{"title":"By eating them, hyenas gathered 9 Neanderthal skeletons in one cave","link":"https://arstechnica.com/?p=1763816","date":1620670707000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Neanderthals-800x480.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Neanderthals.jpg\">Enlarge</a> (credit: Italian Culture Ministry)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Archaeologists in Italy recently unearthed the remains of at least nine Neanderthals in Guattari Cave, near the Tyrrhenian Sea about 100 km southeast of Rome. While excavating a previously unexplored section of the cave, archaeologists from the Archaeological Superintendency of Latina and the University of Tor Vergata recently unearthed broken skulls, jawbones, teeth, and pieces of several other bones, which they say represent at least nine Neanderthals. That brings the cave’s total to at least 10; anthropologist Alberto Carlo Blanc found a Neanderthal skull in another chamber in 1939.</p>\n<p>Italy was a very different place 60,000 years ago. Hyenas, along with other Pleistocene carnivores, stalked rhinoceroses, wild horses (an extinct wild bovine called aurochs), and people.</p>\n<p>“Neanderthals were prey for these animals. Hyenas hunted them, especially the most vulnerable, like sick or elderly individuals,” Tor Vergata University archaeologist Mario Rolfo told The Guardian. The archaeologists found the Neanderthal remains mingled with the bones of rhinos, giant deer, wild horses, and other hyenas. Predators and scavengers tend to leave behind different parts of the skeleton than, say, flowing water or simple burial—and tooth marks are usually a dead giveaway.</p></div><p><a href=\"https://arstechnica.com/?p=1763816#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763816&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6686582ae36bc362cbf38f83380914173c7ecdc70518e7381b3d42d7fab66c42","category":"Tech"}