{"title":"Intel drops the ‘i’ and takes on Apple with its own ‘Ultra’ chips","link":"https://www.macworld.com/article/1955217/intel-core-processor-i-ultra.html","date":1686843537000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With the launch of the <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Mac Pro and the M2 Ultra processor</a> at WWDC, Apple officially ridded its entire Mac line of Intel processors and completed the transition to Apple silicon. It also introduced the most powerful chip it’s ever made, which <a href=\"https://www.macworld.com/article/670873/which-mac-processor-apple-processor-comparison-m1-vs-intel.html\">blows away any Intel chip</a> ever made for a Mac.</p>\n\n\n\n<p>As <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/21559670/intel-core-rebrand&amp;xcust=1-1-1955217-1-0-0&amp;sref=https://www.macworld.com/feed\">reported by The Verge</a>, Intel has responded by changing its own branding. Instead of the Core i3, i5, and i7 chips that have been in use for more than a decade, the next generation of processor will feature three tiers: Intel, Intel Core, and Intel Core Ultra. We’re honestly a little surprised not to see a “Pro” or “Max” in there.</p>\n\n\n\n<p>Somewhat ironically, Intel says one of the reasons it’s changing the names of its chips is to avoid confusion with Apple. As Christopher Hirsch, Intel’s director of product branding, told The Verge, the “I” wasn’t all that clear to customers, with some wondering whether the letter “represents Apple with iPhone and iPod? Was it simply an unknown?”</p>\n\n\n\n<p>That makes sense, but it’s not clear how the Ultra branding will clear things up. Along with the M2 Ultra chip, Apple also sells the <a href=\"https://www.macworld.com/article/1364168/apple-watch-ultra-review.html\">Apple Watch Ultra</a> and is rumored to <a href=\"https://www.macworld.com/article/1503167/iphone-15-ultra-pro-max-size-price.html\">bring the branding to the iPhone line</a> as well.</p>\n\n\n\n<p>Intel says the rebranded chips will begin shipping later this year when its Meteor Lake chips start showing up in PCs.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"66892b25f69ed6a996006d8421e5970dcc6bf54036b9af6376d33ff78f178001","category":"Apple"}