{"title":"Clinical symptoms and histopathological changes in coho salmon affected by the erythrocytic inclusion body syndrome (EIBS) are caused by the infection of piscine orthoreovirus 2 (PRV‐2)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13939?af=R","date":1710397628000,"content":"<h2>Abstract</h2>\n<p>The relationship of histopathological changes and the infection of <i>Piscine orthoreovirus</i> 2 (PRV-2) was investigated in coho salmon that were suffering from the erythrocytic inclusion body syndrome (EIBS). Immunohistochemical observations revealed abundant σ1 protein of PRV-2 in the spongy layer of the ventricle of the heart, where severe myocarditis was observed. In the spleen, the virus protein was detected in many erythrocytes, some of which were spherical-shaped and apparently dead. The number of erythrocytes was decreased in the spleen compared to the apparently healthy fish. The virus protein was also detected in some erythrocytes in blood vessels. The viral protein was often detected in many macrophages ingesting erythrocytes or dead cell debris in the spleen or in the kidney sinusoids. Large amounts of the viral genomic segment L2 were also detected in these organs by RT-qPCR. Many necrotic foci were found in the liver, although the virus protein was not detected in the hepatocytes. These results suggest that the primary targets of PRV-2 are myocardial cells and erythrocytes and that clinical symptoms such as anaemia or jaundice and histopathological changes such as myocarditis in EIBS-affected coho salmon are caused by PRV-2 infection.</p>","author":"Tomokazu Takano, \nSatoshi Miwa, \nTomomasa Matsuyama, \nIkunari Kiryu, \nMiho Honjo, \nTakamitsu Sakai, \nYuta Matsuura, \nMasatoshi Yamasaki, \nAkira Kumagai, \nChihaya Nakayasu","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"6692662a284326f1372e01c3ae20eee7faf58a221c9a63cff26d38211cb0fd93","category":"Environment"}