{"title":"PlayStation ประกาศเพิ่มฟีเจอร์ใหม่หลายรายการมีผลทั้ง PS5, PS Remote Play และ PS App","link":"https://www.blognone.com/node/135739","date":1694683730000,"content":"<div><div><div><p>PlayStation ประกาศเพิ่มฟีเจอร์ใหม่หลายรายการให้กับผลิตภัณฑ์ในเครืออย่าง PS5, PS App และ PS Remote Play โดยมีฟีเจอร์เด่น ๆ ที่น่าสนใจดังนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/84239ef17d55599131dbd81925992307.jpg\" /></p>\n<h2>PlayStation 5</h2>\n<ul>\n<li><strong>ใช้จอย 2 เป็นตัวช่วยในการบังคับคำสั่งต่าง ๆ ในเครื่อง PS5 ได้</strong> ใช้สำหรับสถานการณ์อย่างเกมที่เล่นคนเดียวแล้วเล่นไม่ผ่าน แล้วเพื่อนที่ถือจอย 2 สามารถเข้ามาช่วยเล่นได้โดยไม่ต้องแย่งจอยรองรับทั้งจอย DualSense, DualSense Edge และ จอยที่รองรับจาก 3rd Party</li>\n<li><strong>รองรับ Dolby Atmos สำหรับอุปกรณ์เสียงต่าง ๆ</strong> ปกติ PS5 มีฟีเจอร์ 3D Audio ของตัวเองอยู่แล้วแต่ผู้หลายรายต่างเรียกร้องให้ Sony ใส่ Dolby เข้ามา ซึ่งฟีเจอร์จะช่วยให้อุปกรณ์เสียงที่เชื่อมต่อผ่าน HDMI ที่รองรับ Dolby Atmos อย่าง Soundbars, TV หรือชุดลำโพงต่าง ๆ ได้</li>\n<li><strong>ปรับปรุงระบบ Social ใน PS5 หลายรายการ</strong> ไม่ว่าจะเป็น UI ของ Party, Share Screen Preview, เข้าร่วมเล่นเกมกับเพื่อนได้ง่ายขึ้น และ ตอบแชทด้วยอีโมจิได้ เป็นต้น</li>\n<li><strong>เพิ่มความสามารถในใช้งานอื่น ๆ ใน PS5 อย่าง</strong> สามารถค้นหาเกมในไลบารี่ของตัวเองได้แล้ว, ปรับปรุงฟีเจอร์ Game Help ให้ได้ดีขึ้น, ดูฟีเจอร์ใหม่ ๆ และแนะนำการใช้งานฟีเจอร์ต่าง ๆ ใน PS5, ปิดเสียง หรือเพิ่มลดเสียง ปิ๊ป ของเครื่องเวลาเปิดหรือปิดได้</li>\n<li><strong>รองรับ M.2 SSD ที่ความจุมากขึ้น</strong>โดยรองรับได้สูงสุด 8TB จากที่ก่อนหน้ารองรับได้สุดสูง 4TB</li>\n</ul>\n<h2>PS Remote Play</h2>\n<ul>\n<li><strong>รองรับอุปกรณ์ที่ใช้ระบบปฏิบัติการ Android TV OS เวอร์ชั่น 12 ขึ้นไป</strong> ตัวอย่างอุปกรณ์ที่รองรับคือ ทีวี Sony BRAVIA XR A95L และ Chromecast with Google รุ่น 4K เป็นต้น</li>\n</ul>\n<h2>PS App</h2>\n<ul>\n<li><strong>ปรับปรุงการใช้งาน และเพิ่มฟีเจอร์ใหม่ ๆ ที่สอดคล้องกับ PS5</strong> อย่างการกดอัพเดตเฟิร์มแวร์ของ PS5 ได้ในแอป รวมทั้งระบบ Social ใหม่ ๆ ที่มีใน PS5 สามารถใช้ได้ใน PS App เช่นกัน</li>\n</ul>\n<p>ส่วนข้อมูลอื่น ๆ อาจต้องรอติดตามในงาน State of Play ที่จะจัดรายการในวันที่ 15 กันยายนเวลาตี 4 ตามเวลาประเทศไทย โดยจะอัพเดตข่าวสารเกี่ยวกับเกมใหม่ ๆ จากฝั่งนักพัฒนาเกม 3rd Party และนักพัฒนาเกมอิสระ เป็นหลัก</p>\n<p>ที่มา - <a href=\"https://blog.playstation.com/2023/09/13/ps5-update-rolls-out-globally-with-new-accessibility-audio-and-social-feature-enhancements/\">PlayStation Blog</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/playstation\">PlayStation</a></div><div><a href=\"/topics/ps5\">PS5</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"669bcd541b13e830c8d9887ef56311269b4737d26ca05216424018588308acd1","category":"Thai"}