{"title":"How I learned to stop worrying and trust Apple’s privacy policy","link":"https://www.macworld.com/article/353870/macalope-apple-privacy-policy-android-csam.html","date":1629799200000,"content":"<div>\n<section><div></div></section><p>You can tell that Apple didn’t <em>quite</em> get its announcement of CSAM scanning right because it’s weeks later and we’re still talking about it.</p>\n\n\n\n<p>Writing for The New York Times’ editorial board, Greg Bensinger says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/2021/08/19/opinion/apple-iphone-privacy.html&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">“Apple’s Illusion of Privacy Is Getting Harder to Sell”</a> (Tip o’ the antlers to 5cat.)</p>\n\n\n\n<p>The Macalope’s going to give that headline a 6 out of 10 because while there’s a point behind it, Apple’s pitch <em>is</em> still pretty easy to sell because smartphone choices are not made in a vacuum, they’re relative.</p>\n\n\n\n<p>Also, you can’t dance to that headline. Seriously, the Macalope tried for like 15 minutes.</p>\n\n\n\n<p>(It’s also possible the Macalope just can’t dance, in which case he apologizes.)</p>\n\n\n\n<p>Despite Amnesty International and Forbidden Stories saying <a href=\"https://www.macworld.com/article/351455/macalope-iphone-pegasus-spyware-threat-android-security.html\">not to use the results of their research</a> into Pegasus to make comparisons of the relative security of iOS devices and Android devices, the Macalope sees people are still doing just that.</p>\n\n\n\n<blockquote><p>Google’s Android mobile software also has a voracious appetite for data but may be less vulnerable than the iPhone to broad attacks, such as the recently uncovered one affecting tens of thousands of phones reportedly targeted by NSO Group’s Pegasus software. That’s because Android runs on many different phone types, each with slightly different versions of the software…</p></blockquote>\n\n\n\n<p>“The researchers said not to do this buuut these axes aren’t going to grind themselves.” If you don’t recall, the researchers said the reason there are more iPhones in their report is that iOS provides better logging of Pegasus attacks than Android. Period.</p>\n\n\n\n<p>There’s also some weird construction in this editorial.</p>\n\n\n\n<blockquote><p>Apple also has access to text messages that it says are otherwise encrypted when they are backed up in iCloud, a workaround that’s apparently necessary to aid law enforcement.</p></blockquote>\n\n\n\n<p>Messages are end-to-end encrypted during transmission. iCloud backups are not. If someone has a copy of your backup, which can be subpoenaed, they can read your messages. This isn’t some super-secret back door. It’s not even a “workaround”. It’s the way it’s always been. If you want to encrypt your backups, you can back up to a Mac or PC. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daringfireball.net/2021/08/apple_child_safety_initiatives_slippery_slope&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">John Gruber wonders if</a> Apple’s CSAM detection is a step toward encrypting iCloud backups and the Macalope hopes it is.</p>\n\n\n\n<p>Much of Bensinger’s chastising of Apple is valid, however. It’s true that Apple <em>does</em> know a lot about you and it’s disappointing that it takes a “data for me but not for thee” approach, particularly given its privacy sales pitch. But it’s also true that it’s better to have one company have that information than to have a lot of companies have it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>One writer at the Forbes contributor network and formulaic title generation machine that the Macalope won’t bother to link to (tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/nwsayer/status/1429134131435171848&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">Nick</a>) suggests that Apple CSAM scanning will cause people to flee iOS.</p>\n\n\n\n<p>Uh, to where, exactly?</p>\n\n\n\n<p>As Bensinger says:</p>\n\n\n\n<blockquote><p>One way to keep prying eyes off your data is to resist putting files into Apple’s iCloud service, but that means potentially choosing another service, with its own privacy concerns.</p></blockquote>\n\n\n\n<p>That’s the crux of the problem right there and a point that gets lost in the rush to shove Apple’s ad copy in its face, however fun and probably fair that is to do. Unless you’re going to ditch your smartphone and go back to a landline and fax all your pictures, switching from iOS to Android is not exactly going to solve your privacy problem. In fact, it’s likely to make it worse. If you toss your iPhone on the ocean to “make a statement” by switching to Android, you might not be making the statement you think you are.</p>\n\n\n\n<p>“I’ll show Burger King that heart disease is not for me!”</p>\n\n\n<p>[rolls up to McDonald’s drive-through window]</p>\n\n\n\n<p>“I’ll have ten Big Macs, please!”</p>\n\n\n\n<p>If you don’t like Apple’s CSAM scanning, it may not matter. As <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://stratechery.com/2021/apples-mistake/&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">Ben Thompson noted</a> (subscription):</p>\n\n\n\n<blockquote><p>…Apple’s policy isn’t the only one that matters: both the UK and the EU are moving forward on bills that mandate online service companies proactively look for and report CSAM.</p></blockquote>\n\n\n\n<p>Thompson also suggests Apple’s move might be an attempt to protect end-to-end encryption, an end-to-end end run, if you will. And if you won’t, the Macalope will understand.</p>\n\n\n\n<p>Ultimately, the Macalope agrees with Bensinger’s conclusions. Apple should implement <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://globalprivacycontrol.org/press-release/20201007.html&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">Global Privacy Control</a> in Safari (the Macalope already uses <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.wired.com/story/duckduckgo-quest-prove-online-privacy-possible/&amp;xcust=1-1-353870-1-0-0&amp;sref=https://www.macworld.com/feed\">DuckDuckGo’s privacy plugin</a>). And if we’re looking to for-profit companies to take care of our civil rights, we’re looking in the wrong place.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"66a3eccadb4f6a087d8d2e04ec161f4e9e14e5829d25c88be46f3ecb97bde7f2","category":"Apple"}