{"title":"Review: Framework Laptop’s 13th-gen Intel upgrade helps fix its battery problem","link":"https://arstechnica.com/?p=1939185","date":1684249543000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/IMG_1039-800x533.jpeg\" alt=\"The Framework logo on the hinge.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/IMG_1039.jpeg\">Enlarge</a> <span>/</span> The Framework logo on the hinge. (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<span></span>\n<p>When you read a laptop review, even if the new laptop <em>looks</em> identical to <a href=\"https://arstechnica.com/gadgets/2022/07/review-frameworks-next-gen-laptop-follows-through-on-its-upgradeable-promises/\">last year's model</a>, the company has usually sent the reviewer an entirely new product to set up and test. For this review of the Framework Laptop 13—for all intents and purposes, a brand-new product and the third iteration of Framework's original repairable, upgradeable laptop PC—Framework's PR team sent me a box full of parts that I could use to upgrade <a href=\"https://arstechnica.com/gadgets/2022/07/review-frameworks-next-gen-laptop-follows-through-on-its-upgradeable-promises/\">the laptop I reviewed last year</a>.</p>\n<p>So this is a review of <a href=\"https://frame.work/products/laptop-diy-13-gen-amd\">the 2023 iteration of the Framework Laptop 13</a>, but it's also a review of a box full of parts. We won't reiterate everything we said about the Framework Laptop last year (or the year before that) except to comment on how the design of the system is aging and how the various new components change the experience.</p>\n<p>The big takeaways? If you're considering a Framework Laptop for the first time, the company has fixed many of the things about the laptop that we listed as cons last year, especially the battery life. If you're upgrading an older model, at least one or two of the components in that jumble of parts we got is worth considering as an upgrade. And in either case, you <em>might</em> want to wait for the upcoming <a href=\"https://frame.work/products/mainboard-kit-amd-ryzen-7040-series\">AMD Ryzen edition</a>—at least, as long as the computer you're currently using can get you by until at least \"late Q3,\" when those laptops and mainboards are currently slated to ship.</p></div><p><a href=\"https://arstechnica.com/?p=1939185#p3\">Read 23 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939185&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"66afd7cdd8376d11cb7b24e78b4fa84a69b791740171681fe911a0c4a6c82fd3","category":"Tech"}