{"title":"NASA temporarily loses contact with one of its most distant spacecraft","link":"https://arstechnica.com/?p=1957418","date":1690561487000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/11/pia21839-main-800x450.jpg\" alt=\"Image of the Voyager 2 spacecraft.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/11/pia21839-main.jpg\">Enlarge</a> <span>/</span> An artist's interpretation of Voyager 2, pointed to transmit data to Earth. (credit: <a href=\"https://www.nasa.gov/feature/jpl/voyager-2-illuminates-boundary-of-interstellar-space\">NASA/JPL-Caltech</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>About a week ago, operators of the Voyager 2 spacecraft sent a series of commands that inadvertently caused the distant probe to point its antenna slightly away from Earth. As a result, NASA has lost contact with the spacecraft, which is nearly half a century old and presently 19.9 billion km away from the planet.</p>\n<p>For the time being, NASA and the mission's scientists aren't panicking. In an <a href=\"https://blogs.nasa.gov/sunspot/2023/07/28/mission-update-voyager-2-communications-pause/\">update posted Friday</a>, the space agency said Voyager 2 is programmed to reset its orientation several times a year to keep its antenna pointing at Earth. It is scheduled to do so again on October 15, which should allow communication to resume. In the meantime, NASA said it does not anticipate the spacecraft veering off course.</p>\n\n<p>Launched separately in 1977 on two different rockets, the Voyager 1 and 2 spacecraft have been true trailblazers for NASA and the world. Never before had a spacecraft visited four worlds in a single, grand tour as the two Voyager probes did in the 1970s and 1980s with Jupiter, Saturn, Uranus, and Neptune.</p></div><p><a href=\"https://arstechnica.com/?p=1957418#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1957418&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"66b7a14fa780715591c8a2029b1c8b4b81e6fd20f72d2e082a21602cd7d82fbf","category":"Tech"}