{"title":"Bees go up, flowers go down: Increased resource limitation from late spring to summer in agricultural landscapes","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14576?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/4c92c3ac-0f02-4d26-b659-468d4ba93aed/jpe14576-toc-0001-m.png\" alt=\"Bees go up, flowers go down: Increased resource limitation from late spring to summer in agricultural landscapes\" />\n<p>Our results indicate that agri-environmental management should target the provision of summer floral resources for both social and solitary bees. Local-scale enhancement of floral resources can likely benefit solitary bees, but bumblebees probably require the management of floral resources at the landscape scale. Increasing the floral resources and the flowering period of herbaceous habitats that cover large proportions of the landscape, such as pastures, has the greatest potential to improve summer floral resources for bees.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe loss of floral resources is a leading cause of wild bee decline in agricultural landscapes, but little is known about the temporal aspects of floral resource limitation for both social and solitary bees. Understanding when floral resources are most needed is crucial for the optimal design of pollinator conservation measures.\n\nWe surveyed bees and flowers in 160 semi-natural habitat patches multiple times per year (May–July) for 5 years. We identified the seasonality of floral resources and wild bees and examined inter- and intra-annual patterns of floral resource limitation at both local and landscape scales.\n\nFloral resource availability varied across years but generally peaked in late May, after which it declined and remained low through July.\n\nBumblebee and solitary bee abundances increased across the season, leading to stronger floral resource limitation for both groups later in the season. Bumblebee abundance was marginally positively associated with the cumulative amount of landscape-scale floral resources as well as the floral resources of the previous year. Solitary bee abundance was only predicted by local-scale floral resources.\n\n<i>Synthesis and applications</i>: Our results indicate that agri-environmental management should target the provision of summer floral resources for both social and solitary bees. Local-scale enhancement of floral resources can likely benefit solitary bees, but bumblebees probably require the management of floral resources at the landscape scale. Increasing the floral resources and the flowering period of herbaceous habitats that cover large proportions of the landscape, such as pastures, has the greatest potential to improve summer floral resources for bees.\n</p>","author":"Gabriella A. Bishop, \nThijs P. M. Fijen, \nIvo Raemakers, \nRuud J. M. van Kats, \nDavid Kleijn","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"66c1e8a3ae198a2c6a1024f9ba7598a57b2ff504271c4dd964e8a98b598e1c4c","category":"Environment"}