{"title":"SSR Markers-Based DNA Fingerprinting for Varietal Identification in Mango Cultivars","link":"https://www.preprints.org/manuscript/202403.0950/v1","date":1710749672000,"content":"Mango (Mangifera indica L.) is an allotetraploid (2n = 4X= 40) drupe fruit and has high nutritional value belongs to genus Mangifera and family Anacardiaceae. Mango cultivars are used with worldwide acceptance to pharmacological, ethnomedical, and phytochemical industries. Assessment of the genetic distinctiveness of a cultivar through morphological descriptors is an important tool for both the registration and the protection. New mango genotypes have been improved using valuable diverse germplasm resources to ensure food security. DNA fingerprinting based simple sequence repeats (SSR)-markers have been the most broadly used, effective and accurate in evaluation of genetic characterization of a cultivar. Molecular breeding is an effective source of genetic gain after improvement of fruit trees using marker assisted genomic selection. Total genomic DNA (gDNA) was generated using CTAB method from each cultivar. The most effective 50 hyper-variable SSR markers were selected. Highly specific DNA fingerprints were identified in the candidate line ‘Azeem Chaunsa’ compared with three standard cultivars using SSR-PCR. An agglomerative hierarchical clustering method was used to construct dendrogram based on the UPGMA clustering method. Cultivar identification diagram (CID) was constructed to evaluate association among standard cultivars and Azeem Chaunsa. Our results showed that SSR markers could efficiently assess genetic diversity in mango. The genetic similarity coefficients were recorded between the cultivars of mango ranged from 0.49 to 0.67. CID results concluded that cultivar ‘Azeem Chaunsa’ varied significantly from the check cultivar, Sindhri (46.2%), S.B Chaunsa (45%) and Sufaid Chaunsa (46.7%). The results obtained in this study will orient cultivar identification strategies for a successful future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"66ccf207bf39a438a88f80e59feed19d8213750738911430896ad97f5039fcde","category":"Interdisciplinary"}