{"title":"Seasonal and spatial variability of CO2 emissions in a large tropical mangrove‐dominated delta","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12471?af=R","date":1708528481000,"content":"<h2>Abstract</h2>\n<p>This study quantified the seasonal and spatial variability of partial pressure of CO<sub>2</sub> (<i>p</i>CO<sub>2</sub>) and water-atmosphere CO<sub>2</sub> fluxes in the Parnaíba River Delta, the largest delta in the Americas. It is a pristine equatorial, mangrove-dominated environment located in a transitional between humid and semi-arid climates, with marked seasonality in rainfall and river discharge. Major channels and bays were sampled during dry and wet seasons, with continuous measurements of <i>p</i>CO<sub>2</sub>, temperature, salinity, and wind velocity. Subsurface water samples were collected in discrete stations for pH, total alkalinity (TA), dissolved inorganic carbon (DIC), dissolved oxygen and chlorophyll <i>a</i> quantification. A significant positive correlation between carbonate system parameters with salinity was found in both periods, with salinity significantly higher in the dry season. Strong deviations of <i>p</i>CO<sub>2</sub>, TA, and DIC from two endmembers conservative mixing were found, particularly in mangrove-dominated waters, due to organic matter degradation. The Delta showed high spatial variability of <i>p</i>CO<sub>2</sub>, with the highest values in mangrove-dominated waters, moderate in the river-dominated regions, and lowest in the high salinity areas, suggesting that <i>p</i>CO<sub>2</sub> variability is likely controlled by a combination of river-ocean mixing and biological processes (respiration and photosynthesis). The Delta outgasses about 20 times less CO<sub>2</sub> in the dry season (9.06 ± 11.09 mmol m<sup>−2</sup>.d<sup>−1</sup>) than in the rainy season (209.68 ± 250.87 mmol m<sup>−2</sup> d<sup>−1</sup>). Our results indicate this large mangrove-dominated tropical delta is an important source of CO<sub>2</sub> to the atmosphere, but a sharp decrease was observed during dry periods.</p>","author":"Raisa S.A. Chielle, \nRozane V. Marins, \nMariany S. Cavalcante, \nLuiz C. Cotovicz Jr","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"66d39ca89b1ca1137de9c39f086cfeeecbdc0cc62c4ce5d6df32e2bbedce4b5f","category":"Environment"}