{"title":"Faecal Standing Crop with real time correction using scat detection dogs to estimate population density","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14658?af=R","date":1713185338000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/154199ee-de64-4e7d-9cc3-fb54a255e685/jpe14658-toc-0001-m.png\" alt=\"Faecal Standing Crop with real time correction using scat detection dogs to estimate population density\" />\n<p>Our results demonstrate that our concurrent methodology corrected the effects of weather and habitat on FSC parameters thereby allowing for accurate population density estimation. Additionally, this method can provide reasonably precise density estimates with a logistically feasible sample size, as demonstrated by simulation. Following our recommendations, this method allows a reliable estimate of population density because it incorporates any influence of study area, dog ability and climate in faecal sample detection, providing fundamental information for the conservation of many cryptic and elusive species.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPopulation density is fundamental information for assessing the conservation status of species and support management and conservation actions for in situ populations, but is unknown for many forest species due to their difficulty in detection. The Faecal Standing Crop (FSC) method using detection dogs is an alternative for cryptic or elusive species. An intrinsic difficulty of FSC is the ability to find faecal samples in the field and to estimate the probability of which faeces detection is influenced by degradation due to climatic conditions. Our goal was to propose a concurrent FSC parameter estimation using a scat detection dog under different climatic conditions and apply those parameters in a wild deer population.\n\nTen faecal samples of grey brocket deer (<i>Subulo gouazoubira</i>) were placed weekly in a transect (24 × 1440 m) in both dry and wet seasons (12 weeks each). A scat detection dog was then employed to find experimental faecal samples to determine the FSC parameters that were subsequently used with naturally occurring faecal samples (also dog-detected) to estimate population density.\n\nThe oldest dog found samples were 21 (Dry) and seven (Wet) days after placement, resulting in dog efficiency of 22.5% (Dry) and 30% (Wet). Adjusting the model to account for efficiency and scat durability, we estimated similar, seasonal, densities of 4.51 individuals km<sup>−2</sup> (SD = 2.21, Dry) and 5.37 individuals km<sup>−2</sup> (SD = 3.71, Wet).\n\n<i>Synthesis and applications</i>: Our results demonstrate that our concurrent methodology corrected the effects of weather and habitat on FSC parameters thereby allowing for accurate population density estimation. Additionally, this method can provide reasonably precise density estimates with a logistically feasible sample size, as demonstrated by simulation. Following our recommendations, this method allows a reliable estimate of population density because it incorporates any influence of study area, dog ability and climate in faecal sample detection, providing fundamental information for the conservation of many cryptic and elusive species.\n</p>\n<h2>Resumo</h2>\n<p>\n\nDensidades populacionais são informações fundamentais para a avaliação do status de conservação das espécies e para guiar ações de manejo e conservação de populações in situ, mas essas informações são desconhecidas para muitas espécies florestais devido à sua dificuldade de detecção. O método <i>Faecal Standing Crop</i> (FSC) usando cães farejadores é uma alternativa para espécies crípticas ou elusivas. Uma dificuldade intrínseca do FSC é a capacidade de encontrar amostras fecais em campo e estimar a probabilidade de detecção de amostras influenciada pela degradação devido às condições climáticas. Nosso objetivo foi propor um método para a estimativa dos parâmetros FSC usando um cão farejador sob diferentes condições climáticas. Posteriormente, aplicamos estes parâmetros para estimar uma população de cervídeos selvagens.\n\nDez amostras fecais de veado-catingueiro (<i>Subulo gouazoubira</i>) foram colocadas semanalmente em um transecto (24 × 1440 m) nas estações seca e úmida (12 semanas cada). Utilizamos um cão farejador para encontrar as amostras experimentais que foram usadas para determinar os parâmetros de FSC, os quais foram subsequentemente usados para estimar a densidade populacional na mesma área.\n\nAs amostras mais antigas encontradas pelo cão foram de 21 (estação seca) e sete dias (estação úmida), resultando na eficiência do cão de 22.5% (estação seca) e 30% (estação úmida). Considerando a eficiência e a persistência das fezes no ambiente, estimamos densidades sazonais similares de 4.51 indiv. km<sup>−2</sup> (SD = 2.21, estação seca) e 5.37 indiv. km<sup>−2</sup> (SD = 3.71, estação chuvosa).\n\n<i>Síntese e aplicações</i>: Nossos resultados demonstram que a nossa metodologia corrigiu os efeitos do clima e do habitat nos parâmetros FSC, permitindo uma estimativa precisa da densidade populacional. Seguindo nossas recomendações, esse método possibilita uma estimativa mais confiável da densidade populacional, pois incorpora qualquer influência da área de estudo, capacidade de encontro pelo cão e o clima na detecção das amostras, fornecendo informações fundamentais para a conservação de espécies crípticas e elusivas.\n</p>","author":"Rúbia Ferreira dos Santos Morini, \nFrancisco Grotta‐Neto, \nJosé Maurício Barbanti Duarte","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"66db316140ef9a0ff410cac043e3cc580490909dde9121afc186d6d303906e91","category":"Environment"}