{"title":"Chantal van den Broek-Blaak wins Strade Bianche","link":"https://cyclingtips.com/2021/03/chantal-van-den-broek-blaak-wins-strade-bianche/","date":1615033956000,"content":"<p>Once again SD Worx gave a master-class in tactics at Strade Bianche. After a late-race two-rider move with Elisa Longo Borghini of Trek-Segafredo, Chantal van den Broek-Blaak rode to victory in the Piazza del Campo.</p>\n\n\n\n<p>Longo Borghini held on to take second ahead of the world champion Anna van der Breggen (SD Worx).</p>\n\n\n\n<p>&#8220;It was not really the plan that I would win today,&#8221; Van den Broek-Blaak said after the finish. &#8220;We had such an amazing team and I felt super good, so it came unexpectedly. </p>\n\n\n\n<p>&#8220;We were there with four, with a group of 11, so yes, of course, we are going to play the game. It was my job to try and do it again, and when Elisa came with me, I was not allowed to ride, and I thought it was super smart because normally I cannot follow Elisa on the climbs so I was super scared [of] her and I know she is also really focused on this race. With 1 km to go, I could feel she broke and that I still have something left in the tank.&#8221;</p>\n\n\n\n<h2>How it happened</h2>\n\n\n\n<p>How to even break down what happened in this race? It would be an easier task had there been more than 20 km of live coverage.</p>\n\n\n\n<p>Small breakaways were attempted early in the race, and even sprinter Lotte Kopecky (Liv Racing) tried her luck off the front. A counter-attack of eight riders went with 36 km to go which really kicked off the excitement. That move included last year&#8217;s runner-up Mavi Garcia (Alé BTC Ljubljana), Flanders 2020 winner Van den Broek-Blaak, and Trek-Segafredo&#8217;s Ellen van Dijk. </p>\n\n\n\n<p>The lead group split and regrouped in the sixth sector of gravel. Behind them, a second race was underway with Marianne Vos (Jumbo-Visma) leading a bridge attempt. Following Vos were a lot of the race favourites; Annemiek van Vleuten (Movistar), Kopecky, Cecilie Uttrup Ludwig (FDJ), Kasia Niewiadoma (Canyon-SRAM), and Demi Vollering (SD Worx). </p>\n\n\n\n<p>Behind the chasing group of nine was another group including world champion Van der Breggen and Longo Borghini. </p>\n\n\n\n<p>With 16 km to go the three groups became one, and Van Vleuten didn&#8217;t miss a beat. The defending champion attacked, on the hunt for the hat trick of victories, an achievement never accomplished in the men&#8217;s nor the women&#8217;s race. </p>\n\n\n\n<p>Van Vleuten was initially followed by Longo Borghini, but in the end, it was Vos who clung to the wheel of the European champion. As the two approached the 10 km-to-go mark they held 10 seconds on their chasers. </p>\n\n\n\n<p>SD Worx, with four riders in the chasing group, had the strength in numbers and were able to pull back Van Vleuten. With 8 km to go, with Van Vleuten and Vos caught, attacks continued. </p>\n\n\n\n<p>An attack by Van den Broek-Blaak was followed by Longo Borghini. With only Niewiadoma chasing, the rest of the group hesitated slightly. Longo Borghini and Van den Broek-Blaak saw significant daylight behind them. </p>\n\n\n\n<p>With 4 km to go, the two leaders had 14 seconds on the chasers. As a former winner and a better climber than Van den Broek-Blaak, Longo Borghini wasn&#8217;t getting any help from her break-mate. There was no organized chase from behind, and interestingly the other SD Worx riders started to attack the rest of the group as the finish grew ever closer. </p>\n\n\n\n<p>Past the 1 km-to-go banner Longo Borghini and Van den Broek-Blaak had 17 seconds with Marta Cavalli (FDJ) chasing. </p>\n\n\n\n<p>On the final climb into Siena, Van den Broek-Blaak attacked Longo Borghini, leaving the Italian national champion in the dust to ride solo into the finish. </p>\n\n\n\n<p>The race behind was as chaotic as the rest of the day, with Van der Breggen catching and passing Cavalli to take third on the day. </p>\n\n\n\n<h2>Results </h2>\n\n\n\n<ol><li>VAN DEN BROEK-BLAAK Chantal, SD Work 3:54:40</li><li>Longo LONGO BORGHINI Elisa, Trek-Segafredo +0:07</li><li>VAN DER BREGGEN Anna, SD Worx +0:09</li><li>VAN VLEUTEN Annemiek, Movistar +0:11</li><li>UTTRUP LUDWIG Cecilie, FDJ Nouvelle Aquitaine Futuroscope +0:11</li><li>VOLLERING Demi, SD Worx +0:11</li><li>VOS Marianne, Jumbo-Visma +0:23</li><li>CAVALLI Marta, FDJ Nouvelle Aquitaine Futuroscope +0:27</li><li>NIEWIADOMA Kasia, Canyon-SRAM +0:30 </li><li>VAN DIJK Ellen, Trek-Segafredo +0:32</li></ol>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/chantal-van-den-broek-blaak-wins-strade-bianche/\">Chantal van den Broek-Blaak wins Strade Bianche</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"66e7ee7005bebf230150abb584512c2117281247de01dc7ee84a0bbf55546300","category":"Cycling"}