{"title":"Apple's Research on Anti-Fingerprint Coatings Again Hints at Future Titanium Devices","link":"https://www.macrumors.com/2021/02/23/titanium-anti-fingerprint-coatings-research/","date":1614100454000,"content":"Apple is researching how it can reduce the appearance of fingerprints and smudges on the metal surfaces of its products and has hinted yet again at the use of <a href=\"https://www.macrumors.com/2021/01/26/apple-researching-titanium-macbook-casings/\">titanium for future Apple devices</a>, according to newly-granted patent filings.\r\n<br/>\r\n\r\n<br/>\r\n<div class=\"center-wrap\"><img src=\"https://images.macrumors.com/article-new/2021/02/titanium-macbook-pro-dbrand.jpg\" alt=\"\" width=\"2200\" height=\"1350\" class=\"aligncenter size-full wp-image-785260\" />Image via <a href=\"https://dbrand.com\">Dbrand</a></div>\r\n<br/>\r\n\r\n<br/>\r\nThe patent, filed with the U.S. Patent and Trademark Office and spotted by <a href=\"https://www.patentlyapple.com/patently-apple/2021/02/future-apple-devices-may-be-made-with-titanium-alloys-with-an-applied-anti-fingerprint-coating-.html\"><em>Patently Apple</em></a>, is titled \"<a href=\"http://patft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&Sect2=HITOFF&u=%2Fnetahtml%2FPTO%2Fsearch-adv.htm&r=58&f=G&l=50&d=PTXT&p=2&S1=(%22Apple+Inc%22.AANM.)&OS=AANM/%22Apple+Inc%22&RS=AANM/%22Apple+Inc%22\">Oxide coatings for metal surfaces</a>\" and explains in detail how a thin coating can significantly reduce the appearance of fingerprints on devices.\r\n<br/>\r\n\r\n<br/>\r\nLast month, patents for <a href=\"https://www.macrumors.com/2021/01/26/apple-researching-titanium-macbook-casings/\">titanium device enclosures</a> came to light, revealing Apple's interest in how various devices, including MacBooks, iPads, and iPhones, could adopt titanium casings with a distinctive textured finish. Now, Apple's patent for oxide coatings has again stressed the advantages of using titanium on consumer electronics, such as \"high strength, stiffness, and hardness.\"\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>For example, the relatively high hardness of titanium makes it resistant to scratches, and its stiffness makes it durable enough to withstand bending. In addition, titanium is inherently more corrosion-resistant than certain other alloys.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\nApple highlights that, compared to other metals, titanium easily shows fingerprints when handled. This is partially due to the relatively low reflectivity of titanium and titanium alloy surfaces.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>One of the disadvantages of using titanium and its alloys, however, is that oil from fingerprints can be readily seen on bare titanium and titanium alloy surfaces, leaving unattractive marks on consumer electronics. The nature and volume of the fingerprints can be factors, but even clean fingers can leave a relatively dramatic mark on titanium surfaces.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/visible-fingerprint-patent-example.jpg\" alt=\"\" width=\"1860\" height=\"660\" class=\"aligncenter size-full wp-image-785261\" />\r\n<br/>\r\n\r\n<br/>\r\nConventional oleophobic coatings are usually used to reduce fingerprinting on glass surfaces such as the front and back of iPhones, but these types of coatings are much less effective on titanium surfaces. The patent suggests that Apple's interest in using titanium for its devices has led to the need for new, more effective solutions for the prevention of fingerprinting.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>What are needed therefore are improved cosmetic surface finishes for titanium and its alloys. </blockquote>\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/no-oxide-coating-patent.jpg\" alt=\"\" width=\"1860\" height=\"550\" class=\"aligncenter size-full wp-image-785256\" />\r\n<br/>\r\n\r\n<br/>\r\nThis has led the company to research the use of a thin oxide coating or film \"configured to reduce or eliminate interference-coloring effects brought upon by fingerprints or other thin film options.\" Apple's oxide coating allows the surface of a device to continue reflecting light as though there is no fingerprint present, thereby hiding oily smudges.\r\n<br/>\r\n\r\n<br/>\r\n<blockquote>In some embodiments, the oxide coatings are sufficiently thick to increase the optical path difference of incident light, thereby reducing any inference coloring by the fingerprint to a non-visible level. In some embodiments, the oxide coatings have a non-uniform thickness that changes the way light reflects off interfaces of the oxide coating, thereby reducing or eliminating any thin film interference coloring.</blockquote>\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/oxide-coating-patent.jpg\" alt=\"\" width=\"1860\" height=\"460\" class=\"aligncenter size-full wp-image-785258\" />\r\n<br/>\r\n\r\n<br/>\r\nApple also notes that an oxide coating could be used on surfaces including \"aluminum, aluminum alloy, steel, magnesium, magnesium alloys, zirconium, or zirconium alloys,\" even though it was developed primarily to address titanium or titanium alloys.\r\n<br/>\r\n\r\n<br/>\r\nThe filing also highlights that the oxide coating can be used \"to form durable and cosmetically appealing finishes\" on a wide range of Apple devices, including the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, Apple Watch, and MacBook.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/oxide-coating-patent-devices.jpg\" alt=\"\" width=\"1860\" height=\"1650\" class=\"aligncenter size-full wp-image-785259\" />\r\n<br/>\r\n\r\n<br/>\r\nFollowing last month's news of Apple's curiosity about <a href=\"https://www.macrumors.com/2021/01/26/apple-researching-titanium-macbook-casings/\">expanding the use of titanium</a> for its devices, which is currently only available on the Apple Watch Edition, it is interesting that research in the area is leading to other technological innovations.\r\n<br/>\r\n\r\n<br/>\r\nApple's research suggests that the company is looking to <a href=\"https://www.macrumors.com/2020/12/04/apple-researching-matte-black-finish/\">move beyond</a> standard anodized aluminum casings, but there is no telling if and when this may happen. Nonetheless, patent filings can provide insight into what Apple is exploring and developing behind the scenes, and hint at what we could see in the future.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/patent/\">patent</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/23/titanium-anti-fingerprint-coatings-research/\">Apple&#039;s Research on Anti-Fingerprint Coatings Again Hints at Future Titanium Devices</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apples-research-on-anti-fingerprint-coatings-again-hints-at-future-titanium-devices.2285903/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AKk_ThyW76I:gWTd69iQrtY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AKk_ThyW76I:gWTd69iQrtY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/AKk_ThyW76I\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"66ea2f49c48e2601cd33991e662d3daa7a5fdb33b48bcb742ba9e5fbc745fb99","category":"Apple"}