{"title":"Onychomycosis in Foot and Toe Malformations","link":"https://www.preprints.org/manuscript/202404.0676/v1","date":1712728293000,"content":"Introduction: It has long been accepted that trauma is one of the most important and frequent predisposing factors for onychomycoses . However, the role of direct trauma in the pathogenesis of fungal nail infections was only recently been elucidated in a series of 32 cases of post-traumatic single-digit onychomycosis. The importance of repeated trauma due to foot and toe abnormalities was rarely investigated.Aim of the study: This is a multicenter single-author observational study over a period of 6 years performed at a specialized nail clinic in three countries. All patient photographs taken by the author during this period were screened for toenail alterations and all toe onychomycosis cases were checked whether they contained enough information to evaluate potential foot and toe abnormalities. Particular attention was paid to the presence of hallux valgus, hallux valgus interphalangeus, hallux erectus, inward rotation of the big toe and outward rotation of the little toe, as well as splay foot. Only cases with unequivocal proof of fungal nail infection by either histopathology, mycologic culture or polymerase chain reaction (PCR) were accepted.Results: Of 1653 cases, 185 were onychomycoses proven by mycologic culture, PCR or histopathology. Of these, 179 involved at least one big toenail, 6 affected one or more lesser toenails. Three patients consulted us for another toenail disease and the onychomycosis was diagnosed as a second disease. Eight patients had a pronounced tinea pedum. Relatively few patients had a normal big toe position (n = 9). Most of the cases had a mild to marked hallux valgus (HV) (105) and a hallux valgus interphalangeus (HVI) (143), hallux erectus was observed in 43 patients, the combination of HV and HVI was observed 83 times. Discussion: The very high percentage of foot and toe deformations was surprising. It may be hypothesized that this is not only a pathogenetically important factor but may also play an important role for the localization of the fungal infection as no marked hallux deviation was noted in onychomycoses that affected the lesser toes only. As the management of onychomycoses is a complex procedure involving the exact diagnosis with determination of the pathogenic fungus, the nail growth rate, the type of onychomycosis, its duration and predisposing factors, anomalies of the toe position may be important. Among the most commonly mentioned predisposing factors are peripheral circulatory insufficiency, venous stasis, peripheral neuropathy, immune deficiency and iatrogenic immunosuppression whereas foot problems are not given enough attention. Unfortunately, many of these predisposing and aggravating factors are difficult to treat or to correct. Generally, when explaining the treatment of onychomycoses to the patients, the importance of these orthopedic alterations is not or only insufficiently discussed. In view of the problems encountered with the treatment of toenail mycoses, this attitude should be changed in order to make the patient understand why there is such a low cure rate despite excellent minimal inhibitory drug concentrations in the laboratory.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"66ede9b8af9c21a50ab0be77a86a4fc4a90146fee7eee256cca54d8607601d03","category":"Interdisciplinary"}