{"title":"Netflix once again introduces new features for Android, but not iOS (yet)","link":"https://arstechnica.com/?p=1777051","date":1624996570000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/A6F303AB-D075-4F19-99ED-D9084809D963-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/A6F303AB-D075-4F19-99ED-D9084809D963.jpg\">Enlarge</a> <span>/</span> A screenshot of the Netflix downloads page on a smartphone. (credit: <a href=\"https://about.netflix.com/en/news/stream-your-favorites-before-theyre-done-downloading\">Netflix</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The ability to download videos in their entirety to a mobile device has been a nice (yet lesser-known) feature of Netflix and similar services for a few years now, but the experience has not been without its frustrations. A new update to the Netflix mobile app aims to make the feature better.</p>\n<p>Starting today, Android phone or tablet users on version 7.64 or higher can start viewing a video download in the Netflix mobile app, even if that video hasn't finished downloading to a device. The company's <a href=\"https://about.netflix.com/en/news/stream-your-favorites-before-theyre-done-downloading\">newsroom post</a> announcing the new feature says it's intended for times when \"unreliable Wi-Fi or a maxed-out data plan\" prevents a video from fully downloading.</p>\n<p>So if you tried to download a movie on airport Wi-Fi before your coast-to-coast flight but only got to 80 percent before you had to board, you can now at least watch part of the movie while waiting for an opportunity to finish the download. Once you have a reliable connection again, the download can pick up where it left off, even if you started watching the video in the interim.</p></div><p><a href=\"https://arstechnica.com/?p=1777051#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777051&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"66ffd788ef0ecc15c4fa4b0ffced290840e7de46babc7aeccfecc72745b806fe","category":"Tech"}