{"title":"มาดูการ scale ระบบ Club leaderboard ใน Strava","link":"https://www.somkiat.cc/strava-scaling-club-leaderboard/","date":1628087408000,"content":"<p><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/08/strava-150x150.jpg\" /></p>\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/08/strava-1024x576.jpg\" /></figure>\n\n\n\n<p>สายนักวิ่ง นักปั่น หรือ นักกีฬา น่าจะรู้จักและใช้งาน <a href=\"https://www.strava.com/\" target=\"_blank\">Strava</a><br />ซึ่งแต่ละคนสามารถ update activity ต่าง ๆ <br />รวมทั้งสร้างหรือร่วม Club ต่าง ๆ<br />เพื่อบันทึก แข่งขัน หรือ ดูสถิติต่าง ๆ<br />หนึ่งใน feature หลักของ club คือ <strong>Leaderboard</strong></p>\n\n\n\n<span></span>\n\n\n\n<p><strong><a href=\"https://medium.com/strava-engineering/scaling-club-leaderboard-infrastructure-for-millions-of-users-9ee857ce8cfe\" target=\"_blank\">โดยทางทีมพัฒนาของ Strava</a></strong></p>\n\n\n\n<p>ทำการสรุปการ scale ระบบ Leaderboardให้รองรับจำนวนการใช้งานที่สูงขึ้น<br />รวมทั้งจำนวนผู้ใช้งานในแต่ละ club ที่สูงมาก ๆ<br />จำนวนสมาชิกต่อ club ที่สูงสุดคือ 2 ล้านคน !!<br />มาดูกันว่า Strava ทำอย่างไร ?</p>\n\n\n\n<p><strong>เริ่มต้นในการพัฒนานั้น ทีม Strava มองว่า</strong></p>\n\n\n\n<p>จำนวนสมาชิกใน club ไม่น่าเยอะอาจจะเป็นกลุ่มเล็ก ๆ เท่านั้นเอง<br />แต่เมื่อเวลาผ่านมาเรื่อย ๆ จำนวนสมาชิกแต่ละ club สูงขึ้นเยอะมาก<br />ทำให้ระบบมีปัญหาด้าน performance<br /><br />การพัฒนาจะใช้ Ruby on Rail (RoR) + Active Record<br />สำหรับการดึงข้อมูลจาก database มาประมวลผลใน Leaderboard<br />จะทำการดึงข้อมูล activity ในแต่ละชนิดของแต่ละคน<br />จากนั้นนำมาสรุป และจัดเรียงข้อมูลจากมากไปน้อย<br />มีการจัดทำ index ต่าง ๆ เรียบร้อย<br />แต่ก็ยังรองรับจำนวนผู้ใช้งานไม่เยอะ</p>\n\n\n\n<p><strong>ดังนั้นจึงทำ caching data โดยมีการ update ข้อมูลทุก ๆ 6 ชั่วโมง</strong><br />ซึ่งทำให้ระบบรองรับได้มากขึ้นแต่ข้อมูลไม่ realtime <br />ทำให้ user experience ไม่ดีเลย<br />รวมทั้ง caching data ไม่ใช่การแก้ไขที่ต้นเหตุ !!<br />ยิ่งเจอ club ที่มีสมาชิกเป็นล้านคนการ query ข้อมูลมาใหม่ <br />ต้องใช้เวลามากถึง 20 นาที !!<br />ผลที่ตามมาคือ เจอ error 500 เยอะและบ่อยมาก ๆ<br />จึงน่าจะได้เวลาแก้ไขที่ต้นเหตุกันได้แล้ว</p>\n\n\n\n<p><strong>การแก้ไขปัญหา คือ การเขียนส่วน backend ใหม่</strong></p>\n\n\n\n<p>วิธีคิดคือ<br />เมื่อผู้ใช้งานทำการ upload ข้อมูล activity ใหม่เข้ามายังระบบ<br />จะทำการ update ข้อมูลใน leaderboard ของแต่ละ club ทันที<br />แต่ไม่ต้องการให้ rebuid data ใหม่<br /><br />ดังนั้นจึงทำการเก็บข้อมูลของ leaderboard ไว้ใน <strong>Redis</strong> แทน database หลัก<br />ด้วยการใช้ data structure ที่เหมาะสมคือ <strong>Sorted Set</strong><br />นั่นคือ ข้อมูลจะไม่ซ้ำ และจะเรียงจากมากไปน้อยให้ทันที<br />ส่วนข้อมูลรายละเอียดต่าง ๆ จะเก็บข้อมูลในรูปแบบ <strong>Hash</strong></p>\n\n\n\n<p><strong>การ Rollout ระบบใหม่ จะทำแบบค่อยเป็นค่อยไป</strong></p>\n\n\n\n<p>โดยออกแบบให้ระบบสามารถเปลี่ยนมาใช้งาน feature ใหม่รายคนได้<br />มีขั้นตอนดังนี้</p>\n\n\n\n<ul><li>เริ่มจาก employee testing ก่อน</li><li>ให้ผู้ใช้งาน 10% ลองใช้งาน</li><li>แล้วค่อย ๆ เพิ่มไปจน 100%</li></ul>\n\n\n\n<p>แสดงดังรูป</p>\n\n\n\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/08/strava_02.jpeg\" /></figure>\n\n\n\n<p><strong>ผลการทำงานจากระบบใหม่ ดีขึ้น</strong></p>\n\n\n\n<figure><img src=\"https://www.somkiat.cc/wp-content/uploads/2021/08/strave_03.jpeg\" /></figure>\n\n\n\n<p>เป็นข้อมูลที่น่าสนใจ <br />ซึ่งเราสามารถนำมาเรียนรู้ ศึกษา และนำไปใช้งานได้</p>\n","author":"somkiat","siteTitle":"cc :: somkiat","siteHash":"3a23a5a4389e1e40c6fbb16520a8cc20df5b3591c25145ce72aaa18b19e48201","entryHash":"670297a21e64f9bea47df351b36819a8630f95db5fd6ed59de73104d255c5de5","category":"Thai"}