{"title":"Aero Sensor Companies Start Own Common Aero Device Profile: Got Tired of Waiting for Standard","link":"https://www.dcrainmaker.com/2021/05/aero-sensor-companies-start-own-common-aero-device-profile-got-tired-of-waiting-for-standard.html","date":1620046420000,"content":"<p><img src=\"https://media.dcrainmaker.com/images/2018/09/IMG_4380_thumb.jpg\" /></p>\n<p>Cycling aerodynamic sensor companies Notio &amp; Velocomp have decided they were tired of waiting for the long-discussed ANT+ Aero Sensor device profile, and have simply released their own instead. As a bit of a background refresher here, both Notio &amp; Velocomp are the two main players in the aero sensor space, at least in terms of actual shipping units. There’s a <a href=\"https://www.dcrainmaker.com/2018/07/eurobike-aero-roundup-notio-aerolab-aeropod-swiss-side-and-other-tidbits.html\">long list of companies in the arena</a>, though you’ve likely never heard of most of them. The on-bike cycling aero field is still on the cutting edge of what’s possible, and probably more meaningfully – what consumers are willing to put up with.</p>\n<p>Still, I’ve poked at it from time to time over the last…umm…half decade I think? A long time. Almost as long as companies have been trying to formalize an aero-related device profile within ANT+.  Since then, aero sensor companies have come and gone, including <a href=\"https://www.dcrainmaker.com/2017/07/aerodynamics-alphamantis-acquired.html\">one bought by Garmin – Alphamantis, way back nearly four years ago</a>. To date, Garmin hasn’t released a consumer product based on the prototypes that Alphamantis showed off at previous ANT+ Symposiums. Likely for reasons I’ll explain later.</p>\n<p>In any event, last week’s announcement from Notio &amp; Velocomp is more interesting that people probably realize. So, I’m gonna try and peal back that onion a bit. Because…why not.</p>\n<h3><span>The Aero Profile:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb.png\" /></a></p>\n<p>About two weeks ago, Velocomp and Notio announced the creation and distribution of the “Common Aero Profile”, which basically aims to standardize how devices talk about aerodynamic details in the cycling world. These two companies basically account for all the currently in-production and shipping aero sensors. <a href=\"https://www.dcrainmaker.com/2018/04/hands-on-new-299-aeropod-aerodynamic-sensor.html\">Velocomp makes the AeroPod</a>, while Notio <a href=\"https://www.dcrainmaker.com/2018/09/5-random-things-i-did-this-weekend-80.html#4-notio-konect-quickie\">makes the Notio Aerometer</a>.</p>\n<p>To begin, here’s their official press release on the announcement:</p>\n<blockquote><p>“Cyclists expect bike sensors and bike computers to “just work”. Unfortunately, seamless operation between aero sensors and bike computers isn’t possible today because the aero profile—an industry-standard digital “language” used by aero sensors and bike computers to talk to each other—does not exist. Without an aero profile, cyclists might not benefit from CdA and related measurements, because their aero sensor and bike computer can’t understand each other.</p>\n<p>In order to rectify this problem, two industry leaders in aero sensors, Notio Technologies and Velocomp LLC, today announced a Common Aero Profile. Bike computer and aero sensor manufacturers implementing the Common Aero Profile will provide their customers with a simplified ANT+ setup experience, bike computer display of aero and related data, and device interoperability.</p>\n<p>“The Common Aero Profile opens up aero-related measurements to over 10,000 Notio and Velocomp customers already using our sensors”, says John Hamann, CEO of Velocomp. “Cyclists get simplified aero sensor setup, and measurements that are received and displayed on their bike computer in a consistent manner.”</p>\n<p>“A common aero standard has been an industry goal for several years now,” says Martin Lesauteur, CEO of Notio. “As Notio and Velocomp have captured nearly 100% market share of the aero sensor category, we are collaborating to provide a common standard that’s available now. The Common Aero Profile will stimulate growth opportunities for bike computer and aero sensor manufacturers. For cyclists, seeing aero data on the bike computer of their choice, from the aero sensor of their choice, is another obvious win.”</p>\n<p>The Common Aero Profile will be available for license, without charge, to any bike computer or sensor manufacturer. Notio and Velocomp will implement the Common Aero Profile in their respective products and apps during the 2021 cycling season.”</p></blockquote>\n<p>So essentially, what they’re saying is that because they’re waiting on Garmin/ANT+, they’ve decided to just build their own for now, to get themselves and others (aka, anyone not named Garmin) working towards an actual profile that can be used today. However, they don’t appear to hold any grudges towards the ANT+ profile. In fact, the CEO of Velocomp John Hamann noted in a follow-up message that “if and when it is published, and assuming that bike computer companies choose to adopt it, Velocomp and Notio intend to transition to that profile.”</p>\n<p>But that “in the mean time, we think the Common Aero Profile will spur near-term growth of aero testing and measurement.” – which, is probably accurate. At this point, some cooperation between aero companies is better than fantasizing about a spec that’s been unachievable for years.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2018/04/image_thumb-47.png\" /></p>\n<p>They’re finalizing the exact details of which fields will be included, but the list currently includes: Live CdA, Lap CdA, Wind Speed, Slope, Time Advantage, Lap Marker, Bike Weight, and Rider Weight.</p>\n<p>He noted that “it’s pretty easy to go off into the weeds with all the potentially available metrics, but we are going to try to minimize the complexity of the Common Aero Profile…we want to get it ‘out there’ as soon as possible!”. That’s likely some comments directed at the ANT+ profile, which a few companies have noted to me seems to keep getting bigger and bigger to try and solve every possible scenario – ultimately leading to perfection is the enemy of progress. Inversely, to ANT+’s credit, one of the things that they’ve done exceptionally well over the last decade and more is thinking far ahead in terms of compatibility and potential use cases, which ultimately means the standards tend to stick and be well adopted. But I think most would agree that this one simply has taken far too long.</p>\n<p>Here’s a slide from the <a href=\"https://www.thisisant.com/assets/4._ANT+Update_MichaelRounding_2018.pdf\">2018 ANT+ Symposium</a>, showing the basic structure of how the TWG (Technical Working Group) works on a new ANT+ Profile. It’s actually a pretty good overview of how ANT+ profiles are created and devices are certified.</p>\n<p>Essentially a TWG is a grouping of different companies. So it’s not just Garmin, but Garmin, Velocomp, Notio, AeroLab, likely SRAM, and a pile of others. It’s basically a SIG by another name. There are TWG’s for power meters, trainers (FTMS), and other things. Lots of them, with lots of companies involved.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-1.png\" /></a></p>\n<p>Interestingly, the slide directly before it used the Aero TWG as an example of a profile under development.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-2.png\" /></a></p>\n<p>In any event, Velocomp and Notio’s hope is that the final Common Aero Profile spec will be nailed down in the next few weeks, in time for their products to start using it for the bulk of this season. If other companies want to join in, they’re welcome to.</p>\n<p>Of course, the next steps are formalizing this into products that consumers can use. I’d presume that means we’ll see updated Connect IQ data fields that people can record these data points to, and perhaps we’ll see companies like Hammerhead, Stages, and Wahoo support it too as an interim solution.</p>\n<p>It’s notable that another aero company – <a href=\"https://www.velosense.com/\">Velosense</a>, has actually been using <a href=\"https://www.dcrainmaker.com/2020/12/hammerhead-karoo-2-in-depth-review.html\">Hammerhead Karoo 2</a> units with some of their pro athletes/organizations, and doing so with a sideloaded Android app to record the data into a .FIT file (<a href=\"https://www.dcrainmaker.com/2021/02/how-to-sideload-android-apps-on-your-hammerhead-karoo-1-karoo-2.html\">just like I sideload apps on my Karoo 2</a>). That sort of scenario seems ripe for Hammerhead to come along and say ‘Sure, let’s get these aero fields from the Common Aero Profile added, and make it easy for Velosense at the same time’.</p>\n<p>Somewhat ironically – I’ve actually done aero trials of all three of those companies (Velosense/Notio/VeloComp), with all three travelling at various times over the last couple years to Amsterdam to ride test sections up and down the rowing basin.</p>\n<p>Now finally, one last tidbit that pulls everything full circle is that Notio has long-since <a href=\"https://www.dcrainmaker.com/2018/04/hands-on-new-299-aeropod-aerodynamic-sensor.html#comment-2925431\">licensed some of their patents from Velocomp</a>, who has been around in the aero-measuring industry long before it became cool. That’s a piece that may be impacting some of their competitors in various ways, though, from talking to a number of players in the industry, it’s not generally considered a major sticking point.</p>\n<h3><span>Aero Product Testing Challenges:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0016.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0016_thumb.jpg\" /></a></p>\n<p>Some people have asked, rightfully so, why I haven’t released an in-depth review of an aero sensor to date. And the single-sentence reason is relatively simple: I have very low confidence in the ability to do any meaningful data-backed review such a device at this time.</p>\n<p>The more complex answer: It’s really hard. Incredibly hard, to get consistent enough data on these devices that most consumers can use day to day. And, for about half of these companies – the goal is indeed day to day testing/monitoring of your aero properties. The other half of the companies are geared more towards coaching and analysis services, where a ‘aero professional’ will walk you through the test procedure in person and help you with fit or equipment related changes.</p>\n<p>This second category I have relatively high level of confidence in. I’ve gone through some of these services in test over the years, in both beta and production scenarios, and been relatively confident in the data concepts, and data backing. In fact, I’d argue that I was more confident in having the highly trained staff than the technology itself, because frankly the insight of the staff from various companies having done hundreds of tests is more valuable than one specific sensor reading. But doing it my own out in the wild on real roads with real changes? That’s much messier.</p>\n<p>And then taking that a step forward: Actually creating a review protocol that’s objective and data backed to be able to decide whether or not a product is meaningful? That’s super tricky.</p>\n<p>About at this point someone will shout out: Use Virtual Elevation by Robert Chung!</p>\n<p>To which I’ll happily respond: I see your reference and raise you the real thing – I spent a day with Robert Chung and Tom Anhalt at an aero facility trying to figure out how to test these repeatedly, reliably, and consistently. And I think we all came away with the same rough thought: Holy @#$#@ this is hard.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image001.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image001_thumb.jpg\" /></a></p>\n<p>More specifically, it’s hard to have a way to scale this sort of testing outside of side by side type scenarios that are heavily dependent on knowing the exact rolling resistance of the road and tires, the exact weights of everything on that day, and the exact wind conditions. And far more importantly than that: The rider’s ability to precisely repeat exact finger and body positions within a millimeter or two. To be clear, it’s not impossible, it’s just tough.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/DSC_2818.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/DSC_2818_thumb.jpg\" /></a></p>\n<p><em>(Above: <a href=\"https://www.dcrainmaker.com/2018/01/aerolab-aerodynamic-sensors.html\">Testing AeroLab’s sensors out on the road</a> a few years ago.)</em></p>\n<p>Some of these tests included foam balls hanging off a wooden stick attached to the handlebars, doing ever-so-precise loops around an industrial parking lot. Others involved varying speed tests on an out and back stretch. And some even involved wind tunnel time:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/05/clip_image0018_thumb.jpg\" /></a></p>\n<p>Many questions arose including:</p>\n<p>A) First, validating the exact wind-speed of the sensor in question<br />\nB) How much is the wind-speed impacted by the riders itself? (Spoiler: A lot)<br />\nC) How does mounting position impact the wind-speed? (Another spoiler: More than it should)<br />\nD) Are cross-winds accounted for (yaw angle)?<br />\nE) Was there any braking (if so, likely discard entire test)<br />\nF) How much distance is needed for each test to stabilize (probably 3-5KM)<br />\nG) Did we remember this time to write down every split, and every test variation?<br />\nH) Which recording source are we using? The CIQ-data field, or the synced data backend source?<br />\nI) How are we analyzing the data to ensure the app itself isn’t tweaking our results?</p>\n<p>And that’s just the beginning of the challenges. Which, is ultimately where I’ve paused for now. As Tom, Robert, myself, and others in the industry have poked at – figuring out a repeatable process for <strong>testing aero sensors is tricky</strong>. Impossible? No, definitely not. But challenging.</p>\n<p><em>(To be clear, this is very different than testing riders using aero sensors – because in that case one is starting with the assumption that the sensor is accurate or sensitive enough, regardless of whether or not it actually is).</em></p>\n<p>I think one is probably looking at having a group of people 3-5 days in a single location together hammering through it all with a bunch of products to see where the testing protocol falls apart during the day, iterating on the analysis at night, and rinse repeating. Just a guess. Maybe twice that. Hard to say.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2018/07/DSC_8206.jpg\" /></p>\n<p>Now, this isn’t to say these products don’t provide value. I think they can in the right hands. For example, when Notio first started shipping their products, they required all people go to a multi-hour class on how to use it. They literally did a giant global roadshow where people could only buy their products at that class/event. The goal with that at the time was partially to get real-time feedback from early adopters, but it was also to try and minimize people screwing up their products and them getting a bad rap.</p>\n<p>I think there’s a fuzzy line between the exact accuracy level these products can achieve their positioning and sensors today, versus what people think they can achieve. In that sense I’m reasonably confident that some of these products can help people, over time, figure out the most aero position for themselves on the bike. For example – someone out there doing their 4-6hr Ironman training long-ride each week in aero position, to sit there and tick off 15-30 minute chunks of different positional tweaks and record the findings, iterating week after week. I think that’s largely viable with some of the products there. I’m less confident in one being able to use this tech for the minutia of gear testing, without substantial time spent on the road with each gear combination.</p>\n<p>All of which has nothing, directly, to do with the standard. Except, it probably does.</p>\n<p>One has to remember back to Garmin buying Alphamantis, and ANT+ being effectively led by Garmin, there’s a bit of tie-in there to them also driving much of the aero profile Technical Working Group. I’m sure if I asked ANT+ (officially, Garmin Canada), they’d likely just say things were still being worked out by the technical working group. But other members of that TWG have long felt that Garmin’s cycling product group was stalling on their movement forward of this standard. Remember, in this case ANT+ technically doesn’t represent Garmin’s cycling division. That’d be done by people still in Canada, but not part of ANT+ per se. It’s confusing.</p>\n<p>What’s not confusing though is that Garmin bought an aero company 4 years ago, started working on an aero profile 3 years ago, and hasn’t released a product based on that. This coming from a company that is actually notoriously expeditious about releasing products based on acquired technology/companies. Which is likely an indicator that they’re trying to figure out a saleable consumer product that doesn’t end up becoming a PR disaster, effectively analogous to what I’m trying to figure out from a aero product review standpoint.</p>\n<p>The good news here, if any, is that both Notio and Velocomp have confirmed that if or when ANT+ publishes a standard, then they’ll happily switch over to it. But until then, they’re going to move on.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"67034785e6532f54936fa937f344771f781966342638b32447ba25c9d9f37725","category":"Cycling"}