{"title":"Wastewater treatment using moving bed biofilm reactor technology: a case study of ceramic industry","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11026?af=R","date":1713510000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c26bbd0a-a753-494c-a299-a41d0fcf3702/wer11026-toc-0001-m.png\" alt=\"Wastewater treatment using moving bed biofilm reactor technology: a case study of ceramic industry\" />\n<p>Modified moving bed biofilm reactor was capable of treating ceramic industry effluent. Technique uses a halophilic consortium of biosurfactant producing bacteria and a blend of rhamnolipid and surfactin to reduce pollutants. Water can be reused and recycled on treatment. Technique is cost-effective and energy-efficient with minimal sludge as a remnant of the wastewater system.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Biological approaches and coagulation are frequently used to reduce the chemical oxygen demand (COD) for treatment of ceramic effluent water. The technology known as the moving bed biofilm reactor (MBBR) can accomplish this goal. Further, the process of emulsification-aided innovative MBBR using biosurfactants can be proposed for ceramic effluent treatment. In a step-by-step upgrading scheme, biosurfactants and a consortia of halophilic and halotolerant microbial culture was utilized for the treatment of the effluent water. Over the course of 21 days, a progressive decrease in COD of up to 95.79% was achieved. Over the next 48 h period, the biochemical oxygen demand (BOD) was reduced by 98.3%, while total suspended solids (TSS) decreased by 79.41%. With the use of this innovative MBBR technology, biofilm formation accelerated, lowering the COD, BOD, and TSS levels. This allows treated water to be used for further research on recycling it back into the ceramics sector and repurposing it for agricultural purposes.</p>\n<h2>Practitioner Points</h2>\n<p>\nImplementation of modified MBBR technology for the treatment of effluent water.\nBiosurfactants could reduce in the organic and inorganic loads.\nIncrease in MLSS values with COD removal observed.\nThe plant operations without the use of chemical coagulants was effective with biosurfactants.\nBiofilm formation on carriers was scraped and the presence of surfactin and rhamnolipid was confirmed.\n</p>","author":"Atharv Pethe, \nMousumi Debnath","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"670b51af9badc00a8a07a3c14bd8d7cb6f6066ec8915e5cc3eb2997c15f50ab9","category":"Environment"}