{"title":"Molecular Composition of Exogenous Dissolved Organic Matter Regulates Dissimilatory Iron Reduction and Carbon Emissions in Paddy Soil","link":"https://www.preprints.org/manuscript/202409.0323/v1","date":1725444292000,"content":"Soil carbon (C) cycling under anoxic conditions is mechanistically linked to dissimilatory iron (Fe) reduction, which could be regulated by exogenous dissolved organic matter (DOM). However, the impact of complex exogenous DOM on soil microbial activity and C-Fe coupling in paddy soils remains underexplored. With a 100-day microcosm experiment, we determined that the molecular composition of DOM derived from organic fertilizers and biochar on paddy soil affects soil microbial community, Fe reduction, and C emissions. Our results indicated that biochar-DOM significantly promoted Fe reduction and accelerated CH4 and CO2 emissions, and organic manure-DOM increased soil CO2 emissions, which was closely related to the molecular composition of exogenous DOM. DOM molecules with high aromaticity (AImod) and high DBE, including lignins-vascular plant-derived polyphenols, lignins-polycyclic aromatics (PA), and condensed aromatics-PA, promoted soil Fe reduction and CH4 emissions by enriching soil Fe-reducing bacteria (FeRB), reducing methanotrophs, and facilitating r-strategists at the early stage of incubation. Conversely, DOMs with low AImod, low DBE and high H/C, such as lignins-highly unsaturated and phenolic compounds and proteins-aliphatic compounds, enhanced CO2 emissions by facilitating recalcitrant C degradation and CH4 oxidation at the late stage of incubation. In conclusion, our study highlights the importance of the molecular composition of DOMs derived from organic amendments in regulating soil Fe reduction and C emissions. The findings offer novel insights into the effective utilization of agricultural resources and the mitigation of soil C emissions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6710edbfa88f1c9e4dc30aaf7cae5b9f89f9427ca7b32aa4230b6c19c163a3e4","category":"Interdisciplinary"}