{"title":"Which Mac port is the best to use for external storage?","link":"https://www.macworld.com/article/557441/best-mac-port-external-storage.html","date":null,"content":"<div>\n<section><div></div></section><p>How can you decide when planning to purchase a new drive and cable which port, standard, and cable will give you the best performance for the least necessary to spend? It’s an interesting mix of protocols and cables that can result in hundreds of dollars difference in what you potentially could pay.</p>\n\n\n\n<p>Apple replaced FireWire with Thunderbolt in 2011 on Macs, and upgraded its USB connections to USB 3.0 starting in 2012. Thunderbolt is in its fourth generation now, while USB has gone through 3.1 and 3.2 en route to the current 4.0.</p>\n\n\n\n<p>USB 3.0 offered data rates of 5 gigabits per second (Gbps); 3.1 added a 10Gbps flavor; 3.2, a 20Gbps flavor, and 4.0 incorporates the Thunderbolt 3/4 data transfer standard, allowing up to 40Gbps. Thunderbolt advanced with version 1 offering 10Gbps, version 2 bumping that to 20Gbps, and version 3 jumping to 40Gbps. (Thunderbolt 4 offers additional extensions, some just making mandatory features available in Thunderbolt 3, like support for hubs, but keeps the top data rate the same.)</p>\n\n\n\n<p>Three factors affect the drive and cable you might buy:</p>\n\n\n\n<ul><li>What ports appears on the Mac you own?</li><li>Do you need hard disk drive (HDD) or SSD performance? And, if an SSD, the fastest possible SSD throughput?</li><li>How far away can your drive live from your Mac?</li></ul><h2>Pair ports and drive throughput</h2>\n\n\n\n<p>You can use the free <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mactracker.ca/&amp;xcust=1-1-557441-1-0-0&amp;sref=https://www.macworld.com/feed\">Mactracker</a> to look up your model of Mac, focusing on the Connections tab. (We reviewed <a href=\"https://www.macworld.com/article/358054/mac-gems-mactracker-review.html\">Mactracker as a Mac Gem</a>.) Note the speed listed for various ports. For instance, the late 2014 model Mac mini has four USB ports that support 5Gbps; the 2020 M1 Mac mini has two Type-A ports that also support 5Gbps (3.1 Gen 1), but the USB-C ports handle USB 3.1 Gen (10Gbps) and USB 4 plus Thunderbolt 3 and 4 (20Gbps).</p>\n\n\n\n<p>Consider this when looking at drive performance. A 5,400 revolutions per minute (rpm) hard drive might be fine for Time Machine or other high-capacity purposes in which transfer speeds aren’t a key issue. Such drives can perform at about 100 megabytes per second (MBps) for read and write. A “fast” 7,200 rpm drive can bump read speeds to 200MBps and writes to 150MBps.</p>\n\n\n\n<p>That means the fastest drive at 200MBps can only perform at under 2Gbps, and any USB 3 port would suffice. You can use your slowest port on a Mac or a USB 3 hub attached to it and likely achieve the maximum possible rate.</p>\n\n\n\n<p>As I noted in <a href=\"https://www.macworld.com/article/548635/photos-mac-ssd.html\">another Mac 911 article</a> about using an SSD for an external Photos library, you can buy a fairly affordable SSD that has an internal SATA interface and delivers no more than about 600MBps, which is conveniently just below the 5Gbps baseline speed of any USB 3 port. A drive with USB 3.1 Gen 2 (10Gbps) might deliver slightly better results paired with a port that offers those speeds.</p>\n\n\n\n<p>For better performance—as for an external startup volume or video editing—an NMVe/PCIe-based SSD can achieve rates of 1,000 to 3,000MBps or 8 to 24Gbps. Newer drives and arrays will be able to perform even faster. USB 4 at 20Gbps or Thunderbolt at 20 or 40Gbps is the only reasonable choice to avoid throttling your drive below its maximum capability.</p>\n\n\n\n<h2>Find the right cable</h2>\n\n\n<div><div><figure><a href=\"https://www.amazon.com/AmazonBasics-USB-3-0-Cable-Male/dp/B00NH144GK?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/12/516HqOl6OFL._AC_SL1331_.jpg?quality=50&amp;strip=all&amp;w=1200\" /></a><figcaption>USB Type-A to 3.0 Type-B using a cable like this one can carry 5 Gbps plugged into a 3.0 or 3.1 Type-A port on a Mac.</figcaption></figure></div></div>\n\n\n\n<p>Now, while my point three above are important, here’s the catch: the cable is the thing. While ports define maximum data rates for each supported standard, you need a cable of the right kind to reach maximum rates, too. For lower speeds, you can also opt to buy a less-expensive cable that only delivers the required data rate and avoid overspending.</p>\n\n\n\n<p>While the options can be complicated for USB and Thunderbolt when you’re using a cable for data and to charge a laptop, with AC-powered or modestly-powered SSD drives, you don’t need to worry about whether a cable can exceed a minimum power level, typically 15 watts.</p>\n\n\n\n<p>Instead, look at how the cable is described:</p>\n\n\n\n<ul><li>For 5Gbps speeds over USB 3, any SuperSpeed (by itself) or SuperSpeed/SS USB 5Gbps cable will do, the USB trade group’s two generations of branding for 5Gbps cables. You can find 5Gbps cables that have Type-A at one end to plug into a computer; on the other, either 3.0 Type-B (like the 2.0 squareish one, but with an bump out at the bottom) or the 3.0 Micro-B, a wider version of the 2.0 Micro-B that remains in common use for headphones, ebook readers, non-Apple smartphones, and other devices for charging and USB 2.0 data transfer.</li><li>For 10Gbps speeds over USB, look for a cable with SuperSpeed+ or SuperSpeed/SS USB 10 Gbps logo on it. These cables may have a Type-A or USB-C connector on the computer side and a 3.0 Type-B, 3.0 Micro-B, or USB-C connector on the drive end.</li><li>For 20Gbps over USB, the cable you want should be labeled for SuperSpeed/SS USB 20Gbps. These cables must have USB-C connectors on both ends.</li><li>For 20Gbps over Thunderbolt 3 or 4, you can use a passive cable labeled for Thunderbolt 3 or 4 at lengths up to 6.6 feet (2 meters).</li><li>For 40Gbps over Thunderbolt 3 or 4, you can either use a Thunderbolt 3 or 4 <em>passive</em> cable that’s 1.65 feet (0.5 m) or an <em>active</em> cable that’s up to 6.6 feet long.</li></ul><div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/cable-matters-2.6-ft-usb-c-cable-1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>A USB-C to USB-C cable marked 40 with a USB logo can only be USB 4, allowing up to 20 Gbps or up to 40 Gbps. </figcaption></figure></div><p>Cable Matters</p></div>\n\n\n\n<p>The prices can be substantially different. Try to find the shortest cable that provides the highest speed you need. Look at these three Cable Matters options’ street prices, comparable to those from other companies:</p>\n\n\n\n<ul><li><a href=\"https://www.amazon.com/Cable-Matters-USB-Black-Feet/dp/B00C7RXR72?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">USB 3.0 Type-A to 3.0 Type-B</a>, 6 feet, $7.49</li><li><a href=\"https://www.amazon.com/Cable-Matters-Certified-Thunderbolt-Supporting/dp/B01AS8U9KE?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Thunderbolt 3, passive</a>, 3.3 feet, $21.99</li><li><a href=\"https://www.amazon.com/Cable-Matters-107022-Computer-Cables/dp/B084Z65YJQ?tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/feed\">Thunderbolt 4/USB 4, active</a>, 6.6 feet, $59.99</li></ul><p>Generally, you can plug any USB 3 or 4 or Thunderbolt 3 or 4 cable from a drive into a corresponding on your Mac or hub connected to it, and achieve the highest data rate based on cable type and distance.</p>\n\n\n\n<p>The only place you can get into trouble mixing and matching USB and Thunderbolt cables with a Mac is the discontinued 12-inch MacBook that first appeared in 2015. That was the only Mac to have a USB 3.1-only host controller and no Thunderbolt 3—connecting a Thunderbolt 3 cable between it and a Thunderbolt 3 device will result in no communication. Either a USB 3-only cable or a newer USB 4/Thunderbolt 4 will work instead.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Joe.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"671b85f9c9c03f60bbacf5d6bef7bd02ce8be56f12b7fd94e014817412c218b0","category":"Apple"}