{"title":"OS Updates: iOS 16.4, MacOS 13.3, WatchOS 9.4, tvOS 16.4, and More","link":"https://mjtsai.com/blog/2023/03/27/ios-16-4-and-ipados-16-4/","date":1680056087000,"content":"\n<p>I’m linking here to Michael Tsai’s roundup of links pertaining to iOS (and iPadOS) 16.4, but Apple has pretty much released updates to <em>all</em> of their platforms, all the way down to <a href=\"https://www.macrumors.com/2023/03/27/apple-releases-homepod-16-4-software/\">HomePods</a> and the <a href=\"https://support.apple.com/en-us/HT213110\">Studio Display</a>. </p>\n\n<p>Some of the features that particularly interest me:</p>\n\n<ul>\n<li><p>Mastodon links now get unfurled preview cards in Messages, Mail, and Notes, just like Twitter links.</p></li>\n<li><p><a href=\"https://www.macrumors.com/2023/03/28/apple-makes-new-home-upgrade-available/\">The new “architecture” for the Home app</a> is available again, after being briefly available but then pulled due to bugs in iOS 16.2. It’s a one time upgrade for any homes you’ve set up in Home that is supposed to make everything you do faster and more reliable.</p></li>\n<li><p><a href=\"https://blog.emojipedia.org/ios-16-4-emoji-changelog/\">New emoji</a>, but still no “chef’s kiss”. We need to band together and make a chef’s kiss emoji happen.</p></li>\n<li><p>“Voice isolation” — a feature previously available to VoIP apps like FaceTime and WhatsApp — <a href=\"https://www.macrumors.com/2023/03/21/ios-16-4-voice-isolation-phone-calls/\">is now available for regular old fashioned cellular phone calls on iPhone</a>. I’m not sure how normal people would ever discover this, though — the interface to turn it on or off is in Control Center, when you’re on a call. Seems to me it ought to be in the interface for the call itself in the Phone app, like the controls for switching the audio output.</p></li>\n</ul>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/28/os-updates\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"671cccc218691b8b13ac81db38344a8a93d6086bae168dea2917a549b7fdb207","category":"Tech"}