{"title":"Preview: What you need to know about stage 9 of the Vuelta a España","link":"https://cyclingtips.com/2021/08/preview-what-you-need-to-know-about-stage-9-of-the-vuelta-a-espana/","date":1629581317000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage9-650x402.jpeg\" /></div><h2>Preview: What you need to know about stage 9 of the Vuelta a España</h2><p>\n</p><p><strong>Date: </strong>Sunday August 22<br /><strong>Start: </strong>Puerto Lumbreras<br /><strong>Finish: </strong>Alto de Velefique<br /><strong>Distance: </strong>188 km</p>\n\n\n\n<p>In the words of the Vuelta’s technical director Fernando Escartín, this is a “very tough, pure mountain stage” with almost 4,500 metres of climbing. The first half isn’t too hard – there’s just one Cat 2 climb that averages 3.8% – but the second half is a different story.</p>\n\n\n\n<p>The Alto Collado Venta Luisa is a 29 km-long monster (that averages 4.4% but has a flat section in the middle). That’s followed by a smaller Cat 3 (7.1 km at 3.9%) and then there’s the race’s first HC climb: the 13.2 km ascent to Alto de Velefique which averages 6.4%. This will be a tough day’s racing ahead of the first rest day, and one of the few stages in the race that reaches significant elevations. The Alto Collado Venta Luisa ascends to 1,970 meters, and the stage finishes at 1,800 meters.</p>\n\n\n\n<p><strong>Who’s it for: </strong>Probably the GC men, but possibly the breakaway.</p>\n\n\n\n<p><strong>Dane Cash’s picks:</strong> <em>I’m leaning toward the GC riders in the stage battle with the rest day on the horizon, although it’s close. It’s hard to look past Primož Roglič right now in the high mountains, but if Adam Yates or Egan Bernal plans to try to take it to the defending champion, they’ll certainly have an opportunity in the stage 9 finale. Yates may have a slight edge as he’s a bit punchier than Bernal, but Bernal could thrive at this altitude. Should a break contest the stage, watch out for Romain Bardet and Mark Padun on this climber-friendly profile.</em></p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/08/2021-vuelta-profile-stage9.jpeg\" /></figure>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/stage9.jpeg\" /></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/preview-what-you-need-to-know-about-stage-9-of-the-vuelta-a-espana/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"672293622c1fb89e8e58e9768413ddc42cb9cfe8186fd9530244ab3c2925ea45","category":"Cycling"}