{"title":"Harley Quinn has new bad guy allies in The Suicide Squad red band trailer","link":"https://arstechnica.com/?p=1752433","date":1616785776000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/squad2-980x647.jpg\" alt=\"\"></div>\n        <p>\n          Joel Kinnaman is back as Colonel Rick Flag, heroic leader of Task Force X, aka The Suicide Squad.                      [credit:\n                        YouTube/Warner Bros.                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Idris Elba and Margot Robbie headline an ensemble cast of colorful supervillains recruited for a special military tactical response team in the red band trailer for <a href=\"https://en.wikipedia.org/wiki/The_Suicide_Squad_(film)\"><em>The Suicide Squad</em></a> (embedded below). It's Director James Gunn's (<em>Guardians of the Galaxy</em>) standalone follow-up to 2016's <a href=\"https://en.wikipedia.org/wiki/Suicide_Squad_(film)\"><em>Suicide Squad</em></a>. It's actually pretty tame as red band trailers go, playing up the jokey camaraderie amid all the explosions, gunfire, and blood spatter. Tonally, Gunn's film feels like a cross between <em>Guardians of the Galaxy</em> and <em>Deadpool</em>—in other words, it looks like a lot of fun, and it's definitely something we're keen to see when it debuts this summer.</p>\n<p><strong>(Some spoilers for prior DCEU films below,)</strong></p>\n<p>The original <em>Suicide Squad</em> took place a year after the death of Superman in Zack Snyder's <a href=\"https://en.wikipedia.org/wiki/Batman_v_Superman:_Dawn_of_Justice\"><em>Batman v. Superman: Dawn of Justice</em></a> (2016). Intelligence Officer Amanda Waller (Viola Davis) receives permission to create Task Force X, a tactical response team to combat \"metahuman\" threats. The group is composed entirely of criminals and supervillains and is led by Colonel Rick Flag (Joel Kinnaman). The government plants nanite bombs in their necks to keep them reasonably under control, promising to shorten their sentences if their missions are successfully fulfilled. The all-star cast included Will Smith as Deadshot, Margot Robbie as Harley Quinn, Jai Courtney as Captain Boomerang, and Jared Leto as The Joker. </p></div><p><a href=\"https://arstechnica.com/?p=1752433#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1752433&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"673b5b34a7281d9726e58fae4bd567249c007385199d2f34694c33cbf355ecb8","category":"Tech"}