{"title":"Facility Design for, Installation, and Management of a 300kV Cryo-transmission Electron Microscope","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.963/7720228?rss=1","date":1721779200000,"content":"<span>Facility design and installation of a 300 kV cryo-transmission electron microscope (TEM) is a complex undertaking which requires many years of careful planning, preparation, and organization. Room size, floor vibrations, noise, room temperature, humidity, or potential interferences from magnetic fields can negatively impact the performance of the TEM [<a href=\"#ozae044.963-B1\">1</a>, <a href=\"#ozae044.963-B2\">2</a>]. Additionally, facility services such as A/C, chilled water supply, electrical supply (including battery back-up solutions), nitrogen supply, data connections and storage, room access, and transport routes must be carefully evaluated and modified to host a TEM [<a href=\"#ozae044.963-B2\">2</a>]. As all these factors interfere with the installation, performance, service, usage, and management of the TEM, they must be addressed before the TEM is installed to avoid delays during installation and poor performance. Companies provide pre-installation guidelines which are very helpful but overloaded with information that is often irrelevant for the respective configuration of the TEM and the local arrangements. On top of that, pre-installation guidelines are often not up to date and can contain inaccurate information. While adequate facility design is essential for the performance of the TEM, the installation relies on the interaction between the field engineer, company, facility services, IT, the director of the facility and related staff, who have to solve issues before and during installation to avoid delay and poor performance.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"67407bdb5015ba8ad1cc47fec9462ad5bbfa90868db7519a35c8499cc4cf8726","category":"Environment"}