{"title":"Opening the dialogue: A preliminary exploration of hair color, hair cleanliness, light, and motion effects on fNIRS signal quality","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304356","date":1716472800000,"content":"<p>by Mitchell Holmes, Daniel Aalto, Jacqueline Cummine</p>\r\nIntroduction <p>Functional near-infrared spectroscopy (fNIRS) is a promising tool for studying brain activity, offering advantages such as portability and affordability. However, challenges in data collection persist due to factors like participant physiology, environmental light, and gross-motor movements, with limited literature on their impact on fNIRS signal quality. This study addresses four potentially influential factors–hair color, hair cleanliness, environmental light, and gross-motor movements–on fNIRS signal quality. Our aim is to raise awareness and offer insights for future fNIRS research.</p> Methods <p>Six participants (4 Females, 2 Males) took part in four different experiments investigating the effects of hair color, hair cleanliness, environmental light, and gross-motor movements on fNIRS signal quality. Participants in Experiment 1, categorized by hair color, completed a finger-tapping task in a between-subjects block design. Signal quality was compared between each hair color. Participants in Experiments 2 and 3 completed a finger-tapping task in a within-subjects block design, with signal quality being compared across hair cleanliness (i.e., five consecutive days without washing the hair) and environmental light (i.e., sunlight, artificial light, no light, etc.), respectively. Experiment 4 assessed three gross-motor movements (i.e., walking, turning and nodding the head) in a within-subjects block design. Motor movements were then compared to resting blocks. Signal quality was evaluated using Scalp Coupling Index (SCI) measurements.</p> Results <p>Lighter hair produced better signals than dark hair, while the impact of environmental light remains uncertain. Hair cleanliness showed no significant effects, but gross motor movements notably reduced signal quality.</p> Conclusion <p>Our results suggest that hair color, environmental light, and gross-motor movements affect fNIRS signal quality while hair cleanliness does not. Nevertheless, future studies with larger sample sizes are warranted to fully understand these effects. To advance future research, comprehensive documentation of participant demographics and lab conditions, along with signal quality analyses, is essential.</p>","author":"Mitchell Holmes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6741061811c6c7f8dda08545b6e5ea9947da56df50ca21c92d54fdd95c2c8898","category":"Interdisciplinary"}