{"title":"California AirTag Lawsuit Widened to Include Dozens More Stalking Cases","link":"https://www.macrumors.com/2023/10/13/airtag-lawsuit-widened-stalking-cases/","date":1697197530000,"content":"Apple is facing an expanded class action lawsuit in federal court in San Francisco by more than three dozen victims allegedly terrorized by stalkers using Apple <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, reports <em><a href=\"https://arstechnica.com/tech-policy/2023/10/apple-airtags-triggered-explosion-of-stalking-reports-nationwide-lawsuit-says/\">ArsTechnica</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-1.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe complaint targets Apple alleged negligence in allowing ‌AirTags‌ to become \"one of the most dangerous and frightening technologies employed by stalkers\" since they can be easily used used to determine \"real-time location information to track victims.\"\r<br />\n\r<br />\nThe complaint is a revised version that was brought before a Californian judge in <a href=\"https://www.macrumors.com/2022/12/06/women-sue-apple-over-airtags/\">December 2022</a> by two women, one of which claims her ex-boyfriend used an AirTag to track her without her consent. Since then, plaintiffs allege that there has been an \"explosion of reporting\" showing that ‌AirTags‌ are often used for stalking.\r<br />\n\r<br />\nTo evidence its claims, the complaint cites more than 150 police reports in the United States as of April 2022, as well as an upsurge in international stalking cases involving ‌AirTags‌. Plaintiffs argue that Apple has not done enough to reduce potential harms, which they claim can include financial ruin and in extreme cases murder. \r<br />\n\r<br />\nThere have been multiple news stories about ‌AirTags‌ being used for vehicle theft, stalking, and other nefarious purposes, which has led Apple to make several updates to <a href=\"https://www.macrumors.com/2022/02/10/airtag-updates-unwanted-tracking/\">how AirTags work</a> to prevent criminals from taking advantage of them.\r<br />\n\r<br />\nWhen setting up an AirTag, for example, Apple shows warnings to thwart malicious use. The warning makes it clear that the AirTag is linked to an ‌<a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>‌, that using it to track people is a crime, and that law enforcement can request identifying information about the owner of the AirTag, which Apple will readily provide.\r<br />\n\r<br />\nWith an April 2022 software update, Apple made the AirTag sound louder, also to help cut down on stalking attempts. Apple also added safety features that include Precision Finding, improved display alerts, and louder sounds that are designed to make ‌‌AirTags‌‌ more difficult to use for people-tracking purposes. Additionally, Apple released the \"Tracker Detect\" app that allows Android users to scan for ‌AirTags‌ to make sure there are none around.\r<br />\n\r<br />\nDespite these updates, plaintiffs have alleged that ‌AirTags‌ remain dangerous. For instance, one Georgia resident quoted by <em>ArsTechnica</em> reported that she and her daughter were being stalked by someone using ‌AirTags‌ within the past two weeks \"without knowing by whom or why.\" Although she cannot locate the ‌AirTags‌, she receives daily alerts from Apple and chimes from the ‌AirTags‌ that confirm that the ‌AirTags‌ are still there. These chimes only signal to the victim that she's being perpetually watched. \"Every day, I am reminded that me and my daughter are not safe,\" added the victim in the complaint.\r<br />\n\r<br />\nThe complaint alleges that Apple violated federal and state laws by negligently releasing a defective product, and has been unjustly enriched while invading the privacy of those victim unwittingly being tracked on its devices. Plaintiffs are seeking damages to all persons in the US who own iOS or Android devices, which includes classes of users who were stalked, as well as those who were allegedly at risk of stalking. \r<br />\n\r<br />\nThe complaint also seeks a court order \"enjoining Apple from further unlawful, unfair, and/or fraudulent practices with respect to the design, manufacture, and release into the market of its ‌AirTags‌.\"\r<br />\n\r<br />\nApple is expected to move to dismiss the lawsuit by October 27, the deadline by which the company must respond to the amended complaint.<div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airtags.232\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/13/airtag-lawsuit-widened-stalking-cases/\">California AirTag Lawsuit Widened to Include Dozens More Stalking Cases</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/california-airtag-lawsuit-widened-to-include-dozens-more-stalking-cases.2407426/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6749383b7c07c29f3c57132e00732a2cc00c301c873947a7251eb4dc3310c141","category":"Apple"}