{"title":"Global Future Climate Signal by Latitudes Using CMIP6 GCMs","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2022EF003183?af=R","date":1709723178000,"content":"<h2>Abstract</h2>\n<p>This study estimated global climate change signals at different latitudes for four main Shared Socioeconomic Pathways (SSPs). Five evaluation metrics were integrated using the Technique for Order of Preference by Similarity to Ideal Solution to quantify the historical reproducibility of 25 CMIP6 General Circulation Models (GCMs) with Global Precipitation Climatology Centre precipitation and Climatic Research Unit temperature as the reference. The most suitable GCMs for simulating climate over different latitudes, selected based on evaluation metrics, were used to prepare a multimodel ensemble and project the future annual and seasonal precipitation and temperature in the near (2031–2065) and far future (2066–2100). The results showed that GCMs estimated the historical mean temperature efficiently but underestimated the monthly precipitation compared to the reference data. The changes in precipitation and temperature at mid-latitudes (N45.5°–60°) showed the highest variability for all scenarios. The maximum increases in both climate variables for SSP5-8.5 were 80.5% and 4.8% at N45.5°–60°, respectively. In contrast, the temperature and precipitation at S30.5°–45° revealed a decreasing pattern. Mid-latitude winter (S30.5°–45°) would be drier in the future than in the base period (1980–2014). This study showed that precipitation variability and the mean temperature in the northern hemisphere would be larger for SSPs with higher radiative forcing. Therefore, the results of this study help improve knowledge of global future climate change by latitudes.</p>","author":"Young Hoon Song, \nEun‐Sung Chung, \nShamsuddin Shahid","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"674eeaa0908523d1de0b15f866fbabdca832915c8ac7a3c4f7d00699bb158ac2","category":"Environment"}