{"title":"Exposure to Trimethyltin Chloride Induces Pyroptosis and Immune Dysfunction in Grass Carp CIK Cells by Activating the NF‐κB Pathway Through Oxidative Stress","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24371?af=R","date":1721021413000,"content":"<h2>ABSTRACT</h2>\n<p>Trimethyltin chloride (TMT) is a highly toxic organotin pollutant frequently found in aquatic environments, posing a significant threat to the ecological system. The kidney plays a vital role in the body's detoxification processes, and TMT present in the environment tends to accumulate in the kidneys. However, it remained unclear whether exposure to different doses of TMT could induce pyroptosis and immune dysfunction in grass carp kidney cells (CIK cells). For this purpose, after assessing the half-maximal inhibitory concentration (IC50) of TMT on CIK cells, we established a model for exposure of CIK cells at varying concentrations of TMT. CIK cells were treated with various doses of TMT (2.5, 5, 10 μM) for 24 h. Oxidative stress levels were measured using kits and fluorescence methods, whereas the expression of related genes was verified through western blot and quantitative real-time PCR (qRT-PCR). The results indicated that TMT exposure led to oxidative stress, with increased levels of ROS, H<sub>2</sub>O<sub>2</sub>, MDA, and GSH, and inhibited activities of T-AOC, SOD, and CAT. It activated the NF-κB pathway, leading to the upregulation of NF-κB p65, NF-κB p50, GSDMD, NLRP3, ASC, and Caspase-1. Furthermore, TMT exposure also resulted in increased expression of cytokines (IL-18, IL-6, IL-2, IL-1β, and TNF-α) and decreased expression of antimicrobial peptides (LEAP2, HEPC, and β-defensin). In summary, exposure to TMT induces dose-dependent oxidative stress that activates the NF-κB pathway, leading to pyroptosis and immune dysfunction in grass carp CIK cells.</p>","author":"Xiaotong Ni, \nHaozheng Hong, \nHaotian Xu, \nMeng Qi, \nShiwen Xu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"67548697f8f5f8c777b794511cb2f797040c7fcf90455412f75b0e21a4649346","category":"Environment"}