{"title":"A mHealth intervention to promote physical activity for healthy aging: Every Walk You Take citizen science project","link":"https://www.preprints.org/manuscript/202403.1871/v1","date":1711959217000,"content":"Physical inactivity, highly dependent on community and environmental conditions, is the fourth leading cause of death worldwide. The objective of Every Walk You Take initiative was to co-design and test a mHealth intervention prototype (mobile app) to promote active living, and to identify barriers and facilitators for active living in individuals older than 55 years. Community stakeholders that included citizen scientists, teachers, researchers, health professionals and policy makers, familiar with the social and economic burden of aging in developed societies, codesigned the prototype. The app functionalities included recommendations on healthy routes in the city (parks, pedestrian lanes and streets) according to environmental variables (air quality and climate) and personal preferences (route difficulty, distance and geolocalization); and the collection of ecological momentary assessments (pictures and voice notes) to identify the barriers and facilitators to perform the routes. The prototype was tested in a pilot study in two deprived neighbourhoods of Barcelona. A total of 21 citizen scientists [mean age=67 (standard deviation=7)], 86% of them female collected, during two 7-day cycles, 112 comments and 48 pictures describing the barriers and facilitators for active living. The negative impact of dirty or damaged roads on citizen scientists’ motivation to engage in physical activity was highly reported as a barrier indicating that city infrastructure directly influences the public's inclination towards adopting active lifestyles. However, citizen scientists highlighted murals and urban green spaces they encountered, which made their walks more enjoyable and stimulating, as facilitators for active living. Every Walk You Take initiative constitutes the foundation for the development of novel models of health surveillance to address gaps in the current research landscape of active living. Moreover, the increased health literacy of the individuals ensures that they are more conscious about the role of physical activity in healthy ageing.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"675b889b5e82ba02e39b468381ec32f598569e03e04aea70be462232bb6efe00","category":"Interdisciplinary"}