{"title":"MOOTS DEALER SPOTLIGHT–ANGRY CATFISH BIKE SHOP + COFFEE BAR","link":"https://moots.com/moots-dealer-spotlight-angry-catfish-bike-shop-coffee-bar/","date":1614981678000,"content":"<p>Our featured dealer this month is a long-standing Moots dealer Angry Catfish located in <span></span></p>\n<p>Minneapolis, Minnesota. They’ve been carrying our brand for 11 years since the doors first opened and combine a welcoming bike experience with amazing coffee service. Owner Josh Klauck has strived to create a friendly, approachable shop selling more independent brands than the large box store types. The shop has made many nation’s best bike shops lists, attracting customers from across the world.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC03340-1.jpg\" /><span> </span></p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC04690.jpg\" /></p>\n<p>Even before Angry Catfish opened the doors, they had a relationship with Moots, and bikes were housed in shop owner Josh Klauck’s house before the shop was up and running. Josh recalls there were already a couple of bike shop cafes in Minneapolis, so it wasn’t 100 percent a unique idea, but there were certain aspects we wanted to do differently. We decided to include the cafe with the bike shop because of the community aspect. We wanted to create a gathering place for cyclists and an environment for ourselves where we didn’t have to go anywhere to get coffee and food offerings. We were always spending time together and working 80 hours a week, so it seemed like a good option.</p>\n<p>Now in its 11th-year Angry Catfish is expanding the bike side as they have purchased a new location that will offer a bigger footprint and room to grow. They will keep the original location as a cafe and expand into a new space that once housed a hardware store. The new location will be built out in the next 3-6 months.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/DSC04686-scaled.jpg\" /></p>\n<p>With the forethought of expanding the bike shop footprint, they are also upping their game with Moots. Knowing that they would be expanding the bike side they placed early season orders with Moots to provide an in-house demo experience for customers. Angry Catfish is listed as a certified Moots Demo Center and is one of less than a dozen Moots retailers to offer a dedicated ready-to-ride fleet. They have a beautiful assortment of Routt 45s, Routt RSLs, and Wombles to throw a leg over. If you’re in the Twin Cities area, stop in, check out the Moots demos and stay for a coffee, you’ll be glad you did.<span> </span></p>\n<p>The post <a href=\"https://moots.com/moots-dealer-spotlight-angry-catfish-bike-shop-coffee-bar/\">MOOTS DEALER SPOTLIGHT–ANGRY CATFISH BIKE SHOP + COFFEE BAR</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"6767b48fb6ac8fd837dfa1b62976ed27f74b9681d596363253cb5d660018321b","category":"Cycling"}