{"title":"Spatiotemporal variability of evapotranspiration in Alpine grasslands and its biotic and abiotic drivers","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2633?af=R","date":1708070163000,"content":"<h2>Abstract</h2>\n<p>To gain a deeper understanding of the water balances of Alpine grassland ecosystems, it is crucial to know the abiotic and biotic drivers of evapotranspiration. The abiotic drivers are very heterogeneous in mountain regions because elevation, slope and aspect control incoming R<sub>s</sub>, and atmospheric layering affect air temperature, humidity and wind distribution. In a study with 24 lysimeter plots distributed over a study area of approx. 300 km<sup>2</sup> in the Eastern Alps, we covered a wide range of topographic conditions. We investigated the effects of abiotic drivers on evapotranspiration by measuring evaporation from a free-water body (E<sub>w</sub>). For the biological modulation of crop evapotranspiration (ET<sub>c</sub>), we analysed two different grassland types (at peak biomass and at low biomass) and calculated the respective crop coefficients (K<sub>c</sub>). Results showed that primarily physical drivers such as the accumulated solar radiation from sunrise to measurement (R<sub>s</sub>_acc), followed by atmospheric pressure (P), wind speed (u) and vapour pressure deficit (VPD) influence both E<sub>w</sub> and ET<sub>c</sub>. Moreover, ET<sub>c</sub> is also significantly influenced by standing biomass and the grassland type (i.e., resource use strategies of the vegetation types) and by the geographic location along the valley (i.e., entrance, middle and head of the valley). We suppose plant stress and/or ground winds to be the underlying factor for the significance of the geographic location, yet further research is needed. The current study helps towards a better understanding of the water balance in alpine grassland ecosystems, but we also show that some spatial drivers cannot yet be adequately addressed.</p>","author":"Lisa Ambrosi, \nVanessa Berger, \nGeorg Rainer, \nNikolaus Obojes, \nUlrike Tappeiner, \nErich Tasser, \nGeorg Leitinger","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"676edcc4a3ef6e7dd94f510f1e2f67d4a257f67c35c0de54cac7b92b3549a155","category":"Environment"}