{"title":"The interkingdom horizontal gene transfer in 44 early diverging fungi boosted their metabolic, adaptive, and immune capabilities","link":"https://academic.oup.com/evlett/article/8/4/526/7619622?rss=1","date":1709596800000,"content":"<span><div>Abstract</div>Numerous studies have been devoted to individual cases of horizontally acquired genes in fungi. It has been shown that such genes expand the hosts’ metabolic capabilities and contribute to their adaptations as parasites or symbionts. Some studies have provided an extensive characterization of the horizontal gene transfer (HGT) in Dikarya. However, in the early diverging fungi (EDF), a similar characterization is still missing. In order to fill this gap, we have designed a computational pipeline to obtain a statistical sample of reliable HGT events with a low false discovery rate. We have analyzed 44 EDF proteomes and identified 829 xenologs in fungi ranging from <span>Chytridiomycota</span> to <span>Mucoromycota</span>. We have identified several patterns and statistical properties of EDF HGT. We show that HGT is driven by bursts of gene exchange and duplication, resulting in highly divergent numbers and molecular properties of xenologs between fungal lineages. Ancestrally aquatic fungi are generally more likely to acquire foreign genetic material than terrestrial ones. Endosymbiotic bacteria can be a source of useful xenologs, as exemplified by NOD-like receptors transferred to <span>Mortierellomycota</span>. Closely related fungi have similar rates of intronization of xenologs. Posttransfer gene fusions and losses of protein domains are common and may influence the encoded proteins’ functions. We argue that there is no universal approach for HGT identification and inter- and intra-kingdom transfers require tailored identification methods. Our results help to better understand how and to what extent HGT has shaped the metabolic, adaptive, and immune capabilities of fungi.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"67757d3a74e407ed498b85cb296956920cb107269057281e80eb717c9c3d1b68","category":"Environment"}