{"title":"Strava Adds More Photo-Based Tools to Route Planning","link":"https://www.dcrainmaker.com/2023/08/strava-adds-more-photo-based-tools-to-route-planning.html","date":1692896303000,"content":"<p></p>\n<p>Strava has added a new feature for Subscribers that lets you see photos while route planning on desktop now, and more specifically, lets you see the exact location of said photos. This is a major upgrade over the Strava route-photo feature introduced earlier this year that showed you photos along a created route, but not their location nor allowed you to plan based on them. Additionally, it brings it closer to Komoot’s photo-based route planning features.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutes.jpg\"><img title=\"StravaRoutes\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutes_thumb.jpg\" alt=\"StravaRoutes\" width=\"720\" height=\"480\" /></a></p>\n<p>Given I use route planning tools, and in particular photos, very regularly to create my routes, I figured I’d give this a spin. I find photos incredibly useful in figuring out whether or not a route is:</p>\n<blockquote><p>A) Safe (especially for cycling, but sometimes running/etc…)<br />\nB) The type of road surface/terrain I want: Namely to ensure a road is a road, and gravel is actually gravel-ish, and MTB is something else entirely different<br />\nC) Finding pretty spots to see, life is a journey and all that</p></blockquote>\n<p>It’s largely no accident that most of the epic rides/trail runs/hikes/etc I do look amazing on Strava or Instagram. It’s because I spend time to ensure the views are going to be amazing.</p>\n<p>So, with that, let’s take a look look at how this works. First up, some technical details that are worth noting:</p>\n<blockquote><p>A) Only photos on *BOTH* activities marked as ‘Public’ and profiles marked as ‘Public’ will show up (meaning, if you have a ‘Followers-Only’ profile, your photos are not part of this, even if a given activity is set as full public.</p>\n<p>B) Photos from you within any of your privacy zones are not included either (obviously, since privacy zones are wide swaths of areas, if other people take photos in your zone, that doesn’t matter).</p>\n<p>C) Photos excluded from photo sharing (<a href=\"https://support.strava.com/hc/en-us/articles/12364262598669-Public-Photos-on-Routes\">here</a>) are also excluded here, regardless of whether or not your profile or activity is set to public</p>\n<p>D) Photos should not contain human bodies (cows are OK), faces, or bikes. According to Strava, that’s being filtered out algorithmically.</p>\n<p>E) Included photos will be updated every 48 hours, and photos older than 12 months are being excluded</p>\n<p>F) This update is specifically targeted at desktop (web browser), and specifically for Subscribers</p></blockquote>\n<p>Now, to start, crack open the <a href=\"https://www.strava.com/routes/new\">desktop site</a>, and find a place you want to go. You’ll immediately start to see some bubbles with photos on them. This isn’t all the photos, this is just a few that the Strava gods have deemed noteworthy. Ironically, having been to those locations many times, I’d argue they missed the boat here on places that should actually be highlighted. But hey…algorithms for the win.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning1.png\"><img title=\"StravaRoutePlanning1\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning1_thumb.png\" alt=\"StravaRoutePlanning1\" width=\"722\" height=\"341\" /></a></p>\n<p>No worries, we can set aside Strava’s preference for overly-touristy lake town (Champex), and instead we’ll start from Argentiere, closer in the Chamonix valley. Now, I’ve started the route here and zoomed in, but you’ll notice we only see one new photo spot – this on a trail that should have a ton of spots.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning2.png\"><img title=\"StravaRoutePlanning2\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning2_thumb.png\" alt=\"StravaRoutePlanning2\" width=\"722\" height=\"347\" /></a></p>\n<p>We’ll need to zoom further on Strava, but first, let me show you that same view from Komoot. On their platform, each green dot represents a photo. Thus, it’s easier to see from higher up that there are photos. Hopefully a minor thing Strava can add.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning3-KomootVariant.png\"><img title=\"StravaRoutePlanning3-KomootVariant\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoutePlanning3-KomootVariant_thumb.png\" alt=\"StravaRoutePlanning3-KomootVariant\" width=\"722\" height=\"347\" /></a></p>\n<p>In any case, back on Strava, if you zoom in, then you’ll see all the blue dots – which represent photos. You can hover above one to see animals doing questionable things:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute3.png\"><img title=\"StravaRoute3\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute3_thumb.png\" alt=\"StravaRoute3\" width=\"722\" height=\"345\" /></a></p>\n<p>Spots that have a bunch of photos together are what form those photo bubbles we saw earlier. Basically, Strava is looking at places a ton of people take photos and surfacing those up. In the case of that fake tourist town, a lot of people take photos, thus why it bubbled that up.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute4.png\"><img title=\"StravaRoute4\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute4_thumb.png\" alt=\"StravaRoute4\" width=\"722\" height=\"347\" /></a></p>\n<p>Now, doing some comparison, you can see at that same section of trail that Strava has FAR more photos than Komoot (and the photo pop-up blocks a pile too). For the very random section of trail that’s in-frame, I count 10 on Komoot and 27 (at this zoom level). But, if I zoom in even more on Strava, then even more dots appear. A rough swag for this section shows 50+ photos on Strava, compared to the 10 on Komoot (zooming further didn’t show any more photos on Komoot).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute4-Komoot-Variant.png\"><img title=\"StravaRoute4-Komoot-Variant\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute4-Komoot-Variant_thumb.png\" alt=\"StravaRoute4-Komoot-Variant\" width=\"722\" height=\"344\" /></a></p>\n<p>And this only becomes more apparent as I work my way around this loop. Just so many photos to plan from:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute5.png\"><img title=\"StravaRoute5\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute5_thumb.png\" alt=\"StravaRoute5\" width=\"722\" height=\"347\" /></a></p>\n<p>And then as usual, once you’ve completed your route creation, it’ll show all the photos in a collection, sorted largely by the most recent first. I might <a href=\"https://www.strava.com/routes/3129738638117662938\">actually give this route a roll</a>, looks like a fun trail run/hike.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute6A.png\"><img title=\"StravaRoute6A\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute6A_thumb.png\" alt=\"StravaRoute6A\" width=\"722\" height=\"534\" /></a></p>\n<p>For fun, switching areas entirely, here’s a look at some mostly random farmland on a cycling route I’m gonna do here in a few minutes. Here you can see it’s far more spare (cause, ya know, cows). But, you can see Strava has a bit better coverage (12 on Strava vs 7 on Komoot). Not massively so like up in Chamonix, but notably so. However, that’s only visible when you really zoom down to this level, whereas Komoot makes it far easier to see where the photos are at just about any zoom level.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute7-NetherlandsMapStrava.png\"><img title=\"StravaRoute7-NetherlandsMapStrava\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute7-NetherlandsMapStrava_thumb.png\" alt=\"StravaRoute7-NetherlandsMapStrava\" width=\"353\" height=\"172\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute7-NetherlandsMapKomoot.png\"><img title=\"StravaRoute7-NetherlandsMapKomoot\" src=\"https://media.dcrainmaker.com/images/2023/08/StravaRoute7-NetherlandsMapKomoot_thumb.png\" alt=\"StravaRoute7-NetherlandsMapKomoot\" width=\"357\" height=\"172\" /></a></p>\n<p>In any event, we could do this all day, but that’s basically all you need to know. It works, works well, but really needs to be exposed at a far higher zoom level to make the feature pop. Otherwise you won’t even realize they are there, and will mostly only be drawn to the most crazy-popular of spots. And in the case of that initial Chamonix map, I suspect even Strava’s own Chamonix office would agree those three photo bubble spots are hardly the most scenic places in the greater Mont-Blanc area.</p>\n<p>Still, love the update. Now, off to plan some more routes and get on with my ride.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"67791b907a8b83a9efd0e45c66d43e69845c6b95385a83e06f9b06a386e18cca","category":"Cycling"}