{"title":"How To Create A Rapid Research Program To Support Insights At Scale","link":"https://smashingmagazine.com/2023/07/create-rapid-research-program-support-insights-scale/","date":1689174000000,"content":"<p>While the User Experience practice <a href=\"https://www.nngroup.com/articles/100-years-ux/\">has been expanding and will continue to balloon in the coming years</a>, so have its sub-disciplines such as content strategy, operations, and user research. As the practice of UX Research matures, scalability will continue to be important in order to meet the rapid needs of iterative product development.</p>\n<p>While there are several effective ways to scale user research, such as increasing researcher-to-designer ratios, leveraging big data and real-time analytics, or research democratization, one of the most effective methods is developing a Rapid Research program. In a Rapid Research program, teams are provided quick insight into key problems at an unprecedented operational speed.</p>\n<p>Rapid Research-type support has been around for a while and has <a href=\"https://keylimeinteractive.com/rapid-ux-research/\">taken different shapes across different organizations</a>. What remains true, however, is the goal to <strong>provide actionable insights from end-users at a quick pace that fits within product sprints</strong> and maintains pace with agile development practices. </p>\n<p>In this article, I’m going to unpack what a Rapid Research program is, how to build one in your organization, and underscore the unique benefits that a program like this can provide to your team. Given that there is no singular ‘right way’ to scale insights or mature a user research practice, this outline is intended to provide building blocks and considerations that you may take in the context of the culture, opportunities, and challenges of your organization.</p>\nWhat Is Rapid Research?\n<p>Rapid research is a <a href=\"https://medium.com/mixed-methods/rapid-ux-research-at-google-3b92dd038e30\">relatively recent program</a> where typical user research practices and operations are <strong>standardized and templatized</strong> to provide a consistent, repeatable cadence of insights. As the name suggests, a core requirement of a rapid research program is that it delivers <strong>quicker-than-average insights</strong>. In many teams, this means delivering research on a weekly cadence where a confluence of guardrails, templates, and requirements work to ensure a smooth and consistent process. </p>\n<p>Programs like Rapid Research may be created out of a necessity to keep up with the pace of development while freeing the bandwidth of expert researchers’ time for more <a href=\"https://dscout.com/people-nerds/research-timelines\">complex discovery work that often takes longer</a>. A rapid research program can be a crucial component of any team’s insight ecosystem, balanced against solving different business problems with flexible levels of support.  </p>\n<p><img src=\"https://files.smashing.media/articles/create-rapid-research-program-support-insights-scale/what-makes-rapidresearch.png\" /></p>\n<h3>Scope</h3>\n<h4>Research Methods</h4>\n<p>In order to make research more rapid, teams may consider some research methodologies out of the question in their Rapid Research program. Methods such as longitudinal diary studies, surveys, or long-form interviews might suffer from lower quality if done too quickly. When determining the scope of your rapid research program, ask yourself what methods you can easily templatize and, most importantly, which best <a href=\"https://yetanother.studio/blog/the-organizational-appetite-for-research\">support the needs of your experience teams</a>.</p>\n<p>For example, if your experience teams work on 2-week sprints and need insights in that time, then you will need to consider which research methods can reliably be conducted in 1–2 week increments. </p>\n<h4>Sample Size And Research Duration</h4>\n<p>Methods alone won’t ensure a successful implementation of a rapid research program. You will also need to consider sample size and session duration. Even if you decide usability tests are a reasonable methodology for your rapid research framework, you may be introducing too much complexity to run them with 15+ users within 60-min sessions and analyze all that data efficiently. This may require you to narrow your focus to fewer sessions with shorter duration.</p>\n<h4>Participant Recruitment</h4>\n<p>While there may be fewer and shorter sessions for each study, you also need to consider your participant pool. Recruitment is <a href=\"https://www.userzoom.com/ux-blog/four-top-challenges-ux-teams/\">one of the most difficult aspects</a> of conducting any user research, and this effort must be considered when determining the scope of the program. Recruitment can jeopardize the pace of your program if you source highly specific participants or if they are harder to reach due to internal bureaucracy or compliance constraints.</p>\n<p>In order to simplify recruitment, consider what types of participants are both the <em>easiest</em> to reach and who account for the <em>most</em> use cases or products you expect to be researching. Be careful with this, though, as you don’t want to broaden your customer profiles too much for fear of not getting the helpful feedback you need, as UserZoom says: </p>\n<blockquote>“Why is sourcing participants such a challenge? Well, you could probably find as many users as you like by spreading the net as wide as possible and offering generous incentives, but you won’t necessarily find the ‘right’ participants.”<br /><br />— UserZoom, “<a href=\"https://www.userzoom.com/ux-blog/four-top-challenges-ux-teams/\">Four top challenges UX teams face in 2020 and how to solve them</a>”</blockquote>\n\n<h3>Timing</h3>\n<h4>Why Timing Matters</h4>\n<p>Coupled tightly with scope, the <em>timing</em> of your rapid research end-to-end process will be paramount to the program’s success. Even if you have narrowed the scope to only a handful of research methods with limited sessions at shorter durations and with specific participant profiles, it won’t be ‘rapid’ if your end-to-end project timeline is as long as your average traditional study. Care must be taken to ensure that the project timelines of your rapid research studies are notably quicker than your average studies so that this program feels differentiating and adds value on top of the work your team is already doing. </p>\n<h4>Reconsidering scope</h4>\n<p>If your timelines are about the same, or your rapid cadence is less than 50% more efficient than your average study, consider whether or not you’re being judicious enough in your scope above. Always monitor your timelines and identify where you can speed things up or limit the scope in order to reach a quick turnaround, which is acceptable. One way to support shorter project timelines is through compartmentalization.  </p>\n<h3>Compartmentalization</h3>\n<h4>About Compartmentalization</h4>\n<p>One way to balance scope, timing, and consistency is by breaking up pieces of your average study process into smaller, separate efforts. Consider what your program would look like if you separated project intake from the study kick-off or if discussion guides were not dependent on recruitment or participant types. Splitting out your workflow into separate parts and templating them may eliminate typical dependencies and <a href=\"https://dscout.com/people-nerds/user-research-templates\">streamline your processes</a>.  </p>\n<h4>Ways To Compartmentalize</h4>\n<p>Once you’ve determined the set of research methods and ideal participants to include in your program, you may: </p>\n<ul>\n<li><strong>Templatize the discussion guides</strong> to provide a quick starting point for researchers and cut down on upfront preparation time.</li>\n<li><strong>Create a consistent recruitment schedule</strong> independent of the study method to start before study intake or kick-off to save upfront time.</li>\n<li><strong>Pre-schedule recurring kick-off and readout sessions</strong> to set expectations for all studies while limiting timeline risk when at the mercy of others’ calendars.</li>\n</ul>\n<p>There is a myriad of opportunities to do things differently than your typical research study when you reconsider the relationships and interdependencies in the process.</p>\n<h3>Consistency</h3>\n<h4>Expectability</h4>\n<p>While a quality rapid research program takes into consideration scope, timing, and compartmentalization, it also needs to consider consistency. It would be difficult to discern whether or not the program was ‘rapid’ if, on one week, a study takes one week, and on another week, a study takes 2.5 weeks. Both may be below your current study average. However, project stakeholders may blur the lines between the differences in your rapid studies and your typical studies due to the variability in approach. In addition, it may be difficult to operationalize compartmentalization or rapid recruitment without some form of expected cadence. </p>\n<h4>More Agility</h4>\n<p>As you and your team get used to operating within your rapid cadence, you may identify additional opportunities to templatize, compartmentalize or focus scope. If the program is inconsistent from study to study, it may be more difficult to notice these opportunities for increased agility, hindering your program from becoming even <em>more rapid</em> over time. </p>\nA Rapid Research Case Study\n<p>While working at one of the largest telecommunications companies in the US, I had the privilege of witnessing the growth of the UX Research team from just four practitioners to over 25 by the time I left. During this time, the company had matured its user experience practice, including the standards, processes, and discipline of user research.</p>\n<h4>Identifying The Need</h4>\n<p>As we grew, human insight became a central part of the product development process, which meant an exponential increase in its demand. While this was a great thing and allowed our team to grow, the work we were doing was not sustainable — we were constantly trying to keep pace with product teams who brought us in too late in the process simply to validate their ideas. Not only did we always feel rushed, but we were stuck doing only evaluative work, which not only stifled innovation but also did not satisfy our more senior researchers who wished to do more generative research. </p>\n<h4>How It Fits In</h4>\n<p>Once diagnosing this issue, our leadership initiated several new processes to build a more well-rounded research portfolio that supported iterative research while enabling generative research. This included a democratization program, quarterly planning, and my initiative: Rapid Research. We determined that we needed a program that would allow us to take on mid-sized projects at the pace of product development while providing a new opportunity to hire junior researchers who would be a great talent pool for our team and provide a meaningful way for those new to the field to grow their skills. </p>\n<h4>Getting Started</h4>\n<p>In order to build the rapid research program, I audited the previous year’s worth of research to determine our average timelines, the most common methodologies used for iterative and mid-sized projects, and to identify our primary customer who we do research with most often. My findings would be the bedrock of the program:</p>\n<ul>\n<li>Most iterative research was lite interviews and brief usability tests.</li>\n<li>Many objectives could be covered in 30-minute sessions.</li>\n<li>Mid-sized projects were often with <a href=\"https://www.nngroup.com/articles/why-you-only-need-to-test-with-5-users/\">just a handful of current customers</a>.</li>\n<li>Our average study time was 2–3 weeks, so we’d need to cut this down.</li>\n<li>Given the above constraints, study goals should be highly focused. </li>\n</ul>\n<h4>Building The Program</h4>\n<p>At first, we did not have the budget for hiring new junior researchers to staff the program team. What we did have, however, was a contract with a research vendor who we’ve worked with for years, so we decided to partner with researchers from their team to run our rapid research program.</p>\n<ul>\n<li>We created specific templates for ‘rapid’ usability tests and interviews.</li>\n<li>Studies were capped at two objectives and only a handful of questions in order to fit into 30-min sessions.</li>\n<li>Study intake was governed via a simple intake form, required to be filled out by EOD every Wednesday.</li>\n<li>We scheduled standing kick-off and readout sessions every Friday and shared these invites with product teams for visibility.</li>\n<li>To further establish our senior researchers as Portfolio Research Leads and to protect against scope creep, we required teams to formally request ‘rapid’ studies through them first.</li>\n<li>We started our rapid cadence at two weeks and were able to cut it down to just one week after piloting the program for a month.</li>\n</ul>\n<h4>Strong Results</h4>\n<p>We saw the incredible value and strong results from building our rapid research program, especially alongside the other processes our team was standing up to support varying insights needs.</p>\n<ul>\n<li><strong>Speed</strong><br />We were able to eventually run three research studies simultaneously, enabling us to deliver more research at twice the pace of a traditional study.</li>\n<li><strong>Scale</strong><br />Through this enablement of speed, consistent recruitment, and templatized process, we ran over 100 studies &amp; 650+ moderated interviews.</li>\n<li><strong>Impact</strong><br />Because we outsourced rapid research to a vendor, our team was freed up to deliver foundational research, which doubled our work capacity.</li>\n<li><strong>Growth</strong><br />Eventually, we hired junior researchers and transitioned the program from the vendor, increasing subject matter expertise &amp; operational efficiency.    </li>\n</ul>\nHow To Build A Rapid Research Program\n<p>The following steps outline a process for getting started with building your own rapid research program in your organization. Exactly which steps you choose to follow, or if you decide to add more or less to your process, will be entirely up to you and the unique needs of your team. Follow the proceeding steps while considering the above guidelines regarding scope, timing, compartmentalization, and consistency. </p>\n<p><img src=\"https://files.smashing.media/articles/create-rapid-research-program-support-insights-scale/determining-rapidresearch.png\" /></p>\n<h3>Determine If You Even Need A Rapid Research Program</h3>\n<p>While seemingly counter-intuitive, the first step in building a rapid research program is considering whether you even need one in the first place. Every new initiative or tactic <a href=\"https://dovetail.com/blog/uxr-maturity/\">intended to mature user research practice</a> should consider the available talent and capabilities of the team and the needs or opportunities of the organization it sits within. It would be unfortunate to invest time to build a robust, rapid research program only to find that nobody uses or needs it. </p>\n<h4>Reflection On Current Needs</h4>\n<p>Start by documenting the needs of your experience teams or the organization you support by the different types of requests you receive.</p>\n<ul>\n<li>Are you often asked to deliver research faster?</li>\n<li>What are the types of research which are most often requested?</li>\n<li>Does your team have the capability or operational rigor required to deliver at a faster pace?</li>\n<li>Are you staffed enough to support a more rapid pace, even if you could deliver one?</li>\n<li>Is delivering faster, rigidly-scoped research in service to your long-term goals as a research team, or might it sacrifice them?</li>\n</ul>\n<h4>Gather More Information</h4>\n<p>Answering these questions should be your first step before any meaningful work is done to build a rapid research program. In addition, you might consider the following information-gathering activities:</p>\n<ul>\n<li><strong>Audit previous research</strong> you or your team have done to determine their average scope, timeline, and method.</li>\n<li><strong>Conduct a series of internal stakeholder interviews</strong> to identify what potential value a rapid research program might hold.</li>\n<li><strong>Look for signals for where the organization is going.</strong> If leadership is hiring or training teams on agile methods or demanding teams to take a step back to focus on discovery can help you decide when and where to invest your time.</li>\n</ul>\n<p>These additional inputs will either help you refine your approach to building a program or to steer away from doing so.  </p>\n<h4>Limitations Of Rapid Research</h4>\n<p>Finally, when considering if you should build a rapid research program in the first place, you should consider what the program <em>cannot do</em>. </p>\n<ul>\n<li>What a rapid research program might save on time, it cannot necessarily save on effort. You will still need researchers to deliver this work, which means you may need to restructure your team or hire more people.</li>\n<li>If you decide to make your rapid research program self-service, you likely will still need ResOps support for recruitment and managing the intake process effectively.</li>\n<li>It is also possible to <a href=\"https://www.userzoom.com/ebooks-reports/rapid-ux-research-framework-to-speed-up-agile-decision-making/\">hire a research vendor partner</a> to lead this program, though that will require a budget that not every team may have.</li>\n<li>As mentioned above, a good rapid research program is <a href=\"https://www.userzoom.com/ux-blog/three-tips-to-get-started-with-rapid-ux-research/\">tight and focused in its scope</a>, which limits the type of projects it can accommodate.</li>\n</ul>\n<h3>Identify Your Starting Scope, Timing &amp; Cadence</h3>\n<p>Once you’ve decided to pursue a rapid research program, you’ll need to understand what form your program should take in order to deliver the highest value to your team and those you support. As mentioned above, a right-sized scope should consider the research methods, requirements, session quantity &amp; duration, and participant profiles, which you can confidently accommodate. And you will need to determine the end-to-end timing and program cadence that differentiates from current work while providing just enough time to still deliver sustainable quality. </p>\n<h4>Determine Participant Profiles</h4>\n<p>Start building your scope backwards from the needs gaps you’re filling within your team based on the answers to the discovery questions above. You’ll want to identify the primary type(s) of end-users this program will research.</p>\n<ol>\n<li>Audit the past 6–12 months of research you or your team has done, looking at the most common customer type with whom you do research.</li>\n<li>Then, couple that with any knowledge you may have of where the business or your experience teams will be focused for the following 6–12 months.</li>\n</ol>\n<p>For example, if your audit revealed that your team had focused most frequently on current customers over the past year, and you also know that your business will soon focus on the acquisition of new customers, consider including both current customers and prospective customers in your rapid research scope.</p>\n<p>Remember the important note about consistency above? Once you’ve identified potential participant profiles, make sure you can <em>consistently</em> <em>recruit</em> them. For example, if you use a research panel to source participants for research studies, <a href=\"https://emi-rs.com/2022/09/27/what-is-the-incidence/#:~:text=Incidence%20rate%20allows%20panel%20providers,the%20inverse%20applies%20as%20well.&amp;text=Incidence%20is%20probably%20the%20most%20critical%20factor%20in%20sample%20pricing.\">test the incidence of your participant profiles</a>. If you find they don’t have many panelists with the attributes you need, you might spend too much time in recruitment and jeopardize the speed of the program. </p>\n<p>A balance should be struck between participant profiles that are specific enough to be useful for most projects and those broad enough to reach easily.</p>\n<h4>Determine Research Methods</h4>\n<p>You can conduct the same audit and rough forecasting when determining the research methods your program ought to support but with two additional considerations:</p>\n<ol>\n<li>Team strategy,</li>\n<li>Individual career development.</li>\n</ol>\n<p>User researchers <a href=\"https://www.userinterviews.com/state-of-user-research-2022-report\">tend to focus their work further upstream</a>, where they’re driving product roadmaps or influencing business strategy. This can bode well for your rapid research program if it is focused on evaluative research projects, which are often quicker and cheaper to conduct.</p>\n<p>The ultimate goal is for the rapid research program to be a complement to what your team provides or as an enabler for freeing up their bandwidth so that they can focus on the type of work they want to do more of.</p>\n<h4>Right-size Research Methods</h4>\n<p>Once you’ve determined <em>which</em> research methods you want to include in your rapid research program, consider the level of rigor you need to balance effort and complexity.</p>\n<ul>\n<li>Consider shorter sessions and <a href=\"https://www.nngroup.com/articles/why-you-only-need-to-test-with-5-users/\">testing with fewer participants</a> to keep things manageable within each study.</li>\n<li>While there are a <a href=\"https://www.userinterviews.com/ux-research-field-guide-chapter/research-analysis#:~:text=There%20are%20several%20common%20ways,content%20analysis%2C%20and%20narrative%20analysis.\">number of ways to analyze qualitative data</a>, consider a lite thematic analysis to keep things manageable.</li>\n<li>Instead of building a robust presentation of findings, you may only have time to develop <a href=\"https://dovetail.com/blog/how-to-write-an-executive-summary/\">an effective executive summary</a> of key insights.</li>\n</ul>\n<h4>Determining Timelines</h4>\n<p>Project timelines within a rapid research cadence are directly affected by the above scope decisions for participant profiles and research methodology. Timelines can also compound in highly regulated industries such as healthcare or banking, where you may be required to gather legal &amp; compliance approval on every moderation guide. In order to call this a rapid research program, the end-to-end project timelines need to be shorter than a typical project of a similar scope, or at least feel that way. </p>\n<p><img src=\"https://files.smashing.media/articles/create-rapid-research-program-support-insights-scale/determining-timelines.png\" /></p>\n<ol>\n<li><strong>Scope current minimum effort</strong><br />Start by jotting down the minimum amount of time it takes a researcher on your team to do each sub-step in your current non-rapid research process. Do this for the same participant profiles and methods you want to include in your rapid research program. </li>\n<li><strong>Dependencies</strong><br />Now, identify which sub-steps are dependent on others and think of ways to program them in order to build efficiency. For example, if you need legal approval on every moderation guide before data collection, which takes 2–3 days, see if Legal will commit to a change to a 24-hour SLA for rapid research-specific projects. Another example is if you typically give stakeholders a few days to provide feedback on moderation guides, change this for rapid research projects to cut down dependency time. </li>\n<li><strong>Identify compartmentalization</strong><br />In addition to programming project dependencies, consider the above guidance for compartmentalizing some of the programs in order to remove dependencies entirely, such as with recruitment. Identify what parts of the process don’t have the same dependencies in your rapid research program and can be started earlier. By removing dependencies entirely, you may be able to do several things simultaneously to speed up project timelines.  </li>\n</ol>\n<p>Once you’ve documented your current research process (steps, dependencies, timing) and the changes you need to make to build efficiencies or remove dependencies, document what ‘must be true’ in order to consistently deliver identified changes. Create a table to document all of these details, then sum up the total timelines to compare your typical end-to-end research project timeline with your potential new ‘rapid’ timeline. </p>\n<p>Ask yourself if this seems ‘rapid’ when stacked against your average study duration.</p>\n<ul>\n<li><strong>If not</strong>, look back at the guidance above. Ask yourself if there are other customer types that may be easier to get in front of that you haven’t considered. Consider whether you need to create a new process, expedite existing processes, or create new relationships in order to make your timelines even more rapid. </li>\n<li><strong>If so</strong>, congratulations! You might have just landed on the right scope for your rapid research program. Consider whether this new rapid timeline is something that you can deliver consistently and reliably over time and whether or not you have enough access to participants, and enough budget, to carry out this cadence long-term. </li>\n</ul>\n<h3>Build Infrastructure, Standards &amp; Rules</h3>\n<p>It’s time to set the foundation. Return back to the tables you made above and create an action plan with the following steps and a timeline to build the infrastructure required to bring your program to life. As part of this, you’ll need to establish the rules and standards for communicating with partners. You might consider a playbook and formal scope document to inform others of the ins/outs of the program.  </p>\n<h4>Gather Buy-in</h4>\n<p>Prioritize any work that requires buy-in, generating understanding, or acquiring budget first before spending your time and energy building templates or documentation. You wouldn’t want to create a 20-page scope document outlining the bandwidth for two researchers, a limit to 1 round of stakeholder feedback, and a 24hr SLA for legal approval, only to find out others cannot commit to that.</p>\n<h4>Create Templates</h4>\n<p>You’ll need <a href=\"https://www.userinterviews.com/blog/105-free-uxr-templates-tools-you-already-use\">plenty of templates</a>, tools, and processes specific to the scope of your program.</p>\n<ul>\n<li>If you’re limiting moderation guides to a maximum of 10 questions, then create a specific discussion guide template reflecting that.</li>\n<li>If your data analysis will be sped up by using structured note-taking templates, create those.</li>\n<li>If you’ve determined that all rapid research projects only require an executive summary one-pager, make that too. </li>\n</ul>\n<h4>Staffing</h4>\n<p>As mentioned above, even a drastically reduced version of your typical research processes still requires effort to support. You’ll need to determine, based on the expected scope and cadence of each rapid research project, how many researchers and/or research operations coordinators you’ll need to support the program. While all rapid research programs will require dedicated effort, there are creative ways of staffing the program, such as: </p>\n<ul>\n<li>A dedicated team of 1–2 researchers and 1–2 Ops coordinators to deliver projects with the greatest efficiency and quality.</li>\n<li>A dedicated team of 1–2 researchers who also handle the operations of running the program itself.</li>\n<li>A self-service program, with 1–2 Ops coordinators for supporting anyone doing the research work.</li>\n<li>Outsourcing the entire program to a vendor.</li>\n</ul>\n<p>Work with your leadership, HR, and TA professionals on securing approval for any team restructure, needed headcount budget, or to onboard a new vendor. Then, take the <a href=\"https://dscout.com/people-nerds/hiring-first-ux\">appropriate steps to hire your next researcher</a> or secure the staffing help you need to support your program. </p>\n<h4>Coaching And Guidance</h4>\n<p>Consider training, coaching, and check-in meetings as part of your infrastructure.</p>\n<ul>\n<li>If you are staffing new researchers to this rapid research program, make sure they understand the expectations and have what they need to succeed.</li>\n<li>If you’re implementing a self-service model, provide brown-bag sessions to partners to explain the program do’s and don’ts.</li>\n<li>Schedule quarterly check-ins with partners and leadership to discuss the program accomplishments and any needed adjustments to ensure it stays relevant.</li>\n</ul>\n<h3>Pilot, Get Feedback, And Iterate Over Time</h3>\n<p>No matter how much preparation you do or how much time and effort you spend building the alliances, infrastructure, training, and support required to run your rapid research program effectively, you will learn that there are improvements you should make once you put it into practice. </p>\n<p>There are many benefits to piloting a new program in an organization. <a href=\"https://www.entrepreneur.com/starting-a-business/tasting-as-you-go-the-5-benefits-of-piloting/274426\">One benefit is that it can mitigate risks</a> and allow teams to learn quickly and early enough to make positive enhancements.</p>\n<blockquote>“Piloting offers a realistic preview experience for users at the earliest stages of development. It allows the organization and design team to gather real-time insights that can be used to shape and refine the product and prepare it for commercialization.”<br /><br />— Entrepreneur, “<a href=\"https://www.entrepreneur.com/starting-a-business/tasting-as-you-go-the-5-benefits-of-piloting/274426\">Tasting As You Go: The 5 Benefits of ‘Piloting’</a>”</blockquote>\n\n<p>This means setting expectations early. Consider your first few projects as pilots and expect them to be rocky and imperfect. Use this to your advantage by asking stakeholders you’re closest with to be your trial projects and let them know how important their honest feedback is throughout the process. Ensure that you have clear mechanisms to gather feedback at each project milestone so that you can track progress. It is especially important to capture what might be slowing you down along the way or putting your ‘rapid’ timelines at risk.</p>\nProgram Evolutions, Impacts &amp; Considerations\n<h3>Potential Evolutions &amp; Variations</h3>\n<p>While I’ve outlined a process for getting started, there are many ways in which your rapid research program may evolve over time to meet the needs of your organization better.</p>\n<ul>\n<li>After a few periods, you might identify volume isn’t as high as you anticipated, so you extend the 1-week timeline to every two weeks.</li>\n<li>After a few months, your business might launch a new product line, requiring you to consider a new set of customer profiles in recruitment.</li>\n<li>You may decide to leverage your rapid cadence for individual segments of a longitudinal diary study to accommodate new methods.</li>\n<li>You might use rapid research projects to exclusively evaluate in-market products while others on the team focus on in-progress / new products.</li>\n<li>Rapid research projects could be a stage-gate for larger projects — proving a customer need before larger time investments are made.</li>\n</ul>\n<p>However your rapid research program takes shape, revisit its goals, scope, and operations often in relation to your organizational needs and context so that it remains relevant and delivers the highest impact.  </p>\n<p><img src=\"https://files.smashing.media/articles/create-rapid-research-program-support-insights-scale/impacts-rapid-research-program.png\" /></p>\n<h3>Solid Impacts From Rapid Research</h3>\n<p>Building a rapid research program <a href=\"https://www.uxmatters.com/mt/archives/2022/09/how-rapid-usability-testing-is-changing-ux-research.php\">can have a big impact</a> and can contribute positively toward your team’s long-term strategy. One impact of instituting a rapid research program could be that now your team is freed up to <strong>focus on more generative research</strong>, which unlocks your ability to deliver deep customer insights that pave the way for innovation or strategy. And due to your new rapid pace, you may be able to keep pace with agile development and conduct end-to-end research within 2-week sprints. Another impact is that you may catch <strong>more usability issues further upstream</strong>, <a href=\"https://s3.amazonaws.com/coach-courses-us/public/theuxschool/uploads/The_Trillion_Dollar_UX_Problem.pdf\">saving you over 100x in overhead business cost</a>. A final impact of a rapid research program is that it can <strong>double your team’s throughput</strong>, allowing your team to deliver more research, more frequently, to accommodate more organizational needs. </p>\n<p>Be sure to <a href=\"https://dscout.com/people-nerds/change-canvas-brag-sheet-ux\">track these impacts over time</a> so that you not only get credit for the hard work you put into building the program but so that you can sustain and grow the program over time.</p>\n<h3>Considerations When Building A Rapid Research Program</h3>\n<p>As mentioned in this article, there are many benefits to building a rapid research program. That being said, there are limitations to rapid research in regard to its pros and cons when it should be used, and if you have the available time to stand up a program yourself. </p>\n<h4>Pros And Cons</h4>\n<p>As with building any new program, one should consider both its benefits as well as drawbacks. Here are a few for rapid research programs: </p>\n<p><strong>Pros:</strong></p>\n<ul>\n<li>Can free time for foundational work;</li>\n<li>Rapid studies may keep a better pace with development cycles;</li>\n<li>Can create meaningful opportunities for junior staff;</li>\n<li>Can double project throughput, increasing output volume.</li>\n</ul>\n<p><strong>Cons:</strong>  </p>\n<ul>\n<li>Still requires work and dedicated bandwidth;</li>\n<li>Another thing to diligently track and manage;</li>\n<li>Not great for all types of research studies;</li>\n<li>May cost more money or resources you don’t have.</li>\n</ul>\n<h4>Guidance For Using The Program</h4>\n<p>Rapid Research programs are best for specific types of research which do not take a long time to complete or require rigorous expertise. You may want to educate your partners on when they should expect to use a rapid research program and when they should not.</p>\n<ul>\n<li><strong>Use rapid research when:</strong><ul>\n<li>Agility or quick turnaround is needed;</li>\n<li>You need simple iterative research;</li>\n<li>Stakeholder groups are easier to rally;</li>\n<li>Participants are easy to reach.</li>\n</ul>\n</li>\n<li><strong>Do not use rapid research when:</strong><ul>\n<li>The study method cannot be done quickly without risking quality;</li>\n<li>A highly complex or mixed-methods study is needed;</li>\n<li>A project requires high visibility or stakeholder alignment;</li>\n<li>You have specific, hard-to-reach participants.</li>\n</ul>\n</li>\n</ul>\n<h4>Ramp Up Time</h4>\n<p>While the exact timeline of building a rapid research program varies from team to team, it does take time to do it right. Make sure to plan out enough time to do the upfront work of identifying the appropriate scope, timing, and cadence, as well as gathering consensus from leadership and appropriate stakeholder groups. Standing up a Rapid Research program can take anywhere from 3 months to 1 year, depending on the following: </p>\n<ul>\n<li>Legal and compliance limitations or requirements.</li>\n<li>The number of stakeholder groups you need buy-in from.</li>\n<li>Approval of budget for outside vendors or for hiring an in-house team.</li>\n<li>Time it takes to build templates, guidelines, and materials.</li>\n<li>Onboarding, training, and iteration when starting out.</li>\n</ul>\nConclusion\n<p>A rapid research program can be a fundamental part of your team’s UX Research strategy, enabling your team to take on new insight challenges and deliver efficient research at an unprecedented pace. Building a rapid research program with high intention by determining the goals, appropriate scope, and necessary infrastructure will set your team up for success and enable you to deliver more value for your organization as you scale your user research practice. </p>\n<p>Don’t be afraid to try a rapid research program today! </p>\n<h3>Further Reading On SmashingMag</h3>\n<ul>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/08/ethical-user-research-practice/\">How To Build An Ethical User Research Practice At Any Organization</a>”, Devin Harold</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2021/10/eye-tracking-mobile-ux-research/\">Eye-Tracking In Mobile UX Research</a>”, Mariana Macedo</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/03/pragmatists-guide-lean-user-research/\">A Pragmatist’s Guide To Lean User Research</a>”, Paul Boag</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2023/01/better-roi-digital-products-continous-research/\">Better ROI For Your Digital Products: Why Continuous Research Is Key</a>”, Suzanne Scacca</li>\n<li>“<a href=\"https://www.smashingmagazine.com/2020/12/ethical-considerations-ux-research/\">Ethical Considerations In UX Research: The Need For Training And Review</a>”, Victor Yocco</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"678f640bd1ae69f1f1390cfc1541ffe02b4b3eb3a6daae55698f7f061c6e79ed","category":"Tech"}