{"title":"More evolvable bacteriophages better suppress their host","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13742?af=R","date":1720157389000,"content":"<h2>Abstract</h2>\n<p>The number of multidrug-resistant strains of bacteria is increasing rapidly, while the number of new antibiotic discoveries has stagnated. This trend has caused a surge in interest in bacteriophages as anti-bacterial therapeutics, in part because there is near limitless diversity of phages to harness. While this diversity provides an opportunity, it also creates the dilemma of having to decide which criteria to use to select phages. Here we test whether a phage's ability to coevolve with its host (evolvability) should be considered and how this property compares to two previously proposed criteria: fast reproduction and thermostability. To do this, we compared the suppressiveness of three phages that vary by a single amino acid yet differ in these traits such that each strain maximized two of three characteristics. Our studies revealed that both evolvability and reproductive rate are independently important. The phage most able to suppress bacterial populations was the strain with high evolvability and reproductive rate, yet this phage was unstable. Phages varied due to differences in the types of resistance evolved against them and their ability to counteract resistance. When conditions were shifted to exaggerate the importance of thermostability, one of the stable phages was most suppressive in the short-term, but not over the long-term. Our results demonstrate the utility of biological therapeutics' capacities to evolve and adjust in action to resolve complications like resistance evolution. Furthermore, evolvability is a property that can be engineered into phage therapeutics to enhance their effectiveness.</p>","author":"Elijah K. Horwitz, \nHannah M. Strobel, \nJason Haiso, \nJustin R. Meyer","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"6791677c5e9e5d1d8f79d1e13a6e40d88f048b82a30510259d126d092a3be0d7","category":"Environment"}