{"title":"The management of unused and expired medications in Thai households: Influencing factors and prevailing practices","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309266","date":1724767200000,"content":"<p>by Patranit Srijuntrapun, Kusawadee Maluangnon</p>\r\nObjective <p>Although the improper disposal of unused and expired medications represents a global environmental concern, its significance is often underestimated. This research delves into the practices and factors related to the management of unused and expired medications.</p> Methods <p>Data was collected through a comprehensive survey of Thai households, with 400 structured questionnaires. Multiple regression was then employed to analyze the data.</p> Results <p>Findings show an intriguing paradox. The participants in the survey demonstrated commendable knowledge regarding the appropriate management of unused or expired medications. Yet, this knowledge was not sufficiently put into practice. This study identifies the factors that have a positive influence on proper medication disposal practices, such as age, level of education, attitude, and perception. Surveyed participants exhibited a tendency to retain unused medications and discard expired ones with household waste. Most of them showed a low degree of medication management, pointing to the need for targeted interventions.</p> Conclusion <p>This research provides tangible benefits for policymakers, healthcare practitioners, and researchers addressing waste management paradigms. In terms of policy, the study highlights the need for comprehensive interventions, including medication take-back systems, infrastructure development, and educational initiatives. Policymakers are urged to bridge the gap between knowledge and behavior by promoting access to collection points for proper medication disposal to avoid perpetuating the cycle of suboptimal medication management. This research informs strategies to encourage responsible medication management practices globally, addressing the adverse environmental and health impacts associated with the improper accumulation of medications.</p>","author":"Patranit Srijuntrapun","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"67a14ce4c39b0e57c0913bcb95b7173014839602bc1e49a6e0be7674eea12291","category":"Interdisciplinary"}