{"title":"Evaluation of antioxidant, antimicrobial, and bioactive properties and peptide sequence composition of Malatya apricot kernels","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13632?af=R","date":1717512262000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study used four different apricot (<i>Prunus armeniaca</i>) kernels cultivated in Malatya during two consecutive years. The varieties were Hacihaliloglu, Hasanbey, Kabaasi, and Zerdali. The physicochemical properties of the kernels were determined, and the bioactive content of the kernels was evaluated using kernel hydrolysates prepared using trypsin.</p>\n<h2>RESULTS</h2>\n<p>With regard to the physicochemical properties of the kernels, the dry matter ratio and protein content were the highest in the Hacihaliloglu variety; the ash ratio was the highest in the Kabaasi variety, and the free oil ratio was the highest in the Hasanbey variety. The bioactive compound content changed according to kernel variety. Angiotensin-converting enzyme inhibitors activity was found to be the highest in the Hacihaliloglu and Hasanbey varieties, which had the lowest amygdalin content, and Zerdali had the highest amygdalin content. The antioxidant and antimicrobial effects of the kernels varied, with Hasanbey and Kabaasi generally having the highest content in both analyses. Moreover, a concentration of 20 mg mL<sup>−1</sup> of the hydrolysate was determined to have a destructive effect for the microorganisms used in this study. The storage protein of the kernels, except Hacihaliloglu, was found to be Prunin 1, with the longest matching protein chain in the kernels being R.QQQGGQLMANGLEETFCSLRLK.E.</p>\n<h2>CONCLUSION</h2>\n<p>The results suggest that the peptide sequences identified in the kernels could have antihypertensive, antioxidative, and Dipeptidyl peptidase IV (DPP-IV) inhibitory effects. Consequently, apricot kernels show potential for use in the production of functional food products. Of the kernels evaluated in this study, Hacihaliloglu and Hasanbey were deemed the most suitable varieties due to their higher bioactive content and lower amygdalin content. © 2024 The Author(s). Journal of The Science of Food and Agriculture published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Çağlar Mert Aydın, \nÖmür Çelikbıçak, \nAli Adnan Hayaloğlu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"67b5e4e4624a3e4644266a0d5e9c7bc8d7f66b7b5408200a62e56fb9b6ff3296","category":"Environment"}