{"title":"Working Apple-1 Computer, and Jobs' Leather Bomber Jacket and Other Apple Memorabilia Going up for Auction","link":"https://www.macrumors.com/2021/08/02/apple-1-auction-steve-jobs-memorabilia/","date":1627927675000,"content":"A <a href=\"https://www.rrauction.com/auctions/auction-details/615?page=1&amp;itemQty=24&amp;view=gallery&amp;sort=lot-asc&amp;cat=0\">Steve Jobs and Apple auction</a> coming from Boston-based RR Auction in August will see the sale of several classic Macs and other Apple memorabilia, including a rare Apple-1 computer, an Apple II manual signed by Steve Jobs, a leather bomber jacket worn by Jobs, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/apple-1-computer.jpg\" />\r\n<br />\r\nThe Apple-1 that's going up for sale is from the collection of Roger Wagner, and it was previously sold in April 2002 at the Vintage Computer Festival in 2002. Wagner, who authored the first book on assembly-language programming for the Apple II, is a friend of Steve Wozniak.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nThe Apple-1 was restored to working condition by Apple-1 expert Corey Cohen, and it is functional with a condition rating of 7/10. It comes with the original Apple-1 board, Cassette Interface, cassettes, Panasonic Portable Cassette Tape Recorder and Player, an Apple II keyboard, 11 original Apple-1 Operating Manual pages signed by Ronald Wayne, and more.\r\n<br />\r\n\r\n<br />\r\nApple-1 machines were the first computers produced by Apple and sold by Steve Jobs out of his parents' garage back in 1976. Priced at $666.66, there were originally 175 Apple-1 computers manufactured, but less than half of those are still in existence, so these machines fetch high prices at auction.\r\n<br />\r\n\r\n<br />\r\nBidding on the Apple-1 will start at $50,000, and RR Auction estimates that it could sell for as much as $450,000. Last March, a functional Apple-1 computer <a href=\"https://www.macrumors.com/2020/03/13/apple-1-auction-2020/\">sold for $458,000</a>, though it was in slightly better condition. Some Apple-1 machines have sold for <a href=\"https://www.macrumors.com/2016/08/25/celebration-apple-1-sells-for-815000/\">up to $815,000</a>.\r\n<br />\r\n\r\n<br />\r\nAlong with the Apple-1, RR Auction is selling Steve Jobs' bomber jacket, which <a href=\"https://osxdaily.com/2011/12/30/young-steve-jobs-gives-ibm-the-finger/\">was worn</a> in the 1983 \"middle finger to IBM\" photo, and an Apple II manual that was signed by Steve Jobs and Mark Markkula. Addressed to Julian Brewer, the note in the manual reads \"Julian, Your generation is the first to grow up with computers. Go change the world! Steven Jobs, 1980.\" Julian Brewer is the son of Michael Brewer, who negotiated distribution rights for Apple in the UK in 1979.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/steve-jobs-bomber-jacket.jpg\" />\r\n<br />\r\nRR Auctions expects that the jacket and the manual could fetch prices upwards of $25,000.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/steve-jobs-apple-manual.jpg\" />\r\n<br />\r\nThere are several other bits of Apple memorabilia that are being auctioned off, including a Steve Jobs and Steve Wozniak Signed issue of Macworld, a program signed by Jobs, a letter signed by Jobs, a 128K Macintosh motherboard signed by Jobs and Jef Raskin, a Steve Jobs business card, and more.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/signed-copy-macworld.jpg\" />\r\n<br />\r\n<a href=\"https://www.rrauction.com/auctions/auction-details/615?page=1&amp;itemQty=24&amp;view=gallery&amp;sort=lot-asc&amp;cat=0\">All of the items in the auction</a> will go up for sale on August 13.\r\n<br />\r\n<div>Tag: <a href=\"https://www.macrumors.com/guide/steve-jobs/\">Steve Jobs</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/02/apple-1-auction-steve-jobs-memorabilia/\">Working Apple-1 Computer, and Jobs' Leather Bomber Jacket and Other Apple Memorabilia Going up for Auction</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/working-apple-1-computer-and-jobs-leather-bomber-jacket-and-other-apple-memorabilia-going-up-for-auction.2306291/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=uEHtLJ1yk64:HeXw8Uz0xt4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=uEHtLJ1yk64:HeXw8Uz0xt4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/uEHtLJ1yk64\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"67bc2ce2b4e5301c62ed5bb34b1f209df461f0f41f72fc03775ca22f9f1d4800","category":"Apple"}