{"title":"Soil degradation and herbicide pollution by repeated cassava monoculture within Thailand’s conservation region","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308284","date":1722952800000,"content":"<p>by Ananya Popradit, Yutthana Nakhokwik, Marcel Robischon, Shin-Taro Saiki, Jin Yoshimura, Arichai Wanasiri, Atsushi Ishida</p>\r\n\r\nIn a national park in Northeast Thailand, agricultural land has been converted from natural forest by small-scale farmers for cassava agriculture. We hypothesise that long-termed cassava monoculture leads to the degradation of soil properties. To test the hypothesis, we conducted a five-year (2016–2020) study on the physical and chemical properties of soil in cassava farmland, and also examined the soil properties of its adjacent natural forests, as a control. The examined cassava farmland was converted from the natural forest during the five years from 2011 to 2015. The significant decrease in organic carbon and the increases in exchangeable potassium and bulk density were found in 2016, indicating that these soil properties varied quickly following the farmland conversion. On the other hand, the significant increase in soil nitrogen and the decrease in pH were found later in 2020, indicating that these soil properties were gradually altered by repeated agricultural activities, such as fertilizer application and trampling. In contrast, there were no significant differences in available phosphate, electrical conductivity, cation exchange capacity, and the soil texture (the fractions of sand, silt, and clay) among the forest and farmland soils. The cation exchange capacity was positively correlated to the fraction of clay, the organic carbon, and pH. The use of glyphosate and paraquat herbicides is prohibited within national parks in Thailand. However, in 2020, glyphosate was detected in farmland soil (up to 5.0 mg kg<sup>-1</sup>) during both the rainy and dry seasons, and glyphosate (up to 2.5 mg l<sup>-1</sup>) was detected in stream water from the farmland during the dry season at least in 2020. Soil degradation and herbicide pollution may carry a high risk of causing irreversible changes in terrestrial ecosystems. We discuss the root causes of this issue from perspectives of agricultural production, economy, and the environmental impact, and propose effective policy measures.","author":"Ananya Popradit","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"67c69a98fb87ab9afaa0671f77915e7e0c4ec05780162d9aa57aa06ae7d7bc09","category":"Interdisciplinary"}