{"title":"Video Review: AirPods Pro 2 After Six Months","link":"https://www.macrumors.com/2023/03/08/airpods-pro-2-video-review/","date":1678308548000,"content":"Apple released a second-generation version of the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> back in September 2022, and the updated earbuds have now been available for six months. <em>MacRumors</em> videographer Dan Barbera has been using the ‌AirPods Pro‌ 2 regularly in order to update readers and viewers with a longterm review.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nAs a refresher, the ‌AirPods Pro‌ 2 offer improved Active Noise Cancellation compared to the original version, along with Adaptive Transparency to cut down on sudden, loud sounds like sirens and construction work without blocking out all noise.\r<br />\n\r<br />\nSound quality has been improved with a new audio driver, there's an H2 chip, and Apple swapped over to Bluetooth 5.3. Touch controls are available for adjusting volume, battery life is up, the Apple Watch Charger can be used to charge the earbuds, and a speaker makes it easier to find AirPods lost nearby. Ultimately, there are a lot of improvements, but are the ‌AirPods Pro‌ 2 worth the upgrade over the original ‌AirPods Pro‌?\r<br />\n\r<br />\nDan answers that question and more in his video review that covers durability, Adaptive Transparency, battery life over time, ANC, and other quality of life improvements. Make sure to watch the video, and let us know what you think of the ‌AirPods Pro‌ 2 in the comments below.<br />This article, \"<a href=\"https://www.macrumors.com/2023/03/08/airpods-pro-2-video-review/\">Video Review: AirPods Pro 2 After Six Months</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/video-review-airpods-pro-2-after-six-months.2383143/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"67cb44a9d149fb373ecc6c21f55a0687bc5e6a427a315585ff8f29","category":"Apple"}