{"title":"MBUK Summer 2021 issue on sale now. Subscribe and get a pair of G-Form Sorata Trail Gloves!","link":"https://www.bikeradar.com/news/mbuk-latest-issue-gift/","date":1623153622000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/MBK_396_digiads.1440x958-991aa78.jpg?quality=90&amp;resize=620,413\" />                                            <p>There’s something for everyone in this month’s MBUK. Learn how to pick lines and read the trail for a smoother, faster ride. Read reviews of 12 dropper seatposts, four ‘downcountry’ bikes and six hydration hip packs. The team hang out with all-time legend Steve Peat and find out what he’s been up to since retiring from racing. Jumping at the chance to get out and about again, they ride Wales’s best blue trail, explore Dartmoor, get wild at Black Mountains Cycle Centre and meet the Swinley Forest locals. Plus, you guessed it, much more!</p>\n<ul><li><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to Mountain Biking UK to receive your free gift as well as discounts and more</a></li>\n</ul><h2>How to read the trail like a pro</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Learn to how plan and ride the best lines on every trail. Photo: Steve Behr</span></figcaption><span></span></div>\n<p>Picking the right lines can really level up your riding. For this comprehensive how-to guide, MBUK have teamed up with pro coach Olly Morris to shed some light and what many riders get wrong (and right) about line choice on the trails. Learn how to pick a killer line through the features you’ll come across and properly control your braking and acceleration to ride faster and more efficiently.</p>\n<h2>Downcountry bikes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> We dive deep into the new trend of downcountry bikes. Photo: Steve Behr</span></figcaption><span></span></div>\n<p>In this month’s biketest the team test four downcountry bikes – also known as ‘rad XC’. This new breed of MTB is aimed at those who want to put in the miles and smash an all-day epic, but is also equipped with the right arsenal of kit to chew up more technical trail features – and even the odd jump or two.</p>\n<h2>Dropper seatposts on test</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A bunch of the best droppers get the tested treatment this issue. Photo: Andy Lloyd</span></figcaption><span></span></div>\n<p>Over the decade or so that they’ve been around, dropper posts have completely transformed the way we ride bikes. So much so, in fact, that it’s hard to remember what it was like without them. Being able to adjust your saddle height as you ride has opened up a world of possibilities for us MTBers, but whether you’re adding the first dropper to your bike or upgrading an existing one, which is the most deserving of your cash? 12 posts are put through the mill to find out.</p>\n<h2>Peaty’s pies</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> King in the North: Peaty observes his MTB empire. Photo: Duncan Philpott</span></figcaption><span></span></div>\n<p>Steve Peat is a name every mountain biker should know. This legend of downhill racing once tore it up between the tapes, but what’s he been up to since retiring from the pro scene and settling down in his hometown of Sheffield? A lot, as it turns out. The MBUK team spends a day with Peaty on his home turf and discover that he’s a man with his fingers in many pies.</p>\n<h2>Blues cruise</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Luke and Julia head to Wales to ride the best of the blues. Photo: Andy Lloyd</span></figcaption><span></span></div>\n<p>In the second part of our series to find and ride the UK’s best blue-graded trails, MBUK pedal over the border into Wales. The rugged terrain of this beautiful country has drawn many a mountain biker along its ridges and into its wooded valleys, but which is the best blue Wales has got to offer?</p>\n<h2>And that’s not all…</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Leatt’s new MTB 4.0 Enduro helmet. Photo: Andy Lloyd</span></figcaption><span></span></div>\n<p>This issue of <em>MBUK</em> is jam-packed with all the latest and greatest bikes, product reviews and news stories from the mountain biking world. There are new bikes from Specialized, Santa Cruz and Juliana, along with pages of product reviews that include Leatt’s MTB 4.0 Enduro helmet.</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div>\n<p><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to MBUK</a>, Britain’s best-selling mountain biking magazine – made by riders to inform, excite and entertain other riders – and receive <span>a pair of G-Form Sorata Trail Gloves</span><span>!</span></p>\n<p>Since MBUK’s first issue in 1988, it’s blazed a trail all of its own, combining unrivalled product testing with easy-to-understand skills tips and maintenance advice, inspiring route guides, entertaining riding features and stunning photography from the world’s best snappers – and all while never taking things too seriously.</p>\n<section><div>\n        <h2>Why subscribe?</h2>\n<ul><li>Save 25%* on the shop price: only £24.99 every 6 issues</li>\n<li>Get a pair of <span>G-Form Sorata Trail Gloves!</span></li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an action-packed issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Zone!</li>\n</ul><p>\n\n    </p></div>\n    </section><p>You can <a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW396&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=peaty_MBW396&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">subscribe to MBUK here</a> and check out our <a href=\"https://www.facebook.com/MBUKMag/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/mbukmagazine/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/mbukmagazine?lang=en\" target=\"_blank\">Twitter </a>accounts for all of the latest mountain bike action.<br />\nAnd don’t forget to sign up to the <a href=\"http://www.mbuk.com/newsletter\" target=\"_blank\">newsletter!</a></p>\n<p>*Offer open to new UK customers subscribing to the print edition by direct debit only. Full details of the Direct Debit Guarantee will be provided and are available on request. Please allow 28 working days for delivery of your gift. You will receive 13 issues per year. Your subscription will start with the next available issue. 25% saving based on buying 13 issues at full UK shop price. In the unlikely event your selected gift is unavailable, we reserve the right to send an alternative gift. Offer ends: 06/07/21.</p>","author":"Chris Barnard","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"67d19d996ac4648fda659dc65920895b64c932e835479993731dca80f45ed48d","category":"Cycling"}