{"title":"NASA has selected its deep space hardware—now comes the fun part","link":"https://arstechnica.com/?p=1762028","date":1620164102000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/49957246092_b8eb48be77_k-800x552.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/49957246092_b8eb48be77_k.jpg\">Enlarge</a> <span>/</span> NASA's Kathy Lueders, left, and SpaceX's Hans Koenigsmann track the Demo-2 crew mission in 2020. SpaceX is helping to enable NASA to think less about transportation and more about exploration. (credit: NASA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>No NASA official would ever admit this in public, but the 2010s have been a frustrating decade for human spaceflight.</p>\n<p>After the space shuttle retired in 2011, as most everyone knows, NASA had no way to get its astronauts into space. But the frustrations ran deeper. Even as the agency scrambled to launch into low Earth orbit, it was tasked with sending astronauts further afield into deep space—to the Moon and Mars. So NASA has spent seemingly forever developing \"capabilities\" to get there, and observers often felt like NASA was spinning its wheels. Agency officials frequently talked about going to the Moon and Mars, but that was all they did—<em>talk</em>.</p>\n<p>Now, however, things are starting to change. We are still in early days, but there is increasing agreement at NASA about the need to focus less on transportation—the \"how\" of getting there—and more on what to do when astronauts get to their destinations. This is because, as the transportation pieces fall in line, NASA can think about actual exploration.</p></div><p><a href=\"https://arstechnica.com/?p=1762028#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762028&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"67d5afb7de1f7a1cf0f53b40e797f8117460148441e11153f7e240e820f71ffd","category":"Tech"}