{"title":"New Öhlins RXC34 m.1 fork and TXCAir shock work together for superior handling","link":"https://www.bikeradar.com/news/ohlins-rxc34-m1-fork/","date":1686225617000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/06/JeffThoren-Ohlins-038-3515548.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Ohlins RXC34 m.1 suspension fork and TXC2Air rear shock\" title=\"New Ohlins RXC34 and TXCAir\" />                                            <p>Öhlins has announced the release of its new RXC34 m.1 fork and TXCAir shock. It means the brand finally has a thoroughbred cross-country race product to complete its line-up.</p>\n<p>Building on the racing success of its downhill and enduro forks, the components in the new XC range have been designed to work together. They’re claimed to boast superior handling and precise steering to enable riders to push their limits on ever more technical XCO World Cup tracks with the latest <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">XC race bikes</a>.</p>\n<p>The new suspension units feature several new technologies, including serial shim stacks, an updated two-chamber air-spring design and the option of a carbon CSU (crown steerer unit).</p>\n<p>They also build on the success of Öhlins’ existing line-up, with proven twin-tube technology featuring in the TXCAir shock. The fork has the brand’s signature stiff chassis and floating axle, combined with a lightweight, single-tube OTX14 damper.</p>\n<p>Combined with its partnership with Team BMC Racing, it’s clear these new products have both eyes fixed on the 2024 Paris Olympics, too.</p>\n<section><div>\n        \n<h4>Five things you need to know</h4>\n<ul><li>TXCAir rear shock is available in a lighter, slimmer &amp; more progressive TXC1Air or a larger-volume, more versatile TXC2Air configuration</li>\n<li>RXC34 m.1 fork available with either alloy or one-piece carbon CSU</li>\n<li>The fork and shock have three ride modes, ‘open’, ‘pedal’ and ‘lock’, developed and tested to save seconds on the race track</li>\n<li>Fork and rear shock available with manual or remote control damping options (TXC1Air is only available with remote as standard – can be converted to manual with aftermarket kit)</li>\n<li>Manual damping adjust options add 12 clicks (fork) or 16 clicks (shock) of LSC (low speed compression) adjustment for the ‘open’ mode</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>RXC34 m.1 fork specification and details</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Close up of Ohlins RXC34 m.1 fork in greenery\" title=\"New Ohlins RXC34 m.1 &amp; TXCAir\" /></div><div><figcaption><span><i></i> The RXC34 m.1 shares its lower legs with the RXF34 m.2 trail/downcountry fork.</span></figcaption><span> <i>Ohlins</i></span></div>\n<p>The new RXC34 m.1 fork takes the same basic chassis of the RXF34 m.2 downcountry/trail fork and optimises it for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-country-racing-guide/\">XC racing</a>.</p>\n<p>It retains the chunky lower legs with the brand’s signature floating axle and broad 34mm stanchions. However, the rest of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\">suspension fork</a> has been reworked to reduce weight and improve efficiency, making it better suited to racing.</p>\n<p>The air spring has been redesigned with an updated two-chamber design. These are adjusted via a single air valve, but both the positive and negative chambers can be adjusted with volume spacers.</p>\n<p>The positive chamber can take up to five spacers to adjust progressivity depending on the travel choice, while uniquely, the negative chamber can also be adjusted with up to seven spacers to adjust the initial feel of the fork over small bumps.</p>\n<p>Riders can choose between <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-much-suspension-travel-do-i-need-on-my-mountain-bike/\">110 or 120mm travel</a> on both the carbon or alloy CSU options. Both have the ability to be upped to 130mm with a separate aftermarket air spring.</p>\n<h3>Carbon steerer option</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ohlins RXC34 m.1 carbon steerer tube csu\" title=\"New Ohlins RXC34 and TXCAir\" /></div><div><figcaption><span><i></i> The fork is available with this new one-piece carbon steerer tube or a slightly cheaper, traditional two-piece alloy option.</span></figcaption><span> <i>Jeff Thoren / Ohlins</i></span></div>\n<p>The RXC34 m.1 carbon fork uses a new one-piece carbon fibre CSU to drop a claimed 102g over the alloy version.</p>\n<p>Riders can also opt for a fixed 100mm-travel ‘race’ fork, which drops a further 20g. An alloy CSU version, also with 100mm travel, will be available in future and 130mm incarnations of the fork will be available for OEM manufacturers.</p>\n<p>The result is a fork that’s right in the ballpark of the current 35mm <a href=\"https://www.bikeradar.com/advice/buyers-guides/rockshox-suspension-fork-guide/\">RockShox SID</a>, with a weight of 1,496g for the 110/120mm variant. The cheaper alloy fork, which shares an identical chassis to the RFX34 m.2, comes in at 1,598g.</p>\n<h3>New OTX14 damper</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Close up of Ohlins RXC34 m.1 OTX14 damper with remote lockout\" title=\"New Ohlins RXC34 and TXCAir\" /></div><div><figcaption><span><i></i> The new OTX14 damper is close to 100g lighter than Öhlins’ OTX18 damper, and can be controlled remotely or via a crown-mounted dial</span></figcaption><span> <i>Jeff Thoren / Ohlins</i></span></div>\n<p>Also new for the RXC34 m.1 is the OTX14 damper.</p>\n<p>It has rearranged shim stacks to control the oil flow between the damping circuits, which Öhlins claims have been optimised to help the fork absorb the terrain efficiently, as well as maintaining rider momentum. These are both key attributes for XC racing success.</p>\n<p>Öhlins says it is smaller and lighter than the OTX18 damper found in the RXF34 m.2 and features three ride modes: open, pedal and lockout.</p>\n<p>These have been developed and tested to save crucial seconds on the race track.</p>\n<p>For riders who want to maximise those saved seconds, there is the option of a remote lockout that twins with the remote versions of the TXCAir shocks.</p>\n<p>If you’re less worried about seconds saved and want more adjustment, the crown-top manually adjusted versions have 12 clicks of low-speed compression adjustment for the open mode, giving you more tuning options compared to the fixed open setting of the remote variant.</p>\n<p>Both manual and remote versions have 12 clicks of rebound adjustment at the bottom of the right fork leg.</p>\n<p>Because the basic chassis is shared with the RXF34 m.2, the OTX14 damper and new air spring are backwards compatible between the two. If you wanted, you could fit the even more adjustable OTX18 damper into the RXC34 m.1.</p>\n<h2>TXCAir specification and details</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"New Ohlins TXC1Air and TXC2Air rear shocks\" title=\"New Ohlins RXC34 m.1 &amp; TXCAir\" /></div><div><figcaption><span><i></i> Öhlins will offer two new rear shocks – the smaller, lighter TXC1Air and slightly larger, more versatile TXC2Air.</span></figcaption><span> <i>Ohlins</i></span></div>\n<p>Alongside the RXC34 m.1 fork, Öhlins has developed two TXCAir shocks, the TXC1 and TXC2.</p>\n<p>The TXC1 is lighter at a claimed 245g thanks to the slimmer (than the TXC2) body and air can, which also makes it more progressive. The TXC2, on the other hand, has a bigger body and air can in order to make it a little more versatile and more resistant to heat build-up.</p>\n<p>Both share the same twin-tube damper design, with three ride modes to match up with the fork. As with the fork, the manually adjusted version of the TXC2Air gets 16 clicks of low-speed compression adjustment for the open setting. The remote versions do without this additional adjustment.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ohlins TXC2Air rear shock eyelet and adjustment\" title=\"JeffThoren-Öhlins-050\" /></div><div><figcaption><span><i></i> As well as a remote version, the TXC2Air has the option of a manual lever, with additional low-speed compression adjustment for the open mode.</span></figcaption><span> <i>Jeff Thorens / Ohlins</i></span></div>\n<p>Also like the fork, the shocks have 12 clicks of rebound adjustment, though the rebound dial requires a 3mm Allen key to make any changes, rather than being tool-free.</p>\n<p>To twin the remote fork and shock together, Öhlins has developed a handlebar-mounted remote to control the settings on the fly. Unlike Scott’s similar TwinLoc system, the Öhlins remote has a separate mount for a dropper post, to which you can mount your own dropper lever.</p>\n<p>Both shocks can be adjusted easily with spacers for air can volume and shock stroke. Öhlins says both can be done without removing the shock from the bike, in order to make it as user-friendly as possible.</p>\n<h2>First ride impressions</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rider descends mountain bike trail on specialized bike\" title=\"JeffThoren-Öhlins-001\" /></div><div><figcaption><span><i></i> Sigtuna Bike Arena’s XCO Course was a great testing ground, with a lot of features crammed into minimal elevation gain.</span></figcaption><span> <i>Jeff Thoren / Ohlins</i></span></div>\n<p>I attended the launch of the RXC34 m.1 and TXCAir at Öhlins’ headquarters in Sweden and rode them at the nearby Sigtuna Bike Arena’s excellent XCO course. This provided a wide range of riding despite its lack of elevation.</p>\n<p>Most of the day was spent on a <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/specialized-epic-evo-expert-review/\">Specialized Epic EVO</a>, equipped with the RXC34 m.1 Carbon fork and TXC2Air shock, with both twinned to Öhlins’ remote lockout lever.</p>\n<p>I started with the fork and shock at 83 and 200psi respectively for my 80kg weight and set the rebound on both to six clicks from closed, right in the middle of the range.</p>\n<p>Initial impressions of the fork were very impressive. Right from the off, it became clear sharing the lower legs with the RXF34 m.2 gives it a very stiff and precise feel. Even when launching off drops and into rock gardens, it remained bang on track and pointing exactly where I wanted it.</p>\n<p>Damping control and comfort were also excellent. The fork was supple enough over smaller bumps and had plenty of support in the turns or when I got a little nose-heavy on some of the course’s awkward low-speed drops.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Rider climbs trail on specialized mountaim bike\" title=\"New Ohlins RXC34 m.1 &amp; TXCAir\" /></div><div><figcaption><span><i></i> Short, sharp climbs littered the course, offering a chance to see how efficient the new suspension felt under power.</span></figcaption><span> <i>Jeff Thoren / Ohlins</i></span></div>\n<p>The TXC2Air shock took a little more tinkering. On the first loop, it felt as if it was riding a little deep in its stroke on the rougher, flatter sections of the course, despite a modest 28 per cent sag.</p>\n<p>It felt impressive pointed downhill, with a wonderfully supple feel. However, I was getting a lot of pedal strikes on the many rock-infested climbs and flat pedally sections and it didn’t feel the peppiest under power.</p>\n<p>Because I didn’t want to lose the excellent small-bump compliance and was short on time to experiment with the shock’s volume spacers, I instead went two clicks faster on the rebound to see if it would help the bike ride a little higher and not pack down on smaller, chattery hits.</p>\n<p>This had the desired effect and the shock felt livelier, sat higher and was responding more like I wanted it to.</p>\n<p>Given I was riding an unfamiliar bike on trails I’d never ridden before, it’s impossible to give a complete review of how the fork and shock performed. I’m particularly keen to try the non-remote versions to see how the additional low-speed compression adjustment can alter the ride.</p>\n<p>Even from a short three-hour test ride though, initial impressions are excellent. It’s incredible that modern XC forks and shocks are so capable, performing way beyond the XC suspension of yesteryear.</p>\n<p>I’m certainly looking forward to spending more time on them in the coming months, once we have them for longer-term testing. Stay tuned for a full review in the coming months.</p>\n\n<p> </p>\n<h2>Öhlins RXC34 m.1 fork and TXCAir shock spec details</h2>\n<h3>Öhlins RXC34 m.1 Carbon</h3>\n<ul><li><strong>Price:</strong> £1,485/€1,695/$1,390</li>\n<li><strong>Damper:</strong> OTX14 – manual or remote adjust</li>\n<li><strong>Travel:</strong> 100mm (race version)/110mm/120mm (110/120mm versions can be upped to 130mm with aftermarket air spring)</li>\n<li><strong>Wheel size:</strong> 29in</li>\n<li><strong>Offset:</strong> 44mm</li>\n<li><strong>Weight:</strong> from 1,476g (100mm race)</li>\n</ul><h3>Öhlins RXC34 m.1</h3>\n<ul><li><strong>Price:</strong> £1,310/ €1,495/$1,190</li>\n<li><strong>Damper:</strong> OTX14 – manual or remote adjust</li>\n<li><strong>Travel:</strong> 110mm/120mm (can be upped to 130mm with aftermarket air spring)</li>\n<li><strong>Wheel Size:</strong> 29in</li>\n<li><strong>Offset:</strong> 44mm</li>\n<li><strong>Weight:</strong> 1,598g</li>\n</ul><h3>Öhlins TXC1Air</h3>\n<ul><li><strong>Price:</strong> £609/ €695/$565</li>\n<li><strong>Damper:</strong> Twin-tube with 3 modes – remote adjust only (can be adapted to manual with aftermarket kit)</li>\n<li><strong>Sizes:</strong> 165/190mm x 37.5/40mm and 185/210mm x 47.5/50mm</li>\n<li><strong>Weight:</strong> from 245g</li>\n</ul><h3>Öhlins TXC2Air</h3>\n<ul><li><strong>Price:</strong> £609/€695/$565</li>\n<li><strong>Damper:</strong> Twin-tube with 3 modes – manual or remote adjust</li>\n<li><strong>Sizes:</strong> 165/190mm x 37.5/40/42.5/45mm and 185/210mm x 47.5/50/52.5/55mm</li>\n<li><strong>Weight:</strong> from 255g</li>\n</ul>","author":"Tom Law","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"67dec1fda41a614ce6c2c89ffa36b7ee8d9d58e0c16873f0e34426732c500095","category":"Cycling"}