{"title":"Carbon storage in rare ecosystems relative to their encroaching forests in western Lower Michigan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305394","date":1718632800000,"content":"<p>by M. Megan Woller-Skar, Alexandra Locher, Ellen M. Audia</p>\r\n\r\nRising atmospheric carbon dioxide levels are impacting global temperatures, ecological systems, and human societies. Natural carbon sequestration through the conservation of soil and native ecosystems may slow or reduce the amount of CO<sub>2</sub> in the atmosphere, and thus slow or mitigate the rate of global warming. Most of the research investigating carbon sequestration in natural systems occurs in forested ecosystems, however rare ecosystems such as coastal plain marshes and wet-mesic sand prairie collectively may serve as significant carbon sinks. Our objectives were to measure and assess the importance of carbon sequestration in three rare ecosystems (oak-pine barrens, coastal plain marsh, and wet-mesic sand prairie) in western Lower Michigan. We measured carbon in standing vegetation, dead organic matter, and soils within each ecosystem and adjacent encroaching forested areas. Driven by tree carbon, total carbon stocks in encroaching areas were greater than in intact rare ecosystems. Soil organic carbon was greater in all intact ecosystems, though only significantly so in coastal plain marsh. Principal components analysis explained 72% of the variation and revealed differences between intact ecosystems and their encroaching areas. Linear models using the ratio of red to green light reflectance successfully predicted SOC in intact coastal plain marsh and wet-mesic sand prairie. Our results infer the importance of these rare ecosystems in sequestering carbon in soils and support the need to establish federal or state management practices for the conservation of these systems.","author":"M. Megan Woller-Skar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"67e1e5e9c1a2c04f1e039bcde7b8db086e6c778f1d3e906c90b7c3f014aaf8e6","category":"Interdisciplinary"}