{"title":"Gold and space gray could make a comeback on the iPhone 16 Pro","link":"https://www.macworld.com/article/2241884/iphone-16-pro-colors-desert-yellow-cement-gray.html","date":1708436073000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Every year Apple does its best to disguise the comparatively minor upgrades in its new iPhones by focusing on cosmetic changes—namely color finishes that haven’t previously been available to set the latest phones apart from their predecessors. The iPhone 13 Pro came in a new green and light blue, the 14 Pro gained purple, and the 15 Pro got all-new titanium finishes last year.</p>\n\n\n\n<p>There are still more than six months to go until Apple unveils the iPhone refresh for 2024, but we’ve just had our first clue to the new colors that will be made available for the iPhone 16 Pro and 16 Pro Max when they launch later this year. According to Twitter tipster <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/majinbuofficial/status/1759581161423044677&amp;xcust=1-1-2241884-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Majin Bu</a>, the costlier models “could” come in Desert Yellow and Cement Gray—although he stresses that this information should not be taken as 100% accurate.</p>\n\n\n\n<p>If neither of those sound especially appealing, the leaker clarifies that Desert Yellow (or Desert Titanium) is “similar to the gold of the iPhone 14 Pro but deeper and heavier,” whereas Cement Gray (or Titanium Gray) is “a shade of space gray similar to that used on iPhone 6.”</p>\n\n\n\n<figure><div>\n<blockquote><p>Based on the information I was able to find, the new colors of the iPhone 16 Pro could be<br />Desert Yellow (Desert Titanium) similar to the gold of the iPhone 14 Pro but deeper and heavier<br />Cement Gray (Titanium Gray) a shade of space gray similar to that used on iPhone 6. Other… <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/BWlYwAquS8&amp;xcust=1-1-2241884-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/BWlYwAquS8</a></p>— Majin Bu (@MajinBuOfficial) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/MajinBuOfficial/status/1759581161423044677?ref_src=twsrc%5Etfw&amp;xcust=1-1-2241884-1-0-0&amp;sref=https://www.macworld.com/feed\">February 19, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>New iPhone colors sometimes appear halfway through a model’s first year on the market, serving as a <a href=\"https://www.macworld.com/article/1532375/yellow-iphone-color-launch-spring-holding-back.html\">sly trick</a> to bump sales as they begin to flag. That doesn’t appear to be the case here: there’s no mention of a delay to these finishes going on sale, nor would we expect to hear about the spring 2025 color options this early.</p>\n\n\n\n<p>For all the latest news and rumors about the late-2024 iPhones, check out our regularly updated <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">iPhone 16 superguide</a>. If you can’t wait until the fall, pick up a bargain on one of the current models with our guide to the <a href=\"https://www.macworld.com/article/672801/best-iphone-deals.html\">best iPhone deals</a>.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"67e8bc0251abae2cbbe9f27ba421349cb2417d7c5d435fc52e25b3dcc95c43db","category":"Apple"}