{"title":"A re‐assessment of the Resource Curse Hypothesis in top resource‐rich developing countries: Fresh insights using method of moments quantile regression","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12486?af=R","date":1715770131000,"content":"<h2>Abstract</h2>\n<p>Whether mineral and natural resources (NR) are a blessing or a curse for economic growth (ECON_G) is still a debatable issue among scholars and policymakers. Therefore, the primary goal of the present study is to investigate the relationship between mineral resources (MR), NR, and ECON_G to re-assess the “Resource Curse Theory.” For this purpose, a panel of six top resource-rich developing economies (China, Brazil, Russia, Iran, the Republic of the Congo, and Saudi-Arabia) over the 1995 to 2021 period is analyzed using dynamic ordinary least square, fully modifies ordinary least square and method of moments quantile regression approaches. The basic findings of the above-mentioned techniques reveal the significantly positive impact of both NR and MR on ECON_G in the selected economies. The estimation outputs of the method of moments quantile regression also reveal the significant positive contribution of these resources in ECON_G at all quantiles (0.10–0.90). Thus, the study finds that the Resource Bless Hypothesis is valid as both NR and MR support the absence of the Resource Curse Hypothesis in these countries. Furthermore, the findings of the Granger Causality test reveal that bidirectional causal association is present between NR and ECON_G and MR and ECON_G. The study recommends that policymakers and governments in the resource-rich countries should promote the development of the mining sector and sustainable resource extraction by properly monitoring the resource sector. More importantly, implementing resource governance initiatives are needed to be prioritized for transforming resources as a blessing for the studied countries.</p>","author":"Shiru Sun, \nFei Meng, \nMuhammad Atif Nawaz, \nSobia Hanif","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"67f51c38db9fd901ff4b749212a15ae3abed09456a2bb71b5ec4cc5767b06c50","category":"Environment"}