{"title":"New robot searches for solar cell materials 14 times faster","link":"https://arstechnica.com/?p=1962336","date":1692889790000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Photo_inaction_2Artboard-1-copy-800x530.jpeg\" alt=\"Image of a robotic printer and some samples it has prepared.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Photo_inaction_2Artboard-1-copy.jpeg\">Enlarge</a> <span>/</span> RoboMapper in action. (credit: Aram Amassian)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Earlier this year, two-layer solar cells <a href=\"https://arstechnica.com/science/2023/07/perovskite-silicon-solar-panels-hit-efficiencies-of-over-30/\">broke records</a> with 33 percent efficiency. The cells are made of a combination of silicon and a material called a perovskite. However, these tandem solar cells are still far from the theoretical limit of around 45 percent efficiency, and they degrade quickly under sun exposure, making their usefulness limited.</p>\n<p>The process of improving tandem solar cells involves the search for the perfect materials to layer on top of each other, with each capturing some of the sunlight the other is missing. One potential material for this is perovskites, which are defined by their peculiar rhombus-in-a-cube crystal structure. This structure can be adopted by many chemicals in a variety of proportions. To make a good candidate for tandem solar cells, the combination of chemicals needs to have the right bandgap—the property responsible for absorbing the right part of the sun’s spectrum—be stable at normal temperatures, and, most challengingly, not degrade under illumination.</p>\n<p>The number of possible perovskite materials is vast, and predicting the properties that a given chemical composition will have is very difficult. Trying all the possibilities out in the lab is prohibitively costly and time-consuming. To accelerate the search for the ideal perovskite, researchers at North Carolina State University decided to enlist the help of robots.</p></div><p><a href=\"https://arstechnica.com/?p=1962336#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962336&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6801e7f2eae5bc816608f493a573a0f4bc44adfdcb03cfbb25cbfbe875724323","category":"Tech"}