{"title":"Luxo, Jr. and Mystique inspire novel approaches to shapeshifting materials","link":"https://arstechnica.com/?p=1806822","date":1634940343000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/shapeshifting-materials-composite-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/shapeshifting-materials-composite.jpg\">Enlarge</a> <span>/</span> Harvard scientists built \"Totimorphic\" structural materials that can adopt and maintain any possible shape. Scientists at Case Western Reserve University and Tufts University are exploring shapeshifting liquid crystals. (credit: Aurich Lawson/Harvard/Case Western Reserve)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Luxo, Jr., <a href=\"https://en.wikipedia.org/wiki/Luxo_Jr.\">Pixar's trademark</a> animated Luxo balanced-arm lamp, is based on a classic design known as the <a href=\"https://en.wikipedia.org/wiki/Anglepoise_lamp\">anglepoise lamp</a>, invented by British designer George Carwardine in 1932. Almost ninety years later, the anglepoise lamp has helped inspire a novel approach to building multifunctional shapeshifting materials for robotics, biotechnology, and architectural applications, according to <a href=\"https://www.pnas.org/content/118/42/e2107003118\">a new paper</a> published in the Proceedings of the National Academy of Sciences.</p>\n<p>Meanwhile, physicists at Case Western Reserve University and Tufts University have stumbled on another promising approach to creating novel shapeshifting materials. The researchers remotely manipulated the ordinarily flat surface of a <a href=\"https://en.wikipedia.org/wiki/Liquid_crystal\">liquid crystal</a> without any kind of external stimulus (such as pressure or heat), changing its physical appearance merely with the nearby presence of a bumpy surface. It's early days, but the researchers suggest their approach could someday enable materials that can shapeshift with the ease of <em>The X-Men</em>'s Mystique. They described their work in <a href=\"https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.126.057803\">a new paper</a> published in the journal Physical Review Letters.</p>\n<p>Developing novel shapeshifting materials is a very active area of research because there are so many promising applications, such as building artificial muscles—manmade materials, actuators, or similar devices that mimic the contraction, expansion, and rotation (torque) characteristics of the movement of natural muscle. For instance, in 2019, a team of Japanese researchers <a href=\"https://arstechnica.com/science/2019/07/watch-this-paper-doll-do-sit-ups-thanks-to-new-kind-of-artificial-muscle/\">spiked a crystalline organic material</a> with a polymer to make it more flexible, demonstrating their proof of concept by using their material to make an aluminum foil paper doll do sit-ups. Most artificial muscles are designed to respond to electric fields (such as <a href=\"https://en.wikipedia.org/wiki/Electroactive_polymers\">electroactive polymers</a>), changes in temperature (such as <a href=\"https://en.wikipedia.org/wiki/Shape-memory_alloy\">shape-memory alloys</a> and <a href=\"https://science.sciencemag.org/content/343/6173/868\">fishing line</a>), and changes in air pressure <a href=\"https://en.wikipedia.org/wiki/Pneumatic_artificial_muscles\">via pneumatics</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1806822#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1806822&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"680fd09cffedb9c4e1602e5e097c6e682dc53906e9e02864a29452c3583845c5","category":"Tech"}