{"title":"Emma Norsgaard: \"If you have a happy head, you have fast legs\"","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/emma-norsgaard","date":1635950788000,"content":"\n      <p><span>In her first season in the World Tour, Emma Norsgaard has well and truly earned her place. The 22-year-old signed for Movistar after Equipe Paule Ka — where she had spent her career until then — folded at the end of 2020 and has earned multiple wins and podiums for the Spanish squad. </span></p>\n<div></div>\n<p><span>Speaking ahead of her appearance at Rouleur Live, Norsgaard said the secret to her success is the team environment: “I'm in a really nice environment right now where I feel safe, I feel wanted,” she says. “I feel like the teammates are my really good friends and it's almost like a new little family in Movistar. I think if you have a happy head you have fast legs and this is, especially for me, something that counts. My mental side need to be on point because, if it's not, it's not really working for me and the legs don't work either.” </span></p>\n<p><span>When we speak, Norsgaard seems to have that side working pretty well. She is well into her off season and is preparing for her wedding to fellow cyclist Mikkel Bjerg, which at the time was days away. “The year couldn't end better than getting married to Mikkel,” she says, “I'm super excited. I mean, a little bit stressed with all the planning, but it's going to be so great.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/pages/rouleur-live\">Meet Emma Norsgaard at Rouleur Live 2021</a></em></strong></p>\n<p><span>The Danish rider’s last race of 2021 was the inaugural Paris Roubaix Femmes, where she placed 6th. “It was such a great race,” she recalls, “and it was like we all expected it was super crazy. And then on the cobblestones [it was] super unpredictable. I just felt in the peloton before the race that everyone was super scared. And, and that also led to a lot of tension in the peloton before the first cobbled section so it was a bit crazy and a wild race, but that's how I like it, so I shouldn't complain.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_6115-_1_1024x1024.jpg?v=1635945480\" /><em><span>Emma Norsgaard after Paris-Roubaix Femmes (Image: Peter Stuart)</span></em></span></p>\n<p><span>Having experienced the Roubaix cobbles for the first time, Norsgaard is confident about the next edition: “the race is a lot of hard work also but definitely for next year it's one of my biggest goals, I really want to go for the victory,” she says. “It suits me really well and of course, if I have a little bit of luck, I think I could do a nice result next year, hopefully.” </span></p>\n<p><span>For the majority of the 2021 season, Norsgaard has been pitted against Dutch sprinter Lorena Wiebes with whom she frequently comes head-to-head in sprints. The Danish rider insists that it is an amicable rivalry, however: “we're not enemies at all, we have known each other for many years, me and Lorena, we also did the junior races against each other,” she says. “Yes, she's always been someone I have compared myself to and and still are comparing myself to in every race, because we can almost do the same, she's just just a little bit better than me in the sprints. It's definitely a good rivalry, I would say. It motivates me to see Lorena doing great. And then I believe that I can do it myself as well.” </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/im-proud-to-be-on-the-startline-and-make-history-emma-norsgaard-on-her-first-paris-roubaix\">Related: \"I'm proud to be on the startline and make history\" Emma Norsgaard on her first Paris-Roubaix</a></em></strong></p>\n<p><span>Besides, for Norsgaard, sprinting isn’t the only trick up her sleeve: “I guess I'm still in the category of being a sprinter. I really would like to develop into being this all round kind of rider even more than I am now, and also being able to climb a little bit,” she says. “Definitely over the next couple of years I really want to work on this and work on my TT and be strong in the TT for stage races. So yeah, I mean I love being a sprinter, don't get me wrong, but it's not all I want for my career is to be a sprinter.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327478334-_1_1024x1024.jpg?v=1635945528\" /></span><em><span>Norsgaard wins at the Giro d'Italia Donne (Image: Getty)</span></em></p>\n<p><span>With WorldTour podiums, myriad wins and top-10s to her name this season, Norsgaard very much became one to watch at every race she entered, so how did she deal with the pressure? “I think especially Movistar have been super great with me to not put any stress, or pressure on me,” she says. “I think actually, it's mostly me that put a lot of pressure on myself and this I have had a really hard time dealing with in the end of the season. </span></p>\n<p><span>“I mean, it's been in my head so much that [at] the end of the season, I didn't really enjoy doing the races anymore, because I didn't feel 100%. And then I felt like I disappointed the people around me and and as soon as you start thinking that, you're never going to win the race. So it's definitely something that I want to work on for for next year, the pressure from myself and the expectations I have for myself, and the thoughts about what others might think”</span></p>\n<p><span>Norsgaard signed for a further three seasons with her current team, which, as well as an opportunity to develop, brings job security: “it makes me relax and makes me feel like Movistar really invest in this project that we are doing right now,” she says. “And they believe in me...it's just super nice, you know, being safe in the future.” </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-a-day-in-cycling-history\">Related: Paris-Roubaix Femmes Gallery</a></em></strong></p>\n<p><span>A new ally for her in the fast finishes next season will be Cuban sprinter Arlenis Sierra who Movistar have picked up from A.R Monex. “It’s gonna be super exciting getting to know her and getting to race with her and hopefully we can we can help each other in certain moments in the race and hopefully also in the sprints where she's really strong sprinter herself,” says Norsgaard. “I'm really looking forward to working with her next year and see how it's going to go.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_5977_1024x1024.jpg?v=1635945596\" /><em>Paris Roubaix Femmes 2021 (Image: Peter Stuart)</em></span></p>\n<p><span>Of course, for 2022 the looming prospect of the Tour de France Femmes avec Zwift is high on all of the women’s peloton’s agendas and Norsgaard is no different: “I can't wait to race it. I’ve just been on a camp with my team and they asked what's the biggest race or the biggest goal for next year,” she says. “And I just said if I can do just one stage in the Tour I'm going to be so happy. I mean, it's the biggest goal of the year. Definitely.” </span></p>\n<p><span>Before that, however, there is her wedding to take care of, followed by a trip to London for her appearance at Rouleur Live. “Right now the only thing I'm thinking about is my wedding. I haven't even been looking at the calendar for next year,” she says. “I'll just try to focus on this and celebrate with Mikkel and have some time off and then after my break I think I'm going to start to focusing again on next year.” </span></p>\n<p><span>“I'm definitely looking forward to going to Rouleur and it's a pleasure that they asked me to come. It’s going to be nice seeing London again. It's been some years since I visited.”</span></p>\n<b><i>Rouleur's content is supported by Zwift. Find out more about riding with Zwift this winter </i></b><b><i><a target=\"_blank\" href=\"https://www.zwift.com/uk/neokyo?utm_source=cm&amp;utm_medium=cpm&amp;utm_campaign=zwift_glo_all_cycling_specialistdirect_neokyo_brand_-brandawareness-rouleur\">here</a></i></b><br />\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6815ae6ff63bd69a3393a74fa61207ad5bd4ce42eb90334aa17584fbea4f51e7","category":"Cycling"}