{"title":"Impact and Regulations of AI on Labor Market and Employment in USA","link":"https://www.preprints.org/manuscript/202407.0906/v1","date":1720693621000,"content":"This study investigates the impact of AI regulations and adoption on labor markets and employment in the USA. In order to achieve the study's objective, a robust econometric approach was employed using Principal Components Analysis (PCA) to address multicollinearity among the variables. The regression analysis incorporated principal components representing overall AI adoption and education (PC1), AI innovation and academic output (PC2), economic growth (PC3), and unemployment and AI strategies (PC4). The analysis utilized heteroskedasticity-robust standard errors to ensure reliable coefficient estimates and tested for stationarity to confirm the stability of the time series data. Data were collected from 2010 to 2022, encompassing key AI-related and economic indicators.\nThe results reveal that higher AI adoption and education levels initially lead to job displacement, negatively impacting labor market metrics. Similarly, AI innovation and economic growth driven by AI do not immediately translate into job creation, reflecting transitional challenges. However, the strategic implementation of AI significantly mitigates these adverse effects and enhances employment conditions. The study finds that comprehensive AI strategies, robust regulatory frameworks, and effective workforce retraining and upskilling programs are essential for supporting labor market stability and promoting employment growth. Based on the findings, the study recommended that there is the need to develop and implement comprehensive AI strategies that include robust regulatory frameworks to support workforce transitions. Policies should focus on retraining and upskilling programs to help displaced workers adapt to new AI-driven roles.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"681ace4b577baa9fcb3d749a343c0c5a48608034bfa424bcd00becbfe156f8fe","category":"Interdisciplinary"}