{"title":"Access to abortion pill is spared; SCOTUS freezes lower court’s order","link":"https://arstechnica.com/?p=1933736","date":1682118321000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1251989009-800x533.jpeg\" alt=\"The US Supreme Court in Washington, DC, US, on Wednesday, April 19, 2023. Democrats oppose the Republican-led Congressional Review Act resolution to disapprove of the Department of Veteran Affairs' interim rule on reproductive health care. Photographer: Al Drago/Bloomberg via Getty Images\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/GettyImages-1251989009-scaled.jpeg\">Enlarge</a> <span>/</span> The US Supreme Court in Washington, DC, US, on Wednesday, April 19, 2023. Democrats oppose the Republican-led Congressional Review Act resolution to disapprove of the Department of Veteran Affairs' interim rule on reproductive health care. Photographer: Al Drago/Bloomberg via Getty Images (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/the-us-supreme-court-in-washington-dc-us-on-wednesday-april-news-photo/1251989009?adppopup=true\">Getty | Al Drago</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Supreme Court on Friday issued an order that will maintain status quo access to the abortion and miscarriage drug mifepristone as <a href=\"https://arstechnica.com/science/2023/04/a-deep-dive-into-the-scotus-abortion-pill-case-and-whats-at-stake-for-the-fda/\">the legal battle over the Food and Drug Administration's approval and regulation of the drug</a> continues. The court did not explain its reasoning, but noted that Justices Clarence Thomas and Samuel Alito dissented.</p>\n<p>The ruling overrides an order from the Court of Appeals for the 5th Circuit in New Orleans, which would have curtailed access to the drug as the federal government pursues an appeal of a district court ruling. That ruling, issued by conservative District Judge Matthew Kacsmaryk on April 7, would have revoked access to the drug entirely, finding the FDA's 2000 approval of mifepristone was unlawful, as was the agency's subsequent actions.</p>\n<p>A three-judge panel for the appeals court, however, determined that the plaintiff's in the case—a group of anti-abortion organizations and individuals, led by the Alliance for Hippocratic Medicine—had exceeded the statute of limitations in which they could have legally challenged the FDA's 2000 approval. But, the judges ruled in a 2-1 decision to allow the rest of Kacsmaryk's ruling, revoking the FDA's actions in 2016 and 2021, which eased restrictions and access to the drug.</p></div><p><a href=\"https://arstechnica.com/?p=1933736#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933736&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"681e16b1a8f893bbf89c5ba2179bc0d8ae562d0eedabbfc66979c7279c0d12cf","category":"Tech"}