{"title":"Here’s how Ferrari designed a car that won Le Mans on its first attempt","link":"https://arstechnica.com/?p=1949117","date":1687359548000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023_24hLeMans_lm_17545-800x533.jpg\" alt=\"A red Ferrari prototype drives past the pit wall at Le Mans as the team celebrates\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/2023_24hLeMans_lm_17545-scaled.jpg\">Enlarge</a> <span>/</span> Ferrari last won Le Mans overall in 1965 and hasn't competed at the top level since 1973. This year it returned and won with the hybrid 499P hypercar. (credit: Ferrari)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Tuesday morning, a triumphant Ferrari celebrated its latest race win. Not this past weekend's F1 race in Montreal, though; 2023 is still looking rough for Scuderia Ferrari's open-wheel racing program. Instead, the glory was brought back to Maranello by its new endurance racing effort, which just won the 24 Hours of Le Mans after an absence of 50 years. It did it with an all-new car, against tough opposition, and the enormity of that result has taken a little time to sink in, according to Ferdinando Cannizzo, technical director of Ferrari Competitzione GT and technical director for the Ferrari 499P program.</p>\n<p>\"What I can tell you is that it is clear for us that the challenge that we accepted was very ambitious, that we finally achieved a very historical result,\" Cannizzo told Ars. \"We are aware that the company achieved an historic results, and I think everything will mature in the days that will come; we can probably realize the value of what we have done all together.\"</p>\n<h2>Endurance racing is flat-out now</h2>\n<p>The nature of the Le Mans race has changed a lot since Ferrari last won overall in 1965. Then, as now, overall victory was usually up for grabs for one of the cars in the prototype class—cars designed just to go racing rather than the converted road cars that contest the GT class. And the race still takes place for 24 hours on a circuit that still includes some public roads. But in the 1960s, endurance racing was not a flat-out sport; cars were fragile, and making it to the end meant leaving plenty in reserve and being kind to the machinery.</p></div><p><a href=\"https://arstechnica.com/?p=1949117#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1949117&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6832ae0a505eee39f6975dbb793017914d20321a57da3fd77cf8b62000f661c8","category":"Tech"}