{"title":"Timing of surgery in acute deep partial-thickness burns: A study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299809","date":1710165600000,"content":"<p>by Roos F. C. Salemans, Denise van Uden, Margriet E. van Baar, Tjitske M. Haanstra, Carine H. M. van Schie, Paul P. M. van Zuijlen, Ymke Lucas, Sonja M. H. J. Scholten-Jaegers, Annebeth Meij-de Vries, Fiona M. Wood, Dale W. Edgar, Inge Spronk, Cornelis H. van der Vlies, National Burn Care, Education &amp; Research group, the Netherlands </p>\r\n\r\nFor deep partial-thickness burns no consensus on the optimal treatment has been reached due to conflicting study outcomes with low quality evidence. Treatment options in high- and middle-income countries include conservative treatment with delayed excision and grafting if needed; and early excision and grafting. The majority of timing of surgery studies focus on survival rather than on quality of life. This study protocol describes a study that aims to compare long-term scar quality, clinical outcomes, and patient-reported outcomes between the treatment options. A multicentre prospective study will be conducted in the three Dutch burn centres (Rotterdam, Beverwijk, and Groningen). All adult patients with acute deep-partial thickness burns, based on healing potential with Laser Doppler Imaging, are eligible for inclusion. During a nine-month baseline period, standard practice will be monitored. This includes conservative treatment with dressings and topical agents, and excision and grafting of residual defects if needed 14–21 days post-burn. The subsequent nine months, early surgery is advocated, involving excision and grafting in the first week to ten days post-burn. The primary outcome compared between the two groups is long-term scar quality assessed by the Patient and Observer Scar Assessment Scale 3.0 twelve months after discharge. Secondary outcomes include clinical outcomes and patient-reported outcomes like quality of life and return to work. The aim of the study is to assess long-term scar quality in deep partial-thickness burns after conservative treatment with delayed excision and grafting if needed, compared to early excision and grafting. Adding to the ongoing debate on the optimal treatment of these burns. The broad range of studied outcomes will be used for the development of a decision aid for deep partial-thickness burns, to fully inform patients at the point of consent to surgery and support optimal person-centred care.","author":"Roos F. C. Salemans","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6838f09e8b37f320ec533a33fa13a776b271f9c6f7d7dec78c103a6c3f671baa","category":"Interdisciplinary"}