{"title":"The day it all went wrong for Remco Evenepoel","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-day-it-all-went-wrong-for-remco-evenepoel","date":1694197160000,"content":"\n      <p>It was billed as the biggest test of Remco Evenepoel’s cycling career. The queen stage of the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>: Remco the lone rider versus the Jumbo-Visma trident, and the UAE Team Emirates trio. Over 4,000m of climbing condensed into the final 103km of racing. Beginning in Spain, crossing over into France, up and over the mighty difficult Col d’Aubisque and Col de Spandelles, and then finally a finishing ascent to the mythical, iconic, and formidable Col du Tourmalet.</p>\n<p>This was the day that the young Belgian’s career had seemingly all been crescending to. A day in the high mountains against the very best riders in the peloton, principal among them Tour de France champion Jonas Vingegaard and Primož Roglič. Would he finally be able to bury the myth that he can’t go toe-to-toe with the foremost challengers on the most difficult and demanding of stages?</p>\n<div></div>\n<p>Short answer: no. It was a disaster of epic proportions, the like of which no one could have predicted. Twenty-seven minutes and five seconds after Vingegaard won the stage, leading home a remarkable Jumbo-Visma 1-2-3 that cements Sepp Kuss’ title as race favourite, Evenepoel trundled across the line, surrounded by three of his Soudal - Quick-Step mountain domestiques. His defence of the red jersey was officially annulled.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-day-of-dominance-jumbo-visma-stamp-authority-on-vuelta-a-espana-with-tourmalet-exhibition\"><strong><em>Read more: A day of dominance: Jumbo-Visma stamp authority on Vuelta a España with Tourmalet exhibition</em></strong></a></p>\n<p>The critics and doubters would tell you that this was not a surprise. In winning last year’s Vuelta, Evenepoel minimised his losses on the queen stage to Sierra Nevada, a day after ceding almost a minute to Roglič. Those same sceptics subscribe to the belief that had an evidently improving Roglič not crashed on stage 16, Evenepoel would not have won red. It’s a futile argument in reality, but Evenepoel is fully aware that his Achilles’ heel is a Grand Tour’s hardest test.</p>\n<p>In the four Grand Tours he has ridden so far, he has been supremely strong in the opening 10-day blocks of racing that have included time trials - his forte; short, steep and punchy ascents that he has turned into one of his strengths; and big mountain days coming too early in the race to really be decisive.</p>\n<p>He has been unlucky at the Giro d’Italia: he shouldn’t have ridden the 2021 edition, coming just eight months after his horrific Il Lombardia crash, and this year Covid struck him down while in the race lead. But his record in the second halves of the two Vueltas he has competed in, and most of the 2021 Giro, doesn’t portray an image of a bike rider getting better. A caveat should be inserted: he is 23, and the evidence book counts just three participations in the latter periods of Grand Tours, but it's galling all the same.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1668098757.jpg?v=1694197073\" alt=\"Remco Evenepoel Vuelta a España\" /></p>\n<p>What went wrong on stage 13? So far, it’s not known; the inquest hasn’t begun. The pace set by Jumbo-Visma on the lower slopes of the Aubisque was designed to weaken and distance Evenepoel’s helpers, not him. But with more than 90km of the race remaining, he was cut adrift, accepting the predicament not long after. Quick-Step DS Klaas Lodewyck reflected. \"It was just a bad day for Remco. He was not sick or injured. It’s unfortunate and it can happen. Cycling is not racing on a simulator and we are all human beings.”</p>\n<p>With no Evenepoel up front, it stymied the racing; Jumbo no longer had to try and soften their biggest rival from afar, because he was already beaten, knocked out. Instead it became a procession, save for Juan Ayuso, Cian Uijtdebroeks and Enric Mas valiantly staying within reach. Whereas worldwide cycling fans had tuned in expecting a rumble in the Pyrenees, a shakedown for the ages, instead they were treated to a Jumbo-Visma altitude training ride, like the ones seen by only a few eyes on Teide and at Tignes.</p>\n<p>If there is one positive for the sport to take from Evenepoel’s brutal dethroning, it’s that the narrative around him is enriched, and the intrigue is heightened. Evenepoel has a significant shortcoming, and to many people he is yet to demonstrate that he can definitively tick all of the boxes, climb all of the mountains and breathe the most rarefied of air at the biggest race of all, the Tour de France. There’s now a public will-he-won’t-he debate that will not rest unless he wins yellow one day.</p>\n<p>In the here and now, though, the spectacle of the 2023 Vuelta a España is significantly poorer without the Belgian in contention. One vs two sets of three has just become a cavalcade.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6845ff97ea55614777c43b29ccadb95de69d0007a4e1c482ad9cfc7eed6609de","category":"Cycling"}