{"title":"Yahoo Answers to end as Trump fans see plot to “silence conservatives”","link":"https://arstechnica.com/?p=1754863","date":1617726114000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-question-mark-800x400.jpg\" alt=\"Illustration of a question mark and exclamation point on a wooden floor, leaning against a wall.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-question-mark.jpg\" class=\"enlarge-link\" data-height=\"612\" data-width=\"1224\">Enlarge</a> (credit: Getty Images | Thomas Hertwig | EyeEm)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Yahoo Answers is shutting down on May 4, 2021, the Verizon-owned <a href=\"https://help.yahoo.com/kb/SLN35642.html\">Yahoo announced this week</a>. The 16-year-old question-and-answer service will enter read-only mode on April 20, preventing users from posting new questions or answering other users' questions, Yahoo said. On the May 4 shutdown date, the website will no longer be accessible, and the URL will redirect to the Yahoo homepage, Yahoo said. No other Yahoo services are affected by this announcement.</p>\n<p>Just why people still use Yahoo Answers is a question that probably lacks a satisfying answer. One Ars colleague suggested that I format this article \"as a question followed by a bunch of poorly written responses that don't quite answer the question.\" Instead of that, let's take a look at some of the recent questions that have risen to the top or near the top of the Yahoo Answers <a href=\"https://answers.yahoo.com/\">homepage</a>.</p>\n<p>The shutdown announcement prompted anger from people asking if Yahoo Answers is being \"shut to silence conservatives\" and for recommendations of other sites that post \"the truth regarding the left's degeneracy.\" Another asked whether former President Donald Trump should buy Yahoo to prevent the shutdown. Others wanted to know whether the US can survive Biden's presidency and whether Democrats will ever \"admit\" that the election was rigged (<a href=\"https://apnews.com/article/election-2020-ap-fact-check-joe-biden-donald-trump-technology-49a24edd6d10888dbad61689c24b05a5\">it wasn't</a>).</p></div><p><a href=\"https://arstechnica.com/?p=1754863#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1754863&comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6845ad9d4fef78d570d9f388a2ff0d4491b49279b0c2fc21767a6bec417026be","category":"Tech"}