{"title":"Adobe Highlights New Generative AI Features for Photoshop and More","link":"https://www.macrumors.com/2023/10/10/adobe-generative-ai-features/","date":1696977106000,"content":"At its annual MAX conference, Adobe today provided <a href=\"https://news.adobe.com/news/news-details/2023/Adobe-Releases-Next-Generation-of-Firefly-Models/default.aspx\">insight into its plans</a> for generative AI technology in Photoshop, Illustrator, and other popular design apps.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/adobe-generative-fill-photoshop.jpg\" alt width=\"1300\" height=\"713\" />\r<br />\nAdobe has iterated on Firefly, its AI image generation model, with the Firefly Image 2 Model. Improved Text to Image capabilities can be used on the <a href=\"https://www.adobe.com/sensei/generative-ai/firefly.html\">Firefly web app</a>, and a Generative Match option lets users generate content in user-specified styles. Photo Settings allows for photography-style image adjustments, and Prompt Guidance helps users refine their suggestions for better end results.\r<br />\n\r<br />\nAs for quality, Firefly Image renders better skin, hair, eyes, hands, and body structure, plus it offers better colors and improved dynamic range. The generative AI model is used for generative fill in Adobe Photoshop, allowing users to add, expand, and remove content with text prompts.\r<br />\n\r<br />\nThere's now a Firefly Vector Model, which Adobe says is the world's first generative AI model for creating vector graphics. Integrated into Adobe Illustrator, Firefly Vector Model can be used to create all manner of vector graphics, including logos, website designs, and product packaging.\r<br />\n\r<br />\nAccording to Adobe, the Firefly Vector Model can create \"human quality\" vector and pattern outputs with a Text to Vector graphic feature. Generated graphics are organized into groups and fully editable, with options to match an artboard's existing style.\r<br />\n\r<br />\nAdobe Express also has a new Firefly Design model for generating templates for social media posts and marketing assets. Firefly Design Model can generate templates in popular aspect ratios that are editable in Express.\r<br />\n\r<br />\nMore information about Adobe's new AI features can be <a href=\"https://www.adobe.com/\">found on the Adobe website</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/adobe/\">Adobe</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/10/adobe-generative-ai-features/\">Adobe Highlights New Generative AI Features for Photoshop and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/adobe-highlights-new-generative-ai-features-for-photoshop-and-more.2407137/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"68500ea5985e8e10ca7ff56d6515f89e876f14612924de81d278ac38f357da19","category":"Apple"}