{"title":"How to prevent punctures: six steps to stop flat tyres","link":"https://www.bikeradar.com/advice/skills/how-to-prevent-punctures/","date":1619085456000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/Patched-inner-tube-1-78715c1.jpg?quality=45&amp;resize=620,413\" />                                            <p>We’ve all heard that dreaded hiss and felt a tyre go squidgy with a puncture. It usually means 15 minutes at the side of the road and often happens at the worst possible moment when it’s about to rain, it’s cold, it’s getting dark – or all three.</p>\n<p>It’s good to be prepared, carry a spare tube and know <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">how to fix a puncture</a> quickly. You’ve typically got two options: to repair the inner tube that’s punctured or swap in a new one.</p>\n<p>There are plenty of things you can do to lessen your chances of getting a flat in the first place, though. After all, prevention is better than cure when it comes to punctures. Here are six steps to help stop punctures on your bike.</p>\n<h2>1. Choose the right tyres</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A hard-wearing road tyre or semi-slick gravel tyre will provide additional puncture protection but may rob you of some speed.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>First up, choose tyres that are designed for the conditions.</p>\n<p>It’s great to ride the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">best road bike tyres</a> – they’re lightweight, fast-rolling, responsive and comfortable. But punctures are a lot more common on wet winter roads often strewn with grit and debris, so as the summer wanes into autumn it’s a good idea to switch to winter tyres.</p>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bike-tyres/\">best winter road bike tyres</a> are more robust than a summer tyre, with more puncture protection, often including a bead-to-bead protection strip, and are made using thicker rubber. The best year-round training tyres will balance speed, durability, grip and puncture protection.</p>\n<p>Wider tyres can give you more grip and better ride comfort as well and, if you have the clearance in your frame, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">gravel bike tyre</a> with a light tread could also be a good bet for <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-to-work-guide/\">cycling to work</a>, winter cycling or mixed-terrain riding.</p>\n<h2>2. Get the pressure right</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pumping your tyres to a suitable pressure will help prevent flats.</span></figcaption><span> <i>Dave Caudrey / Immediate Media</i></span></div>\n<p>If the pressure in your tubed tyre is too low, you risk getting a pinch flat, where the inner tube gets trapped between the rim and the tyre casing as you roll over a road or trail imperfection. That leads to a puncture with two parallel slits in the tube, also called a snakebite flat.</p>\n<p>So it’s important to <a href=\"https://www.bikeradar.com/features/how-to-inflate-a-bicycle-tyre-everything-you-need-to-know-about-pumps-valves-pressure-and-more/\">pump up your bike’s tyres</a> to the right pressure. That will also lessen the chance of sidewall damage, reduce tyre wear, lessen the chance of damage to wheel rims and improve your bike’s handling, which can get squirmy if the pressure is too low.</p>\n<p>Finding the right pressure for you takes a little trial and error, and depends on the terrain you’re riding, your weight and the conditions. We’ve got a guide to <a href=\"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/\">mountain bike tyre pressure</a> to help you find the right pressure for trail riding.</p>\n<p>Tyres will have a recommended pressure range printed on their sidewalls, but you can normally go lower if you’re riding with <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a> because you don’t have the risk of pinch flats (we’ll come on to tubeless).</p>\n<p>Wheel brands will also often have a recommended inflation range for their wheels on their websites.</p>\n<h2>3. Add sealant to your tubes</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Running sealant-filled tubes – or adding sealant to your existing inner tubes – can help to prevent punctures, but will add weight and rolling resistance.</span></figcaption><span> <i>George Scott / Immediate Media</i></span></div>\n<p>Another option is to add sealant to your inner tubes, giving you the benefits of added puncture protection without having to invest in tubeless tech, though it will add weight and rolling resistance to your setup.</p>\n<p>Adding sealant is easier to do if your inner tube has a removable valve core, so you can pour sealant into the tube without the risk of gumming up the valve. Also check that the sealant is compatible with your inner tubes, particularly if you are using latex inner tubes.</p>\n<p>Slime is among the brands that sell a sealant formulated for use in inner tubes. The other option is to use inner tubes that come ready-filled with sealant. Again, Slime offers these in a range of sizes to fit the majority of popular road and mountain bike tyre and <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">wheel sizes</a>.</p>\n<p>Inner tube sealant works much in the same way as <a href=\"https://www.bikeradar.com/features/which-tubeless-sealant-works-the-best/\">tubeless tyre sealant</a>. The sealant coats the inside of your inner tube as the tyre spins and, if you ride over a puncture-causing object, such as a thorn or glass, the air escaping from the tube sucks the sealant toward the hole. Particles in the sealant should plug up the hole before it deflates the tyre.</p>\n<h2>4. Go tubeless</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Going tubeless removes the risk of pinch flats, and the sealant will often repair small cuts in the tyre before they turn into a puncture, but some setup and ongoing maintenance is required.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>All the buzz at the moment is around tubeless tyres for road bikes. The benefits of tubeless can include lower rolling resistance and a more comfortable ride, as well as protection from flats, plus you can (probably) ditch those pesky <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tubes</a>.</p>\n<p>Without a tube you can’t get a pinch flat, so you’ll avoid this type of puncture. The sealant in the tyre also plugs smaller holes and prevents many of these from turning into a full-fledged puncture.</p>\n<p>Like sealant-filled inner tubes, tubeless tyres aren’t infallible, though.</p>\n<p>If you do get a puncture that the sealant can’t seal, you can use a tubeless repair kit to plug-up the hole. If that doesn’t work – or the hole is too big for a repair plug – you’ll need to fit a spare inner tube.</p>\n<p>You’ll need tubeless-ready wheels and tyres to go tubeless. Most newer wheels come with tubeless-ready rims, but the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tubeless-road-tyres/\">best tubeless road tyres</a> are usually a bit more expensive than tyres designed to be used with inner tubes.</p>\n<p>Don’t try to convert non-tubeless components to tubeless because the tech requires close tolerances.</p>\n<p>If you do switch to tubeless, you also need to keep an eye on your sealant level and make sure that it hasn’t dried out – topping it up if necessary – so there’s a bit of extra ongoing maintenance required.</p>\n<h2>5. Check your tyres regularly</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Check your tyres regularly for pressure and wear. Also, look out for any debris embedded in the rubber that may cause a puncture.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>A worn tyre is much more likely to puncture, so it’s a good idea to check the state of your bike’s tyres regularly. A badly worn tyre will have a flattened or squared profile where the rubber thickness has been eaten away by the road or trail.</p>\n<p>Some tyres will have wear indicators built into the tread, so you can see when they need to be replaced. If you’ve worn through the rubber to the puncture protection belt, or the threads of the tyre’s carcass can be seen – even if only in one spot – it’s definitely time to fit a new tyre.</p>\n<p>Even if your tyres aren’t worn, it’s important to check them regularly. Tyres can pick up flints, glass, thorns or other debris, so inspect the tread as part of your regular, pre-ride <a href=\"https://www.bikeradar.com/advice/workshop/how-to-safety-check-your-bike/\">bike safety check</a>.</p>\n<p>If you find anything embedded in your tyre, prise it out with a small screwdriver blade or the point of a sharp knife before it can work its way further into the tyre and cause a puncture.</p>\n<p>Watch out for larger cuts in the tyre’s tread or sidewall that might make it unsafe to ride. If you do get a puncture while out riding, make sure you check the tyre thoroughly to remove whatever it was that caused the puncture in the first place.</p>\n<h2>6. Don’t ride in the gutter</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Watch out for puncture-causing debris when cycling and avoid riding in the gutter.</span></figcaption><span> <i>Tobias Ackeborn / Getty Images</i></span></div>\n<p>If you’re riding on the road, there’s generally always more debris at the side of the road, compared to where other vehicles’ tyres have rolled, so don’t ride in the gutter or too close to the edge of the carriageway.</p>\n<p>Choosing the optimum <a href=\"https://www.bikeradar.com/features/how-to-ride-safely-in-traffic/\">road position</a> will also help you ride more safely around other road users.</p>\n<p>Conversely, don’t ride too far out because that’s another area where motor vehicle tyres don’t normally pass. Debris can build up nearer the centre of the road as well, particularly on narrower single carriageway back roads.</p>\n<p>If you need to cross the centre of a narrow road, look for gaps in the gravel or dirt and cross them at an angle that limits your exposure to sharp, puncture-causing objects.</p>\n<p>Also, look out for potholes or other obstacles that might cause a sudden impact. These can cause pinch-flats or potentially damage the rims of your bike’s wheels.</p>\n<p> </p>\n<p> </p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"68514a9e9dc521dce7f03ce442225a0743268b7a0cbbfedfe650c4ea40ffffeb","category":"Cycling"}