{"title":"Alex Dowsett’s Hour Record bike and superfast kit","link":"https://www.bikeradar.com/features/pro-bike/alex-dowsett-hour-record-bike/","date":1636042508000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Alex-Dowsett-Hour-Record-bike-9ad6775.jpg?quality=45&amp;resize=620,413\" />                                            <p>Just over seven years after he broke the men’s Hour Record aboard a <a href=\"https://www.bikeradar.com/news/pro-bike-dowsetts-canyon-speedmax-whr/\">Canyon Speedmax WHR</a>, Alex Dowsett has set a new personal best of 54.555km at the Aguascalientes velodrome, in Mexico.</p>\n<p>Though he fell short of breaking the current men’s Hour Record (which stands at 55.089km, set by Victor Campenaerts in 2019), it was nevertheless a courageous attempt at one of the sport’s most prestigious records.</p>\n<p>As always, though, this latest Hour Record attempt was a true tech feast, and in addition to bucket loads of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">power</a>, a highly optimised <a href=\"https://www.bikeradar.com/advice/skills/technique/how-to-nail-your-time-trial-position-like-tony-martin/\">time trial position</a> and (according to Dowsett himself) at least 300 to 400mg of <a href=\"https://www.bikeradar.com/advice/nutrition/coffee-and-cycling-what-you-need-to-know/\">caffeine</a>, Dowsett’s equipment was carefully chosen to maximise his chances of breaking and taking back the record.</p>\n<p>As such, Dowsett used a cutting-edge track bike built with exotic parts, a super-expensive custom skinsuit and a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-time-trial-helmets-real-world-testing-of-5-favourites/\">time trial helmet</a> said to work best with his individual position on the bike.</p>\n<p>After all, in an event without tactics and where the difference between success or failure is so binary, every marginal gain counts.</p>\n<h2>Factor Hanzo time trial/track bike</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett’s Factor Hanzo bike is a cutting-edge time trial bike, modified for track use.</span></figcaption><span> <i>Jesús González</i></span></div>\n<p>Dowsett’s bike is a modified <a href=\"https://www.bikeradar.com/brand/factor/\">Factor</a> Hanzo <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bike</a>.</p>\n<p>As Factor doesn’t make a track bike, Dowsett instead used a frameset designed for road time trials, with one key modification; a 3D-printed titanium rear end (seatstays and chainstays) with rear-facing track dropouts, made by <a href=\"https://www.bikeradar.com/brand/silca/\">Silca</a>.</p>\n<p>This modification enables the use of a <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\">fixed-gear drivetrain</a>, as required by the rules of the event.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> To enable the use of a fixed-gear drivetrain, Dowsett had his Factor Hanzo time trial bike modified with a 3D-printed titanium rear end made by Silca.</span></figcaption><span> <i>Silca / Factor</i></span></div>\n<p>The Hanzo frameset itself features a wide stance fork, designed to move the legs of the fork away from the wheel and prevent them from interacting with the airflow over the front wheel.</p>\n<p>It’s not as extreme a design as the <a href=\"https://www.bikeradar.com/features/pro-bike/hope-hb-t/\">Hope HB.T</a> track bike, where the fork legs are placed so wide they effectively break the airflow over the rider’s legs.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The fork legs have a wide stance to improve aerodynamic performance with a wide range of wheels.</span></figcaption><span> <i>Jesús González</i></span></div>\n<p>Nevertheless, it stands in contrast to many modern track bikes, such as <a href=\"https://www.bikeradar.com/features/pro-bike/joss-lowden-argon-18-electron-pro/\">Joss Lowden’s Argon 18 Electron Pro</a> or <a href=\"https://www.bikeradar.com/news/bradley-wiggins-pinarello-bolide-hr-first-glimpse/\">Bradley Wiggins’ Pinarello Bolide HR</a>, which feature forks that hug the front wheel as close as possible.</p>\n<p>The rest of the bike is a mix of deep, truncated aerofoil tubes designed to minimise air resistance as much as possible within the UCI’s strict regulations.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Factor Hanzo time trial bike uses deep, truncated aerofoil tube shapes to minimise aerodynamic drag.</span></figcaption><span> <i>Factor</i></span></div>\n<h3>Wheels and tyres</h3>\n<p>Being a track bike, there are relatively few components to complete the build. Still, for a record attempt such as this, Dowsett naturally chose the fastest parts he could get his hands on.</p>\n<p>The wheels are a set of HED Volo track discs. Given there are no crosswinds in a velodrome to worry about, it’s possible to run solid disc wheels both front and rear, without any concerns about handling.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Double discs are the most aerodynamic, and therefore fastest, option for an Hour Record.</span></figcaption><span> <i>Factor</i></span></div>\n<p>These wheels are wrapped in 700×23c Vittoria Pista Oro tubular tyres. These are Vittoria’s fastest, lightest, most supple track-specific tyres.</p>\n<p>Tubulars are still the tyre of choice in the velodrome, where the smooth track surface means running an extremely high <a href=\"https://www.bikeradar.com/advice/workshop/road-bike-tyre-pressure/\">tyre pressure</a> (something which is typically not possible in clincher or tubeless tyre systems) can help to reduce rolling resistance.</p>\n<h3>Drivetrain</h3>\n<p>Dowsett’s drivetrain had just a single gear, with a 61-tooth, £950 <a href=\"https://www.bikeradar.com/news/aerocoach-aten-chainring/\">AeroCoach Aten chainring</a> and a 13-tooth White Industries sprocket at the rear.</p>\n<p>That works out as a 123.34-inch gear, for those using old money. If you wanted to replicate that on a standard road bike, it’s like using a 52-tooth chainring with an 11-tooth sprocket.</p>\n<p>The Aten chainring is made from machined titanium and backed with carbon fibre, for increased stiffness. It also has an aerodynamic profile and a titanium nitride coating, which is said to reduce drivetrain friction (this coating is also what gives the chainring its gold colour).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A huge, 61-tooth, AeroCoach Aten chainring gives an idea of how fast Dowsett was riding.</span></figcaption><span> <i>Factor</i></span></div>\n<p>According to AeroCoach, this chainring saves a rider around 1.6 watts versus a standard aero chainring, which equates to around 25cm distance gained per 250m lap when riding over 50kph.</p>\n<p>Dowsett’s chain is an Izumi Super Toughness Kai 1/8-inch track chain, which was treated with an <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">immersive wax lubricant</a> to minimise drivetrain friction.</p>\n<p>A set of 170mm Rotor Aldhu cranks, attached to a Power2Max NG track <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a>, sits in a CeramicSpeed optimised <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett used a 13-tooth sprocket at the rear and a waxed chain.</span></figcaption><span> <i>Factor</i></span></div>\n<p>Dowsett recorded his ride data on a <a href=\"https://www.bikeradar.com/features/first-look-friday/hammerhead-karoo-2/\">Hammerhead Karoo 2</a> bike computer, placed under his saddle (per UCI rules which dictate an athlete isn’t allowed to look at a bike computer during track events).</p>\n<h2>Components</h2>\n<h3>AeroCoach Ascalon extensions</h3>\n<p>At the front of his bike, Dowsett used a set of AeroCoach Ascalon 3D-printed titanium aero extensions, paired with AeroCoach’s Align Wing carbon armrests.</p>\n<p>The Ascalon extensions are an off-the-peg model, as opposed to the fully custom set of <a href=\"https://www.bikeradar.com/news/aerocoach-tri-bars/\">AeroCoach Vantaggio extensions</a> used by Filippo Ganna.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett used AeroCoach Ascalon extensions.</span></figcaption><span> <i>Factor</i></span></div>\n<p>The angle of the extensions is set at 20 degrees, with the armrests shimmed up to 15 degrees, to stay within the UCI’s regulations on positioning.</p>\n<h3>Simmons Racing saddle</h3>\n<p>Despite looking like a custom saddle, Dowsett’s perch is actually another off-the-peg item, albeit one with a $650 price tag.</p>\n<p>Made by Simmons Racing, the Pursuit Saddle SR 1.0 is constructed from carbon fibre with the option of firm or soft padding, or no padding at all. It’s claimed to weigh just 100g (not that weight matters much for an Hour Record).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett’s saddle of choice was a Simmons Racing Pursuit Saddle SR 1.0.</span></figcaption><span> <i>Factor</i></span></div>\n<p>Its twin-pronged shape is similar to that used by <a href=\"https://www.bikeradar.com/news/ism-expands-saddle-line/\">ISM saddles</a>, designed to reduce genital numbness while riding in an aggressive aero position.</p>\n<h3>Speedplay Zero Aero pedals</h3>\n<p>For a final aero touch, Dowsett used <a href=\"https://www.bikeradar.com/reviews/components/pedals/speedplay-zero-aero-pedal-review/\">Speedplay Zero Aero pedals</a>.</p>\n<p>Designed with a dimpled underside surface to help smooth the airflow over the pedal body and reduce drag, these are the same pedals Bradley Wiggins used to set his Hour Record in 2015.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett used Speedplay Zero Aero pedals.</span></figcaption><span> <i>Factor</i></span></div>\n<h2>Skinsuit</h2>\n<p>As it’s the rider that contributes the largest amount of aerodynamic drag in the rider plus bike system, a skinsuit is a critical piece of equipment for any racer.</p>\n<p>Dowsett’s skinsuit was custom made by Vorteq, with a design specifically optimised for the speed and conditions he was riding in.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett’s Vorteq skinsuit was custom made for his body shape and the conditions he was riding in.</span></figcaption><span> <i>Jesús González</i></span></div>\n<p>Specifically, the skinsuit had an asymmetric design – because you’re always turning left in an Hour Record – and the fabrics used were optimised for a speed of 43kph, to account for the different air density at 1,887m of altitude at the Aguascalientes velodrome.</p>\n<h2>Helmet</h2>\n<p>Dowsett’s helmet was a HJC Adwatt, a short-tailed time trial helmet with a large visor up front for good visibility in the aero position.</p>\n<p>According to Dowsett, it offers a good balance of low aerodynamic drag and positional stability, meaning if Dowsett were to change his head position at any point it wouldn’t cause a massive increase in drag.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dowsett used an HJC Adwatt time trial helmet, which features a traditional teardrop design and a short tail.</span></figcaption><span> <i>Jesús González</i></span></div>\n<p>Dowsett has, in the past, opted for the <a href=\"https://www.bikeradar.com/reviews/helmets/road-cycling-helmets/poc-tempor-aero-helmet-in-brief-review/\">POC Tempor</a> time trial helmet, but said he found he needed to keep his head in the precise optimum position in order to maximise the effectiveness of its distinctive shape.</p>\n<p>Given the physical toll of the Hour Record, the Adwatt, and its more traditional teardrop design, allowed Dowsett a greater degree of movement to help him remain comfortable in the aero position.</p>\n<h2>What next for the Hour Record?</h2>\n<p>With Dowsett failing to break Campenaerts’ record, the question remains as to who will be next to step up and have a go.</p>\n<p>World time trial champion Filippo Ganna, of <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour</a> team Ineos Grenadiers, has expressed an interest in the event, and even told <a href=\"https://video.gazzetta.it/video-festival-sport-gold-ganna-rivedi-evento/85da8918-29b9-11ec-b040-09ac12d51b87?vclk=home_generico\" target=\"_blank\">La Gazzetta dello Sport</a> he has performed 30-minute test runs averaging an astonishing 57.5kph.</p>\n<p>Given his pedigree both on the road and on the track (Ganna is a former world champion and Olympic gold medalist on the track as well), he seems the obvious candidate on paper.</p>\n<p>Could he be the man to finally surpass Chris Boardman’s 1996 ‘Best Human Effort’ record of 56.375km with a UCI-sanctioned ‘Hour Record’ setup?</p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"6854696657a17fcb1965c67c4a18da179bf231a7ff8299f009be451f26b6d3ce","category":"Cycling"}