{"title":"Design of Small-Type Permanent-Magnet Linear Motors and Drivers for Automation Application","link":"https://www.preprints.org/manuscript/202409.0456/v1","date":1725527526000,"content":"This paper designs and fabricates a small-type permanent-magnet linear motor and driver for automation applications. It covers structural design, magnetic circuit analysis, control strategies, and hardware development. Magnetic circuit analysis software JMAG is used for flux density distribution, back electromotive force(back-EMF), and electromagnetic force analysis. To address end effects and cogging force, auxiliary core structures and control strategies are proposed. The motor has a three-phase, six-coil, seven-pole configuration, achieving a peak phase voltage of 3.621 V at 1.0 m/s with a total harmonic distortion(THD) of 0.49 % and the voltages of each phase are balancing a phase voltage error of -0.002 V. The average electromagnetic force is 5.46 N/A. The driver uses a three-phase inverter with voltage space vector pulse width modulation(VSVPWM), dq-axes current closed-loop control, electromagnetic force control, and S-curve motion trajectory control. Simulations with JMAG-RT models in MATLAB/Simulink verify the control strategies. A microcontroller (TMS320F280045) serves as the control core, and a magnetic encoder with a 488 nm resolution provides position feedback. Each phase winding has an equivalent resistance of approximately 3.0 Ω and an inductance of approximately 1.98 mH. The S-curve motion trajectory control achieves a maximum position error of approximately 5.0 μm and a speed ripple of approximately 0.03 m/s at steady speed. With cogging force improvement, the maximum electromagnetic force is 4.90 N, and the q-axis current compensates around 1.05 A based on mover position. S-curve motion trajectory control results in highly stable and responsive performance. Practical tests show that the designed small-type permanent-magnet linear motor and its driver provide efficient, stable, and high-precision solutions for automation applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6860cc9fb9a01ac0f13f760ef156a0da8740e4f953e2f3f46ea08fe7e0ab7ea7","category":"Interdisciplinary"}