{"title":"Here's How Much It Costs Apple to Make a Vision Pro Headset","link":"https://www.macrumors.com/2024/02/26/price-apple-pays-to-make-vision-pro-headset/","date":1708947505000,"content":"Starting at $3,500, Apple's Vision Pro price puts it at the top-end of the AR/VR headset market, but a significant portion of the cost is down to the device's premium \"bill of materials,\" which is thought to come in at just over $1,500.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Making-Vision-Pro.jpeg\" width=\"1280\" height=\"720\" />\r<br />\nAccording to <a href=\"https://omdia.tech.informa.com/blogs/2023/jul/oledos-and-oled-displays-will-account-for-35-of-apples-vision-pro-vr-device-component-costs\">Omdia's research</a>, the components used in Vision Pro are estimated to cost Apple a total of $1,542. The most expensive component is said to be the two 1.25-inch micro-OLED displays inside the headset, one for each eye. The displays provide a total of 23 million pixels, which Apple says is \"more pixels than a 4K TV.\" Omdia estimates that Apple pays $228 for each display, or $456 per headset. \r<br />\n\r<br />\nThe second most expensive components are the M2 and R1 chips. The M2 is the main processor, which is the same chip that was first introduced in the 2022 MacBook Air. The M2 is responsible for processing content, running the visionOS operating system, executing computer vision algorithms, and providing graphical content. The R1 chip is responsible for all of the information coming from the cameras, sensors, and microphones. Together they cost Apple a total of $240.\r<br />\n\r<br />\nAs noted by <em><a href=\"https://www.cnbc.com/2024/02/24/apples-vision-pro-why-its-so-expensive.html\">CNBC</a></em>, it is hard to extrapolate Apple's profit margin from these estimated figures, since they do not take into account research and development costs, packaging, shipping, sales, marketing, and any capital expenditures that can add up-front costs to large parts orders. Nevertheless, they do give an idea of how expensive the parts alone are in a given device.\r<br />\n\r<br />\nApple is expected to produce fewer than 400,000 Vision Pro headsets in 2024 due to the complexity of manufacturing, according to analyst Ming-Chi Kuo. However, Apple is said to be already working on a new version of the Apple Vision Pro that will be priced more affordably. The chips in the device are likely to be on par with the iPhone rather than Mac-level chips, and Apple may also use lower resolution internal displays and cheaper materials. It could also drop the outward-facing EyeSight feature that lets other people see a simulated rendering of the wearer's eyes.\r<br />\n\r<br />\n<em>Bloomberg</em>'s Mark Gurman believes that Apple is working on a next-generation version of the Vision Pro that could see a launch <a href=\"https://www.macrumors.com/2024/02/19/gurman-apple-vision-pro-2-at-least-18-months-away/\">sometime in late 2025</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AppleVisionPro\">Vision Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/26/price-apple-pays-to-make-vision-pro-headset/\">Here's How Much It Costs Apple to Make a Vision Pro Headset</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-how-much-it-costs-apple-to-make-a-vision-pro-headset.2420426/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6869538bd503d94d8f92a447ebe2764e99d707f2e024816eb45843523850697a","category":"Apple"}