{"title":"WhatsApp Gains Email Address Verification for Authenticating Accounts","link":"https://www.macrumors.com/2023/11/21/whatsapp-email-verification-authenticate-account/","date":1700561152000,"content":"WhatsApp has started allowing users to authenticate their account on a device with an email address as an alternative to using a phone number, for times when cellular coverage is poor. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/03/Whatsapp-Feature.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nThe new option to link an account to an email address does not replace SMS verification via a six-pin code, and opening a WhatsApp account still requires the user to provide a number. But with email verification, existing users now also have the means to authenticate their account on a device even in areas where cellular signal is non-existent. \r<br />\n\r<br />\nSpotted by <a href=\"https://wabetainfo.com/whatsapp-for-ios-23-24-70-whats-new/\">WABetaInfo</a>, the new feature is rolling out today as part of version 23.24.70 of WhatsApp for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. To use email verification in the updated app, tap the Settings tab, choose Account, then select Email Address.\r<br />\n\r<br />\nWhatsApp has also been working on a <a href=\"https://www.macrumors.com/2023/05/25/whatsapp-usernames-in-development/\">username feature</a> that could potentially provide people on the messaging service with an additional layer of privacy when communicating with others. \r<br />\n\r<br />\nThe username feature is still in development, so it's too early to tell how they will work when they are rolled out, but it could be that the platform intends to let users reach other people by entering a username instead of a phone number, similar to Telegram. <div>Tags: <a href=\"https://www.macrumors.com/guide/whatsapp/\">WhatsApp</a>, <a href=\"https://www.macrumors.com/guide/wabetainfo/\">WABetaInfo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/21/whatsapp-email-verification-authenticate-account/\">WhatsApp Gains Email Address Verification for Authenticating Accounts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whatsapp-gains-email-address-verification-for-authenticating-accounts.2411581/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"686bb2f1249a1220d285b7387636d895bca2eb5b101255ee8e12463ce8da3afa","category":"Apple"}