{"title":"Don’t worry about the end-call button’s new position in iOS 17’s Phone app","link":"https://www.macworld.com/article/2027705/ios-17-phone-app-end-call-button-moving.html","date":1691754793000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We’ve known since WWDC in June that Apple is updating the Phone app experience in <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a>. There are useful new features like <a href=\"https://www.macworld.com/article/1993858/ios-17-how-to-live-voicemail.html\">Live Voicemail</a>, FaceTime voicemails, and of course, <a href=\"https://www.macworld.com/article/2017358/ios-17-how-to-create-customize-contact-poster.html\">Contact Posters</a>. </p>\n\n\n\n<p>And there are also some interface tweaks, one of which is a rearrangement of the buttons you see when on a call. Instead of six buttons (two rows of three) in the middle of the screen and a red <em>End Call</em> button below, there are now six buttons at the bottom of the screen, with the <em>End Call</em> being the one in the lower right. It’s still red and quite obvious.</p>\n\n\n\n<p>The Contacts button is gone–which you probably never used–and other in-call buttons have new icons and have shifted their placement. You can see the new placement using the slider in the image below.</p>\n\n\n\n<figure><div><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/ios16-call-interface.jpg?quality=50&amp;strip=all\" alt=\"iOS 16 call interface\" width=\"4017\" height=\"2716\" /><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/ios17-call-interface.jpg?quality=50&amp;strip=all\" alt=\"iOS 17 call interface\" width=\"4017\" height=\"2716\" /></div><figcaption>The iOS 16 call interfaces vs. the latest iOS 17 beta interfaces. Swipe to compare.</figcaption></figure>\n\n\n\n<p>Despite this change appearing in the original Developer Beta 1 release, it seems some in the tech press have just decided to load the iOS 17 beta on their phones and notice it, and they are <em>not</em> happy. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://gizmodo.com/apple-iphone-move-end-call-ios-17-beta-1850721425&amp;xcust=1-1-2027705-1-0-0&amp;sref=https://www.macworld.com/feed\">Gizmodo asks</a>, “If the function remains the same, why change the design?” <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnbc.com/2023/08/08/apple-moves-button-to-hang-up-or-end-call-in-ios-17-beta.html&amp;xcust=1-1-2027705-1-0-0&amp;sref=https://www.macworld.com/feed\">CNBC</a> writes, “It’s easy to imagine someone with muscle memory from years of hanging up phone calls accidentally pressing where the button used to be.” <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://abcnews.go.com/US/wireStory/end-call-button-iphone-move-apples-ios-17-102136629&amp;xcust=1-1-2027705-1-0-0&amp;sref=https://www.macworld.com/feed\">ABC News</a> got in on the hysteria. So did <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cbsnews.com/atlanta/news/apple-is-about-to-mess-with-your-head-the-big-red-end-call-button-is-moving/&amp;xcust=1-1-2027705-1-0-0&amp;sref=https://www.macworld.com/feed\">CBS</a>.</p>\n\n\n\n<p>The whole idea of the new interface is to maximize the space on the screen for the new Contact Posters coming with iOS 17 and streamline the experience with only the most useful features in more logical positions. And while there’s some logic to the “I mindlessly hit this one area of the screen without even looking and am going to hit the wrong thing now,” I really don’t think that’s how it operates. For all the griping about this change, almost nobody is actually claiming that they, personally, have not used the new interface properly. </p>\n\n\n\n<p>Maybe that’s because people don’t blindly hit an area of the screen, they hit the big red button. And the new interface still keeps that as the only button with color–all the others are grey. In fact, on iOS 16 the end call button isn’t even labeled! Now it helpfully says “End.”</p>\n\n\n\n<p>If there’s an issue with the call interface, it’s that everything else has moved. For incoming calls, the <em>Message</em> button is now on the left, with the Reminder button replaced by a Voicemail button and moved to the right. This makes sense–few users probably used the feature to “make a reminder to call this person back” and with Live Voicemail, many will likely want to screen their calls by sending them to voicemail with the option to pick it up once they see what it’s about.</p>\n\n\n\n<p>When you’re in a call, the <em>Contacts</em> button is gone (again, not likely used often by most people), and everything else has been reordered. <em>Mute</em> and <em>Audio</em> buttons have swapped places, as have the <em>Keypad</em> and <em>FaceTime</em> buttons. </p>\n\n\n\n<p>This is all much less of a paradigm shift and mental hurdle to overcome than when Apple <a href=\"https://www.macworld.com/article/677786/how-to-move-the-address-bar-back-to-the-top-in-safari.html\">moved the Safari address bar to the bottom of the screen</a> in iOS 15. That went through a lot of iteration and retractions and eventually became optional (but still the default).</p>\n\n\n\n<p>This is going to be <em>fine</em>. I’ve been living with this for months. The first time you look at it you go, “Oh, they changed the buttons” and then you press the big red End button like you always did. You get used to it almost immediately and you move on with your life because it is in no way difficult or inconvenient, it’s just a little shocking at first because Apple has kept the same call interface for so long.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"686e4cfe981023ed91a767c1c41023e4357250c8b0e4f775f2962ceed3b11c6b","category":"Apple"}