{"title":"A variance-partitioning approach for assessing mate choice and which sex controls mating behavior","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae021/7637295?rss=1","date":1711670400000,"content":"<span><div>Abstract</div>Mating behavior arises from interactions between males and females. The precopulatory stage includes various male and female mating behaviors that are potentially influenced (independently or jointly) by each sex, thereby shaping the dynamics of this stage. However, limited attention has been given to determining the relative contributions of males and females to the expression of precopulatory behaviors. Here, we adopted a variance-partitioning approach to assess which sex controls each precopulatory behavior. This approach also enabled us to evaluate the existence of mate choice by assessing whether the expression of precopulatory behavior depends on the identity of the opposite-sex partner. In our study, using the bean bug <span>Riptortus pedestris</span>, we exposed individual males and females to different opposite-sex partners (i.e., mating assays) up to six times. During the mating assay, we measured multiple precopulatory behaviors (e.g., latency to mount, courtship rate, courtship duration, and duration of position change). Variance partitioning showed that the variation in each precopulatory behavior could be attributed solely to either sex but not to both sexes. Hence, the precopulatory stage of <span>R. pedestris</span> comprises a combination of male-controlled and female-controlled behaviors. We also suggested that mate choice was absent in both sexes of <span>R. pedestris</span> in the postmounting and precopulatory stages. Our findings highlight the importance of the variance-partitioning approach in the study of mating behavior, as it facilitates the investigation of whether mate choice occurs at specific mating stages and enhances our understanding of evolutionary dynamics during mating.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"687873e268cfeca80679f2859ea3aa001920f897129d65211ebf15ca810158e4","category":"Environment"}