{"title":"132 Effects of supplementing corn silage to fall-calving cows grazing tall fescue on cow and calf performance and physiology","link":"https://academic.oup.com/jas/article/102/Supplement_1/60/7617998?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The objective was to test the effect of fescue varieties and supplemental feeding of cows grazing fescue pastures during the growing season on cow and calf performance and physiology. Multiparous and primiparous Angus crossbred cows (n= 45) averaging 151 ± 7 d of gestation at trial initiation, were stratified and assigned to pasture treatment based on estimated calving date and parity. Treatment design was a 2 x 2 factorial with two types of fescue pasture (toxin producing or non-toxin producing) and two levels of supplemental corn silage (non-supplemented or supplemented at 1% of BW DM basis). Each treatment replicate (pasture, n = 3 or 4 pastures per treatment) was stocked with 3 cows. There were seven replicates of non-toxin-producing fescue (5 ppm ± 2.50 SEM ergot alkaloids; 38.6% endophyte infection), and eight replicates of toxin producing K31 fescue pastures (507 ppm ± 0.82 SEM ergot alkaloids; 92.5% endophyte infection). Cows were fed corn silage (38% DM, 7.83% CP DM basis) daily in fenceline bunks and feeding amount was adjusted at weigh dates to maintain 1% of BW DM basis. Cows were weighed on two consecutive days at initiation and upon conclusion of the study after being fed similar diets for 4 d to minimize variation in ruminal fill. Body weight (BW), body condition score (BCS), hair score (HS), hair length (HL), and rump fat (RF) measurements were taken at initiation (the middle of the second trimester), trial mid-point (beginning of third trimester), and approximately 2 wk before estimated parturition. Cows remained on experimental pastures through parturition. Data were analyzed as a mixed model with pasture as experimental unit and cows within pasture as subsamples. Initial cow BW and BCS were 558 ± 11 kg (SEM), and 4.9 ± 0.08 (SEM), respectively. For all measures of interest there were no significant interactions observed (P &gt; 0.16). Supplemental feeding tended (P = 0.07) to increase BW gain and rump fat (P = 0.05) regardless of fescue type. Cows grazing toxic fescue tended (P = 0.12) to have a longer hair coat. Likewise, cows grazing toxic fescue had less change in overall HS (P = 0.02). Supplemental feeding of corn silage to cows at 1% of BW DM basis while grazing fescue did not significantly affect gain differences or reduce visible symptoms typical of fescue toxicosis when grazing during the growing season.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"687e2fc5e697adb89b5719f7c26bca5e1dd1e3d2c1fafb889615ed3c9eaca187","category":"Environment"}