{"title":"PSII-11 Achieving heavier piglet weights at weaning with live yeast (Saccharomyces cerevisiae) supplementation under field conditions","link":"https://academic.oup.com/jas/article/102/Supplement_2/287/7664710?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The benefits of live yeast supplementation during both gestation and lactation on piglet performance, nutrient digestibility and immune status have been well reported. However, the application of live yeast to gestation diets in some commercial practices may not be warranted. Therefore, the objective of this study was to evaluate the effect of feeding live yeast to lactating sows on piglet performance at weaning under field conditions. Before start of the study, a total of 268 Camborough L42 gestating sows were fed a restricted, commercial diet. From ≈112 d of gestation until weaning, sows were fed a commercial lactation mash diet with or without inclusion of live yeast (Vistacell, AB Vista, UK) at 1 kg/t. Piglets were cross-fostered within treatment to standardize piglet numbers on sows, and weaned at approximately 24 d. Body weights of piglets at weaning were collected from around 40% of sows. Data were statistically analyzed by Mixed Model using JMP Pro v.16.2 software (SAS Institute Inc, Cary, NC), with significance being accepted at <span>P</span> &lt; 0.05. Treatment was included as a fixed factor in all models, with sow ID and piglet ID nested within treatment included as random variables for sow and piglet performance, respectively. The interaction between treatment and parity was also included in the model for sow performance. Sow parities of 4 and above were combined into one group. Proportional piglet body weights were assessed by non-parametric Wilcoxon Test. An interaction between treatment and parity was shown for average daily feed intake (ADFI), whereby parity-1 sows fed the control diet and parities-3 and -4 sows fed live yeast had greater feed intakes than parity-2 sows fed live yeast. Sow body weights and body condition scores at weaning were unaffected by treatment. Piglet body weights at processing, the number of piglets weaned and weaning ages were also unaffected by treatment. However, piglets from sows fed live yeast were significantly heavier (7.12 kg vs. 6.85 kg) at weaning than piglets from sows fed control diets (<span>P</span> &lt; 0.01). In addition, the proportion of piglets at weaning with body weights of less than 7 kg tended to be fewer (45% vs. 55%), with a greater percentage of heavier (&gt;7 kg) piglets, from sows supplemented with live yeast (<span>P</span> = 0.08). In conclusion, these findings indicate that supplementing live yeast solely to the lactating sow can promote growth of nursing piglets leading to improved piglet performance at weaning.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"688deb3dcb5126a9ee0b387c030952145258274ce6792da92c790f82976051e6","category":"Environment"}