{"title":"Quantifying the hybrid flow and aperture forming of liquid metals immersed in NaOH solution under rotating magnetic field","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202200100?af=R","date":1707196547000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f2f20e64-763c-4178-88e5-65cf90812f3a/appl202200100-gra-0001-m.png\" alt=\"Quantifying the hybrid flow and aperture forming of liquid metals immersed in NaOH solution under rotating magnetic field\" /><p>In this study, the dynamic behaviors of LM (EGaIn) immersed in solution under rotating magnetic field, including interfacial morphology, fluidics responses, apertures tuning, and so forth, were quantified via establishing a coupled three-dimensional model with magnetic effect on two-phase flow. Through theoretical and experimental combination, interesting phenomena were interpreted and potential applications were suggested.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Liquid metal (LM) immersed in solutions exhibited profound fluidic phenomena under various working situations. With persistent research endeavor, a growing number of intriguing phenomena along this direction have been increasingly disclosed. Among the many critical issues, quantifying the hybrid flow of LMs and surrounding solutions often encounters tough challenges due to the large property differences between the two fluids, including density, electrical and fluidic characteristics, and so forth. Especially, when the electromagnetic field is involved, the problems would become ever complicated. In this article, to characterize the hybrid fluids of LM and NaOH solution under rotating magnetic field (RMF), we established a coupled three-dimensional model considering magnetic effect on the two-phase flow. The computational prediction of the model was validated through comparing the simulated morphological features of LM with the experimental measurements at different rotational speeds of magnetic field. Finally, two phenomena were revealed with potential applications interpreted: (1) LM would accelerate the solution due to their difference in viscosity; (2) an asymmetric flow and tunable hole formation under RMF will occur due to the surface tension redistribution on LM. The present works are expected to provide reliable guidance for quantifying the multiphase flow behaviors of hybrid fluids composed of LM and other liquids. The revealed hole size dominated LM aperture is especially useful for developing future smart optical switch and electromagnetic shielding devices.</p>","author":"Nan Li, \nLei Wang, \nJing Liu","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"68909cf712980fcdd62a9c4239c9183da3d8ee11c421b64fceee8c3afb33d99a","category":"Environment"}