{"title":"Impossible Route: Yuma to Bishop via Death Valley – Jeremiah Bishop & Jake Orness","link":"https://theradavist.com/2021/05/impossible-route-yuma-to-bishop-via-death-valley/?utm_source=rss&utm_medium=rss&utm_campaign=impossible-route-yuma-to-bishop-via-death-valley","date":1620302421000,"content":"<p><b>February 28 – March 8, 2021</b><br />\n<b>February 27th<span> </span></b><br />\n<b>Arrival in Yuma, Arizona</b></p>\n<p>The Impossible Route team arrived about as prepared for it as a groom to a shotgun wedding.<span> </span></p>\n<p>We planned on paper, but this was the Mojave Desert and Death Valley; and they would definitely hold some big surprises. <span> </span><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/38-E_D7Impossible_2137_094203.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The absurdly ambitious mission was to see if it was possible for Tyler Pearce<span> “</span>The Vegan Cyclist” and me to ride the core of the California Back Country Discovery Moto route and keep up with the motorcycle itinerary. Now only a damn fool would think this is possible, but both VC and I are qualified as knowing-no-bounds foolish.<span> </span></p>\n<p>The route looked tough even on paper but if we got lost or stuck in terrain not rideable it might not be possible.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/130-E_D5Impossible_2135_022053A.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Stats</strong><br />\nDistance:<br />\n1,245 kilometers  – <span>774miles  </span><br />\nElevation gain:<br />\n15,235 Meters – <span>49,985 Feet  </span></p>\n<p>For our rules, we would ride self-sufficient like a mountain bike stage race; only getting food, water, and resting at the villages or camps that punctuate the otherwise unthinkable desolate deserts.<span> </span></p>\n<p>Each day<span>’</span>s route would be about 110 miles, over sand and rock, through heat and cold, and under the burning sun; but our hand was full of aces! We have an outstanding team to capture this amazing effort and our food bar none. Finish or not, we would deliver some stunning photography, incredible videos, and great resources for those who follow behind us who will try the route.</p>\n<p>We tested, pre-quarantined, and traveled with the highest level of caution to arrive safely to our bubble in the desert.</p>\n<p>I hopefully asked my friend, the celebrated chef, Biju Thomas to join us, thinking he would have to say no because of all that he has on his plate (Dad Joke pun!), but he said yes! He ran camp life like a boss as well as keeping us fed with nutritious food.<span> </span></p>\n<p>Here<span>’</span>s a look at our Impossible Routes dream team:</p>\n<p>Biju Thomas, a celebrated chef with great experience serving elite cycling teams.</p>\n<p>Ramy Khalaf, our amazing risk-taking videographer.</p>\n<p>Jake Orness, the artist-eyed and phenomenal photographer for Eliel. <span> </span></p>\n<p>Our <span>“</span>Aussie” Dale Travers, driving and shooting amazing social media.</p>\n<p>The <span>“</span>young gun,” Travis Longfellow bicycle mechanic and support driving. <span> </span></p>\n<p>My nervous riding partner Tyler Pearce <span>“</span>The Vegan Cyclist,” the funny guy and our inspiring storyteller.</p>\n<p>And me, the tough guy former pro whose job is to make barely possible challenges more possible.<span> </span></p>\n<p>What a great group to take on this unique mission. <span> </span></p>\n<p>The goal is to ride a gravel version I<span>’</span>d planned of the California Backcountry Discovery Route moto route. The course would be 750 miles from Yuma to Bishop over 7 days. I was fairly certain our chances to complete this were 50/50, when considering our rules of taking no outside assistance from our media team while riding, but trail angels or other good luck was fair game.<span> </span></p>\n<p>The basis of these rules comes from my experience riding the two-person Cape Epic mountain bike stage race. No outside assistance during stages and we both must ride together working as a team. What<span>’</span>s more, we had brought gravel bikes to a very rough place. Like a switchblade to a gunfight, but why not try? I think it can be a beacon of hope for folks who have been pent up for a year and we could inspire others to get out of their comfort zone.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/65-E_D1Impossible_2131_063244A.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>February 28<br />\nPrep Day<br />\n3 Miles</b></p>\n<p>Nervously we hustled to prepare all the gear, not really sure if we had the right equipment or enough of it.<span> </span></p>\n<p>We put the Apidura bags on our bikes barely knowing how the straps worked, we download a GPS tracks tried to turn on sat phones we also didn’t know how to use. Mounted up our new IRC tires, installed our lights to our trusty Canyon Grails.<span> </span></p>\n<p>To say we were in over our heads is the understatement. We were like the local rock climbing club setting out for El Capitan.<span> </span></p>\n<p>I assured everybody that things were under control while inside of my head I was certain we were going to die or get lost in the desert with no water and 6 flat tires.<span> </span></p>\n<p>We did pre-ride interviews by the river. At sunset, the wind was ratcheting up and so too where our nerves.</p>\n<p>Nervous and excited, we knew that the next morning we would roll out of the only city we<span>’</span>d see for 761<span>  </span>miles. Logistics challenged us and our timeline was crunched, but like a rocket taking off, it didn<span>’</span>t matter if we were ready just if we were willing.<span>  </span>I stressed at the sheer amount of prep we had only given one day to execute. It was crunched, but it just worked!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/88-E_D1Impossible_2131_080257.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>March 1<br />\nDay 1<br />\n120 Miles: Yuma to Blythe<br />\nNo More Water?</b></p>\n<p>Tyler and I were as excited as school kids off to the first day. The adventure started out well. We climbed north away from the US/Mexican border town of Yuma Arizona. Into the wind, we started up the washboarded Picacho Road. The scenery became forbidding and increasingly desolate as we left civilization. The only spot of shade that could be found was next to a sign warning us that ahead there would be no gas, food, or water.</p>\n<p>After two hours, we crested a gap between two mountains – the Picacho Mine overlook. We froze in our tracks. The view of the rough Trigo Mountain Wilderness was mesmerizing. The jagged peaks layered endlessly in the distance. Tyler and I had a collective <span>“</span>oh, shit!” moment. We just caught the first glimpse of our opponent.</p>\n<p>We remained optimistic as we passed through Picacho State Recreation Area and merrily passed our last possible water source, the Colorado River, before entering the sandbox. At first the sand was rideable, but approximately 4-miles-long, it tested our patience with on-and-off the bike falling. Our frustration lead to anger, and our anger led to doubt. At one point, I broke out laughing because it was all I had left to cope. We felt like two little flies stuck on flypaper, barely able to move, but we kept going.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/108-E_D1Impossible_2131_095134.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Tyler<span>’</span>s shoe broke and we had to stuff a buff in it so it wouldn’t stab him in the foot. We kept going, feet aching, arms tired from pushing the bike, and the heat was climbing into the low 80<span>’</span>s. This had us sucking down our water much faster than planned. Finally we passed a guy on a four-wheel dune buggy. He tossed us some water (trail angel!) and said, <span>“</span>Hang in there, guys! A quarter-mile and the sand is done!”</p>\n<p>Freedom! We climbed up out of there and felt like we<span>’</span>d escaped the first trap of the route. Only 660 miles left.<span> </span></p>\n<p>The pavement on Route 78 was pretty sketchy and there were a lot of big trucks passing, so I was excited to turn left on Milpitas Wash Road. We stopped and tried to cry because looking ahead we could see it was another river of deep sand and rocks.<span> </span></p>\n<p>Riding but mostly walking for a half mile, <span>“</span>It will get better,” I said. This was my promise of the week to keep Tyler<span>’</span>s morale up. Once we escape the sand, it was on washboard. The thing is when you’re riding at 4 miles an hour in the blazing sun doing high power just to stay upright, you go through water fast. We ran out with 20 miles to go, as we approached Bradshaw Trail.<span> </span></p>\n<p>Turning right on Bradshaw Trail, we were greeted by our old friend the sand. This time it was more like a river of pebbles. They were the size of dimes, quarters, and nickels. Our tires sank and so did our spirits. Exhausted and out of water, we have been riding for eight hours. We took the lids off our water bottles and sucked the last drop of water from the tube connected to my hydration bladder. Already my head was throbbing from dehydration.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/98-E_D1Impossible_2131_090521.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Tyler asked Dale how much farther?<span> </span></p>\n<p>Dale said, <span>“</span>13 miles.”<span> </span></p>\n<p>Tyler said, <span>“</span>No way I can make it 13 miles with no water on this trail.”<span> </span></p>\n<p>I coaxed him to just make it to the top of the hill. Then we can coast down to town and maybe find water halfway there. Of course this was a lie, because I knew there was no water on the other side of the mountain, but it kept us moving. We found a motorcycle family and Tyler batted his eyelashes scoring us some water and saving the day.<span> </span></p>\n<p>We sped over the final six miles that were paved. We were so happy to see the campground and ready for some awesome food, but we also realized that riding sunrise-to-sunset every day with very little recovery was going to smash us and become unsustainable.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/206-E_D2Impossible_2132_045218A.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>March 2:<br />\nDay 2<br />\n130 Miles: Blythe to Hole in the Wall<br />\nShoe Tree Chasing the Mirage</b></p>\n<p>We started out in the crisp morning air, through great farmlands with small houses and palms of old Mexico. We turned a corner only to be stopped behind a massive herd of sheep. The men with their safety vests and sticks worked dogs to move the sheep. It was relaxing to be at the mercy of the sheep<span>’</span>s pace, but at some point we knew we needed to forge on.<span> </span></p>\n<p>Today’s surface was a little firmer. We climbed northwest on Blythe Rice Road and over Styx Pass, enjoyed some magic vistas and very nice gravel. The track alternated between fast gravel and 1-kilometer-long sand patches that forced high power just to stay up, but today the rhythm change was tolerable and even fun. We stopped at the Rice Shoe Fence for some photos and to take in the modern art/trash installation that was something out of a post apocalyptic future movie. It was kind of creepy, to be honest – not the kind of place I want to be at nighttime.<span> </span></p>\n<p>We got back on route but struggled to find the correct road leaving the ghost town of Rice. We decided it was safest to take the plan-B route of Cabot Road where we were passed by giant trucks hauling salt with huge trailers. These desert titans on wheels flung dust trails like jet plane for miles. As we approached the horizon, it would just get farther away. At one point we spotted a town. <span>“</span>Look!”<span>  </span>We were excited. A patch of little white square buildings in the distance surely meant water was near.<span> </span></p>\n<p>The closer we got, the farther the town seemed, until finally an hour later we arrived at an abandoned mine site. There were containers, gas tanks, earthmoving machines, oil tanks, sheet metal and buildings, but no people. No water. <span>‘</span>Damn, I<span>’</span>m getting thirsty, <span>“</span>I thought. We continued west. Our left sides baking in the sun, the backs of our legs burned to purple. We encountered deep sand and again full effort rendered progress of just 4 miles-per -hour.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/90-E_D2Impossible_2132_093538.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The sections that were hard-packed were gorgeous lunar landscapes in 360 degrees. Finally, after two hours, we arrived at an intersection.<span>  </span>Upon crossing the tracks, we became excited because we saw the only human being we<span>’</span>d seen all day: a rail line maintenance worker, with a sweat-stained shirt, worn boots, and scruffy cowboy chin. He waved hello. Tyler chatted with him and scored us four little bottles of water. It was just what we needed to make it. We opted for the pavement on Route 66 from Danby, but two completely washed out sections interrupted even that route. We rode right down the yellow line on what used to be the busiest road in the Southwest. I imagined folks in heavy metal cruisers traveling to San Diego or Las Vegas from Chicago. Now Route 66 is just dressed in sand, and cracked pavement, and old signs.<span>  </span>The rough payment is a treat. We upped our speed toward the abandoned town of Essex – the fourth ghost town that we passed. So many abandoned places and lost stories, and again no obvious signs of water. According to the map we just had to turn left and in 10 minutes, cross the highway, and go up one more hill.<span>  </span>No problem, I thought. Then we looked in the distance and caught sight of the behemoth mountain and realized the scale of my map. Our jaws dropped.<span>  </span>Because my GPS track was a 130-mile point-to-point, the scale fooled us. The interstate was 12 miles away. The warped space-time distance of the desert got us again. Tyler and I rode as fast as we could this late in the game, thinking top speed would get us there faster. He was out of food, so I gave him my last snack. I too paid for raising the pace. It was my turn to bonk in the last half hour. Two hours later, climbing away from the sunset our brains low on sugar, we spun the pedals on the steepening grade.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/34-E_D2Impossible_2132_071559.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We had entered Mojave National Preserve. The Joshua trees at 4,000 feet stood guard like old men. In my mind, they welcomed us to a sacred desert, palm flags showing us the way up.<span> </span></p>\n<p>I was in the trance: The place in your head you get to only after incredible work and with a lack of mental diversions; Where the pavement passes underneath you like a conveyor belt of diamonds; The sky swirls like a van Gough painting. Long shadows stretched across the rippled desert as the sun dipped behind the mountain. <span> </span></p>\n<p>Part of the magic behind these efforts was the quest for some clear vision devoid of modern human influence.<span>  </span>Breathe like breeze, blood rushing like a river, a reflection of mountain silhouettes in our eyes; we for once become more a part nature than of human kind for some brief moment. <span>“</span>###! This is Epic!” Tyler blurts out.<span>  </span>Yep, I confirm this over-used word certainly rebranded in this moment.<span> </span></p>\n<p>Finally we arrived to the hole-in-the-wall campground nestled in a high saddle between the Woods Mountains and Providence Mountains in the Mojave National Preserve. A small applause erupted and I cracked a chapped smile. Round granite rocks, palms, cactus, yucca, and Joshua trees surrounded the campground. It was a beautiful place to call it a night. We rebounded quickly with a lot of Flow Recovery drink and water. We enjoyed laughing off the hardships of the day with the film team while eating incredible biryani and caramelized sweet potatoes Chef Biju cooked up.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/3-E_D3Impossible_2133_070513.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>March 3<br />\nDay 3<br />\n70 Miles: Sahara Oasis to Death Star</b></p>\n<p>We set out at 8 a.m. Despite the warming sun, the temperature was in the 30<span>’</span>s. We desperately needed sleep the night before, so we planned on this later start time. Tyler seemed to not want to leave the warmth of his sleeping bag. It didn’t sound like 70 miles would be much, but it would be far from a recovery ride. We hoped this day would be a chance to at least regain our composure.</p>\n<p>The surprisingly named New York Mountains were beautifully filled with Joshua trees and were a hard-pack dreamscape. It was amazing how once we got moving our legs turned over with ease. The golden morning light passed over the nearby cliffs and beamed to the sandy floor of Wild Horse Canyon.<span> </span></p>\n<p>We flew down a monster descent on our Grails before double track took us deeper into the heart of the <a href=\"https://en.wikipedia.org/wiki/Mojave_Desert\" target=\"_blank\">Mojave</a>. Here the desert was rich with life. Cholla cactus gardens lined our path and flowers dotted the sand. I wished we’d spotted a desert tortoise or a big horn sheep.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/122-E_D3Impossible_2133_111907.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>To our surprise, we spotted an abandoned mine. It soon became a well-worth-it detour. Like an eager kid, Tyler couldn’t resist climbing the old wooded structure. Like a more cautious kid who’d already experienced some broken bones in his life, I soon followed. From atop this contraption, we stared off into the endless distance and imagined what life would be like out there permanently and a long time ago.</p>\n<p>Then we headed north on Cima Road towards Kessler Peak Road. The mountainside roads were beautiful. The hills below the abandoned mine offered a stunningly fast rolling double track path. This riding was the stuff of my dreams!<span> </span></p>\n<p>Finally it seemed like we<span>’</span>d be given an easier day, but as we approached the pass we found ourselves rim-deep in sand once again. Pushing, riding, cursing, Tyler took off his broken shoe and walked along with one socked foot. This had become my new sort of gauge of how long a sandpit was.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/84-E_D3Impossible_2133_102529A.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We crested the pass, and were greeted by the sickest decent of the whole ride: a bermed ATV track. This was one of the opportunities I<span>’</span>d cleverly used the Strava Route Builder [https://blog.strava.com/routes] to reroute our course with the goal of avoiding the interstate. We followed a blown-out section of road and saw the film crew up ahead. Tyler wanted to jump on the interstate to finish but I thought it would be more appropriate (and legal) to ride the parallel gravel route that was really more sand than gravel. Yep, he did not like this decision, but we made it. At the very end of the day, we caught site of the massive solar arrays of the Iwanpah Solar Generation site.<span> </span></p>\n<p>There was a certain somber mood that evening. We knew the crux of the expedition was upon us. The next day was 163-miles across a massive mountain and with endless dry desert in front of us.<span> </span></p>\n<p>This was the impossible part of the Impossible Route.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/35-E_D4Impossible_2134_071423.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>March 4<br />\nDay 4<br />\nPrimm to Furnace Creek<br />\n163 Miles</b></p>\n<p>At daybreak, we got better sight of the craziest thing! From the top of our first climb, the entire valley beneath us was filled with one million reflecting mirrors, each directed at one of three glowing hot towers. This array, the <a href=\"https://en.wikipedia.org/wiki/Ivanpah_Solar_Power_Facility\" target=\"_blank\">Ivanpah Solar Power Facility</a>, is used to generate 1 million mega watt-hours of electricity. This futuristic display made quite the backdrop to the Queen stage.<span> </span></p>\n<p>The climb of Colossal Mine was the toughest we’d yet encountered. It was steep, mean, and beautiful. It forced us off our bikes and made our knees and backs hurt. To make matters worse, we were fully loaded with as much water as was humanly possible for us to carry. The rough jeep track descent was brutal. The climb was not the reward we had hoped.<span> </span></p>\n<p>To ride through this segment without flatting took incredible concentration. We looked for the smoothest lines possible. It still took forever, and we had jackhammered hands and feet and necks.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/46-E_D4Impossible_2134_082144.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Finally, after what seemed like an hour, we saw the most sumptuous super-smooth black top our eyes had ever seen. Excelsior Mine Road extended ike a long ribbon of fresh black licorice through a brown desert. We climbed and found amazing rhythm to the pedals, approaching horse thief camp on the Tacopa pass. At an elevation f 5,000 feet, cotton trees and tall grass wagged in the breeze. Precious spring water must be in the ground here somewhere, I thought as we passed an abandoned ranch. <span> </span></p>\n<p>We turned right crossing over a cattle grate into California Valley. Rolling hills on a mountain side bench lay before us twisting slightly left to right. In the far distance first sight of Death Valley a sliver of white hit sand.<span>  </span>We sped down the rocky trail and were actually able to enjoy the rolling hardpack despite its numerous rocks. Toward the bottom it became sandy again. I came into a wash going way too fast and flew over the bars smashing my shin and startling me. I was very lucky not to get hurt out here, I thought!<span> </span></p>\n<p>We continued on furnace Creek Road and the temperature climbed, finally moving fast again on the payment until I got a flat! HISSSSSS….air was leaking out of a side wall cut. It managed to seal and then we continued. Still at 1,300 feet now we passed through the small village of Tacopa. There were a few simple structures like particleboard boxes and a few random small houses, and that was about it for the town with no municipal water. <span> </span></p>\n<p>“Ah,ha!” Tyler exulted as he spotted a freestanding shed-like building. It had a painted mural of giant blue water drop on one side and said H20. Yay! I knew it had to be free water for weary travelers, but when we rolled up we saw that it was a water vending machine. It only took dollar bills. My heart sank. I asked Tyler if he had any cash? He just shook his head. We sat there contemplating the irony in this moment. We leaned our backs on the side of the building in the only available shade, realizing we were out of luck. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/24-E_D4Impossible_2134_063952.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Then along came a small beat up silver sedan with two occupants – a seldom-shaven middle age man driving and woman in the passage seat. Tyler’s charisma worked and the car slowed. The nice folks inside gave us a grocery bag full of water bottles! It was awesome and we chatted with glee and learned a bit about why some people chose to live here. The solitude and the peace and quite is like nowhere else, and the people are nice.<span> </span></p>\n<p>Once again we were revived from a lowest low to “sure, we can,” and off we rode in the big ring.<span> </span></p>\n<p>We crested a paved climb and peered over the rim and out upon the deep valley – the realm of Death, or at least that was how the scary legend tells it. I looked over at Tyler and said, “enough of the frying pan. Now into the fire!” It was a bit scary to have been riding for seven hours and only just be entering the toughest part of the route. We had nothing more than a snack’s worth of food and water enough to fill salad bowl. Sand dunes and a baked powdery valley lay below us.<span>  </span>Then my front tire wheezed out its last breath. We looked at each other in amazement. In one of the smarter pieces of our plan, we resolved to carry a spare tire. We sealed the tire with a CO2, and were back in the game!</p>\n<p>We turned right and continued descending into the valley of death. Then we faced a massive sand wash and had to walk our bikes again. We still had 65 miles left, with only two hours until sunset. A harsh reality was starting to sink in.</p>\n<p>Then, an unexpected sound drifted toward us. We heard guitar music, and it seemed to be coming from a small camper van and the distance. As we approached, we said hello and the musician – a man in a wide-brimmed desert hat – offered to play us a song! It was a soft moment of acceptance of our fate. I was soothed by the guitar serenade.</p>\n<p>We rode another two hours of vicious washboard and sand. We kept it moving, but I also knew this incredibly slow pace would have us riding well into the late night, with no food or water. We had enough punishment. Our wrists were battered, our feet were swollen, our behinds punished, and our throbbing legs with the least of our problems.</p>\n<p>I smiled knowing we had likely met our match, perhaps before Tyler realized it. We rode another 3 hours until sunset. We were out of food and almost out of water. This would make for a death march in the dark through hideous sand and washboard roads.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/77-E_D4Impossible_2134_125726.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We had to make a decision: Do we go as far as we can, or pull the pin here knowing perfectly well how it would end? If we bailed now we could at least finish the rest of the days, and have some chance of seeing the rest of the route. So we skipped the last 40 miles of sandbox and river rock, and I was just fine with it. We finally pulled over and decided we were done.<span>  </span>We took a ride to Furness Creek in the film truck. With this plan, we knew we would have a fresh start the next day and enjoy the rest of the trip.</p>\n<p>For all of the effort, I thought I’d be more disappointed not finishing the day, but rather I was quite fine with the gigantic effort we put toward trying. It didn’t bother me a bit, I suppose because I knew it wasn’t a close call, but rather very much not happening. You might even say “impossible” without outside support. <span> </span></p>\n<p>At camp that evening, we hung out had fun. I felt a sense of relief that some pressure was off. Now we could explore and enjoy the adventure. It’s interesting that I seem to learn the most when I get outside of my comfort zone.<span> </span></p>\n<p>That night it was clear to me that the greatest value in this effort was not saying we finished the whole thing inside a deadline. The greatest part of this trip was the joy and camaraderie that we had forged in trying something this over the top, with such an awesome group of humans, and incredible supporters behind us. Death Valley was the heart of this adventure, and with a realization of how alive and powerful the desert is, I only wish it had a name that was a more fitting tribute. I suggest the Valley of Wonder.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/216-E_D5Impossible_2135_052520.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>March 5<br />\nDay 5: Furnace Creek to Race Track<br />\n101 Miles</b></p>\n<p>Our heavy mood had lifted and we had great vibes, hot coffee, and some amazing cinnamon rolls that Biju had scored. It was a fresh start for the new day.</p>\n<p><span> </span></p>\n<p>Today we climbed from below sea level up one monster of paved climb. I was surprised how we had seemingly recovered, or perhaps the smooth asphalt was a contrast to the playground of sand we had become accustomed too.<span> </span></p>\n<p>Tyler saw a false summit up ahead and attacked! I countered, seeing the real summit was another kilometer away. We raced to the top as if we had just started our expedition, and somehow we were flying near 400 watts. This should’ve been impossible, having ridden 40 hours in the last four days! We high-fived and went on a detour of the Ryloyte Mine.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/86-E_D5Impossible_2135_115343A.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Adventures like this, when time stands still, are so cool.<span> </span></p>\n<p>Next we hit Titus Canyon. It was a stunning kaleidoscope of colors and shapes, and amazed us like kids in a dinosaur museum. There were serpentine tracks laid down a woven tapestry through the mountains.<span>  </span>I won’t ever be able to describe it, and the videos will only halfway do it justice. I’ll just say, it was definitely one of the most amazing descents on a gravel bike I have ever done! <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/217-E_D5Impossible_2135_052915.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We emerged through a crack in a wall-like mountainside and returned to the valley floor. We took a right on Hidden Valley Road and enjoyed a direct tailwind on pavement. We made it to Uhebe Crater just in time for sunset, and celebrated finishing the day!<span> </span></p>\n<p>Tyler noticed something was missing. “Now where the hell is the RV?”<span>  </span>A cold wind blew in and crows sailed like kites above the craters edge.<span> </span></p>\n<p>Unfortunately, our camp was another 16 miles to the south. Let’s just say it made for some sad dark riding for us to get up that mountain.<span>  </span>Thinking it was a shorter day, we didn’t have our lights, and so we hopped in the truck for the last 10 miles to the campground. We figured we had ridden at least 10 miles off course to go to the mine for photos and videos and sightseeing. So we made the most of the day, and declared the course certainly was “possible.”<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/58-E_D6Impossible_2136_095556.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>March 6</strong><br />\n<strong>Day 6: The Cerro Gordo Ghost Town</strong><br />\n<strong>72 Miles</strong></p>\n<p>The calm evening was interrupted shortly after we lay down in our sleeping bags. A devil wind howled. It picked up to a gale at one point and terrorized us. There were insane tent flapping sounds like a giant bat flapping its wings. The rain fly and one pole of our damaged tent were falling apart with 40-50 mph gusts.<span>  </span>Around 4 a.m. the tent caved in, and in our half-asleep state it felt like we were in a collapsing cave!<span> </span></p>\n<p>The wind eventually relented as the sun came up, but was still blowing at a steady 20 mph.<span> </span></p>\n<p>I rallied to get up, but Tyler was not getting up. After drinking enough coffee to kill a Chihuahua, we got a late start. We headed south, moving slowly toward a point of interest simply called “The Racetrack” where we had our chance to see one of the most beautiful places on earth. There, 60-pound rocks slide hundreds of meters, mysteriously across the mud. Our experiences in the winds the night before made it seem very clear how the rocks moved.</p>\n<p>We turned and descended Lippincott Trail. This massive downhill was totally badass, but probably more suited to a 4×4 Jeep than our bicycles. It was kind of cool because, once again, somehow we got away with it with no crashes. Let’s just say it was sketchy, real sketchy..Im not sure why it felt so awesome to ride the gravel bike down this crazy trail, it was kind of an analog approach to the route, a practicum in the absolute limits of body and bike. Yep there is the limit.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/107-E_D6Impossible_2136_014340.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>From the bottom of Saline Valley, we climbed and climbed until we saw snow in the shadows. The view around us was phenomenal. There was such contrast and 6,000 feet of relief between the brown Death Valley on our left and the 400-foot tall sand dunes below to our right that glowed yellow like small ribbons. The road became glorious hardpack. The Joshua trees laughed at us. We jumped, whooped, and howled with delight. These were the only sounds, aside from the tailwind whooshing.<span> </span></p>\n<p>After we took a break for lunch, the fastest descent of the day was a magical moment in which I realized we were surrounded by a truly ancient landscape. Humans rarely see a place almost untouched by people. The prehistoric Californian mountains were twice as big and the desert twice as wide as I could have imagined. From the valley at sea level, to the mountains rising 10,000 feet above, my eyes were stunned. Damn, California, you sure are beautiful.</p>\n<p>Of course, for these highs we paid terribly. The backside of climb Cerro Gordo punished us for more than an hour. Tyler’s knee really hurt.<span>  </span>For a time, he didn’t think he could continue. I encouraged him, and he later found his rhythm. My back started to hurt. It was so bad I had to actually sit down and stretch. I got back up and just put on foot in front of the other, knowing if it was like everything else on this trip it was bound to improve. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/184-E_D6Impossible_2136_050829.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Improve it did. Reaching the top of Cerro Gordo, we were treated to a tour of the mine museum by famous “Ghost Town Living” YouTuber Brent Underwood. He told us how 4,000 desperate minors, working 80+ mine shafts in search of silver and lead ore, once inhabited the ghost town. In perspective, we don’t have it so bad.<span> </span></p>\n<p>Our 5,000-foot descent into the sunset was like the ending of some kind of movie.<span> </span></p>\n<p><span>The </span>5,000 foot descent into the sunset was like the end of some kind of Sci- Fi movie, it was so surreal the Silver of the lakes below showing like mirrors under chin. We stop several times to shake out our hands and take photos. Once again we rode into the darkness.<span>  </span>Speeding down the pavement was fun in the dark, we had zero regrets about lingering at the sites too long, we had seen some epic shit that day the kind of ride that could have been 2 days.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/133-E_D7Impossible_2137_033242.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><span> </span><b>March 7<br />\nDay 7: Lone Pine to Bishop</b><br />\n<b>91 Miles        <span> </span></b></p>\n<p>Almost there, we set out from Lone Pine excited to zip through the Alabama Hills used in countless Hollywood movies. The snow visible on the high Sierras meant we had crossed the desert and reached the other side of the great Mojave. So very close to our finish line, a sense of relief arrived.<span> </span></p>\n<p>We splashed through several streams of glass-clear water.<span>  </span>I’ll never look at water the same again in my life. Every drop is so precious, when you’ve had none. We had fortunate tailwinds this final day, and sped our Grails along the dirt roller coaster of 20-foot tall hills.<span>   </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/56-E_D7Impossible_2137_104003.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We saw a monument in the distance. It was a white obelisk standing out against the bleak sagebrush. We soon arrived at the cemetery memorial for the internment camp called Manzanar. Here Japanese-Americans were imprisoned during World War II. There were forced from their homes into this isolated place. We stopped for a moment of silence. I wondered at the lessons I could learn here.</p>\n<p>We moved on. The wind strong at our back like propellers, we flew through sandy flat stretches filled with huge satellite dishes and flanked by massive mountains. It was a strange place. I had a flat. Tyler yelled. I went to work putting a thumb on it to stop the air from coming out, I got a plug to work and it was good thing because I’d lost my pump! Not good. No pump out here can be a big problem. Tyler had a tiny CO2, so we rode on eggshells for a while.</p>\n<p>Then, we rode through some moon dust. This was something I’ve never ridden before, and I might never ride again. It would splash like dry mud, leaving splotches on our clothing. <span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/44-E_D7Impossible_2137_100651.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We approach the final climb and we could see a winter storm was moving in over the Sierras. The sky turned into steel wool. We had some navigational challenges, but we made it to the top of our climb and saw a gem of a glacier’s snow and rock shimmer from the eastern Sierra.<span> </span></p>\n<p>The final approach into Bishop is into a purple sunset a glowing orb atop a pyramid Peak the wind ripping crosswind seems the last thing the desert to throw at us so I did. We sped through the finish. I was relieved and happy, and Tyler was over the moon joyous. He was like a kid that just spent the day in Disneyland.<span> </span></p>\n<p>Elated, Tyler and I rode up to the camper and were greeted by the smiles of our media team.</p>\n<p>“We made it!” Tyler said, doing a rear wheel skid to finish.</p>\n<p><span> </span>Slip, BAM! Tyler dropped straight to the ground and landed square on his hip. The guys all started laughing until they realized the severity of his crash. He hit an oil patch on the pavement, his tire slipped and the bike whipped out from underneath of him. The celebration was very short-lived. Tyler was in pain and we needed to get him to the hospital. Our group said bittersweet goodbyes and parted ways a bit bummed, and a bit relieved.<span> </span></p>\n<p>X-Rays soon revealed Tyler had broken his hip. So it would be. Like Greek tragedy, our quest’s highs were dealt some lowest lows.<span> </span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/192-E_D7Impossible_2137_055933.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/193-E_D7Impossible_2137_060114.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Despite my expectations of finding desolate landscapes, gloom, and physical pain, the Impossible Route: Death Valley was quite the contrary. It was the most alive I’ve ever felt. It’s a beautiful thing to be alive for the short time we are here; a gift we all give back to the earth in time. Though the ride was a great undertaking, it brought a lot of joy, wonder, and even hope that great places like this can be preserved. It is my wish that more riders go there, test themselves, enjoy the magical places along the way, and leave with a greater respect for the land and a better understanding of themselves. <span> </span></p>\n<p>____</p>\n<p><em><span>Check out the f</span>eature documentary of the Impossible Route: Death Valley expedition presented by Canyon Bicycles.  For equipment recommendations, and other tips from riders, visit <a href=\"http://www.TheImpossibeRoute.com\"><span>www.TheImpossibeRoute.com</span></a><span> </span></em></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"6894321aa0f5a6fb6182400cab872dfadea7160c4b7d63d487bd8a9cb569bbc1","category":"Cycling"}