{"title":"At least 2 hominin species lived at Laetoli site 3.6 million years ago","link":"https://arstechnica.com/?p=1818035","date":1638792951000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/trackway-800x446.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/trackway.png\">Enlarge</a> <span>/</span> A human relative left these five tracks in a 3.6 million-year-old layer of sediment at the Laetoli Fossil site in Tanzania. (credit: McNutt et al. 2021)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The first evidence of human relatives walking on two feet comes from about 70 footprints left by at least two <em>Australopithecus afarensis</em> walking across soft volcanic ash about 3.6 million years ago. <em>A. afarensis</em> was a short hominin with a jutting lower jaw, which walked upright but may also have spent some time in the trees; the most famous member of the species is a fossil woman now called Lucy.</p>\n<p>Not far from that site, another set of footprints reveals that Lucy and her kin may have lived alongside another bipedal hominin species, one that moved very differently.</p>\n<h2>The forgotten footprints</h2>\n<p>When the footprints were first spotted in 1976, the paleoanthropologists who unearthed them from what's called Site A weren't sure what to make of them. Paleoanthropologist Mary Leakey suggested they could be hominin tracks, but others weren't so sure. One anthropologist even suggested the tracks could have been left by a young bear walking on its hind legs for a few steps.</p></div><p><a href=\"https://arstechnica.com/?p=1818035#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1818035&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6897465620867fe2333ee371689d57d829ce9628a73d367ec9690e791fe1d01c","category":"Tech"}