{"title":"Centrosome amplification primes ovarian cancer cells for apoptosis and potentiates the response to chemotherapy","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002759","date":1725544800000,"content":"<p>by Frances Edwards, Giulia Fantozzi, Anthony Y. Simon, Jean-Philippe Morretton, Aurelie Herbette, Andrea E. Tijhuis, Rene Wardenaar, Stacy Foulane, Simon Gemble, Diana C.J. Spierings, Floris Foijer, Odette Mariani, Anne Vincent-Salomon, Sergio Roman-Roman, Xavier Sastre-Garau, Oumou Goundiam, Renata Basto</p>\r\n\r\nCentrosome amplification is a feature of cancer cells associated with chromosome instability and invasiveness. Enhancing chromosome instability and subsequent cancer cell death via centrosome unclustering and multipolar divisions is an aimed-for therapeutic approach. Here, we show that centrosome amplification potentiates responses to conventional chemotherapy in addition to its effect on multipolar divisions and chromosome instability. We perform single-cell live imaging of chemotherapy responses in epithelial ovarian cancer cell lines and observe increased cell death when centrosome amplification is induced. By correlating cell fate with mitotic behaviors, we show that enhanced cell death can occur independently of chromosome instability. We identify that cells with centrosome amplification are primed for apoptosis. We show they are dependent on the apoptotic inhibitor BCL-XL and that this is not a consequence of mitotic stresses associated with centrosome amplification. Given the multiple mechanisms that promote chemotherapy responses in cells with centrosome amplification, we assess such a relationship in an epithelial ovarian cancer patient cohort. We show that high centrosome numbers associate with improved treatment responses and longer overall survival. Our work identifies apoptotic priming as a clinically relevant consequence of centrosome amplification, expanding our understanding of this pleiotropic cancer cell feature.","author":"Frances Edwards","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"6899e8e1871cb1621ad48bbb7fb013704ba904e97ac1497cdf8b0fb99806a4d2","category":"Environment"}