{"title":"Infrared Response and Mechanical Properties of Coal with Load-Bearing Damage from a Hole Defect","link":"http://link.springer.com/10.1007/s10706-023-02691-3","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Primary and secondary hole defects in the process of coal mining will have an important impact on the stability of coal, therefore, the study of the mechanical and related characteristics of coal containing hole defects is of great significance for safe production and engineering practice. In this paper, the RMT-150 rock mechanics system is used to carry out uniaxial compression damage tests on coal with different hole sizes, and the whole process is recorded by simultaneous infrared radiation monitoring, based on which the influence of hole size on the change of physical properties and infrared radiation temperature response is analyzed. The results found that: the hole defect has a deteriorating effect on the strength of the coal, and the hole size is negatively correlated with the uniaxial compressive strength and elastic modulus. When the coal doesn’t contain a hole or the hole size is small, the load damage is mainly shear, and as the hole size increases, the tensile damage characteristics gradually become significant. Hole defects cause the initial differential maximum infrared radiation temperature and the initial differential lowest infrared radiation temperature of coal surface thermal images to diverge in a “ &lt; “ trend, while the initial differential average infrared radiation temperature monotonicity is obvious. The slope of linear change in the middle section of the coefficient of variation of infrared radiation temperature gradually increases with the increase of the hole, while the change of entropy value is generally higher than that of intact coal. The infrared temperature field of the coal containing hole is approximately Bi-gaussian distribution, and the instantaneous trend of the fitted distribution curve shifts to the right and overall to the right as the test progresses, and the curve shifts from a lean and tall form to a short and fat form.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"689d6774b97b63f49b48a46f4854b093ba51992bab6f71d5044e958e9f7548b3","category":"Environment"}