{"title":"Apple is working on turning AirPods into a ‘health tool’ to boost hearing","link":"https://www.macworld.com/article/1656002/airpods-update-health-features-hearing-aid-fda.html","date":1678721040000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>AirPods have been a huge success for Apple, but now the market has many earbuds that are just as good (or better), and Apple lead isn’t what it used to be. So Apple needs to evolve the AirPods, and according to a new report, health, not music, will be the next area for innovation.</p>\n\n\n\n<p>In the paid section of his latest <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-03-12/why-are-so-many-apple-executives-leaving-who-are-successors-at-apple-aapl-lf5g7j9c&amp;xcust=1-1-1656002-1-0-0&amp;sref=https://www.macworld.com/feed\">Power On newsletter</a>, Bloomberg’s Mark Gurman predicts that AirPods will be upgraded with the “ability to get hearing data of some sort” within the next two years. Gurman cites the <a href=\"https://www.macworld.com/article/673337/how-to-use-live-listen.html\">Live Listen</a> feature already in AirPods, which uses the iPhone’s microphone to capture audio that is then fed to the listener, but points out that this is not an FDA-approved feature. According to his report, that could change in a future AirPods update.</p>\n\n\n\n<p>“I believe Apple intends to upgrade the AirPods to become a health tool in the next year or two, with the ability to get hearing data of some sort,” he wrote. “Given Apple’s goal to make health one of its next big initiatives, I wouldn’t be surprised if the AirPods do eventually take on those [Live Listen] functions more officially.”</p>\n\n\n\n<p>Gurman does not specify what other features Apple could implement, or if the AirPods would be redesigned to accommodate such features. Hearing aids may have features such as directional microphones, speech isolation, natural sound reproduction, and the ability to recognize and realistically playback using the wearer’s own voice.</p>\n\n\n\n<p>Apple’s focus on health started with the Apple Watch and it has been a successful market for the company because its health features are executed well and work seamlessly with the device. So it makes sense for Apple to follow suit with the AirPods and take the next year or two to make sure the features are done in the proper way.</p>\n\nHeadphones, Health and Beauty, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"689e5b405b255ed46b6155007131af4dd84516200a41632373b749d10ba7098e","category":"Apple"}