{"title":"Predicting Melanoma Immunotherapy Efficacy: Neural Network Models with Gene Expression and Clinical Data","link":"https://www.preprints.org/manuscript/202405.1160/v1","date":1715930009000,"content":"Immunotherapy, particularly Immune Checkpoint Blockade (ICB), has demonstrated significant efficacy in treating melanoma in recent years. However, accurately predicting treatment success and avoiding ineffective therapies remains an unresolved challenge. Therefore, this study aims to develop statistical models utilizing neural networks to forecast the effectiveness of immune checkpoint therapies for melanoma patients. Our models primarily rely on Artificial Neural Networks (ANN) to anticipate both Overall Survival (OS) and Progression-Free Survival (PFS) among melanoma patients undergoing anti-CTLA4 and anti-PD1/anti-PDL1 therapy. We incorporate gene expression data, measured in Transcripts per Million (TPM), derived from bulk tumor RNA-sequencing datasets. Additionally, clinical variables such as gender, age, and treatment type are factored into our analysis. The ANN underwent optimization to attain the highest feasible precision in anticipating the predetermined survival outcome. Issues stemming from high-dimensional data, such as overfitting, were tackled through regularization and feature selection methods. Consequently, the ANN-based model incorporating feature selection exhibited the capacity to forecast survival (PFS) in response to ICB therapy with a maximal precision of 86%. Conversely, the ANN lacking feature selection but incorporating regularization achieved accuracies of up to 72% for PFS and 71% for OS, correspondingly. In order to confront the challenge posed by limited patient samples and to assess replicability, the model underwent training and validation based on the amalgamation of all five datasets. However, this amalgamation failed to enhance predictive performance, necessitating further investigations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"68b079dde2fea27ce410913c941a8c527c5a1760df0fe5639dae3f587d4f3ea6","category":"Interdisciplinary"}