{"title":"88 The impact of trait measurement error on quantitative genetic analysis","link":"https://academic.oup.com/jas/article/102/Supplement_3/25/7757173?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The accuracy of trait measurements greatly affects the quality of downstream genetic analyses. With the advancement of three-dimensional sensor cameras and computer vision techniques, there is a growing trend to adopt these new tools for on-farm data collection as they can reduce labor and facilitate the collection of large phenotypic data sets across diverse populations. Pig body weight (BW) values estimated 1) manually using a digital scale, and 2) from videos using computer vision can be considered as two different measurements of the same trait because the source of phenotyping error is different. In other words, BW is controlled by the same set of causal loci, but by different phenotyping errors, and thus has different heritabilities. Previous research has shown that trait measurement error, defined as the difference between manually collected phenotypes and image-derived phenotypes, may be influenced, at least in part, by genetic factors. This suggests that trait measurement error is systematic rather than random, and thus, more likely to lead to misleading downstream results when used in quantitative genetic analysis. Therefore, in this study, we investigated the impact of trait measurement error on the genetic analysis of pig BW. Specifically, the objectives of this study were to 1) estimate trait measurement error from manually collected and image-derived pig BW, and 2) estimate genomic heritability for trait measurement error. Ground-truth BW data were collected manually using a digital weighing system for 540 pigs at five different time points over 3 mo. In addition, image-derived BW were estimated by training models on video data captured by a depth camera. A total of four image analysis machine learning and deep learning models were used, including adaptive thresholding segmentation coupled with either ordinary least squares or random forests, and deep regression based on ResNet50 and Xception. Coefficients of determination for image-derived and ground truth BW were at least 0.95 across time points. Genomic heritability estimates for manual and image-derived BW were mostly identical across time points (ranging from 0.23 to 0.54), indicating that manually measured and image-derived phenotypes yield the same genetic results. In addition, genomic heritability estimates for measurement error were consistently negligible, indicating that trait measurement errors in pig BW do not contain systematic errors that could bias downstream genetic analysis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"68b264e24ef023b4220c0a218f40a2e7a3cd7ad8052555ee893094ac83265d88","category":"Environment"}