{"title":"Environmental drivers of food webs in charr and trout‐dominated cold‐water lakes","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12851?af=R","date":1721059152000,"content":"<h2>Abstract</h2>\n<p>Cold-water lakes situated in high latitudes and altitudes have pivotal socio-ecological importance both globally and locally. However, they are increasingly threatened by multiple anthropogenic stressors, such as climate change, hydropower and invasive species. The development of efficient management strategies is therefore urgently needed and requires a comprehensive understanding of the factors influencing the biodiversity and ecological processes of these ecosystems. We provide a holistic knowledge base for informed future research and management by addressing the interplay between local and global environmental drivers of food webs in Arctic charr (<i>Salvelinus alpinus</i>, Salmonidae) and brown trout (<i>Salmo trutta</i>, Salmonidae) dominated cold-water lakes in Fennoscandia. The trophic niche and population dynamics of these generalist top consumers provide extensive insights into the effects of natural and anthropogenic drivers on food webs in intensively studied Fennoscandian cold-water lakes, covering marked biogeographical gradients in abiotic and biotic conditions. Drawing on a synthesis of existing literature, our focus is on three pivotal drivers: (1) lake location and connectivity, (2) lake area and morphometry and (3) fish community composition. These drivers significantly influence the complexity and the origin and flow of energy in lake food webs, and ultimately the size structure of the charr and trout populations. Furthermore, we highlight ongoing environmental changes in Fennoscandian cold-water lakes caused by hydropower and invasive species. Finally, we identify crucial knowledge gaps and propose management actions for improving the future state of Fennoscandian cold-water lake ecosystems and their charr and trout populations.</p>","author":"Henna Kangosjärvi, \nPer‐Arne Amundsen, \nPär Byström, \nAnders G. Finstad, \nMichael Power, \nJavier Sánchez‐Hernández, \nAntti P. Eloranta","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"68b3e91c83044b36675207975936f0049a15348941136c4b7023bc73bc98a25e","category":"Environment"}