{"title":"Harnessing AutoDesign and Open-Source Digital Twin Simulations for EV Charging Station Location Selection","link":"https://www.preprints.org/manuscript/202405.0791/v1","date":1715596227000,"content":"A pivotal strategy in decarbonizing the transport sector is by transitioning from internal combustion engine vehicles (ICEVs) to electric vehicles (EVs), especially if they are charged with renewable energy. To provide an incentive to the common populace to switch to EVs, cities should set up - or enable or even encourage the private sector to do so - electric vehicle charging stations (EVCS) at multiple and suitably accessible locations. This paper aims to present a digitaltwin-enabled methodology study for selecting the most suitable possible locations to establish EVCS with consideration of the low voltage (LV) network operation in terms of power losses, active and reactive power in EV charging demand and the effect of the EVCS on the transformers, based on examples in Newcastle upon Tyne (England, UK). It also evaluates the most suitable type of charger that could be installed at these locations by studying the estimated traffic, cost and impact of the EVCS on the power grid, both at peak and off hours. This paper demonstrates how digitaltwin technologies, such as the web-based tool AutoDesign by Northern Powergrid and EA Technology and open source Pandapower can be used for identifying the most viable and cost-effective locations to connect EVCSs to a Distribution Network Operators (DNO)’s LV network. The results of the analysis indicate that with the installation of the most suitable type of EVCS in a particular location, the local power grid would not be significantly affected at any hour of the day.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"68b8faf87b399495dbd9fe3b094bf089b521e3690b3efef7674b7767e3d2cb5d","category":"Interdisciplinary"}