{"title":"What does your partner want? Using a gender equality lens to assess partner support and involvement in family planning in Uganda","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003264","date":1716991200000,"content":"<p>by Bolanle Olapeju, Anna Passaniti, Paul Odeke, Zoé Mistrale Hendrickson, Judith Nalukwago, Pallen Mugabe, Leonard Bufumbo, Musa Kimbowa, Fiona Amado, Emmanuel Kayongo, Mabel Naibere, Nanah Nanyonga, Glory Mkandawire, Richard Mugahi, Tabley Bakyaita, Richard Kabanda, J. Douglas Storey</p>\r\n\r\nIt is unclear if there are any differences in the ways men and women perceive partner support in the context of family planning. The USAID-funded Social and Behavior Change Activity (SBCA) in Uganda explored male versus female priorities in the decision-making considerations and preferred measures of partner support related to family planning. Data were from a cross -sectional nationally representative telephone survey of 1177 men and women aged 18–49 years old in sexual partnerships. Key measures included current family planning use (Are you or your partner currently doing anything to prevent or delay becoming pregnant?); family planning decision-making considerations (In your experience, which of the following are the three most important considerations as you make family planning decisions?); and preferred partner support (What level of involvement would you like to see from your partner in your family planning decisions?). Multivariable logistic regressions explored factors associated with decision-making priorities and preferred partner support, adjusting for sociodemographic confounders. Two-thirds (66%) of men and women wanted a high level of involvement from their partner, which was associated with higher odds of using family planning (aOR: 2.46, 95% CI: 1.87–3.24). Specific ways partners could be involved included accompanying them to health services (39%), permitting them to get family planning services (26%), and jointly discussing family planning options (23%). Of note, more women wanted their partner to accompany them (45%) than men (33%) while more men (29%) wanted to jointly discuss options than women (15%). Social and behavior change interventions should operationalize partner support differently for men and women. Study findings were used to implement a health campaign that explicitly encouraged partner dialogue and support across the various life stages; empowering women with knowledge and skills to have honest conversations with their partners about birth spacing and timing.","author":"Bolanle Olapeju","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"68bb35f24a7508f5c5dd6541c76803eed8b7a777feda90c6c281a5314fefe73c","category":"Environment"}