{"title":"Climate mitigation potential of natural climate solutions and clean energy on The Nature Conservancy properties in California, USA","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311195","date":1729519200000,"content":"<p>by Kristen N. Wilson, Daniel W. Salzer, Michelle C. Passero</p>\r\n\r\nNatural climate solutions (NCS) and transitioning to clean energy can reduce greenhouse gases and contribute to mitigating climate change. Private landowners with large holdings, such as conservation organizations like The Nature Conservancy, have set ambitious goals to reduce net emissions and increase sequestration on their lands by implementing NCS. We assessed the potential carbon dioxide-equivalent (CO2e) reduction from feasible NCS, specifically implementing new restoration and agricultural management activities, and transitions to clean energy on The Nature Conservancy, California chapter’s fee-owned and conservation easement properties. We compared the total CO2e reduction from potential new NCS activities to the impact from ongoing NCS activities, the chapter’s 2030 goal, and the state’s reduction goal for natural and working lands to understand how the organization can contribute to climate mitigation. We found that implementing NCS on 37 fee-owned properties (63,175 MTCO2e year –1) and clean energy on 10 fee-owned properties (488 MTCO2e year –1) combined would not reach the chapter’s 2030 goal (72,000 MTCO<sub>2</sub>e year –1), and there can be tradeoffs between maximizing CO2e reduction and protecting conservation values. However, ongoing changes to forest management on a single conservation easement property, where another non-profit harvests timber and sells carbon credits, currently contributes 147,749 MTCO2e year –1, more than two times the 2030 goal and representing 7.4% of the state’s annual goal. Our results suggest that The Nature Conservancy, California chapter would need to implement NCS on some of the conservation easements or consider future land protection deals with carbon rich ecosystems or high impact NCS to reach their CO2e reduction goal.","author":"Kristen N. Wilson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"68bde060b3b8f4a00bba6576e9bdadfaa392bfc25718b12c13d89a0652e75a6a","category":"Interdisciplinary"}