{"title":"Artificial Intelligence in Strategic Management: Examining Novel AI Applications in Organizational Strategic Decision-Making","link":"https://www.preprints.org/manuscript/202409.1330/v1","date":1726609834000,"content":"This study investigates the emerging applications of Artificial Intelligence (AI) in strategic management and its impact on organizational decision-making processes. As AI technology rapidly advances, it has become a crucial component in redefining organizational strategies. According to a global survey by the Boston Consulting Group, over 60% of executives believe that AI can significantly improve key performance indicators and enhance opportunities for strategic differentiation and sustainable competitive advantages. Using a descriptive-survey methodology and questionnaire-based data collection, this research examines the influence of AI on strategic decision-making in large organizations. The statistical population comprises senior managers across various industries, with sampling conducted through convenience sampling. Data analysis was performed using SMART-PLS software, revealing significant improvements in strategic decision-making processes through AI implementation. The study demonstrates that AI, by analyzing complex data sets and identifying hidden patterns, assists managers in making more optimal decisions. Furthermore, AI's predictive analytics capabilities contribute to enhanced strategic planning and risk mitigation in decision-making processes. The research findings indicate a statistically significant positive correlation (r = 0.72, p &lt; 0.001) between AI adoption and the quality of strategic decisions. This paper concludes by proposing that organizations should leverage AI as a tool to strengthen their organizational strategies, while emphasizing the importance of ethical considerations and human oversight. The implications of this research extend to both academic and practical domains, offering insights into the integration of AI in strategic management processes and its potential to revolutionize organizational decision-making paradigms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"68c5f3e9116146d9232ff0645e588e7fce9bf0cecee8c18240b5a9009e977d38","category":"Interdisciplinary"}