{"title":"Distribution and impacts of invasive plant species in Gullele Botanical Garden","link":"https://www.preprints.org/manuscript/202405.0445/v1","date":1715157293000,"content":"Invasive species are non-native organisms that are introduced to a particular environment with a potential to spread from the place of introduction and cause biodiversity loss. This research was done in Gullele Botanical Garden with the objective of advancing management strategies for invasive and potentially invasive species by examining their abundance, distribution, impacts. Proportional number of plots with a size of 10m by 10m was laid at each land use types to collect vegetation and environmental data. The impact rank was analysed as a data frame using the R-statics packages, which shows the lower and higher impact rate ranges for the sampled land use types. ArcGIS was used to map the spatial distributions of each species. A total of 2550 individuals from 12 families comprising 16 invasive and potentially invasive species have been recorded in 40 sample plots across all sampled land use types. The highest species abundance appeared near the roadside among the sampled plots. Acacia decurrens, Cyathula uncinulata, and Acacia melanoxylon were the three most predominant species, had a substantial contribution to the high impact on the native species. Either intentionally by planting for their advantageous qualities or unintentionally associated with other seeds or other vectors, invasive and potentially invasive species were introduced into the garden. Although there are various techniques to control invasive species, mechanical controlling mechanisms like hand-weeding, uprooting, cutting, and rehabilitation with native species, along with regular monitoring, are highly recommended for the current challenge in the garden.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"68c60b5fe6696fe9e60b50632b8db587a76c9252908b3d2196efc12bb707d77a","category":"Interdisciplinary"}