{"title":"The effect of downstream translocation on Atlantic salmon Salmo salar smolt outmigration success","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15928?af=R","date":1728731076000,"content":"<h2>Abstract</h2>\n<p>Trap and transport, the capture and subsequent translocation of fish during the freshwater phase of their migration, is becoming more common as a management intervention. Although the technique can be successful, it is costly and can have unintended effects on the fish being transported. This study investigates whether trap and transport can be used to increase the migration success of Atlantic salmon, <i>Salmo salar</i>, smolts in naturally flowing rivers. Seaward-migrating <i>S. salar</i> (<i>n</i> = 294) from two UK rivers were tracked using acoustic telemetric techniques. Outmigration success and timing were compared between non-transported (released at the original in-river capture site) and transported (released ca. 23 km downstream of the capture site) individuals. Downstream translocation increased the proportion of fish that successfully migrated to marine waters, and there was no indication that transport reduced post-release survival. The post-release migration speed of transported fish was slower than expected but this was likely a function of their advanced migration timing rather than an inhibition of their capacity to migrate. These results suggest that trap and transport can increase the outmigration success of <i>S. salar</i> smolts, but the earlier river exit dates of transported fish could negatively affect their survival at sea.</p>","author":"Ruaidhri Forrester, \nHannele M. Honkanen, \nJessie Lilly, \nAmy Green, \nJessica R. Rodger, \nBrian A. Shields, \nPhilip Ramsden, \nJ. Peter Koene, \nMelanie Fletcher, \nColin W. Bean, \nColin E. Adams","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"68d8e16d507facd19a05019dbdd81866ed32ac7022f114d887655d976dc80f20","category":"Environment"}