{"title":"Insufficient and biased representation of species geographic responses to climate change","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17408?af=R","date":1720594800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/5b049877-9f3e-4597-8c8d-9a56b6adb9bf/gcb17408-toc-0001-m.png\" alt=\"Insufficient and biased representation of species geographic responses to climate change\" />\n<p>We use a database of documented potential climate change-related species range changes to determine how research is spread across the species and geographic space of the world. We find that there are biases in these studies towards certain groups of organisms, parts of the species' ranges and parts of the world. These findings offer guidance for future data collection that provides a strong foundation for managing the biological impacts of climate change.</p>\n<br />\n<h2>Abstract</h2>\n<p>The geographic redistributions of species due to a rapidly changing climate are poised to perturb ecological communities and significantly impact ecosystems and human livelihoods. Effectively managing these biological impacts requires a thorough understanding of the patterns and processes of species geographic range shifts. While substantial recent redistributions have been identified and recognized to vary by taxon, region, and range geometry, there are large gaps and biases in the available evidence. Here, we use the largest compilation of geographic range change observations to date, comprised of 33,016 potential redistributions across 12,009 species, to formally assess within- and cross-species coverage and biases and to motivate future data collection. We find that species coverage varies strongly by taxon and underrepresents species at high and low latitudes. Within species, assessments of potential redistributions came from parts of their geographic range that were highly uneven and non-representative. For most species and taxa, studies were strongly biased toward the colder parts of species' distributions and thus significantly underrepresented populations that might get pushed beyond their maximum temperature limits. Coverage of potential leading and trailing geographic range edges under a changing climate was similarly uneven. Only 8% of studied species were assessed at both high and low latitude and elevation range edges, with most only covered at one edge. This suggests that substantial within-species biases exacerbate the considerable geographic and taxonomic among-species unevenness in evidence. Our results open the door for a more quantitative accounting for existing knowledge biases in climate change ecology and a more informed management and conservation. Our findings offer guidance for future data collection that better addresses information gaps and provides a more effective foundation for managing the biological impacts of climate change.</p>","author":"Evan J. Parker, \nSarah R. Weiskopf, \nRuth Y. Oliver, \nMadeleine A. Rubenstein, \nWalter Jetz","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"68dbedbde8a5fcf4daf4009589203988e75b2ed679a69738c7a70ee2e8725cf7","category":"Environment"}