{"title":"\"I'm actually on my dream team\" 22-year-old Mikayla Harvey on joining Canyon//SRAM","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mikayla-harvey-canyon-sram","date":1614883225000,"content":"\n      <p><span style=\"font-weight: 400;\">“Last year was very difficult, our team, we were quite like a special unit together, we all got along really well.” Harvey says of the now-defunct Equipe Paule Ka. “We were able to race so well as a group and were all kind of developing together. So then to have everything fall apart was really hard at the time because we all basically had to go separate ways and find new teams.” </span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">After the team’s original sponsors were unable to continue due to the pandemic, management were left scrambling to secure new backers for the Continental squad. Clothing brand Paule Ka eventually stepped in, signing a four-year deal, but a few months later, in October, they pulled the plug, leaving Harvey and her teammates without contracts. “Last year, it wasn't even a surprise that everything fell apart, because I was so used to things just going wrong. So I kind of got used to adversity,” says Harvey. </span></p>\n<p><span style=\"font-weight: 400;\">“I'm so glad we all actually found new teams in the end,” she added. “We're in almost a better situation now, a door closes and new opportunities open up.” </span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mikhayla_portrait_1024x1024.jpg?v=1614879200\" alt=\"\"></span></p>\n<p><em><span style=\"font-weight: 400;\">Mikayla Harvey in her 2021 Rapha team kit at <a href=\"https://www.wmncycling.com/team/\" target=\"_blank\" rel=\"noopener noreferrer\">Canyon//Sram</a> (Photo credit: Thomas Maheux)</span></em></p>\n<p><span style=\"font-weight: 400;\">Despite the late news of the termination of her team, Harvey can’t have been short of opportunities. Part of a wave of talented young riders emerging from the women’s peloton over the last few years, achieving results far beyond the expectations of their age and experience, Harvey is among the most promising. “I've always been into cycling,” she says, “I got my first bike when I was like two or three, just like one of those push bikes. I have always had a bike with me. I come from a family who's just really into the sport.”</span></p>\n<p><span style=\"font-weight: 400;\">So “into the sport” is Harvey’s family that when she was approaching the end of her junior years and facing diminishing racing opportunities at home in New Zealand, her parents built a team from scratch. </span></p>\n<p><span style=\"font-weight: 400;\">“It was coming out of under 15 or under 17, that age group. There wasn’t really anything for us girls,” she says. “So my parents created this team called Mike Greer Homes Women's Cycling and that allowed us to do this local racing series in New Zealand and go over to Australia to race.” </span></p>\n<div style=\"text-align: left;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_5825_1024x1024.jpg?v=1614877170\" alt=\"\" style=\"float: none;\"></div>\n<meta charset=\"utf-8\">\n<p><em><span style=\"font-weight: 400;\">Photo credit: Simon Wilkinson/SWPix.com </span></em></p>\n<p><span style=\"font-weight: 400;\">It wasn’t just Harvey herself who benefitted from her parents’ generosity, two other young prospects in the WorldTour; Harvey’s new team mate Ella Harris, and Niamh Fisher-Black of SD Worx are also products of the team. “A whole bunch of us come from that same team,” says Harvey, “I think it's really special, what my parents did, to just give us the opportunity to do these races.” </span></p>\n<div style=\"text-align: left;\"></div>\n<p><span style=\"font-weight: 400;\">Harvey has come full circle as she now joins Harris at Canyon//SRAM for her first season in a WorldTour team. “It's so cool being on the same team as Ella now,” she says, “I literally remember we were like 11, or 12, when we first started racing against each other in triathlon. So the fact that we both grew up at the same level, and then eventually made it over to Europe and now on the same team is really special.” </span></p>\n<p><span style=\"font-weight: 400;\">Harris and Harvey might have started their careers on the same road, but their respective journeys into the WorldTour have been vastly different. While Harris gained her spot on the squad after winning the 2019 Zwift Academy, Harvey took a more traditional route; spending two years racing in America straight after high school where her parents once again supported her. “It was like a pro team but we weren't getting paid anything,” she says. “So my parents were actually helping me out with food money so I didn't have to work part time as well. So if it wasn't for my family there's no way I would have made it over in Europe.” </span></p>\n<p><span style=\"font-weight: 400;\">As privileged as her position may be, Harvey still owns the hard work and is grateful for every opportunity. “That's just made me really grateful to actually have made it here,” she says. “I didn't know that it would be possible to come from New Zealand and make it as a pro.”</span></p>\n<p><span style=\"font-weight: 400;\">In riding for Canyon//SRAM, Harvey’s childhood dreams have literally come true. “I remember being like 15/16 and my favourite team at the time was Specialized Lululemon,” she says, “I was a mega fan. And it's funny because that's the old Canyon//SRAM. So it's like, I'm actually on my dream team.” </span></p>\n<p><span style=\"font-weight: 400;\">“A lot of the riders have been like idols to me.” </span></p>\n<div style=\"text-align: start;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ThomasMaheux_Girona_Harvey_THSMHX121827-1440x810_1024x1024.jpg?v=1614877877\" alt=\"\" style=\"float: none;\"></div>\n<p><span style=\"font-weight: 400;\">Despite being somewhat star struck by her new team mates, Harvey is making the most of their collective experience. “I've got so much to learn, these girls have been racing bikes for quite a while,” she says. “I'm just like... a little sponge, just absorbing all this new information.” “I think it's going to be a perfect environment for me to really continue to develop and and really flourish as a rider”</span></p>\n<p><span style=\"font-weight: 400;\">If Harvey follows the same trajectory she has been on thus far she will quickly find herself becoming one of the team’s star riders. The young Kiwi is realistic, however, about her need to develop, “I think this year, it's really important for me to just settle into the new team, kind of get comfortable in this new environment,” she says. “I also will have opportunities to really show myself as a rider. I've still got a lot to learn and it will be cool being able to follow Kasia and see how she's able to lead the group.”</span></p>\n<p><span style=\"font-weight: 400;\">For 2021, she has her sights set on the races where she got her best results in 2020, such as Fleche Wallonne where she placed 7th. “I'm really excited for the Ardennes.” With Niewiadoma having stated that she will sit the Giro Rosa out, Harvey might be presented with another chance to lead at the 10-day race. “The Giro is always going to be quite special to me so I'll be really going quite hard for that one,” she says.</span></p>\n<div style=\"text-align: left;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ThomasMaheux_Girona_Harvey_THSMHX122505-1440x810_1024x1024.jpg?v=1614877357\" alt=\"\" style=\"float: none;\"></div>\n<p><span style=\"font-weight: 400;\">She is cautious of setting too many targets, however: “I'm still young, so I don't want to put too much pressure on myself,” she says. “But at the same time, there's always opportunities and when they arise, I won't not go for them.” </span></p>\n<p><span style=\"font-weight: 400;\">Undoubtedly inspired by her parents, Harvey is already hoping to be able to use her position to help up and coming Kiwi riders, “I'd like to be able to inspire the next generation of riders coming from New Zealand, just to show them that it is possible to be a professional, and you just have to work hard, but it's not impossible,” she says.</span></p>\n<p class=\"p3\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Newsletter_header_Rapha_banner_1_1f836b58-8628-4b22-9a4d-ae47a1f735d2_1024x1024.jpg?v=1614182000\" alt=\"\"></a></p>\n<meta charset=\"utf-8\">\n<p class=\"p3\"><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\">Discover our women's newsletter</a></em></strong></p>\n<p>“I'd also love to be able to help riders when they’re coming over to Europe. I'd love to be able to host them and just to help them learn the ropes because it is a little difficult coming straight over to Europe, it's a whole new world and it can get quite confusing, but to be able to be a mentor in the future, I think would be really awesome”</p>\n<p><span style=\"font-weight: 400;\">Before any of that, however, there’s the matter of her first race with her new team this weekend at Strade Bianche. Harvey managed an impressive 12th place in the sweltering August conditions last year, “I like the hard conditions,” she says. “If it's really hot or super cold and muddy like I tend to thrive in bad conditions. I don't exactly enjoy it, but I do better.” She will be pleased, then, to see that the forecast is for rain.</span></p>\n<h3><span style=\"font-weight: 400;\">Behind Canyon//SRAM</span></h3>\n<p><span style=\"font-weight: 400;\">The Canyon//SRAM team comprises fourteen riders from nine different countries. Between them, the riders have a host of national and world titles as well as WorldTour wins. </span></p>\n<p><span style=\"font-weight: 400;\">The team was formed in 2016, with <a href=\"https://go.skimresources.com?id=173655X1642184&amp;xs=1&amp;url=https%3A%2F%2Fwww.rapha.cc%2Fgb%2Fen%2F\" target=\"_blank\" rel=\"noopener noreferrer\">Rapha</a> as a driving force behind the team at a time when the brand had just split with Team Sky. Tiffany Cromwell and Hannah Barnes were the biggest names on the initial squad, and it's a testament to the team environment that both of them remain part of the team five years later.</span></p>\n<p><span style=\"font-weight: 400;\">It boasts an impressive roster, including </span><span style=\"font-weight: 400;\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/kasia-niewiadoma-pole-position\">Kasia Niewiadoma</a> and Chloe Dygert, and a host of victories on the World stage. But the team has also attracted attention for smart initiatives, such as offering a pro contract to the winner of the Zwift Academy every season.</span></p>\n<p><span style=\"font-weight: 400;\">With title sponsors Canyon and SRAM providing the team with the best equipment and wearing cutting-edge kit from world-renowned brand Rapha, the team is also among the sharpest turned-out in terms of kit and bikes.</span></p>\n<h4>Team list</h4>\n<p>Alice Barnes</p>\n<p>Hannah Barnes  </p>\n<p>Neve Bradbury  </p>\n<p>Elise Chabbey </p>\n<p>Tiffany Cromwell </p>\n<p>Chloe Dygert </p>\n<p>Ella Harris </p>\n<p>Mikayla Harvey </p>\n<p>Lisa Klein </p>\n<p>Hannah Ludwig </p>\n<p>Katarzyna Niewiadoma </p>\n<p>Alexis Ryan </p>\n<p>Omer Shapira</p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"68df87313f6afb8bf77c64003bda373a019a25c366007460e0cc1933684c542e","category":"Cycling"}