{"title":"ScotRail introduces the UK's first active travel carriages with 20 bike racks","link":"https://www.cyclist.co.uk/news/9948/scotrail-introduces-the-uks-first-active-travel-carriages-with-20-bike-racks","date":1627916241000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>2 Aug 2021</span></div>    </div></div><p>\nHighland Explorer carriages will initially run on the West Highland Line from Glasgow to Oban with space for 20 bikes and 24 people</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/08/scotrail_highland_explorer.jpg?itok=nbWKIofM\" />  </div>\n<div>\n      <p> ScotRail has introduced three 'first of their kind' Highland Explorer carriages, each featuring 20 bike racks, to open up the country to cyclists and outdoor enthusiasts.</p>\n<p>Initially running on the West Highland Line from Glasgow to Oban via Loch Lomond and The Trossachs, they're decked out to carry up to 20 bikes including accommodation for tandems and 24 people with an e-bike charging point, free Wi-Fi, USB sockets and power points at seats.</p>\n<p><a href=\"/in-depth/1150/argyll-bute-big-ride\" target=\"_blank\"><em>Check out Cyclist's Big Ride in Argyll and Bute in western Scotland</em></a></p>\n<p><em><br />\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/08/scotrail_highland_explorer_2.jpg?itok=83HhlnGS\" />  </div>\n</div>\n<p></p></em></p>\n<p>The carriages will be easy to spot with a special paintjob by artist Peter McDermott and spots must be booked in advance, though specific seats are only chosen once on board, so get there in plenty of time for the best view of west Scotland.</p>\n<p>Alex Hynes, ScotRail managing director, said, 'This is a landmark moment for lovers of Scotland's great outdoors. For the first time in the UK, a train carriage will be able to accomodate up to 20 cycles, which will allow more people than ever before to enjoy the majestic scenery this country has to offer.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/in-depth/9968/who-are-the-favourites-for-the-2021-vuelta-a-espana\">Who are the favourites for the 2021 Vuelta a Espana?</a></div>    </div></div><p>\nMeanwhile Grace Martin, Scotland director at Sustrans, which has worked closely with ScotRail on the project, said, 'Even more people can now experience iconic west coast routes like the Caledonia Way and enjoy world famous Highland hospitality along the area's many family-friendly day rides.</p>\n<p>'The carriages are a great example of how we can work together to make walking, cycling and public transport more attractive and convenient options, giving people the opportunities to make more of their journeys without the need for a car.'</p>\n<p>For more information visit <a href=\"https://www.scotrail.co.uk/scotrail-highland-explorer\" target=\"_blank\">scotrail.co.uk</a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"68e943861378a389d8771647a47af0812d5cd2a99aae23438c5cf292367b5764","category":"Cycling"}