{"title":"Garmin’s 2 new smartwatches want to make the casual athlete more advanced","link":"https://arstechnica.com/?p=1759233","date":1619089200000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Garmin-Venu-2-2S-Ars-Technica-13-800x450.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/Garmin-Venu-2-2S-Ars-Technica-13.jpeg\">Enlarge</a> (credit: Garmin)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Garmin has <a href=\"https://fave.co/3grSKMh\" target=\"_blank\">just launched</a> its latest pair of smartwatches, the Garmin Venu 2 and Venu 2S, aimed at those who feel Apple Watches and typical Android smartwatches just don’t give enough health and fitness data. Garmin has a seemingly bottomless roster of smartwatches, and most cater to those who train rather than just exercise casually.</p>\n<p>The Venu 2 and 2S seem suited best for somewhat serious to moderately serious trainers who want data informed by all of the latest wearable sensors (SpO<sub>2</sub>, GPS, HR). At the same time, it covers its smartwatch bases quite well with a vibrant AMOLED touchscreen, onboard music storage, smartphone notifications for iPhone and Android devices (including texts you can reply to on Android), and 11-day battery life.</p>\n<p>Add in rapid recharging, which gives you a day of smartwatch use from a 10-minute charge (or 1 hour of GPS with music playback) and all of this should add up to quick-and-easy, everyday integration into your life and routines. Garmin wants to help this along with a revamped UI aesthetic to match the sharper, more colorful AMOLED display and a series of new aggregated metrics that explain what all the data it’s gathering actually means for your health.</p></div><p><a href=\"https://arstechnica.com/?p=1759233#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759233&amp;comments=1\">Comments</a></p>","author":"Corey Gaskin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"68edfd38c97f6272b64912b13d181e25436371e3c9f6e3f190e89a52d0f67fa2","category":"Tech"}