{"title":"Boston Dynamics’ Atlas tries out inventory work, gets better at lifting","link":"https://arstechnica.com/?p=2001322","date":1707251005000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/atlas-2-980x668.jpg\" /></div>\n          <p>\n            Boston Dynamics' Atlas research robot.                          [credit:\n                              Boston Dynamics                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>The world's most advanced humanoid robot, Boston Dynamics' Atlas, <a href=\"https://www.youtube.com/watch?v=SFKM-Rxiqzg\">is back</a>, and it's moving some medium-weight car parts. While the robot <a href=\"https://arstechnica.com/gadgets/2021/08/boston-dynamics-shares-an-incredible-behind-the-scenes-look-at-robot-building/\">has mastered</a> a lot of bipedal tricks like walking, running, jumping, and even backflips, it's still in the early days of picking stuff up. When <a href=\"https://arstechnica.com/gadgets/2023/01/boston-dynamics-atlas-robot-grows-a-set-of-hands-attempts-construction-work/\">we last saw</a> the robot, it had sprouted a set of rudimentary hand <a href=\"https://www.youtube.com/watch?v=g2_zb6oyep8\">clamps</a> and was using those to carry heavy objects like a toolbox, barbells, and a plank of wood. The new focus seems to be on \"kinetically challenging\" work—these things are heavy enough to mess with the robot's balance, so picking them up, carrying them, and putting them down requires all sorts of additional calculations and planning so the robot doesn't fall over.</p>\n<p>In the latest video, we're on to what looks like \"phase 2\" of picking stuff up—being more precise about it. The old clamp hands had a single pivot at the palm and seemed to just apply the maximum grip strength to anything the robot picked up. The most delicate thing Atlas picked up in the last video was a wooden plank, and it was <a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/22-1-1440x982.jpg\">absolutely destroying</a> the wood. Atlas' new hands look a lot more gentle than The Clamps, with each sporting a set of three fingers with two joints. All the fingers share one big pivot point at the palm of the hand, and there's a knuckle joint halfway up the finger. The fingers are all very long and have 360 degrees of motion, so they can flex in both directions, which is probably effective but very creepy. Put two fingers on one side of an item and the \"thumb\" on the other, and Atlas can wrap its hands around objects instead of just crushing them.</p>\n<div><div></div><p>Sadly all we're getting is this blurry 1 minute video with no explanation as to what's going on.  </p></div>\n<p>Atlas is picking up a set of car struts—an object with extremely complicated topography that weighs around 30 pounds—so there's a lot to calculate. Atlas does a heavy two-handed lift of a strut from a vertical position on a pallet, walks it over to a shelf, and carefully slides it into place. This is all in Boston Dynamics' lab, but it's close to repetitive factory or shipping work. Everything here seems designed to give the robot a manipulation challenge. The complicated shape of the strut means there are a million ways you could grip it incorrectly. The strut box has tall metal poles around it, so the robot needs to not bang the strut into the obstacle. The shelf is a tight fit, so the strut has to be placed on the edge of the shelf and slid into place, all while making sure the strut's many protrusions won't crash into the shelf.</p></div><p><a href=\"https://arstechnica.com/?p=2001322#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2001322&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"68f2d8e472806acffc6fe322e0cdb68deca3a4d1abcfa0cce99e36b68d8f8224","category":"Tech"}