{"title":"Hands-On With the New 'Apple Sports' App","link":"https://www.macrumors.com/2024/02/21/apple-sports-app-hands-on/","date":1708536073000,"content":"Apple <a href=\"https://www.macrumors.com/2024/02/21/apple-sports-app-announced/\">today released Apple Sports</a>, a brand new app that's designed to be a dedicated hub for sports fans to find real-time statistics, scores, lineup details, live betting odds, and more. This is Apple's first new app in some time, so we thought we'd give it a quick evaluation.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe Apple Sports app has a straightforward design that puts each person's favorite leagues and teams front and center. It's updated for all the leagues that are in season right now, including MLS, NBA, NCAA basketball, NHL, Premier League, and more.\r<br />\n\r<br />\nAs of right now, NFL and college football aren't available, but Apple is planning to add support for those and MLB, WNBA, and NWSL when those seasons begin.\r<br />\n\r<br />\nYou can see all pertinent stats for your favorite teams, along with play-by-plays and schedules so you don't miss anything. You can only get this app on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, and right now, Live Activities don't seem to be working, though support might be coming in the future.\r<br />\n\r<br />\nApple Sports is available in the United States, the United Kingdom, and Canada. It can be downloaded from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. [<a href=\"https://apps.apple.com/us/app/apple-sports/id6446788829\">Direct Link</a>]<br />This article, \"<a href=\"https://www.macrumors.com/2024/02/21/apple-sports-app-hands-on/\">Hands-On With the New 'Apple Sports' App</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-new-apple-sports-app.2420072/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"68f4253a15d142d6c761153eeffc9a0eb590a8262dfabf8971a10b1406b0dc67","category":"Apple"}