{"title":"Apple Card Savings Account Available Starting Today With 4.15% Interest Rate","link":"https://www.macrumors.com/2023/04/17/apple-card-savings-account-launching-today/","date":1681740479000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/04/apple-cards-new-high-yield-savings-account-is-now-available-offering-a-4-point-15-percent-apy/\">announced</a> that the long-awaited Apple Card Savings feature is available starting today with an initial APY of 4.15%. The savings account has no fees, no minimum deposits, and no minimum balance requirements.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe feature allows Apple Card users to open a high-yield savings account from Goldman Sachs in the Wallet app on their iPhone and start earning interest on their Daily Cash balance. Users can also earn interest on personal funds deposited into the savings account through a linked bank account, or from their Apple Cash balance. \r<br />\n\r<br />\nTo open a savings account in the Wallet app, users will tap on the Apple Card, tap on the circle with three dots at the top of the screen, tap Daily Cash, and select Set Up Savings. Once the account is set up, all Daily Cash received from that point on will be automatically deposited into it and start earning interest. If they prefer, users can choose to have Daily Cash added to their Apple Cash balance instead at any time.\r<br />\n\r<br />\nApple Card Savings allows a maximum balance of $250,000, and balances are fully insured by the FDIC. To access funds stored in the account, users can transfer money to their Apple Cash balance or to a linked external bank account, a process that Apple says can take 1-3 business days to be completed. There are no fees for withdrawals.\r<br />\n\r<br />\nApple Card Savings requires an iPhone with iOS 16.4 or later and is available to U.S. residents who are 18 years of age or older. Apple has published a <a href=\"https://support.apple.com/en-us/HT213451\">support document</a> with additional information about the feature.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/17/apple-card-savings-account-launching-today/\">Apple Card Savings Account Available Starting Today With 4.15% Interest Rate</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-card-savings-account-available-starting-today-with-4-15-interest-rate.2387038/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"690955ed6bea6f422c5c04d3b16b3b8ec404f0f21b72634883acba62cbb544ba","category":"Apple"}