{"title":"Crosstalk between <i>MIR-96</i> and <i>IRS/PI3K/AKT/VEGF</i> cascade in hRPE cells; A potential target for preventing diabetic retinopathy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310999","date":1727704800000,"content":"<p>by Zeynab Hosseinpoor, Zahra-Soheila Soheili, Maliheh Davari, Hamid Latifi-Navid, Shahram Samiee, Dorsa Samiee</p>\r\n\r\nRegulation of visual system function demands precise gene regulation. Dysregulation of miRNAs, as key regulators of gene expression in retinal cells, contributes to different eye disorders such as diabetic retinopathy (DR), macular edema, and glaucoma. <i>MIR-96</i>, a member of the <i>MIR-183</i> cluster family, is widely expressed in the retina, and its alteration is associated with neovascular eye diseases. <i>MIR-96</i> regulates protein cascades in inflammatory and insulin signaling pathways, but further investigation is required to understand its potential effects on related genes. For this purpose, we identified a series of key target genes for <i>MIR-96</i> based on gene and protein interaction networks and utilized text-mining resources. To examine the <i>MIR-96</i> impact on candidate gene expression, we overexpressed <i>MIR-96</i> via adeno-associated virus (AAV)-based plasmids in human retinal pigment epithelial (RPE) cells. Based on Real-Time PCR results, the relative expression of the selected genes responded differently to overexpressed <i>MIR-96</i>. While the expression levels of <i>IRS2</i>, <i>FOXO1</i>, and <i>ERK2</i> (<i>MAPK1</i>) were significantly decreased, the <i>SERPINF1</i> gene exhibited high expression simultaneously. pAAV-delivered <i>MIR-96</i> had no adverse effect on the viability of human RPE cells. The data showed that changes in insulin receptor substrate-2 (IRS2) expression play a role in disrupted retinal insulin signaling and contribute to the development of diabetic complications. Considered collectively, our findings suggest that altered <i>MIR-96</i> and its impact on <i>IRS/PI3K/AKT/VEGF</i> axis regulation contribute to DR progression. Therefore, further investigation of the <i>IRS/PI3K/AKT/VEGF</i> axis is recommended as a potential target for DR treatment.","author":"Zeynab Hosseinpoor","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6910707c2e0de7275ae8d1de4bfa9583f66d3d4d7cacf2b855c96c6d76aa03ef","category":"Interdisciplinary"}