{"title":"How to block and silence robocalls on your iPhone","link":"https://www.macworld.com/article/232621/iphone-robocalls-block-silence-robocalls-spam-att-verizon-tmobile.html","date":1625837461000,"content":"\n<div>\n<section><div></div></section><p>Automated calls that offer unwanted or illegal products or that attempt to defraud you are known as robocalls. And they have risen into the billions in recent years. The FCC is trying to fight it as are the telephone carriers, who waste large sums of money trying to block such calls legally from their networks and have to field millions of angry questions from subscribers.</p>\n\n\n\n<p>(Some robocalls are legal and desirable: school announcements, doctor appointment reminders, and automated messages from companies that you do business with and gave permission to call you.)</p>\n\n\n\n<p>Part of the problem is that FCC rules limit the way in which telcos can prevent calls from passing over their networks. That’s to prevent phone operators from blocking competitive companies. But it also ties their hands a bit regarding fraud.</p>\n\n\n\n<p>But if you opt into call blocking of scams and spam, the phone companies have your permission and it’s just fine. The FCC and telcos have also rolled out a new technology <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.fastcompany.com/90299767/heres-the-cure-for-the-deluge-of-scammy-spammy-robocalls&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">called STIR/SHAKEN</a> that’s supposed to prevent call spoofing, but if there’s anything we’ve learned from phone spammers, it’s that they always find a way around the systems that are put in place. Remember <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.donotcall.gov&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">Do Not Call</a>?</p>\n\n\n\n<h2>Protect yourself from robocalls</h2>\n\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/article/2019/04/nomorobo-ios-100793027-medium.jpg\" /><figcaption><p>iOS apps like Nomorobo can identify robocalls.</p>\n</figcaption></figure></div>\n\n\n\n<p>Apple added the option in iOS 9 for third-party apps to annotate incoming calls based on Caller ID. Several of these are available, some with free tiers and some with paid options. The best of them, such as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://hiya.com/&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">Hiya</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nomorobo.com/&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">Nomorobo</a>, show a message alongside an incoming call that matches their databases that reads “robocall” or “scam or fraud”—or the great “neighbor scam,” in which the area code and prefix (next three numbers) of the incoming call are changed to match your number, making you think it might be a call from someone you know.</p>\n\n\n\n<p>You can also turn to free services that can be enabled via apps or your account from three of the four biggest U.S. wireless carriers. Because these work at the network level, you’ll have fewer calls pass through to your phone that are problematic.</p>\n\n\n\n<ul><li><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.att.com/features/security-apps.html&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">AT&amp;T Call Protect</a>. The free flavor installs as an app for controlling features and viewing information, and blocks calls before they hit your phone as well as identifies ones that are sketchy. You can also create a personal block list. A paid option ($3.99/month) adds reverse-number lookup and a few other security features. (I’m an AT&amp;T customer, and have the free flavor installed for years; I receive nothing like the volume of robocalls most people I know complain of.)</p></li><li><p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.t-mobile.com/resources/call-protection&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">T-Mobile Scam Shield</a>. Previously Scam Block and Scam ID, T-Mobile’s free Scam Shield offers several layers of protection against spammers, including blockers, unknown caller ID, and an extra PROXY number that you can use when you don’t want to share your personal phone number. The service is free but you can upgrade to Scam Shield Premium ($4/month) to send entire categories of unwanted robocalls directly to voicemail and create “always-block” lists.</p></li><li> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.verizon.com/solutions-and-services/call-filter/&amp;xcust=1-1-232621-0-0-0&amp;sref=https://www.macworld.com/feed\">Verizon Call Filter.</a> This Verizon app can be set to block and mark incoming calls by risk level as well as send calls straight to voicemail. A paid version ($2.99/month) adds caller ID,<span> a personal block list, and a spam risk meter.</span></li></ul><p><em>This Mac 911 article is in response to a question submitted by Macworld reader Brenda.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Every question won’t be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"69115246083e5fbc9e4b43b746058c53ba242be45946d32f4311ddfccae49498","category":"Apple"}