{"title":"The FBI public charging station warning is scary, but your iPhone has your back","link":"https://www.macworld.com/article/1781211/juice-jacking-fbi-warns-against-public-usb-chargers.html","date":1681183012000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Denver FBI office recently tweeted a warning not to use public USB phone charging stations, and it seems like a good excuse to remind everyone about this sound advice: <em>Never plug your iPhone, iPad, or Mac into any USB device or cable you do not control.</em></p>\n\n\n\n<p>The Denver FBI office’s tweet echo’s the agency’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.fbi.gov/how-we-can-help-you/safety-resources/scams-and-safety/on-the-internet&amp;xcust=1-1-1781211-1-0-0&amp;sref=https://www.macworld.com/feed\">advice for protecting your data and devices online</a>. The FCC carries similar warnings against using public USB chargers, warning of “juice jacking”–the practice of using public USB ports to load malware onto devices.</p>\n\n\n\n<figure><div>\n<blockquote><p>Avoid using free charging stations in airports, hotels or shopping centers. Bad actors have figured out ways to use public USB ports to introduce malware and monitoring software onto devices. Carry your own charger and USB cord and use an electrical outlet instead. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/9T62SYen9T&amp;xcust=1-1-1781211-1-0-0&amp;sref=https://www.macworld.com/feed\">pic.twitter.com/9T62SYen9T</a></p>— FBI Denver (@FBIDenver) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/FBIDenver/status/1643947117650538498?ref_src=twsrc%5Etfw&amp;xcust=1-1-1781211-1-0-0&amp;sref=https://www.macworld.com/feed\">April 6, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Apple does its best to reduce this threat, but these protections are never perfect. On an iPhone or iPad, you might see a “<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT202778&amp;xcust=1-1-1781211-1-0-0&amp;sref=https://www.macworld.com/feed\">Trust this Computer</a>” prompt when plugging into a public USB charging port. If you see this, do <em>not</em> select “Trust” and instead immediately disconnect your iPhone. You may instead see an “<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-ca/HT208277&amp;xcust=1-1-1781211-1-0-0&amp;sref=https://www.macworld.com/feed\">accessory not supported</a>” warning. Again, your best bet is to remove your device if you see either of these prompts.</p>\n\n\n\n<p>However depending on how sophisticated the attack is, these prompts might be bypassed. Juice jacking, as it’s called, can come from the USB port itself or from a malicious cable–and they often look genuine. If at all possible, avoid using any publicly-available USB port or cable.</p>\n\n\n\n<h2>Stick to electrical outlets</h2>\n\n\n\n<p>The best way to charge your iPhone in public is to use your own charger instead of a public USB port. Most public charging stations also contain electrical outlets, so you should use your own charger and cable in one of those.</p>\n\n\n\n<p>There are lots of affordable compact USB-C power adapters available these days and even small models with multiple ports and higher wattage limits that can charge a MacBook and iPhone or iPad at the same time. Check out our <a href=\"https://www.macworld.com/article/234733/best-usb-c-power-adapters-iphone-fast-charging.html\">USB-C chargers guide</a> for recommendations, or grab a compact <a href=\"https://www.macworld.com/article/819438/best-macbook-usb-c-charger.html\">USB-C charger made for MacBooks</a> that will also work great for your iPhone or iPad.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"69157088a0d49ec4c8d1fd75c9d35643ba1c58ddf5efe34b45a7200b29b79318","category":"Apple"}