{"title":"Analysis of FOXP3 Gene Expression in OVCAR3 Cell Line After Rosmarinic Acid and Doxorubicin Treatment","link":"https://www.preprints.org/manuscript/202407.2478/v1","date":1722376662000,"content":"Aim: Ovarian cancer is the leading cause of gynecological cancer deaths worldwide. Treatment methods are listed as surgery, chemotherapy and radiotherapy depending on the stage of the cancer, but developing resistance to chemotherapy increases the need for alternative agents that act on the same pathways. In this study, the effects of rosmarinic acid (RA) and doxorubicin (DX) on the activation of FOXP3, an important tumor suppressor gene, in OVCAR3 cells were examined.\nMaterial Method: In the study, human ovarian adenocarcinoma cell line was used. MTT test was applied to determine the effect of rosmarinic acid and doxorubicin on the proliferation of OVCAR3 cells. Expression levels of FOXP3 for cell proliferation and Capase-3 for Apoptosis were determined by qRT-PCR and Western blot analysis. Wound healing model was applied to determine metastasis. The results were evaluated with one-way ANOVA in SPSS 20.0 program as p≤0.05.\nResults: It was determined that rosmarinic acid alone and in combination with doxorubicin inhibited the proliferation of OVCAR3 cells in a time- and dose-dependent manner for 24, 48 and 72 hours, and caused the cells to die by causing them to undergo apoptosis. It was observed that Caspase-3 expression increased approximately tenfold in OVCAR3 cells, while FOXP3 expression increased only in RA treatment and was downregulated in DX and RA+DX treatments.\nCoclusion According to the results of our study, it was observed that many steps of the signaling pathways related to proliferation, migration and apoptosis were affected by the combination of RA and DX in OVCAR3 cells. This shows that RA will gain an important place in cancer treatment with more comprehensive studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6926933fb641f40dcd865740f4875c860d50ff06450f2c8a7dc7d447a2c53f9e","category":"Interdisciplinary"}