{"title":"Top Stories: Epic Games vs. Apple, Hidden AirTag Mode, Apple Music Hi-Fi, Colorful MacBook Air?","link":"https://www.macrumors.com/2021/05/08/top-stories-epic-games-vs-apple/","date":1620478827000,"content":"While we wait for the newly introduced iMac, iPad Pro, and Apple TV models to launch later this month, this week saw the kickoff of the big Epic Games v. Apple trial, with lots of juicy tidbits coming out as the two sides make their arguments.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Top-Stories-59-Feature.jpg\" />\r\n<br />\r\n\r\n<br />\r\nThis week also saw some rumors about a Hi-Fi tier for Apple Music, more biometric sensing capabilities for Apple Watch, and timing for the next-generation iPad mini launch. We also saw people digging into Apple's new AirTags, including the discovery of a hidden \"developer mode\" in the Precision Finding feature. Read on for details on these stories and more!\r\n<br />\r\n\r\n<br />\r\n<h2>Epic Games vs. Apple Trial Over App Store Policies Begins</h2>\r\n<br />\r\nThe highly-anticipated Epic Games vs. Apple bench trial <a href=\"https://www.macrumors.com/2021/05/03/epic-games-vs-apple-trial-begins/\">kicked off this week</a> in California court, with lawyers for both companies presenting their cases before District Judge Yvonne Gonzalez Rogers.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite_apple_featured.jpg\" />\r\n<br />\r\nEpic Games has attempted to paint the App Store as anti-competitive and monopolistic, noting that developers are forced to use Apple's in-app purchase system, and thus pay Apple a 30% commission on sales. The company behind the popular battle royale game Fortnite believes Apple should allow both third-party app stores and direct payment systems in apps.\r\n<br />\r\n\r\n<br />\r\nEpic Games described the App Store as a \"walled garden\" and presented emails from current and former Apple executives like Steve Jobs, Phil Schiller, and Eddy Cue in an attempt to prove this claim.\r\n<br />\r\n\r\n<br />\r\nApple has argued that a single, curated App Store is necessary to protect the security, privacy, reliability, and quality that customers have come to expect from the company. Apple also argued that Epic Games has benefitted from the App Store ecosystem for over a decade.\r\n<br />\r\n\r\n<br />\r\n\"<a href=\"https://www.macrumors.com/2021/05/03/apple-doesnt-want-to-be-android/\">Epic wants us to be Android, but we don't want to be</a>,\" said Apple lawyer Karen Dunn, referring to the ability to sideload apps outside of the Google Play store. \"Our consumers don't want that either,\" she added.\r\n<br />\r\n\r\n<br />\r\nApple <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">removed Fortnite from the App Store</a> in August 2020 after Epic Games introduced a direct payment option in the app, in defiance of the App Store rules. Epic Games then filed an orchestrated lawsuit against Apple, accusing the company of anti-competitive behavior.\r\n<br />\r\n\r\n<br />\r\nThe trial is set to last three weeks and will include testimony from Apple executives like CEO Tim Cook.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Rumored to Announce Third-Generation AirPods and Apple Music Hi-Fi in 'Coming Weeks'</h2>\r\n<br />\r\nWhile it has only been a few weeks since Apple hosted its Spring Loaded event, a new rumor from music industry website <em>Hits Daily Double</em> suggests that <a href=\"https://www.macrumors.com/2021/05/01/apple-music-hifi-tier-new-airpods-coming-weeks/\">third-generation AirPods could be introduced alongside a new Apple Music Hi-Fi tier</a> in the \"coming weeks.\"\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/General-Music-and-AirPod-3-Feature.jpg\" />\r\n<br />\r\nHi-Fi or high-fidelity audio would result in improved sound quality for songs/albums. The report claimed that the new Hi-Fi tier will be priced at the same $9.99 per month rate as Apple Music's individual plan, suggesting that high-fidelity content may be made available to existing subscribers at no additional charge.\r\n<br />\r\n\r\n<br />\r\nLending credence to this rumor, <em>MacRumors</em> contributor Steve Moser <a href=\"https://www.macrumors.com/2021/05/01/ios-14-6-beta-6-hifi-apple-music/\">discovered references to Hi-Fi support in the iOS 14.6 beta</a>.\r\n<br />\r\n\r\n<br />\r\nAs for the third-generation AirPods, they are expected to have a similar design language as the AirPods Pro, but without Active Noise Cancellation. The new AirPods could be announced in a press release soon, or held for the WWDC 2021 keynote on June 7.\r\n<br />\r\n\r\n<br />\r\n<h2>AirTag Precision Finding Has a Hidden 'Developer Mode'</h2>\r\n<br />\r\nApple's new AirTag item tracking accessory is equipped with a U1 chip for Ultra Wideband spatial awareness, enabling a handy <a href=\"https://www.macrumors.com/how-to/use-precision-finding-airtag/\">Precision Finding feature</a> on iPhone 11 and iPhone 12 models.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-1.jpg\" />\r\n<br />\r\nPrecision Finding provides users with the exact distance and direction to their AirTag with an on-screen arrow in the Find My app, with a combination of sound, haptics, and visual feedback helping them find the AirTag.\r\n<br />\r\n\r\n<br />\r\nInterestingly, an AirTag user has inadvertently discovered the existence of a <a href=\"https://www.macrumors.com/2021/05/06/airtag-precision-finding-hidden-developer-mode/\">hidden \"developer mode\" in the Precision Finding interface</a>. The overlay, which appears after tapping an item's name four times in the Precision Finding interface, displays real-time diagnostic and technical information about the feature's operation, including accelerometer and gyroscope coordinates, haptic feedback, screen resolution, tracking animations, and more.\r\n<br />\r\n\r\n<br />\r\nKeep in mind that there does not appear to be an easy way to reset the settings that appear after you customize them. \r\n<br />\r\n\r\n<br />\r\n<h2>Prosser: Next MacBook Air Could Come in Colors Similar to iMac</h2>\r\n<br />\r\nLeaker Jon Prosser was the first to claim that the iMac would come in an array of colors, and he now says we may see Apple make a <a href=\"https://www.macrumors.com/2021/05/07/prosser-macbook-air-colors-similar-to-imac/\">similar move with the next MacBook Air</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/macbook-colors-3d-black-bezels.jpg\" />\r\n<br />\r\nWhile his source was \"very cryptic\" in making reference to a blue MacBook, the source suggested that this would be for Apple's consumer notebook lineup, pointing to this being a MacBook Air rather than a MacBook Pro.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Watch Likely to Gain Blood Pressure, Blood Glucose, and Blood Alcohol Monitoring</h2>\r\n<br />\r\nApple Watch continues to involve into an all-in-one health tool on the wrist, with features like heart rate tracking, the ECG app, and blood oxygen monitoring — and this might just be the beginning.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-watch-ecg.jpg\" />\r\n<br />\r\n<em>The Telegraph</em> this week reported that Apple is the largest customer of the British electronics startup Rockley Photonics, which has developed non-invasive optical sensors for detecting multiple blood-related health metrics, including blood pressure, blood glucose, and blood alcohol levels.\r\n<br />\r\n\r\n<br />\r\nRockley's sensors beam infrared light through a user's skin, much like the existing sensors on the back of the Apple Watch for detecting heart rate and blood oxygen levels, so it's possible that <a href=\"https://www.macrumors.com/2021/05/03/apple-watch-blood-pressure-glucose-alcohol/\">more blood-related health features could be coming to future Apple Watch models</a>.\r\n<br />\r\n\r\n<br />\r\nIn a December 2020 interview, Apple CEO Tim Cook said the Apple Watch is still in the \"early innings,\" noting that the company is <a href=\"https://www.macrumors.com/2020/12/09/tim-cook-outside-magazine-interview/\">testing \"mind blowing\" capabilities</a> in its labs. \"Think about the amount of sensors in your car,\" said Cook, adding \"and arguably, your body is much more important than your car.\"\r\n<br />\r\n\r\n<br />\r\n<h2>Samsung Expected to Supply 120Hz Displays for iPhone 13 Pro Models</h2>\r\n<br />\r\nApple's upcoming iPhone 13 Pro and iPhone 13 Pro Max models are widely rumored to feature OLED displays with up to a 120Hz refresh rate, resulting in content and scrolling appearing smoother.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/120-hz-13-joe-blue.jpg\" />\r\n<br />\r\nKorean website <em>The Elec</em> this week reported that <a href=\"https://www.macrumors.com/2021/05/03/iphone-13-pro-120hz-displays-samsung/\">Samsung will be the exclusive supplier of the 120Hz displays</a>, with LG seemingly out of the running. \r\n<br />\r\n\r\n<br />\r\n120Hz support will be made possible by Apple adopting low-power LTPO display technology, according to previous reports. LTPO technology would result in a more power-efficient backplane, allowing for a 120Hz refresh rate without a significant impact on battery life.\r\n<br />\r\n\r\n<br />\r\nSimilar to recent Apple Watch models, LTPO could also enable iPhone 13 Pro models to have an always-on display with the clock visible.\r\n<br />\r\n\r\n<br />\r\n<h2>iPad Mini 6 Delayed Until Second Half of 2021</h2>\r\n<br />\r\nApple is rumored to be working on a new iPad mini with slimmer bezels, allowing for a larger 8.4-inch display, but the device might launch later than expected.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/ipad-mini-6-screen-increase-feature.jpg\" />\r\n<br />\r\nIn a research note this week, Apple analyst Ming-Chi Kuo briefly mentioned that <a href=\"https://www.macrumors.com/2021/05/03/kuo-ipad-mini-6-delayed-second-half-of-2021/\">the new iPad mini will launch in the second half of 2021</a>. Earlier rumors had suggested the device might launch this spring.\r\n<br />\r\n\r\n<br />\r\nThe sixth-generation iPad mini is expected to have a similar design as the third-generation iPad Air, including a Touch ID home button and a Lightning connector, and the device will likely get a faster chip too. The current iPad mini launched in March 2019 and features a 7.9-inch display, A12 Bionic chip, and support for the original Apple Pencil.\r\n<br />\r\n\r\n<br />\r\nKuo also said Apple <a href=\"https://www.macrumors.com/2021/05/02/kuo-8-inch-foldable-iphone-2023/\">plans to launch an 8-inch foldable iPhone in 2023</a>, competing with the likes of Samsung and Huawei. \r\n<br />\r\n\r\n<br />\r\n<h3>MacRumors Newsletter</h3>\r\n<br />\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br />\r\n\r\n<br />\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/may-6-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/08/top-stories-epic-games-vs-apple/\">Top Stories: Epic Games vs. Apple, Hidden AirTag Mode, Apple Music Hi-Fi, Colorful MacBook Air?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-epic-games-vs-apple-hidden-airtag-mode-apple-music-hi-fi-colorful-macbook-air.2295332/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=F8e4Qb7uMqE:Ih6AXMXlvKc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=F8e4Qb7uMqE:Ih6AXMXlvKc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/F8e4Qb7uMqE\" />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6927fdd26b16cd6a441d2c668c9f2ab2658f4fd4fe5fb7454cd104955ba7a89e","category":"Apple"}