{"title":"Five rumored Apple products that aren’t launching at WWDC","link":"https://www.macworld.com/article/348097/five-rumored-apple-products-that-arent-launching-at-wwdc.html","date":1622969100000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>On Monday at 9am PT, <a href=\"https://www.macworld.com/article/347851/wwdc-2021-ios-15-macos-12-watchos-8-tvos-15-macbook-pro-mac-mini-apple-silicon-m1x.html\">Apple will unveil a bunch of new products</a>. We’ll get looks at iOS 15 and iPadOS 15, macOS 12, probably a new processor, maybe new MacBooks, and possibly a new Mac mini. It’s going to be a big day for sure, with lots of surprises. But while we never know what Apple might pull out of its bag of tricks, there are a couple of products we know for sure we won’t see.</p>\n\n\n\n<h2>iPad mini</h2>\n\n\n\n<p>Early rumors suggested a new iPad mini with slimmer bezels might launch around the time of WWDC, but <a href=\"https://www.macworld.com/article/348015/apple-ipad-ipad-mini-ipad-pro-bezels-home-button-wireless-charging-airpower.html\">the latest speculation suggests</a> we’ll be waiting a little longer. According to recent rumors, Apple is exploring the removal of the home button like it did with the iPad Air, so it’s going to be a little longer before we get to see it.</p>\n\n\n\n<h2>iPhone</h2>\n\n\n\n<p>There was a time when WWDC was the launching pad for the new iPhone. But ever since the iPhone 4s, it’s gotten its own event in September. There was an outside chance that <a href=\"https://www.macworld.co.uk/news/iphone-se-3-release-date-3788075/\">a new iPhone SE</a> could make its debut at WWDC, but we haven’t heard anything about it for months, so it likely won’t make an appearance until 2022.</p>\n\n\n\n<h2>Apple Watch</h2>\n\n\n\n<p>Even though we’re going to get a look at watchOS 8, we’ll need to wait a few more months for the newest Apple Watch. Like the iPhone, Apple holds a separate event in the fall to show off the latest Apple Watch hardware. We’re <a href=\"https://www.macworld.com/article/346955/apple-watch-series-7-might-get-its-first-major-redesign.html\">expecting some big changes though</a>, so it’ll be worth the wait.</p>\n\n\n\n<h2>AirPods</h2>\n\n\n\n<p>We’ve expected the <a href=\"https://www.macworld.co.uk/news/new-airpods-2020-3780443/\">heavily rumored AirPods</a> at every Apple event for the past year, but we’re definitely not expecting them at this one. We’re certain of three things: they’re ready to launch, Apple Music’s new spatial audio is perfect for them, and we won’t be able to buy them for another few months.</p>\n\n\n\n<h2>iMac ‘Pro’</h2>\n\n\n\n<p>Apple just launched the new 24-inch M1 iMac, so it only makes sense that the developer’s conference would bring the higher-end version. But we’re confident in saying that’s not happening. While we fully expect <a href=\"https://www.macworld.co.uk/news/big-imac-2021-release-3803868/\">a 29-inch or 32-inch pro-tier iMac</a> to arrive this year with an M1X or M2 processor, a new design, and hopefully space gray paint job, we don’t think it’s quite ready for WWDC.  Apple will likely follow the same pattern for the next round of higher-end Apple silicon Macs, starting with the MacBook Pro and Mac mini, and ending with the iMac later this year or early next.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"692d91b6578d0049bb62cb3dc8061be303bacb3c79e6818c4eae8cb30e296585","category":"Apple"}