{"title":"Top Stories: Yellow iPhone 14, Apple Music Classical Announced, and More","link":"https://www.macrumors.com/2023/03/11/top-stories-yellow-iphone-14-apple-music-classical/","date":1678539600000,"content":"The rumors were right! This year's mid-cycle color addition for the iPhone 14 is indeed a bright yellow, and it's available for pre-order now alongside the usual spring color refresh for iPhone cases and Apple Watch bands.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/top-stories-11mar2023.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nThis week also saw the surprise announcement of Apple Music Classical, a new iPhone app for Apple Music subscribers that will launch later this month. iPhone and Mac rumors also continue to surface as we look toward upcoming hardware launches that involve more than just a new color, so read on for all the details on these stories and more!\r<br />\n\r<br />\n<h2>Apple Announces New Yellow Color Option for iPhone 14 and iPhone 14 Plus</h2>\r<br />\nApple this week <a href=\"https://www.macrumors.com/2023/03/07/apple-announces-yellow-iphone-14/\">introduced a new Yellow color option for the iPhone 14 and iPhone 14 Plus</a>. The devices <a href=\"https://www.macrumors.com/2023/03/10/iphone-14-yellow-preorders/\">can be pre-ordered in the new color now</a> in the U.S. and more than 60 other countries. In-store availability will begin Tuesday, March 14.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-14-Yellow-Feature-2.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThere are no changes to the iPhone 14 and iPhone 14 Plus beyond the new Yellow color option. Apple first released the devices in September in Midnight, Starlight, Blue, Purple, and (PRODUCT)RED.\r<br />\n\r<br />\n<h2>Apple Music Classical Launching Later This Month</h2>\r<br />\nApple's <a href=\"https://www.macrumors.com/2023/03/09/apple-music-classical-available-for-pre-order/\">long-awaited classical music app is now available for pre-order</a> on the App Store and will be released on March 28. The app will be free to use with an Apple Music subscription on iOS 15.4 and later, and offers over five million classical music tracks.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Apple-Music-Classical-App-Icon-Feature-Blue.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nApple Music Classical is based on the former classical music streaming service Primephonic, which <a href=\"https://www.macrumors.com/2021/08/30/apple-acquires-primephonic-classical-music-service/\">Apple acquired and shut down back in 2021</a>. As a brief overview, we've put together a list of <a href=\"https://www.macrumors.com/2023/03/09/apple-music-classical-15-things-you-need-to-know/\">15 things to know about the app</a> ahead of its launch.\r<br />\n\r<br />\n<h2>iPhone 14 Silicone Cases Now Available in Four New Colors</h2>\r<br />\nAlongside the iPhone 14 and iPhone 14 Plus in Yellow, Apple made its silicone cases for the devices <a href=\"https://www.macrumors.com/2023/03/07/iphone-14-silicone-cases-four-new-colors/\">available in four new color options</a> this week, including Canary Yellow, Olive, Sky, and Iris.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-14-and-14-Plus-New-Silcone-Case-Colors-Feature.jpg\" alt width=\"2056\" height=\"1156\" />\r<br />\nThere are also new colors for a <a href=\"https://www.macrumors.com/2023/03/07/apple-releases-new-apple-watch-bands/\">variety of Apple Watch bands and AirTag accessories</a>, as part of Apple's usual spring refresh of colors. All of the new accessories are available to order now on Apple's online store.\r<br />\n\r<br />\n<h2>iPhone 15 Pro Front Glass Leak Reveals Ultra-Thin Bezels Around Display</h2>\r<br />\nWhile the iPhone 15 series is still around six months away, <a href=\"https://www.macrumors.com/2023/03/05/iphone-15-pro-front-glass-leak/\">front glass panels for the devices were allegedly leaked</a> this week on Chinese social media sites.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/iPhone-15-Pro-Front-Glass-Panel-Leak.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nAs <a href=\"https://www.macrumors.com/2023/01/21/iphone-15-pro-ultra-thin-curved-bezels/\">previously rumored</a>, the iPhone 15 Pro and Pro Max will feature even thinner bezels around the display compared to the previous generation. Moreover, the Dynamic Island is <a href=\"https://www.macrumors.com/2022/09/18/dynamic-island-all-iphone-15-models-rumor/\">expected to be expanded to all four iPhone 15 models</a>, after debuting on the iPhone 14 Pro models last year.\r<br />\n\r<br />\n<h2>New MacBook Airs Expected to Launch by Summer</h2>\r<br />\nApple will likely <a href=\"https://www.macrumors.com/2023/03/05/new-macbook-airs-by-summer-gurman/\">release new 13-inch and 15-inch MacBook Air models</a> \"between late spring and summer,\" according to <em>Bloomberg</em>'s Mark Gurman.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/06/MacBook-Air-Multiple-Sizes-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nBoth new MacBook Air models and an updated 13-inch MacBook Pro will be <a href=\"https://www.macrumors.com/2023/03/06/new-macbook-airs-with-m3-chip-report/\">equipped with Apple's M3 chip</a>, built on TSMC's 3nm process, according to <em>9to5Mac</em>. An <a href=\"https://www.macrumors.com/2023/03/05/new-imac-advanced-development/\">updated 24-inch iMac</a> with an M3 chip is also expected to be released in the second half of this year.\r<br />\n\r<br />\n<h2>tvOS 16.3.3 Released With Fix for Siri Remote Connectivity</h2>\r<br />\nIf you have been experiencing connectivity issues with the Siri Remote while using your Apple TV, <a href=\"https://www.macrumors.com/2023/03/06/apple-releases-tvos-16-3-3/\">a fix is finally available with tvOS 16.3.3</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/siri-remote-1.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThe software update is only available for the new third-generation Apple TV 4K and \"fixes an issue where the Siri Remote can become unresponsive,\" according to Apple's release notes. On the Apple TV, the update can be installed via Settings &gt; System &gt; Software Updates.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/mar-9-2023\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/11/top-stories-yellow-iphone-14-apple-music-classical/\">Top Stories: Yellow iPhone 14, Apple Music Classical Announced, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-yellow-iphone-14-apple-music-classical-announced-and-more.2383414/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"69311ba4f13659445afdf190213efdaf1cb2672318cb14385c6da2a442e80829","category":"Apple"}