{"title":"A geometric morphometric analysis of wing variations in shape and size of the blue bottle fly, Calliphora vicina (Diptera: Calliphoridae)","link":"https://academic.oup.com/ee/article/53/4/577/7680264?rss=1","date":1716422400000,"content":"<span><div>Abstract</div>A geometric morphometric analysis was performed on the right wing of adult <span>Calliphora vicina</span> (Robineau-Desvoidy) collected across 4 altitudinal levels in Sicily. The objective of this study was to assess differences in shape and centroid size (CS) between females and males and across elevations. The wings analyzed in this study were removed from adults of <span>C. vicina</span> collected with baited traps at 20, 700, 1,153, and 1,552; for this study, 19 landmarks were identified in each wing. The coordinates of the landmarks were aligned and superimposed to prevent variations due to position, orientation, and scale; they were then scaled to the same CS and recentered. CS and Procrustes differences were, respectively, used to assess variations in size and shape. Significant differences were observed in wing shape between males and females but not between all altitudinal levels. Female wings were found to be significantly larger than males (<span>P</span> &lt; 0.01). Wings of flies collected at the highest altitudinal level resulted in significantly larger wings than those collected at lower altitudes (<span>P</span> &lt; 0.001), with CS values ranging from 12.1 to 14.1. Variation in wing shape can impact thermal regulation, and therefore, oxygen content, temperature, atmospheric pressure, and solar radiation can have an effect on an insect’s body and activity levels. At high elevations and lower temperatures, larger wings could mean less energy expenditure when flying to increase body temperature.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"693c89d0abaa8169cf2a9b379997aff73636c7a2bdefc71d2adb7170e326535a","category":"Environment"}