{"title":"Hacker Group Mysteriously Removes Stolen Apple Schematics and Extortion Threat From Ransomware Website","link":"https://www.macrumors.com/2021/04/26/revil-delists-stolen-apple-schematics-threat/","date":1619438455000,"content":"A ransomware group that last week <a href=\"https://www.macrumors.com/2021/04/21/apple-supplier-ransomware-attack/\">stole schematics</a> from Apple supplier Quanta Computer and threatened to release the trove of documents has mysteriously removed all references related to the extortion attempt from its dark web blog, <em>MacRumors</em> can confirm.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Ports-2021-MacBook-Pro-Mockup-Feature-1-copy.jpg\" />\r\n<br />\r\nThe ransomware group known as REvil claimed last Tuesday that it had accessed the internal computers of Taiwan-based Quanta and managed to obtain several images and schematics of unreleased Apple products.\r\n<br />\r\n\r\n<br />\r\n<em><a href=\"https://www.bleepingcomputer.com/news/security/revil-gang-tries-to-extort-apple-threatens-to-sell-stolen-blueprints/\">BleepingComputer</a></em> reported that the group initially demanded Quanta pay $50 million for recovery of the files. However, according to an April 20 statement posted on the hacker group's site, Quanta refused to pay the ransom, which led the criminals to go after Apple for the money instead.\r\n<br />\r\n\r\n<br />\r\nTo prove it had hacked into Quanta's servers and in order to turn up the pressure on Apple, the hackers publicly posted a handful of images depicting unreleased product schematics, including details on Apple's unreleased next-generation MacBooks. \r\n<br />\r\n\r\n<br />\r\nThe group threatened to publish new data every day leading up to May 1, unless Apple paid the $50 million ransom demand in exchange for deleting the files. \r\n<br />\r\n\r\n<br />\r\nThe extortion attempt was timed to coincide with Apple's April 20 \"Spring Loaded\" digital event, where Apple <a href=\"https://www.macrumors.com/2021/04/24/top-stories-april-2021-event-recap/\">announced</a> AirTag item trackers, new <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models, and new iMacs. Despite the threat, however, no additional stolen documents have been leaked online since the original demand was made public. \r\n<br />\r\n\r\n<br />\r\nHistorically, REvil isn't known for bluffing and routinely posts stolen documents if its victims don't pay up, so it's unclear why the group has failed to follow through on this occasion, and Apple has so far not commented on the breach. The group actively continues to extort other companies, so what has prompted it to remove all content linked to the Quanta hack remains unknown. We'll update this article if we learn more.<br />This article, \"<a href=\"https://www.macrumors.com/2021/04/26/revil-delists-stolen-apple-schematics-threat/\">Hacker Group Mysteriously Removes Stolen Apple Schematics and Extortion Threat From Ransomware Website</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hacker-group-mysteriously-removes-stolen-apple-schematics-and-extortion-threat-from-ransomware-website.2293294/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PlpuCOWjjX0:_oknKVT6Arg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PlpuCOWjjX0:_oknKVT6Arg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PlpuCOWjjX0\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"69415752cfdebe39bbd6067705de6ee67bf3ee84a4f44d54a851f995923d690e","category":"Apple"}