{"title":"บัญชี GitHub ปริศนาโพสเอกสารอ้างว่ามาจากบริษัท Spyware จีน ระบุเคยขโมยข้อมูลจากเกาหลี, ไทย, มาเลเซีย, เวียดนาม และอีกหลายชาติ","link":"https://www.blognone.com/node/138306","date":1708455231000,"content":"<div><div><div><p>สัปดาห์ที่ผ่านมาบัญชีผู้ใช้ I-S00N บน GitHub โพสเอกสารจำนวนมาก ระบุว่ามาจากบริษัท Anxun ในจีนที่ให้บริการสปายแวร์และอุปกรณ์สำหรับเจาะเครือข่ายในรูปแบบต่างๆ เพื่อขโมยข้อมูลออกมา พร้อมกับแสดงความไม่พอใจว่าบริษัทหลอกลวงหน่วยงานรัฐ และขัดแย้งกับพนักงาน</p>\n<p>ข้อมูลในเอกสารนั้นเป็นภาษาจีนทั้งหมด แสดงถึงรายการสินค้าและบริการของบริษัทที่สามารถเข้าควบคุมเครื่องของเหยื่อได้ทั้ง Windows, Mac, Android, และ iOS โดยแต่ละเวอร์ชั่นจะมีฟีเจอร์ต่างกันไป เช่น iOS จะทำได้เพียงการอ่านรายชื่อติดต่อ, ข้อมูล GPS, อ่านไฟล์รูป, และอัดเสียง เหมือนแอปทั่วไปที่ขอสิทธิได้ ขณะที่ Android จะอ่านรายการโทร, ประวัติการเข้าเว็บ, หรือรายการแอปในเครื่องตลอดจนการอ่านข้อความในแอปแชตได้ด้วย ฟีเจอร์ต่างๆ เน้นผู้ใช้ในจีนอย่างหนัก เช่น ฟีเจอร์ค้นหาข้อมูลผู้ใช้ Baidu, หรือผู้ใช้ WeChat อุปกรณ์บางตัวมีไว้เพื่อเจาะเครือข่าย Wi-Fi โดยอาศัยการยิงรหัสผ่าน และเจาะระบบ</p>\n<p>จุดน่าสนใจคือเอกสารระบุรายชื่อเหยื่อที่เคยถูกเจาะระบบ โดยมักเป็นเครือข่ายโทรศัพท์มือถือหรือหน่วยงานรัฐในประเทศต่างๆ ทั้งเกาหลีใต้, คาซักสถาน, ไทย, ฮ่องกง, มาเลเซีย, อินโดนีเซีย, เวียดนาม รายชื่อนี้มีหน่วยงานไทยทั้งรัฐและเอกชนหลายหน่วยงาน แต่ไม่มีข้อมูลใน GitHub ที่โพสมาแต่อย่างใด โดยในไฟล์ที่โพสมามีข้อมูลการโทรศัพท์ของเครือข่ายโทรศัพท์มือถือ Beeline และ Tele2 ไว้บางส่วนด้วย</p>\n<p>ข้อมูลทั้งหมดเป็นภาษาจีนและกำลังมี<a href=\"https://github.com/soufianetahiri/Anxun-isoon/blob/main/Anxun%20Victim%20List-01cdc26f-e773-4ad7-8808-d04abf16aae7_1_0.md\">ผู้ไล่แปลเอกสารทั้งหมดอยู่</a> ส่วนกระบวนการตรวจสอบความน่าเชื่อถือของข้อมูลนั้นอาจจะต้องรอองค์กรที่ถูกเปิดข้อมูลบางส่วนเช่น Beeline หรือ Tele2 ออกมายืนยัน รวมถึงหลายสำนักข่าวที่ติดต่อบริษัท Anxun เพื่อขอความเห็นไป</p>\n<p>ที่มา - <a href=\"https://github.com/I-S00N/I-S00N\">GitHub: I-SOON</a>, <a href=\"https://cybernews.com/news/github-leak-exposes-chinese-cyber-ops/\">Cybernews</a>, <a href=\"https://twitter.com/AzakaSekai_/status/1759326049262019025\">@AzakaSekai_</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0594b042cc5e1ec294f99ef52c37260e.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6944c5cc452d60d75b955b05290b9baca0c3f3b206576c0f47811188366057f9","category":"Thai"}