{"title":"273 Toxicokinetic approach to measure the efficacy of a mycotoxin deactivator against aflatoxin B1 and zearalenone in pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/54/7757265?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Zearalenone (ZEN) and aflatoxin B1 (AFB1) are mycotoxins highly prevalent worldwide and can impair the performance and health of pigs. Preventive solutions such as the use of dietary mycotoxin deactivators (MD) can help in reducing the exposure to ZEN and AFB1 in animals. The aim of this study was to perform a toxicokinetic study in pigs focusing on the plasma concentration-time profiles of these 2 toxins, alone or in combination with a MD. The study was conducted on 12 healthy pigs (6 males/6 females) of 8 wk of age with an initial average body weight (BW) of 13.8 kg (ethical approval n° 2017/106). The acclimatization period was 1 wk (d 1-7). The pigs were randomly allocated into 2 mixed sex treatment groups of 6 pigs per group. On d 8, after fasting for 12 h, the pigs were given an intragastric single bolus of ZEN and AFB1 (group 1: ZEN 0.5 mg/kg BW and AFB1 0.1 mg/kg BW) or the same ZEN and AFB1 challenge with a MD (Unike Plus at 0.1 g/kg BW; group 2). Oral absorption and systemic exposure of ZEN and AFB1 were evaluated by comparing the plasma toxicokinetic parameters of the glucuronide conjugate of ZEN (ZEN-GlcA) and AFB1. For ZEN-GlcA, the area under the instrument response-time curve (AUC0-4h) for group 1 was 616.9 responses*h whereas it decreased to 379.2 response*h with the addition of MD. Therefore, MD reduced the oral bioavailability of ZEN by 38.5%. For AFB1, the area under the plasma concentration-time curve (AUC0-4h) for group 1 was 32.3 ng/mL*h whereas it decreased to 14.3 ng/mL*h with the addition of MD. Therefore, the oral bioavailability of AFB1 with MD is 44.3% compared with group 1. This toxicokinetic model developed for swine has shown a great sensitivity that allows to quantity different levels of mycotoxin exposure. Unike Plus was able to reduce the systemic exposure to ZEN as well as AFB1. This preventive strategy is necessary to limit the appearance of clinical symptoms, and therefore, can help to control the development of infectious diseases and maintain the performance of animals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6962ae8cac3e9c65c6ef8683ab67f851835dd17bfcf91ed21f5bf46be32cdd14","category":"Environment"}