{"title":"Meta เปิดตัว Llama 2, AI ใช้แชตถามตอบแบบโอเพนซอร์ส ใช้เพื่อการค้าก็ได้ ความสามารถใกล้ ChatGPT ตัวก่อน","link":"https://www.blognone.com/node/134893","date":1689700390000,"content":"<div><div><div><p>Meta เปิดตัว Llama 2 ตัวต่อจาก Llama ที่<a href=\"https://www.blognone.com/node/132773\">เปิดตัวไปเมื่อเดือนกุมภาพันธ์ที่ผ่านมา</a> ตัวโมเดลมี 3 ขนาดเช่นเดิม คือ 7B, 13B, และ 70B แต่เปลี่ยนแนวทางเพิ่มการฝึกกับชุดคำถามตอบมากขึ้น โดยมีการจูนกับชุดคำถามตอบกว่าแสนรายการ และฝึกเพิ่มด้วยการให้คนมาเลือกคำตอบที่ดีที่สุดอีกกว่าล้านครั้ง</p>\n<p>แนวทางการฝึกเพิ่มเติมเช่นนี้ทำให้ Llama 2 เอาชนะโมเดลโอเพนซอร์สในขนาดเดียวกันได้ชัดเจน โดยเฉพาะในกลุ่มโมเดลขนาดเล็ก 7B แต่ในโมเดลขนาดใหญ่กลับทำคะแนนเพิ่มจาก Llama 1 ได้ชัดเพียงแค่บางหมวด เมื่อใช้โมเดล Llama-2-70B-Chat ทดสอบตอบคำถามแข่งกับ ChatGPT-0301 และให้มนุษย์เป็นคนพิจารณาว่าคำตอบใครดีกว่ากันก็พบว่า Llama-2-70B-Chat  ทำคะแนนได้สูสี กรรมการที่เป็นมนุษย์ให้คะแนน Llama-2 ชนะ 35.9% เท่ากัน 31.5% และให้ ChatGPT ชนะ 32.5%</p>\n<p>Llama 2 ฝึกด้วยข้อมูลชุดใหม่ มีขนาดใหญ่ขึ้น 40% เป็น 2 ล้านล้านโทเค็น กระบวนการฝึกใช้ context ยาวขึ้นเป็น 4K ทำให้รองรับคำถามตอบขนาดยาวได้ ตัวโมเดลขนาดใหญ่ใช้ชิปกราฟิกไปทั้งหมด 1,720,320 ชั่วโมง ปล่อยคาร์บอนรวม 291 ตันระหว่างการฝึก</p>\n<p>ก่อนหน้านี้ Meta เปิดให้คนภายนอกใช้งาน Llama เพื่องานวิจัยเท่านั้น ใน Llama 2 รอบนี้ทาง Meta อนุญาตให้ใช้งานเพื่อการค้าได้ หากบริการมีผู้ใช้ไม่เกิน 700 ล้านคนต่อเดือน และผู้ใช้ยอมรับเงื่อนไขการใช้งานว่าจะไม่นำ Llama 2 ไปใช้งานอันตรายต่างๆ</p>\n<p>ที่มา - <a href=\"https://ai.meta.com/llama/\">Meta AI</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/017f7dbbc41422363fc7b53486829fc6.jpg\" /></p>\n<p><img src=\"https://scontent.fbkk12-1.fna.fbcdn.net/v/t39.8562-6/361590483_235309902165028_8558564526447568738_n.jpg?_nc_cat=101&amp;ccb=1-7&amp;_nc_sid=6825c5&amp;_nc_ohc=H4QmTUInwY8AX_dPdRX&amp;_nc_ht=scontent.fbkk12-1.fna&amp;oh=00_AfAaPrvhZ-Tj006Ll8CrMRAUjkipKbJ1jayw3wyVISCYGQ&amp;oe=64BB360F\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/llm\">LLM</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"696ae7a3e3344e683911720df89f0466a93f505faf952deaeaff9e71c3f76628","category":"Thai"}