{"title":"Effects of Soybean Isoflavone on the Growth Performance and Lipid Metabolism of Juvenile Chinese Mitten Crab Eriocheir sinensis","link":"https://www.preprints.org/manuscript/202405.1013/v1","date":1715752100000,"content":"In order to study the effects of soybean isoflavones on the growth performance and lipid metabolism of juvenile Chinese mitten crab, six experimental diets were formulated by gradient supplementation 0%, 0.004% and 0.008% soybean isoflavones at different dietary lipid levels (10% and 15%), which were named to NF-0 group (10% fat and 0% SIF), NF-0.004 group (10% fat and 0.004% SIF), NF-0.008 group (10% fat and 0.008% SIF), HF-0 group (15% fat and 0% SIF), HF-0.004 group (15% fat and 0.004% SIF) and HF-0.008 group (15% fat and 0.008% SIF). All crabs with an initial weight of 0.4 ± 0.03 g were fed for 8 weeks. The results showed that diets supplementation with 0.004% or 0.008% SIF significantly increased the weight gain and specific growth rate of crabs. Diets supplementation with 0.004% or 0.008% SIF significantly reduced the content of non-esterified free fatty acids and triglycerides in the hepatopancreas of crabs at 10% dietary lipid level. Dietary SIF significantly decreased the relative mRNA expressions of elongase of very long-chain fatty acids 6 (elovl6), triglyceride lipase (tgl), sterol regulatory element binding protein 1 (srebp-1), carnitine palmitoyltransferase-1a (cpt-1a), fatty acid transporter protein 4 (fatp4), carnitine palmitoyltransferase-2 (cpt-2), Δ9 fatty acyl desaturase (Δ9 fad), carnitine palmitoyltransferase-1b (cpt-1b), fatty acid binding protein 10 (fabp10) and microsomal triglyceride transfer protein (mttp) in the hepatopancreas of crabs. At 15% dietary lipid level, 0.008% SIF significantly increased the relative mRNA expressions of fatty acid binding protein 3 (fabp3), carnitine acetyltransferase (caat), fatp4, fabp10, tgl, cpt-1a, cpt-1b and cpt-2 and significantly down regulated the relative mRNA expressions of Δ9 fad and srebp-1. In conclusion, SIF can improve the growth and utilization of high-fat diet by inhibiting genes related to lipid synthesis and promoting lipid decomposition in juvenile Chinese mitten crab.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"696b86de47936b745f10186b2a0033c29a9308a1361893e55c94e6a19b6149eb","category":"Interdisciplinary"}