{"title":"High-percentage new energy distribution network line loss frequency division prediction based on wavelet transform and BIGRU-LSTM","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308940","date":1724076000000,"content":"<p>by Xiangming Wu, Nan Song, Jifeng Liang, Ye Lv, Zitian Wang, Lijun Yang</p>\r\n\r\nThe access of new energy improves the flexibility of distribution network operation, but also leads to more complex mechanism of line loss. Therefore, starting from the nonlinear, fluctuating and multi-scale characteristics of line loss data, and based on the idea of decomposition prediction, this paper proposes a new method of line loss frequency division prediction based on wavelet transform and BIGRU-LSTM (Bidirectional Gated Recurrent Unit-Long Short Term Memory Network).Firstly, the grey relation analysis and the improved NARMA (Nonlinear Autoregressive Moving Average) correlation analysis method are used to extract the non-temporal and temporal influencing factors of line loss, and the corresponding feature data set is constructed. Then, the historical line loss data is decomposed into physical signals of different frequency bands by using wavelet transform, and the multi-dimensional input data of the prediction network is formed with the above characteristic data set. Finally, the BIGRU-LSTM prediction network is built to realize the probabilistic prediction of high-frequency and low-frequency components of line loss. The effectiveness and applicability of the method proposed in this paper were verified through numerical simulation. By dividing the line loss data into different frequency bands for frequency prediction, the mapping relationship between different line loss components and influencing factors was accurately matched, thereby improving the prediction accuracy.","author":"Xiangming Wu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"697dbbb06709f8e1ca99a376fe44cd46b4b77a1e6280778563db330d3ac8762d","category":"Interdisciplinary"}