{"title":"Your iPhone ‘Batterygate’ check will be arriving soon–with a little extra","link":"https://www.macworld.com/article/2030996/your-batterygate-check-is-finally-in-the-mail-and-its-a-lot-bigger-than-you-thought.html","date":1692155765000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Remember the “Batterygate” class-action suit? Back in 2020, Apple finally settled a 2018 class-action lawsuit brought behalf of those with an iPhone 6 or iPhone 7 who were upset that Apple would reduce performance as the battery degraded, in order to keep the phone functioning. It resulted in a battery replacement program, reduced battery pricing, and a $500 million settlement.</p>\n\n\n\n<p>Perhaps most importantly, Apple made its battery management more transparent, and iOS now gives you better information about your battery health and whether or not your iPhone’s performance might be impacted by it.</p>\n\n\n\n<p>That $500M figure was supposed to represent $25 per affected user. Today, according to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.mercurynews.com/2023/08/11/apple-to-pay-up-to-500-million-to-iphone-users-after-judge-nixes-final-appeal/&amp;xcust=1-1-2030996-1-0-0&amp;sref=https://www.macworld.com/feed\">The Mercury News</a>, Apple is finally clear to begin payments. For the last few years, several iPhone owners have appealed the settlement, claiming it was insufficient. Their last appeal has been lost, and now payments can begin.</p>\n\n\n\n<p>If you filed a claim three years ago, you might get up to $65, not $25 as originally expected. Apple’s payments will be “between $310 million to $500 million” in total. After the lawyers get their piece, the rest is divided among the approved claims. There were about 3 million claims, which puts the final payments at around $65 per person. But some claims are still being assessed, so the final figure could change a little.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"697e0fa1fef6460a30cfbf38ecd359af26acce239fada8f85b53a802d5862532","category":"Apple"}