{"title":"Let’s face it, Apple is never getting rid of the ridiculous 13-inch MacBook Pro","link":"https://www.macworld.com/article/1997491/13-inch-macbook-pro-m3-processor-touch-bar-price-existence.html","date":1689762600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>At the end of June, I said that we probably <a href=\"https://www.macworld.com/article/1966309/imac-macbook-air-pro-mac-mini-m3-2024.html\">won’t be getting any new Macs</a> for the rest of the year, based on reports that Apple’s chips cycle had been affected by production issues. However, new reports indicate that Apple could release new Macs this fall.</p>\n\n\n\n<p>According to Bloomberg’s Mark Gurman, <a href=\"https://www.macworld.com/article/1996129/m3-imac-macbook-air-pro-launch-2023-fall-event.html\">Apple may release new Macs this October</a> that feature the M3 chip. Either Apple and TSMC (the chip manufacturer) have been able to address the production issues, or the <a href=\"https://www.macworld.com/article/1807369/m3-processor-mac-ipad-pro-2024-release.html\">reports of a delay</a> were exaggerated. In any case, Gurman reports that the first Macs to get the M3 are the iMac, the 13-inch MacBook Air…and the 13-inch MacBook Pro.</p>\n\n\n\n<p>The 13-inch MacBook Pro! It’s the misfit of Apple’s Mac lineup, but if there’s any doubt that Apple is truly behind this MacBook model, that doubt can be laid to rest should an M3 update see the light of day. Even so, I still can’t understand why. For its price and what you get, there are better MacBooks in Apple’s lineup.</p>\n\n\n\n<h2>The MacBook Air is a better buy</h2>\n\n\n\n<p>The M3 update will not be your typical Mac update. The M3 will be made using the 3-nanometer manufacturing process, which allows for a higher transistor density in the chip compared to the enhanced 5nm M2 and the standard 5nm M1. That could produce a performance increase that’s more than the usual 20 to 25 percent from generation to generation. The M3 may also be more power efficient, which means longer battery life for MacBooks. <a href=\"https://www.macworld.com/article/1953800/apple-m3-cpu-gpu-speed-performance.html\">Learn all about the potential of the M3</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m1-004.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"13 inch M2 MacBook Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m1-004.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m1-004.jpg?resize=300%2C225&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m1-004.jpg?resize=768%2C576&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m1-004.jpg?resize=1200%2C900&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"900\" /><figcaption><p>The M3 13-inch MacBook Pro will likely start at $1,299, which is $200 more than an M3 13-inch MacBook Air that offers similar performance.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Let’s assume that Apple will not change the prices of the MacBooks when the M3 arrives. The 13-inch MacBook Pro starts at $1,299, while the 13-inch MacBook Air (which is also getting an M3 upgrade) starts at $1,099. Two laptops with the same chip offer the same performance (based on our testing of the M1 and M2 models), but the Air is $200 cheaper.</p>\n\n\n\n<p>Now, when I say “the same performance” I’m talking about the general, everyday tasks that most people use these laptop models for. The 13-inch MacBook Pro has fans to maintain an optimal temperature. The MacBook Air does not, so it could throttle its performance during CPU or GPU-intensive tasks, such as a long 4K video render–but if you’re doing that kind of task, you’re better off spending the extra money on a 14- or 16-inch MacBook Pro.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m2-009.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"13-inch M2 MacBook Pro (left) and the 14-inch M1 Pro MacBook Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m2-009.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m2-009.jpg?resize=300%2C225&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m2-009.jpg?resize=768%2C575&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/06/13inch-macbook-pro-m2-009.jpg?resize=1200%2C899&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"899\" /><figcaption><p>The 13-inch MacBook Pro (left) doesn’t look like the 14-inch (right) or 16-inch MacBook Pro.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Old design</h2>\n\n\n\n<p>Apple considers the 13-inch MacBook Pro as part of the pro lineup with the 14- and 16-inch MacBook Pro, but if you put the three laptops side by side, you wouldn’t think they were part of the same lineup. The 14- and 16-inch models feature sleeker designs that look more compact, and it has smoother curves that give it a refined look. The displays have smaller bezels and a camera notch at the top that reminds people of the iPhone.</p>\n\n\n\n<p>On the other hand, the 13-inch MacBook Pro has a design that’s several years old, with harsh edges and much larger bezels because they had to be that big to accommodate the tech being used back in 2017. Even if you pull the 13-inch MacBook Pro out of the pro comparison and sit it next to a MacBook Air, you know what? The comparison gets worse because the Air has more in common with the 14- and 16-inch MacBook Pro than the 13-inch MacBook Pro–the Air, at first glance, actually looks like it belongs in the Pro lineup.</p>\n\n\n\n<p>The 13-inch MacBook Pro doesn’t even have an advantage when it comes to ports. It has two Thunderbolt 4/USB-C ports and a headphone jack, the same as the MacBook Air.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"M1 MacBook Pro Touch Bar\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/07/m1-macbook-pro-touch-bar.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>For fans of the Touch Bar, it’s the 13-inch MacBook Pro or bust.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>The reasons why Apple keeps it around</h2>\n\n\n\n<p>Macworld columnist Jason Snell last year wrote some theories on <a href=\"https://www.macworld.com/article/787109/13-inch-macbook-pro-reasons-to-exist.html\">why Apple kept the 13-inch MacBook Pro around during the upgrade to the M2</a> that still apply to a future M3 upgrade.</p>\n\n\n\n<p>The first theory is recycling; Apple loves to promote recycling and using the 13-inch MacBook Pro year after year epitomizes that. Perhaps more important to Apple is that the longer a design is implemented, the more profitable it is to make. Since the 13-inch MacBook Pro design has been around for several years, it must bring Apple a tidy profit, even with chip upgrades.</p>\n\n\n\n<p>Another theory is that the 13-inch MacBook Pro has some features not found in the MacBook Air: a cooling fan, a slightly bigger battery than the 13-inch MacBook Air, a better three-microphone array, and the Touch Bar. But these features tend to address a very specific customer base, not the majority. Then there’s marketing. The 14-inch MacBook Pro starts at $1,999, but the 13-inch Pro brings the entry point to the pro lineup down $700. So the company can say its MacBook Pro starts at $1,299, which makes it a more palatable marketing point. </p>\n\n\n\n<p>That matters to shoppers who don’t pay close attention to what they’re buying. But there are likely more than a few 13-inch MacBook Pro owners who have buyer’s remorse, especially now that the 15-inch Air has arrived for the same price. Once you take a closer look and compare prices, specifications, features, and performance, you’ll find that Apple offers better choices than the 13-inch MacBook Pro, and that’s not going to change when the M3 version arrives.</p>\n\n\n\n<p>But it seems like Apple is never going to give up on the 13-inch Pro. The M3 model will likely have the same old design, same price, and same Touch Bar, and that’s the way Apple likes it.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"698cfff4ba271d5a54b1ed2c12b015cdac330f976dda3a44a157845c5b3cef80","category":"Apple"}