{"title":"What the iPhone 15 Pro's Volume Buttons Could Look Like","link":"https://www.macrumors.com/2023/04/13/iphone-15-pro-volume-button-renders/","date":1681403486000,"content":"With recent rumors indicating a last-minute change to the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a>'s feature set, what's in store for the device's volume buttons remains to be seen. We've heard multiple rumors that the ‌iPhone 15 Pro‌ models are set to adopt a new volume button and mute switch design, but emerging rumors about Apple's <a href=\"https://www.macrumors.com/2023/04/11/kuo-iphone-15-pro-no-solid-state-buttons-after-all/\">abandonment of solid-state</a> button technology throw the design rumors into chaos.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Upper-Perspective.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nAs of right now, there is no indication that Apple will change its plans for a single, elongated volume button and a mute button instead of a mute switch, and we have an accurate look at what the buttons will look like provided there are no radical design shifts in store. <a href=\"https://twitter.com/URedditor\">Leaker Unknownz21</a> worked with <em>MacRumors</em> to share the actual design of the ‌iPhone 15 Pro‌'s volume and mute buttons, which haven't been seen before now.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Upper-Perspective-ZOOM.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWe used ‌iPhone 15 Pro‌ information sourced from Unknownz21 to create images that depict the design of the volume, mute, and power buttons, including a view of the internal components. Note that these renders were created before the most recent solid-state rumors, there could be changes to the internal layout, but there is a good chance the external design will remain the same. In fact, Unknown21 has confirmed that the solid-state button design was still in development until very, very recently, and there is a chance that it hasn't been canceled at all.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Lower-Perspective.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nLeaks to date have gotten the single volume rocker rumor right, but the design that Apple developed includes a split in the middle to designate the volume up and volume down sections of the button. With the middle split, the design looks similar to two separate buttons, but it is a notable departure from the current button design in which the volume up and volume down buttons are distinct.\r<br />\n\r<br />\n<div></div>\r<br />\nApple has not used this kind of unified button design since the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> 3GS in 2009, as the company swapped to two separate round volume up and down buttons with the ‌iPhone‌ 4, and ultimately transitioned to dual elongated buttons with the 2014 launch of the ‌iPhone‌ 6. It is worth highlighting that the single button design the middle separation has been in place since the early ‌iPhone 15 Pro‌ development period. \r<br />\n\r<br />\nApple initially planned to introduce the single volume button design alongside solid-state technology, but reliable Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> believes solid-state buttons <a href=\"https://www.macrumors.com/2023/04/11/kuo-iphone-15-pro-no-solid-state-buttons-after-all/\">have been abandoned</a>. There were \"unresolved technical issues\" that Apple was unable to address before mass production, so solid-state buttons will be delayed and ultimately introduced with a <a href=\"https://www.macrumors.com/2023/04/12/iphone-16-pro-solid-state-buttons/\">later version of the iPhone</a>.\r<br />\n\r<br />\nSolid-state technology is what Apple uses for the Mac's trackpad and the Home button on <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> iPhones. With this feature, the volume button on the ‌iPhone 15 Pro‌ and Pro Max would not have physically depressed, instead using haptic feedback to mimic the feel of a press. With haptic buttons delayed, Apple could instead use the single button design with standard physical buttons.\r<br />\n\r<br />\n<div><blockquote><p>So far I haven’t seen anything to suggest a different exterior design for the buttons - if this is true then I think it’ll likely be more of an internal change, rather than something visible.<br /><br />Currently, EVT units use the existing design - although changes are always possible 🤔 <a href=\"https://t.co/eK71637HRJ\">https://t.co/eK71637HRJ</a></p>— Unknownz21 🌈 (@URedditor) <a href=\"https://twitter.com/URedditor/status/1646171471998271493?ref_src=twsrc%5Etfw\">April 12, 2023</a></blockquote> </div>\r<br />\nIn his Medium post, Kuo said the buttons will have a \"traditional physical button design,\" but he did not provide context on whether Apple would stick with the single volume button design change or revert to the same two button design that was used for the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models. There is now some added mystery surrounding what kind of volume button design we'll get for the ‌iPhone 15 Pro‌ and 15 Pro Max, and there are arguments both for keeping the single button design and for reverting to the prior design. Unknownz21 believes that Apple will make minimal changes to the buttons at this point, and that while there could be added separation between the buttons, the design will not be the same as the ‌iPhone 14‌ button design.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Volume-Module-Lower-Perspective.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nGiven that there are other internal changes planned for the ‌iPhone 15 Pro‌ and Pro Max to accommodate new camera technology (specifically in the case of the periscope lens for the Pro Max), it may not be easy for Apple to go back to the original volume button design. Additionally, there were rumors that Apple planned to replace the mute switch with a mute button, and that the button could serve as a <a href=\"https://www.macrumors.com/2023/03/29/iphone-15-pro-action-button-rumor/\">multi-use Action button</a> similar to the Action button on the <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Volume-Module-Lower-Perspective-ZOOM.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe ‌Apple Watch Ultra‌ Action button and the Side button on all Apple Watch models use physical button technology. They are not haptic or solid-state, so a case can be made that what works for the watch will work for the ‌iPhone‌. Apple can retain the single volume button and the \"Action\" button even without a shift to haptic technology. Apple has been referring to the button as the \"ringer button\" or \"action button\" internally, which does indeed seem to suggest there could be a multi-function customizable button.\r<br />\n\r<br />\n<div></div>\r<br />\nWe have a detailed look at the module (codenamed \"Bongo\") that Apple designed for the volume button, mute button, and power button, created with information about the internal layout. While the renders still give a look at the potential external design that Apple will go with, it is likely that there are going to be internal changes to this design. Apple initially intended to add two additional Taptic Engines to the ‌iPhone 15 Pro‌ models to power the haptic buttons, but those will no longer be needed. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/iP15-Pro-Volume-Module-Upper-Perspective.jpg\" alt width=\"3840\" height=\"2160\" />\r<br />\nUnless Apple has last minute plans to abandon the mute switch to button transition and the elongated volume button in favor of the prior design, what we are sharing here today is a true-to-life depiction of what the ‌iPhone 15 Pro‌ and Pro Max will look like. It is the most complete picture of the ‌iPhone 15 Pro‌ to date, and it is the design that Apple has conceptualized since the ‌iPhone 15 Pro‌ was in early design stages.\r<br />\n\r<br />\nWhile the loss of solid-state button technology is a major disappointment for those who were looking forward to it, Apple has other notable design changes that are coming to the ‌iPhone 15 Pro‌ models. The device chassis will be made from titanium, which is the same material that Apple uses for the ‌Apple Watch Ultra‌. Like the frame, the buttons will be made from titanium as well.\r<br />\n\r<br />\nTitanium is stronger than aluminum and lighter weight than stainless steel, the material that Apple used for the <a href=\"https://www.macrumors.com/roundup/iphone-14-pro/\">iPhone 14 Pro</a>. We are expecting a weight reduction for the ‌iPhone 15 Pro‌ compared to the ‌iPhone 14 Pro‌ just based on material update, but final weight will be dependent on the alloy that Apple uses and the internal layout changes.\r<br />\n\r<br />\nTitanium has more of a brushed, matte finish than stainless steel, and the more subdued texture will be more resistant to fingerprints. Apple has also tested <a href=\"https://twitter.com/URedditor/status/1646237361536204914\">a shiny mirror finish</a> for the ‌iPhone 15 Pro‌ frame, so there is a small chance that both shiny and matte options could be offered for some of the models. As titanium is stronger than stainless steel, the ‌iPhone 15 Pro‌'s frame could be more resistant to dents, dings, and bending, but it may be easier to scratch because the oxide layer is easily damaged.\r<br />\n\r<br />\nIn addition to a titanium frame, the ‌iPhone 15 Pro‌ and Pro Max will also have a design that slims down the bezels and deepens the curve at the corners of the device, so while it will look similar to the ‌iPhone 14 Pro‌, it will be distinct. The bezels are notably smaller and will increase the available display area somewhat, but no changes are expected for the <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a>.\r<br />\n\r<br />\nOther ‌iPhone 15 Pro‌ features include TSMC's 3-nanometer A17 chip, a USB-C port instead of a Lightning port, a periscope camera lens for the ‌iPhone 15 Pro‌ Max with expanded optical zoom, faster 5G, and Wi-Fi 6E.\r<br />\n\r<br />\nNote that many new additions, including the planned unified volume button, the mute button, and the titanium frame, will be limited to the higher-end ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max and will not be available with the standard <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models.\r<br />\n\r<br />\nFor more on the ‌iPhone 15 Pro‌ and Pro Max, we have a dedicated <strong><a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro roundup</a></strong> that aggregates everything we've heard so far, and we also have a <strong><a href=\"https://www.macrumors.com/roundup/iphone-15/\">separate iPhone 15 roundup</a></strong> that gives a better idea of the differences between the Pro and non-Pro models.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/13/iphone-15-pro-volume-button-renders/\">What the iPhone 15 Pro's Volume Buttons Could Look Like</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-the-iphone-15-pros-volume-buttons-could-look-like.2386739/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"69a7945b48258e87ad95fcd3260f25fcac26bd1e90b74ab1c9bdfbd62729b48c","category":"Apple"}