{"title":"IRC Boken Doublecross tire review: A curious approach to mixed-terrain speed","link":"https://cyclingtips.com/2021/04/irc-boken-doublecross-tire-review-a-curious-approach-to-mixed-terrain-speed/","date":1619109399000,"content":"<p>I’ve always had a soft spot in my heart for semi-slick tires, dating back to the mid-1990s when the Michelin Wildgripper Sprint was my go-to rear for mountain biking. The fine center tread looked fast — and was fast — and yet the tacky rubber still offered surprising good climbing traction (even in moderate mud!) Meanwhile, its stout cornering knobs gave me all the confidence I wanted when blasting through corners. </p>\n\n\n\n<p>I’ve been on and off (mostly on) the semi-slick bandwagon ever since, and it was with this same sense of hope that I took delivery of IRC’s Boken Doublecross, built with a tubeless-ready 60 TPI nylon casing, an almost perfectly smooth center tread, and particularly meaty cornering knobs.</p>\n\n\n\n<p>In this case, though, the Boken Doublecross is billed as an “aggressive all-conditions gravel tire”, supposedly offering both excellent straight-line speed and secure cornering for demanding events like the original Belgian Waffle Ride in southern California, whose 217 km (135 mi) course serves up a brutally diverse mix of tarmac, dirt fire roads, rocky hiking trails, and honest-to-goodness singletrack. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/IRC-Boken-Doublecross-tire-review-2-1340x754.jpg\" /><figcaption>The tread design rolls quite well on paved and hardpacked surfaces, but in terms of outright grip, it could benefit from softer rubber.</figcaption></figure>\n\n\n\n<p>Speed is nice to have for a mixed-terrain event like the Belgian Waffle Ride, but so is traction and casing durability. After all, even the fastest tires are slow when you’re carrying them.</p>\n\n\n\n<p>IRC offers the Boken Doublecross solely in 700c diameter, but in three different casing widths — 33, 38, and 42 mm — all with size-specific tread variations. The 38 mm and 42 mm versions are the most similar to each other, with a very tightly packed center tread matched to a much more open shoulder design with a double row of staggered L-shaped blocks. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/IRC-Boken-Doublecross-tire-review-3-1340x754.jpg\" /><figcaption>Not surprisingly, the Boken Doublecross isn’t ideal in mud given how the center tread tends to pack up.</figcaption></figure>\n\n\n\n<p>In contrast, the 33 mm Boken Doublecross’s center knobs are relatively tightly packed, although nowhere near as smooth as the two larger sizes, and all of the knobs are not only smaller overall, but more evenly spread out. It’s so different that it should arguably be a different model altogether, and curiously, IRC’s own description even suggests as such.</p>\n\n\n\n<p>I tested the 38 mm tire here. Actual average weight was 472 g per tire (just 7 g heavier than claimed), and retail price is US$60 / AU$78 / £43 / €50.</p>\n\n\n\n<h2>Installation notes</h2>\n\n\n\n<p>Installation was pleasantly straightforward, with a just-right bead diameter that was neither too tight nor too loose on the variety of wheels I tried. Inflation was relatively easy with a Topeak JoeBlow Ace DX floor pump in the high-volume setting. The casing sealed up nicely, too, holding tight with 40 mL of sealant per tire and absolutely zero weeping post-installation.</p>\n\n\n\n<p>I generally hover around 70-72 kg (153-159 lb) depending on the time of year, and after a fair bit of experimentation, I eventually settled on an operating pressure of 34/35 psi, front/rear. Mounted on my reference set of <a href=\"https://cyclingtips.com/2020/11/dt-swiss-gr-1600-spline-25-gravel-wheelset-long-term-review-the-sweet-spot/\" target=\"_blank\">DT Swiss GR1600 Spline 25</a> aluminum clinchers (24 mm internal width), the actual measured tire width was notably oversized at just a hair under 41 mm. </p>\n\n\n\n<h2>Ride report</h2>\n\n\n\n<p>We’ve learned an awful lot about rolling resistance and tire construction in recent years, and the Boken Doublecross’s fairly stiff casing suggests that it wouldn’t exactly be the fastest around. That’s only one piece of the puzzle, however; tread design and rubber compounds still matter, too. True to IRC’s claims, the Boken Doublecross’s mostly smooth center and seemingly faster-rebounding rubber are impressively efficient-feeling on tarmac, maintaining speed nicely on harder surfaces in general and delivering a notably quiet roll.</p>\n\n\n\n<p>Off-road, that somewhat stiffer casing serves up a little more of a mixed bag. On the one hand, it’s proven to be reassuringly durable, sloughing off sharp rocks with minimal fear of pinch-flatting — even at lower pressures — and virtually no sidewall scuffing since I started testing these in November. Tread wear has been excellent, too. </p>\n\n\n\n<p>So in terms of hard-surface rolling efficiency, casing toughness, and tread durability, the Boken Doublecross has a lot going for it. But where I found myself wanting more was traction.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/IRC-Boken-Doublecross-tire-review-4-1340x754.jpg\" /><figcaption>The rounded profile feels good when cornering hard on pavement. Looser conditions would arguably be better served with a more squared-off shape, though.</figcaption></figure>\n\n\n\n<p>The harder compound worked well on tarmac in terms of grip, with even the open shoulder pattern providing a surprisingly confident feel when leaned over, thanks to the stout knob shape and firm rubber. The rounded profile feels natural when switching directions, too. It’s no race slick, of course, but the on-road cornering manners were far better than I’d expected based on appearances.</p>\n\n\n\n<p>Off-road, the Boken Doublecross was more disappointing. The combination of a relatively hard compound and minimal center tread provide only so-so drive and braking traction, especially on looser surfaces. And while that rounded profile and higher-rebound rubber are nice on pavement, I found them more apt to slide through corners instead of confidently biting into the ground like something with a more squared-off shoulder. Dropping the inflation pressure certainly helped with the traction, but it also came at the expense of rolling efficiency. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/IRC-Boken-Doublecross-tire-review-5-1340x754.jpg\" /><figcaption>It might seem like there are lots of biting edges, but the Boken Doublecross’s relatively hard rubber compound could still use some more.</figcaption></figure>\n\n\n\n<p>In fairness to IRC, some of this criticism is due to the challenging traction conditions I have here on the Colorado Front Range, where ground conditions are often more akin to kitty litter over concrete than tacky, brown dirt. That said, I’ve also found those surfaces to quickly reveal weaknesses in tires that might otherwise be masked on surfaces that inherently provide more grip.</p>\n\n\n\n<p>Even omitting the squared-off profile that’s admittedly more region/conditions-specific, I’d like to see a suppler casing and better rubber — maybe even dual-compound rubber — because that would make this tire a better performer no matter where you are.</p>\n\n\n\n<h2>Doubling down on the Doublecross?</h2>\n\n\n\n<p>Whether you find the above characterization of the Boken Doublecross’s performance positive or negative will likely depend heavily on what you value in a gravel tire. </p>\n\n\n\n<p>If your primary goal is ultimate performance, you can certainly do better here. The WTB Riddler is still one of my all-time favorites, for example, thanks to its combination of shockingly good rolling efficiency and outstanding grip on mixed surfaces. The tacky rubber compound helps the low-profile center tread work far better than you’d expect when climbing or under hard braking, and the squared-off shoulder tread with that dense array of stout cornering knobs inspires confidence when you’re leaned over on loose ground way more than you should be. </p>\n\n\n\n<p>But that supple casing is also known for offering less-than-stellar puncture protection (though the latest formulation is apparently better), and the rubber wears fairly quickly.</p>\n\n\n\n<p>It’s a somewhat similar story with something like the ultra-popular Schwalbe G-One Allround. It’s fast and fun with a superb rubber compound, but also not the most durable or longest-lasting.</p>\n\n\n\n<p>This IRC Boken Doublecross, though? It’s not the fastest, and certainly not the grippiest mixed-conditions tire I’ve used. But it’s quite good on tarmac — definitely better than I thought it’d be — and while it slides around more on actual gravel than I’d prefer, it’s also proven to be impressively tough and durable such that I’m confident it would continue to deliver that modest performance for more than a single season of hard use. </p>\n\n\n\n<p>If you’re made of money, the choice is easy: go with one of the options on the market that offers more outright performance (e.g. the WTB Riddler). But if you prefer to squeeze a bit more out of your hard-earned dollar and are willing to give up some outright performance in return for more durability and longevity — while still being pretty good on a wide range of surface types — this seems like a pretty solid way to go.</p>\n\n\n\n<p>For more information, visit <a href=\"https://ircbike.com/collections/gravel/products/boken-doublecross\" target=\"_blank\">www.ircbike.com</a>.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/04/irc-boken-doublecross-tire-review-a-curious-approach-to-mixed-terrain-speed/\">IRC Boken Doublecross tire review: A curious approach to mixed-terrain speed</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"69a950e74d46870086154fe208188f98e60885ddb74a112fa063bc1c5145c36c","category":"Cycling"}