{"title":"Predicting Above-Ground Biomass of Forest in South Carolina: Integrating Remote Sensing, Machine Learning, and Interpolation Techniques","link":"https://www.preprints.org/manuscript/202409.1867/v1","date":1727279521000,"content":"This study evaluates the effectiveness of a Random Forest model for predicting above-ground biomass in South Carolina (SC), utilizing diverse remote sensing and climatic data sources. SC, with its humid subtropical climate and varied geography, including the Atlantic coastal plain, Piedmont, and Blue Ridge Mountains, poses unique challenges for biomass estimation. We integrated global biomass datasets for 2010, MODIS vegetation indices (NDVI and EVI), Leaf Area Index (LAI) from MOD15A2H, and climate data from TerraClimate. The model was trained using 2010 data and applied to 2022 datasets to assess biomass changes. To validate the model, plot-level biomass estimates from the 2023 FIA data were interpolated using Inverse Distance Weighting (IDW). Performance evaluation showed a strong positive correlation between predicted and observed biomass, with a correlation coefficient of 0.77 and an R² value of 0.62, indicating that the model explains 62% of the variability in biomass. Comparison with IDW-interpolated biomass data resulted in a correlation coefficient of 0.64, confirming the model's validity. Although the Random Forest model demonstrated reliable predictions, the study suggests potential improvements by incorporating additional data sources and advanced modeling techniques. The findings emphasize the value of integrating remote sensing data, machine learning, and interpolation methods to enhance biomass estimation accuracy. This research provides crucial insights into biomass distribution in SC and establishes a basis for future studies on forest monitoring and carbon accounting, highlighting the importance of combining various data sources for comprehensive environmental analysis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"69b43243e3274555282f1cd935b5abeac017a124a4ddbc8c844975b00e890900","category":"Interdisciplinary"}