{"title":"Over The Last 14 Years, iPhone Prices Have Gone Up More Than 80%","link":"https://www.macrumors.com/2021/10/14/iphone-price-increase-over-14-years/","date":1634218717000,"content":"Since its launch in 2007, the price of the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> has gone up more than 80% around the world, according to a new study that looked at ‌iPhone‌ prices all over the world and their increase and decrease over the years.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iphone-13-display-pro-max.jpg\" />\r\n<br />\r\nAccording to the <a href=\"https://www.self.inc/info/iphone-price-index/\">study conducted by Self</a>, since its launch in 2007 and subsequent annual upgrades, the price of iPhones has increased more than 80%, now costing over $400 more on average to buy in countries around the world compared to the original ‌iPhone‌. \r\n<br />\r\n<blockquote>Since its US launch in 2007 and subsequent years in other countries, iPhone prices have increased by 81% across the globe. This means that in 2021, the latest flagship iPhone model costs $437 more to buy in each of the 38 countries it's available in than it used to.</blockquote>While the price increase comes alongside more advanced technology and increases in production costs, the increase also comes as a result of inflation and Apple having to sometimes increase prices to counter economic growth. \r\n<br />\r\n<blockquote>However, many countries have experienced inflation and growth in purchasing power in the years between, and our research shows that Apple have risen iPhone prices 26% higher than local inflation rates. This means that local affordability for a flagship iPhone costs people around the world $154 more in real terms than the first models they could purchase.</blockquote>As part of its research, Self has created an interactive map that highlights the changes in ‌iPhone‌ prices in real-world terms as a percentage of GDP over the last 14 years in more than 30 countries around the world. According to that map, the United Arab Emirates has witnessed the largest increase in the price of the ‌iPhone‌, with the latest model costing more than double what it did when it originally launched.<br />This article, \"<a href=\"https://www.macrumors.com/2021/10/14/iphone-price-increase-over-14-years/\">Over The Last 14 Years, iPhone Prices Have Gone Up More Than 80%</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/over-the-last-14-years-iphone-prices-have-gone-up-more-than-80.2316906/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=sX1jHl9woJE:EyXUMfWBclM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=sX1jHl9woJE:EyXUMfWBclM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/sX1jHl9woJE\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"69bb902e54b0677959e034e33bbc2fcc886992826c0c0aa8249d57b6b6459baf","category":"Apple"}