{"title":"Apple releases macOS Sonoma 14.1.2 to fix exploited zero-day WebKit flaws","link":"https://www.macworld.com/article/2159458/apple-releases-macos-sonoma-14-1-2-to-fix-exploited-zero-day-webkit-flaws.html","date":1701375950000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>With macOS 14.2 still in beta, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT214032&amp;xcust=1-1-2159458-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple has released macOS Sonoma 14.1.2</a> with a pair of critical security Safari updates. Apple only says 14.1.2 includes “important bug fixes and security updates,” but its security update page describes two patches for WebKit flaws that “may have been exploited.”</p>\n\n\n\n<p>The two WebKit flaws, which were also patched in iOS and iPadOS with 17.1.2:</p>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing web content may disclose sensitive information. Apple is aware of a report that this issue may have been exploited against versions of iOS before iOS 16.7.1.</li>\n\n\n\n<li><strong>Description:</strong> An out-of-bounds read was addressed with improved input validation.</li>\n\n\n\n<li><strong>WebKit Bugzilla:</strong> 265041<br /><strong>CVE-2023-42916:</strong> Clément Lecigne of Google’s Threat Analysis Group</li>\n</ul>\n\n\n\n<p><strong>WebKit</strong></p>\n\n\n\n<ul>\n<li><strong>Impact:</strong> Processing web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been exploited against versions of iOS before iOS 16.7.1.</li>\n\n\n\n<li><strong>Description:</strong> A memory corruption vulnerability was addressed with improved locking.</li>\n\n\n\n<li><strong>WebKit Bugzilla:</strong> 265067<br /><strong>CVE-2023-42917:</strong> Clément Lecigne of Google’s Threat Analysis Group</li>\n</ul>\n\n\n\n<p>Apple also released Safari 17.1.2 for macOS Ventura and other versions of macOS before Sonoma. To update to Sonoma 14.1.2 or Safari 17.1.2 in Ventura, head over to <em>System Settings</em>, then <em>General</em> and <em>Software Update</em>, and click <em>Update Now</em>. On pre-Ventura Macs, go to <em>System Preferences</em> and click on the <em>Software Update</em> pane.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"69c4d03cb97894928af43f72befb43ad926024d82f6aee4048df79522a028bad","category":"Apple"}