{"title":"Airfoil review: Sheer delight in streaming audio to any device","link":"https://www.macworld.com/article/550431/mac-gems-airfoil-review.html","date":1636714800000,"content":"<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div></div><h3>Price When Reviewed</h3><p>$29 (free test version available); $15 upgrade to version 5</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Rogue Amoeba</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$29</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.rogueamoeba.com/airfoil/mac/buy.php&amp;xcust=1-1-550431-2-239602-11825&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p></p>\n\n\n\n<p>macOS is magnificent at allowing us to add audio destinations. You can target internal speakers, external ones added via USB, Apple TVs, third-party compatible receivers and smart TVs, and even the seemingly isolated HomePods and HomePod minis because of their networked nature.</p>\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/mag-gems-airfoil-main.png?w=483\" /><figcaption>The main interface lets you redirect an app or other input to one or more outputs.</figcaption></figure></div></div>\n\n\n\n<p>But if you want to orchestrate directing sound to multiple speakers or have controls at your fingertips to pick and change destinations, macOS doesn’t offer much. In iTunes or Music, you can click the AirPlay button to select audio output devices, including choosing more than one if they’re AirPlay 2 compatible, but that’s as sophisticated as macOS gets. iOS and iPadOS offer much richer options.</p>\n\n\n\n<p>Airfoil steps into that audio breach as it has for 15 years. The single-minded app lets you choose one or more audio destinations from a list of locally connected audio devices, including via Bluetooth, and from networked AirPlay devices. It’s also compatible with Sonos and various Google “Cast” hardware. By installing the free <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://rogueamoeba.com/airfoil/satellite/&amp;xcust=1-1-550431-1-0-0&amp;sref=https://www.macworld.com/feed\">Airfoil Speakers</a> under Android, iOS, iPadOS, macOS, or Windows, you can add those devices’ audio output <em>and</em> use them for remote control of your Mac’s copy of Airfoil.</p>\n\n\n\n<p>Airfoil lets you manually select multiple speakers and targets, controlling the volume of each individually. You can also build groups of speakers to target a preferred set of destinations with a single click.</p>\n\n\n\n<p>The Advanced Speaker Options dialog in the Speakers menu helps with a common problem: keeping sound in sync with all the potential delays across different networking methods. You can tweak the Sync slider for each destination while music is playing to avoid the highly disconcerting sound of out-of-phase playback.</p>\n\n\n\n<p>Airfoil includes a 10-band equalizer with a variety of presets to match different styles of music and spoken-word audio.</p>\n\n\n\n<p>The app can take its input from any running app or any other app you select, from any audio input source on your computer, and from special system inputs, which can include something like passing text to speech to a particular device. (For more elaborate sound routing with options for professionals, Rogue Amoeba offers Loopback; <a href=\"https://www.macworld.com/article/232341/loopback-2-review.html\">see my review of Loopback 2</a>.)</p>\n\n\n\n<p>The current release of Airfoil supports macOS 10.14 through 12. This includes what Rogue Amoeba describes as “initial compatibility” for Monterey with no known problems, but it plans further development. Airfoil is $29. A test version can be downloaded and used for free; the app overlays static after 10 minutes.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/mag-gems-airfoil-eq.png\" /><figcaption>A 10-band equalizer provides controls for modulating audio to sound its best.</figcaption></figure></div>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/mag-gems-airfoil-speaker-groups-prefs.png\" /><figcaption>Set up groups to associate preferred sets of audio devices, allowing for single-click selection.</figcaption></figure></div>\n\n\n\n<p>Airfoil, like several other Rogue Amoeba apps, requires installing a low-level driver called Audio Capture Engine. Improved system integrity and security in macOS 11 Big Sur and 12 Monterey require a multi-step sequence and a few restarts—more with an M1 than an Intel Mac. The company <a href=\"https://www.macworld.com/article/232341/loopback-2-review.html\">provides a step-by-step illustrated guide</a> for both kinds of Macs.</p>\n\n\n\n<p>Airfoil provides the ghost audio controls you reached for in macOS and found missing. It enhances macOS’s might as a sound-producing operating system as well as if it were built in.</p>\n\n\n\n<p><em>Macworld <a href=\"https://www.macworld.com/article/227479/airfoil-5-review-audio-utility-pumps-up-the-volume-with-bluetooth-support-airfoil-satellite-and-mor.html\">reviewed the last major update to Airfoil</a>, version 5, in 2016.</em></p>\n\n\n\n<p><em>With the strong resurgence of the Mac in recent years, we want to celebrate the tools we use and that readers recommend to make the most of your macOS experience. Mac Gems highlights great nuggets of Mac software, apps that have a high utility, have a sharp focus on a limited set of problems to solve, and are generally developed by an individual or small company. Stay tuned for weekly updates, and send your suggestions to the Mac Gems Twitter feed (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macgems&amp;xcust=1-1-550431-1-0-0&amp;sref=https://www.macworld.com/feed\">@macgems</a>).</em></p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"69c8da4ceda435b669f399c0dc7d4540f723b92ac24931287ea94198def7af5b","category":"Apple"}