{"title":"184 The metabolism of vitamin D is modulated by vitamin C supplementation during porcine reproductive and respiratory syndrome challenge in post-weaning piglets","link":"https://academic.oup.com/jas/article/102/Supplement_2/131/7665015?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This study evaluated the impact of different dietary vitamin D sources combined or not with vitamin C on serum 25(OH)D<sub>3</sub> concentrations and the expression of genes related to antimicrobial peptides and to the metabolism of vitamin D, vitamin C, calcium (Ca), and phosphorus (P). From weaning (d 21) until d 68, 27 piglets were fed a post-weaning diet supplemented with: 1,500 IU of vitamin D<sub>3</sub> (CTR; n = 9); 200 IU of vitamin D<sub>3</sub> + 2,000 IU of 25(OH)D<sub>3</sub> (HD; n = 8); or HD + 500 mg/kg of vitamin C (HD+C; n = 10). From d 40 to 68 piglets were exposed to porcine reproductive and respiratory syndrome (PRRS) using a natural disease challenge model. At d 68, after blood collection, all piglets were euthanized for the collection of lung and kidney samples. The concentrations of serum 25(OH)D<sub>3</sub> were determined by HPLC and the mRNA expression of genes of interest was assessed by qPCR. Data were analyzed in a one-way analysis of variance with three treatments. At d 40 (after 19 d of supplementation), serum 25(OH)D<sub>3</sub> concentrations were greatest for HD+C (22.48 ± 1.25 ng/mL), intermediate for HD (17.43 ± 0.84 ng/mL), and least for CTR (8.54 ± 0.65 ng/mL) treatments (<span>P</span> &lt; 0.01). At d 68 (after 28 d of PRRS challenge) these values were greatest for HD (14.64 ± 2.77 ng/mL), intermediate for CTR (6.22 ± 0.59 ng/mL), and least for HD+C (2.18 ± 0.13 ng/mL; <span>P</span> &lt; 0.01). No treatments effect was detected on pulmonary CYP27B1, RXRα, SLC23A1, RIGI, PR-39, and pBD1. In lungs, VDR expression was least for HD+C (<span>P</span> ≤ 0.06) whereas MDA5 expression was greatest for HD+C (<span>P</span> ≤ 0.07), and SLC23A2 expression was greatest for HD (<span>P</span> ≤ 0.09; Table 1). No treatments effect was detected on expression of renal FGFR1, KL, RXRα, SLC23A1, SLC23A2, and TPRV5. In kidney, CYP27B1 expression was greatest for HD+C groups (<span>P</span> = 0.03) and CYP24A expression was greatest for HD (<span>P</span> = 0.01). Renal EGR1 and NPT2c expressions were greatest for CTR groups and least for HD+C (<span>P</span> = 0.09) whereas WNK4 expression was greatest for HD+C and least for CTR (<span>P</span> = 0.10). Renal VDR expression was greatest for HD groups and least for HD+C (<span>P</span> ≤ 0.05). In conclusion, vitamin C supplementation increased serum 25(OH)D<sub>3</sub> concentrations in pre-challenged piglets. These concentrations were reduced by vitamin C supplementation after PRRS challenge, which may be related to a greater synthesis of the active form of vitamin D in the kidney. Little effects were detected on pulmonary antimicrobial peptides, but the gene expression related to renal P reabsorption was influenced by HD+C whereas Ca reabsorption was apparently not impacted by treatments.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"69d7909a65a7e0003c1d7cd64035dfac358dca470a2d3802bd9e82cb763a97e3","category":"Environment"}