{"title":"Persistence of fish populations to longer, more intense, and more frequent mass mortality events","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17251?af=R","date":1711168978000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/504a7455-124d-433a-9897-879ac8b8c63c/gcb17251-toc-0001-m.png\" alt=\"Persistence of fish populations to longer, more intense, and more frequent mass mortality events\" />\n<p>Mass mortality events happen over short periods when a large number of individuals are dying and thus removed from the population. These events are becoming increasingly more common. The young fish are particularly sensitive to strong changes in their environment, such as marine heatwaves, that can cause mass mortality events among them. We demonstrate that the probability of observing a population collapse increases with increasing frequency, intensity, and duration of these young fish mass mortality events. The presented framework estimates which fish species are sensitive to these increasingly more common extreme events.</p>\n<br />\n<h2>Abstract</h2>\n<p>Over the last decades, mass mortality events have become increasingly common across taxa with sometimes devastating effects on population biomass. In the aquatic environment, fish are sensitive to mass mortality events, particularly at the early life stages that are crucial for population dynamics. However, it has recently been shown for fish, that a single mass mortality event in early life typically does not lead to population collapse. Moreover, the frequency and intensity of extreme events that can cause mass mortality, such as marine heatwaves, are increasing. Here, we show that increasing frequency and intensity of mass mortality events may lead to population collapse. Since the drivers of mass mortality events are diverse, and often linked to climate change, it is challenging to predict the frequency and severity of future mass mortality events. As an alternative, we quantify the probability of population collapse depending on the frequency and intensity as well as the duration of mass mortality events. Based on 39 fish species, we show that the probability of collapse typically increases with increasing frequency, intensity, and duration of the mortality events. In addition, we show that the collapse depends on key traits such as natural mortality, recruitment variation, and density dependence. The presented framework provides quantitative estimates of the sensitivity of fish species to these increasingly common extreme events, which paves the way for potential mitigation actions to alleviate adverse impacts on harvested fish populations across the globe.</p>","author":"Øystein Langangen, \nJoël M. Durant","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"69ebc82d14561484ad46b448cc999b63f361411bb112b0289190f79b39ddd63e","category":"Environment"}