{"title":"384 Synthesis of glycine from trans-4-hydroxy-L-proline by placentae but not endometria of gestating gilts","link":"https://academic.oup.com/jas/article/102/Supplement_3/248/7757432?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Trans-4-hydroxy-L-proline (Hyp) is an abundant amino acid in the collagen of pigs. The turnover of this protein releases a large amount of Hyp, traditionally considered a metabolic waste. However, results of recent studies documented the conversion of Hyp into glycine in young pigs. Because pregnant gilts are typically fed a soybean meal-based diet that contains insufficient glycine and provides only 35% of the total glycine needed by pregnant gilts, it is possible that the conceptus can form glycine from Hyp. This hypothesis was tested in the present study. Gilts were fed a 1.8-kg corn- and soybean meal-based diet containing 14% crude protein. On d 90 of gestation, gilts (n = 5) were hysterectomized after euthanasia. Slices (~ 100 mg) of placentae or endometria were incubated at 37 °C for 2 h in oxygenated (95% O<sub>2</sub>/5% CO<sub>2</sub>) Krebs-Henseleit bicarbonate buffer (pH 7.4, with 5 mM D-glucose) containing 0 or 2 mM Hyp. After a period of 2 h incubation, 200 μL of 1.5 M HClO<sub>4</sub> was added into the incubation medium to stop the reaction. The tissues were homogenized and rinsed with 1 mL water, followed by the addition of 100 μL of 2 M K<sub>2</sub>CO<sub>3</sub>. The neutralized extract was analyzed for amino acids using HPLC involving derivatization with o-phthaldialdehyde. Tissues that received no incubation time were determined as well. Data were analyzed by the paired t-test. Results indicated that glycine was produced from 2 mM Hyp by the placenta (Table 1). Glycine was subsequently converted into serine by the placenta. The formation of glycine and serine from Hyp was not due to protein breakdown because there were no differences (<span>P</span> &gt; 0.05) in concentrations of tyrosine (an amino acid that is neither synthesized nor degraded by porcine placentae) in the incubation medium plus tissue at the end of a 2-h incubation period. In contrast to placentae, endometria did not form glycine or serine from Hyp. These findings indicate an important role for Hyp in the provision of both glycine and serine in the conceptus, which may be nutritionally and physiologically significant to compensate for a deficiency of glycine in maternal diets for gestating gilts. (Supported by a USDA/NIFA grant # 2022-67015-36376 and USDA multistate Hatch project #7752: S1081)</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"69ec6fabbd03732f31090a1944c599253b413f2676a1df33e287cd97ef4cea06","category":"Environment"}