{"title":"Abundance and diversity of the culturable nectar mycobiome in Rhododendron catawbiense varies with elevation","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae079/7742493?rss=1","date":1724716800000,"content":"<span><div>Abstract</div>The nectar microbiome can influence pollinator choice and plant fitness. Previous research has shown that changes in environmental conditions at large spatial scales can influence nectar microbiome composition. However, little is known about how changes in climate with increasing elevation affect nectar microbiome abundance and composition. Here, we describe the culturable nectar mycobiome (CNMB) of <span>Rhododendron catawbiense</span> (Ericaceae) by quantifying colony abundance, identity and richness of fungal genera. We further evaluate how the CNMB abundance, diversity and composition (i.e. the fungal species within the nectar microbiome) varies at two different elevations. Nectar samples were collected from <span>R. catawbiense</span> individuals at a high and low elevation and were cultured on yeast agar with 0.01% chloramphenicol media. Fungal colonies were categorized morphologically, quantified and then identified using DNA barcoding. In total, 2822 fungal colonies were recorded belonging to six genera across both elevations. Elevation did not influence CNMB diversity (Simpson’s diversity index) or genera richness per flower, however only three genera were found at the high elevation while six were found at the low elevation. Elevation had a significant effect on colony abundance with a 95% increase in the number of colonies in nectar samples at low compared with the high elevation. Variation in abundance and the overall genera composition of fungal colonies across elevations may have the potential to affect nectar quantity and quality and ultimately pollination success. This study adds to our understanding of the drivers of CNMB composition across spatial scales and its potential implications for plant–pollinator interactions.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"69ef12024fe3d966972a08ca6a8955b6f21eea2ec04a2f334c6aacfeba9bca52","category":"Environment"}