{"title":"Low Frequency Ventilation Facilitates Weaning in Acute Respiratory Distress Syndrome Treated with Extracorporeal Membrane Oxygenation: A Randomized Trial","link":"https://www.preprints.org/manuscript/202408.0960/v1","date":1723621620000,"content":"Although extracorporeal membrane ventilation offers the possibility for low frequency ventilation, protocols commonly used in patients with acute respiratory distress syndrome (ARDS) and treated with extracorporeal membrane oxygenation (ECMO) vary largely. Whether strict adherence to low frequency ventilation offers benefit on important outcome measures is poorly understood. Background/Objectives: This pilot clinical study investigated the efficacy of low frequency ventilation on ventilator free days (VFDs) in patients suffering from ARDS treated with ECMO therapy. Methods: In this single-center randomized controlled trial, 44 (70% male) successive ARDS patients treated with ECMO (aged 56 ± 12 years, SAPS III 64 (SD ± 14)) were randomly assigned 1:1 to control group (conventional ventilation) or treatment group (low fre-quency ventilation during first 72 hours on ECMO: respiratory rate 4-5/min; PEEP 14-16cm H2O; plateau pressure 23-25 cm H2O, tidal volume: &lt; 4mL/kg). The primary endpoint was VFDs at day 28 of ECMO start. The major secondary endpoint was ICU mortality, 28-day and 90-day mortality. Results Twenty-three (52%) patients could be successfully weaned from ECMO and were discharged from intensive care unit (ICU). Twelve patients in the treatment group and five patients in the control group showed more than one VFD at day 28 after ECMO. VFDs were 3.0 (SD ± 5.5) days in the control group and 5.4 (SD ± 6) days in the treatment group (P = 0.117). Until day 28 after ECMO initiation, patients in the treatment group could be more often successfully weaned from ventilator (OR of 0.164 of 0 VFDs at day 28 after ECMO start; 95% CI 0.036-0.758; P = 0.021). ICU mortality did not differ significantly (36% in treatment group and 59% in control group; P = 0.227). Conclusions: Low frequency ventilation is comparable to conventional protec-tive ventilation in patients with ARDS treated with ECMO. However, low frequency ventilation may support weaning from invasive mechanical ventilation in patients suffering from ARDS treated with ECMO therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"69f0a1843b6c51200c7ad4ada4e56e784e1a4abb78dac43ac6b796a4d564159e","category":"Interdisciplinary"}