{"title":"PSIV-19 Effects of Flavolac feed top dress in lactation on sow body weight change and litter performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/306/7665082?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>A total of 271 mixed parity sows (PIC 1050) were used to evaluate the effect of feeding Flavolac in lactation diets on sow farrowing performance and litter growth performance during summer conditions. Flavolac (Agroceres Multimix; Rio Claro, Sao Paulo, Brazil) is a commercial product containing several compounds, including amino acids, antioxidants, botanicals, direct fed-microbials, and vitamin-like compounds, that individually have previously been shown to improve litter weaning weight or preweaning mortality. However, there are no published data on the benefit when these compounds are used in combination. The experiment was conducted at a commercial sow farm located in northwest Texas. At approximately d 112 to 114 of gestation, sows were moved to the farrowing house, and randomly allotted to 1 of 2 treatments based on parity and caliper score. Treatments consisted of a control diet (no Flavolac) or the control diet with an added Flavolac top-dress (80 g/d in a single feeding). Sows were weighed before entering the farrowing house and at weaning. Sows were provided approximately 1.8 kg per day of a common lactation diet without Flavolac pre-farrowing. After farrowing, sows were provided ad libitum access to lactation feed. Application of treatments began after cross fostering, approximately 24 h post-farrowing. The weaning age averaged approximately 21.3 d. There was no evidence of differences (<span>P</span> &gt; 0.10) in sow body weight (BW) at entry, weaning, or overall BW change (Table). There was no evidence of differences (<span>P</span> &gt; 0.10) for sow entry caliper, weaning caliper score, caliper score change, or average daily lactation feed disappearance. In addition, there was no evidence of differences (<span>P</span> &gt; 0.10) in total litter or piglet birth weight. However, administration of Flavolac tended (<span>P</span> &lt; 0.10) to increase litter weaning weight, total litter weight gain, and litter average daily gain. The inclusion of Flavolac led to a tendency (<span>P</span> = 0.091) for a reduction in pre-weaning mortality and therefore, an improvement in percentage of pigs weaned relative to those on d 2. In summary, inclusion of Flavolac during the lactation period resulted in a tendency for reduced pre-weaning mortality and tended to improve total litter weight gain, and thus litter weight at weaning.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6a023368bb22a7ae7ce2aaee1bdaf1f727abff3dc689f9a92f6f9206e1c8c293","category":"Environment"}