{"title":"Apple Confirms iOS 17.4 Disables Home Screen Web Apps in the European Union","link":"https://www.macrumors.com/2024/02/15/ios-17-4-web-apps-removed-apple/","date":1708023763000,"content":"With the second beta of iOS 17.4, Apple <a href=\"https://www.macrumors.com/2024/02/08/ios-17-4-nerfs-web-apps-in-the-eu/\">disabled much of the functionality</a> of Progressive Web Apps (PWAs) in the European Union. There was some speculation that it could be a temporary change or a bug related to some of the updates to the app ecosystem in Europe, but Apple has confirmed that PWAs were intentionally removed and won't be returning.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iOS-17.4-Feature-Blue.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn an <a href=\"https://developer.apple.com/support/dma-and-apps-in-the-eu\">update on the Developer website</a> (via <em><a href=\"https://9to5mac.com/2024/02/15/ios-17-4-web-apps-european-union/\">9to5Mac</a></em>),  Apple explains that users in the EU will not have access to <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a> web apps due to the support for alternative browser engines and the accompanying security risks and work required to implement a new solution.\r<br />\n\r<br />\nAccording to Apple, ‌Home Screen‌ web apps are built on WebKit and its security architecture, and are designed to \"align with the privacy and security model for native apps on iOS.\" Storage isolation and system prompts to access privacy functions on a per-site basis are crucial.\r<br />\n\r<br />\nWithout isolation, Apple claims that malicious web apps could read data from other web apps and gain access to a user's camera, microphone, and location without user consent. To fix these security issues, Apple would need to build a new integration architecture, which it says is not practical because of the other Digital Markets Act requirements and because ‌Home Screen‌ web apps aren't used by many people.\r<br />\n<blockquote>The iOS system has traditionally provided support for Home Screen web apps by building directly on WebKit and its security architecture. That integration means Home Screen web apps are managed to align with the security and privacy model for native apps on iOS, including isolation of storage and enforcement of system prompts to access privacy impacting capabilities on a per-site basis.\r<br />\n\r<br />\nWithout this type of isolation and enforcement, malicious web apps could read data from other web apps and recapture their permissions to gain access to a user's camera, microphone or location without a user's consent. Browsers also could install web apps on the system without a user's awareness and consent. Addressing the complex security and privacy concerns associated with web apps using alternative browser engines would require building an entirely new integration architecture that does not currently exist in iOS and was not practical to undertake given the other demands of the DMA and the very low user adoption of Home Screen web apps. And so, to comply with the DMA's requirements, we had to remove the Home Screen web apps feature in the EU.</blockquote>\r<br />\n<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users in the European Union can access websites directly from the ‌Home Screen‌ through a bookmark, but PWA features won't be available. Web apps on the ‌Home Screen‌ will be forced to open in Safari (or another default browser) rather than in a dedicated window, there isn't support for long-term local storage, and notifications won't work.\r<br />\n\r<br />\nApple says that the changes are a direct result of DMA compliance, and will affect only a \"small number of users.\" The company also says that it regrets the impact the change will have on developers of ‌Home Screen‌ web apps and ‌iPhone‌ users.\r<br />\n\r<br />\nThe update to ‌Home Screen‌ web apps comes alongside many other changes to the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> in the European Union, with Apple allowing alternative app marketplaces, alternative payment methods, different browser engines, and more.<div>Tag: <a href=\"https://www.macrumors.com/guide/european-union/\">European Union</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/15/ios-17-4-web-apps-removed-apple/\">Apple Confirms iOS 17.4 Disables Home Screen Web Apps in the European Union</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-confirms-ios-17-4-disables-home-screen-web-apps-in-the-european-union.2419554/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6a0ecfa3c73aaf4b986817d89d867c28e2db97c8ae0e4afedddf1127fc23be00","category":"Apple"}