{"title":"Grinduro California Ride Extends Registration, Skirts the Snow","link":"https://bikerumor.com/grinduro-california-2023-registration/","date":1683739018000,"content":"<p>Grinduro California, the popular gravel party with a race in the middle that also benefits a local outdoor nonprofit, returns this year for another installment of the ride that tells “a tale of two sides” of Mt. Shasta.</p>\n\n\n\n<p>For race organizers, the name of the game this year is getting butts on saddles. To that end, they’ve excitedly announced there’s no snow “anywhere” on the 59.1-mile course, and that wildflowers are “exploding.” Also, there’s no hike-a-bike on this trip, which organizers said will embolden some but “admittedly chagrin” others.</p>\n\n\n\n<p>The weekend runs May 19-21, with races on Saturday sandwiched between assorted revelry and ancillary rides. Organizers extended the registration deadline in a final bid to fill out the grid. </p>\n\n\n\n<p>“Riders will experience everything from rough remote gravel roads to smooth swoopy singletrack, all between an elevation of 3,500-5,000 feet to stay out of the snowpack,” a press release said.</p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy.jpg\"><img width=\"800\" height=\"449\" src=\"https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-800x449.jpg\" alt=\"riding a gravel road among tall pine trees with mt. shasta in the background\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-800x449.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-297x167.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-120x67.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-768x431.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-1536x862.jpg 1536w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-400x225.jpg 400w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy-1200x675.jpg 1200w, https://bikerumor.com/wp-content/uploads/2023/05/IMG_0775-copy.jpg 1600w\" /></a><figcaption>From a provided photo set labeled “2023 course conditions.”</figcaption></figure>\n\n\n\n<p>Course co-designer Dave Tricamo dove in further.</p>\n\n\n\n<p>“The Grinduro course comes in at 59.1 miles with 21 of those paved and 6,325 ft. of elevation gain. Do not be misled by the mileage, this is a tough course with relentless changes in elevation and a multitude of surface types that will keep riders on their toes. And as for the <a href=\"https://bikerumor.com/long-term-review-easton-ec90-ax-gravel-wheels-keep-on-rollin-through-any-terrain/\" target=\"_blank\">most important of considerations</a>, tire type and pressure! I’d ride a 40C tire with some knobs at about 40 PSI. This is not a mountain bike course,” Tricamo advised.</p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1.jpg\"><img width=\"800\" height=\"533\" src=\"https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-800x533.jpg\" alt=\"a woman rides a singletrack through a rocky trail\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-800x533.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-297x198.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-120x80.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-768x512.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-1536x1024.jpg 1536w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-2048x1365.jpg 2048w, https://bikerumor.com/wp-content/uploads/2023/05/ELPL5936-1-720x480.jpg 720w\" /></a><figcaption>Rugged but not rough — part of the 2022 course.</figcaption></figure>\n\n\n\n<p>Racing takes place Saturday, May 20. Roughly speaking, the course leads riders from smooth, wide roads in timber country south of Mt. Shasta to a steep, zigzagging singletrack finish. Along the way, there’s scenic private property Grinduro obtained special permission to ride, plus some challenging gravel climbs, and an idyllic lunch on the Lake Siskiyou shores.</p>\n\n\n\n<p>A shorter option, Grindurito, appeals to riders less experienced or out for a lark. At 35.5 miles and 3,546 ft. of climbing, it encompasses Grinduro stages 2-4.</p>\n\n\n\n<p>The three-day event also includes preliminaries on Friday, and the “Wahoo Hangover Ride” on Sunday — plus plenty of “maxin’ and relaxin'” in the form of camping, live music, food, and “festival vibes.” For routes, GPX files, and all available course details, check out the <a href=\"https://grinduro.com/california-maps.php\" target=\"_blank\">course maps site</a>.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Many divisions covering multiple age and skill brackets <a href=\"https://www.bikereg.com/grinduro-california\" target=\"_blank\">are open in each race</a>. Ages 13-61 and over are welcome, as are para-cyclists, non-binary riders, single speeders (<em>shudder</em>), and tandem teams. Generally, you’ll pay $250 for the Grinduro and $225 for the Grindurito.</p>\n\n\n\n<p>And oh, yeah, your money goes to a cause that seeks to protect activities like gravel riding in the area. The event benefits its organizer, the <a href=\"https://siskiyououtdooralliance.org/\" target=\"_blank\">Siskiyou Outdoor Recreation Alliance</a> (SORA). The nonprofit is “focused on promoting sustainable outdoor recreation through programs, policy, planning, and stewardship,” the press release said. Funds from each Grinduro, it added, go directly toward trail maintenance and construction for the following year’s race.</p>\n\n\n\n<p>There’s even a funding stream that benefits low-income families in the area who may want to get out in the mountains, but don’t have the resources.</p>\n\n\n\n<p>“In addition to the Siskiyou Stewardship Fund, Grinduro proceeds support the SORA Equipment Lending Library, which makes mountain bikes and cross-country ski equipment available to serve low-income and disproportionately impacted populations from the Siskiyou-Mount Shasta region. The project aims to ensure youth and disabled people have equitable access to essential equipment so they can participate in fun and healthy activities offered through local outdoor recreation programs,” Justi Hansen, SORA Executive Director, explained in the press release.</p>\n\n\n\n<p>“All of us at SORA are so proud to welcome the Grinduro community to Mt. Shasta,” Hansen added. “Riders are helping us fulfill our mission while they’re out there having a good time.”</p>\n\n\n\n<p><a href=\"https://grinduro.com/california.php\" target=\"_blank\"><em>grinduro.com</em></a></p>\n<p>The post <a href=\"https://bikerumor.com/grinduro-california-2023-registration/\">Grinduro California Ride Extends Registration, Skirts the Snow</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Sam Anderson","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"6a1058f22333d6ff1b96007bb9588215d4132c5265568efee146efce25aa09ab","category":"Cycling"}