{"title":"Inositol trisphosphate and ryanodine receptor signaling distinctly regulate neurite pathfinding in response to engineered micropatterned surfaces","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308389","date":1725544800000,"content":"<p>by Joseph T. Vecchi, Madeline Rhomberg, C. Allan Guymon, Marlan R. Hansen</p>\r\n\r\nMicro and nanoscale patterning of surface features and biochemical cues have emerged as tools to precisely direct neurite growth into close proximity with next generation neural prosthesis electrodes. Biophysical cues can exert greater influence on neurite pathfinding compared to the more well studied biochemical cues; yet the signaling events underlying the ability of growth cones to respond to these microfeatures remain obscure. Intracellular Ca<sup>2+</sup> signaling plays a critical role in how a growth cone senses and grows in response to various cues (biophysical features, repulsive peptides, chemo-attractive gradients). Here, we investigate the role of inositol triphosphate (IP3) and ryanodine-sensitive receptor (RyR) signaling as sensory neurons (spiral ganglion neurons, SGNs, and dorsal root ganglion neurons, DRGNs) pathfind in response to micropatterned substrates of varied geometries. We find that IP3 and RyR signaling act in the growth cone as they navigate biophysical cues and enable proper guidance to biophysical, chemo-permissive, and chemo-repulsive micropatterns. In response to complex micropatterned geometries, RyR signaling appears to halt growth in response to both topographical features and chemo-repulsive cues. IP3 signaling appears to play a more complex role, as growth cones appear to sense the microfeatures in the presence of xestospongin C but are unable to coordinate turning in response to them. Overall, key Ca<sup>2+</sup> signaling elements, IP3 and RyR, are found to be essential for SGNs to pathfind in response to engineered biophysical and biochemical cues. These findings inform efforts to precisely guide neurite regeneration for improved neural prosthesis function, including cochlear implants.","author":"Joseph T. Vecchi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6a188a22b4f900044db8694eda75445b6d2701a497f5c6ee7c7505df89904219","category":"Interdisciplinary"}