{"title":"413 Evaluation of utilizing personal development tools in collegiate science curriculum to enhance soft skill development","link":"https://academic.oup.com/jas/article/102/Supplement_3/420/7757326?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study examines the integration of CliftonStrengths, within the Department of Animal Science at Iowa State University. In previous semesters, CliftonStrengths was introduced to freshmen, but no further application of the assessment took place. Fall 2023 incoming students completed more intensive application following completion of the assessment. The objective of this study aims to determine if students’ soft skills are enhanced through awareness and application of their own strengths. This study surveyed new and current students, analyzing their perceptions towards CliftonStrengths and their experiences in group settings. Three surveys were administered at different time points during the fall 2023 semester, one current student survey (CSS) at the start of the semester, and two new student surveys for the beginning (pre-NSS) and end (post-NSS) of the semester. Surveys captured demographic data and responses on a 0 to 10 scale. Response rates were 42% from pre-NSS, 22% CSS, and 24% from post-NSS. The pre-NSS and CSS contained 46 and 37 first-generation students, respectively. The pre-NSS consisted of 120 freshmen and 17 transfer students, and the CSS consisted of 43 sophomores, 44 juniors, and 59 seniors. Survey questions were structured around the primary domains within CliftonStrengths; strategic thinking, relationship building, influencing, and executing. Analysis of the pre-NSS responses showed 61% of new students were not familiar with CliftonStrengths and 78% have not taken the assessment. The CSS showed that 66% of current students have taken the CliftonStrengths Assessment. New students that completed intensive application of CliftonStrengths reported a 2.8-point increase from pre-NSS (4.9 ± 2.96) to post-NSS (7.7 ± 2.51) in response to identifying the value of CliftonStrengths in everyday life. New students reported being more comfortable with strengths at the conclusion of this semester with an average response of 9 ± 1.4 on a 10-point scale. The responses to “I believe someone in my career path should know their strengths” had higher average response rates from post-NSS (7.7 ± 0.26) compared with CSS (6.9 ± 0.20). Student responses to “I believe knowing my Strengths helps me at my best” also had higher average response rates from post-NSS (8.3 ± 0.24) compared with CSS (7.4 ± 0.18). Students responded to “I feel confident that I can recognize strengths in others” with higher response rates in the post-NSS (7.1 ± 0.30) compared with CSS (6.1 ± 0.18). All questions asking about the ability to identify domain types of other individuals were higher in post-NSS responses compared with CSS. The post-NSS responses to understanding how to use different domains in a group were greater for strategic thinkers, relationship builders, and influencers. In conclusion, the intensive application of CliftonStrengths in the Department of Animal Science at Iowa State University has increased familiarity, confidence, and comfort with their strengths.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6a22f530899f6d8c37d2acf4ebeff6e26e38670e4f476f0512d1648c010abad0","category":"Environment"}