{"title":"Apple Declines to Appeal UK Ruling That Revives Antitrust Probe Into Browser and Cloud Gaming Restrictions","link":"https://www.macrumors.com/2023/12/19/apple-declines-to-appeal-uk-ruling/","date":1702993687000,"content":"Apple has decided to not appeal a UK court ruling that revives a comprehensive antitrust investigation into its dominance in mobile browsers and cloud gaming, meaning it will commence in January (via <a href=\"https://open-web-advocacy.org/blog/cma-reopens-investigation-into-apple/\">Open Web Advocacy</a>).\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/app-store-blue-banner-uk-fixed.jpg\" width=\"1794\" height=\"1009\" />\r<br />\nIn late November, London's Court of Appeal <a href=\"https://www.macrumors.com/2023/11/30/uk-revives-antitrust-probe-into-apple-restrictions/\">effectively reversed</a> a previous verdict that had halted the probe, reinforcing the authority of the UK's Competition and Markets Authority (CMA). There was a 21-day grace period before the investigation could restart to provide Apple with a sufficient window to respond.\r<br />\n\r<br />\nApple had the option to appeal to the Supreme Court until yesterday, but decided not to do so, meaning that the CMA's investigation is set to resume efforts to scrutinize the company's influence in the mobile browser market and its approach to cloud gaming on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>. The <a href=\"https://www.gov.uk/cma-cases/mobile-browsers-and-cloud-gaming?utm_medium=email&amp;utm_campaign=govuk-notifications-topic&amp;utm_source=1c322e66-03ab-4704-ba89-5cf1839a587e&amp;utm_content=immediately#court-of-appeal-judgment\">CMA's latest update</a>:<blockquote><strong>18 December 2023</strong>: The deadline for Apple to seek the Court of Appeals permission to appeal the Court's decision has now lapsed, therefore in accordance with the Court's order dated 30 November 2023, the market investigation will recommence on 24 January 2023.</blockquote>In November 2022, the CMA <a href=\"https://www.macrumors.com/2022/11/22/uk-cma-market-probe-apple-google/\">launched an investigation</a> into the cloud gaming and mobile browser restrictions put in place by both Apple and Google, suggesting that the two companies were holding back innovation and increasing costs for web developers, cloud gaming service providers, and browser vendors. This decision was initially <a href=\"https://www.macrumors.com/2023/03/31/uk-apple-browser-probe-shut-down/\">overturned</a> by the Competition Appeal Tribunal (CAT), which agreed with Apple that the CMA <a href=\"https://www.macrumors.com/2023/03/31/uk-apple-browser-probe-shut-down/\">took too long to open an investigation</a>.\r<br />\n\r<br />\nThe Court of Appeal's latest judgment clarified that the CMA acted within its legal bounds, rejecting Apple's argument regarding time limits. The ruling emphasized that such restrictions apply only to consultation processes within a market study and do not limit the CMA's broader investigative powers.\r<br />\n\r<br />\nThe court highlighted the CMA's role in promoting competition and safeguarding consumer interests, pointing out the potential \"serious consequences\" of restricting these powers. The investigation is a part of the CMA's broader effort to scrutinize the power exerted by tech giants like Apple and Google overs mobile ecosystems with a focus on operating systems, app stores, and web browsers on mobile devices.<div>Tags: <a href=\"https://www.macrumors.com/guide/antitrust/\">Apple Antitrust</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/19/apple-declines-to-appeal-uk-ruling/\">Apple Declines to Appeal UK Ruling That Revives Antitrust Probe Into Browser and Cloud Gaming Restrictions</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-declines-to-appeal-uk-ruling-that-revives-antitrust-probe-into-browser-and-cloud-gaming-restrictions.2414152/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6a2a6b3ca31fe87e0cd20dd8e2f0ea3b20700f5e711b78a986dab3f9218e29e8","category":"Apple"}