{"title":"‘Poor Charlie’s Almanack’ (and the Tragic State of E-Books)","link":"https://www.stripe.press/poor-charlies-almanack","date":1703886364000,"content":"\n<p>When Charlie Munger — Warren Buffet’s longtime partner at Berkshire Hathaway — died last month at 99, <a href=\"https://daringfireball.net/linked/2023/11/28/charlie-munger-rip\">I mentioned</a> that a new edition of <em>Poor Charlie’s Almanack</em> was about to be published by Stripe Publishing (a subsidiary of the very same Stripe of e-payments renown).</p>\n\n<p><a href=\"https://press.stripe.com/poor-charlies-almanack\">The hardcover edition</a> is out, but Stripe has also made the entire book available on this marvelous website. The site is beautiful, fun, and clever, and <a href=\"https://daringfireball.net/linked/2023/04/11/make-something-wonderful\">reminds me</a> greatly of <a href=\"https://stevejobsarchive.com/book\">the web edition of The Steve Jobs Archive’s <em>Make Something Wonderful</em></a>. Both are damning condemnations of the state of e-books.</p>\n\n<p>Regarding <em>Make Something Wonderful</em>, <a href=\"https://twitter.com/sdw/status/1645833999762472960\">Sebastiaan de With wrote</a>:</p>\n\n<blockquote>\n  <p>It’s hard to capture the delight of a real book, but this website \ndoes a fantastic job coming close. Lots of delightful, thoughtful \nlittle details. </p>\n\n<p>I say “ebook” because it isn’t a word used anywhere on the \nwebsite, likely for good reason: there are no good ebooks. The \nePub file lacks all the delight of the beautiful website. Books on \nApple Books are objectively worse than their written counterparts. \nThis might be nicer. </p>\n</blockquote>\n\n<p>Kindle editions are even more primitive, design-wise. Compare <a href=\"https://www.amazon.com/gp/product/B0C5TCGPPS?ref=knfdg_R_hard_pew&amp;asin=B0C5TCGPPS&amp;revisionId=a2fa6a1f&amp;format=1&amp;depth=1\">the Kindle preview</a> of <em>Poor Charlie’s Almanack</em> to the website edition. It’s like comparing a matchbook to a blowtorch. With the e-book editions — Kindle, Kobo, Apple Books, whatever — you can merely read these books. With the web editions, you <em>experience</em> them.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/29/poor-charlies-almanack\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6a40ba25078e14b3b7bb3ec0face3f26cfc4bfc7c58c02774fb5d91429fb9e9c","category":"Tech"}