{"title":"Apple fixes Photos smart album bug that originated in macOS Catalina","link":"https://www.macworld.com/article/343708/apple-fixes-photos-smart-album-bug-that-originated-in-macos-catalina.html","date":1619611200000,"content":"\n<div>\n<section><div></div></section><p>The mathematician Bertrand Russell discovered a paradox in 1901 about sets of things: collections could be described that couldn’t contain themselves, even though the rules said they must. One approachable non-mathematical explanation involves barbers: imagine a barber who only shaves people who don’t shave themselves. Could that barber shave themself?</p>\n\n\n\n<p>Apple posed a similar but simpler conundrum via <a href=\"https://www.macworld.com/article/233908/how-to-work-around-a-photos-bug-in-macos-catalina-that-thinks-an-image-or-movie-remains-in-an-album.html\">a bug it introduced into smart albums in macOS Catalina</a> that the company fixed in macOS Big Sur. You can create smart albums in Photos that include only photos and videos not included in <em>any</em> manually assembled album, one that has media included in <em>one or more albums</em>.</p>\n\n\n\n<p>The bug appeared in Catalina if you deleted an album using the Photos sidebar by Control-clicking the album name, selecting Delete Album, then confirming the deletion. The Photos app would forget to remove the “in an album” flag on the media, and you would find it still remained in a smart album that collected all images and videos not in any album.</p>\n\n\n\n<p>This has been fixed in Big Sur, preventing the explosion of any nearby robot brains trying to sort out the paradox. And, seemingly, no rebuild of your Photos library is required. Whatever operation Big Sur and Photos does the first time you launch Photos after upgrading appears to take care of any weirdness that might linger.</p>\n\n\n\n<p>Apple still lacks a way for something obvious to even the least mathematical mind: finding out which albums a photo and movie is actually present in if it’s present in any album! A kind contributor to Apple’s technical support forums <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/docs/DOC-250002459&amp;xcust=1-1-343708-0-0-0&amp;sref=https://www.macworld.com/feed\">created a complicated AppleScript</a> that provides the answer, however.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Line.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6a491b67893ddacd534ba2d7cd4614fb3c01d3e1c568e7e5486a55534c85e55d","category":"Apple"}