{"title":"How to fix an iPhone stuck on the Apple logo","link":"https://www.macworld.com/article/1982562/how-to-fix-iphone-stuck-apple-logo.html","date":1688987700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>iPhones are usually very reliable when it comes to updating software or transferring your data from an older model to a new one, but now and again you can experience a few problems. One of the most confusing is when the device only shows the Apple logo on the display and refuses to boot into iOS What can you do when this happens? We show you how to fix an iPhone stuck on the Apple logo. </p>\n\n\n\n<h2>How long has your iPhone been stuck on the Apple logo?</h2>\n\n\n\n<p>First up, it’s worth seeing if your iPhone is merely progressing slowly through an update, rather than stuck. Apple recommends checking that the progress bar under the logo hasn’t moved for at least an hour before becoming worried about a potential issue. If it has, then maybe give the device a little more time to process any large software updates it may be dealing with. But, if the progress bar gets stuck for longer than an hour, it’s probably time to try and fix the issue. </p>\n\n\n\n<p>There are two main routes you can use: Force Restart or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201263&amp;xcust=1-1-1982562-1-0-0&amp;sref=https://www.macworld.com/feed\">Recovery Mode</a>. The first simply forces the iPhone to turn itself off and then reboot. Like a Mac, a simple hard reboot will often fix whatever’s ailing your iPhone.</p>\n\n\n\n<p>Recovery Mode is required if a forced restart doesn’t work, but it does require you to connect the iPhone to a computer. This should either be a Mac running on at least macOS Catalina, a Mac running macOS Mojave or earlier but with iTunes installed, or a Windows PC with iTunes installed.  </p>\n\n\n\n<h2>Force Restarting a stuck iPhone</h2>\n\n\n\n<p>The quickest option is the Force Restart, as it quickly reboots your iPhone. It can be triggered by using the following button combinations:</p>\n\n\n\n<p><strong>iPhone 8 or later</strong>: You’ll need to do a little finger dancing to get modern iPhones into their recovery mode. First, press and release the Volume Up button, do the same for the Volume Down button, then press and hold the Side button until you see that the device has entered its recovery mode. This is signified by the screen going black, then the Apple logo returning. </p>\n\n\n\n<p><strong>iPhone 7 and iPhone 7 Plus:</strong> It’s a bit different on these devices, as you need to press and hold both the Volume Down and Sleep/Wake buttons at the same time. Keep holding them until the iPhone display goes black and then the Apple logo reappears.</p>\n\n\n\n<p><strong>iPhone 6S and earlier: </strong>If you’re still sporting one of these classics, here’s the button combination required. Press and hold both the Home button and the Sleep/Wake button, release the latter, and keep the Home button held down until you see the iPhone reboot.</p>\n\n\n\n<h2>Using Recovery Mode to fix an unresponsive iPhone</h2>\n\n\n\n<p>If these steps don’t clear the problem, then you’ll need to use the Recovery Mode method. Many of the steps are exactly the same as those listed above, the main difference is that you’ll need to plug your iPhone into the computer you have using the Lightining-to-USB-C cable supplied with your iPhone.</p>\n\n\n\n<p>For those on a Mac with macOS Catalina or later, open Finder and select your iPhone from the left-hand column. For those on a Mac with macOS Mojave (or earlier) or a Windows PC, open iTunes and select the iPhone from the left-hand column.  </p>\n\n\n\n<p>With this done you’ll need to put the iPhone into Recovery Mode. This is achieved by using the button combinations described in the Force Restart section. Rather than rebooting into iOS, you’ll see an image of a computer icon with a cable underneath. This signifies that the iPhone is in Recovery Mode. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Recovery mode on an iPhone\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?quality=50&amp;strip=all 1874w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iphone-stuck-on-Apple-logo-RECOVERY-MODE.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /></figure><p>Apple</p></div>\n\n\n\n<p>On your computer you should now see two options appear: <em>Update</em> or <em>Restore</em>. <em>Update</em> will install the latest version of iOS on your iPhone while leaving your data intact. Restore will wipe the data on your phone and re-install the latest version of the operating system. You’ll then be able to restore from the most recent iCloud backup.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"macOS update for a stuck iPhone\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?quality=50&amp;strip=all 1555w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=1200%2C674&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=1536%2C863&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/07/How-to-fix-an-iPhone-stuck-on-Apple-Logo-UPDATE.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"674\" /></figure><p>Apple</p></div>\n\n\n\n<p>Hopefully, you should see your iPhone up and running again after these steps. Should the worst-case scenario happen and the device remains unresponsive, then we recommend <a href=\"https://www.macworld.com/article/670653/how-to-book-an-appointment-at-an-apple-stores-genius-bar.html\">booking an appointment at your nearest Apple Store</a>, as they may be able to use more advanced tools to salvage the situation. </p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6a51f4989643030ea0fbee56091b00ce771e4f0ede6e50bc3091d016b4e994a7","category":"Apple"}