{"title":"Natural Flood Management Through Peatland Restoration: Catchment‐Scale Modeling of Past and Future Scenarios in Glossop, UK","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037320?af=R","date":1724683228000,"content":"<h2>Abstract</h2>\n<p>Field-scale experiments have shown the Natural Flood Management (NFM) potential of peatland restoration. The likelihoods of effectiveness are yet unknown at scales and storms large enough to impact human lives. Using GMD-TOPMODEL, we upscale a rare Before-After-Control-Intervention empirical data set to a 25 km<sup>2</sup> catchment with &gt;600 properties at flood-risk, and test storms of up to a 1,000-year return period (RP). Under these scales/storms, we find that it is not necessary (nor feasible) to delay the outlet flow-peak to meaningfully attenuate it. Enhancing catchment “kinematic” storage, for example, through restoration, can be sufficient to reduce flow magnitudes without detectable changes to peak-flow timing. NFM benefit increases exponentially with restoration area size under smaller storms, but linearly under larger storms. At RP ≤ 100 years, longer-lasting frontal-type storms are more challenging to defend against via NFM, but at RP &gt; 100 years shorter-duration convectional-type events become more challenging. In the order of 1,000–10 years storms: (a) revegetating the bare-peat areas in 15% of the catchment is 31%–61% likely to reduce peak-flows by &gt;5%; (b) revegetating &amp; damming the erosion gullies in ∼20% of the catchment is 42%–71% likely to reduce peak-flows by &gt;5%; (c) Growth of Sphagnum in the dammed gullies of ∼20% and ∼40% of the catchment increase the likelihoods of &gt;5% peak reductions to 65%–86% and 90%–98%, respectively. The numerical evidence of significant NFM benefit due to Sphagnum re-establishment is an important finding, because it shows that meaningful flood-risk mitigation in headwater catchments under scales/storms relevant to communities at risk can be delivered alongside other ecosystem benefits of Sphagnum re-establishment.</p>","author":"Salim Goudarzi, \nDavid Milledge, \nJoseph Holden, \nMartin Evans, \nTim Allott, \nAdam Johnston, \nEmma Shuttleworth, \nMartin Kay, \nDavid Brown, \nJoe Rees, \nDonald Edokpa, \nTom Spencer","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"6a51d361b245940647128470273ba62696c2957d6f1c4c31b43a6f8dd46f925d","category":"Environment"}