{"title":"48 The ruminal microbiome of conventionally and artificially raised lambs fed high-concentrate and high-forage post-weaning diets","link":"https://academic.oup.com/jas/article/102/Supplement_1/88/7617970?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Artificially rearing lambs on milk replacer impacts development of the ruminal microbiome. The objective was to evaluate the extent to which pre-weaning management influences the ruminal microbiome of lambs during finishing. A finishing study was conducted using 32 Polypay conventionally-raised (CR; n = 10 rams, 6 ewes) or artificially raised (AR; n = 10 rams, 6 ewes) lambs weaned at 56 d of age. Following weaning, lambs were adapted to a HC (85:15 concentrate:forage) diet for 35 d. Lambs were then blocked by sex and body weight and randomly assigned to either continue receiving HC or abruptly transition to a HF (50:50 concentrate:forage) diet. Individually-housed lambs were fed ad libitum through a target slaughter weight (rams: 59.0; ewes: 54.4 kg). Rumen fluid samples were collected via oral intubation on d 0, 14, 28, and when lambs reached slaughter weight. Analysis of 16S rRNA gene sequences was conducted in QIIME 2 (v.2023.2). Taxonomy was assigned with SILVA (SSU 138). Diversity was analyzed by PERMANOVA. Random forest classification was applied to determine if pre-weaning management and diet could be predicted using microbial composition. Alpha diversity did not differ in CR vs. AR lambs at the initial sampling (P &gt; 0.22), but species richness was greater in HR lambs regardless of pre-weaning management from d 14 through slaughter (P &lt; 0.01). Beta diversity did differ between CR and AR at the initial sampling (P ≤ 0.02). The influence of pre-weaning management was still present in weighted UniFrac distances by d 14 (P = 0.09), but effects of pre-weaning management were no longer apparent from d 28 through slaughter (P ≥ 0.28). Similarly random forest modeling was able to predict pre-weaning management in initial samples (accuracy: 0.75 ± 0.15). Accuracies decreased over the study period (d 14: 0.58 ± 0.07; d 28: 0.50 ± 0.15; slaughter: 0.45 ± 0.07), whereas model performance improved for prediction of diet (d 14: 0.83 ± 0.15; d 28: 0.87 ± 0.12; slaughter: 0.97 ± 0.07). The most important feature in predicting pre-weaning management at initial sampling belonged to Ruminococcus, and 9 ASV assigned to Prevotella were among the most important features in the model. Five features were present in the top 20 most important features for both the initial and finishing models, and included ASV assigned to Streptococcus, Lactobacillus, and Bifidobacterium. These results illustrated continued impacts of early-life management on ruminal microbiome composition at the beginning of the finishing period, even though CR and AR lambs had been adapted to the same diet for more than 1 mo. While pre-weaning effects were muted over the course of finishing as diet became the predominant factor, the influence of early-life management was still detectable by the end of the finishing period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6a57887e1bc9f395bdb5301fd4ad0bec9f3e8f94b652817639f8f06b472724f8","category":"Environment"}