{"title":"A Simple Method for Identifying the Natural Frequency of a Micro Satellite with a Primary Structure made of Aluminum Alloy","link":"https://www.preprints.org/manuscript/202404.0391/v1","date":1712298121000,"content":"Micro satellites must survive severe mechanical conditions during their launch phase. Therefore, structural design requirements are imposed on the micro satellites. These requirements are the strength requirement and the stiffness requirement. Usually, the structural design of a micro satellite is performed using the internal stress analysis and the natural frequency analysis, which are based on a Finite Element Method (FEM). The validity of this structural design is evaluated through vibration tests. In an early stage of development, which has a FEM model of a satellite in the process of creation, presumption of the natural frequency of a satellite may be difficult. In this study, a simple method for determining the longitudinal and lateral minimum natural frequencies of the micro satellites during the ascent phase was clarified. The structure of the micro satellites used in this research is made of aluminum alloy, and they have a monocoque structure. The Young's modulus and moment of inertia of area used to calculate the minimum natural frequencies were determined using the area ratio of the monocoque structure to the entire satellite. When this method is used, the estimated minimum natural frequencies of the longitudinal direction and the lateral direction are in agreement with the measured values acquired by the vibration tests. In order to shorten the process of micro satellites development, this paper describes a practical estimation method of the minimum natural frequency for micro satellites.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6a5f2c89ee79a86113d988be4564dc1c2fe81b09264da15e8a7dc6b8fd9f4634","category":"Interdisciplinary"}