{"title":"Cyclist’s 4 favourite Tony Martin moments","link":"https://www.cyclist.co.uk/in-depth/10140/tony-martin-cyclist-highlights","date":1632913267000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>29 Sep 2021</span></div>    </div></div><p>\nOur highlights as the German rider calls time on a 14-year professional career in the peloton</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2017/06/tony_martin.jpg?itok=PoQD2IBj\" />  </div>\n<div>\n      <p> The news of Tony Martin’s retirement has appeared to strike a chord with many throughout the cycling world. To be so revered amongst those you have never met is an impressive feat by itself, regardless of his palmarès to back it up.</p>\n<p>Martin retired in fitting fashion last week at the World Championships, taking home another rainbow jersey and gold medal in the shape of the mixed relay time-trial. <em>Cyclist</em> has compiled some of our favourite Tony Martin moments as the peloton says goodbye to one of its most reliable riders.</p>\n<h2>Robyn Davidson, Editorial Assistant</h2>\n<h3>1. Stage 4 of the 2015 Tour de France: cobbles and a yellow jersey</h3>\n<p>It took a while for Martin to wear the first yellow jersey of his career. Some thought it might never happen during the 2015 <a href=\"/tags/tour-de-france\" target=\"_blank\">Tour de France</a> after three failed attempts in as many stages. First, the opening day time-trial victory went to BMC Racing Team’s Rohan Dennis.</p>\n<p>Despite finishing in the main group with stage winner André Greipel on the second day, his ninth place meant Martin just missed out on bonus seconds. The yellow jersey instead went to Fabian Cancellara, with Martin second by three seconds. Chris Froome rode his way into the <em>maillot jaune</em> on the third stage and looked set to defend it the next day, Martin now just one second behind.</p>\n<p>It was on the cobbled stage from Seraing to Cambrai that the German took matters into his own hands when he jumped ahead of the peloton, yellow jersey in sight with just 3km remaining. We all dared to believe. Once Martin escaped the pack, that tended to be it for the rest. They tried to claw him back this time and came agonisingly close to doing so – if the line was moved a few metres further down the road, it would’ve been heartbreak again.</p>\n<p>A sprinting mass could be seen in the background, gaining speed and time. Yet Martin was able to celebrate the win and the jersey – fist pumping and smile beaming as he crossed the line. A happier man you probably wouldn’t find. That day spoke volumes for his character, never accepting defeat and trying until the very end.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_image/public/2017/06/tony_martin.jpg?itok=kMZP4NgA\" />  </div>\n</div>\n<h3>2. Stage 16 of the 2016 Tour de France: a huge, doomed breakaway</h3>\n<p>An unprecedented attack formed on the roads from Moirans-en-Montagne to Berne during the 2016 Tour de France.</p>\n<p>Julian Alaphilippe broke away from the peloton alongside Etixx-Quick Step teammate Tony Martin and the pair never looked back. In what probably felt like a regular day in the saddle for Martin and potentially an experience of intense punishment for the Frenchman, as they managed to stay away for an eye-watering 173km, their lead extending to over six minutes at its peak.</p>\n<p>After sharing some laughs Alaphilippe cracked first and Martin attempted to carry on, but eventually was reeled back in by the impending sprint teams looking for a stage win.</p>\n<p>Martin ironically finished last on the day with only Alaphilippe alongside him, 12 minutes behind stage winner Sagan. The duo won the joint combativity award. Not a bad prize and not for the first time in history either, as Juan Antonio Flecha and Johnny Hoogerland also received the joint award when they were taken down by a media car in 2011.</p>\n<h2>3. Matthew Loveridge, Website Editor</h2>\n<h3>Stage 6 of the 2013 Vuelta a España: an equally huge, equally doomed breakaway</h3>\n<p>\nWhether or not he should be compared to an armoured vehicle, Tony Martin has pulled off some performances with a distinctly diesel-esque quality, just riding and riding in a manner that seemed to defy normal measures of athletic output.</p>\n<p>His performance on Stage 6 of the 2013 <a href=\"/tags/vuelta-a-espana\" target=\"_blank\">Vuelta</a> from Guijuelo to Caceres is an all-time great in the pantheon of solo efforts.</p>\n<p>Off the front for almost the whole 175km stage, Martin – then riding for Omega Pharma-QuickStep – had seven and a half minutes on the peloton at one point, and clung on to roughly a minute’s lead at the 20km to go mark. </p>\n<p>Somehow, he kept it going and crossed under the flamme rouge with the smallest of gaps, but it wasn’t to be, and he was swamped metres from the finish line by a sprinting peloton.</p>\n<p>All’s fair in love and bike racing and the performance earned plenty of praise, but I don’t know if I’ve ever been more disappointed on a rider’s behalf. If ever a win were deserved, it was on that day.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/1015/paris-roubaix-all-you-need-to-know\">Paris-Roubaix 2021: Route, start list and all you need to know</a></div>      <div><a href=\"/in-depth/4470/where-paris-roubaix-2021-will-be-decided-part-4-roubaix-velodrome\">Where Paris-Roubaix 2021 will be decided, part 4: Roubaix Velodrome</a></div>      <div><a href=\"/news/10138/paris-roubaix-weather\">Will it rain at Paris-Roubaix 2021?</a></div>    </div></div><h4></h4>\n<h2>4. Will Strickson, Editorial Assistant</h2>\n<h3>Stage 20 of the 2009 Tour de France: conquering Mont Ventoux</h3>\n<p>Let’s set the scene. The date is 25th July 2009. It’s Stage 20 of the Tour de France, the final stage before the race heads to Paris and it’s a <a href=\"/in-depth/1448/mont-ventoux-the-giant-of-provence\" target=\"_blank\">Mont Ventoux</a> summit finish. Alberto Contador is in yellow, Andy Schleck in white, Thor Hushovd in green and Franco Pellizotti in the polka dots. Third and fourth in GC are Lance Armstrong of Astana and Bradley Wiggins of Garmin-Slipstream.</p>\n<p>A 24-year-old Tone in that delightful Columbia-HTC jersey gets himself into a big breakaway and finds himself with only talented climber Juan Manuel Garate – who’s also a good 10kg lighter – for company on Ventoux.</p>\n<p>Garate drops our young hero, dancing off up the mountain while the German trudges on. The race behind is kicking off with both Schlecks putting the pressure on and Contandor forgetting he has a saddle on the bike. Such is the power and determination of Martin that he catches back to Garate despite the odds and they ride on to the finish with the favourites still 40 seconds in arrears.</p>\n<p>Sadly he didn’t have any explosion left in his legs for the final sprint and finished second on the day but for a big time-trialist to do that on Ventoux is a superhuman effort. Who did he think he was, Wout van Aert?! He’d dabbled in GC riding in one-week races but that day showed that Tony Martin’s engine was such that nothing was out of reach. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"6a624b1840ff2f45a4622db5724a5e9c581ea6591b135dd09364386f2213f75c","category":"Cycling"}