{"title":"‘I’m going to shoot my shot on the Tourmalet’ - Veronica Ewers aims high at the 2023 Tour de France Femmes","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-m-going-to-shoot-my-shot-on-the-tourmalet-veronica-ewers-on-the-tour-de-france-femmes","date":1689937306000,"content":"\n      <p><span>With only a few days to go until the madness of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> begins, Veronica Ewers is seeking solace by Lake Annecy. The place reminds her of a family home on the shores of a lake in northern Idaho, where she grew up. This tranquil setting provides her with a moment of calm before the storm.</span></p>\n<p><span>“I’ve not been able to get there for eight years and it’s one of my favourite places on the planet, so when looking for a spot in France, I thought, “I need to be on a lake,” Ewers told </span><i><span>Rouleur. </span></i></p>\n<div></div>\n<p><span>The EF-Education-TIBCO-SVB rider is only in her second year as a WorldTour racer, but Ewers has already made her mark on the scene. In the inaugural Tour de France Femmes last year, she secured ninth in the GC behind some of the biggest names in the women’s peloton. This year, she’ll once again lead the team, but this time, the 28-year-old has her sights set even higher. </span></p>\n<p><span>“I’m aiming for a top five in the general classification, and I think that would come with aiming for a stage win as well,” she said. </span></p>\n<p><span>With her speciality in uphill terrain, the fabled Col du Tourmalet should suit her strengths. However, Ewers acknowledges the presence of defending champion Annemiek van Vleuten on the start line, as well as Demi Vollering and Gaia Realini, which forces her to “keep realistic”. But Ewers is a fierce competitor and holds herself to very high standards. “I’m going to shoot my shot on the Tourmalet,” she added, hoping to reach new heights atop the hallowed climb. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1412020119.jpg?v=1689844063\" alt /></span><em><span>Last year Ewers came ninth overall in the Tour de France Femmes (Tim de Waele/Getty Images)</span></em></p>\n<p><span>Not only does this year’s edition include an eye-wateringly brutal climb, but all eight stages pose their own difficulties, with 26 categorised climbs spread across them. Ewers notes how the route will suit not only the most attritional rider, but also the rider who can recover best as each stage is extremely intense – especially with an individual time trial on the final stage. </span></p>\n<p><span>“I’ve still not raced a lot of time trials. It’s going to suit those who can perform well under significant fatigue, which could be a true game changer if GC times are anywhere close,” Ewers said. </span></p>\n<p><span>“But I’m interested to see how the whole stage race will be raced compared to the Giro Donne, because the stages were tough enough to be pretty full gas all day. In the Tour, the stages are a fair bit longer, but maybe not so significantly longer that it won’t be full gas. At the Giro I don’t think a break was able to get away the whole race, so we will have to see what opportunities people can have at the Tour.” </span></p>\n<p><span>Ewers improved her GC ranking at the Giro Donne earlier this month with a fourth place overall, securing a second place finish along the way on stage four. That stage finish, behind winner Elisa Longo Borghini and ahead of Van Vleuten, has given her more confidence in taking risks and being more aggressive on the bike, something she is working on as a developing rider. “You have to be able to take those chances to get results – they don’t come to you,” she said.</span></p>\n<p><span>“I wouldn’t have managed second place if I had not been aggressive and taken the chance. But I think I have an advantage in where I am at in my career as I am still somewhat an underdog and able to make moves that maybe some of the big names are not allowed to as much.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1511218083.jpg?v=1689843766\" alt /><em><span>Ewers sprinting against Annemiek van Vleuten and Elisa Longo Borghini at the Giro Donne (Dario Belingheri/Getty Images)</span></em></span></p>\n<p><span>Despite the chaos of the Giro Donne, Ewers enjoyed her first experience of the Italian Grand Tour and is looking forward to taking to the start the Tour on Sunday in Clermont-Ferrand, albeit a tad nervous, especially with all the hype around the race. However, she notes how her teammates help to alleviate any nerves and joining her in France are Kathrin Hammes, Sara Poidevin, Georgia Williams, Alison Jackson, Letizia Borghesi, and Magdeleine Vallieres.</span></p>\n<p><span>Not only is a team vital to help get their GC aspirations over the line, but they also play a crucial role in managing the emotional ups and downs of racing. With Ewers setting high standards for herself, the inevitable setbacks become more challenging for the American to overcome. Having her team by her side provides invaluable support, helping her navigate the rollercoaster of being a professional cyclist. However, this aspect remains a work in progress for the young and talented rider.</span></p>\n<p><span>“I pretty much exceeded my expectations in my first year as pro, and with that, I sort of developed a lot of following expectations for myself coming into this year. And I think that was mostly from myself,” she said. “So I set a lot of expectations for myself coming into this year and especially in the first half of this season, I did not come anywhere close to those expectations.” </span></p>\n<p><span>Ewers may still be on a journey of discovery with life in the pro peloton and currently enjoying the calm of Lake Annecy, but there is a magnificent storm brewing inside Ewers ready to be unleashed in Clermont-Ferrand.</span></p>\n<p><em><span>*Cover image by Zac Williams/SWPix.com </span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6a77725b281041855beb90467924673ec9fb919479dd019fec3fcc2f61aa042a","category":"Cycling"}