{"title":"Dan Bigham breaks British Hour Record with 54.723km ride","link":"https://www.cyclist.co.uk/news/10155/dan-bigham-british-hour-record","date":1633102729000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>1 Oct 2021</span></div>    </div></div><p>\nA day after Joss Lowden broke the women's Hour Record, Bigham took to the track to beat Bradley Wiggins's record. Photo: James Huntly </p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/dan_bigham.jpeg?itok=YpROlSY6\" />  </div>\n<div>\n      <p> Dan Bigham has broken <a href=\"/news/245/bradley-wiggins-sets-new-hour-record\" target=\"_self\">Sir Bradley Wiggins's British Hour Record</a> in Grenchen, Switzerland, setting a new distance of 54.723km.</p>\n<p>The Ribble-Weldtite rider and aerodynamics specialist, who has worked with the likes of Jumbo-Visma and the Danish Olympic team as part of his WattShop business, rode a negative split and was slowly gaining on Wiggins's record in the second half an hour, consistently lapping the track in under 16 seconds.</p>\n<p>Bigham's preparation might not have been ideal for the event, having taken part in the individual and mixed relay time-trial at the World Championships in Leuven last week, but his training at the velodrome in Derby and meticulous planning meant he was in control the whole time and even pushed beyond his schedule.</p>\n<p>Broadcast on <a href=\"https://www.youtube.com/watch?v=yr66nPikPn4\" target=\"_blank\">thecyclingdane YouTube channel</a>, <a href=\"/news/6318/watch-victor-campenaerts-to-be-streamed-live\" target=\"_self\">world Hour Record holder</a> Victor Campenaerts appeared in the live chat to discuss Bigham's effort, clearly nervous, as Bigham confirmed post-ride that he will be aiming to break the official world Hour record in the near future.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/4651/gallery-the-best-bikes-from-bespoked-2018\">Gallery: The best bikes from Bespoked 2018</a></div>      <div><a href=\"/in-depth/5898/me-and-my-bike-spoon-customs\">Me and my bike: Spoon Customs</a></div>      <div><a href=\"/in-depth/5743/me-and-my-bike-condor\">Me and my bike: Condor</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 119: on sale now!</a></div>    </div></div><p>\nSadly his effort this time around wouldn't have counted for the official record as the UCI requires riders to be in the Registered Testing Pool or have an Athlete Biological Passport which Bigham, who doesn't ride in the WorldTour, didn't have this time around.</p>\n<p>Bigham also estimated that to break Campenaerts' distance he'd need to find an extra 7W on his average, though the Belgian also has the advantage of setting his record at altitude in Mexico.</p>\n<p>It comes a day after Bigham's partner Joss Lowden's incredibly impressive ride to break the women's Hour Record on the same track with a distance of 48.406km and still looking like she could ride another hour afterwards. Quite literally a power couple. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"6a79ecb2d1d5d14fc390bd87143d1ac29cff6d45cfce0e94ca756c91e57a678d","category":"Cycling"}