{"title":"Using texture analysis of ultrasound images to assess the effect of cupping therapy on muscle quality of the triceps","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301221","date":1711548000000,"content":"<p>by Isabella Yu-Ju Hung, Yih-Kuen Jan</p>\r\n\r\nThe objectives were to investigate whether cupping therapy improves muscle quality and the interaction between duration and negative pressure of cupping therapy affects muscle quality. A 2×2 factorial design with repeated measures was used to examine the efficacy of cupping therapy on improving muscle quality. The independent factors were cupping pressures at −225 and −300 mmHg and cupping durations at 5 and 10 min, and the dependent factor was texture of B-mode ultrasound image of the triceps. Four cupping protocols were applied to 12 participants at 4 different days. Texture analysis including contrast, correlation, energy, and homogeneity was applied to assess muscle quality from 480 ultrasound images. The two-way repeated measures ANOVA showed that there was an interaction between the pressure and duration factors on the superficial layer of the triceps in contrast (F = 5.434, <i>P</i> = 0.004) and correlation (F = 6.274, <i>P</i> = 0.029). In contrast texture, the superficial layer of the triceps showed a significant increase in three protocols: −225 mmHg for 5 min (1.0434 ± 0.130), −300 mmHg for 5 min (1.0339 ±0.1407), and −300 mmHg for 10 min (1.0563 ±0.1432) except −225 mmHg for 10 min (0.9704 ±0.0985). In correlation texture, the superficial layer of the triceps showed a significant decrease in all protocols: −225 mmHg for 5 min (0.9556 ± 0.07), −225 mmHg for 10 min (0.9831 ± 0.0708), −300 mmHg for 5 min (0.9976 ± 0.055), and −300 mmHg for 10 min (0.9406 ± 0.0809). The results indicate that the interaction between the pressure and duration factors of cupping therapy significantly increases contrast texture and significantly decreases correlation texture of the superficial layer of the triceps after cupping therapy. Cupping therapy decreases homogeneity among soft tissues of the treated muscle.","author":"Isabella Yu-Ju Hung","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6a7a4248a8ce3094b70ec14d3bd27bc8c94106eba202f2a2b1e3c42a29902366","category":"Interdisciplinary"}