{"title":"Heavy metal residues in eggshells of Common Cranes (Grus grus) nesting in an agricultural region in north-eastern Germany","link":"http://link.springer.com/10.1007/s10336-023-02122-3","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Urbanization, industrialization, and intensification of agriculture have led to considerable heavy metal pollution across the globe, harming our ecosystems. Concentrations of arsenic (As), cadmium (Cd), copper (Cu), and lead (Pb) have been analysed in 249 eggshells collected between 2006 and 2021 from 83 female Common Cranes (<em>Grus grus</em>) nesting within north-eastern Germany. Information on the presence of trace elements in cranes from Europe and their potential adverse effects on the reproduction are largely missing. Only Cu and Pb were found to be present in eggshell samples. Levels of both metals did not exceed concentrations considered potentially toxic in birds and unhatched eggs did not contain higher metal concentrations compared to eggshell residues from hatched eggs. Statistical analysis revealed that trace element concentrations decreased significantly over the course of the study period. The ban of leaded gasoline in the early twenty-first century and strict limitations of heavy metal-based biocontrol products are likely responsible for this decrease over the years. However, as Cu levels gradually increase with increasing proportions of agricultural areas within the cranes’ home ranges, we suggest that considerable amounts of Cu originating from agricultural practises are still being released into the environment. We found no increase in metal concentrations in eggshells with increasing female age, suggesting that heavy metals do not accumulate in the circulatory systems of the adults over time. This study is the first to assess heavy metal contamination in Common Cranes and indicates the suitability of crane’s eggshells as bioindicator for monitoring environmental pollution.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"6a81455c841031cea5040d3cd7d649ba76fbdb87a6f72c1de0628970927b9784","category":"Environment"}