{"title":"Positional and Dimensional Tmj Changes Following the Use of Different Class II Correctors in a Sample of Erbil City [Randomized Clinical Trial]","link":"https://www.preprints.org/manuscript/202404.0758/v1","date":1712837291000,"content":"Due to the retrognathic mandible, an orthodontist frequently observes skeletal class II malocclusion in growing patients. The preferred technique for analyzing and monitoring the temporomandibular joint alterations caused by the functional device is magnetic resonance imaging [MRI]. \nThe study aimed to assess and compare changes in the articular disc's dimension and location before and following the use of various class II correctors to correct the class II molar relation using MRI technology. Methods: 39 adolescent patients aged 15-23 years old [24 girls and 15 boys] who were diagnosed with skeletal Class II division 1 malocclusion based on clearly defined criteria underwent treatment with either the power scope II [PS], Sabbagh Advanced Repositioning Appliance [SARA] and or Dynaflex [DF] with fixed appliances. For fixed functional treatment, the average length of treatment was 5-7 months. The changes in the articular disc dimension and position and condylar position were assessed. The study was done at the Department of Orthodontics at the College of Dentistry, Hawler Medical University in Erbil City. \nResults:  Group DF has a significant effect on the condylar position index and posterior joint space on the closed mouth and disc length on both open and close mouth techniques, and in the group SARA, disc position, and condylar position index on closed mouth technique have shown that significant differences were observed.\nConclusion:  Class II malocclusions can be effectively corrected by fixed functional appliances. The statistical significance forward movement of the condyle in the glenoid fossa and the posterior movement of the articular disc concerning the condylar head was observed. The mechanism of action of functional appliances appears to include the forward migration of the C-GF complex.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6a90484c260e203ffb14391e5c602af14fdddec591ade3afe3976b54f8a7fb39","category":"Interdisciplinary"}