{"title":"As it turns out, the iPhone is actually a bargain compared to Android phones","link":"https://www.macworld.com/article/1804399/iphone-secondary-market-refurbished.html","date":1683023400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Cue the classic Barry Manilow hit “Looks Like We Made It” because, uh, well, it looks like Apple’s gonna make it.</p>\n\n\n\n<p>And you were so worried. You should have seen your face.</p>\n\n\n\n<p>As you may have read pretty much everywhere, Apple has long been chided as being “elitist” for selling Devices That Cost Too Much™! The company famously invented selling things at a premium price, everything having been priced quite low prior to its founding in 1976.</p>\n\n\n\n<p>The idea that Apple devices are too expensive has always been 100 pounds of hot nonsense in a container only rated by the International Hot Nonsense Standards Board to hold no more than 2.3 kg (5 pounds) of hot nonsense (the International Hot Nonsense Standards Board having been established in 1995 after the horrific hot nonsense spill in Corpus Christi, Texas). Because while Apple devices aren’t priced as low as many of the cheaper Android or PC alternatives, they cost what they’re worth.</p>\n\n\n\n<p>Well, you say, Mr. Macalope, sir (why so formal, imaginary reader?), that is something you can say, but can you prove it? Can you put your virtual money where your literal floppy drive mouth is?</p>\n\n\n\n<p>That might make it hard to talk, but the Macalope will give it a try.</p>\n\n\n\n<p>Apple devices have always retained their value very well compared to their more disposable counterparts in the smartphone and personal computer markets. You can check this on any site that will buy your smartphone from you. The Macalope just compared two smartphones on a popular phone-buying site that he won’t name because they’re not paying for this name drop but it’s got the same as a famous long-necked herbivore. </p>\n\n\n\n<p>The iPhone 14 Plus and the Google Pixel 7 Pro both cost the same amount if you buy them from Apple and Google, respectively. They also cost the same if you buy them from them sullenly or just constantly hurling obscenities at your screen. Doesn’t matter, they’re both $899. Try to turn them in for cash, however, and you’ll find that there’s a lot more depreciation on the Pixel 7 Pro. The long-necked herbivore site will give you $481 for a pristine iPhone 14 Plus but only $299 for the Pixel 7 Pro. And that’s the Pixel, a reputable name brand.</p>\n\n\n\n<p>Now we can see how the iPhone’s lasting value plays out in the market.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macalope\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p>Writing for The Wall Street Journal, Christopher Mims details <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.wsj.com/amp/articles/apple-iphone-smartphone-market-dominant-android-7914e6b0#selection-109.5-109.73&amp;xcust=1-1-1804399-1-0-0&amp;sref=https://www.macworld.com/feed\">“The Unexpected Reason Apple Is Dominating the U.S. Smartphone Market”</a> and the Macalope will just tell you it’s the longevity of iPhones.</p>\n\n\n\n<p>It’s not just that Apple hardware tends to last longer, it’s also that Apple tends to support devices longer with software updates.</p>\n\n\n\n<blockquote><p>As a result, these phones have a considerable afterlife, cycling through second and even third owners before being cast aside.</p></blockquote>\n\n\n\n<p>Dear readers, both real and imaginary, the Macalope cannot enumerate how many times since the iPhone’s debut he has had to lance the boil of a notion that Apple was doomed unless it cut prices to go after market share. Now we find that not only did Apple take <em>profit</em> share, clearly the better of the shares, but it also gained market share by making the devices last longer.</p>\n\n\n\n<p>This effect has not gone unnoticed by the research companies.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2023/04/24/refurbished-iphone-sales-continue-to-grow/&amp;xcust=1-1-1804399-1-0-0&amp;sref=https://www.macworld.com/feed\">“Refurbished iPhone sales continue to grow as Apple extends lead over Samsung”</a></p>\n\n\n\n<blockquote><p>Counterpoint Research analysts say that this makes Apple the “fastest-growing brand” in the used and refurbished smartphone markets worldwide.</p></blockquote>\n\n\n\n<p>Apple sells refurbished iPhones itself but it also sells subscription services that owners of iPhones old and new can take advantage of. Also, don’t know if you’ve heard about this, but the company takes a cut of the sales of these so-called “apps” the kids are into these days, which are also purchased on all kinds of iPhones.</p>\n\n\n\n<p>It is a bit of a wonder that this strategy sailed so gracefully over the heads of your average pundit.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6a915ee849595c1c87ba160d2ff655bde0e828d04a44e8cfb38eeaf90103c907","category":"Apple"}