{"title":"Comment: Tadej Pogačar speaks for cycling, he needs to be asked the questions","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/comment-tadej-pogacar-speaks-for-cycling-he-needs-to-be-asked-the-questions","date":1625601376000,"content":"\n      <p><span>With Covid bubbles forcing the rest day ritual of the press conference to Zoom, the scrutiny normally faced by the leader of the Tour de France has certainly been lighter this year. Although Tadej Pogačar has fronted up to daily interviews while leading the race, UAE Team Emirates allowed a short ten-minute press conference in English with him; just three questions apiece from three selected journalists</span>, were presented to the yellow jersey, the last of which asked him how he would disprove those who doubted the legitimacy of his performances. </p>\n<div></div>\n<p><span>“I think we have many controls to prove them wrong,” Pogačar said. “I know for example that yesterday I had three controls in one day; two before the stage and one after. So I think that gives enough weight to prove them wrong.”</span></p>\n<p><span>Perhaps this is enough. In fairness to Pogačar, the topic was put to him again on stage 10 and he cited the impact of crashes on his opponents. “Yesterday I've been asked this one question and I stated the facts,” he added. “I don't know what else to do to prove my innocence.”</span></p>\n\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/tour-de-france-2021\"><b><i>Tour de France 2021 articles</i></b></a></p>\n<p><span>As the race continues and after a rest day press briefing that amounted to partial censorship of the Tour leader, questions remain. Chiefly, are we watching a once in a generation talent spread his wings and show what he can do? Or are we watching something else?</span></p>\n<p><span>Why is this important? Let’s first look at the wider sporting context; tennis ace Naomi Osaka announced that she would not attend the mandatory press conferences at this year’s French Open tournament due to their negative impact on her mental health. She was fined and subsequently withdrew from the tournament, but her stance opened up a wider debate about the role of the press as communicator and authenticator of sport in an age when athletes can bypass it through social media. </span></p>\n<p><span>There can be no doubt that the press conference at its worst can be an excruciating experience for all involved. Lazy journalists can ask lazy or inappropriate questions to an athlete whose defences are down after a mentally and physically exhausting ordeal, and so they fall back on bland, pre-determined answers about taking things ‘day-by-day’ and so on. </span></p>\n<p><span>It may be flawed but a press conference can contain appropriate and relevant questions too. Above all it sets the tone for the debate. What questions are people asking? What is the mood? It has an under-valued role in setting the media narrative that we consume as followers of the sport. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326655660_1024x1024.jpg?v=1625600918\" /></span></p>\n<p><em><span>Photo: Michael Steele/Getty Images</span></em></p>\n<p><span>In the historical context of cycling, the leader of the Tour has a responsibility, whether they like it or not, to be a spokesman for the sport. Whether the press conference is the right format for this is almost a moot point; the yellow jersey must present himself as the face of the sport at the most visible event of the year. He could share power data, invite greater access behind the scenes into his preparation and training, but these would undoubtedly hand an advantage to any opposition who didn’t have to do it, as Pogačar himself has acknowledged. At the moment, the press conference is his best opportunity to face up. It’s all we’ve got. </span></p>\n<p><span>The specific context of the season is not irrelevant either. Suspicions were voiced concerning the performances of Bahrain-Merida by anonymous rival team directors at the Criterium du Dauphiné. Richard Carapaz, speaking on the Tour’s rest day, said he “can’t be compared to Pogačar, he is at a plane above me. But compared with the normal human beings I’m right there.” Thomas De Gendt has noted that the peloton is getting younger and faster at a surprising rate. </span></p>\n<p><span>\"One day, the day has to come when the young riders are better, but they have done it very suddenly,” he told Sporza. “Normally it's gradual but now they have suddenly taken over everything and push the older ones to the back.”</span></p>\n<p><span>These words matter. The headline of French sports daily L’Equipe after Pogačar’s ride to Le Grand-Bornand read ‘Hors Catégorie’. Let’s not forget that this is a paper that is not afraid of insinuation or inference in its long history, nor should we forget that it memorably chose the headline ‘Sur Un Autre Planète’ to describe Lance Armstrong’s commanding performances at the Tour in 1999. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1233801965_1024x1024.jpg?v=1625601009\" /></span></p>\n<p><em><span>Team Ineos are struggling to keep pace with Pogacar, with Carapaz describing him as \"</span>a plane above me\". Photo: Getty Images</em></p>\n<p><span>Le Monde opined that we are watching ‘les phénomènes inexplicables’, picking out Sonny Colbrelli’s third place finish at the summit finish in Tignes on stage nine in particular. “Are we witnessing the return of ‘le cyclisme à deux vitesses’, a symbol of cycling’s dark years?” it asked on the Tour’s first rest day. “The words – to gut, knock out, flay, kill, etc. – in use during the Lance Armstrong years (1999-2005) are making a comeback with this slightly sickening aroma,” it added. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-tommorow-always\"><strong><em>Related – Tadej, Tomorrow, Always</em></strong></a></p>\n<p><span>Meanwhile, UAE Team Emirates is led by Mauro Giannetti and Matxín Fernández</span><span> – former managers of Saunier Duval and Geox-TMC, whose riders once included Leonardo Piepoli, Juan José Cobo and Riccardo Riccò – while Pogačar’s DS Andrej Hauptman was excluded on the eve of the 2000 Tour for returning a haematocrit of over 50%. UAE Team Emirates is essentially a continuation of Lampre, the team which in 2013 was central to the Mantova investigation (in 2015 a judge dismissed all charges when prosecutors were unable to prove organised doping in the team). </span></p>\n<p><span>There are still some who will never be satisfied. That’s not the point. Pogačar doesn’t need to satisfy everybody. But he does need the opportunity and the obligation to speak up for his sport, to address what needs to be addressed. </span></p>\n<p><span>The 2021 Tour is currently lacking his voice. In its space is doubt, suspicion, uncertainty. That’s the most dangerous thing for a sport, because when people don’t know what they’re watching, they switch off. </span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6a93c5ff00dfbd14bbca2a92b186d670fd49fd5dc75ea7a3f1545b235990e5f9","category":"Cycling"}