{"title":"Apple is running out of chances to get gaming right","link":"https://www.macworld.com/article/342974/apple-is-running-out-of-chances-to-get-gaming-right.html","date":1618219800000,"content":"\n<div>\n<section><div></div></section><p>Apple has made several attempts to make a go of the game market over the years—anyone remember when Apple had Game Evangelists? <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://web.archive.org/web/19970414095621/http://www.pippin.apple.com/&amp;xcust=1-1-342974-0-0-0&amp;sref=https://www.macworld.com/feed\">Pippin</a>? <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=http://preserve.mactech.com/articles/mactech/Vol.13/13.02/GameSprocketIntro&amp;xcust=1-1-342974-0-0-0&amp;sref=https://www.macworld.com/feed\">Game Sprockets</a>? And each and every time, just like boss battles in classic Nintendo games, those efforts have largely been futile. Gaming has so often seemed like an afterthought for Apple, paid lip service while the company focused on other areas that it clearly felt more passionately about, like music.</p>\n\n\n\n<p>With iOS, it seemed as though Apple had finally struck gold, providing a platform for hundreds of games that millions of people obsess over. But while the company’s mobile platform has proved to be profitable for gaming, there’s only so much of that success that can be laid directly at Apple’s own feet. After all, we’re talking about a company that initially eschewed the idea of even allowing third parties to build native apps for its smartphone.</p>\n\n\n\n<p>The company’s latest foray into the gaming arena has been Apple Arcade, and while it started out promising, interest has largely died off until just a couple of weeks ago, when Apple made a change that might prove a shot in the arm for the company’s efforts—or could very well prove to be yet another instance of a stopped clock being right twice a day.</p>\n\n\n\n<h2>Plenty arcade</h2>\n\n\n\n<p>At its launch, the promise of Apple Arcade was straightforward: well-crafted titles that you couldn’t get on any other mobile platform or any other subscription service, for $5 every month. But as the months went by and new games appeared in dribs and drabs, enthusiasm in Apple Arcade largely plateaued. Reports appeared claiming that Apple was looking to re-think what it had done with the service.</p>\n\n\n\n<p>Hence <a href=\"https://www.macworld.com/article/342305/game-on-apple-arcade-bolsters-its-library-with-classic-app-store-favs.html\">the announcement on April 2</a>, which brought a slew of new titles to the service, many of them well-known games from both iOS’s past and present. This change stands to make Arcade a far more compelling offer, closer to subscription service competitors from Microsoft and Google.</p>\n\n\n\n<p>One issue with bolstering a service with originals (as Apple has found out on Apple TV+, among other projects), is that in the earliest days, there’s no barometer for whether those originals are <em>good</em>. Sure, you might have solid names behind many of the titles you’re producing, but even a talented creator sometimes produces a stinker. It takes time for momentum to catch up, and even then, your breakout hits may be few and far between.</p>\n\n\n\n<p>That’s why Apple’s new value proposition is far sweeter: It offers games that show the best of what iOS has to offer and boast <em>proven</em> track records. It’s akin to offering a back catalog of things customers already know they want.</p>\n\n\n\n<p>As a result, the company doesn’t need to spend a lot of time selling users on games like <em>Threes</em> and <em>Monument Valley</em>—that job’s already been done. And users now have a more, if you’ll pardon the expression, apples-to-apples comparison: sure, they could pay $6 for <em>Threes</em> and $4 for <em>Monument Valley</em>…but Apple Arcade is just $5 a month for those and a bunch of other games. It’s an idea that’s a lot easier for customers to wrap their heads around.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/monument-valley-iPhone.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption>Pay $4 for just Monument Valley, or pay $5 per month for Apple Arcade and get access to several other games, as well.</figcaption></figure><p>ustwo games</p></div>\n\n\n\n<p>Lingering in the background is the real question: Is this a flash in the pan or a more sustainable strategy? An influx of 30 new titles and two new categories of games suggests a real sea change, but will Apple continue to add more titles to its Timeless Classics and App Store Greats collections, and if so, at what kind of pace?</p>\n\n\n\n<p>And, more to the point, does this change mean that the people in charge of Apple’s gaming strategy finally <em>get</em> gaming? I’m not entirely sold yet. This may be just another example of Apple trying to turn over a new leaf in the market and getting lucky.</p>\n\n\n\n<h2>Gaming: It’s everywhere you want to be</h2>\n\n\n\n<p>Case in point: There’s been talk of Apple revamping the Apple TV to serve as a more attractive gaming console, possibly by including a more powerful chip and better graphics performance. But those kind of updates seem to miss the point: it’s not <em>power</em> that’s holding Apple’s gaming ambitions back. To think so is to misread the segment of the gaming market that Apple is playing in.</p>\n\n\n\n<p>The Apple TV will, fundamentally, never compete with the likes of an Xbox or a PlayStation—or even a Nintendo Switch, though that’s a closer comparison in terms of hardware power—mainly because those devices are purpose-made for gaming. Just throwing a controller into the Apple TV box doesn’t solve the problem.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/apple-tv-siri-remote-2020.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Do people <em>really</em> use the Apple TV to play games designed for mobile devices? If so, it’s not a lot of people.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Here’s the thing: that’s okay. Playing mobile games on a set-top box might appeal to some, but to most players—and I’m betting Apple’s metrics would probably back this up—games played on Apple’s mobile devices pretty much <em>stay</em> on Apple’s mobile devices.</p>\n\n\n\n<p>And Apple should come to terms with the fact that that is okay. Gaming isn’t a thing that only happens in the living room anymore, just like listening to music underwent a personal audio revolution with the Walkman and the iPod, and streaming video has become something people do on planes. The addressable market for those playing games on their smartphones and tablets is far, far larger than those who only play on consoles or PCs.</p>\n\n\n\n<p>What Apple’s latest decision about Arcade does is put the focus squarely back on the most important part of the gaming equation: the games. If it keeps that up, it might finally see that it’s been too busy looking to what it could have rather than focusing on what it’s already got.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6a9b1fe478033165f6113b9fc31bdbd79059f5cfb638891f3289ad25e46ad8f1","category":"Apple"}