{"title":"iPhone With MicroLED Display Reportedly on Apple's Roadmap","link":"https://www.macrumors.com/2023/05/10/microled-iphone-report/","date":1683738087000,"content":"Apple plans to release an iPhone with a microLED display in the future, according to a report today from supply chain publication <a href=\"https://www.digitimes.com/news/a20230510PD204.html\"><em>DigiTimes</em></a>. This display technology would allow for higher brightness, decreased power consumption, improved contrast ratio, and other benefits compared to current iPhones with OLED displays.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/iphone-14-pro-max-deep-purple-feature-purple.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe paywalled report claims the Apple Watch Ultra will be the first Apple device to switch to microLED, followed by the iPhone and iPad:<blockquote>Starting with Apple Watch, Apple plans to further introduce microLED display to iPhone and iPad. Some sources from IT industry forecast that Apple Watch Ultra will no longer use existing OLED display by end-2024 or 2025 as it will be replaced by Apple's self-developed microLED display.</blockquote>With the Apple Watch Ultra <a href=\"https://www.macrumors.com/2023/04/27/apple-watch-ultra-second-half-2025/\">not expected to use microLED until 2025</a>, the first iPhone to adopt the technology is likely still several years away from launching. All four iPhone 15 models coming later this year are expected to stick with OLED displays.\r<br />\n\r<br />\nIn the meantime, Apple is still completing its transition to OLED displays. The first Apple device with an OLED display was the original Apple Watch, followed by the iPhone X, and the first iPad and Mac models with OLED displays are <a href=\"https://www.macrumors.com/2022/12/12/oled-macbook-air-ipad-pro-2024/\">rumored to launch next year</a>. The transition to microLED will likely follow a similar smaller-to-larger device trajectory.<div>Tags: <a href=\"https://www.macrumors.com/guide/digitimes-com/\">DigiTimes</a>, <a href=\"https://www.macrumors.com/guide/micro-led/\">Micro-LED</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/10/microled-iphone-report/\">iPhone With MicroLED Display Reportedly on Apple's Roadmap</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-with-microled-display-reportedly-on-apples-roadmap.2389203/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6a9f6907a7b9b59bf56e773708bfd3b953ec66f6b4fce83e95fb4b8f5aa4c5c2","category":"Apple"}