{"title":"A Mini LED display could be the best reason to buy a new iPad Pro","link":"https://www.macworld.com/article/235002/ipad-pro-mini-led-display.html","date":1618569000000,"content":"\n<div>\n<section><div></div></section><p>We’ve heard rumors <a href=\"https://www.macworld.com/article/3530357/report-apple-to-feature-six-products-with-mini-leds-including-a-14-1-inch-macbook-pro.html\">for about a year or so</a> that Apple is on the verge of launching some products with Mini LED display technology, and now the first may finally be on the way. The latest speculation suggests that at least one of the new iPad Pro models will have a mini LED display to separate it even further from the iPad Air. Here’s why it could be the biggest reason to buy a new iPad Pro.</p>\n\n\n\n<h2>A better backlit LCD</h2>\n\n\n\n<p>To understand Mini LED, you first have to know the basics of how a traditional backlit LCD works. That’s what we have in all our iPads, MacBooks, and iMacs today.</p>\n\n\n\n<p>It can get complicated, but in short, there’s a backlight (usually white), with an LCD layer on top of it. The purpose of the LCDs is to block a controlled amount of light from the backlight. On top of the LCDs are color filters that turn the light red, green, or blue. That’s the basic structure, but modern LCDs have other layers like polarizers, anti-glare coatings, and so on. A big white light, covered by a bunch of tiny LCDs (three for each pixel) to block or let through various amounts of light, and a color filter to turn the light red, green, or blue.</p>\n\n\n\n<p>What Mini LED technology does is replace that big backlight with a grid of lots of tiny little backlights.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2018/11/array-backlighting-100780670-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2018/11/array-backlighting-100780670-large.jpg\" /></a><figcaption><p>This image from Vizio illustrates the concept of local dimming LED arrays. </p>\n</figcaption></figure></div>\n\n\n\n<p>I’m glossing over the finer points. There are <em>lots</em> of exceptions. In TVs, for example, larger LED backlight arrays with what is called “local dimming” are common, and even Mini LED TVs are already on the market from brands like TCL. Apple’s Pro Display XDR is very nearly a Mini LED display, with 576 backlight LEDs that are individually controlled (a typical Mini LED display of that size would have perhaps a few thousand).</p>\n\n\n\n<p>So that’s Mini LED in a nutshell: kind of like the Pro Display XDR, but with many more, smaller, LED backlights. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cnet.com/news/mini-led-lcd-tv-tech-tiny-lights-could-lead-to-better-picture-quality-tcl-6-series/&amp;xcust=1-1-235002-0-0-0&amp;sref=https://www.macworld.com/feed\">CNET has a good article</a> that focuses on TVs. The principle is the same for all Mini LED displays.</p>\n\n\n\n<h2>Precise local dimming and HDR</h2>\n\n\n\n<p>What does a backlight array of thousands of tiny LEDs do for you, exactly? Well, in a traditional LCD you may have one backlight lighting up the entire display in a uniform fashion. It has to be as bright as the brightest white pixels on the screen. Then the LCDs in front of it would block some amount of light to make darker pixels.</p>\n\n\n\n<p>With an array of backlight LEDs, like those on the Pro Display XDR, you can individually control the brightness of the backlight on hundreds of tiny “zones” and then further refine the brightness with the LCD layer. This improves contrast and power efficiency, and allows for darker black levels.</p>\n\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/article/2021/01/pro-display-layers-100872910-large.jpg\" /><figcaption><p>The Pro Display XDR has hundreds of LED backlights, but not enough to be truly called a Mini LED display.</p>\n</figcaption></figure></div>\n\n\n\n<p>Mini LED technology takes this even further, with thousands or even tens of thousands of really tiny LEDs divided into hundreds or thousands of lighting zones. The display can control the backlight intensity behind just a few hundred pixels.</p>\n\n\n\n<p>This further improves power efficiency, and also makes it possible to have finer control over the brightest and darkest areas of the screen. One LED backlight can be cranked up really bright without causing light to bleed into a dark area nearby.</p>\n\n\n\n<p>It’s likely that Apple products with Mini LED displays will have higher peak and sustained brightness, though not up to the level of the Pro Display XDR’s impressive 1000 nits sustained and 1600 nits peak. That sort of thing generates a lot of heat and requires significant cooling. This, combined with great black levels, will mean really high contrast ratios and brilliant HDR quality.</p>\n\n\n\n<h2>Not the same as Micro-LED</h2>\n\n\n\n<p>There’s another technology coming down the pike with a similar-sounding name: Micro-LED. Likely to appear first in the Apple Watch due to cost, Micro-LED is not at all the same thing as Mini LED.</p>\n\n\n\n<p>If you read the description of Mini LED and thought, “why don’t they just make the LEDs so small that there’s one for every subpixel?” then you’re right on target. That’s exactly what Micro-LED is.</p>\n\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/article/2021/01/micro-led-trendforce-100872911-large.jpg\" /><figcaption><p>Micro-LED isn’t like Mini LED. It’s not an LCD at all.</p>\n</figcaption></figure></div>\n\n\n\n<p>Micro-LED is very much like OLED; a self-emissive technology (meaning there’s no backlight). It is an array of <em>much smaller</em> LEDs, millions of them on a single display, each the size of an individual sub-pixel. Each Micro LED is red, green, or blue and simply shines brighter or dimmer to change a pixel’s color. Thus there is no need for an LCD layer or a color filter.</p>\n\n\n\n<p>Micro-LED displays are too expensive for widespread adoption right now, but prices are coming down. They should ultimately offer big benefits over LCD or OLED technology, with super-fast response times, incredibly color reproduction, high brightness, perfect black levels, and better energy efficiency all in a thinner display.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6aac341fd1ae2f467a3371c2eb3145fb11f6c0b33756f4377f01a4796a9f9253","category":"Apple"}