{"title":"Fitness of Multi-Resolution Remotely Sensed Data for Cadastral Mapping in Ekiti State, Nigeria","link":"https://www.preprints.org/manuscript/202408.1404/v1","date":1724148244000,"content":"In developing nations, such as Ekiti State, Nigeria, the use of remote sensing data, especially satellite and UAV imagery, remains significantly underutilized in land administration. This limits the potential of multi-resolution imagery in land governance and socio-economic development. This study examines factors influencing UAV adoption for land administration in Nigeria, mapping six distinct rural, peri-urban, and urban sites, and creating orthomosaics with resolutions ranging from 2.2cm to 3.39cm. Boundaries were manually delineated from multi-resolution orthomosaics to acquire coordinates, and parcel areas were calculated. Using 0.05m UAV imagery as the reference, the Root Mean Square Error (RMSE) was computed to evaluate 0.1, 0.5, and 1m orthomosaics' accuracy for boundary delineation across the six geographical contexts. The Normalized Parcel Area Error (NPAE) was also calculated to determine how the multi-resolution imageries affected the property areas. Results showed a consistent increase in error with increasing resolution (0.1m to 1m) in formal areas (Igedora, Maryland, Okebola) with physical demarcations, from 0.117m to 1.747m RMSE. In contrast, informal settlements exhibited inconsistent error values, indicating a differing impact of resolution on error between formal and informal areas. The research demonstrates the role of physical demarcations in facilitating cadastral mapping, with formal settlements demonstrating the highest suitability. This study recommends the use of imagery resolution specific to each context, offering guidance for improved land governance. Implications and recommendations include promoting awareness of settlement typologies in aerial imagery use for cadastral mapping, leveraging UAVs for high-resolution aerial imagery, and addressing regulatory challenges to promote UAV adoption. Finally, the RMSE and NPAE values can serve as metrics for assessing different resolution images’ fitness for cadastral mapping.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6aacecd1ece4c3b9bdf6ecb1afdbb5ea1f7c1cf4fcb3ce7be640598466b6b07f","category":"Interdisciplinary"}