{"title":"Apple Seeks Early Motion to Reject Epic's Claim It's Being Denied iOS Access","link":"https://www.macrumors.com/2021/05/19/apple-early-motion-epic-games-app-store-access/","date":1621422237000,"content":"As part of the Apple vs. <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> legal battle, Apple has filed a motion asking for a judge ruling on one of the ten claims that ‌Epic Games‌ had made against it. Specifically, Apple is seeking a partial judgment on the claim that iOS is an \"essential facility\" and denies Epic's claim that it has been unlawfully barred from accessing it through the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/fortnite_apple_featured.jpg\" />\r\n<br />\r\nThe claim, specified in <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.364265/gov.uscourts.cand.364265.708.0.pdf\">court filings</a> as Count 2, refers to Epic's argument that it's been denied access to iOS, which it claims is an \"essential facility\" due to the fact it's been blocked access to the ‌App Store‌. The Count specifically accuses Apple of violating Section 2 of the Sherman Act through \"its unlawful denial to Epic and other app distributors of an essential facility—access to iOS.\"\r\n<br />\r\n\r\n<br />\r\nApple is asking the judge to move forward with a judgment due to Epic's lack of \"factual, expert, or legal support for its theory of essential facility\" and that it has practically given up on attempting to prove it. Apple also cites testimony from one of Epic's own witnesses, who said during the trial regarding the ‌App Store‌ that nothing they say is referencing anything that can be deemed an \"essential facility.\"\r\n<br />\r\n<blockquote>Epic’s experts did not opine on whether iOS is an essential facility, or whether Epic has been denied access to iOS. Rather, Dr. Evans admitted in his written direct testimony that Epic and other developers are provided \"access to the tools and permissions for writing iOS apps.\" \r\n<br />\r\n\r\n<br />\r\nAnd on the stand, Dr. Evans admitted that he was not \"expressing any opinion on anything termed an essential facility or anything related to an essential facility claim in this case.\"</blockquote>In the court filing, Apple says that the iOS ‌App Store‌ can easily be replicated and duplicated, and per the court's own definition, iOS is not an essential facility. Apple goes on to say that essential means \"essential\" and not what's \"best,\" \"most profitable or preferable.\"\r\n<br />\r\n\r\n<br />\r\nApple <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">removed Fortnite</a> and <a href=\"https://www.macrumors.com/2020/08/28/apple-terminates-epic-games-developer-account/\">stripped Epic of access to its developer account</a> in August of last year after it violated ‌App Store‌ Guidelines. To the court, Apple reiterated that Epic has access to the ‌App Store‌, despite its claim it's been unlawfully stripped of access to an \"essential facility,\" as long as it follows the same rules that all developers are adhered to.\r\n<br />\r\n\r\n<br />\r\nApple notes that ‌Epic Games‌ had full access to the app distribution platform before it began \"Project Liberty,\" Epic's codename for its legal fight against Apple. \r\n<br />\r\n<blockquote>There is no dispute that Epic actually has access to iOS. Epic, like all other developers, may obtain \"access to the tools and permissions for writing iOS apps,\" and may distribute those apps through iOS, by agreeing to the DPLA. And Epic clearly did (prior to Project Liberty) distribute its apps through iOS and the ‌App Store‌. So do millions of other developers.</blockquote>Apple says that ‌Epic Games‌' real argument is not that it is illegally being denied access to the ‌App Store‌ and iOS, but that instead it does not like the terms and conditions that developers must follow on the platform. \r\n<br />\r\n\r\n<br />\r\nThe <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a> trial <a href=\"https://www.macrumors.com/2021/05/03/epic-games-vs-apple-trial-begins/\">officially started on May 3</a>, and Apple is asking that its request for a partial judgment be entrained on May 24 or as soon as the court may hear its request. <div>Tag: <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/19/apple-early-motion-epic-games-app-store-access/\">Apple Seeks Early Motion to Reject Epic's Claim It's Being Denied iOS Access</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-seeks-early-motion-to-reject-epics-claim-its-being-denied-ios-access.2296755/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AQcAEvYqrME:CgU_ewk_Sgg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=AQcAEvYqrME:CgU_ewk_Sgg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/AQcAEvYqrME\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6ab072aa946c9665459f5cf5268b5886f1749019902ba351ce93ab57d53c3a7d","category":"Apple"}