{"title":"Combined benthic and stream edge sampling better represent macroinvertebrate assemblages than benthic sampling alone along an aridity gradient","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10601?af=R","date":1708011195000,"content":"<h2>Abstract</h2>\n<p>Studies of stream macroinvertebrates traditionally use sampling methods that target benthic habitats. These methods could underestimate biodiversity if important assemblage components exist outside of the benthic zone. To test the efficacy of different sampling methods, we collected paired reach-wide benthic and edge samples from up to 10 study reaches in nine basins spanning an aridity gradient across the United States. Edge sampling targeted riparian-adjacent microhabitats not typically sampled, including submerged vegetation, roots, and overhanging banks. We compared observed richness, asymptotic richness, and assemblage dissimilarity between benthic samples alone and different combinations of benthic and edge samples to determine the magnitude of increased diversity and assemblage dissimilarity values with the addition of edge sampling. We also examined how differences in richness and assemblage composition varied across an aridity gradient. The addition of edge sampling significantly increased observed richness (median increase = 29%) and asymptotic richness (median increase = 173%). Similarly, median Bray–Curtis dissimilarity values increased by as much as 0.178 when benthic and edge samples were combined. Differences in richness metrics were generally higher in arid basins, but assemblage dissimilarity either increased or decreased across the aridity gradient depending on how benthic and edge samples were combined. Our results suggest that studies that do not sample stream edges may significantly underestimate reach diversity and misrepresent assemblage compositions, with effects that can vary across climates. We urge researchers to carefully consider sampling methods in field studies spanning climatic zones and the comparability of existing data sets when conducting data synthesis studies.</p>","author":"Brian A. Gill, \nDaniel C. Allen, \nMeryl C. Mims, \nThomas M. Neeson, \nAlbert Ruhi, \nCarla L. Atkinson, \nArial J. Shogren, \nTravis M. Apgar, \nZacchaeus G. Compson, \nStephen Cook, \nDaryl R. Trumbo, \nMichelle H. Busch, \nKelsey D. Hollien, \nKyle Leathers, \nMegan C. Malish, \nGrace L. O'Malley, \nSamuel Silknetter, \nChelsea R. Smith, \nHoward Dunleavy, \nMichael T. Bogan","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"6ab24fd959edc384118943c336ecba19767282ca79e9b8736b235c75961c343d","category":"Environment"}