{"title":"Bivalves Improved Water Quality by Changing Bacterial Composition in Sediment and Water in an IMTA System","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1930201?af=R","date":1681282800000,"content":"<p>Integrated multitrophic aquaculture (IMTA) maximises the nitrogen cycle between system components, including bacteria. In order to maximise the bacterial role in nitrogen elimination in an IMTA system, we investigated the effect of bivalve culture on water quality and bacterial community structure in overlying water and sediment in the “shrimp-crab-bivalve-fish” IMTA system. The bacterial composition in overlying water and sediment was measured by Illumina -MiSeq high-throughput sequencing technology. The results show that dissolved oxygen was higher in the bivalve culture area. Ammonia and nitrite in the bivalve culture area were lower than those in the nonbivalve culture area; however, the nitrate and phosphate in the bivalve culture area were higher than those in the nonbivalve culture area. The Chao1, Shannon, and Ace indexes were higher in the bivalve area. More bacteria with nitrification and denitrification functions were detected in bivalve culture areas, such as <i>Ruegeria</i> (1.05%–4.79%), <i>Thalassobius</i> (0.11%–0.69%), <i>Limibaculum</i> (0.07%–0.69%), <i>HIMB</i>11 (0.13%–0.21%), and <i>Rubellimicrobium</i> (0.01%–0.16%). More Cyanobacteria were detected in bivalve culture areas with higher phosphate concentrations. To sum up, bivalves can release phosphorus through bioturbation, increasing the abundance of Cyanobacteria, which release dissolved oxygen into overlying water through photosynthesis, enhance nitrification (mainly ammonia oxidation), and improve the ammonia nitrogen removal capacity of the system. Meanwhile, bivalves can increase bacterial diversity and abundance by regulating dissolved oxygen. This study provided insight into bivalve interaction with bacterial activity in the IMTA system.</p>","author":"Shuo Kong, \nZhao Chen, \nAbdallah Ghonimy, \nJian Li, \nFazhen Zhao, \nUmar Khan","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6ab4b99fe155416acd4234f900a090ef26aa9cb963b38561b851c2bbbfbae404","category":"Environment"}