{"title":"Imaging Sonar Reveals Diel Movement of Fish Throughout a Developed Australian Estuary","link":"http://link.springer.com/10.1007/s12237-023-01315-6","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Estuaries present a unique interface between ocean and freshwater systems and support key fish habitats. While the role of estuaries for juvenile fish has been studied extensively, the daily movement patterns of large fish and the exchange of fishes between estuary and ocean are less understood, particularly in developed estuaries. This study examines the quantity of fish biomass transiting through an important commercial fishing estuary in New South Wales, Australia, over 4 months, at four sites, and across diel periods. We used an imaging sonar across diurnal and nocturnal sampling events to reveal the size of fish, their movement patterns, and the biomass flux occurring throughout the estuary. Across ~ 60 h of footage, &gt; 66,200 fish were counted and measured. Fish activity was the greatest at night, with 77% of fish biomass flux (kg h<sup>−1</sup>) occurring during nocturnal sampling. The total observed fish biomass over the 60 h amounted to ~ 15,500 kg, with the highest activity recorded at the estuary mouth at night (736 ± 463 kg h<sup>−1</sup>). Overall, mean fish length was the greatest at night (25.2 ± 2.0 cm); however, fish observed during the day at the estuary mouth had the highest mean length (27.8 ± 6.9 cm). Extrapolated across the width of the estuary, total fish movement ranged to a maximum of 47 Tons h<sup>−1</sup> in the lower estuary (Stockton) and a minimum of 0.4 Tons h<sup>−1</sup> in the upper estuary (Throsby Creek Lower). These results demonstrate the importance of estuaries, despite their level of development, in supporting the daily movement patterns of fish biomass between habitats, estuary, and ocean.</p>\n                    <span>\n                      <h3>Graphical Abstract</h3>\n                      <p>\n      <span>\n                        <span>\n                          <img src=\"https://static-content.springer.com/image/MediaObjects/12237_2023_1315_Figa_HTML.png\" />\n                        </span>\n                      </span></p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"6ab579716589895540d481eb362dac2ff7b29635bdaf252f1f436429b4d5f569","category":"Environment"}