{"title":"More water, less light: how to improve silver fir seeding to convert Norway spruce monocultures into mixed stands in a drier region of Germany","link":"https://academic.oup.com/forestry/article/97/4/615/7577293?rss=1","date":1705536000000,"content":"<span><div>Abstract</div>Adaptive forest management gains importance as climate and disturbance regimes continue to change. Norway spruce monocultures are particularly vulnerable to those changes. Thus, there is a strong demand to convert pure spruce stands toward better adapted forest ecosystems. Silver fir has similar wood properties as Norway spruce, but is less vulnerable to droughts. Yet, little is known how to efficiently admix silver fir into Norway spruce monocultures. We analyzed seedling abundance in mature Norway spruce monocultures 1 year after soil scarification and silver fir seeding in a relatively dry region of southern Germany. Our objectives were to study the effect of soil scarification and seeding on regeneration density and to identify drivers of seedling abundance. We collected data on regeneration, forest structure, as well as soil and light conditions at 103 scarified and 25 untreated control plots. We used non-parametric independence tests to compare scarified and untreated plots. Subsequently, we used boosted regression trees to investigate the drivers of seedling abundance. Norway spruce strongly benefited from soil scarification (<span>P</span> &lt; .001), with seedling numbers even exceeding those of silver fir. Both species thrived in soils with high plant available water capacity. In contrast, seedling numbers were overall negatively affected by light. Moreover, we found a higher density of silver fir regeneration at greater distance from neighboring trees and in soils devoid of carbonate. Our study indicates that water, not light, is the limiting factor for both Norway spruce and silver fir seedlings in the study region. Seeding silver fir will likely be most effective underneath an intact canopy on deep, fine-textured soils without carbonate, while maximizing the distance to Norway spruce trees. In conclusion, silver fir seeding can be optimized to become an effective adaptive measure to diversify Norway spruce monocultures, and thus to create more resistant and resilient forest ecosystems.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"6ab5c7794ca3ed405a0fe8b327c82db254f926c839f3e9de54a495547976515a","category":"Environment"}