{"title":"Weekend Tech Tidbits: Karoo 2 Color Cases, 4iiii Crank Buyback, and GoPro Session Labs Update","link":"https://www.dcrainmaker.com/2021/05/weekend-tech-tidbits-karoo-2-color-cases-4iiii-crank-buyback-and-gopro-session-labs-update.html","date":1621162719000,"content":"<p>Here’s a quick round-up of a few items that spilled over from the last week (or so) that I’ve consolidated together for your inner geek to consume.</p>\n<h3><span>Hammerhead’s New Karoo 2 Colorful Cases:</span></h3>\n<p>Starting off with ‘well, that took longer than I expected’ to launch, are <a href=\"https://www.hammerhead.io/collections/best-sellers/products/karoo-2-custom-color-kit\">Hammerhead’s Karoo 2 color case shells</a>. I say ‘longer than I expected’ because they quietly teased these in a survey last summer (yes, almost a year ago).  In any event, they’re here now for <a href=\"https://www.dcrainmaker.com/2020/12/hammerhead-karoo-2-in-depth-review.html\">the Karoo 2</a>. These allow you to replace your black shell with a non-black shell. Obviously, you should choose red.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-49.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-49.png\" /></a></p>\n<p>I suppose if you also have <a href=\"https://www.dcrainmaker.com/2021/02/garmin-enduro-gps-watch-in-depth-review.html\">a Garmin Enduro watch</a>, you could choose the lime green color, which roughly matches the accents there. In case you were curious, they followed their <a href=\"https://www.facebook.com/groups/hammerheadkaroo/permalink/3599646113413056/\">survey results exactly</a>. Lime green came in last place of the five colors that made the cut, but it placed well ahead of teal, pink, and army green (in total, 16 colors were considered).</p>\n<p>Now, this privilege won’t come cheap – costing $39USD/39EUR…but hey, shipping is free.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-50.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-50.png\" /></a></p>\n<p>Inside the kit is also two screws and a screwdriver. Yes, it actually includes a screwdriver:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-51.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-51.png\" /></a></p>\n<p>I’ve put it in my cart a few times (the red one, obviously), but haven’t quite pulled the trigger on it. Eventually I’ll cross that line. But not yet.</p>\n<p>Oh, and in case the last time you checked on the Karoo 2, it’s now available for regular order. No pre-order stuff. Just order and it ships immediately.</p>\n<h3><span>4iiii Crank Buyback Program:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-52.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-52.png\" /></a></p>\n<p>Now, are you the owner of an unused Shimano crankset sitting around your garage? Then you can <a href=\"https://4iiii.com/crank-buyback/#seemore\">earn enough cash to pay</a> for that lime green Karoo 2 shell, via 4iiii’s Crank Buyback program. This program gives you $30-$45 in straight cash for used Shimano left-arm cranks. Plus, they’ll send you a shipping label. As an alternative to getting cash back, you can have them donate that amount to Trips for Kids, which is a charity that gets bikes into the hands of kids.</p>\n<p>So, why is 4iiii doing this? Well, like every other bike-related company in the industry right now, parts are hard to come by. Especially crankset and drivetrain related parts (which is why you see Elite making their Suito trainer offered without a cassette). For companies like 4iiii (and Elite), it’s literally holding back sales, since they don’t have the parts required to sell their products.</p>\n<p>Once you send in the crank arm, they’ll inspect it and then ultimately attach a power sensor pod to it for re-sale. The $30-$45 for a crank arm isn’t really that much less than you’d buy a new one for…if you could actually buy a new one. So being able to dig around in a box and grab that used crank-arm to send in for a bit of cash is a decent deal. That’s especially notable if you perhaps took off that very crank-arm to install a pre-attached left-only crank+power meter in the last few years.</p>\n<p>In any case, you <a href=\"https://4iiii.com/crank-buyback/go\">simply go to their site</a> and choose from the long drop-down list. The screenshot below is only a partial list</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/05/image-53.png\"><img src=\"https://media.dcrainmaker.com/images/2021/05/image_thumb-53.png\" /></a></p>\n<p>And with that…there ya go, all ya need to know. I wonder if we’ll see trainer manufacturers do the same with cassettes soon? Sure, cassettes do get more wear than most crank arms, but, I suspect most cassettes are retired well before reaching even the youth of their years.</p>\n<h3><span>GoPro Hero 5 Session Labs Firmware:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2016/09/GoPro-Hero5-Black-Hero5-Session-2016_thumb.jpg\" /></p>\n<p>This post is apparently all about pulling old things out of the closet. But if you’ve got a <a href=\"https://www.dcrainmaker.com/2016/09/gopro-hero5-karma-drone.html\">GoPro Hero 5 Session</a> sitting around (it launched in 2016!), then you’re the new winner of a bunch of new features. As <a href=\"https://dronedj.com/2021/05/14/gopro-labs-now-supports-hero5-session/\">DroneDJ noticed</a>, this past week it <a href=\"https://community.gopro.com/t5/GoPro-Labs/ct-p/GoProLabs\">received the option to download the GoPro Labs firmware</a> for it. This joins the GoPro Hero 7, Hero 8, Hero 9, and MAX as being supported GoPro Labs cameras.</p>\n<p><em>(Note: This doesn’t include the GoPro Hero 5, non-session, seen above right – just the Hero 5 session, seen left above.)</em></p>\n<p>If you’re not familiar with GoPro Labs, it was introduced a year ago in May 2020, and allows you to get pretty geeky with configuration of the camera, while also unlocking features not otherwise accessible in the camera. For example, delayed recording (such as to turn on the camera the following morning before sunrise). For the Hero 5 Session, there’s not a simple list that I could find of all the added GoPro Labs features it supports (since some newer cameras support additional features), but looking at the <a href=\"https://gopro.github.io/labs/control/session5/\">controls QR code creation page</a>, it appears to support:</p>\n<p>– Delayed capture start<br />\n– Specified capture end<br />\n– Setting all the frames/resolutions via QR code<br />\n– Setting the time<br />\n– Setting all the ProTune controls<br />\n– Setting most of the camera preferences</p>\n<p>This is especially notable for the Hero 5 Session, as it lacks a normal touchscreen to interact with the menus for the camera itself. If you remember, you had to use this little dual-button system on a tiny calculator-style screen, which was roughly akin to banging your head on a wall (a few weeks ago I went to use this camera for something else and then remembered why I rarely used it).</p>\n<p>Still, while I appreciated the theory of the size, the practicality of it for most people wasn’t all that different, once you had it mounted, than a regular GoPro. I do suspect these days though they could launch a legit tiny GoPro competitor to the <a href=\"https://www.dcrainmaker.com/2021/03/insta360-go-2-action-review.html\">Insta360 Go2</a>, but perhaps super-lightweight that’d also be useful for the DIY FPV drone community (with a removable micro-SD card, and power connectors). Perhaps something hardware-wise stripped down to save weight, but without having to make a so-called ‘naked GoPro’ yourself.</p>\n<p>In any case (get it?), with that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"6aba93d9b3fbbd506baa633952c521802f349176ad54fc5d549921af91f76da3","category":"Cycling"}