{"title":"Economical Experimental Device for Evaluating Thermal Conductivity in Construction Materials under Limited Research Funding","link":"https://www.preprints.org/manuscript/202403.1875/v1","date":1711724610000,"content":"African scientific research faces formidable challenges, particularly with limited access to state-of-the-art measurement instruments. The high cost associated with these devices presents a significant barrier for regional research laboratories, impeding their ability to conduct sophisticated experiments and gather precise data. This predicament not only hampers the individual laboratories but also has broader implications for the African scientific community and the advancement of knowledge in developing nations—the financial cost barrier considerably impacts the research quality of these laboratories. Reflection on technical and economical solutions needs to be quickly found to help these countries advance their research. In civil Engineering, the thermal conductivity property is the most important measurement for characterising heat transfer in construction materials. Existing devices (i.e., conductometers) in a laboratory are expensive (approximately 30,000 euros) and unavailable for some African laboratories. The study proposes a new and affordable device to evaluate thermal conductivity in construction materials. The method involves establishing a thermal flux between a heat source ( from the Joule effect provided by steel wool where a current is circulating) and a cold source (generated by ice cube) under steady-state conditions. The development of the cylindrical prototype is based on the comparative flux-meter method outlined in the measuring protocol of the ASTM E1225 standard document. Experiments were conducted on four distinct materials (polystyrene, wood, agglomerated wood, and rigid foam). The results indicate a correct correlation between the experimental values obtained from the newly developed prototype and the reference values found in the literature. For example, concerning the experimental polystyrene study, the detailed case analysis reveals a good correlation, with a deviation of only 4%. The percent error found falls within the acceptable range indicated by the standards recommendations of the ASTM E1225 standard, i.e., within 5% acceptable error.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6ac0b48b77367215f1c989f32d6f317e106f797ad93e0e835157f321d805d942","category":"Interdisciplinary"}