{"title":"Apple Watch Series 7 Production Reportedly Delayed Due to Quality Issues [Updated]","link":"https://www.macrumors.com/2021/08/31/apple-watch-series-7-production-delay/","date":1630424719000,"content":"Production of the upcoming Apple Watch Series 7 has been delayed due to the upcoming watch featuring a \"complicated design,\" according to a report by <em><a href=\"https://asia.nikkei.com/Business/Technology/Apple-Watch-production-delayed-as-engineers-wrestle-with-quality-issues\">Nikkei Asia</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/Apple-Watch-7-Unreleased-Feature.jpg\" />\r\n<br />\r\nAccording to the report, Apple suppliers began small-scale production of the watch last week, and during which, employees \"encountered critical challenges in reaching satisfactory production performance.\" \r\n<br />\r\n<blockquote>Manufacturers of Apple Watch 7, as the device is expected to be called, began small-scale production last week but encountered critical challenges in reaching satisfactory production performance, multiple people familiar with the situation said.\r\n<br />\r\n\r\n<br />\r\nThree sources said the current disappointing production quality could be attributed to the complexity of design, which is significantly different from that of previous generations of the watch, and the assemblers found issues when putting together electronics modules, components and displays.</blockquote>As a result of the complex design, which is rumored to come in the form of flat-edges and larger displays, Apple suppliers have \"temporarily halted\" production of the new watch as engineers attempt to \"further certify the designs before going into mass production.\"\r\n<br />\r\n\r\n<br />\r\nThe Apple Watch Series 7, according to <em>Nikkei Asia</em>, will come with blood pressure measurement capabilities, an apparent factor in production being halted. Specifically, hardware to enable blood pressure measurements must \"meet requirements for water-resistance performance, further increasing the engineering and production challenges.\"\r\n<br />\r\n\r\n<br />\r\nApple is widely rumored to be planning an all-digital event for the middle of next month, where the company is expected to announce the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> and Apple Watch Series 7. Today's report, however, citing sources, says those plans might be impacted due to the production issues. While production of the watch may be experiencing issues, those issues may only result in delayed shipping of the device rather than a delay in its announcement. \r\n<br />\r\n\r\n<br />\r\nFor example, Apple suppliers earlier this year were battling with production constraints related to mini-LED displays used in the new 12.9-inch <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>. While the new <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> was announced in April, it didn't begin shipping until later in May due to production issues. A similar scenario may be in play with the Apple Watch Series 7 if today's report is true.\r\n<br />\r\n\r\n<br />\r\n<b>Update 9:42 am</b>: <em>Bloomberg</em> is <a href=\"https://www.bloomberg.com/news/articles/2021-08-31/apple-s-new-watch-will-likely-be-delayed-over-production-snags\">hearing similar information</a> that the launch is likely to be delayed.<blockquote>Apple Inc.’s upcoming smartwatch is suffering production snags as manufacturers adjust to a new design, likely leading to delays, according to a person familiar with the situation.</blockquote><div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 6</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/nikkei-com/\">nikkei.com</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Don't Buy)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/31/apple-watch-series-7-production-delay/\">Apple Watch Series 7 Production Reportedly Delayed Due to Quality Issues [Updated]</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-7-production-reportedly-delayed-due-to-quality-issues-updated.2309302/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=zHnjCe96Ocs:aBNqIkcQcmM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=zHnjCe96Ocs:aBNqIkcQcmM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/zHnjCe96Ocs\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6ac6812722332d92f69c810a0a431e5669220d446dac0b6d735d4e9caa920589","category":"Apple"}