{"title":"Millions of PC motherboards were sold with a firmware backdoor","link":"https://arstechnica.com/?p=1943487","date":1685624657000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/gigabyte-listing-800x533.jpg\" alt=\"Millions of PC motherboards were sold with a firmware backdoor\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/gigabyte-listing.jpg\">Enlarge</a> (credit: BeeBright/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Hiding malicious programs in a computer’s UEFI firmware, the deep-seated code that tells a PC how to load its operating system, has become an insidious trick in the toolkit of stealthy hackers. But when a motherboard manufacturer installs its own hidden backdoor in the firmware of millions of computers—and doesn’t even put a proper lock on that hidden back entrance—they’re practically doing hackers’ work for them.</p>\n<p>Researchers at firmware-focused cybersecurity company Eclypsium revealed today that they’ve discovered a hidden mechanism in the firmware of motherboards sold by the Taiwanese manufacturer Gigabyte, whose components are commonly used in gaming PCs and other high-performance computers. Whenever a computer with the affected Gigabyte motherboard restarts, Eclypsium found, code within the motherboard’s firmware invisibly initiates an updater program that runs on the computer and in turn downloads and executes another piece of software.</p>\n<p>While Eclypsium says the hidden code is meant to be an innocuous tool to keep the motherboard’s firmware updated, researchers found that it’s implemented insecurely, potentially allowing the mechanism to be hijacked and used to install malware instead of Gigabyte’s intended program. And because the updater program is triggered from the computer’s firmware, outside its operating system, it’s tough for users to remove or even discover.</p></div><p><a href=\"https://arstechnica.com/?p=1943487#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1943487&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6aca8083e2b056566bfe1622ff39f1d87ea02d5323a143fb34e74e1b5d5de7ee","category":"Tech"}