{"title":"Application of Reduced Graphene Oxide-Zinc Oxide Nanocomposite in the Removal of Pb(II) and Cd(II) Contaminated Wastewater","link":"https://www.preprints.org/manuscript/202407.1109/v1","date":1721032541000,"content":"Toxic metal wastewater is a challenge for exposed terrestrial, aquatic environments and the recyclability of the water, prompting inputs for the development of promising treatment methods. Consequently, the rGO/ZnONP nanocomposite was synthesized at room temperature for four hours and was tested for adsorption of cadmium and lead in wastewater. The optimized nanocomposite had the lowest band gap energy (2.69 eV) and functional group interactions were at 516, 1220, 1732, 3009, and 3460 cm-1. The nanocomposite showed saturation of ZnO nanoparticles on rGO with a weight percentage of zinc (60.02 %), oxygen (22.96 %), and carbon (16.58 %), and the micrograph showed slight agglomeration on the sheet surface. The nanocomposite’s D and G band intensities were almost the same constituting the ZnO presence on rGO from the raman spectrum. The adsorption equilibrium time for cadmium and lead was reached within 10 and 90 minutes with efficiencies of ~ 100 %. Sips and Freundlich were best fitting the cadmium and lead adsorption data (R2 ~ 1), therefore the adsorption was a multilayer coverage for lead and a mixture of heterogenous and homogenous coverage for cadmium adsorption. Both adsorptions were best fitted by the pseudo first order model, suggesting the multilayer coverage dominance. The adsorbent was reused for three and seven times for cadmium and lead. The nanocomposite showed selectivity towards lead (95 %) and cadmium (100 %) in the interfering wastewater matrix. Conclusively, the nanocomposite may be embedded within upcoming lab-scale treatment plants which could lead to further upscaling and serving as industrial wastewater treatment material.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6acba53218a79f47f0ef13f01512c1ca26e2bb65a167c80093153dd46259e538","category":"Interdisciplinary"}