{"title":"Bike light laws in the UK: what you need to know","link":"https://www.bikeradar.com/features/bike-light-laws-in-the-uk-what-you-need-to-know/","date":1696752000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/11/GettyImages-1229913396-69d87c0.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"LONDON, ENGLAND - DECEMBER 02: A man is seen cycling through an empty Covent Garden on December 2, 2020 in London, England.\" title=\"England Enters Tier System After Second Coronavirus Lockdown Ends- Tier Two\" />                                            <p>There’s a lot of confusion surrounding the law for bike lights: is a flashing light legal or does it have to be steady? And do you have to fit reflectors, too? Here, we set the facts straight.</p>\n<p>It’s worth explaining why you need to fit and use lights at night in the first place, and it’s not just to see where you’re going – if you’re riding on city streets, the street lights probably do that for you fairly well. Equally important is that bike lights and reflectors help us to be seen by other road users and pedestrians.</p>\n<p>If you’re looking for advice on which bike lights to buy, check out our guides to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-lights-for-road-cycling/\">best bike lights for road cycling</a> and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-lights/\">best mountain bike lights</a>.</p>\n<h2>The current UK law on bike lights</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Magicshine Ray 2600B Smart Remote Bike Light - front light for road bikes\" title=\"Magicshine Ray 2600B Smart Remote Bike Light - 04\" />\n\n</div><div><figcaption><span><i></i> It is a legal requirement to have a front and rear light, as well as a red rear reflector, illuminated on your bike when riding at night.</span></figcaption><span> <i>David Caudery / Our Media</i></span></div>\n<p>According to the UK’s Road Vehicles Lighting Regulations (RVLR), it’s illegal to cycle on a public road between sunset and sunrise without lights.</p>\n<p>There have been quite a few changes to this legislation in recent years – the current version of the RVLR was published in 1989, and has since been amended multiple times, <a href=\"http://www.legislation.gov.uk/uksi/2017/852/made\" target=\"_blank\">most recently in 2017</a>.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cateye rear light.\" title=\"_BR_3260\" />\n\n</div><div><figcaption><span><i></i> Your rear light should shine red in a constant or flashing pattern.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>To avoid trouble with the law (and, arguably more importantly, to stay safe), a white light must be showing from the front of your bike and a red light from the rear.</p>\n<p>The RVLR specifies minimum outputs for these lights and also requires that complete bikes must be sold with reflectors on the front and rear of the bike, as well as both the front and rear of each pedal.</p>\n<p>To be totally clear, it is not a requirement to ride with a <strong>white f</strong><strong>ront</strong> <strong>reflector</strong> fitted to your bike but it <strong>must have a red rear reflector fitted. </strong>Complete bikes must be sold with them fitted. In any case, it’s a good idea to leave both of them on.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"POC Omne Eternal\" title=\"POC Omne Eternal\" />\n\n</div><div><figcaption><span><i></i> Front or rear helmet lights can be used in addition to but not in place of lights on your bike.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Note that, to stay on the right side of the law, the lights must also be fitted to your bike and not your helmet. The law states explicitly they should be mounted to your bike and they cannot be higher than 1,500mm from the ground in any case.</p>\n<p>If you lack any of these things and are involved in a nighttime crash, then it could be regarded as ‘contributory negligence’, which is a fancy way of saying the law could potentially deem the incident partially your fault.</p>\n<p>But, in practice, you’re unlikely to be pulled over by the police as long as the front and rear of your bike is illuminated.</p>\n<p>This is backed up by <a href=\"https://www.gov.uk/guidance/the-highway-code/rules-for-cyclists-59-to-82\" target=\"_blank\">Rule 60 of the Highway Code</a>, which says:</p>\n<p>“At night your cycle MUST have white front and red rear lights lit. It MUST also be fitted with a red rear reflector (and amber pedal reflectors, if manufactured after 1/10/85). White front reflectors and spoke reflectors will also help you to be seen. Flashing lights are permitted but it is recommended that cyclists who are riding in areas without street lighting use a steady front lamp.”</p>\n<h2>The minimum legally required equipment for riding a bike at night in the UK</h2>\n<ul>\n<li>A front lamp showing a white light, positioned up to 150cm from the ground and facing forwards. If capable of emitting only a flashing light, it must emit at least four candela (a unit of light intensity, comfortably exceeded by modern lights). If capable of emitting a steady light, the light must comply to BS6102/3 standards</li>\n<li>A rear lamp showing a red light, positioned between 35cm and 150cm from the ground, facing rearwards. If capable of emitting only a flashing light, it must emit at least four candela. If capable of emitting a steady light, it must comply to BS3648, or BS6102/3 standards</li>\n<li>Rear reflector, coloured red, positioned between 25cm and 90cm from the ground, facing rearwards</li>\n<li>Pedal reflectors, coloured amber, positioned so that one is plainly visible to the front and another to the rear of each pedal</li>\n</ul>\n\n<h2>Is there a maximum power limit for bike lights?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Exposure Toro Mk14 front light\" title=\"Exposure Toro Mk14 light - 04\" />\n\n</div><div><figcaption><span><i></i> The most powerful lights can brightly illuminate a dark path, but also have the potential to dazzle other road users.</span></figcaption><span> <i>David Caudery / Our Media</i></span></div>\n<p>No, there isn’t, but you don’t want to dazzle oncoming road users, for obvious reasons.</p>\n<p>Bike light technology has improved in leaps and bounds since the introduction of LED lights, and they now run brighter, for longer and weigh less than old dynamo-powered lamps.</p>\n<p>“If your lights cause undue dazzle or discomfort to other road users, then you’re breaking the law and the police are within their rights to ﬁne you,” says Cycling UK.</p>\n<p>In practice, though, as long as your bike has a front white and red rear light it’s rare to be stopped and ﬁned by the police, but please be considerate to other road users.</p>\n<h2>Can I fit flashing lights only?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"See.Sense Icon 3 rear light for road bikes\" title=\"See.Sense Icon3 rear light - 03\" />\n\n</div><div><figcaption><span><i></i> In general, it’s better to have a flashing rear light and leave your front one in its steady setting.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Yes, you can use only flashing lights front and rear, as long as they are both capable of emitting at least four candela (a unit of light intensity, roughly equal to 12 lumens, which is comfortably exceeded by most modern lights).</p>\n<p>The light must also only flash between 60 and 240 times per minute (1 to 4Hz).</p>\n<p>The jury is still out on whether it’s safer to run <a href=\"https://www.bikeradar.com/advice/buyers-guides/flashing-bike-lights/\">flashing or steady lights</a> – a flashing light can distort depth perception and a steady light can be easily lost in a sea of other distracting lights.</p>\n<p>The safest thing to do is run both, perhaps using a helmet-mounted light for the rear flashing LED.</p>\n<p>Also, be aware that it’s illegal (not to mention highly dangerous and irresponsible) to show a red light at the front or a white light to the rear.</p>\n<p>It is also illegal to fit triangular-shaped rear reflectors on anything other than a trailer. This could easily confuse drivers, especially in poor weather conditions.</p>\n<h2>Do my lights have to comply with UK standards to be legal?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Most lights sold in the UK by reputable dealers comply to the relevant safety standards\" title=\"/m/loader/final_group_loader/MBK_334_p116-123_group_for_loading/MBK_334_p116-123_group/\" />\n\n</div><div><figcaption><span><i></i> The situation regarding standards can be extremely confusing.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Yes, but also no.</p>\n<p>If a light is capable of emitting a steady beam, legislation demands that lights comply to BS6102/3, but few – if any – lights actually comply with these standards.</p>\n<p>However, as the amended RVLR allows for flashing lights, but BS6102/3 does not include flashing lights, approval is granted on the basis they have a power output above or equal to the aforementioned 4-candela limit and flash between 60 and 240 times per minute.</p>\n<p>A light or reflector that does not conform to BS6102/3 standards, but conforms to a corresponding standard from another EC country that is marked accordingly would be considered to comply as long as that standard provides an equivalent level of safety.</p>\n<p>If all of that sounds incredibly confusing that’s because it is. As Cycling UK states: “current UK legislation isn’t up to speed with the technological advancements [in lighting technology] or the effects of global markets”.</p>\n<h2>Can I use dynamos instead?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"The Tour de Fer comes with front and rear dynamo lighting.\" title=\"Genesis Tour de Fer 30 02\" />\n\n</div><div><figcaption><span><i></i> Front and rear dynamo lights meet safety and legal requirements.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-dynamos/\" target=\"_blank\">Dynamo-powered bike lights</a> are legal even though many stop emitting light when the bike stops. It’s fine from a legal standpoint so long as you stop on the left.</p>\n<p>Any good modern dynamo light will come with something called a standlight anyway, which provides a limited amount of extra stored power even when the dynamo isn’t running.</p>\n<h2>Do I have to use lights in daytime low-visibility conditions, such as fog?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cyclists ride along a street through dense fog in Kuwait City on January 27, 2023.\" title=\"KUWAIT-WEATHER-FOG\" />\n\n</div><div><figcaption><span><i></i> It’s not a legal requirement to ride with a rear light in the fog, but it’s definitely a good idea.</span></figcaption><span> <i>ASSER AL-ZAYYAT/AFP via Getty Images</i></span></div>\n<p>Unlike other vehicles, bicycles are not required to have lights fitted and switched on during seriously reduced visibility conditions – because lights are not required to be fitted during daylight hours.</p>\n<p>However, it is a very sensible idea to have them fitted and switched on if you hit a bank of fog, so keep a close eye on that weather forecast.</p>\n<h2>Are older bikes exempt from these laws?</h2>\n<p>Not exactly. Cycles manufactured before October 1990 can have any kind of white front lamp that is visible from a reasonable distance, and pre-October 1985 cycles don’t need pedal reflectors.</p>\n<p>Again, while it may not fit with your perfectly curated vintage aesthetic, it’s still a good idea to fit lights to your retro bike.</p>\n<h2>Can I remove the wheel reflectors that my bike came with?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Time XPRO 10 road pedals\" title=\"Time XPRO 10 road pedals\" />\n\n</div><div><figcaption><span><i></i> Clipless pedals may not come with reflectors, which are technically a legal necessity.</span></figcaption><span> <i>Our Media</i></span></div>\n<p>Yes, you may, though it will make your bike less visible at night.</p>\n<p>The Pedal Cycles Safety Regulations (PCSR) apply to the sale of new bikes in the UK, and state that every new bicycle sold must come with several extra reflectors beyond those mentioned above. However, they’re not required by the Road Vehicles Lighting Regulations to be fitted, so can be considered a ‘bonus’.</p>\n<p>These additional ones include reflectors on the sides of the wheels (clear white or coloured yellow). You can remove these if you really want to, but be aware that the bike shop you bought it from is probably unwilling to do it for you.</p>\n<p>Remember that to stay on the right side of the law, your pedals must be fitted with reflectors.</p>\n<p>This, obviously, causes a problem with most modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-pedals/\">clipless pedals</a>, which do not have provisions to fit reflectors.</p>\n<p>Technically, this means using them at night is illegal, and if you’re involved in a crash, could again count as contributory negligence.</p>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>\n<div>If you want to stay on the right side of the law Shimano, for example, offers <a href=\"https://www.sjscycles.co.uk/pedals-cleats/shimano-105-spdsl-pd5800-smpd65-reflector-unit-y40r98110/\" target=\"_blank\">aftermarket bolt-on reflectors for its SPD-SL pedals</a>. For two-bolt SPD pedal users, Shimano also offers <a href=\"https://www.sjscycles.co.uk/pedals-cleats/shimano-xtr-pdm970-smpd22-reflector-unit-y41r98070/\" target=\"_blank\">an adaptor that converts one side of the pedal into a flat pedal that includes reflectors</a>.</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n</div>\n<h2>What about other countries?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"BERLIN, GERMANY - APRIL 25: A cyclist in front of the Federal Chancellery in the Blue Hour pictured on April 25, 2019 in Berlin, Germany. (Photo by Florian Gaertner/Photothek via Getty Images)\" title=\"Exterior View Of The Federal Chancellery\" />\n\n</div><div><figcaption><span><i></i> In Germany, bike lights must meet StVZO standards.</span></figcaption><span> <i> Florian Gaertner/Photothek via Getty Images</i></span></div>\n<p>Most countries have their own laws relating to bike lights, with some more strict than others.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/stvzo-bike-lights/\">Germany’s StVZO bike light regulations</a> are some of the most prescriptive in the world and, because it’s home to many large light manufacturers (not to mention a huge cycling population), you’ll find many lights sold outside of Germany that comply.</p>\n<h2>US bike light laws</h2>\n<p>US bike light laws vary state by state. But the laws in Colorado are typical of most states.</p>\n<p>Between sunset and sunrise or in low light conditions, you must have:</p>\n<ul>\n<li>A white front headlight visible from a minimum of 500 feet away</li>\n<li>A rear red reflector visible from a minimum of 600 feet away</li>\n</ul>\n<p>Despite not being a legal requirement, it’s a good idea to attach a red rear light to your bike to maximise your visibility.</p>\n<p>As well as a front light and rear reflector or light, some states require side reflectors too.</p>\n<p>For example, Californian law insists on a white or yellow reflector on the pedal, foot or ankle visible from at least 200 feet.</p>\n<p>If your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road bike tyres</a> aren’t reflective, you’ll also need white or yellow side reflectors on the front and red side reflectors at the back.</p>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"6ace88b5fea3e48842c3f3b406b632ad869b7e67a2e5dcd1b88fe3b48c094326","category":"Cycling"}