{"title":"Individual and Community‐Level Determinants of Knowledge of Obstetric Danger Signs among Women in Southern Ethiopia: A Multi‐Level Mixed Effect Negative Binomial Analysis","link":"https://www.preprints.org/manuscript/202409.1315/v1","date":1726567020000,"content":"Introduction: One of the key strategies to achieve sustainable development goal by reduce preventable maternal deaths below 70 per 100,000 is increasing awareness about major obstetrics danger sign. Mother's awareness of obstetric danger signs in developing country is relatively low regardless of attempts trough many local and national program. It is crucial to increase women’s knowledge of obstetric danger signs through education and awareness-raising efforts. Despite its importance to reduce maternal deaths, Studies are limited only to the Northern Ethiopia. Objective: This study aimed to assess prevalence of knowledge of obstetric danger signs and associated factors among women who delivered in the last 12 months in Sidama region, Ethiopia. Methods: We conducted a community-based cross-sectional study from October to November, 2022. A multi-stage sampling procedure was utilized to select study participants. A structured and pretested questionnaire was utilized to collect data. A multilevel mixed-effects negative binomial regression model was used to control effects of clusters and confounders.Results: Out of 1,140 study participants, only 1,130 study participants took part in the study making a response rate of 99.12%. The overall prevalence of knowledge of obstetrics danger sign was estimated as 22.3% (95%CI: 18.7, 25.9). Government employed women (AIRR = 1.37; 95% CI: 1.2, 1.6), women who had access to mass media (AIRR = 1.16; 95% CI: 1.08, 1.25), women who had received model family training (AIRR = 1.15; 95% CI: 1.1, 1.25), autonomous women (AIRR = 1.15; 95% CI: 1.04, 1.25), women who had faced health problems during pregnancy (APR = 1.21; 95% CI: 1.11, 1.32) and urban women (APR = 1.22; 95% CI: 1.09, 1.62) were factors associated positively with knowledge of obstetrics danger sign. Conclusion: The prevalence of knowledge of obstetrics danger sign is found to be lower compared with the national average. Residence, mass-media exposure, model family planning, problem faced during pregnancy and women autonomy are the main predictors of knowledge of obstetrics danger sign. Public health policy makers should enhance health literacy at for focused on rural community. Awareness creation should be improved through mass media. Health providers should educate women during maternity health services to empower women for decision making process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6ae0a3f5c04b5fff352bcf7becd6260dce4920f258f3167043a70f7c1181ae00","category":"Interdisciplinary"}