{"title":"'Overcome, fight and don't give up' - Inside Elena Bris's recovery from a major crash","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-scars-frightened-me-but-i-didnt-give-up-inside-elena-briss-journey-to-recovery","date":1687862512000,"content":"\n      <p><em>*Produced in association with Pas Normal Studios*</em></p>\n<p><span>Last Tuesday I collapsed. </span><span>I had spent more than a year feeling full of light, full of energy, which was incredible and extraordinary. </span></p>\n<p><span>But something happened last week. The sun was shining, it was hot. It was 9 o'clock – I remember it well. It was like entering a hurricane, so strong, so physical, so dizzying, so incapacitating.</span></p>\n<p><span>Once again, it felt like everything was falling apart. Everything was slow, dark, tangled, as if the knot had never dissolved. I was scared to death that I had lost the lightness and the clarity of mind. I was afraid of going back, scared of the old fear.</span></p>\n<p><span>But I stopped, I breathed and I realised I could never go back because now I knew something important: if it happens once, can happen again.</span></p>\n<p><span>That's what I clung to with all my might, like someone who clings to one of those mechanical bulls, refusing to admit defeat, so as not to fall. It’s like when you are almost on the ground and yet you're still holding on to the rope waiting, knowing that you just have to hold on and not give in because soon you'll regain your composure.</span></p>\n<p><span>\"Hold on,\" I was telling myself. \"If you let yourself fall you'll never ride that bull again.\"</span></p>\n<p><span>So I opened my notebooks again. I wrote pages and pages about the brightest moments, letting the ink run, in handwriting I almost didn't understand myself, because it wasn't my hand but my head that was drawing the lines. I had never written a diary in my life, but I knew I had to keep a record of that state of mind because sooner or later I would need to return to it.</span></p>\n<p><span>I think for this to be understood I have to start at the beginning, talking about something that happened a year ago.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Denia1-LR13_1024x1024.jpg?v=1687862848\" alt /></p>\n<p><span>***</span></p>\n<p><span>In February last year I moved to a house my family has on the coast, close to Valencia. For years it has been a very special place where I don't need anything else than to breathe the smell of the pine trees. The objective was simple, I would work from there and cycle for as many hours as I wanted. A seamless plan.</span></p>\n<p><span>However, I didn't enjoy myself. I didn't feel like going out or training or going for a walk or going down to the beach. The sun was shining outside and that almost made me feel worse. I felt guilty for not knowing how to enjoy what I had. I was struggling at work, I had no ideas. Where had my creativity gone?</span></p>\n<p><span>Not long after, I decided to go back to Madrid. It rained. One day after another it rained. I regretted having wasted those days of perfect sunshine, of warmth, the old story of the lost opportunity. One afternoon, though, the skies cleared and a kind of urgency took over my body. My drowsiness left me and in its place a certain clarity came to me, an inertia to make the most of the two hours of the day that remained until sunset. </span></p>\n<p><span>So I went out, up the street leading to the first open road, through one set of traffic lights and then another.</span></p>\n<p><span>Five minutes later I was lying on the tarmac, I was trying to stand up but I couldn't. A woman's voice told me that the ambulance was coming. \"No, no, no, no\", I was regretting everything. \"Who told me to go out? I was done for the day, who told me to go out?\"</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cures-dependency-LR36_1024x1024.jpg?v=1687862963\" alt /></p>\n<p><span>A few hours later – it seemed like days – I heard: \"Your pelvis is broken, your hip is shattered, you will never ride a bike again and you will walk with difficulty\". </span></p>\n<p><span>I had lost consciousness. This isn’t real. How was I going to stand it? I had lived through really bad things, very painful losses in the family, but I had always had the feeling that if something like this happened, I wouldn't be capable of coping with it. </span></p>\n<p><span>But a while later, something changed in my head. Two ideas began to emerge in my mind, clear and corporeal. The first one was that nothing bad could happen because my mother would be with me, I would go home with her and she would take care of me. The second one was Fabio Jakobsen.</span></p>\n<p><span>Fabio Jakobsen. I remembered the brutal accident that shattered the Dutchman, that brought him to the very brink of death and left with not one of his bones whole. I remembered that less than a year later he was riding again, struggling, but he was riding. I remembered how a few months later he started racing and winning. I wasn't Jakobsen, nor did I care. But if he, hopeless as he may have once felt, had been able to come back, I felt like, one day, I could get back on a bike and regain the good form I had to enjoy myself again. Above all, I had to enjoy myself.</span></p>\n<p><span>I grabbed hold of this idea with surprising ease, with no need to fight against the mechanical bull. I was in the arms of this idea as if on a cloud. In spite of the doctors and my surgeon – one of the most prestigious in that speciality: “you won't come back the same, it's impossible with that damage” he said. But I did not give up.</span></p>\n<p><span>A week later I was operated on. Five hours later I woke up and saw their faces: the surgeons looked different, they came out of the operation happy and I knew then that I was okay. I would have to work hard, but I had already won.</span></p>\n<p><span>After that, several months in a wheelchair and then some more months on crutches awaited me. No summer cycling, no forty-degree mountain passes, no hot air or sun burning my arms. How much I loved those feelings. I thought that maybe in November I could get back on a bike and maybe a little earlier I could get on the turbo trainer.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Rollers-therapy-LR26_1024x1024.jpg?v=1687535347\" alt /></span></p>\n<p><span>I remembered how hard the lockdown period was. I had anxiety, blockage, and claustrophobia. My disorders, of which I have several, were accentuated. </span></p>\n<p><span>However, when I look back now to the case at hand and I see myself in a wheelchair, unable to do anything for myself, I have the feeling that it was the happiest time of the last few years. That dead time was the most alive.</span></p>\n<p>I’m a person that never lets anyone help me, not even prepare me a single meal. I’m someone that thinks that I need to do everything because I can do it faster, in my way and better. But back then, I was getting undressed in front of my mother so she could help me to take a shower. I trusted her with every detail of my daily life. I just had to sit quietly waiting. </p>\n<p><span>My anxiety turned into balm, my heart rate dropped, my breathing calmed and that mental tangle was gone. There was no disorder anymore, the one that has been a part of me for 15 years. </span></p>\n<p><span>So I started to write. I knew my anxiety would come back one day, so I wanted to leave testimony of all the good things that were happening to me, so that my head would never be able to say that it had all been a dream.</span></p>\n<p><span>I worked every day, I moved my leg, I repeated fictitious movements. The leg didn't move but I worked on the order of my brain. Soon my leg began to move, then my knee, then my hip. Watching it was painful, but I moved anyway and recorded myself: \"Mum, record me doing this\". \"Mummy look, record me, record me\".  How patient she was. How much I loved her, how much I love her now and how much I am afraid of losing her.</span></p>\n<p><span>I kept working and kept moving. The scars gave me a few problems and I had to go to the hospital every day, but I didn't give up. </span></p>\n<p>***</p>\n<p><span>My recovery has been amazing, my doctor keeps telling me it is not normal and I am proud. My sister (a great physiotherapist) is proud, and that is perhaps what touches me the most. I never gave up, I never stopped working. </span></p>\n<p><span>In July I was already on the turbo trainer. In August I took the bike out for the first time and in September I could already do two to three hour rides. The support and advice of David Barranco, my coach, has been fundamental. I put myself, I still put myself, in his hands, blinded. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Daily-ride-LR16_7ed96366-c119-4bb0-b37b-9cd30f4f2318_1024x1024.jpg?v=1687862883\" alt /></p>\n<p><span>After this experience, I want to praise public health and its workers. I received so much love from the hospital nurses and assistants. I’ve learned that people are good, even though sometimes people want to believe the opposite. I entered the hospital with a lot of fear and little by little I began to blossom again. They didn't leave me for a moment, I didn't have time to fall.</span></p>\n<p><span>I left the hospital full of energy. Those weeks changed me and gave me a strength that nourished me for many months. Today I am still fighting, I am struggling sometimes, the moments of inertia are lower and I am the one who pushes most of the time. But I want to believe that I am winning.</span></p>\n<p><span>People say that what doesn't kill makes you stronger. Forget about that, you are already lucky enough it didn't kill you.</span></p>\n<p><span>I'm the same person, I have the same shadows, I'm not stronger, I’m not wiser, but I have perspective. And this is a power I didn’t know I had. </span>Those bright days reflected in my diary remind me that I can overcome, I can fight, I don’t give up and I can ride my bike again. </p>\n<p><span>Now I still have bad days, days spent stuck in the concrete of a head which undermines itself. But I embrace that feeling, host it and tame it. And then I come out on fire, floating, the machinery full of ideas working again.</span></p>\n<p><span>Today, just one year after my crash, which came just in time to save my life, I am back enjoying myself on the bike, I am back burning my arms and breathing hot air. I am back meeting new people and being thankful for every minute I spend in the great outdoors.</span></p>\n<p><span>Because there is something I know now</span><span><span>: how rare it is for everything in your life to go well, and how good it feels to be aware when it does.</span></span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6af4ab45756fd1c59330996127685c5586be623181d6f8e5d1b5e7433d32574d","category":"Cycling"}