{"title":"2nd Party Game Developers","link":"https://markpeak.net/2nd-party-game-developers/","date":1678980900000,"content":"<p>คำศัพท์ที่ใช้กันแพร่หลายในวงการเกมคือ 1st Party ที่หมายถึงเกมที่พัฒนาโดยสตูดิโอในเครือเจ้าของแพลตฟอร์มเอง (เช่น Sony) และ 3rd Party เกมที่พัฒนาโดยบริษัทอื่น (เช่น EA)</p>\n<p>คำถามที่มักถามกันบ่อยคือ แล้ว 2nd Party ล่ะ คืออะไร</p>\n<p>คำตอบ<a href=\"https://en.wikipedia.org/wiki/Video_game_developer#Second-party_developer\">ตามนิยาม</a>คือ บริษัทเกมที่ได้รับสัญญาว่าจ้างจากบริษัทเจ้าของแพลตฟอร์ม ให้ทำเกมลงแพลตฟอร์มนั้นๆ เพียงแพลตฟอร์มเดียว (exclusive) โดยที่บริษัทผู้รับจ้างไม่ได้เป็นบริษัทในเครือ และจบโปรเจคไปแล้วก็อาจไปรับงานแพลตฟอร์มอื่นได้</p>\n<p>คำถามถัดมาคือ ตัวอย่าง 2nd Party มีบริษัทใดบ้าง</p>\n<p>หากเราดูจากชื่อ “เจ้าของแพลตฟอร์ม” ในปัจจุบัน เหลือแค่ 3 บริษัทคือ Microsoft, Sony, Nintendo ดังนั้นการเป็น 2nd Party จึงต้องมีความสัมพันธ์กับ 3 บริษัทนี้</p>\n<h2>Nintendo</h2>\n<p>เจ้าของแพลตฟอร์มที่โดดเด่นที่สุดเรื่อง 2nd Party หนีไม่พ้น Nintendo ที่นิยมใช้วิธีจ้างบริษัทภายนอก เข้ามาทำเกมแฟรนไชส์ของตัวเอง และตัวอย่างสตูดิโอ 2nd Party ที่ยิ่งใหญ่ที่สุด (ในแง่ผลงาน) แบบไร้ข้อกังขาคือ  Game Freak ผู้สร้างเกม Pokemon ตั้งแต่ภาคแรกสุด (ลองนึกถึงจำนวนครั้งที่โลโก้ Game Freak โผล่ขึ้นมาบนหน้าจอของผู้เล่นก็ได้)</p>\n<p>Game Freak ก่อตั้งในปี 1989 ออกเกม Pokemon ภาคแรกในปี 1996 ซึ่งเกม Pokemon ทั้งหมดให้นินเทนโดจัดจำหน่าย โดยที่ Game Freak ยังถือเป็นบริษัทอิสระจนถึงทุกวันนี้ และยังมีการออกเกมอื่นนอกแพลตฟอร์มนินเทนโดอยู่บ้างประปราย เช่น Tembo the Badass Elephant (2015, Sega จัดจำหน่าย) หรือ Giga Wrecker (2017, จัดจำหน่ายโดย Rising Star Games)</p>\n<p></p>\n<p>อีกชื่อที่มีเอี่ยวกับซีรีส์ Pokemon มาคู่กัน คือ <a href=\"https://en.wikipedia.org/wiki/Creatures_(company)\">Creatures</a> หรือชื่อเดิม Ape ซึ่งก่อตั้งในปี 1995 โดยสืบทอดตำนานมาจาก  Shigesato Itoi (ผู้สร้างเกม Mother/Earthbound) นอกจากการช่วย Game Freak ทำเกมแล้ว ยังมีผลงานเกมของตัวเองเดี่ยวๆ คือ Pokemon ภาคแยกต่างๆ และ Detective Pikachu</p>\n<p>สตูดิโอที่มีสถานะคล้าย Game Freak คือ <a href=\"https://en.wikipedia.org/wiki/HAL_Laboratory\">HAL Laboratory</a> บริษัทเกมญี่ปุ่นรุ่นเก๋ากึ๊ก ก่อตั้งในปี 1980 และยังเป็นอิสระจนถึงทุกวันนี้ ชื่อบริษัทอาจไม่ดังนัก แต่ช่วยทำเกมดังหลายเกม เช่น ซีรีส์ Kirby, Super Smash Bros. สองภาคแรก และ Mother/Earthbound</p>\n<ul>\n<li>Satoru Iwata ประธานนินเทนโดผู้ล่วงลับ ก็เคยทำงานที่ HAL ก่อนย้ายมาอยู่กับนินเทนโด</li>\n<li>Masahiro Sakurai บิดาแห่งซีรีส์ Super Smash Bros. ก็เป็นลูกจ้าง HAL ก่อนแยกออกมาตั้งบริษัทเอง</li>\n</ul>\n<p>อีกสตูดิโอ 2nd Party ชื่อดังคือ Rare ที่ทำเกมให้นินเทนโดในยุค 90s หลายเกม เช่น Donkey Kong Country, Killer Instinct, GoldenEye 007 โดยแลกกับนินเทนโดเข้ามาถือหุ้นเล็กน้อย แต่สุดท้ายความสัมพันธ์ก็จบลงเมื่อ Microsoft มาซื้อ Rare ในปี 2002</p>\n<p>ในทางกลับกัน มีสตูดิโอ 2nd Party ที่นินเทนโดทำงานด้วย แล้วภายหลังไปซื้อกิจการมาเป็น 1st Party ตัวอย่างคือ <a href=\"https://en.wikipedia.org/wiki/Retro_Studios\">Retro Studios</a> ที่ทำซีรีส์ Metroid Prime (ตั้งบริษัทปี 1998, นินเทนโดซื้อหุ้นทั้งหมดปี 2002), <a href=\"https://en.wikipedia.org/wiki/Next_Level_Games\">Next Level Games</a> ที่ทำซีรีส์ Mario Striker กับ Luigi’s Mansion (ตั้งบริษัทปี 2002, นินเทนโดซื้อปี 2021)</p>\n<h2>Sony</h2>\n<p>สตูดิโอในเครือข่ายของ Sony ที่เข้าข่าย 2nd Party ชัดเจนที่สุดคือ <a href=\"https://en.wikipedia.org/wiki/Insomniac_Games\">Insomniac Games</a> ซึ่งทำเกมลง PlayStation นับตั้งแต่ก่อตั้งในปี 1996 ตัวอย่างคือเกมซีรีส์ Spyro, Ratchet &amp; Clank, Resistance หรือในยุคหลังๆ คือ Marvel’s Spider-Man</p>\n<p>Insomniac ยังมีโอกาสไปทำเกมกับค่ายอื่นๆ บ้าง เช่น Sunset Overdrive (Microsoft) แต่สุดท้ายชะตาก็กลายมาเป็น 1st Party เต็มตัวหลัง Sony ซื้อกิจการในปี 2019</p>\n<p>สตูดิโอที่มีสถานะคล้ายๆ กันคือ <a href=\"https://en.wikipedia.org/wiki/Sucker_Punch_Productions\">Sucker Punch Productions</a> ที่ทำเกม Infamous ให้ PlayStation แล้วมาโดนซื้อในปี 2011 ก่อนกลับมาดังอีกรอบด้วย Ghost of Tsushima</p>\n<h2>Microsoft</h2>\n<p>แนวทางของไมโครซอฟท์นั้นเน้นซื้อขาดเลยซะมากกว่า (คนมันรวยช่วยไม่ได้) แต่ก็มีสตูดิโอที่อาจพอเข้าข่าย 2nd Party อยู่บ้าง เช่น <a href=\"https://en.wikipedia.org/wiki/Asobo_Studio\">Asobo Studio</a> ที่ทำเกม ReCore กับ Flight Simulator เป็นเอ็กซ์คลูซีฟ แต่ในขณะเดียวกันก็มีสิทธิไปทำเกมแพลตฟอร์มอื่นด้วย เช่น A Plague Tale กับผู้จัดจำหน่ายรายอื่น</p>The post <a href=\"https://markpeak.net/2nd-party-game-developers/\">2nd Party Game Developers</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"6af56cd92108727866a85149c69cf850bf9a3a67686829ae0491992833ebed15","category":"Thai"}