{"title":"Decadal limnological changes in Lake Beseka, central Rift Valley of Ethiopia","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12445?af=R","date":1706066988000,"content":"<h2>Abstract</h2>\n<p>Lake Beseka (Metahara), formerly, an alkaline soda lake in the Central Rift Valley of Ethiopia is recently undergoing unprecedented changes. The objective of this study was to investigate the current status on the plankton composition of Lake Beseka, in relation to the lake's environmental parameters. Samples for physicochemical and biological parameters were taken twice a year during both the rainy and dry seasons at two different sites (open and shore). Temperature, pH, conductivity, dissolved oxygen, alkalinity, salinity, ammonia, silica and soluble reactive phosphate showed significant variation (<i>p</i> &lt; .05) between wet and dry seasons. The physicochemical parameters recorded during this study shows decreasing trend than the previous studies indicating the lakes ecosystem undergone fundamental changes over time. A total of 25 phytoplankton and 13 zooplankton genera were identified. The phytoplankton community of Lake Beseka had previously been dominated by <i>Arthrospira fusiformis</i>, but this time it was completely missing, and diatoms substituted for it. The decrease in pH and salinity of the lake's water could be responsible for these changes. In addition, cyclopoid copepods now predominate over zooplankton in <i>Branchionus dimidiatus</i> during periods of high salinity. Redundancy analysis showed that SRP, ammonia, nitrate and turbidity are important environmental factors that significantly influenced plankton abundance. This study provides new baseline information on the plankton composition of Lake Beseka, in relation to the lake's environmental parameters, which can be used to evaluate future community structure.</p>","author":"Hana Melese, \nHabte Jebessa Debella","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"6affe589d84714fea927d5c457996dcd7218ca98276e7339add59219f7c90a9f","category":"Environment"}