{"title":"How useful is genomic data for predicting maladaptation to future climate?","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17227?af=R","date":1711954800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e37dc9a0-f3cb-4b7f-b8b9-cff01e52c3cd/gcb17227-toc-0001-m.png\" alt=\"How useful is genomic data for predicting maladaptation to future climate?\" />\n<p>\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Methods using genomic information to forecast potential population maladaptation to climate change or new environments are becoming increasingly common, yet the lack of model validation poses serious hurdles toward their incorporation into management and policy. Here, we compare the validation of maladaptation estimates derived from two methods—Gradient Forests (GF<sub>offset</sub>) and the risk of non-adaptedness (RONA)—using exome capture pool-seq data from 35 to 39 populations across three conifer taxa: two Douglas-fir varieties and jack pine. We evaluate sensitivity of these algorithms to the source of input loci (markers selected from genotype–environment associations [GEA] or those selected at random). We validate these methods against 2- and 52-year growth and mortality measured in independent transplant experiments. Overall, we find that both methods often better predict transplant performance than climatic or geographic distances. We also find that GF<sub>offset</sub> and RONA models are surprisingly not improved using GEA candidates. Even with promising validation results, variation in model projections to future climates makes it difficult to identify the most maladapted populations using either method. Our work advances understanding of the sensitivity and applicability of these approaches, and we discuss recommendations for their future use.</p>","author":"Brandon M. Lind, \nRafael Candido‐Ribeiro, \nPooja Singh, \nMengmeng Lu, \nDragana Obreht Vidakovic, \nTom R. Booker, \nMichael C. Whitlock, \nSam Yeaman, \nNathalie Isabel, \nSally N. Aitken","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"6b016626caaf270a3f4021fdb323f988e74783d5c47b34fee200ca1e117a0e51","category":"Environment"}