{"title":"30 Effects of using different dietary standardized ileal digestible lysine plans on growth performance and carcass characteristics of grow-finish pigs from high or low breeding value boars","link":"https://academic.oup.com/jas/article/102/Supplement_2/71/7664813?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The present study aimed to evaluate the impact of using different dietary standardized ileal digestible (SID) lysine (Lys) plans on growth performance and carcass characteristics of grow-finish pigs coming from high or low breeding value boars. A total of 2,080 pigs (PIC 800 × PIC Camborough) were housed in 20 mixed sex pens (26 pigs/pen), blocked by body weight (BW), and randomly allotted in a 2 × 2 factorial arrangement with boar breeding value (high or low) and nutrition Lys plan (current SID Lys curve recommendation for PIC 800 as % of PIC 337 SID Lys curve or alternative SID Lys curve). Pigs were weaned at 21 d of age (6.1 ± 0.05 kg BW) and followed during the wean-to-finish period until reach the market slaughter weight. Pigs were fed either the current recommendation or an alternative SID Lys curve for PIC 800, in a 6 phase feeding program: phase 1 (6-11 kg; 100 vs 100%, respectively); phase 2 (11-23 kg; 97 vs 100%, respectively); phase 3 (23-45 kg; 97 vs 100%, respectively); phase 4 (45-73 kg; 97 vs 95%, respectively); phase 5 (73-102 kg; 97 vs 95%, respectively); and phase 6 (102-132 kg; 97 vs 90%, respectively). Pigs were fed isoenergetic diets. Performance and carcass traits, and removals and mortality were recorded. Data were analyzed using mixed models in R, and considering pen as the experimental unit for performance traits and individual carcasses for carcass traits. There was no evidence of interaction between boar breeding value and nutrition plan factors. Overall, high breeding value pigs had greater average daily gain (ADG; 0.84 ± 0.005 g/d) compared with low breeding value pigs (0.82 ± 0.005 kg/d; <span>P</span> &lt; 0.01), which was driven by increased average daily feed intake (ADFI; 1.92 ± 0.011 and 1.89 ± 0.011 kg/d, respectively; <span>P</span> &lt; 0.05; Table 1). Moreover, high breeding value pigs had greater hot carcass weight (HCW; 97.8 ± 1.09 kg), carcass yield (74.1 ± 0.23%), backfat thickness (16.3 ± 0.29 mm) and lower lean meat % (57.0 ± 0.21%) compared with low breeding value pigs (96.0 ± 1.09 kg; 73.7 ± 0.23 %; 15.4 ± 0.28; 57.5 ± 0.21%, respectively; <span>P</span> &lt; 0.05; Table 1). Regarding nutrition plan, no significant differences were observed for overall performance traits between pigs fed the current or alternative SID Lys curve (<span>P</span> &gt; 0.05; Table 1). Nevertheless, pigs fed the alternative SID Lys curve had heavier HCW (97.3 ± 1.09 kg) compared with pigs fed the current SID Lys curve (96.6±1.09 kg; <span>P</span> &lt; 0.05; Table 1). No significant differences were observed for overall removals and mortality by breeding value or nutrition Lys plan (<span>P</span> &gt; 0.05). In summary, grow finish pigs from high breeding value boars have an improved productive performance. PIC 800 pigs may achieve the same productive performance with lower lysine levels at the end of the grow-finish period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6b045e44171acd49727d987c11e01946be736753b0d42f08553f7406e97d0872","category":"Environment"}