{"title":"Detection of Dengue Virus 1 and Mammalian Orthoreovirus 3, with Novel Reassortments, in a South African Family Returning from Thailand, 2017","link":"https://www.preprints.org/manuscript/202408.0015/v1","date":1722503584000,"content":"In July 2017, a family of three members; a 46-year-old male, a 45-year-old female and their 8-year-old daughter, returned to South Africa from Thailand. They presented symptoms consistent with mosquito-borne diseases, including fever, headaches, severe body aches and nausea. Mosquito bites in all family members suggested recent exposure to arthropod-borne viruses. Dengue virus 1 (Genus Orthoflavivirus) was isolated (isolate no. SA397) from the serum of the 45-year-old female via intracerebral injection in neonatal mice and subsequent passage in VeroE6 cells. Phylogenetic analysis of this strain indicated close genetic identity with cosmopolitan genotype 1 DENV1 strains from Southeast Asia, assigned to major lineage K, minor lineage 1 (DENV1I_K.1), such as GZ8H (99.92%) collected in November 2018 from China and DV1I-TM19-74 isolate (99.72%) identified in Bangkok, Thailand, in 2019. Serum samples from the 46-year-old male yielded a virus isolate that could not be confirmed as DENV1, prompting unbiased metagenomic sequencing for virus identification and characterization. Illumina sequencing identified multiple segments of a Mammalian orthoreovirus (MRV), designated Human/SA395/SA/2017. Genomic and phylogenetic analysis classified Human/SA395/SA/2017 as MRV-3 and assigned a tentative genotype MRV-3d based on the S1 segment. Genomic analyses suggested Human/SA395/SA/2017 may have originated from reassortments of segments among swine, bat, and human MRVs. The closest identity of the viral attachment protein σ1 (S1) was related to a human isolate identified from Tahiti, French Polynesia, in 1960. This indicates ongoing circulation and cocirculation of Southeast Asian and Polynesian strains, but detailed knowledge is hampered by limited availability of genomic surveillance. This case represents a rare concurrent importation of two distinct viruses with different transmission routes in the same family with similar clinical presentations. It highlights the complexities of diagnosing diseases with similar sequelae in travellers returning from tropical areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6b0af13e7783b8ed5f0d1c926f228568d4f8b8772f21d0799137497676dd200a","category":"Interdisciplinary"}