{"title":"Strong Agricultural Resilience to 2022 Southern China Drought","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004243?af=R","date":1711195119000,"content":"<h2>Abstract</h2>\n<p>Meteorological drought, especially when influenced by human activities, significantly impacts agriculture. We assessed the Yangtze River Basin (YRB)’s crop ecosystem resilience during the 2022 southern China drought. Using the elasticity framework, we quantified crop Leaf Area Index (LAI) changes with meteorological factors and human activities (irrigation) in the YRB. Our study covered maize, wheat, early and late-season rice, evaluating model accuracy with and without irrigation. Results indicate high accuracy (<i>R</i>\n<sup>2</sup> &gt; 0.8, <i>p</i> &lt; 0.05) in simulating LAI changes, notably improved with irrigation. Irrigation emerged as the primary driver of LAI changes in the past two decades, except for solar radiation’s impact on maize. In 2022, irrigation crucially influenced LAI changes, particularly in rice varieties. Early-season rice and late-season rice saw over 40% contribution from irrigation, while maize and wheat responded mainly to precipitation and radiation. Overall, 2022 yields remained stable, with late-season rice showing an apparent increase. Drought timing correlated with maize, wheat, and early-season rice yields, consistent with natural patterns. Conversely, late-season rice exhibited the opposite pattern due to artificial irrigation, impacting 58% of the growing areas in 2022. The study offers insights into investigating farmland ecosystems responding to extreme droughts.</p>","author":"Yijing Cao, \nYongqiang Zhang, \nJing Tian, \nXiaojie Li, \nZixuan Tang, \nXuening Yang, \nXuanze Zhang, \nNing Ma","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"6b113fcac89ba02c3c86cfdeb55354bfa58ad27c9ece0a33c3675f8e26e2d2b4","category":"Environment"}