{"title":"The 2023 Apple Watch Series 9: What to Expect From Apple This Fall","link":"https://www.macrumors.com/guide/apple-watch-series-9/","date":1679088990000,"content":"Along with the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, the Apple Watch is one of the products that Apple has been updating on an annual basis, and it is one of the devices that we can count on seeing this fall.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/10/apple-watch-8-red.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nRumors about new Apple Watch models are often overshadowed by ‌iPhone‌ rumors, but we do get tidbits of information here and there. This guide aggregates everything we know about the Apple Watch Series 9.\r<br />\n\r<br />\n<h2>An Iterative Update</h2>\r<br />\nApple in 2022 focused its development resources on the <a href=\"https://www.macrumors.com/roundup/apple-watch-ultra/\">Apple Watch Ultra</a>, and we didn't see a slew of new features for the standard Series 8. We're expecting the same general situation this year - Apple is working on future Apple Watch technology for the larger-sized model, and rumors suggest that we're going to see smaller updates for the Series 9 with <a href=\"https://www.macrumors.com/2023/01/08/airpods-apple-watch-ipad-apple-tv-2023/\">few new features</a> at the current time.\r<br />\n\r<br />\n<h2>Processor Improvements</h2>\r<br />\nThe S8 chip in the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 8</a> is the same as the S7 chip in the Apple Watch Series 7, which offered the same performance as the S6 in the Apple Watch Series 6.\r<br />\n\r<br />\nThere have been no notable improvements to the Apple Watch processor for a few years now, so we could see an updated S9 chip with some minor performance improvements.\r<br />\n\r<br />\n<h2>Bluetooth</h2>\r<br />\nApple added Bluetooth 5.3 to the ‌Apple Watch Ultra‌, and in 2023, we could see it expanded to the Series 9. Apple has been slowly updating its product lineup with the latest Bluetooth standard.\r<br />\n\r<br />\n<h2>Battery Life</h2>\r<br />\nAny update to the processor could potentially result in small battery life improvements, though we are not counting on major updates. Apple could also use that efficiency boost for additional always on display functionality or other feature tweaks.\r<br />\n\r<br />\n<h2>Other Features</h2>\r<br />\nWith the exception of a new chip, the Series 9 is expected to offer the same feature set as the Series 8, with full details on the Series 8's capabilities <a href=\"https://www.macrumors.com/roundup/apple-watch/\">in our Apple Watch roundup</a>.\r<br />\n\r<br />\n<h2>A New Apple Watch Ultra?</h2>\r<br />\nThe ‌Apple Watch Ultra‌ is a new product in the Apple Watch lineup as of 2022, so we don't yet know if it's going to be updated on an annual basis.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/apple-watch-ultra-cyber.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWe have not heard rumors of a 2023 version of the ‌Apple Watch Ultra‌, but there are details on a 2024 model, so Apple may wait until 2024 to refresh the device.\r<br />\n\r<br />\n<h2>A New Apple Watch SE?</h2>\r<br />\nApple has not historically refreshed the <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a> annually, and there is no word on whether there will be a 2023 refresh. The SE was updated in 2022, so it is unlikely.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/apple-watch-se-yellow.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\n<h2>Future Features</h2>\r<br />\nWe don't have a whole lot to look forward to with the Apple Watch Series 9 as of yet, but there are some future technologies that Apple will add to the Apple Watch that will make for more exciting updates at a later date.\r<br />\n<ul>\r<br />\n <li><a href=\"https://www.macrumors.com/2023/01/10/apple-custom-displays-microled-apple-watch/\"><strong>MicroLED Display</strong></a> - As soon as 2024, Apple is rumored to be adopting microLED technology for the Apple Watch, using custom displays that it designs in-house, similar to how the company does chip designs. The microLED display will be used for a high-end Apple Watch, likely the ‌Apple Watch Ultra‌. MicroLED technology will bring brighter and more vibrant colors, plus improved viewing angles.</li>\r<br />\n <li><strong><a href=\"https://www.macrumors.com/2023/01/02/cheaper-airpods-and-micro-led-apple-watch-rumors/\">Larger display for Apple Watch Ultra</a></strong> - Apple is working on a new version of the ‌Apple Watch Ultra‌ with an even larger 2.1-inch display, an update that could come alongside the transition to microLED.</li>\r<br />\n <li><strong><a href=\"https://www.macrumors.com/2023/02/22/apple-blood-glucose-monitoring-technology/\">Noninvasive Blood Glucose Monitoring</a></strong> - Apple has been working on a noninvasive blood glucose monitoring function for the Apple Watch for years now, and has made enough progress that the concept is now at a point where it is functional, viable, and ready to be used in a future Apple Watch with some refinement. Noninvasive blood glucose monitoring is still years away at this point, but when it's introduced, it will mark one of the biggest updates to the Apple Watch.</li>\r<br />\n</ul>\r<br />\n<h2>Launch Date</h2>\r<br />\nApple refreshes the Apple Watch on an annual basis alongside the new ‌iPhone‌ models, so we can expect to see an Apple Watch announcement this September, followed by a launch a week or two later.<br />This article, \"<a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">The 2023 Apple Watch Series 9: What to Expect From Apple This Fall</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/the-2023-apple-watch-series-9-what-to-expect-from-apple-this-fall.2383989/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6b11aae0fa9382f83ed112e6ad825e1b6ce68569099db6e2527f9df9acfc96fd","category":"Apple"}