{"title":"Well-being of Emotional Labor Force: A Case of Healthcare Workers at a Government District Hospital in Rumphi, North Malawi","link":"https://www.preprints.org/manuscript/202406.1496/v1","date":1718943307000,"content":"This study addresses a gap in literature by comprehensively analyzing the emotional well-being of healthcare workers. Methods: The study employed an analytical cross-sectional design utilizing both qualitative and quantitative methodologies among 84 healthcare workers. Quantitative data was analyzed using STATA version 17 while qualitative data was analyzed using thematic analysis. Ethical approval was sought from the University of Livingstonia Research Ethics Committee (UNILIA-REC). Results: 88% of the participants had experienced verbal abuse; stress and anger, 87% emotional tiredness, 22% depression, and 4% physical abuse. Emotional tiredness was associated with department (p=0.004) and work demand (p=0.0047), stress and anger were associated with experience (p=0.033), department (p=0.002) and work demand (p=0.002), depression was associated with age (p=0.035), experience (p=0.025), cadre (p=0.046), staffing (p=0.005) and work demand(p=0.044), verbal abuse was associated with department (p=0.035) and physical abuse was associated with knowledge of policies (p=0.002). Being aware of emotions and controlling them was the common coping strategy used by most (26%) of the respondents. The study established that most (78%) of healthcare workers did not receive formal training on coping skills for emotional disturbances. Conclusions: Healthcare workers experience some emotional disturbances within their professional roles. There is a need for healthcare workers to be trained on how to cope with emotional disturbances.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6b1c6ad737b81c46fafcf28f4ba98e64c75758293621a2a7af82770c59503d86","category":"Interdisciplinary"}