{"title":"Belgian one-day race Danilith Nokere Koerse triples women's prize money for equality","link":"https://www.cyclist.co.uk/news/10276/danilith-nokere-koerse-prize-money","date":1637753550000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>24 Nov 2021</span></div>    </div></div><p>\nWomen's race prize pool is tripled to €18,800, now matching men's total</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/danilith.jpeg?itok=iNqnQms1\" />  </div>\n<div>\n      <p> Semi-classic race Danilith Nokere Koerse will now provide an equal prize pool for both men and women, tripling the amount women have previously received.</p>\n<p>This act makes Danilith Nokere Koerse one of the highest-paying one-day races in women's cycling, with the aim of the event being part of the Women's WorldTour for 2023.</p>\n<p>Amy Pieters (Team SD Worx) won the most recent edition of the race in March, beating BikeExchange's Grace Brown and Lisa Klein of Canyon-SRAM.</p>\n<p>Previously for the men's race, race organiser Robrecht Bothuyne said the UCI set a prize pool of €18,800. The women's race stood at €5,130.</p>\n<p>Now, winners in both the men's and women's fields will receive €7,515, with prize money running all the way down to 20th place.</p>\n<p>Bothuyne said, 'Women's cycling is becoming more and more important. The gap with the men when it comes to prize money must therefore be closed.</p>\n<p>'We also have our \"Pur Natur mountain prize\" of €1,500, which has been the same for men and women for several years.</p>\n<p>'Danilith Nokere Koerse is the one-day race with the highest prize money in women’s cycling. We also link this to our candidacy for the Women’s World Tour.'</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/reviews/9947/shimano-dura-ace-r9200-and-ultegra-r8100-shimano-finally-goes-12-speed\">Shimano Dura-Ace R9200 and Ultegra R8100: Shimano finally goes 12-speed</a></div>      <div><a href=\"/buying-guides/1671/buyers-guide-to-road-bike-groupsets\">Buyer's guide to road bike groupsets </a></div>      <div><a href=\"/shimano/1391/shimano-dura-ace-9100-groupset-review\">Shimano Dura-Ace 9100 groupset review</a></div>      <div><a href=\"/buying-guides/677/gifts-for-cyclists\">Best gifts for cyclists: presents for the cyclist in your life</a></div>    </div></div><p>\nWomen's race director Gil Steyvers added, 'As a Women's ProSeries race we already pay a decent starting fee to participating teams. It is a multiple of what teams get in lower categorised races and is also close to the starting fee for the men's teams.</p>\n<p>'Now we are stepping up our efforts to close the financial gap by rewarding the women equally for their performance. We want to strengthen our candidacy for the UCI Women's World Tour.</p>\n<p>'We are convinced that our race can be an added value in terms of sport, appearance and therefore financially. We hope the UCI will approve our candidacy for 2023.'</p>\n<p>The 2022 edition of Danilith Nokere Koerse will begin in Deinze, Belgium on the 16th of March for both men and women.</p>\n<p><em>Image credit: @NokereKoerse</em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"6b2aeef22b424e22777f20ce44c7a4ae0d2b6156b92b05bfa1ca1338fecd84d3","category":"Cycling"}