{"title":"U.S. Developers Can Now Offer Non-App Store Purchasing Option, But Apple Will Still Collect Commissions","link":"https://www.macrumors.com/2024/01/16/us-app-store-alternative-purchase-option/","date":1705443890000,"content":"Apple is making major changes to its U.S. iOS <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> policies, and developers are now able to direct customers to a non-App Store purchasing option for digital goods. Apple is allowing apps to feature a single link to a developer website that leads to an in-app purchase alternative, but Apple plans to continue to collect a 12 to 27 percent commission on content bought this way.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iOS-App-Store-General-Feature-JoeBlue.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nApple's update and the backstory that led to it are a bit complicated, but what <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> users need to know is that some apps in the U.S. storefront will soon feature a link to their website where subscriptions and other content can be purchased outside of the ‌App Store‌ in-app purchase system, likely with a discounted price.\r<br />\n\r<br />\nDevelopers who want to offer this option will need to apply for a StoreKit External Purchase Link Entitlement, as Apple has outlined in both updated ‌App Store‌ Review Guidelines and the statement of compliance submitted to the Northern California U.S. District Court. With a Link Entitlement, a developer is able to direct a user to an out-of-app purchasing mechanism using an external purchase link. From Apple's modified ‌App Store‌ rules:\r<br />\n<blockquote>Developers may apply for an entitlement to provide a link in their app to a website the developer owns or maintains responsibility for in order to purchase such items. Learn more about the entitlement. In accordance with the entitlement agreement, the link may inform users about where and how to purchase those in-app purchase items, and the fact that such items may be available for a comparatively lower price. The entitlement is limited to use only in the iOS or iPadOS App Store on the United States storefront. In all other storefronts, apps and their metadata may not include buttons, external links, or other calls to action that direct customers to purchasing mechanisms other than in-app purchase.\r<br />\n\r<br />\nIf your app engages in misleading marketing practices, scams, or fraud in relation to the entitlement, your app will be removed from the App Store and you may be removed from the Apple Developer Program.</blockquote>\r<br />\nThere are several requirements that developers need to adhere to maintain the privacy and security of the ‌App Store‌ ecosystem, and notably, Apple will collect a commission on purchases made using these Entitlement Links. Rather than 30 percent, Apple will collect a 27 percent fee on user purchases or year-one subscriptions made through the link. On the second year of a subscription, the commission fee drops to 12 percent, which is three percentage points lower than the 15 percent fee that Apple collects from second-year or longer subscriptions made through the in-app purchase system. Apps that participate in the ‌App Store‌ Small Business Program will be charged a 12 percent commission rate.\r<br />\n\r<br />\nThe commission will apply to transactions for digital goods and services that take place on a developers website within seven days after a user taps through an External Purchase Link to an external website. \r<br />\n\r<br />\nSeveral key points about Entitlement Links are listed below.\r<br />\n<ul>\r<br />\n \t<li>All links to outside purchasing methods must use the Entitlement Link system, and developers must apply and get Apple's approval.</li>\r<br />\n \t<li>Developers are permitted to have a single plain link on <strong>one</strong> screen of an app. The link can be at a sign-in screen, in user settings, or elsewhere, but it can only be in one place. The single location may not be an interstitial, modal, or pop-up.</li>\r<br />\n \t<li>The link can mention the specific price of content on a website, or that content is discounted on the website from the ‌App Store‌ price. Comparisons are allowed.</li>\r<br />\n \t<li>Links cannot be placed directly on an in-app purchase screen or in the in-app purchase flow.</li>\r<br />\n \t<li>Developers need to certify that the third-party payment service provider they are using for out-of-app purchasing meets industry standards for payment processors, and that they will offer users processes for managing subscriptions, requesting refunds, and disputing unauthorized transactions.</li>\r<br />\n \t<li>Apps that participate in Apple's Video Partner Program or News Partner Program are not eligible for Link Entitlement.</li>\r<br />\n \t<li>Apps that use the StoreKit External Purchase Link must continue to offer in-app purchases as an option.</li>\r<br />\n<li>‌App Store‌ pages are not able to include information about purchasing on a website or a link to a website.</li>\r<br />\n<li>Digital purchases that are sold on an app's website through the Entitlement Link must be available for use in that app.</li>\r<br />\n \t<li>The StoreKit External Purchase Link cannot discourage users from making in-app purchases or mimic an in-app purchase.</li>\r<br />\n \t<li>Links must open a new window in the default browser of the device, and are not able to open a web view.</li>\r<br />\n \t<li>No redirecting, intermediate links, or URL tracking parameters are allowed.</li>\r<br />\n<li>Developers are required to provide a periodic accounting of qualifying out-of-app purchases, and Apple has a right to audit developers' accounting to ensure compliance with their commission obligations and to charge interest and offset payments.</li>\r<br />\n\r<br />\n</ul>\r<br />\nThe Link Entitlement process and the ‌App Store‌ changes are applicable only in the U.S. ‌App Store‌. Apps for all other storefronts are not able to include buttons, external links, or calls to action that direct customers to alternative purchasing options.\r<br />\n\r<br />\nApple will provide an in-app warning to customers to let them know that they are leaving the ‌App Store‌ ecosystem to make a purchase on an external website and that ‌App Store‌ protections will not be available.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/apple-external-website-warning.jpg\" width=\"1200\" height=\"900\" />\r<br />\nAccording to Apple's statement filed with the court, the requirements surrounding links are aimed at minimizing \"fraud, scams, and confusion,\" while also providing developers with an opportunity to \"entice users to other platforms\" and give customers a choice between non-App Store purchasing and in-app purchases.\r<br />\n\r<br />\nThe changes today stem from Apple's 2021 legal battle with <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>. Apple won the dispute and the court did not find that Apple had violated U.S. antitrust law, but Apple was at the time ordered to remove \"anti-steering\" rules preventing developers from informing customers about alternatives to in-app purchases. That order has been on hold <a href=\"https://www.macrumors.com/2023/07/17/app-store-rule-change-epic-games-delayed/\">during the appeals process</a>, but the appeals process ended today.\r<br />\n\r<br />\nBoth Apple and ‌Epic Games‌ <a href=\"https://www.macrumors.com/2023/09/28/apple-epic-appeal-supreme-court/\">had appealed</a> to the United States Supreme Court, but the Supreme Court <a href=\"https://www.macrumors.com/2024/01/16/supreme-court-declines-to-hear-apple-vs-epic-case/\">declined to hear the case</a>. That means the initial ruling and the appeals court ruling that agreed with it are permanent, and Apple now has to comply with the part of that order that required it to change the ‌App Store‌ rules.\r<br />\n\r<br />\nThe anti-steering rule was two-pronged, requiring Apple to allow for links to in-app purchase alternatives and to allow developers to communicate with customers outside of the ‌App Store‌ through email and other contact information collected in the app. The outside communication part of the order was already satisfied with a change that Apple made to the ‌App Store‌ rules in 2021 to <a href=\"https://www.macrumors.com/2021/08/26/app-store-changes-developer-lawsuit-settlement/\">settle a class-action developer lawsuit</a>.\r<br />\n\r<br />\nApple has already been allowing developers to use communication methods like email to inform customers about payment methods available outside of iOS apps, and Apple makes it clear in its messaging today that there are no limits on developers' out-of-app communications with users. The full statements that Apple provided to the court have been obtained by <em>MacRumors</em> and can be read below. \r<br />\n\r<br />\n<div><p>   <a href=\"https://www.scribd.com/document/699388059/App-Store-VP-Matthew-Fischer-on-Apple-s-Injunction-Compliance#from_embed\">App Store VP Matthew Fischer on Apple's Injunction Compliance</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a> on Scribd</p></div>\r<br />\n\r<br />\n<div><p>   <a href=\"https://www.scribd.com/document/699388061/Apple-Notice-of-Compliance-With-UCL-Injunction#from_embed\">Apple Notice of Compliance With UCL Injunction</a> by <a href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\">MacRumors</a> on Scribd</p></div>\r<br />\n<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/16/us-app-store-alternative-purchase-option/\">U.S. Developers Can Now Offer Non-App Store Purchasing Option, But Apple Will Still Collect Commissions</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/u-s-developers-can-now-offer-non-app-store-purchasing-option-but-apple-will-still-collect-commissions.2416540/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6b2e14f00df399a81ce78e3405e330eed48c6fed8164cf777c94f4451fc5a868","category":"Apple"}