{"title":"Stage and discharge prediction from documentary time-lapse imagery","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000106","date":1713276000000,"content":"<p>by Kenneth W. Chapman, Troy E. Gilmore, Mehrube Mehrubeoglu, Christian D. Chapman, Aaron R. Mittelstet, John E. Stranzl</p>\r\n\r\nImagery from fixed, ground-based cameras is rich in qualitative and quantitative information that can improve stream discharge monitoring. For instance, time-lapse imagery may be valuable for filling data gaps when sensors fail and/or during lapses in funding for monitoring programs. In this study, we used a large image archive (&gt;40,000 images from 2012 to 2019) from a fixed, ground-based camera that is part of a documentary watershed imaging project (https://plattebasintimelapse.com/). Scalar image features were extracted from daylight images taken at one-hour intervals. The image features were fused with United States Geological Survey stage and discharge data as response variables from the site. Predictions of stage and discharge for simulated year-long data gaps (2015, 2016, and 2017 water years) were generated from Multi-layer Perceptron, Random Forest Regression, and Support Vector Regression models. A Kalman filter was applied to the predictions to remove noise. Error metrics were calculated, including Nash-Sutcliffe Efficiency (NSE) and an alternative threshold-based performance metric that accounted for seasonal runoff. NSE for the year-long gap predictions ranged from 0.63 to 0.90 for discharge and 0.47 to 0.90 for stage, with greater errors in 2016 when stream discharge during the gap period greatly exceeded discharge during the training periods. Importantly, and in contrast to gap-filling methods that do not use imagery, the high discharge conditions in 2016 could be visually (qualitatively) verified from the image data. Half-year test sets were created for 2016 to include higher discharges in the training sets, thus improving model performance. While additional machine learning algorithms and tuning parameters for selected models should be tested further, this study demonstrates the potential value of ground-based time-lapse images for filling large gaps in hydrologic time series data. Cameras dedicated for hydrologic sensing, including nighttime imagery, could further improve results.","author":"Kenneth W. Chapman","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"6b339f1e1fc6ea9ab899348ddff38f09ad8f4a1810a5429f4d5bb96fda85c6a0","category":"Environment"}