{"title":"Apple Begins Transition to Randomized Serial Numbers With Purple iPhone 12","link":"https://www.macrumors.com/2021/05/05/purple-iphone-12-randomized-serial-number/","date":1620231431000,"content":"MacRumors previously reported about Apple's <a href=\"https://www.macrumors.com/2021/03/09/apple-randomized-serial-numbers-early-2021/\">plan to switch to randomized serial numbers</a> for future products starting in early 2021, and this transition has now started with the new purple iPhone 12 model in multiple countries.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/iphone-12-preorder-purple.jpg\" />\r\n<br />\r\nWith assistance from <a href=\"https://twitter.com/zollotech\">Aaron Zollo</a>, host of the <a href=\"https://www.youtube.com/c/zollotech/videos\">YouTube channel ZolloTech</a>, we can confirm that the purple iPhone 12 released last month has a new 10-character serial number format, compared to the usual 12 characters for most other Apple products. Apple previously said its randomized serial numbers would initially be 10 characters long, so the purple iPhone 12 appears to be the first Apple product with a randomized serial number.\r\n<br />\r\n\r\n<br />\r\nThe change likely extends to the purple iPhone 12 mini, but we've yet to confirm this. On the contrary, the randomized serial number format does not appear to apply to the AirTag at this time, with multiple MacRumors editors and others we've spoken to still seeing 12-character serial numbers for the item tracking accessory. \r\n<br />\r\n\r\n<br />\r\nIt remains to be seen if the new iMac, iPad Pro, and Apple TV have randomized serial numbers when they launch in the second half of May.\r\n<br />\r\n\r\n<br />\r\nIn a memo obtained by MacRumors in March, Apple said products already shipping at that time would continue to use the company's previous serial number format, which has for years allowed customers and service providers to determine the date and location that a product was manufactured. The first three characters represent the manufacturing location, the following two characters indicate the year and week of manufacture, and the last four characters reveal a device's model, color, and storage capacity.\r\n<br />\r\n\r\n<br />\r\nThe new serial number format will consist of a randomized alphanumeric string of 8-14 characters (10 characters initially) that will no longer include manufacturing or configuration details, according to Apple's memo. Apple advised authorized resellers to <a href=\"https://www.macrumors.com/2021/04/14/apple-preapres-for-randomized-serial-numbers/\">prepare for the transition</a> to the new format ahead of its \"Spring Loaded\" event last month.\r\n<br />\r\n<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-12\">iPhone 12 (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/05/purple-iphone-12-randomized-serial-number/\">Apple Begins Transition to Randomized Serial Numbers With Purple iPhone 12</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-begins-transition-to-randomized-serial-numbers-with-purple-iphone-12.2294946/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1WCZcRJndys:57nrm-XKUAw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1WCZcRJndys:57nrm-XKUAw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/1WCZcRJndys\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6b35125a42927ac4a2da724b4849aad0a1ee77b1d2eb9869bb11df44b08de881","category":"Apple"}