{"title":"Linux Foundation says companies are desperate for open source talent","link":"https://arstechnica.com/?p=1797172","date":1632261926000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/certification-800x457.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/certification.png\">Enlarge</a> <span>/</span> It probably shouldn't be considered \"surprising\" when a Linux certification entity reports that Linux certifications are highly desirable. (credit: <a href=\"https://www.linuxfoundation.org/resources/publications/open-source-jobs-report-2021/\">Linux Foundation</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Linux Foundation <a href=\"https://www.linuxfoundation.org/wp-content/uploads/LFResearch_OpenSourceJobsReport_ver5.pdf\">released</a> its 2021 Open Source Jobs Report this month, which aims to inform both sides of the IT hiring process about current trends. The report accurately foreshadows many of its conclusions in the first paragraph, saying \"the talent gap that existed before the pandemic has worsened due to an acceleration of cloud-native adoption as remote work has gone mainstream.\" In other words: job-shopping Kubernetes and AWS experts are in luck.</p>\n<p>The Foundation surveyed roughly 200 hiring managers and 750 open source professionals to find out which skills—and HR-friendly resume bullet points—are in the greatest demand. According to the report, college-degree requirements are trending down, but IT-certification requirements and/or preferences are trending up—and for the first time, \"cloud-native\" skills (such as Kubernetes management) are in higher demand than traditional Linux skills.</p>\n<p>The hiring priority shift from traditional Linux to \"cloud-native\" skill sets implies that it's becoming more possible to live and breathe containers without necessarily understanding what's inside them—but you can't have Kubernetes, Docker, or similar computing stacks without a traditional operating system beneath them. In theory, <em>any</em> traditional operating system could become the foundation of a cloud-native stack—but in practice, Linux is overwhelmingly what clouds are made of.</p></div><p><a href=\"https://arstechnica.com/?p=1797172#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1797172&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6b601c58977f8faadc9ba6e9590b4a758ee1f7dd5891c04432ba382e9fa710cd","category":"Tech"}