{"title":"INDUCER OF CBF EXPRESSION 1 promotes cold-enhanced immunity by directly activating salicylic acid signaling","link":"https://academic.oup.com/plcell/article/36/7/2587/7635906?rss=1","date":1711497600000,"content":"<span><div>Abstract</div>Cold stress affects plant immune responses, and this process may involve the salicylic acid (SA) signaling pathway. However, the underlying mechanism by which low-temperature signals coordinate with SA signaling to regulate plant immunity remains unclear. Here, we found that low temperatures enhanced the disease resistance of <span>Arabidopsis thaliana</span> against <span>Pseudomonas syringae</span> pv. <span>tomato</span> DC3000. This process required INDUCER OF CBF EXPRESSION 1 (ICE1), the core transcription factor in cold-signal cascades. ICE1 physically interacted with NONEXPRESSER OF PATHOGENESIS-RELATED GENES 1 (NPR1), the master regulator of the SA signaling pathway. Enrichment of ICE1 on the <span>PATHOGENESIS-RELATED GENE 1</span> (<span>PR1</span>) promoter and its ability to transcriptionally activate <span>PR1</span> were enhanced by NPR1. Further analyses revealed that cold stress signals cooperate with SA signals to facilitate plant immunity against pathogen attack in an ICE1-dependent manner. Cold treatment promoted interactions of NPR1 and TGACG-BINDING FACTOR 3 (TGA3) with ICE1 and increased the ability of the ICE1–TGA3 complex to transcriptionally activate <span>PR1</span>. Together, our results characterize a critical role of ICE1 as an indispensable regulatory node linking low-temperature-activated and SA-regulated immunity. Understanding this crucial role of ICE1 in coordinating multiple signals associated with immunity broadens our understanding of plant–pathogen interactions.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"6b84812d2c6aa08c13e0ed27d25e10e82efbbc5102434ff02d3727c4ce26f2c0","category":"Environment"}