{"title":"Dispersal limitation shapes distance‐decay patterns of European spiders at the continental scale","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13810?af=R","date":1710729699000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>To assess the relative relevance of dispersal limitation and species sorting as drivers of spatial turnover between spider faunas of European territories.</p>\n<h2>Location</h2>\n<p>Continental Europe.</p>\n<h2>Time period</h2>\n<p>Present.</p>\n<h2>Major taxa studied</h2>\n<p>Spiders (Order Araneae).</p>\n<h2>Methods</h2>\n<p>We analysed how distance-decay patterns differ between northern and southern Europe (broadly, territories covered vs. not covered by ice sheets during the last glacial maximum, respectively) in 15 spider families, using standardized distances to allow a direct comparison between parameters (i.e. slope and intercept) of climatic and spatial distance-decay models. Thus, we assessed North–South differences in parameters of spatial and, independently, climatic distance-decay models, and whether those differences are explained by family-specific traits related to dispersal ability.</p>\n<h2>Results</h2>\n<p>Climatic and spatial distance-decay patterns are very similar in northern Europe, where climatic and spatial distances are highly correlated. In contrast, slopes are steeper in spatial than in climatic distance-decay curves in southern Europe, where climatic and spatial distances are decoupled. Moreover, family traits related to dispersal ability explained the North–South difference in spatial distance-decay slopes, as well as the amount of nestedness-resultant dissimilarity between southern and northern spider faunas.</p>\n<h2>Main conclusions</h2>\n<p>Our results suggest that differences in beta diversity patterns between northern and southern Europe reflect the strength of dispersal limitation in spiders, which varies across families and leads to different degrees of disequilibrium with current climatic conditions depending on the taxon. Moreover, in the South of Europe, where spatial and climatic distances are uncorrelated, spatial distance-decay models are steeper and have larger explanatory power than climatic distance-decay models, which suggests that dispersal limitation is the main factor shaping current beta diversity patterns of European spiders at the continental scale.</p>","author":"Ramiro Martín‐Devasa, \nAlberto Jiménez‐Valverde, \nFabien Leprieur, \nAndrés Baselga, \nCarola Gómez‐Rodríguez","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"6b87d4ff61516e6e493a4b261ca0b9e8514d32be17ac5a03b487df250c9650b2","category":"Environment"}