{"title":"Empowering parents to optimize feeding practices with preschool children (EPO-Feeding): A study protocol for a feasibility randomized controlled trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304707","date":1717423200000,"content":"<p>by Jian Wang, Yang Cao, Xiaoxue Wei, Kirsty Winkley, Yan-Shing Chang</p>\r\nBackground <p>Parental feeding practices (PFPs) play a key role in fostering preschoolers’ dietary habits and in mitigating the risk of childhood obesity. Nevertheless, parents often employ inappropriate feeding practices, leading to children’s potential nutrition-related issues. Thus, research is needed to inform interventions that focus on optimizing feeding practices.</p> Methods <p>This protocol describes the evaluation of a novel intervention—Empowering Parents to Optimize Feeding Practices (EPO-Feeding Program). The program will be evaluated with a two-arm feasibility randomized controlled trial (RCT) in Yangzhou, China. The program includes four weekly group-based training sessions led by healthcare professionals for parents of preschool children. The intervention incorporates sessions, group discussions, motivational interviewing, and supplementary materials (e.g., key messages and educational videos) aimed at enhancing parents’ knowledge, skills, and behaviours related to feeding practices. The primary outcomes include i) implementation feasibility, primarily assessed through retention rates; and ii) program acceptability through a survey and qualitative process evaluation. Secondary outcomes encompass the potential impacts on i) PFPs, ii) parental perception of child weight (PPCW), iii) parenting sense of competence, iv) children’s eating behaviours, and v) child weight status. Quantitative analyses include descriptive estimates for evaluating the feasibility and linear mixed regression analysis for testing the potential effects. Qualitative valuation will use thematic framework analysis.</p> Discussion <p>If this study shows this program to be feasible to implement and acceptable to parents, it will be used to inform a fully powered trial to determine its effectiveness. The research will also help inform policy and practices in the context of child nutrition promotion, particularly regarding implementing group-based training sessions by healthcare providers in similar settings.</p> Trial registration <p>Clinicaltrials.gov, Protocol #NCT06181773, 20/11/2023.</p>","author":"Jian Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6b8ab3878ee8f058c650e3c3b6e2f26be831661f5cef8b92dc60c7cf1de97eda","category":"Interdisciplinary"}