{"title":"Evaluation and Projection of Population Exposure to Temperature Extremes over the Beijing–Tianjin–Hebei Region Using a High-Resolution Regional Climate Model RegCM4 Ensemble","link":"http://link.springer.com/10.1007/s00376-023-3123-5","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Temperature extremes over rapidly urbanizing regions with high population densities have been scrutinized due to their severe impacts on human safety and economics. First of all, the performance of the regional climate model RegCM4 with a hydrostatic or non-hydrostatic dynamic core in simulating seasonal temperature and temperature extremes was evaluated over the historical period of 1991–99 at a 12-km spatial resolution over China and a 3-km resolution over the Beijing–Tianjin–Hebei (JJJ) region, a typical urban agglomeration of China. Simulations of spatial distributions of temperature extremes over the JJJ region using RegCM4 with hydrostatic and non-hydrostatic cores showed high spatial correlations of more than 0.8 with the observations. Under a warming climate, temperature extremes of annual maximum daily temperature (TXx) and summer days (SU) in China and the JJJ region showed obvious increases by the end of the 21st century while there was a general reduction in frost days (FD). The ensemble of RegCM4 with different land surface components was used to examine population exposure to temperature extremes over the JJJ region. Population exposure to temperature extremes was found to decrease in 2091–99 relative to 1991–99 over the majority of the JJJ region due to the joint impacts of increases in temperature extremes over the JJJ and population decreases over the JJJ region, except for downtown areas. Furthermore, changes in population exposure to temperature extremes were mainly dominated by future population changes. Finally, we quantified changes in exposure to temperature extremes with temperature increase over the JJJ region. This study helps to provide relevant policies to respond future climate risks over the JJJ region.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"6ba3c966f36fc88cad527c8fe0629011dad13227400dc7b00177b923e29613f7","category":"Environment"}