{"title":"Nissan จับมือพาร์ทเนอร์จีนลงทุน 1 พันล้านปอนด์ ตั้งโรงงานผลิตแบต EV ในอังกฤษ","link":"https://www.blognone.com/node/123530","date":1625146163000,"content":"<div><div><div><p>Nissan ประกาศจับมือกับ Envision Group บริษัทพลังงานรายใหญ่จากจีน ร่วมกันลงทุน 1 พันล้านปอนด์หรือราว 4.4 หมื่นล้านบาทเพื่อสร้างโรงงานผลิตแบตเตอรี่สำหรับรถยนต์ไฟฟ้าที่เมือง Sunderland ประเทศอังกฤษ</p>\n<p>โปรเจ็คนี้ใช้ชื่อว่า Nissan EV36Zero จะสร้างโรงงานผลิตแบตเตอรี่ที่มีกำลังผลิต 9 กิกะวัตต์ ใกล้กับโรงงานประกอบรถยนต์ของ Nissan ที่เมือง Sunderland โดย Ashwani Gupta ซีโอโอของ Nissan ระบุว่าโรงงานใหม่นี้จะซัพพอร์ตด้านการวิจัยและพัฒนารถยนต์ในสหราชอาณาจักร รวมถึงยกระดับความสามารถของแรงงานด้วย ซึ่งแบตเตอรี่ที่จะผลิตขึ้นที่นี่จะถูกนำไปใช้ในรถยนต์ไฟฟ้าของ Nissan ถึง 100,000 คันต่อปี</p>\n<p>ในประกาศยังระบุว่าโรงงานแห่งนี้สามารถเพิ่มกำลังการผลิตเป็น 35 กิกะวัตต์ได้ด้วยเงินลงทุนราว 1.8 พันล้านปอนด์หรือราว 8 หมื่นล้านบาท</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b6112c6bfc4882a75ad9ec9977e087f8.png\" /><em>หุ่นยนต์ที่โรงงาน Nissan ในเมือง Sunderland กำลังผลิต Nissan LEAF | ภาพโดย Nissan</em></p>\n<p>ฝั่งสภาเทศบาลเมือง Sunderland ก็ตอบรับการมาลงทุนของ Nissan โดยการเตรียมสร้างโซลาร์ฟาร์มเพิ่มอีก 10 แห่ง เพื่อป้อนพลังงานสะอาด 100% ให้ Nissan และซัพพลายเออร์โดยรอบ เล็งสร้างงาน 6,200 ตำแหน่ง</p>\n<p>แบตเตอรี่เป็นชิ้นส่วนที่แพงและสำคัญที่สุดในรถยนต์ไฟฟ้า ทำให้ผู้ผลิตรถยนต์ต่างพากันหาพาร์ทเนอร์ด้านแบตเตอรี่กันอย่างจริงจัง เช่น General Motors ก็ร่วมมือกับ LG Chem ตั้งโรงงานผลิตแบตเตอรี่ในสหรัฐอเมริกา แต่ฝั่ง Tesla ใช้กลยุทธ์สร้างโรงงาน Gigafactory ผลิตแบตเตอรี่ของตัวเอง รวมถึงสั่งจาก Panasonic, LG และ CATL ด้วย</p>\n<p>รถยนต์ไฟฟ้ากำลังบูมในตลาดยุโรป โดยในปี 2020 ยอดขายรถยนต์ใหม่ในยุโรปเป็นรถยนต์ไฟฟ้าถึง 10% ทะยานจากเพียง 3.2% ในปี 2019 เป็นผลจากการอุดหนุนของรัฐบาลและกฎระเบียบด้านมลพิษที่เข้มงวดขึ้น</p>\n<p>ที่มา - <a href=\"https://asia.nikkei.com/Business/Automobiles/Nissan-to-build-1.4bn-EV-battery-plant-in-UK-with-Chinese-partner\">Nikkei Asia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nissan\">Nissan</a></div><div><a href=\"/topics/electric-car\">Electric Car</a></div><div><a href=\"/topics/united-kingdom\">United Kingdom</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6ba686d3ad34ce381786fcc50a627ea17d55d4ced8f25d862378890c65d138f8","category":"Thai"}