{"title":"Exploration of the Defect Landscape of Aragonite CaCO3 at the Atomic Scale","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.982/7720234?rss=1","date":1721779200000,"content":"<span>Aragonite, which is a metastable crystalline polymorph of CaCO<sub>3</sub>, is the main component of nacre (approximately 95% of the total volume). As a representative natural material, nacre exhibits excellent penetration resistance and the unusual combination of mechanical strength and toughness, three orders of magnitude higher toughness and two times higher mechanical strength compared to the main constitute of aragonite [<a href=\"#ozae044.982-B1\">1</a>]. Although the unusual mechanical properties of natural materials are mainly ascribed to their hierarchical microstructures [<a href=\"#ozae044.982-B2\">2</a>], it is well recognized that mechanical properties of composites are a result of the highly coordinated deformation mechanisms synergistically working in the characteristic microstructures at multiple length scales. Although previous studies mainly focus on the deformation behavior within its brick-and-mortar-like microstructure at the micrometer scale, simulation results show that overall toughness of such hierarchical materials will increase by one order of magnitude, and the fracture toughness of the lowest-level structure is increased by approximately a factor of two to three [<a href=\"#ozae044.982-B3\">3</a>]. Thus, accurate understanding of the deformation mechanisms within aragonite at the smaller length scale (nano- through the atomic scale) is essential to appreciate the synergistic effect. To achieve this, atomic scale insights of various crystal defects within nacre is a prerequisite.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"6ba8a1f9377b8263261f90e1d943cd72649aa85098d121ce8ce76d3b72da3d74","category":"Environment"}