{"title":"Increased α-ketoglutarate links the C3–C4 intermediate state to C4 photosynthesis in the genus Flaveria","link":"https://academic.oup.com/plphys/article/195/1/291/7611674?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>As a complex trait, C<sub>4</sub> photosynthesis has multiple independent origins in evolution. Phylogenetic evidence and theoretical analysis suggest that C<sub>2</sub> photosynthesis, which is driven by glycine decarboxylation in the bundle sheath cell, may function as a bridge from C<sub>3</sub> to C<sub>4</sub> photosynthesis. However, the exact molecular mechanism underlying the transition between C<sub>2</sub> photosynthesis to C<sub>4</sub> photosynthesis remains elusive. Here, we provide evidence suggesting a role of higher α-ketoglutarate (AKG) concentration during this transition. Metabolomic data of 12 <span>Flaveria</span> species, including multiple photosynthetic types, show that AKG concentration initially increased in the C<sub>3</sub>–C<sub>4</sub> intermediate with a further increase in C<sub>4</sub> species. Petiole feeding of AKG increases the concentrations of C<sub>4</sub>-related metabolites in C<sub>3</sub>–C<sub>4</sub> and C<sub>4</sub> species but not the activity of C<sub>4</sub>-related enzymes. Sequence analysis shows that glutamate synthase (Fd-GOGAT), which catalyzes the generation of glutamate using AKG, was under strong positive selection during the evolution of C<sub>4</sub> photosynthesis. Simulations with a constraint-based model for C<sub>3</sub>–C<sub>4</sub> intermediate further show that decreasing the activity of Fd-GOGAT facilitated the transition from a C<sub>2</sub>-dominant to a C<sub>4</sub>-dominant CO<sub>2</sub> concentrating mechanism. All these results provide insight into the mechanistic switch from C<sub>3</sub>–C<sub>4</sub> intermediate to C<sub>4</sub> photosynthesis.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"6bb2c2b5632ed4c825c973aef373f49001bbc8464a7aef42fa8b9f0adf18e2e1","category":"Environment"}