{"title":"Functionalizing Thiosemicarbazones for Covalent Immobilization on Nanoparticles","link":"https://www.preprints.org/manuscript/202406.0006/v1","date":1717462365000,"content":"The use of thiosemicarbazones (TSCs) as ligands for the functionalization of nanoparticles (NP) for various purposes, such as the covalent immobilization is fueled by their modular character (thiosemicarbazides + carbonyl compound), allowing enormously broad variation of up to four substituents on the main R1R2C=N(1)–NH–C(S)–N(4)R3R4 core. For R1 and R2 we introduced di-2-pyridyl ketone for the coordination of metals and 9-anthraldehyde for luminescence. R3 and R4 substituents were varied for various purposes. Amino acids were functionalized at the N4 position to [R1R2TSC–spacer–amino acid] conjugates for future peptide conjugation or for direct anchoring to NP via their carboxylic function. Further direct NP anchoring functions such as phosphonic acid (OP(OH)2), glucose, o-hydroquinone, OH, and thiol (SH) were introduced with or without separation through hydrocarbon spacer units such as phenyl, cyclohexyl, benzyl, ethyl and methyl in [R1R2TSC–spacer–anchor group] conjugates. [R1R2TSC–spacer–end group] conjugates including OH, S-Bn (Bn = benzyl), NH-Boc (Boc = tert-butyloxycarbonyl), COOtBu, or N3 end groups were produced for the facile formation of amide, ester, or triazine conjugates through click chemistry. The synthesis of the thiosemicarbazides H2NH–C(S)–NR3R4 starting from amines, including amino acids, SCCl2 or CS2, and hydrazine and their condensation with dipyridyl ketone and anthraldehyde lead finally to 34 new TSC derivatives. They were synthesized in up to six steps with overall yields ranging from 10 to 85% and were characterized by a combination of elemental analyses, mass spectrometry, and magnetic nuclear resonance spectroscopy. UV-vis absorption and photoluminescence spectroscopy allowed to easily trace the dipyridyl imine and anthracene chromophores.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6bc00deb62ae7609dd08cdfe4fed979680cc93d94e1cbb97141ffd40fb0d5fd4","category":"Interdisciplinary"}