{"title":"Spawning Redd Habitat Use and Selection by Invasive Brown Trout (Salmo trutta) Along a Longitudinal Gradient in a Headwater Stream","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4389?af=R","date":1728121452000,"content":"<h2>ABSTRACT</h2>\n<p>As stream habitats change from upstream to downstream, choice of spawning redd sites by brown trout may shift as habitat availability changes. In a previous study, we examined the importance of overhead cover or shade in redd site selection. Here, we examined spawning site habitat use and selection by brown trout by assessing physical characteristics at redd sites in a 4.8-km reach of Garvin Brook (southeastern Minnesota, USA) during each of five spawning seasons, 2016–2020. We measured redd dimensions, water depths, and current velocities, and compared these among four separate sections (900–1900 m in length) of the stream. We also assessed available habitats within each section to examine possible selection of habitats by spawning trout, plus quantified the size distribution of gravel substrate at redd sites within two stream sections. Habitat availability varied dramatically among stream sections. After analyzing 1844 redds from the five spawning seasons, brown trout displayed strong selection for water depths between 10 and 29 cm and current velocities between 10 and 49 cm/s. Preferred/selected water depths and current velocities increased by 7 cm and 10 cm/s, respectively, between upstream and downstream sections. All redds were located in gravel/cobble substrates, with variations in size distributions of gravels not correlated to redd dimensions or any measured habitat variable. Spawning site preferences of brown trout can change along a stream reach of moderate length, likely in relation to changing availability of various combinations of water depth, velocity, substrate, available cover, and trout abundance.</p>","author":"Neal D. Mundahl, \nAvery C. Schnaser, \nSilas Bergen","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"6bc6fed7b3ccb6694911a17e5f5b973671a8ad275a7665670ae734cfa7de4d46","category":"Environment"}