{"title":"Driver-to-Driver Communication Skills: Contributing Factors to Traffic Accidents on South African Roads?","link":"https://www.preprints.org/manuscript/202405.2109/v1","date":1717136190000,"content":"Road traffic accidents are associated with different factors, such as non-signalized road networks, inexperienced drivers, lack of communication skills, distraction, and visual or cognitive impairment of road users, which have led to this increase in traffic accidents. Understanding these factors in alignment with road user communication skills can provide solutions that can reduce traffic fatalities. Road users’ communication is predominantly formal in nature, but informal means of communication also exist but are not given proper attention during the driving training and licence testing processes. Therefore, this study investigated communication skills between drivers as a factor contributing to traffic accidents in South African cities. Consequently, 16 traffic scenarios of communication between drivers were simulated using PTV Vissim and Blender software, and a semistructured interview questionnaire was used to collect data from South African road users. The questionnaire was further used to evaluate the confidence level of road users concerning informal communication. The data were analysed via regression analysis to establish the relationship between traffic accidents and miscommunication between drivers. The information gathered and analysed from this study helps to understand the informal communication types between drivers and establish where communication loss exists, which ultimately leads to a traffic accident. The results also show that misinterpretation of communication signals can present the possibility of traffic safety risk.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6bd598fe000c4b452ba793530a036ab1506204b65909bdfeb26e8c49e4147cf2","category":"Interdisciplinary"}