{"title":"437 Fetal Programming in Sheep: Epigenetic modifications in offspring from poorly nourished dams","link":"https://academic.oup.com/jas/article/102/Supplement_3/103/7757345?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Poor maternal nutrition (restricted- and over-feeding) during gestation can negatively impact the efficiency of livestock production by generating offspring with decreased muscle mass, increased adiposity, and impaired metabolism. The mechanisms behind these altered phenotypes are not well-characterized. The effects of poor maternal nutrition during gestation on offspring growth and development begin in utero and contribute to metabolic dysregulation of offspring into maturity and across subsequent generations, demonstrating long-term negative effects on the livestock. Fetal programming results in epigenetic modifications that can involve changes in offspring gene expression and downstream function, with no alteration on the DNA sequence. Using a sheep model of poor maternal nutrition, we have previously shown that F1 offspring from restricted- and over-fed dams are smaller at 10 mo of age relative to offspring from control-fed dams. Additionally, we observed that this phenotype persisted in the F2 offspring from restricted-fed granddams, while F2 offspring from over- and control-fed granddams were of similar body weight. We have recently demonstrated that F1 offspring from poorly nourished ewes have differential methylation patterns and altered gene expression in liver tissue demonstrating a potential mechanism that contributes to persistent altered growth. We have also begun evaluating the effects of maternal nutrient restriction on the development of fetal small intestine, a key facilitator of nutrient transport. Poor maternal nutrition during gestation alters development of offspring small intestine and further understanding of developmental programming in key metabolic tissues can aid in the development of nutritional strategies to improve efficiency of livestock production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6be17c7c1c4088b59ad19830619c538bbdcb7fa75d8be4e365ee6e723164fecf","category":"Environment"}