{"title":"Unearthed touchscreen iMac G3 prototype evokes a very different era of Apple","link":"https://arstechnica.com/?p=1967015","date":1694457689000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/imac_touchscreen-800x403.jpg\" alt=\"Hand touching Apple logo squares to try and match colors of the G3\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/imac_touchscreen-scaled.jpg\">Enlarge</a> <span>/</span> It only cost Michael MJD nearly $1,800, plus a replacement display controller, to get to the point where he could play the memory game on a classic iMac. (credit: Michael MJD / YouTube)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Two remarkable things appear in <a href=\"https://www.youtube.com/watch?v=oZGswRH4wbM\">a recent Michael MJD video</a>. One is an iMac G3 from 1999 that responds to not just touchscreen taps and drags, but also touch pressure. The other is a sticker on the side of the Strawberry tray-loading iMac, indicating that it was an \"Engineering Prototype\" from Elo, a company that was an official \"Value Added Reseller\" for Apple products.</p>\n<p>The first iMac's release was <a href=\"https://www.cnn.com/style/apple-imac-g3-25th-anniversary/index.html\">25 years ago last month</a>. The device was a breakthrough on many levels. The transparent brightly colored plastic, the streamlined shape with rounded corners, and the bold-for-the-time choice to forgo floppy drives and myriad other PC ports made the G3 a style icon, to the point where the G3 is <a href=\"https://www.moma.org/collection/works/82133?artist_id=22559&amp;page=1&amp;sov_referrer=artist\">part of the Museum of Modern Art's permanent collection</a>. It rebuilt and fortified Apple's position in the tech landscape. And, not for nothing, it kicked off an <a href=\"https://www.reddit.com/r/Zillennials/comments/hlu6gw/anyone_remember_the_huge_transparent_trend_of_the/\">era-defining surge in transparent design</a>.</p>\n<div><div></div><p>Elo's touchscreen Mac was meant to work as a kiosk but survived until today to become a remarkable oddity. </p></div>\n<p>The iMac G3 heralded some of Apple's future strategies and focus, but the company and its business model contained many aspects of an earlier era. Elo, a company that continues to make <a href=\"https://www.elotouch.com/\">touchscreens for point-of-sale systems</a> and other applications, turned some iMacs into touchscreen kiosks, with Apple's approval as a \"Value Added Reseller.\" As Michael MJD points out in his video, the iMac made sense as a good-looking computer you could park on a surface and allow people to manipulate without a keyboard or mouse. What's more, Elo was only one of three known companies offering this kind of third-party touchscreen conversion.</p></div><p><a href=\"https://arstechnica.com/?p=1967015#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967015&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6be25274adce2839421e190db607251e43b8f6ab12f3722979a52cfa274f482d","category":"Tech"}