{"title":"PSXII-27 Effects of different doses of aflatoxin B1 on the ruminal fermentation parameters and microbial populations of goats","link":"https://academic.oup.com/jas/article/102/Supplement_3/580/7757516?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Aflatoxin B<sub>1</sub> (AFB<sub>1</sub>) in feed is posing a serious threat to animal health and performance. This study investigated the ruminal fermentation parameters and microbial populations of goats in response to different doses of AFB<sub>1</sub>. Saanen goats = 18) were randomly divided into three groups: basal diet group (CON), basal diet with the addition of 50 µg/kg AFB<sub>1</sub> (LD), and basal diet with the addition of 500 µg/kg AFB<sub>1</sub> (HD). The feeding experiment lasted for 14 d and all goats were housed in individual pens. Ruminal volatile fatty acids (VFAs) of different groups were detected by gas chromatography techniques and metagenomic techniques were applied to analyze the rumen microbiome. Results showed that the ruminal pH, the concentration of acetate, propionate, and total VFAs was decreased quadratically (<span>P</span> &lt; 0.01) with increasing AFB<sub>1</sub> levels. The concentration of butyrate was decreased linearly (<span>P</span> &lt; 0.05) with greater AFB<sub>1</sub> levels (Table 1). At the phylum level, the relative abundance of Chytridiomycota, Ascomycota, and Mucoromycota were less (<span>P</span> &lt; 0.05) in the HD group (Table 1). At the genus level, the relative abundance of <span>Neocallimastix</span> was less (<span>P</span> &lt; 0.05) in the HD group, while the relative abundance of <span>Bacteroides</span> was greater (<span>P</span> &lt; 0.05) in the HD group. KEGG analysis revealed that the carbohydrate metabolism pathway was enriched in LD group (<span>P</span> &lt; 0.05); folding, sorting and degradation, cell growth and death, signal transduction, and transport and catabolism were enriched in CON group (<span>P</span> &lt; 0.05); whereas global and overview maps, metabolism of other amino acids, amino acid metabolism, and nucleotide metabolism were represented more abundantly (<span>P</span> &lt; 0.05) in HD group Table 2). Lastly, annotation using the CAZy database revealed that most enzymes were classified as glycoside hydrolases (GH, 40.1%), followed by glycosyltransferases (GT, 29.1%), carbohydrate esterases (CE, 13.8%), and carbohydrate-binding modules (CBM, 12.5%). CBM family 56 and GH family 94 were more (<span>P</span> &lt; 0.05) abundant in LD group. GH family 30 and GH family 74 were more (<span>P</span> &lt; 0.05) abundant in HD group, while 7 CAZymes (GT92, GT20, CE7, GT32, GT35, GT57, and GT50) were more (<span>P</span> &lt; 0.05) abundant in the CON group. This study demonstrates that AFB<sub>1</sub> could induce modifications in the microbiota profile, impact the degradation of carbohydrates and result in diminished concentrations of VFAs. This ultimately hinders both digestibility and average daily gain of the goats. This study provides valuable insights into the microbial and metabolic changes occurring in the rumen in response to AFB<sub>1</sub> exposure, contributing to a better understanding of the underlying mechanisms leading to the observed physiological effects in goats. Further exploration of these metabolic pathways could aid in the development of targeted strategies to mitigate the negative impacts of AFB<sub>1</sub> on rumen health and animal performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6be63a08b905a768ecca75d2d56c57458fffd638068aad4bd66cdd4a2ac5930a","category":"Environment"}