{"title":"Prediction of Greenhouse Microclimatic Parameters Using Building Transient Simulation and Artificial Neutral Networks","link":"https://www.preprints.org/manuscript/202403.1333/v1","date":1711088792000,"content":"The aim of this study is to develop an African Neutral Network (ANN) model for predicting temperature and relative humidity in the greenhouse during the calendar year. Input data are ambient temperature and relative humidity outside of the greenhouse chosen for a typical meteorological year for the location of the object and the values of temperature and relative humidity of the air in the greenhouse, obtained as a result of a TRNSYS dynamic simulation of the thermal load of the facility. The goal was to show that our ANN model is capable of making predictions over extended time period. The TRNSYS model was created on a real object, taking into account all relevant parameters, in order to describe the dynamic behavior of the object as good as possible. The ANN model is formed of 3 layers, where the number of neurons in the hidden layer is obtained by training different types in order to reach the optimal number of neurons, and the values of the learning rate and epochs are also varied. The activation functions were respectively the hyperbolic tangent in the hidden layer and the linear function in the output layer. The Root Mean Square Error (RMSE), Mean Absolute Error (MAE) and Correlation Coefficient were chosen as the statistical criteria for measuring of the network performance. MAE and RMSE showed that the model with 6 neurons in the hidden layer gave the best results of data prediction in relation to the input data. Statistical analysis of output shows that, the RMSE and Mean Absolute Error (MAE) between the measured and predicted temperature was 0.3166 °C and 0.1002°, and the relative humidity RMSE and MAE was 5.9% and 3.4%, respectively, which can satisfy the demand of greenhouse climate control. The results of the study showed that the model can be used with satisfactory accuracy to predict the parameters of the internal environment, in relation to the complex simulation of the thermal load of the object.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6bed8f2739355bd652ee224b92bafbd110864af59b557cd100306864ce1ce212","category":"Interdisciplinary"}