{"title":"Sociodemographic, clinical characteristics, and treatment patterns of endometrial cancer cases in Puerto Rico during the period 2009 to 2015: A retrospective study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302253","date":1714658400000,"content":"<p>by Yisel Pagán Santana, Maira Castañeda Ávila, Ruth Ríos Motta, Karen J. Ortiz Ortiz</p>\r\nBackground <p>Over the past decades, the rising incidence rates of endometrial cancer have made it a significant public health concern for women worldwide. Treatment strategies for endometrial cancer vary based on several factors such as stage, histology, the patient’s overall health, and preferences. However, limited amount of research on treatment patterns and potential correlations with sociodemographic characteristics among Hispanics is available. This study analyzes the treatment patterns for patients diagnosed with endometrial cancer in Puerto Rico.</p> Methods <p>A secondary database analysis was performed on endometrial cancer cases reported to the Puerto Rico Central Cancer Registry-Health Insurance Linkage Database from 2009 to 2015 (n = 2,488). The study population’s sociodemographic and clinical characteristics were described, along with an overview of the therapy options provided to patients receiving care on the island. Logistic regression models were used to evaluate the association of sociodemographic/clinical characteristics with treatment patterns stratified by risk of recurrence.</p> Results <p>In our cohort, most patients were insured through Medicaid and had a median age of 60 years. Almost 90% of patients received surgery as the first course of treatment. Surgery alone was the most common treatment for low-risk patients (80.2%). High-risk patients were more likely to receive surgery with radiotherapy and chemotherapy (24.4%). Patients with Medicare insurance were five times (HR: 4.84; 95% CI: 2.45–9.58; p &lt; 0.001) more likely to receive surgery when compared with patients insured with Medicaid. In contrast, those with private insurance were twice as likely to receive surgery (HR: 2.38; 95% CI: 1.40–4.04; <i>p</i> = 0.001) when compared to those with Medicaid.</p> Conclusion <p>These findings provide insight into the treatment patterns for endometrial cancer in Puerto Rico and highlight the importance of considering factors such as disease risk when making treatment decisions. Addressing these gaps in treatment patterns can contribute to effective management of endometrial cancer.</p>","author":"Yisel Pagán Santana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6bee0d0edc20d5d6876c741dcb7bc863e7d3ade5361f7ef93a7f01710f675c3c","category":"Interdisciplinary"}