{"title":"Optimizing Pancreatic Cancer Therapy: The Promise of Immune Stimulatory Oncolytic Viruses","link":"https://www.preprints.org/manuscript/202408.2113/v1","date":1724925658000,"content":"Pancreatic cancer presents formidable challenges due to rapid progression and resistance to conventional treatments. Oncolytic viruses (OVs) selectively infect cancer cells and cause cancer cells to lyse, releasing molecules that can be identified by the host’s immune system. Moreover, OV can carry immune-stimulatory payloads such as interleukin-12 which when delivered locally can enhance immune system-mediated tumor killing. OV’s are very well tolerated by cancer patients due to their ability to selectively target tumors without affecting surrounding normal tissues. OV’s have recently been combined with other therapies including chemotherapy and immunotherapy to improve clinical outcomes. Several OVs including adenovirus, herpes simplex viruses (HSV), vaccinia virus, parvovirus, reovirus, and measles virus have been evaluated in preclinical and clinical settings for the treatment of pancreatic cancer. We evaluated the safety and tolerability of a replication-competent oncolytic adenoviral vector carrying two suicide genes (thymidine kinase, TK; and cytosine deaminase, CD) and human interleukin-12 (hIL12) in metastatic pancreatic cancer patients in a phase 1 trial. This vector was found to be safe and well-tolerated at the highest doses tested without causing any significant adverse events (SAE). Moreover, long-term follow-up studies indicated an increase in the overall survival (OS) in subjects receiving the highest dose of the OV. Our encouraging long-term survival data provide hope for patients with advanced pancreatic cancers, a disease that has not seen a meaningful increase in OS in the last five decades. In this review article, we highlight several preclinical and clinical studies and discuss future directions for optimizing OV therapy in pancreatic cancer. We envision OV-based gene therapy to be a game changer in the near future with the advent of newer generation OVs that have higher specificity and selectivity combined with personalized treatment plans developed under AI guidance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6bf0d51e99ba65694bd196a7283e2758841ebc3196266026a4cb622df7b27edc","category":"Interdisciplinary"}