{"title":"Maximizing Green Building Efficiency: Innovations for Sustainable Constructions","link":"https://www.preprints.org/manuscript/202406.1636/v1","date":1719224391000,"content":"The construction sector is a paradigm shift into the sustainable era to solve environmental issues, combat global warming. And the reflection of this is on Green Buildings where energy savings, cost savings, occupant comfort takes priority. The idea of green building efficiency merges sophisticated technologies, creative architectural design templates, and reusable materials into the whole life cycle of a building process in order to render minimum environmental impact. The pilot project of The National Institute of Geophysics and Volcanology (INGV) - Irpinia headquarters, illustrates in this context, innovative technologies of energy transition with a photovoltaic parking with geothermal piles. The project is consistent with the concepts of Nearly Zero Energy Buildings (NZEBs), directed to a high energy performance and very low environmental impact. Incorporating geothermal piles is a major area of advancement in sustainable building ideas that use the Earth's natural heat to create an energy efficient solution in heating and cooling. Project Goals – The project aims to install emission free renewable cleaning energy cost-effective clean production and increase energy efficiency, reduce CO2 emissions and energy security. For this purpose this paper, using as a support the PVGis software, evaluates the potential produced with the photovoltaic system installed in the canopies. With the help of this analysis, it is feasible to determine the amount of electricity produced as well as the system's amortization based on the excess energy sent to the public grid. The project is regarded as creative from the standpoints of energy given the use of geothermal and photovoltaic systems, as well as from an architectural and design perspective due to the use of novel materials. This all-encompassing strategy establishes INGV as a pioneer in the promotion of environmentally friendly technologies and shows a dedication to sustainability and energy efficiency.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6bf9c6f6c682424b15ad50c4e45ccdc6cfb38228814c154eadd53bdc682c1d99","category":"Interdisciplinary"}