{"title":"Google Play dumps APKs for the more Google-controlled “Android App Bundle”","link":"https://arstechnica.com/?p=1777546","date":1625177385000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/37.jpg\" /></div>\n        <p>\n          The Android App Bundle logo.                      [credit:\n                        <a href=\"https://about.google/\">Google</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Android's app file format, the APK (Android PacKage), has been with us since the 2008 launch of Android. It's portable, easy to create since it's just a structured .zip file, and widely supported by a variety of tools. Windows 11 is even going to support the format as part of its upcoming <a href=\"https://arstechnica.com/gadgets/2021/06/microsofts-windows-subsystem-for-android-sounds-a-lot-like-chrome-os/\">Android compatibility.</a> Google, though, doesn't want APKs to be the way to publish an Android app anymore. Google's <a href=\"https://android-developers.googleblog.com/2021/06/the-future-of-android-app-bundles-is.html\">Android Developer Blog</a> recaps how, starting in August, new apps being uploaded to the Play Store will need to use the new Android App Bundles (AAB) format to distribute apps. This sounds like just the beginning, and Google says that App Bundles \"will replace the APK as the standard publishing format.\"</p>\n<p>Android App Bundles were introduced to the Android ecosystem in 2018, and I wrote a big section about them in the <a href=\"https://arstechnica.com/gadgets/2018/09/android-9-pie-thoroughly-reviewed/#h22\">Android 9 review</a>. The basic sales pitch is that Android devices have plenty of different hardware and language combinations that apps have to support, and shipping all of that code to every individual device is a waste of space. Android supports over 150 languages, <a href=\"https://developer.android.com/ndk/guides/abis\">four different</a> CPU architectures (ARMv7, ARMv8, x86, and x86_64), and several screen resolution buckets. It's common to pile all of this into a single APK (though sometimes they are split up by CPU architecture), but doing so means each device gets a lot of code and resources that are irrelevant for its specific combination of CPU, locale, and screen size. While this waste of storage space doesn't matter much on high-end phones with good Internet connections, it can be a big deal for cheaper, storage-limited devices and in places where speedy Internet is hard to come by.</p>\n<p>Google's solution is the Android App Bundle, which turns Android app distribution from a monolithic, universal APK into a collection of \"split APKs\" that can be specifically doled out by the Google Play Store for each individual device. As the name suggests, these \"Split APKs\" aren't entire apps. They're parts of an app, each targeting a specific area of change, that combine to form the final app. With App Bundles, if you have a high-resolution, ARMv8 device with a locale set to English with App Bundles, the Play Store will spit out a set of Split APKs that supports only that device type. If your friend has a low-resolution ARM v7 phone set for English and Hindi, they'll get another set of APK that supports exactly that. Google Play can generate bespoke APKs for every user, giving them only the code they need and nothing more. Google says the result is apps that are 15 percent smaller than a universal APK.</p></div><p><a href=\"https://arstechnica.com/?p=1777546#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777546&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6bfc9eca17c6c88a3c0de2a99fff0587165bb0e83eba6871bbb44af603dec730","category":"Tech"}