{"title":"Mustafa Suleyman – Inflection AI and DeepMind Cofounder","link":"https://markpeak.net/mustafa-suleyman-inflection-ai/","date":1691892899000,"content":"<p>ฟังรายการ Kara Swisher สัมภาษณ์ Mustafa Suleyman ผู้ร่วมก่อตั้ง DeepMind ที่ล่าสุดลาออกจาก Google มา<a href=\"https://www.blognone.com/node/133700\">ตั้งบริษัทใหม่ Inflection AI ร่วมกับ Reid Hoffman</a> (ผู้ร่วมก่อตั้ง LinkedIn)</p>\n<p>นานๆ ทีเราถึงเห็นคนที่เป็น co-founder ของบริษัท AI ชื่อดัง 2 บริษัท เลยมาจดประเด็นเก็บไว้สักหน่อยว่าเขามีมุมมองต่อเรื่องต่างๆ ในวงการ AI อย่างไรบ้าง</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://open.spotify.com/episode/0m1aSCrRKA8pqsnrkarT2Y\">\n\t\t\t\t\t<img src=\"https://i.scdn.co/image/ab6765630000ba8a8cbcb1cde86604c19c27c2e8\" alt=\"Inflection AI: Personalized and More &quot;Woke&quot; Than The “TruthGPT” Elon Might Make\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://open.spotify.com/episode/0m1aSCrRKA8pqsnrkarT2Y\">\n\t\t\tInflection AI: Personalized and More \"Woke\" Than The “TruthGPT” Elon Might Make\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://open.spotify.com/episode/0m1aSCrRKA8pqsnrkarT2Y\">\n\t\t\t<p>Listen to this episode from On with Kara Swisher on Spotify. After Kara and Nayeema debate the pros and cons of AI personal assistants vs. human personal assistants vs. fake personal assistants, we turn to Mustafa Suleyman, the man who co-founded DeepMind. Now, he and his co-founders Reid Hoffman and Karén Simonyan have started Inflection…</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://open.spotifycdn.com/cdn/images/favicon32.b64ecc03.png\" alt=\"Spotify\" />\t\tSpotify\t</div>\n</div>\n<p>มาตรการความปลอดภัย (guardrail) ของ AI</p>\n<ul>\n<li>ควรมีวิธีการบอกว่า “นี่คือ AI กำลังพูดอยู่นะ ไม่ใช่คน” อย่างชัดแจ้ง (explicit) เพื่อป้องกันปัญหา imitation คือ AI ปลอมตัวเป็นคน</li>\n<li>ควรมีระบบ watermark เพื่อบ่งบอกว่าคอนเทนต์นี้สร้างโดยใคร จะได้ติดตามย้อนกลับได้ (<a href=\"https://www.blognone.com/node/133829\">แนวทางนี้กูเกิลบอกว่าจะทำ</a>)</li>\n<li>ควรมีผู้ตรวจสอบอิสระ (independent third party) ทำหน้าที่เป็น red team ลองโจมตีโมเดล AI ดูว่าสำเร็จหรือไม่ ซึ่ง Inflection มีทีมนี้อยู่ แต่อยากให้เป็นมาตรฐานอุตสาหกรรมด้วย</li>\n</ul>\n<p>ความสัมพันธ์ของบริษัทสตาร์ตอัพสาย AI</p>\n<ul>\n<li>คนทำงานใน Inflection, Anthropic, DeepMind, OpenAI รู้จักกันหมด เป็นเพื่อนกันสมัยเรียน อยู่ในวงการนี้มา 10-15 ปีด้วยกัน วิธีคิดคล้ายกัน แต่แนวทางแตกต่างกันในรายละเอียด วิธีทำงานจึงต่างกัน</li>\n</ul>\n<p>อนาคตของการใช้ AI ส่วนบุคคล</p>\n<ul>\n<li>เขามองว่าโลกจะมี AI จำนวนมาก นอกจาก AI ของบริษัทใหญ่ๆ อย่าง Microsoft/Google เขามองว่าธุรกิจทุกแห่ง แบรนด์ทุกแบรนด์ บุคคลทุกคน จะมี AI ของตัวเอง คอยช่วยงานของเราเอง</li>\n<li>Inflection เลือกทำธุรกิจนี้ เรียกว่า Personal AI หรือ Pi เหมือนเป็นผู้ช่วยส่วนตัว (assistant หรือ chief of staff) คอยทำงานต่างๆ ให้เรา และคอยคุยกับ AI ของคนอื่นเพื่อเจรจาสิ่งต่างๆ แทนเรา</li>\n<li>ในโลกที่บริษัทใหญ่ๆ มี AI พยายามมานำเสนอของขายให้เรา นำเสนอโฆษณาให้เรา เราจำเป็นต้องมี AI ที่อยู่เคียงข้างเรา อยู่ฝั่งเดียวกับเรา เป็นที่ปรึกษาให้เราด้วย</li>\n<li>โมเดลธุรกิจของ Personal AI ควรเป็นการจ่ายเงิน subscription โดยตรง เพื่อพิทักษ์ผลประโยชน์ให้เราโดยไม่มีอะไรแอบแฝง จ่ายเงินแล้วมีความรับผิดชอบต่อผู้จ่าย (accountable) เราเองก็เชื่อถือ AI ได้มากขึ้นด้วย ดีกว่าโมเดล freemium ที่เชื่อถือได้ลำบากว่ามีอะไรแอบแฝงหรือไม่</li>\n<li>การแข่งขันของวงการ AI ยังจะเป็นเรื่องของรสนิยมของคำตอบด้วย แต่ละคนจะชอบรูปแบบของคำตอบแตกต่างกันไป บางคนอาจชอบ AI แนว woke หรือบางคนอาจชอบ TruthGPT ของ Elon Musk ที่เน้นเรื่องตลกสัปดน เล่นมีมตามสไตล์ผู้สร้าง</li>\n</ul>\n<p>มองเพื่อนร่วมวงการ</p>\n<ul>\n<li>DeepMind จุดเด่นคือมีทีมวิจัยที่เก่งมาก จุดอ่อนคือสนใจเรื่อง reinforcement learning ในสภาพแวดล้อมจำลองมากเกินไป ทำให้สร้างผลิตภัณฑ์ AI ในโลกจริงที่สเกลได้ไม่เก่งเท่าไร แต่<a href=\"https://www.blognone.com/node/133503\">การรวมร่าง Google DeepMind</a> น่าจะทำให้กลับมาวิ่งตามคนอื่นได้เร็ว เพราะฐานทีมวิจัยดีอยู่แล้ว</li>\n<li>Meta ใช้แนวทาง open source จะช่วยให้อุตสาหกรรมใช้งานโมเดล LLaMA แพร่หลายได้เร็วมาก และจะเป็นประโยชน์ต่อบริษัท Meta ในการสร้างนวัตกรรมได้เร็วกว่า Google/DeepMind/Microsoft</li>\n</ul>\n<p>ทิศทางของวงการ AI</p>\n<ul>\n<li>การแพร่หลายของ AI แบบ open source จะทำให้คนทั่วไปสร้าง AI ที่มีคุณภาพระดับ 85-90% ได้อย่างรวดเร็ว แต่การไปให้ถึงคุณภาพระดับ 99% นั้นยากมาก ต้องใช้ทีมวิจัย ทีมนักวิทยาศาสตร์ระดับโลก ที่เข้าถึงทรัพยากรการประมวลผลขนาดใหญ่ได้ด้วย</li>\n<li>Inflection ได้เปรียบตรงที่มีสายสัมพันธ์กับ Microsoft ทำให้เข้าถึงทรัพยากร เข้าถึงจีพียูรุ่นใหม่ๆ บน Azure ได้ ถือเป็นข้อได้เปรียบ</li>\n<li>แต่ทิศทางของโมเดล AI จะมุ่งสู่ขนาดเล็กลง มีประสิทธิผล (efficiency) มากขึ้น ตัวอย่างคือโมเดล LLM ในปี 2023 มีขนาด 3B parameter แต่คุณภาพทำได้เท่ากับ GPT-3 ที่ออกปี 2020 ขนาด 175B หรือขนาดต่างกัน 60x</li>\n<li>มองว่าจะแก้ปัญหา AI หลอน (hallucination) ในอีกไม่กี่ปีข้างหน้า หรือราวกลางปี 2025</li>\n</ul>\n<blockquote>\n<p>I stand by my claim: 95% of the time means largely eliminated by June 2025. <a href=\"https://twitter.com/GaryMarcus?ref_src=twsrc%5Etfw\">@GaryMarcus</a> <a href=\"https://t.co/GwXzugRlWR\">https://t.co/GwXzugRlWR</a> <a href=\"https://t.co/hNn6hbfnp3\">https://t.co/hNn6hbfnp3</a></p>\n<p>— Mustafa Suleyman (@mustafasuleyman) <a href=\"https://twitter.com/mustafasuleyman/status/1669481907980206081?ref_src=twsrc%5Etfw\">June 15, 2023</a></p></blockquote>\n<p></p>\n<p>AI กับการแย่งงานคน</p>\n<ul>\n<li>ทุกวันนี้ AI เก่งกว่าคนแล้วในเรื่องการแปลภาษา ในเรื่องการจดจำใบหน้า และจะเก่งขึ้นอีกเรื่อยๆ ในด้านอื่นด้วย</li>\n<li>การที่ AI เก่งกว่าคนเป็นสิ่งที่ดี และจะก่อให้เกิดการเติบโตของผลิตภาพอย่างก้าวกระโดด (greatest explosion of productivity in history) เราจะใช้ศักยภาพใหม่นี้ไปแก้ปัญหาใหญ่ๆ อย่าง climate crisis</li>\n<li>เราควรเผชิญหน้ากับภาวะนี้ด้วยความเป็นจริง ไม่มองโลกในแง่ร้ายหรือหายนะเกินไป ควรตั้งคำถามว่าเราควรทำอย่างไรเพื่อช่วยให้การเปลี่ยนผ่านนี้ราบรื่น</li>\n<li>เขามองว่าควรเก็บภาษีด้วยนโยบายก้าวหน้า (progressive taxation) เพื่อลดความเหลื่อมล้ำ เก็บภาษีคนรวยเพื่อมาชดเชยคนจน แต่ยังไม่ต้องไปถึงขั้น UBI (universal basic income) เพราะมองว่าทำได้ยาก เห็นผลไม่ชัดเจน</li>\n</ul>\n<p></p>The post <a href=\"https://markpeak.net/mustafa-suleyman-inflection-ai/\">Mustafa Suleyman – Inflection AI and DeepMind Cofounder</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"6c0af682f1b860ad5d27166c35a9581e180925ecf47e8c900282a3dbfa7451d8","category":"Thai"}