{"title":"The potential of the transformer-based survival analysis model, SurvTrace, for predicting recurrent cardiovascular events and stratifying high-risk patients with ischemic heart disease","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304423","date":1718719200000,"content":"<p>by Hiroki Shinohara, Satoshi Kodera, Yugo Nagae, Takashi Hiruma, Atsushi Kobayashi, Masataka Sato, Shinnosuke Sawano, Tatsuya Kamon, Koichi Narita, Kazutoshi Hirose, Hiroyuki Kiriyama, Akihito Saito, Mizuki Miura, Shun Minatsuki, Hironobu Kikuchi, Norifumi Takeda, Hiroshi Akazawa, Hiroyuki Morita, Issei Komuro</p>\r\nIntroduction <p>Ischemic heart disease is a leading cause of death worldwide, and its importance is increasing with the aging population. The aim of this study was to evaluate the accuracy of SurvTrace, a survival analysis model using the Transformer—a state-of-the-art deep learning method—for predicting recurrent cardiovascular events and stratifying high-risk patients. The model’s performance was compared to that of a conventional scoring system utilizing real-world data from cardiovascular patients.</p> Methods <p>This study consecutively enrolled patients who underwent percutaneous coronary intervention (PCI) at the Department of Cardiovascular Medicine, University of Tokyo Hospital, between 2005 and 2019. Each patient’s initial PCI at our hospital was designated as the index procedure, and a composite of major adverse cardiovascular events (MACE) was monitored for up to two years post-index event. Data regarding patient background, clinical presentation, medical history, medications, and perioperative complications were collected to predict MACE. The performance of two models—a conventional scoring system proposed by Wilson et al. and the Transformer-based model SurvTrace—was evaluated using Harrell’s c-index, Kaplan–Meier curves, and log-rank tests.</p> Results <p>A total of 3938 cases were included in the study, with 394 used as the test dataset and the remaining 3544 used for model training. SurvTrace exhibited a mean c-index of 0.72 (95% confidence intervals (CI): 0.69–0.76), which indicated higher prognostic accuracy compared with the conventional scoring system’s 0.64 (95% CI: 0.64–0.64). Moreover, SurvTrace demonstrated superior risk stratification ability, effectively distinguishing between the high-risk group and other risk categories in terms of event occurrence. In contrast, the conventional system only showed a significant difference between the low-risk and high-risk groups.</p> Conclusion <p>This study based on real-world cardiovascular patient data underscores the potential of the Transformer-based survival analysis model, SurvTrace, for predicting recurrent cardiovascular events and stratifying high-risk patients.</p>","author":"Hiroki Shinohara","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6c0d58863a9057bd528e892a7423ce54811f765ff90124f62182b7c6fdbe23e2","category":"Interdisciplinary"}