{"title":"Exploring the Genetic Basis of Heterosis in Calonectria spp. Resistance on Eucalypt","link":"https://www.preprints.org/manuscript/202407.0338/v1","date":1720081150000,"content":"(1) Selecting high-quality varieties with disease resistance by crossbreeding artificially is the most fundamental way to address the damage caused by Calonectria spp in eucalypt plantations. However, understanding the mechanism of the formation of disease-resistant heterosis in eucalypt is crucial for the success of crossbreeding. (2) Two eucalypt hybrids, susceptible EC333 (H1522 × unknown) and resistant EC338 (W1667 × P9060) were screened in our previous study on the infection of the isolates of Calonectria., which causes eucalypt leaf blight. RNA-Seq sequencing was performed on susceptible hybrid EC333, disease-resistant hybrid EC338 (W1667 × P9060), and their parents. A comparison was conducted between the the transcriptomic data sequenced and the reference genome of Eucalyptus grandis, and the The differential expression of genes and functional annotations between hybrids and parents was identified. (3) Gene differential expression analysis shows that there are 3912 differentially expressed genes between EC333 and EC338, with 1631 up-regulated and 2281 down-regulated. The expression trends of differential gene sets in P9060 and EC338 were similar. However, the expression trend of W1767 was opposite that of EC338. The similarity of expression levels and the advantage of stress resistance of E. pellita suggested that genes with significant differences in expression are likely to be related to disease resistance. The GSEA enrichment based on GO annotation revealed that the carbohydrate binding pathway (GO:0030246) is differentially expressed between EC338 and EC333. The gene pathway that differentially expressed between EC338 and EC333, was revealed by GSEA enrichment based on KEGG annotation, is Sesquiterpenoid and Triterpenoid biosynthesis (EGR00909). The Alternative Splicing analysis demonstrated that the AS events gene between EC338 and EC333 is LOC104426602. According to SNP analysis, EC338 has 626 more high-impact mutation loci than the male parent P9060, and 396 more than the female parent W1767, the maternal parent W1767 has 259 more mutation loci in the downstream region than EC338, while the male parent P9060 has 3107 fewer mutation loci in the downstream region than EC338. Additionally, EC338 has 9631 more mutation loci in the exon region than EC333. These findings suggested that the genetic pathways, specific gene regions, and their quantities might play crucial roles in the formation of heterosis linked to the resistance against eucalypt leaf blight. The modules were found in WGCNA, which were strongly and oppositely correlated with EC338 and EC333, such as module MEsaddlebrown is likely to be associated with leaf blight resistance. (4) The present study provides a detailed explanation of the genetic basis for the heterosis of resistance to eucalypt leaf blight, providing a basis for exploring genes related to resistance to eucalypt leaf blight.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6c104c619a1c0680afec2e14ba068b3e1b2e483a2464b53d6eca5a4bd5851fc3","category":"Interdisciplinary"}