{"title":"ทีมงาน Alan Wake 2 อธิบายเหตุผลที่ห่างภาคแรก 13 ปี ภาคนี้ใช้ระบบตัวเอก 2 คนสลับไปมา","link":"https://www.blognone.com/node/136032","date":1696248461000,"content":"<div><div><div><p>ค่ายเกมฟินแลนด์ Remedy Entertainment กำลังจะมีผลงานใหม่คือ <a href=\"https://www.blognone.com/node/135349\">เกมสยองขวัญ Alan Wake 2 วางขาย 27 ตุลาคม</a> ช่วงนี้ทีมผู้บริหารของ Remedy เริ่มเดินสายพบสื่อเพื่อโปรโมทเกม ทำให้เราได้รู้เบื้องหลังของเกมมากขึ้น</p>\n<p>Sam Lake ผู้อำนวยการฝ่ายครีเอทีฟของ Remedy ให้สัมภาษณ์ว่าเกม Alan Wake 2 ใช้เวลาห่างจากภาคแรกถึง 13 ปี (ภาคแรกออกปี 2010) มาจากปัจจัยเรื่องสภาพตลาดเกมในช่วงก่อนหน้านี้ไม่เอื้อให้ทำภาคต่อ เนื่องจากผู้จัดจำหน่ายเกมภาคแรกคือ Microsoft Game Studios หันไปสนใจเกมออนไลน์แนว live service ทำให้ Remedy เปลี่ยนทิศทางไปทำเกม Quantum Break ที่ออกในปี 2016 แทน</p>\n<p>หลังจากนั้น Remedy ไปทำเกม Control ในปี 2018 ซึ่งประสบความสำเร็จอย่างสูง และเนื้อเรื่องมีความเชื่อมโยงกับจักรวาล Alan Wake ด้วย จึงส่งผลให้<a href=\"https://www.blognone.com/node/126241\">โปรเจค Alan Wake 2 ได้ไฟเขียวให้เริ่มทำได้</a> และมี Epic Games ร่วมลงทุน-เป็นผู้จัดจำหน่ายเกมให้ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/126922d68bda6dc2e2e3b8de197751ef.jpg\" alt /></p>\n<p>การที่เกมภาค 2 ทิ้งห่างจากภาคแรกนาน 13 ปี และภาคแรกเองยอดขายก็ไม่ได้เยอะมากนัก (3.1 ล้านชุด ขายเฉพาะบน Xbox 360 และพีซี) จึงมีโอกาสสูงที่ไม่ค่อยมีคนเคยเล่นภาคแรก หรือเคยเล่นแต่ลืมเรื่องไปหมดแล้ว ทางออกของทีมออกแบบเกมจึงเป็นการเพิ่มตัวละครหลักคนที่สอง Saga Anderson เจ้าหน้าที่ FBI หญิงที่ออกตามหา Alan Wake ตัวเอกของภาคแรกอีกที</p>\n<p>การเพิ่มตัวเอกอีกคนเข้ามา ช่วยให้ผู้เล่นหน้าใหม่เข้าถึงเกมได้ง่ายขึ้น เพราะไม่ต้องโยงกับเนื้อเรื่องจากภาคแรกมากนัก และยังเป็นการสร้างมุมมองใหม่ๆ ให้ผู้เล่นเดิมด้วย</p>\n<p>เมื่อเล่นไปถึงช่วงหนึ่งในเนื้อเรื่อง ผู้เล่นสามารถสลับไปมาระหว่างตัวละครทั้งสองได้ในบางเหตุการณ์ ช่วยเพิ่มความแปลกใหม่ให้เกมเพลย์มากขึ้น ทีมของ Remedy ระบุว่าแกนหลักของภาคนี้คือ \"duality\" ความเชื่อมโยงระหว่างสองโลก และตัวละครสองคน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/07456a8eddc622ef324505c69e79e5fc.jpg\" /></p>\n<p>ของใหม่อีกอย่างในเกมภาค 2 คือ Mind Place เป็น \"ความคิด\" ในหัวของ Saga Anderson ตัวเอกคนใหม่ที่ออกสืบสวนปริศนาในเกมภาค 2 ด้วยความที่เธอเป็นเจ้าหน้าที่สืบสวน FBI ทำให้ในหัวเธอเต็มไปด้วยข้อมูลต่างๆ แปะไว้ตามฝาผนัง (case board) เหมือนกับที่เราเห็นในหนังตำรวจ ผู้เล่นสามารถนำข้อมูลต่างๆ ที่พบเจอในเกมมารวบรวมเป็นโปรไฟล์ เพื่อหาความเชื่อมโยงและแก้ปริศนาต่างๆ ในเกมได้จากหน้าจอนี้</p>\n<p>ส่วนตัว Alan Wake ตัวเอกอีกคนที่ติดอยู่ในมิติชื่อ Dark Place มีห้องคล้ายๆ กันชื่อ Writer's Room ที่มีระบบบอร์ดเนื้อเรื่อง (plot board) เขาสามารถ \"เขียน\" (rewrite) เรื่องราวของตัวเขาเองใหม่ตามความคืบหน้าของเหตุการณ์ในเรื่อง</p>\n<p>เอนจินเกมที่ Alan Wake 2 ใช้งานคือ Northlight Engine ของ Remedy เอง ซึ่งใช้กับเกม Quantum Break และ Control อยู่ก่อนแล้ว ทีมจากเว็บไซต์ VGC ลองเล่นเกมเวอร์ชันพรีวิวแล้วชมว่ากราฟิกสวยงามมาก ระดับเดียวกับ Resident Evil 4 Remake ของ Capcom</p>\n<p>บทสัมภาษณ์ฉบับเต็มอ่านได้จาก <a href=\"https://www.videogameschronicle.com/features/why-remedy-is-glad-it-took-13-years-to-make-alan-wake-2/\">VGC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/alan-wake\">Alan Wake</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/remedy-entertainment\">Remedy Entertainment</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6c23e1792b0a90578c48f879cc2a6190858d0cde676db53e5424a1ce295e9160","category":"Thai"}