{"title":"Megaselia scalaris and Senotainia tricuspis Infesting Apis mellifera: Genotyping, Detection by Quantitative PCR, and Involvement in the Transmission of Microbial Pathogens","link":"https://www.preprints.org/manuscript/202409.0085/v1","date":1725287419000,"content":"Megaselia scalaris and Senotainia tricuspis are two parasitoid flies of the honeybee Apis mellifera and are known to infest apiaries of different European and Mediterranean countries. However, their prevalence is still little known and no systematic control of their presence and countermeasures are currently adopted. To achieve a better knowledge about their distribution in apiaries, quantitative PCR (qPCR) based methods for their rapid detection directly in hive matrices were developed in this study. These were applied to samples of adult honeybees and hive debris collected in the summer season in Central Italy and Kosovo. In total 16 samples per type per region were analyzed. Both flies were detected in the two geographical contexts but more frequently in Central Italy. The positive apiaries in Central Italy were re-sampled one year later by capturing viable honeybees and isolating emerging flies after differentiation into adults. These were genotyped by sequencing regions of the mitochondrial cytochrome oxidase subunit I gene COI for M. scalaris and cytochrome B gene cytB for S. tricuspis amplified with specific primers designed in this study. Different genotypes of M. scalaris were detected and these were related to biotypes from distant nations. Some fly isolates were shown to harbor DNA or RNA of honeybee microbial pathogens. Results suggested to implement efficient control against these parasites in apiaries to limit their detrimental effects. The qPCR tests that have been developed can facilitate larger screening studies and early detection.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6c250825d71184f457660cdce84d56df3c95d54b42d3f15ea45c4daf87ce9e30","category":"Interdisciplinary"}