{"title":"Baseline assessment of the coastal elasmobranch fauna of Eastern Cabo Verde, West Africa","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4206?af=R","date":1727334000000,"content":"<h2>Abstract</h2>\n<p>An increasing onus on elasmobranch management by regional bodies has been hindered by a lack of data on abundance, distribution and fisheries, especially in data-poor areas like the eastern Atlantic Ocean. From 2015 through 2017, 204 baited remote underwater videos (BRUV) were deployed in Cabo Verde around the eastern islands of Sal, Boavista and Maio and the remote offshore reef João Valente to establish a baseline of elasmobranch abundance. Over 200 hours of footage revealed 215 individual elasmobranchs, spanning 14 species from 6 taxonomic families. The abundance of elasmobranchs was highest in Maio, the island with the smallest human population, followed by Boavista and Sal. Smaller-bodied meso-predatory species such as the common smoothhound (<i>Mustelus mustelus</i>) and the Atlantic weasel shark (<i>Paragaleus pectoralis</i>) constituted the majority of observations in Maio and Boavista. Inversely, <i>Carcharhinus</i> spp. were observed in considerably greater abundance in Sal, and there was notably lower abundance of small-bodied sharks at sites with high large-bodied Carcharhinid abundance. Species richness was consistent with abundance estimates across islands, with Boavista and Sal recording the highest species diversity, followed by Maio. Results suggest that amongst Cabo Verde's eastern islands, there exists a high relative diversity and abundance of coastal elasmobranchs compared to populations in West Africa. Nonetheless, there is evidence of exploitation of higher trophic levels species. This trend is most notable in the decreasing abundance of Carcharhinids with increasing proximity to the capital city Praia, suggesting that fishing efforts from the capital are negatively affecting the abundance of large-bodied, higher-trophic predators.</p>","author":"Zeddy T. A. Seymour, \nZe Luis Monteiro, \nAngelito Monteiro, \nIvy E. Baremore, \nFrancesco Garzon, \nRachel T. Graham","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"6c27c600e5b06f1fa556054a66db04a2f43df25fa34d934184cb043b6af7b013","category":"Environment"}