{"title":"Neogene History of the Amazonian Flora: A Perspective Based on Geological, Palynological, and Molecular Phylogenetic Data","link":"https://new.annurev.org/content/journals/10.1146/annurev-earth-081522-090454?TRACK=RSS","date":1685491200000,"content":"<div><p>The Amazon hosts one of the largest and richest rainforests in the world, but its origins remain debated. Growing evidence suggests that geodiversity and geological history played essential roles in shaping the Amazonian flora. Here we summarize the geo-climatic history of the Amazon and review paleopalynological records and time-calibrated phylogenies to evaluate the response of plants to environmental change. The Neogene fossil record suggests major sequential changes in plant composition and an overall decline in diversity. Phylogenies of eight Amazonian plant clades paint a mixed picture, with the diversification of most groups best explained by constant speciation rates through time, while others indicate clade-specific increases or decreases correlated with climatic cooling or increasing Andean elevation. Overall, the Amazon forest seems to represent a museum of diversity with a high potential for biological diversification through time. To fully understand how the Amazon got its modern biodiversity, further multidisciplinary studies conducted within a multimillion-year perspective are needed.\n</p><ul>\n<li><span>▪ \n</span>The history of the Amazon rainforest goes back to the beginning of the Cenozoic (66 Ma) and was driven by climate and geological forces.\n</li>\n<li><span>▪ \n</span>In the early Neogene (23–13.8 Ma), a large wetland developed with episodic estuarine conditions and vegetation ranging from mangroves to terra firme forest.\n</li>\n<li><span>▪ \n</span>In the late Neogene (13.8–2.6 Ma), the Amazon changed into a fluvial landscape with a less diverse and more open forest, although the details of this transition remain to be resolved.\n</li>\n<li><span>▪ \n</span>These geo-climatic changes have left imprints on the modern Amazonian diversity that can be recovered with dated phylogenetic trees.\n</li>\n<li><span>▪ \n</span>Amazonian plant groups show distinct responses to environmental changes, suggesting that Amazonia is both a refuge and a cradle of biodiversity.\n</li>\n</ul><p></p></div>","author":"Carina Hoorn, Lúcia G. Lohmann, Lydian M. Boschman and Fabien L. Condamine","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"6c3064f907c47a5e7cb8400c18fcfd91246a0600a2c31f7c39ac177964f22ede","category":"Environment"}