{"title":"358 The effect of increasing dietary limestone concentration on growth performance, gas flux, and carcass characteristics in finishing beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/376/7757160?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Reducing methane (CH<sub>4</sub>) emissions from beef cattle is desirable as CH<sub>4</sub> is a greenhouse gas that represents an energetic loss from the production system. Limestone is commonly fed to cattle as a source of calcium but may also act as a rumen buffer and decrease CH<sub>4</sub> emissions by limiting hydrogen availability for methanogenesis. The objective of this experiment was to determine if diet limestone concentration influences growth performance, gas flux, and carcass characteristics in finishing beef cattle. Yearling steers [n = 16; initial body weight (BW) 619 ± 34 kg] were stratified by BW and randomly assigned to 1 of 2 isocaloric and isonitrogenous dietary treatments in a completely randomized design where limestone was included at 1.3% (1X) or 2.6% (2X) of diet dry matter (DM). Finishing diets were formulated to contain 0.43 or 0.96% DM as Ca and were fed ad libitum using automated cattle feeders (SmartFeed Pro; C-Lock Inc.; Rapid City, SD) in a single pen for the final 37 d of finishing. Body weights were measured on d -1, 0, 36, and 37. An automated head chamber system (GreenFeed; C-Lock Inc.) was used to measure gas flux. Analysis of variance was conducted using JMP Pro 17 to determine the fixed effect of treatment with individual animal as the experimental unit. Statistical significance was defined as <span>P</span> ≤ 0.05 with a tendency defined as 0.05 &lt; <span>P</span> ≤ 0.10. Increasing the dietary limestone concentration from 1.3 to 2.6% of DM did not influence DM intake, but numerically increased final shrunk BW (<span>P</span> = 0.68) and hot carcass weight (<span>P</span> = 0.75) and increased average daily gain (ADG; <span>P</span> = 0.02) and gain to feed ratio (G:F) by approximately 12%. Cattle fed the 2X diet tended to have 6.5% greater ribeye area (<span>P</span> = 0.09), but similar USDA yield grade, backfat thickness, and dressing percentage (<span>P</span> ≥ 0.34) when compared with cattle fed the 1X diet. Daily CO<sub>2</sub> and CH<sub>4</sub> emissions, daily O<sub>2</sub> consumption, CH<sub>4</sub> yield, and respiratory quotient were unaffected by treatment (<span>P</span> ≥ 0.47). The improvement in ADG resulted in a tendency for CH<sub>4</sub> emission intensity to be decreased by 9.1% (<span>P</span> = 0.09) when the concentration of limestone was 2.6% of dietary DM. While increasing dietary limestone concentration from 1.3 to 2.6% of diet DM did not influence absolute daily CH<sub>4</sub> emissions, it increased ADG through an improvement in feed efficiency, which translated to a tendency for a reduction in CH<sub>4</sub> emission intensity. These preliminary data suggest that there may be a benefit to feeding limestone or calcium at levels greater than currently recommended by the NASEM (2016). Future research should focus on determining optimum dietary limestone or calcium levels for finishing cattle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6c351667e4cf886fadb0adcbdb49180352960e188028e33c896aedebca06e362","category":"Environment"}