{"title":"Estella Atekwana: Autobiographical Notes","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-080322-082343?TRACK=RSS","date":1685491200000,"content":"<div><p>I describe my career journey from a young girl in Cameroon, West Africa, to a trailblazing geophysicist to my current role as dean. I chronicle my time as a student, the transition to being an early career faculty, launching my research career, and ultimately finding my way to administration. Along the way I helped pioneer biogeophysics as a subdiscipline in geophysics while simultaneously maintaining an international research program in continental rift tectonics. I also describe the many intersectionalities in my life including being the first Black woman in many spaces, being a champion for student success, developing a diverse talent pipeline by enhancing diversity in the geosciences, and navigating academic job searches as part of a dual-career couple. Finally, I acknowledge all those who helped shape my career including the many students I had the opportunity to mentor.</p>\n<ul>\n<li><span>▪ \n</span>Many underrepresented minority geoscientists lack the social capital and professional networks critical for their success.\n</li>\n<li><span>▪ \n</span>Geoscience departments must be intentional and deliberate in promoting and ensuring more inclusive workplace environments.\n</li>\n<li><span>▪ \n</span>Dual-career couples remain a major challenge, impacting retention and recruitment of top talent; universities should provide resources to alleviate this challenge.\n</li>\n<li><span>▪ \n</span>Biogeophysics has untapped potential for advancing understanding of subsurface biogeochemical processes and the search for life in extreme environments.\n</li>\n<li><span>▪ \n</span>To date, considerable speculation remains regarding the fundamental geodynamic processes that initiate and sustain the evolution of magma-deficient rifts.\n</li>\n</ul></div>","author":"Estella A. Atekwana","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"6c371640956b91dc4112797fe1efd2b0d758a84be4f302eb0cfe574ed7d0f4a0","category":"Environment"}