{"title":"Consumer group wants to end $255M “gift card loophole” for Starbucks and others","link":"https://arstechnica.com/?p=1993919","date":1704481466000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1219305593-800x534.jpg\" alt=\"Starbucks app showing on an iPhone\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1219305593.jpg\">Enlarge</a> <span>/</span> Starbucks' Rewards programs are a key part of their revenue. How the company deals with unspent amounts in that app could change under new Washington state proposals. (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>When you get a Starbucks gift card, or keep reloading one on your phone, you often end up with awkward amounts that can be difficult to spend.</p>\n<p>For most people, the remainders are a few bucks of wasted potential caffeine and sugar. For Starbucks, they are worth hundreds of millions of dollars each year, according to a consumer advocacy group in Washington state that wants to end the \"Gift Card Loophole.\" Changes in the coffee giant's home state could affect gift and loyalty cards nationwide.</p>\n<p>The <a href=\"https://www.waconsumerprotection.org/\">Washington Consumer Protection Coalition</a> (which notes that its top funding contributor is the Service Employees International Union) is pushing state legislators to remove a provision dating back to 2004. While <a href=\"https://archive.seattletimes.com/archive/?date=20040627&amp;slug=gift27m\">that 2004 legislation</a> was relatively consumer-friendly for its time by barring gift cards from fully expiring and eliminating maintenance fees, it allowed funds left on cards, or now on mobile apps, to be claimed as revenue by companies.</p></div><p><a href=\"https://arstechnica.com/?p=1993919#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993919&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6c3aaadec4a62436f2192cf9b57949a304fa1991f34db32c02f37a3f5d03972a","category":"Tech"}