{"title":"With the Government Absent, Who Was Responsible for Saving Restaurants?","link":"https://www.eater.com/22321575/covid-19-one-year-later-government-response-restaurants-workers-diners","date":1616013589000,"content":"\n<p>Hillary Dixler Canavan, writing for Eater:</p>\n\n<blockquote>\n  <p>Agency is hard enough to come by in daily life, but in a pandemic\nthat’s made it clear just how little of it we actually have,\nchoosing how to spend money becomes a compelling stand-in. It\nseems inevitable now that the choices available to even the most\nethically minded diners have largely been consumer choices: Buy\nrestaurant merch and gift cards. Get takeout and tip\nextravagantly. Avoid third-party delivery apps if possible. Dine\noutside. Eat at home.</p>\n\n<p>But underneath every available option is the one terrible choice\nthe government constructed for all of us: Engage with restaurants\nor watch the industry disappear. This is the wrong ultimatum,\nhowever, and one that only reinforces two distinct yet related\naxioms of American restaurant culture — that customers ought to\nhave authority over workers, and that those workers matter less\nthan their customers.</p>\n</blockquote>\n\n<p>We have leaned toward “get takeout and tip extravagantly”, but it’s tough. Even making a conscientious effort to support our favorite restaurants, we’ve spent only a fraction of what we usually spend over the last year. It’s been a hard year for so many businesses, but it’s hard to not think that we, collectively, have most failed our restaurant industry. We even call it “hospitality”. How can you be hospitable during a frighteningly contagious and dangerous pandemic?</p>\n\n<div>\n<a  title=\"Permanent link to ‘With the Government Absent, Who Was Responsible for Saving Restaurants?’\"  href=\"https://daringfireball.net/linked/2021/03/17/saving-restaurants\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6c403892ab2a1b37dd5434b7bbb62c9c2f89ee35eb6fe9be310803f0fad258fe","category":"Tech"}