{"title":"Assessing the performance of Moghani crossbred lambs derived from different mating systems with Texel and Booroola sheep","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301629","date":1712239200000,"content":"<p>by Reza Talebi, Mohsen Mardi, Mehrshad Zeinalabedini, Mehrbano Kazemi Alamouti, Stéphane Fabre, Mohammad Reza Ghaffari</p>\r\n\r\nIn our ongoing project, which focuses on the introgression of <i>Booroola</i>/<i>FecB</i> gene and the <i>myostatin</i> (<i>MSTN</i>) gene into purebred Moghani sheep, we assessed the performance of second-generation Moghani crossbreds such as second crossbreds (F2) and initial backcross generation (BC1). These crossbreds were generated through different mating systems, including in-breeding, outcrossing, first paternal backcrossing (PBC1), and first maternal backcrossing (MBC1). Notably, F2 strains exhibited lean tail, woolly fleece and a higher percentage of white coat color compared to BC1. The impact of mating systems and birth types on pre-weaning survival rates was found to be statistically significant (<i>P</i> &lt; 0.0001), with singleton offspring resulting from paternal backcross showing a particularly substantial effect. The F2 crossbred lambs carrying the <i>Booroola</i> gene did not show a statistically significant difference in survivability compared to those carrying the <i>MSTN</i> gene, implying the <i>Booroola</i> prolificacy gene had no significant impact on survival outcomes. However, the occurrence of multiple births had a significant negative impact on lamb survival (<i>P</i> &lt; 0.0001). The PBC1 sheep strains, specifically Texel Tamlet ram strains carrying the <i>MSTN</i> mutation, exhibited superior growth rates compared to others (<i>P</i> &lt; 0.05). Interestingly, the <i>MSTN</i> mutation in the homozygous variant genotype significantly impacts growth rate before weaning compared to other genotypes and pure Moghani sheep (<i>P</i> &lt; 0.05). In conclusion, this study objectively underscores the pivotal role of genetic factors, specifically through strategic mating systems like paternal backcrossing, in enhancing desired traits and growth rates in Moghani sheep, thereby contributing valuable insights to the field of sheep breeding programs.","author":"Reza Talebi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6c4672668feb1e0db223b56bd468bcd29ccbcf89b0d545f627c5fd79bf2bbb57","category":"Interdisciplinary"}