{"title":"iPhone 13 invite: All the very real clues Apple just dropped","link":"https://www.macworld.com/article/356182/iphone-13-invite-clues-camera-colors-display.html","date":1631117028000,"content":"<div>\n<section><div></div></section><p>Apple has announced that the first event of the fall, dubbed “California Streaming,” will <a href=\"https://www.macworld.com/article/356143/apple-sets-iphone-13-event-for-september-14.html\">take place on September 14</a>. Among other things (such as a new <a href=\"https://www.macworld.com/article/348953/2021-apple-watch-series-7-design-display-features-release.html\">Apple Watch</a> and <a href=\"https://www.macworld.com/article/349085/2021-airpods-pro-max-design-features-price-release.html\">AirPods</a>), we’re betting heavily that the <a href=\"https://www.macworld.com/article/234814/2021-iphone-13-rumors-specs-price-release.html\">iPhone 13</a> will make its debut. And since we’ve already written at length about what we expect Apple to include in the new phone, it’s time to get out our markers and microscopes to decipher what clues Apple has placed in the event invite.</p>\n\n\n\n<h2>Streaming something</h2>\n\n\n\n<p>Okay, the California Streaming tagline isn’t helpful at all. It’s not even a clever pun. We know the even takes place in California and it will be streamed for all the world to see, but beyond that, there doesn’t seem to be any obvious hints, not like last year’s “<a href=\"https://www.macworld.com/article/234672/apple-all-but-certain-to-unveil-iphone-12-at-october-13-online-event.html\">Hi, Speed</a>” or the iPhone 11’s “<a href=\"https://www.macworld.com/article/233209/apples-big-iphone-11-event-will-be-held-on-september-10-by-innovation-only.html\">By innovation only</a>” tagline.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/09/apple-tv-foundation-art-4.png?w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>But since we’re speculating like conspiracy theorists, let’s dive a little deeper. Apple could use the event to tease the upcoming release of its new “Foundation” series, or announce a new promotion that gives a year of Apple TV+ with a new iPhone purchase. Maybe the iPhone 13 will have a new feature that will let users easily live stream using the camera app. Or maybe it’s a reference to <a href=\"https://www.macworld.com/article/232982/5g-faq-iphone-12-performance-speed-carriers-mmwave-availaibity.html\">mmWave 5G</a> that was previously limited to the U.S. Because there’s no way Apple would use a tagline just because it sounded good, right?</p>\n\n\n\n<h2>Shooting stars</h2>\n\n\n\n<p>With night mode on the iPhone 12, it doesn’t matter what kind of light you have to take your shot. But when you point your iPhone 12 at the sky, nothing really happens. If you’re lucky, you might be able to see a spec or two or something resembling the moon on a particularly bright night, but for the most part night mode is limited to happenings on the ground.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/pixel-astrophotography.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Pixel 4 can shoot the stars with a tripod and a little time.</p>\n</figcaption></figure><p>Fergus Halliday/IDG</p></div>\n\n\n\n<p>That’s <a href=\"https://www.macworld.com/article/356647/bigger-batteries-could-be-the-star-of-apples-september-event.html\">rumored to change</a> with the introduction of the iPhone 13. According to a fresh rumor, the iPhone 13 cameras will “now recognize when stars are in the scene and internally adjusts itself accordingly” and we think the invite confirms it—the image of the Catalina-style mountains is clearly taken at twilight. It goes even further—Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/gregjoz/status/1435272731746979840&amp;xcust=1-1-356182-1-0-0&amp;sref=https://www.macworld.com/feed\">video invite</a> of the event clearly shows stars in the distance, which would not be visible using the current iPhone camera system. Apple could have used a bright sunny day for its backdrop, so its choice of a night sky must have some meaning, right?</p>\n\n\n\n<h2>Full focus</h2>\n\n\n\n<p>It wouldn’t be a new iPhone without new camera features, and we fully expect the iPhone 13 to up the ante. Among the features we’re hoping for is an enhanced ultra-wide camera, which is hard to not see in the event invite. That mountain range is very wide—even if the invite itself is frustratingly not 16:9.</p>\n\n\n\n<p>We also can’t help but notice how the image inside the Apple logo appears a bit more focused than the scenery around it. That seems like a nod to another feature we’re expecting: portrait videos. Apple unveiled something similar with the new FaceTime app in <a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">iOS 15</a> and it’s rumored to come to the iPhone 13 camera as well—so the subject in your videos will be in focus against a blurry background. But the Apple logo probably won’t be there. </p>\n\n\n\n<h2>More than a sunset</h2>\n\n\n\n<p>A new iPhone means new colors, and we think we’ve spotted a few of them in the event invite. First, there may be a new matte black option, which we can see at the bottom of the frame. Also, we think we see the new rose gold right above the mountains—and maybe even a touch of Sunset Gold if we squint just right.</p>\n\n\n\n<h2>Spot the display</h2>\n\n\n\n<p>One of the rumors we hope-hope-hope comes true is an option for an always-on display. And we refuse to believe Apple didn’t just confirm it for all to see. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-event-date.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p><br /></p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>When you watch the invite video on Twitter, the Apple logo will give way to a night sky (see above for our thoughts on that) with the date “9.14” in the center. It could be nothing, but also no, it couldn’t. It’s simple: Apple is obviously alluding to the always-on display coming in the iPhone 13 that will show the time, date, and notifications when the screen is off. If it’s anything like Android phones, it’ll look a lot like it does in the invite, with a thin font against a dark screen. Since Apple never centers numbers over a dark screen for any reason, we’re sure we’ve nailed this one.</p>\n\n\n\n<h2>AR everywhere</h2>\n\n\n\n<p>Apple has used augmented reality to promote the last several events, but never has it been so realistic. When you enter the AR view, the Apple logo opens up to a view of the mountains in the invite, making a mini-portal into Cupertino. We’re not saying Apple is going to unveil a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://marvel.fandom.com/wiki/Sling_Ring&amp;xcust=1-1-356182-1-0-0&amp;sref=https://www.macworld.com/feed\">Sling Ring</a>—though please Apple consider this—but the whole thing could be a tease for AR glasses. Our eyes are ready, Apple.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6c4b76341a5b75dae930022c7f0fcab59a8f8b398eef1a3f9b6688f53fca3a1f","category":"Apple"}