{"title":"BC Bike Race Gravel Explorer – Day 4 race report","link":"https://cyclingtips.com/2021/10/bc-bike-race-gravel-explorer-day-4-race-report/","date":1633069358000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-05413-650x434.jpg\" /></div><h2>BC Bike Race Gravel Explorer - Day 4 race report</h2><p></p><p></p><strong>Presented By 3T \r\nLocation – Kelowna and Crawford Trails \r\nDistance – 44 km \r\nVertical – 1081 m \r\n<a href=\"https://racedaytiming.ca/results/2021BCBRGravelExplorerDay4\" target=\"_blank\">Stage Four Results</a></strong>\r\n\r\nOur journey over the mountains yesterday, from Penticton to Kelowna has set us up for an another amazing circuit route today, around and within the Crawford trails. Once again, we return to the BCBR Gravel Explorer manifesto “everywhere a gravel bike can go”!\r\n\r\n\r\n<blockquote><em><strong>“Everybody is going to find some discomfort and find someplace to push themselves, absolutely really fantastic, variety is good – bring it on”!!</strong></em>\r\nTristen Chernove – Paralympian – 13 Rainbow jerseys and 4 Olympic Medals</blockquote>\r\n\r\n\r\nToday’s route started in the local Mission Creek bike skills park and meandered slowly through the orchards and vineyards of East Kelowna, headed into the massive hills of the Crawford trails. As the dark black pavement ramped upward covered in the contrasting deepest yellow hues of fall, the riders found their way to the top of the course and from there the fun would begin.\r\n\r\nThe Crawford trails have a little bit of everything, and the route, designed by local gravel rider, Trent Marshall included that formula “a bit of everything”. As riders began the first descent into the small firs and stunning ponderosas, the trails were in equal variety to the flora; from smooth and flowy, to bumpy and rough and everything in between. Small grueling ups were punctuated by long fast downs, giving all the riders a chance to fly along corridors of yellow aspen and still green dense coniferous forests. The final descent on a spectacular double-track named the Pink Hwy and including parts of Lost Lake trail totaled 6.5 km’s of face peeling speed!\r\n\r\nThe guns fired predictably as the slope increased and just before the peloton had transitioned from pavement to gravel, Alexander Fraser-Mauran (Red Truck Racing, Mosaic Homes) shot off the front in a bid to cut back on Cory Wallace’ (Kona Endurance Team) lead and perhaps create a gap he could hold onto in the singletrack. It was short-lived as Cory closed it down just over the top and well before things got hectic.\r\n\r\nThe chase was on, once again Karsten Madsen (Clif Bar, Oakley, Enve, Ryzon) was on the back foot and chasing hard, but his methodical approach to all things sporting ensures systematics precision and patience. While he ended the day in second and has consolidated that podium step, barring any mishaps on the final day he will come away with a load of experience to add to an already full armory, let’s keep our eye on this guy over the next few years.\r\n\r\nThe women’s race was turned inside out, and upside down today as Sammi Runnels (CNCPT Team) suffered a mechanical and lost the overall lead. Amity Rockwell (Easton Cycling) who loves the technical pressed on, doing what she loves best. Sammi Runnels (CNCPT Team) now sits 1 minute and 19 seconds adrift of the lead she has so patiently spent 3 days building up, and the green leaders coveted jersey is still up for grabs. \r\n\r\n\r\n\r\n<blockquote><em><strong>“So incredible to be back in our local, national cycling community again. Everybody is here for their own reasons, yet we get together as a big group, doing it together as a big group, this is long overdue”.</strong></em>\r\nTristen Chernove – Paralympian – 13 Rainbow jerseys and 4 Olympic Medals</blockquote>\r\n\r\n\r\n\r\nFarther back in the men’s field, Lucas Strain (CNCPT Team) had a solid day on the bike and embraced the variety laid out before him. He has now fought his way into the third overall position with Alexander Fraser-Maraun (Red Truck Racing, Mosaic Homes) dropping to 4th. With 1 day of racing left there’s not much time remaining to finalize a medal position.\r\n\r\nIn the Women’s 30+ field Holly Shellenberg has been riding strong all week and seems to have a lock on the leaders’ jersey, as well Jesse Scholtes in the Men’s 30+ is seemingly about to take the honours home. Great to see these athletes embracing the challenges of the first ever BCBR Gravel Explorer.\r\n\r\nThere is a solid field of 60+ men here and it’s being owned by a young man named Mark Bennett who likes the cut of his green jersey and apparently wants to keep them all. On the women’s side Heide Saunders is 60 but because none of her peers wanted to participate, so she was forced to play down-a-category, she’s currently 3rd overall in the Women’s 50+!\r\n\r\nPaul Moffat is running away with the category of 40+ men, obviously, he’s got some chops in all departments, but the field behind isn’t giving up and is rather stacked! I’m not sure they’re as focused on racing or simply – having an awesome time on these incredible tracks – we see a lot of high fives, friends helping friends, and some other processes going on.\r\n\r\nRJ Sauer is bike-packing the entire week, he’s ridden into town to race and or ride, then pedaled back to camp, again and again. I think at the end of the day as Tristan said “this is long overdue” for us to come together and do what we all love, ride bikes together! \r\n\r\n\r\n\r\n<blockquote><strong>“You see this smile, you see this (motions to his face), another great day!!” </strong><em>\r\nCharles Creighton – new guy to racing – loving it! </em></blockquote>\r\n\r\n\r\n\r\nPhoto Credit: Chris Stenberg <h2>Key Details</h2><ul><li>Everybody is going to find some discomfort and find someplace to push themselves</li><li>Holly Shellenberg has been riding strong all week and seems to have a lock on the leaders’ jersey</li><li>Paul Moffat is running away with the category of 40+ men</li><li>Incredible to be back in our local, national cycling community again.</li><li>Great to see these athletes embracing the challenges of the first ever BCBR Gravel Explorer</li></ul><figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-02060.jpg\" /><figcaption></figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-04996.jpg\" /><figcaption></figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-05225.jpg\" /><figcaption></figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-05036.jpg\" /><figcaption></figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/stenberg-web-05400.jpg\" /><figcaption></figcaption></figure></li></ul></figure><p></p><a href=\"https://cyclingtips.com/2021/10/bc-bike-race-gravel-explorer-day-4-race-report/\">Read More</a>","author":"BCBRGravel","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6c4e8a2a79f550bf275bbcc4d173ddf4da0c04b4fe0d3a5e44b49e900b504ecf","category":"Cycling"}