{"title":"Assessing Governability in Aquaculture Coastal Zones: New Insight from the International Level","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/7197832?af=R","date":1718236114000,"content":"<p>Historically, European Union (EU27) member states have held sway over the administration of aquaculture sectors. However, challenges have arisen within this regulatory framework, particularly concerning the implementation of sustainable conservation measures across the EU27 region. In response to perceived regulatory shortcomings, alternative strategies like economic and community-based management have emerged. Thus, this study aims to investigate how global governance factors have influenced the growth of the aquaculture industry within the European Union (EU13) and European Union (EU14) from 1990 to 2023. To address endogeneity concerns, robust least squares, two-stage least squares (2SLS), and ordinary least squares estimators were employed, yielding significant findings. Notably, the impact analysis reveals that property rights, economic stability, private sector quality, and private interest are pivotal drivers of aquaculture industry growth in EU14 developed countries compared to their EU13 developing counterparts. Conversely, the novelty of the paper shows that economic growth, social development, and aquaculture industry advancement hold greater significance in EU13 developing countries relative to EU14 developed ones, as indicated by the estimators. Given these insights, policymakers in EU13 developing countries are urged to prioritize initiatives aimed at fortifying property rights, economic stability, and private interest. Conversely, policymakers in EU14 developed countries are encouraged to focus on fostering economic growth, enhancing public sector quality, and promoting social development in blue farming.</p>","author":"Mohd Alsaleh, \nLee Seong Wei","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6c4f8f6ffb91d90cacced214e9abbc629a59140b330877244bb1f7676c87f28f","category":"Environment"}