{"title":"Thermal, water, and land cover factors led to contrasting urban and rural vegetation resilience to extreme hot months","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae147/7645780?rss=1","date":1713139200000,"content":"<span><div>Abstract</div>With continuing global warming and urbanization, it is increasingly important to understand the resilience of urban vegetation to extreme high temperatures, but few studies have examined urban vegetation at large scale or both concurrent and delayed responses. In this study, we performed an urban–rural comparison using the Enhanced Vegetation Index and months that exceed the historical 90th percentile in mean temperature (referred to as “hot months”) across 85 major cities in the contiguous United States. We found that hot months initially enhanced vegetation greenness but could cause a decline afterwards, especially for persistent (≥4 months) and intense (≥+2 °C) episodes in summer. The urban responses were more positive than rural in the western United States or in winter, but more negative during spring–autumn in the eastern United States. The east–west difference can be attributed to the higher optimal growth temperatures and lower water stress levels of the western urban vegetation than the rural. The urban responses also had smaller magnitudes than the rural responses, especially in deciduous forest biomes, and least in evergreen forest biomes. Within each biome, analysis at 1 km pixel level showed that impervious fraction and vegetation cover, local urban heat island intensity, and water stress were the key drivers of urban–rural differences. These findings advance our understanding of how prolonged exposure to warm extremes, particularly within urban environments, affects vegetation greenness and vitality. Urban planners and ecosystem managers should prioritize the long and intense events and the key drivers in fostering urban vegetation resilience to heat waves.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"6c4fd6762645bb2bb9adf557d388a8bb887b5884399b706048e548c9c5c971e1","category":"Interdisciplinary"}