{"title":"Estimation Model for Maize Multi-components Based on Hyperspectral Data","link":"https://www.preprints.org/manuscript/202408.1128/v1","date":1723732415000,"content":"Assessing the quality of corn seeds necessitates evaluating their content of water, fat, protein, and starch. This study integrates hyperspectral imaging technology with chemometric analysis techniques to achieve non-invasive and rapid detection of multiple key components in corn seeds. Hyperspectral images of the embryo surface of maize seeds were collected within the wavelength range of 1100~2498nm. Subsequently, image segmentation techniques were applied to extract the germ structure of the corn seeds as the region of interest. Seven spectral data preprocessing algorithms were employed, and the Detrending Transformation (DT) algorithm was identified as the optimal preprocessing method through comparative analysis using the Partial Least Squares Regression (PLSR) model. To reduce spectral redundancy and streamline the prediction model, three algorithms were employed for characteristic wavelength extraction: Successive Projections Algorithm (SPA), Competitive Adaptive Reweighted Sampling (CARS), and Uninformative Variable Elimination (UVE). Using both the original spectra and the extracted characteristic wavelengths, four content detection models were constructed: PLSR, Back Propagation Neural Network (BPNN), Radial Basis Function Neural Network (RBFNN), and Least Squares Support Vector Machine (LSSVM). The experimental results demonstrate that the DT-CARS-LSSVM model exhibits exceptional accuracy and stability in predicting these four key components, with determination coefficients of 0.9877, 0.9344, 0.9827, and 0.9592, respectively. This study not only provides a scientific basis for evaluating the quality of corn seeds but also opens up new avenues for the development of non-invasive detection technology in related fields.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6c54439e7274f823e6dd66eaf646856aea832a734d4e39068543cb0fa2ffdbf9","category":"Interdisciplinary"}