{"title":"Simplified tree marking guidelines enhance value recovery as well as stand vigour in northern hardwood forests under selection management","link":"https://academic.oup.com/forestry/article/97/2/183/7287277?rss=1","date":1696032000000,"content":"<span><div>Abstract</div>In northern hardwood forests, tree markers select the trees to be harvested during logging operations using classification systems that assign harvest priorities based on the presence of a wide range of individual defects. According to the most recent advances in our understanding of the impact of defects on both tree vigour (the risk of mortality or decline in growth) and quality (the potential for recovering valuable sawlogs), tree markers should adopt a simpler classification system that considers fewer defects than the current operational practice, and they should prioritize the removal of trees with crown dieback. Since the probability of developing defects and dying increases substantially with tree diameter, tree markers should also favour the removal of larger trees that have maintained their quality. However, these recommendations were developed based on tree-level analyses. To provide further validation at the stand scale, we compared stand improvement and value recovery under three tree marking regimes: a new, simplified regime based on the recommendations above, and two regimes used in the province of Quebec, Canada. To do so, we conducted tree marking simulations and value recovery assessments in 14 managed stands distributed across the northern hardwood range of Quebec. Our results confirmed that the simplified tree marking regime not only facilitated stand improvement by removing a greater proportion of low-vigour trees, but also recovered significantly more value (17% on average) at the stand scale. By prioritizing the removal of trees with crown dieback, the simplified regime was superior at salvaging the current value of low-vigour trees before they die or decline in quality. Based on our results, we propose simplified and empirically-validated tree marking guidelines for northern hardwood forests.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"6c5c78d8c2686dbb0f66fc3c059291b85c67e46053c45c23e2581fa6c16c3c05","category":"Environment"}