{"title":"★ Adware for Apple Services in iOS","link":"https://daringfireball.net/2023/04/ios_adware","date":1682001703000,"content":"\n<p><a href=\"https://stevestreza.com/2020/02/17/ios-adware/\">Steve Streza, all the way back in February 2020</a> (innocent times, that month):</p>\n\n<blockquote>\n  <p>Over the years, Apple has built up a portfolio of services and\nadd-ons that you pay for. Starting with AppleCare extended\nwarranties and iCloud data subscriptions, they expanded to Apple\nMusic a few years ago, only to dramatically ramp up their\nofferings last year with TV+, News+, Arcade, and Card. Their\nservices business, taken as a whole, is quickly becoming massive;\nApple reported <a href=\"https://www.macrumors.com/2020/01/28/apple-services-revenue-12-7-billion-q1-2020/\">$12.7 billion in Q1 2020</a> alone, nearly a\nsixth of its already gigantic quarterly revenue. [...]</p>\n\n<p>If you don’t subscribe to these services, you’ll be forced to look\nat these ads constantly, either in the apps you use or the push\nnotifications they have turned on by default. The pervasiveness of\nads in iOS is a topic largely unexplored, perhaps due to these\nservices having a lot of adoption among the early adopter crowd\nthat tends to discuss Apple and their design. This isn’t a value\ncall on the services themselves, but a look at how aggressively\nApple pushes you to pay for them, and how that\n<a href=\"https://en.wikipedia.org/wiki/Growth_hacking\">growth-hack</a>-style design comes at the expense of the user\nexperience. In this post, I’ll break down all of the places in iOS\nthat I’ve found that have Apple-manufactured ads. You can\nreplicate these results yourself by doing a factory reset of an\niPhone (backup first!), installing iOS 13, and signing up for a\nnew iCloud account.</p>\n</blockquote>\n\n<p>Streza’s post emphasizes the new-user experience, and he’s right that longtime users (like you, dear reader, probably) don’t see a lot of this. But I do, because when reviewing new devices or new OS releases, I’ll sometimes set up as new (and use a spare Apple ID dedicated to testing) to see the factory-fresh Cupertino default experience. Is it too much advertising? I don’t know — but it’s a lot. One thing that’s clear is that Apple sees Music and TV as Apple-service properties. Yes, you can use them for listening to your own music and watching your own video files, but first and foremost these are client apps to Apple’s Music and TV+ services. These are not the iTunes and Video apps of yore.</p>\n\n<p>But what got me thinking about this issue this week is the dumbest adware in iOS I’ve seen. For the last several weeks, I’ve noticed <a href=\"https://daringfireball.net/misc/2023/04/ios-settings-arcade-ad.png\">an ad in Settings on my iPhone</a>, in the iCloud section at the very top of the first screen: “Apple Arcade Free for 3 Months”. The reason this is dumb is that I pay for a family account for Apple One, <em>so we already have Apple Arcade</em>. But here’s Apple badgering me to sign up for a 3-month free trial that I don’t need.</p>\n\n<p>If I tap into that ad’s section in Settings it explains why they’re offering it: “Services Included With Purchase”. I’m not even sure what device I bought that earned me this offer, but it shouldn’t matter. Why are they showing me something I already pay for?</p>\n\n<p>To be clear, I was able to make this ad go away by tapping “Not Now” on the offer screen in Settings. (I waited for weeks before doing so to see if it would go away on its own.) And I’m not blankly opposed to using this top-of-the-first-screen space in Settings to show offers for Apple’s services or AppleCare warranty coverage. But they ought to be presented conservatively, and with surgical precision. Apple is doing users a favor if they’re reminding them of offers — like three free months of Apple Arcade — that they’ve already qualified for with a hardware purchase. But it’s annoying and confusing that it’s the very app where I manage my Apple One subscription that’s suggesting I sign up for a service included in Apple One.</p>\n\n<p>We — including Apple itself and Tim Cook personally — decry the invasiveness of the surveillance advertising complex, by which they develop profiles of us so accurate that the ads they deliver are so on-point to our recent interests that millions of people falsely believe their devices are somehow surreptitiously listening to their real-world conversations. This stupid Apple Arcade prompt in Settings is the opposite: I’m being shown it because Apple knows I recently bought a new device from them, but somehow doesn’t know that I already pay them for a subscription that includes Arcade. How can they be so contextually unaware?</p>\n\n<p>Promotions for services I might want? Maybe, but Apple should be extremely conservative about presenting them — especially in push notifications. Promotions for services I already pay for? That shouldn’t happen.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6c5e1353663c47bfc14ae945c8eae10655f8939989d4d1ed4759cb7cbb69db1c","category":"Tech"}