{"title":"The stromal side of the cytochrome b6f complex regulates state transitions","link":"https://academic.oup.com/plcell/article/36/10/4234/7706167?rss=1","date":1720051200000,"content":"<span><div>Abstract</div>In oxygenic photosynthesis, state transitions distribute light energy between PSI and PSII. This regulation involves reduction of the plastoquinone pool, activation of the state transitions 7 (STT7) protein kinase by the cytochrome (cyt) <span>b</span><sub>6</sub><span>f</span> complex, and phosphorylation and migration of light harvesting complexes II (LHCII). In this study, we show that in <span>Chlamydomonas reinhardtii</span>, the C-terminus of the cyt <span>b</span><sub>6</sub> subunit PetB acts on phosphorylation of STT7 and state transitions. We used site-directed mutagenesis of the chloroplast <span>petB</span> gene to truncate (remove L215<span>b6</span>) or elongate (add G216<span>b6</span>) the cyt <span>b</span><sub>6</sub> subunit. Modified complexes are devoid of heme <span>ci</span> and degraded by FTSH protease, revealing that salt bridge formation between cyt <span>b</span><sub>6</sub> (PetB) and Subunit IV (PetD) is essential to the assembly of the complex. In double mutants where FTSH is inactivated, modified cyt <span>b</span><sub>6</sub><span>f</span> accumulated but the phosphorylation cascade was blocked. We also replaced the arginine interacting with heme <span>ci</span> propionate (<span>R207Kb6</span>). In this modified complex, heme <span>ci</span> is present but the kinetics of phosphorylation are slower. We show that highly phosphorylated forms of STT7 accumulated transiently after reduction of the PQ pool and represent the active forms of the protein kinase. The phosphorylation of the LHCII targets is favored at the expense of the protein kinase, and the migration of LHCII toward PSI is the limiting step for state transitions.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"6c6d53d8e36a522d1dd62b7729b2bd807ff618213dbf55e328a9346cb754e86f","category":"Environment"}