{"title":"WSJ: Apple to Release iPhone Journaling App for Logging Daily Activities","link":"https://www.macrumors.com/2023/04/21/apple-launching-journaling-app/","date":1682070500000,"content":"Apple is planning to launch a <a href=\"https://dayoneapp.com\">Day One</a>-style iPhone journaling app to let users compile their daily activities, as part of its efforts in the physical and mental health market, reports <em>The Wall Street Journal</em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2016/02/apple-store-logo-1.jpg\" alt width=\"800\" height=\"452\" />\r<br />\nFrom the <a href=\"https://www.wsj.com/articles/apple-plans-iphone-journaling-app-in-expansion-of-health-initiatives-690b2c8b?mod=rss_Technology\">paywalled report</a>:\r<br />\n<blockquote>The software will compete in a category of so-called journaling apps, such as Day One, which lets users track and record their activities and thoughts. The new Apple product underscores the company's growing interest in mental health.\r<br />\n\r<br />\nThe Apple journaling app, code-named Jurassic, is designed to help users keep track of their daily lives, according to the documents describing the software. The app will analyze the users' behavior to determine what a typical day is like, including how much time is spent at home compared with elsewhere, and whether a certain day included something outside the norm, according to the documents.</blockquote>Based on documents seen by <em>WSJ</em>, a personalization feature will highlight potential topics for users to write about, such as a workout, while the app will also offer \"All Day People Discovery\" to detect a user's physical proximity to other people.\r<br />\n\r<br />\nAccording to the report, Apple's app will have the ability to gather much more user data than third-party journaling apps, and will have access to text messages and phone calls,  but privacy and security will be central to the software's design. The analysis of the user's day will take place on-device, and journaling suggestions will remain in the system for four weeks, after which they will be removed.\r<br />\n\r<br />\nIt's not known when the app will be released, but it could be announced as soon as WWDC in June, when iOS 17 is set to be previewed, and could be a feature of the new operating system. The documents seen by <em>WSJ</em> offered no indication as to whether Apple plans to charge for the journaling app. An Apple spokesperson declined to comment. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/21/apple-launching-journaling-app/\">WSJ: Apple to Release iPhone Journaling App for Logging Daily Activities</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/wsj-apple-to-release-iphone-journaling-app-for-logging-daily-activities.2387396/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6c6d2d9ca7ebc6511f02a25e28fdea1415815a872d7c97bcffe88ca3e172aea8","category":"Apple"}