{"title":"Sand, sun, and electric off-road SUVs: Extreme E holds its first race","link":"https://arstechnica.com/?p=1754831","date":1617724974000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/XP2101_044846_15U8452-980x653.jpg\" alt=\"\"></div>\n        <p>\n          The Odyssey 21 of Mikaela Ahlin-Kottulinsky and Jenson Button, who are driving for the JBXE Extreme-E Team. Button is not the only F1 world champion to enter a team in Extreme E, but he is the only one to also strap in as a driver.                      [credit:\n                        Extreme E                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Traveling to threatened environments in order to have a race to raise awareness about the threats to those environments might seem a little counterintuitive at first glance. But that's the concept behind Extreme E, a new racing series for electric off-road SUVs, created by some of the people who gave us Formula E.</p>\n<p><a href=\"https://arstechnica.com/cars/2019/01/electric-suvs-racing-in-the-himalayas-and-the-amazon-meet-extreme-e/\">When Extreme E was launched</a>, it promised challenging racing against a backdrop of spectacular (spectator-free) scenery in remote locations, with participants traveling by ecologically aware boat, not fleets of jumbo jets. And the first X Prix, held this past weekend in Saudi Arabia, certainly delivered in that regard, with action reminiscent of a Tatooine pod race.</p>\n<p>The fledgling sport has already attracted some of the biggest names in racing. Formula 1 world champions Lewis Hamilton, Nico Rosberg, and Jenson Button are each fielding a team, and Button is also donning his <a href=\"https://arstechnica.com/cars/2020/12/why-racing-drivers-trust-their-lives-to-a-fireproof-fabric-called-nomex/\">nomex</a> as one of the drivers. As are rally legends Sebastian Loeb and Carlos Sainz, and Laia Sanz, one of the most successful <a href=\"https://en.wikipedia.org/wiki/Motorcycle_trials\">Trials</a> riders and a distinguished Dakar competitor. Even GMC Hummer is taking part <a href=\"https://arstechnica.com/cars/2021/04/gmc-readies-a-second-electric-off-road-hummer-this-one-is-an-suv/\">now that it has found a new lease on life as an EV brand</a>.<!--adbreak--></p></div><p><a href=\"https://arstechnica.com/?p=1754831#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1754831&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6c7278e00aaaee25b50b40dd0ae018b8bf371bc6cfceae525476e54aa95c1fe9","category":"Tech"}