{"title":"Vegetation structure and climate shape mountain arthropod distributions across trophic levels","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14164?af=R","date":1723799692000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/cc3b7233-d151-4856-a532-90c208b871f6/jane14164-toc-0001-m.png\" alt=\"Vegetation structure and climate shape mountain arthropod distributions across trophic levels\" />\n<p>Despite their vital role in ecosystems, foliar arthropods distributions remain poorly understood, particularly in mountainous regions. This study addresses this gap by modelling the distribution of 31 foliar arthropod genera in the French Alps. It emphasizes the importance of modelling across diverse trophic groups to anticipate arthropod responses to global change.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nArthropods play a vital role in ecosystems; yet, their distributions remain poorly understood, particularly in mountainous regions.\n\nThis study delves into the modelling of the distribution of 31 foliar arthropod genera in the French Alps, using a comprehensive approach encompassing multi-trophic sampling, community DNA metabarcoding and random forest models.\n\nThe results underscore the significant importance of vegetation structure, such as herbaceous vegetation density, and forest density and heterogeneity, along with climate, in shaping the distributions of most arthropods. These responses to environmental gradients are consistent across trophic groups, with the exception of nectarivores, whose distributions are more sensitive to landscape structure and water availability.\n\nBy leveraging community DNA metabarcoding, this study sheds light on the understudied drivers of arthropod distributions, emphasizing the importance of modelling across diverse trophic groups to anticipate arthropod responses to global change.\n</p>","author":"Camille Martinez‐Almoyna, \nIrene Calderòn‐Sanou, \nClément Lionnet, \nLudovic Gielly, \nFrédéric Boyer, \nPaul Dufour, \nLily Dunyach, \nChristian Miquel, \nMarc Ohlmann, \nJérôme Poulenard, \nJulien Renaud, \nAmélie Saillard, \nSara Si‐Moussi, \nRuth Stephan, \nMary Varoux, \nThe Orchamp Consortium, \nTamara Münkemüller, \nWilfried Thuiller","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"6c738a8d11003683eeaa0978b20c99a0723325218deb376ebfbc76d20b4181d3","category":"Environment"}