{"title":"Shifting dynamics in restoration ecology: Concrete steps towards centering Black, Indigenous, and People of Color's communities and perspectives","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12345?af=R","date":1717916400000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/1d35fcc6-78c4-4a89-a13a-a7510e2c18d6/eso312345-toc-0001-m.png\" alt=\"Shifting dynamics in restoration ecology: Concrete steps towards centering Black, Indigenous, and People of Color's communities and perspectives\" />\n<p>Ecological restoration is a crucial tool for mitigating climate change and the global biodiversity crisis, but the extensive knowledge of Black, Indigenous and People of Colour (BIPOC) is often excluded though will play a key role in accelerating the advancement of restoration efforts. We argue for the inclusion of BIPOC into restoration, their ideas and introduce The Black Earth Restoration Collective to propel this need and work.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEcological restoration is a crucial tool for mitigating climate change and addressing the global biodiversity crisis. The extensive knowledge of Black, Indigenous and People of Colour (BIPOC) will play a key role in accelerating the advancement of restoration efforts but has historically been excluded. BIPOC traditions and practices of protecting and restoring ecological communities include intricate socio-ecological systems whose holistic practices preserve cultural knowledge while simultaneously addressing environmental issues.\n\nIf we are to have a seat at the table for everyone and meet the lofty goals of the U.N. Decade on Ecosystem Restoration to contribute to reversing the biodiversity and climate crises, the field of restoration ecology can no longer afford to exclude BIPOC communities and their irreplaceable social, cultural, and ecological knowledge.\n\n<i>Solution</i>: We offer opportunities to engage BIPOC communities and their contributions to restoration, and to introduce a restoration community to connect and center BIPOC through the <i>Black Earth Restoration Collective</i>. This is a call to action to those with power and access in restoration ecology to make vital shifts needed to accomplish a more equitable and just approach to restoration.\n</p>","author":"Samantha Rosa, \nSarah Hollis, \nRegina Mae Francia, \nAmelia Renner, \nNia Johnson, \nRebecca S. Barak, \nHolly P. Jones, \nEvelyn W. Williams, \nAlicia J. Foxx","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"6c766cdfb889f3c2d71b129c37a872ff4c7c7424677d45aa326b954a5db82631","category":"Environment"}