{"title":"Insect population dynamics under <i>Wolbachia</i>-induced cytoplasmic incompatibility: Puzzle more than buzz in <i>Drosophila suzukii</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300248","date":1710252000000,"content":"<p>by Alexandra Auguste, Nicolas Ris, Zainab Belgaidi, Laurent Kremmer, Laurence Mouton, Xavier Fauvergue</p>\r\n\r\nIn theory, the introduction of individuals infected with an incompatible strain of <i>Wolbachia pipientis</i> into a recipient host population should result in the symbiont invasion and reproductive failures caused by cytoplasmic incompatibility (CI). Modelling studies combining <i>Wolbachia</i> invasion and host population dynamics show that these two processes could interact to cause a transient population decline and, in some conditions, extinction. However, these effects could be sensitive to density dependence, with the Allee effect increasing the probability of extinction, and competition reducing the demographic impact of CI. We tested these predictions with laboratory experiments in the fruit fly <i>Drosophila suzukii</i> and the transinfected <i>Wolbachia</i> strain <i>w</i>Tei. Surprisingly, the introduction of <i>w</i>Tei into <i>D</i>. <i>suzukii</i> populations at carrying capacity did not result in the expected <i>w</i>Tei invasion and transient population decline. In parallel, we found no Allee effect but strong negative density dependence. From these results, we propose that competition interacts in an antagonistic way with <i>Wolbachia</i>-induced cytoplasmic incompatibility on insect population dynamics. If future models and data support this hypothesis, pest management strategies using <i>Wolbachia</i>-induced CI should target populations with negligible competition but a potential Allee effect, for instance at the beginning of the reproductive season.","author":"Alexandra Auguste","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6c76860375da5e314bc275a3f8d69da7825483eef983a4da69066a8366de781d","category":"Interdisciplinary"}