{"title":"Synthesis of Titanium Carbide Nanoparticles by Magnesiotermic Method","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.645/7719753?rss=1","date":1721779200000,"content":"<span>Titanium carbide (TiC) is a material that has garnered significant attention due to its high melting point (3338 K), rendering it resistant to wear, thus finding applications in aerospace materials [<a href=\"#ozae044.645-B1\">1</a>]. For the mentioned applications, there is interest in producing TiC powders with a fine particle size and narrow distribution. Where the crystallization shape and exposed facets of TiC particles influences its physical and chemical properties [<a href=\"#ozae044.645-B2\">2</a>]. Various methods are proposed for producing TiC powder, such as the carbo-thermal process, self-sustained reactive sintering, microwave, and electrospinning [<a href=\"#ozae044.645-B3\">3</a>]. The motivation of this work is to synthesize TiC employing turbostratic carbon as a carbon source and metallic titanium powder. From Alfa Aesar (44 µm), 0.80 g of 99.5% titanium powder and 0.20 g of turbostratic carbon were used. The powders were homogenized in an agate mortar for 30 minutes, forming a pellet by pressing at 218 MPa [<a href=\"#ozae044.645-B4\">4</a>]. The sample was covered with 3 g of metallic magnesium for ignition. This stage was carried out in a CO<sub>2</sub> atmosphere to prevent reaction with atmospheric oxygen. Additionally, the synthesis reaction produces magnesium oxide as a byproduct. Hence, it is necessary to wash the powders for approximately 3 h at room temperature with constant agitation using hydrochloric acid [<a href=\"#ozae044.645-B5\">5</a>]. Structural characterization was performed using a Panalytical X'pert PRO diffractometer operated at 40 kV and 30 mA with CuK<sub>α</sub> radiation (λ = 0.15406 nm). Scanning electron microscopy (SEM) was utilized to evaluate the morphology. The microstructures of the TiC were characterized using bright-field mode in a transmission electron microscope (TEM), model JEOL JEM2200FS.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"6c840fc9494e0efa09b476d402fa2084ac1afca28d6ee7c444c3b4e2bf1e57d4","category":"Environment"}