{"title":"Artificial intelligence of imaging and clinical neurological data for predictive, preventive and personalized (P3) medicine for Parkinson Disease: The NeuroArtP3 protocol for a multi-center research study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300127","date":1710424800000,"content":"<p>by Maria Chiara Malaguti, Lorenzo Gios, Bruno Giometto, Chiara Longo, Marianna Riello, Donatella Ottaviani, Maria Pellegrini, Raffaella Di Giacopo, Davide Donner, Umberto Rozzanigo, Marco Chierici, Monica Moroni, Giuseppe Jurman, Giorgia Bincoletto, Matteo Pardini, Ruggero Bacchin, Flavio Nobili, Francesca Di Biasio, Laura Avanzino, Roberta Marchese, Paola Mandich, Sara Garbarino, Mattia Pagano, Cristina Campi, Michele Piana, Manuela Marenco, Antonio Uccelli, Venet Osmani</p>\r\nBackground <p>The burden of Parkinson Disease (PD) represents a key public health issue and it is essential to develop innovative and cost-effective approaches to promote sustainable diagnostic and therapeutic interventions. In this perspective the adoption of a P3 (predictive, preventive and personalized) medicine approach seems to be pivotal. The NeuroArtP3 (NET-2018-12366666) is a four-year multi-site project co-funded by the Italian Ministry of Health, bringing together clinical and computational centers operating in the field of neurology, including PD.</p> Objective <p>The core objectives of the project are: i) to harmonize the collection of data across the participating centers, ii) to structure standardized disease-specific datasets and iii) to advance knowledge on disease’s trajectories through machine learning analysis.</p> Methods <p>The 4-years study combines two consecutive research components: i) a multi-center retrospective observational phase; ii) a multi-center prospective observational phase. The retrospective phase aims at collecting data of the patients admitted at the participating clinical centers. Whereas the prospective phase aims at collecting the same variables of the retrospective study in newly diagnosed patients who will be enrolled at the same centers.</p> Results <p>The participating clinical centers are the Provincial Health Services (APSS) of Trento (Italy) as the center responsible for the PD study and the IRCCS San Martino Hospital of Genoa (Italy) as the promoter center of the NeuroartP3 project. The computational centers responsible for data analysis are the Bruno Kessler Foundation of Trento (Italy) with TrentinoSalute4.0 –Competence Center for Digital Health of the Province of Trento (Italy) and the LISCOMPlab University of Genoa (Italy).</p> Conclusions <p>The work behind this observational study protocol shows how it is possible and viable to systematize data collection procedures in order to feed research and to advance the implementation of a P3 approach into the clinical practice through the use of AI models.</p>","author":"Maria Chiara Malaguti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6c86b962fce55ab22427568a98943d830dea49db2707027e395c3abe2778688b","category":"Interdisciplinary"}