{"title":"Intra-arterial delivery of neurospheres into isolated perfused porcine colons: a proof of concept","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae022/7639392?rss=1","date":1712016000000,"content":"<span><div>Abstract</div>Cell replacement in aganglionic intestines is a promising, yet merely experimental tool for the therapy of congenital dysganglionosis of the enteric nervous system like Hirschsprung disease. While the injection of single cells or neurospheres to a defined and very restricted location is trivial, the translation to the clinical application, where large aganglionic or hypoganglionic areas need to be colonized (hundreds of square centimetres), afford a homogeneous distribution of multiple neurospheres all over the affected tissue areas. Reaching the entire aganglionic area <span>in vivo</span> is critical for the restoration of peristaltic function. The latter mainly depends on an intact nervous system that extends throughout the organ. Intra-arterial injection is a common method in cell therapy and may be the key to delivering cells or neurospheres into the capillary bed of the colon with area-wide distribution. We describe an experimental method for monitoring the distribution of a defined number of neurospheres into porcine recta <span>ex vivo,</span> immediately after intra-arterial injection. We designed this method to localize grafting sites of single neurospheres in precise biopsies which can further be examined in explant cultures. The isolated perfused porcine rectum allowed us to continuously monitor the perfusion pressure. A blockage of too many capillaries would lead to an ischaemic situation and an increase of perfusion pressure. Since we could demonstrate that the area-wide delivery of neurospheres did not alter the overall vascular resistance, we showed that the delivery does not significantly impair the local circulation.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"6c89030a0cacf8196523685d46a05eeadcf8466293c6630de56e346ad7c39c54","category":"Environment"}