{"title":"Apple dispels the age-old solution to a wet iPhone: Don’t put it in rice","link":"https://www.macworld.com/article/2239742/iphone-liquid-damage-dry-rice.html","date":1708341300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Ever since cell phones were a thing, we’ve been dropping them in water. And while today’s iPhones are resistant to splashes, dips, and dunks in water, there are still times when they get too wet and the dreaded liquid-detection alert appears on your screen.</p>\n\n\n\n<p>For years, we’ve turned to a simple household staple when we need to save our iPhones from a liquid death: a bag of rice. The method is decidedly low-tech. Just pop your phone in a bag of rice, seal it up, and wait for a day or so. The idea is that the rice will draw the water out from inside the phone before it can fry any internal parts. People who have experienced <a href=\"https://www.macworld.com/article/668606/how-to-fix-a-wet-or-water-damaged-iphone.html\">waterlogged phones</a> swear by it, and there’s tons of anecdotal evidence to show that it does indeed work.</p>\n\n\n\n<p>However, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.usatoday.com/story/tech/2017/08/28/your-smartphone-got-wet-heres-what-do-first/609145001/&amp;xcust=1-1-2239742-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">researchers have been claiming</a> for years that rice doesn’t actually dry your phone faster and could slow down the process, leaving your logic board susceptible to further damage. And a new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/102643#:~:text=Don't%20dry%20your%20iPhone,rice%20to%20damage%20your%20iPhone.&amp;xcust=1-1-2239742-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">2024 support document</a> from Apple actually advises against using rice to dry out your iPhone as “doing so could allow small particles of rice to damage your iPhone.” Instead, Apple suggests the following steps:</p>\n\n\n\n<ol>\n<li>Tap your iPhone gently against your hand with the connector facing down to remove excess liquid. Leave your iPhone in a dry area with some airflow. </li>\n\n\n\n<li>After at least 30 minutes, try charging with a Lightning or USB-C cable or connecting an accessory.</li>\n\n\n\n<li>If you see the alert again, there is still liquid in the connector or under the pins of your cable. Leave your iPhone in a dry area with some airflow for up to a day. You can try again to charge or connect an accessory throughout this period. It might take up to 24 hours to fully dry.</li>\n\n\n\n<li>If your phone has dried out but still isn’t charging, unplug the cable from the adapter and unplug the adapter from the wall (if possible) and then connect them again.</li>\n</ol>\n\n\n\n<p>Among the don’ts, Apple also urges against drying your iPhone with an external heat source or compressed air, or inserting a foreign object, such as a cotton swab or a paper towel, into the Lightning or USB-C port.</p>\n\n\n\n<p>Granted, iPhones have been able to withstand submersion in water at a maximum depth of 6 meters (about 20 feet) up to 30 minutes <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/108039&amp;xcust=1-1-2239742-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">since the iPhone 12</a>, so chances are you haven’t had to worry about liquid damage for a while. But if you ever do, just leave the rice in the cabinet. </p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6c9d52e2ee0127475ad93e56367919f7a510e3e00d9b03b7d0867285dfadf600","category":"Apple"}