{"title":"A PROGRESS-driven approach to cognitive outcomes after traumatic brain injury: A study protocol for advancing equity, diversity, and inclusion through knowledge synthesis and mobilization","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307418","date":1721656800000,"content":"<p>by Thaisa Tylinski Sant’Ana, Sara Hanafy, Esme Fuller-Thomson, Michelle McDonald, Angela Colantonio, Daìthì Cee, Gráinne McGettrick, Brian Lawlor, Tatyana Mollayeva</p>\r\n\r\nEvidence syntheses for advancing equitable traumatic brain injury (TBI) research, policy, and practice presents formidable challenges. Research and clinical frameworks are currently not specific to equity, diversity, and inclusion considerations, despite evidence that persons with TBI live in societies in which power imbalances and systems of social dominance may privilege some people and marginalize others. The present protocol outlines a strategy for a research program, supported by the Canadian Institutes of Health Research, that explores the integration of PROGRESS-Plus parameters in research with the goal of advancing open-science databases and tools to improve our understanding of equity in cognitive and brain health outcomes in TBI. PROGRESS-Plus is a framework outlining social, economic, and cultural parameters that may influence health opportunities and outcomes (e.g., place of residence, race, occupation, gender, etc.). A multistep research program is proposed to support three objectives: (1) organizing existing data on TBI-induced changes in cognition and brain health into a template to facilitate future research, including research using machine learning techniques; (2) updating published evidence with a more rigorous approach to the consideration of PROGRESS-Plus parameters; and (3) mobilizing knowledge on the current state of evidence that is relevant, equitable, and accessible. This program facilitates partnerships with knowledge users across clinical, research, academic, and community sectors to address the three research objectives through a unifying workflow of exchange, synthesis, and knowledge mobilization. We anticipate that this global collaboration between topic experts and community leaders in equity in brain health will add significant value to the field of TBI by promoting equity-transformative advancements in knowledge synthesis, policy, and practice.","author":"Thaisa Tylinski Sant’Ana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6ca281c20bcb02b2c7b02b4fcc0d28567b9f7c8f8ed6f9894e7250d2ceeadc55","category":"Interdisciplinary"}