{"title":"Profiling and Prioritizing Climate‐Smart Aquaculture Technologies, Innovations, and Management Practices in Kenya","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8843677?af=R","date":1728568992000,"content":"<p>Climate-smart agriculture (CSA) has been promoted in Kenya as a panacea for climate change impacts on agricultural productivity. Consequently, various climate-smart aquaculture technologies, innovations, and management practices (CSA-TIMPs) have been developed, validated, and adopted through the Kenya Climate-Smart Agriculture Project (KCSAP). Nevertheless, there has been no evaluation of the climate-smartness of the CSA-TIMPs for priority setting. In this study, we evaluated and ranked the CSA-TIMPs using a modified Climate-smart Agriculture Prioritization Framework (CSA-PF). The prioritization process included multistakeholder validation workshops involving researchers, fisheries officers, farmers, traders, and policy makers. The climate-smartness scores of the CSA-TIMPs were given based on the CSA pillars (i.e., adaptation, mitigation, and productivity) under various climate-smartness indicators, with a score ranging from −10 (for a negative impact) to +10 (for a positive impact). This resulted in the identification and documentation of forty (40) CSA-TIMPs. Climate-smartness scores varied from 3.8 to 6.1, with higher values indicating strong synergies between the CSA pillars, with productivity having the highest average score of 6.4. The top 5 list of CSA-TIMPs with the best synergies among the CSA pillars was then developed for prioritization. Adoption of these CSA-TIMPs would be instrumental in achieving the CSA triple wins, especially in improving aquaculture productivity. Therefore, sustained efforts in stakeholder engagement, capacity building, and policy support are essential to ensure the successful adoption of CSA-TIMPs in Kenya. A dynamic approach that includes continuous validation, comprehensive monitoring and evaluation, and an enabling environment for adoption will be key to achieving sustainable and scalable impacts.</p>","author":"Kevin Obiero, \nErick Ogello, \nJonathan Munguti, \nJimmy Mboya, \nDomitila Kyule, \nMary Opiyo, \nCecilia Githukia, \nKevin Ouko, \nElijah Kembenya, \nJacob Abwao, \nGeraldine Matolla, \nJosiah Ani, \nSaitoti Sambu, \nMaureen Cheserek, \nKiplangat Ngeno, \nJoel Khobondo, \nMenaga Meenakshisundaram, \nChrysantus Tanga, \nRodrigue Yossa, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6ca80cbeff15fa1050367fcfc3f551d16199d3b68b16109d6258f5dd10f02482","category":"Environment"}