{"title":"Paternal intergenerational plasticity in the plant species Paeonia ostii: Implications for parental fitness and offspring performance","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14506?af=R","date":1712119233000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/164bfe8e-d117-4bf3-8362-27416106269d/fec14506-toc-0001-m.png\" alt=\"Paternal intergenerational plasticity in the plant species Paeonia ostii: Implications for parental fitness and offspring performance\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/12/paternal-intergenerational-plasticity-in-the-plant-species-paeonia-ostii-implications-for-parental-fitness-and-offspring-performance/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nWhile there is long-standing interest in the role of inter- and transgenerational plasticity via the maternal line, it rarely has been studied via the paternal line. Thus, consequences of the paternal environment for parental fitness and for performance of offspring in the environments experienced by either fathers or mothers are not known. We studied the intergenerational plasticity (IGP) of the plant species <i>Paeonia ostii</i> (Paeoniaceae) and tested the hypothesis that exposure of fathers to environmental stress (i) reduces parental fitness and performance of offspring grown under non-stressful conditions, but (ii) mitigates the negative effects of environmental stress on fitness of parents and performance of offspring.\n\nCrosses were made in a greenhouse within six families of <i>P. ostii</i> between parents grown under drought and in a mesic environment, and the offspring of each cross were grown under both dry and mesic conditions. Production and germination of seeds and morphological and physiological traits of offspring were measured as indicators of parental fitness and offspring performance, respectively.\n\nPaternal drought decreased seed number per fruit, except when maternal plants also were grown in drought conditions. Offspring drought decreased seedling performance. However, when fathers experienced drought this negative effect on the offspring was partly mitigated, in particular when mothers also had experienced drought. In contrast, offspring grown in mesic conditions had improved seedling performance, especially when either parent (or both) also were grown in mesic conditions. Such statistical differences remained when seed mass was included as a covariate.\n\nOverall, paternal pollen of <i>P. ostii</i> mediated IGP to drought almost as well as it did for maternal ovules. IGP was adaptive if environments remained constantly dry across generations but maladaptive if environments changed. Hence, under future climate changes, paternal IGP might be both a blessing and a curse, with the blessing occurring when the focal habitat becomes drier and pollen comes from already-dry places, while the curse may dominate in predictably moist habitats surrounded by drier habitats.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/12/paternal-intergenerational-plasticity-in-the-plant-species-paeonia-ostii-implications-for-parental-fitness-and-offspring-performance/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Keliang Zhang, \nYusong Ji, \nLinjun Yao, \nHuina Liu, \nYin Zhang, \nJerry M. Baskin, \nCarol C. Baskin, \nLei Zhang, \nChaohan Xu, \nJun Tao, \nAndreas Prinzing","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"6caa7aaf9ffbb24e99147286053a8da992bc2f06e04e024cd1c5faa36a9b68f6","category":"Environment"}