{"title":"Jasper Stuyven wins Milano-San Remo","link":"https://cyclingtips.com/2021/03/jasper-stuyven-wins-milano-san-remo/","date":1616255465000,"content":"<p>Jasper Stuyven won Milano-San Remo when he timed an attack to perfection, leaving a group of race favourites behind with 2.5 km to go. The Belgian rider was joined by Soren Kragh Andersen and although the two looked like they would not make it to the line, Stuyven just held off a pack of strong sprinters to take the victory.</p>\n\n\n\n<p>“I can’t describe how I feel. It’s unbelievable,&#8221; Stuyven said after the finish. &#8220;We had a plan to go for it, to try to win. I felt really good all day and the finale went well.&nbsp;There was a lot of fast guys in the group after the Poggio, so I knew I had to try all or nothing and I did. If it’d had gone to the line I could have finished fifth or tenth but I preferred to go all in, so I took the biggest victory of my career.&#8221;</p>\n\n\n\n<p>Caleb Ewan (Lotto Soudal) was the best of the rest with Wout van Aert (Team Jumbo-Visma) taking third on the day.</p>\n\n\n\n<h2>How it happened</h2>\n\n\n\n<p>A breakaway of eight headed out early for a long day in front of the peloton. The riders out front were Nicola Conci (Trek-Segafredo), Andrea Peron and Charles Planet (Team Novo Nordisk), Mattia Viel and Filippo Tagliani (Androni-Sidermec), Alessandro Tonelli (Bardiani-CSF-Faizanè), Taco Van der Hoorn (Intermarché-Wanty-Gobert) and Mathias Norsgaard (Movistar). They quickly achieved a 7+ minute gap over the peloton with 280 km to go.</p>\n\n\n\n<p>Tim Declercq patrolled the front of the peloton for Deceuninck-QuickStep for much of the day, and as the race reached the final 100 km the gap had dropped to 3&#8217;18&#8221;. </p>\n\n\n\n<p>Into the final 58 km, the break finally started to splinter. As they took on the Allasio they lost Viel and Martens while the gap to the remaining breakaway dropped below two minutes. </p>\n\n\n\n<p>Unfortunately for Deceuninck-QuickStep Sam Bennett needed to drop back for a bike change around 45 km to go, just as the speeds started to increase on the three Capo climbs. </p>\n\n\n\n<p>The riders out front one by one dropped back behind the field and the final breakaway rider was swept up with 24 km to go. </p>\n\n\n\n<p>With 23.7 km to go on the Cipressa Jumbo-Visma set a pace to shed the pure sprinters. When Van Aert was out of teammates Ineos Grenadiers took over at the front. Fernando Gaviria and Alexander Kristof of  UAE-Team Emirates were two casualties of the increased speeds. </p>\n\n\n\n<p>Ineos Grenadiers held the front of the peloton at the base of the Cipressa but before the base of the Poggio di Sanremo Lotto Soudal and Bora-Hansgrohe took to the front. </p>\n\n\n\n<p>Complete chaos ensued as the race rocketed towards the Poggio. Filippo Ganna (Ineos Grenadiers) was the first to take on the Poggio followed by his teammate Tom Pidcock. </p>\n\n\n\n<p>Elia Viviani (Cofidis Solutions Crédits) was dropped with 8.2 km to go as the pace spat riders from the remaining peloton. Once Ganna clocked out Dylan van Baarle took over for Ineos Grenadiers. </p>\n\n\n\n<p>Julian Alaphillipe (Deceuninck-QuickStep) made his move with 6.4 km to go, with Van Aert glued to his wheel. Van der Poel followed behind the two with Ewan, Michael Matthews (Team BikeExchange), and Stuyven. Van Aert went next with Ewan on his wheel. </p>\n\n\n\n<p>A large group of favourites crested the top of the climb together. Pidcock set a blistering pace on the descent followed by Van Aert, Van der Poel, Peter Sagan (Bora-Hansgrohe), Ewan, Stuyven, and a handful of other riders.</p>\n\n\n\n<p>With 2.5 km at the base of the descent, Stuyven attacked the leading group. The Belgian rider got a bit of a gap as the rest of the leaders looked at each other. Andersen, not about to think twice, took off after the Stuyven. </p>\n\n\n\n<p>It was touch and go in the final kilometre as the chasing group increased speed, and it looked like Stuyven and Andersen had been caught in the final 200 meters but Stuyven timed his sprint perfectly and held off Ewan and Van Aert to take the biggest win of his career so far. </p>\n\n\n\n<h2><strong>Results</strong></h2>\n\n\n\n<p>1 STUYVEN Jasper (Trek-Segafredo) 6:38:06<br>2 EWAN Caleb (Lotto Soudal) st<br>3 VAN AERT Wout (Team Jumbo-Visma) st<br>4 SAGAN Peter (Bora-Hansgrohe) st<br>5 VAN DER POEL Mathieu (Alpecin-Fenix) st<br>6 MATTHEWS Michael (Team BikeExchange) st<br>7 ARANBURU Alex (Astana-Premier Tech) st<br>8 COLBRELLI Sonny (Bahrain-Victorious) st<br>9 KRAGH ANDERSEN Soren (Team DSM) st<br>10 TUGIS Anthony (Team Total Direct Energie) st</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/jasper-stuyven-wins-milano-san-remo/\">Jasper Stuyven wins Milano-San Remo</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6cbc876b4bfb828eed5c9bd632b96c9c6de4221bb8c41858bd0ba280ddb9368f","category":"Cycling"}