{"title":"Apple VP of Hardware Engineering for Home Devices Leaving Company After 25 Years","link":"https://www.macrumors.com/2024/01/29/apple-hardware-engineer-leaving-25-years/","date":1706519789000,"content":"DJ Novotney, one of Apple's top hardware engineering architects, is leaving Apple for Rivian Automotive, <em><a href=\"https://www.bloomberg.com/news/articles/2024-01-28/apple-home-devices-car-veteran-exits-for-top-rivian-product-role?srnd=technology-vp\">Bloomberg</a></em> reported over the weekend.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/04/HomePod-G4-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nNovotney has worked at Apple for 25 years and been highly influential in the development of the iPod and iPhone over multiple generations of the hardware. He also helped lead development of the iPad and bring the Apple Watch to market, according to the report's sources at Apple.\r<br />\n\r<br />\nNovotney was also involved in \"Project Titan,\" the company's stalled attempt to develop an autonomous electric vehicle. Most recently he was the senior executive in charge of developing future home devices, with a special focus on robotics and AI. Apple is said to have explored a future <a href=\"https://www.macrumors.com/2021/04/12/homepod-ipad-with-robotic-arm/\">high-end HomePod speaker</a> that could include an iPad connected via a robotic arm that tracks and follows users around a room.\r<br />\n\r<br />\nNovotney will become senior VP of vehicle programs at Rivian, which makes electric SUVs and pickup trucks. The executive informed colleagues of his exit on Friday, according to the report.\r<br />\n<blockquote>\"Great products are what we do best and I have been so very lucky along the way to be part of so many amazing teams that developed everything from iPod, iPhone, iPad, Watch and so many more,\" Novotney wrote in a memo to colleagues that was seen by Bloomberg. \"Apple has been my life, but now is the time for me to move on and help bring to life a new set of products.\"</blockquote>Several senior Apple executives are leaving or have left the company in recent years. Notable figures among them include Tang Tan, Apple's VP of product design for the iPhone and Apple Watch, who is joining Jony Ive's LoveFrom design firm next month, and hardware technologies leader Steve Hotelling, who left Apple last year. <div>Tag: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/29/apple-hardware-engineer-leaving-25-years/\">Apple VP of Hardware Engineering for Home Devices Leaving Company After 25 Years</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vp-of-hardware-engineering-for-home-devices-leaving-company-after-25-years.2417735/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6cbcfc2633449799af1ab1052e76423e505eb9273163244d7549b44345821ceb","category":"Apple"}