{"title":"Tadej Pogačar is making history","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-pogacar-just-how-good-is-he","date":1633977200000,"content":"\n      <p>In case you missed the memo, Tadej Pogačar is very good at cycling. By the time Tadej turned 23-years-old in September 2021, he’d already bagged two Tour de France titles and his first Monument, <span>Liège–Bastogne–Liège</span>. It wouldn't take him long to add a second one day classic to his <em>palmares</em>.</p>\n<p><span>In the 2021 edition of Il Lombardia, Pogačar attacked on the Passo di Ganda with more than 35km remaining. Although the likes of Vincenzo Nibali — a two-time winner of the 'Race of the Falling Leaves' — had responded to Pogačar’s acceleration initially, the Slovenian was soon alone at the front of the race. The images of Pogačar solo almost mirrored his decisive attack on the Col de Romme at the Tour de France earlier this season.</span></p>\n<div></div>\n<p><span>Pogačar crested the ascent with more than thirty seconds in hand. A solo victory in Bergamo was on the horizon. However, Fausto Masnada — a Bergamo local — had bridged to <span>Pogačar </span>with a daring dive down the mountain. His descent was far from perfect technically — Masnada hardly hit a single apex — yet it proved to be incredibly effective.</span></p>\n<p><span>With world champion Julian Alaphilippe waiting in the chasing group, Masnada was ordered not to work with Pogačar by his Deceuninck-Quick Step principals. </span><span>That didn’t throw off the Slovenian, though, who carried Masnada to the final metres in Bergamo. The chasing group looked to be closing the gap, but a lack of cooperation swiftly taught us that the winner would come from the leading duo.</span></p>\n<p><span>The home crowd cheered for Masnada, but he’d have to settle for second place after Pogačar capped off an emphatic display with an equally dominant sprint. At 23-years-old, Tadej Pogačar had become a double Monument winner.</span></p>\n<p><span>After the race, <span>Pogačar </span>spoke about how he dealt with Masnada’s company. “At first, I thought when I attacked that someone would come with me. I just went solo. I knew that Masnada knows these roads pretty well. I knew that he would come back in the technical part of the descent, although I didn’t know that he wouldn’t work with me. In the sprint, I knew what to do.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FRED7242_1024x1024.jpg?v=1633956664\" /><em>Pogačar rides away on the Passo di Ganda. (Image credit: RCS Sport / LaPresse)</em></span></p>\n<p><span>With <span>Pogačar's season in the books</span>, we can take stock of his performances this year.</span></p>\n<p><span>The same rider rarely wins </span><span>Il Lombardia and the Tour de France in the same season. The feat has only been achieved by three icons of the sport: Fausto Coppi, Eddy Merckx and Bernard Hinault, who achieved the double in 1979.</span></p>\n<p><span>However, Pogačar also won <span>Liège–Bastogne–Liège</span> earlier this season. The trio of race victories has only ever been matched By Eddy Merckx, who won <span>Liège</span>, Il Lombardia and the Tour de France in both 1971 and 1972. Fausto Coppi is the only other rider to win the Tour de France and two Monuments in a single year — he won Milan-Sanremo in his impressive 1949 campaign. </span>That makes <span>Pogačar the first rider to win two Monuments and the Tour de France in a single season in 49 years.</span></p>\n<p><span><span>And then, we must consider the Slovenian's age. Merckx turned 26 in his great 1971 season, whilst Coppi was 30 in 1949. Pogačar has only just turned 23, making him the youngest rider ever to couple two Monuments with the Tour de France.</span></span></p>\n<p><span>Regardless of age, Pogačar’s ‘21 season u<span>ndoubtedly </span>goes down as one of the best ever.</span></p>\n<p><span>When asked about his accomplishments this year, after a brief smile, which perhaps indicated disbelief, <span>Pogačar </span><span>replied</span> “I don’t know, for me, every victory is important. Especially this one because I’ve been dreaming of starting Il Lombardia and to race with the best here in Italy. Now I’m here and I took the victory, it’s crazy.”</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1328696093-min_1024x1024.jpg?v=1633956627\" />Pogačar celebrates one of his three stage victories at the 2021 Tour de France (Image credit: Michael Steele/Getty Images)</span></i></p>\n<p><span>So what lies next for Tadej Pogačar?</span></p>\n<p><span>Well, the clue may lie in the other Monument dominated by Merckx: Milan-Sanremo. Merckx won Sanremo seven times throughout his career, including in 1971 and 1972. Coppi also won Sanremo three times between 1946 and 1949.</span></p>\n<p><span>Will Sanremo be next on <span>Pogačar's </span>hit list? <span>He made his Milan-</span><span>Sanremo debut earlier this season, finishing twelfth.</span> </span><span>In theory, t</span><span>he Poggio could act as a launch pad for <span>Pogačar </span>to demonstrate his explosive climbing skills, and if he does arrive in Sanremo with company, his sprint cannot be underrated.</span></p>\n<p><span>Pogačar has also mentioned his aspirations to race the Giro d’Italia for the first time at some point in the future. In <a href=\"https://www.gazzetta.it/festival-sport-trento/10-10-2021/pogacar-ora-voglio-diventare-campione-mondo-me-slovenia-4201741617012.shtml\" target=\"_blank\">an interview</a> with La Gazzetta dello Sport, <span>Pogačar </span>said, “The pink jersey is another of the beautiful jerseys in cycling. I don't know when I'll race it, you should ask Mauro Gianetti, my sports director. I think I'll be at the start in the future. It is a race that I really like; every now and then it crosses over into Slovenia.”</span></p>\n<p><span>No matter how historic <span>Pogačar's </span>achievements already are, he’s staying present and enjoying the competition. “</span><span>I’m hearing a lot about having made history today, but I don’t think about it. I just enjoy riding my bike.”</span></p>\n<p><em><span>Cover image: Tim de Waele/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6cc478664a7062bf4760f0856a33bfb0ebfde23702ac6deaf3979f2026093f0b","category":"Cycling"}