{"title":"Combined analysis of single-cell sequencing and bulk transcriptome sequencing reveals new mechanisms for non-healing diabetic foot ulcers","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306248","date":1719842400000,"content":"<p>by Ran Chen, Lijun Zou</p>\r\n\r\nDiabetic foot ulcers (DFUs) pose a significant challenge in diabetes care. Yet, a comprehensive understanding of the underlying biological disparities between healing and non-healing DFUs remains elusive. We conducted bioinformatics analysis of publicly available transcriptome sequencing data in an attempt to elucidate these differences. Our analysis encompassed differential analysis to unveil shifts in cell composition and gene expression profiles between non-healing and healing DFUs. Cell communication alterations were explored employing the Cellchat R package. Pseudotime analysis and cytoTRACE allowed us to dissect the heterogeneity within fibroblast subpopulations. Our findings unveiled disruptions in various cell types, localized low-grade inflammation, compromised systemic antigen processing and presentation, and extensive extracellular matrix signaling disarray in non-healing DFU patients. Some of these anomalies partially reverted in healing DFUs, particularly within the abnormal ECM-receptor signaling pathway. Furthermore, we distinguished distinct fibroblast subpopulations in non-healing and healing DFUs, each with unique biological functions. Healing-associated fibroblasts exhibited heightened extracellular matrix (ECM) remodeling and a robust wound healing response, while non-healing-associated fibroblasts showed signs of cellular senescence and complement activation, among other characteristics. This analysis offers profound insights into the wound healing microenvironment, identifies pivotal cell types for DFU healing promotion, and reveals potential therapeutic targets for DFU management.","author":"Ran Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6ccb75493807be1648fd56774b07673138d50a49b5aaf9d10fa63610fa1cff2c","category":"Interdisciplinary"}