{"title":"What Saul Bass Can Teach Us About Web Design","link":"https://smashingmagazine.com/2021/02/saul-bass-teach-web-design/","date":1613131200000,"content":"<p>Web design exists at a lovely intersection of different disciplines. In previous articles, I’ve written about the lessons to be learned <a href=\"https://www.smashingmagazine.com/2019/11/newspapers-teach-web-design/\">from newspapers</a> and <a href=\"https://www.smashingmagazine.com/2020/06/vitruvius-web-design/\">from ancient Roman architects</a>. This time we’ll be looking at one of the all-time great graphic designers — Saul Bass. </p>\n<p>Saul Bass is a graphic design legend. Responsible for title sequences in films like <em>North by Northwest</em> and <em>Anatomy of a Murder</em>, as well as a number of iconic posters and brand logos over the years. His work, in the words of Martin Scorses, “distilled the poetry of the modern, industrialized world.”</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/46ca50c6-36dd-4a2d-9890-5d2c02363db7/1-logos-designed-by-saul-bass.png\" /></p>\n<p>We’re in a different world now, a breakneck speed digital world, but that carries with it its own poetry. Although the backdrop has changed, Saul Bass’s methods and mindset have stood the test of time, and web designers would do well to remember them.</p>\n<h3>Making The Mundane Extraordinary</h3>\n<p>Before getting into the particulars of Saul Bass and his work, it’s worth outlining his approach to design in broader terms. Big characters inspire big ideas, but as is so often the case the real trick is in the details. </p>\n<p>Concerning his approach to title sequences, Bass said: </p>\n<blockquote>“Deal with ordinary things, things that we know so well that we’ve ceased to see them; deal with them in a way that allows us to understand them anew — in a sense making the ordinary extraordinary.”<br /><br />— Saul Bass (<a href=\"https://medium.com/art-science/saul-bass-on-his-approach-to-designing-movie-title-sequences-47fd537c457b\">Source</a>)</blockquote>\n\n<p>A similar ethos can and should be applied to web design. <strong>As we look at his work, yes, by all means envision homepage splashes, but also think about buttons and signup forms and legal disclaimers.</strong> There is just as much beauty to be found in the little things. Sometimes more. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e8be2aba-edc1-4d51-8d14-dccf3ed6c1c5/2-grand-prix-film-poster.png\" /></p>\n<p>That Bass is even renowned for title sequences is a testament to his creativity. Before Saul Bass entered the scene film titles were usually dull affairs, names and static images delivered with all the bizazz of divorce papers. Under his eye, they became pieces of art, statements on the tone, and texture of what was to come. As he so brilliantly put it, </p>\n<blockquote>“Design is thinking made visual.”<br /><br />— Saul Bass</blockquote>\n\n<p>You can find more about Saul Bass' vision of his work and his influences in the following pages and videos:</p>\n<ul>\n<li><a href=\"https://monoskop.org/images/a/af/Kepes_Gyorgy_Language_of_Vision.pdf\"><em>Language of Vision</em></a> by György Kepes, an early mentor of Bass</li>\n<li><a href=\"https://www.youtube.com/watch?v=nRpGSDsu_tg\">‘Saul Bass’s Movie Posters’</a>, a video essay by The Royal Ocean Film Society, fittingly made in portrait orientation!</li>\n<li><a href=\"https://www.nytimes.com/2011/11/07/arts/design/saul-bass-made-the-title-sequence-into-a-film-star.html\">The Man Who Made the Title Sequence Into a Film Star</a> by Alice Rawsthorn</li>\n<li><a href=\"https://youtu.be/CeAHOVcWvoc\"><em>Why Man Creates</em></a>, the Oscar-winning short by Saul Bass and Mayo Simon</li>\n</ul>\n<h3>Color</h3>\n<p>Let’s start with the most basic aspect — color. Bass once said that ‘audience involvement with a film should begin with its first frame.’ So too should visitor involvement begin upon first load. We process the colors and arrangement of a website before we have time to process its content. You’ll find no greater advocate for quality content than me, but it is hampered if not given a quality canvas to unfold on.</p>\n<p>For Bass is typically translated into simple, vivid color palettes with <strong>no more than three of four colors</strong>. Not too busy, but plenty of pop. Red, white, and black is one of the golden color combinations — one Bass put to use many times. Bright colors don’t always mean ‘loud’, sometimes they mean ‘striking.’</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a011b55d-2d03-46ee-a25f-7c77a4cdfacb/3-film-posters-designed-by-saul-bass.png\" /></p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c53228c6-52ea-41a4-bd8a-bf807451ed43/4-tone-poems-of-color-album-cover.png\" /></p>\n<p>What does this mean in terms of web design? Well, a little more than ‘use bright colors,’ I’m afraid. Study color theory then apply it to your projects in tasteful, audacious ways. Several excellent articles on the subjects on the subject listed at the end of this section, and <a href=\"https://www.smashingmagazine.com/category/colors/\">the ‘Colors’ category of <em>Smashing Magazine</em></a> is home to plenty more. It’s well worth the attention. The right palette can set a tone before visitors have even processed what they’re looking at. </p>\n<p>For an uncannily Saul Bass-esque example of color and shape in action on the web, take <a href=\"https://ottendorf.space/\">the Holiday Center for Working Youth in Ottendorf</a>. What better way to celebrate bold, functional architecture than through bold, functional design? It’s like a <em>Vertigo</em> poster in digital form. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ce2e03af-576c-4925-b323-144cdb543ac5/5-ottendorf-youth-center-homepage.png\" /></p>\n<p>Red, white, and black isn’t always the answer (though it is an incredibly sharp combination). The right mix depends on the story you’re trying to tell, and how you’re trying to tell it. Saul Bass knew full well that color is an incredibly powerful tool, and it’s one still often underused in the prim, white-space world of today’s web.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a848f946-343c-4187-8b17-7424ac0e820b/6-lubimovka-festival-homepage.png\" /></p>\n<p>Audience involvement with a website begins with color, so make it count. For those unsure where to start here are a selection of Smashing articles on the topic:</p>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2010/01/color-theory-for-designers-part-1-the-meaning-of-color/\">Color Theory for Designers, Part 1: The Meaning of Color</a> by Cameron Chapman</li>\n<li><a href=\"https://www.smashingmagazine.com/2010/02/color-theory-for-designers-part-2-understanding-concepts-and-terminology/\">Color Theory for Designers, Part 2: Understanding Concepts And Terminology</a> by Cameron Chapman</li>\n<li><a href=\"https://www.smashingmagazine.com/2010/02/color-theory-for-designer-part-3-creating-your-own-color-palettes/\">Color Theory for Designers, Part 3: Creating Your Own Color Palettes</a> by Cameron Chapman</li>\n<li><a href=\"https://www.smashingmagazine.com/2016/04/web-developer-guide-color/\">A Simple Web Developer’s Color Guide</a> by Laura Elizabeth</li>\n<li><a href=\"https://www.smashingmagazine.com/2012/10/the-code-side-of-color/\">Hex Color: The Code Side Of Color</a> by Ben Gremillio</li>\n</ul>\n<h3>Typography</h3>\n<p>Words, words, words. Design may be thinking made visual, but sometimes the best way to say something is to come right out with it in words. Bass had a typographical style almost as distinctive as his visual one. Rough, hand-drawn, and almost always all-caps, he made words powerful without being overbearing.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/df3efb57-8317-4bea-aa5f-497a950d9de3/7-north-by-northwest-opening-titles.png\" /></p>\n<p>Fonts can tell stories too. They communicate tone of voice, formality, importance, and structure, among other things. Combined with a strong color scheme they can make copy dance where it might otherwise slouch along feeling sorry for itself.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c98878b9-0601-4703-bd87-4c42739b1dff/8-kotak-toys-homepage.png\" /></p>\n<p>Copywriter Jon Ryder showcases this beautifully on <a href=\"https://www.fullstopnewparagraph.co.uk/\">his personal website</a>, which is the full package of strong color and bold, playful typography. As you click the prompts the copy rearranges and edits itself. It’s a brilliant idea elegantly executed. If Saul Bass was around to design portfolios this is the kind of thing you’d expect him to come up with.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f2848d90-28fe-4959-ac7a-283da074c698/9-jon-ryder-portfolio-website-homepage.png\" /></p>\n<p>Art of the Title refers to Bass’s approach as <a href=\"https://www.artofthetitle.com/designer/saul-bass/\">‘kinetic typography’</a>, and I think that’s a lovely turn of phrase to keep in mind when choosing font combinations for the web. <strong>Yes, Times New Roman or Arial will do a job, but with the wealth of free fonts and CSS stylings available why wouldn’t want to try giving your words more life?</strong> It’s not always appropriate, but sometimes it can be just the ticket. </p>\n<h4>Resources</h4>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2017/02/30-free-fonts-with-personality-and-style/\">Free Fonts With Personality And Style</a> by Cosima Mielke</li>\n<li><a href=\"https://www.smashingmagazine.com/2018/06/reference-guide-typography-mobile-web-design/\">A Reference Guide For Typography In Mobile Web Design</a> by Suzanne Scacca</li>\n<li><a href=\"https://open-foundry.com/\">Open Foundry</a>, curated and open-source fonts</li>\n<li><a href=\"https://fonts.google.com/\">Google Fonts</a></li>\n<li><a href=\"https://typographica.org/on-typography/saul-bass-website-and-hitchcock-font-are-back/\">Hitchcock</a> font by designer Matt Terich, for fun</li>\n</ul>\n<h3>Drawing</h3>\n<p>This one is as much about the process as it is about websites themselves. Saul Bass was a big believer in drawing. Even as technologies advanced and opportunities arose to streamline the design process, he understood there is no substitute for working with your hands when trying to get ideas out of your head and into the world. To aspiring designers, he advised, </p>\n<blockquote>“Learn to draw. If you don’t, you’re going to live your life getting around that and trying to compensate for that.”</blockquote>\n\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b49ec5c0-a3cf-49c9-9a12-138a088b16ee/10-psycho-shower-scene-storyboard.png\" /></p>\n<p>Whatever it is you’re dealing with — page layout, logos, icons — there is no faster way to get the ideas out of your head than by drawing them. In this day and age that doesn’t necessarily mean pen and paper, you can always use tablets and like, but the underlying principle is the same. There are no presets — just you and your ideas. I’m no Saul Bass, but I’ve had a few good ideas in my time (at least two or three) and most of them happened almost by accident in the flow drawing.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c84983a0-df31-4e3f-adb1-76353b298f99/11-new-york-times-front-page-pencil-sketch.png\" /></p>\n<p>The value of drawing pops up in the unlikeliest of places and I love it every time I do. <a href=\"https://www.nytimes.com/2017/05/10/insider/an-fbi-director-is-terminated-and-a-front-page-is-too.html\">Every front page of <em>The New York Times</em> starts as a hand-drawn pencil sketch</a>, for example. Are there fancy computer programs that could do a similar job? Sure, and they’re used eventually, but they’re not used first. It doesn’t matter if they’re brainstorming corporate logos, revamping a website’s homepage, or preparing the front page of a newspaper — designers draw.</p>\n<p>Here are some good articles about the value of drawing in a web design context:</p>\n<ul>\n<li><a href=\"https://www.secretstache.com/blog/importance-sketching-web-design/\">The Importance of Sketching in Web Design</a> by Carrie Cousins</li>\n<li><a href=\"https://www.researchgate.net/publication/295397569_Significance_of_sketch_in_creativity_process_related_to_graphic_design_education\">Significance of Sketch in Creativity Process Related to Graphic Design Education</a> by Ezgi Karaata</li>\n</ul>\n<h3>An Interdisciplinary Approach</h3>\n<p>It’s near impossible to fix one label on Saul Bass. At any given time he was a graphic designer, a filmmaker, a photographer, an architect. The list goes on and on. Having to be literate in so many areas was a necessity, but it was also a genuine passion, a constant curiosity. </p>\n<p>Take the title sequence of <em>Vertigo</em>. Its iconic spiral aesthetic dated back years earlier <a href=\"https://www.nytimes.com/2011/11/07/arts/design/saul-bass-made-the-title-sequence-into-a-film-star.html\">when Bass came across spiral diagrams by 19th-century French mathematician Jules-Antoine Lissajous</a>. When asked to work on Vertigo, the idea clicked into place immediately. Mathematical theory found its way into an Alfred Hitchcock film poster, and who are we to argue with the results?  </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3b1a1339-8f10-471e-ae46-f6355354504b/12-jules-antoine-lissajous-spirals.png\" /></p>\n<p>Having a <strong>specialization</strong> is obviously important in any field, but there is so much to be gained from stepping outside our lanes. Anyone with even a casual interest in web development has almost certainly found themselves needing a similarly protean approach — whether they wanted to or not. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c477735d-d2b7-4112-ad0f-5b18f3f7fd96/13-tonya-baydina-portfolio-website-homepage.png\" /></p>\n<p>Engineering, design, UX, typography, copywriting, ethics, law… much like in architecture there are few fields that <em>don’t</em> enrich one’s understanding of web design, so don’t be afraid to immerse yourself in the unfamiliar. You just might find the perfect inspiration.     </p>\n<h3>Iterate, Collaborate</h3>\n<p>Even the masters are students, always learning, always iterating, often collaborating. Bass of course had strong ideas about what form his projects ought to take, but it was not his way or the highway. Look no further than <a href=\"https://www.itsnicethat.com/articles/saul-bass-the-shining\">Stanley Kubrick’s feedback on potential posters for <em>The Shining</em></a>. The two went through <em>hundreds</em> of drafts together. In one letter Hitchcock wrote, “beautifully done but I don’t think any of them are right.”</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6d255f32-085d-4305-b722-6a2da51a50f3/14-rejectec-poster-design-the-shining.png\" /></p>\n<p>One can only imagine how many hours Bass slaved over those mockups, but when you look at those rejected it’s hard to disagree with Kubrick; beautifully done, but not quite right. I think the final result was worth the work, don’t you?</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/58bc588f-3f8f-4cdd-855e-aac9da76625f/15-the-shining-film-poster.png\" /></p>\n<p>We live and work in a largely corporate world. Like Bass, that doesn’t have to hamstring the things you make. Hold your ground when that’s what the moment calls for, but always be on the lookout for genuine partners. They are out there. The client isn’t always right, but they’re not always wrong either. Collaboration often brings out the best in a project, and even geniuses have to work like hell to get it right. </p>\n<p>There are few things more valuable than feedback from people you trust. It’s hard to beat that cool, communicative flow where egos and insecurities are out of the picture and it’s all about making the thing as good as it can be. </p>\n<p>Here are a couple of articles on iteration and experimentation in web design that I’ve really enjoyed working on:</p>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2020/10/principles-visual-communication/\">The Principles Of Visual Communication</a> by Elizabeth Lin</li>\n<li><a href=\"https://www.smashingmagazine.com/2020/11/playfulness-code-supercharge-fun-learning/\">Playfulness In Code: Supercharge Your Learning By Having Fun</a> by Jhey Tompkins</li>\n</ul>\n<h3>Beauty For Beauty’s Sake</h3>\n<p>No-one dreams of doing corporate art, but Bass is a model example of excellence thriving in that world. Decades it still holds its own and is oftentimes genuinely beautiful. He showed better than most that designing for a living didn’t mean creativity couldn’t thrive. <strong>Whether you’re making brand logos or homepages there’s a lot to be said for creatives fighting their corner. You owe it to the work.</strong></p>\n<p>Bass put it better than I ever could.</p>\n<blockquote>“I want everything we do to be beautiful. I don’t give a damn whether the client understands that that’s worth anything, or that the client thinks it’s worth anything, or whether it is worth anything. It’s worth it to me. It’s the way I want to live my life. I want to make beautiful things, even if nobody cares.”</blockquote>\n\n<p>Everything else stems from this ethos, from beauty for beauty’s sake. From color to iteration to delight in the little details, Saul Bass showed the way for graphic and web designers alike. Be audacious, curious, and learning all the time. Make beautiful things, even if nobody cares. </p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"6cd35afc55799141d662c3a9e8b569213173145ddf333f5805918a45ce3b2409","category":"Tech"}