{"title":"An examination of early socioeconomic status and neighborhood disadvantage as independent predictors of antisocial behavior: A longitudinal adoption study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301765","date":1714399200000,"content":"<p>by Shelley A. Gresko, Laura K. Hink, Robin P. Corley, Chandra A. Reynolds, Elizabeth Muñoz, Soo Hyun Rhee</p>\r\n\r\nThe present study examined early socioeconomic status (SES) and neighborhood disadvantage (ND) as independent predictors of antisocial behavior (ASB) and addressed the etiology of the associations (i.e., genes versus the environment) using a longitudinal adoption design. Prospective data from the Colorado Adoption Project (435 adoptees, 598 nonadopted children, 526 biological grandparents of adoptees, 481 adoptive parents, and 617 nonadoptive parents including biological parents of unrelated siblings of adoptees) were examined. SES and ND were assessed during infancy and ASB was evaluated from ages four through 16 using parent and teacher report. Associations between predictors and ASB were compared across adoptive and nonadoptive families and sex. Early SES was a nominally significant, independent predictor of antisocial ASB, such that lower SES predicted higher levels of ASB in nonadoptive families only. ND was not associated with ASB. Associations were consistent across aggression and delinquency, and neither SES nor ND was associated with change in ASB over time. Nominally significant associations did not remain significant after controlling for multiple testing. As such, despite nonsignificant differences in associations across sex or adoptive status, we were unable to make definitive conclusions regarding the genetic versus environmental etiology of or sex differences in the influence of SES and ND on ASB. Despite inconclusive findings, in nonadoptees, results were consistent—in effect size and direction—with previous studies in the literature indicating that lower SES is associated with increased risk for ASB.","author":"Shelley A. Gresko","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6cdc68ee8113dd42d9c50a5acee5d6682b2bf9d0eae4381f472f9095bf8dbd24","category":"Interdisciplinary"}