{"title":"Fitbit Makes Some Premium Subscription Features Free","link":"https://www.dcrainmaker.com/2023/03/fitbit-makes-some-premium-subscription-features-free.html","date":1678822938000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/03/FitbitGooglePixel.jpg\"><img title=\"FitbitGooglePixel\" src=\"https://media.dcrainmaker.com/images/2023/03/FitbitGooglePixel_thumb.jpg\" alt=\"FitbitGooglePixel\" width=\"720\" height=\"480\" /></a></p>\n<p>Fitbit has announced that they’ll be making a set of their Fitbit Premium subscription features free to all Fitbit users – including for Pixel Watch users which leverage the Fitbit features. These features are mostly historical data access features (versus things like coaching). The change is effective today/immediately, but may take till the end of the month to roll out for all users.</p>\n<p>Fitbit says specifically that data within the “Fitbit Health Metrics Dashboard” will now be free to all users, which includes trends for both 30-day and 90-day timeframes. This includes the following stats (according to Fitbit):</p>\n<ul>\n<li><b>Breathing rate:</b> This metric is the number of breaths you take per minute.</li>\n<li><b>Heart-rate variability (HRV):</b> This metric is the variation in time between heartbeats.</li>\n<li><b>Skin temperature:</b> This metric is the variation in your skin temperature taken from your wrist while you sleep.</li>\n<li><b>Oxygen saturation (SpO2):</b> This metric estimates the amount of oxygen in your blood, and will only be available on compatible devices.</li>\n<li><b>Resting heart rate (RHR):</b> This metric is the number of times your heart beats per minute when you are still and well-rested.</li>\n</ul>\n<p>Note that some features remain Premium, such as <a href=\"https://www.dcrainmaker.com/2021/11/fitbit-daily-readiness-score-review-heres-how-it-works.html\">Fitbit’s Daily Readiness Score</a>, which combines a number of data layers together such as sleep and workout history, to figure out whether you should do a workout or take a nap (or some combination of the two of those). Same goes for features like sleep restlessness.</p>\n<p>So while Fitbit hasn’t gone all the way to removing the Fitbit Premium subscription, this is a notable first step.</p>\n<p>I’d been meaning to finish writing a post I started drafting last fall, which was tentatively titled “Fitbit’s Subscription Misinformation Is Killing Their Own Products”. The point of the post was that overwhelmingly, the conversation I’ve seen following Fitbit product releases is no longer about the products or features. Instead, it’s become about all the features people think they need a subscription for.</p>\n<p>I can’t overstate how mind-boggling it is to see how overwhelming this assumption is in the comments section of reviews here as well as YouTube – let alone countless other places on the internet.</p>\n<p>The problem? It’s actually largely untrue.</p>\n<p>Sure, there were historical metrics like the above listed ones that were paywalled beyond 7-day data. But almost everything else wasn’t actually paywalled. I outlined this in the side-by-side post I did last spring <a href=\"https://www.dcrainmaker.com/2022/05/vivosmart-ridiculously-comparison.html\">between the Fitbit Charge 5 and the Garmin Vivosmart 5</a>. And the kicker was that for things like HRV and Skin Temp, their competitors didn’t offer those at those price points, or for free. Leaving really only three comparative metrics that required premium for longer data periods (Breathing Rate, SpO2, and Resting HR).  All other historical data like steps, sleep, workouts, stairs, and everything in between was actually fully available for free.</p>\n<p>In other words, virtually every comment I saw in reviews led people to believe they couldn’t access these stats without paying extra – when in reality they could. These are reviews on YouTube for Fitbit Charge products that each have +/- a million views on them – with lots of people reading comments as part of their purchasing decision.</p>\n<p>For example, I did my entire <a href=\"https://www.dcrainmaker.com/2022/10/fitbit-inspire-3-in-depth-review.html\">Fitbit Inspire 3 In-Depth Review</a> last fall on a free account, no paid subscription. And here’s the sleep data you see:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2022/10/IMG_7472.png\"><img title=\"IMG_7472\" src=\"https://media.dcrainmaker.com/images/2022/10/IMG_7472_thumb.png\" alt=\"IMG_7472\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2022/10/IMG_7473.png\"><img title=\"IMG_7473\" src=\"https://media.dcrainmaker.com/images/2022/10/IMG_7473_thumb.png\" alt=\"IMG_7473\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2022/10/IMG_7474.png\"><img title=\"IMG_7474\" src=\"https://media.dcrainmaker.com/images/2022/10/IMG_7474_thumb.png\" alt=\"IMG_7474\" width=\"237\" height=\"510\" /></a></p>\n<p>Thus the point of my drafted post I never finished was that Fitbit was killing their own hardware success trying to sell a subscription that I don’t think was actually overcoming the loss of product revenue. Add to this their competitors like Apple and Garmin offering everything for free. We saw Garmin shift their PR and marketing approach last winter from being subtle about this point, to now being overtly sharp about it. It’s literally a line-item in their press releases now:</p>\n<blockquote><p>“Designed for customers seeking a simpler solution for monitoring their wellbeing, the vívosmart 5 features at-a-glance health stats for Pulse Ox, 24/7 heart rate monitoring, Body Battery energy monitoring, all-day stress tracking and more <a name=\"_Hlk98744980\"></a>— <strong>no subscription required.</strong><sup>””</sup></p></blockquote>\n<p>And <a href=\"https://www.theverge.com/22882401/garmin-vivomove-sport-review-fitness-tracker-smartwatch-wearables\">Garmin’s executives have doubled-down</a> on that in multiple interviews as well:</p>\n<blockquote><p>“It’s your data,” [Phil] McClendon said. “We’re not charging you the ability to access your data, and that’s something we will continue to do and that we feel very strongly about.”</p></blockquote>\n<p>Obviously, it’s not just Garmin, but most of Fitbit’s competitors. Companies like Samsung offered this data via their S Health platform for free, as does Apple via their own Fitness app and Apple Health vault. Plus a slate of smaller or more indirect competitors like Polar, Suunto, Huawei, and many more. As Google slowly shifts Fitbit’s platform to be a more direct competitor to the Apple Watch for <a href=\"https://www.dcrainmaker.com/2022/10/google-pixel-watch-in-depth-review-a-promising-start.html\">Google’s own Pixel Watch</a>, it needs to find a way to kill off that line of “but a subscription” questioning for consumers – at least for core data features. Coaching and classes is one thing, but not looking at your own data.</p>\n<p>But hey, given all the other weird things that <a href=\"https://www.theverge.com/2023/2/24/23612141/fitbit-google-server-outage-challenges-wearables\">Fitbit has decided to kill off in recent months</a>, at least this time they killed a bad thing. Hopefully this trend correction continues.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"6ceaa19ef02ef12c75982489a957ec389ee575873b2d5ef6ba47cc7d6c6ebca8","category":"Cycling"}