{"title":"That foldable MacBook rumor makes more sense than you’d think","link":"https://www.macworld.com/article/2258965/apple-foldable-macbook.html","date":1709816996000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple remains oddly reticent about entering the burgeoning foldable market, with the first <a href=\"https://www.macworld.com/article/673515/foldable-iphone-release-date-rumours-patents.html\">folding iPhone</a> still nowhere to be seen an astonishing five years after Samsung unveiled the <a href=\"https://www.techadvisor.com/article/720129/samsung-galaxy-fold-review.html\" target=\"_blank\">first Galaxy Fold</a>. It’s tempting to assume, at this point, that Apple might have decided to skip this market entirely and focus on mixed reality.</p>\n\n\n\n<p>But a new report suggests that, while there are currently no plans for either a foldable iPhone or a foldable iPad, Apple does have something in mind. And that is a foldable… MacBook.</p>\n\n\n\n<p>On Twitter/X Thursday, the widely respected tech analyst Ming-Chi Kuo posted his thoughts on Apple’s plans in this area, revealing that right now, “Apple’s only foldable product with a clear development schedule is the 20.3-inch MacBook, expected to enter mass production in 2027.”</p>\n\n\n\n<figure><div>\n<blockquote><p>最近我多次被詢問蘋果是否計劃在 2025 年或 2026 年量產可折疊 iPhone 或 iPad。我的最新調查顯示，蘋果目前唯一有明確開發時程的可折疊產品，只有配備約20.3\"顯示器、並預計在2027年量產的MacBook。<br /><br />—<br />Recently, I've received many inquiries about whether Apple plans to mass-produce the…</p>— 郭明錤 (Ming-Chi Kuo) (@mingchikuo) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mingchikuo/status/1765563986089783322?ref_src=twsrc%5Etfw&amp;xcust=1-1-2258965-1-0-0&amp;sref=https://www.macworld.com/feed\">March 7, 2024</a></blockquote>\n</div></figure>\n\n\n\n<p>Honest first reaction? Confusion. MacBooks <em>already</em> fold; whoever came up with the original clamshell laptop design was really on to something, but that happened more than <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Grid_Compass&amp;xcust=1-1-2258965-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">40 years ago</a>. So this must mean something else.</p>\n\n\n\n<p>At 20.3 inches, the rumored device would have the largest ever screen on an Apple laptop. In order to make this work as a portable machine (after all, there’s a reason why the company doesn’t currently go any bigger than 16.2 inches) the hinge will bisect the screen itself, rather than linking the screen and keyboard as on the existing MacBook range. As for the keyboard itself? Gone. At least as a hardware component.</p>\n\n\n\n<p>The lower half of the screen (which will need to be a touchscreen) will act as a software keyboard when required, potentially aided by haptic feedback to improve typing accuracy. When you’re not typing, you can have this lower screen behave as part of the interface, or indeed unfold it completely and place the whole ‘laptop’ horizontally as a sort of colossal iPad for watching movies. Or for connecting to a separate Bluetooth mouse and keyboard for a desktop-esque computing experience. The rumor also implies a touch-based version of macOS, which in itself would be a game-changer. </p>\n\n\n\n<p>It would be reasonable to be skeptical about all of this. Foldables are a notoriously tricky product category because they create so many headaches around fragility, screen quality, repeat actions leading to joint wear and tear, excessive thickness when closed and more. Apple will want to get this right before shipping, and there are many opportunities between now and 2027 for the company to get cold feet and close things down.</p>\n\n\n\n<p>But if Apple <em>can</em> get this right? This could be a very exciting prospect indeed.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6ceb07e896d1de811e4e3315cd8cc5a98cbb50e76add144c110c86645c19e7b2","category":"Apple"}