{"title":"Omloop Het Nieuwsblad: Essential info for the opening weekend cobbled Classic","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad","date":1708423200000,"content":"\n      <p><b>Date: </b><span>Saturday February 24, 2024 <br /></span><b>Start:</b><span> Ghent, Flanders <br /></span><b>Finish:</b><span> Ninove, Flanders <br /></span><b>Defending champions:</b><span> Dylan van Baarle (Jumbo-Lease a Bike) and Lotte Kopecky (SD Worx) </span></p>\n<p><span>Omloop Het Nieuwsblad is a one-day race held in Belgium and is the first WorldTour race to be held in Europe. The men's race first began in 1945 and has become the opening of the Flanders Classics season. Starting in Ghent and finishing in Ninove, the route covers the hills of the Flemish Ardennes and includes the iconic cobbled streets of Belgium. </span></p>\n<p>Its early place in the racing calendar means that the one-day race is often associated with cold weather – a contrast to previous three WorldTour races in the Middle East and Australia. Over the years, Omloop Het Nieuwsblad has been moved or cancelled due to bad weather and now the race organisers keep a close eye on the forecasts and will make any changes to the route if they feel it is necessary. </p><div></div>\n<div></div>\n<p>Only three riders have won the cobbled race three times: Ernest Sterckx (1952, 1953 and 1956), Joseph Bruyère (1974, 1975 and 1980), and Peter Van Petegem (1997, 1998 and 2002). It’s not too much of a surprise that almost all the record holders for winning Omloop Het Nieuwsblad more than once have come from Belgium. Out of the 77 races held so far in its history, 58 of those who have taken the title have been from the race's home country. British rider Ian Stannard is the only non-Belgium rider to make it onto the honours list for winning the race on more than one occasion having won the semi-Classic in 2014 and 2015. </p>\n<p>Team Visma-Lease a Bike have won the previous two editions with Wout van Aert taking the top spot in 2022 and Dylan van Baarle soloing to victory in 2023. Both of the previous winners will be on the start line for the 2024 edition, hoping to win a second title, alongside team-mates Tiesj Benoot and Christophe Laporte, both strong Classics riders. Knocking on the door of the title last year, however, was 21-year-old rider Arnaud De Lie (Lotto Dstny), who is back again, looking for top honours. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1469563123.jpg?v=1704375866\" /><em>Image: Getty </em></p>\n<h3><b>Omloop Het Nieuwsblad men’s teams: </b></h3>\n<p><em>Up-to-date as of January 4, 2024</em></p>\n<ul>\n<li>Team dsm-firmenich PostNL</li>\n<li>Alpecin-Deceuninck</li>\n<li>Arkéa-B&amp;B Hotels</li>\n<li>Astana Qazaqstan</li>\n<li>Bahrain-Victorious</li>\n<li>Decathlon AG2R La Mondiale Team</li>\n<li>Groupama-FDJ</li>\n<li>Ineos Grenadiers</li>\n<li>Soudal–Quick-Step</li>\n<li>EF Education-EasyPost</li>\n<li>Lotto Dstny</li>\n<li>Team Jayco Alula</li>\n<li>Bora-Hansgrohe</li>\n<li>Visma-Lease a Bike</li>\n<li>UAE Team Emirates</li>\n<li>Lidl-Trek</li>\n<li>Cofidis</li>\n<li>Uno-X Mobility</li>\n<li>Intermarché-Wanty</li>\n<li>Movistar</li>\n</ul>\n<h3><b>Omloop Het Nieuwsblad 2024 men’s route: </b></h3>\n<p>The 2024 route is almost the same as last year’s edition, however, it is slightly shorter at 202 kilometres, whereas last year’s race was 207km. This is the only tweak that has been made to the route this year, with all the cobbled sections and hills being the same, totalling 12 climbs and nine pavé sections. </p>\n<p>The race begins in Ghent, and the first taste of the cobbles comes at 36.2km with a 2km stint on the pavé. A few kilometres later, the peloton will tackle their first climb of the day – the Leberg, a 950-metre climb that boasts 13.8% gradients. This is the only real uphill challenge the peloton faces during the first half of the route, and it is not until 60km later that the action really starts to begin. From Kattenberg at 103.4km, the bergs and cobbles keep coming every 10km. They will tackle the Leberg again, then Hostellerie, Valkenberg, Wolvenberg, Molenberg, and then a third trip over the Leberg. </p>\n<p>In the final 30km, the peloton reaches Berendries at 172.4km before facing Elverenberg-Vossenhol 2km later, then the penultimate climb – Kapelmuur. The iconic climb is only 475 metres but has a maximum gradient of 19.8%, making the average a steep 9.3%. The climb has become famous for featuring in races such as Omloop Het Nieuwsblad and the Tour of Flanders, with hundreds of fans standing on the verge, cheering on the riders. </p>\n<p>Once up the punchy Muur, the riders will round off the climbs with the partly cobbled Bosberg, a 980m climb at 5.8%, a few kilometres after. The Bosberg is the final uphill test for the riders as it is a flat, 10km run-in to the finish in Ninove. </p>\n<h3><b></b></h3>\n<h3>\n<b>Omloop Het Nieuwsblad Women</b><span> </span>\n</h3>\n<p><span>Since 2006, Omloop Het Nieuwsblad has had a women’s edition held on the same day as the men’s. Although the race is shorter in distance than the men’s race, the women still use much of the same roads through the Flemish Ardennes, featuring the region’s cobbled roads. Now in its 19th edition, the one-day race will be the first race in Europe for the Women’s WorldTour. </span></p>\n<p>Former Movistar rider Annemiek van Vleuten was one of the four riders who have won the women’s edition of Omloop Het Nieuwsblad twice, first taking the title in 2020 and winning the one-day race in 2022. Other riders who joined her are Suzanne de Goede (2006 and 2009), Emma Johansson (2010 and 2011), and Anna van der Breggen (2015 and 2021). </p>\n<p>Last year, Lotte Kopecky became the first female Belgian rider to take the top step of the podium on this opening Classic, followed by team-mate Lorena Wiebes and Team UAE ADQ’s Marta Bastianelli. Kopecky will looking to defend her title again this year, but she’ll have tough competition, even from within her team with Demi Vollering on the startline, as well as a strong Lidl-Trek team featuring Elisa Balsamo, Elisa Longo Borghini, and Lizzie Deignan.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1247474011_9fe1938a-c2f4-4187-8a5a-5a9271451016.jpg?v=1704375143\" /><em>Image: Getty</em></p>\n<h3><b>Omloop Het Nieuwsblad women’s teams: </b></h3>\n<ul>\n<li>Movistar </li>\n<li>Lidl-Trek</li>\n<li>SD Worx</li>\n<li>Uno-X Mobility </li>\n<li>UAE Team ADQ</li>\n<li>Visma-Lease a Bike</li>\n<li>Team dsm-firmenich PostNL</li>\n<li>Roland </li>\n<li>Liv Alula Jayco</li>\n<li>Human Powered Health</li>\n<li>Fenix-Deceuninck</li>\n<li>FDJ-Suez</li>\n<li>Canyon//SRAM Racing</li>\n</ul>\n<h3><strong>Omloop Het Nieuwsblad 2024 women’s route: </strong></h3>\n<p>The women’s route follows a similar route to the men's race, albeit shorter at 127km. Like the men's, this is shorter than last year’s edition, which stood at 130km. Nevertheless, the women’s peloton will still tackle eight climbs and five cobbled sections over the 127km-long course. </p>\n<p>After starting in Ghent, the women’s peloton will reach their first pavé section – Lange Munte – after 28.1km of racing. However, it is not until much later (68.7km) that they reach their first uphill challenge, the Edelareberg, a 1.5km climb with an average gradient of 4.2%. Having completed the first half without much testing, it is the second half of the race where it ramps up with all seven remaining climbs packed into the last 70km. </p>\n<p>The Wolvenberg comes first, with its ramps reaching 17.3%, followed by the Molenberg, Leberg, Berendries, and Elverenberg-Vossenhol. At 111km, that is when the women’s peloton faces the Kapelmuur and the Bosberg within a few kilometres of one another, the same as the men’s race. After the two iconic climbs, it is a flat run to the finish line in Ninove. </p>\n<h3><b></b></h3>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6ced6efede5fcb69f3873b35f393f439ebfd9c9cfbfbc072e0a93f1ef11e2b7c","category":"Cycling"}