{"title":"PSIX-5 Performance of black soldier fly larvae meal as secondary protein sources in extruded dog diets","link":"https://academic.oup.com/jas/article/102/Supplement_3/577/7757751?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Black soldier fly larvae meal (BSFL) has gained market exposure with ties to sustainability and novelty. Graded inclusions of BSFL were assessed for nutrient digestibility, stool quality, and palatability in adult dogs. The BSFL was included at 0%, 5% and 10% in chicken-based extruded dog diets (formulated to 22% crude protein, 13% crude fat, 3% crude fiber). The study was approved by the facility’s Institutional Animal Care and Use Committee. A standard 2-bowl palatability test over a 2-d period was executed (n = 30 dogs each) to determine intake ratios between diets (0% vs. 5%, 0% vs. 10%, and 5% vs. 10%). Total tract nutrient digestibility was evaluated (n = 6 dogs per diet) with 5 d acclimation followed by 5 d total fecal collection. Stool quality was evaluated on a 1 to 5 scale. Palatability data were analyzed using paired t-test. To test for mean differences in digestibility and stool quality outcomes between 0%, 5%, and 10% BSFL dogs, we applied the Kruskal-Wallis test. Statistical significance was set at 5% type 1 error rate. Dry matter, protein, fat, and energy digestibility, and stool quality were similar between all diets (<span>P</span> &gt; 0.05). Palatability was improved (<span>P</span> &lt; 0.05) with inclusion of BSFL (i.e., preference for 5% and 10% vs. 0% inclusion) and improved (<span>P</span> &lt; 0.05) at 10% vs. 5% inclusion. The BSFL tested showed merit as a palatable ingredient source that maintains stool quality and digestibility in adult dogs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6cf151880b4bc8bd4b4f89b5adc8790615efde0396af5b880976385c84570cbd","category":"Environment"}