{"title":"PSI-9 Relationship of body condition measures and boar reproductive performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/348/7664883?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>In the swine industry, boar nutritional requirements are not well characterized; thus, boars are typically fed to maintain a specific body condition score (BCS). Assessing body condition with subjective scoring can lead to over or underfeeding, which may have repercussions on sperm production and(or) quality. There are objective tools to assess body condition in live boars, like backfat (BF) thickness measured with real-time ultrasound, the Knauer caliper, and flank-to-flank (F2F) length. The relationship of sperm production and quality with BCS has not been reported in modern genetics and modern boar studs. The purpose of this study was to evaluate the relationship of body condition measures with boar reproductive performance. Data collected in March 2023 on commercial boars (n = 147) included a BCS ranging from 2.25 to 3.5, ultrasound backfat (13.7 ± 4.37 mm) performed by a trained technician, body weight (BW; 222 ± 30.2 kg) estimated using heart girth and body length from poll to tailhead, F2F length (106.03 ± 5.94 cm) and Knauer caliper score (17.5 ± 2.37). Additional variables considered were boar genetic line, age, and collection frequency. Sperm production data (total motility, 92.1 ± 7.22%; concentration, 36.7 ± 12.10 mil/mL; ejaculate volume, 231.1 ± 73.72 mL; normal cells, 83.4 ± 11.27%) were obtained from the six collections immediately prior to body condition evaluation. Data were evaluated with the glmmTMB package of R Statistical Software using a generalized linear mixed model. There were no significant relationships between motility or ejaculate volume and boar body condition. Backfat depth was related to percentage of normal cells (<span>P</span> = 0.029) and inversely related to sperm concentration (<span>P</span> = 0.035). There was a tendency for boars with greater F2F to have greater sperm concentration (<span>P</span> = 0.090). Generally, the percentage of normal cells decreased with increasing BCS, though due to the low number of observations in the lower categories, only BCS 3.25 and BCS 3.5 boars were found to have a significant relationship with the trait (<span>P</span> = 0.004 and <span>P</span> = 0.022, respectively). Caliper measure was not related with any sperm parameters. While accessible tools are necessary for consistent management of boars, BF thickness measured by ultrasound was the only objective tool in this study with a significant relationship to any sperm parameters assessed. Measuring BF with ultrasound may not be practical for everyday use. More research should be done to further assess body condition measurements, objective measuring tools, and boar sperm production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6cff895cf9c12c231a7e645b9e7448a6a54f5d52b639b61ba8e09b35841b3b81","category":"Environment"}