{"title":"A Systematic Review of Trauma Informed Care in Substance Use Settings","link":"https://www.preprints.org/manuscript/202409.1775/v1","date":1727088773000,"content":"Purpose: Trauma informed care as an organisational intervention has gained increasing  attention in recent years. Substance use settings may be overrepresented with service users who have experienced trauma and adversity. This systematic review will examine the effectiveness of trauma informed care as an organisational intervention from an implementation perspective. \n\nMethods: The preferred reporting items for systematic review and meta-analyses (PRISMA) guidelines were followed. Three databases were searched; Academic Search Complete, Embase, and Scopus, supplemented with a Google Scholar search. Articles were included if they were peer reviewed in the English language from inception to February 2024 and reported on trauma informed care in substance use settings with an implementation context. Quality appraisal was conducted with the Mixed Method Appraisal Tool. \n\nResults: This systematic review of trauma informed care with implementation domains in substance use settings included (N=15) studies reporting on 12 datasets.  Studies were classified as low quality in (n=5), moderate in (n=1) and high in (n=6). Studies reported positive findings on reductions in substance use, and reductions on mental health and trauma symptoms, and treatment retention across community and residential settings. While satisfaction with services provided was also highlighted for service users and employees. The results further highlight the importance of the role of leadership across implementation domains, and the possibility of using the 10 trauma informed implementation domains in different treatment contexts as a framework to support implementation. Findings in this review are mapped onto these 10-trauma informed care implementation domains and reported as a narrative synthesis. \n\nConclusion: Trauma informed care is a promising organisational wide intervention with the potential to improve outcomes for service users and employees. Implementation can be supported by using the 10 trauma informed care implementation domains described in this review. However, most of the studies were qualitative and quantitative descriptive meaning drawing casual inferences is difficult. As such,  further research should be undertaken.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6d0237f5348b2692db3e1221fc731f8bf962ede55c8b358fa551c6e3462fa3b3","category":"Interdisciplinary"}