{"title":"Deceuninck-QuickStep will ride Specialized bikes for six more seasons","link":"https://cyclingtips.com/2021/06/deceuninck-quickstep-will-ride-specialized-bikes-for-six-more-seasons/","date":1624467688000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/dqs-650x433.jpg\" /></div><h2>Deceuninck-QuickStep will ride Specialized bikes for six more seasons</h2><p>\n</p><p>Just days before the start of the 2021 <a href=\"https://cyclingtips.com/tag/tour-de-france/\" target=\"_blank\">Tour de France</a>, Deceuninck-QuickStep has announced that it will stick with Specialized for the next several seasons after agreeing to a lengthy new deal, confirming comments made last month by team manager Patrick Lefevere.</p>\n\n\n\n<p>The extension to the partnership between team and brand will see Deceuninck-QuickStep racing Specialized bikes through the 2027 season. Specialized will also continue to provide helmets and shoes, and the brand’s subsidiary Roval will continue to be the team’s provider of wheels and components.</p>\n\n\n\n<p>The Deceuninck-QuickStep squad first raced on Specialized from 2007 to 2009, and it has been with the brand since returning to it in 2012, with the team’s riders having racked up numerous Monument victories aboard the bikes in that time.</p>\n\n\n\n<p>“For over a decade, Deceuninck-QuickStep has been instrumental in the development of cutting-edge technology for our bikes and equipment, which has resulted in some of the most monumental victories for Specialized,” said Specialized founder and CEO Mike Sinyard via a press release.</p>\n\n\n\n<p>“We are honored to continue the close partnership with Patrick and this special team, to drive the future of our sport.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/deceuninck-quickstep-will-ride-specialized-bikes-for-six-more-seasons/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6d03bff68c6bfccaf323fe114274258814045b6074933c8f10588820c3982114","category":"Cycling"}