{"title":"Simulation of the effects of climate change, crop pattern change, and developing irrigation systems on the groundwater resources by SWAT, WEAP and MODFLOW models: a case study of Fars province, Iran","link":"http://link.springer.com/10.1007/s10668-023-03157-5","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The severe shortage of water resources is the most important cause of the uncontrolled abstraction of groundwater resources in semi-arid regions. In this regard, modeling and forecasting groundwater levels can help in the accurate estimation of watershed water consumption and sustainable agricultural development. In the present study, the interaction effect of surface and groundwater using SWAT, WEAP, and MODFLOW models on agricultural water consumption of Kavar plain in Fars province has been evaluated. Also, the simultaneous impact of climate change, increasing the efficiency of irrigation systems, and changing the cultivation pattern to predict the groundwater level in the future were analyzed. For these purposes, first, the changes in crop pattern and type of irrigation systems during the decade 2008 to 2018 were investigated; then different management scenarios were defined to balance the groundwater level. The results of predicting climatic parameters indicate that in all three scenarios of emissions in the next period (2021–2040), the temperature will increase (0.54–1.01 °C) and precipitation will decrease (3–10%). The combination of SWAT and WEAP models with the MODFLOW model showed that by using these models, the interaction behavior of surface water and groundwater, the amount of recharges, and groundwater level can be quantitatively simulated. Also, applying different irrigation scenarios in the models showed that by adjusting the cultivation pattern and improving surface and pressurized irrigation efficiencies, the amount of groundwater abstraction in dry and normal conditions can be reduced by 23 to 42 percent. Therefore, the groundwater level will increase in the next period.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"6d0d34f4ceee08474a4ada52cbebcd815414469292598b0c2674eebcdbb843e5","category":"Environment"}