{"title":"Nitrogen dynamics as a function of soil types, compaction, and moisture","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301296","date":1712239200000,"content":"<p>by Saurav Das, Ankita Mohapatra, Karubakee Sahu, Dinesh Panday, Deepak Ghimire, Bijesh Maharjan</p>\r\n\r\nIn this study, the complex interactions between soil types, compaction, and moisture on nitrogen (N) transformation processes such as ammonia (NH<sub>3</sub>) volatilization, ammonification, nitrification, and denitrification were examined over a 30-day period using a simulated column approach. Two soil types: loam, and sandy loam, were subjected to three compaction treatments—control, surface, and sub-surface compaction—and two moisture regimes, dry and wet. Liquid urea ammonium nitrate (32-0-0) was used as the N fertilizer source at a rate of 200 kg N ha<sup>-1</sup>. Key indicators of N transformations were measured, including residual concentrations of ammonium (NH<sub>4</sub>-N) and nitrate (NO<sub>3</sub>-N), NO<sub>3</sub>-N leaching, NH<sub>3</sub> volatilization, and nitrous oxide (N<sub>2</sub>O) emissions. Findings revealed that compaction significantly increased residual NH<sub>4</sub>-N concentrations in deeper soil profiles, with the highest 190.80 mg kg<sup>-1</sup> recorded in loam soil under sub-surface compaction and dry conditions. Nitrification rates decreased across both soil types due to compaction, evidenced by elevated residual NH<sub>4</sub>-N levels. Increased NO<sub>3</sub>-N leaching was observed in loam soil (178.06 mg L<sup>-1</sup>), greater than sandy loam (81.11 mg L<sup>-1</sup>), due to initial higher residual NO<sub>3</sub><sup>-</sup> in loam soil. The interaction of compaction and moisture most affected N<sub>2</sub>O emissions, with the highest emissions in control treatments during dry weather at 2.88 kg ha <sup>-1</sup>. Additionally, higher NH<sub>3</sub> volatilization was noted in moist sandy loam soil under control conditions at 19.64 kg ha <sup>-1</sup>. These results highlight the necessity of considering soil texture, moisture, and compaction in implementing sustainable N management strategies in agriculture and suggest recommendations such as avoiding broadcast application in moist sandy loam and loam soil to mitigate NH<sub>3</sub> volatilization and enhance N use efficiency, as well as advocating for readjustment of fertilizer rate based on organic matter content to reduce potential NO<sub>3</sub>-N leaching and N<sub>2</sub>O emissions, particularly in loam soil.","author":"Saurav Das","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6d136ea4472edd8b06305deff8a8aa81939111581a6768b06982a37d3b8f3b95","category":"Interdisciplinary"}