{"title":"Scalp dose analysis for transient and permanent alopecia following conventional cranial irradiation using Image Guided Radiotherapy (IGRT): A prospective study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311855","date":1728568800000,"content":"<p>by Bongkot Jia-Mahasap, Wannapha Nobnop, Patumrat Sripan, Ekkasit Tharavichitkul, Somvilai Chakrabandhu, Pitchayaponne Klunklin, Wimrak Onchan, Pooriwat Muangwong, Imjai Chitapanarux</p>\r\nPurpose <p>The dosimetry of scalp dose was prospectively studied and correlated with alopecia following conventional cranial irradiation in primary brain tumors patients.</p> Materials and methods <p>Patients with primary brain tumors who required conventional radiotherapy were enrolled. A hairline marker was applied to the patient’s scalp to identify the entire scalp region. The maximal dose to 2% volume of interest (D2) for the entire scalp region were obtained. The radiation dosages at the localized hair-loss areas were evaluated during the final week of RT (transient alopecia) and six months after completing RT (permanent alopecia). Kruskal-Wallis tests were used to compare the dosimetric parameter values with statistical significance set as p &lt; 0.05.</p> Results <p>Forty-eight patients were included in the analysis. The prescribed radiation doses ranged from 50.4 to 60.0 Gy. Thirty-two patients experienced alopecia (27 transient and 5 permanent). The median D2 values adjusted for the entire scalp were higher in the alopecia group (38.40 Gy for transient alopecia and 47.84 Gy for permanent alopecia vs 11.90 Gy for no alopecia, p &lt; 0.001). The D2 value was determined as a predictive parameter for alopecia. The threshold values for transient and permanent alopecia over the entire scalp were 22.15 Gy and 36.81 Gy, respectively. At the localized hair-loss areas, the D2 values for transient and permanent alopecia were higher at 44.82 Gy and 50.00 Gy, respectively. The radiation intensity at the localized hair-loss areas was also related to the severity of alopecia, with D2 values of 35.14 Gy and 46.39 Gy for clinically assigned grade 1 and grade 2 transient alopecia, respectively, with the D2 value being even higher for permanent alopecia.</p> Conclusions <p>The D2 parameter value could be used to predict the type and severity of alopecia.</p>","author":"Bongkot Jia-Mahasap","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6d157abbe12568cc8f553d998feaec1950926ffc2e29825f19c7a4d72f74a9e5","category":"Interdisciplinary"}