{"title":"Effects of using wearable devices to monitoring physical activity in pulmonary rehabilitation programs for chronic respiratory diseases: A systematic review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308109","date":1722002400000,"content":"<p>by Thaianne Rangel Agra Oliveira, Ana Tereza do Nascimento Sales Figueiredo Fernandes, Thayla Amorim Santino, Fernanda Elizabeth Pereira da Silva Menescal, Patrícia Angélica de Miranda Silva Nogueira</p>\r\nIntroduction <p>Pulmonary rehabilitation (PR) is an intervention aimed at the comprehensive care of individuals with chronic respiratory diseases. Patients with chronic obstructive pulmonary disease (COPD) and asthma present low levels of physical fitness because they avoid physical exercises due to the fear of triggering recurrent symptoms. Wearable devices have been integrated into behavioral modification interventions for physical activity in PR protocols. Therefore, this review aims to identify how wearable devices are being utilized for monitoring chronic respiratory diseases in pulmonary rehabilitation programs.</p> Methods and analysis <p>Searches will be conducted on Medline, Cochrane Central Register of Controlled Trials, Embase (CENTRAL), CINAHL and PEDro electronic databases, as well as a search in the grey literature. We will include baseline data from randomized clinical trials reporting the use of wearable devices for monitoring physical activity in protocols for pulmonary rehabilitation programs for chronic respiratory diseases. Studies that discuss only the development of algorithms or applications for the assessment of diseases or unavailable full texts will be excluded. The main reviewer will conduct the initial search and exclusion of duplicates, while two independent reviewers will select studies, extract data, and assess the methodological quality using the PEDro tool.</p> PROSPERO registration number <p>CRD42024504137.</p>","author":"Thaianne Rangel Agra Oliveira","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6d1e30ec1103afd23f2f998724cd5eefc9e46418873e7594d923110cf5afc4b0","category":"Interdisciplinary"}