{"title":"AWS Week in Review –  New Open-Source Updates for Snapchange, Cedar, and Jupyter Community Contributions – May 15, 2023","link":"https://aws.amazon.com/blogs/aws/aws-week-in-review-new-open-source-updates-for-snapchange-cedar-and-jupyter-community-contributions-may-15-2023/","date":1684182049000,"content":"<p>A new week has begun. Last week, there was a lot of news related to AWS. I have compiled a few announcements you need to know. Let’s get started right away!</p> \n<p><strong><u>Last Week’s Launches</u></strong><br /> Let’s take a look at some launches from the last week that I want to remind you of:</p> \n<p><strong>New Amazon EC2 I4g Instances</strong> – Powered by <a href=\"https://aws.amazon.com/ec2/graviton\">AWS Graviton2</a> processors, Amazon Elastic Compute Cloud (Amazon EC2) I4g instances improve real-time storage performance up to 2x compared to prior generation storage-optimized instances. Based on <a href=\"https://aws.amazon.com/blogs/aws/aws-nitro-ssd-high-performance-storage-for-your-i-o-intensive-applications/\">AWS Nitro SSDs</a> that are custom-built by AWS and reduce both latency and latency variability, I4g instances are optimized for workloads that perform a high mix of random read/write and require very low I/O latency, such as transactional databases and real-time analytics. To learn more, see <a href=\"https://aws.amazon.com/blogs/aws/new-storage-optimized-amazon-ec2-i4g-instances-graviton-processors-and-aws-nitro-ssds/\">Jeff’s post</a>.</p> \n<p><strong>Amazon Aurora I/O-Optimized </strong> – You can now choose between two storage configurations for Amazon Aurora DB clusters: Aurora Standard or Aurora I/O-Optimized. For applications with low-to-moderate I/Os, Aurora Standard is a cost-effective option.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/05/03/2023-aurora-io-optimized-2.jpg\" alt width=\"933\" height=\"452\" /></p> \n<p>For applications with high I/Os, Aurora I/O-Optimized provides improved price performance, predictable pricing, and up to 40 percent costs savings. To learn more, see <a href=\"https://aws.amazon.com/blogs/aws/new-amazon-aurora-i-o-optimized-cluster-configuration-with-up-to-40-cost-savings-for-i-o-intensive-applications/\">my full blog post</a>.</p> \n<p><strong>AWS Management Console Private Access</strong> – This is a new security feature that allows you to limit access to the AWS Management Console from your <a href=\"https://aws.amazon.com/vpc\">Virtual Private Cloud</a> (VPC) or connected networks to a set of trusted AWS accounts and organizations. It is built on VPC endpoints, which use <a href=\"https://aws.amazon.com/privatelink\">AWS PrivateLink</a> to establish a private connection between your VPC and the console.</p> \n<p><img src=\"https://docs.aws.amazon.com/images/awsconsolehelpdocs/latest/gsg/images/console-private-access-verify.png\" alt=\"https://docs.aws.amazon.com/images/awsconsolehelpdocs/latest/gsg/images/console-private-access-verify.png\" /></p> \n<p>AWS Management Console Private Access is useful when you want to prevent users from signing in to unexpected AWS accounts from within your network. To learn more, see the <a href=\"https://docs.aws.amazon.com/awsconsolehelpdocs/latest/gsg/console-private-access.html\">AWS Management Console getting started guide</a>.</p> \n<p><strong>One-Click Security Protection on the Amazon CloudFront Console</strong> – You can now secure your web applications and APIs with <a href=\"https://aws.amazon.com/waf\">AWS WAF</a> with a single click on the <a href=\"https://aws.amazon.com/cloudfront\">Amazon CloudFront</a> console. CloudFront handles creating and configuring AWS WAF for you with out-of-the-box protections recommended by AWS and this simple and convenient way to protect applications at the time you create or edit your distribution.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/05/14/2023-waf-in-cloudfront.jpg\" alt width=\"1733\" height=\"1135\" /></p> \n<p>You may continue to select a preconfigured AWS WAF web access control list (ACL) when you prefer to use an existing web ACL. To learn more, see <a href=\"https://docs.aws.amazon.com/AmazonCloudFront/latest/DeveloperGuide/distribution-web-awswaf.html#WAF-additional-protections\">Using AWS WAF to control access to your content</a> in the AWS documentation.</p> \n<p><strong>Tracing AWS Lambda SnapStart Functions with AWS X-Ray</strong> – You can use AWS X-Ray traces to gain deeper visibility into your function’s performance and execution lifecycle, helping you identify errors and performance bottlenecks for your latency-sensitive Java applications built using SnapStart-enabled functions.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/05/15/blog-trace-after-510-1.png\" alt width=\"872\" height=\"502\" /></p> \n<p>With X-Ray support for SnapStart-enabled functions, you can now see trace data about the restoration of the execution environment and execution of your function code. You can enable X-Ray for Java-based SnapStart-enabled Lambda functions running on <a href=\"https://docs.aws.amazon.com/corretto/\" target=\"_blank\">Amazon Corretto</a> 11 or 17. To learn more about X-Ray for SnapStart-enabled functions, visit the <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/snapstart-monitoring.html#snapstart-xray\" target=\"_blank\">Lambda Developer Guide</a> or <a href=\"https://aws.amazon.com/blogs/compute/debugging-snapstart-enabled-lambda-functions-made-easy-with-aws-x-ray\" target=\"_blank\">read Marcia’s blog post</a>.</p> \n<p>For a full list of AWS announcements, be sure to keep an eye on the <a href=\"https://aws.amazon.com/new/\">What’s New at AWS</a> page.</p> \n<p><strong><u>Open Source Updates</u></strong><br /> Last week, we introduced new open-source projects and significant roadmap contributions to the Jupyter community.</p> \n<p><strong>Snapchange</strong> – Snapchange is a new open-source project to make fuzzing of a memory snapshot easier using KVM written by Rust. Snapchange enables a target binary to be fuzzed with minimal modifications, providing useful introspection that aids in fuzzing. Snapchange utilizes the features of the Linux kernel’s built-in virtual machine manager known as kernel virtual machine or KVM. To learn more, see the <a href=\"https://aws.amazon.com/blogs/opensource/announcing-snapchange-an-open-source-kvm-backed-snapshot-fuzzing-framework/\">announcement post</a> and <a href=\"https://github.com/awslabs/snapchange\">GitHub repository</a>.</p> \n<p><strong>Cedar</strong> – Cedar is a new open-source language for defining permissions as policies, which describes who should have access to what, and evaluating those policies. You can use Cedar to control access to resources such as photos in a photo-sharing app, compute nodes in a microservices cluster, or components in a workflow automation system. Cedar is also authorization-policy language used by the <a href=\"https://aws.amazon.com/verified-permissions/\">Amazon Verified Permissions</a>, a scalable, fine-grained permissions management and authorization service for custom applications and <a href=\"https://aws.amazon.com/verified-access/\">AWS Verified Access</a> managed services to validate each application request before granting access. To learn more, see the <a href=\"https://aws.amazon.com/blogs/opensource/using-open-source-cedar-to-write-and-enforce-custom-authorization-policies/\">announcement post</a> , <a href=\"https://www.amazon.science/blog/how-we-built-cedar-with-automated-reasoning-and-differential-testing\">Amazon Science blog post</a> and <a href=\"https://www.cedarpolicy.com/en/playground\">Cedar playground</a> to test sample policies.</p> \n<p><strong>Jupyter Community Contributions</strong> – We announced new contributions to Jupyter community to democratize generative artificial intelligence (AI) and scale machine learning (ML) workloads. We contributed two Jupyter extensions – Jupyter AI to bring generative AI to Jupyter notebooks and <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/05/amazon-codewhisperer-extension-jupyterlab-sagemaker-studio/\">Amazon CodeWhisperer Jupyter extension</a> to generate code suggestions for Python notebooks in JupyterLab. We also contributed three new capabilities to help you scale ML development faster: notebooks scheduling, SageMaker open-source distribution, and <a href=\"https://aws.amazon.com/about-aws/whats-new/2023/05/amazon-codeguru-security-plugin-sagemaker-studio-jupyter-notebooks-preview/\">Amazon CodeGuru Jupyter extension</a>. To learn more, see the <a href=\"https://aws.amazon.com/blogs/machine-learning/announcing-new-jupyter-contributions-by-aws-to-democratize-generative-ai-and-scale-ml-workloads/\">announcement post</a> and <a href=\"https://aws.amazon.com/jupyter/\">Jupyter on AWS</a>.</p> \n<p>To learn about weekly updates for <a href=\"https://aws.amazon.com/opensource/\">open source at AWS</a>, check out the latest <a href=\"https://blog.beachgeek.co.uk/newsletter/\">AWS open source newsletter</a> by Ricardo.</p> \n<p><strong><u>Upcoming AWS Events</u></strong><br /> Check your calendars and sign up for these AWS-led events:</p> \n<p><strong>AWS Serverless Innovation Day on May 17</strong> – Join us for a free full-day virtual event to learn about AWS Serverless technologies and event-driven architectures from customers, experts, and leaders. Marcia outlined <a href=\"https://aws.amazon.com/blogs/aws/learn-how-to-modernize-your-applications-at-aws-serverless-innovation-day/\">the agenda and main topics</a> of this event in her post. You can register on the <a href=\"https://pages.awscloud.com/GLOBAL-event-LS-aws-serverless-innovation-day-2023-reg-event.html?trk=7172d097-8f13-4dc1-b1ef-e97b3fd45b15&amp;sc_channel=el\">event page</a>.</p> \n<p><strong>AWS Data Insights Day on May 24</strong> – Join us for another virtual event to discover ways to innovate faster and more cost-effectively with data. Whether your data is stored in operational data stores, data lakes, streaming engines, or within your data warehouse, <a href=\"https://aws.amazon.com/redshift\">Amazon Redshift</a> helps you achieve the best performance with the lowest spend. This event focuses on customer voices, deep-dive sessions, and best practices of Amazon Redshift. You can register on the <a href=\"https://pages.awscloud.com/GLOBAL-event-LS-aws-data-insights-day-2023-reg-event.html\">event page</a>.</p> \n<p><strong>AWS Silicon Innovation Day on June 21</strong> – Join AWS leaders and experts showcasing AWS innovations in custom-designed EC2 chips built for high performance and scale in the cloud. AWS has designed and developed purpose-built silicon specifically for the cloud. You can understand AWS Silicons and how they can use AWS’s unique EC2 chip offerings to their benefit. You can register on the <a href=\"https://siliconinnovationday.splashthat.com/\">event page</a>.</p> \n<p><strong>AWS re:Inforce 2023</strong> – You can still register for <a href=\"https://reinforce.awsevents.com/\">AWS re:Inforce</a>, in Anaheim, California, June 13–14.</p> \n<p><strong>AWS Global Summits</strong> – Sign up for the AWS Summit closest to your city: <a href=\"https://aws.amazon.com/events/summits/hongkong/\">Hong Kong</a> (May 23), <a href=\"https://aws.amazon.com/events/summits/india/\">India</a> (May 25), <a href=\"https://aws.amazon.com/events/summits/amsterdam/\">Amsterdam</a> (June 1), <a href=\"https://aws.amazon.com/events/summits/london/\">London</a> (June 7), <a href=\"https://aws.amazon.com/events/summits/washington-dc/\">Washington DC</a> (June 7-8), <a href=\"https://aws.amazon.com/events/summits/toronto/\">Toronto</a> (June 14), <a href=\"https://aws.amazon.com/es/events/summits/madrid/\">Madrid</a> (June 15), and <a href=\"https://aws.amazon.com/it/events/summits/milano/\">Milano</a> (June 22).</p> \n<p><strong>AWS Community Day</strong> – Join community-led conferences driven by <a href=\"https://aws.amazon.com/developer/community/usergroups/\">AWS user group</a> leaders closest to your city: <a href=\"https://www.midwestcommunityday.com/\">Chicago</a> (June 15), and <a href=\"https://community.awsug.ph/2023/index.html\">Philippines</a> (June 29–30).</p> \n<p>You can browse all upcoming <a href=\"https://aws.amazon.com/events/explore-aws-events/\">AWS-led in-person and virtual events</a>, and <a href=\"https://aws.amazon.com/developer/events/\">developer-focused events</a> such as AWS DevDay.</p> \n<p>That’s all for this week. Check back next Monday for another Week in Review!</p> \n<p>— <a href=\"https://twitter.com/channyun\">Channy</a></p> \n<p><em>This post is part of our </em><a href=\"https://aws.amazon.com/blogs/aws/tag/week-in-review/\"><em>Week in Review</em></a><em> series. Check back each week for a quick roundup of interesting news and announcements from AWS!</em></p>","author":"Channy Yun","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"6d2d71b0fa0feeee32dd5bbb6e6c4e2a5ee0e7a8eefc28685688dbda33d1bb35","category":"Tech"}