{"title":"Selection of Relay Function Nodes for UAV Routing in Wireless Multi-Hop Network","link":"https://www.preprints.org/manuscript/202406.1378/v1","date":1718890897000,"content":"Unmanned delivery technology using unmanned aerial vehicles (UAVs) has the potential to solve issues such as traffic congestion and labor shortages. We investigated a method to construct a route between the source and destination nodes in a wireless multi-hop network by installing a radio terminal in each house. If the relay functions of all nodes in the network are in operation, the number of control messages for route construction increases, and the message relay forwarding load of each node increases. Keeping all node pairs multi-hop connectivity, we establish a method to operate the relay function with as few nodes as possible. End nodes that have not activated the relay function connect to the relay node with the closest physical distance. In this paper, we propose methods for selecting nodes to operate the relay function. Specifically, one method is based on random selection, another method is based on the number of adjacent nodes, and a third method is based on the Multipoint Relay (MPR) of the Optimized Link State Routing Protocol (OLSR). For each method, we evaluate whether the route construction is available, the number of relay nodes, the total distance of constructed routes, and the distance in population-dense regions. We clarify the characteristics of each method, and the method based on MPR is the best for constructing a network suitable for UAV navigation routes. In addition, the smaller the number of relay nodes, the more unexpected collisions on the links due to route conflicts. We clarify the minimum node density required to apply the MPR method which reduces the number of relay nodes suppressing route conflicts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6d2f8ee71fd903fffe9386ecf40901c60a71785069acc1ade4653194df117ff9","category":"Interdisciplinary"}