{"title":"Knowledge and Prevalence of Latent Tuberculosis Infection: A Pilot Study in Patients Attending a Primary Healthcare Clinic in Rural Eastern Cape, South Africa.","link":"https://www.preprints.org/manuscript/202409.2299/v1","date":1727592654000,"content":"Latent tuberculosis infection (LTBI) remains a significant global health concern, particularly in regions with high tuberculosis (TB) prevalence, such as South Africa. This pilot study aimed to evaluate the prevalence of LTBI and assess patient knowledge about the condition in a primary healthcare clinic in rural Eastern Cape, South Africa. A cross-sectional design was used, and convenience sampling recruited outpatients aged 18 years and older with no prior history of TB. Blood samples were analyzed using the QuantiFERON-TB Gold assay to determine LTBI status, and a survey assessed patient knowledge of LTBI. Strong positive correlations were observed between what patients understand by the term LTBI and how is LTBI different from TB (0.70), patients understand by the term LTBI and the risk factors for developing LTBI (0.70), how is LTBI different from TB and the risk factors for developing LTBI (0.78), and how is LTBI different from TB and the recommended treatments for LTBI (0.79), indicating overlap in understanding. In contrast, negative correlations between if patients ever heard of latent LTBI before and patients understanding the term LTBI (-0.25), the risk factors for developing LTBI (-0.22), LTBI progressing to active TB (-0.27), and the recommended treatments for LTBI (-0.27). This divergence points to different dimensions of patient knowledge and awareness. Age, gender, occupation, comorbidities, and HIV status showed varying LTBI positivity trends. Among younger patients aged 20-29, 15.4% tested positive, while the 30-39 group showed a nearly equal split between positive (48.1%) and negative cases. A higher positivity rate was seen in females (39.1%) compared to males (31.6%). Unemployed individuals had higher positivity rates, suggesting socioeconomic factors' influence. Comorbidities, especially hypertension, diabetes, and asthma, correlated with higher LTBI positivity among females, but this was less evident in males. HIV-positive patients had a higher LTBI-negative rate compared to HIV-negative patients. These findings suggest that demographic and health factors, including age, gender, occupation, comorbidities, and HIV status, may predict LTBI positivity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6d32f0b0a08d7a891105433865dc8074ad0eb1c0d2dae27fa557904e10fcb6f1","category":"Interdisciplinary"}