{"title":"Nonlinear Responses of COVID-19 Incidence Rates to Temperature, Relative Humidity, Ultraviolet Radiation, and Diurnal Temperature Range","link":"https://www.preprints.org/manuscript/202409.1380/v1","date":1726644877000,"content":"The COVID-19 pandemic has significantly impacted human health and daily life. Meteorological factors play a crucial role in virus transmission. Understanding these factors is critical for pandemic control, yet debates continue due to variations in research methods and data. This study uses a global dataset and focuses on administrative units smaller than 10,000 km². The relationship between daily COVID-19 incidence rates and meteorological factors—including temperature, relative humidity (RH), ultraviolet radiation (UVR), and diurnal temperature range (DTR)—was analyzed across 173 units in 62 countries. The results revealed significant nonlinear responses and lag effects between incidence rates and the meteorological factors. Key inflection points were observed at 0°C and 24°C for temperature, 63% for RH, 102 KJ/m² for UVR, and 15°C for DTR. Below 0°C, infection risk increased with rising temperatures; from 0°C to 24°C, risk decreased; and above 24°C, risk escalated rapidly. RH below 63% correlated inversely with infection risk, while above 63%, the correlation was positive. Infection risk decreased with UVR below 102 KJ/m² but increased beyond this threshold. These nonlinear responses are primarily driven by the differential effects of these factors on virus survival, transmission, and human immunity. Conditions around 24°C, 63% RH, 102 KJ/m² UVR, and DTR below 15°C appear optimal for human immunity, correlating with lower infection risk. High temperature and low UVR prompted immediate infection responses, while low temperatures, high UVR, and larger DTR showed delayed effects. These findings provide new, more reliable evidence for understanding the mechanisms driving COVID-19 pandemic dynamics and for preventing the future normalization of the epidemic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6d3c1a660b69f4b001f74ce3010ced8054f8e9294110b429868d18896696b339","category":"Interdisciplinary"}