{"title":"Increased Frequency of Circulating Activated FOXP3+ Regulatory T-cell Subset in Patients with Chronic Lymphocytic Leukemia Is Associated with the Estimate of the Size of the Tumor Mass, STAT5 Signaling and Disease Course during Follow-Up of Patients","link":"https://www.preprints.org/manuscript/202408.1596/v1","date":1724252372000,"content":"Advanced chronic lymphocytic leukemia (CLL) is accompanied by increased circulating regula-tory T cells (Tregs) and increased susceptibility to severe infections, which were also shown to en-tail a striking induction of FOXP3 expression in Tregs. As homeostasis of the most suppressive CD45RA-FOXP3high activated Treg (aTreg) subset differs, it is critical to analyse homeostatic sig-naling in Treg subsets. Therefore, in this study, by using conventional and imaging flow cytome-try, we monitored STAT5 signaling/phosphorylation (pSTAT5) and investigated Treg subsets in relation to the Binet stage, the total tumor mass score (TTM) and disease course during follow-up of 37 patients with CLL. aTreg percentage was significantly increased among CD4+ T cells from patients with advanced disease and significantly correlated with the TTM. A subgroup of patients with higher aTreg percentages among CD4+FOXP3+ T cells at the start of therapy was character-ized by more frequent episodes of severe infections during follow-up, suggesting that aTreg frac-tion could represent a possible marker of severe disease course with infectious complications. Augmented homeostatic STAT5 signaling could support aTreg expansion, as higher pSTAT5 lev-els were significantly corelated with increased aTreg frequency among CD4+FOXP3+ T cells during follow-up of patients on therapy as well as following SARS-CoV-2 antigen-specific stimulation in vitro.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6d40035768d17f3466063aa329b39530d9080a5be55eb5db90523eb1234a9dd5","category":"Interdisciplinary"}