{"title":"<i>Spilanthes filicaulis</i> (Schumach. & Thonn.) C.D. Adams leaves protects against streptozotocin-induced diabetic nephropathy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301992","date":1713535200000,"content":"<p>by Oluwafemi Adeleke Ojo, Akingbolabo Daniel Ogunlakin, Christopher Oloruntoba Akintayo, Olaoluwa Sesan Olukiran, Juliana Bunmi Adetunji, Omolola Adenike Ajayi-Odoko, Theophilus Oghenenyoreme Ogwa, Olorunfemi Raphael Molehin, Omolara Olajumoke Ojo, Ramzi A. Mothana, Abdullah R. Alanzi</p>\r\nBackground and objective <p>Diabetic neuropathy (DN) is a complex type of diabetes. The underlying cause of diabetic nephropathy remains unclear and may be due to a variety of pathological conditions resulting in kidney failure. This study examines the protective effect of the methanolic extract of <i>Spilanthes filicaulis</i> leaves (MESFL) in fructose-fed streptozotocin (STZ)-induced diabetic nephropathy and the associated pathway.</p> Methods <p>Twenty-five rats were equally divided randomly into five categories: Control (C), diabetic control, diabetic + metformin (100 mg/kg), diabetic + MESFL 150 mg/kg bw, and diabetic + MESFL 300 mg/kg bw. After 15 days, the rats were evaluated for fasting blood glucose (FBG), alanine aminotransferase (ALT), aspartate aminotransferase (AST), alkaline phosphatase (ALP), urea, uric acid, serum creatinine, reduced glutathione (GSH), superoxide dismutase (SOD), catalase (CAT), and lipid peroxidation (MDA). Gene expression levels of cyclic adenosine monophosphate (cAMP), protein kinase A (PKA), cAMP response element-binding (CREB), cFOS and the antiapoptotic protein Bcl-2 were examined.</p> Results <p>We observed that MESFL at 150 and 300 mg/kg bw significantly downregulated the protein expression of cAMP, PKA, CREB, and cFOS and upregulated the Bcl-2 gene, suggesting that the nephroprotective action of MESFL is due to the suppression of the cAMP/PKA/CREB/cFOS signaling pathway. In addition, MESFL increases SOD and CAT activities and GSH levels, reduces MDA levels, and reduces renal functional indices (ALP, urea, uric acid, and creatinine).</p> Conclusion <p>Therefore, our results indicate that MESFL alleviates the development of diabetic nephropathy via suppression of the cAMP/PKA/CREB/cFOS pathways.</p>","author":"Oluwafemi Adeleke Ojo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6d4a05a8d0f8fe07719d25a91b34c2c7cc60d43ee01aadebfd8e016365b7e1ca","category":"Interdisciplinary"}