{"title":"109 Effectiveness of Fenbendazole in growing Quarter Horses using the Quantitative Modified Wisconsin Technique","link":"https://academic.oup.com/jas/article/102/Supplement_1/101/7618028?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Anthelmintics are commonly used in the equine industry to reduce parasite load, but there is a growing concern about anthelmintic resistance, especially in young horses where there is limited information available. Twenty-four, 2-yr-old Quarter Horses (825 ± 21 d of age, initial BW 409 ± 6 kg, 12 fillies and 12 geldings) originating from a single herd were used in a 42-d study to investigate the effectiveness of a commercial anthelmintic (fenbendazole) on fecal egg counts (FEC), hypothesizing that there would be a decrease in FEC following anthelmintic administration. Horses were housed individually (3.7m × 11m) and offered ad libitum Coastal Bermudagrass hay and water and fed a pelleted concentrate offered at 0.75% (as-fed) of their BW. During the 42-d study, BW was obtained and BCS were assigned in 21-d intervals. Fenbendazole was administered orally on d 0 and 14 dosed on BW per manufacturer label. Fresh fecal samples were collected on d 0 and 14, before anthelmintic administration, and on d 28 and 42. Fecal egg floats were conducted using the Modified Wisconsin Method, and eggs per gram (EPG) were determined in duplicate. A fecal egg count reduction test (FECRT) was calculated, beginning on d 14. Outliers were determined as values ± 2 standard deviations of the mean, and data were analyzed using PROC MIXED of SAS (v9.4) with the main effect of time. Horses increased in BW (P ≤ 0.01) over time, but BCS did not change (P = 0.25). Mean FEC increased over time (P ≤ 0.01), beginning on d 14, and remained increased to d 42 compared to baseline. However, there was a trend (P = 0.07) for mean FEC to be less on d 42 (189.70 ± 29 EPG) when compared with d 14 (251 ± 28 EPG). The calculated reduction of FEC were below the targeted 95% or greater and included d 14 (1.04%), d 28 (35%), and d 42 (41%). The increased shedding of eggs did not negatively impact BW or BCS. However, we reject the hypothesis since FEC increased following anthelmintic treatment, indicating the need for consistent monitoring of anthelmintic efficacy in young horses.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6d59a931632c2e8634a7ec33c8db6e8db64381a3b49b666a7367f797acf50e8f","category":"Environment"}