{"title":"Replacing artisanal fisheries with dolphin watching: Strategy for conservation and sustainable community‐based marine ecotourism","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4156?af=R","date":1713682800000,"content":"<h2>Abstract</h2>\n<p>\nIn coastal delphinid conservation, dolphin watching (DW) is frequently proposed for artisanal fishers as a community-based marine ecotourism (CBME) plan to reduce fishing effort and delphinid bycatch. Questions including whether DW profitability is sufficient to replace fishing and whether fishers can conduct DW sustainably, however, are rarely examined.\nIn the present study, questionnaire targeting tourists was implemented to investigate DW profitability in Sanniang Bay, China where DW-based CBME has been operated by local fishers since 2004. CBME sustainability was evaluated by comparing DW profitability with household income with reference to local poverty, and rural and economically comfortable families in China.\nOut of 1046 tourists interviewed, 40 (3.82%) tourists knew there is DW in Sanniang Bay, while 292 (27.9%) tourists were lured to attend DW with low pricing. The fisher earned 110RMB (<i>ca</i>. 16.0$USD) per DW trip and required two, four, and nine trips per day to earn household income higher than poverty, rural and economically comfortable lines. Raising ticket fee and maximizing per-trip number of tourists can substantially improve DW profitability, which facilitates CBME sustainability and poses minimal impacts on target animals.\nCBME in rural areas could be trapped into low popularity–low pricing–low profitability embarrassments because of primitive tour facilities, insufficient ecological education value, poor hospitality skills and lacking marketing access. The sustainable CBME should incorporate ecologically friendly conducts, direct indigenous profits with minimal transaction costs, venture and service diversification, and marketing with indigenous cultural characteristics.\nDW history in Sanniang Bay further indicates profit distribution of tourism ventures directly influence CBME sustainability. Accordingly, indigenous rights, economic equity and social justice should be centrally placed in CBME policying with the minimal intervention from non-indigenous capitals and commercialized manipulations.\n</p>","author":"Haiping Wu, \nFangqiang Luo, \nShiang‐Lin Huang, \nJing Wang, \nYirong Ling, \nMeifang Lin, \nChongwei Peng","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"6d60ae7ed06b4736f1cdd17bd1632c26e168e48e8540316158acca9841081a21","category":"Environment"}