{"title":"Visually stunning The Creator is a rare piece of original sci-fi filmmaking","link":"https://arstechnica.com/?p=1973729","date":1696618544000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/creator2-800x539.jpg\" alt=\"black man lying in road on back pointing a gun\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/creator2.jpg\">Enlarge</a> <span>/</span> John David Washington stars as a US sergeant on an undercover mission who befriends an AI \"child\" in <em>The Creator</em>. (credit: 20th Century Studios)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's rare to get an original piece of science fiction filmmaking not based on existing IP in this era of adaptations and superhero mega-franchises. So <a href=\"https://en.wikipedia.org/wiki/The_Creator_(2023_film)\"><em>The Creator</em></a> is a welcome offering in the genre, combining elements of <em>District 9</em>,<em> Ex Machina</em>,<em> Blade Runner</em>, and <em>Apocalypse Now</em>, among others, to produce a visually stunning and timely tale of a war between humans and AI. It's directed by Gareth Edwards, best known for 2014's <a href=\"https://en.wikipedia.org/wiki/Godzilla_(2014_film)\"><em>Godzilla</em></a> and <a href=\"https://en.wikipedia.org/wiki/Rogue_One\"><em>Rogue One: A Star Wars Story</em></a> in 2016.</p>\n<p><strong>(Some mild spoilers below but no major reveals.)</strong></p>\n<p>The inspiration for <em>The Creator</em> came post-<em>Rogue One</em>, when Edwards took a road trip through the Midwest. He spotted a strange building with a Japanese logo in the middle of one of the endless fields, and his mind instantly jumped to robots. What would a robot built inside that factory think when it encountered the field and broader outside world for the first time? \"It felt like the beginning of a movie,\" Edwards recalled, and locked himself away in a hotel in Thailand to write the screenplay. He also joined a fellow director on a tour across Vietnam. \"I started envisioning massive futuristic structures rising out of paddy fields... and I got really excited about the idea of something <em>Blade Runner</em>-esque being set in Vietnam,\" he said. The end result was <em>The Creator</em>.</p></div><p><a href=\"https://arstechnica.com/?p=1973729#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973729&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6d67b47b79eced9ccf8d98dcc1deffb5b3295b3bc680046dd093fd054037162b","category":"Tech"}