{"title":"Deep (200–2,000 cm) Soil Water Use Can Compensate for the Drought Effect on Gas Exchange in Dry Years Better Than in Wet Years for Dryland Tree Plantations","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037084?af=R","date":1724484248000,"content":"<h2>Abstract</h2>\n<p>Analyzing deep soil water use (DSWU) response to precipitation change and its impact on tree physiology is necessary to understand tree mortality mechanisms, especially in drylands. Using a process-based model parameterized with in situ measured fine root distribution data for 0–2,000 cm depth, along with a root-cutting (below 200 cm depth) numerical experiment, this study explored DSWU strategies and their contribution to total water consumption during different precipitation years, as well as their relationship to tree gas exchange traits, in mature apple (<i>Malus pumila</i> Mill) tree and black locust (<i>Robinia pseudoacacia</i> L.) plantations in both wetter (Changwu, 583 mm) and drier (Yan'an, 534 mm) sites on China's Loess Plateau. Results showed that DSWU at 200–2,000 cm depth in different precipitation years of both species mainly occurred during the early growing seasons. On average, DSWU contributed 22.9% and 25.1% to the total water consumption of apple trees and black locust, respectively, and its contribution increased to 26.0% and 36.7% in extremely dry years. Moreover, the lack of DSWU significantly decreased (<i>p</i> &lt; 0.05) stomatal conductance (by 16.9%, 16.9%, 47.4%, and 11.4%, respectively) and photosynthetic rates (by 37.1%, 20.1%, 28.5%, and 16.4%, respectively) of Changwu apple trees, Yan'an apple trees, Changwu black locust and Yan'an black locust in extremely dry years. Similar reductions occurred only in Yan'an for both tree species in normal years. In contrast, no significant differences were found in gas exchange traits in extremely wet years. Our results highlight that DSWU is an important strategy for plantations in the deep vadose zone region to resist extreme drought.</p>","author":"Xiaoya Shao, \nXiaodong Gao, \nZhibo Zhang, \nNana He, \nNanfang Ma, \nXue Du, \nXining Zhao","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"6d6d8d9904406d7f450b23abd4e58b9b91f10782dade0719ddb1635b1806dd7b","category":"Environment"}