{"title":"Measuring factors affecting honey bee (Hymenoptera: Apidae) attraction to soybeans using bioacoustics monitoring","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae036/7640602?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Soybean (<span>Glycine max</span> (L.) Merr.) is an important agricultural crop around the world, and previous studies suggest that honey bees (<span>Apis mellifera</span> Linnaeus) can be a component for optimizing soybean production through pollination. Determining when bees are present in soybean fields is critical for assessing pollination activity and identifying periods when bees are absent so that bee-toxic pesticides may be applied. There are currently several methods for detecting pollinator activity, but these existing methods have substantial limitations, including the bias of pan trappings against large bees and the limited duration of observation possible using manual techniques. This study aimed to develop a new method for detecting honey bees in soybean fields using bioacoustics monitoring. Microphones were placed in soybean fields to record the audible wingbeats of foraging bees. Foraging activity was identified using the wingbeat frequency of honey bees (234 ± 14 Hz) through a combination of algorithmic and manual approaches. A total of 243 honey bees were detected over 10 days of recording in 4 soybean fields. Bee activity was significantly greater in blooming fields than in non-blooming fields. Temperature had no significant effect on bee activity, but bee activity differed significantly between soybean varieties, suggesting that soybean attractiveness to honey bees is heavily dependent on varietal characteristics. Refinement of bioacoustics methods, particularly through the incorporation of machine learning, could provide a practical tool for measuring the activity of honey bees and other flying insects in soybeans as well as other crops and ecosystems.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"6d7f736f730f29ab389e01ed623461006c78f624e68a7f46ba03854e2963b814","category":"Environment"}