{"title":"โครงข่าย 5G จาก AIS เตรียมพาอุตสาหกรรมสู่ยุค Smart Manufacturing 4.0","link":"https://www.blognone.com/node/123003","date":1622774725000,"content":"<div><div><div><p>ในงาน AIS Business Digital Future 2021 ที่ผ่านทาง AIS Business ผู้นำโซลูชันดิจิทัล แก่กลุ่มองค์กรนำเสนอแนวคิด Your Trusted Smart Digital Partner โดยเปิดช่องทางให้พันธมิตรสำคัญของ AIS ทำงานร่วมกันกับธุรกิจต่างๆ จนก้าวขึ้นมาเป็นผู้ชนะในยุค Digital Transformation</p>\n<p>และหนึ่งในหัวข้อที่พลาดไม่ได้ของงานคือหัวข้อ Enterprise 5G Private Network &amp; Edge Computing การพูดคุยเพื่อหาคำตอบว่าความสามารถใหม่ๆ ของเครือข่าย 5G จะช่วยสนับสนุน Digital Transformation สำหรับภาคธุรกิจได้อย่างไร ผู้ร่วมเสวนาในหัวข้อนี้ ได้แก่  AIS ในฐานะผู้นำโครงสร้างพื้นฐานดิจิทัลไทย, Bosch Thailand บริษัทผู้ให้บริการโซลูชัน Industry 4.0 และ  SNC Former จำกัด (มหาชน) ผู้ผลิตกลุ่มชิ้นส่วนยานยนต์ และเครื่องใช้ไฟฟ้าในเขตพื้นที่อีอีซี มาแลกเปลี่ยนกรณีศึกษาร่วมกัน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6ba728fa11d606e9ab1bef3c49746e2c.png\" /></p>\n<h3>5G ดีกว่า 4G, 3G หรือแม้กระทั่งเครือข่าย Wi-Fi อย่างไร</h3>\n<p><strong>คุณอัศนีย์​ วิภาตเวท Head Of Enterprise Telecom Technology Product Department จาก AIS</strong> ระบุถึงความแตกต่างระหว่าง 5G กับเครือข่ายในปัจจุบันอย่าง 4G, 3G ว่า 5G มีแบนด์วิธที่มากกว่า และความหน่วงต่ำกว่า ซึ่งเป็นเรื่องสำคัญมากในการนำไปปรับใช้กับระบบ Automation ในโรงงานอุตสาหกรรม</p>\n<p>5G ยังสามารถรองรับเครือข่ายอุปกรณ์ IoT ในปริมาณมาก แม้เครือข่าย 4G, 3G จะสามารถใช้งานได้เหมือนกันระดับหนึ่ง แต่เมื่อมีอุปกรณ์มากขึ้นเรื่อยๆ ในระดับ Smart City เครือข่ายเดิมๆ ก็อาจจะรองรับไม่ไหวอีกต่อไป การลงทุนกับอุปกรณ์ IoT จึงควรพิจารณาถึง 5G เพื่อการขยายตัวในอนาคต</p>\n<p>และเมื่อเปรียบเทียบ 5G กับเครือข่ายประเภท Wi-Fi นั้น 5G มีเสถียรภาพสูงกว่าเพราะใช้ช่องสัญญาณที่ผ่านการประมูล (licensed band spectrun)มาใช้ ทำให้ผู้ได้รับอนุญาตอย่าง AIS สามารถจัดการช่องสัญญาณให้มีคุณภาพดี สามารถใช้งานได้อย่างต่อเนื่อง ต่างจากช่องสัญญาณที่สามารถใช้งานได้เสรี (unlicensed band) ที่แม้จะไม่ต้องเสียค่าใช้งานช่องสัญญาณ แต่ในโลกความเป็นจริงเราก็พบปัญหาอุปกรณ์ใช้งานจำนวนมากจนอุปกรณ์ต่างๆ เชื่อมต่อเครือข่ายไม่ได้อยู่เสมอๆ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8fc722569c6defc45adec7b1da2aae44.png\" /></p>\n<p>นอกจากนี้ 5G ยังเหมาะแก่การใช้งานกับอุปกรณ์เคลื่อนที่ ซึ่งถูกออกแบบให้สามารถย้ายข้ามพื้นที่ จากสถานีฐานหนึ่งไปอีกสถานีฐานหนึ่ง จึงรองรับการใช้งานในพื้นที่กว้างได้ดีกว่า Wi-Fi และเทคโนโลยีแบบสาย Fiber Optic  ตัวอย่างเช่นงานเครื่องจักรที่ต้องปรับเปลี่ยนตำแหน่งในสายการผลิต, งาน Logistics ในโรงงานอุตสาหกรรม เป็นงานที่เหมาะกับการใช้ 5G ได้เป็นอย่างดี ลดงบประมาณและประหยัดเวลาในการออกแบบสายการผลิตใหม่ หรือเดินสายใหม่ให้ยุ่งยาก</p>\n<p>\"หัวใจสำคัญของการสนับสนุน Transformation ในธุรกิจ คือการเข้าใจ Pain และความต้องการของลูกค้า เพราะเราไม่สามารถทำงานอยู่คนเดียวที่ส่วนกลาง การทำงานร่วมกันระหว่างเอไอเอส, Partner และลูกค้าจะทำให้เราก้าวข้ามความเปลี่ยนแปลงของยุคดิจิทัลได้\" คุณอัศนีย์กล่าว</p>\n<h3>5G กับการเพิ่มประสิทธิภาพการผลิตด้วย Smart Manufacturing</h3>\n<p>Mr. Joseph Hong, Managing Director จาก Bosch Thailand แนะนำถึง Bosch ว่าบริษัทให้บริการโซลูชัน Industry 4.0 และ Smart Manufacturing มาตั้งแต่ปี 2011 มียอดขายในโซลูชัน Industry 4.0 รวมทั่วโลกถึง 4 พันล้านยูโรหรือประมาณ 150,000 ล้านบาท ในปี 2020 และยังสามารถสร้างยอดขายได้ถึง 700 ล้านยูโรหรือประมาณ 27,000 ล้านบาทในส่วนของโซลูชัน Connected Manufacturing</p>\n<p>คุณ Josep เล่าถึงประโยชน์ของ Smart Manufacturing ที่กลุ่มอุตสาหกรรมจะได้คือโซลูชันเหล่านี้สามารถเพิ่ม Productivity หรือกำลังการผลิตได้ถึง 25%, เพิ่มระยะเวลาทำงาน (availability) ของเครื่องจักรได้มากกว่า 15%, ลดค่าใช้จ่ายในการบำรุงรักษาได้มากกว่า 25%</p>\n<p>โดยโครงข่าย 5G นับเป็นโครงสร้างพื้นฐานสำคัญสำหรับการนำเครือข่ายไร้สายมาใช้กับงานที่สำคัญยิ่งยวด (critical application) ของโรงงานต่างๆ อาทิ ระบบควบคุมเครนจากระยะไกล, รถไร้คนขับในโรงงาน (automated guided vehicles - AGV), augmented reality (AR) เป็นต้น โดยตอนนี้ Bosch ได้ทดสอบเครือข่าย 5G แบบเฉพาะพื้นที่ (5G Private Network) ที่จะใช้สำหรับโรงงานอุตสาหกรรมร่วมกับ AIS เฟสแรกที่โรงงานในจังหวัดระยอง พบว่าเทคโนโลยีและเครือข่าย 5G ช่วยเพิ่มประสิทธิภาพของการทำงาน, ลดการใช้พลังงาน และลดระยะเวลาหยุดการผลิต (downtime) ตลอดทั้งสายการผลิตได้เป็นอย่างดี ซึ่ง 5G ช่วยให้สามารถจัดการกับข้อมูลจำนวนมากที่เกิดขึ้นในสายการผลิตได้แบบ Real-time ทำให้ Bosch มองว่า 5G จะเป็นเสมือนเส้นประสาทสำคัญของ Smart Factory ในอนาคต</p>\n<p>“5G คือมาตรฐานการสื่อสารใหม่ซึ่งเป็นองค์ประกอบหลักของ Smart Factory ในอนาคต ผู้ที่ปรับตัวไม่ทัน มีความเสี่ยงที่จะตกขบวนในอนาคต” Mr. Joseph กล่าว</p>\n<p>อีกกรณีศึกษาที่น่าสนใจคือ 5G Private Network  ของ AIS เพื่อใช้ในโรงงาน SNC Former บริษัทสัญชาติไทยผู้ผลิตชิ้นส่วนเครื่องใช้ไฟฟ้าและรถยนต์</p>\n<p><strong>คุณสมชาย งามกิจเจริญลาภ Managing Director บริษัท SNC Former จำกัด (มหาชน)</strong> เล่าภาพรวมให้รู้จักบริษัทมากขึ้นว่า บริษัทได้เริ่มต้นจากการเป็นบริษัทรับจ้างผลิต (OEM) ชิ้นส่วนเครื่องใช้ไฟฟ้าและชิ้นส่วนในรถยนต์ โดยใช้ความได้เปรียบจากค่าแรงที่ต่ำกว่า แต่เมื่อสภาพการแข่งขันเปลี่ยนไป แต่ละบริษัทนำเอาเทคโนโลยีที่สูงขึ้นมาใช้ ทาง SNC จึงต้องปรับตัว ด้วยการหาเทคโนโลยีและโซลูชัน Smart Manufacturing เข้ามาใช้ โดยยึดแนวคิดหลักคือการเชื่อมต่อเครื่องจักร คน และข้อมูลเข้าด้วยกัน</p>\n<p>ช่วงสองปีที่ผ่านมา SNC Former ได้ร่วมมือกับ AIS ในการนำ 5G เข้ามา ตั้งเสา 5G ที่โรงงานในระยอง เปิดทางให้สามารถนำเทคโนโลยีใหม่อย่างหุ่นยนต์และอุปกรณ์ IoT เข้ามาเชื่อมต่อผ่านเครือข่าย 5G ในโรงงาน เพื่อช่วยเติมเต็มการทำงานให้เป็น Smart Manufacturing อย่างสมบูรณ์​เพิ่มขีดความสามารถในการแข่งขันได้</p>\n<p>\"อนาคตข้างหน้าเราฝันว่า จะมีโรงงานที่พนักงานเราทำงานจากที่ไหนก็ได้ เป็นโรงงานปิดไฟมืด มีแต่เครื่องจักรที่ทำงาน วิศวกรก็ดี ผู้บริหารก็ดี นั่งอยู่ข้างนอก นั่งจิบกาแฟ มีปัญหาก็แก้ไขผ่านมือถือ\" คุณสมชายกล่าว</p>\n<h3>5G ไม่ได้มีแค่ประโยชน์แค่เชื่อมต่อข้อมูลแต่ยังรวมถึงการพัฒนาเทคโนโลยีใหม่</h3>\n<p>5G ช่วยเรื่องการเชื่อมต่ออุปกรณ์ต่างๆ ในความหน่วงต่ำ และการทำงานเรียลไทม์ แต่ประโยชน์ด้านการเชื่อมต่อเป็นเพียงส่วนหนึ่งเท่านั้น เพราะ 5G จะช่วยขับเคลื่อนองคาพยพของโครงสร้างพื้นฐานอื่นๆ สำหรับการใช้งานในอุตสาหกรรม</p>\n<p>คุณอัศนีย์​ วิภาตเวท จาก AIS เล่าถึงโครงสร้างที่เกิดขึ้นด้วยเทคโนโลยี 5G ได้แก่ Edge Computing ที่เปิดทางให้โรงงานอุตสาหกรรมสามารถใช้เซิร์ฟเวอร์ประมวลผลบนโครงข่าย 5G ในพื้นที่ที่ใกล้กับความต้องการใช้งาน เช่น การตั้งศูนย์ข้อมูลในนิคมอุตสาหกรรม ช่วยให้ใช้งานได้เหมือนคลาวด์ที่โรงงานไม่ต้องดูแลเซิร์ฟเวอร์เหล่านี้ด้วยตัวเอง แต่การยังได้เซิร์ฟเวอร์ที่อยู่ใกล้หรือแม้แต่อยู่ในพื้นที่ของโรงานเอง  และ 5G ยังเปิดทางผู้ให้บริการเครือข่ายสามารถสร้างเน็ตเวิร์คที่มีความปลอดภัยสูง แยกเน็ตเวิร์คออกสำหรับลูกค้าแต่ละรายเป็นส่วนตัวเหมือนเป็นเน็ตเวิร์คของตัวเอง (Private Network)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/077d88fb9acf694bc43458ad6ebfb583.png\" /></p>\n<h3>สรุป</h3>\n<p>ถ้าย้อนเวลากลับไปสัก 2-3 ปีก่อน คำว่า 5G ดูเป็นอนาคตไกลตัว แต่ในวันนี้เราได้เห็นแล้วว่า 5G กับการใช้งานในพื้นที่จริงและช่วยให้ธุรกิจเปลี่ยนผ่านสู่ดิจิทัลอย่างสมบูรณ์ได้อย่างไรบ้าง</p>\n<p>ก้าวต่อไป 5G ของ AIS คือ การสร้างความเข้าใจในธุรกิจของลูกค้าว่าลูกค้ามีความต้องการและรายละเอียดทางธุรกิจแบบไหน และมี pain point ตรงไหนบ้าง ซึ่ง AIS มีทีมงานที่จะเข้าไปทำงานกับลูกค้า เพื่อช่วยให้ลูกค้าองค์กรได้เปลี่ยนผ่านธุรกิจสู่ดิจิทัลได้  ไม่ว่าลูกค้าจะมาจากอุตสาหกรรมใดก็ตาม</p>\n<p>ผู้ที่สนใจบริการจาก AIS Business สามารถติดต่อเจ้าหน้าที่ที่ดูแลองค์กรของท่าน หรือศึกษาข้อมูลเพิ่มเติมได้ทางเว็บไซต์ <a href=\"https://business.ais.co.th/\">AIS Business</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/enterprise\">Enterprise</a></div><div><a href=\"/topics/manufacturing\">Manufacturing</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6d8341f87a9a16a3aef1ea25e814829753b60e0340730918a352fd0ca9366840","category":"Thai"}