{"title":"Effect of piston bowl geometry and spray angle on engine performance and emissions in HCCI engine using multi‐stage injection strategy","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14203?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>The homogeneous charge compression ignition (HCCI) and combustion chamber geometry play significant roles in improving the potential of compression ignition engines and their environmental sustainability. However, a major hindrance to the progress of HCCI technology has been the notable decline in brake thermal efficiency and emit high levels of hydrocarbon (HC) and carbon monoxide (CO) which is mainly due to the low temperatures during combustion and low post oxidation of these components. Combustion chambers like hemispherical combustion chamber (TCC) and toroidal combustion chamber (TCC) are known to provide better combustion characteristics due to their increased surface-to-volume ratio. Moreover, injection timing and spray position have shown a significant effect on the controlling onset of combustion and emission in HCCI engine. Therefore, the primary objective of this numerical study is to enhance the engine characteristics in HCCI mode using an HCC and TCC piston bowl geometry coupled with multistage injection and compare the results with flat piston bowl geometry. The results show that the toroidal shape piston geometry provides 3%–5% higher brake thermal efficiency compared to the conventional piston geometry. Additionally, the energy balance analysis revealed that the combination of modified piston geometry and multi stage injection improved the combustion process by reducing the energy losses due to incomplete combustion and heat transfer to the engine walls. These findings suggest that the proposed injection strategy combined with modified piston geometry has the potential to enhance the performance of HCCI engines and reduce their environmental impact.</p>","author":"Advait Mishra, \nSaksham Kulshrestha, \nFaisal Moin Patel, \nNishant Tiwari, \nAbhishek Sharma","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"6d846d61a8a1c22643e77fb978268502784b5413973a722b5ecf793647428327","category":"Environment"}