{"title":"Investigating the use of artificial nest boxes positioned at different heights on trees and in isolated positions by dormice (Muscardinus avellanarius): Implications for current survey guidelines","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12330?af=R","date":1716869955000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d7cfd209-69f7-4a0d-b097-a8915c84b27f/eso312330-toc-0001-m.png\" alt=\"Investigating the use of artificial nest boxes positioned at different heights on trees and in isolated positions by dormice (Muscardinus avellanarius): Implications for current survey guidelines\" />\n<p>This research questions the validity of dormouse surveys based on artificial nest boxes, positioned at around 1.4 m from ground level, to determine the presence of dormice (<i>Muscardinus avellanarius</i>) by providing alternative nest sites high in the tree canopy and on isolated posts that could only be reached by traversing the ground. This raises questions regarding the apparent decline of hazel dormice and the contraction of their range based on surveys carried out according to current ‘good practice’ guidance and suggests these should be reviewed and revised to ensure conservation objectives are being met.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThis research, carried out in two phases, is a response to questions raised regarding the validity of surveys based on artificial nest boxes, positioned at around 1.4 m from ground level, to determine the presence of dormice (<i>Muscardinus avellanarius</i>). This species is generally considered to be an arboreal mammal that visits the ground infrequently other than for winter hibernation.\n\nIn Phase 1, artificial nest boxes were positioned high in the tree canopy and at standard height on the same tree. The presence of leaves and material from the woodland floor in nests informed the design of Phase 2 with the inclusion of a third box, on an isolated post with no arboreal connectivity, carried out on a different site.\n\nResults demonstrate the presence of dormice and their nests in artificial nest boxes positioned in the tree canopy, at conventional height and on isolated posts with no arboreal connectivity. This suggests that the current method of surveying for dormice using boxes at around 1.4 m from ground level may not result in robust ‘likely absence’ conclusions for surveys aimed at determining the presence of dormice on a site.\n\nPrevious experience of long-term surveys has indicated that use of artificial next boxes declines with age of box. This was confirmed over the 6 years of the second project reported here. While often taken to indicate decline in population alternative explanations are proposed and this is highlighted as requiring further investigation.\n\nThe apparent decline of hazel dormice and the contraction of their range is evidenced by surveys carried out according to current ‘good practice’ guidance. The results of this research suggest that these should be reviewed and revised to ensure conservation objectives are being met.\n</p>","author":"Debbie Bartlett, \nSam Bower, \nPeter Dear","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"6d920647a465611deb8549c609f6244c1f78d82aac75bd796f77f607b1b95359","category":"Environment"}