{"title":"Mortality and major adverse cardiovascular events after glucagon-like peptide-1 receptor agonist initiation in patients with immune-mediated inflammatory diseases and type 2 diabetes: A population-based study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308533","date":1723125600000,"content":"<p>by Derin Karacabeyli, Diane Lacaille, Na Lu, Natalie McCormick, Hui Xie, Hyon K. Choi, J. Antonio Aviña-Zubieta</p>\r\nObjective <p>To assess the risk of all-cause mortality and major adverse cardiovascular events (MACE) in patients with immune-mediated inflammatory diseases (IMIDs) and type 2 diabetes newly initiating glucagon-like peptide-1 receptor agonists (GLP-1-RAs) versus dipeptidyl peptidase-4 inhibitors (DPP-4is).</p> Methods <p>We performed a population-based cohort study using administrative health data from British Columbia. Patients with an IMID (i.e., rheumatoid arthritis, psoriatic disease, ankylosing spondylitis, inflammatory bowel disease, or a systemic autoimmune rheumatic disease) and type 2 diabetes who newly initiated a GLP-1-RA or DPP-4i between January 1, 2010, and December 31, 2021 were identified using ICD-9/10 codes. The primary outcome was all-cause mortality. Secondary outcomes included MACE and its components (i.e., cardiovascular death, myocardial infarction, and ischemic stroke). Cox proportional hazard regressions were used with propensity score overlap weighting. The analysis was repeated in age- and sex-matched adults without IMIDs.</p> Results <p>We identified 10,855 adults with IMIDs and type 2 diabetes who newly initiated a GLP-1-RA or DPP-4i. All-cause mortality rate was lower among initiators of GLP-1-RAs compared to initiators of DPP-4is, with a weighted hazard ratio (HR) of 0.48 (95% confidence interval [CI], 0.31–0.75) and rate difference (RD) of -9.4 (95% CI, -16.0 to -2.7) per 1000 person-years. Rate of MACE was also lower with GLP-1-RA exposure (HR 0.66 [0.50–0.88], RD -10.5 [-20.4 to -0.8]). Effect sizes were similar in adults without IMIDs.</p> Conclusion <p>In patients with IMIDs and type 2 diabetes, GLP-1-RA exposure is associated with a lower risk of all-cause mortality and MACE compared to a cardioneutral active comparator.</p>","author":"Derin Karacabeyli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6d94372df50825b1c3adc37a71f6437ec25968dbb840211968ad50040746ba45","category":"Interdisciplinary"}