{"title":"Lead admin of child sex abuse website pleads guilty, faces 20 years to life","link":"https://arstechnica.com/?p=1947631","date":1686691520000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-519951874-800x537.jpg\" alt=\"The bars of a jail cell are pictured along with a man's hand turning a key in the lock of the cell door.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-519951874-scaled.jpg\">Enlarge</a> (credit: Getty Images | Charles O'Rear)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A man described as the lead administrator of a child sexual abuse website pleaded guilty to engaging in a child exploitation enterprise and faces a sentence of at least 20 years and possibly life in prison. The website was \"dedicated to the advertisement and distribution of images and videos depicting child sexual abuse,\" the federal government said.</p>\n<p>William Michael Spearman, a 57-year-old from Alabama, pleaded guilty yesterday in US District Court for the Southern District of Florida, the US Department of Justice <a href=\"https://www.justice.gov/opa/pr/man-pleads-guilty-running-child-sexual-abuse-website\">announced</a>. Four other defendants were previously convicted of crimes related to \"their involvement with the same website,\" the DOJ said.</p>\n<p>\"The website included a section devoted to the sexual abuse of infants and toddlers, a section devoted to images and videos depicting children being subjected to pain and torture, and a section devoted to avoiding detection by law enforcement,\" the DOJ said. \"As the lead administrator, Spearman managed numerous 'staff' members, directed them how to help run the site, recommended other users for promotion, kept records of child pornography files advertised and distributed over the site, presided over staff meetings, praised and scolded users, and counseled users and other managers about the function and expectations of the website. Spearman also advertised and distributed images over the website.\"</p></div><p><a href=\"https://arstechnica.com/?p=1947631#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947631&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6d9cac4450b544df7930719a8a0d9d81d421b24b2dbe13c2c4c727cb6a74f289","category":"Tech"}