{"title":"Ameliorative Effects of Different Dietary Levels of Fish Protein Hydrolysate (FPH) on Growth and Reproductive Performance, Feed Stability, Tissues Biochemical Composition, Haematobiochemical Profile, Liver Histology, and Economic Analysis of Pabda (Ompok pabda) Broodstock","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6044920?af=R","date":1706774400000,"content":"<p>This study investigated the impacts of various inclusion levels of dietary potential of fish protein hydrolysate (FPH) on the growth and reproductive performance, biochemical composition, blood parameters, and liver histology of <i>Ompok pabda</i> broodstock. About 600 pabda broods (11.00 ± 0.05 g) were distributed into 12 cages and fed twice in a day. For this, four experimental diets (crude protein: 30%; crude lipid: 9%) were prepared by incorporating FPH at different percentages (0%, 5%, 7%, and 9%). The FPH positively impacted (<i>p</i> &lt; 0.05) the durability index, water stability, and swelling rates of the experimental diets. Furthermore, significantly higher palatability (<i>p</i> &lt; 0.05) was recorded for pabda diets incorporated with 5% and 7% FPH. After 90 days, the growth performance of pabda in final weight, live weight gain, total biomass, specific growth rate, hepatosomatic index, visceral somatic index, and nutrient utilization indices, feed conversion ratio and protein efficiency ratio, was significantly (<i>p</i> &lt; 0.05) improved when fed with 7% FPH diet. Additionally, the ovipositor diameter (5.10 ± 0.05 mm), spawning response (98.48 ± 2.4%), fecundity (13.28 ± 0.23 × 10<sup>4</sup> eggs/kg), and egg fertilization rate (87.09% ± 0.14%) were significantly higher (<i>p</i> &lt; 0.05) for the 7% FPH dietary group than other treatments. The fish group that received control diet experienced a marked (<i>p</i> &lt; 0.05) reduction in egg hatching rates, coupled with longer ovulation period as compared to FPH-treated groups. Dietary FPH inclusion at different levels also caused notable improvements (<i>p</i> &lt; 0.05) in most hematological and serum biochemical indices of pabda broodfish. The 7% FPH group also exhibited enhanced liver health, characterized by superior nuclei, erythrocyte, and cytoplasmic structure and boosted the farm economics efficiency. In summary, 7% dietary FPH is suitable and beneficial for <i>O. pabda</i> broodstock development in captivity by improving growth and reproductive performance, overall health, and farm economics.</p>","author":"Nahid Hasan Sezu, \nShishir Kumar Nandi, \nAfrina Yeasmin Suma, \nZulhisyam Abdul Kari, \nLee Seong Wei, \nPaul Seguin, \nMikael Herault, \nMd. Sakhawat Hossain, \nMartina Irwan Khoo, \nEl-Sayed Hemdan Eissa, \nMuhammad Anamul Kabir, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6d9e98cd4f5f3930dc1d7c89cbcd846db6f282f48f42c4dd7f838fb768380743","category":"Environment"}