{"title":"Changes in blood catecholamines during induction of general anesthesia in patients with post-induction hypotension undergoing laparoscopic cholecystectomy: A single-center prospective cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305980","date":1719324000000,"content":"<p>by Yi Yao, Xia Kong, Xuhui Chen, Yingying Zhang, Xueru Liu, Xiaobin Wang</p>\r\nBackground <p>Post-induction hypotension (PIH) often occurs during general anesthesia induction. This study aimed to investigate blood catecholamine levels during induction of general anesthesia in patients with PIH undergoing laparoscopic cholecystectomy.</p> Methods <p>This prospective study included 557 adult patients who underwent laparoscopic cholecystectomy under general anesthesia. PIH was defined as a greater than 20% decrease in systolic blood pressure from the pre-induction value, a systolic arterial pressure of less than 90 mmHg, or both. Plasma concentrations of epinephrine and norepinephrine during the induction of general anesthesia were determined using enzyme-linked immunosorbent assay. Multivariate logistic regression analysis evaluated the association between the clinical factors and PIH.</p> Results <p>Of the 557 patients, 390 had PIH, and the remaining 167 were allocated to the non-PIH group. Changes in blood adrenaline, noradrenaline levels, or both were more pronounced in the PIH than in the non-PIH group (p&lt;0.05). Age, body mass index, a history of hypertension, preoperative systolic blood pressure, and propofol or sufentanil dose were independent predictors of PIH.</p> Conclusion <p>The changes of blood catecholamines in patients with more stable hemodynamics during the induction of general anesthesia are smaller than that in patients with post-induction hypotension.</p> Trial registration <p>ChiCTR2200055549, 12/01/2022.</p>","author":"Yi Yao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6da0f845ee5a1d1620289bc2cc8e9d84bf3344378dac27692ae001a860fb3662","category":"Interdisciplinary"}