{"title":"Lauren De Crescenzo wins women’s Unbound Gravel 200 mile event","link":"https://cyclingtips.com/2021/06/lauren-de-crescenzo-wins-womens-unbound-gravel-200-mile-event/","date":1622937202000,"content":"<p>Lauren De Crescenzo won the women’s Unbound Gravel 200 mile race in 12 hours six minutes and 49 seconds, nearly 16 minutes ahead of defending champion Amity Rockwell.</p>\n\n\n\n<p>After two flats early on De Crescenzo was on the back foot and had to chase for an hour to catch the women out front. “I was chasing, it took a while,” De Crescenzo said at the finish. “I was moving really fast the whole time.” De Crescenzo moved into the lead with 55 miles to go and worked with a few men on course to extend her advantage over her competitors. </p>\n\n\n\n<p>Second place finisher Rockwell chose to ride conservatively from the start, with the idea that she would be stronger than the rest by hour eight. “Lauren passed me pretty early, and I slowly got everyone except her, she was long gone apparently,” Rockwell said.</p>\n\n\n\n<p>“The main emotion is probably relief right now,” Rockwell said at the finish. “I thought the last time was hard when I won, but this was way harder.” </p>\n\n\n\n<p>De Crescenzo rode the final 25 miles on her own, taking advantage of her time trial extensions. The Cinch Cycling racer could not have planned a better comeback story for Emporia after she broke her collarbone 30 miles into Unbound Gravel in 2019.</p>\n\n\n\n<p>“I don’t know if it’s as hard as <a href=\"https://everesting.cc\" target=\"_blank\">Everesting</a>, but this is the hardest gravel race I’ve ever done,” De Crescenzo said of the effort.</p>\n\n\n\n<h3>Results</h3>\n\n\n\n<ol><li>Lauren de Crescenzo 12:06:49</li><li>Amity Rockwell +0:15:26</li><li>Emily Newsom +0:24:03</li><li>Whitney Alison +0:27:30</li><li>Shayna Powless +0:31:01</li></ol>\n<p>The post <a href=\"https://cyclingtips.com/2021/06/lauren-de-crescenzo-wins-womens-unbound-gravel-200-mile-event/\">Lauren De Crescenzo wins women’s Unbound Gravel 200 mile event</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6da6b2db3cb928b330951cedb386359d8341830d156e562c22dc1fdaa034510e","category":"Cycling"}