{"title":"PSIV-17 Effects of butyrin-based additive supplementation on nursery pig performance, fecal dry matter, serum cytokines, short chain fatty acid production, and serum chemistry","link":"https://academic.oup.com/jas/article/102/Supplement_2/307/7665023?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Two experiments were conducted to determine the effects of butyrin-based feed additives on nursery pig performance, fecal dry matter (DM), serum chemistry, and short chain fatty acid (SCFA) production. In Exp. 1, 250 pigs (initially body weight = 5.6 kg) were randomly allotted to 1 of 5 treatments. There were 5 pigs/pen and 10 replications/treatment. Treatments consisted of a negative control, a positive control, and three diets containing various butyrin-based feed additives. The negative control was a corn-soybean meal-based diet with no antibiotics or pharmacological content of Zn or Cu. The positive control contained 3,000 and 2,000 mg/kg of Zn from ZnO in phase 1 (d 0 to 10) and 2 (d 10 to 24), respectively, 250 mg/kg of Cu from CuSO<sub>4</sub> in phase 3 (d 24 to 38), and 55 mg/kg of carbadox (Mecadox; Phibro Animal Health Corp., Teaneck, NJ) across all phases. The butyrin-based feed additives were added at 0.1% to the negative control diet and consisted of monobutyrin, mono-tributyrin, or tributyrin. In Exp. 2, 1,492 pigs (initially 5.1 kg) were randomly allotted to 1 of 4 treatments. There were 26 or 27 pigs/pen and 14 replications/treatment. Treatments were fed over 3 phases consisting of a control diet and 3 diets containing different mono-tributyrin blends. In phase 1 and 2, the control diet contained 55 mg/kg of carbadox and 3,000 and 2,000 mg/kg of Zn from ZnO, respectively. Each feed additive was added at 0.3% to the control diet in phase 1 and 2, and 0.1% in phase 3. Phases 1 and 2 were fed by feed budget of 2.3 and 5.4 kg/pig, respectively, and phase 3 until the completion of the study. Overall, for Exp. 1, pigs fed the positive control had increased (<span>P</span> &lt; 0.05) average daily gain (ADG) and average daily feed intake (ADFI) compared with all other treatments (Table). Pigs fed monobutyrin had decreased (<span>P</span> &lt; 0.05) gain to feed ratio (G:F) compared with all other treatments. On d 24, pigs fed the positive control and mono-tributyrin had increased (<span>P</span>&lt; 0.05) fecal DM compared with pigs fed monobutyrin and tributyrin with the negative control intermediate. On d 38, pigs fed mono-tributyrin had increased (<span>P</span> &lt; 0.05) serum haptoglobin and cecal butyrate concentration compared with pigs fed the positive and negative control, respectively, with other treatments intermediate. For Exp. 2, there were no differences in growth performance throughout the study. On d 10, pigs fed mono-tributyrin blend 3 had increased (<span>P</span>&lt; 0.05) fecal DM compared with mono-tributyrin blend 2 with other treatments intermediate. On d 24 and 42, pigs fed mono-tributyrin blend 1 had the highest (<span>P</span> ≤ 0.012) IL-12 concentration, without significant mean separation on d 24. In summary, butyrin-based feed additives had limited effects on growth performance. However, supplementing butyrin-based feed additives led to alterations in fecal consistency, SCFA production, and serum chemistry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6daa9f2f79acea68d974511fa355e275c5609220bf61a5cdd4525b0b494443e8","category":"Environment"}