{"title":"Signal‐Transduction Proteins from Caribbean Cassiopea xamachana: The Scaffolding Protein CxRACK1 Shows Conserved Molecular Signatures and Differential Expression between Larval and the Subsequent Metamorphic Stages","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/8676010?af=R","date":1724659376000,"content":"<p>The molecular features from the coding sequence and part of the 5′-UTR of the scaffolding protein receptor for activated C kinase (<i>CxRACK1</i>) gene from the jellyfish <i>Cassiopea xamachana</i> were assessed by a combination of regular and inverse PCR amplifications. The final <i>CxRACK1</i> mRNA sequence contained 1,041 bp with an open reading frame of 954 bp that translated into 317 amino acids. The translated primary sequence contained the canonical seven WD40 domains, one ribosome, and three conserved protein kinase C (PKC)-binding sites as well as the Tyr amino acid targets for Src phosphorylation. The protein showed a conserved CxRACK1 tertiary structure since the seven WD40 domains clearly assembled into the characteristic <i>β</i>-propeller shape displaying surface exposed amino acids critical for regulation by phosphorylation. Within the 5′-UTR, <i>cis</i>-acting regulatory elements were analyzed with available software from the closest organismal phylogeny which corresponded to that of chordates, plants, and fungi. Of note were one element related to retinol binding, three that corresponded to light regulation, two to target binding sites for zinc finger domain proteins, and two more were transcriptional activators. Further phylogenetic analysis placed <i>CxRACK1</i> within the Scyphozoa group as expected. RT-qPCR analysis of distinct physiological stages through the <i>C. xamachana</i> metamorphic cycle showed slightly but consistent lower <i>CxRACK1</i> mRNA levels in scyphistomae, strobilae, and ephyrae than those in buds and larvae. This suggested an increased expression and possible involvement of this molecule in signal transduction processes related to the transition to these initial metamorphic stages.</p>","author":"Tania Islas-Flores, \nPatricia Cabrales-Arellano, \nEstefanía Morales-Ruiz, \nMarco A. Villanueva, \nChristyn Bailey","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6dbf34fdc70f5870a96fb457a57e87d4dc10360cee3000306bbaa91a2a7ec6be","category":"Environment"}