{"title":"Curcumin Supplementation Enhances the Feeding and Growth of Largemouth Bass (Micropterus salmoides) Fed the Diet Containing 80 g/kg Fish Meal","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/5454248?af=R","date":1677225600000,"content":"<p>Two feeding trials were conducted to evaluate the influence of dietary curcumin level on fish meal replacement with poultry by-product (PBM) in a largemouth bass (<i>Micropterus salmoides</i>) diet. In trial I, the reference diet (R) contained 400 g/kg fish meal, and PBM replaced 60 and 80% of the fish meal (P16 and P8). In trial II, the diet containing 80 g/kg fish meal (P8) served as control (C), and curcumin was added at 5000 and 10000 mg/kg (C5 and C10), respectively. Replacement of fish meal with PBM significantly influenced feed intake, phosphorus retention efficiency (PRE), body lipid content, the ratio of fish meal consumption to fish production (RCP), and wastes of carbon and phosphorus but did not result in significant alternation in weight gain, feed conversion ratio (FCR), retention efficiencies of nitrogen (NRE), carbon (CRE) and energy (ERE), viscerosomatic index (VSI), hepatosomatic index (HSI), and body composition. The RCP, body lipid content, and phosphorus waste were higher in fish fed diet R than in fish fed diets P16 and P8. Curcumin supplementation influenced weight gain, feed intake, FCR, carbon waste, and RCP, but did not result in significant alternation in CRE, NRE, PRE, ERE, condition factor, VSI, HSI, body composition, and nitrogen and phosphorus wastes. The weight gain and feed intake were higher in fish fed diet C10 than in fish fed diet C, while the carbon waste was higher in fish fed diets C5 and C10 than in fish fed diet C. Overall, the minimum dietary fish meal level for largemouth bass could be dropped to 80 g/kg when PBM was used as an alternative ingredient, and 10000 mg/kg curcumin could obviously improve growth of fish fed diet containing 80 g/kg fish meal.</p>","author":"Li Wang, \nAnlan Yu, \nCong Yu, \nUmar Bashir Ibrahim, \nJianming Chen, \nYan Wang, \nZhitao Qi","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6dc4fbc13f5834113c75f0749217b6b5ac577549e55f56d769eb0ea63bca3d74","category":"Environment"}