{"title":"The Association between Dietary Protein Intake and Sources and the Rate of Longitudinal Changes in Brain Structure","link":"https://www.preprints.org/manuscript/202403.1415/v1","date":1711368428000,"content":"Few studies have examined the dietary protein intake and sources in combination with the longitudinal changes in brain structure markers. Our study aimed to examine the association between dietary protein intake and different sources of dietary protein with the longitudinal rate of change in brain structural markers. A total of 2723 and 2679 participants from the UK Biobank were included in the analysis. The relative and absolute amounts of dietary protein intake were calculated through a 24-hour dietary recall questionnaire. The longitudinal change rates of brain structural biomarkers were computed using two waves of brain imaging data. We utilized multiple linear regression to examine the association between dietary protein and different sources and the longitudinal changes in brain structural biomarkers. Restrictive cubic splines were used to explore nonlinear relationships, and stratified and sensitivity analyses were conducted. Increasing the proportion of animal protein in dietary protein intake is associated with a slower reduction in the total hippocampus volume (THV, β: -0.02524, P&amp;lt;0.05), left hippocampus volume (LHV, β: -0.02435, P&amp;lt;0.01) and right hippocampus volume (RHV, β: -0.02544, P&amp;lt;0.05).Higher intake of animal protein relative to plant protein is linked to a lower atrophy rate in THV (β: -0.01249, P&amp;lt;0.05) and LHV (β: -0.01173, P&amp;lt;0.05) and RHV (β: -0.01193, P&amp;lt;0.05). Individuals with higher intake of seafood exhibit lower longitudinal rate of change in HV compared to those with no consume (THV, β: -0.004514; P&amp;lt;0.05; RHV, β: -0.005527, P&amp;lt;0.05). In subgroup and sensitivity analyses, there was not a significantly alteration. A moderate increase in the intake and proportion of animal protein in the diet, especially from seafood, is associated with a lower longitudinal change rate in hippocampus volume.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6dc8124dd810837d2752125a3e2d2800ce7d0c1736846f8480df61535316aff7","category":"Interdisciplinary"}