{"title":"Decapod Crustacean Larval Communities in the South Adriatic: Spring Composition, Horizontal and Vertical Distribution Patterns","link":"https://www.preprints.org/manuscript/202409.0839/v1","date":1726031425000,"content":"An oceanographic cruise from southern Adriatic to the northern Ionian basins, during 2013 spring period, allowed us to describe spatial abundance and distribution of decapod crustacean larval assemblages with a multidisciplinary approach. Seventeen locations on the Apulian and Albanian shelves and offshore waters, including the Strait of Otranto, were sampled by BIONESS electronic multinet. In May 2013 a swarm of zoeae (11 Brachyura taxa, mostly at first instar, with Xantho granulicarpus at 87%) was recorded in the neuston of the Italian side. Decapod larvae were concentrated in the first 20-30 m surface layer, strongly linked to the thermocline and generally above the DCM, suggesting that they are involved in surface water circulation. The migratory behavior of decapod larvae in coastal stations is quite regular between 20 and 60 m depth and daily time independent. In offshore stations, migration is compatible with the day-night cycle, where a minimum WMD value is evident at about 20m at night. The availability of four satellite-tracked surface drifters in the same area and period of the larvae presence, represented a possibility to discuss the geographic dispersal of larvae linked to the surface circulation in successive days. Only one drifter crossed the south Adriatic passing from the Italian to the Balkan neritic area, employing about 40 days. The actual genetic homogeneity of many Brachyura coastal species populations on the opposite sides of the Adriatic Sea, suggests the existence of a genetic connection which should not rely exclusively upon larvae circulation and needs to be fueled by additional strategies of biological communication.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6dd978e3f51253d70ed94e4deaa6b8d386657547226a7ae622d44afabf44e0d0","category":"Interdisciplinary"}