{"title":"Investigating the mechanism of antioxidants as egg white powder flavor modifiers","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13146?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The uses of egg white powder (EWP) are restricted because of its odor. It is necessary to find a method to improve its flavor. In this paper, three different antioxidants – green tea extract (GTE), sodium ascorbate (SA), and glutathione (GSH) – were selected to modify the flavor. The physicochemical and structural properties of EWP were investigated to study the mechanism of the formation and release of volatile compounds.</p>\n<h2>RESULTS</h2>\n<p>Antioxidants can modify the overall flavor of EWP significantly, inhibiting the generation or release of nonanal, 3-methylbutanal, heptanal, decanal, geranyl acetone, and 2-pemtylfuran. A SA-EWP combination showed the lowest concentration of ‘off’ flavor compounds; GTE-EWP and GSH-EWP could reduce several ‘off’ flavor compounds but increased the formation of geranyl acetone and furans. The changes in the carbonyl content and the amino acid composition confirmed the inhibition of antioxidants with the oxidative degradation of proteins or characteristic amino acids. The results of fluorescence spectroscopy and Fourier transform infrared (FTIR) spectroscopy provided structural information regarding EWP, which showed the release of volatile compounds decreased due to structural changes. For example, the surface hydrophobicity increased and the protein aggregation state changed.</p>\n<h2>CONCLUSIONS</h2>\n<p>Antioxidants reduce the ‘off’ flavor of EWP in two ways: they inhibit protein oxidation and Maillard reactions (they inhibit formation of 3-methylbutanal and 2-pemtylfuran) and they enhance the binding ability of heat-denatured proteins (reducing the release of nonanal, decanal, and similar compounds). © 2023 Society of Chemical Industry.</p>","author":"Weijian Zhang, \nYanjun Yang, \nYujie Su, \nLuping Gu, \nCuihua Chang, \nJunhua Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6dd9a3df75b85af6ce6433494e0af1afff9aa6602dc2aa9e825a80cce7e6cab4","category":"Environment"}