{"title":"Doping Effect on Ge(001)/Mn5Ge3Cx Co-Sputtered Thin Films by Solid Phase Epitaxy Method","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.597/7719655?rss=1","date":1721779200000,"content":"<span>A major challenge of semiconductor spintronics is the integration of information storage and processing in a single material. This requires efficient spin injection, detection, manipulation, transport, and storage of spins. Magnetization switching by an electric current is a phenomenon critical for the spread of magnetic random-access memories and magnetic logic [<a href=\"#ozae044.597-B1\">1</a>]. The principle of this operation is due to the spin transfer torque (STT) effect, which is a mechanism of the orientation of the magnetic moments based on the interaction between the charge and the spin of the electrons that occurs in ferromagnetic and ferrimagnetic materials. It has been found that Mn<sub>5</sub>Ge<sub>3</sub> is a ferromagnetic compound that increases its Curie temperature, <span>TC</span>, with carbon doping. C-doping modifies the electronic structure of the Mn atoms, mainly the 3d subband of the Mn II [<a href=\"#ozae044.597-B2\">2</a>, <a href=\"#ozae044.597-B3\">3</a>]. Mn<sub>5</sub>Ge<sub>3</sub> thin films have attracted much attention due to their magnetic and structural properties, we present the growth of Ge(001)/Mn<sub>5</sub>Ge<sub>3</sub> thin films by magnetron-sputtering technique, using the solid phase epitaxy (SPE) method, which consists of the deposition of Mn or co-deposition of Mn and C at room temperature followed by thermal annealing at a substrate temperature, <span>Ts</span>, to induce Ge diffusion into the Mn layer to form the Mn<sub>5</sub>Ge<sub>3</sub> compound.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"6de52a8149242b4efcd6e29d4025fa3615cabfbc22d240dec0540726d1542470","category":"Environment"}