{"title":"Should alarm bells be ringing for Evenepoel and Soudal - Quick-Step at the Giro d’Italia?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/cracking-on-category-two-climbs-should-alarm-bells-be-ringing-for-evenepoel-and-soudal-quick-step-at-the-giro-d-italia","date":1683653023000,"content":"\n      <p><span>Was stage four of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia </a>simply a bad day for Soudal - Quick-Step? A series of mistakes and poor tactical decisions? Will it be an anomaly in their assault of </span><i><span>La Corsa Rosa </span></i><span>that they will learn from and rectify? Or should Remco Evenepoel, who for the last three stages has seemed imperiously strong, start to worry about the team he has to support him in his fight for pink? Could it be that the very riders who are supposed to be there to help him may, in fact, be the world champion’s downfall? Soudal - Quick-Step’s performance today raises a number of questions.</span></p>\n<div></div>\n<p><span>The team’s head-scratching tactics began during the hectic opening to the stage when riders began to scramble to get in the breakaway of the day – something that Soudal - Quick-Step arguably brought on themselves when Evenepoel publicly announced his plan to purposefully relinquish the pink jersey on today’s stage. After 20km of racing, a group of 14 riders escaped the peloton, none of whom were a serious threat to the overall general classification battle. However, rather than allowing this group to get away, Quick-Step chased hard behind for a subsequent 15 minutes, dropping some of Evenepoel’s own teammates out of the back of the bunch in this process.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography-07174_1024x1024.jpg?v=1683650388\" alt /><em><span>Image: Zac Williams/SWpix</span></em></span></p>\n<p><span>Once they brought those first escapees back to the jaws of the peloton, the attacks from the bunch came again. And again. And again. It led to a brutal 60 kilometre fight in the lashing rain until the eventual winning breakaway went clear up the road. Over three hours of relentless racing led to a fatigued Soudal - Quick-Step squad who had been clambering to control the stage ever since the flag dropped. But by this point, it seemed like the Belgian team had at least created a race situation they should have been satisfied with: there was a group up the road with no dangerous GC riders and the chance to let the time gap grow enough to ensure that Evenepoel would lose the pink jersey as desired and avoid the rigmarole that comes with having it after every stage.</span></p>\n<p><span>However, Soudal - Quick-Step continued to ride hard on the front of the bunch as the stage continued, ensuring that the breakaway group ahead didn’t get a gap much above four minutes. With this hard work the team put in on the front –seemingly for little benefit whatsoever – one by one as their turns were completed, Soudal - Quick-Step riders began to slip off the back of the peloton. Although Evenepoel was going to lose the pink jersey as he'd hoped, the team continuously decided to push the pace on the front. All that this riding achieved was to leave Evenepoel completely isolated, with all his teammates spent, as the reduced bunch made its way up the final ascent of the day.</span></p>\n<p>Even the likes of Ilan van Wilder and Louis Vervaeke, two of Evenepoel’s key domestiques who would have been expected to be with him in the middle to high mountains in this race, were unable to hold on to the peloton on the final climb. This was despite it only being a category two ascent – there is far more arduous terrain to come in this race.</p>\n<p><span>The world champion being left alone on this climb made him vulnerable to attacks. Today, none of the other GC contenders took advantage of Evenepoel being without teammates, but the same scenario cannot be relied on as the race goes on. The crucial thing is that Soudal - Quick-Step have now shown some serious chinks in their armoury. At the start of this race when Evenepoel took such a dominating time trial win, it almost felt like Specialized should have started creating the pink bike for him to ride in Rome already, but today changed everything.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--2792_1024x1024.jpg?v=1683650274\" alt /></span><em><span>Image: Zac Williams/SWpix</span></em></p>\n<p><span>There is now a clear pathway to how Evenepoel can be beaten: he surely can’t respond to every single attack if he finds himself without teammates in the upcoming mountains. If other stages have aggressive, tough starts like today’s did, then rival general classification teams will be rubbing their hands together at the chance to get the world champion alone and vulnerable as the gradients kick up. The Ineos Grenadiers, by contrast, had five riders left in the front group at the end of stage four, while Jumbo-Visma had three. Is Soudal - Quick-Step really ready to put up a proper fight to these experienced, focused GC squads?</span></p>\n<p><span>Of course, Evenepoel’s pure strength might just do it. Perhaps he’s good enough to win this Grand Tour even without the best team around him, but that’s a risky strategy that comes with stress and pressure. Perhaps today’s stage was one that Soudal - Quick-Step will learn from and they will ride more conservatively in the days to come, but they have now, crucially, opened themselves up to attack.</span></p>\n<p><span> Evenepoel no longer seems infallible, and while he might be a super talent of the modern cycling era, it’s hard to imagine that one rider could have the strength of a team of nine. There is a long way to go in this Giro d’Italia and, although it didn't lead to any serious changes to the general classification, today’s stage was perhaps the most important one of the race yet. It was a sign that the roads to pink in Rome may not be as simple as Soudal - Quick-Step might have hoped.</span></p>\n\n<p><span><em><span>Cover image: Zac Williams/SWpix</span></em><br /></span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6de6f31273a746e88d89df20055474948467218c2058ec1c3d1200e3b601da2b","category":"Cycling"}