{"title":"How iPadOS 15 can finally make Apple’s tablet live up to its potential","link":"https://www.macworld.com/article/347967/wwdc-2021-ipados-15-ipad-pro-home-screen-widgets-pro-apps-multitasking-keyboard-shortcuts.html","date":1622800800000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>After a decade, technology can often start to seem a bit boring, but the iPad experienced a bit of a resurgence in the last year, thanks in no small part to a pandemic that saw a lot more people working from home. But despite the iPad’s popularity and its amazing hardware, the general consensus seems to be that the tablet’s software just can’t keep pace. So all eyes are on Apple’s imminent Worldwide Developers Conference, where the company will likely take the wraps off the latest update to iPadOS and we’ll discover whether our wishes have been granted.</p>\n\n\n\n<p>Until then, our hopes and dreams for the iPad remain in a quantum state, like Schrödinger’s cat: simultaneously bestowed and rejected. And while we won’t know which will be which until Apple opens that box, that certainly doesn’t deter me from thinking about the iPad updates I’d like to see.</p>\n\n\n\n<h2>There’s no place like home screen</h2>\n\n\n\n<p>Last year’s iOS 14 update brought the biggest improvements to the iPhone’s home screen since the device debuted. But love for the iPad was surprisingly short. Though the iPhone now lets you add widgets to your home screen and hide less frequently used programs in its App Library, the iPad got neither of those improvements. Widgets are still constrained to a column on the iPad’s first home screen, and App Library is nowhere to be found.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/ipados-14-june-2020.png?w=1200\" /><figcaption><p>TIme for a new home screen for iPadOS.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The easy move for Apple here would be to simply add those missing home screen features to the iPad, but part of me suspects that the company may have something more in mind. After all, two years ago, Apple forked iPadOS off from iOS with the idea that the iPad deserved its own full-fledged operating system. This gives Apple the freedom to treat these two devices differently, according to their needs, though so far that doesn’t seem to have benefited the iPad so much as not let it hold back the iPhone.</p>\n\n\n\n<p>Still, I’m hoping that Apple has decided to give the iPad’s home screen a more substantive makeover. Not just widgets anywhere, but perhaps even <strong>free-floating widgets</strong> not attached to a grid. Maybe the <strong>ability to add documents or files to the home screen</strong>. Or what if you could <strong>dock a live app to the home screen</strong> somehow, as sort of a super widget? The iPad’s expansive home screen has always seemed a bit wasted by just featuring a super-sized iPhone home screen: time to let it come into its own.</p>\n\n\n\n<h2>Cleaning up the multitasking mess </h2>\n\n\n\n<p>Multitasking on the iPad is, to put it generously, a mess. Split View and Slide Over, first introduced in 2015’s iOS 9 and refined a couple of times over the years, have always had the feeling of a band-aid slapped over a mortal wound. Their limitations (like the dance of getting an app that’s not in your dock into Split View) and awkward gestures (how many times have you activated Slide Over when you meant to simply swipe) feel cumbersome, especially compared to the multitasking we’ve always had on the Mac.</p>\n\n\n\n<p>So I’m hoping that 2021 is the year that <strong>Apple finally cracks multitasking on the iPad</strong>. I’m not sure exactly what that looks like; there are those who argue for the wholesale transplant of macOS’s windowing system, but that seems as though it might be another imprecise fit borne out of convenience rather than actual appropriateness. Fundamentally, though, the iPad has always been built around the idea of one app on the screen at any time, and it’s clear that simply won’t do in a world where people expect to be able to run multiple apps at once.</p>\n\n\n\n<p>The good news it that there are indications that Apple may be heading in this direction, from the addition of multiple windows for iPad apps in 2019 to the recently touted ability to hook up your new 2021 iPad Pro to a Pro Display XDR—which seems like overkill when all you could theoretically do at present is run one app on a really big, really expensive screen.</p>\n\n\n\n<h2>Going pro</h2>\n\n\n\n<p>The iPad Pro has been around for more than five years, and while the signifier of that Pro moniker has had different interpretations over the years (used to be, for example, it was the only model that worked with the Smart Keyboard or Apple Pencil, a feature now available even on the $329 basic iPad), one thing has been lacking throughout: <strong>Apple’s own pro apps</strong>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/photoshop-ipad.jpg?quality=50&amp;strip=all\" /><figcaption><p>If Adobe can make a pro app like Photoshop for iPad, why can’t Apple bring its pro apps over?</p></figcaption></figure><p>Adobe</p></div>\n\n\n\n<p>If you’re a Mac user accustomed to getting your job done in Final Cut Pro, Logic Pro, or Xcode, the iPad—Pro as it may be—is simply a non-starter. That is, it must be said, a tad embarrassing, not only because Apple markets its device as “pro,” but also because the most recent iPad Pro runs on the same M1 chip in the latest Apple-silicon based Macs—which are all more than capable of running the above apps.</p>\n\n\n\n<p>So, I’d hope that the upcoming WWDC presentation shows off at <em>least</em> one of Apple’s pro applications having made the jump to iPadOS. If the company is looking to kickstart the tablet’s future, and keep building on the success the device has had over the past year, then enabling pros by letting them use <em>your own software</em> is a great and long overdue step.</p>\n\n\n\n<h2>A little bit of this, a little bit of that</h2>\n\n\n\n<p>There are, of course, plenty of other improvements I’d like to see to iPadOS, and this article isn’t long enough for all of them. Amongst them, allow me to indulge a personal wish: one place that iPadOS really falls down for me, personally, is in its handling of audio. Even after a decade, you still can’t <strong>record audio in one app while using a mic in another app</strong>—for those of us out there who dream of using the iPad as powerful, portable podcast studio, it’s a sad state of affairs.</p>\n\n\n\n<p>This one I’ll steal from my colleague <a href=\"https://www.macworld.com/author/jason-snell\">Jason Snell</a>: <strong>global keyboard shortcuts</strong>. Given that you might very well have an external hardware keyboard you use with your iPad these days, it would be great if iPadOS allowed for the same degree of customization as macOS, letting you not only remap existing keyboard shortcuts, but perhaps even create ones that work throughout the system and let you trigger Shortcuts.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-home-app-ios-14.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Home app on iPad needs a refresh.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Finally, I’d like to see some <strong>improvements to the Home app</strong>. This isn’t unique to iPadOS, but as I’m hoping to see a bigger push from Apple on smart home tech at this year’s WWDC, thanks to the new <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://zigbeealliance.org/news_and_articles/chip-is-now-matter/&amp;xcust=1-1-347967-0-0-0&amp;sref=https://www.macworld.com/feed\">Matter initiative</a>, the iPad should certainly come along for the ride. The Home app on the iPad suffers from the same woes as the tablet’s home screen: surely there’s a better way to interact with and display information than just a grid of tiles. Here’s hoping it gets a much-needed refresh by surfacing more useful information, perhaps mimicking the way Control Center uses machine learning to figure out which smart home accessories you’re most likely to want to interact with at certain times, locations, and conditions.</p>\n\n\n\n<p>There’s a lot more that Apple could do with iPadOS, and I’m hopeful that there will be plenty of new additions and improvements that I haven’t even thought of. It’s clear the iron is hot for Apple’s tablet, and the company would seriously be missing a trick if it didn’t strike—and strike hard.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6de806655606a4995ca4ed8d06c58fb175c93ad6125eb6dbeb94667861bb9fe6","category":"Apple"}