{"title":"The Effect of Silymarin on Ischemia-Reperfusion Injury in Skeletal Muscles of Rats","link":"https://www.preprints.org/manuscript/202405.1896/v1","date":1716960144000,"content":"Background and Aim: It is generally accepted that oxidative stress mediators play an important role in ischemia-reperfusion injury(I/R), although the exact mechanism is not fully elucidated. While the impact of silymarin on I/R injury in several tissues, including the myocardial, cerebral, gastric and liver tissue, has been examined, the present state of research on this topic remains insufficient to provide a widely accepted understanding. For this purpose, our objective was to examine the effect of silymarin on muscle tissue in rats subjected to lower extremity I/R injury.\nMethod: After ethics committee approval, 18 male Wistar albino rats weighing between 225-275 g were used. The rats were divided into three groups containing six mice each, Control,Ischemia-Reperfusion and Silymarin-Ischemia/Reperfusion groups. Silymarin was administered intraperitoneally 30 minutes before the procedure.( 100 mg/kg-1 ) In the I/R groups, an atraumatic microvascular clamp was placed in the infrarenal abdominal aorta. After 120 minutes, the clamp was removed and reperfusion was achieved for 120 minutes. In muscle tissue samples taken at the end of the reperfusion period; Malondialdehyde (MDA) levels, catalase (CAT) enzyme activity levels and histopathological parameters were compared.\nResults: In the histopathological examination, no degeneration was observed in the muscle fibers in the control group, while findings of striated muscle damage such as muscle atrophy hypertrophy, muscle degeneration-congestion, internal of the muscle nucleus-oval-central nucleus, fragmentation-hyalinization and leukocyte cell infiltration were observed in the I/R group. In the S-I/R group, muscle atrophy hypertrophy, internal of the muscle nucleus-oval-central nucleus, fragmentation-hyalinization and leukocyte cell infiltration were observed to improve these damaged areas compared to the I/R group. MDA levels in the I/R group were found to be significantly higher than in the control and S-I/R groups. CAT enzyme activity was found to be significantly higher in the I/R group than in the control group. \nConclusion:Our study revealed that the administration of silymarin at a dosage of 100 mg/kg-1 by intraperitoneal injection 30 minutes before ischemia in rats effectively decreased lipid peroxidation and oxidative stress. Additionally, it successfully reduced the injury caused by ischemia/reperfusion in muscle histology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6df65661e8446360d0ddb7b71015a80f3e0b0d5a2a5ca8e2dfd428a5efb14080","category":"Interdisciplinary"}