{"title":"GLUTAMYL-tRNA SYNTHETASE 1 deficiency confers thermosensitive male sterility in rice by affecting reactive oxygen species homeostasis","link":"https://academic.oup.com/plphys/article/196/2/1014/7709389?rss=1","date":1720396800000,"content":"<span><div>Abstract</div>Temperature is one of the key environmental factors influencing crop fertility and yield. Understanding how plants sense and respond to temperature changes is, therefore, crucial for improving agricultural production. In this study, we characterized a temperature-sensitive male sterile mutant in rice (<span>Oryza sativa</span>), <span>glutamyl-tRNA synthetase 1-2</span> (<span>ers1-2</span>), that shows reduced fertility at high temperatures and restored fertility at low temperatures. Mutation of <span>ERS1</span> resulted in severely delayed pollen development and meiotic progression at high temperatures, eventually leading to male sterility. Moreover, meiosis-specific events, including synapsis and crossover formation, were also delayed in <span>ers1-2</span> compared with the wild type. However, these defects were all mitigated by growing <span>ers1-2</span> at low temperatures. Transcriptome analysis and measurement of ascorbate, glutathione, and hydrogen peroxide (H<sub>2</sub>O<sub>2</sub>) contents revealed that the delayed meiotic progression and male sterility in <span>ers1-2</span> were strongly associated with changes in reactive oxygen species (ROS) homeostasis. At high temperatures, <span>ers1-2</span> exhibited decreased accumulation of ROS scavengers and overaccumulation of ROS. In contrast, at low temperatures, the antioxidant system of ROS was more active, and ROS contents were lower. These data suggest that ROS homeostasis in <span>ers1-2</span> is disrupted at high temperatures but restored at low temperatures. We speculate that ERS1 dysfunction leads to changes in ROS homeostasis under different conditions, resulting in delayed or rescued meiotic progression and thermosensitive male fertility. <span>ers1-2</span> may hold great potential as a thermosensitive material for crop heterosis breeding.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"6df8ec74b5a92ccfeca080b36621398a574669de09b46cb16372907022f794ce","category":"Environment"}