{"title":"PSIV-A-12 Ruminal in vitro digestibility of novel pennycress meal using the Daisy II incubator","link":"https://academic.oup.com/jas/article/102/Supplement_2/365/7664822?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Field pennycress seed has a high oil content, making it valuable for biofuel production. The high protein content of the resulting pennycress meal makes it a potentially valuable protein feedstuff for livestock. However, pennycress meal also contains greater content of fiber, erucic acid, and glucosinolates, which limit its use in livestock rations. Golden pennycress, a novel pennycress, was developed to contain greater oil content and decreased content of fiber, increasing the value of pennycress meal as a potential livestock feed. The objective of this research was to characterize a novel pennycress meal using an in vitro rumen fermentation system. Digestion of golden pennycress (GPC), black-seeded pennycress (BPC), and a total mixed ration (TMR, as the control), was evaluated in vitro using the Daisy II incubator. Each incubation vessel contained 12 filter bags (4 containing GPC, 4 containing BPC, and 4 containing the TMR). Rumen fluid was collected from two cannulated steers and processed according to Ankom procedures; samples were incubated in the rumen fluid inoculum for either 24 or 48 h. Neutral Detergent Fiber (NDF) of GPC averaged 23% (dry matter basis) and was less than the BCP NDF content (30%, dry matter basis). In vitro true dry matter disappearance (IVTDMD) and in vitro neutral detergent fiber digestibility (NDFD) were calculated and shown in Table 1. Proc Mixed procedures of SAS were used to identify difference in digestibility. Due to the novelty of golden pennycress, this study appears to be the first that compares ruminal digestibility of pennycress meals, thereby establishing initial data relative to the feeding value of GPC. As the novel pennycress was developed to have a reduced fiber level, the reduced NDF content of GPC over BPC was expected. The significant increase of IVTDMD of GPC compared with BPC at either incubation length suggests increased overall digestibility and improved dry matter utilization of the novel pennycress. Additional research investigating the reduced NDFD of GPC is warranted. As the first study evaluating the use of golden pennycress meal in ruminant diets, this study provides baseline values from which to build additional research projects.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6df855774e941a5d7dfb747dd5bcde7d0ca8441a73fd00fb8d77bda216bf1b1f","category":"Environment"}