{"title":"Tragacanth Gum and Linseed Gum as Adhesives Improved the Survival, Digestive Function, Antioxidant Enzyme Activities, and Immunity in Large Yellow Croaker (Larimichthys crocea) Larvae","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/7271887?af=R","date":1675411200000,"content":"<p>A 30-day feeding experiment was designed to investigate the effects of different adhesives on survival, growth performance, digestive enzyme activities, antioxidant capacity, and inflammation response of large yellow croaker (<i>Larimichthys crocea</i>) larvae (initial weight 8.40 ± 0.18 mg). Four iso-nitrogenous (55% crude protein) and iso-lipidic (22% crude lipid) microbound diets (MBD) were formulated to contain 2% sodium alginate (SA), 2% tragacanth gum (TG), 2% linseed gum (LG), and 2% poloxamer (PX), respectively. Results showed that larvae fed with TG and LG diets had significantly higher survival rate than the larvae fed with SA and PX (<i>P</i> &lt; 0.05). Larvae fed with the PX diet had lower final weight and specific growth rate than the other groups (<i>P</i> &lt; 0.05). Larvae fed with TG diet had significant higher activities of lipase in pancreatic segments and trypsin in intestinal segments than the larvae fed with the PX (<i>P</i> &lt; 0.05). Meanwhile, the lipase activities of larvae fed with LG was significantly higher in intestinal segments than those fed with SA and PX diets (<i>P</i> &lt; 0.05). Larvae fed with TG and LG diets had significantly higher activities of AKP in brush border membranes than larvae fed with SA and PX diets (<i>P</i> &lt; 0.05). Moreover, the mRNA expression of pcna and zo-1 increased, respectively, in larvae fed TG and LG diets compared with the other groups (<i>P</i> &lt; 0.05). Larvae fed with LG and TG diets had significantly higher activities of SOD and T-AOC than those fed with PX diet (<i>P</i> &lt; 0.05). The content of GSH increased significantly in larvae fed with SA, TG, and LG diets compared with PX treatment (<i>P</i> &lt; 0.05). The activities of iNOS significantly increased in larvae fed with TG and LG diets compared to other groups (<i>P</i> &lt; 0.05). Meanwhile, the mRNA expression of il-10 significantly increased in TG and LG groups (<i>P</i> &lt; 0.05). In conclusion, results of the study demonstrated that TG and LG can be used as feed binders for microdiets with positive effects on survival, activities of digestive enzymes, antioxidant capacity, and inflammatory response. However, PX inhibited the survival and growth, and further study is needed to determine the suitable usage and dosage.</p>","author":"Jiahui Liu, \nYuntao Wang, \nJianmin Zhang, \nChenxiang Zhang, \nChuanwei Yao, \nWenxuan Xu, \nXiang Xu, \nKangsen Mai, \nQinghui Ai, \nMohamed Abdelsalam","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"6df9c7b9b931195f53b577b898cc8ac3adaa0b0745c68e9c2e74553a79442506","category":"Environment"}