{"title":"Apple Extends Lead Over Samsung As Biggest Buyer of Semiconductor Chips in 2020","link":"https://www.macrumors.com/2021/02/17/apple-biggest-buyer-semiconductor-chips-2020/","date":1613560047000,"content":"Apple was easily the largest buyer of semiconductor chips in 2020, according to the latest data collected by <a href=\"https://www.gartner.com/en/newsroom/press-releases/2021-02-09-gartner-says-apple-and-samsung-extended-their-lead-as\">Gartner</a>. Apple spent &#36;53.6 billion and took 11.9% of the global market share, representing 24% growth year-on-year, while Samsung was the second biggest buyer, spending &#36;36.4 billion and taking 8.1% of the market, representing 20.4% growth year-on-year. \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/tsmc_semiconductor_chip_inspection_678x452.jpg\" alt=\"\" width=\"678\" height=\"449\" class=\"aligncenter size-full wp-image-756102\" />\r\n<br/>\r\nTogether, the two companies consumed over &#36;90 billion of the chips in 2020, a &#36;16.6 billion total increase compared to 2019, making up 20 percent of the worldwide market.\r\n<br/>\r\n<blockquote>Apple retained its position as the No. 1 global semiconductor customer in 2020, thanks mainly to the continued success of <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a>, special demand for Mac computers and iPads, and increasing NAND flash consumption. \"Increasing demand for mobile PCs and tablets due to working from home significantly drove the production of Macs and iPads through 2020,\" said Masatsune Yamaji, research director at Gartner. \"The company also began its transition to Apple silicon for its Mac product line in the second half of 2020.\"</blockquote>The top 10 companies in 2020 remained the same as in 2019, but increased their semiconductor spend by 10% in 2020, and accounted for 42% of the total market, up from 40.9% in 2019. Samsung benefited from a big reduction in spending by Huawei, which remained in third position, despite being down 23.5% from 2019. \r\n<br/>\r\n<blockquote>\"The U.S. government increased trade restrictions on Huawei in 2020, limiting its ability to purchase semiconductors, which, in turn, limited its smartphone supply and reduced its market share. However, the Chinese market remains important for semiconductor vendors, as other Chinese smartphone OEMs stepped in to fill the vacuum created by Huawei in the second half of 2020,\" said Yamaji.</blockquote>Among the top 10 companies, Xiaomi increased its spending the most (26%) in 2020, having been minimally impacted by the global health crisis thanks to its mainly online-driven sales model. Sanctions on Huawei also enabled Xiaomi to gain more market share in the smartphone market. <div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/gartner/\">Gartner</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/17/apple-biggest-buyer-semiconductor-chips-2020/\">Apple Extends Lead Over Samsung As Biggest Buyer of Semiconductor Chips in 2020</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-extends-lead-over-samsung-as-biggest-buyer-of-semiconductor-chips-in-2020.2285057/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C3WtlMPeLDg:khxm_GWPLIM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C3WtlMPeLDg:khxm_GWPLIM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/C3WtlMPeLDg\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6e045954455b68c5004157686ebe111696227123e0425c13dc20e2408d24d1d7","category":"Apple"}