{"title":"Calcium regulation of the Arabidopsis Na+/K+ transporter HKT1;1 improves seed germination under salt stress","link":"https://academic.oup.com/plphys/article/194/3/1834/7459810?rss=1","date":1701820800000,"content":"<span><div>Abstract</div>Calcium is known to improve seed-germination rates under salt stress. We investigated the involvement of calcium ions (Ca<sup>2+</sup>) in regulating <span>HIGH-AFFINITY K+ TRANSPORTER 1</span> (<span>HKT1; 1</span>), which encodes a Na<sup>+</sup>/K<sup>+</sup> transporter, and its post-translational regulator TYPE 2C PROTEIN PHOSPHATASE 49 (PP2C49), in germinating Arabidopsis (<span>Arabidopsis thaliana</span>) seedlings. Germination rates of <span>hkt1</span> mutant seeds under salt stress remained unchanged by CaCl<sub>2</sub> treatment in wild-type <span>Arabidopsis</span>, whereas <span>pp2c49</span> mutant seeds displayed improved salt-stress tolerance in the absence of CaCl<sub>2</sub> supplementation. Analysis of <span>HKT1;1</span> and <span>PP2C49</span> promoter activity revealed that CaCl<sub>2</sub> treatment results in radicle-focused expression of <span>HKT1;1</span> and reduction of the native radicle-exclusive expression of <span>PP2C49</span>. Ion-content analysis indicated that CaCl<sub>2</sub> treatment improves K<sup>+</sup> retention in germinating wild-type seedlings under salt stress, but not in <span>hkt1</span> seedlings. Transgenic seedlings designed to exclusively express <span>HKT1;1</span> in the radicle during germination displayed higher germination rates under salt stress than the wild type in the absence of CaCl<sub>2</sub> treatment. Transcriptome analysis of germinating seedlings treated with CaCl<sub>2</sub>, NaCl, or both revealed 118 upregulated and 94 downregulated genes as responsive to the combined treatment. Bioinformatics analysis of the upstream sequences of CaCl<sub>2</sub>–NaCl-treatment-responsive upregulated genes revealed the abscisic acid response element CACGTGTC, a potential CaM-binding transcription activator-binding motif, as most prominent. Our findings suggest a key role for Ca<sup>2+</sup> in mediating salt-stress responses during germination by regulating genes that function to maintain Na<sup>+</sup> and K<sup>+</sup> homeostasis, which is vital for seed germination under salt stress.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"6e0c284371325cb045e48db61f7f9733c7971abede9836602581d2df7e526bea","category":"Environment"}