{"title":"26 Trace minerals to improve bull fertility","link":"https://academic.oup.com/jas/article/102/Supplement_3/82/7757209?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Bull fertility is paramount for reproductive success in cow-calf production systems and there are a variety of factors that influence bull fertility. Trace mineral requirements and recommendations have been established for growing and finishing steers, as well as lactating and pregnant cows, yet no specific requirements have been established for young or mature beef bulls. Nonetheless, trace minerals have been shown to have an important role in sexual maturation and semen quality of ruminants. Research performed in rams indicates that zinc deficiency results in reduced testicular development, decreased testicular concentrations of testosterone, and impaired development of seminiferous tubules. Deficiency of Zn has also been reported to negatively impact male fertility in humans, where men diagnosed with infertility responded positively to Zn supplementation. In growing bulls, diets with greater concentrations of organic forms of Zn, Cu, and Mn, tended to result in earlier attainment of puberty compared with control diets containing inorganic minerals. Furthermore, greater liver concentrations of Zn have been negatively correlated with sperm acrosomal damage in growing bulls, based on flow cytometry analyses. More recent research indicates that the use of hydroxichloride-based trace minerals results in greater liver concentrations of Zn and Cu compared with sulfate sources. While evidence indicates that trace mineral status has an important role in bull fertility, further research is required to better understand the contributions of trace minerals to semen quality. In addition, investigating the impact of trace mineral sources with greater bioavailability on semen quality may result in the development of practical recommendations that optimize bull fertility.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6e0f7b502ace487c36857c95849b2f85b85a4985eec2dddddb7b4d12a44817e7","category":"Environment"}