{"title":"Remember That Alternative Apple TV Remote? It's Now Available Through Deutsche Telekom","link":"https://www.macrumors.com/2021/08/18/deutsche-telekom-alternative-apple-tv-remote/","date":1629328872000,"content":"Back in November, Universal Electronics <a href=\"https://www.macrumors.com/2020/11/22/uei-alternative-apple-tv-4k-remote/\">announced the launch</a> of a third-party <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> Remote that was meant to be provided to cable, satellite, and MVPD customers. At the time, there was no word on which cable companies might offer the remote, but now it appears that it's available through T-Mobile parent company Deutsche Telekom.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/dt-apple-tv-remote.jpg\" />\r\n<br />\r\nAccording to <a href=\"https://www.businesswire.com/news/home/20210818005801/en\">Universal Electronics</a>, Deutsche Telekom will be providing the remote to German customers who subscribe to its MagentaTV service, which <a href=\"https://www.telekom.com/en/company/details/deutsche-telekom-to-offer-apple-tv-4k-from-july-20-2021-631626\">comes with an Apple TV 4K</a>. Deutsche Telekom allows customers to get the ‌Apple TV‌ 4K as either a rental or purchase device to access the MagentaTV service.\r\n<br />\r\n\r\n<br />\r\nDeutsche Telekom's website for MagentaTV says that the remote control was \"developed for MagentaTV\" and has been certified by Apple. The Bluetooth-enabled remote can be used to get directly to MagentaTV's content, and it offers similar functionality as Apple's own <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> Remote.\r\n<br />\r\n\r\n<br />\r\nThe MagentaTV button goes to the electronic content guide for the service, and there are dedicated channel up/down buttons for browsing. A ‌Siri‌ button activates ‌Siri‌ on the ‌Apple TV‌, and there are also buttons for controlling content playback.\r\n<br />\r\n\r\n<br />\r\nUniversal Electronics says that its remote features an ergonomic form factor with hard-capped keys for enhanced tactile feedback, along with an accelerometer and ambient light sensor to power backlit keys in low light environments. It includes Apple's Made for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> authentication chip to ensure secure connectivity to the ‌Apple TV‌.\r\n<br />\r\n\r\n<br />\r\nThere is no way to purchase the Universal Electronics remote on a standalone basis, and for now, it is limited to Deutsche Telekom customers who subscribe to MagentaTV and opt to rent or purchase an ‌Apple TV‌. Universal Electronics could offer it to other cable providers in the future, though.\r\n<br />\r\n\r\n<br />\r\nThis is not the first time that an alternative ‌Apple TV‌ remote has been made available for cable customers. Swiss telco Salt <a href=\"https://www.macrumors.com/2019/12/09/salt-tv-alternative-apple-tv-4k-remote-control/\">in 2019 launched</a> a third-party remote control option for the ‌Apple TV‌, for example.\r\n<br />\r\n\r\n<br />\r\nApple in April 2021 <a href=\"https://www.macrumors.com/roundup/apple-tv/\">refreshed the Apple TV 4K</a> and introduced a revamped version of the ‌Siri‌ Remote that's larger and thicker, with an aluminum body. The new version of the remote does away with the touch surface that was at the top of the prior remote and instead adopts a touch-enabled clickpad that has gesture support.<br />This article, \"<a href=\"https://www.macrumors.com/2021/08/18/deutsche-telekom-alternative-apple-tv-remote/\">Remember That Alternative Apple TV Remote? It's Now Available Through Deutsche Telekom</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/remember-that-alternative-apple-tv-remote-its-now-available-through-deutsche-telekom.2307975/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9O1IjQtknPA:ilsfUQJvvZ8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=9O1IjQtknPA:ilsfUQJvvZ8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/9O1IjQtknPA\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6e160d04a32d077442489a6a06352421678c7e7b6189b8f3a66f7cf922024dd0","category":"Apple"}