{"title":"Apple releases major updates to Logic Pro for Mac and iPad","link":"https://www.macworld.com/article/2127951/logic-pro-garageband-mainstage-mac-ipad-updates.html","date":1699291548000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple on Monday released major updates of Logic Pro for Mac and iPad. The updates to Apple’s music authoring software bring the Mac version to 10.8, and the iPad version to 1.1.</p>\n\n\n\n<p>Apple also updated MainStage, its Mac app that acts as a live rig with Logic Pro. GarageBand, Apple’s audio editing app for consumers, was also updated. Both received bug fixes. Here’s what’s new with the Logic apps:</p>\n\n\n\n<div><div>\n<p>The release notes for Logic Pro for Mac 10.8 detail the new features:</p>\n\n\n\n<ul>\n<li>Deliver a release-ready mix with Mastering Assistant and its professional palette of intuitive sound-shaping tools</li>\n\n\n\n<li>Transform any audio sample into a malleable sound that you can perform using Sample Alchemy</li>\n\n\n\n<li>Radically reshape and reshuffle audio with Beat Breaker, a sophisticated time and pitch morphing plug-in</li>\n\n\n\n<li>New Slip and Rotate tools allow for the contents inside a region to be moved independent of its position on the timeline</li>\n\n\n\n<li>Ability to record in 32-bit float now available when using supported audio devices</li>\n\n\n\n<li>Free “Hybrid Textures” Sample Alchemy pack includes a collection of 70 patches and over 80 loops built from found sounds flipped into creative playable instruments</li>\n</ul>\n</div></div>\n\n\n\n<div><div>\n<p>Here are the release notes for Logic Pro for iPad 1.1:</p>\n\n\n\n<ul>\n<li>Deliver a release-ready mix with Mastering Assistant and its professional palette of intuitive sound-shaping tools</li>\n\n\n\n<li>Record live into Quick Sampler to create instruments and drum kits using the built-in microphone or any connected audio device</li>\n\n\n\n<li>Interact seamlessly between apps like Voice Memos with added support for Split View and Stage Manager</li>\n\n\n\n<li>Select and drag multiple files at once from the Files app to quickly build drum kits or add stems to a project</li>\n\n\n\n<li>Instantly audition samples, loops or instruments in the Browser by sliding your finger up or down</li>\n\n\n\n<li>Free “Hybrid Textures” Sample Alchemy pack includes a collection of 70 patches and over 80 loops built from found sounds flipped into creative playable instruments</li>\n</ul>\n\n\n\n<p>To update these apps, check the App Store app on your device. Then go to the Updates tab and select the “Update” button next to the app. </p>\n</div></div>\n\nProfessional Software</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6e16a9eb0386f49948e4459906a7a556bf42c1d52a0efaf9bf99789d77571e65","category":"Apple"}