{"title":"Effect of transglutaminase crosslinking combined with lactic fermentation on the potential allergenicity and conformational structure of soy protein","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13628?af=R","date":1717138462000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Food allergies are a growing concern worldwide, with soy proteins being important allergens that are widely used in various food products. This study investigated the potential of transglutaminase (TGase) and lactic acid bacteria (LAB) treatments to modify the allergenicity and structural properties of soy protein isolate (SPI), aiming to develop safer soy-based food products.</p>\n<h2>RESULTS</h2>\n<p>Treatment with TGase, LAB or their combination significantly reduced the antibody reactivity of β-conglycinin and the immunoglobulin E (IgE) binding capacity of soy protein, indicating a decrease in allergenicity. TGase treatment led to the formation of high-molecular-weight aggregates, suggesting protein crosslinking, while LAB treatment resulted in partial protein hydrolysis. These structural changes were confirmed by Fourier transform infrared spectroscopy, which showed a decrease in β-sheet content and an increase in random coil and β-turn contents. In addition, changes in intrinsic fluorescence and ultraviolet spectroscopy were also observed. The alterations in protein interaction and the reduction in free sulfhydryl groups highlighted the extensive structural modifications induced by these treatments.</p>\n<h2>CONCLUSION</h2>\n<p>The synergistic application of TGase and LAB treatments effectively reduced the allergenicity of SPI through significant structural modifications. This approach not only diminished antibody reactivity of β-conglycinin and IgE binding capacity of soy protein but also altered the protein's primary, secondary and tertiary structures, suggesting a comprehensive alteration of SPI's allergenic potential. These findings provide a promising strategy for mitigating food allergy concerns and lay the foundation for future research on food-processing techniques aimed at allergen reduction. © 2024 Society of Chemical Industry.</p>","author":"Guangliang Xing, \nSiran Yang, \nLu Huang, \nSitong Liu, \nXinyi Wan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6e1dd830bea3029c5d7851497479e2cf4122e997c9a96427bdf34bce6e0759a4","category":"Environment"}