{"title":"KBTG เปิดแผนก Software Development Excellence สร้างทีม DevX เสริมทัพนักพัฒนา","link":"https://www.blognone.com/node/121379","date":1614220200000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>ธนาคารกสิกรไทย ไม่ได้เติบโตอยู่ที่ประเทศไทยอีกต่อไปแล้ว แต่ตั้งเป้าใหญ่ขยายไปยังประเทศอื่นๆ ซึ่งที่ผ่านมาทางธนาคารเริ่มขยายธุรกิจเข้าไปในประเทศจีน สปป.ลาว เมียนมา อินโดนีเซีย กัมพูชา และเวียดนาม ในรูปแบบธนาคารท้องถิ่น ธนาคารร่วมลงทุน และสาขาของธนาคาร</p>\n<p>KBTG บริษัทเทคโนโลยีภายใต้ธนาคารกสิกรไทยจึงต้องคิดสูตรใหม่ เฟ้นหาระบบที่ช่วยให้นักพัฒนาทำงานได้เต็มประสิทธิภาพ จึงเป็นที่มาของการเปิดตัวแผนก Software Development Excellence มาพัฒนา Automate Tools เพื่อให้การพัฒนาซอฟต์แวร์มีประสิทธิภาพสูงสุด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e2b86ae5431729e247ce225b531e4b9d.jpeg\" ></p>\n<h3>โครงสร้างแผนก Software Development Excellence</h3>\n<p>Software Development Excellence มาพร้อม 4 ทีมย่อย Agile, DevOps, Software Development Methodology และ DevX  แต่ละทีมจะนำ use case ที่ดีที่สุดของแต่ละ guild ใน KBTG มาสร้างโซลูชั่นตรงกลางสำหรับนักพัฒนาซอฟต์แวร์ทั้งหมด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/bf325e3145b828e8ecc8d17c2b893a01.png\" ></p>\n<p>คุณจิรัฎฐ์ ศรีสวัสดิ์ Assistant Managing Director แผนก Software Development Excellence ของ KBTG บอกว่า ตัวแผนกตั้งขึ้นมาตั้งแต่เดือนกุมภาพันธ์ที่ผ่านมา โดยระยะแรกได้เปิดตัวทีม DevX ขึ้นมาก่อน เป้าหมายของทีมคือ สร้างแพลตฟอร์มที่จะเพิ่มประสิทธิภาพการทำงาน ลดความซับซ้อน ผลิตซอฟต์แวร์หรือนำเครื่องมือใหม่ๆ มาปิดช่องว่างการทำงานได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dda011ffbf0367a352b10c8a300e5f2c.jpeg\" ></p>\n<p>ทีม DevX จะช่วยเพิ่มความสามารถในการติดตามและตรวจสอบประสิทธิภาพของแอปพลิเคชันตั้งแต่ต้นจนจบหรือ Application Observability ทั้ง Logging, Metrics, และ Tracing โดยประสานงานกับทีม Infrastructure ในการวางมาตรฐานและพัฒนา Common Library เพื่อส่งต่อให้กับทีมแอปพลิเคชัน สร้าง Developer Utility Platform ให้การทำงานเป็น Automation ให้มากที่สุด รวมแอปพลิเคชันทั้งบริษัทให้มาอยู่ในที่เดียวกันเพื่อความสะดวกในการจัดการ สามารถดู blueprint ด้านล่างเพื่อให้เห็นภาพเพิ่มเติมได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/700bc924041f5c0ab485b85eee7e4e73.png\" ></p>\n<p><strong>แนวคิดของทีม DevX คล้ายกับการทำสตาร์ทอัพ กล่าวคือ สตาร์ทอัพสร้างบริการจาก pain point ของลูกค้า แต่ทีม  DevX ต้องสร้างโซลูชั่นจาก pain point ของนักพัฒนาซอฟต์แวร์ด้วยกันเอง</strong></p>\n<p>คุณจิรัฎฐ์บอกว่า สิ่งเหล่านี้ไม่ใช่เรื่องใหม่ เพราะบริษัทในซิลิคอนวัลเล่ย์อย่าง Google, Facebook, Uber ต่างก็ใช้วิธีนี้ นั่นจึงเป็นเหตุผลที่ยริษัทเหล่านั้นโตเร็ว และออกฟีเจอร์ใหม่ทันความต้องการของตลาด</p>\n<p>อย่างไรก็ตาม การเริ่มต้นอะไรใหม่นั้นไม่ใช่เรื่องง่ายและมีความท้าทายหลายอย่างรออยู่ เช่น ทำอย่างไรให้คนเป็นร้อยคนสามารถทำงานที่ไม่ซ้ำกัน ทำอย่างไรจึงจะได้คนที่มีทักษะ soft skill สื่อสารเก่ง และที่สำคัญคือมีความเข้าใจปัญหาของนักพัฒนาด้วยกันอย่างถ่องแท้</p>\n<h3>สรุป</h3>\n<p>การเปิดตัวทีมใหม่ของ KBTG ครั้งนี้ สร้างความแตกต่าง และเป็นการตอกย้ำภาพลักษณ์ Tech Company ลำดับต้นๆ ของไทย เพราะลำพังการมีนักพัฒนาซอฟต์แวร์และวิศวกรเก่งๆ นั้นไม่พอ ต้องมีกระบวนการและระบบที่ทำให้การสร้างงานนั้นทำได้ลื่นไหลและรวดเร็ว ซึ่ง KBTG มองเห็นจุดนี้</p>\n<p>จนถึงตอนนี้ แผนก Software Development Excellence มีคนทำงานราว 40-50 โดย KBTG ตั้งเป้าที่จะมีพนักงานในแผนกนี้ประจำทั้งในไทย จีน และเวียดนาม ทางบริษัทเปิดรับสมัครคนที่สนใจอยากร่วมงานด้วยเช่นกัน สามารถส่งใบสมัครมาที่ recruitment@kbtg.tech</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/kbtg\">KBTG</a></div><div class=\"field-item odd\"><a href=\"/topics/kasikorn-bank\">Kasikorn Bank</a></div><div class=\"field-item even\"><a href=\"/topics/developer\">Developer</a></div><div class=\"field-item odd\"><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"advertorial","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6e20f3abc5c7328d9194428cd70c620db22bf1382c5ae7e190e1324a9de1a830","category":"Thai"}