{"title":"Selle Italia goes green with the Model X Green Superflow saddle","link":"https://www.cyclist.co.uk/sponsored/9514/selle-italia-goes-green-with-the-model-x-green-superflow-saddle","date":1619081297000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>28 Apr 2021</span></div>    </div></div><p>\nThe new Model X Green Superflow sees the historic Italian marque establish its eco credentials</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/selle_italia_model_x_green_superflow_02.jpg?itok=XylGGHbM\" />  </div>\n<div>\n      <p> Selle Italia has a long and storied history with cycling. Founded in 1897 in the village of Corsico near Milan, it began life providing high-quality saddles so everyday cyclists could travel in comfort. Then, under the ownership of the Bigolin family in the late ’60s, Selle Italia started to undergo a shift in direction.</p>\n<p>Building on its decades of experience, the company started to create products for performance cycling and embrace new materials and construction techniques. Innovation became integral to Selle Italia, with research and development teams introducing anatomical concepts to help competitive cyclists through the most challenging and punishing of rides.</p>\n<p>This attention to detail helped grow Selle Italia’s reputation with both professional and amateur riders, pushing it to the forefront of saddle design and establishing the company as one of cycling’s biggest names.</p>\n<p>Selle Italia forged a strong working relationship with five-time Tour de France winner Bernard Hinault in the 1980s, leading to the creation of the lightweight, nylon Turbo design and the Flite in 1990. The latter became an iconic saddle that has stood the test of time – a precursor to ultra-lightweight saddles (it weighed less than 200 grams), its slimmer profile reduced friction surface.</p>\n<p>More recently, that signature saddle evolved into the Flite Boost, a lightweight snub-nose design that eases pressure when riders are in a performance-orientated cycling position.</p>\n<h3>A greener future</h3>\n<p>Selle Italia has taken a further step forward in 2021 with the launch of the Model X Green Superflow, the first saddle to emerge from its new eco-sustainable Green-Tech production process.</p>\n<p>Thanks to decades of research and development in the cycling arena, Selle Italia has always leveraged innovation to power growth. That’s something that rings true for Green-Tech, introduced in summer 2020 with the aim to produce competitively priced saddles that are made in a sustainable way.</p>\n<p>The Model X Green Superflow is the first saddle off the Green-Tech production line, assembled with an efficient, automated manufacturing process that mechanically connects each of the separate elements together. As well as this streamlined process, its eco credentials are further boosted by the fact that it’s free from any environmentally damaging glue or polyurethane adhesive.</p>\n<p>The Model X is also produced entirely in Italy, helping to cut the saddle’s CO2 emissions transportation footprint and ensure Selle Italia isn’t relying on a cycling supply chain that’s experienced a turbulent 12 months thanks to Covid-19 disruption.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/04/selle_italia_model_x_green_superflow_01.jpg?itok=ZLMPh4XD\" />  </div>\n</div>\n<h3>Anatomy of the saddle</h3>\n<p>The Model X is created using Selle Italia’s Flex Control technology, which comprises two separate elements with differing flexibility inside the shell. When combined they ensure greater stability and enhanced comfort for the rider. A further element, the Fec Alloy rails, offer a highly resistant and flexible iron-carbon steel alloy to support the shell on top.</p>\n<p>For added comfort, the Model X has a Total Gel (with integrated antibacterial treatment) molded cover over the surface of the shell to serve as the saddle’s padding for better shock absorption in differing conditions. The curved form also makes it ideal for static cyclists or those with a posterior pelvic tilt.</p>\n<p>At 315 grams the Model X is on the slightly heavier side for a performance saddle, but the really big advantage comes in its competitive price point. At £49.90 its affordability makes it an appealing choice for those looking for a comfortable performance saddle that won’t break the bank.</p>\n<p>With all this in mind, the Model X green Superflow makes for an exciting and innovative saddle that’s ideal for riders who are environmentally conscious. After more than 120 years of cycling saddle innovation, the historic Italian marque now has its eye on a greener future.</p>\n<p><em><strong>Discover more about the new Model X Green Superflow saddle at <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5677966246&amp;iu=/359/impcount.co.uk\" target=\"_blank\">selleitalia.com</a></strong></em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/saddles\">Saddles</a></div>    </div></div>","author":"SimonR","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"6e21208db88fd5bd54a70d6bfc07dd537fa8992e8776a941178a5c815bc36b28","category":"Cycling"}