{"title":"Latinx youth’s and parents’ covid-19 beliefs, vaccine hesitancy and vaccination rates: Longitudinal associations in a community sample","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307479","date":1721829600000,"content":"<p>by Namoonga M. Mantina, Maiya G. Block Ngaybe, Katharine H. Zeiders, Kayla M. Osman, Ada M. Wilkinson-Lee, Antoinette M. Landor, Lindsay T. Hoyt</p>\r\nIntroduction <p>The Latinx population has the second highest COVID-19 death rate among racial/ethnic groups in the United States and less than half of Latinx youth aged 5–17 years old completed their COVID-19 primary vaccination series as of September 2022. COVID-19 vaccine misinformation detrimentally impacts vaccination rates. In this study, we examined factors that predicted Latinx youth COVID-19 vaccine hesitancy and vaccination status.</p> Methods <p>A community-based sample of 290 Latinx parent and adolescent dyads from a Southwestern metropolitan area of the United States who were recruited to complete an online survey at baseline at T1 (August 2020 –March 2021) and one year later. We tested a longitudinal mediation model in which we examined individual and family factors that would predict youth COVID-19 vaccine hesitancy and vaccination status over time.</p> Results <p>Youth’s pandemic disbelief (i.e., the belief that the COVID-19 pandemic is a conspiracy or not real) predicted greater youth’s COVID-19 vaccine hesitancy, and in turn, a lower likelihood of youth’s COVID-19 vaccination. Youth’s pandemic disbelief also predicted greater parent’s vaccination hesitancy which, in turn, predicted greater youth’s vaccination hesitancy and a lower likelihood of COVID-19 vaccination. Parents’ pandemic disbelief predicted their own COVID-19 hesitancy, but not youth hesitancy.</p> Discussion <p>Our study findings provide initial evidence that general pandemic disbelief was a significant driver of vaccine hesitancy and vaccination among Latinx families. The study contributes to the limited research investigating COVID-19 vaccination in the Latinx community and among Latinx youth, further aiding how COVID-19 vaccine disparities can be mitigated among racial/ethnic populations.</p>","author":"Namoonga M. Mantina","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6e24ffcd9410fad52c79db60c0d339f18126e20911822640fb1bf9ac76eae943","category":"Interdisciplinary"}