{"title":"A year after New Shepard’s accident, Blue Origin may return to flight next month","link":"https://arstechnica.com/?p=1967258","date":1694523330000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/12/launchBO-800x533.jpg\" alt=\"On January 23, 2016, Blue Origin launched its New Shepard rocket again, after its previous flight in late 2015. This marked the first time a booster had flown into space, landed vertically, and re-flown again.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/12/launchBO.jpg\">Enlarge</a> <span>/</span> On January 23, 2016, Blue Origin launched its New Shepard rocket again, after its previous flight in late 2015. This marked the first time a booster had flown into space, landed vertically, and re-flown again. (credit: Blue Origin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One year ago today, a Blue Origin-built rocket carrying a spacecraft exploded above the West Texas desert in dramatic fashion. There were no passengers aboard the New Shepard capsule, which was able to push powerfully away from the rocket with its escape system and land safely under a parachute in the desert.</p>\n<p>The failure of the New Shepard-23 mission happened at 1 minute and 4 seconds into the flight. The vehicle had already passed through max Q, the point at which the launch system faces maximum dynamic pressure during ascent, and its BE-3 rocket engine was throttling back up to continue climbing on its suborbital trajectory.</p>\n<p>Half a year after this failure, Blue Origin <a href=\"https://arstechnica.com/science/2023/03/blue-origin-provides-a-detailed-analysis-of-its-launch-failure/\">provided an update</a> on the accident investigation it had conducted with assistance from the Federal Aviation Administration and the National Transportation Safety Board. According to this update, the mishap team noted \"hot streaks\" on the rocket engine's nozzle and determined that it was operating at higher temperatures than it was designed for.</p></div><p><a href=\"https://arstechnica.com/?p=1967258#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1967258&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6e2bc5b9ff03c167b8ed7e5b02c868309649b79b5748723b8455a745808bab5a","category":"Tech"}