{"title":"Laying foundations for transformation: Insights from local government engagement on climate-resilient rural water services in Nepal","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000081","date":1710252000000,"content":"<p>by Jeremy Kohlitz, Melita Grant, Ratan Bahadur Budhathoki, Shova Chhetri, Heman Paneru, Min Prasad Basnet, Sunetra Lala, Gabrielle Halcrow, Naomi Carrard</p>\r\n\r\nTransformative change in how local governments support rural water services is required to accommodate the increasingly extreme effects of climate change on water service systems. This study explores the potential for contextualised soft systems thinking activities to prepare local government officials with responsibilities pertaining to rural water services in Nepal to shift towards more transformative thinking. First, the study presents the findings of focus group discussions in two rural districts of Nepal that identified common climate-related problems for rural water access including water shortages, contamination, and unequal burden of impacts. Second, we facilitated workshops with local government and non-government stakeholders, drawing on the focus group findings to frame the challenges for rural water linked to climate change that require local government response. We designed the workshops drawing on ‘transformative spaces’ concepts and included soft systems thinking activities to foster systemic perspectives. Participants learned about worldviews, leverage points, rich pictures, root cause analysis, and theory-of-change based action planning. Following the workshops, the study team participated in reflective sensemaking in which they deliberated on their experiences and notes from facilitating the workshops to assess the extent to which the participants demonstrated transformative thinking about rural water systems. The workshop approach showed promise in shifting how local government participants think about rural water services beyond technical fixes towards addressing deep-seated issues. However, further work is required to foster new relationships necessary to support transformation and grapple with ethical dilemmas pertaining to power dynamics at community and government levels. Nevertheless, the approach presented here is a replicable, low-cost way to prepare local government stakeholders in Nepal for transforming their thinking and systems to ways that enable sustainable rural water service delivery under threats of climate change.","author":"Jeremy Kohlitz","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"6e2fedb913183ce83ec4fb96f565caaa5cf8867eee4ca586e033255501c9c8fb","category":"Environment"}