{"title":"Changes in decomposition dynamics, soil community function and the growth of native seedlings under the leaf litter of two invasive plants","link":"http://link.springer.com/10.1007/s10530-024-03405-3","date":1730419200000,"content":"<h3>Abstract</h3>\n                    <p>Invasive alien plants (IAPs) represent a major challenge to biodiversity and ecosystem functioning, especially those transformer species. Litter chemistry and decomposition rates are relevant factors to understand the invasion process due to its influence on nutrient cycling and ecosystem dynamics. Here, we present the results of a litterbag mesocosm comparing the decomposition dynamics of litter produced by two common IAPs (<em>Acacia dealbata</em> and <em>Carports edulis)</em> with similar amounts of native litter from invaded ecosystems (shrubland and coastal dunes invaded by <em>A. dealbata</em> and <em>C. edulis</em>, respectively), and how this different leaf litter origin further affects soil community function and the growth of seedlings of different native species. After 12 months of incubation, plant litter decayed at a rate of between 54 and 36% (<em>C. edulis</em> litter &gt; dune litter and Shrub litter &gt; <em>A. dealbata</em> litter) with slight changes in nutrient composition (C, N, C:N, and P content) at the end of the assay. Whereas the effect of the litterbag content (native vs. non-native plant litter) was rather limited, the incubation time significantly affected physico-chemical parameters. Thus, extracellular enzymatic activities (EAs, including acid and basic phosphatase, β-glucosidase, urease) varied depending on the litterbag content (native and non-native) for both decomposing species (<em>A. dealbata</em> or <em>C. edulis</em>). The correspondence analysis (CA) based on the community level physiological profile (CLPPs) showed a similar trend of data clustering regardless of the IAP considered. In both cases, different decomposition times were more relevant than litter origin to discriminate the soil functional activity. Finally, seedlings of different native species were grown in soils previously used for the litter incubation experiment. Here, seedlings of native species growing in soils from the mesocosm (previously covered with native or invasive litter) showed a species-dependent response. At the end of the assay, slight differences were found between the invasive and native plant litter. The results of the decomposition rates between litter of different origin, the effect of litter origin on soil nutrient content, on extracellular EAs, on the functional profile of soil communities, and also on the performance of native seedlings can be considered as limited. These results suggest that litter chemistry might not be as relevant as previously suggested—at least not relevant to explain ecosystem-level alterations—while highlighting the importance of assessing invasion thresholds rather than litter chemical composition.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"6e3e9717c7d3025aa4be50140ca73a4d045e9724bc30f23e88ac5e44c0d5fd83","category":"Environment"}