{"title":"Samsung's 'Try Galaxy' Feature Uses Two iPhones to Demo Z Fold5 Experience","link":"https://www.macrumors.com/2023/08/21/samsung-try-galaxy-iphone-demo/","date":1692649239000,"content":"Samsung today announced the launch of an updated \"Try Galaxy\" website that's designed to allow <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users to experience what it's like having a foldable smartphone.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/samsung-try-galaxy-1.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nTry Galaxy uses two iPhones to \"showcase the benefits\" of the Galaxy Z Fold5's large display. For those unfamiliar with the device, <a href=\"https://www.macrumors.com/2023/07/26/samsung-new-galaxy-z-foldable-smartphones/\">the latest Samsung Galaxy Fold</a> has a 6.2-inch Cover Screen that opens out like a book into a 7.6-inch display.\r<br />\n\r<br />\nSamsung has long had a web app that demonstrates the customized Android UI that it has developed complete with Samsung apps, but the Galaxy Fold option is new. To use it, two iPhones are required, both with the Try Galaxy app added to the <a href=\"https://www.macrumors.com/guide/home-screen/\">Home Screen</a>. The app can be installed through <a href=\"https://trygalaxy.com\">the Try Galaxy website</a>, which has a scannable QR code.\r<br />\n\r<br />\nThe web app needs to be launched on both iPhones, and one generates a code while the other accepts the code in order to initiate a sync between the two devices. From there, a \"single\" screen is split between two iPhones to simulate the Galaxy Fold's larger display.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/samsung-try-galaxy-2.jpg\" alt width=\"2000\" height=\"1125\" />\r<br />\nThere are a limited number of experiences that customers can choose, and there's only a surface level look at the Galaxy Fold options. Users can play an Air Hockey game, go through a walkthrough on multitasking, or see a video split across two screens. Almost everything available in the multi-screen view is a video walkthrough that is controlled by Samsung, so it's more of a gimmick than anything else.\r<br />\n\r<br />\nSamsung often uses anti-Apple marketing, and likes to point out that Apple has no foldable ‌iPhone‌. A <a href=\"https://www.macrumors.com/2022/11/03/samsung-anti-apple-foldable-iphone-ad/\">recent \"On the Fence\" campaign</a>, for example, saw Samsung featuring ‌iPhone‌ users jealous of the foldable technology. Samsung has <a href=\"https://www.macrumors.com/2022/09/09/samsung-anti-apple-tweets-iphone-14/\">also done</a> a first-to-foldables campaign mocking the ‌iPhone‌'s lack of innovation, and encouraged ‌iPhone‌ customers to \"Join the Flip side.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/galaxy-z-fold5-open.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nEarlier this summer, Samsung launched its fifth-generation line of foldable devices. Rumors have suggested that Apple is experimenting with foldable smartphone technology, but there is no word yet on if or when the Cupertino company will come out with a foldable ‌iPhone‌.<div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/21/samsung-try-galaxy-iphone-demo/\">Samsung's 'Try Galaxy' Feature Uses Two iPhones to Demo Z Fold5 Experience</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsungs-try-galaxy-feature-uses-two-iphones-to-demo-z-fold5-experience.2399245/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6e42bf03f4d1e6171b1f25fd41b60c4649d670db3de980b7d98a1057f2c28afd","category":"Apple"}