{"title":"Ground Urban Heat Island: Strengthening the Connection Between Spaceborne Thermal Observations and Urban Heat Risk Management","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024GH001114?af=R","date":1721805556000,"content":"<h2>Abstract</h2>\n<p>As urbanization progresses under a changing climate, urban populations face increasing threats from chronically higher heat exposures and more frequent extreme heat events. Understanding the complex urban thermal exposure patterns becomes crucial for effective heat risk management. The spatial advantage of satellite thermal observations positions surface urban heat islands (SUHI) as a primary measure for such applications at the city scale. However, satellite-inherent biases pose considerable uncertainties. To improve the representation of human-relevant heat exposure, this study proposes a simple but effective satellite-based measure– ground urban heat island (GUHI), focusing solely on radiant temperatures from urban ground elements. Leveraging ECOSTRESS land surface temperature product and radiation-based statistical downscaling, diurnally representative GUHIs were evaluated over NYC. The findings reveal that overall GUHI is consistently warmer than SUHI diurnally. However, GUHI exhibits complex spatial contrasts with SUHI, primarily influenced by vegetation coverage. Various indicators associated with urban structures and materials were examined, showing important but dissimilar roles in shaping the spatial dynamics of GUHI and SUHI. This study highlights the value of satellite thermal observations compared to air temperature while addressing uncertainties in widely adopted practices of using them. By improving the depiction of human-related urban heat patterns from Earth observations, this research offers valuable insight and more reliable measures to address the urgent requirements for urban heat risk management globally.</p>","author":"Leiqiu Hu, \nChristopher Uejio","siteTitle":"Wiley: GeoHealth: Table of Contents","siteHash":"018a2f8ee482f9683e9bc368088d60586256b9cdf0b21bf2031822bf8cde1d3a","entryHash":"6e5065c8142d038a2fe52d7fd073f6b807adca1f5e31b01e4bdabbc63e31f603","category":"Environment"}