{"title":"The impact of Ethiopian Green Legacy Initiative (GLI) on landscape functionality and plant species diversity in Lake Hawassa watershed, Ethiopia","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2676?af=R","date":1716878319000,"content":"<h2>Abstract</h2>\n<p>As one of the responses to the global commitments against climate change, the Ethiopian Government launched a nationwide Green Legacy Initiative (GLI) in 2019, which largely focused on forest tree plantations with some inclusion of fruit trees. Despite its tremendous efforts and investments, its effectiveness and impacts have not been studied. This paper attempted to address this necessity by conducting a cross-sectional quasi-experiment in three randomly selected woredas/districts of Lake Hawassa Watershed from August 20 to September 2, 2023. The research hypothesized the likely impacts of GLI on four dependent variables (hydrological regulation, soil stability, nutrient cycling and plant species diversity). To achieve this, the research considered the two variants of GLI practices (plantation with and without soil and water conservation measures) and the corresponding control sites. Having three sites and three treatments with five replications, the study involved a total of forty-five quadrats of the same size (20 m × 20 m). The first three parameters were analysed using the landscape functionality analysis method, while the fourth employed Shannon's diversity index. Results of ANOVA showed that, on average 87% of randomly selected quadrats were found to significantly improve the local hydrology (runoff potential) (≈ 83.3% with Av. <i>p</i> = 0.012), soil stability (≈100% with Av. <i>p</i> = 0.002), nutrient cycling (≈83.3% with Av. <i>p</i> = 0.017) and plant species diversity (≈83.3% with Av. <i>p</i> = 0.012). The research revealed positive results from the Ethiopian Green Legacy Initiative. The small number of samples is acknowledged as a limitation of the research.</p>","author":"Bezawit A. Demisse, \nSaa Dittoh, \nEliasu Salifu, \nMichael M. Moges, \nMulugeta Dadi Belete","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"6e52f4b9274226e598d9b553838373c91786b714af63082a09c4dc1b2a774645","category":"Environment"}