{"title":"Amazon’s Project Kuiper satellites add to astronomers’ light-pollution woes","link":"https://arstechnica.com/?p=1974159","date":1696760900000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/satellites-800x527.jpg\" alt=\"satellite streaks\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/satellites.jpg\">Enlarge</a> (credit: Alan Dyer/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Amazon is set to launch two satellite prototypes for its Project Kuiper network, which will eventually number more than 3,200 orbiters. Project Kuiper could become a rival to SpaceX’s <a href=\"https://www.wired.com/story/as-spacexs-starlink-ramps-up-so-could-light-pollution/\">Starlink constellation</a>, which is now nearly 4,800 strong. Amazon’s launch is planned for 2 pm Eastern time today, with a backup launch window tomorrow. This rapid growth of the satellite industry has come at a cost for astronomers and fans of the night sky, as two new studies and panels at an international astronomy conference stressed this week.</p>\n<p>All spacecraft in low-Earth orbit reflect sunlight, and some glint enough to be visible to the naked eye—artificial constellations that compete with stellar ones. Satellites can cause problems for astronomers when they streak across images, interfere with radio observations, or make hard-earned data less scientifically useful. By one estimate, there could be some <a href=\"https://www.nature.com/articles/s41550-020-01238-3\">100,000</a> satellites swarming the skies in the 2030s. While scientists are mainly concerned about this aggregate effect, some individual satellites are very bright indeed. A study <a href=\"https://www.nature.com/articles/s41586-023-06672-7\">published in the journal Nature</a> this week shows that a prototype of AST SpaceMobile’s BlueBird swarm has become one of the brightest objects in the heavens. Another <a href=\"https://iopscience.iop.org/article/10.1088/1538-3873/acf40c\">study</a> documents how even deliberately darkened satellites are still twice as bright—if not more—than the limit astronomers have called for to minimize effects on space science.<br />\n</p><div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/02/wired-logo.png\" /></div>\n<p>Such concerns prompted a major conference this week, organized by the International Astronomical Union’s <a href=\"https://www.wired.com/story/astronomers-want-to-save-dark-skies-from-satellite-swarms/\">Centre for the Protection of the Dark and Quiet Sky from Satellite Constellation Interference</a>, known as CPS. It’s being held in the Canary Islands, where there are several observatories. It’s the first in-person meeting of its kind, bringing together scores of astronomers, as well as satellite industry representatives, advocates of <a href=\"https://www.wired.com/story/in-new-zealand-people-and-moths-rediscover-dark-skies/\">Indigenous and environmental</a> perspectives, and policy experts.</p></div><p><a href=\"https://arstechnica.com/?p=1974159#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1974159&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6e5a660dd84afb6e5c2e26e368c81ab23448490e576a908d672daffad7d6befd","category":"Tech"}