{"title":"Habitat quality and biological community responses to innovative hydropower plant installations at transverse in‐stream structures","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14593?af=R","date":1709010060000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/77692d7f-9eda-44bd-aa36-cfdb53824098/jpe14593-toc-0001-m.png\" alt=\"Habitat quality and biological community responses to innovative hydropower plant installations at transverse in-stream structures\" />\n<p>The installation of different types of innovative HPPs has not improved the habitat conditions for rheophilic species, contrary to the promises raised by the developers of these concepts. Conversely, retrofitting existing weirs accompanied by further damming even significantly increased the effects of serial discontinuity and deteriorated the habitat conditions for rheophilic species in upstream sections. As evident from the findings of this study, habitat and biological community effects resulting from serial discontinuity should become better integrated into ecological assessments of HPP developments.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEcological assessments of the effects of hydropower plants (HPPs) are often limited to aspects of entrainment, mortality, injuries, and passage of fish, whereas the effects on riverine habitats and biological communities in proximity to these structures are hardly documented.\n\nIn this study, aquatic communities comprising fish, macroinvertebrates, macrophytes and periphyton as well as physical and hydromorphological parameters were investigated in upstream and downstream river sections at five transverse structures at different seasons before and after the installation of an innovative HPP.\n\nAt all study sites, significant differences in the aquatic community composition between the assessed upstream and downstream sections were found after HPP construction, indicating distinct serial discontinuity.\n\nRaising the damming target at the sites Großweil and Au deteriorated the habitat conditions in the upstream area close to the weir and presumably influenced in particular the macroinvertebrate community, where a significant decrease in the density of rheophilic mayfly, stonefly and caddisfly larvae was observed after HPP construction.\n\n<i>Synthesis and applications</i>: The installation of different types of innovative HPPs has not improved the habitat conditions for rheophilic species, contrary to the promises raised by the developers of these concepts. Conversely, retrofitting existing weirs accompanied by further damming even significantly increased the effects of serial discontinuity and deteriorated the habitat conditions for rheophilic species in upstream sections. As evident from the findings of this study, habitat and biological community effects resulting from serial discontinuity should become better integrated into ecological assessments of HPP developments.\n</p>","author":"Josef Knott, \nMelanie Mueller, \nJoachim Pander, \nJuergen Geist","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"6e632465cbaaf65b5bccc4391d81b8cd6b313b54662e11b632d6473c7f0ac0fe","category":"Environment"}