{"title":"Test ride over 75 electric bikes at Alexandra Palace this August","link":"https://www.bikeradar.com/news/ebike-demo-weekend-2021/","date":1627927231000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/ebike-demo-weekend-2-1c8fc7d.jpg?quality=90&amp;resize=620,413\" />                                            <p>Have you ever wondered what it’s like to ride an electric bike or are you a bit overwhelmed by the choice? Well, you’re in luck.</p>\n<p>The Cycle Show and London Ebike Festival have organised an eBike Demo Weekend at Alexandra Palace, London, from 14 to 15 August 2021, with some of the biggest brands in cycling exhibiting and over 75 ebikes available to test ride.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">Electric bikes </a>have grown in popularity over recent years. More and more people realise the benefits of having a bike that can assist you along the flat and get you over climbs. Prices of ebikes have also come down, and more and more brands are entering the electric bike market.</p>\n<p>The eBike Demo Weekend is the perfect opportunity to find out more about this burgeoning category of bikes and give them a go.</p>\n<h2>Over 75 electric bike models from 22 brands</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> There will be over 100 different electric bikes available to test ride.</span></figcaption><span> <i>Cycle Show</i></span></div>\n<p>The demo weekend will have over 100 bikes available to try out from 22 brands, including Brompton, Ridgeback, Dawes, Specialized and Cannondale, as well as models from ebike-only specialists such as Wisper, VOLT and Chill ebikes.</p>\n<p>Bikes will range from traditional town and folding commuter bikes to electric gravel and mountain bikes.</p>\n<p>As an alternative to buying a bike outright, Swapfiets will have a selection of its Dutch-style electric bikes available to test ride following the recent expansion of its monthly rental scheme in London.</p>\n<p>If you’re bringing young ones with you, there will also be a children’s track for them to have fun testing out a selection of Squish bikes for ages three to nine.</p>\n<h2>Two outdoor tracks for test riding</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> You’ll be able to test the bikes on two different circuits.</span></figcaption><span> <i>Cycle Show</i></span></div>\n<p>The eBike Demo Weekend will feature two outdoor tracks in the parkland of Alexandra Palace to test ride the electric bikes on display: a tarmac track for road and commuter bikes and an off-road track through woodland for gravel ebikes and e-MTBs.</p>\n<p>Visitors will be given 40 minutes to properly try out the ebikes on these circuits, but bikes will be subject to availability due to recharging and some models will only be available in certain sizes.</p>\n<h2>How to book your place</h2>\n<p>You can book your place at the 2021 eBike Demo Weekend via <a href=\"https://ebikedemo.seetickets.com/content/ticket-options?src=webtextlink&amp;_ga=2.229233305.425589334.1626863753-1020462161.1626863753\" target=\"_blank\">The Cycle Show’s website</a>.</p>\n<p>Priority tickets are available for £5, which includes a confirmed entry slot and time, priority access, queue jump and a free copy of <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription\" target=\"_blank\">Cycling Plus</a> or <a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription\" target=\"_blank\">MBUK</a> magazine.</p>\n<p>Alternatively, you can book a free ticket for entry into the eBike Demo village and test rides will be available on a first-come, first-served basis with no guarantee of entry or wait times. Spaces are also limited.</p>\n<p>The Cycle Show will follow all government guidelines and legislation to ensure the event is as safe as possible.</p>\n<p>You can find out more information about the weekend on the <a href=\"https://www.cycleshow.co.uk/ebike-demo-weekend/\" target=\"_blank\">eBike Demo Weekend event page</a>.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"6e6408ee5cd2b6d164f76e516ca399d82c651aad40b1b48451de799f6a9c2fc5","category":"Cycling"}