{"title":"Apple Card Savings Account Receives Another Rate Increase","link":"https://www.macrumors.com/2024/01/04/apple-card-savings-account-apr-increase/","date":1704424077000,"content":"Apple today increased the Apple Card savings account's APY to 4.35%, according to a notification sent to cardholders, including <em>MacRumors</em> contributor <a href=\"https://twitter.com/aaronp613\">Aaron Perris</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/apple-card-savings-account-16x9.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThis is the second increase to the savings account's APY in as many months, after Apple <a href=\"https://www.macrumors.com/2023/12/20/apple-savings-4-25-interest-rate/\">raised it from 4.15% to 4.25% in December</a>. Apple's rate now matches that offered by popular high-yield savings accounts from American Express and Discover, but there are still some other options that offer even higher APYs up into the 4.5% to low 5% range in the U.S., such as Marcus by Goldman Sachs and Wealthfront.\r<br />\n\r<br />\nApple launched the high-yield savings account <a href=\"https://www.macrumors.com/2023/04/17/apple-card-savings-account-launching-today/\">in April 2023</a>, in partnership with Goldman Sachs. The account can be opened and managed in the Wallet app on the iPhone, and it has no fees, no minimum deposits, and no minimum balance requirements. You must have an Apple Card, be a U.S. resident, and be at least 18 years old to open an account.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/4.35-Apple-Card-Savings.jpg\" width=\"1179\" height=\"320\" />\r<br />\nThe account allows Apple Card holders to earn interest on their Daily Cash cashback balance, and on personal funds deposited via a linked bank account, or from their Apple Cash balance. The maximum balance allowed is $250,000, and balances are fully insured by the U.S. government's Federal Deposit Insurance Corporation.\r<br />\n\r<br />\nThe rate increase comes after <em>The Wall Street Journal</em> in November reported that Goldman Sachs is <a href=\"https://www.macrumors.com/2023/11/28/apple-goldman-sachs-partnership-ending/\">looking to terminate its Apple Card partnership</a>, as part of its broader exit from the consumer lending business. The partnership is expected to end within the next year or so, but it's unclear how this might affect the Apple Card in the future.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/04/apple-card-savings-account-apr-increase/\">Apple Card Savings Account Receives Another Rate Increase</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-card-savings-account-receives-another-rate-increase.2415503/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6e6e8ca773bc6c10271f3a00fe2c7f856cf8a3a10412883ef2eeeadc92b9700c","category":"Apple"}