{"title":"Hosting Ars, part three: CI/CD, or how I learned to stop worrying and love DevOps","link":"https://arstechnica.com/?p=1956002","date":1690981251000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1367728715c-800x450.jpg\" alt=\"Image of devops \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/GettyImages-1367728715c.jpg\">Enlarge</a> <span>/</span> DevOps, DevOps, DevOps!  (credit: ArtemisDiana / Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>One of the most important things to happen in the evolution of development over the past many years is the widespread adoption of <a href=\"https://www.redhat.com/en/topics/devops/what-is-ci-cd\">continuous integration and continuous deployment</a>, or CI/CD. (Sometimes the \"CD\" stands for \"continuous delivery,\" depending on who you're talking to.)</p>\n<p>It's a concept that jettisons a lot of older ideas about how systems should be managed and instead gives you a way to update code and integrate changes as live rolling deployments while ensuring that the new code is tested and slots in smoothly with stuff that's already running. A properly architected CI/CD pipeline means you can get code changes into production faster and with fewer errors. But what does that look like in practice?</p>\n<p>It looks like Ars Technica, because we've adopted a CI/CD workflow to take full advantage of the flexibility afforded us by serverless cloud hosting. Welcome to part three of our four-part series on how we host Ars—here, we’re going to swing away from the \"ops\" side of \"DevOps\" and peer more closely at the \"dev\" part instead. Join us for a look behind the curtain at how Ars uses CI/CD in both our deployed applications and our infrastructure management!</p></div><p><a href=\"https://arstechnica.com/?p=1956002#p3\">Read 38 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956002&amp;comments=1\">Comments</a></p>","author":"Lee Hutchinson","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6e79bb78791427fa5b266efd951a3994e924e53367882e3165328a3eaea55169","category":"Tech"}