{"title":"Salinity plays a limited role in determining rates of size evolution in fishes globally across multiple scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13883?af=R","date":1723695049000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Substantial progress has been made to map biodiversity and its drivers across the planet at multiple scales, yet studies that quantify the evolutionary processes that underpin this biodiversity, and test their drivers at multiple scales, are comparatively rare. Studying most fish species, we quantify rates of body size evolution to test the role of fundamental salinity habitats in shaping rates of evolution at multiple scales. We also determine how four additional factors shape evolutionary rates.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time Period</h2>\n<p>Extant species.</p>\n<h2>Major Taxa Studied</h2>\n<p>Actinopterygii.</p>\n<h2>Methods</h2>\n<p>In up to 1710 comparisons studying over 27,000 species, we compare rates of body size evolution among five salinity habits using 13 metrics. The comparisons span a molecular tree, 100 supertrees, and 10 scales of observation to test for robust patterns and reveal how patterns change with scale. Then, three approaches assess the role of three non-salinity factors on rates, and an alternative habitat scheme tests if lakes influence evolutionary rates.</p>\n<h2>Results</h2>\n<p>Rates of size evolution rarely differ consistently between salinity habitats; rate patterns are highly clade- and scale dependent. One exception is freshwater-brackish fishes, which possess among the highest size rates of any salinity, showing higher rates than euryhaline fishes in most groupings studied at most scales, and versus marine, freshwater and marine–brackish habitats at numerous scales. Additionally, species richness had the greatest potential to predict phenotypic rates, followed by branch duration, then absolute values of body size. Lacustrine environments were consistently associated with high rates of size evolution.</p>\n<h2>Main Conclusions</h2>\n<p>We reveal the rate patterns that underpin global body size diversity for fishes, identifying factors that play a limited role in shaping rates of size evolution, such as salinity, and those such as species richness, age and lake environments that consistently shape evolutionary rates across half of vertebrate diversity.</p>","author":"John T. Clarke, \nRobert B. Davis","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"6e7dca672def16208207bac81b2242663750f18967b62a74efc920d67ffe4c2b","category":"Environment"}