{"title":"Effects of Influenza Vaccine on the Immune Responses to SARS-CoV-2 Vaccination","link":"https://www.preprints.org/manuscript/202403.1414/v1","date":1711350236000,"content":"A number of studies suggested that influenza vaccination can provide protection against COVID-19 but the underlying mechanisms that could explain this association is still unclear. In this study, the effect of the 2021/2022 seasonal influenza vaccination on the immune response to the booster dose of anti-SARS-CoV-2 vaccination was evaluated in a cohort of healthy individuals. One hundred and thirteen participants were enrolled, and 74 of them with no prior COVID-19 diagnosis or significant co-morbidities were considered for the analysis. Participants received the anti-influenza tetravalent vaccine and the booster dose of the anti-SARS-CoV-2 vaccine or the anti-SARS-CoV-2 vaccine alone. Blood was collected before and 4 weeks after each vaccination and 12 weeks after SARSCoV2 vaccination and analyzed for anti-flu and anti-spike-specific antibody titers and for in vitro influenza and SARS-CoV-2 neutralization capacity. Results indicated an increased reactivity in subjects who received both influenza and SARSCoV2 vaccinations, as compared to those who received only the SARS-CoV-2 vaccine, with sustained anti-spike antibody titers up to 12 weeks post-vaccination. Immune response to influenza vaccine was evaluated and individuals were stratified as high or low responders. High responders showed increased antibody titers against SARSCoV2 vaccine both after 4- and 12-weeks post-vaccination. On the contrary, the individuals classified as low responders were less responsive to the SARS-CoV-2 vaccine. These data indicate that both external stimuli, such as influenza vaccination, and the host's intrinsic ability to respond to stimuli play a role in the response to vaccine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6e80fea87eb4725e8f9c5bc7b01a9e0cf4a1ccec1244c29e4f4e7006c6cfbcbe","category":"Interdisciplinary"}