{"title":"Unveiling the Molecular Mechanisms of the Placenta Accreta Spectrum","link":"https://www.preprints.org/manuscript/202407.1604/v1","date":1721382891000,"content":"Placenta accreta spectrum (PAS) disorders are characterized by abnormal trophoblastic invasion into the myometrium, leading to significant maternal health risks. PAS includes placenta accreta (invasion &amp;lt;50% of the myometrium), increta (invasion &amp;gt;50%), and percreta (invasion through the entire myometrium). The condition is most associated with previous cesarean deliveries, and its incidence increases with the number of cesareans. Other risk factors include advanced maternal age, multiparity, and various uterine surgeries. The increasing global cesarean rates heighten the importance of early PAS diagnosis and management. The study reviewed molecular mechanisms driving PAS, focusing on signaling pathways, genetic expression, biomarkers, and non-coding RNAs involved in trophoblastic invasion. It explored genetic expression and key regulatory processes such as apoptosis, cell proliferation, invasion, and inflammation. The manuscript was compiled from recent scientific literature (2014 – 2024) from the Scopus, PubMed, Google Scholar, and Web of Science databases. Placenta Acreta Spectrum; acreta; increta; percreta; trophoblast invasion; miRNAs, lncRNAs; genetic expression; biomarkers; signaling pathways were the employed keywords to compile relevant literature. The PAS is an important obstetric health problem that challenges maternal health risks associated with abnormal trophoblastic invasion that relies on abnormal placentation, uterine scarring, and impaired decidualization. Identifying new biomarkers like AFP, sFlt-1, β-hCG, PlGF, and PAPP-A aids early detection and management. Understanding genetic expression and non-coding RNAs is crucial for unraveling PAS complexities. Besides, aberrant signaling pathways like Notch, PI3K/Akt, STAT3, and TGF-β offer potential therapeutic targets to modulate trophoblastic invasion. This review underscores the need for interdisciplinary care, early diagnosis, and ongoing research into PAS biomarkers and molecular mechanisms to improve prognosis and quality of life for affected women.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6e80d15a4d9fc47e962c9c89963891e26d0e0b742ed4256d90ac4e5441e389e0","category":"Interdisciplinary"}