{"title":"Evie Richards takes a huge bunny hop into the Olympics","link":"https://www.cyclist.co.uk/news/9783/evie-richards-takes-a-huge-bunny-hop-into-the-olympics","date":1624461656000,"content":"<span>\n      <span><a href=\"/authors/maria-david\">Maria David</a></span>\n  </span><div>  \n  <div>      <div><span>24 Jun 2021</span></div>    </div></div><p>\nChildhood dream is fulfilled for the Trek Factory Racing-Red Bull rider, after a complicated trail to Tokyo 2020</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/evie_richards.jpg?itok=I15n205m\" />  </div>\n<div>\n      <p> A thrilled Evie Richards had her childhood dream come true earlier this week when her place on the Team GB Olympic squad was confirmed. The confirmatory email finally came through in the evening after an entire day spent waiting to find out if she would be on the plane to Tokyo.</p>\n<p>Needless to say there were huge celebrations in the Richards household when the 24-year-old Trek Factory Racing and Red Bull-sponsored rider found out that she will be on the start line at Izu (120km south of Tokyo) on 27th July for the cross-country mountain bike race.</p>\n<h3>An initial bumpy road</h3>\n<p>Richards will be just the second woman to represent Team GB in the mountain bike race since 2000, and will be the first Olympic mountain biking medallist if she reaches the podium.</p>\n<p>‘It’s all I’ve ever dreamed of from such a young age, so I really can’t believe I’m going. I’ve got videos from six years ago of me saying “I’m going to be in Tokyo in 2020”, and so it’s amazing to see that I actually will be there,’ she says.</p>\n<p>‘So it wasn’t just this wild dream that I had – and actually it’s amazing and quite emotional to see that. I’m super-excited about it.’</p>\n<p>For the rider from Malvern, Worcestershire, it has been a long and at times difficult road since she set her sights on the Olympics from the age of 11.</p>\n<p>Richards, who had done various sports in her youth, finally got into cycling aged 16 and received coaching from local top riders Liam Killeen and Tracy Moseley.</p>\n<p>After being selected for the <a href=\"/tags/british-cycling\">British Cycling</a> Academy in 2015, Richards spent a few difficult years in Manchester, where she found cycling life constrained by living in the city.</p>\n<p>‘It was a really a hard time. I think it’s really hard for mountain bikers to be located in a city centre. It’s an amazing setup for track riders in that they can see their physios every day, and they’re on the track and in the gym. But for mountain bikers – I didn’t drive at the time – it’s not easy to find trails, and also on trails if I crashed no one would know where I was.'</p>\n<p>It was while in Manchester that Richards became obsessed with her food and weight, developing the condition known as relative energy deficiency in sport (RED-S). She eventually received help from sports dietitian Renée McGregor in 2018, as well as family and friends.</p>\n<p>As if that wasn’t enough, she also dislocated her knee and had to undergo surgery in 2019, leading to an interrupted season.</p>\n<p>Despite these setbacks, Richards still managed to notch up success along the way: a double Cyclocross U23 Worlds Championships title in 2016 and 2017, and a bronze medal at the 2018 Commonwealth Games.</p>\n<p>After leaving the Academy in 2018, Richards returned to her family base and signed up as a racer for Trek Factory Racing, with sponsorship from Red Bull. Continuing to make her mark on the international mountain biking circuit, Richards placed third overall in the U23 World Cup competition in 2018 and 2019.</p>\n<p>More recently she won the World Cup Cross Country round at Nové Město in the Czech Republic last year and has already had two victories this year in Spain and Switzerland.</p>\n<p>‘I always dreamed of being sponsored by Red Bull, and I’ve only ever ridden a Trek bike so for me I feel so lucky, and I’m much happier where I am now.’</p>\n<h3>Racing during the pandemic</h3>\n<p>However, she admits to being 'a stress ball', and that the challenging times of the pandemic have not helped matters in the run-up to the Tokyo Olympics.</p>\n<p>‘It was super stressful trying to work out how to get to these races. There were times when I didn’t think I’d manage to get to these World Cups.</p>\n<p>‘I couldn’t get over to Spain in January and in February, and I’ve been turned away from the airport a fair few times now. I’ve had to do quite a bit of quarantining but I feel like I’m slowly getting used to this new way of travelling with all this paperwork from all embassies and having to isolate and do like a hundred Covid tests.</p>\n<p>‘After my last race I had to isolate for longer than normal because someone tested positive on my flight, and then countries were banning people from the UK from travelling over, so my plans kept changing. I found it really hard.</p>\n<p>‘Our Trek team managers have got letters from all sorts of embassies – sports embassies, normal embassies from different countries and then it’s my responsibility to sort out all the Covid tests and that kind of paperwork. We have got over to a few races, which is good though.’</p>\n<p>In order to circumvent the hurdles and pitfalls in getting to the races abroad, Richards and her support team spent extended periods of time in mainland Europe over the spring and were fortunately able to contest World Cup races in Germany, Czech Republic, Austria with another race in Italy, and a World Cup in France to come before jetting off to Tokyo.</p>\n<p>‘I feel really lucky that I’m out here now, and I can feel relaxed just do my job – training hard and being an athlete.’</p>\n<h3>Tokyo course preview and preparation</h3>\n<p>Richards previewed the Olympic cross country mountain bike course at the test event in 2019 and knows the aspects that will be important to succeed on the demanding 4.1km circuit, which includes 150m of climbing on each lap.</p>\n<p>‘We’ve [with coaches Matt Ellis and Liam Killeen] got loads of data from when we did the test event. We’ve got videos, I’ve written notes on every section and we’ve got pictures of everything, so we have quite specific things that will help me when I get to Tokyo,’ Richards explains.</p>\n<p>‘The course is quite different to any of the courses we’ve done. I’d say it’s probably most similar to Czech Republic, in the sense that there’s rocks and stuff like that. The ascents/descents are a lot steeper. Olympic tracks are probably more challenging than other courses, so I’d probably compare it to the London Olympics course at Hadleigh Park, before it was altered for the public.’</p>\n<p>In addition, the heat and humidity of Izu will be a challenge for Richards, who prefers the cold, wintry conditions of a <a href=\"/tags/cyclocross\">cyclocross</a> race.</p>\n<p>‘I much prefer the cold. I started heat training work from February, and it’s something I’ve been doing a lot at home, but actually reduced it in my programme because for me, mentally it was more draining and meant I was sacrificing my other training.</p>\n<p>‘We’ve actually changed it to doing more actual riding somewhere hot, and riding on steep-sloped climbs, rather than heat chamber stuff. I’ve never had to do any heat adaptation before, so I am learning how my body reacts, and it’s a new thing and a good challenge to have.’</p>\n<p>Racing in such conditions will also mean a different way of racing from her usual attacking style.</p>\n<p>‘Attacking early will probably be the worst thing for Tokyo! Learning to pace better is something I’m going through with my coaches. You don’t really want to go in the deep end too early when it is hot because you really can’t recover.</p>\n<p>‘You really can’t get that core temperature down, so it’s definitely something that we trialled at this race. It’s about putting in your best effort, not your max effort.’</p>\n<h3>Taking on the competition</h3>\n<p>As for her chances at the Tokyo Games, Richards will have her work cut out for her as competition will be tight. Defending Olympic Champion Jenny Rissveds of Sweden has been racing strongly this season, while Richards’ Swiss teammate Jolanda Neff has also been on the podium a few times this year, while six-time and reigning World Champion Pauline Ferrand-Prevot has shown solid form.</p>\n<p>The Frenchwoman’s compatriot Loana Lecomte is the current rising star in the women’s elite rankings. Nevertheless, the sheer competitiveness of the sport means Richards is still in with a shout at getting on the podium.</p>\n<p>‘There are a lot of fast girls at the moment and it keeps changing all the time, but Loana is very quick. She is absolutely flying at the moment, and fields ahead of everyone else. It’ll be a really close battle though because at every World Cup it’s different people in the top 10.</p>\n<p>‘I think every rider is probably also going to struggle in the conditions, so it depends how you deal with that on the day. Pacing of the race, and cooling strategies during the race, will be really key. So I think it’ll be a really exciting race.’</p>\n<p>Covid rules mean that athletes will be in small bubbles in Tokyo, with Richards lodging with <a href=\"/tags/tom-pidcock\">Tom Pidcock</a>, who is also competing in the cross country mountain bike race.</p>\n<p>Hopefully, the two of them can inspire each other and Richards can have a fairy tale end to her Olympic campaign, and maybe make history in British women’s mountain biking in the process. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"6e889b06dae8ca2cfb747b9d9e1acf1c228c00abb07dad4da6aa19f5f3a0daa6","category":"Cycling"}