{"title":"Development and Validation of the Communities Geriatric Mild Cognitive Impairment Risk Calculator (CGMCI-Risk)","link":"https://www.preprints.org/manuscript/202409.0296/v1","date":1725431944000,"content":"Objectives: To develop and validate the Communities Geriatric Mild Cognitive Impairment Risk Calculator (CGMCI-Risk), aimed at aiding community healthcare workers in the early identification of individuals at high risk of Mild Cognitive Impairment (MCI); Methods: Based on nationally representative community survey data, backward stepwise regression was employed to screen the variables, and logistic regression was utilized to construct the CGMCI-Risk. Internal validation was conducted using bootstrap resampling, while external validation was performed using temporal validation. The area under the receiver operating characteristic curve (AUROC), calibration curve, and decision curve analysis (DCA) were employed to evaluate the CGMCI-Risk in terms of discrimination, calibration, and net benefit, respectively; Results: The CGMCI-Risk model included variables such as age, educational level, sex, exercise, garden work, TV watching or radio listening, Instrumental Activity of Daily Living (IADL), hearing, and masticatory function. The AUROC was 0.781 (95% CI = 0.766 to 0.796). Calibration curve showed strong agreement, and the DCA suggested substantial clinical utility. In external validation, the CGMCI-Risk model maintained similar performance with an AUROC of 0.782 (95% CI = 0.763 to 0.801); Conclusions: CGMCI-Risk is an effective tool for assessing cognitive function risk within the community. It uses readily predictor variables, allowing community healthcare workers to identify the risk of MCI in older adults over a three-year span.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6e8b8ef199b65de9fccae6db8f10067ccc24bd55547eacf739e49aea5ad92bd5","category":"Interdisciplinary"}