{"title":"Cable TV has fewest subscribers since 1992, YouTube TV is the only riser","link":"https://arstechnica.com/?p=1939351","date":1684182015000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/06/cable-tv-getty-640x424.jpg\" alt=\"Cable TV has fewest subscribers since 1992, YouTube TV is the only riser\" />\n      <p>(credit: Getty Images | chargerv8)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Everybody knows satellite and cable TV is dying right? Cord cutting has been a trend for years, but a new report from <a href=\"https://variety.com/2023/tv/news/cord-cutting-all-time-high-q1-2023-pay-tv-losses-1235610939/\">Variety</a> highlights just how bad it has gotten. Citing numbers from research firm SVB MoffettNathanson, US pay-TV subscribers are down to their lowest levels since 1992—that's before DirecTV even existed. Q1 2023 reportedly saw 2.3 million households cut the cord, making it the biggest drop on record.</p>\n<p>The report says pay TV is now only in 58.5 percent of US households. Cable TV subscribers dropped 9.9 percent year over year, while satellite is down 13.4 percent. MoffettNathanson senior analyst Craig Moffett wrote that \"the sun is beginning to set\" on the cable and satellite TV business and that \"the picture is not one that suggests that a plateau in the rate of decline is coming any time soon.\" It's getting to the point where cable companies can't afford the high rates some channels like sports broadcasters are charging, and they're forced to raise prices, which forces more people to cut the cord. Moffett calls it the “impoverishment cycle.”</p>\n<p>The only pay-TV provider not to see a drop in subscribers is also the most modern: Google's YouTube TV, which added 300,000 subscribers in Q1 2023 and is now at 6.3 million paying customers. That makes it about 40 percent the size of the biggest pay-TV provider, Comcast, which has 15.53 million customers.</p></div><p><a href=\"https://arstechnica.com/?p=1939351#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939351&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6e8db86ed2876b0fb1095e122db1bdafed1722b70dbfd1b4cb19206ca911534a","category":"Tech"}