{"title":"A link between evolution and society fostering the UN sustainable development goals","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13728?af=R","date":1718348400000,"content":"<h2>Abstract</h2>\n<p>Given the multitude of challenges Earth is facing, sustainability science is of key importance to our continued existence. Evolution is the fundamental biological process underlying the origin of all biodiversity. This phylogenetic diversity fosters the resilience of ecosystems to environmental change, and provides numerous resources to society, and options for the future. Genetic diversity within species is also key to the ability of populations to evolve and adapt to environmental change. Yet, the value of evolutionary processes and the consequences of their impairment have not generally been considered in sustainability research. We argue that biological evolution is important for sustainability and that the concepts, theory, data, and methodological approaches used in evolutionary biology can, in crucial ways, contribute to achieving the UN Sustainable Development Goals (SDGs). We discuss how evolutionary principles are relevant to understanding, maintaining, and improving Nature Contributions to People (NCP) and how they contribute to the SDGs. We highlight specific applications of evolution, evolutionary theory, and evolutionary biology's diverse toolbox, grouped into four major routes through which evolution and evolutionary insights can impact sustainability. We argue that information on both within-species evolutionary potential and among-species phylogenetic diversity is necessary to predict population, community, and ecosystem responses to global change and to make informed decisions on sustainable production, health, and well-being. We provide examples of how evolutionary insights and the tools developed by evolutionary biology can not only inspire and enhance progress on the trajectory to sustainability, but also highlight some obstacles that hitherto seem to have impeded an efficient uptake of evolutionary insights in sustainability research and actions to sustain SDGs. We call for enhanced collaboration between sustainability science and evolutionary biology to understand how integrating these disciplines can help achieve the sustainable future envisioned by the UN SDGs.</p>","author":"Luc De Meester, \nElla Vázquez‐Domínguez, \nRees Kassen, \nFélix Forest, \nMauricio R. Bellon, \nBritt Koskella, \nRosa A. Scherson, \nLicia Colli, \nAndrew P. Hendry, \nKeith A. Crandall, \nDaniel P. Faith, \nCraig J. Starger, \nR. Geeta, \nHitoshi Araki, \nEhsan M. Dulloo, \nCaroline Souffreau, \nSibylle Schroer, \nMarc T. J. Johnson","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"6ea4437973f191fb223d0b5609a689ca2924fb1f9ed73592c0fd9d6732e9bfe1","category":"Environment"}