{"title":"Association of body image perception and (dis)satisfaction with adiposity in adults: The Pró-Saúde study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304987","date":1718028000000,"content":"<p>by Magno C. Cabral, Gabriela M. O. Coelho, Natalia Oliveira, Daniela S. Canella, Raiane L. O. Brasil, Tatiana A. M. Campos, Eduardo Faerstein, Flávia F. Bezerra</p>\r\nIntroduction <p>Body image distortion and/or dissatisfaction may occur primarily due to body fat accumulation and/or distribution. The aim of this study was to evaluate the frequency of body image perception and (dis)satisfaction categories in adult men and women according to the adiposity classification.</p> Methods <p>This is a cross-sectional study (n = 514; 33–79 years; 265 women) that is part of a prospective cohort (Pró-Saúde study). Adiposity measurements were determined by two methods: anthropometry, used to calculate the body mass index (BMI) and dual-energy X-ray absorptiometry (DXA), to estimate body fat percentage. Participants were grouped as “no excess adiposity” and “excess adiposity”, considering BMI and body fat percentage (&gt;30% for men, &gt;40% for women). Perception and (dis)satisfaction with body image were evaluated using the Kakeshita scale, composed by 15 silhouettes, developed for the Brazilian population. Degree of distortion (perceived BMI ‐ real BMI) and dissatisfaction (perceived BMI ‐ desired BMI) were calculated.</p> Results <p>A high proportion of men (58.6%; 74.3%), and especially of women (82.6%; 86.8%), presented body size overestimation and dissatisfaction due to excess weight, respectively. A relevant fraction of the women (32.6%) and men (30.8%) who were dissatisfied due to excess weight did not present excess adiposity, especially if classified by DXA. Variability in degree of distortion was hardly explained by anthropometric and DXA variables in women (&lt;5%) and men (∼22%). Both anthropometric and DXA measurements accounted for ∼30% and ∼50% of the variability in degree of dissatisfaction among women and men, respectively.</p> Conclusion <p>Our results suggest a high frequency of body image distortion in Brazilian adult individuals, as well as dissatisfaction with excess weight, especially among women with excess adiposity. The findings indicate that anthropometric measurements explain much of the variability in degree of body image dissatisfaction in men, with no apparent advantage of the use of more refined DXA measurements.</p>","author":"Magno C. Cabral","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6eb8deca883340d35c191d1f9c668c80030ac2a78353e840498b6be50051b416","category":"Interdisciplinary"}