{"title":"Apple Rolls out ‘Find My’ to Bicycles and More: Sports Tech Thoughts","link":"https://www.dcrainmaker.com/2021/04/apple-rolls-out-find-my-to-bicycles-and-more-sports-tech-thoughts.html","date":1617915150000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/FindMyVanmoof.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"FindMyVanmoof\" src=\"https://media.dcrainmaker.com/images/2021/04/FindMyVanmoof_thumb.jpg\" alt=\"FindMyVanmoof\" width=\"722\" height=\"407\" border=\"0\" /></a></p>\n<p>Today Apple announced their Find My feature is now available to 3rd party devices, and two of the three device partners for the initial launch are sports related. There’s the <a href=\"https://9to5mac.com/2021/04/08/belkin-soundform-freedom-vs-airpods/\">Belkin’s sport headphones</a>, and the VanMoof S3 &amp; X3 electric bikes. The third device isn’t on the market yet, but is the <a href=\"https://chipolo.net/en/pages/chipolo-one-spot\">Chipolo OneSpot tracker</a>, which is basically like a Tile tracker, but now also integrated with Apple’s Find My.</p>\n<p>Now before we talk about Apple’s implementation and the ramifications, one should note that what we see today is iterative on both their own technology and others. For example, a few years back <a href=\"https://www.dcrainmaker.com/2019/01/4iiii-tracking-capabilities.html\">4iiii added Chipolo tracking to their power meters</a>. It’s even on my mountain bike power meter from them. Sure, it won’t keep someone from stealing your bike, but it might make finding it easier again – depending on the motives of the thief, and whether there’s enough Chipolo users nearby.</p>\n<p>Just like we saw a few weeks ago <a href=\"https://www.thetileapp.com/en-eu/blog/tile-tracks-fitbit-inspire2\">Fitbit add Tile support</a> to their wearables. The idea being you can use your smartphone app to find your Fitbit tracker. Though, I suspect most of us probably want to use our Fitbit to figure out where on earth we left our phone in our house. But hey, iterative steps.</p>\n<h3><span style=\"font-weight: bold;\">VanMoof’s Find My Feature:</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"clip_image001[7]\" src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017_thumb.jpg\" alt=\"clip_image001[7]\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Now, the VanMoof bicycle case is interesting to me. Mainly because up until semi-recently I actually had a VanMoof bike (the one above). In my case, I paid for their subscription service to have a non-electric Smart S. For those not familiar, VanMoof’s main thing in life is that they’ve got connected bikes. Up until about a year ago, that was both electric and non-electric bikes, but now they’ve gone all e-bikes. However, the connected bits primarily referred to two pieces. The first was a smartphone app that could do some basic things like lock and unlock your bike, set the alarm options (which is crazy loud), track mileage, and check battery status. But the more appealing part of their smartphone app was that in conjunction with a service they offered, they’d <a href=\"https://www.vanmoof.com/blog/en/vanmoof-bike-hunt-report-november-2020\">find your bike in the event it was stolen</a>.</p>\n<p>The service was basically started off with them turning on some tracking on the bike, once triggered, and then if required they’d escalate to sending out people to track it down ‘in the real world’. If they failed, you’d get a new bike on them (assuming you paid for the service).</p>\n<p>Now in my case with my non-electric bike, it was a sup-bar experience (I don’t know if the full e-bikes are different). See, the tracking was only tied to whether your phone was there with it. So for example, when I would go on trips for a week and park my bike somewhere else, in some cases it never even showed where the bike was parked (a week later). This despite having plenty of battery in the bike. Also, in general, while the book visually looked great (if you liked the modern design), actually was poorly made or assembled. Silly things like nobody ever bothered to glue the pedal reflectors on (so they flew off constantly), it that was delivered to me at the showroom with a flat tire (seriously), and the three-speed shifting wouldn’t shift unless I backwards pedaled during each shift (every time). Eventually I simply stopped using it, and after paying more than it was worth in subscription fees, I returned it. I had high hopes, but was disappointed on multiple fronts, including how much VanMoof hyped the app, but ultimately I found it pretty underwhelming at the time. Perhaps things have changed.</p>\n<p>With today’s announcement, their S3 and X3 bikes are now compatible with Find My, which if you’re an Apple user you’ll be familiar with. Essentially you can open an app on your phone and find other Apple products, like your iPad, phone, and computers. You can also do some basic management too, like triggering noises or such. With Apple’s expansion of Find My, now 3rd parties can get in on the action. Which, is exactly what VanMoof has done.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/image-14.png\"><img style=\"margin: 0px; border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-13.png\" alt=\"image\" width=\"720\" height=\"444\" border=\"0\" /></a></p>\n<p>For new S3 and X3 bikes purchased as of today, they’ll come equipped with the Find My feature. This means that it’ll show up on their Find My list of things, 24&#215;7, according to VanMoof (unlike my non-electric version which seemed to update 0x0). Sure, this allows you to find it, but it also lets you honk the horn too – making it easy to find your bike amongst hundreds of other bikes in the racks in Amsterdam (where VanMoof is based). That’s useful…especially if you are a bit foggy on exactly where you parked it…5 imaginary pre-pandemic bar visits ago (all restaurants have been closed here since last fall).</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/384184-VM_FindMy_Options-5-7e10a9-original-1617708605.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"384184-VM_FindMy_Options-5-7e10a9-original-1617708605\" src=\"https://media.dcrainmaker.com/images/2021/04/384184-VM_FindMy_Options-5-7e10a9-original-1617708605_thumb.png\" alt=\"384184-VM_FindMy_Options-5-7e10a9-original-1617708605\" width=\"722\" height=\"256\" border=\"0\" /></a></p>\n<p>All of this depends on slightly new hardware, which is why it’s only working on the newer bikes from now, and now older ones.</p>\n<p>One of the important things here to understand is that unlike your iPhone or Mac using Find My, this isn’t leveraging WiFi or cellular in the bike itself. Instead, with the new 3rd party access to Find My, it’s using a different chipset akin to Apple’s U1 Ultra Wideband chip to act like a Tile/Chipolo network, leveraging other devices in the network – all without direct cellular/WiFi access. In it’s the requirements for getting access to the Find My network, Apple notes:</p>\n<blockquote><p>“With this, third-party device makers will be able to take advantage of Ultra Wideband technology in U1-equipped Apple devices, creating a more precise, directionally aware experience when nearby.”</p></blockquote>\n<p>More importantly though, if someone else finds your device (such as those sport earphones mentioned earlier), it’ll show a message on their phone on how to contact you. You’ll need to first set the device as ‘lost’, and then from there specify the contact info. While Tile and Chipolo have millions of devices, Apple has hundreds of millions of devices out looking always passively looking for things. The U1 chip is currently in the iPhone 11 &amp; 12 series phones, as well as the Apple Watch Series 6 and HomePod Mini. Though oddly, not the newer AirPods Max (the crazy expensive headphones), nor any of the newer M1 Macs.</p>\n<h3><span style=\"font-weight: bold;\">Other Applications in Sports Tech:</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-1.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-1.jpg\" alt=\"clip_image001\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Of course, when Apple throws its weight behind something, it’s rare that it doesn’t quickly find mass adoption. And undoubtedly, 3rd parties will flock to the Find My feature with their own implementations.The question is: To what extent?</p>\n<p>And that extent will largely depend on how complicated it is to implement technically, but also process-wise. For example, Apple’s HomeKit specifications and agreements are well known to be more convoluted than 3rd party companies prefer. Thus, while there is adoption there – it’s more limited than other Apple developer programs (and far more limited in support than the Google Home integration, which is found on virtually every smartphone device made). Over time that’s shifting, but it’s ultimately slowed adoption of HomeKit device.</p>\n<p>On the technical side, I think the implementation seen in <a href=\"https://chipolo.net/en/pages/chipolo-one-spot\">Chipolo’s upcoming ONE Spot tracker</a> is probably the most interesting one. Here’s an ultra-low power device using the technology that crosses the deice into the Chipolo network. This effectively acts as a gateway to stick a Chipolo tag on something and have it be tracked within your Find My app, rather than the Chipolo app. But more importantly, it makes your small Chipolo tracker compatible with hundreds of millions of devices rather than just the few million Chipolo users. Inversely, Chipolo isn’t limited to just iOS, but also Android compatible too.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/04/image-15.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-14.png\" alt=\"image\" width=\"720\" height=\"537\" border=\"0\" /></a></p>\n<p>As you shift this lens into the sports world, I’d imagine the likes of Specialized and others would be looking to put Find My chips on their bikes, especially their e-bikes. Heck, once the Chipolo Find My enabled tracker becomes available in June (and thus the reach of all those Apple devices), I’m going to buy a few to stick semi-hidden on <a href=\"https://www.dcrainmaker.com/2021/04/my-stupidly-overcomplicated-2021-bike-mileage-tracking-project.html\">our cargo bikes</a>. Sure, we have other theft protection on it, but one more layer is handy.</p>\n<p>But what about the likes of Garmin and others? Well, I think Fitbit has kinda paved that way for them. Today, Garmin’s ‘Find’ feature is tied to your specific phone, via just Bluetooth. Whether it’s finding your phone from your watch, or finding your watch from your phone – both require a direct and active Bluetooth connection with your phone. Thus, it only works if you’re close enough for that to happen. And it doesn’t work if your Garmin device is off. Or if the Garmin Connect app is closed, hung, or otherwise out to lunch.</p>\n<p>For example, take a Garmin Edge bike computer – once you power that off, it’s as good as dead to any locate functions. Whereas something like the Chipolo tracker isn’t. It’s passively there still, and in the case of Chipolo’s tracker, tied to a tiny coin-cell battery – exactly as 4iiii has done with their power meter. There’s undoubtedly space inside most bike computers on the market for this type of thing to be implemented. Though, I think the value here is more in the bike itself than anything else.</p>\n<p>But heck, why stop there. If the number of views on my <a href=\"https://www.youtube.com/watch?v=Pw0mYAM0c5I\">&#8216;How to find your lost GoPro&#8217; video</a> is any indication &#8211; I&#8217;d find having this built into that super handy. Undoubtedly most GoPro&#8217;s that are lost during action are eventually found some&#8230;just by the wrong person. If this could tell that person how to get it back to you &#8211; I suspect many people would. Or even, just having this in my own darn home would be useful.</p>\n<p>Finally, I think too many people get fixated on the ‘stolen’ argument with these sorts of tech. Yes, that’s important, but as the name implies ‘Find My’ is more about finding something you’ve misplaced. Some people also use it to keep tabs on family members (such as elderly or kids). To have this built into a watch as someone runs sans-phone throughout the city, quietly laying a breadcrumb trail of location clues, in case of emergency, seems like it could have substantial safety applications beyond finding a fancy bike.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"6ebe83ab01a0223956fd33e42289336469030e7596ebd53fe66331a8ea9ef636","category":"Cycling"}