{"title":"Emigration of post‐spawned twaite shad Alosa fallax, an anadromous and iteroparous fish, in a highly fragmented river","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15713?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>Anthropogenic barriers are widely known to negatively impact the spawning migrations of anadromous fishes, by delaying or preventing passage upstream. Although the impacts of barriers on emigrating post-spawned adults are less well studied, they could potentially impact the fitness and subsequent return rates of iteroparous species. In this study, passive acoustic telemetry was used to track the emigrations of 53 twaite shad <i>Alosa fallax</i> in the River Severn basin in their first spawning migration a year after being tagged, giving insights into their emigration movements and the impacts of anthropogenic weirs on these movements. <i>A. fallax</i> began their emigrations after spending varying amounts of time and migrating various distances within the river, with late-emigrating individuals moving fastest and most directly. Emigrations became faster and more direct the further downstream individuals were from their furthest upstream extent. Downstream passage delays at weirs increased emigration times by a median of 61%, with environmental conditions (i.e., temperature, flow, and tidal influence on river level) having little influence on downstream passage at weirs with no modifications to facilitate fish passage. As weir-induced emigration delays are suggested to deplete energy reserves (when energy levels are already depleted post-spawning), limit spawning opportunities (by preventing access to downstream spawning habitat), and expose individuals to increased predation risk and suboptimal conditions (e.g., high temperatures), these delays can potentially diminish the benefits of iteroparity. The evidence presented here suggests that more consideration should be given to the potential impacts of anthropogenic barriers on the emigrations of iteroparous species when assessing river connectivity or undertaking barrier mitigation.</p>","author":"Mark I. A. Yeldham, \nJ. Robert Britton, \nCharles Crundwell, \nPeter Davies, \nJamie R. Dodd, \nAndrew D. Nunn, \nRandolph Velterop, \nJonathan D. Bolland","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"6ec08ad9818f15b6968ff1cd5936f9f2c723d670c721bdb4da86076f5472def4","category":"Environment"}