{"title":"Pneumonia Detection from Chest X-rays Using the CheXNet Deep Learning Algorithm","link":"https://www.preprints.org/manuscript/202407.0104/v1","date":1719832494000,"content":"- Early and accurate detection of pneumonia from chest X-ray images is crucial for timely treatment and patient care. In study presents a robust computational framework leveraging the CheXnet algorithm, a deep learning model, to identify pneumonia from chest X-rays. Developed a neural network architecture trained on a substantial dataset of chest X- ray images labeled as 'Normal' and 'Pneumonia'. The user- friendly interface of the system allows for seamless uploading of images, with the model subsequently providing predictions, a confusion matrix, accuracy metrics, and layer activations visualizations. The algorithm's performance was rigorously evaluated, with a confusion matrix indicating a high number of true positives and true negatives. Specifically, the model detected pneumonia with an accuracy of 92.47%, as shown by the results displayed in the system's interface. The precision, recall, and F1-score for pneumonia detection were 0.90, 0.96, and 0.93 respectively, with the overall system achieving an accuracy of 0.91 across the test set of 624 images. Visualizations of the neural network layers reveal the complex feature mappings the model uses to differentiate between normal and pathological findings. These insights could be vital for enhancing the interpretability of deep learning models in medical diagnostics. The Results indicate that the CheXnet-based neural network is a promising tool for automating pneumonia detection in clinical settings, which can assist radiologists in the diagnostic process and potentially improve patient outcomes through earlier intervention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6ec32f7ffa9ab85293a51936f3aac587394d3e236710c17fec623f0433fce6e0","category":"Interdisciplinary"}