{"title":"iPhone 15 Pro Max Likely to Start at $1,199 to $1,299, Says Analyst","link":"https://www.macrumors.com/2023/07/26/iphone-15-pro-max-price-increase-rumor/","date":1690405227000,"content":"Apple's upcoming iPhone 15 Pro models will likely be more expensive than the current models, according to Tim Long, an analyst at British bank Barclays. Long said this information is based on conversations with supply chain companies in Asia.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/07/iPhone-15-Pro-Two-Volume-Buttons-and-Titanium-Feature-Blue-Green.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIn a research note this month, obtained by <em>MacRumors</em>, Long said he expects the iPhone 15 Pro to cost up to $100 more than the iPhone 14 Pro, and the iPhone 15 Pro Max to be $100 to $200 more expensive than the iPhone 14 Pro Max. He believes pricing will remain similar for the standard iPhone 15 and iPhone 15 Plus models.\r<br />\n\r<br />\nBased on Long's estimates, pricing for the iPhone 15 lineup in the U.S. could be as follows:<ul><li><strong>iPhone 15:</strong> $799 (unchanged)</li>\r<br />\n<li><strong>iPhone 15 Plus:</strong> $899 (unchanged)</li>\r<br />\n<li><strong>iPhone 15 Pro:</strong> Up to $1,099 (vs. $999 now)</li>\r<br />\n<li><strong>iPhone 15 Pro Max:</strong> Up to $1,299 (vs. $1,099 now)</li></ul>Rumors suggest the iPhone 15 Pro Max will feature an upgraded Telephoto lens with periscope technology that <a href=\"https://www.macrumors.com/2023/04/18/iphone-15-pro-max-5-6x-optical-zoom/\">enables up to 5-6x zoom</a> without blur, compared to 3x on iPhone 14 Pro models. This feature is not expected to be available on the smaller iPhone 15 Pro this year, which could contribute to the Pro Max seeing a bigger price increase. Long believes the periscope lens will add around $50 to the iPhone 15 Pro Max's bill of materials.\r<br />\n\r<br />\nPrice estimates for future iPhones should always be treated with some skepticism, as they are merely educated guesses and are not always correct. For example, Apple analyst Ming-Chi Kuo <a href=\"https://www.macrumors.com/2022/08/10/iphone-14-pro-price-increase-kuo/\">predicted</a> price increases for the iPhone 14 Pro models last year, but the devices ended up having the same prices as the previous generation.\r<br />\n\r<br />\nApple is expected to announce the iPhone 15 lineup in September, despite reports of a temporary <a href=\"https://www.macrumors.com/2023/07/20/iphone-15-pro-display-manufacturing-issues/\">display-related manufacturing issue</a> for the Pro models. Other rumored features for the Pro models include a USB-C port, titanium frame, customizable Action button, faster A17 Bionic chip, thinner bezels around the display, Wi-Fi 6E support, increased RAM, upgraded Ultra Wideband chip, and more, so all of the new features coupled with inflationary pressures could warrant price hikes. It would be the first price increase for the high-end iPhone models since the iPhone X and iPhone XS Max, which started at $999 and $1,099, respectively. \r<br />\n\r<br />\nEarlier this week, <em>Bloomberg</em>'s Debby Wu and Takashi Mochizuki reported that Apple was <a href=\"https://www.macrumors.com/2023/07/24/apple-price-hike-iphone-15-pro-models/\">considering raising the prices of the iPhone 15 Pro models</a> by an unspecified amount, so multiple sources have reported this possibility. We'll find out for sure when Apple unveils the iPhone 15 lineup in just a few months from now.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/barclays/\">Barclays</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/26/iphone-15-pro-max-price-increase-rumor/\">iPhone 15 Pro Max Likely to Start at $1,199 to $1,299, Says Analyst</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-pro-max-likely-to-start-at-1-199-to-1-299-says-analyst.2396991/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6eca042c6521e63590e975217f532dbc005acf4b920fc7d00ae0661c3f22c232","category":"Apple"}