{"title":"‘The Bizarre Reaction to Facebook’s Decision to Get Out of the News Business in Australia’","link":"https://www.techdirt.com/articles/20210217/22383446265/bizarre-reaction-to-facebooks-decision-to-get-out-news-business-australia.shtml","date":1613706347000,"content":"\n<p>Mike Masnick, writing at Techdirt:</p>\n\n<blockquote>\n  <p>First is the link tax. This is fundamentally against the\nprinciples of an open internet. The government saying that you\ncan’t link to a news site unless you pay a tax should be seen as\ninherently problematic for a long list of reasons. At a most\nbasic level, it’s demanding payment <em>for traffic</em>. […] This is\nlike saying that not only should NBC have to run an\nadvertisement for Techdirt, but it should have to pay me for it.\nIf that seems totally nonsensical, that’s because it is. The\nlink tax makes no sense.</p>\n\n<p>And, most importantly, as any economist will tell you, taxing\nsomething doesn’t just bring in revenue, it decreases whatever you\ntax. This is why we have things like cigarette taxes and pollution\ntaxes. It’s a tool to get less of something. So, in this case,\nAustralia is saying it wants to tax links to news on Facebook, and\nFacebook responds in the exact way any reasonable economist would\npredict: it says that’s just not worth it and bans links. That’s\nnot incompatible with democracy. It’s not bringing a country to\nits knees. The country said “this is how much news links cost” and\nFacebook said “oh, that’s too expensive, so we’ll stop.”</p>\n\n<p>Contrary to the idea that this is an “attack” on journalism or\nnews in Australia, it’s not. The news still exists in Australia.\nNews companies still have websites. People can still visit those\nwebsites.</p>\n</blockquote>\n\n<p>Facebook’s doing the right thing here. Australia’s law is a bad one — it might as well have been written by Rupert Murdoch himself.</p>\n\n<div>\n<a  title=\"Permanent link to ‘‘The Bizarre Reaction to Facebook’s Decision to Get Out of the News Business in Australia’’\"  href=\"https://daringfireball.net/linked/2021/02/18/masnick-facebook-australia\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6ed6f4c6f2abf0a46f66a8bf1b453dfbf33803d74d76fc6c23eab5a203692b71","category":"Tech"}