{"title":"Silca’s new 3D-printed titanium cleats are claimed to last 4x longer than brass cleats","link":"https://www.bikeradar.com/news/silca-titanium-cleats/","date":1637082910000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/TopSection-sw_1800x1800-2771645.jpg?quality=90&amp;resize=620,413\" />                                            <p>Silca’s all-new 3D-printed titanium two-bolt mountain bike <a href=\"https://www.bikeradar.com/advice/skills/how-to-use-clipless-pedals/\" target=\"_blank\">clipless pedal</a> cleats are claimed to last four times longer than brass cleats.</p>\n<p>The $85 cleats are 3D-printed from 6Al 4V titanium using a ‘hollow’ construction, with the void left behind filled with a gyroid lattice.</p>\n<p>The key claimed advantage of titanium cleats is increased strength, with these said to be around two times stronger than stock brass cleats. This adds up to a life expectancy of around three-to-four times that of a standard brass cleat.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The void left in the cleats is filled with a gyroid lattice.</span></figcaption><span> <i>Silca</i></span></div>\n<p>Brass cleats are used on <a href=\"https://www.bikeradar.com/reviews/components/pedals/time-atac-xc-6-pedal-review/\" target=\"_blank\">Time Atac</a> and <a href=\"https://www.bikeradar.com/reviews/components/pedals/time-link-pedal-review/\" target=\"_blank\">Link</a> pedals, as well as <a href=\"https://www.bikeradar.com/reviews/components/pedals/crankbrothers-mallet-2-pedals-review/\" target=\"_blank\">Crankbrothers pedals</a>. However, the product page for the cleats does not specify how the cleats compare to stock Shimano SPD cleats – which are made from steel – in terms of longevity.</p>\n<p>We’ve asked Silca to clarify and will update this article when we have more information.</p>\n<p>The cleats are also claimed to save a modest amount of weight, with the whole titanium cleat and hardware kit claimed to shave off up to 30g compared to a stock set of steel Shimano cleats.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The cleats ship with matching titanium bolts.</span></figcaption><span> <i>Silca</i></span></div>\n<p>The titanium cleats are said to be slightly less strong than the steel retention plates used in clipless pedals. This means they are still the wear/disposable item in a typical pedal system.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The cleats are available for three common pedal systems.</span></figcaption><span> <i>Silca</i></span></div>\n<p>The cleats are available for standard two-bolt Shimano SPD systems, Crankbrothers pedals and 10-degree Time Atac pedals.</p>\n<p>Naturally, the cleats come with matching titanium hardware. Unusually, these use a T25 head (a 4mm hex head is more commonly employed on cleats), with Silca claiming these are less prone to long-term wear.</p>\n<p>The $85 cleats are said to have been tested by half a dozen athletes at the 2020 Tokyo Olympics.</p>\n<p>The cleats will ship in late November with international pricing TBA.</p>","author":"Jack Luke","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"6edf56d203983092629410aa93348249d993093aff11f3c034668ec1036f6091","category":"Cycling"}