{"title":"Apple Card Users Earned More Than $1 Billion in Daily Cash Last Year","link":"https://www.macrumors.com/2024/01/30/apple-card-1-billion-daily-cash-2023/","date":1706634238000,"content":"<a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> has over 12 million users in the United States, with card holders earning more than $1 billion in Daily Cash rewards in 2023, <a href=\"https://www.apple.com/newsroom/2024/01/apple-card-is-helping-cardholders-live-healthier-financial-lives/\">Apple said today</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/04/apple-card-feature2.jpg\" width=\"1144\" height=\"644\" />\r<br />\nDaily Cash is earned with every purchase on the ‌Apple Card‌. Apple provides 3% cash back for Apple purchases and items bought from select partners like T-Mobile, Ace Hardware, Panera Bread, Walgreens, and Uber. All <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a> purchases with ‌Apple Card‌ earn 2% cash back, and all other purchases earn 1% cash back.\r<br />\n\r<br />\nApple delivers Daily Cash rewards every day, and ‌Apple Card‌ holders can choose to have it added to the Apple Cash card or they can or opt in to having their cash deposited in the Apple Savings Account that launched last year.\r<br />\n\r<br />\nApple says that the \"vast majority\" of ‌Apple Card‌ users have opted in to having their Daily Cash auto-deposited into Savings, and nearly two-thirds of users deposit additional funds from a linked bank account. The ‌Apple Card‌ offers <a href=\"https://www.macrumors.com/2024/01/26/apple-savings-account-apy-increase/\">an APY of 4.50 percent</a> at the current time, which is <a href=\"https://www.macrumors.com/2024/01/27/apple-card-savings-interest-rate-comparison/\">on par with the high-yield savings accounts</a> from many competing financial institutions. \r<br />\n\r<br />\nAlmost 30 percent of ‌Apple Card‌ customers make two or more payments per month, and more than a million ‌Apple Card‌ users share their ‌Apple Card‌ with their Family Sharing Group. Close to 600,000 users have added spouses, partners, or another trusted adult to their ‌Apple Card‌. For those with low credit scores who are not initially approved for an ‌Apple Card‌, Apple has a \"Path to ‌Apple Card‌ Program.\" According to Apple, 200,000 users have been approved for an ‌Apple Card‌ after enrolling and following the program's personal steps.\r<br />\n\r<br />\nIt has been almost five years since the ‌Apple Card‌ launched in 2019, and ‌Apple Pay‌ VP Jennifer Bailey said that new tools and features will be coming to ‌Apple Card‌ holders \"in the year ahead and beyond.\"<blockquote>\"We designed Apple Card with users' financial health in mind, and it's rewarding to see our more than 12 million customers using its features to make healthier financial decisions,\" said Jennifer Bailey, Apple's vice president of Apple Pay and Apple Wallet. \"We're proud of what we've been able to deliver to Apple Card customers in just five years. As we look at the year ahead and beyond, we're excited to continue to innovate and invest in Apple Card's award-winning experience, and provide users with more tools and features that help them lead healthier financial lives.\"</blockquote>Though ‌Apple Card‌ is approaching its five-year launch anniversary, Apple has not managed to expand it to countries beyond the United States. \r<br />\n\r<br />\nApple's relationship with ‌Apple Card‌ provider Goldman Sachs <a href=\"https://www.macrumors.com/2023/07/25/apple-goldman-sachs-apple-card-issues/\">has also soured</a>, and reports suggest that Apple and Goldman Sachs plan to <a href=\"https://www.macrumors.com/2023/11/28/apple-goldman-sachs-partnership-ending/\">end their partnership</a> in the next 12 to 15 months. Goldman Sachs is planning to cut back on its consumer business, and the partnership with Apple will be entirely dissolved. \r<br />\n\r<br />\nApple will need to find another partner for the ‌Apple Card‌, but has said that it is focused on providing the best experience for customers. Interruptions to the ‌Apple Card‌ service are not expected, and there's as of yet no word on the financial institution that Apple might partner with to replace Goldman Sachs. The failure of the agreement between Goldman Sachs and the upcoming shift are likely to delay any behind-the-scenes plans that Apple has had to expand the ‌Apple Card‌ beyond the United States. \r<br />\n\r<br />\n<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/30/apple-card-1-billion-daily-cash-2023/\">Apple Card Users Earned More Than $1 Billion in Daily Cash Last Year</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-card-users-earned-more-than-1-billion-in-daily-cash-last-year.2417880/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6eef0bcd4d5a5bbbbbf55ce6709162284068437bd8efdaddd946f1b82874e93c","category":"Apple"}