{"title":"Mental-somatic multimorbidity in trajectories of cognitive function for middle-aged and older adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303599","date":1715695200000,"content":"<p>by Siting Chen, Corey L. Nagel, Ruotong Liu, Anda Botoseneanu, Heather G. Allore, Jason T. Newsom, Stephen Thielke, Jeffrey Kaye, Ana R. Quiñones</p>\r\nIntroduction <p>Multimorbidity may confer higher risk for cognitive decline than any single constituent disease. This study aims to identify distinct trajectories of cognitive impairment probability among middle-aged and older adults, and to assess the effect of changes in mental-somatic multimorbidity on these distinct trajectories.</p> Methods <p>Data from the Health and Retirement Study (1998–2016) were employed to estimate group-based trajectory models identifying distinct trajectories of cognitive impairment probability. Four time-varying mental-somatic multimorbidity combinations (somatic, stroke, depressive, stroke and depressive) were examined for their association with observed trajectories of cognitive impairment probability with age. Multinomial logistic regression analysis was conducted to quantify the association of sociodemographic and health-related factors with trajectory group membership.</p> Results <p>Respondents (N = 20,070) had a mean age of 61.0 years (SD = 8.7) at baseline. Three distinct cognitive trajectories were identified using group-based trajectory modelling: (1) Low risk with late-life increase (62.6%), (2) Low initial risk with rapid increase (25.7%), and (3) High risk (11.7%). For adults following along Low risk with late-life increase, the odds of cognitive impairment for stroke and depressive multimorbidity (OR:3.92, 95%CI:2.91,5.28) were nearly two times higher than either stroke multimorbidity (OR:2.06, 95%CI:1.75,2.43) or depressive multimorbidity (OR:2.03, 95%CI:1.71,2.41). The odds of cognitive impairment for stroke and depressive multimorbidity in Low initial risk with rapid increase or High risk (OR:4.31, 95%CI:3.50,5.31; OR:3.43, 95%CI:2.07,5.66, respectively) were moderately higher than stroke multimorbidity (OR:2.71, 95%CI:2.35, 3.13; OR: 3.23, 95%CI:2.16, 4.81, respectively). In the multinomial logistic regression model, non-Hispanic Black and Hispanic respondents had higher odds of being in Low initial risk with rapid increase and High risk relative to non-Hispanic White adults.</p> Conclusions <p>These findings show that depressive and stroke multimorbidity combinations have the greatest association with rapid cognitive declines and their prevention may postpone these declines, especially in socially disadvantaged and minoritized groups.</p>","author":"Siting Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6ef030e086e70c51f9b58c80690966098a49e47cd6303ef0d10b5de9eb9505fd","category":"Interdisciplinary"}