{"title":"Working as a Healthcare Professional at Island Primary Care: An Exploratory Qualitative Study in Cyclades Islands, Greece","link":"https://www.preprints.org/manuscript/202403.1796/v1","date":1711728412000,"content":"Improving the quality and access to healthcare services in rural areas is fundamental to develop sustainable healthcare systems. This research aims to explore the motivations of healthcare professionals to work and settle in rural island areas of Greece with limited access to secondary and tertiary care. The study suggests practical ways to encourage self-motivation and attract more health workers in rural areas. An exploratory qualitative research approach was employed, involving semi-structured interviews with 16 healthcare professionals working in primary care units that lack direct hospital or hospital-health center access. The research was conducted specifically in the rural islands of Cyclades. Thematic analysis was conducted to identify common themes and unique insights from the participants. The analysis revealed three thematic categories. Τhe «attraction» thematic was influenced by personal factors, random selection, origin, accommodation factors, professional factors and obligatoriness. The «recruitment» thematic was associated with understaffing, special care issues, unstable working environment, educational and organizational aspects, and insular lifestyle. The thematic of «retention» highlighted personal issues, accommodation difficulties, economic and work-related issues, and unique challenges posed by an insular lifestyle. This research provides valuable insights into the motivations that drive healthcare professionals to settle, work, and remain in remote island units, as well as the challenges they encounter in making this decision. The study proposes strategies to motivate and attract more healthcare professionals to rural areas. These findings should be considered when formulating or reviewing primary healthcare empowerment policies to ensure equitable healthcare access for all individuals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6efcab692d6965530f5d305e0ce456c1be4a03751b7c38276b9586d3ed82b375","category":"Interdisciplinary"}