{"title":"Prevalence and geographic distribution of <i>Echinococcus</i> genus in wild canids in southern Québec, Canada","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306600","date":1721052000000,"content":"<p>by Ève-Marie Lavallée-Bourget, Christopher Fernandez-Prada, Ariane Massé, Patricia Turgeon, Julie Arsenault</p>\r\n\r\n<i>Echinococcus</i> spp. is an emerging zoonotic parasite of high concern. In Canada, an increase in the number of human and animal cases diagnosed has been reported, but information regarding the parasite’s distribution in wildlife reservoir remains limited. A cross-sectional study was conducted to estimate the prevalence of wild canids infected with <i>Echinococcus</i> spp. and <i>Echinococcus multilocularis</i> in areas surrounding populated zones in Québec (Canada); to investigate the presence of areas at higher risk of infection; to evaluate potential risk factors of the infection; and as a secondary objective, to compare coproscopy and RT-PCR diagnostic tests for <i>Taenia</i> spp. and <i>Echinococcus</i> identification. From October 2020 to March 2021, fecal samples were collected from 423 coyotes (<i>Canis latrans</i>) and 284 red foxes (<i>Vulpes vulpes</i>) trapped in 12 administrative regions. Real-time PCR for molecular detection of genus <i>Echinococcus</i> spp. and species-specific <i>Echinococcus multilocularis</i> were performed. A total of 38 positive cases of <i>Echinococcus</i> spp., of which 25 were identified as <i>E</i>. <i>multilocularis</i>, were detected. Two high-risk areas of infection were identified. The prevalence of <i>Echinococcus</i> spp. was 22.7% (95% CI 11.5–37.8%) in the Montérégie centered high-risk area, 26.5% (95% CI 12.9–44.4%) in the Bas-St-Laurent high-risk area, and 3.0% (95%CI 1.8–4.7%) outside those areas. For <i>E</i>. <i>multilocularis</i>, a prevalence of 20.5% (95% CI 9.8–35.3%) was estimated in the high-risk area centered in Montérégie compared to 2.4% (95% CI 1.4–3.9%) outside. Logistic regression did not show any association of infection status with species, sex, or geolocation of capture (<i>p</i> &gt; 0.05). This study shows the circulation of <i>Echinococcus</i> in a wildlife cycle in 9/12 administrative regions of Québec.","author":"Ève-Marie Lavallée-Bourget","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6f022c3ace8d97b4900d4b626f7374abb9d423897a58e6ce371fe52ffd680b1c","category":"Interdisciplinary"}