{"title":"Apple actually has an online storefront now and it’s very crowded","link":"https://www.macworld.com/article/352583/apple-actually-has-an-online-storefront-now-and-its-very-crowded.html","date":1628048043000,"content":"<div>\n<section><div></div></section><p>We may have seen the last ‘Be Right Back.’ message on the Apple Store. After inexplicably going down late Tuesday night, the Apple Store returned with a new tab, <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/store&amp;subid1=1-1-352583-1-0-0\">a new look</a>, and a whole lot of new puns.</p>\n\n\n\n<p>While Apple has been selling products online for years, it’s never had a true storefront that encouraged browsing. Products still have to buy links that go to dedicated sections of the store, but you no longer need to jump through hoops or search for a specific product to browse its digital shelves. The leftmost tab next to the Apple logo now says “Store,” and clicking it brings you to what Apple describes as “The best way to buy the products you love.” </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-store-down.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Will Apple still need to shut down the entire store to add something new?</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>It certainly is a better experience. The front page of the store is filled with links to Apple’s family of products as well as a series of cards advertising the latest stuff with clever slogans like “Stick Out” (MagSafe), “Blast Past Fast” (iPhone 12), and “A world of winning looks” (Apple Watch International Collection bands). You can still find products the old way, but the new design is more likely to encourage impulse buying. For example, the AirTag is spotlighted as well as the HomePod mini.</p>\n\n\n\n<p>The look is fairly busy with numerous rows of cards and clickable elements, but it encourages browsing like the iOS app. And it’s possible that Apple might not need to take the store down for hours every time it needs to add a new product, a strange quirk that has is endearing to Apple fans and confounding to anyone looking to buy a product during shutdown times.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6f060c3f3aedd6e3678817d72ca92aafb4861f1e36a06c53df0e6b77cdae88bc","category":"Apple"}