{"title":"The function of red and banded patterns in snakes: the eyes of the beholders—also, the function of bands in fish","link":"https://academic.oup.com/biolinnean/article/142/4/452/7465249?rss=1","date":1702080000000,"content":"<span><div>Abstract</div>The functions of bright bands in coral and other snakes have long been a puzzle. A common opinion is that coral snakes display aposematic marks and that other red and black banded snakes in the Americas are mimics of coral snakes. In two previous reviews, I challenged this prevailing opinion and showed that red and bands are probably defensive against snake predators. Here, I offer a plausible mechanisms through which red and bands could be protective against ophidian predators: the function of bands is to interfere with the focusing ability of snakes, which eyes, as in fish, rely on a ball lens that moves back and forth, a peculiarity among terrestrial vertebrates. Simulations show how the spherical aberrations created by ball lenses produce local maxima in contrast when out of focus, which would feel in focus. I conjecture that red targets specific visual receptors in snakes active in low light: these receptors would have a slow and saturating response. This conjecture is justified by the lability of vision in snakes and the overabundance of red light in dim light. Those conjectures allow precise and well-respected predictions and credibly explain a wide range of observations, such as the geographical repartition of tricolour snakes, the evolution of triadal patterns, the evolution of specific triadal-like patterns in some <span>Erythrolamprus</span>, and the repeated evolution of black and white banded snakes with a red dorsal line. Fish eyes have similar optics, and the function of the ubiquitous fish bands could likewise be to interfere with the vision of predators.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"6f09e770354f72ba57fdd3b56e370946a820805dacbd24fe1d80ca6c8134ee25","category":"Environment"}