{"title":"Local Testing A Serverless API (API Gateway And Lambda)","link":"https://smashingmagazine.com/2021/10/local-testing-serverless-api-gateway-lambda/","date":1633428000000,"content":"<p>This article is for anyone struggling with testing cloud services locally, and specifically for people wanting to locally test an API that uses API Gateway and Lambda, with the Serverless framework, on AWS. I was once in desperate need of this knowledge, and my co-worker Joseph Jaffe helped me put this solution into place.</p>\n<p>A very popular and quick API solution is using Serverless along with API Gateway and Lambda. If you have never done this before, you can <a href=\"https://www.serverless.com/blog/node-rest-api-with-serverless-lambda-and-dynamodb\">read more about it here</a>. If you already have experience, and are looking for creative ways to locally test, then keep reading. Bonus if you like 🌮🌮!</p>\nThe Problem\n<p>When setting up an API using the Serverless framework, there are important choices to make. Some are <em>extremely</em> important: they can make your life much easier as you build your API, or cause you huge headaches in the future. For instance, when I first started my API, I was setting up each endpoint in its own Serverless project folder. Thus each endpoint had unique URLs. This is bad practice for an API solution that needs one base URL with multiple service points. We changed the solution to have all endpoints in the same Serverless project, and that allowed us to use one extra handy aspect of Lambda — layers. Lambda layers are a way to share code across API endpoints, reducing the amount of repeated code across the API project. You can read <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/configuration-layers.html\">more about Lambda Layers here</a>, but I digress. Let’s get back to the problem: local testing!</p>\n<p>When you create a new API endpoint, you must deploy the entire API to include the new resource in API Gateway and get the URL for it. Once you have done that, you can deploy individual resources. </p>\n<p>Deploying for Serverless takes time. Lots of time. For instance, see these average deploy times for one of our last projects:</p>\n<ul>\n<li>Deploying a single endpoint: <strong>~7 seconds</strong> 🙂</li>\n<li>Deploying full API (~12 resources): <strong>~24 seconds</strong> 😔</li>\n<li>Deploying Layers (2 layers): <strong>~32 seconds</strong> 💀</li>\n</ul>\n\n<p>While these times don’t appear too bad at first glance, imagine trying to quickly and iteratively test out changes in your API. Having each deploy over 1 minute long is a huge time-hog and will kill your momentum. Stretch this over weeks of development and you will see why we all need a solution to test Lambda functions locally.</p>\nOur Solution\n<p>In order to quickly flush out the obvious errors, we require local testing. In order to test locally, we found that <code>serverless invoke local</code> allows us to do this in the simplest manner. This not only allows us to run Lambda scripts locally, but we can also add breakpoints using Debug Mode in Visual Studio Code. If you have never played with it, <a href=\"https://code.visualstudio.com/docs/editor/debugging\">Debug Mode in VSC is really helpful</a>.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/135f2786-8e9d-482a-9143-69cce0fcc0bc/1-local-testing-serverless-api-gateway-lambda.png\" /></p>\n<p>The most important aspect of local testing is instant feedback. No more waiting around for layers, functions or entire APIs to deploy! Tons of time saved during the initial build and your (patience as well as your) Program Director will love you for it!</p>\n<h3>Data</h3>\n<p>The last Serverless API project we worked on stored all the data in JSON files hosted on AWS S3 buckets. You may be reading the data from a database, so you need to make sure you can still access the data while running locally. One way would be to set up the database locally on your machine. Ultimately, every project is unique and requires you to think creatively for a solution that meets your needs.</p>\n<h3>Environment Variables</h3>\n<p>In order for us to know if we are running locally or not, we created an environment variable to pass in through our local invocation. The variable is named <code>LOCAL_DEV</code> and is used to check if we should be loading the data from S3 or from a local file system folder, like so:</p>\n<pre><code>const data = \n  process.env.LOCAL_DEV === \"true\"\n  ? require(`./data/tacos.json`)\n  : //handle loading/setting the data as you regularly would</code></pre>\n\n<p>Note above that the boolean value of true is in quotes. Environment variables always come through as strings, so be ready to handle this fact of life.</p>\n<p>We have a snapshot of the data stored on S3 on our local computers, so when we are in local development mode, we use that local data in order to run and test the code locally.</p>\n<p>Additionally, if you are using layers in Lambda, you will need to point directly to the code as opposed to referring to it by name, at the top of your Lambda file:</p>\n<pre><code>const apiCommon = process.env.LOCAL_DEV === \"true\"\n? require(\"../layers/apicommon/nodejs/node_modules/apicommon/index\")\n: require(\"apicommon\");</code></pre>\n\n<h3>Local Invocation</h3>\n<p>Once you have all code in place to allow the Lambda function to run successfully locally, then you can try invoking the function. Here is an example invocation of an endpoint called tacos (🌮🌮) that gets all tacos from a food API. Because I ❤️ 🌮🌮. <a href=\"https://github.com/thirteen23/tacos-are-the-best\">Code for this example can found on Github</a>.</p>\n<p>This is copied and pasted from a command shortcut I defined in my <code>package.json</code> file. That command requires you to put literal <code>\\</code> markers in front of all quotes. Here is that command from <strong><code>package.json</code></strong> in its entirety:</p>\n<pre><code>\"scripts\": {\n\"local-tacos\": \"serverless invoke local --function tacos --data '{ \\\"queryStringParameters\\\": {\\\"type\\\": \\\"breakfast\\\", \\\"filling1\\\": \\\"egg\\\", \\\"filling2\\\": \\\"bacon\\\", \\\"filling3\\\": \\\"cheese\\\", \\\"tortilla\\\": \\\"flour\\\", \\\"salsa\\\": \\\"Salsa Doña\\\"}}' -e LOCAL_DEV=true &gt; output.json\"\n}</code></pre>\n\n<p>Ok, now let’s look at this command and what each part does. I am removing all of the literal markers for easier readability.</p>\n<pre><code>serverless invoke local --function tacos --data '{ \"queryStringParameters\": {\"type\": \"breakfast\", \"filling1\": \"egg\", \"filling2\": \"bacon\", \"filling3\": \"cheese\", \"tortilla\": \"flour\", \"salsa\": \"Salsa Doña\"}}' -e LOCAL_DEV=true &gt; output.json</code></pre>\n\n<p>First, the base part:</p>\n<pre><code>serverless invoke local --function tacos</code></pre>\n\n<p>The item above says to locally invoke the API endpoint \"tacos\" (local 🌮🌮 are the best, right?) which gets a set of tacos filtered by whatever query string parameters you send it. Next, let’s look at the second part.</p>\n<pre><code>--data '{ \"queryStringParameters\": {\"type\": \"breakfast\", \"filling1\": \"egg\", \"filling2\": \"bacon\", \"filling3\": \"cheese\", \"tortilla\": \"flour\", \"salsa\": \"Salsa Doña\"}}'</code></pre>\n\n<p>Here is where we can define whatever query string parameters we are passing into the API endpoint. For this example, we pass into the API endpoint all the attributes that describe the taco(s) we are looking for. In our case, we are looking for egg, bacon and cheese tacos on a flour tortilla with Salsa Doña.</p>\n<p><strong>Note</strong>: <em>Any guess as to where the taco described above (with Salsa Doña) can be found in Austin, Texas, USA? If you know, please respond in the comments!</em> </p>\n<p>If you need to test a bunch of parameters, you could save them out in a testing/query.json file(s) so you could do something like:</p>\n<pre><code>yarn local-taco query-success yarn local-taco query-fail</code></pre>\n\n<p>This could be a good start for an <a href=\"https://www.serverless.com/blog/how-test-serverless-applications\">API testing environment</a>!</p>\n<p>The third part of the call is for defining any environment variables.</p>\n<pre><code>-e LOCAL_DEV=true</code></pre>\n\n<p>This tells our Lambda code very clearly we are running this function locally and to make sure and prepare for that by pulling all resources in locally as well.</p>\n<p>Last, I pipe the results into a JSON file.</p>\n<pre><code>&gt; output.json</code></pre>\n\n<p>From here I can easily verify if the results are correct or if an error was thrown.</p>\nConclusion\n<p>That sums it up! If you didn’t see the link earlier, I have a <a href=\"https://github.com/thirteen23/tacos-are-the-best\">sample project written up</a> that you can try on your own, using the Serverless framework, the AWS services API Gateway, and Lambda.</p>\n<p>Also, if you have ideas on how to make this solution better, or other alternative solutions, I would love to hear about your feedback/tips/experiences in the comments below.</p>\n<h3>Further Reading On Smashing Magazine</h3>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2021/09/orchestrating-complexity-web-animations-api/\">Orchestrating Complexity With Web Animations API</a>, Kirill Myshkin</li>\n<li><a href=\"https://www.smashingmagazine.com/2021/03/choosing-new-serverless-database-technology-agency/\">Choosing A New Serverless Database Technology At An Agency (Case Study)</a>, Michael Rispoli</li>\n<li><a href=\"https://www.smashingmagazine.com/2021/07/gatsby-serverless-functions-international-space-station/\">Gatsby Serverless Functions And The International Space Station</a>, Paul Scanlon</li>\n<li><a href=\"https://www.smashingmagazine.com/2021/04/flaky-tests-living-nightmare/\">Flaky Tests: Getting Rid Of A Living Nightmare In Testing</a>, Ramona Schwering</li>\n</ul>\n<p>🎧 <strong>Bonus</strong>: <a href=\"https://www.smashingmagazine.com/2020/08/smashing-podcast-episode-22/\">Smashing Podcast Episode 22 With Chris Coyier: What Is Serverless?</a> (moderated by Drew McLellan)</p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"6f0df6208229f4cc970e1f8227e6f0458ac42a2a6f5e6791de8735bee0c28943","category":"Tech"}