{"title":"The Brits riding the 2023 Giro d’Italia","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-brits-riding-the-2023-giro-d-italia","date":1683204065000,"content":"\n      <p><span>Out of the 176 riders who will be making their way to Italy to fight for <em>maglia rosa </em>in 2023, eight of them are British, and will be flying the Union flag for those back on home soil. With this in mind, those watching from the UK should have plenty to cheer about when watching the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> from home. </span></p>\n<div></div>\n<p>British team Ineos Grenadiers unsurprisingly have the most British riders taking to the Italian roads, including former Tour de France winner Geraint Thomas and 2020 Giro winner Tao Geoghegan Hart, who are both hoping to secure strong spots in the general classification. There are also a number of Brits who could contest stage wins and get in breakaways, as well as find themselves up front for bunch sprints, like Mark Cavendish of Astana Qazaqstan and Hugh Carthy of EF Education-EasyPost. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-2023-the-general-classification-favourites\"><strong><em>Read more: Giro d’Italia 2023: The general classification favourites</em></strong></a></p>\n<p><span>Here’s a list of all the British riders competing in the 2023 Giro, their strengths, and how we can expect them to make their mark throughout the three-week event.</span></p>\n<h3><b>Geraint Thomas, Ineos Grenadiers</b></h3>\n<h3><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1409902087.jpg?v=1681733233\" alt=\"Geraint Thomas at the 2022 Tour de France\" /></b></h3>\n<p><em><span>Geraint Thomas came third in last year's Tour de France, proving he still has the strength and stamina for the brutal parcours of a Grand Tour (Image by Getty Images)</span></em></p>\n<p>Geraint Thomas is one of the most versatile and well-loved riders in the peloton at the moment. With 13 years of experience in the WorldTour, he has raced a total of 17 Grand Tours – in three of which he has secured a podium place. Despite being one of the older riders in the peloton, last year he came third in the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> behind Jonas Vingegaard and Tadej Pogačar, both who are 10 years younger than Thomas. However, he has never had quite the same success in the Giro d'Italia, and has been forced out of his last two GC bids there in unusual circumstances.</p>\n<p>He’ll be going into this year’s Giro as one of Ineos Grenadiers' best time trialists, a skill that’ll prove a major benefit thanks to the increased number of TTs in this year's Giro. <span>Thomas will be hoping for third time lucky, but he has admitted that if someone from his team is riding better than him, he’ll be more than willing to provide a supporting role. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/a-history-of-unfinished-business-at-the-giro-d-italia-will-2023-be-the-year-things-go-right-for-geraint-thomas\"><em><strong>Read more: A history of unfinished business at the Giro d'Italia - Will 2023 be the year things go right for Geraint Thomas?</strong></em></a></p>\n<h3><b>Tao Geoghegan Hart, Ineos Grenadiers </b></h3>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032639-083_e25d7dab-4c25-41b8-825c-da38b5c434ee.jpg?v=1681733519\" alt=\"Tao winning the 2020 Giro \" /></b></p>\n<p><span><em>Tao Geoghegan Hart won the 2020 Giro d'Italia after Geraint Thomas crashed out early on in the race (Image by Getty Images)</em></span></p>\n<p><span>The 2020 Giro d’Italia winner will be back on the start for the 106th edition, looking to prove he can once again win a Grand Tour title. Since his win in 2020, he has raced the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> and the Tour de France in a support role, but now makes his return to the Italian roads. The 28-year-rider has displayed a solid start to the season with a third-place finish at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a> and Volta a la Comunitat Valenciana, where he also secured a long-awaited win since the 2020 Giro. He is a rider who has proved he can climb as well as perform well in a time trial, the perfect combination for this year’s Giro. The Tour of the Alps is considered an ideal Giro warm-up and Geoghegan Hart dominated the race, taking the overall win – a huge boost in confidence going into the Giro. </span><span>With this in mind, he’ll most likely be going into the race as Ineos Grenadiers' main GC contender. </span></p>\n<h3><b>Mark Cavendish, Astana Qazaqstan Team </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-05247.jpg?v=1681734042\" alt=\"Mark Cavendish came third at Scheldeprijs \" /></span><em><span>Mark Cavendish secured third place at this year's Scheldeprijs (Image by SWPix.com)</span></em></p>\n<p><span>Out of all the British riders taking to the start line of this year’s Giro, Mark Cavendish has had some of the best results at the race in the past, winning the points classification title alongside 16 stage wins and 28 top-10 finishes. While his main focus for 2023 is to secure the 35th Tour de France stage win, surpassing Eddy Merckx's tally, Cavendish will be using the Giro to find a much needed win ahead of the Tour. </span></p>\n<p><span>The British national champion has put in a lot of work so far this season with his new Astana Qazaqstan, and while we have only seen him standing on a podium twice so far, he has raced the most kilometres this year out of all the British riders at the Giro. Whether this will be a blessing or a curse, we are yet to find out, but there will be plenty of opportunities for this sprinter to bag a stage, especially in the first week. </span></p>\n<h3><b>Hugh Carthy, EF Education-EasyPost</b></h3>\n<p><em><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FD7A0948.jpg?v=1681734388\" alt=\"Hugh Cathy at the 2022 Giro d'Italia\" /></b></em></p>\n<p><em><span>Hugh Carthy during stage 20 of the Giro d'Italia last year. He came eight overall on this stage from Belluno to Marmolada (Image by SWPix.com)</span></em></p>\n<p><span>A strong and consistent climber, Hugh Carthy will be at home in the Alps, Apennines and Dolomites during the Giro, having proven he can go all in on any climb. Last year, Carthy came ninth in the overall GC classification and took a respectable 15th in the mountains classification. The year before in 2021 he had another top-10 finish, coming eighth overall. His best Grand Tour result was in 2020 at the Vuelta a España, where he placed third and won a brutal summit finish stage up the Angliru. However, since 2020, he has yet to secure another podium position. EF Education-EasyPost have confirmed he will line up with teammate Rigoberto Urán as joint leader for the American team, with the outright leader decided as the race plays out. Nevertheless, Carthy will be looking to better his recent results and step back onto that podium. </span></p>\n<h3><b>Ben Swift, Ineos Grenadiers </b></h3>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Tirreno_887.jpg?v=1681735833\" alt /></b></p>\n<p><em>Ben Swift riding Tirreno-Adriatico last year in Italy (Image by SWPix.com)</em></p>\n<p>A senior member of the Ineos Grenadiers team, Ben Swift will be going into his fifth Giro d'Italia. He is one of the teams more experienced riders and has helped many succeed at various races. He is going into this year's Giro with the aim of helping his team win their first Grand Tour title since 2021 and will be supporting their GC leader throughout the three weeks. However, he has proven he is capable of podium finishes himself with two second place stages at the Giro and the Vuelta a España, and a two podium finishes at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a>. </p>\n<h3>Jake Stewart, Groupama-FDJ</h3>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-03001.jpg?v=1683109310\" alt=\"Jake Stewart\" /><em>This will be Jake Stewart's Giro d'Italia debut (Image by SWPix.com)</em></p>\n<p>This will be Jake Stewart's debut at the Giro, having only previously raced in the Vuelta last year. However, the Groupama-FDJ rider was taken ill during the Spanish Grand Tour and was forced to abandon the race after stage seven. Just 23 years old, Stewart was showing promising results in his first Grand Tour with three top-10 finishes, following this up with an eighth overall at the 2022 edition of the Tour of Britain. His breakthrough was in 2021 when he secured second place at Omloop Het Nieuwsblad, but since then he has had a rollercoaster journey suffering from illness. So far this year, Stewart hasn't had the most noteworthy start, but he'll be looking to prove people wrong when he lines up for his second Grand Tour – with the hopes of seeing it through the whole three weeks. </p>\n<h3>Stephen Williams, Israel-Premier Tech</h3>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1402851981.jpg?v=1683192327\" alt /><em>Stephen Williams wore the Tour de Suisse leaders jersey after his stage one win (Image by Getty Images)</em></p>\n<p>Stephen Williams is another Brit making his debut at this year's Giro d'Italia. This is also his first year with Israel-Premier Tech after moving from his former team Bahrain-Victorious. Williams took his first WorldTour victory last year at the Tour de Suisse, beating a strong field to the line on stage one. However, since then, the British rider hasn't been able to secure any podium finishes. He's a punchy climber and will be able to tackle the gruelling climbs in this year's route, so we will probably see him support some of the team's more experienced leaders. But if the right stage comes his way, we wouldn't be surprised if he placed in the top 10 or even on a stage podium.</p>\n<h3>Charlie Quarterman, Team Corratec - Selle Italia</h3>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1344928694.jpg?v=1683201581\" alt=\"Charlie Quarterman\" /></p>\n<p><em>Quarterman will make his Grand Tour debut at the 2023 Giro (Getty Images)</em></p>\n<p>At the age of 24, this will be Charlie Quarterman's first-ever Grand Tour appearance. In fact, it's a remarkable turnaround for the Oxford-born rider after spending a year as an amateur in 2022 having been dropped by Trek-Segafredo in 2021.</p>\n<p>A strong time trialist, Quarterman will be his Corratec team's best chance at top result in the Giro's three races against the clock. A former under-23 British national champion, he also finished fifth in last year's senior time trial.</p>\n<p>Like the rest of his teammates, you can expect to see Quarterman attempting to get into the breakaways and show off the wildcard team's sponsors as much as possible before the stage favourites kick into action.</p>\n<p><em>Cover image by Zac Williams/SWPix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6f1a2372554463c998d1aff4bf4eb499652ee614367341a2833cb194b4868cc0","category":"Cycling"}