{"title":"Unleashing Nature&rsquo;s Allies: Analysing Vertical Transmission Dynamics of Insect-Specific Flaviviruses in Mosquitoes","link":"https://www.preprints.org/manuscript/202408.1313/v1","date":1724145842000,"content":"Insect-specific viruses (ISVs) include viruses that are restricted to the infection of mosquitoes and are spread mostly through transovarial transmission. Despite using a distinct mode of transmission, ISVs are often closely related to arthropod-borne viruses (arboviruses) that are responsible for human diseases and able to infect both mosquitoes and vertebrates. ISVs can also induce a phenomenon called “superinfection exclusion”, whereby a primary ISV infection in an insect inhibits subsequent viral infections of the insect. This has sparked interest in the use of ISVs for the control of pathogenic arboviruses transmitted by mosquitoes. In particular, insect-specific flaviviruses (ISF) have been shown to inhibit infection of vertebrate-infecting flaviviruses (VIFs) both in vitro and in vivo. This has shown potential as a new and ecologically friendly biological approach to the control of arboviral disease. For this intervention to have lasting impacts for biological control, it is imperative that ISFs are maintained in mosquito populations with high rates of vertical transmission. Therefore, these strategies will need to optimize vertical transmission of ISFs in order to establish persistently infected mosquito lines for sustainable arbovirus control. This review compares recent observations of vertical transmission of arboviral and insect-specific flaviviruses and potential determinants of transovarial transmission rates to understand how the vertical transmission of ISFs may be optimised for effective arboviral control.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f1e54f16fc06190c36f1ecbce4fa555961883f9e8316d8cf6060485ade761fb","category":"Interdisciplinary"}