{"title":"Study based on metabolomics and network pharmacology to explore the mechanism of Ginseng‐Douch compound fermentation products in the treatment of hyperlipidemia","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13858?af=R","date":1726144454000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Ginseng-Douchi (GD) is a complex fermented product of ginseng and soybean, similar to natto, and is effective in the treatment of hyperlipidemia, but the mechanism of action involved needs to be further explored.</p>\n<h2>RESULTS</h2>\n<p>The present study combines a comprehensive strategy of network pharmacology and metabolomics to explore the lipid-lowering mechanism of GD. First, a hyperlipidemia rats model induced by a high-fat diet was established to evaluate the therapeutic effects of GD. Second, potential biomarkers were identified using serum metabolomics and metabolic pathway analysis was performed with MetaboAnalyst. Third, network pharmacology is used to find potential therapeutic targets based on the blood-influencing components of GD. Finally, core targets were obtained through a target–metabolite and the enrichment analysis of biomarkers–genes. Biochemistry analysis showed that GD exerted hypolipidemic effects on hyperlipidemic rats. Nineteen potential biomarkers for the GD treatment of hyperlipidemia were identified by metabolomics, which was mainly involved in linoleic acid metabolism, glycerophospholipid metabolism, ether lipid metabolism, alpha-linolenic acid metabolism and glycosylphosphatidylinositol-anchor biosynthesis. GD had a callback function for ether lipid metabolism and glycerophospholipid metabolism pathways. Eighteen blood components were identified in serum, associated with 85 potential therapeutic targets. The joint analysis showed that three core therapeutic targets were regulated by GD, including PIK3CA, AKT1 and EGFR.</p>\n<h2>CONCLUSION</h2>\n<p>This study combines serum medicinal chemistry of traditional Chinese medicine, network pharmacology and metabolomics to reveal the regulatory mechanism of GD on hyperlipidemia. © 2024 Society of Chemical Industry.</p>","author":"Jianfeng Sun, \nWenting Dong, \nYuanyuan Zhao, \nGuodong Sun, \nLiyan Chen, \nJinhai Huo, \nWeiming Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6f206ea193e5ffda2c3cc38beda96177bf35b8f2d15fef11413ade56d27c7a83","category":"Environment"}