{"title":"Cyclist’s 31 Inspirational Women No6: Teniel Campbell","link":"https://www.cyclist.co.uk/sponsored/9296/cyclist-s-31-inspirational-women-no6-teniel-campbell","date":1614710498000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-06T15:51:00+00:00\">6 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nThe first black female rider to race for a Women&#039;s WorldTeam team</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/teniel_campbell.jpg?itok=81lchI79\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David</p>\n<p>Teniel Campbell made history recently by becoming the first black female to race for a Women’s WorldTeam. The 23-year-old Team BikeExchange rider may have placed only 91<sup>st</sup> at Omloop Het Nieuwsblad, but it nonetheless represented another groundbreaking milestone for Teniel, who has come a long way from her upbringing in Trinidad and Tobago.</p>\n<p>Her journey to the sharp end of the women’s pro peloton began back in Trinidad when she took up cycling as a way to pass the time while watching her mum play netball. Teniel recalls:</p>\n<p>‘My brother Akil and I would get bored to death watching mum play netball. The cycling track was nearby, so we went over there and spoke to the coach to relieve the boredom.</p>\n<p>‘He said we were welcome to come over whenever we wanted and this is how it all started.</p>\n<blockquote><p>I never paid attention to my skin colour, or anyone else’s. For me, it is important that someone sees my potential and not the colour of my skin</p></blockquote>\n<p>‘As my brother and I improved we started taking part in races. My dad, who lives in the US, was also a cyclist, so when he would come to Trinidad for the Easter Grand Prix we would all be racing together.</p>\n<p>‘It was my brother who inspired me – he was “that guy”. I really loved his grit and determination and I used to think, “I must drop and beat him one day!”</p>\n<p>‘I had a golden opportunity in 2017 when Desmond Roberts [the manager of her team at the time, Perfection Services Limited Cycling Club], paid for me to travel to Martinique for the Caribbean Cycling Championships.</p>\n<p>‘While I was there I met UCI president David Lappartient after I won double gold, and he was very impressed, and invited me to the UCI Training Centre in Switzerland, where my coach was Alejandro Gonzalez-Tablas.</p>\n<p>‘My time there was then extended, and I joined the UCI’s continental team. I was heartbroken when Alejandro moved to Mitchelton-Scott (now Team BikeExchange).</p>\n<p>‘I never paid attention to my skin colour, or anyone else’s. For me, it is important that someone sees my potential and not the colour of my skin. But I do remember arriving at my first professional races in Norway and noticing from people’s facial reactions how surprised they were to see me.</p>\n<p>‘I got totally dropped in the race, but I was welcomed by the women in the peloton. Chloe Hosking and Annemiek van Vleuten sent me messages of encouragement, saying they admired my determination.’</p>\n<p>Teniel then signed with the Italian team Valcar Travel &amp; Service for 2020. She moved to Bergamo in Italy, but just a few months later her life was turned upside down when she found herself at ground zero when the coronavirus pandemic starting to sweep across Italy and the rest of Europe.</p>\n<p>‘Dealing with the pandemic was difficult,’ she says. ‘How I survived it was to really switch my brain off. It was really hard hearing the ambulances going up and down and church bells ringing at all hours. The only people I saw were when I was in the supermarket once a week, so it was really challenging.</p>\n<p>‘After two weeks I just stopped thinking. I didn’t think about the Olympics being postponed, races, nothing. I just kept pedalling on Zwift. If you let the mind stray it’s not going to make it any easier. So I just switched off.’</p>\n<p>After such a difficult year, 2021 represents a fresh challenge for Teniel. She has signed a two-year contract with Team BikeExchange, making the step up to the Women’s WorldTour and reuniting with Gonzalez-Tablas, who is now a sports director for the women’s team.</p>\n<p><strong>Find the rest of <a href=\"/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em></a> here</strong></p>\n<p>‘When I discovered I was going to work with Alejandro again I was really excited. I am looking forward to the season and to seeing if I can discover my capabilities because I always remember him telling me during the first year at the world cycling centre that I don’t know how much I am capable of.</p>\n<p>‘So to be here with him again, I hope to discover my engine more, and my characteristics as a rider. I am really comfortable with Alejandro as my coach because he knows me.</p>\n<p>‘I have a lot of mantras and mottos to motivate me. My favourite is from Thomas Jefferson: “Nothing can stop the man with the right mental attitude from achieving his goal and nothing on earth can help the man with the wrong mental attitude.’</p>\n<p>‘Everything is mostly mental – what you tell yourself is what you’ll get. The more I get the more I realise how true that is.’</p>\n<p><strong>For more from Zwift this International Women's Month</strong>, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5632488679&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"6f244a12a8a4726c1cbedccb1a37bedf7d3e0a72585a147eaeb5224415448a6e","category":"Cycling"}