{"title":"The impact of boldness on demographic rates and life‐history outcomes in the wandering albatross","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2656.14077?af=R","date":1711363214000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9219929b-1941-43de-8c4d-d5e3a0a7c2a9/jane14077-toc-0001-m.png\" alt=\"The impact of boldness on demographic rates and life-history outcomes in the wandering albatross\" />\n<p>There is an ongoing debate about the role of animal personality in shaping life-history differences between individuals. A comprehensive approach, based on a suite of demographic tools and considering all aspects of the life cycle offers great potential to unveil patterns of personality-mediated differences in wild animal populations. Credit: Julien Collet.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDifferences among individuals within a population are ubiquitous. Those differences are known to affect the entire life cycle with important consequences for all demographic rates and outcomes. One source of among-individual phenotypic variation that has received little attention from a demographic perspective is animal personality, which is defined as consistent and heritable behavioural differences between individuals. While many studies have shown that individual variation in individual personality can generate individual differences in survival and reproductive rates, the impact of personality on all demographic rates and outcomes remains to be assessed empirically.\n\nHere, we used a unique, long-term, dataset coupling demography and personality of wandering albatross (<i>Diomedea exulans</i>) in the Crozet Archipelago and a comprehensive analysis based on a suite of approaches (capture-mark-recapture statistical models, Markov chains models and structured matrix population models). We assessed the effect of boldness on annual demographic rates (survival, breeding probability, breeding success), life-history outcomes (life expectancy, lifetime reproductive outcome, occupancy times), and an integrative demographic outcome (population growth rate).\n\nWe found that boldness had little impact on female demographic rates, but was very likely associated with lower breeding probabilities in males. By integrating the effects of boldness over the entire life cycle, we found that bolder males had slightly lower lifetime reproductive success compared to shyer males. Indeed, bolder males spent a greater proportion of their lifetime as non-breeders, which suggests longer inter-breeding intervals due to higher reproductive allocation.\n\nOur results reveal that the link between boldness and demography is more complex than anticipated by the pace-of-life literature and highlight the importance of considering the entire life cycle with a comprehensive approach when assessing the role of personality on individual performance and demography.\n</p>","author":"Joanie Van de Walle, \nRuijiao Sun, \nRémi Fay, \nSamantha C. Patrick, \nChristophe Barbraud, \nKarine Delord, \nHenri Weimerkirch, \nStephanie Jenouvrier","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"6f249a1a5714199ec3a2ed91f0786eadf93b0ad67f5805f5eda6fa0e0f78bae2","category":"Environment"}