{"title":"A Mountain Biker’s Gravel Bike: Gustav “Dangerholm” and His Scott Scale 910 Rigid Gravel MTB – Gustav Gullholm","link":"https://theradavist.com/2021/07/a-mountain-bikers-gravel-bike-gustav-dangerholm-and-his-scott-scale-910-rigid-gravel-mtb/?utm_source=rss&utm_medium=rss&utm_campaign=a-mountain-bikers-gravel-bike-gustav-dangerholm-and-his-scott-scale-910-rigid-gravel-mtb","date":1625659228000,"content":"<p><b>Concept: </b><em>A mountain biker’s gravel bike.</em></p>\n<p>With gravel biking being all the rage these days, most brands have a model or five in their portfolio and they’re widely popular because of their adventurous versatility. Of course, they come in many shapes, from retro single-speed steel works of art to full-on aero bikes. But with their drop bars, most modern gravel bikes in general clearly take on a road cyclist approach.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7556.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Coming from a mountain bike background you’re used to flat bars and wide tires, and I’m surely not alone in having spent a ton of time just riding gravel on hardtail mountain bikes. So I decided to push it a little further in that direction, with a gravel dedicated MTB.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7757.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Honestly, it all started with having a crankset leftover from another build, and it all escalated from there. Modest plans turned into very ambitious plans, I never seem to learn!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7707.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>So in addition to going for a fast and fun riding bike, I also ended up going all-in with the looks. Integrated brake hoses, custom AXS controller setup, and a paint job not easily missed.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7626.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Looks:</b></p>\n<p>One of the best parts of this project was that the rigid fork allowed me to level up a bit when it comes to both integration and paint scheme. A smooth transition between the fork crown and head tube gives a very clean canvas compared to stanchions and stuff when running a suspension fork.</p>\n<p>It also made it a bit easier with the front brake hose routing, even though I didn’t manage to go full road/gravel style and run it inside the fork leg. Gotta leave something for next time!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7713.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7667.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Except for being a gravel bike, it will also be my winter training bike. I gave my old winter bike a very bright 90’s Klein paint job, just to cheer things up a bit during the long and dark Swedish winter, and decided to continue keeping things bright.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7556.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The yellow is a heavy metallic that shifts a lot depending on the light, and truly comes alive in sunshine. To keep things a bit interesting I came up with a stripe-fade design and no it wasn’t a lot of fun to mask haha.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7724.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7717.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>A big and quite difficult decision was to paint the Bike Ahead Composites wheels. Exclusive, lightweight and expensive – these are works of art in their raw carbon finish already. But no one remembers a coward so I kinda just went for it.</p>\n<p>And in the end, I’m very happy that I did, since it added so much to the two-tone look of the bike.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7607.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As icing on the cake, there’s the optional (and of course color-matched) front rack, for when you feel like going on stupid long rides or need to transport your favorite beverages.</p>\n<div>\n<a href=\"https://radavist-static-production.s3.amazonaws.com/uploads/2021/07/FB-No-Logo.mp4\">https://radavist-static-production.s3.amazonaws.com/uploads/2021/07/FB-No-Logo.mp4</a></div>\n<p><b>Highlights:</b></p>\n<p><b>Brake integration: </b>The Syncros Fraser iC SL bars have been modified and reinforced to allow for internal routing. Together with the Trickstuff Piccola Carbon brakes with banjo couplings designed specifically for this purpose, it makes for one of the cleanest looking front ends ever seen on a mountain bike. Along with a customized steerer tube as well as a steering stop, the hoses then continue to the brake calipers.</p>\n<p><b>Stealth AXS controllers:</b> This custom setup uses the Zirbel Twister WE01 controllers as a base. They’re essentially a mix between triggers and gripshift, with a “shifter ring” that rotates in either direction to actuate the derailleur or dropper. Small but strong magnets give them a very tactile feel, and they’re honestly the best and most ergonomic shifter solution I’ve ever tried for flatbars (and I’ve run everything from hydraulic to electronic). One cool feature is that the rings can be 3D printed, so you can get them in any size or shape you want.</p>\n<p><b>Stealth electronics: </b>The AXS circuit boards are hidden inside the handlebars, and with a larger than standard battery they’re expected to last 5-8 years. To pair/adjust components you simply remove the bar end plug, pull the board out and hit the now very small button. But once setup you shouldn’t have to touch them for a very long time.</p>\n<p><b>Streamlined frame: </b>The frame is a Scott Scale 910, essentially the entry-level but good value option. Stock it comes with both front derailleur mount and plenty of cable ports, all of which have been removed/reinforced/refinished for a perfectly clean looking frame.</p>\n<p><b>Dual seat combos:</b> For maximum lightweight and cool looks, there’s a custom painted Schmolke Carbon TLO seat post with a matching Tune Speedneedle Twenty20. But doing manuals down high-speed gravel descents is simply a lot of fun, so there’s an optional RockShox Reverb AXS dropper with a Berk Composites seat. With the controller so well hidden, it stays on the bike no matter what combo is used.</p>\n<p><b>One fast drivetrain:</b> The chainring is a 40T Garbaruk paired to one of their 12-speed cassettes, so you’re well prepared for most scenarios. To squeeze a little extra speed from the bike everything runs on ceramic bearings from Kogel. This includes the Kolossos rear derailleur cage, with its oversized pulley wheels.</p>\n<p><b>Wheels:</b> Special enough to be highlighted on their own are the Bike Ahead Composites Biturbo RS wheels. The 6-spoke carbon design is probably one of the most iconic on the market today. Lightweight at 1250g (before all that heavy paint) and extremely responsive, not just thanks to the low weight but to the design itself. Handmade in Germany.</p>\n<p><b>Tires: </b>Not exactly confidence inspiring under hard cornering or braking, the Continental SpeedKing RS sure are fast though. As in easily the fastest mountain bike tires I’ve ever tried on gravel, and there are tests out there that agree with me. Part of what makes them fast is the “Race Sport” casing which is super supple but very thin, making them difficult to run tubeless. So they’re set up with Tubolito tubes.</p>\n<p><b>Extras:</b> The optional front rack bolts straight onto the fork, and to finish everything off I also custom painted a Scott Cadence helmet and Sport Shield sunglasses to match.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/DSC7645.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Spec list:</b></p>\n<p>Frame: Scott Scale 910 Size Medium, no cable ports, no FD mount<br />\nFork: Trek 1120 with optional front rack<br />\nHeadset: First/Syncros semi custom setup<br />\nHandlebars: Syncros Fraser iC SL 90mm x 720mm, custom routing/reinforcement<br />\nGrips: Syncros Foam<br />\nBrakes: Trickstuff Piccola Carbon<br />\nDiscs: Trickstuff Dächle UL 160mm/180mm<br />\nAdapters: Bike Ahead Composites THE FIXER Centerlock Adapters<br />\nSeat: Tune Speedneedle Twenty20 alternatively Berk Composites<br />\nSeat post: Schmolke Carbon TLO 400mm alternatively Rockshox Reverb AXS 125mm<br />\nSeat clamp: BikeYoke Squeezy<br />\nCranks: SRAM XX1 Eagle DUB<br />\nBottom bracket: Kogel Ceramic<br />\nChainring: Garbaruk 40T<br />\nChain: SRAM XX1 Eagle<br />\nCassette: Garbaruk 12-speed 10-48T<br />\nControllers: Zirbel Twister WE01 custom setup<br />\nRear derailleur: SRAM XX1 AXS with Kogel Kolossos ceramic oversize pulley wheel system<br />\nPedals. Xpedo M-Force 8Ti<br />\nWheels: Bike Ahead Composites Biturbo RS<br />\nThru axles: Syncros rear, Extralite front<br />\nTires: Continental SpeedKing RS 2.2″<br />\nTubes: Tubolito<br />\nOther: Scott Ransom ribbed chainstay guard cut to fit</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"6f27c6b0cc8add29ce80f3f62e1aaf049db32b2f21c406b5234c8440f7a0b61f","category":"Cycling"}