{"title":"Fairphone 3 gets seven years of updates, besting every other Android OEM","link":"https://arstechnica.com/?p=1952561","date":1689016716000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/17-800x589.jpg\" alt=\"The Fairphone 3.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/17.jpg\">Enlarge</a> <span>/</span> The Fairphone 3. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>No one in the Android ecosystem can hold a candle to Apple's software support timeline for the iPhone, but there is one company that comes the closest: Fairphone. Following in the footsteps of the <a href=\"https://arstechnica.com/gadgets/2023/01/the-fairphone-2-will-hit-end-of-life-after-7-years-of-updates\">Fairphone 2</a>, the Fairphone 3 is also getting an Android-industry-best seven years of OS support. Fairphone continues to run circles around giant tech companies that have a lot more resources than it does, and it's doing this even in the face of component vendors like Qualcomm dropping support for the phone's core components.</p>\n<p>The company <a href=\"https://twitter.com/Fairphone/status/1678372450059337731\">announced today</a> that the Fairphone 3, which was released in 2019, has had its support extended to 2026, making for seven years of updates. The company also just released Android 13 for the Fairphone 3. Google's own 2019 phone, the Pixel 4, shut down support in October 2022.</p>\n<p>Fairphone strives to make sustainable smartphones, designing its products to be repairable and also offering replacement parts for sale online. Part of that sustainability mission is an absolutely herculean effort to keep the Android updates flowing, even when Qualcomm drops <a href=\"https://arstechnica.com/gadgets/2021/03/the-fairphone-2-hits-five-years-of-updates-with-some-help-from-lineageos/\">critical software support</a> for the SoC. Fairphone says the Snapdragon 632 SoC in the Fairphone 3 was only supported up to Android 11, so continuing to support the Fairphone 3 meant doing the upgrades all by itself.</p></div><p><a href=\"https://arstechnica.com/?p=1952561#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952561&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6f294627431727332813eb3e87099ef9647739578a31157f39ac13f1c26a8f3c","category":"Tech"}