{"title":"High‐Resolution Ensemble Modelling of Coral Distributions in the Northern Gulf of Mexico Based on Geomorphometry: Coral Diversity and Benthic Habitat Fragmentation From Oil and Gas Infrastructure to Inform Spatial Planning","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4234?af=R","date":1725863417000,"content":"<h2>ABSTRACT</h2>\n<p>The northern Gulf of Mexico is home to several species of corals that provide a wide range of ecosystem services to other organisms. Oil and gas infrastructure, such as platforms and pipelines, form an extensive network throughout the northern Gulf of Mexico. Detrimental impacts associated with oil and gas exploration and extraction have been recorded in this area at depths where corals are found. Due to these ecosystems' vulnerability to long-term impacts, it is necessary to determine areas of interest that would benefit from further exploration and informed spatial planning. This study aimed to identify potential areas of interest for coral studies in the northern Gulf of Mexico. Ensemble species distribution models for 13 species of corals including scleractinians, black corals, and octocorals were produced based on seafloor characteristics and combined to identify areas with relatively higher coral diversity potential than others. The ensemble modelling approach produced robust outputs, as evaluated by the area under the curve, Cohen's kappa coefficient, sensitivity, specificity and the proportion of correct predictions. The proximity of suitable habitat to active and proposed oil and gas infrastructure was evaluated; this spatial analysis showed that oil and gas infrastructures potentially impact 23.5% of all predicted suitable coral habitat in the study area and contribute to benthic habitat fragmentation. Twelve areas of interest greater than 100 km<sup>2</sup> and located outside a 4-km zone of potential influence from oil and gas infrastructure were delineated and deemed of interest for further exploration and spatial planning, and hypothetical prioritization scenarios for spatial planning are presented. The maps produced can inform discussions among stakeholders to reach the best spatial planning outcomes while considering other ecological, social, economic and governance factors.</p>","author":"Vincent Lecours, \nAmy Oxton, \nDanny Khor, \nJulia Tiplea","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"6f348e2861482e7b69b1e69ba65d24df001e2b3213c4641bba803b307a9ee00a","category":"Environment"}