{"title":"Between‐ versus within‐species variation in plant–soil feedback relates to different functional traits, but exudate variability is involved at both scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2435.14548?af=R","date":1715144986000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d7b95587-cbe9-403b-8670-d17b06fd8f94/fec14548-toc-0001-m.png\" alt=\"Between- versus within-species variation in plant–soil feedback relates to different functional traits, but exudate variability is involved at both scales\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/to-promote-or-limit-its-own-growth-in-the-soil-how-the-compounds-released-by-plant-roots-explain-variation-both-between-plant-species-and-between-plant-lineages-within-species/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPlant–soil feedback—feedback from plant-induced changes in soil properties to plant fitness—is increasingly shown to drive the maintenance of local plant diversity at both interspecific and intraspecific levels. A robust understanding of the relationships between plant–soil feedback and functional plant traits, which would improve our ability to generalize plant–soil feedback results beyond specific study systems, is, however, still lacking. This is especially true at the intraspecific plant level.\n\nWe assessed the relationship between plant–soil feedback and several functional traits in 13 co-occurring grassland species, including 20 genotypes of the dominant grass, <i>Festuca rubra</i>. The traits encompassed various aspects of growth, root properties and root exudate variability. Combining these traits into principal gradients of functional trait variation, we also tested the potential for the conservation and collaboration gradients to explain variation in PSF.\n\nBetween-species plant–soil feedback variation was explained by differences in biomass production and exudate composition, as well as contrasting strategies along the collaboration gradient. Within-species plant–soil feedback variation—that is between <i>Festuca rubra</i> genotypes—was associated with exudate variability, especially contrasting amounts of exuded phenols. Several traits had a significant effect on plant–soil feedback only via their interaction with exudate composition.\n\nOverall, PSF was associated with different traits at between-species versus within-species levels. Root exudate variability was, however, involved at both diversity levels. Our results put forth the role of root exudation patterns as an important driver of variation in plant–soil feedback. Better integration between research on plant–soil feedback and on root exudation would therefore improve our understanding of the processes—both ecological and evolutionary—supporting the maintenance of plant diversity within grassland communities.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/08/to-promote-or-limit-its-own-growth-in-the-soil-how-the-compounds-released-by-plant-roots-explain-variation-both-between-plant-species-and-between-plant-lineages-within-species/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Youssef Yacine, \nEliška Kuťáková, \nDina in ‘t Zandt, \nVěroslava Hadincová, \nJaroslav Semerád, \nTomáš Cajthaml, \nZuzana Münzbergová","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"6f4f61e30040471bb3620ff5b768328eff0cb29fe9288795fd4ed9cbc075eaed","category":"Environment"}