{"title":"Modeling the Production Process of Lignin Nanoparticles through Anti-Solvent Precipitation for Properties Prediction in Industrial Perspective","link":"https://www.preprints.org/manuscript/202410.0946/v1","date":1728886252000,"content":"Global warming has recently intensified research interest in renewable polymer chemistry, with significant attention directed towards lignin nanoparticle (LNPs) synthesis. Despite progress, LNPs industrial application faces challenges: (1) reliance on kraft lignin from declining raw biomass processes, (2) sulfur-rich, and condensed lignin use, (3) complex lignin macroparticles to LNPs conversion, using harmful and toxic solvents, and above all (4) lack of control over the LNPs production process (i.e., anti-solvent precipitation parameters), resulting in excessive variability in properties. In this work, eco-friendly LNPs with tailored properties were produced from a semi-industrial organosolv process by studying anti-solvent precipitation variables. Using first a parametric and then a Fractional Factorial Design, predictions of LNPs size and size distribution as well as zeta-potential were derived from a model over beech by-products organosolv lignin, depending on initial lignin concentration (x1, g/L), solvent flow rate (x2, ml/min), antisolvent composition (x3, H2O/EtOH v/v), antisolvent ratio (x4, solvent/antisolvent v/v) and antisolvent stirring speed (x5, rpm). This novel chemical engineering approach holds promise for overcoming the challenges inherent in industrial lignin nanoparticle production, thereby accelerating the valorization of lignin biopolymers for high value-added applications such as cosmetics (sunscreen or emulsion) and medicine (encapsulation, nanocarriers), a process currently constrained by significant limitations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f50cb928a35fc25835c6f77650f28131be62352c79fef6ecfc495cbb8c28daf","category":"Interdisciplinary"}