{"title":"Analysis of outcomes and prognostic factor in acute type A aortic dissection complicated with preoperative shock: A single-center study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302669","date":1714485600000,"content":"<p>by Chun-Yu Lin, Ming-Chang Kao, Hsin-Fu Lee, Meng-Yu Wu, Chi-Nan Tseng</p>\r\nBackground <p>Acute type A aortic dissection (ATAAD) is a critical cardiovascular emergency that requires prompt surgical intervention for preserving life, particularly in patients with critical preoperative status. This retrospective study aimed to investigate the clinical features, early and late outcomes, and prognostic factors in patients undergoing aortic repair surgery for ATAAD complicated with preoperative shock.</p> Methods <p>Between April 2007 and July 2020, 694 consecutive patients underwent emergency ATAAD repair at our institution, including 162 (23.3%) presenting with preoperative shock (systolic blood pressure &lt;90 mm Hg), who were classified into the survivor (n = 125) and non-survivor (n = 37) groups according to whether they survived to hospital discharge. The clinical demographics, surgical information, and postoperative complications were compared. Five-year survival and freedom from reoperation rates of survivors were analyzed using the Kaplan–Meier actuarial method. Multivariate logistic regression analysis was used to identify independent risk factors for in-hospital mortality.</p> Results <p>The in-hospital surgical mortality rate in patients with ATAAD and shock was 22.8%. The non-survivor group showed higher rates of preoperative cardiopulmonary resuscitation, acute myocardial infarction, and cerebral infarction, and was associated with longer cardiopulmonary bypass time, higher rates of total arch replacement and intraoperative extracorporeal membrane oxygenation implementation. The non-survivor group had higher blood transfusion volumes and rates of malperfusion-related complications. Multivariate analysis revealed that preoperative cardiopulmonary resuscitation, prolonged cardiopulmonary bypass time, and total arch replacement were risk factors for in-hospital mortality. For patients who survived to discharge, the 5-year cumulative survival and freedom from aortic reoperation rates were 75.6% (95% confidence interval, 67.6%–83.6%) and 82.6% (95% confidence interval, 74.2%–91.1%), respectively.</p> Conclusions <p>Preoperative shock in ATAAD is associated with a high risk of in-hospital mortality, particularly in patients who undergo cardiopulmonary resuscitation and complex aortic repair procedures with extended cardiopulmonary bypass. However, late outcomes are acceptable for patients who were stabilized through surgical treatment and survived to discharge.</p>","author":"Chun-Yu Lin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6f517f18f5699222ccec6b0ca38674c729b0820aba5bd05437ba52d33f612d72","category":"Interdisciplinary"}