{"title":"M3 iMac Reviews: Impressive Chip Performance but Lightning Accessories Disappoint","link":"https://www.macrumors.com/review/m3-imac/","date":1699280766000,"content":"Last week, Apple <a href=\"https://www.macrumors.com/2023/10/30/apple-announces-m3-macbook-pros/\">updated the 24-inch iMac</a>, with the headline upgrade being the M3 chip for significantly improved performance. Other new features include Wi-Fi 6E, Bluetooth 5.3, and up to 24GB of unified memory.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iMac-M3-Blue-Feature.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n\r<br />\nThe new <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> can be purchased from the Apple's online store, with prices starting at $1,299. Apple began accepting orders on October 30, and new ‌iMac‌ will begin arriving to customers and launch in stores on Tuesday, November 7.\r<br />\n\r<br />\n<ul><li><a href=\"https://www.macrumors.com/guide/m1-vs-m3-imac/\">M1 vs. M3 iMac Buyer's Guide: 15+ Differences Compared</a></li></ul>\r<br />\n\r<br />\nAhead of time, the first reviews of the laptops have been shared by select media outlets and YouTube channels, and we have rounded up some of them below.\r<br />\n\r<br />\n<h2>Written Reviews</h2>\r<br />\n<a href=\"https://www.techradar.com/computing/macs/apple-imac-24-inch-m3-review\"><em>TechRadar</em></a>'s Matt Hanson pointed out the ‌iMac‌'s <a href=\"https://www.macrumors.com/2023/10/30/magic-accessories-still-feature-lightning/\">continued use of Lightning ports</a> on its Magic Keyboard, Magic Trackpad, and Magic Mouse:\r<br />\n\r<br />\n<blockquote>Sticking to the same design also brings back some old frustrations, such as the charging port on the bottom of the Magic Mouse, which means you can't use it while it's charging, plus a reliance on the increasingly obsolete Lightning connection for charging all of the peripherals, rather than getting with the times and using USB-C. </blockquote>\r<br />\n\r<br />\n<a href=\"https://techcrunch.com/2023/11/06/apple-imac-m3-review/\"><em>TechCrunch</em></a>'s Brian Heater downplayed the significance of the continued use of the Lightning port, but emphasised that it was time for Apple to move on:\r<br />\n\r<br />\n<blockquote>Apple's desktop accessories are one of the few remaining vestiges of a connector that's past its prime. It largely won't bother you. There's less daily wear, as most people don't plug and unplug their keyboards and trackpads at the same rate they do their phones. Also, you're probably not going to get pocket lint jammed in there. Still, it's time for to Apple rip off the Band-Aid off, once and for all.</blockquote>\r<br />\n\r<br />\nEarly Geekbench 6 benchmark results indicated that the <a href=\"https://www.macrumors.com/2023/11/01/m3-chip-benchmark-results/\">M3 chip is up to 40% faster than the M1</a> used in the previous ‌iMac‌ from 2021.\r<br />\n\r<br />\n<a href=\"https://www.digitaltrends.com/computing/apple-imac-m3-review/\"><em>Digital Trends</em></a>'s Luke Larsen on the performance improvements delivered by the M3 chip:\r<br />\n\r<br />\n<blockquote>Moving from the M1 to the M3 is a big jump. Even if you think the performance changes between each individual generation aren't too exciting, skipping one adds up to a noticeable difference.\r<br />\n\r<br />\nWhen you look at Cinebench R23 scores, the M3 is a whopping 20% faster in both single-core and multi-core. That's massive. It means no matter what the strenuous task is, the M3 iMac will be at least 20% faster. A good example is a simple video encoding test in Handbrake. The M3 iMac encoded the same video to H.265 27% faster than the M1 iMac.\r<br />\n\r<br />\nIt shows how far Apple has taken these chips in just a few generations, especially on the GPU front. I was sent the 10-core GPU model, and with the inclusion of Dynamic Caching, this little iMac is a pretty solid little engine for graphics. In the Cinebench 2024 GPU test, it was 35% faster than the M1 Pro in a 14-inch MacBook Pro despite having six less GPU cores. Meanwhile, the M3 iMac beats the M2 Pro in the Mac mini by 20% in this same graphics test. Again, I think you can credit Dynamic Caching for doing a lot of the heavy lifting in that comparison.</blockquote>\r<br />\n\r<br />\nThe M3 chip is among Apple's first <a href=\"https://www.macrumors.com/guide/3nm/\">3nm</a> chips. The M3 chip features eight CPU cores like the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip, but it now offers an eight- or 10-core GPU, rather than the seven- or eight-core GPU of the ‌M1‌. It also features a 4.05 GHz CPU clock speed, up from 3.20 GHz on the ‌M1‌ chip, more memory bandwidth, support for AV1 decode, and a new GPU architecture with Dynamic Caching, hardware-accelerated ray tracing, and hardware-accelerated mesh shading.\r<br />\n\r<br />\n<em><a href=\"https://www.tomshardware.com/desktops/apple-imac-2023\">Tom's Hardware</a></em>'s Brandon Hill on the 2023 ‌iMac‌ as a whole:\r<br />\n\r<br />\n<blockquote>The iMac has always been a reasonably economical system for Mac users who want \"just the basics\" in an everyday computer. The screen is large, bright, and colorful. The minimalist design blends in with just about any décor (and you can choose from various colors to match), and the new Apple M3 chip provides a big jump in performance compared to the M1 model that debuted in 2021.\r<br />\n\r<br />\nUnfortunately, there are quite a few \"gotchas\" here. While the $1,299 starting price is enticing, you're saddled with just 8GB of unified memory and a 256GB SSD. That's hardly enough to futureproof the iMac. A simple upgrade to 16GB of memory costs a staggering $200, while storage upgrades are equally pricey.\r<br />\n\r<br />\nIf you want Gigabit Ethernet, that's a $30 upcharge, and you only get two Thunderbolt 4 ports on base systems. You must spend at least $1,499 to get two Thunderbolt 4 ports and two USB 3 ports.\r<br />\n\r<br />\nApple's iMac is an excellent all-in-one macOS machine, though it's in need of a rethink when it comes to its pricing and available configurations.</blockquote>\r<br />\n\r<br />\n<h2>Video Reviews</h2>\r<br />\n<div></div>\r<br />\n<div></div>\r<br />\n<div></div><div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iMac\">iMac (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/imac.91\">iMac</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/m3-imac/\">M3 iMac Reviews: Impressive Chip Performance but Lightning Accessories Disappoint</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/m3-imac-reviews-impressive-chip-performance-but-lightning-accessories-disappoint.2410028/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"6f52d11cd21176e6b17cd6d01e7f10167029691e58a235730d12319fb87e65fd","category":"Apple"}