{"title":"The world champion, the geared BMX, and the drama that followed","link":"https://cyclingtips.com/2021/07/the-world-champion-the-geared-bmx-and-the-drama-that-followed/","date":1627632397000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033351-019-650x433.jpg\" /></div><h2>The world champion, the geared BMX, and the drama that followed</h2><p>\n</p><p>‘Drama’ was a thread running through the BMX racing at the Tokyo Olympics. Favourites crashed out; the defending men’s champ was stretchered off, and is still in hospital; there were surprise medallists in both finals.  </p>\n\n\n\n<p>For good measure, there was a bit of drama going on in the pits, too. </p>\n\n\n\n<p>Twan van Gendt, the current world champion competing for the Netherlands, had a card up his sleeve: he was racing the first geared BMX bike in Olympic history. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CRbPKcqFhQd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CRbPKcqFhQd/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Twan van Gendt (@twanvangendt)</a></p></div></blockquote> \n\n\n\n<p>BMX bikes are invariably single speed, so you might be forgiven for thinking that Van Gendt had found a loophole and exploited it. </p>\n\n\n\n<p>That’s not the case: BMX racing, like any other discipline in the cycling family, follows strict technical guidelines presided over by the UCI (International Cycling Union). Hidden somewhere in the depths of a technical guidebook – which, I can assure you, are not best described as scintillating reading – is the allowance that “multiple speed gear systems are permitted”.  </p>\n\n\n\n<p>There was no sleight of hand; Van Gendt had just done his homework better than his competitors.</p>\n\n\n\n<p>At various points in the sport’s history, riders and bike designers have attempted the development of BMX bikes with multiple gears, but they’ve never really caught on. The barriers are many, including (but not limited to) the monstrous torque of the riders; the fact that they’re spinning the cranks north of 150 revs per minute; the way the bikes tend to be either airborne or slamming back to earth; and – this is an important one – the weight of tradition. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033351-026-1340x893.jpg\" /></figure>\n\n\n\n<p>In pursuit of a decisive advantage in the Olympics, Van Gendt and his team (and sponsors) decided to throw tradition to the wind. Shimano supplied a Zee shifter and modified rear derailleur which Van Gendt put through extensive testing at his home track in the Netherlands. </p>\n\n\n\n<p>The Dutch star’s minimal set-up – two cogs at the back, a 16 tooth and a 17 tooth – was honed to give him a decisive advantage on the Tokyo track. The course is around 25% longer than a typical Olympics track, with more sections that can be rolled instead of jumped. The opening straight is longer, too – making Van Gendt’s two-geared drivetrain, at least theoretically, a race-winning advantage. </p>\n\n\n\n<p>It also sent the BMX world into a bit of a meltdown, with traditionalists decrying Van Gendt’s set-up as being against the spirit of the sport. Before the opening ceremony had even begun, it looked like Van Gendt had struck a decisive psychological advantage.</p>\n\n\n\n<p>Van Gendt’s finely-honed preparations didn’t end there. Red Bull, who sponsor the Dutchman, built a replica ramp and opening straight to match the dimensions of the Tokyo course, so that Van Gendt’s preparations and testing of the geared drivetrain could proceed perfectly. </p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CGk4bBQlZeA/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CGk4bBQlZeA/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Twan van Gendt (@twanvangendt)</a></p></div></blockquote> \n\n\n\n<p>Of course, sometimes an athlete just doesn’t have the legs on the day. For Van Gendt, today was that day; he had a literal extra gear, but metaphorically couldn’t find one. </p>\n\n\n\n<p>In the semi-finals, he finished in eighth of eight for the first two heats, improving to seventh in the third and final of his rides in Tokyo only by virtue of US medal contender Connor Fields crashing out. After all that, Van Gendt walked away with the lowest score of all semi-finallists. </p>\n\n\n\n<p>Meanwhile, Van Gendt’s teammate, Niek Kimmann pulled an improbable victory out of the bag, securing a gold medal for the Netherlands. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033354-007-1340x893.jpg\" /><figcaption>A different Dutchman on the top step of the podium: Niek Kimmann of the Netherlands.</figcaption></figure>\n\n\n\n<p>Kimmann was riding with a fractured kneecap, after an official walked into his path on Monday. He didn’t have a replica track to train on, and he only had one gear. </p>\n\n\n\n<p>But his performance – and Van Gendt’s comparative underperformance – <em>did</em> demonstrate one thing: marginal gains are all well and good, but you still need to be the best rider in the race. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/the-world-champion-the-geared-bmx-and-the-drama-that-followed/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6f654dd47909f334f0b33b7d746386e15a2a1a05cfbd691c383cb649c4dec6b4","category":"Cycling"}