{"title":"Sleep duration time and human papillomavirus infection risk: The U-shaped relationship revealed by NHANES data","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301212","date":1712325600000,"content":"<p>by Huangyu Hu, Yue Wu, Min Zhao, Jiaqi Liu, Ping Xie</p>\r\nPurpose <p>This study aims to investigate the relationship between sleep factors (sleep duration time [SDT] and obstructive sleep apnea [OSA]) and human papillomavirus (HPV)/high-risk HPV(HR-HPV) infection, utilizing data from the National Health and Nutrition Examination Survey (NHANES).</p> Methods <p>We conducted a cross-sectional analysis using NHANES data, focusing on SDT and OSA’s association with HPV/HR-HPV infection. The primary statistical methods included weighted multivariate linear regression and logistic regression to assess the association between SDT, OSA, and HPV/HR-HPV infection. The study employed restricted cubic splines (RCS) for evaluating potential non-linear relationships between SDT and HPV/HR-HPV infection. Subgroup analyses were conducted. Interaction terms were used to examine the heterogeneity in associations across different subgroups.</p> Results <p>The study identified a U-shaped relationship between SDT and HPV infection. Specifically, 7 hours of sleep was associated with the lowest risk of HPV infection. In comparison, SDT less than 7 hours resulted in a 26.3% higher risk of HPV infection (Odds Ratio [OR] = 1.26, 95% Confidence Interval [CI]: 1.029, 1.549), and more than 9 hours of sleep showed a 57.4% increased risk (OR = 1.574, 95% CI: 1.116, 2.220). The relationship between SDT and HR-HPV infection was significant in the first two models, but not in the fully adjusted model. No significant interaction was found between sleep duration and other covariates. There was no association between OSA and HPV/HR-HPV infection.</p> Conclusion <p>The study underscores the complex relationship between sleep duration and HPV infection risk, suggesting both very short and very long sleep durations may increase HPV infection likelihood. The findings highlight the need for further research to explore the biological mechanisms underpinning this association and to consider broader population groups and more precise sleep assessment methods in future studies.</p>","author":"Huangyu Hu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6f67f3b182f63fd502ca707a7d641f6b06d21a11d4e4f463f0b0e0d3d2909acf","category":"Interdisciplinary"}