{"title":"Effect of absorber shape on energy, exergy efficiency and enviro‐economic analysis of solar air collector: An experimental study","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14481?af=R","date":1727075153000,"content":"<h2>Abstract</h2>\n<p>The efficiency of solar air collectors, which are intended to convert solar energy into thermal energy, is the subject of numerous studies that aim to assess and improve it. Solutions for sustainable energy heavily rely on these systems. Making the right choice regarding the best method for absorbing solar radiation and reducing heat losses is what will ultimately lead to their improved performance. In this work, wavy and corrugated absorbers were suggested inside a solar air collector. The aim of this article is to study experimentally the thermal performance of the solar air collector when using wavy shape of absorber and corrugated shape of absorber instead of the flat shape of absorber under the same weather conditions of Sfax region central-eastern of Tunisia. The suggested shapes of absorber augmented sun exposure and heating area. The results obtained from this experimental study show that switching from a flat plate absorber to both wavy and corrugated absorbers resulting significant performance gains. The absorber with waves showed a significant improvement in daily thermal efficiency of 22.89%, and the absorber with corrugations showed an even greater improvement of 40.56%. Comparable patterns were noted in daily exergy efficiency, where the corrugated absorber demonstrated an astounding 44.83% increase and the wavy absorber provided a 23.24% improvement. Notably, when total cost savings and monthly CO<sub>2</sub> reduction were taken into account, the corrugated absorber turned out to be the best option. These findings highlight the importance of absorber form in optimizing thermal and energy efficiency, which may have positive effects on the economy and environment.</p>","author":"Yassmin Touhami, \nRidha Boudhiaf, \nAbd Elnaby Kabeel, \nAbdelkrim Khelifa, \nMohammed El Hadi Attia, \nMoataz M. Abdel‐Aziz, \nNoureddine Latrache, \nAbederrahmane Aissa, \nZied Driss","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"6f670a10927a4f98de4e2bfce4cd5847399d0a19a5afc15b849974ef7d8e43da","category":"Environment"}