{"title":"Numerical simulation of rock blasting under different in-situ stresses and joint conditions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299258","date":1713794400000,"content":"<p>by Hai Rong, Nannan Li, Chen Cao, Yadi Wang, Jincheng Li, Mingda Li</p>\r\n\r\nHigh primary rock stress can limit the generation of rock cracks caused by blasting, and blasting usually shows different rock breaking states under different primary rock stress conditions. There are a large number of naturally formed joints in rock mass, due to the limitations of laboratory tests, a numerical model of jointed rock mass was established using LS-DYNA software to investigate the evolution of blasting damage under various in-situ stresses and open joints. In this simulation, using the Lagrange-Euler (ALE) procedure and the equation of state (JWL) that defines explosive materials, the study considered different joint thicknesses (2cm, 4cm, and 6cm), joint angles (0°, 30°, 60°, and 90°), and in-situ stress conditions (lateral stress coefficients of 0.5, 1, and 2, with vertical in-situ stresses of 10MPa and 20MPa), through stress analysis and damage area comparison, the relationship between damage crack propagation and horizontal and vertical stress difference is explored. The research aimed to understand the mechanisms underlying crack initiation and propagation. The results show that: (1) The presence of joints exerts a barrier effect on the expansion and penetration of cracks. When explosion stress waves reach the joint surface, their propagation is impeded, leading to the diffusion of wing cracks at the joint ends. When the lateral stress coefficient and joint angle are the same, an increase in initial in-situ stress results in a reduction in the area of the blasting damage zone. (2) Under the same initial in-situ stress conditions, the area of the blasting damage zone initially increases and then decreases with an increasing joint angle. However, it remains larger than that without a joint, and there exists an optimal angle that maximizes the damage area. In the simulated conditions, the area of damage cracks is greatest when the joint angle is 60° dip angle. (3) The presence of initial in-situ stress has a certain impact on the initiation and expansion of blasting cracks. The degree and nature of this influence are not solely related to the lateral stress coefficient but also depend on the joint’s angle and thickness. When in-situ stress is present, the initial in-situ stress field’s pressure is not conducive to the initiation and propagation of blasting cracks. However, the existence of a joint has a noticeable guiding and promoting effect on crack propagation, and the pattern of crack propagation is influenced by both joint and in-situ stress conditions.","author":"Hai Rong","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6f6d504932e5ff4174551b50043effe913ce4c45d81b40b50093938e8c9eb4f1","category":"Interdisciplinary"}