{"title":"Application of Attribute-Based Encryption in Military Internet of Things Environment","link":"https://www.preprints.org/manuscript/202407.2360/v1","date":1722317943000,"content":"Military Internet of Things (MIoT) has emerged as a new research area in military intelligence. The MIoT frequently has to constitute a federation-capable IoT environment when the military needs to interact with other institutions and organizations or carry out joint missions as part of a coalition such as in NATO.  One of the main challenges of deploying MIoT in such an environment is to acquire, analyze, and merge huge amounts of data from many different IoT devices and disseminate it in a secure, reliable, and context-dependent manner. In this work, we present a comprehensive solution for secure data dissemination based on the integration of Hyperledger Fabric's distributed registry technology, Apache Kafka message broker, and data processing microservices implemented using the Kafka Streams API library and applying attribute-based encryption (ABE), a cryptographic approach that facilitates controlling access to information based on data and user attributes rather than traditional methods that rely on specific keys. In the work, we built an experimental setup, implemented an access control scheme designed for mobile components, and performed an evaluation of its performance. Performance tests have confirmed the suitability of the developed cryptographic method for attribute-based data access control in MIoT systems, considering the federations of military networks. The results indicate that the proposed cryptographic scheme is viable for the number of attributes typically assumed to be used in battlefield networks, offering a good trade-off between security and performance for modern cryptographic applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f6db606f12095d6b842a771d98cc8a417725fd0bbeeacdb3cdb8233f4c1b6b8","category":"Interdisciplinary"}