{"title":"Treatment of Aggressive Behavior and Agitation in a 11-Year-Old Boy With Co-occurring Autism and ADHD: A Case Report and Literature Review on the Use of Intravenous Valproate in Emergency Psychiatry","link":"https://www.preprints.org/manuscript/202403.1482/v1","date":1711437654000,"content":"Background: Autism spectrum disorder (ASD) is a persistent neurodevelopment disorder frequently co-occurring with Attention-Deficit/Hyperactivity Disorder (ADHD) and behavior-related disorders. While behavioral therapy is the first-line option to manage ASD core symptoms, pharmacological therapy is sometimes needed to treat acute problems, such as agitation and aggressive behaviors. Recent guidelines recommend neuroleptics to reduce psychomotor agitation in people with ASD. However, since children with ASD are often drug-resistant, alternative treatments are often justified. \nReports from literature showed that intra-venous valproate (IV-VPA) can be effective in reducing agitation in psychiatric patients, with lower frequency of adverse events compared to convention-al treatments. However, since findings are occasionally inconsistent, IV-VPA is not an approved option in clinical psychiatry. We aim at improving the knowledge on the IV-VPA treatment option in emergency psychiatry in the pediatric age.\nMethods: We report the case of a 11-year-old boy suffering from a complex neurodevelopmental condition, who experienced a psychotic episode with severe aggressive and disruptive behaviors, successfully treated with IV-VPA. Besides, we conducted an up-dated literature review on this topic. \nConclusion: In our case, first-line therapies proved to be ineffective. On the contrary, IV-VPA led to a safe and prompt clinical success, in line with other reports. Based on our literature review, IV-VPA can be highly effective and can reduce the risk of adverse events that frequently occur with the use of high-dose standard medications in emergency psychiatry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f6fe70af0f467661df68a023a9bdafd51066bfa1255893fdbcd83d41e655b10","category":"Interdisciplinary"}