{"title":"Overexpression of Il-6 in Bleomycin-Treated Balb/C Mice Provides a New Model of Lung Fibrosis: Transcriptomic Comparison to Human Ipf","link":"https://www.preprints.org/manuscript/202407.2361/v1","date":1722317953000,"content":"Idiopathic pulmonary fibrosis (IPF) is a difficult to treat condition to treat with a high mortality rate. While preclinical models such as Bleomycin (Bleo)-induced fibrosis recapitulate some aspects of IPF, new models that more closely mimic the disease are warranted. We have developed and characterized a novel model in BALB/c mice using a transient overexpression of IL-6 combined with Bleo. This model’s transcriptomic signature was compared to published human IPF datasets. BALB/c females were treated with AdIL-6 in combination with Bleo (AdIL-6+Bleo) or control comparators, and underwent assessments of histopathology (ECM, α-SMA accumulation), collagen content and lung physiology (Elastance, EST).  Flow cytometry was used to characterize T cell and Macrophage subsets, and T cell depletion studies (anti-CD4/CD8) were completed to assess T cells role in fibrosis.  Bulk RNA sequencing generated gene signatures were compared to that of other rodent fibrosis models and published human datasets of IPF datasets. The AdIL-6+Bleo treatment resulted in robust fibrosis measures (day21), sustained fibrosis until at least day 50, a unique cytokine profile at day 7, and increased activated CD4+Tcells, CD8+Tcells, and CD16+MHChi/Clec7a/iNOS-/Arg1-/CD206- macrophages. T cell depletion markedly decreased fi-brotic responses and this population of macrophages. The Day 21 AdIL-6+Bleo transcriptome shared more genes with each of two human IPF datasets than Bleo alone in C57Bl/6 mice or other rodent models.  We conclude that AdIL-6+Bleo in BALB/c mice offers a superior preclinical model for studying IPF mechanisms and potential therapeutic intervention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f7631da410029cba66cd0277f27578911e6eeaf4423b5629419dd287bccdd77","category":"Interdisciplinary"}