{"title":"The effect of dead standing (marcescent) biomass on litter decomposition in herbaceous flora is governed by plant functional group","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14544?af=R","date":1710564315000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6e5b3391-bc8d-445c-8eae-dc61a876404a/fec14544-toc-0001-m.png\" alt=\"The effect of dead standing (marcescent) biomass on litter decomposition in herbaceous flora is governed by plant functional group\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/06/how-does-standing-dead-plant-biomass-marcescence-affect-litter-decomposition-in-herbs/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIn autumn, temperate herbs begin to senesce and gradually shed their litter. However, surprisingly large amounts of dead biomass remain standing, that is, marcescent. The consequences of marcescence for the decomposition of biomass once it finally reaches the soil are largely unknown.\n\nHere, we aimed to determine whether marcescence affects subsequent litter decomposition in the organic layer to such an extent that its mass loss and chemistry are distinguishable from those of directly shed biomass. We further aimed to disentangle the role of plant functional traits and groups (forbs vs. grasses) concerning the marcescence effect on decomposition.\n\nTo this end, we sampled the living, marcescent and shed senescent biomass of 39 herbaceous plant species grown in a common garden experiment, determined plant functional traits and incubated the marcescent and shed plant tissues in the field in an allochthonous organic layer for 6 months. We determined the mass loss, C and N contents, chemical composition and microbial community structure of the decomposed tissues.\n\nOur results show that marcescent tissues decomposed more slowly than directly shed tissues (mass loss 37.3% vs. 63.2% for forbs, 43.5% vs. 45.5% for grasses), likely due to more favourable conditions for decomposition in the organic layer. These were reflected in a significantly higher microbial colonization of shed (~333 and 708 μg biomass C g<sup>−1</sup> for forbs and grasses, respectively) than marcescent tissue (~189 and 543 μg biomass C g<sup>−1</sup> for forbs and grasses, respectively) even after 6 months in the organic layer. Moreover, higher relative contributions of aliphatics and polyphenolics in shed tissues indicated a more advanced stage of decomposition. Notably, marcescent tissues of forbs, with a more complex growth architecture (being composed of stems [marcescent] and leaves [shed]), decomposed substantially more slowly than directly shed tissues. In contrast, differences in decomposition between marcescent and shed tissues of grasses, with a more uniform growth architecture, were substantially less pronounced.\n\nThese findings highlight that marcescence in the temperate herbaceous flora can strongly affect litter decomposition and thus C and nutrient cycling through temperate ecosystems, but that the extent to which marcescence affects decomposition depends on plant functional group.\n</p>","author":"Šárka Angst, \nOndřej Mudrák, \nJan Frouz, \nVeronika Jílková, \nRenáta Schnablová, \nPetra Straková, \nHana Veselá, \nGerrit Angst","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"6f77c4f68e22d44f593f101ab56b375b89952ac3fb52f1db76ce638e33f802ad","category":"Environment"}