{"title":"Elon Musk Hires New Twitter CEO: NBCUniversal Ad Chief Linda Yaccarino","link":"https://www.cnbc.com/2023/05/12/nbcuniversal-ad-chief-yaccarino-resigns-as-sources-say-shes-in-talks-to-be-twitter-ceo.html","date":1684183842000,"content":"\n<p>Lillian Rizzo, reporting for CNBC:</p>\n\n<blockquote>\n  <p>NBCUniversal global advertising chief Linda Yaccarino has resigned\nto join Twitter as its next chief executive. Twitter owner Elon\nMusk <a href=\"https://twitter.com/elonmusk/status/1657050349608501249\">confirmed the hire</a> in a tweet Friday.</p>\n\n<p>“I am excited to welcome Linda Yaccarino as the new CEO of\nTwitter!” Musk tweeted. He said she “will focus primarily on\nbusiness operations, while I focus on product design &amp; new\ntechnology.”</p>\n\n<p>He added, “Looking forward to working with Linda to transform this\nplatform into X, the everything app.”</p>\n</blockquote>\n\n<p>I wish Yaccarino luck, truly. But the CEO needs to run the company, and I find it unlikely that she’s going to have that authority with Musk running “product design and new technology”.</p>\n\n<p>Tim Cook is an obvious example of a non-product person who is very successfully leading a product-first company. But while Cook is not a product designer or product visionary, there is zero question within Apple that Cook is the boss. The buck stops at Cook’s desk — including on product decisions.</p>\n\n<p><strong>Sidenote:</strong> I <a href=\"https://bsky.app/profile/gruber.bsky.social/post/3jup7lhivok25\">noticed</a> about two weeks ago that Musk has largely stopped referring to Twitter by name and instead saying “<a href=\"https://twitter.com/elonmusk/status/1652048146195959809\">this platform</a>”. Months ago he <a href=\"https://www.wsj.com/articles/twitter-inc-changes-its-name-to-x-corp-and-moves-to-nevada-703ac892\">changed the name of the holding company</a> from “Twitter Inc.” to “X Corp.”. The fact that he largely refers to it now as “this platform” makes me think he’s going to rename it X sooner rather than later. Seems crazy to me to throw away the Twitter brand name though, so maybe “X” will just be to Twitter what “Meta” is to Facebook and “Alphabet” is to Google. But also: Musk does crazy things. Throwing away the entire Twitter brand would be less crazy than his buying it in the first place.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/15/twitter-ceo-linda-yaccarino\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"6f7c613b43602cc1ea068dd0e3742abac95c0b7da3596930100b5457a126debe","category":"Tech"}