{"title":"Functional diversity loss and taxonomic delays of European freshwater fish and North American breeding birds","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2435.14599?af=R","date":1718002419000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f41e9727-4b50-40bc-a378-4740c5c98ca0/fec14599-toc-0001-m.png\" alt=\"Functional diversity loss and taxonomic delays of European freshwater fish and North American breeding birds\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/29/functional-diversity-loss-and-taxonomic-delays-of-european-freshwater-fish-and-north-american-breeding-birds/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBiodiversity is temporally dynamic, reflecting historical environmental conditions and influencing ecosystem stability. Colonisation and extinction dynamics frequently exhibit asynchronous patterns, resulting in net imbalances and thus to long-lasting richness trends. If these trends are not functionally random, functional net imbalances between colonisations and extinctions (fNICE) are likely to emerge.\n\nUsing community time series data of European freshwater fish and North American breeding birds, we investigated how fNICE differs from its taxonomic equivalent (tNICE), to provide a comprehensive picture of biodiversity dynamics.\n\nOur findings reveal that taxonomic and functional delays are a prevalent feature, challenging the assumption of an immediate response to environmental changes. Taxonomic delays manifest as extinction debts and colonisation credits, while functional delays indicate a shift in the balance between functional gains and losses over time. Moreover, we found that taxonomic and functional imbalances are not always directly correlated, although some specific patterns were found consistently for fish and birds.\n\nEarly colonisations outpaced functional gains, indicating that although new species arrived earlier than the extinction of other species, the acquisition of new functional traits lagged. Although this may temporarily stabilise communities, as functional redundancy can mitigate loss of function via local extinctions, excessive redundancy can compromise biodiversity's capacity to respond to environmental variations, thereby undermining long-term resilience.\n\nIn conclusion, understanding the intricate temporal dynamics of biodiversity responses is paramount for effective conservation practices. While short-term observations may suggest an equilibrium between diversity and the environmental conditions, our results underscore the importance of considering long-term dynamics and the interplay between species traits and changing environments. The metrics tNICE and fNICE are valuable tools for quantifying these temporal dynamics and unravelling their consequences for ecosystem stability. Incorporating these insights into conservation strategies can aid in proactively preserving biodiversity and safeguarding the integrity of ecosystems.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/29/functional-diversity-loss-and-taxonomic-delays-of-european-freshwater-fish-and-north-american-breeding-birds/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Lucie Kuczynski, \nAna Maria Bastidas Urrutia, \nHelmut Hillebrand","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"6f9229f05d911f3ce72d4a4c63d7b0ff0977bf7223ca1ad0babf0f2b6cff3fd5","category":"Environment"}