{"title":"Looking for reliable species distribution models for low‐density cetacean species: Compared effectiveness of SDMs for G. griseus, G. melas, Z. cavirostris in the Mediterranean Sea based on long‐term fixed‐transect data","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4115?af=R","date":1709166221000,"content":"<h2>Abstract</h2>\n<p>\nThe EU regulative framework for the protection of marine biodiversity and habitats requires the assessment of species' conservation status and the identification of core habitats to design adequate conservation and management plans. However, the identification of distribution range and habitat-use of pelagic large-range, migratory species, such as cetaceans, is challenging.\nSpecies distribution models (SDMs) are increasingly used in conservation planning to identify species priority areas. However, the quality of SDMs varies widely depending on the representativeness of data and the appropriateness of the modelling techniques.\nSince 2007, the Fixed Line Transect Mediterranean Monitoring Network (FLT Med Net) has been continuously monitoring cetaceans throughout the year in the Mediterranean basin using passenger ferries as observation platforms that perform repetitive surveys along fixed trans-border transects.\nWith the aim of defining a standard analytical approach, the data collected by the FLT Med Net on rarer Mediterranean cetacean species (i.e., <i>Grampus griseus</i>, <i>Globicephala melas</i>, <i>Ziphius cavirostris</i>) are used here to assess the performance of commonly used SDMs, including GLM, GAM, GAM-Negative Binomial, GAM-tweedy, MaxEnt and Random Forest. Models were built and evaluated using a total of 296 FLT Med Net sighting data and cross-validated using 145 independent data points.\nUnder testing conditions, almost all methods exhibited good performance, with Random Forest being the best model in several cases. However, when evaluated with the independent dataset, many models yielded inconsistent results or notably low performance. Only MaxEnt demonstrated consistent efficiency and reliability in both cases, showing results less affected by unequal sampling or small sample size.\nResults confirm the importance of robust standard SDM approaches based on representative data such as the FLT Med Net data to identify reliable priority areas for the species and to assess the long-term coherence and effectiveness of spatial protection measures.\n</p>","author":"Antonella Arcangeli, \nMarta Azzolin, \nL. Babey, \nLea David, \nO. Garcia‐Garin, \nAurelie Moulins, \nMassimiliano Rosso, \nAlessia Scuderi, \nPaola Tepsich, \nMorgana Vighi, \nArianna Orasi","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"6f97783fc88a78af6f28e4b800a64aca9a4813a402b288f88497e35463d1d926","category":"Environment"}