{"title":"BDNF specifically expressed in hippocampal neurons is involved in methylmercury neurotoxicity resistance","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24174?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<p>Methylmercury (MeHg) causes selective neuronal damage to cerebrocortical neurons (CCNs) in the central nervous system, but not to hippocampal neurons (HiNs), which are highly vulnerable to neurodegenerative diseases. In our previous study using cultured rat neurons, we performed a comprehensive gene expression analysis and found that the brain-derived neurotrophic factor (BDNF), a neurotrophin (NT), was specifically expressed in HiNs. Therefore, to elucidate the causal factors of MeHg toxicity resistance in HiNs, we conducted a comparative study of the protein expression and function of several NTs, including BDNF, using CCNs showing vulnerability to MeHg toxicity and HiNs showing resistance. BDNF was specifically expressed in HiNs, whereas nerve growth factor was barely detectable in either neuron type. In addition, other NTs, NT3 and NT4/5, were expressed in small but nearly equal amounts in both neuron types. Furthermore, among the various pathways involved in MeHg neurotoxicity, the p44/42 MAPK pathway was specifically activated in HiNs, even without MeHg treatment. siRNAs were used to reduce NTs in both neuron types. Only a specific reduction in BDNF attenuated the resistance to MeHg toxicity and p44/42 MAPK activation in HiNs. In addition, the external addition of BDNF and NT4/5, which act on the same tyrosine receptor kinase (Trk), TrkB, suppressed MeHg neurotoxicity in both neuron types. These results suggest that BDNF, expressed specifically in HiNs, is involved in the resistance to MeHg neurotoxicity via TrkB. Additionally, the activation of the p44/42 MAPK pathway may contribute to the inhibitory effect of BDNF on MeHg neurotoxicity.</p>","author":"Masatake Fujimura, \nTakamitsu Unoki","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"6f9a834ebb067ab1cde179e6e67c624ca82db352d3f06d4e29e1d0c8b7315f20","category":"Environment"}