{"title":"Atorvastatin Treatment Significantly Increased the Concentration of BM-MNCs and TcPO2 and Lowered Pain Scale after BMCs Treatment Patients with &ldquo;No-Option&rdquo; Critical Limb Ischaemia.","link":"https://www.preprints.org/manuscript/202403.1355/v1","date":1711085224000,"content":"Background: The present study investigated the outcomes and possible predictive factors of autologous bone marrow cells (BMCs) therapy in patients with „no-option“ critical limb ischaemia (CLI). It was focused on exploring the clinical background and prior statin and renin-angiotensin system (RAS)-acting agent’s pharmacotherapy related to the therapeutic efficacy of BMCs treatment.\nMethods: In the present study, we have reviewed thirty-three patients (mean age 64.9 ± 10 years; 31 males) with advanced CLI after failed or impossible revascularisation, who were treated with 40 ml of autologous BMCs by local intramuscular application. Patients with limb salvage and wound healing (n=22) were considered responders to BMCs therapy, and patients with limb salvage and complete ischemic wound healing (n=13) were defined as super-responders. Logistic regression models were used to screen and identify the prognostic factors, and a receiver operating characteristics (ROC) curve, a linear regression and a survival curve were drawn to determine the predictive accuracy, the correlation between the candidate predictors and the risk of major amputation. \nResults: Based on the univariate regression analysis, baseline C-reactive protein (CRP) and transcutaneous oxygen pressure (TcPO2) values were identified as prognostic factors of the responders, while CRP value, ankle-brachial index (ABI) and bone marrow-derived mononuclear cells (BM-MNCs) concentration were identified as prognostic factors of the super-responders. An area under the ROC curve of 0.768 indicated good discrimination for CRP ˃ 8.1 mg/L before transplantation as a predictive factor for negative clinical response. Linear regression analysis revealed a significant dependence between the levels of baseline CRP and the concentration of BM-MNCs in transplanted bone marrow. Patients taking atorvastatin before BMCs treatment (n=22) had significantly improved TcPO2 and reduced pain scale after BMCs transplant, compared to the non-atorvastatin group. Statin treatment was associated with reduced risk for major amputation. However, the difference was not statistically significant. Statin use was also associated with a significantly higher concentration of BM-MNCs in the transplanted bone marrow compared to patients without statin treatment. Patients treated with RAS-acting agents (n=20) had significantly reduced pain scale after BMCs transplant, compared to the NON-RAS group. Similar results, reduced pain scale and improved TcPO2, were achieved in patients treated with atorvastatin and RAS-acting agents (n=17) before BMCs treatment. Results of the Spearman correlation showed a significant positive correlation between CLI regression, responders, and previous therapy before BMCs transplant with RAS-acting agents alone or with atorvastatin.\nConclusions: CRP and TcPO2 were prognostic factors of the responders, while CRP value, ABI and BM-MNCs concentration were identified as predictive factors of the super-responders. Atorvastatin treatment was associated with a significantly increased concentration of BM-MNCs in bone marrow concentrate and higher TcPO2 and lower pain scale after BMCs treatment in CLI patients. Similarly, reduced pain scales and improved TcPO2 were achieved in patients treated with atorvastatin and RAS-acting agents before BMCs treatment. Positive correlations between responder and previous treatment before BMCs transplant with RAS-acting agents alone or atorvastatin were significant.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6f9b14ccaf236fe6d40bfef3ef2de4480718f18ac57eed4ce3ac9ed70e54318e","category":"Interdisciplinary"}