{"title":"ทีมวิจัยจีนสาธิตการคำนวณด้วยคอมพิวเตอร์ควอนตัมขนาด 56 บิตสำเร็จ ผ่านด่าน Quantum Supremacy ตามกูเกิลแล้ว","link":"https://www.blognone.com/node/125524","date":1635392174000,"content":"<div><div><div><p>ทีมวิจัยนำโดยศาสตราจารย์ Jian-Wei Pan จาก University of Science and Technology of China รายงานถึงคอมพิวเตอร์ควอนตัม Zuchongzhi ขนาด 66 คิวบิต โดยทีมงานวิจัยสามารถสาธิตการแก้<a href=\"https://en.wikipedia.org/wiki/Boson_sampling\">ปัญหา Boson Sampling</a> ด้วยคิวบิตจำนวน 56 คิวบิตในชิปและรัน 20 วงรอบประมวลผล เป็นการสาธิตว่า Zuchongzhi สามารถประมวลผลงานบางชนิดได้โดยที่คอมพิวเตอร์ทั่วไปทำไม่ได้ เข้าสู่พลังประมวลผลระดับ Quantum Supremacy</p>\n<p>การแก้ปัญหา Boson Sampling เป็นปัญหาหนึ่งที่เชื่อกันว่าใช้สาธิตพลังประมวลผลของคอมพิวเตอร์ควอนตัมว่าเหนือกว่าคอมพิวเตอร์ทั่วไปได้ เพราะการจำลองเหตุการณ์นี้อย่างแม่นยำทำได้ยาก (อย่างไรก็ตามการจำลองแบบประมาณค่ายังทำได้ในคอมพิวเตอร์ทั่วไปอยู่) การสาธิตเครื่อง Zuchongzhi ครั้งนี้แสดงให้เห็นว่ามันสามารถแก้ปัญหา Boson Sampling เร็วกว่าซูเปอร์คอมพิวเตอร์ที่เร็วที่สุดในโลก ระดับ 10<sup>24</sup> เท่าตัว พ้นจากระดับคอมพิวเตอร์ที่สามารถสร้างได้จริงไปแล้ว</p>\n<p>กูเกิลประกาศความสำเร็จในการพัฒนาคอมพิวเตอร์ควอนตัมเพื่อแก้ปัญหาระดับ Quantum Supremacy ตั้งแต่ปี 2019 <a href=\"https://www.blognone.com/node/112707\">ด้วยการแก้ปัญหา Schrödinger-Feynman algorithm</a> แม้ว่าการผ่านด่าน Quantum Supremacy จะเป็นหลักชัยสำคัญแต่การใช้งานเพื่อแก้ปัญหาในโลกความเป็นจริงก็ยังจำกัด ระหว่างนี้อาจจะมีการใช้งานจริงกับปัญหาเฉพาะทางบางประเภท แต่ปัญหาหลายอย่างต้องการเทคโนโลยี Quantum Error Correction ที่จะทำให้สามารถสร้างคอมพิวเตอร์ควอนตัมระดับพันคิวบิต (มีคิวบิตจริงระดับล้านคิวบิต แต่ใช้เพื่อการแก้ความผิดพลาด)</p>\n<p>ที่มา - <a href=\"https://physics.aps.org/articles/v14/147\">American Physical Society</a>, <a href=\"https://quantum.ustc.edu.cn/web/index.php/node/991\">USTC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a93381fd4402e188b5cdc2fa97810cc5.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/quantum-computer\">Quantum Computer</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"6f9ffda8e23f1508777b2721e5d7d8999c8a898df2f698f6358c99bfeddc79f2","category":"Thai"}