{"title":"The effects of environmental factors on the synthesis of water‐soluble Monascus red pigments via submerged fermentation: a review","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13517?af=R","date":1712656528000,"content":"<h2>Abstract</h2>\n<p>Monascus pigments (MPs) have been used as natural food pigments for many years. There is a high demand for Monascus red pigments (MRPs) to enhance color and for antibacterial and cancer-prevention therapies in food and medicine. Most of MRPs aren't water-soluble, and the yield of water-soluble MRPs is naturally low. But on the other hand, water-soluble MRP is more cost-effective for application in industrial mass production. Therefore, it's important to improve the yield of water-soluble MRPs. Environmental factors have significant influence on the synthesis of water-soluble MRPs, which is crucial for the development of industrial production of water-soluble MRPs. This review introduces the biosynthetic pathways of water-soluble MRPs and summarizes the effects of environmental factors on the yield of water-soluble MRPs. Acetyl coenzyme A (acetyl-CoA) is a precursor for MPs synthesis. The carbon and nitrogen sources and the carbon/nitrogen ratio can impact MPs production by regulating the metabolic pathway of acetyl-CoA. Optimization of fermentation conditions to change the morphology of Monascus can stimulate the synthesis of MPs. The appropriate choice of nitrogen sources and pH values can promote the synthesis of MRPs from MPs. Additives such as metal ions and non-ionic surfactants can affect the fluidity of Monascus cell membrane and promote the transformation of MRPs into water-soluble MRPs. This review will lay the foundation for the industrial production of water-soluble MRPs.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Ping Li, \nYin Zhou, \nYingying Wu, \nXiao Jiang, \nXuan Wang, \nXinyun Shi, \nWeiping Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"6fa8ace1f262848af0974991602775f63698b9effd06382e6eafe0850ce89407","category":"Environment"}