{"title":"PSV-29 In vitro digestibility and in situ degradability of lobster and mixed crab shell waste material","link":"https://academic.oup.com/jas/article/102/Supplement_3/738/7757852?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of this research was to determine the in situ and in vitro degradability of lobster shell waste meal (LM) and crab shell waste meal (CM). Lobster and crab harvest are major industries within the New England states and the Maritime provinces. Harvest of the American lobster amounts to 54,643 tons caught and processed in 2020 in the New England states. The Atlantic Red Crab annual quota is around 1,814 tons. The Jonah Crab amounts to 5,725 tons. Due to the significant harvest, there is a resulting increase in byproducts and wastes at processing facilities providing potential feedstuffs for cattle. For both experiments, LM and CM were compared with soybean (SBM) and blood meals (BM). In experiment 1, 0.5 g of each meal were added to an artificial rumen incubator (Daisy, Ankom technologies) and DM degradability over 48 h was measured. In experiment 2, ruminally-cannulated Holstein cows (n = 4) in a 4 × 4 Latin square, had 5 g of sample were placed in Dacron bags in the dorsal rumen. Bags were in duplicate and removed at 2, 4, 8,12, 24, and 48 h time points. Eight bags were removed at 12 h for use in the in vitro intestinal degradability measurement using the modified three-step technique. Contrasts were: SBM vs. BM+LM+CM (SBM vs others), BM vs. LM+CM, and LM vs. CM. In experiment 2, 0 h bags served as a determination of fraction A, while the 48 h bags served as fraction C. Fraction B = 100% - (fraction A + fraction C). Degradation rate (kd) was calculated by converting % CP degraded from 2 to 24 h to Ln and then calculating the slope. In experiment 1, DM degradation was 45.8, 43.8, 76.4 and 100.1 % for SBM, BM, LM, and CM respectively; SBM vs others (<span>P</span> &lt; 0.01), BM vs. LM + CM (<span>P</span> &lt; 0.01), and no difference between LM vs. CM. Fraction A (CP) was 9.9, 8.1, 4.2, and 4.8% respectively; with SBM vs. others (<span>P</span> &lt; 0.03), BM vs. LM+CM (<span>P</span> &lt; 0.01), and no difference between LM vs CM. Fraction B (CP) was 76.2, 62.2, 28.9, and 42.6% respectively; with SBM vs. others (<span>P</span> &lt; 0.01), BM vs. LM + CM (<span>P</span> &lt; 0.01), and LM vs. CM (<span>P</span> &lt; 0.10). Fraction C (CP) was 4.41, 30.8, 46.8, and 37.5% respectively; with SBM vs. others (<span>P</span> &lt; 0.01), BM vs. LM + CM (<span>P</span> &lt; 0.03), and LM vs. CM (<span>P</span> &lt; 0.08). Intestinal CP digestibility was 56.2, 64.7, -5.83, and 10.5% respectively, with SBM vs others (<span>P</span> &lt; 0.01), BM vs LM+CM (<span>P</span> &lt; 0.01), and no difference between LM and CM. Results of these studies indicated that LM and CM may have some benefits in cattle diets, but feeding studies should be conducted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"6fa9ddef1dbd6ea38ae531a7b7dedf23c50b5a674cac093d8da854b226bedfb8","category":"Environment"}