{"title":"What is FTP and why does it matter for cyclists?","link":"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/","date":1684926000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/05/BMC-Kauis-01-One-14-af7a7f7.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"BMC Kaius ONE 01 gravel bike\" title=\"BMC Kauis 01 One - 14\" />                                            <p>FTP stands for Functional Threshold Power, which is defined as the highest average power you can sustain for approximately an hour, measured in watts.</p>\n<p>FTP is one of the most common training metrics used in cycling and is frequently used by coaches as a benchmark metric and to determine training zones when <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-train-with-power/\">training with power</a>. The latest training apps also use FTP to set <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-workouts-training-plans-zwift/\">workouts and training plans</a> when using a smart trainer.</p>\n<p>In this guide, we’ll look at how to determine your FTP, what you can do with that number, and how to improve it. We’ll also consider why FTP might not always be the best tool to guide your training effectively.</p>\n<h2>How to determine your FTP</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Jack Evans doing a 4km time trial on a Watt bike.\" title=\"CZ1_9554\" /></div><div><figcaption><span><i></i> FTP testing requires a gruelling maximal 20-minute effort.</span></figcaption><span> <i>Chris Teagles / Our Media </i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">Indoor cycling apps</a> such as <a href=\"https://www.bikeradar.com/reviews/training/training-software/trainerroad-training-software-review/\">TrainerRoad</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/wahoo-systm-guide/\">Wahoo SYSTM</a> and <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a> use Functional Threshold Power to calibrate workout intensities. For example, Zwift may call for three-minute intervals at 120 per cent of your FTP, with two-minute recoveries in between.</p>\n<p><a href=\"https://www.bikeradar.com/advice/5-tips-for-finding-the-right-coach/\">Cycling coaches</a> use FTP in the same way – to measure progress and to personalise specific training intensities. This is the same process whether working with WorldTour team riders or keen amateurs.</p>\n<p>The previous standard, lactate threshold, involved measuring blood lactate every few minutes while ramping up intensity on a trainer.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Zwift has a Workout feature that is calibrated on your FTP\" title=\"Zwift has a Workout feature that is calibrated on your FTP\" /></div><div><figcaption><span><i></i> Zwift and a number of other training apps use FTP to create personalised workouts on the indoor trainer.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>Dr Andrew Coggan, co-author of <em>Training and Racing with a Power Meter</em>, created the FTP standard as a more practical approach. In functionality, training to lactate threshold and FTP are very similar.</p>\n<p>“FTP has become the gold standard,” says Scott Moninger, a former professional cyclist and coach for <a href=\"https://www.velociouscyclingadventures.com/\" target=\"_blank\">Velocious Cycling Adventures</a>. “Whereas a few years ago you had to go into a lab, now you can get that number with a power meter and a 20-minute field test.</p>\n<p>“In a perfect world, I’d get a cyclist to do a 60-minute time trial, but I can’t ask people to do that,” Moninger says. “Even if you removed the realities of traffic and stoplights, a 60-minute time trial is very difficult to do.”</p>\n<p>So Moninger and most others use a 20-minute field test with a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a>.</p>\n<h2>How to find your FTP with a 20-minute test</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"TrainerRoad iPhone workouts\" title=\"TrainerRoad iPhone workouts\" /></div><div><figcaption><span><i></i> An all-out 20-minute ride is the benchmark test for finding your FTP.</span></figcaption><span> <i>TrainerRoad</i></span></div>\n<p>To measure your FTP, you need a bike with a power meter or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> with an integrated power meter. A bike with a power meter is ideal because you are generally able to generate more power outside than when you’re on a fixed bike inside.</p>\n<p>The key, however, is to make the test repeatable, so you have consistent results from one test to the next.</p>\n<p>After a good warm-up, including one or two hard efforts of four to five minutes, ride as hard as is sustainable for 20 minutes.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Liv Avail Advanced 1 women's road bike\" title=\"Liv Avail Advanced 1 - 23\" /></div><div><figcaption><span><i></i> A modest gradient helps most riders produce high watts.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Moninger recommends finding a road grade of anywhere between 2 and 4 per cent if possible because this will engage more of your glutes and back muscles, and result in the best possible power.</p>\n<p>“I see differences of between five and 15 watts, depending on the person,” Moninger says. “It’s the same with a trainer, and it’s the same reason power on a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\">time-trial bike</a> is lower, even for the best TT riders in the world.”</p>\n<p>Once home, go back and look at your average power for that 20-minute effort. You can use <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">cycling apps</a> such as Garmin Connect, Strava, TrainingPeaks or Wahoo Fitness to do this.</p>\n<p>You can also just use your Garmin, Wahoo or any other compatible <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">bike computer</a> – just remember to start and stop a lap for your 20-minute effort.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ribble CGR Ti Enthusiast road bike\" title=\"Ribble CGR Ti Enthusiast - 21\" /></div><div><figcaption><span><i></i> More explosive riders might need to use a lower percentage of their test score than ‘diesel engines’.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>The standard practice is to use 95 per cent of your 20-minute power as your FTP. But this doesn’t work for every athlete.</p>\n<p>Coach<a href=\"https://www.bikeradar.com/author/tombell/\"> Tom Bell</a>, co-founder of <a href=\"https://www.highnorth.co.uk/\">High North Performance</a> with Dr Emma Wilkins, adjusts the percentage according to an athlete’s characteristics.</p>\n<p>“For athletes who are particularly ‘punchy’ and can produce power outputs over durations of two minutes to five minutes that are far above their 20-minute power, then we’ll generally estimate FTP at around 90 per cent of 20-minute power,” he explains.</p>\n<p>“For athletes who are more ‘diesel engines’, and who have a smaller delta between their five-minute maximal power and their 20-minute maximal power, we’ll use roughly 95 per cent.</p>\n<p>“For athletes who sit between these two extremes, we’d go with something in between, for example 93 per cent.”</p>\n<p>If you don’t have a coach, subjectively assess your strengths and weaknesses to determine which percentage to use.</p>\n<h3>Is your FTP realistic?</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Ineos Grenadiers's Italian rider Filippo Ganna rides to break the hour record with a distance of 56.792km in the Velodrome Suisse, an indoor velodrome in Grenchen, northern Switzerland on October 8, 2022.\" title=\"CYCLING-SUI-MEN-HOUR-RECORD\" /></div><div><figcaption><span><i></i> Your FTP should be sustainable for up to an hour.</span></figcaption><span> <i>VALENTIN FLAURAUD/AFP via Getty Images</i></span></div>\n<p>Remember that FTP is only an estimate, so before taking your test number as gospel, Bell urges athletes to do a reality check.</p>\n<p>“It’s important to be honest with yourself, and ultimately let real-world performance reveal the truth.</p>\n<p>“If your estimated FTP is a value that you know you’d struggle to hold for 30 minutes, let alone 60 minutes, then it’s likely overestimated,” he adds.</p>\n<p>You can subjectively appraise your FTP using the rate of perceived exertion (RPE), says Bell.</p>\n<p>You shouldn’t exceed an RPE of 8-9/10 (with 10 being all-out) within the first 10 to 15 minutes of riding at FTP.</p>\n<h2>What can you do with your FTP?</h2>\n<p>Taking an FTP test doesn’t just leave you in an oxygen-deprived heap and bruise or inflate your ego according to how well you think you have done.</p>\n<p>Your FTP number can help make your training, pacing and racing more effective.</p>\n\n<h3>Learn what effort levels are sustainable for different durations</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Jack Evans riding Haute Route Davos mountain time trial\" title=\"8385_20220925_100201_250827277_original\" /></div><div><figcaption><span><i></i> Riding based on FTP is one of the best pacing methods.</span></figcaption><span> <i>Haute Route</i></span></div>\n<p>The first time you do a 20-minute test, you will probably start out too hard and see your wattage number fade gradually – even if the effort feels the same, start to finish.</p>\n<p>This shows why it’s helpful to have a power meter quantify your power production instead of just relying on feel.</p>\n<p>The more you ride with a power meter, the more you will understand your abilities. Starting a 20-minute climb? Let your buddies blow themselves up going hard for the first couple of minutes while you carefully pace out your effort, riding at your FTP.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/critical-power/\">Critical Power</a> (CP), a similar metric to FTP, is better still for pacing (and many coaches’ preferred testing method).</p>\n<p>You can work out your CP by inputting your average power from a series of maximal efforts into a<a href=\"https://www.highnorth.co.uk/critical-power-calculator\" target=\"_blank\"> Critical Power calculator</a>.</p>\n<p>Then enter your CP number into the Pacing Calculator part of the software to estimate the power you can hold for 3 to 20 minutes.</p>\n<h3>Measure your improvement</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Katherine Moore climbing on the Liv EnviLiv Advanced 1 women's aero road bike\" title=\"Liv EnviLiv_-5\" /></div><div><figcaption><span><i></i> Although power is vanity and speed is sanity, the latter is affected by more external factors.</span></figcaption><span> <i>Sam Voaden / Our Media</i></span></div>\n<p>How do you know if you’re getting fitter and faster? Because you beat your training buddy up a hill? Or because you bettered your time at your local time trial?</p>\n<p>These are useful, but not exactly scientific. Your buddy could have been under the weather and the TT might have had a screaming tailwind. Measuring your FTP is similar to standing on a bathroom scale – that number ain’t gonna lie.</p>\n<p>Moninger recommends testing your FTP every four to six weeks during the season.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Stephen Roche (The Bike Tailor) directing Liam Cahill in the Silverstone Sports Engineering Hub wind tunnel\" title=\"Best value aero upgrades\" /></div><div><figcaption><span><i></i> Get aero to capitalise on your FTP improvements.</span></figcaption><span> <i>Joseph Branston / Our Media</i></span></div>\n<p>How your FTP compares to another rider’s is irrelevant. The highest FTP is not what wins a race. The highest <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-to-weight-ratio/\">power-to-weight ratio</a> will likely win a hill climb and the highest power-to-drag ratio will likely win a flat time trial. But the FTP number in and of itself is not a comparative metric – it’s your personal number for specific training.</p>\n<p>Speaking of that bathroom scale, if your FTP is going up and your <a href=\"https://www.bikeradar.com/advice/nutrition/how-to-lose-weight-cycling/\">weight is going down</a>, you are going to go faster.</p>\n<h3>Calibrate your training zones</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"An athlete's training schedule in TrainerRoad's adaptive training feature\" title=\"TrainerRoad adaptive training\" /></div><div><figcaption><span><i></i> Training software takes account of fitness indicators, including FTP, to make a plan.</span></figcaption><span> <i>TrainerRoad</i></span></div>\n<p>One of the first things training software programs will prompt you for is your FTP.</p>\n<p>Plug in this number and the program will do the rest, whether this is TrainerRoad, Zwift or something else. Many of these programs have built-in tests to help you measure your FTP (<a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-take-ftp-test-zwift/\">Zwift offers either a 20-minute FTP test or a ramp test</a>).</p>\n<p>If you are using a training plan from a book, a magazine, a coach or elsewhere, it will prescribe training by zones. Usually, there are six or seven zones (depending on the coach’s or company’s particular philosophy).</p>\n<p>For training with power, these are based on your FTP and are often determined like this:</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿Zone</th><th>Name</th><th>Heart rate (% of threshold HR)</th><th>Power (% of threshold power)</th><th>Typical duration</th></tr></thead><tbody><tr><td>1</td><td>Active recovery</td><td>Less than 68%</td><td>Less than 55%</td><td>n/a</td>        </tr><tr><td>2</td><td>Endurance</td><td>69-83%</td><td>56-75%</td><td>3+ hours</td>        </tr><tr><td>3</td><td>Tempo / Sweetspot</td><td>84-94%</td><td>76-90%</td><td>20 mins to 1 hour</td>        </tr><tr><td>4</td><td>Threshold</td><td>95-105%</td><td>91-105%</td><td>10 to 30 mins</td>        </tr><tr><td>5</td><td>VO2 max</td><td>More than 106%</td><td>106-120%</td><td>3 to 8 mins</td>        </tr><tr><td>6</td><td>Anaerobic capacity</td><td>n/a</td><td>More than 121%</td><td>30 seconds to 3 mins</td>        </tr></tbody></table></div>\n\n<p>When you hear people talk about doing a tempo ride, or an endurance ride, what they are talking about is training in those specific zones.</p>\n<p><a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">Training zones</a> can be just as important for easy training days as hard ones, helping you to recover effectively and avoid <a href=\"https://www.bikeradar.com/advice/fitness-and-training/overtraining-syndrome/\">overtraining</a>.</p>\n<p>Cyclists are often guilty of going too hard on easy days and are then unable to go as hard as needed on very hard days.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Simon von Bromley of BikeRadar using a time trial bike for Zwift\" title=\"Simon von Bromley of BikeRadar using a time trial bike for Zwift\" /></div><div><figcaption><span><i></i> Most people won’t need different indoor and outdoor training zones.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>As we touched on earlier, most riders will produce more power and record a higher FTP on the road than the trainer.</p>\n<p>But unless the difference is larger than 20 watts, Bell says there is little need to have different indoor and outdoor training zones.</p>\n<p>“In most cases, training zones should already be wide enough to account for differences between indoors and outdoors, particularly when we also factor in the natural day-to-day variation in FTP too,” he adds.</p>\n<p>It’s more important to assess your heart rate, breathing and feeling in your legs. Then, adjust the difficulty of your workout to account for the indoor versus outdoor and day-to-day discrepancy in FTP, according to Bell.</p>\n<h2>How to improve your FTP</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Interval training on Garmin computer\" title=\"Interval training on Garmin computer\" /></div><div><figcaption><span><i></i> Interval training is a tried and tested way to improve your FTP.</span></figcaption><span> <i>TrainerRoad</i></span></div>\n<p>In short, train, ideally following a <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-training-plan/\">structured training plan</a>. Instead of just riding along and hoping for the best, spend time riding in specific zones.</p>\n<p>Whether you opt for a pyramidal (little high intensity, some medium intensity and more low intensity) or polarised (little high intensity, almost no medium intensity and lots of low intensity) training approach, <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">base training</a> is essential, according to Bell.</p>\n<p>“Longer-duration, lower-intensity rides should be a staple, as these help to bring about a range of aerobic adaptations without a great deal of physiological stress, and particularly help develop abilities like fat oxidation, which is a key determinant of FTP,” he says.</p>\n<p>To further raise your FTP, he recommends longer intervals at or above FTP. For example:</p>\n<ul><li>4x 8-10 minutes at 102-108 per cent FTP with 4-5 minutes recovery</li>\n<li>5x 6 mins at 102-108 per cent FTP with 3-4 minutes recovery</li>\n</ul><p>Bell says microburst intervals and over/under workouts (where you alternate between about 105-110 per cent FTP and roughly 80-90 per cent FTP) also work well.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"ENVE Melee (Ultegra Di2 build) road bike\" title=\"ENVE Melee (Ultegra Di2 build) - 12\" /></div><div><figcaption><span><i></i> Some riders find more moderate-intensity riding raises their FTP.</span></figcaption><span> <i>Steve Sayers / Our Media</i></span></div>\n<p>Frank Overton, founder and head coach at <a href=\"https://fascatcoaching.com/\" target=\"_blank\">FasCat Coaching</a>, is a big proponent of <a href=\"https://www.bikeradar.com/advice/fitness-and-training/sweetspot-training/\">sweetspot training</a> as a way to raise FTP and generally be more productive with your training time.</p>\n<p>He and other coaches define the ‘sweetspot’ as an overlap between the top end of zone three (or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/why-you-should-build-tempo-riding-into-your-training-this-spring/\">‘tempo’ riding</a>) and the low end of zone four.</p>\n<p>Overton recommends working sweetspot training into group rides or climbing efforts, but for those who want specific intervals he suggests:</p>\n<ul><li>4x 15 minutes between 84 and 97 per cent of FTP; 10 minutes easy riding between efforts</li>\n<li>2x 20 minutes between 84 and 97 per cent of FTP; five minutes easy riding between efforts</li>\n</ul><h2>How else can you assess your fitness?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"A tech gallery from Tour De Lunsar, Sierra Leone between April 26-30, 2023 Nate Mesmer from US team Mike’s Bikes lead a breakaway on Stage four. The two Mikes Bikes riders donated the Cannondale bikes to Lunsar Cycling Team after the race. The Mike Bike’s Foundation helps to facilitate bike donations from the US to Sierra Leone. They work with partner bike shops in Sierra Leone who pay for the shipping of the bikes. Mikes Bikes runs a strict policy for donations. The criteria the bikes need to meet before they are shipped involves having a market value of over . The partners in Sierra Leone sell the bikes and/or use the parts on the bikes and make profits from the sales that pay wages, help to run racing teams and fund new cycling related projects. There are other organisations running similar schemes. Working Bikes in Chicago, Village Bicycle Project in. Salt Lake City, Mikes Bikes in California and Re-Cycle in the UK.\" title=\"MG_BIke Radar_TDL_212\" /></div><div><figcaption><span><i></i> Comparing efforts at the start and end of a long ride shines light on your endurance.</span></figcaption><span> <i>Matt Grayson </i></span></div>\n<p>FTP testing is time-consuming and tiring, but there are almost countless ways to track your progress less objectively.</p>\n<p>Bell suggests repeating the same interval sessions and analysing your power output, RPE and heart rate.</p>\n<p>“Over time, you should find that your power is improving and/or heart rate and RPE is coming down.</p>\n<p>“Or you may find that you’re able to complete an extra interval in a workout for the same subjective effort level,” he explains.</p>\n<p>Another method is to perform a short maximal effort (one to two minutes) at the start and end of an endurance ride.</p>\n<p>If you repeat the test monthly, you should observe less drop-off in power between your fresh and fatigued efforts as your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-endurance/\">endurance improves</a>, according to Bell.</p>\n<section><div>\n        \n<h2>What are the drawbacks of FTP?</h2>\n<h4>Tom Bell, co-founder of High North Performance, and BikeRadar coaching contributor</h4>\n<p>FTP testing has, in some respects, become an essential cycling test, given that many training platforms use this as the key metric for establishing training intensities and measuring training load.</p>\n<p>However, it’s important to note that it does have limitations.</p>\n<p>In particular, rather than doing a full ~60-minute time trial, the vast majority of cyclists will complete some form of abbreviated FTP test (such as the 20-minute test mentioned above).</p>\n<p>These tests all rely on assumptions about your physiology and the relative energy system contribution during the test.</p>\n<p>In many cyclists (particularly those who are time-limited and/or perform a high proportion of training above their threshold), the FTP estimate from these shorter tests can notably over-estimate the power that could be produced for longer durations.</p>\n<p>The problem is compounded by the fact that FTP tests are highly sensitive to your performance on the day, which can be influenced by factors such as how well the effort was paced, motivation levels, fatigue state and fuelling, to name a few.</p>\n<p>In fact, FTP will change from day to day, and even over the course of a single ride. We therefore prefer to think of FTP as having a range of values and a moving target, rather than one single figure.</p>\n<p>As many people tend to test FTP using abbreviated methods, and on a day when they are feeling particularly motivated and fresh, their FTP often comes out at the higher end of this range, and can result in training zones often being set too high.</p>\n<p>Additionally, while FTP has arguably become the universal indicator of overall cycling performance, it’s not appropriate to all disciplines.</p>\n<p>For example, if you’re training for a short event, then other markers of performance such as <a href=\"https://www.bikeradar.com/advice/fitness-and-training/vo2-max/\">VO2 max</a> and anaerobic capacity will be much more relevant than FTP.</p>\n<p>Likewise, very long endurance events, such as long sportives or multi-day races, can be influenced more by factors such as exercise economy and fat oxidation ability, which are not captured particularly well by FTP.</p>\n<p>Ultimately, FTP testing can help to reveal a piece of the puzzle in terms of how a cyclist’s performance is progressing and, as a near-universal figure, it’s an easy metric to use across multiple training platforms.</p>\n<p>However, it is unable to provide as much insight as some other methods (both lab- and field-based methods, including a critical power test) for riders who want to drill down into the specifics of their physiology and training data.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Jack Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"6fc2d2577a21514afeac49255fbc73b7007c8ccf333f9c82457c1476dac36419","category":"Cycling"}