{"title":"MiR-132-3p suppresses peritoneal fibrosis induced by peritoneal dialysis via targeting TGF-<i>β</i>1/Smad2/3 signaling pathway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301540","date":1712844000000,"content":"<p>by Yangyang Yin, Yuqi Yang, Yongqiang Zhang, Yu Shang, Qian Li, Jing Yuan</p>\r\nBackground <p>Peritoneal fibrosis (PF) is the main complication of peritoneal dialysis (PD) and the most common cause of cessation from PD. There is still no effective therapeutic approach to reserve PF. We aimed to investigate the role of miR-132-3p and underlying potential mechanisms in PF.</p> Methods <p>A total of 18 Sprague-Dawley (SD) rats were divided randomly into three groups (n = 6): (i)Control group (ii)PF group (iii)PF+Losartan group; Rats in the PF group and PF+Losartan group received daily intraperitoneal injections of 3 mg/kg chlorhexidine for 14 days, and rats in the PF+Losartan group simultaneously received daily intraperitoneal injections of 2 mg/kg losartan for 14 days. The control group was injected with saline in the same volume. Met-5A cells were treated for 24h with TGF-<i>β</i>1 dissolved in recombinant buffered saline at a concentration of 10 ng/ml, meanwhile, PBS solution as a negative control. The human peritoneal solution was collected for the detection of miR-132-3p.</p> Results <p><i>In vivo</i>, SD rats were infused with chlorhexidine to establish PF model, and we found that miR-132-3p significantly decreased and the expressions of transforming growth factor-<i>β</i>1 (TGF-<i>β</i>1), and Smad2/3 were up-regulated in PF. <i>In vitro</i>, miR-132-3p mimics suppressed TGF-<i>β</i>1/Smad2/3 activity, whereas miR-132-3p inhibition activated the pathway. In human peritoneal solution, we found that the expression of miR-132-3p decreased in a time-dependent model and its effect became more pronounced with longer PD duration.</p> Conclusion <p>MiR-132-3p ameliorated PF by suppressing TGF-<i>β</i>1/Smad2/3 activity, suggesting that miR-132-3p represented a potential therapeutic approach for PF.</p>","author":"Yangyang Yin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6fc400c38ee2394551bd8c5f4e1bfd9d49b7cc4d37a4a4f2f49474d89cf2f14f","category":"Interdisciplinary"}