{"title":"Geraint Thomas: ‘There’s no ego in this team’","link":"https://cyclingtips.com/2021/06/geraint-thomas-theres-no-ego-in-this-team/","date":1624563178000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/thomas-650x405.jpg\" /></div><h2>Geraint Thomas: 'There's no ego in this team'</h2><p>\n</p><p>With less than two days to go before the start of the 2021 Tour de France, the Ineos Grenadiers continue to avoid naming any one of the multiple stars on their lineup as the outright leader for the French Grand Tour.</p>\n\n\n\n<p>Speaking to the media on Thursday, 2018 Tour winner Geraint Thomas addressed the topic of leadership within the squad, suggesting that the multiple stage racing stars that the Ineos Grenadiers have sent to the Tour are committed to succeeding as a team.</p>\n\n\n\n<p>“Starting with such a strong team is a great position to be in,” he said. “Communication is the main thing. The good thing is that there’s no ego in this team. That’s why we’ve performed as well as we have so far this season.”</p>\n\n\n\n<p>The Ineos Grenadiers have riders in the Tour lineup who could conceivably lead a three-week GC charge in Thomas, Richard Carapaz, Tao Geoghegan Hart, and Richie Porte. While Porte said after his victory at the Critérium du Dauphiné that he expected to be riding for Thomas at the Tour, Porte himself did finish on the podium in the race last year. Carapaz, meanwhile, has won the Tour de Suisse since Porte’s post-Dauphiné comments, and Geoghegan Hart is the most recent Grand Tour winner on the squad, having won last year’s Giro d’Italia.</p>\n\n\n\n<p>The Ineos Grenadiers have, of course, taken a multiple-leader approach to the Tour before. Thomas took his own Tour victory after coming into that year’s race as a co-leader alongside four-time winner Chris Froome. The next year, the team featured Thomas and Egan Bernal as co-leaders, and it was Bernal who stood atop the final podium in Paris with Thomas finishing as runner-up.</p>\n\n\n\n<p>This year, however, the team will have even more potential leaders. In the run-up to the event, the squad has mostly avoided making any clear pronouncements about any leadership hierarchy for the Tour, with team principal Dave Brailsford saying that the Ineos Grenadiers plan to take an aggressive approach to the race.</p>\n\n\n\n<p>With the Grand Départ less than two days away, Thomas hinted that the squad is not planning to protect all four of himself, Carapaz, Geoghegan Hart, and Porte – but that the quartet of stars will see how things develop in the race.</p>\n\n\n\n<p>“There are four guys who potentially can be up there and that’s great. It gives us cards to play later on,” Thomas said.</p>\n\n\n\n<p>“At the same time we can’t get carried away and try to protect four riders. That would be impossible and would take too much out of the other four in the first week. But if we can all be in touching distance, then it can be a great strength. But as we all know, that won’t be the case. Something will happen to somebody, as it always does.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/geraint-thomas-theres-no-ego-in-this-team/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"6fc8f080645f1fb7ba625b8a19b8699c7989d76d0566613adf9eea3efb41c150","category":"Cycling"}