{"title":"Environmental constraints can explain clutch size differences between urban and forest blue tits: Insights from an egg removal experiment","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14171?af=R","date":1725254626000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/beeb98ac-0015-49d2-ac85-cc53a5e37f06/jane14171-toc-0001-m.png\" alt=\"Environmental constraints can explain clutch size differences between urban and forest blue tits: Insights from an egg removal experiment\" />\n<p>In birds, urban populations generally exhibit reduced clutch sizes compared to forest populations. Following an egg removal manipulation that aimed to increase egg production, urban birds did not lay as many new eggs as forest birds, suggesting that environmental constraints could limit the number of eggs that urban females lay.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUrban environments present novel ecological challenges to wild species. In birds, urban populations generally exhibit reduced clutch sizes compared to forest populations. However, whether smaller urban clutches are adaptive or a result of environmental constraints is unclear.\n\nTo investigate these two hypotheses, we quantified the ability of urban and non-urban blue tits (<i>Cyanistes caeruleus</i>) to lay new eggs after an experimental manipulation aimed to increase egg production. We removed the first four eggs laid by urban and forest birds to test their ability to produce new eggs. If the urban environment imposes constraints on egg production, we predicted that urban birds would not lay new eggs. If the small clutches of urban birds are an adaptive response, we predicted they would lay new eggs to reach the optimal clutch size for the environment.\n\nConsistent with the environmental constraint hypothesis, our results suggest that urban females do not lay new eggs to the same extent as forest birds following egg removal. Forest birds laid approximately two new eggs after our experimental manipulation, while urban birds laid approximately 0.36 new eggs following egg removal.\n\nOur manipulation resulted in a brood reduction in the urban experimental nests, yet there was no difference in the number of fledged offspring between urban control and experimental nests. This suggests that females might be misjudging urban habitat quality and produce a clutch with more eggs than nestlings they can rear.\n\nOverall, our results suggest that environmental constraints could limit the number of eggs that urban females lay, generating urban versus non-urban differences in this trait.\n</p>","author":"Mark D. Pitt, \nNorah S. S. Alhowiti, \nClaire J. Branston, \nEugenio Carlon, \nJelle J. Boonekamp, \nDavide M. Dominoni, \nPablo Capilla‐Lasheras","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"6fd3633f743358cb1822f805775daf15a423f5be6a264302ed08ef2da87862d8","category":"Environment"}