{"title":"Los mejores Mac para profesionales de la fotografía","link":"https://www.macworld.com/article/1457994/mejores-mac-edicion-fotografia.html","date":1691592437000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>La fotografía es un arte digitalmente exigente ya que los últimos modelos de cámaras de fotos producen archivos gigantes que a veces ocupan demasiado espacio. Entonces, ¿qué Mac deberías elegir si trabajas con fotografías en tu día a día?</p>\n\n\n\n<p>Echamos un vistazo al mejor Mac para la edición de fotos, así como a algunos kits adicionales que necesitas para subir de nivel en tu fotografía digital.</p>\n\n\n\n<p>Para otras opciones creativas, lee el <a href=\"https://www.macworld.com/article/1453215/el-mejor-mac-que-puedes-comprar-en-2022-si-eres-disenador-grafico.html\">mejor Mac para diseñadores</a> y el <a href=\"https://www.macworld.com/article/1452914/el-mejor-mac-para-editar-video-en-2022.html\">mejor Mac para la edición de vídeo.</a></p>\n\n\n\n<h2>Por qué los y las profesionales de la fotografía prefieren los Mac</h2>\n\n\n\n<p>Hubo un tiempo, en los primeros días de la fotografía digital, en el que los Mac tenían una gran ventaja sobre los PC en lo que respecta a la edición de fotos. Esto fue gracias a una mejor gestión del color y, en los primeros años, a <a href=\"https://www.macworld.com/article/1454291/como-usar-filtros-de-instagram-en-adobe-photoshop-camera.html\">Adobe Photoshop</a>, que solo estuvo disponible en el Mac hasta 1993.</p>\n\n\n\n<p>Gracias a esta ventaja, los Mac se convirtieron en la herramienta preferida de los fotógrafos y, aunque el software de edición fotográfica actual está disponible en todas las plataformas, los Mac de Apple siguen siendo los preferidos de los fotógrafos.</p>\n\n\n\n<p>En las secciones siguientes hablaremos de las especificaciones que hacen del Mac una gran elección para los fotógrafos. También hablaremos de los cambios que se dice que van a llegar a las pantallas de Apple y explicaremos lo que significa para los fotógrafos el paso de Apple de los procesadores basados en Intel a los basados en ARM.</p>\n\n\n\n<p>Lee nuestra guía sobre la <a href=\"https://www.macworld.com/article/1453702/como-editar-las-fotos-con-el-mac.html\">edición de fotos en el Mac</a>. También te puede interesar Cómo conseguir Photoshop en un Mac y cómo conseguir la mejor oferta de Adobe Creative Cloud.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3806269/captura_de_pantalla_2021-06-30_a_las_16_16_47_thumb.png\" alt loading=\"lazy\" /></figure></div>\n\n\n\n<h2>La mejor configuración de Mac para la fotografía</h2>\n\n\n\n<p>Antes de decirte cuáles son, en nuestra opinión, los mejores MacBook y Mac para fotógrafos, vamos a repasar lo que necesitas en términos de especificaciones. Esto es lo que debes tener en cuenta a la hora de elegir.</p>\n\n\n\n<h3>Pantalla</h3>\n\n\n\n<p>Una de las razones por las que los Mac son una gran elección para los y las fotógrafos de hoy en día es su excelente precisión cromática y calidad de pantalla. Por ejemplo, el iMac de 24 pulgadas viene con una pantalla de 4,5K. El iMac de 27 pulgadas tenía una pantalla 5K, pero Apple dejó de fabricar ese modelo en marzo de 2022 y aún no está claro si volverá a haber otro iMac con una pantalla más grande.</p>\n\n\n\n<p>Pero las pantallas de gran calidad no solo están reservadas al iMac. Si quieres un Mac que puedas llevar siempre contigo -para poder editar fotografías cuando estés en el campo-, entonces querrás considerar un <a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-1457994-1-0-0&amp;u=https://www.apple.com/es/macbook-pro/\" target=\"_blank\">MacBook Pro.</a></p>\n\n\n\n<p>El MacBook Pro de 14 pulgadas que se presentó en 2021 y se actualizó en 2023 ofrece una excelente pantalla de 3.024 por 1.964 (es decir, 5,9 millones de píxeles). El MacBook Pro de 16 pulgadas ofrece aún más píxeles: 7,7 millones. De hecho, Apple afirmó que la pantalla del MacBook Pro de 2021 era la mejor pantalla de portátil del mundo cuando se lanzó.</p>\n\n\n\n<p>Se trata de una pantalla Liquid Retina XDR con un rango dinámico extremo de, según Apple: 1.000 nits de brillo y 1.600 nits de brillo máximo. También tiene una relación de contraste de 1.000.000:1, lo que debería permitir ver detalles en las sombras, negros más profundos y colores más vivos.</p>\n\n\n\n<p>Pero lo más importante de las pantallas de 14 y 16 pulgadas del MacBook Pro es que se trata de los primeros, y hasta ahora únicos, Mac con ProMotion. ProMotion llegó por primera vez al iPad Pro y al iPhone 13 Pro y ofrece una frecuencia de refresco adaptativa de hasta 120 Hz (lo que significa que puede refrescar las imágenes 120 veces por segundo). Sin embargo, también puede variar esta frecuencia de refresco en función de lo que se necesite, lo que ahorra batería.</p>\n\n\n\n<p>Si quieres más píxeles, siempre puedes conectar una pantalla independiente de 5K o 6K para usarla con tu MacBook, en cuyo caso cualquier Mac podría ser una gran opción para la edición de fotos. En marzo de 2022, Apple presentó el Studio Display de 27 pulgadas, que se suma al Pro Display XDR de 32 pulgadas. Pero no hace falta gastarse tanto dinero en una pantalla que funcione bien. </p>\n\n\n\n<p>Para más información sobre cómo usar una segunda pantalla con tu Mac, echa un vistazo a cómo usar una segunda pantalla con un Mac, cómo conectar dos o más pantallas a un Mac M1 o M2 y nuestro resumen de los mejores monitores y pantallas para Mac.</p>\n\n\n\n<h3>Procesador</h3>\n\n\n\n<p>Han pasado más de tres años desde que Apple anunció que pasaría de los procesadores Intel a sus propios procesadores Silicon de Apple. Apple ha realizado la transición de todos sus Mac a este nuevo procesador, introduciendo las versiones Pro, Max y Ultra de la generación de chips M1 y M2, entre los que encontrarás varias opciones de CPU y GPU. Es seguro decir que el cambio ha sido increíblemente positivo.</p>\n\n\n\n<p>Una de las ventajas para los y las fotógrafas de los nuevos chips de Apple es que los núcleos de la CPU se dividen en núcleos de rendimiento y núcleos de eficiencia. Esto significa que si tu Mac está indexando tu biblioteca de fotos en segundo plano mientras tú estás ocupado editando una imagen RAW, no deberías experimentar ninguna ralentización, porque las tareas se dividirán entre los núcleos de la forma más eficiente.</p>\n\n\n\n<p>A lo largo de los años que siguieron a la introducción del M1 en octubre de 2020 hemos visto cómo Apple añadía más núcleos de CPU y GPU a las variantes de los chips, culminando en junio de 2023 con el M2 Ultra que ofrece hasta una CPU de 24 núcleos, una GPU de 76 núcleos, 64 GB, 128 GB o 192 GB de RAM y hasta 8 TB de SSD.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3806269/captura_de_pantalla_2021-06-30_a_las_16_18_06_thumb.png\" alt loading=\"lazy\" /></figure></div>\n\n\n\n<h3>Gráficos</h3>\n\n\n\n<p>Si quieres más núcleos gráficos tienes que buscar las configuraciones Pro, Max y Ultra. Si trabajas con imágenes de muy alta resolución, es posible que antes hayas pensado en gráficos discretos, pero los gráficos de Apple están incluidos en el mismo sistema en chip y comparten la memoria unificada con la CPU.</p>\n\n\n\n<p>La buena noticia es que las GPU de Apple han demostrado su valía frente a los gráficos discretos que antes se encontraban en el MacBook Pro de 16 pulgadas con procesador Intel y en el (ya descatalogado) iMac de 27 pulgadas.</p>\n\n\n\n<h3>RAM</h3>\n\n\n\n<p>No es posible actualizar la RAM (también conocida como memoria unificada) en ningún Mac que incorpore un chip de las series M1 o M2, por lo que debes asegurarte de comprar un Mac con suficiente memoria para tus necesidades.</p>\n\n\n\n<p>Esto pone de relieve una desventaja particular con el chip M1, no se puede tener más de 16 GB de memoria unificada en esos modelos. Por suerte, Apple rectificó esta situación con la generación M2, con el chip M2 capaz de soportar 24 GB de RAM. Si quieres aún más RAM, puedes optar por el M2 Pro de hasta 32 GB, el M2 Max de hasta 92 GB y el M2 Ultra, que puede llegar hasta los 192 GB de RAM.</p>\n\n\n\n<p>Sin embargo, 16 GB de RAM deberían ser suficientes. Otra cosa a tener en cuenta es que la RAM en un Mac M1/M2 funciona de forma diferente a la RAM en un Mac Intel. Se conoce como memoria unificada y tanto los núcleos gráficos como los del procesador pueden acceder a ella siempre que lo necesiten.</p>\n\n\n\n<p>Pero si crees que vas a necesitar más de 16 GB de RAM, los modelos Pro, Max o Ultra son la mejor opción.</p>\n\n\n\n<h3>Almacenamiento</h3>\n\n\n\n<p>Como fotógrafo, es probable que uno de tus requisitos principales sea tener suficiente espacio para almacenar tu extensa biblioteca de imágenes, aunque puede que encuentres opciones de almacenamiento en la nube, o almacenamientos externos rentables, que te convengan.</p>\n\n\n\n<p>Sugerimos que la capacidad de almacenamiento mínima a considerar sea de 512 GB. Si quieres más que eso, los Macs M1 ofrecen hasta 2TB SSD, mientras que el MacBook Pro de 16 pulgadas y el iMac de 27 pulgadas llegan a 8TB SSD.</p>\n\n\n\n<p>Tenemos un resumen de las mejores unidades SSD externas para Mac y, si prefiere la capacidad a la velocidad, también hay mejores discos duros externos para Mac.</p>\n\n\n\n<h3>Duración de la batería</h3>\n\n\n\n<p>Un último aspecto que importará mucho si es probable que utilices tu Mac para editar fotos cuando estés fuera visitando a clientes es la duración de la batería. En este aspecto, los Mac con procesadores propios de Apple realmente toman la delantera a sus predecesores con tecnología Intel: el MacBook Pro de 16 pulgadas ofrece 22 horas de autonomía, frente a las 11 horas anteriores. Así es como se compara la duración de la batería de los Mac actuales:</p>\n\n\n\n<p></p>\n\n\n\n<ul>\n<li>MacBook Air de 13 pulgadas, M2 – hasta 18 horas</li>\n\n\n\n<li>MacBook Air de 15 pulgadas, M2 – hasta 18 horas</li>\n\n\n\n<li>MacBook Pro de 14 pulgadas, M2 Pro/M2 Max: hasta 18 horas</li>\n\n\n\n<li>MacBook Pro de 13 pulgadas, M2 – hasta 20 horas</li>\n\n\n\n<li>MacBook Pro de 16 pulgadas, M2 Pro/M2 Max – hasta 22 horas</li>\n</ul>\n\n\n\n<h3>Puertos</h3>\n\n\n\n<p>El MacBook Pro de 13 pulgadas y el MacBook Air de 13/15 pulgadas ofrecen dos puertos Thunderbolt/USB 4 y, siempre que adquieras un modelo M2, un puerto de carga MagSafe adicional. Esto puede ser suficiente para tus necesidades; echa un vistazo a estos adaptadores y concentradores USB C si quieres añadir más puertos. </p>\n\n\n\n<p>Por ejemplo, el <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.amazon.es/Twelve-South-Delgado-Tablets-Adaptador/dp/B09C9W6SCC/&amp;xcust=1-1-1457994-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Twelve South StayGo</a> cuesta 99,99 euros en Amazon, y amplía tu Mac con ocho puertos extra, incluyendo USB-C 3.1 para cargar el portátil con Power Delivery (PD) de 85W; un puerto HDMI; dos puertos USB-A 3.0 a 5Gbps, y otro puerto USB-A; Gigabit Ethernet; y lectores de tarjetas SD y Micro SD.</p>\n\n\n\n<p>El iMac de 24 pulgadas tiene una selección diferente de puertos según el modelo que elijas. Uno de los iMac de 24 pulgadas ofrece dos puertos Thunderbolt/USB 4, mientras que el otro ofrece dos puertos USB 3 adicionales. Sin embargo, este modelo de iMac más pequeño ya no tiene lector de tarjetas.</p>\n\n\n\n<p>El Mac mini también tiene una buena selección de puertos, entre los que se incluyen dos puertos Thunderbolt/USB 4, dos puertos USB-A y un puerto HDMI. Sin embargo, el Mac mini carece del lector de tarjetas SDXD que ofrecen el Mac Studio y los modelos MacBook Pro de 14 y 16 pulgadas.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3806269/apple_mac_mini_2018_review_3_thumb.jpeg\" alt loading=\"lazy\" /></figure></div>\n\n\n\n<h2>¿Mac o MacBook para la edición de fotos?</h2>\n\n\n\n<p>La elección de un Mac para la edición fotográfica depende del uso que le vayas a dar al dispositivo. ¿Deseas poder editar fotografías sobre la marcha o prefieres hacer tus ediciones desde la comodidad de tu estudio?</p>\n\n\n\n<p>Si sabes que vas a tener que editar sobre el terreno, el MacBook Pro es claramente la mejor opción. Pero, ¿y si quieres una pantalla grande para editar las fotografías?</p>\n\n\n\n<p>La pantalla del MacBook Pro de 16 pulgadas es grande, pero podrías pensar que el iMac de 5K sería el más adecuado, y lo sería, pero podrías conectar una segunda pantalla de 6K a tu MacBook cuando estés de vuelta en tu escritorio.</p>\n\n\n\n<p>Basándonos en esto, creemos que un MacBook Pro es la mejor opción para los fotógrafos, pero ¿qué modelo? Sigue leyendo para descubrirlo.</p>\n\n\n\n<h2>Los mejor MacBook para la edición de fotos</h2>\n\n\n\n<p>Si quieres poder editar imágenes sobre la marcha, un portátil Mac con una pantalla de tamaño decente te será de gran ayuda.</p>\n\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t1.  Apple 16-inch MacBook Pro (M2 Pro, 2023)\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"1800\" height=\"1013\" alt=\"Apple 16-inch MacBook Pro (M2 Pro, 2023)\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/16-inch-MacBook-Pro-2023.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tdesde $59,999\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Prácticamente cualquier MacBook de la gama actual será lo suficientemente bueno para la edición fotográfica, pero tus necesidades determinarán cuál es la mejor opción para ti.</p>\n\n<p>Si eres fotógrafo o fotógrafa profesional que probablemente necesites editar imágenes de muy alta resolución y en formato RAW, entonces el MacBook Pro de 16 pulgadas, con su gran pantalla y su potente configuración, sería la mejor opción.</p>\n\n<p>El hecho de que este modelo te permita maximizar la RAM hasta 64 GB (o incluso 96 GB si optas por un chip M2 Max) y maximizar el almacenamiento es un verdadero punto a su favor.</p>\n\n<p>Los gráficos del M2 Pro o del M2 Mac, comparados con los gráficos de los Mac M1 y M2, son probablemente una verdadera ventaja si trabajas con imágenes de gran tamaño.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1482414/review-macbook-pro-16-2023.html\" target=\"_blank\">\n\t\t\t\t\t\t Review Apple 16-inch MacBook Pro (M2 Pro, 2023)\t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t2.  Apple 14-inch MacBook Pro (M2 Pro, 2023)\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"1800\" height=\"1013\" alt=\"Apple 14-inch MacBook Pro (M2 Pro, 2023)\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/14-inch-macbook-pro-2023.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tdesde $49,999\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cyberpuerta.mx/Apple/Mac/MacBook-Pro/Apple-MacBook-Pro-Retina-MPHH3E-A-14-2-Apple-M2-Pro-16GB-512GB-SSD-Plata-Enero-2023.html&amp;xcust=1-1-1457994-6-1475624-9934&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$46579 at  CyberPuerta</a><a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-1457994-6-1475624-9934&amp;u=https://www.apple.com/mx/shop/buy-mac/macbook-pro\" target=\"_blank\">$49999 at  Apple</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Todo lo relacionado con el MacBook Pro de 16 pulgadas también se aplica al MacBook Pro de 14 pulgadas, lo que podría ser una forma de ahorrar algo de dinero si no necesitas el tamaño de pantalla adicional. También puedes considerar que la pantalla del MacBook Pro de 14 pulgadas es lo suficientemente grande si vas a conectarlo a un monitor externo cuando estés en el estudio. Consulta nuestras mejores selecciones de pantallas para Mac.</p>\n\n<p>Las especificaciones son prácticamente idénticas a las del modelo más grande, salvo que en el nivel básico hay un modelo con una GPU de 16 núcleos en lugar de 19 núcleos. Este modelo, que cuesta algo menos que el resto, puede ser suficiente para tus necesidades.</p>\n\n<p>Si los más de 2000 que cuesta siguen siendo demasiado, hay también otras opciones. Podrías echar un vistazo al Mac mini con M2 Pro o, si tu criterio principal es un portátil Mac con una pantalla grande, podrías considerar el MacBook Air de 15 pulgadas, del que hablaremos a continuación.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1948062/comparativa-macbook-air-15-pulgadas-macbook-pro-14-pulgadas.html\" target=\"_blank\">\n\t\t\t\t\t\t Review Apple 14-inch MacBook Pro (M2 Pro, 2023)\t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t3.  Apple 15-inch MacBook Air (M2, 2023)\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"2000\" height=\"1125\" alt=\"Apple 15-inch MacBook Air (M2, 2023)\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Apple-MacBook-Air-15in-02.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tdesde $29,999\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-1457994-6-1944104-9934&amp;u=https://www.apple.com/mx/shop/buy-mac/macbook-air\" target=\"_blank\">$29999 at  Apple</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Apple presentó el MacBook Air de 15 pulgadas en junio de 2023. Aunque puede que se vea algo perjudicado por su chip M2, es la forma más barata de conseguir una pantalla más grande en un portátil Mac.</p>\n\n<p>Si estás pensando en comprar el MacBook Air de 15 pulgadas con vistas a utilizarlo para editar fotografías, te sugerimos que amplíes el almacenamiento a 512 GB, ya que se ha descubierto que el SSD de 256 GB es más lento (y probablemente querrás el almacenamiento adicional de todos modos). También te recomendaríamos que adquirieras 16 GB de memoria unificada (o más si tu presupuesto te lo permite). Con 512 GB y 16 GB de RAM el precio será menos que el del MacBook Pro de 14 pulgadas, así que no es un ahorro tan grande como cabría esperar.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1948062/comparativa-macbook-air-15-pulgadas-macbook-pro-14-pulgadas.html\" target=\"_blank\">\n\t\t\t\t\t\t Review Apple 15-inch MacBook Air (M2, 2023)\t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t</div>\n\n\t\t\n\n\n<h2>Mejor Mac de sobremesa para la edición de fotos</h2>\n\n\n\n<p>Si realizas la edición en casa en lugar de in situ, existen algunas buenas opciones en lo que respecta a los Mac.</p>\n\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t1.  Apple Mac mini (M2 Pro, 2023)\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"1960\" height=\"1102\" alt=\"Apple Mac mini (M2 Pro, 2023)\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/01/comprar-mac-mini-m2-pro-m2-max_1.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tdesde $31,999\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-1457994-6-1481081-9934&amp;u=https://www.apple.com/mx/shop/buy-mac/mac-mini/chip-m2-pro-de-apple-con-cpu-de-10-n%C3%BAcleos-y-gpu-de-16-n%C3%BAcleos-512gb\" target=\"_blank\">$31999 at  Apple</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Si quieres un M2 Pro no tienes por qué pagar los precios del MacBook Pro. Hay un Mac mini con M2 Pro que cuesta 1.568,85 € y, aunque también necesitarás una pantalla, un ratón y un teclado, ese precio es lo suficientemente inferior al del MacBook Pro de 14 pulgadas como para comprar una pantalla realmente buena.</p>\n\n<p>Al igual que con el MacBook Pro de 14 pulgadas, el modelo estándar ofrece una GPU de 16 núcleos, pero puedes actualizarla a la de 19 si crees que te va a beneficiar.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1482231/review-mac-mini-m2-pro.html\" target=\"_blank\">\n\t\t\t\t\t\t Review Apple Mac mini (M2 Pro, 2023)\t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t2.  Apple Mac Studio (M2 Max, 2023)\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"1920\" height=\"1080\" alt=\"Apple Mac Studio (M2 Max, 2023)\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/06/Mac-Studio.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tdesde $45,999\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/312327/435278/7614?subId1=1-1-1457994-6-1944072-9934&amp;u=https://www.apple.com/mx/shop/buy-mac/mac-studio\" target=\"_blank\">$45999 at  Apple</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n<p>Si quieres más potencia en tu Mac de sobremesa, puedes gastarte un poco más en el Mac Studio, que es la forma más barata de conseguir el M2 Max (que también es una opción en los MacBook Pro de 14 y 16 pulgadas).</p>\n\n<p>Al igual que el Mac mini, necesitarás un monitor, un ratón y un teclado, pero es posible que ya los tengas. El Mac Studio básico ofrece una CPU de 12 núcleos y una GPU de 30 núcleos, 32 GB de memoria unificada y un montón de puertos. Es una máquina muy potente por una fracción del precio del MacBook Pro M2 Max.</p>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1951673/review-mac-studio-m2-max.html\" target=\"_blank\">\n\t\t\t\t\t\t Review Apple Mac Studio (M2 Max, 2023)\t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t</div>\n\n\t\t\n\n\n<div></div>\n\n\n\n\n<p><em>Artículo original publicado en la edición en inglés de<a href=\"https://www.macworld.com/article/676023/best-mac-for-photo-editing.html\" target=\"_blank\"> Macworld.com</a></em>.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"6fd487e03d66a81cb0b15dbf8b42be0ce79e81d2cfc51ee84f4eaaa4425a7bf0","category":"Apple"}