{"title":"Buffer overruns, license violations, and bad code: FreeBSD 13’s close call","link":"https://arstechnica.com/?p=1751073","date":1616752805000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/freebsd-beastie-this-is-fine-800x450.jpg\" alt=\"FreeBSD's core development team, for the most part, does not appear to see the need to update their review and approval procedures.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/freebsd-beastie-this-is-fine.jpg\" class=\"enlarge-link\" data-height=\"844\" data-width=\"1500\">Enlarge</a> <span class=\"sep\">/</span> FreeBSD's core development team, for the most part, does not appear to see the need to update their review and approval procedures. (credit: Aurich Lawson (after KC Green))</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>At first glance, Matthew Macy seemed like a perfectly reasonable choice to port WireGuard into the FreeBSD kernel. WireGuard is an encrypted point-to-point tunneling protocol, part of what most people think of as a \"VPN.\" FreeBSD is a Unix-like operating system that powers everything from Cisco and Juniper routers to Netflix's network stack, and Macy had plenty of experience on its dev team, including work on multiple network drivers.</p>\n<p>So when Jim Thompson, the CEO of Netgate, which makes FreeBSD-powered routers, decided it was time for FreeBSD to enjoy the same level of in-kernel WireGuard support that Linux does, he reached out to offer Macy a contract. Macy would port WireGuard into the FreeBSD kernel, where Netgate could then use it in the company's popular pfSense router distribution. The contract was offered without deadlines or milestones; Macy was simply to get the job done on his own schedule.</p>\n<p>With Macy's level of experience—with kernel coding and network stacks in particular—the project looked like a slam dunk. But things went awry almost immediately. WireGuard founding developer Jason Donenfeld didn't hear about the project until it surfaced on a FreeBSD mailing list, and Macy didn't seem interested in Donenfeld's assistance when offered. After roughly nine months of part-time development, Macy committed his port—largely unreviewed and inadequately tested—directly into the HEAD section of FreeBSD's code repository, where it was scheduled for incorporation into FreeBSD 13.0-RELEASE.</p></div><p><a href=\"https://arstechnica.com/?p=1751073#p3\">Read 66 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1751073&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"6fe27195f1d22e037550c94132cd62eb595195bd5a900f1d4542eb00b48e6229","category":"Tech"}