{"title":"Drought Risk Assessment for the Agriculture System in Afghanistan: A Spatial Analysis of Hazard, Exposure and Vulnerability","link":"https://www.preprints.org/manuscript/202407.1647/v1","date":1721635144000,"content":"Despite decades of conflict and political instability, drought has also severely affected Afghanistan’s rural population and agriculture sector. Agriculture is a primary livelihood source in the country, and recurring droughts have put cascading pressures on the agricultural economy and food security. Therefore, understanding the key drivers of all risk components through a comprehensive risk assessment is critical for proactive drought risk management. This study assesses agricultural drought risk from an integrated perspective, emphasizing the combined effects of drought hazard, exposure, and vulnerability. Multi-methods research was conducted, employing remote-sensing-based analysis covering a period from 2001 to 2023. We used the Vegetation Condition Index (VCI) to analyze the drought hazard for the agricultural system during the winter growing season. The vulnerability indicators and exposure levels of the agricultural system were determined through spatial analysis combined with a literature review and expert consultation. An adapted conceptual framework of the Intergovernmental Panel on Climate Change (IPCC) was utilized, which incorporates hazard, exposure, and vulnerability to define risk. The results revealed that droughts occur frequently and in changing patterns throughout the country. All provinces have experienced drought over the past two decades, albeit with varying severities and frequencies. Severe droughts were observed in 2001-2002, 2008, 2011, 2018, and consecutively in 2021-2022-2023. Drought vulnerability and exposure vary widely across the country, particularly in the northern, western, and southern provinces. The final calculated risk shows that most provinces in southern and southwestern zones face a high risk of recurrent droughts, further exacerbating agricultural challenges in these regions. Such analyses under a multimethod approach provide information on spatial patterns of drought risk and drivers of agricultural systems that can support decision-makers and policymakers in formulating strategies to reduce drought risk and adapt to the agricultural sector.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"6ff2433dd27dd5b0fec7507eed2adca5458e37311e3ced10d271a977135a0aa3","category":"Interdisciplinary"}