{"title":"The top 10 riders of the Women’s WorldTour in 2023","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-top-ten-riders-of-the-women-s-worldtour-in-2023","date":1703660400000,"content":"\n      <p><span>As the women’s sport continues to grow, so does the strength-in-depth in the peloton. With a total of 27 different races, the 2023 Women’s WorldTour was the biggest and most expansive yet, with more races allowing for a greater number of riders to win top level races. The dominance of SD Worx may have made it feel at times as though no other teams were getting a look in, but there were still others who managed to resist their supremacy and excel themselves. </span></p>\n<div></div>\n<div></div>\n<p><span>It was also a season that saw a changing of the guard at the very top of the sport. After years of consistent brilliance, this was Annemiek Van Vleuten’s final season as a professional, and her previously untouched dominance was at last challenged by other stars arriving into the prime of their career.</span></p>\n<p><span>We looked at the top 10 best performers of the season, and chose the rider we think shined above all others.</span></p>\n<h3><b>10. Chloe Dygert</b></h3>\n<p><span>Following years of fitness woes that looked like it might curtail her career permanently, this was the season that Chloe Dygert returned, and started to fulfil the huge potential she’d shown back in 2019 when she so stunningly won the elite time trial at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">World Championships</a>. Victory in that same race was the highlight of her 2023, not only as a reclamation of her status as the best time trialist in the world, but also in how it completed a redemption arc following the horror crash she suffered in the 2020 edition. This year wasn’t just about returning to her previous form, but saw her develop as a rider, showcasing a quicker sprint finish that earned her multiple podium finishes in top races including stages at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/eight-stages-blockhaus-and-a-broader-route-how-rcs-is-stepping-up-the-giro-d-italia-women\">Giro Donne</a>, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-femenina-2023-everything-you-need-to-know\">Vuelta Femenin</a>a and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/ridelondon-classique-preview-route-contenders-and-prediction\">RideLondon Classique</a>, as well as a World title on the track in the individual pursuit. </span></p>\n<h3><b>9. Cecilie Uttrup Ludwig</b></h3>\n<p><span>Though her quirky off-bike personality suggests somebody spontaneous and unpredictable, on the bike Cecilie Uttrup Ludwig continues to be one of the most dependably consistent riders in the peloton. She even repeated her exact finishes from last year at both the Giro and the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> of sixth and seventh overall respectively, while being in the mix for many of the Classics, most notably <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a>, where she was third. Crucially, this consistency was also occasionally spiced up with a bit of glory, including a star turn at her home Tour of Scandinavia, which saw her win two stages and claim second overall, victory at the Giro d’Emilia Classics, and a third place at the World Championships, a landmark first-ever senior Worlds medal. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TMX_161100.jpg?v=1702979984\" /></span></p>\n<h3><b>8. Gaia Realini</b></h3>\n<p><span>Elisa Longo Borghini’s fitness problems and Lizzie Deignan’s gradual return post-pregnancy meant Trek-Segafredo took a bit of a spanking from archrivals SD Worx this year, but there was one shining light in Gaia Realini. The young Italian was one of the revelations of the season, first drawing attention in February at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour </a>where she led team leader Borghini all the way to the top of the Jebel Hafeet mountain to take a one-two on both the stage and the GC, then starring up against the world’s best with podium finishes on GC at both the Vuelta Femenina and Giro Donne. Even though her form did tail a little towards the end of the year, these performances proved that she’s already among the very best climbers in the world.  </span></p>\n<h3><b>7. Kasia Niewiadoma </b></h3>\n<p><span>After a typically solid Classics campaign (including fifth at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> and fourth at Amstel Gold) and some high stage races finishes (third at Itzulia and fourth at the Tour de Romandie), Kasia Niewiadoma’s season really came to life at the Tour de France Femmes, where for a few thrilling kilometres on the Col du Tourmalet, she threatened to win the whole thing. Though her audacious attack was eventually neutralised by Demi Vollering, it was still enough to see her place a very impressive third overall at what is the biggest race on the calendar. Another podium finish came at the Tour de Suisse, where she placed second overall, but still the longed-for end to her four-year drought without a win continued — until October, when she got the better of Vollering and Silvia Persico to delightedly be crowned Gravel World Champion – a victory she said “repays an entire season”. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/506756-Kasia_Niewiadoma_-_credit-Thomas_Maheux-5f2a5e-original-1697006570_png_058c870f-10d0-49eb-85f7-6098fb37a863.jpg?v=1702980005\" /></span></p>\n<h3><b>6. Charlotte Kool</b></h3>\n<p><span>The departure of Lorena Wiebes, the sprinter responsible for the vast majority of the team’s victories over the last year, threatened the onset of a crisis at Team dsm-firmenich, but thankfully, the void left by her was more than ably filled by Charlotte Kool. Kool had no problem making the transition from Wiebes’ lead-out rider to being the team’s sprinter, even getting the better of the formerly invincible sprinter in three of her ten sprint wins. That total made her the most prolific sprinter of 2023, and came mostly in top level WorldTour races, while a couple of prologue victories and the overall at the RideLondon Classique made for a grand total of 13 wins. </span></p>\n<h3>\n<b>5. Lorena Wiebes</b><span> </span>\n</h3>\n<p><span>Not content with only being the best sprinter in the world, and knowing that she would not be the automatic team leader as often for her new team SD Worx, Lorena Wiebes widened her repertoire in 2023 to great effect. She mastered the cobbled climbs of Belgium to play a crucial role in the team’s successful Classics campaign, took a medal on the Gravel at the European Championships, and even finished second overall behind team-mate Lotte Kopecky at the Simac Ladies Tour. And although she wasn’t quite as prolific in the bunch sprints as previous seasons, the wins still kept coming thick and fast, with stages at the Tour and Giro as well as Classics like Scheldeprijs and Ronde van Drenthe.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1464736155_8759763d-6920-4f47-abaa-1e6d31e175ef.jpg?v=1702980167\" /></span></p>\n<h3><b>4. Marlen Reusser</b></h3>\n<p><span>During her second season riding for SD Worx, Marlen Reusser came into her own, expanding upon her role from 2022 as luxury super-domestique to achieve a huge amount of individual glory. Relishing her upgraded role as co-leader, not only did Reusser register podium finishes for herself while playing a key role helping Demi Vollering win at the Tour de Romandie and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège–Bastogne–Liège</a>, she also picked up some of the biggest victories of her own career in everything from overall stage race titles at Itzulia and the Tour de Suisse, the Gent-Wevelgem Classic, and the individual time trial stage of the Tour de France Femmes. She might have pulled out exhausted during the World Championships time trial, but it hardly mattered now that Reusser has become such a multifaceted star. </span></p>\n<h3><b>3. Annemiek van Vleuten</b></h3>\n<p><span>The final season in the extraordinary career of Annemiek van Vleuten got off to a relatively subdued start as she wasn’t quite her usual domineering self in the spring Classics, but she was building her form to peak in time for Grand Tours. And there, as has been the case for so much of her career, she reigned supreme, defending her Vuelta Femenina title by a whisker ahead of Demi Vollering, before crushing the opposition for a fourth Giro Donne title. The dream was a repeat of her Grand Tour grand slam from last year, but the Col du Tourmalet proved to be a bridge too far for her 40-year-old legs at the Tour de France Femmes, and she could only manage fourth overall. Perhaps it is indeed the right time to retire, therefore, although there was still time for her to end her career on a high with yet another overall stage race victory at the Tour of Scandinavia. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2288.jpg?v=1702980346\" /></span></p>\n<h3><b>2. Lotte Kopecky</b></h3>\n<p><span>As the star rider in cycling-mad Belgium, and who has been credited with popularising the women’s sport there, it sometimes seems as though Lotte Kopecky is carrying the weight of a nation on her shoulders, and has occasionally fallen short of the unreasonably high expectations demanded of her. Not in 2023 though, during which she stormed to 14 victories, including a defence of her Tour of Flanders title, and the fulfilment of her dream of winning the World Championships. </span></p>\n<p><span>Even the races she failed to win weren't really defeats, as they were usually runner-up finishes behind team-mates — most astonishingly of all at the Tour de France Femmes, where she climbed as nobody thought she was capable of to finish second overall, defeated only by SD Worx team-mate Demi Vollering. It was an incredible season, only a <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> victory away from being perfect. </span></p>\n<h3>\n<b>1. Demi Vollering</b><span> </span>\n</h3>\n<p><span>Though there were signs last year that Demi Vollering was ready to challenge Annemiek van Vleuten as the best rider in the world, the way in which she so categorically usurped her in 2023 was breathtaking. The changing of the guard was confirmed on the Col du Tourmalet in July, when Vollering rode away from her compatriot and the rest of the field to take the yellow jersey at the Tour de France Femmes. But, in truth, it had seemed inevitable from early in the season following her dominant displays to claim overall victory at the Vuelta a Burgos and help SD Worx team-mate Marlen Reusser to win Itzulia and the Tour de Suisse. </span></p>\n<p><span>In the hilly Classics, she was even more dominant, triumphing at each of Strade Bianche, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\">Amstel Gold</a>, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-fleche-wallonne-femmes-preview-route-predictions-and-contenders\">Flèche Wallonne</a> and Liège–Bastogne–Liège – a quartet that even Van Vleuten nor Anna van der Breggen ever managed to achieve in the same season, putting Vollering’s 2023 up alongside the very best of those two greats.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230730TDFFAZ0082-A.S.O._Thomas_Maheux-2.jpg?v=1702988711\" /></span></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"6ff9ef1afe75eeaf49b1969d304cf67a83c916e955b8c2c941b82f4a5466d731","category":"Cycling"}