{"title":"Metabolic profiles in drought-tolerant wheat with enhanced abscisic acid sensitivity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307393","date":1721656800000,"content":"<p>by Yuanjie Weng, Ryosuke Mega, Fumitaka Abe, Hisashi Tsujimoto, Masanori Okamoto</p>\r\n\r\nGlobal warming has led to the expansion of arid lands and more frequent droughts, which are the largest cause of global food production losses. In our previous study, we developed TaPYLox wheat overexpressing the plant hormone abscisic acid (ABA) receptor, which is important for the drought stress response in plants. TaPYLox showed resistance to drought stress and acquired water-saving traits that enable efficient grain production with less water use. In this study, we used TaPYLox to identify ABA-dependent and -independent metabolites in response to drought stress. We compared the variation of metabolites in wheat under well-watered, ABA treatment, and drought stress conditions using the ABA-sensitive TaPYLox line and control lines. The results showed that tagatose and L-serine were ABA-dependently regulated metabolites, because their stress-induced accumulation was increased by ABA treatment in TaPYLox. In contrast, L-valine, L-leucine, and DL-isoleucine, which are classified as branched chain amino acids, were not increased by ABA treatment in TaPYLox, suggesting that they are metabolites regulated in an ABA-independent manner. Interestingly, the accumulation of L-valine, L-leucine, and DL-isoleucine was suppressed in drought-tolerant TaPYLox under drought stress, suggesting that drought-tolerant wheat might be low in these amino acids. 3-dehydroshikimic acid and α-ketoglutaric acid were decreased by drought stress in an ABA-independent manner. In this study, we have succeeded in identifying metabolites that are regulated by drought stress in an ABA-dependent and -independent manner. The findings of this study should be useful for future breeding of drought-tolerant wheat.","author":"Yuanjie Weng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6ffa618a6e4abfabb30afb332de6e57e2c47d390d37a1bc3ba7a5778b3ee3180","category":"Interdisciplinary"}