{"title":"Utility values and electronic device use in low-vision people attending rehabilitation services: Data from a nation-wide registry in Italy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308569","date":1723212000000,"content":"<p>by Gianni Virgili, Eliana Costanzo, Ilaria Biagini, Mariacristina Parravano, Alessia Di Simone, Filippo Amore, Mauro Tettamanti, Simona Di Pietro, Giovanni L. Ciaffoni, Giovanni Sato, Giovanni Giacomelli, Federico Bartolomei</p>\r\nPurpose <p>To estimate utility values associated with visual loss using EuroQol (EQ-5D) questionnaire, the impact of low-vision (LV) device use on utilities and the contribution of Instrumental Activities of Daily Living (IADL) score in patients attending vision rehabilitation (VR) services enrolled in the Italian Device &amp; Aids Register (D.A.Re).</p> Methods <p>This is a multicenter, prospective, cross-sectional study. D.A.Re. collects general and clinical information, vision-specific variables, use of electronic devices and quality of life questionnaires.</p> Results <p>A total of 442 patients (75.0±16.6 years, 275 female) were included, 88 (19.9%) used specialised electronic LV devices, and 116 (26.2%) used smartphones and tablets. Users of smartphones and tablets were younger than non-users (67.5 vs. 77.6 years, p&lt;0.001), but overall, their age ranged between 20 and 93. Stronger associations were found between vision-specific variables and IADL score compared to EQ-5D score. In multivariable age-adjusted models, the utility value of using smartphones and tablets on EQ-5D score was 0.12 (p&lt;0.01), slightly larger than that of 1.0 logMAR difference (-0.09, p&lt;0.01) or visual field damage within 10° of fixation (-0.10, p&lt;0.01). Use of portable low-vision electronic devices and being employed or student (vs. retired) was also associated with better utility values (0.12 and 0.15, respectively, p&lt;0.05).</p> Conclusions <p>Visual loss is associated with loss of utilities in Italian patients attending VR services, whereas special-purpose electronic aids, and smartphone and tablet use are associated with better utility values. We found that IADL may be more sensitive to visual loss than EQ-5D and could be a valid health-related quality of life outcome in trials on VR.</p>","author":"Gianni Virgili","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"6ffde900f35049fd6fe49667607c36c60fd6e73917b13ae6538e0ae54f7bbb87","category":"Interdisciplinary"}