{"title":"Rocket Report: NASA to test new RS-25 engines; Russia’s phantom rockets","link":"https://arstechnica.com/?p=1973490","date":1696590021000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/20230917-DSC_0796-800x531.jpg\" alt=\"Stoke Space's Hopper 2 takes to the skies in September in Moses Lake, Washington.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/20230917-DSC_0796-scaled.jpg\">Enlarge</a> <span>/</span> Stoke Space's Hopper 2 takes to the skies in September in Moses Lake, Washington. (credit: Stoke Space)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.14 of the Rocket Report! The big news this week is that Stoke Space, which is seeking to build a fully reusable rocket, has secured a significant amount of funding that should help it get closer to a debut launch within a couple of years. I also like the name they've chosen for their rocket—Nova.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Stoke Space raises $100 million, names rocket</strong>. On Thursday afternoon, the small launch company announced it had secured $100 million in new funding, bringing the total amount raised to $175 million. The new Series B investment is being led by Industrious Ventures with participation from the University of Michigan, Sparta Group, Long Journey, and others. Stoke intends to use the funding to finance the development of its first-stage rocket engine and structure, the orbital version of its reusable second stage, and new construction at the historic Launch Complex 14 at Cape Canaveral Space Force Station, Florida.</p></div><p><a href=\"https://arstechnica.com/?p=1973490#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973490&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7000b1db6df5ea2fc039cfe6d88834bb6c4cfa15e5e3a004886c9a76a3d8a246","category":"Tech"}