{"title":"Range‐wide prediction of habitat suitability for king cobras under current and future scenarios在当前和未来情景下眼镜王蛇栖息地适宜性的全域预测","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.52?af=R","date":1719474874000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/81e5d0ec-7223-44aa-9bb9-b0de1d9078eb/inc352-gra-0001-m.png\" alt=\"Range-wide prediction of habitat suitability for king cobras under current and future scenarios 在当前和未来情景下眼镜王蛇栖息地适宜性的全域预测\" /><p>Potential distribution scenarios of <i>Ophiophagus hannah</i> in current and future climate change scenarios indicate highly suitable areas for this reptile will increase over the period and will shift towards the north of Asia. This may have a prospective alteration in human-snake encounters in these areas of Asia accordingly.\n\n</p><br />\n<h2>Abstract</h2>\n<p><i>Ophiophagus hannah</i>, commonly known as the king cobra, is listed as vulnerable by the International Union for Conservation of Nature (IUCN) and is protected under national laws in most countries. This charismatic species faces multiple threats, including habitat loss, human persecution, illegal trafficking, and climate change. Due to the king cobra's sensitivity to environmental conditions, its population status and trends are barely understood. This study used the MaxEnt algorithm to predict the potential distribution of king cobras across Asia, a method that has been successfully implemented in modeling distributions of various species in the region. The findings showed that Evergreen Broadleaf Trees emerged as the most influential variable for the distribution of <i>Ophiophagus hannah</i> with a 27.3% contribution, followed by the Mean Diurnal Range and Urban/Built-up areas. Jackknife analysis identified the Mean Diurnal Range as having the highest testing gain. Approximately 413,268 km<sup>2</sup> were found to have the most suitable climatic conditions for sustaining this species. Countries such as India, Myanmar, Bangladesh, Vietnam, Cambodia, Indonesia, and Malaysia were identified as having favorable conditions. Under the future climate scenario SSP5-8.5, the extent of suitable habitats (maximum) for the king cobra is projected to decrease in the periods 2041–2060 and 2081–2100. This report provides valuable insights that could inform conservation strategies for <i>O. hannah</i> in these regions.</p>\n<h2>摘要</h2>\n<p><i>Ophiophagus hannah</i>，俗称眼镜王蛇，被世界自然保护联盟(IUCN)列为易危物种，在大多数国家受到国家法律的保护。这一魅力物种面临着多重威胁，包括栖息地丧失、人类迫害、非法贩运和气候变化等。由于眼镜王蛇对环境条件的敏感性，其种群现状和趋势几乎不为人所知。本研究利用MaxEnt算法预测了眼镜王在亚洲各地的潜在分布，该方法已成功应用于该地区各种物种分布的建模。结果表明，常绿阔叶树是对眼镜王蛇分布影响最大的变量，其贡献率达27.3%，其次是平均日较差和城市、人工设施地区。Jackknife分析确定了平均日较差具有最高的测试增益。大约413，268 km<sup>2</sup>的面积被发现具有维持该物种的最适宜的气候条件。印度、缅甸、孟加拉国、越南、柬埔寨、印度尼西亚、马来西亚等国被认定为具有有利条件。在未来SSP5-8.5气候情景下，眼镜王的适宜栖息地范围(最大值)在2041-2060年和2081-2100年期间将减少。本报告提供了有价值的见解，可为眼镜王蛇在该区域的保护工作策略提供参考。【审阅:杨毅】</p>","author":"Subha Shankar Mukherjee, \nDebidas Patra, \nAsif Hossain","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"700e93cee8143dffec377227f606f054459bbe10ce47cf00c4af094252ddd540","category":"Environment"}