{"title":"Radiocarbon dating and isotopic palaeoecology of Glossotherium phoenesis from the Late Pleistocene of the Santa Elina rock shelter, Central Brazil","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3553?af=R","date":1688984712000,"content":"<h2>Abstract</h2>\n<p>The Santa Elina rock shelter (Central Brazil) stands out with two human occupation layers with ground sloth fossil remains from the Late Pleistocene. Here, we explore the palaeontological aspect of this site. We update the taxonomic assignment of the ground sloth found in the shelter to <i>Glossotherium phoenesis</i>. Radiocarbon dating performed on bioapatite (<sup>14</sup>C<sub>bioapatite</sub>) from two tooth specimens reveal the minimum ages of 14 944–15 239 cal a \n<span>bp</span> (unit II2) and 22 339–22 534 cal a \n<span>bp</span> (unit III4), which were converted to collagen using a novel approach and presented the calibrated ages of 17 450–17 906 cal a \n<span>bp</span> (<sup>14</sup>C<sub>collagen</sub> = 14 547 ± 40) and 25 994–26 396 cal a \n<span>bp</span> (<sup>14</sup>C<sub>collagen</sub> = 22 042 ± 40). We reinforce the chronology of the oldest unit of Santa Elina with material culture in association with megafauna bones to the Last Glacial Maximum. Carbon isotopic signatures suggest a mixed feeding diet for both specimens. The most recent ground sloth presents a higher isotopic value (<i>δ</i>\n<sup>13</sup>C = −1.8‰) and narrower niche breadth (<i>B</i>\n<sub>\n   <i>A</i>\n</sub> = 0.50) than the oldest one (<i>δ</i>\n<sup>13</sup>C = −3.3‰; <i>B</i>\n<sub>\n   <i>A</i>\n</sub> = 0.74). We conclude that <i>G. phoenesis</i> lived in an arboreal savanna habitat during the phases studied. Slightly different oxygen isotopic values (<i>δ</i>\n<sup>18</sup>O = 26.2‰ and 27.9‰) might suggest a decrease in humidity over time. Our results provide insights into the palaeoecology of the tropical Pleistocene <i>G. phoenesis</i> and the palaeoenvironmental setting of Santa Elina when occupied by early humans and megafauna during the Late Pleistocene.</p>","author":"Thais Rabito Pansani, \nMário André Trindade Dantas, \nLidiane Asevedo, \nAlexander Cherkinsky, \nDenis Vialou, \nÁgueda Vilhena Vialou, \nMírian Liza Alves Forancelli Pacheco","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"7016f3336be2c9a50af898e52f39cdb47dacf1a5236009682a0ed54d2ba9b3a3","category":"Environment"}