{"title":"Monitoring air quality of Sharkia Governorate using remote sensing","link":"http://link.springer.com/10.1007/s11600-023-01283-2","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>Due to Sharkia population’s rapid growth, the crises of atmospheric pollutants are causing significant concern. These circumstances have positive and negative impacts on both environment and climate. This research aims to investigate and evaluate changes in land and air characteristics of the governorate using remotely sensed data from several satellites (Landsat, Aqua, Terra, and Sentinel-5P) in conjunction with geographic information system (GIS) techniques. Three multitemporal Landsat images were acquired in July 2002, 2012, and 2022, to monitor land use/land cover (LULC) changes during the past 20 years. In addition, aerosol optical depth (AOD) data were obtained daily over 2022, and Particulate Matter (PM<sub>2.5</sub>) was calculated and then averaged seasonally. Sentinel-5P was utilized for CO, NO<sub>2</sub>, and SO<sub>2</sub> retrievals. Results showed that the governorate was continuously subjected to spatiotemporal changes in LULC during the whole study period. It was mainly occupied by vegetation with a total area of 3711.64, 3851.05, and 3794.59 km<sup>2</sup> in 2002, 2012, and 2022, respectively. Seasonal means of PM<sub>2.5</sub> followed this order: spring (77.59 µg/m<sup>3</sup>) &gt; summer (50.76 µg/m<sup>3</sup>) &gt; winter (49.29 µg/m<sup>3</sup>) &gt; autumn (42.71 µg/m<sup>3</sup>). However, the winter season recorded the highest mean values for all gases, CO (946.58 µg/m<sup>3</sup>), NO<sub>2</sub> (9.70 µg/m<sup>3</sup>), and SO<sub>2</sub> (13.07 µg/m<sup>3</sup>). It was concluded that the southern region of the governorate is more vulnerable to environmental stresses, which can reduce biodiversity and ultimately affect the study area’s climate. In order to manage fragile ecosystems sustainably, this study recommends the creation of efficient land and air management information systems and regulations.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"702348fd2cbe0aafc379c4a812e7fcae5fef7c60e2f26220ae7dc4983cc998d5","category":"Environment"}