{"title":"What on earth is Apple doing with the iPhone 15 Pro volume and mute buttons?","link":"https://www.macworld.com/article/1665435/iphone-15-pro-solid-state-volume-mute-buttons-why.html","date":1679397300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We’ve seen multiple rumors and supposed leaked CAD designs now that show Apple is about to change up the left side of your iPhone. Well, assuming you buy an <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 Pro</a>. On the higher-end iPhones, the up and down buttons are being replaced by a single volume button, and the mute switch we’ve had on iPhones since the beginning will now also be a button.</p>\n\n\n\n<p>These are apparently going to be solid-state buttons that don’t actually depress. Just like the Touch ID modules on iPhone SE, the trackpads on MacBooks, or the virtual buttons on the stems of AirPods Pro, these buttons will actually just be touch-sensitive areas connected to Taptic Engine haptics that imitate the <em>feel</em> of a click when pressed, even though nothing ever moves.</p>\n\n\n\n<p>It’s an interesting new development, a curious little detail among more interesting new features, but I can’t figure out exactly <em>why</em> Apple might be doing this. It doesn’t seem to solve any problem or enable any great new functionality or feature that isn’t possible today. And it might even introduce some new problems.</p>\n\n\n\n<h2>Cost and durability</h2>\n\n\n\n<p>It’s tempting to think the move to solid-state buttons is about making the iPhone more durable. But the buttons are not the weak link that causes iPhones to break–the glass on the front and back is.</p>\n\n\n\n<p>Apple also doesn’t seem to have any problem making iPhones as waterproof as they need to be with the current button design. Surely the Lightning port (or USB-C on iPhone 15 Pro) is the limiting factor there, as evidenced by the Apple Watch’s superior waterproofing while still featuring clickable buttons.</p>\n\n\n\n<p>It doesn’t seem like it would be a cost-saving measure, either. In fact, adding a touch sensor and Taptic Engine to the iPhone likely more than offsets the cost of the current, traditional buttons. And switching to solid-state buttons doesn’t seem like it would save internal space–the current button mechanism is smaller than even the smallest Taptic Engine would be.</p>\n\n\n\n<p>Of course, it’s possible that Apple has some clever engineering solution that makes a solid-state design cheaper or smaller or both, but it’s hard to imagine that being the case. And if it was, you’d think it would not be only for the Pro model. So why is Apple making this change?</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?w=1200\" alt=\"Lateral del iPhone 14 Pro Max\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/12/iPhone-14-Pro-Max_1.webp?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>This button won’t be a real button on the iPhone 15—but why?</p></figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<h2>Benefits and drawbacks</h2>\n\n\n\n<p>When Apple transitioned to the Force Touch trackpad, there were clear benefits. It was hard to click the trackpad near the top edge where the hinge was, and Force Touch fixed that. It also lets you “click” in multiple places easily, and apply different levels of force.</p>\n\n\n\n<p>With something as simple as the volume buttons and mute switch, one struggles to think of scenarios that are made better by a Force Touch solution. A single volume button could be swipeable for faster volume adjustment, but that sounds like a nightmare for those who use a case (which is most iPhone users). It could detect different levels of force, but for what purpose?</p>\n\n\n\n<p>Maybe Apple could make a quick tap, double-tap, hard press, or something that triggers playback or accessibility controls, or the like. But that’s doable with today’s buttons–it’s a software problem. Plus it’s a worrisome idea, as with no visual indication that the volume button does something else when pressed or tapped a certain way, it’s going to be accidentally triggered by confused users all the time (like 3D Touch was before Apple got rid of it).</p>\n\n\n\n<p>It’s easier to see why replacing the mute <em>switch</em> with a mute <em>button</em> could be desirable. Yes, you lose the ability to simply glance at the side of your phone to visually confirm if it is muted or not, but the tiny mute switch is often hard to manipulate. For those who use a case or have fine motor control problems, a button is going to be much easier to manipulate than the current tiny switch. And how many of us have accidentally turned on our phone’s volume when pulling it out of our pockets? I’m still not sold on the need for it to be solid-state, but a mute button will be an improvement.</p>\n\n\n\n<h2>It’s all about the software</h2>\n\n\n\n<p>I keep thinking about why Apple would make this hardware change. It’s not cheaper, doesn’t save internal space, doesn’t necessarily improve durability or waterproofing, and usability is sort of a “better in some ways worse in others” situation.</p>\n\n\n\n<p>But then I remember the Dynamic Island on iPhone 14 Pro. Before its official unveiling, we had reliable leaks that Apple was going to have a hole-punch style “pill” area for Face ID sensors and a “hole” next to it for the front camera. There were <a href=\"https://www.macworld.com/article/543848/iphone-14-pro-hole-punch-display-rumors.html\">all sorts of mockups</a> showing what it would look like.</p>\n\n\n\n<p>It was the software side that made it special. The “pill and hole” was hidden behind an entirely new element that turned a hardware issue into an interface solution. Because the hardware requires a lot of parts suppliers and manufacturing partners, the physical aspects of a new iPhone often leak out. The software, tightly controlled within Apple’s walls, is always a surprise. Hence the impact of the Dynamic Island.</p>\n\n\n\n<p>I hope a surprise akin to (if not as significant as) Dynamic Island is exactly what Apple has in store for us with this new force-touch solid-state volume and mute design. Because if it’s just touch-sensitive and swipe-able volume control, I have to wonder…<em>why?</em></p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7026f9da03fd62ca3595ccc4a54a4a3959207b58f2d23867e6a916ed3339b147","category":"Apple"}