{"title":"HashiCorp State of Cloud Strategy Survey 2023: Maturity drives operational efficiency","link":"https://www.hashicorp.com/blog/hashicorp-state-of-cloud-strategy-survey-2023-maturity-drives-operational-efficiency","date":1686574800000,"content":"<p>The third annual <a href=\"https://www.hashicorp.com/state-of-the-cloud\">HashiCorp State of Cloud Strategy Survey</a> is out, and the results reveal that operational cloud maturity — defined not by the amount of cloud usage, but by adoption of a combination of technology and organizational best practices at scale — is driving business benefits in a wide variety of ways. Those benefits include retaining talent, cost savings, an improved security posture, and operational efficiency. Most notably, perhaps, the 2023 State of Cloud Strategy Survey found that despite global macroeconomic uncertainty, high-maturity companies were more likely to boost their cloud investments and more likely to reap the benefits of their efforts.</p>\n\n<p>For the 2023 survey, HashiCorp once again commissioned Forrester Consulting to conduct the research. Forrester surveyed almost 1,000 technology practitioners and decision makers, the vast majority from organizations with more than 1,000 employees. Respondents came from around the world, and worked in a variety of industries. </p>\n\n<p>This blog post covers how the survey calculated cloud maturity, presents the top-line results of the survey, and summarizes Forrester Consulting’s key recommendations. For full results and analysis, complete with interactive charts, visit the <a href=\"https://www.hashicorp.com/state-of-the-cloud\">survey microsite</a>, where you can also download the Forrester study: <em>Operational Maturity Optimizes Multicloud.</em> </p>\n\n<h2>A cloud maturity model</h2>\n\n<p>To better understand the evolution of cloud adoption, we worked with Forrester to develop a <a href=\"https://www.hashicorp.com/state-of-the-cloud#more-about-our-model-of-operational-cloud-maturity\">cloud maturity model</a> that describes where organizations are in their cloud adoption journey. Based on organizations’ adoption of <a href=\"https://www.datocms-assets.com/2885/1684971014-hashicorp-tlp_v2.pdf\">best practices across infrastructure, security, networking, and applications, as well as their reliance on platform teams</a>,respondents were divided into three tiers:</p>\n\n<ul>\n<li><strong>Low maturity</strong>, the lowest 25% of respondents, who are experimenting with these practices</li>\n<li><strong>Medium maturity</strong>, the middle 50% of organizations, standardizing their use of these practices</li>\n<li><strong>High maturity</strong>, the top 25% of respondents, who are scaling these practices broadly across the organization.</li>\n</ul>\n\n<p>Incorporating a maturity model enables deeper insights into the survey results. Specifically, organizations demonstrating the most cloud maturity are also the ones unlocking the most value from their cloud efforts. Mature cloud practices were strongly correlated with positive business outcomes with respect to speed, risk, and efficiency.</p>\n\n<p>Simply put, high-maturity companies were more likely to report increases in their cloud spending, and that their multi-cloud strategies were saving them money. At the same time, highly mature organizations were less likely to suffer from “cloud waste” — or avoidable cloud spending. Just as important, high-maturity companies reported more success coping with key cloud issues, from security to the ongoing shortage of critical cloud skills. </p>\n\n<h2>7 numbers to remember</h2>\n\n<p>We’ve boiled down the top-line results of the 2023 HashiCorp State of Cloud Strategy survey into a set of key numbers:</p>\n<img src=\"https://www.datocms-assets.com/2885/1686325108-7-numbers-to-remember.png\" alt=\"7\" /><h2>Cloud spending is up, for good reason</h2>\n\n<p>A key takeaway from the 2023 HashiCorp State of Cloud Strategy Survey is that despite global economic headwinds, more than half (56%) of respondents said they boosted their cloud spending, while only about one in five (22%) reduced their cloud spend. The trend was even stronger among high-maturity organizations, where almost two-thirds (62%) increased spending, while only 38% of low-maturity respondents did so.</p>\n\n<p>What’s behind this increase in cloud investment? It’s working. The overwhelming majority of multi-cloud users say the strategy is helping them reach their business goals (73%), or they expect it to in the next year (19%). Low-maturity organizations, however, are enjoying fewer benefits, with just 60% seeing business benefits and 22% expecting them in the next year.</p>\n\n<p>Even as companies increase cloud spending, however, almost all (94%) still struggle with cloud waste, a percentage virtually unchanged from the <a href=\"https://hashicorp-www-next-git-nels-asmstate-of-the-cloud-hashicorp.vercel.app/state-of-the-cloud/2022#94percent-are-wasting-money-in-the-cloud\">2022 survey results</a>. Top factors contributing to avoidable cloud spend include overprovisioning resources (50%), idle or underused resources (50%) and lack of needed skills (43%). </p>\n\n<p>Interestingly, cost reduction is actually an important driver of multi-cloud adoption, cited by more than half (51%) of respondents, and trailing only reliability. And once again, high-maturity organizations lead the way, with 53% claiming cost reduction as a multi-cloud driver, compared to just 42% of low-maturity respondents. Globally, the Asia-Pacific region (56%) found cost savings in multi-cloud a much stronger multi-cloud driver than did the Europe-Middle East-Africa (42%). For more information on global differences in cloud strategy, download our regional breakdowns of the survey results (<a href=\"https://www.datocms-assets.com/2885/1686242393-2023_state_of_cloud_collateral-emea-final.pdf\">EMEA</a>, <a href=\"https://www.datocms-assets.com/2885/1686242389-2023_state_of_cloud_collateral-apj-final.pdf\">Asia-Pacific</a>).</p>\n\n<h2><strong>Forrester’s key recommendations</strong></h2>\n\n<p>For more on the survey methodology and the cloud maturity model, download the Forrester study: <em>Operational maturity optimizes multicloud</em>). There you’ll also find Forrester’s key findings, noting that operational maturity maximizes multi-cloud business goals and benefits and macroeconomic uncertainty highlights cloud costs, some of which are avoidable. Notably, Forrester also highlights how skills shortages and security threats impede operational effectiveness.</p>\n\n<p>Forrester also offers a set of key recommendations based on the survey results. To maximize the benefits of multi-cloud during times of market uncertainty and change, Forrester recommends that organizations seek cloud maturity by ensuring that crucial aspects like security, automation, and platform teams are in place. Here are the highlights:</p>\n\n<p><strong>Macroeconomic shifts demand higher levels of automation.</strong> Firms must take drastic steps to cope with economic uncertainty amid elevated expectations. Avoidable cloud waste and cost efficiencies are important areas for improvement. Automation should replace inefficient, insecure, and error-prone manual processes. Mature organizations are also expanding the scope of automation to achieve scale, increase efficiency, and reduce cost. </p>\n\n<p><strong>Mature your multi-cloud practices and align them with your business strategy.</strong> In a multi-cloud world, tech leaders must align their investments with business strategy. For agile yet mature operations, organizations must standardize and scale best practices across infrastructure, security, applications, and networking. Organizational best practices like platform teams, meanwhile, enable scale and maturity, so companies can maximize their support of business objectives.</p>\n\n<p><strong>Address security from all dimensions.</strong> Modern cybersecurity requires a multidimensional security practice, especially in multi-cloud environments. Mature firms manage security by auditing it as well as centrally enforcing rules and policies via automation. Automation speeds detection and remediation of security vulnerabilities, leading to safer, more secure environments.</p>\n\n<p><strong>Upskill and mature your platform teams.</strong> The increasing complexity of technology means organizations must make the most of relatively scarce cloud skills. High-maturity firms exploit all possible routes to upskilling — training, certification, and partnerships with systems integrators and outsourcing providers. In addition, they must create a culture that supports and promotes learning, and platform teams can both influence and benefit from such a culture.</p>\n\n<h2><strong>More cloud strategy survey analysis to come</strong></h2>\n\n<p>This post is the first of several planned to highlight key results and analysis from the 2023 HashiCorp State of Cloud Strategy survey. Stay tuned for deep dives into the multi-cloud maturity model, the importance of platforms, how specific industries responded to the survey, and more. </p>\n\n<p>Finally, for the full results, including detailed interactive charts and graphs, visit the <a href=\"https://hashicorp.com/state-of-the-cloud\">HashiCorp State of Cloud Strategy survey site</a>. That’s also where you'll find links to the Forrester Consulting study, <em>Operational Maturity Optimizes Multicloud</em>, as well as regional breakdowns of the data, all free to download. </p>\n","author":"Fredric Paul","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"7027857456a75bc674571aeeb3d65f3e06f9c98aa3fddd607ad554674b8edab0","category":"Tech"}