{"title":"Characterizing Bloodstream Infections in Chronic Hemodialysis Patients: A Single Center Experience","link":"https://www.preprints.org/manuscript/202410.0971/v1","date":1728956023000,"content":"Background: Bloodstream infections (BSIs) pose a major health risk to hemodialysis patients, significantly contributing to morbidity and mortality. This study aimed to identify the bacterial pathogens responsible for BSIs in this population, analyze clinical and laboratory profiles, and identify risk factors associated with poor outcomes.\nMethods: This retrospective study was conducted at Sohar Hospital, Oman, analyzing cases from January 2018 to December 2022. Data were obtained from e-health records, focusing on patient demographics, bacterial etiology, antibiotic susceptibility, and clinical outcomes. Statistical analysis included t-tests, Mann-Whitney tests, chi-square, and Fisher’s exact tests, with univariate odds ratios calculated for mortality associations using the R package GTSUMMARY.\nResults: Among 1332 hemodialysis patients, 148 (11.1%) developed a BSI, with an average age of 60.43±14.46 years. Infections were more common among females (54%) and those over 60 years. The predominant comorbidities were hypertension (86%) and diabetes mellitus (74%). The main causative agents were coagulase-negative staphylococci (29.7%), Staphylococcus aureus (20.3%), Pseudomonas aeruginosa (12.2%), and Klebsiella pneumoniae (8.8%). Gram-negative bacteria showed high susceptibility (80-100%) to carbapenems and piperacillin-tazobactam, while Gram-positive bacteria exhibited 80-100% susceptibility to amoxicillin-clavulanic acid and universal sensitivity to linezolid and vancomycin.\nConclusions: BSIs in hemodialysis patients at Sohar Hospital are associated with high morbidity and mortality rates, underscoring the need for prompt empirical antibiotic therapy and targeted treatment adjustments based on culture results. This study highlights critical mortality-associated factors, offering valuable insights for improving patient management and survival outcomes in this vulnerable population.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"702da2f057d73a79a4cdca081ca17dba288c89a5d0cb5c16197d3975f0b1f504","category":"Interdisciplinary"}