{"title":"New Features for Final Cut Pro for Mac and iPad","link":"https://www.apple.com/newsroom/2023/11/final-cut-pro-for-mac-and-ipad-get-powerful-updates/","date":1699398092000,"content":"\n<p>Apple Newsroom yesterday:</p>\n\n<blockquote>\n  <p>Today Apple announced updates to Final Cut Pro across Mac and \niPad, offering powerful new features that help streamline \nworkflows. Final Cut Pro now includes improvements in timeline \nnavigation and organization, as well as new ways to simplify \ncomplex edits. The apps leverage the power-efficient performance \nof Apple silicon along with an all-new machine learning model for \nObject Tracker, and export speeds are turbocharged on Mac models \npowered by multiple media engines. Final Cut Pro for iPad brings \nnew features to further enhance the portable Multi-Touch editing \nexperience, including support for voiceover recording, expanded \nin-app content options, added color-grading presets, and workflow \nimprovements. These updates to Final Cut Pro will be available \nlater this month on the App Store. </p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/linked/2023/11/02/tobin-bts-scary-fast\">I mentioned last week</a> that video editors took notice that <a href=\"https://www.apple.com/newsroom/2023/10/behind-the-scenes-at-scary-fast-apples-keynote-event-shot-on-iphone/\">Apple’s behind-the-scenes look</a> at their “Scary Fast” keynote showed the film being editing in Premiere Pro, not Final Cut Pro, and that it wasn’t helping allay the fears of Final Cut Pro devotees that Apple was losing interest in it, <em>a la</em> the <a href=\"https://www.dpreview.com/news/5576621302/apple-aperture-will-no-longer-work-after-macos-mojave\">still-lamented Aperture</a>.</p>\n\n<p>It occurred to me then that the best evidence that Apple remains keenly committed to Final Cut Pro is that they (finally?) ported it, along with Logic Pro, to the iPad <a href=\"https://daringfireball.net/linked/2023/05/09/final-cut-pro-logic-pro-ipad\">earlier this year</a> — and <a href=\"https://daringfireball.net/linked/2023/05/17/snell-final-cut-logic-ipad\">that the iPad versions are good</a>.</p>\n\n<p>Now, as if on cue, Apple has announced significant feature updates to Final Cut Pro (<a href=\"https://www.apple.com/newsroom/2023/11/apple-supercharges-logic-pro-for-mac-and-ipad/\">and Logic Pro</a>) for both Mac and iPad.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/11/07/final-cut-pro-new-features\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7034a66d2e4b5b2641cd2d380ee5de7a7a2ad56ed6ddc3ece76e6b9cbfc1972d","category":"Tech"}