{"title":"Comment: Why my insurance company won’t support mandatory registration or insurance for cyclists","link":"https://www.cyclist.co.uk/in-depth/9748/comment-why-my-insurance-company-won-t-support-mandatory-registration-or-insurance-for","date":1623764988000,"content":"<span>\n      <span><a href=\"/authors/dave-george\">Dave George</a></span>\n  </span><div>  \n  <div>      <div><span>15 Jun 2021</span></div>    </div></div><p>\nDave George, CEO of specialist cycling insurer Bikmo, says his company will not support mandatory registration or insurance for cyclists</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/mg_bikmo_road_gorge_34.jpg?itok=r9fXO3eQ\" />  </div>\n<div>\n      <p> <em>A petition from lawyer 'Mr Loophole' Nick Freeman is calling for mandatory registration and insurance of cyclists. </em><em>In response, Dave George, CEO of <a href=\"https://bikmo.com/uk/\" target=\"_blank\">specialist insurer Bikmo</a>, explains why his company will not support such a move.</em></p>\n<p>Cyclists pose such little risk compared to the real danger on our roads. More people are killed by cows than by cyclists, while 21,770 pedestrians were hit by drivers of motor vehicles in 2019, and yet we give disproportionate air time to crackpot views on mandatory registration and insurance of people cycling.</p>\n<p>Periodically, somebody crops up and suggests that cyclists should be licensed and insured. The same debate ensues, largely dominated by people who feign interest in improving cycling safety but who really want to suppress cycling levels and protect the status quo.</p>\n<p>As somebody whose job is assessing cycling and risk profiles – day in, day out – I thought I'd shine a light on why mandatory registration and insurance for cyclists is an incredibly bad idea.</p>\n<p>As an insurance company, you might expect Bikmo would favour mandatory insurance for cyclists, but that couldn't be further from the position anyone who is looking at the bigger picture will take. For one, we need mass cycling and other transport options like e-scooters to stand a chance of tackling the climate emergency.</p>\n<p>As a company, we're part of 1% For The Planet and are acutely aware of the challenges facing the planet. Emissions from surface transport in 2019 accounted for 22% of total UK greenhouse gas emissions. This makes surface transport the UK’s highest emitting sector.</p>\n<p>We need to be doing everything we can to make cycling easier, not burden it with unnecessary red tape through registration – which will decrease levels of cycling participation.</p>\n<p>Imagine needing to register for a tabard and wear it every time you popped out for a bike ride. Where would it stop? Pedestrians? Horse riders? Joggers on country lanes? The more you think about it the more ludicrous it is.</p>\n<p>Most of our policies offer third party liability insurance and that's fine for people who want added peace of mind. But out of tens of thousands of customers who are cycling hundreds of thousands of miles between them, between 2019 and 2021 so far, we had zero third party liability claims towards people and only a handful towards property (representing just 0.6% of all claims).</p>\n<p>Mandatory insurance for cyclists would grow our business hugely but it’s a disingenuous solution to a problem that doesn't exist and we should call it out.</p>\n<p>Some might say, 'But drivers have to be registered and insured?' Imagine the chaos that would ensue if that wasn't the case.</p>\n<p>That's right – and in many cases, even with registration and insurance, it is carnage out there and that's because of something described in the legal profession as causative potency. Put simply, it describes the potential for road users to cause damage to each other.</p>\n<p>This doesn’t stem from how annoying you might perceive a road user to be; more rationally, it comes down to physics – crash into someone using a car and you could well seriously injure or kill them. Do the same using a bicycle and that outcome is much rarer.</p>\n<p>In 2019, 16,884 cyclists were injured on the roads; in the same time frame, 21,770 pedestrians were hit by motor vehicles, with 470 killed.</p>\n<p>Even with mandatory registration and insurance for drivers of motor vehicles, there are an estimated 1.2 million uninsured drivers on Britain's road and in London alone there is a hit-and-run crash involving a motor vehicle every two hours.</p>\n<p>From an insurance perspective, encouraging people to register their bikes when purchased could be transformative in reducing bike theft, but it shouldn't be mandatory and definitely shouldn't require some form of bicycle number plate. That's as close to bike registration as we should ever get.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/3t/9755/3t-to-bring-its-carbon-frame-building-in-house\">3T to bring its carbon frame building in-house</a></div>      <div><a href=\"/review/9600/le-col-project-aero-collection-mclaren\">Le Col releases Project Aero Collection with McLaren</a></div>      <div><a href=\"/reviews/9246/met-manta-mips-aero-helmet-review\">Met Manta Mips aero helmet review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\nThose petitioning for cyclists to wear mandatory tabards identifying themselves claim it will create parity across all road users. Given the stats show how much disparity there is in who causes the most harm on our roads, it's no wonder the police spend their limited resources targeting those who are likely to cause the most harm and not people riding bicycles.</p>\n<p>I'll be spending Bikmo's resources trying to get as many people cycling as possible because that, statistically, is what will actually make cycling safer. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"7036ba61f47dc7fa8c9c38147ecd07f1f7a793c380564e8b33e7386e2ba97420","category":"Cycling"}