{"title":"‘Magic cosmetic fillers’: Appearance-enhancement effects on self–face recognition","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305580","date":1718287200000,"content":"<p>by Valentina Cazzato, Charlotte Ellis, Stergios Makris</p>\r\n\r\nPeople naturally exhibit a self-serving bias which can be observed in their tendency to judge their own physical attractiveness more favourably than that of others. Despite this positive self-perception, minimally invasive cosmetic injectable procedures for facial rejuvenation and enhancement are becoming increasingly common. It remains unclear, however, whether recognizing an altered version of one’s own face, enhanced cosmetically, correlates with a positive view of cosmetic surgery and excessive preoccupations about physical characteristics perceived as defects (body dysmorphic concerns). In this study, 30 healthy female participants, aged 18–24 years (Mage = 21.1 years, SD = 1.6), engaged in a face recognition task during which their faces were digitally morphed with that of gender-matched unfamiliar women who had undergone cosmetic enhancements, specifically lip and cheek fillers. The duration of exposure to these modified faces varied with short (500 msec) and long (2000 msec) viewing periods. Participants were asked to identify whether the digital morphs represented themselves or the other woman. Self-reports regarding acceptance of cosmetic surgery and dysmorphic concerns were collected. Participants PSE indicated a tendency towards self-bias under short presentation times, shifting towards the other as presentation times lengthened. Interestingly, this effect was associated with greater acceptance of cosmetic surgery and higher body dysmorphic concerns. This study underscores the importance of understanding how perceptions of others’ physical appearances can influence self-recognition and attitudes towards cosmetic surgery, which may have both positive and potentially harmful implications.","author":"Valentina Cazzato","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7040e1f7b2869aa33c7eaa2aa133e5ae658e412b0dc15a66ca626dc66ce09cb8","category":"Interdisciplinary"}