{"title":"Effects of the symbiotic bacteria, Caballeronia insecticola, on the life history parameters of Riptortus pedestris (Hemiptera: Alydidae) and their implications for the host population growth","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae100/7824617?rss=1","date":1729123200000,"content":"<span><div>Abstract</div>This study aimed to investigate the effects of symbiosis on the life history of host insects and address their implications at the host population level. We evaluated the effects of symbiotic bacteria <span>Caballeronia insecticola</span> on its host <span>Riptortus pedestris</span> (Fabricus) (Hemiptera: Alydidae) from cohorts for nymphal development, adult survivorship, and female reproduction. Then, life table parameters were compared between symbiotic and apo-symbiotic groups, and the effects of symbiosis on the abundance of <span>R. pedestris</span> were simulated for varying proportions of symbiotic individuals in host populations. We found that symbiosis significantly accelerated the nymphal development and reproductive maturation of females. However, symbiosis incurred survival cost on adult females, reducing their longevity by 28.6%. Nonetheless, symbiotic females laid significantly greater numbers of eggs than the apo-symbiotic during early adult ages. This early reproductive investment negated the adverse effect of their reduced longevity, resulting in the mean lifetime fecundity to not significantly differ between the 2 groups. Indeed, total cohort fecundity of the symbiotic group was 1.3-fold greater than that of the apo-symbiotic group. Life table analysis demonstrated shorter generation time and greater population growth rate in the symbiotic population. Finally, the simulation model results indicate that an increase in the proportion of symbiotic <span>R. pedestris</span> favored the population growth, increasing the population size by 1.9 times for every 25% increase in the proportion of symbiotic individuals. Our study demonstrates that symbiont-mediated changes in the life history parameters of host individuals favor the host population growth, despite substantial reduction in the female longevity.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"704239115c14be6ba5edc0d527803afb90eafa5cff0e48159f0d73ab07a7a2d9","category":"Environment"}