{"title":"Ditch the GC: Why teams are giving up on the battle for the podium","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-changing-approach-to-grand-tour-racing","date":1611140220000,"content":"\n      <p><span style=\"font-weight: 400;\">Grand Tours always have winners and losers.</span></p>\n<p><span style=\"font-weight: 400;\">We all know that Tadej Pogačar </span><span style=\"font-weight: 400;\">was </span><i><span style=\"font-weight: 400;\">the </span></i><span style=\"font-weight: 400;\">man of the 2020 Tour de France. On his race debut he won three stages along with three jerseys, the maillot jaune amongst them. It was a phenomenal performance.</span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">You would be hard-pressed to argue that Primož Roglič </span><span style=\"font-weight: 400;\">and </span><span style=\"font-weight: 400;\">Richie Porte, while missing out on the overall win, were not also clear winners amongst the riders of the Tour.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/what-does-2021-hold-for-mark-cavendish\">Related – What does 2021 hold for Mark Cavendish?</a></strong></em></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Related – Wout van Aert: Comeback Kid</a>  </strong></em></p>\n<p>But what of the teams? Yes UAE, Jumbo-Visma and Trek-Segafredo had their logos on the podium, but one squad stood out from the rest despite not having a single rider remotely close to the yellow jersey: Team Sunweb.</p>\n<p><span style=\"font-weight: 400;\">Sunweb were not set up to challenge for yellow. Instead, they set out to hunt stage wins at every opportunity – with relentless predatory precision.</span></p>\n<p><span style=\"font-weight: 400;\">They brought a strong sprinting line-up that boasted Cees Bol, Casper Pedersen, and Joris Nieuwenhuis, meaning they could regularly lead the peloton entering the flamme rouge. Sprint-finishes didn't prove to be the team's strongpoint though – they failed to win a mass-sprint, but Cees Bol did claim two podiums. Instead it was their climbers who excelled.</span></p>\n<p><span style=\"font-weight: 400;\">Sunweb’s climbers and puncheurs quickly lost time in the GC, which was all part of the playbook. Following the climb to Mont Aigoual, their best placed rider was Nico Roche, 12 minutes down. This allowed Sunweb to place any of their riders in the breakaway, as they were insignificant in the fight for yellow.</span></p>\n<p><span style=\"font-weight: 400;\">This strategy introduced the cycling world to a man named Marc Hirschi.</span></p>\n<div style=\"text-align: left;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_1095_1024x1024.jpg?v=1611068028\" alt=\"Marc Hirschi celebrates winning at the Tour de France\" style=\"float: none;\"></div>\n<p><em><span style=\"font-weight: 400;\">Marc Hirschi of Sunweb celebrates winning at the 2020 Tour de France (Image credit: Alex Whitehead/SWpix.com)</span></em></p>\n<p><span style=\"font-weight: 400;\">The Swiss first challenged for stage 2 to Nice, proving he was one of the most dynamic punchers attacking alongside Julian Alaphilippe and Adam Yates. He was just beaten to the line by the Frenchman, a man who is accustomed to winning his fair share of Tour stages.</span></p>\n<p><span style=\"font-weight: 400;\">Hirschi next attempted to win stage nine to Laruns, where he set off for a seemingly hopeless 90km solo ride. His legs were sapped by the solo effort, and he was finally caught in the final 2km to be just beaten to the line by </span><span style=\"font-weight: 400;\">Pogačar</span><span style=\"font-weight: 400;\">.</span></p>\n<p><span style=\"font-weight: 400;\">It was a sign of things to come, though, and Hirschi would claim his first win on stage 12, helped by the likes of Nico Roche and Søren Kragh Andersen – riders with no ambitions for anything other than assisting Sunweb in their quest for a stage. SKA would claim two further victories for Sunweb and they ended the Tour de France with three stage wins – only UAE would win more.</span></p>\n<p><span style=\"font-weight: 400;\">Sunweb hadn’t claimed the maillot jaune, they didn’t finish in the top 50, in fact. Yet there's no doubting that the team was one of the Tour's winners. That hasn't gone unnoticed by other teams.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB1_3662_1024x1024.jpg?v=1611068133\" alt=\"Jakob Fuglsang celebrates\"></span><span style=\"font-weight: 400;\"><i>Jakob Fuglsang of Astana Pro Team celebrates winning stage eight at the 2017 Critérium du Dauphiné. (Image credit: Alex Broadway/ASO/SWpix.com)</i></span></p>\n<h4><span style=\"font-weight: 400;\">Following the Sunweb suit</span></h4>\n<p><span style=\"font-weight: 400;\">Speaking at the Astana-Premier Tech pre-season training camp in Spain, Jakob Fuglsang announced his goals for the season. The Dane entered the Giro last year as one of the main protagonists, but was disappointed to finish 6th.</span></p>\n<p><span style=\"font-weight: 400;\">“I believe, at the end of the day, I could do better than sixth place in GC, but I think sometimes you miss a lot of opportunities when racing for GC. Racing for fifth place, fourth place, I don’t know how much it changes things, then it's maybe nicer to try to win a mountain jersey or a stage or something like that,” Fuglsang explained.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/desire-journal/pro-team-bikes-2021\"><em><strong>Related – WorldTour team bikes 2021: The best so far</strong></em></a></p>\n<p>Indeed, rather than trimming some places off his GC position, it's Sunweb's strategy that has caught Fuglsang’s attention.</p>\n<p><span style=\"font-weight: 400;\">“I think that we can learn a lot from how Sunweb rode in the Tour last year, getting three stage wins and being present in so many stages,\" Fulgsang said. \"Riding without a leader and not doing GC, it's actually possible to be a success riding in a Grand Tour like that. It's not all about riding GC, where a small thing could go wrong and your whole grand tour is not a success anymore.”</span></p>\n<p><span style=\"font-weight: 400;\">The apparent increasing prevalence of ‘super-teams’ is also a factor in Fuglsang’s decision. Ineos have attracted Richie Porte, Adam Yates and </span><span style=\"font-weight: 400;\">Daniel Martínez</span><span style=\"font-weight: 400;\"> for 2021, while Jumbo-Visma were in full control of the 2020 Tour until the final moments of stage 20, despite the absence of Steven Kruijswijk.</span></p>\n<p><span style=\"font-weight: 400;\">“The team and the organisation around a leader is really important if you want to go for the win in Grand Tours. And you can see it yourself, we don’t have a team like Ineos, you need a budget three times ours. That’s how it is,” said Fuglsang.</span></p>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032337-017_1024x1024.jpg?v=1611068270\" alt=\"Alex Vlasov racing at the Route d'Occitanie\"><em>Aleksandr Vlasov, Egan Bernal, and Pavel Sivakov during 44th La Route d’Occitanie (Image credit: CorVos/SWpix.com)</em></span></p>\n<p><span style=\"font-weight: 400;\">Few would debate that the real winner of any Grand Tour is, specifically, the overall winner. However, World Tour riders often have 60-80 race days in a season, and multiple sponsors to satisfy. Giving up 21 of those chasing the GC, when there's a fight to be had stage wins and other jerseys, seems an increasing stretch for many teams.</span></p>\n<p><span style=\"font-weight: 400;\">But, it is a Grand Tour, and as last year taught us – anything can happen.</span></p>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"705acae5b1063927ca01e096b5308127a9123b30b3c9183a6090408c3c9b6863","category":"Cycling"}