{"title":"Untouchable Vingegaard - the 2023 Itzulia Basque Country in review","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/jonas-vingegaard-dominant-in-itzulia-basque-country-2023","date":1681039817000,"content":"\n      <p>With neither Tadej Pogačar (UAE Team Emirates), Remco Evenepoel (Soudal - Quick-Step) or Primož Roglič (Jumbo-Visma) present, Itzulia Basque Country provided a golden opportunity for a host of other GC contenders to win a WorldTour stage race.</p>\n<div></div>\n<p>The parcours looked unpredictable, too, with no time trial or mountain top finish, and a lot of climbing spaced out over the whole week, but no obvious stage where the GC would be decided. An open race was expected, with multiple riders all in with a shot of overall victory.</p>\n<h3>VINGEGAARD LAYS DOWN A MARKER WITH DOMINANT RIDE</h3>\n<p>Despite that expectation, this was ultimately even more one-sided than the races involving the aforementioned trio, only with Jonas Vingegaard playing the role of the all-conquering victory. The Jumbo-Visma rider was untouchable from start to finish, winning half of the six stages on offer, and winning by a comfortable margin of 1:12 — the largest of any WorldTour stage race so far this season, and of any Itzulia Basque Country edition since 2002.</p>\n<p>Despite being reigning Tour de France champion, Vingegaard doesn't yet have the same reputation as Pogačar, Evenepoel and Roglic for being a prolific winner; in the last two seasons he has built his form steadily in the early season stage races, and not reaching his peak until the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. But this year, following his similarly dominant performance at O Gran Camiño, we’re seeing a new Vingegaard, one who has already won six races and two GC titles.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/its-a-lot-harder-for-the-guys-with-more-weight-kilos-start-to-count-in-these-races-now-sep-vanmarcke-on-the-changing-landscape-of-the-classics\"><strong><em>Read more: 'It's a lot harder for the guys with more weight, kilos count in these races now’ - Sep Vanmarcke on the changing landscape of the Classics</em></strong></a></p>\n<p>Whereas in past single-week stage races (including Paris-Nice last month, where he finished third behind Pogačar and David Gaudu) Vingegaard has looked vulnerable, here he exuded authority. He had already ridden proactively on the opening day by sprinting successfully for bonus seconds at intermediate sprints, before seizing control of the race by winning the steep uphill sprint in Amasa-Villabona at the end of stage three, and tightened his grip further the following day by riding away with Mikel Landa (Bahrain-Victorious) and again winning the stage in a two-up sprint.</p>\n<p>Then on the final stage, rather than simply defend his lead, he attacked from long-range. He had typically strong support with his Jumbo-Visma teammates, with Attila Valter and Steven Kruijswijk getting into the day’s break, but didn’t even need to use them, only resting a few moments in their slipstream after they’d dropped back, before riding the remaining 28km solo almost a minute ahead of the rest.</p>\n<h3>RUNNER-UP LANDA LACKING KILLER INSTINCT</h3>\n<p>It was clear Mikel Landa (Bahrain-Victorious) meant business in his home race when, on stage 2, he embarked on a surprise long-range move with an attack 47km from the finish. He might have been reeled in some 30km later, but did survive long enough to pick up some bonus seconds, and was evidently not too fatigued from the effort, as the very next day he sprinted for second behind Vingegaard at the finish.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1480329940.jpg?v=1681039394\" alt=\"Mikel Landa and Jonas Vingegaard\" /></p>\n<p>Landa then confirmed his status as the chief rival to Vingegaard the next day when he was the only rider to follow the Dane’s move on the final climb, but the way the rest of that stage unfolded did expose a lack of killer instinct that has held Landa back over the years. The Basque rider had appeared to play the approach to the finish intelligently, declining to take a turn on the finishing straight and forcing Vingegaard to lead him out. But he fluffed his lines when it came to the climax, first waiting too long to begin his sprint and letting his opponent take the final corner in the lead, then trying and failing to squeeze through a non-existent gap to overtake him in the sprint.</p>\n<p>It was as if Landa had forgotten how to win a race — failure to do so means a continuation of his long drought without a win, which stretches back to August 2021, and as far back as March 2018 in terms of WorldTour races. Sealing second overall confirms Landa as one of the best stage racers so far this season, but he still needs to find something extra if he’s to land that long-awaited win.</p>\n<h3>INEOS’ STRUGGLES CONTINUE</h3>\n<p>Lining up with Egan Bernal, Luke Plapp and defending champion Dani Martínez, Ineos Grenadiers seemed to have one of the strongest rosters in the race, and indeed they made an excellent start, with Ethan Hayter winning the opening bunch sprint after Martínez had earlier made a real statement of intent by claiming all the bonus seconds at an intermediate sprint.</p>\n<p>Things rapidly unravelled, however. Hayter was dropped early the next day to lose the overall lead, and then, after the team had done so much work to chase down Landa’s early attack and position themselves for the final climb, Martínez was held up requiring a bike change, and lost 30 seconds. With Plapp conceding multiple minutes after his sterling domestique work had been done, and Bernal still well off the pace, Martínez was their only option for the GC, but he continued to shelve time in the following stages and couldn’t keep up with the favourites on the climbs.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1479713976.jpg?v=1681039586\" alt=\"Itzulia Basque Country\" /></p>\n<p>Ineos are still therefore without a WorldTour stage race title this season, and none of their star-studded roster at the moment looks in the form to mount a GC challenge at any of the all-important Grand Tours.</p>\n<h3>TWO STAGE WINS FOR BORA</h3>\n<p>Of the stages not won by Jonas Vingegaard, Bora-Hansgrohe were the most successful team, with Ide Schelling and Sergio Higuita triumphing on stages two and five respectively.</p>\n<p>Both victories had a lot in common, too, with each rider coming out on top from reduced groups by starting their sprint early, and maintaining their sprint for an improbable amount of time to take the win.</p>\n<p>Schelling’s victory (his first since 2021, having come close a few times at Volta a Catalunya) had the added bonus of earning him a day in the leader’s jersey, while Higuita looked in great nick throughout, and may well have made the podium had he not been forced to dismount during an incident on stage three’s crucial uphill finish. He instead had to settle for sixth overall, but will surely be pleased with how his form is shaping up.</p>\n<h3>UNUSUAL PARCOURS LEADS TO CLOSE TIME GAPS</h3>\n<p>Though there were lots of climbs and activity in the GC race, the nature of the parcours, with no proper mountain top finish, meant the favourites tended to finish together at the end of each stage.</p>\n<p>As a result, the rest of the GC behind Vingegaard remained tightly congested right up until the finish — a mere ten seconds separated Ion Izagirre (Cofidis) in third and Simon Yates (Jayco-AlUla) in ninth on the final GC.</p>\n<p>Izagirre sealed that final slot on the podium ahead of David Gaudu (Groupama-FDJ) by sprinting for bonus seconds at the finish line of the final stage (the sixth time in his career that he has finished on the podium at this race), but it really could have been any one of the riders immediately behind him on GC. Enric Mas (Movistar) impressed on the climbs, James Knox (Soudal - Quick-Step) attacked throughout, and Brandon McNulty (UAE Team Emirates) relished being a team leader for once, but all instead filled out the remaining places in the top ten.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"705f06102a0078f345af04448b27c1add1de74f779afa72a6c49f393c82072f9","category":"Cycling"}