{"title":"Dietary diversity and nutritional status of adults living with HIV during the COVID-19 era","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307427","date":1721397600000,"content":"<p>by Kasim Abdulai, Abdul Rauf Alhassan, Safianu Osman Aleboko, Mohammed Doobia Ahmed, Awal Seidu Mohammed, Odei-Asare Fremah Adom, Rhoda Kumah</p>\r\nBackground <p>The coronavirus Disease 2019 (COVID-19) pandemic has brought about unique challenges in healthcare and nutrition, particularly for people living with HIV (PLHIV). Understanding their dietary patterns and nutritional status is crucial for developing targeted interventions and improving health outcomes. Therefore, this study assessed the dietary diversity and nutritional status of PLHIV during the COVID-19 era.</p> Methods <p>We adopted a facility-based cross-sectional study design to enroll 220 PLHIV from two hospitals in the Central Region of Ghana. Dietary intakes were assessed using 24-hour recall. Anthropometric and body composition data were collected with a stadiometer and a body composition monitor. Dietary diversity was evaluated using the FAO’s Individual Dietary Diversity Score (IDDS). Data analysis was conducted with SPSS version 20. Significance level was set p-value less than 0.05.</p> Results <p>A significant proportion (33.2%) of PLHIV had low dietary diversity, with the majority (55.5%) categorized as needing dietary improvement. Approximately 2 out of every 10 of the participants were identified as underweight. Participants aged 40 to 59 years were more likely to exhibit higher dietary diversity (adjusted odds ratio (AOR) = 1.966, 95% Confidence Interval (CI): 1.045–4.987). Participants who consumed meals at least three times daily were more likely to have a high IDDS (AOR = 1.641, 95% CI: 1.221, 8.879). Employed participants (public sector and private sector) were also more likely to have a high IDDS compared to unemployed participants (AOR = 1.448, 95% CI: 1.028–3.042; AOR = 1.165, 95% CI: 1.030–9.329, respectively). Factors associated with undernutrition included being female (AOR = 1.829, 95% CI: 1.294, 3.872) and first-line antiretroviral therapy ART (AOR = 1.683, 95% CI: 1.282–2.424).</p> Conclusion <p>The study emphasizes the need for nutritional interventions for PLHIV, particularly during crises. It advocates for a policy collaboration to address food insecurity and promote resilient health outcomes.</p>","author":"Kasim Abdulai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"706baf5f67498977bc34a533e184e8727d389d43a96a74d25a411a99164afe78","category":"Interdisciplinary"}