{"title":"Investigation of the diversity, equity, inclusion, and belonging within the undergraduate student population within the Department of Animal Science at Iowa State University","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae100/7699165?rss=1","date":1719360000000,"content":"<span><div>Abstract</div>Iowa State University (ISU) provides resources for diversity, equity, inclusion, and belonging (DEI-B) to provide students with a comfortable academic home regardless of their demographics or prior experiences. The objective of this study was to investigate undergraduate students’ DEI-B perspectives in the Department of Animal Science at ISU. One survey instrument was developed containing 14 questions that covered demographics, feelings of inclusion, comfort-seeking tools, and ways to improve DEI-B. Answer choices were either multiple choice, 1 to 5 sliding scale, or a specified text sliding scale. Eligible participants were undergraduate students enrolled in Animal or Dairy Science (<span>n</span> = 974). Demographics and comfort-seeking tools will be presented descriptively. Inclusion at the start and after 2 yr were compared using six different linear models. A variable was deemed significant if the <span>P</span>-value was ≤ 0.05. A total of 383 students (88% of total respondents) completed 50% or more of the inclusion questions. Seniors had the highest response rate. More students reported coming from a rural background. Primary species of interest was companion animals. There were no observed differences in feelings of inclusion in classes, with peers, or with faculty for hometown, admission type, ethnic group, and first generation when students started (<span>P </span>≥ 0.067). There was a difference for primary species of interest (<span>P</span> ≤ 0.011) and with female students feeling less included (<span>P</span> ≤ 0.039). There were no observed differences after 2 yr in classes, with peers, or with faculty for classification year, admission type, or first generation (<span>P</span> ≥ 0.088). Suburban students felt the least included in classes compared to rural and urban students (<span>P</span> ≤ 0.036). Female students felt less included in all three categories (<span>P</span> ≤ 0.017). The majority of students reported having companion animal experience but almost half reported having no experience with livestock prior to ISU. A total of 51% of students said they never considered transferring to another major and 48% indicated that they plan to pursue a career in veterinary medicine. A total of 75% of students felt inclusion could be improved by creating more hands-on opportunities and 60% suggested the department provide more study space. In conclusion, the Department of Animal Science at ISU has some effective inclusion practices but needs to evolve and improve in its DEI-B practices for the undergraduate student population.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"7074c9445734d55b8ba92641b0d15ccb817953eedfc2ba9049679f91e24c1ee5","category":"Environment"}