{"title":"Cyclosporin a as an Add-On Therapy to a High Dose Corticosteroid-Based Background Treatment in Patients With COVID-19: A Multicenter Randomized Clinical Trial","link":"https://www.preprints.org/manuscript/202407.2075/v1","date":1721962142000,"content":"Background: In susceptible hosts, SARS-CoV2 induced hyperinflammation accounts for an increased mortality. The search of adjuvant immunomodulatory therapies has been ongoing ever since the pandemic outbreak. Aim: Our purpose was to evaluate the efficacy of cyclosporin A (CsA) as add-on therapy to standard of care in patients with severe COVID-19 pneumonia. Methods: We conducted a randomized clinical trial in patients admitted to 8 Spanish Tertiary Hospitals. Patients were stratified into two severity categories and randomized 1:1 to receive a high dose corticosteroid-based standard therapy with or without CsA. The primary endpoint was FiO2 recovery by day 12 without relapses. Results: 109 patients were included and 98 randomized: 51 of them were assigned to CsA+SoC group and 47 to Standard of Care (SoC). 96/98 of them were included in the Intention to Treat population. 35 (68.6%) patients from CsA+SoC group and 32 (71,1%) patients from SoC group reached the primary endpoint in the ITT analysis. No differences were found after stratification into age groups, severity level at admission or the combination of both. Overall, time to FiO2 normalization was 7.4 days vs 7.9 days in the experimental and control groups, respectively. Global mortality was 8.2%. Severe adverse events were uncommon and equally distributed between arms. Conclusion: Addition of CsA did not show differences over a high-dose corticosteroids-based treatment in the clinical course of included patients. A better identification of candidates who will benefit from receiving immunomodulatory drugs is necessary in future studies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"707c7cb19f6592cf87d4c18e8fe9f5d23c7334e224bebfd7909c6c7cbbf106d8","category":"Interdisciplinary"}