{"title":"Analysis of Microbial and Nematode Communities in the Apple Replant Disease Complex","link":"https://www.preprints.org/manuscript/202404.1081/v1","date":1713270699000,"content":"Apple replant disease (ARD) is a complex issue caused by various fungal, oomycetes pathogens and parasites which can differ in their abundance between sites within a geographic region. Knowledge of the specific etiology of ARD at a particular site is required in order to develop commercially viable soil management strategies to combat specific/individual components of the disease. In this study we analyzed the soil from six ARD sites for the presence of fungal, bacterial and oomycetes communities and plant parasitic nematodes. Five fungal, and 17 bacterial classes were differentially represented in the microbiomes from different locations. Mortierellomycetes was the most abundant fungal taxa represented followed by Sordariomycetes. Mortierella exigua a fungal endophyte was the most abundant fungal amplicon sequence variant (ASV) in the core microbiome. Proteobacteria was the most prevalent phylum identified in orchard soils. Several potential phytopathogenic fungi involved in ARD and endophytes including Fusarium oxysporum, F. solani, Nectria ramulariae, Ilyonectria robusta and Nectriaceae were identfied in the orchard soil. Pythium attrantheridium (Globisporangium attrantheridium), P. monospermum and P. ultimum (Globisporangium ultimum) were the most abundant oomycete taxa identified in these soil samples. Six different groups of plant-parasitic nematodes were found across the six orchards soil. Root-lesion nematodes, Pratylenchus spp., which are commonly associated with ARD, were identified in all orchards soil at population densities ranging from 12 to 33/100 cm3 soil. This research contributes valuable understanding of the ARD complex as the apple industry needs alternative approaches to combat the disease.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"70813c150c228100e8a8fc20e9555dc4dd0df18db18d7540f2764ca9559cc2ed","category":"Interdisciplinary"}