{"title":"Screening for Hypertension in adolescents living with HIV: Protocol for a cluster randomized trial to improve guideline adherence","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302016","date":1714744800000,"content":"<p>by Raphael Adu-Gyamfi, Juliana Enos, Kwame Yeboah, Veronika Shabanova, Nicola Hawley, Deda Alangea Ogum, Adwoa Agyei Nkansah, Elijah Paintsil, Kwasi Torpey</p>\r\nBackground <p>Although AIDS-related deaths have reduced with increased access to antiretroviral care, cardiovascular disease-related morbidities among persons living with HIV are rising. Contributing to this is the higher incidence of Hypertension among Persons Living with HIV. The duration of exposure to the virus and antiretroviral drugs plays a vital role in the pathogenesis, putting perinatally infected children and adolescents at higher risk than behaviorally-infected ones, supporting the calls for increased surveillance of Hypertension among them. Despite the availability of guidelines to support this surveillance, the blood pressure (BP) of adolescents living with HIV (ADLHIV) is not checked during clinical visits. This study aims to assess the effect of a theory-based intervention on healthcare workers’ adherence to the guidelines for hypertension screening among adolescents.</p> Methods <p>A multi-facility cluster-randomized study will be conducted. The clusters will be 20 antiretroviral therapy sites in the Greater Accra Region of Ghana with the highest adolescent caseload. Data will be extracted from the folders of adolescents (10–17 years) who received care in these facilities six months before the study. The ART staff of intervention facilities will receive a multicomponent theory of planned behaviour-based intervention. This will include orientation on hypertension risk among ADLHIV, provision of job aids and pediatric sphygmomanometers. Six months after the intervention, the outcome measure will be the change from baseline in the proportion of ADLHIV whose BP was checked during clinical visits. The calculated sample size is 400 folders.</p> Implications of findings <p>This study will generate evidence on the effectiveness of a multicomponent theory-based intervention for improving the implementation of clinical practice guidelines.</p> Trial registration <p>PACTR202205641023383.</p>","author":"Raphael Adu-Gyamfi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7088201080ba4c1bf0329af9954a707d910dfe734922e3acf4b12f397fbf8884","category":"Interdisciplinary"}