{"title":"Examining the Effect of Agrochemicals on Soil Microbiological Activity, Micronutrient Availability, and Uptake by Maize (Zea mays L) Plants","link":"https://www.preprints.org/manuscript/202405.1299/v1","date":1716217469000,"content":"Introduction: Agricultural practices significantly influence soil microbial populations and physicochemical properties, which are crucial for crop growth and quality. This study aims to investigate the impact of different agrochemical applications on soil microbial dynamics, soil physicochemical properties, as well as yield and proximate properties of maize.\n\nMethods: Carefully gathered topsoil samples at depths ranging from 1 to 15 cm, were transported to Jimma University to cultivate maize. Over a period of up to 120 days, soil and maize samples were collected at specified days to analyze various parameters, including soil pH, microbial populations, as well as nutrient content both in soil and plants. The collected data was statistically analyzed using one-way ANOVA, with a significance level of p &lt; 0.05.\n\nResults: The soil bacterial and fungal populations were measured on days 5, 10, 20, 40, 80, and 120. The highest total mesophilic bacterial count (TMBC) was measured in the pots containing compost (G) and the lowest in pots that received macronutrient fertilizers and glyphosates (B) (i.e. 91.8 x 105 and 13.13 x 105 cfu/g of soil, respectively). The highest total mesophilic fungal count (TMFC) was observed in pots containing glyphosates and compost (F) (i.e. 67.25 x 104 cfu/g soil) and again the lowest in pot treated with macronutrient fertilizers and glyphosate (B) (i.e. 3.23 x 104 cfu/g soil). Moreover, the pots treated with macronutrient fertilizers and glyphosate (B), macronutrient fertilizers (A), and micronutrient fertilizers (C) exhibited the lowest levels of Fe and Zn. Furthermore, the pots receiving macronutrient fertilizer combined with glyphosate (B), as well as those receiving macronutrient fertilizers (A) alone had the lowest concentrations of Mn and Cu micronutrients. Finally, in maize the lowest protein, fats, and carbohydrates (g/100g) were found in the pots treated with macronutrient fertilizer combined with glyphosate (B, 2.21 ± 0.2), micronutrient fertilizer (C, 8.57 ± 0.25), and glyphosates only (D, 57.34 ± 0.1). Maize treated with compost (G) showed the highest levels of Fe, Cu, and Zn, while macronutrient fertilizer combined with glyphosate (B) resulted in the lowest content of these micronutrients. Additionally, maize receiving micronutrient fertilizer (C) had the highest concentration of Mn, whereas those treated with glyphosates (D) had the lowest.\n\nConclusions:  Significant variations in soil’s mesophilic bacterial and fungal populations, micronutrient levels, and nutritional composition were observed, indicating treatment-related changes. Generally, treatment with micromineral fertilizer combined with glyphosate (B) seemed to deplete the soil while compost treatment improved. Compost-treated soils exhibited the highest mesophilic bacterial and fungal count, as well as Fe and Zn micronutrient concentrations. The use of agrochemicals also had a negative effect on maize yield quality. The fluctuations in the soil parameters underscore the multifaceted effects of agrochemical treatments.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"708ba1f98d1864903bbac5dea716920819964dddf1f793fd9e83b2d63fabc1ec","category":"Interdisciplinary"}