{"title":"Assessing the dynamics of common dolphin (Delphinus delphis) mother‐calf pairs along the south coast of Portugal using unmanned aerial vehicles","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13115?af=R","date":1719897016000,"content":"<h2>Abstract</h2>\n<p>Maternal grouping dynamics involve trade-offs between: (1) infant protection from predation (predation hypothesis), (2) infant protection from male harassment (infant safety hypothesis), and (3) reducing scramble competition for prey resources (foraging-type scramble competition hypothesis). Using unmanned aerial vehicles, we assessed grouping dynamics in common dolphin (<i>Delphinus delphis</i>) groups containing mother-calf pairs to address these hypotheses. We analyzed social aspects and structural group elements using generalized additive mixed models and modeled group formation using multinomial generalized estimating equations. Calf proportion was higher in very compact groups and in groups of 10–20 individuals but decreased in larger groups. The frequency of socio-sexual behaviors increased in larger groups and decreased in groups with higher calf proportion. Calf distance to its nearest neighbor decreased with increasing group size and cohesion. With a higher proportion of calves, scatter (versus parallel) formation was less frequent. A calf's nearest neighbor was most often (55.4%) a nonmother. Calves showed a preference for being in the front center of the group. These results offer strong support for the predation and infant safety hypotheses and partial support for the foraging-type scramble competition hypothesis. This work provides insight into the adaptive function of maternal strategies in a small delphinid.</p>","author":"Joana Castro, \nAndré Cid, \nAlicia Quirin, \nFábio L. Matos, \nRui Rosa, \nHeidi C. Pearson","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"708c2209894f6a86da19024c2df800ebb17a27c2c4b173ba9869955f61af1773","category":"Environment"}