{"title":"Attenuation analysis in coal based on a fractal viscoelastic model","link":"http://link.springer.com/10.1007/s11600-024-01314-6","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Great attention has been focused on uncovering the physics of seismic wave attenuation in rocks in the past few decades. However, the contribution of different attenuation mechanisms on attenuation is not completely clear in coal. We use the fractal viscoelastic model to describe the <em>P</em>-wave attenuation in coal, and the model has a good approximation to the constant-<em>Q</em> model when choosing lower fractional order <span>\n                      \n                      <span>\\(\\alpha\\)</span>\n                      \n                    </span>. We experimentally measured attenuation in dry and water-saturated coal samples in the frequency range of 10–250 Hz, at room temperature, and approximately room pressure. Attenuation in the dry sample is frequency independent and the fractal viscoelastic model curves fit well with the data when <span>\n                      \n                      <span>\\(\\alpha =0.056\\)</span>\n                      \n                    </span>. For the partial water saturation cases, attenuation is frequency dependent, and the simple viscoelastic attenuation theory cannot describe the strong attenuation in seismic band; when water saturation is high (<span>\n                      \n                      <span>\\(\\ge 80\\%\\)</span>\n                      \n                    </span>), we need wave-induced fluid flow mechanism to explain the high <span>\n                      \n                      <span>\\(Q^{-1}\\)</span>\n                      \n                    </span> values. The final contribution of viscoelasticity to attenuation is about 63%, while the final contribution of wave-induced fluid flow mechanism to attenuation is about 37% in the test.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"708e1f4a6c0556a4c713b289d3ecb8a87fe03ce6b5bcee8c28c08ddb99565169","category":"Environment"}