{"title":"Apple releases important security update to iOS, iPadOS, macOS, and watchOS","link":"https://www.macworld.com/article/345223/ios-and-ipados-14-5-1-watchos-7-4-1-and-macos-big-sur-11-3-1-updates-are-now-available.html","date":1620078506000,"content":"\n<div>\n<section><div></div></section><p>Apple on Monday released updates for iOS, iPadOS, watchOS, and macOS. The updates contain security patches, while iOS and iPadOS also has a fix for an issue with App Tracking Transparency.</p>\n\n\n\n<p>The Webkit fix is especially important. Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201222&amp;xcust=1-1-345223-0-0-0&amp;sref=https://www.macworld.com/feed\">security update document</a> states that it fixes a flaw where, “Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.”  Two phrases you never want to hear in a security update are “arbitrary code execution” and “may have been actively exploited,” so it’s important that users update as soon as possible.</p>\n\n\n\n<h2>How to install the updates</h2>\n\n\n\n<p>Before updating, it’s a good idea to back up your data, just in case the update causes problems. To install the update, you need an internet connection. Also, your device will need to restart in order to finish the installation. Here are the steps.</p>\n\n\n\n<h3>iPhone and iPad</h3>\n\n\n\n<ol><li>Open the <em>Settings</em> app </li><li>Tap on <em>General</em> and then <em>Software Updates</em>.</li><li>You can tap <em>Learn more</em> to read the release. To perform the installation, tap <em>Download and Install</em>.</li></ol><h3>Mac</h3>\n\n\n\n<ol><li>Click on the Apple menu.</li><li>Select <em>About this Mac</em>.</li><li>In the window that appears, go to the <em>Overview</em> tab if it’s not already open.</li><li>Click on the <em>Software Update</em> button. This will open the Software Update system preference.</li><li>You can click the <em>More info</em> link if you want to learn more about the update.</li><li>When you are ready to install, click on the <em>Update Now</em> button. The installation takes several minutes, depending on the speed of the internet connection.</li></ol><h3>Apple Watch</h3>\n\n\n\n<ol><li>On your iPhone, launch the <em>Watch</em> app.</li><li>Tap <em>General</em>.</li><li>Tap <em>Software Update</em>. The app will look for the update online.</li><li>When the app finds the update, you’ll see a screen with the release notes. Under the notes, tap <em>Download and Install</em>.</li></ol><h2>Notes on the security fixes</h2>\n\n\n\n<p>Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201222&amp;xcust=1-1-345223-0-0-0&amp;sref=https://www.macworld.com/feed\">security notes</a> state that the follow are fixed in the updates.</p>\n\n\n\n<blockquote><p><strong>WebKit</strong></p><p>Impact: Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.</p><p>Description: A memory corruption issue was addressed with improved state management.</p><p>CVE-2021-30665: yangkang (@dnpushme)&amp;zerokeeper&amp;bianliang of 360 ATA</p><p><strong>WebKit</strong></p><p>Impact: Processing maliciously crafted web content may lead to arbitrary code execution. Apple is aware of a report that this issue may have been actively exploited.</p><p>Description: An integer overflow was addressed with improved input validation.</p><p>CVE-2021-30663: an anonymous researcher</p></blockquote>\n\n\n\n<h2>App Tracking Transparency fix in iOS and iPadOS</h2>\n\n\n\n<p>The following are the release notes for iOS and iPadOS 14.5.1</p>\n\n\n\n<blockquote><p>This update fixes an issue with App Tracking Transparency where some users who previously disabled Allow Apps to Request to Track in Settings may not receive prompts from apps after re-enabling it. This update also provides important security updates and is recommended for all users.</p></blockquote>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"70abdd123ac7420e86eea3fe893b00b9aff37e688e9a9d723f6e7ccb839c2e13","category":"Apple"}