{"title":"Gurman: Apple to Announce New Macs This Month","link":"https://www.macrumors.com/2023/10/22/gurman-apple-to-announce-new-macs-this-month/","date":1697977268000,"content":"Apple is planning a Mac-focused product launch, likely including the announcement of a refreshed 24-inch <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>, for the end of this month, <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> reports.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/imac-purple.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn the latest edition of his <a href=\"https://www.bloomberg.com/news/newsletters/2023-10-22/what-is-apple-doing-in-ai-revamping-siri-search-apple-music-and-other-apps-lo1ffr7p\">\"Power On\" newsletter</a>, Gurman said that Apple is \"planning a Mac-centered product launch around the end of this month\" that could see the the release of a refreshed 24-inch ‌iMac‌ model, which is long overdue a hardware update. The current model launched in April 2021 and it is the only current-generation Mac left with the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip. Gurman has repeatedly said that Apple's next <a href=\"https://www.macrumors.com/2022/07/06/no-m2-imac-on-the-horizon-for-2022/\">iMac will skip the M2</a> and feature the M3 chip instead, but he declined to mention which chip the new machine will feature in this newsletter.\r<br />\n\r<br />\nGurman noted that Apple retail stores are now in short supply of the ‌iMac‌, 13-inch MacBook Pro, and 14- and 16-inch MacBook Pro, and many configurations now will not arrive until mid-November, in what he believes is \"a clear sign that something is about to happen\" regarding these three machines. He added that Apple has \"made headway\" on new 14-inch and 16-inch MacBook Pros. While the current, <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> Pro and ‌M2‌ Max 14-inch and 16-inch MacBook Pro models launched in January, he thinks that an \"additional update the same year would be unusual, but not inconceivable.\"\r<br />\n\r<br />\nGurman believes that the upcoming Mac announcement will take place on Monday, October 30 or Tuesday, October 31, followed by Apple's earnings call on Thursday, November 2. He does not expect any of the new Macs to feature major changes other than new processors, but mused that there could be minor improvements to their displays.\r<br />\n\r<br />\nGurman also reiterated rumors that next-generation <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> models with M3 chips will not launch until early 2024 and that a larger \"pro\" version of the ‌iMac‌ with a 32-inch display and a new design is tabled for late 2024 or 2025. Mac redesigns are apparently likely to occur when Apple begins adding touchscreens to the lineup further in the future.<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/22/gurman-apple-to-announce-new-macs-this-month/\">Gurman: Apple to Announce New Macs This Month</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/gurman-apple-to-announce-new-macs-this-month.2408323/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"70b8746dfb67f4e48e5bbdc847d63a15c207296fa019044f6278ee7e00f178f8","category":"Apple"}