{"title":"MYµALBUMIN: A Point-of-Care Medical Device for Determination of Albumin-Creatinine Ratio (uACR) in Random Urine Samples as A Marker of Nephropathy","link":"https://www.preprints.org/manuscript/202404.1870/v1","date":1714379115000,"content":"Chronic kidney disease (CKD) is a progressive condition that affects more than 10% of the world's population. Monitoring urine albumin and creatinine ratio (µACR) has become the gold standard for nephropathy diagnosis and control. The objective of the present study was to develop a simple, accurate, sensitive, and rapid point-of-care test (PoCT) device - MYμALBUMIN that community healthcare professionals can use in resource-limited facilities and by patients in their own homes for screening the risk and monitoring the progress of CKD. Albumin and creatinine concentrations in urine samples were determined using spectrophotometric dye (tetrabromophenol blue)-binding and colorimetric Jaffe’assay, respectively. Urine samples were diluted with distilled water (1:80) and mixed separately with albumin and creatinine reaction mixture. The creatinine reaction was incubated at room temperature (25oC) for 30 minutes before analysis. Optical density (OD) was measured at the wavelengths of 625 nm (albumin) and 515 nm (creatinine). All calibration curves (2-60 mg/L and 0.25-2 mg/dL for albumin and creatinine) yielded linear relationships with correlation coefficients (r2) of &amp;gt; 0.999. Good accuracy (%DMV &amp;lt; + 2.88%) and precision (%CV &amp;lt; 3.0%) were observed from both the intra- or interday assays for the determination of albumin and creatinine by MYµALBUMIN. The limit of quantification (LOQ) of albumin and creatinine in urine samples determined by MYµALBUMIN and laboratory spectrophotometer were 2 mg/L and 0.1 mg/dL, respectively, using 37.5 μL urine samples. The device was well applied with clinical samples from 13 CKD patients. The median (range) of %DMV of the central (hospital) laboratory method (immune-based assay) was 3.18 (-10.11 to 14.12)%, with a high correlation coefficient (r2 &amp;gt;0.99). In conclusion, MYμALBUMIN showed satisfactory test performance in terms of accuracy, reproducibility, sensitivity, and specificity. The device would have significant economic benefits besides obviously improving clinical decision-making processes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"70c214b89c84d70dc85d3c761236d6cf9aed03170b886064127fffa8b39d54fc","category":"Interdisciplinary"}