{"title":"Predicting the future of our oceans—Evaluating genomic forecasting approaches in marine species","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17236?af=R","date":1711167680000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d0b93a6c-3d7f-41e4-bee2-46ebf0ef2380/gcb17236-toc-0001-m.png\" alt=\"Predicting the future of our oceans—Evaluating genomic forecasting approaches in marine species\" />\n<p>Predicting climate change impacts is of central importance in marine ecosystems that provide a major source of nutrition to global communities and this work must be based on a sound understanding of both ecological and genomic impacts. This opinion synthesizes knowledge about the genomic basis of adaptation in marine species, highlights the few examples where genomic forecasting has been applied in marine systems, identifies the key challenges in validating genomic offset estimates in marine species, and provides a workflow to guide marine managers in incorporating these predictions into the decision-making process.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change is restructuring biodiversity on multiple scales and there is a pressing need to understand the downstream ecological and genomic consequences of this change. Recent advancements in the field of eco-evolutionary genomics have sought to include evolutionary processes in forecasting species' responses to climate change (e.g., genomic offset), but to date, much of this work has focused on terrestrial species. Coastal and offshore species, and the fisheries they support, may be even more vulnerable to climate change than their terrestrial counterparts, warranting a critical appraisal of these approaches in marine systems. First, we synthesize knowledge about the genomic basis of adaptation in marine species, and then we discuss the few examples where genomic forecasting has been applied in marine systems. Next, we identify the key challenges in validating genomic offset estimates in marine species, and we advocate for the inclusion of historical sampling data and hindcasting in the validation phase. Lastly, we describe a workflow to guide marine managers in incorporating these predictions into the decision-making process.</p>","author":"K. K. S. Layton, \nM. S. O. Brieuc, \nR. Castilho, \nN. Diaz‐Arce, \nD. Estévez‐Barcia, \nV. G. Fonseca, \nA. P. Fuentes‐Pardo, \nN. W. Jeffery, \nB. Jiménez‐Mena, \nC. Junge, \nJ. Kaufmann, \nT. Leinonen, \nS. M. Maes, \nP. McGinnity, \nT. E. Reed, \nC. M. O. Reisser, \nG. Silva, \nA. Vasemägi, \nI. R. Bradbury","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"70cbd5979505155a5ac08e0ddb5cb1876a1bc51c22ef7f4156b330f171326ca2","category":"Environment"}