{"title":"ยานอวกาศ HAKUTO-R ของญี่ปุ่นตกบนดวงจันทร์ เกิดจากปัญหาซอฟต์แวร์ทำงานผิดพลาด","link":"https://www.blognone.com/node/134051","date":1685324574000,"content":"<div><div><div><p>ความคืบหน้าของข่าว <a href=\"https://www.blognone.com/node/133561\">ยานสำรวจเอกชนญี่ปุ่น HAKUTO-R ขาดการติดต่อช่วงสุดท้ายก่อนลงจอดบนดวงจันทร์</a> หลังจากนั้นมีการยืนยันโดยกล้องของ NASA ว่า HAKUTO-R \"ตก\" ระหว่างลงจอด</p>\n<p>บริษัท ispace เจ้าของยานลำนี้ได้เผยผลสอบสวนอย่างละเอียด สรุปว่าปัญหาเกิดจากซอฟต์แวร์ในการวัดค่าความสูงจากพื้นผิวดวงจันทร์</p>\n<p>รายงานของ ispace บอกว่ายาน HAKUTO-R ลดระดับความสูงเพื่อลงจอดบนดวงจันทร์ ตั้งแต่ความสูง 100 กิโลเมตรได้ตามที่ควรจะเป็น ความเร็วตอนนั้นลดเหลือ 1 เมตรต่อวินาที แต่ปัญหาเกิดขึ้นเมื่อความสูงเหลือ 5 กิโลเมตร ระบบของยานกลับวัดค่าความสูงได้เป็น 0 (อยู่บนพื้นดวงจันทร์แล้ว) ระบบการควบคุมการลงจอดอย่างช้าๆ จึงหยุดทำงาน ส่งผลให้ในระยะ 5 กิโลเมตรนี้ยานจึงร่วงลงอย่างอิสระ (free fall) และกระแทกกับผิวดวงจันทร์</p>\n<p>สาเหตุของปัญหาเกิดจากการเลือกลงจอดที่หลุมอุกกาบาต (crater) ซึ่งตัววัดระยะความสูงทำงานผิดพลาด เพราะสับสนระหว่างขอบหลุมกับก้นหลุมที่มีความสูงต่างกัน 3 กิโลเมตร ส่วนเหตุผลที่ซอฟต์แวร์ทำงานพลาดยังเกิดจากการตัดสินใจเปลี่ยนจุดลงจอด ซึ่งเกิดขึ้นหลังจากกระบวนการรีวิวความถูกต้องของซอฟต์แวร์แล้ว และการทดสอบแบบซิมูเลเตอร์ในภายหลังไม่ครอบคลุมเงื่อนไขเหล่านี้ดีมากพอ</p>\n<p>ispace บอกว่ายอมรับในความผิดพลาดครั้งนี้ และจะปรับแก้ในซอฟต์แวร์ของภารกิจครั้งถัดไปที่จะมีอีก 2 ครั้งในอนาคต</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0c3a1c3fdf69789f3194268b147c6a74.jpg\" /></p>\n<p>ภาพเรนเดอร์ยาน HAKUTO-R ที่ควรลงจอดบนดวงจันทร์ได้สำเร็จ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/676c62a47dce6bad0cef0f20981e84cf.jpeg\" /></p>\n<p>ที่มา - <a href=\"https://ispace-inc.com/news-en/?p=4691\">ispace</a> via <a href=\"https://www.engadget.com/japans-ispace-says-hakuto-r-crashed-because-it-got-confused-by-a-crater-rim-113115803.html\">Engadget</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/space\">Space</a></div><div><a href=\"/topics/moon\">Moon</a></div><div><a href=\"/topics/japan\">Japan</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"70cbf2238a495d2d32b590c76d51ec6e2c617c01b87971dd605617b3c97feb79","category":"Thai"}