{"title":"The Arabidopsis ARID–HMG DNA-BINDING PROTEIN 15 modulates jasmonic acid signaling by regulating MYC2 during pollen development","link":"https://academic.oup.com/plphys/article/196/2/996/7699678?rss=1","date":1719360000000,"content":"<span><div>Abstract</div>The intricate process of male gametophyte development in flowering plants is regulated by jasmonic acid (JA) signaling. JA signaling initiates with the activation of the basic helix–loop–helix transcription factor (TF), MYC2, leading to the expression of numerous JA-responsive genes during stamen development and pollen maturation. However, the regulation of JA signaling during different stages of male gametophyte development remains less understood. This study focuses on the characterization of the plant ARID–HMG DNA-BINDING PROTEIN 15 (<span>AtHMGB15</span>) and its role in pollen development in <span>Arabidopsis</span> (<span>Arabidopsis thaliana</span>). Phenotypic characterization of a T-DNA insertion line (<span>athmgb15-4</span>) revealed delayed bolting, shorter siliques, and reduced seed set in mutant plants compared to the wild type. Additionally, <span>AtHMGB15</span> deletion resulted in defective pollen morphology, delayed pollen germination, aberrant pollen tube growth, and a higher percentage of nonviable pollen grains. Molecular analysis indicated the downregulation of JA biosynthesis and signaling genes in the <span>athmgb15-4</span> mutant. Quantitative analysis demonstrated that JA and its derivatives were ∼10-fold lower in <span>athmgb15-4</span> flowers. Exogenous application of methyl jasmonate could restore pollen morphology and germination, suggesting that the low JA content in <span>athmgb15-4</span> impaired JA signaling during pollen development. Furthermore, our study revealed that AtHMGB15 physically interacts with MYC2 to form a transcription activation complex. This complex promotes the transcription of key JA signaling genes, the R2R3-MYB TFs <span>MYB21</span> and <span>MYB24</span>, during stamen and pollen development. Collectively, our findings highlight the role of AtHMGB15 as a positive regulator of the JA pathway, controlling the spatiotemporal expression of key regulators involved in Arabidopsis stamen and pollen development.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"70d1ef76402b1be8d54834ec00ea1d6d8cc711ed4a7f7dbf05a444b85c8972dd","category":"Environment"}