{"title":"Human Pose Estimation for Yoga using VGG-19 and COCO Dataset","link":"https://www.preprints.org/manuscript/202408.1107/v1","date":1724144673000,"content":"Human Pose Estimation (HPE) is a critical technol\u0002ogy in computer vision with diverse applications ranging from healthcare to sports analysis. This project presents a method for detecting the 2D stance of multiple persons in an image using a nonparametric representation known as Part Affinity Fields (PAFs). By leveraging the first 10 layers of the VGG-19 convolutional neural network and training on the COCO dataset, our model effectively identifies and associates key points of the  human body.The architecture employs a two-branch system that jointly learns part locations and their associations through sequential prediction. This enables the model to maintain real-time performance while achieving high accuracy, regardless of the number of persons in the image. To enhance accessibility, we developed a mobile application using Flutter and TensorFlow Lite, allowing real-time pose estimation via a mobile device’s front camera. The app provides immediate feedback on physical exercises and yoga poses, making it an invaluable tool for fitness enthusiasts and healthcare professionals. Visual outputs such as heatmaps and PAFs confirm the model’s capability to accurately localize and connect key points. Despite potential challenges such as data  quality and hyperparameter tuning, the results indicate that our approach is both reliable and practical for real-world deployment. This project not only advances the state-of-the-art in HPE  but also opens up possibilities for future enhancements, including integrating 3D pose estimation and applying the technology in augmented and virtual reality applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"70d55b08c1a205e8fe00d1174a54d07c0ac15e29130ec3c03bb27baf0caa149c","category":"Interdisciplinary"}