{"title":"Alogic Clarity Pro Touch and Clarity Pro monitor review","link":"https://www.macworld.com/article/1995331/alogic-clarity-pro-touch-clarity-pro-monitor-review.html","date":1689587827000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n<div><span>At a glance</span>\n<div><div><div><h3>Pros</h3><ul><li>Impressive 4K 60Hz touchscreen</li><li>Fantastic adjustable stand</li><li>Built-in USB hub</li></ul></div><div><h3>Cons</h3><ul><li>4K not 5K</li><li>Fiddly Mac touchscreen software install</li><li>Hub doesn’t daisy-chain extra displays</li></ul></div></div></div><h3>Our Verdict</h3><p>The Alogic Clarity Pro Touch adds touchscreen functionality for Mac. It’s a premium-looking 27in 4K touchscreen display with built-in USB hub and a fantastic height-adjustable, tilt and pivot stand. Artists and video pros will appreciate its touchscreen and the fact that it operates as a quality display with retractable webcam in normal use.<br />With the webcam, the non-touch Clarity Pro is a worthy upgrade on the entry-level Clarity.</p>\n</div><h3>Price When Reviewed</h3><p>$1,199</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today: Alogic Clarity Pro Touch Display\t\t</h3>\n\t\t\t\t<div>\n\t\t\n\t\t<div>\n\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Alogic</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$1199</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://alogic.co/products/clarity-pro-touch&amp;xcust=1-1-1995331-2-1995332-20066&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View Deal</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\n\t\t\t\t\t\n\t\t\t\t\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\tPrice comparison from Backmarket\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>One of our favorite third-party displays is Alogic’s Clarity, a great-looking premium 27-inch 4K monitor that can pivot from landscape to portrait orientations and boasts a back-mounted USB-C hub. Read our full <a href=\"https://www.macworld.com/article/917240/alogic-clarity-27-inch-4k-monitor-review.html\" target=\"_blank\">Alogic Clarity Monitor review</a>.</p>\n\n\n\n<p>Alogic has now added two new monitors to its Clarity range: the Clarity Pro and Clarity Pro Touch.</p>\n\n\n\n<p>The Clarity Pro adds an all-important webcam to the display. The Clarity Pro Touch has the webcam and is a touchscreen display that you can use much like an iPad with onscreen tap, swipe, slide and pinch.</p>\n\n\n\n<h2>Screen pixels and colors</h2>\n\n\n\n<p>Of course, the most important consideration when buying a display is the picture quality.</p>\n\n\n\n<p>As with the original Clarity, the Alogic Clarity Pro and Pro Touch offer a 4K (3840-x-2160 pixels) screen, capable of displaying over a billion colors at a 60Hz refresh rate.</p>\n\n\n\n<p>Apple’s own monitors offer 5K or 6K resolutions, but at a cost—the <a href=\"https://www.macworld.com/article/622664/apple-studio-display-review.html\" target=\"_blank\">Apple Studio Display</a> (5120‑by‑2880 resolution) costs a third more than the top-end Clarity Pro Touch and lacks the touchscreen functionality, and is twice the price of the entry-level Clarity.</p>\n\n\n\n<p>Apple’s Studio Display can go brighter (600 nits vs 400) but Alogic’s display supports HDR (High Dynamic Range) 600 content, which means that the whites of the display are very bright and clear, and the blacks much deeper, giving the same effect as 600 nits.</p>\n\n\n\n<p>The Clarity uses QLED (Quantum Dot LED) screen technology that helps produce brighter and more vibrant colors than usual.</p>\n\n\n\n<p>While the Studio Display offers a higher-end screen, the Alogic Clarity screens will be bright and impressive enough for most users.</p>\n\n\n\n<p>The Clarity Pro ($999) and Clarity Pro Touch ($1,199) are both cheaper than the Apple Studio, so if 4K is good enough for you, you get a lot of screen for your money with the Clarity range.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Fold-Stand.jpg?quality=50&amp;strip=all\" alt=\"Alogic Clarity Pro Touch with Fold Stand\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Fold-Stand.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Fold-Stand.jpg?resize=300%2C223&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Fold-Stand.jpg?resize=768%2C571&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"761\" /></figure><p>Alogic</p></div>\n\n\n\n<h2>Touchscreen controls</h2>\n\n\n\n<p>The most obvious advantage the Clarity Pro Touch has over the Apple Studio Display and other premium screens is its precision, 10-point multitouch One Glass Solution (OGS) touchscreen.</p>\n\n\n\n<p>We are all experts on a touchscreen, which we know from our phones and tablets—but few of us, especially Mac users, are used to interacting with their computers via a touchscreen.</p>\n\n\n\n<p>There are real benefits to computer touchscreens, especially for professionals such as creatives and scientists.</p>\n\n\n\n<p>Many popular creative programs—Adobe Photoshop and Illustrator, SketchUp, ZBrush, Autodesk Maya, Blender and Inkscape, for example—allow for freehand input, such as drawing or sculpting.</p>\n\n\n\n<p>Alogic has an optional accessory, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://alogic.co/products/clarity-fold-stand-for-clarity-pro-touch&amp;xcust=1-1-1995331-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">$199 Clarity Fold Stand</a>, to better facilitate comfortable drawing or interacting onscreen—the articulating stand securely holds the monitor raised at an angle like a drafting board. It can rotate 360° so that you can share work with colleagues.</p>\n\n\n\n<p>It’s a more intuitive way to fine-tune levels and effects in photo-editing or music mixing, in applications such as Adobe Lightroom and Audition, and Apple Pro Logic.</p>\n\n\n\n<p>It can also substitute for a variety of analog input devices, such as MIDI synth controllers or live streaming control decks, in apps such as Ableton Live, OBS and XSplit.</p>\n\n\n\n<p>Getting hands-on or stylus-on with the screen in front of you encourage spontaneity and experimentation.</p>\n\n\n\n<p>For non-creatives, it’s fun to move folders around, open tabs, and double- and triple-tap text with a finger. Suddenly, the desktop mouse seems rather old-fashioned.</p>\n\n\n\n<p>You can use your fingers or any capacitive stylus to interact with the onscreen content. Alogic sells its own <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://alogic.co/products/usi-active-stylus-pen&amp;xcust=1-1-1995331-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">USI Active Stylus Pen</a> for $49.99. </p>\n\n\n\n<p>Alogic’s use of One Glass Solution technology that combines the monitor’s protective layer with its input layer via a conductive medium keeps the Clarity Pro Touch’s screen as thin as the other Clarity monitors, while maintaining the monitor’s bright picture. This is a major advantage over lower cost, capacitive touchscreen monitors that often appear darker because of the extra layer of glass required by a touchscreen.</p>\n\n\n\n<p>The Clarity Pro Touch supports capacitive styluses on Windows, macOS and ChromeOS—as well as Microsoft Pen Protocol (MPP) compatible active styluses on Windows.</p>\n\n\n\n<p>While it’s a quality touchscreen, the Clarity Pro Touch doesn’t support pressure sensitive touch. </p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Touch-options-Mac.jpg?quality=50&amp;strip=all&amp;w=1112\" alt=\"UPDD Commander Touchscreen options\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Touch-options-Mac.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Touch-options-Mac.jpg?resize=278%2C300&amp;quality=50&amp;strip=all 278w, https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Touch-options-Mac.jpg?resize=768%2C829&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Touch-options-Mac.jpg?resize=1112%2C1200&amp;quality=50&amp;strip=all 1112w\" width=\"1112\" height=\"1200\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Touchscreen Mac setup</h2>\n\n\n\n<p>Setting up the touchscreen was not as simple as we expected.</p>\n\n\n\n<p>As the macOS offers much less support for touch functionality than Windows, Alogic requires the Clarity Pro Touch users to download drivers and a UPDD configuration app to provide a more functionality on Mac.</p>\n\n\n\n<p>On first basic monitor to computer setup (we used an M2 Pro Mac mini) we had basic touchscreen controls working fine. We could move folders about, switch between tabs, close windows, and so on.</p>\n\n\n\n<p>However, to get full pinch-and-zoom touchscreen you need to download special drivers and a text file you’ll need in the setup.</p>\n\n\n\n<p>Alogic includes a QR scan code in the user manual so you can quickly get to Clarity touch screen drivers. The drivers can also be found on the Clarity Pro Touch product page.</p>\n\n\n\n<p>It’s quite a fiddly experience—not difficult but with plenty of aspects and settings to configure.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Settings-Mac.jpg?quality=50&amp;strip=all\" alt=\"UPDD Commander Settings\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Settings-Mac.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Settings-Mac.jpg?resize=300%2C271&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/UPDD-Settings-Mac.jpg?resize=768%2C692&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"923\" /></figure><p>Foundry</p></div>\n\n\n\n<p>The downloaded UPDD Commander app lets you customize a long list of touch gestures involving one, two, three, or five fingers with taps, presses, drags and swipes. A one-finger tap substitute for a mouse click. A two-finger tap can be set as a double-click.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogoc-Clarity-Pro-webcam.jpg?quality=50&amp;strip=all\" alt=\"Alogic Clarity Pro Touch webcam\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogoc-Clarity-Pro-webcam.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogoc-Clarity-Pro-webcam.jpg?resize=300%2C144&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogoc-Clarity-Pro-webcam.jpg?resize=768%2C369&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"492\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Webcam and audio</h2>\n\n\n\n<p>The original Clarity lacked a webcam. Of course, you can add your own separate webcam to dangle from the top of the monitor, which would give you more flexibility and choice than having a fixed in-screen cam.</p>\n\n\n\n<p>The Clarity Pro and Pro Touch earn their “Pro” title with the addition of a webcam. This one is clever as it is automatically raises itself from within the monitor when an app—such as FaceTime, Zoom, Google Meet, Slack or Teams—requires it, and then auto-retracts when it’s no longer needed.</p>\n\n\n\n<p>This keeps the straight-line looks of the monitor when not in use, and also gives you  privacy protection as it ensures that the camera has no chance of spying on you if malware has somehow got into your system.</p>\n\n\n\n<p>It’s an 8-megapixel webcam that offers a decent quality image, and audio is fine, too. (The Apple Studio Display features a fixed 12-megapixel webcam).</p>\n\n\n\n<p>While it’s clever, the retractable webcam feels a little flimsy, and the adjusting scroll wheel at the back doesn’t give a lot of camera manoeuvrability—although more than you get with the Apple Studio Display’s static camera and lack of any adjustability to the monitor. With the Clarity Pro and Pro Touch you will mainly use the monitor’s own super stand to centre yourself onscreen.</p>\n\n\n\n<p>Alogic’s Clarity display features two 5W speakers. It’s ok for video calls but you wouldn’t want to listen to music on it—you’d be better off with a separate quality speaker. The built-in 3.5mm audio jack can be used to connect external speakers.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-ports.jpg?quality=50&amp;strip=all\" alt=\"Alogic Clarity Pro hub ports\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-ports.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-ports.jpg?resize=300%2C77&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-ports.jpg?resize=768%2C196&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"261\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Built-in multi-port hub and power</h2>\n\n\n\n<p>To have full use of the touchscreen and webcam, you must connect your Mac to the monitor via either the USB-C or USB-B port at the back of the display.</p>\n\n\n\n<p>All Alogic Clarity monitors boast the back-mounted hub that includes a USB-C upstream port that supports DisplayPort 1.4, plus an upstream USB-B port, and two USB-A downstream ports, as well as a DisplayPort 1.4 and two HDMI 2.1 ports, and a 3.5mm audio port.</p>\n\n\n\n<p>You connect from your Mac to the screen for Extended or Mirrored display modes via either the USB-C, DisplayPort 1.4 or one of the HDMI 2.1 ports. But connecting via the video ports will not allow for the webcam or touchscreen to work. As such the extra video ports at the back of the Clarity Pro and Pro Touch are rather redundant if you want to have full control of all the features as you can’t daisy-chain the video ports.</p>\n\n\n\n<p>Using USB-C or USB-B, it can connect to your computer for not just the display but also charge a laptop at up to 65W at the same time.</p>\n\n\n\n<p>The original Clarity monitor offered 90W charging for the laptop but the Pro and Pro Touch require around 25W for the webcam.</p>\n\n\n\n<p>However, Alogic has reduced the power supply from 180W to just 150W, so a higher level of laptop charging could maybe have remained if the original power supply had been retained.  </p>\n\n\n\n<p>The bonus of charging your laptop from the monitors means you don’t need a separate power supply for your laptop. You can just connect with one cable to get an external display and keep even a medium-sized (13-14-inch) laptop fully charged.</p>\n\n\n\n<p>The Apple Studio Display connectivity hub has one upstream 96W PD Thunderbolt 3 port to connect to the computer and three 10Gbps USB-C ports for connecting peripherals and storage devices.</p>\n\n\n\n<p>If the computer is connected to the USB-C port on the display, the USB-A ports will operate at a rather lame USB 2.0 (480MBps) speed because the video traffic shares the USB-C cable with the USB data. This is where the Studio Display’s higher-bandwidth 40Gbps Thunderbolt 3 connection and fast USB-C ports are superior. USB 2.0 is fine for most peripherals (keyboards, mic, for example) but not for high-speed storage devices such as external hard drives and USB flash drives.</p>\n\n\n\n<p>However, if the computer is connected to the display’s USB-B port, the USB-A ports operate at 5Gbps USB 3.0 speed. This makes the USB-B connection the most sensible, and both USB-C and USB-B connections are acceptable for touchscreen use.</p>\n\n\n\n<p>However, to connect your Mac to the display via USB-B you will need an extra USB-C to USB-B cable, which strangely isn’t included. The Clarity monitors come with three cables: USB-C to USB-C (10Gbps), HDMI to HDMI and, curiously, USB-A to USB-B.</p>\n\n\n\n<p>Despite the multiple display connections you cannot, for now at least, daisy chain other displays to the Clarity’s hub so the two HDMI ports are rather redundant.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-monitor-back.jpg?quality=50&amp;strip=all\" alt=\"Alogic Clarity Pro Touch monitor back\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-monitor-back.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-monitor-back.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-monitor-back.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-monitor-back.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Design and looks</h2>\n\n\n\n<p>All the silvery Clarity monitors looks great next to a Mac. This is no uninspiring black-plastic monitor.</p>\n\n\n\n<p>It’s a little deeper than the slim Apple Studio Display, but its curved back means you won’t notice from the front. Unlike with the static Apple display, you can easily adjust the height of the Clarity monitors. The excellent stand is height-adjustable up to 150mm.</p>\n\n\n\n<p>The screen can tilt and swivel and rotate in portrait and landscape orientations. A gravity sensor detects the rotation and adjusts the picture to match the orientation.</p>\n\n\n\n<p>The Clarity displays measure 56.5cm tall (22.2in), 62.4cm (24.5in) wide and 22cm (8.7in) deep. The Clarity Pro and Pro Touch are slightly heavier than the webcam-less Clarity—weighing 7.6kg vs 7.5kg.</p>\n\n\n\n<p>The Studio Display measures 47.8cm tall (18.8in), 62.3cm (24.5in) wide and 16.8cm (6.6in) deep. It weighs 6.3kg.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Clarity-monitors.jpg?quality=50&amp;strip=all\" alt=\"Alogic Clarity, Pro and Pro Touch Displays\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Clarity-monitors.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Clarity-monitors.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Clarity-monitors.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/07/Alogic-Clarity-Pro-Touch-Clarity-monitors.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"683\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Price</h2>\n\n\n\n<p>For a quality 27in display, Alogic’s entry-level Clarity is competitively priced at $799.99 or £700.</p>\n\n\n\n<p>Adding a retractable webcam, the Clarity Pro costs $999 / £849.</p>\n\n\n\n<p>With touchscreen the Clarity Pro Touch is priced at $1,199 / £999. For a large 4K touchscreen display, this is attractively priced.</p>\n\n\n\n<p>Compare those prices to Apple’s $1,599/£1,499 price tags for its Studio Display, which has a 5K screen but lacks an adjustable stand or touchscreen.</p>\n\n\n\n<p>Read our full roundup of the <a href=\"https://www.macworld.com/article/668700/best-mac-monitors-displays.html\" target=\"_blank\">best monitors for Mac</a>.</p>\n\n\n\n<h2>Verdict</h2>\n\n\n\n<p>The Alogic Clarity Pro Touch adds touchscreen functionality for Mac. It’s a premium-looking 27in 4K touchscreen display with built-in USB hub and a fantastic height-adjustable, tilt and pivot stand. Artists and video pros will appreciate its touchscreen and the fact that it operates as a quality display with retractable webcam in normal use.</p>\n\n\n\n<p>With the webcam, the non-touch Clarity Pro is a worthy upgrade on the entry-level Clarity, but if you prefer a more flexible separate webcam, the original Clarity is still an excellent option—maybe as a second display next to either the Pro or Pro Touch.</p>\n\nComputer Accessories, Monitors</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"70de8464ba6b362461979e57db80a479780012321e2e8854dba39d51e9310e90","category":"Apple"}