{"title":"How Drops-Le Col have prepared for Liege-Bastogne-Liege","link":"https://www.cyclist.co.uk/news/9526/how-drops-le-col-have-prepared-for-liege-bastogne-liege","date":1619185519000,"content":"<span>\n      <span><a href=\"/authors/maria-david\">Maria David</a></span>\n  </span><div>  \n  <div>      <div><span>23 Apr 2021</span></div>    </div></div><p>\nAfter a promising start to the season, Drops-Le Col let us in on their preparations for Liège-Bastogne-Liège. Photos: Rhode Photo</p>\n<div>\n      <p> British Drops-Le Col s/b Tempur rider Joss Lowden is buzzing after placing fifth at Brabantse Pijl recently. With riders from all the top ranked teams being present, this was a women's WorldTour race in all but name.</p>\n<p>Lowden was in the final select break with fancied riders like Demi Vollering (<a href=\"/tags/sd-worx\">SD Worx</a>) and Ruth Winder (<a href=\"/tags/trek-segafredo\">Trek-Segafredo</a>), but just missed out in the dash for the finish line.</p>\n<p>As a relative newcomer to WorldTour racing, Lowden’s strong showing at Brabantse Pijl, along with a top 10 finish at the Healthy Ageing Tour, has been confidence-building for the team’s 2021 campaign.</p>\n<p></p><div><div>\n  <a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos#1\"><p><span>Image 2 of</span> 5</p><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/04/rhodephoto_dropslecol_lbl_recon-3871.jpg?itok=29ZOmFLA\" /></a></div>\n<p><span>Image 2 of </span>5</p>\n</div> <p></p>\n<h3>Preparation for Liège-Bastogne-Liège</h3>\n<p>Manager Tom Varney made the decision for the women to skip the Amstel Gold Race so that the British UCI Continental Team could focus on the remaining two races of Ardennes Classics week.</p>\n<p>Sadly, a crash at a pivotal point in Flèche Wallonne put Lowden out of contention, but it’s a case of onwards and upwards for <a href=\"/tags/li-ge-bastogne-li-ge\">Liège-Basogne-Liège</a>.</p>\n<h4>Training and Recon</h4>\n<p>Given the pandemic, the team have done things differently to previous years, with riders travelling less than usual. Drops-Le Col s/b Tempur did not feel it was morally appropriate to do all their customary team training camps in Spain during these uncertain times, and Lowden spent more time in the UK, away from her teammates who were in a team house in Belgium.</p>\n<p>Still, lots of base training has been done around Lowden’s area of origin, in Sussex, notably in the Ashdown Forest, one of her favourite areas to train.</p>\n<p>While simulating the profile of a course is useful, what is really important is to simulate the efforts, as Lowden says: 'For Liège-Bastogne-Liège you are looking at something like 100km with 12x 3 minutes at maximum effort.</p>\n<p>'So training is based around that, though it is a very tough thing to do. Most of us can do six or eight efforts at 3 minutes maximum, but only a few racers can do 12. So the race then just becomes attritional.'</p>\n<p></p><div><div>\n  <a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos#4\"><p><span>Image 5 of</span> 5</p><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/04/rhodephoto_dropslecol_lbl_recon-8756.jpg?itok=ktC4sjrh\" /></a></div>\n<p><span>Image 5 of </span>5</p>\n</div> <p></p>\n<p>Knowledge of the course is really important, and though Lowden has done some scouting of the Liege route, logistics have meant that in some races it’s not always possible to do a full recon.</p>\n<p>However, her teammates and performance director Nico Marche have been very good at providing analysis, giving full details on where the climbs are and where the selection will take place.</p>\n<p>'The girls have raced much more than I have so far, and with them having reconned the routes of Liège-Bastogne-Liège and all the other Classics races they are able to say exactly which part of the road to be at which point, and where it is important to stay at the front, where they think the break will go.</p>\n<p>'Sara [Penton], Emilie [Moberg] and Marjo [Van 't Geloof] were great at doing that at Brabantse and it worked well,' Lowden says.</p>\n<p>Another crucial aspect of training is mental preparation and the belief that you can be in the race and contest for the win. With the early season gains for the team, Lowden is beginning to feel like she can be part of the WorldTour race.</p>\n<p>'The more you race, the better you do, and then you believe you can be there and ride in a way that supports that. When racing these Classics races it really hurts! Your legs are screaming. But, to a certain extent, the harder it hurts and the longer it hurts the better it is for me.</p>\n<p>'I know I can push myself through that pain boundary. Before, when my legs were hurting I thought I was the only one in pain. But now I realise that what I’m feeling is the same as what 95% of the other racers are feeling.</p>\n<p>'Because I know I can push myself through the pain I also know that I could do well at those moments when it hurts.'</p>\n<p></p><div><div>\n  <a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos#2\"><p><span>Image 3 of</span> 5</p><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/04/rhodephoto_dropslecol_lbl_recon-3872.jpg?itok=VEwXl5Gs\" /></a></div>\n<p><span>Image 3 of </span>5</p>\n</div> <p></p>\n<h3>Activation and rehabilitation</h3>\n<p>Part of the secret behind optimal physical preparation for racing is muscle activation. Teammate Van ’t Geloof being a qualified physiotherapist is very useful as she provides advice and tips to the Drops-Le Col riders on muscle recruitment and core stability.</p>\n<p>Lowden has had her fair share of injuries in recent years, so conditioning is key for her being able to stay injury-free.</p>\n<p>'I have injuries most years. Last year I separated my shoulder, as well as having bad sinusitis so I was feeling pretty rubbish. I spoke to Marjo and said \"I really need your help\".</p>\n<p>'The problem is that I don’t always recruit the muscles that I should when riding – other muscles overcompensate, and so I end up being injured a lot.</p>\n<p>'Doing the specific activation exercises that Marjo has given us has been valuable, and it has really made a difference.'</p>\n<p></p><div><div>\n  <a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos#3\"><p><span>Image 4 of</span> 5</p><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/04/rhodephoto_dropslecol_lbl_recon-3937.jpg?itok=K4-OrWYU\" /></a></div>\n<p><span>Image 4 of </span>5</p>\n</div> <p></p>\n<h3>Health and well-being</h3>\n<p>Because races are now coming thick and fast, the riders’ health and well-being is monitored closely by the team’s performance director Marche as well as by team doctor Claire Rose – herself a former racer.</p>\n<p>UCI Continental teams are not obliged to have a medic among their permanent staff, however Drops-Le Col team principals Bob and Tom Varney put the health of the riders at the forefront.</p>\n<p>So Lowden benefits from close follow-up through a specific rider wellness programme that has been introduced as part of their suite of monitoring tools. Various aspects of rider well-being are tracked, including nutrition, weight, sleep, concussion, menstrual cycle and mental health.</p>\n<p>\nAs for this last race of the Ardennes Classics, it is going to be a challenge for all riders regardless of the kit colours they are wearing when they crest seven categorised climbs and various other lumps over the 140.9km route.</p>\n<p>Liège-Bastogne-Liège is one of the most arduous races on the women’s calendar but Lowden remains positive and is ready to make her mark on the race.</p>\n<p>Further down the line, in the autumn she hopes to make an official attempt at the <a href=\"/news/9231/joss-lowden-breaks-womens-hour-record-in-training\">Hour Record</a>, which she unofficially broke last year.</p>\n<p>Given her performances so far over the spring, we'd say things are looking good for the Drops-Le Col s/b Tempur rider. </p>\n  </div>\n<div>  \n  <div>      <div>\n<div>\n\n          &lt;&gt;<span><a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos\">Drops-Le Col Liege-Bastogne-Liege training photos</a></span>&lt;/&gt;\n      \n  \n  <div>\n\n    \n    \n    <div><span>\n      <span><a href=\"/news\">News</a></span>\n  </span><div>  \n  <div>      <div><span>23 Apr 2021</span></div>    </div></div><div>\n        <div><ul><li><a href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.cyclist.co.uk%2Fnews%2F9525%2Fdrops-le-col-liege-bastogne-liege-training-photos\">\r\n  <span>\r\n      \r\n          \r\n      \r\n  </span>\r\n  <span>facebook</span>\r\n</a>\r\n</li>\n<li><a href=\"http://twitter.com/home?status=Drops-Le%20Col%20Liege-Bastogne-Liege%20training%20photos%20https%3A%2F%2Fwww.cyclist.co.uk%2Fnews%2F9525%2Fdrops-le-col-liege-bastogne-liege-training-photos\">\r\n  <span>\r\n      \r\n      \r\n      \r\n  </span>\r\n  <span>twitter</span>\r\n</a>\r\n</li>\n<li><a href=\"https://plus.google.com/share?url=Drops-Le%20Col%20Liege-Bastogne-Liege%20training%20photos%20https%3A%2F%2Fwww.cyclist.co.uk%2Fnews%2F9525%2Fdrops-le-col-liege-bastogne-liege-training-photos\">\r\n  <span>\r\n      \r\n          \r\n            \r\n              \r\n              \r\n            \r\n          \r\n      \r\n  </span>\r\n  <span>google+</span>\r\n</a>\r\n</li>\n<li><a href=\"mailto:?subject=Drops-Le%20Col%20Liege-Bastogne-Liege%20training%20photos&amp;body=https%3A%2F%2Fwww.cyclist.co.uk%2Fnews%2F9525%2Fdrops-le-col-liege-bastogne-liege-training-photos\">\r\n  <span>\r\n      \r\n          \r\n        \r\n  </span>\r\n  <span>email</span>\r\n</a>\r\n</li>\n</ul></div>  </div>\n</div><div>  \n  <div>      <div><div>\n  <a href=\"/news/9525/drops-le-col-liege-bastogne-liege-training-photos#0\"><p><span>Image 1 of</span> 5</p><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/gallery_adv/public/2021/04/rhodephoto_dropslecol_lbl_recon-8529.jpg?itok=t07QPMaw\" /></a></div>\n</div>    </div></div><div><h4><span>Read more about:</span></h4><div><div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div><div>  \n  <div>      <div><a href=\"/training\">Training</a></div>    </div></div></div></div>  </div>\n\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jackew","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"70ed8f64f41436a0a799cbfb4a5db765b7a8de15f7efac31b0dcd09eab988977","category":"Cycling"}