{"title":"‘There was never pressure to be in cycling, it was just what I wanted to do’: Zoe Bäckstedt interview","link":"https://www.cyclist.co.uk/in-depth/zoe-backstedt-cyclist","date":1695722133000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/zoe-backstedt-cyclist\">‘There was never pressure to be in cycling, it was just what I wanted to do’: Zoe Bäckstedt interview</a></p>\n\n<p><em>This interview was originally conducted before EF Education-Tibco-SVB</em> <em>revealed they were folding at the end of the 2023 season but Bäckstedt was kind enough to answer a few extra questions about her switch to Canyon-SRAM.</em></p>\n\n\n\n<p><strong>You were on the winning team [EF Education-Tibco-SVB] at this year’s Paris-Roubaix. How did you find the race?</strong></p>\n\n\n\n<p>Bumpy! No, it was great fun and I really enjoyed it.</p>\n\n\n\n<p><strong>What was more special, the moments with your dad, <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-magazine-podcast-episode-40-magnus-backstedt-on-paris-roubaix\" target=\"_blank\">Magnus</a> [a former Paris-Roubaix winner], or being on the winning team?</strong></p>\n\n\n\n<p>Honestly, being on the winning team. Nothing beats that feeling. We were outsiders to win, but they let the breakaway get so far up the road there wasn’t much chance of it coming back. Everyone else did loads of work to bring it back to nine seconds, but then they messed it up and didn’t quite make it back on.</p>\n\n\n\n<p><strong>At what point did you start celebrating?</strong></p>\n\n\n\n<p>When I hit the velodrome I had no idea what was happening. I couldn’t hear anything on the radio for almost the whole race because AJ’s [teammate Alison Jackson, winner of <a href=\"https://www.cyclist.co.uk/in-depth/paris-roubaix-2023-highlights\" target=\"_blank\">Paris-Roubaix 2023</a>] group was five and a half minutes ahead and the radio doesn’t quite reach that far, and I’d pulled it out with about 10km to go because there was no point. </p>\n\n\n\n<p>I looked up to the TV as I came into the velodrome and saw her sprinting and thought, ‘Oh cool, they’re replaying the sprint.’ I was thinking it was maybe the bunch sprint and there was someone ahead. I kept watching and then she started celebrating. I went half a lap thinking, ‘Did she actually do it or not? What’s going on?’ Then I saw my soigneur and she was just screaming at me; then I realised and I started to scream. I did that lap so hard to get back to see her, it was the best thing ever.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/2023-pro-cycling-european-championships\">Pro Log: Christophe Laporte beats Wout van Aert at European Championships, potential Jumbo-Visma and Soudal-QuickStep merger, Nathan Van Hooydonck retires and Cat Ferguson signs for Movistar</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-magazine-podcast-episode-25-the-backstedts-roubaix-dream\">Cyclist Magazine Podcast Episode 25 – The Backstedts’ Roubaix dream</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 144: on sale now!</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n<div>\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-970x647.jpg\" alt=\"Zoe Backstedt interview\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/zoe-backstedt-interview-01.jpg 1200w\" /><figcaption>Patrik Lundin / Cyclist</figcaption></figure></div>\n\n\n<p><strong>And you were riding your dad’s old pedals. How did that come about?</strong></p>\n\n\n\n<p>He gave them to me at the start of the year and said, ‘I’ve been waiting for when you or El [sister <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-magazine-podcast-episode-25-the-backstedts-roubaix-dream\" target=\"_blank\">Elynor</a>] signs for a team that rides Speedplay,’ and that happened to be me first. I think he only used them in one or two races beforehand, so they felt normal.</p>\n\n\n\n<p><strong>There was a lot of interest from teams trying to sign you. What made you choose EF?</strong></p>\n\n\n\n<p>What worked best for me was being able to do cyclocross as well, and obviously EF have got Clara Honsinger [American cyclocross champion] in there, which helped. Nothing beats bright pink kit, too, and that plays a very big part in it. It sounds like a joke but it really is the nicest kit in the peloton.</p>\n\n\n\n<p><strong>Did you ever consider joining your sister at Lidl-Trek?</strong></p>\n\n\n\n<p>For my first year, no. I don’t think it’s right for me and El to be in the same team in my first year. I’m still learning and it would be too much of a comfort barrier if things went wrong. Maybe in a few years if the opportunity comes and we both want to go to the same team it would be cool to race with her, but for my first year it didn’t make sense.</p>\n\n\n\n<p><strong>Growing up in that environment, were you always into cycling?</strong></p>\n\n\n\n<p>A big part of me didn’t want to do it. Growing up I was doing a lot of other sports, just being a kid, then I started getting into high school and there was a lot of homework and exams and I was doing three or four sports so it was getting too much and I cut it down to just cycling. I think I picked the right sport.</p>\n\n\n\n<p><strong>Was it competitive at home?</strong></p>\n\n\n\n<p>Only in board games. Of course it’s going to be competitive at some point but my sister and I were never in the same category or the same races. I think we only raced a couple of national races on the track and then together we did some madison. Against each other it’s always going to be competitive; with each other it was helping each other out in any way we could.</p>\n\n\n\n<p><strong>Is it nice to be in the same races as Elynor now?</strong></p>\n\n\n\n<p>Yeah, in the middle of a race she’ll be like, ‘You alright Zo? Have you eaten? Have you drunk?’ I passed her in Flanders as she had done all the work she needed to do and I was trying to move up and she said, ‘Go Zoe, you need to move up.’ I’m like, ‘I know, I’m trying my best!’ She’s still there for me even though we’re on different teams, so it’s really nice.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p><strong>Magnus is a DS at Canyon-SRAM. Have you bumped into him a lot at races?</strong></p>\n\n\n\n<p>Pretty much every race he’s been at I’ve tried to go over to see him just to say hi. Just make sure he’s alright.</p>\n\n\n\n<p><strong>How have you found the step up to the elite ranks?</strong></p>\n\n\n\n<p>It’s been pretty good. The races are a lot longer – my first race was 140km, which was not necessarily hard because I’ve trained those distances, but it was when it got to Gent-Wevelgem and it was 160km. Those last 20km I could feel in my legs. I did a couple of races as a <em>stagiaire</em> last year too, which was cool to just get a little bit of experience. It wasn’t too hard and the team have made it a lot easier.</p>\n\n\n\n<p><strong>And it seems like there hasn’t been pressure to get results?</strong></p>\n\n\n\n<p>Yeah absolutely, it’s just experiencing the WorldTour, making mistakes and learning from them, and helping out teammates in any way I can.</p>\n\n\n\n<p><strong>Was there any pressure from the family when you were younger?</strong></p>\n\n\n\n<p>Growing up it was, ‘Do what you enjoy. If you enjoy riding go out and ride; if you don’t, do something else.’ There was never pressure to be in cycling, it was just to do what I wanted to do.</p>\n\n\n\n<p><strong>Is that why you do so many different disciplines?</strong></p>\n\n\n\n<p>Yep! Doing cyclocross, road, track, for me it just makes sense in my brain.</p>\n\n\n\n<p><strong>Which is your favourite?</strong></p>\n\n\n\n<p>Cross. It’s great fun. Muddy field in Belgium – nothing better. We have a Benidorm World Cup now too, so we do get to go to the sunshine in January.</p>\n\n\n\n<p><strong>Do you think you’ll specialise in the Classics as you develop?</strong></p>\n\n\n\n<p>Probably, yeah. I quite like the brutality of those types of races and the unpredictable weather in Belgium at the start of spring. It’s my type of stuff. I’m getting flashbacks to Gent-Wevelgem in my head… 160km in the rain. </p>\n\n\n\n<figure><img src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/09/%C2%A9Canyon_Backstedt_297_SR_AEROAD-STRAIGHT-776x970.jpg\" alt=\"woman standing behind bike\" /><figcaption>Canyon-SRAM</figcaption></figure>\n\n\n\n<p><strong>With your mid-season move to Canyon-SRAM, was an immediate switch a priority when figuring out where to go?</strong></p>\n\n\n\n<p>When the news came out that the team was folding at the end of the year, Linda [Jackson, EF Education-Tibco-SVB founder] was extremely helpful and understanding in allowing me to move before the start of the cyclocross season. If I’d have moved at the end of the year I would’ve had to deal with a change of kit, equipment and team structure mid-cyclocross season. This is an important cross season for me with some key goals, so it was the best solution to move across to <a href=\"https://www.cyclist.co.uk/tags/canyon-sram\" target=\"_blank\">Canyon-SRAM</a> when I did.</p>\n\n\n\n<p><strong>How has it been like so far being on the same team as your dad?</strong></p>\n\n\n\n<p>It’s been super-cool. In my first race with the team I forgot he was my dad as I saw him as my boss/DS in the team car. When I was growing up he was always at the races, it’s just now on a more professional level. It’s really nice to have him there to help and support the whole team, and of course he knows his stuff, which I really respect.</p>\n\n\n\n<p><strong>Do you have any hopes for the team’s 2024 kit design?</strong></p>\n\n\n\n<p>Honestly I’m happy if it stays the same. I really love the kit we have now with the shark teeth on the shoulders and the forks of the bike. If it does change I’ll be looking forward to seeing what the new design may be and getting to race in something just as cool.</p>\n\n\n\n<p><strong>• This article originally appeared in issue 144 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/zoe-backstedt-cyclist\">‘There was never pressure to be in cycling, it was just what I wanted to do’: Zoe Bäckstedt interview</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"70ee20add673fc07fa79745e68e1e3e3aedd5276eeb2817caffe3d591eb26c03","category":"Cycling"}