{"title":"Tour de France 2021 Stage 13 Preview - A Classics Profile","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-13-preview-a-transitional-day","date":1625762979000,"content":"\n      <p>Stage 13 of the Tour de France heads towards the Pyrenees, but the riders won't be taking on the mountains just yet. Instead, a long transitional stage awaits the peloton, 220km in length.</p>\n<p>This could bring the classics specialists to the fore, where they'll make life hellish for the pure sprinters.</p>\n<p>Stage 12 was dominated by a breakaway of 13 riders who escaped early after an echelon-filled start. Later, a group of four rode away from the rest of the escapees, before Nils Politt fled solo and descended into <span>Nîmes to win the first WorldTour race of his career. The peloton arrived over 15 minutes behind Politt, where Mark Cavendish picked up a couple of green jersey points in the sprint.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tagged/tour-de-france-2021\"><b><i>Tour de France 2021 articles</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP13_1024x1024.jpg?v=1625668572\" />Stage 13 profile</span></i></p>\n<p><span>The stage begins in </span>Nîmes <span>which is where stage 12 concluded. The stage acts partly as a transition day to the Pyrenees.</span></p>\n<p><span>The only categorised climb occurs at kilometre 51. It is likely that the breakaway will have formed by the time the riders reach the Côte du Pic Saint-Loup. The ascent is 5.5km in length and averages 3.6%. However, the climb features a short downhill section halfway up and the final kilometre is very steep, meaning it cannot be underestimated by the non-climbers.</span></p>\n<p><span>The next point to look out for is the intermediate sprint in Fontès which takes place just over 100km in. Here, Mark Cavendish may sprint to protect his green jersey, though he may be more concerned with the stage finish</span><span>. Other riders with an interest in the green jersey include Jasper Philipsen, Michael Matthews and Sonny Colbrelli.</span></p>\n<p><span>From here, 120km will remain until the finish line in Carcassonne. Although there are no more categorised climbs, flat terrain is not overly prevalent with rolling, short hills throughout. The pure sprinters, and notably Mark Cavendish, must resist during this phase of the race if they are to compete for the stage.</span></p>\n<p><span>The hills cease in the final 20km, where the road dives into the centre of Carcassonne. The first critical corner occurs at the</span><i><span><span> </span>flamme rouge</span></i><span><span> </span>(1km remaining). This is a tight, right-hand corner which is more acute than 90 degrees, meaning the speed will be wiped from the group and making positioning even more critical. With 600 metres left, there is a 60-degree left-turn, where the leadout trains will battle for position. Deceuninck-Quick Step won this battle on stage 11 which meant Mark Cavendish’s job was<span> </span>simplified. The road kinks to the left with around 200 metres left, where the sprinters will unleash their assault on the finish line. </span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326659878-min_1024x1024.jpg?v=1625668346\" />Image credit: Chris Graythen/Getty Images</span></i></p>\n<p><span>On paper, this looks to be a mass sprint. However, due to the distance and rolling nature of the stage, this could explode into something that looks a little more like a one-day classic. </span></p>\n<p><span>This works against<span> </span></span><b>Mark Cavendish</b><span>. The Manx Missile may struggle with the almost 2,000 metres of climbing. If he does make it to the finish line in the front, he’ll be the man to beat, but his presence there is questionable. This makes<span> </span></span><b>Davide Ballerini</b><span><span> the</span> key man in the Deceuninck squad. The Italian won Omloop Het Nieuwsblad earlier this year in a sprint finish. He possesses a rapid kick and isn’t averse to fast racing either.</span></p>\n<p><span>Jumbo-Visma’s Tour de France altered massively when</span><b><span> Primož Roglič </span></b><span>crashed on stage 3 and later withdrew. They still have GC ambitions with the talented<span> </span></span><b>Jonas Vingegaard</b><span>, but they are now much less likely to win the Tour de France. This has unleashed<span> </span></span><b>Wout van Aert</b><span><span> </span>to go stage hunting. </span></p>\n<p><span>We’ve seen the Belgian road champion up the road a couple of times already, notably when he won in <span>Malaucène after conquering Mont Ventoux</span>. This stage suits him supremely well — the purest sprinters may struggle to hold on and it's difficult enough for him to make an impression. His best opportunity may lie in the breakaway, but Van Aert could win this one in a sprint or even with a solo attack.</span></p>\n<p><span>Bora-hansgrohe put on a masterclass at the Giro d'Italia earlier this season when guiding <strong>Peter Sagan</strong> to the line after dropping the pure sprinters. However, the Slovak Champ has dropped out of the Tour de France —</span><span> only the fourth Grand Tour he's failed to finish in his career. That didn't stop <strong>Nils Politt </strong>from sailing to victory in Nîmes. Bora could try a similar tactic again with the likes of <strong>Daniel Oss, Ide Schelling </strong>and<strong> Lukas </strong><span><strong>Pöstlberger</strong> </span>all potential breakaway options as well as Politt.</span></p>\n<p><span>However, <span>Bahrain-Victorious and Team BikeExchange could try to replicate Bora's Giro strategy with <b>Sonny Colbrelli</b> and <b>Michael Matthews</b> in mind. BikeExchange are one of the few teams with all eight riders still present which means they could be leaned on to control.</span></span></p>\n<p><span>Other sprinters that could pose a threat include<span> </span></span><b>Jasper Philipsen, Christophe Laporte<span> </span></b><span>and<span> </span></span><b>Nacer Bouhanni.</b></p>\n<p>However, the stage is far from guaranteed to be decided in a mass sprint. A large breakaway could force their way up the road early which would make things almost impossible for a single team to control all day.</p>\n<p><span>This is how stage 7 unfolded, where<span> </span></span><b>Matej<span> </span></b><b>Mohorič</b><span> </span><span>tasted victory at the Tour de France for the first time. The Slovenian champion has another good chance here if he finds himself in a similar breakaway group.</span></p>\n<p><span>AG2R <span>Citroën </span>have a variety of good breakaway options with<span> </span></span><b>Greg Van Avermaet, Oliver Naesen<span> </span></b><span>and<span> </span></span><b>Dorian Godon<span> </span></b><span>in their ranks. None of the three have recorded a single top 10 at the Tour de France this season, but this is a good opportunity to change that record.</span></p>\n<p><span>Other riders with a chance in a large breakaway group include<span> </span></span><b>Anthony Turgis, Kasper Asgreen, Jasper Stuyven, Dylan van Baarle, Michael Valgren<span> </span></b><span>and<span> </span></span><b>Magnus Cort.</b></p>\n<h4><b>Prediction</b></h4>\n<p>The sprinters will be <span>desperate to compete for stage victory in </span><span>Carcassonne after missing a good chance in Nîmes.</span><span> However, if more than ten riders can join the</span><span> breakaway, it will be very difficult to control. </span><span>From the breakaway, we are picking a wildcard in <strong>Anthony Turgis</strong>. Riding for TotalEnergies, Turgis has impressed this season with numerous top ten finishes in the cobbled Classics. He has a quick finish too, which is proven by his second place at </span>Kuurne–Brussels–Kuurne.</p>\n<p><i><span>Cover image:<span> </span></span></i><i><span>A.S.O./Pauline Ballet</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"70f62609c5937743f05029f984eeac317e850f34884ec064e5822b81674935f1","category":"Cycling"}