{"title":"ข้อมูลใหม่เผย ไมโครซอฟท์เคยเสนอขาย Bing ให้แอปเปิลเมื่อปี 2018 แต่แอปเปิลไม่เอา","link":"https://www.blognone.com/node/138390","date":1708832437000,"content":"<div><div><div><p>ตอนนี้กูเกิลกำลังเจอ<a href=\"https://www.blognone.com/node/119134\">กระทรวงยุติธรรมสหรัฐ (Department of Justice หรือ DoJ) สั่งฟ้องข้อหาผูกขาดตลาด Search ในสหรัฐ</a> กระบวนการไต่สวนยังอยู่ในชั้นศาล</p>\n<p>ฝั่งกูเกิลได้ส่งเอกสารแก้ต่างต่อศาล เอกสารฉบับนี้ได้เปิดเผย \"ข้อมูลใหม่\" ว่าไมโครซอฟท์เคยเสนอขาย Bing ให้แอปเปิลในช่วงปลายปี 2018 แต่สุดท้ายแอปเปิลปฏิเสธข้อเสนอนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/633f575ff9bb7bb9ebc6bd91b1c63178.jpg\" /></p>\n<p>เอกสารของกูเกิลระบุว่าไมโครซอฟท์พยายามเสนอ Bing เป็นเสิร์ชเอนจินหลักของ Safari และ iOS มาหลายครั้ง (2009, 2013, 2015, 2016, 2018, 2020) แต่ทุกครั้งแอปเปิลปฏิเสธ หลังทดลองใช้งานแล้วพบว่าคุณภาพของผลการค้นหา Bing แย่กว่ากูเกิลมาก อีกทั้งยังตามหลังเรื่องผลการค้นหาในหลายประเทศที่แอปเปิลทำธุรกิจอยู่ นอกจากนี้ แอปเปิลยังพบว่าไมโครซอฟท์มีพนักงานฝ่าย Bing ประมาณ 1,000 คน น้อยกว่าฝ่าย Google Search ที่มีพนักงาน 6,000 คนมาก แถมไมโครซอฟท์ยังดูไม่สนใจลงทุนใน Bing เพิ่มแต่อย่างใด</p>\n<p>การพูดคุยครั้งสำคัญเกิดขึ้นช่วงปลายปี 2018 เมื่อไมโครซอฟท์เข้ามานำเสนอแผนการ Bing ให้แอปเปิลฟังอีกครั้ง และชวนให้แอปเปิลเข้ามาร่วมลงทุนใน Bing ด้วย ข้อเสนอของไมโครซอฟท์ไปไกลถึงขั้นออกปากชวนให้แอปเปิลมาซื้อ Bing ด้วยซ้ำ ซึ่งทำให้แอปเปิลยิ่งตื่นตระหนก เพราะมองว่าไมโครซอฟท์ไม่สนใจลงทุนกับ Bing ต่อแล้วจึงมาเสนอขาย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b0a8e7ee808312c85c08365150acf74b.png\" /></p>\n<p>Eddy Cue ผู้บริหารของแอปเปิลที่ดูแลธุรกิจด้านบริการในตอนนั้น มองว่าหากธุรกิจ Bing ดีจริง ไมโครซอฟท์ไม่มีทางเสนอขายแน่นอน โดยเปรียบเทียบว่าแอปเปิลไม่มีทางยก iOS ให้ไมโครซอฟท์ใช้งานฟรีๆ แน่ และสุดท้าย Tim Cook ได้แจ้งต่อ Satya Nadella ปฏิเสธข้อเสนอนี้อย่างเป็นทางการ</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8582bb9a91ced25d90e03e3d8b027e45.png\" /></p>\n<p>แต่ไมโครซอฟท์ก็ยังไม่ยอมแพ้ และกลับมาคุยกับแอปเปิลอีกรอบในปี 2020 เสนอให้แอปเปิลใช้งาน Bing ใน iOS และ Safari อีกครั้ง ซึ่งแอปเปิลก็ปฏิเสธด้วยเหตุผลเดิมคือ คุณภาพของ Bing ไม่ดีพอ และผู้ใช้งานจะต้องเปลี่ยนเอนจินกลับเป็น Google Search แน่ๆ จึงไม่มีประโยชน์อะไรที่จะเซ็นสัญญาฉบับนี้</p>\n<p>กูเกิลยื่นข้อมูลเหล่านี้ต่อศาลเพื่อต่อสู้คดีว่า ไม่ได้มีพฤติกรรมผูกขาด ห้ามแอปเปิลใช้งานเสิร์ชเอนจินคู่แข่งอย่าง Bing แต่อย่างใด แต่แอปเปิลไม่เลือก Bing เพราะไม่มีความสามารถในการแข่งขันมากพอต่างหาก แอปเปิลเลือกกูเกิลเพราะทำบริการที่มีคุณภาพดีชนะผู้เล่นอื่นๆ ในตลาด</p>\n<p>ที่มา - <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.dcd.223205/gov.uscourts.dcd.223205.835.0.pdf\">เอกสารฉบับเต็ม (PDF)</a>, <a href=\"https://www.cnbc.com/2024/02/24/google-says-microsoft-offered-to-sell-bing-to-apple-in-2018.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bing\">Bing</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/search-engine\">Search Engine</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div><div><a href=\"/topics/doj\">DoJ</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"70fbfc6b9a0d6f3eeb3d606eafa28379b61d77f82c1932f891344e357322952b","category":"Thai"}