{"title":"Managerial (dis)preferences towards employees working from home: Post-pandemic experimental evidence","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303307","date":1715781600000,"content":"<p>by Agnieszka Kasperska, Anna Matysiak, Ewa Cukrowska-Torzewska</p>\r\n\r\nWork from home (WFH) has been a part of the professional landscape for over two decades, yet it was the COVID-19 pandemic that has substantially increased its prevalence. The impact of WFH on careers is rather ambiguous, and a question remains open about how this effect is manifested in the current times considering the recent extensive and widespread use of WFH during the pandemic. To answer these questions, this article investigates whether managerial preferences for promotion, salary increase and training allowance depend on employee engagement in WFH. We take into account the employee’s gender, parental status as well as the frequency of WFH. Furthermore, we examine whether managers’ experience with WFH and its prevalence in the team moderate the effect of WFH on careers. An online survey experiment was run on a sample of over 1,000 managers from the United Kingdom. The experiment was conducted between July and December 2022. The findings indicate that employees who WFH are less likely to be considered for promotion, salary increase and training than on-site workers. The pay and promotion penalties for WFH are particularly true for men (both fathers and non-fathers) and childless women, but not mothers. We also find that employees operating in teams with a higher prevalence of WFH do not experience negative career effects when working from home. Additionally, the more WFH experience the manager has, the lesser the career penalty for engaging in this mode of working. Our study not only provides evidence on WFH and career outcomes in the post-pandemic context but also furthers previous understanding of how WFH impacts careers by showing its effect across different groups of employees, highlighting the importance of familiarisation and social acceptance of flexible working arrangements in their impact on career outcomes.","author":"Agnieszka Kasperska","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"70fd35a74d95e71154d05b8c6317e02d6a164cfb80f83f2d70f8ac5d8e6c8399","category":"Interdisciplinary"}