{"title":"Landslide Thickness Estimated from InSAR-derived 2D Deformation: Application to the Xiongba ancient Landslide, China","link":"https://www.preprints.org/manuscript/202410.0747/v1","date":1728548559000,"content":"The thickness estimation is crucial for evaluating landslide evaluating. The traditional non-contact mass conservation method adopts three-dimensional deformation to estimate landslide thickness, which may be unsuitable due to the limitations of observations. In this study, a more feasible approach for estimating landslide thickness based on 2D deformation derived from two-track Interferometric Synthetic Aperture Radar (InSAR) observations is proposed, specifically applied to the Xiongba landslide. The comparison between the estimated thickness from the InSAR-derived 2D deformation and the measured thickness by geological and drilling methods validates the reliability of the proposed method. The mapped InSAR LOS deformation rate fields reveal two distinct deformation regions, including a frontal zone exhibiting significant deformation and a relatively stable zone. The analysis of the 2D deformation indicates that surface uplift at the front edge of the Xiongba-H2 landslide may result from the pushing of the rock-soil mass in areas of high deformation. The inversion result suggests that the thickness of the Xiongba-H2 landslide is ranging from 10 to 100 m, corresponding to the active volume of 6.17×107 m3. A thicker region is identified, at the front edge along the Jinsha River, posing the potential of further failure. It is believed that the proposed low-cost, easily implementable approach could enhances the applicability of InSAR technology for landslide motion analysis and hazard assessment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"70fd52d391c2a4194ffedddebc3d299592388fc892bfe391e3fd022a2073a7f0","category":"Interdisciplinary"}