{"title":"Effects of Salinity on the Egg Fertilization, Hatching, and Tadpole Growth and Survival Rates of the Thailand Frog (Rana tigerina Dubois, 1981)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6750783?af=R","date":1708761600000,"content":"<p>We studied the effects of salinity on the egg fertilization, hatching, and tadpole growth and survival rates of the Thailand frog (<i>Rana tigerina</i> Dubois, 1981), an introduced species that is commonly cultured in the Mekong Delta, Vietnam. Salinity levels of 2, 6, and 4% significantly affected the fertilization and hatching rates of the eggs, as well as the tadpole survival rates from the newly hatched to yolk sac exhaustion stages, respectively (<i>p</i> &lt; 0.05). Notably, during the stage from yolk sac exhaustion to juvenile tadpole, a salinity of 3% resulted in an increase in the final weight of the tadpoles throughout the stage and a significant increase in Phase 1 (the tadpole stage from yolk sac exhaustion to the onset of foreleg emergence) and Phase 2 (the tadpole stage from the onset of foreleg emergence to the onset of hind leg emergence); however, it did not show a significant effect on tadpole survival rates in Phases 1 and 2 of this stage (<i>p</i> &gt; 0.05). A salinity level of up to 5% showed no significant effect on the growth performance but caused a significant reduction in the survival rates of the tadpoles during this stage. We recommend that the artificial reproduction process of Thai frogs should be performed using salinities of &lt;2%, with salinities of ≤2 and 3% being suitable for rearing tadpoles from the newly hatched to yolk sac exhaustion stage and from the yolk sac exhaustion to juvenile stage, respectively.</p>","author":"Huynh Kim Huong, \nCheng-Ting Huang, \nHo Khanh Nam, \nNguyen Thi My Nhan, \nDoan Xuan Diep, \nHorst Kaiser","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"71022d00528636d985e42f223cd8c098a3d8ed4e0a93184c9b778e8660ed9fe8","category":"Environment"}