{"title":"Best MTB elbow pads 2021 | Top-rated elbow pads for mountain biking","link":"https://www.bikeradar.com/advice/buyers-guides/best-elbow-pads/","date":1622115082000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/09/Elbow-pads-best-list-07-522b976.jpg?quality=90&amp;resize=620,413\" />                                            <p>Elbow pads might not be the most common form of protection for mountain biking, with <a href=\"https://www.bikeradar.com/features/6-of-the-best-knee-pads/\">knee pads</a> probably being the most popular after <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-helmets-for-trail-riding/\">helmets</a>, but a set of pads on your arms can provide an additional line of defence when things don’t go to plan.</p>\n<p>As well as offering protection, consideration is also made for breathability as well as style, materials, fastenings and fit.</p>\n<p>Read our guide on what to look for when buying a set of pads and check out our selection of the best elbow pads as tested by the BikeRadar team.</p>\n<h2>Buyer’s guide to MTB elbow pads | What to look for</h2>\n<h3>Protection</h3>\n<p>Elbow pads can be divided into two camps when it comes to protection.</p>\n<p>The first option is a hardshell elbow guard that features tough plastic panels. This style is preferable for gravity-orientated riding, including downhill and park riding, because it provides protection against serious impacts.</p>\n<p>The second option is a lightweight pad, which is what we have focused on in this guide. These often use reactive materials such as D30 and Sas-Tec, which harden on impact to provide a good degree of protection but should also be flexible, lightweight and breathable.</p>\n<p>Lightweight pads mostly provide protection from low impacts and abrasion but some can be used for more technical riding. They are best suited to trail riding where there is a smaller chance of coming off and you don’t want to feel encumbered by hefty pads.</p>\n<h3>Fastening</h3>\n<p>Bulkier and more protective pads tend to fasten with Velcro straps. Some riders prefer Velcro closures because they allow precise adjustments and provide an undeniably secure fit.</p>\n<p>Many lightweight pads rely on elasticated fabrics and a snug, compressive fit to stay in place.</p>\n<p>Internal grippers are often used to help lightweight pads stay in place. As long as the fit is correct, these will go virtually unnoticed when you’ve got them on and can easily be worn all day.</p>\n<h3>Fit</h3>\n<p>Much of what makes wearing elbow pads a pleasant experience boils down to the fit. If they’re too tight they can quickly become uncomfortable, cutting off blood flow and causing irritation. Too loose and they’ll move around and slip down your arm, becoming a nuisance and useless in a crash.</p>\n<p>Fastening is important here, but most pads will also have an articulated fit to match the shape of your arms and come in a range of sizes to suit different riders.</p>\n<h3>Breathability</h3>\n<p>As elbow pads hug the body closely and cover a lot of skin, they can feel hot – particularly if you are riding hard.</p>\n<p>Many pads use mesh fabrics and cut-out sections on the inner arm to improve breathability. Perforated pads are also common to further aid cooling.</p>\n<p>This is worth paying particular attention to if you’re buying elbow pads for riding in warm conditions.</p>\n<section><div>\n        <h2>The best elbow pads for cycling, as rated by our expert testers</h2>\n<ul><li>Troy Lee Designs Speed D3O</li>\n<li>100% Ridecamp</li>\n<li>100% Teratec</li>\n<li>7iDP Sam Hill Lite</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Troy Lee Designs Speed D3O</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> With such a svelte profile, they’re barely noticeable under a jersey</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Feeling more like a second skin than a pad, you can ride in the Troy Lee Designs Speed D30 elbow pads all day. With such a svelte profile, they’re barely noticeable under a jersey.</p>\n<p>Protection is provided by a layer of D3O viscoelastic foam, which hardens upon impact to help ward off gravel rash and absorb lighter blows.</p>\n<p>Because they’re so comfy, we’ve found ourselves wearing these pads more often, making them more likely to save our elbows than a bulkier, more protective set. The full-length sleeve has just the right stretch, so they stay up without feeling too tight.</p>\n<p>At just 4mm thick, the D30 padding won’t prevent serious injury so these are best suited to trail riding.</p>\n<ul><li>£50 / $49 / €60 as tested</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>100% Ridecamp</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The slim profile means they’ll fit under most jersey sleeves.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>The 100% Ridecamp elbow pads are a simple slip-on design that provide some extra protection for trail riding.</p>\n<p>The pads are seriously comfy. The lower section of the pad sits across the forearm but the fabric has enough stretch in it to avoid any issues with discomfort or arm pumping.</p>\n<p>Padding is slim, so isn’t suitable for gravity riding, but it stays put when going downhill and will fit under a jersey.</p>\n<p>The pads can get sweaty but the mesh panel on the inside makes them less hot than others.</p>\n<ul><li>£44 as tested</li>\n<li><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/elbow-pads/100-ridecamp-elbow-pads-review/\">Read the fill 100% Ridecamp review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>100% Teratec</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> There’s good coverage around the elbow and the D3O-style armour is very pliable.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>The 100% Teratec pads have some great features. The pre-curved elbow cup is housed in a long elasticated sleeve, making the fit really snug and secure.</p>\n<p>There’s good coverage around the elbow and the D3O-style armour is very pliable, so the pad doesn’t bulge out when your arm is bent. A panel of abrasion-resistant nylon over the top of the cup increases durability.</p>\n<p>The sleeve extends a good way up, leaving movement uninhibited, but the wrist cuff is crazy-tight and we found that on prolonged downhills this contributed noticeably to arm pump.</p>\n<p>They’re a bit sweaty on the way back up because the sleeve isn’t very breathable.</p>\n<ul><li>£53 / $59 / AU$105 as tested</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>7iDP Sam Hill Lite</h2>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The 6mm-thick elbow cup balances slimness with protection.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/reviews/clothing/armour-and-pads/knee-pads/7idp-sam-hill-knee-pads-review/\">7iDP’s Sam Hill knee pads</a> are some of our favourite leg protectors, so we were expecting equally good things here.</p>\n<p>These elbow pads are a similar style, with a stretchy compression sleeve and silicone gripper at the top and bottom, which hold them in place well.</p>\n<p>They don’t cover as large an area as the other pads in this guide and size up small. The upper cuff sits on the bicep, so can feel tight when your arm is flexed. In the cold, they take a while to mould to your arms.</p>\n<p>The 6mm-thick elbow cup balances slimness with protection, and it’s made from an articulated and very mouldable rubber, so the fit is great.</p>\n<ul><li>£60 / $65 / AU$125 as tested</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Also consider…</h2>\n<p>These elbow pads scored less than the four out of five stars needed to make our best list, but are still worth considering.</p>\n<h3>Fox Enduro Sleeve</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> With a slim profile, they fit subtly under a jersey or easily in your pack.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>While the thin integrated pad isn’t pre-shaped, it’s flexible, moulds to the shape of your arm well and offers decent protection for trail riding (you can upgrade to a D3O insert that hardens on impact for £25 more).</p>\n<p>The tight neoprene sleeve and gripper strip mean the pads stay put. With a slim profile, they fit subtly under a jersey or easily in your pack, but we found that the cuffs pinched and the tight fit started to fatigue our arms on longer rides.</p>\n<p>Despite the perforations and mesh on the inner arm, they tend to get sweaty (although this does help them to stick in place).</p>\n<ul><li>£50 / $55 / AU$100 / €50 as tested</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Leatt AirFlex</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The fit is spot on around the upper arm and forearm.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Leatt’s 3D-moulded impact gel makes these slim pads soft, malleable and comfy. With silicone grippers on both the elasticated sleeve and the inside of the elbow cup, they hardly budged even on really rough trails.</p>\n<p>Mesh fabric on the inner arm and a cutout at the elbow make them distinctly cooler than the likes of the Fox and 100% pads.</p>\n<p>The fit is spot on around the upper arm and forearm but if the sleeve were tighter around the elbow itself, it would boost pad security even further.</p>\n<p>They’re pretty pricey, especially for a design without D3O-style technology.</p>\n<ul><li>£70 / $70 as tested</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Mountain Biking UK","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"7105907b971e38586e7e82b09c966a13b489262eb02c24ebc1ca5d961ca8ea84","category":"Cycling"}