{"title":"Keeping the peace, but for how long?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-stage-17-jumbo-visma-tactics","date":1694628030000,"content":"\n      The final kilometres of the Alto de l'Angliru might just have been the most bizarre passage of racing in what has been a head-scratching, confusing situation for the Jumbo-Visma team. Once again, they exercised their utter dominance in this year's <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, with Sepp Kuss, Jonas Vingegaard and Primož Roglič all riding away from the rest of the race. But it also appeared to descend into chaos as they raced against, rather than with, each other. Two kilometres from the finish, Kuss lost the wheel of the other two as Roglič set a fierce tempo and was dropped.. It was not an explicit attack from the Slovenian in the way that <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/unforeseen-drama-jonas-vingegaard-stakes-major-claim-for-vuelta-leadership-after-devastating-attack\">Vingegaard’s was yesterday in Bejes</a>, but it did not need to be on such steep gradients as found on the mighty Angliru. <br />\n<div></div>\n<p><br />Then in an unexpected twist, Kuss found himself clawing precious time back after Mikel Landa (Bahrain-Victorious) bridged up to him and helped pace him to the finish. Kuss appeared to be on the brink of losing the red jersey, losing 20 of his 29 second advantage on GC over Vingegaard with a kilometre still to climb. However, Landa’s help was enough to limit his losses to 19 seconds at the top, saving the jersey by a slender eight seconds. Anyone watching the race without any context would have assumed Roglič and Vingegaard were riding for one team and Landa and Kuss for another — especially as Kuss’ leader's jersey matched the red of Landa’s Bahrain-Victorious. <br /><br />All this does not look good PR-wise for Jumbo-Visma. Kuss is admired by fans around the world for the selfless work he has done as a super-domestique for Jumbo-Visma for so many years, and for appearing to be such a modest, all-round good guy. The sight of the very teammates he has sacrificed so much for to deliver Grand Tours ostensibly ganging up on Kuss and dropping him while in the race lead, on his birthday no less, can’t help but look bad.</p>\n<p><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230913VUE02031-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1694627205\" /><br />But for all the bad optics, Jumbo-Visma’s approach can be made sense of, and is grounded in logic — cold, hard, unsentimental logic, but logic nonetheless. As reiterated at the finish today, the team has decided that the plan was still to let the road decide which of their three riders would win the Vuelta, allowing the strongest of the three to take glory rather than have the other two compromise their own ambitions to help Kuss. And on the Angliru today, Kuss was the weakest of the three, unable to keep up with the pace set by Roglič while Vingegaard remained on his wheel. The fact Landa was able to catch up to Kuss also justified the approach, as it proved that the Spaniard would have caught up to all of the Jumbo-Visma trio had they slowed down in order to accommodate Kuss, threatening the team’s chances of taking the stage win (which, incidentally, was their second in two days, and fifth in the race). <br /><br />Sure, it is harsh, and it is impossible not to feel bad for Kuss, who is not receiving the same degree of selflessness he has given his teammates over the years. But from the team’s point of view, they want to keep everybody happy, and Roglič and Vingegaard would evidently not have been happy to have had their wings clipped. Another stage win might not seem like much in the grand scheme of things, but sharing them between the three does go some way to keep each feeling as though they are being compensated for. <br /><br />Where the internal team politics really got complicated was in determining which of Vingegaard and Roglič would be allowed to take the stage win at the top of the Angliru. The fact that Vingegaard had won his second stage of the race yesterday, while Roglič still had only one to his name, implied that it was the Slovenian’s turn to do so. But, complicating matters was the question of the bonus seconds available at the line. Vingegaard is now within striking distance of Kuss on GC, and the extra four seconds he would have gained would have brought him twice as close to the red jersey. Therefore, had Vingegaard been permitted to win the stage instead of Roglič, it would have been clear that the management was explicitly backing him over Kuss. But instead, it was Roglič who went over the line uncontested to win the stage, giving Kuss a lifeline and an eight-second buffer.<img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230913VUE02030-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1694627221\" />Jumbo-Visma is playing a basically impossible balancing act to satisfy all three riders’ desires, and tension seems to be mounting. When Kuss was dropped on the climb, he was seen saying something into his radio, but neither of his two teammates looked back at him as he was distanced, almost as if not wanting to confront their guilt at what they were doing. At the finish, the television broadcast Kuss going to Roglič and saying enigmatically how he had a \"weird feeling\" on the climb and how \"If I drop, I drop\". Roglič appeared uncomfortable, not wanting to talk in front of all the cameras, and Kuss was not quite his usual affable self. And all of their post-stage interviews were cagey, Kuss saying that he is \"happy to work for\" his teammates, but only \"when called for\", and that he still 'wants his shot' at glory; Roglič seeming to contradict himself about wanting Kuss to keep the red but also wanting to gain time himself, and Vingegaard reluctant to talk about the situation. </p>\n<p><br />However much Jumbo-Visma tries to keep everyone happy behind the scenes, with four days of racing still to come and plenty of selective climbs and challenging parcours, this could get very messy.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"71060f2320f815fc01725d036fa05c7328579c671cd01aa1099676187a90ab19","category":"Cycling"}