{"title":"Earth at risk: An urgent call to end the age of destruction and forge a just and sustainable future","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae106/7638480?rss=1","date":1712016000000,"content":"<span><div>Abstract</div>Human development has ushered in an era of converging crises: climate change, ecological destruction, disease, pollution, and socioeconomic inequality. This review synthesizes the breadth of these interwoven emergencies and underscores the urgent need for comprehensive, integrated action. Propelled by imperialism, extractive capitalism, and a surging population, we are speeding past Earth's material limits, destroying critical ecosystems, and triggering irreversible changes in biophysical systems that underpin the Holocene climatic stability which fostered human civilization. The consequences of these actions are disproportionately borne by vulnerable populations, further entrenching global inequities. Marine and terrestrial biomes face critical tipping points, while escalating challenges to food and water access foreshadow a bleak outlook for global security. Against this backdrop of Earth at risk, we call for a global response centered on urgent decarbonization, fostering reciprocity with nature, and implementing regenerative practices in natural resource management. We call for the elimination of detrimental subsidies, promotion of equitable human development, and transformative financial support for lower income nations. A critical paradigm shift must occur that replaces exploitative, wealth-oriented capitalism with an economic model that prioritizes sustainability, resilience, and justice. We advocate a global cultural shift that elevates kinship with nature and communal well-being, underpinned by the recognition of Earth’s finite resources and the interconnectedness of its inhabitants. The imperative is clear: to navigate away from this precipice, we must collectively harness political will, economic resources, and societal values to steer toward a future where human progress does not come at the cost of ecological integrity and social equity.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"710ca9239ce786fae86c93ce05b7699518e303708d4fa8be10cea01964b57255","category":"Interdisciplinary"}