{"title":"Is Workforce Agility a Good Coping Strategy to Deal with the COVID-19 Crisis: A Theoretical Perspective","link":"https://www.preprints.org/manuscript/202405.0294/v1","date":1714985237000,"content":"Aim: This study aimed to understand the role of workforce agility as a coping strategy to curtail the COVID-19 pandemic. Method: The study reviewed and integrated two lines of literature to develop a theoretical framework to help business organizations to respond, adapt, and recover from the COVID-19 pandemic crisis.  Results: The results showed that there are several commonalities between the workforce agility literature and the crisis management literature, mostly manifested in the speed of responding to uncertain and unpredictable, adverse events in the business environment. A thorough review of key themes in both kinds of literature led to developing a theoretical framework that links crisis drivers, crisis enablers, crisis capabilities, and response strategy. Workforce agility can be used as a coping strategy to deal with the COVID-19 pandemic crisis. Both kinds of literature evolve to respond to any crisis; the crisis management literature focuses on Meso-level (organizational level) or collective actions to mitigate the crisis, while the workforce agility literature focuses on the Micro-level (individual level). However, the successful response to any crisis requires the synergy of both actions.  Future Studies: The results of this research are of prime importance for both researchers and practitioners. Researchers can use the theoretical framework as a baseline for building empirical research design. The current study also sets the context for future researchers who are interested in workforce agility to test the validity of agile work behaviors in real adverse context. It also opens a new stream of debate by deconstructing understudied links between workforce agility, resilience, and crisis management. Mangerial implication: For practitioners to ensure a successful response to any impending crisis, they must develop their employees’ agile behaviors. Practitioners can also redesign their recruitment strategy to select the right individuals with the right agile attributes, abilities, and behaviors to easily alter their behaviors according to the progressing crisis phases. Finally, practitioners can design continual learning interventions to include required agile skills and competencies to prepare their employees for future crises.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"710d78ecbb7f1ae82651cc256c5c14afc595c4214bb294b34fe8e9bcb754b6ef","category":"Interdisciplinary"}