{"title":"Shkreli’s infamous price-gouging scheme finally shut down in $40M settlement","link":"https://arstechnica.com/?p=1819411","date":1639093197000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/02/Screen-Shot-2016-02-04-at-6.11.06-PM-640x311.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/02/Screen-Shot-2016-02-04-at-6.11.06-PM.png\">Enlarge</a> <span>/</span> Martin Shkreli, former CEO of Turing, smirked his way through a Congressional hearing. (credit: <a href=\"http://www.c-span.org/video/?404183-1/hearing-prescription-drug-market\">CSPAN</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A pharmaceutical company once owned by Martin Shkreli will pay up to $40 million in a settlement that will also finally end his infamous price-gouging scheme involving the antiparasitic drug Daraprim.</p>\n<p>The Federal Trade Commission and its state co-plaintiffs—New York, California, Illinois, North Carolina, Ohio, Pennsylvania, and Virginia—filed a settlement order this week that will require Vyera Pharmaceuticals (formerly Turing) and its parent company Phoenixus to make Daraprim available to any generic competitor for the cost of making the drug. The companies are also barred from engaging in any scheme resembling the one surrounding Daraprim for 10 years.</p>\n<p>The FTC and states alleged that, in 2015, Shkreli and former Vyera CEO Kevin Mulleady abruptly jacked up the price of Daraprim by more than 4,000 percent—raising the list price from $17.50 to $750 per tablet—after they bought the rights to the drug and created a \"web of anticompetitive restrictions to box out the competition.\"</p></div><p><a href=\"https://arstechnica.com/?p=1819411#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1819411&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7111c7504e20b73c48ace289da76125e267dca7c8a0b1217325e7624424edfa2","category":"Tech"}