{"title":"Improving communication and promoting social inclusion for hearing-impaired users: Usability evaluation and design recommendations for assistive mobile applications","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305726","date":1721224800000,"content":"<p>by Hyeonsu Kim, Heetae Hwang, Sojung Gwak, Jihyeon Yoon, Kyudong Park</p>\r\n\r\nThis study examines the usability of communication-assistive applications for hearing-impaired users, with a focus on enhancing user experience and promoting social inclusion. Although such applications have been developed and evaluated previously, interface designs that consider the intimacy needs of hearing-impaired users remain under-explored. We performed a comprehensive usability evaluation employing a mixed-method approach, which involved hearing-impaired individuals as well as field experts. The findings revealed areas for improvement in the design, validated the feasibility of implementing these applications, and emphasized the importance of incorporating the unique needs and preferences of hearing-impaired users. Furthermore, this paper discusses the importance of introducing guidelines and evaluation scales for the “Design for Emotion and Life Knowledge” levels to facilitate smooth and effective human–computer interactions. Such measures will promote the development of intelligent assistive technologies that reflect the qualitative needs of people with disabilities and contribute to social rights for hearing-impaired users. With the growing demands of artificial-intelligence-powered assistive technologies, the inclusion of individuals with disabilities in the design and research process is anticipated to increase. In future, studies should be conducted to blend the culturally shared experiences and emotional bonds expressed by users (having mild-to-severe hearing impairment) with the design and development process of assistive devices or services.","author":"Hyeonsu Kim","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7112aa75c0b71919b7e4b802b0281accad5ddf84e2636a0d5620a88d29deb5c8","category":"Interdisciplinary"}