{"title":"Upper and Lower Bounds to Pull-Out Loading of Inclined Hooked End Steel Fibres Embedded in Concrete","link":"https://www.preprints.org/manuscript/202406.0617/v1","date":1718086622000,"content":"Steel fibre reinforced concrete (SFRC) consists of short hooked steel fibres randomly distributed and oriented within the cementitious matrix. The contribution of fibre in bridging cracks to provide the stress transfer required relies upon the orientation of the fibre in the concrete. Bridging fibre aligned with a crack are less effective than those inclined to it. Therefore, understanding the pull-out behaviour of misaligned fibre is a key factor to quantify and optimize the design of SFRC in the structural applications. In the laboratory a single oriented fibre embedded in a solid cylinder of concrete is subjected to a pull-out test where the axis of a tensile force is aligned with the axis of the cylinder. Based upon the observed behaviour this paper presents a new analytical bounding approach to capture the pull-out response of misaligned hooked-end steel fibre embedded in a concrete matrix. The analysis is based upon a transversely isotropic condition assumed for the plasticity that occurs in the cold drawn fibre. The model accounts for the influence of fibre diameter and the combined strengths of the steel and concrete. The model predictions have also been compared with other experimental results published in the literature. The results showed that the model can predict pull-out loads reasonably for different fibre orientations between bounds of failure derived from the strengths of the two constituents. A critical orientation is observed at maximum strength. Therein, an understanding of the pull-out behaviour of misaligned, hooked-end fibres is necessary to optimize the strength of concrete from this method of reinforcement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7112b99ae80c55f4cddcc20ca595270c6de152f45e53807cac38c0064f22475d","category":"Interdisciplinary"}