{"title":"Hands-on with the new SRAM Force AXS groupset – real weights vs Shimano Ultegra","link":"https://www.bikeradar.com/features/sram-force-axs-weight/","date":1678474316000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/SRAM-Force-Weighed-Site1-copy-dc29583.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"SRAM Force Weighed Site1 copy\" title=\"SRAM Force Weighed Site1 copy\" />                                            <p>Like the original, the new 2023 SRAM Force AXS is a 12-speed wireless road bike groupset.</p>\n<p>In fact, changes from the previous-generation groupset have been small, and mostly to the shifters, the 2x crankset and the front derailleur. The good news is the price hasn’t changed.</p>\n<p>SRAM has sent us a complete groupset to test, but before riding off into the sunset using it, we’ve weighed all the individual parts. If, however, you do want to know what it’s like to ride off into the sunset with the groupset in Portugal, read our <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-force-axs-review/\">SRAM Force AXS first ride review</a>.</p>\n<p>SRAM Force AXS is pitched against <a href=\"https://www.bikeradar.com/news/shimano-ultegra-r8100-first-look/\">Shimano Ultegra 12-speed.</a> We’ve previously weighed Ultegra component-by-component, so we’ve compared the weights of the two groupsets here.</p>\n\n<section><div>\n        \n<h2>SRAM Force AXS: seven things to know</h2>\n<p>Here’s a run-down of key features of the new SRAM Force AXS groupset. There’s more detail on all the components and their variants in our <a href=\"https://www.bikeradar.com/news/new-sram-force-etap-axs/\">SRAM Force AXS groupset</a> launch story.</p>\n<ol><li>Rather than use separate chainrings, the standard-width Force AXS 2x crankset now has a single-piece, direct-mount chainring, like those seen in SRAM Red AXS. 1x cranksets are also direct mount, but the Wide double has separate chainrings</li>\n<li>As with the previous generation, SRAM’s cassettes start at 10 teeth, so cranksets are smaller than those used by Shimano, which uses cassettes starting at 11 teeth. The cranksets are available in 50/37t, 48/35t and 46/33t sizes</li>\n<li>SRAM majors on different configurations, so as well as the standard-spaced double crankset, there’s a single-ring option and Wide cranksets with smaller chainrings in double and single configurations</li>\n<li>There are power meter options for all cranksets. The standard double is dual-sided, others read left-crank power only. You can upgrade a non-instrumented crankset to a power meter</li>\n<li>The front derailleur has been redesigned with the aim of improving shift quality</li>\n<li>The standard rear derailleur handles cassettes up to 36 teeth, but there’s also a single-ring only XPLR derailleur that will accept a 42t cassette. As with all of SRAM’s groupsets, you can also set up a mullet build</li>\n<li>The shifters are smaller than the previous-generation groupset and the shift levers have been redesigned. They lose the option to connect wired Blips satellite shifters, although you can still use them with wireless Blips</li>\n</ol><p>\n\n    </p></div>\n    </section><h2>SRAM Force AXS groupset component weights</h2>\n<h3>SRAM Force AXS shifters (pair) weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The shifters have been slimmed down for the second generation of Force AXS.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>The old Force AXS shifters were chunky, but SRAM has slimmed down the current version with the aim of making them easier to use for a wider range of hand sizes. They’re a similar size and shape to <a href=\"https://www.bikeradar.com/news/sram-rival-axs/\">Rival AXS</a> shifters and have comparable functionality, losing bite point adjustment and wired Blips compatibility.</p>\n<p>The brake lever is carbon rather than the Rival groupset’s alloy brake lever and the shift lever is smaller, which SRAM says reduces the risk of pinched fingers when braking. The Ultegra 12-speed wireless shifters come in quite a bit lighter than Force AXS.</p>\n<ul><li><b>Actual weight:</b> 468g (pair)</li>\n<li><b>Ultegra weight:</b> 385g (pair)</li>\n</ul><h3>SRAM Force AXS rear derailleur weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The rear derailleur is essentially identical.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>The SRAM Force AXS rear derailleur’s tech hasn’t changed from the previous generation. There’s a button used to trim the mech and put it into configuration mode to enable you to change shift parameters via the AXS smartphone app.</p>\n<p>You also get the same Orbit fluid damper to help improve shift quality and reduce drivetrain noise. Only the graphics and finish have changed to the new sparkly metallic look.</p>\n<p>Ultegra has a single central battery powering both front and rear shifters, so it saves quite a bit of weight here. We weighed the same battery at 53g when we checked the weights of the <a href=\"https://www.bikeradar.com/features/shimano-105-di2-weight/\">Shimano 105 Di2 groupset</a>.</p>\n<ul><li><b>Actual weight:</b> 328g (including battery)</li>\n<li><b>Ultegra weight: </b>261g</li>\n</ul><h3>SRAM Force AXS front derailleur weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The front derailleur has been redesigned.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>SRAM has redesigned the front derailleur cage to improve shift quality. It retains the yaw geometry of SRAM’s other derailleurs. SRAM claims this results in less chain clatter when you’re cross-chaining, which was an annoying feature of the previous-generation groupset.</p>\n<p>Again, Ultegra comes in lighter but doesn’t have an attached battery.</p>\n<ul><li><b>Actual weight: </b>182g (including battery)</li>\n<li><b>Ultegra weight: </b>111g</li>\n</ul><h3>SRAM Force AXS crankset weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The crankset now uses integrated chainrings.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>A standard double crankset now uses a one-piece ‘integrated’ chainring, which mounts directly to the crank arms. SRAM says this change increases the unit’s stiffness. It’s available with either a dual-sided power meter or un-instrumented, with SRAM claiming the power meter adds just 40g to the crankset weight.</p>\n<p>We have the 48/35t option with a power meter, but you can also buy a double crankset in 40/33t. There’s a new 50/37t, which was previously only available for Red AXS. There are also 1x chainsets with direct-mount chainrings and Wide options.</p>\n<p>The Force AXS chainset with a power meter weighs within one gram of the Ultegra chainset without a power meter.</p>\n<ul><li><b>Actual weight:</b> 748g (with power meter)</li>\n<li><b>Ultegra weight: </b>749g (52/36t, 172.5mm cranks, no power meter)</li>\n</ul><h3>SRAM Force AXS crankset cassette (10-33t) weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The cassettes remain unchanged.</span></figcaption><span></span></div>\n<p>Cassettes haven’t changed. Those for use with double chainsets run up from 10-28t, via 10-30t and 10-33t to a 10-36t, so there are plenty of gear range options. You can fit a 10-36t or 10-42t cassette with a single chainring and a Force AXS XPLR rear derailleur. All require an XDR freehub.</p>\n<p>SRAM’s cassette is significantly lighter than the Ultegra design and uses SRAM’s Minicluster design, where the four smallest sprockets are machined from a single block of steel.</p>\n<ul><li><b>Actual weight:</b> 273g (10-33t)</li>\n<li><b>Ultegra weight: </b>340g (11-34t)</li>\n</ul><h3>SRAM Force AXS crankset brake calipers weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The calipers were updated in 2020.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>SRAM moved to a two-piece design in 2020, to make for easier manufacturing, more accurate piston bore drilling and less brake rub on prolonged braking. These haven’t changed for the new groupset.</p>\n<ul><li><b>Actual weight:</b> 286g (130g front with hose &amp; brake fluid, 156g rear with hose &amp; brake fluid)</li>\n<li><b>Ultegra weight: </b>240g (pair)</li>\n</ul><h3>Brake rotors</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> We weighed the 160mm rotors.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>SRAM uses the same Paceline brake rotors as with its previous-generation Force AXS and other groupsets. They’re available in 140mm or 160mm diameter, with SRAM recommending the 160mm size we have here.</p>\n<ul><li><b>Actual weight:</b> 320g (pair)</li>\n<li><b>Ultegra weight: </b>216g (pair)</li>\n</ul><h3>SRAM Force AXS crankset chain weight</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The chain is around the same weight as Ultegra.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>As with the cassette, SRAM uses the same chain as on its previous-generation Force AXS groupset. The flattop design is unique to SRAM road groupsets.</p>\n<p>Unlike the Red-level chain, the Force chain has solid pins, which might add a little to the weight. Still, at 242g it’s pretty light and almost the same weight as the Ultegra groupset’s Shimano XT chain.</p>\n<ul><li><b>Actual weight:</b> 242g</li>\n<li><b>Ultegra weight: </b>240g</li>\n</ul><h3>SRAM DUB bottom bracket</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You can get a DUB bottom bracket to fit just about any frameset.</span></figcaption><span> <i>Liam Cahill / Our Media</i></span></div>\n<p>SRAM has options for its DUB bottom bracket with the majority of different <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket standards</a>. We’ve got the threaded external bottom bracket from a Specialized Aethos, but we don’t have a comparable weight for Shimano Ultegra.</p>\n<ul><li><b>Actual weight:</b> 76g</li>\n</ul><h3>SRAM Force AXS groupset total weight</h3>\n<p>Totting all that up, we reckon the new SRAM Force AXS groupset weighs 2,922g in the configuration we have. Ultegra 12-speed undercuts that at 2,577g without a bottom bracket or brake hoses.</p>\n<p>The Force AXS groupset’s weight sits mid-way between SRAM Red AXS at just over 2,500g and Rival AXS at around 3,500g, both with double chainrings. That’s highly dependent on configuration though.</p>\n<p>We’ve also weighed the individual components of <a href=\"https://www.bikeradar.com/features/shimano-105-di2-weight/\">Shimano 105 Di2</a> and calculated a total weight of 2,950g. Interestingly, the SRP for the new SRAM Force AXS groupset, as well as the weight, is closer to that for 105 Di2 than Ultegra.</p>\n<ul><li><b>SRAM Force AXS total weight:</b> 2,922g</li>\n<li><b>Ultegra total weight: </b>2,577g</li>\n</ul><p>For more detail on the new SRAM Force AXS groupset, check out our first ride review video. Next up is to fit the Force AXS groupset to a bike and head out onto the less exotic and warm roads of the UK rather than Portugal to test it a lot more thoroughly, so watch out for a full review.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"711bf4c5d15be0f692f7a4420e3198d70592894e4433a1887961eb","category":"Cycling"}