{"title":"Transcriptomic Profiling Reveals Altered Expression of Genes Involved in Metabolic and Immune Processes in NDV-Infected Chicken Embryos","link":"https://www.preprints.org/manuscript/202409.1123/v1","date":1726378336000,"content":"The objective of this study was to investigate the transcriptomic profiling of differentially ex-pressed genes between a commercial layer breed and an indigenous Indian breed. RNA was ex-tracted from NDV-infected and uninfected embryo lung tissue samples of Aseel, Kadaknath, and White Leghorn chickens. RNA-Seq was performed, and reads were aligned to the chicken refer-ence genome (Galgal7). A total of 594 genes were significantly differentially expressed, with 264 upregulated and 330 downregulated in infected embryos. Highly overexpressed genes in infect-ed conditions included C8A, FGG, PIT54, FETUB, APOC3, FGA, SPIA1, AvBD13, APOH, AMBP, TTR, PLA2G12B. Additionally, 29 novel transcripts and 20 lncRNAs were upregulated. White Leghorn embryos showed distinct expression patterns for CAV1 and GATA3, while Kadaknath healthy embryos had higher levels of CYTB, HBBA, ND4, ND4L, and ND5, indicating breed uniqueness. The analysis revealed significant gene involvement through Gene Ontology and KEGG pathways, highlighting alterations in gene expression related to immune function, me-tabolism, cell cycle, nucleic acid processes, and mitochondrial activity due to NDV infection. ALDOB, PRPS2, XDH, DCK2, and TK1 genes, which were involved in several metabolic path-ways, clearly displayed an altered expression pattern in the infected embryo. Additionally, ALB, TLR4, TLR2, TLR21, IL1R2, IL22RA2, HSP90AA, HSPB9(p60), and HSPB8 were significantly up-regulated in infected lung samples, while CXCR4, CXCL14, GATA3, IL17REL, and IL22RA1 were downregulated. Notably, higher expression of HSPs in Kadaknath suggests heat tolerance. This research provides insights into the genetic differences between commercial and local breeds and reveals the impact of NDV infection on metabolic processes, potentially identifying candidate genes for breed improvement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"711c581c5e56fdee0f396e5cc6cee9e479accb1fdf308a28ffdced8cb7518a58","category":"Interdisciplinary"}