{"title":"Apple Likely Already Designing Chips Based on TSMC's 2nm Process","link":"https://www.macrumors.com/2024/02/28/apple-designing-2nm-silicon-chips/","date":1709125677000,"content":"Apple is already designing the chips that will use TSMC's next-generation 2-nanometer fabrication process, according to information allegedly sourced from an Apple employee on LinkedIn.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/10/Apple-Silicon-Teal-Feature.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nOriginally captured by Korean website <a href=\"https://gamma0burst.tistory.com/m/1107\">gamma0burst</a> and shared on X (Twitter) by the leaker <a href=\"https://x.com/Tech_Reve/status/1762774972852998249?s=20\">Revegnus</a> (@Tech_Reve), the information appears in a heavily redacted slide said to list the employee's work on past and current projects at Apple.\r<br />\n\r<br />\nA non-redacted part of the slide reads \"TS5nm, TS3nm, working on TS2nm,\" terms believed to reference the different fabrication processes Apple has chosen for past, current, and future chips. Terms like \"3nm\" and \"2nm\" refer to the specific architecture and design rules TSMC is using for a family of chips. Decreases in node size correspond to a smaller transistor size, so more transistors can fit on a processor, leading to boosts in speed and more efficient power consumption. \r<br />\n\r<br />\nRumors <a href=\"https://www.macrumors.com/2024/01/15/next-gen-chip-technology-on-track-for-2025/\">suggest</a> that TSMC is already starting work on more advanced 1.4-nanometer chips, which are expected to come out as soon as 2027. Apple is said to be looking to reserve TSMC's initial manufacturing capabilities for both 1.4nm and 1nm technologies. To get a sense of the nanometer scale, a strand of human hair is about 80,000 to 100,000nm wide. \r<br />\n\r<br />\nLast year, Apple adopted 3nm chips for its iPhones and Macs, an upgrade over the prior 5nm mode. The switch to 3nm technology brought 20 percent faster GPU speeds, 10 percent faster CPU speed, and a 2x faster Neural Engine to the iPhone, and similar improvements on Macs.  \r<br />\n\r<br />\nApple is believed to be the first company that will <a href=\"https://www.macrumors.com/2024/01/24/apple-tsmc-first-2nm-chips/\">receive chips built on TSMC's future 2nm process</a>, which is expected to go into production in the second half of 2025. The 2nm fabrication process, also known simply as \"N2,\" is expected to offer a 10 to 15 percent speed improvement at the same power or a 25 to 30 percent power reduction at the same speed compared to chips made with the supplier's ‌3nm‌ technology.\r<br />\n\r<br />\nTSMC is building two new facilities to accommodate 2nm chip production, and is waiting on approval for a third. The Taiwanese fab giant is spending billions on the change, and Apple will also need to make chip design changes to accommodate the new technology. Apple is TSMC's main client, and it is typically the first to get TSMC's new chips. Apple <a href=\"https://www.macrumors.com/2023/08/29/apple-buys-all-3nm-tsmc-chips-2023/\">acquired all of TSMC's 3-nanometer chips</a> in 2023 for iPhones, iPads, and Macs, for example.<div>Tags: <a href=\"https://www.macrumors.com/guide/tsmc/\">TSMC</a>, <a href=\"https://www.macrumors.com/guide/revegnus/\">Revegnus</a>, <a href=\"https://www.macrumors.com/guide/2nm/\">2nm</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/28/apple-designing-2nm-silicon-chips/\">Apple Likely Already Designing Chips Based on TSMC's 2nm Process</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-likely-already-designing-chips-based-on-tsmcs-2nm-process.2420633/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"711e3025aa9086881282b15a0778d865693ca4c66fda2315df1769d150f8c427","category":"Apple"}