{"title":"Yet another Google AI leader has defected to Apple","link":"https://arstechnica.com/?p=1762074","date":1620079183000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/IRW_3731-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/IRW_3731.jpg\">Enlarge</a> <span>/</span> AI researcher Samy Bengio (left) poses with his brother Yoshua Bengio (right) for a photo tied to a report from cloud-platform company Paperspace on the future of AI. (credit: <a href=\"https://blog.paperspace.com/the-future-of-ml/\">Paperspace</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Apple has hired Samy Bengio, a prominent AI researcher who previously worked at Google. Bengio will lead \"a new AI research unit\" within Apple, according to a recent report <a href=\"https://www.reuters.com/technology/apple-hires-ex-google-ai-scientist-who-resigned-after-colleagues-firing-2021-05-03/\">in Reuters</a>. He is just the latest in a series of prominent AI leaders and workers Apple has hired away from the search giant.</p>\n<p>Bengio will work directly under John Giannandrea, Apple's senior vice president of machine learning and AI strategy. Giannandrea himself used to lead AI at Google (he worked there for eight years) before jumping ship to work at Apple in 2018. We <a href=\"https://arstechnica.com/gadgets/2020/08/apple-explains-how-it-uses-machine-learning-across-ios-and-soon-macos/\">interviewed him at length</a> last year about the growing role of machine learning in Apple's software and services.</p>\n<p>Apple uses machine learning to improve the quality of photos taken with the iPhone, surface suggestions of content and apps that users might want to use, power smart search features across its various software offerings, assist in palm rejection for users writing with the iPad's Pencil accessory, and much more.</p></div><p><a href=\"https://arstechnica.com/?p=1762074#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762074&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"711fe80ef88a2b7e0c88e0027ca1a017fea42f5b8fa1e84de00ba184fde3f30a","category":"Tech"}