{"title":"33 Beyond bacteria: Impact of live yeast as a probiotic on the intestinal health of dogs","link":"https://academic.oup.com/jas/article/102/Supplement_3/122/7757084?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Inactivated yeast and yeast-based products are commonly used in pet food to improve palatability, contribute to dietary protein content, and improve gastrointestinal functionality. However, the use of viable yeast <span>Saccharomyces</span> as a probiotic may contribute to additional beneficial effects on dogs and cats. Considering that, in this presentation, we will focus on the use of viable yeast as a probiotic for dogs. A study conducted at the Federal University of Parana, Brazil, observed that Beagle dogs supplemented with a probiotic yeast presented reduced fecal concentrations of total biogenic amines, ammonia, and aromatic compounds and greater fecal concentrations of butyrate. The supplemented dogs also presented an improvement in dysbiosis index, a greater abundance of <span>Bifidobacterium</span> and <span>Turicibacter</span>, and a reduced abundance of <span>Escherichia coli</span> in feces. In addition, control group dogs presented upregulation in microbial genes related to virulence factors (such as lipopolysaccharide export system), antibiotic resistance, and osmotic stress, compared with the probiotic group. These results may indicate a possible protective effect of the yeast probiotic against potential pathogenic bacteria in the gut. The mechanisms by which yeast probiotics may contribute to gastrointestinal functionality in dogs and cats are not fully elucidated. However, they are usually attributed to the stimulation of brush edge disaccharidases; competition for adhesion sites against potential pathogens; stimulation of nonspecific immunity; neutralization of toxins; and direct effect against potentially pathogenic microorganisms. Many of these mechanisms are influenced directly by yeast cell wall components, such as mannans and beta-glucans. One of the main mechanisms of action of mannans is the elimination of bacteria with pathogenic potential that present type-1 fimbriae, such as some strains of <span>E. coli</span> and <span>Salmonella</span>, preventing their adhesion and colonization to the host mucosa. This may also contribute to the establishment of beneficial bacteria in the gut. We can conclude that viable yeast <span>Saccharomyces</span> as a probiotic may have promising beneficial effects on intestinal functionality of dogs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"711f4b948362428d61e5d372b2187426addef91a49fbb849484cec57c5e1a172","category":"Environment"}