{"title":"A framework for assessing the impacts of land‐use/cover change and climate change on wheat productivity under 1.5 and 2.0 °C warming at watershed scale","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13237?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Irrigation is used extensively to enhance grain production and ensure food security. Many studies have used crop models and global climate models to study the variation of irrigated crop yield in the context of climate change. But most considered the influence of direct climate change but neglected the influence of irrigation water availability, which is affected by land-use/cover change (LUCC) and indirect climate change, on irrigated crop yield. This study therefore developed a framework including Patch-generating Land Use Simulation model, Soil and Water Assessment Tool, Agricultural Production Systems sImulator Model, and global climate models for exploring the impacts of LUCC, direct climate change, and indirect climate change on wheat yield in a typical watershed.</p>\n<h2>RESULTS</h2>\n<p>Both LUCC and climate change caused increased runoff from October to May, and thus increased the irrigation water availability, by 51.6 and 30.7 mm per growing season under 1.5 and 2.0 °C warming, respectively. The combined influence of LUCC, direct, and indirect climate change increased wheat yield by about 18.5% and 15.5% in the context of 1.5 and 2.0 °C warming, respectively. The relative contribution of LUCC, indirect climate change and direct climate change to yield was 4.7%, 41.2%, and 54.1% under 1.5 °C warming, and 13.1%, 28.7%, and 58.2% under 2.0 °C warming, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>We suggest that changes in irrigation water availability should be considered from a watershed perspective when simulating the influence of climate change on crop yield, especially regional crop production estimation. © 2023 Society of Chemical Industry.</p>","author":"Haowei Sun, \nLi Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"712539abb9910516edd8c757e05acb796eb96b2b50cebc901ee60be3124e182c","category":"Environment"}