{"title":"Quality changes due to refrigerated storage in a traditional dry‐cured pork belly salted with glasswort or KCl as partial substitutes for NaCl","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13701?af=R","date":1719578287000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Glasswort represents a novel alternative to KCl for replacing sodium in meat products. To evaluate the effects of Na reduction on the quality changes of a traditional dry cured belly due to storage, fresh bellies were dry-salted with 2% NaCl (BCON), with 2% of a mixture containing 50% NaCl and 50% KCl (BKCl) or with 1% of a mixture of 90% NaCl and 10% powdered glasswort (BGW), dry-cured, sliced, vacuum packaged and stored under refrigeration for 60 days.</p>\n<h2>RESULTS</h2>\n<p>The BKCl and BGW bellies were lower in sodium by one-third to one-half compared to BCON (with 1.6 g Na/100 g). Neither BKCl, nor BGW significantly differed from BCON in free fatty acids (FFA) before and after storage, whereas BGW showed almost twice as much 2-methylbutanal content as BCON. All bellies showed microbiological stability during storage. <i>Micrococcaceae</i> was the most abundant microbial group with values of 10<sup>5</sup> to 10<sup>6</sup> colony-forming units g<sup>−1</sup>. The BGW presented higher <i>Micrococcaceae</i> counts (approximately one log unit) but lower microbial biodiversity than BCON.</p>\n<h2>CONCLUSION</h2>\n<p>The two alternative dry salting methods reduced the sodium content in bellies, at the same time as ensuring chemical and microbiological stability during refrigerated vacuum storage. © 2024 The Author(s). Journal of The Science of Food and Agriculture published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Iasmin Ferreira, \nIrma Caro, \nJavier Mateo, \nAlireza Kasaiyan, \nAna Leite, \nLia Vasconcelos, \nSandra Rodrigues, \nAlfredo Teixeira","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7131f761201d88e79a274bf3d01ea42c18ab42733058ef3dbdade5d3f225c043","category":"Environment"}