{"title":"Controls on Polar Southern Ocean Deep Chlorophyll Maxima: Viewpoints From Multiple Observational Platforms","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GB008033?af=R","date":1711193433000,"content":"<h2>Abstract</h2>\n<p>Deep Chlorophyll Maxima (DCMs) are ubiquitous in low-latitude oceans, and of recognized biogeochemical and ecological importance. DCMs have been observed in the Southern Ocean, initially from ships and recently from profiling robotic floats, but with less understanding of their onset, duration, underlying drivers, or whether they are associated with enhanced biomass features. We report the characteristics of a DCM and a Deep Biomass Maximum (DBM) in the Inter-Polar-Frontal-Zone (IPFZ) south of Australia derived from CTD profiles, shipboard-incubated samples, a towbody, and a BGC-ARGO float. The DCM and DBM were ∼20 m thick and co-located with the nutricline, in the vicinity of a subsurface ammonium maximum characteristic of the IPFZ, but ∼100 m shallower than the ferricline. Towbody transects demonstrated that the co-located DCM/DBM was broadly present across the IPFZ. Large healthy diatoms, with low iron requirements, resided within the DCM/DBM, and fixed up to 20 mmol C m<sup>−2</sup> d<sup>−1</sup>. The BGC-ARGO float revealed that DCM/DBM persisted for &gt;3 months. We propose a dual environmental mechanism to drive DCM/DBM formation and persistence within the IPFZ: sustained supply of both recycled iron within the subsurface ammonium maxima, and upward silicate transport from depth. DCM/DBM cell-specific growth rates were considerably slower than those in the overlying mixed layer, implying that phytoplankton losses such as herbivory are also reduced, possibly because of heavily silicified diatom frustules. The light-limited seasonal termination of the observed DCM/DBM did not result in a “diatom dump”, rather ongoing diatom downward export occurred throughout its multi-month persistence.</p>","author":"Philip W. Boyd, \nDavid Antoine, \nKimberley Baldry, \nMarin Cornec, \nMichael Ellwood, \nSvenja Halfter, \nLeo Lacour, \nPauline Latour, \nRobert F. Strzepek, \nThomas W. Trull, \nTyler Rohr","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"71372d895342ff06d39f49a7304112b82fd2db37090d56672a4cbf030703f4f2","category":"Environment"}