{"title":"Green Composites in Aviation: Optimizing Natural Fiber and Polymer Selection for Sustainable Aircraft Cabin Materials","link":"https://www.preprints.org/manuscript/202409.2321/v1","date":1727600168000,"content":"The increasing demands on global resources due to technological development driven by consumer expectations and demands have resulted in significant problems with ecological sustainability and material availability. The creation of biocomposites has resulted in notable advancements in the green industry within the materials science area this century, owing to concerns regarding sustainability and the environment. Globally, there is a surge in the creation of highly efficient materials derived from natural resources. In aviation applications, plant-fiber-supported polymer composite materials are becoming increasingly popular. Aerospace materials are typically used in aircraft construction as structural materials to support loads throughout different flight phases. There are many diverse mechanical qualities of natural fibres; therefore, selecting one for the interior parts of an aircraft cabin based only on its attributes leads to a multiple-attribute decision-support issue. In this paper, the effective natural fibre and polymer choice for use as reinforcing materials in composite materials is represented for the composite materials’ improvement to aircraft cabin luggage for aerospace implementations. This study can guide material designers in investigating different hybrid materials with the most effective natural fiber and polymer obtained by hierarchical strategy by elucidating the effective material choice to meet the criteria determined for the aircraft cabin luggage. For this purpose, the definitive rankings of the twelve polymers and sixteen natural fibers in terms of performance score were assessed using hierarchical strategy methodology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"713ad1a00170fdef105693590c9ce0a881bb903a6796ca8e2d423b4f0e76eca2","category":"Interdisciplinary"}