{"title":"Impact of QRS misclassifications on heart-rate-variability parameters (results from the CARLA cohort study)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304893","date":1718632800000,"content":"<p>by Frank Sauerbier, Johannes Haerting, Daniel Sedding, Rafael Mikolajczyk, Karl Werdan, Sebastian Nuding, Karin H. Greiser, Cees A. Swenne, Jan A. Kors, Alexander Kluttig</p>\r\nBackground <p>Heart rate variability (HRV), an important marker of autonomic nervous system activity, is usually determined from electrocardiogram (ECG) recordings corrected for extrasystoles and artifacts. Especially in large population-based studies, computer-based algorithms are used to determine RR intervals. The Modular ECG Analysis System MEANS is a widely used tool, especially in large studies. The aim of this study was therefore to evaluate MEANS for its ability to detect non-sinus ECG beats and artifacts and to compare HRV parameters in relation to ECG processing. Additionally, we analyzed how ECG processing affects the statistical association of HRV with cardiovascular disease (CVD) risk factors.</p> Methods <p>20-min ECGs from 1,674 subjects of the population-based CARLA study were available for HRV analysis. All ECGs were processed with the ECG computer program MEANS. A reference standard was established by experienced clinicians who visually inspected the MEANS-processed ECGs and reclassified beats if necessary. HRV parameters were calculated for 5-minute segments selected from the original 20-minute ECG. The effects of misclassified typified normal beats on i) HRV calculation and ii) the associations of CVD risk factors (sex, age, diabetes, myocardial infarction) with HRV were modeled using linear regression.</p> Results <p>Compared to the reference standard, MEANS correctly classified 99% of all beats. The averaged sensitivity of MEANS across all ECGs to detect non-sinus beats was 76% [95% CI: 74.1;78.5], but for supraventricular extrasystoles detection sensitivity dropped to 38% [95% CI: 36.8;38.5]. Time-domain parameters were less affected by false sinus beats than frequency parameters. Compared to the reference standard, MEANS resulted in a higher SDNN on average (mean absolute difference 1.4ms [95% CI: 1.0;1.7], relative 4.9%). Other HRV parameters were also overestimated as well (between 6.5 and 29%). The effect estimates for the association of CVD risk factors with HRV did not differ between the editing methods.</p> Conclusion <p>We have shown that the use of the automated MEANS algorithm may lead to an overestimation of HRV due to the misclassification of non-sinus beats, especially in frequency domain parameters. However, in population-based studies, this has no effect on the observed associations of HRV with risk factors, and therefore an automated ECG analyzing algorithm as MEANS can be recommended here for the determination of HRV parameters.</p>","author":"Frank Sauerbier","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"713cbd06b1be70a876462786728775c848205611e79ceaeae63183864b04b6cb","category":"Interdisciplinary"}