{"title":"Revegetation Changes Main Erosion Type on the Gully–Slope on the Chinese Loess Plateau Under Extreme Rainfall: Reducing Gully Erosion and Promoting Shallow Landslides","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036307?af=R","date":1709195349000,"content":"<h2>Abstract</h2>\n<p>Extreme rainfall events pose a severe challenge to soil and water conservation, even in areas with high vegetation cover on the Loess Plateau. In this study, the artificial extreme rainfalls with cumulative rainfall of 270 mm and intensity of 60 mm · hr<sup>−1</sup> were conducted on in-situ experimental plots (20 × 2.5 m) on a loess gully–slope with gradients of 35°–40° that were treated with different grass coverage: (0%, 30%–40%, 70%–80%, &gt;90%). The ephemeral gully/rill and shallow landslide occurred in plots were analyzed. Revegetation changed the erosion type on gully–slope, reducing gully erosion but promoting shallow landslide due to the change from infiltration–excess runoff to saturation–excess runoff. Under grass coverage of &gt;90%, over 95% of rainfall seeped into the soil, and subsurface flow was generated due to the lower saturated hydraulic conductivity of underlying soil, which increased the possibility of landslides. The average erosion rate (0.36–3.29 g · m<sup>−2</sup> min<sup>−1</sup>; no obvious erosion) in plots with 70%–80% coverage was 95.5% lower than that in bare land plots (27.8–47.5 g · m<sup>−2</sup> min<sup>−1</sup>; ephemeral gully erosion), while due to landslides the average erosion rate in plots with &gt;90% coverage (135.1–184.3 g · m<sup>−2</sup> min<sup>−1</sup>) was 86.5 times higher than that in plots with 70%–80%. For grass, a coverage of 70%–80% was most effective in preventing soil erosion, controlling gully erosion and preventing landslides under extreme rainfall. These results deepen the understanding of the complex relationship between vegetation, gully erosion, and landslides in ecologically sensitive areas.</p>","author":"Yangguang Xu, \nLi Luo, \nWenzhao Guo, \nZhao Jin, \nPei Tian, \nWenglong Wang","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"7146eeb4820e25ee177829368d0054415f00f24f877cdc917176659923c1639f","category":"Environment"}