{"title":"กูเกิลใช้ AI พยากรณ์ ลดเมฆ Contrail จากเครื่องบินลงได้ 54% ช่วยลดภาวะเรือนกระจก","link":"https://www.blognone.com/node/135242","date":1691764217000,"content":"<div><div><div><p>เมฆสีขาวที่เราเห็นเป็นทางยาวต่อจากเครื่องบิน เรียกว่าเมฆ contrail (ย่อมาจาก condensation trail) เกิดจากไอที่พ่นออกมาจากเครื่องยนต์เครื่องบิน มาเจอกับไอน้ำที่ลอยอยู่บริเวณนั้นแล้วก่อตัวเป็นเกล็ดน้ำแข็งขนาดเล็ก</p>\n<p>ตามความรู้สึกของคนทั่วไป เมฆ contrail ดูไม่เป็นพิษเป็นภัย แต่จริงๆ แล้วเมฆ contrail สร้างภาวะเรือนกระจก เพราะเมื่อกระจายตัวออกแล้วจะบังไม่ให้ความร้อนจากดวงอาทิตย์สะท้อนออกไปนอกโลกได้ (ดูแผนภาพประกอบ) จากงานวิจัยพบว่า ปัจจัยจาก contrail คิดเป็นสัดส่วนถึง 35% ของภาวะโลกร้อนจากอุตสาหกรรมการบิน</p>\n<p>ปัญหานี้แก้ไม่ยากโดยหลักการ เพียงแค่ให้เครื่องบินเลี่ยงการบินผ่านพื้นที่ความชื้นสูงเท่านั้น เช่น บินให้สูงกว่าหรือต่ำกว่าเล็กน้อย แต่ในทางปฏิบัติอาจทำได้ยากเพราะไม่รู้ว่าพื้นที่ความชื้นสูงอยู่ตรงไหนบ้าง</p>\n<p>ทีมวิจัยจาก Google Research ร่วมกับโครงการ Breakthrough Energy ของบิล เกตส์ จึงแก้ปัญหานี้โดยรวมข้อมูลภาพถ่ายดาวเทียม แล้วให้ AI เรียนรู้แพทเทิร์นว่าเมฆ contrail เกิดขึ้นแถวไหนบ่อยๆ บ้าง แล้วมาสร้างโมเดลเพื่อพยากรณ์เส้นทางบินที่เหมาะสมให้นักบิน</p>\n<p>กูเกิลลองนำโมเดลนี้ไปใช้จริง ร่วมกับสายการบิน American Airlines จำนวน 70 เที่ยวบิน แล้วเช็คกับภาพถ่ายดาวเทียมหลังบินเสร็จ พบว่าสามารถลดเมฆ contrail ลงได้ถึง 54%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dcbb50a2d9286c76dd8a88d70ee36006.webp\" /></p>\n<p>ที่มา - <a href=\"https://blog.google/technology/ai/ai-airlines-contrails-climate-change/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/environment\">Environment</a></div><div><a href=\"/topics/global-warming\">Global Warming</a></div><div><a href=\"/topics/american-airlines\">American Airlines</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"714d95ac2c14d4202c77a6e906f7f9b40517125693754f98f7eb5352b1678d3f","category":"Thai"}