{"title":"Life cycles and challenges for fish species that breed in South African estuaries","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15618?af=R","date":1710504692000,"content":"<h2>Abstract</h2>\n<p>The literature currently recognizes four guilds of estuarine resident fish species, namely solely estuarine, estuarine and marine, estuarine and freshwater, and estuarine migrant. In this review the life cycles of actual representatives from these four guilds are assessed to determine whether the current definitions, which have never been formally tested, are appropriate to fish species resident in South African estuaries. Detailed information and diagrammatic life cycles are provided for the selected species covered by this review. A potential new estuarine resident guild category is also identified, namely, those taxa that are primarily estuarine but also have subpopulations recorded in both adjacent marine and freshwater habitats. The full range of reproductive characteristics employed by estuary resident species is examined, ranging from live bearers, pouch and nest brooders, to a suite of oviparous taxa that attach their ova to estuarine rocks, shells, and submerged vegetation, all of which assists with larval retention within the estuarine environment. The small size and early reproductive maturity of most estuarine resident species is highlighted, with reduced vulnerability to predation in shallow, sheltered, often turbid estuary waters offering considerable protection during spawning events when compared to the open ocean. In addition, these small fish would not have to move considerable distances at any stage of their life cycle, since egg, larval, juvenile, and adult stages all occur in the same place. The existence of contingent subpopulations within many estuarine resident species is noted, physico-chemical stresses on these species are highlighted, and the eurytopic nature of these small fish taxa emphasized.</p>","author":"Alan K. Whitfield","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"7153c58dfd33ba4828d793715e3bb82fa1b707ac9be99a9167f437ecacdfc919","category":"Environment"}