{"title":"Unveiling the Impact and Strategies of AI Integration in Sabah's Academic Realm: Opportunities, Challenges, and Recommendations","link":"https://www.preprints.org/manuscript/202404.1708/v1","date":1714112176000,"content":"The integration of artificial intelligence (AI) into academic settings in Sabah, Malaysia, is transforming education and research landscapes. While AI technologies promise to enhance teaching, learning, and scholarly activities, they also pose challenges such as ethical concerns and skill gaps among academic staff. This study addresses the multifaceted impacts of AI adoption on academicians in Sabah, focusing on two key research questions: the impact of AI-based intelligent tutoring systems on student engagement, learning outcomes, and educational equity, and the challenges and opportunities in building academicians' capacity to integrate AI technologies effectively. Through a multidisciplinary approach, incorporating insights from education, computer science, social sciences, and ethics, this research aims to evaluate the effectiveness of AI tools in educational settings and identify strategies for skill development and infrastructure support. The study recommends empirical assessments within Sabah's educational institutions, considering contextual factors and fostering collaborative partnerships with local communities. Professional development programs, collaboration with industry partners, and improved access to AI infrastructure are proposed strategies. Longitudinal studies and interdisciplinary research initiatives are suggested for future research, along with qualitative methods to capture diverse perspectives. Ultimately, by embracing a collaborative and multidisciplinary approach, Sabah's academic community can harness the transformative potential of AI to advance education, research, and scholarship while promoting ethical and inclusive practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"71575ce65c1b10ffc69234851ee267c4b8a2f394a5646dc37c9ac6d08ae8d368","category":"Interdisciplinary"}