{"title":"Apple to Provide DIY Repair Manuals on Support Website, Says Parts Store Will Be Operated By a Third Party","link":"https://www.macrumors.com/2021/11/22/apple-self-service-repair-program-details/","date":1637604179000,"content":"Last week, Apple announced a new <a href=\"https://www.macrumors.com/2021/11/17/apple-launches-self-service-repair/\">self-service repair program</a> that will provide customers with access to Apple genuine parts, tools, and manuals for completing their own repairs of select devices, starting with the iPhone 12 and iPhone 13 lineups and later Macs with M1 chips. Apple said the program will be available starting early next year in the United States and expand to additional countries throughout 2022.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/apple-self-service-repair-text.jpg\" />\r\n<br />\r\nIn an internal memo obtained by MacRumors, Apple provided a few more details about the program, including that repair manuals will be made available on the <a href=\"https://support.apple.com/\">Apple Support website</a>, confirming the location of where customers will be able to review this information prior to ordering parts for a self-service repair.\r\n<br />\r\n\r\n<br />\r\nApple's memo also said that its online parts store will be operated by an unspecified third party. While no official reason was provided, it would certainly be logistically easier for Apple to outsource shipping and receiving of parts to and from customers. A similar system is already in place for Apple Authorized Service Providers.\r\n<br />\r\n\r\n<br />\r\nWhen announcing the program last week, Apple said self-service repairs are intended for \"individual technicians with the knowledge and experience to repair electronic devices,\" adding that the initial phase of the program will focus on common repairs, such as replacing an iPhone's display, battery, or camera.\r\n<br />\r\n\r\n<br />\r\nApple's self-service repair program announcement <a href=\"https://www.macrumors.com/2021/11/17/ifixit-comments-apple-self-repair-program/\">has received praise</a> from supporters of the \"Right to Repair\" movement, but there are still some question marks. In its memo, Apple said more details will be shared as the program's launch approaches.<div>Tags: <a href=\"https://www.macrumors.com/guide/right-to-repair/\">Right to Repair</a>, <a href=\"https://www.macrumors.com/guide/self-service-repair/\">Self Service Repair</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/22/apple-self-service-repair-program-details/\">Apple to Provide DIY Repair Manuals on Support Website, Says Parts Store Will Be Operated By a Third Party</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-provide-diy-repair-manuals-on-support-website-says-parts-store-will-be-operated-by-a-third-party.2324476/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=iuTvDWuoeMU:-pHmdxITeIg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=iuTvDWuoeMU:-pHmdxITeIg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"715ad1717bfcedb64527df10a7118360067396b8652635c4f84298ef27ce8cc5","category":"Apple"}