{"title":"Exploring the Research Gaps on the Long-Term Effects of Soccer Headers: A Meta-Review of Existing Evidence","link":"https://www.preprints.org/manuscript/202410.1856/v1","date":1729690692000,"content":"Background: The practice of heading in soccer is widely recognized as an important aspect of the game both offensively and defensively, frequently implemented by players. However, concerns persist about the negative impact of this technique on players' cognitive function and symptoms, both in the short and long-term. This meta-review aims to systematically map the existing literature on soccer heading and its implications on the long-term effects; Methods: We conducted a meta-review of systematic reviews following PRISMA-ScR guidelines in PubMed, Embase and Web of Science databases. Searches were conducted between 21 February and 20 March 2024, in English, with a limitation to articles published between January 2000 and March 2024.; Results: Three systematic reviews were eligible for having addressed the subject of head-ball impacts in soccer and their physiological, neurological and cognitive impact. While most studies did not report any significant long-term changes, short-term impairments in memory and reaction time were observed in some instances, normalizing within 24 hours. Neurochemical markers showed mixed results, with increased NF-L levels persisting up to a month in certain cases. Visual reflexes and corticomotor inhibition also exhibited temporary dysfunctions post-heading; Conclusions: This meta-review highlighted the limited number of systematic reviews on the effects of heading in soccer in young and adult players. The current evidence suggests that while heading may lead to short-term cognitive and physiological changes, the long-term effects remain uncertain and probably under-studied. Further research, particularly with professional players and standardized methodologies on long-term follow-up, is needed to clarify these potential risks and inform safety measures in soccer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"716139dbf16de8b7fa0843eaa5c67d1a8ec342d0d268fa2bd73043420da87be8","category":"Interdisciplinary"}