{"title":"464 Awardee Talk: Gastrointestinal tract physiology in young pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/412/7757064?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>It is indeed a great privilege to have been awarded the 2024 American Feed Industry Association Award in Nonruminant Nutrition Research. I am honored to follow in the footsteps of many great non-ruminant nutritionists in the industry. I commenced my career in the pork industry with a PhD in digestive nutritional physiology focusing on the newly weaned piglet that, some 35 yr later, is still the subject of significant interest amongst researchers, veterinarians and practitioners, and producers alike. My research was amongst the first to demonstrate direct relationships between voluntary feed intake after weaning and structure and function of the small intestine, corresponding to production consequences. To circumvent intestinal tract disturbances after weaning, antibiotic growth promotors (AGPs)/prophylactic levels of antibiotics and mineral compounds (e.g., ZnO) were routinely included in diets. With the withdrawal of AGPs and in some jurisdictions, in-feed medications and ZnO, the commercial importance of maximizing feed intake in the post-weaning period, with appropriate inclusion of fiber and selected feed additives, has become even more apparent. Some of the more recent work I have been involved in, still involving the gastrointestinal tract, has explored the interrelationships as to why progeny born to first-litter sows perform worse than progeny born to multiparous sows. This is a global issue for the pork industry, especially in view of increasing litter size, yet remains one that has been relatively underexplored. A series of Australian studies using primiparous and multiparous sows, and their progeny conducted on commercial farms confirmed these findings, and reported some significant physiological, immunological, and anatomical differences between piglets born to different parity mothers. Piglets born to first-litter sows are born and weaned lighter than their counterparts born to older sows, suggesting they suffer poorer acquisition of maternal immunity and delays in intestinal tract development and skeletal muscle both in utero and soon after birth, and around weaning. Piglets born to first-litter sows enter weaning with reduced intestinal tract integrity and show some signs of reduced immunocompetence, which taken together, may impede their ability to cope with the stressors of weaning. Weaned piglets are typically treated collectively and are not managed by parity, but lifelong consequences of being born to a first-litter sow suggests further work needs to be done in this field. Gastrointestinal tract structure and function in piglets, and indeed in all neonates, is intricately associated with ‘gut health’, which was a term not even in the lexicon of the pork industry when I began my career. It is pleasing to see that the study of the gastrointestinal tract continues today, stronger than ever, as advances in science and methodologies allow for greater introspection of this organ and its multi-directional influences on the biology of the pig.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"71632d41603a085c2f1960ce68cb779b297fb177575b34512b0b90a22828d02f","category":"Environment"}