{"title":"Improved Biocompatibility and Osseointegration of Nanostructured Calcium-Incorporated Titanium Implant Surface Treatment (XPEED&reg;)","link":"https://www.preprints.org/manuscript/202405.0575/v1","date":1715234472000,"content":"Surface treatment of implants facilitates osseointegration, with nanostructured surfaces exhibiting accelerated peri-implant bone regeneration. This study compared bone-to-implant contact (BIC) in implants with hydroxyapatite (HA), sand-blasted and acid-etched (SLA), and SLA with calcium (Ca)-coated (XPEED®) surfaces. Seventy-five disk-shaped grade 4 Ti specimens divided into three groups were prepared, with 16 implants per group tested in New Zealand white rabbits. Surface characterization was performed using X-ray diffraction (XRD), field emission scanning electron microscopy (FE-SEM), digital microscopy, and a contact angle analyzer. Cell viability, proliferation, and adhesion were assessed using MC3T3-E1 cells. Apatite formation was evaluated using modified simulated body fluid (m-SBF) incubation. After 4 weeks of healing, the outcomes reviewed were BIC, bone area (BA), removal torque tests, and histomorphometric evaluation. Microstructure analysis revealed irregular pores across all groups, with the XPEED group exhibiting a nanostructured Ca-coated surface. Surface characterization showed a crystalline CaTiO3 layer on XPEED surfaces, with evenly distributed Ca penetrating the implants. All surfaces provided excellent environments for cell growth. The XPEED and SLA groups showed significantly higher cell density and viability with superior osseointegration than HA (p &amp;lt; 0.05); XPEED exhibited the highest absorbance values. Thus, XPEED surface treatment improved implant performance, biocompatibility, stability, and osseointegration.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"716aca4e4561a20e0dc1ddd7980392b56b64e9e7200a2aba4af21245f5d25f99","category":"Interdisciplinary"}