{"title":"Positive Security เปิดซอร์สเฟิร์มแวร์ ESP32 สำหรับ สำหรับส่งข้อมูลกลับหาเจ้าของผ่านเครือข่าย Find My","link":"https://www.blognone.com/node/122717","date":1621275713000,"content":"<div><div><div><p>Positive Technology เปิดโครงการ Send My เฟิร์มแวร์สำหรับโมดูล ESP32 เพื่อการส่งข้อมูลกลับหาเจ้าของโดยไม่ต้องมีโทรศัพท์มือถือ แต่ใช้เครือข่าย Find My ที่เป็นอุปกรณ์ iOS จำนวนมากทั่วโลก</p>\n<p>ก่อนหน้านี้มีโครงการโอเพนซอร์เพื่อสร้างอุปกรณ์ที่ใช้เครือข่าย Find My อยู่แล้ว คือ <a href=\"https://github.com/seemoo-lab/openhaystack\">OpenHayStack</a> แต่ก็ใช้สำหรับหาอุปกรณ์เหมือนกับ AirTag ปกติเท่านั้น ไม่สามารถส่งข้อมูลกลับมาได้</p>\n<p>Positive Technology ระบุว่ากระบวนการส่งข้อมูลกลับหาเจ้าของที่ง่ายที่สุดคือการออกแบบเฟิร์มแวร์ให้เหมือนเป็น AirTag หลายๆ ตัว ถ้าตัวไหนแสดงตัวก็แปลค่าเป็นเป็นค่าที่อยากสื่อสารกลับไปหาเจ้าของ แต่ปรากฎว่าแอปเปิลจำกัดให้ผู้ใช้แต่ละคนสามารถใช้ AirTag ได้ 16 อันเท่านั้นทำให้วิธีนี้ใช้จริงไม่ได้</p>\n<p>เทคนิคของ Positive Technology อาศัยแนวทางการเปลี่ยนกุญแจสาธารณะของ Find My ทุกๆ 15 นาที โดยแทนที่จะเปลี่ยนกุญแจตามสมการปกติ กุญแจสาธารณะระหว่างอุปกรณ์และตัว ESP32 อาจะเป็นกุญแจใดก็ได้ใน 4 รูปแบบ และฝั่งเครื่องรับข้อมูลก็ยิงกุญแจค้นข้อมูลจากเซิร์ฟเวอร์ด้วยกุญแจสาธารณะทั้ง 4 ตัว หากพบตัวใดก็แสดงว่าอุปกรณ์ปลายทางกำลังส่งข้อมูล 2 บิต หลังทดสอบกับเครือข่ายจริงพบว่า Send My สามารถส่งข้อมูลกลับไปหาเจ้าของได้ที่อัตรา 3 ไบต์ต่อวินาที</p>\n<p>แม้ว่าตอนนี้ Send My จะใช้งานได้ แต่ Positive Technology ก็ระบุแอปเปิลก็อาจจะพยายามปิดการใช้งานในอนาคต ความเป็นไปได้คือเติมข้อมูลยืนยันผู้ผลิตอุปกรณ์แพ็กเก็ต BLE ที่ AirTag ส่งออกมา แต่ตอนนี้เองข้อความของ AirTag ก็เต็มความจุของมาตรฐาน BLE แล้ว อีกทางคือการจำกัดปริมาณการคิวรีจากเซิร์ฟเวอร์ของ Find My ให้ต่ำลง</p>\n<p>ที่มา - <a href=\"https://positive.security/blog/send-my\">Positive Technology</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3fd9204b93f72e8bed5fb3006040a36d.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/airtag\">AirTag</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/internet-things\">Internet of Things</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"717686bef90c2bfe81c6e4bde7fbac8326002f51188cb79ebe01eb5b31fe56ad","category":"Thai"}