{"title":"Typhoid intestinal perforation in Francophone Africa, a scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003056","date":1711720800000,"content":"<p>by Leah Sukri, Audry Banza, Katherine Shafer, Yakoubou Sanoussi, Kathleen M. Neuzil, Rachid Sani</p>\r\n\r\nTyphoid intestinal perforation (TIP) is a leading cause of peritonitis and indication for emergency surgery in Africa, with reported mortality rates up to 30% in pediatric patients. Currently, data on TIP in Western databases are primarily from countries that speak English, likely due to non-English publication and citation biases. Despite the high burden of infectious diseases in Francophone Africa, data from these countries regarding TIP remain limited. This study aims to highlight the incidence and morbidity of TIP in Francophone African countries using an extended search algorithm. We conducted a scoping review using the PubMed, EMBASE, and SCOPUS databases with the keywords “peritonitis”, “non-traumatic ileal perforation”, and “typhoid” in Francophone African countries. Additionally, we contacted surgeons in Africa and concurrently used citation chasing to obtain data not found in western databases. In total, 32 studies from 12 countries were identified and included in this review. A total of 22 publications were in French. Patient median age was 20 years and TIP caused a median of 35% of acute peritonitis cases. Mortality rates ranged from 6–37% (median: 16%). Rate of complications ranged from 15–92% (median: 46%). Ileostomy creation as a treatment for TIP varied between hospitals (0–79%), with the highest rates reported in Niger. In Francophone Africa, TIP is associated with high morbidity and mortality, most commonly in children and young adults. Interventions, including improved sanitation and the introduction of typhoid conjugate vaccines into routine vaccination programs, have the potential to significantly decrease typhoid fever and its complications.","author":"Leah Sukri","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"717faefe7b0812d421d1da15d02dfcdb0e8af983ffdfe660d7b880387aa6b612","category":"Environment"}