{"title":"A transcriptomics‐based investigation of the mechanism of pulmonary fibrosis induced by nickel oxide nanoparticles","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24088?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Nickel oxide nanoparticles (NiONPs) are an emerging nanomaterial, which poses a huge threat to the health of workplace population. Nanoparticles induce pulmonary fibrosis, and its mechanisms are associated with noncoding RNAs (ncRNAs). However, ncRNAs and competing endogenous RNA (ceRNA) networks which involved in NiONP-induced pulmonary fibrosis are still unclear. This study aimed to identify ncRNA-related ceRNA networks and investigate the role of the Wnt/β-catenin pathway in pulmonary fibrosis. Male Wistar rats were intratracheally instilled with 0.015, 0.06, and 0.24 mg/kg NiONPs twice a week for 9 weeks. First, we found there were 93 circularRNAs (circRNAs), 74 microRNAs (miRNAs), 124 long non-coding RNAs (lncRNAs), and 1675 messenger RNAs (mRNAs) differentially expressed through microarray analysis. Second, we constructed ceRNA networks among lncRNAs/circRNAs, miRNAs and mRNAs and identified two ceRNA networks (lnc<i>Melttl16</i>/<i>miR-382-5p</i>/<i>Hsd17b7</i> and circ<i>Iqch</i>/<i>miR-181d-5p</i>/<i>Stat1</i>) after real time-quantitative polymerase chain reaction (RT–qPCR) validation. Furthermore, based on Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG) analyses, ncRNAs were found to be involved in biological processes and signaling pathways related to pulmonary fibrosis. KEGG analysis showed that NiONPs activated the Wnt/β-catenin pathway in rats. In vitro, HFL1 cells were treated with 0, 50, 100, and 200 μg/mL NiONPs for 24 h. We found that NiONPs induced collagen deposition and Wnt/β-catenin pathway activation. Moreover, a blockade of Wnt/β-catenin pathway alleviated NiONP-induced collagen deposition. In conclusion, these observations suggested that ncRNAs were crucial in pulmonary fibrosis development and that the Wnt/β-catenin pathway mediated the deposition of collagen.</p>","author":"Han Liu, \nMengmeng Yang, \nKun Li, \nQing Gao, \nJinfa Zheng, \nXuefeng Gong, \nHui Wang, \nYingbiao Sun, \nXuhong Chang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"71868cf6dabb33881a4c7f7f02ad93d49be685618f040e61105958ee34b1ac36","category":"Environment"}