{"title":"Apple Music Classical Now Available in China, Japan, and More Countries","link":"https://www.macrumors.com/2024/01/24/apple-music-classical-now-available-china-japan/","date":1706094829000,"content":"Apple Music Classical is now available in China, Japan, South Korea, Taiwan, Hong Kong, and Macao, fulfilling a rollout promise to the regions that Apple made <a href=\"https://www.macrumors.com/2024/01/09/apple-music-classical-expanding-to-more-countries/\">earlier this month</a>. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/apple-music-classical.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nApple Music Classical first launched in most other countries in March 2023. The ‌Apple Music‌ Classical app offers ‌Apple Music‌ subscribers access to over five million classical music tracks, including new high-quality releases, in addition to hundreds of curated playlists, thousands of exclusive albums, and other features like composer bios and deep dives on key works.\r<br />\n\r<br />\nThe app offers a simpler interface for interacting with classical music specifically. Unlike the existing ‌Apple Music‌ app, ‌Apple Music‌ Classical allows users to search by composer, work, conductor, catalog number, and more. Users can get more detailed information from editorial notes and descriptions.\r<br />\n\r<br />\nThe app can be pre-ordered now on the App Store in the above regions. In the U.S., a standard Apple Music subscription costs $10.99 per month.\r<br />\n \r<br />\nIn 2021, Apple announced that it had purchased the classical music streaming service Primephonic and would be folding it into ‌Apple Music‌ via a new app dedicated to the genre. <div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music-classical/\">Apple Music Classical</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/24/apple-music-classical-now-available-china-japan/\">Apple Music Classical Now Available in China, Japan, and More Countries</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-classical-now-available-in-china-japan-and-more-countries.2417285/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7198737504c6588ed79b8d26eafe41083cc56da6cf02fc92b486d589c8abc968","category":"Apple"}