{"title":"Nic Dlamini: the hero cycling needs","link":"https://www.cyclist.co.uk/news/9845/nic-dlamini-the-hero-cycling-needs","date":1625586558000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>6 Jul 2021</span></div>    </div></div><p>\nDlamini came home almost 90 minutes after Ben O'Connor on Sunday and outside the time limit but his performance was inspirational</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/cauldphoto-tdf-stage9-18.jpg?itok=X3XZu6Br\" />  </div>\n<div>\n      <p> On Sunday's Stage 9 of the Tour de France, Ben O'Connor powered through tough conditions and tougher climbs to take an impressive win in Tignes. Almost 90 minutes later, Nic Dlamini came across the line.</p>\n<p>Despite being nearly 50 minutes outside the time limit and the last man on the road by over half an hour, Dlamini, who crashed earlier that day, was determined to finish.</p>\n<p>The Team Qhubeka-NextHash man was the first black South African to ride the Tour de France and was determined to not give in, even when he saw several other riders calling it quits before the finish line.</p>\n<p>'I did realise after I crashed that it was going to be tight but it was just going up for the last 25km and I was already freezing by then and you know when it's really freezing on the Alps and you just can't reach into your pockets for food or even hold your bottle,' he explained.</p>\n<p>'At the bottom of the climb I tried calculating how long it would take and I knew it would be more than an hour and the chance was really small but I saw some guys getting into a car and thought to myself I was just going to keep going and get to the finish line.</p>\n<p>'I don't think I've seen myself like that, when I crossed the line my face just said it all. It was definitely one of my most difficult days on the saddle, it was 4,600 metres of climbing and not much downhill.'</p>\n<p>Dlamini himself doubted why he didn't just get in a nice, heated car and get a lift up the mountain in the exact same position in the race, 'I kept asking myself why when I woke up the next day. I wanted to respect the sport, respect my team and honour my dream to try to finish the race. That's something that I will forever be happy about.'</p>\n<p>That move was met by immense support both on the roadside in Tignes and across the world, 'Considering where I come from and coming here as the first black South African has really changed a lot of people's lives and inspired a lot of people in South Africa and internationally. I'm really happy to have been the person to be granted that opportunity and I hope it doesn't stop and I can keep on inspiring youngsters to keep dreaming.</p>\n<p>'I would've loved to get to Paris, I think it was going to be one of the only years that the Tour finishes in Paris on Nelson Mandela Day but I knew it wasn't going to be easy and I look forward to coming back and finishing the race.'</p>\n<p>Even though he'd been blown away by the level of support throughout the Tour, he was surprised that there were people left at the end, instead he thought, with the time reaching 7pm, the barriers and staging would be getting packed away.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/8632/how-to-watch-and-live-stream-the-tour-de-france-2021\">How to watch and live stream the Tour de France 2021</a></div>      <div><a href=\"/in-depth/9838/gallery-bikes-of-the-tour-de-france-2021\">Gallery: Bikes of the Tour de France 2021</a></div>    </div></div><p>\n'It made me really emotional to see the support is always there even on bad days because everyone gets bad days.</p>\n<p>'Even before the Tour started I received a lot of support from parents and youngsters of how inspired they were to live their dream and keep pushing, that makes you step up as a person.'</p>\n<p>Dlamini, whose next target is heading to the Olympics alongside teammates Stefan de Bod and Ryan Gibbons, concluded, 'This was a perfect position to encourage a lot of people in the townships, whether it's sport or academics, to work hard and never give up on their dreams.' </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"71bb2df40744d7bb6789e608eef3497ccef307628180b12d596cb47434b31e57","category":"Cycling"}