{"title":"Twitter Spaces เพิ่มฟังก์ชั่น co-host แล้ว ส่วน Fleets ที่หายไปจะเป็นพื้นที่ของ Spaces","link":"https://www.blognone.com/node/124094","date":1628213771000,"content":"<div><div><div><p>ในที่สุดทวิตเตอร์ก็เพิ่มฟังก์ชั่น co-host บน Spaces ห้องคุยเสียงแบบ Clubhouse ให้คนอื่นมาเป็น  co-host ได้ 2 คน คอยจัดการงานต่างๆ ไม่ว่าจะเป็นการเชิญสปีกเกอร์ขึ้นมาพูด, การจัดการ request, การลบคนออกจากห้อง เป็นต้น ทวิตเตอร์บอกด้วยว่า Fleets หรือ Stories ที่หายไป จะกลายเป็นพื้นที่ของ Spaces หรือ Spaces bar</p>\n<p>ที่ผ่านมา ทวิตเตอร์พยายามเพิ่มความสามารถใหม่ๆ ใน Spaces หลายอย่างหลังเริ่มมีคนนิยมใช่้งานมากขึ้นเรื่อยๆ เช่น การแชร์ลิงค์ Spaces บนไทม์ไลน์ได้เพื่อเชิญชวนให้คนเข้ามาพูดคุยได้ด้วยการกดปุ่มเดียว โดยในอนาคต ทวิตเตอร์เตรียมเปิดใช้ Voice Transformer ซึ่งก็คือการเปลี่ยนเสียงพูดของเราโดยใช้เอฟฟเฟกต์ เช่น Bee, Cartoon, Helium, Incognito, Karaoke, Microphone, Phone, Spatial, Stadium, Stage ซึ่งจะเป็นลูกเล่นใหม่ที่นอกจากจะสนุกแล้ว ยังช่วยปกปิดตัวตนเราได้อีกทางหนึ่งด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/70b331f0e487cd288e507872a7cf1fe7.png\" /></p>\n<blockquote><p>making it easier to manage your Space…introducing co-hosting!- hosts have two co-host invites they can send- the table just got bigger: 1 host, 2 co-hosts, and 10 speakers- co-hosts can help invite speakers, manage requests, remove participants, pin Tweets and more! <a href=\"https://t.co/s76JFbhTL2\">pic.twitter.com/s76JFbhTL2</a></p>\n<p>— Spaces (@TwitterSpaces) <a href=\"https://twitter.com/TwitterSpaces/status/1423333566675628039?ref_src=twsrc%5Etfw\">August 5, 2021</a></p></blockquote>\n<p>ที่มา - <a href=\"https://9to5mac.com/2021/08/05/twitter-spaces-introduces-co-host-feature-and-more/\">9to5Mac</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/spaces\">Spaces</a></div><div><a href=\"/topics/twitter\">Twitter</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"71bb19ed9d1147702545557eb3811e0ded0f4dc8fd5b9387658114e5667aa55b","category":"Thai"}