{"title":"Political factors and arrangements influencing primary health care financing and resource allocation: A scoping review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308754","date":1723212000000,"content":"<p>by Henrique Sant’Anna Dias, Adelyne Maria Mendes Pereira, Elisabete de Fátima Polo de Almeida Nunes, Caroline Pagani Martins, Marcela Castilho, Fernanda de Freitas Mendonça, Luciana Dias de Lima</p>\r\nIntroduction <p>Primary health care is a key element in the structuring and coordination of health systems, contributing to overall coverage and performance. PHC financing is therefore central in this context, with variations in sufficiency and regularity depending on the “political dimension” of health systems. Research that systematically examines the political factors and arrangements influencing PHC financing is justified from a global and multidisciplinary perspective. The scoping review proposed here aims to systematically map the evidence on this topic in the current literature, identifying groups, institutions, priorities and gaps in the research.</p> Methods and analysis <p>A scoping review will be conducted following the method proposed by Arksey and O’Malley to answer the following question: What is known from the literature about political factors and arrangements and their influence on and repercussions for primary health care financing and resource allocation models? The review will include peer-reviewed papers in Portuguese, English or Spanish published between 1978 and 2023. Searches will be performed of the following databases: Medline (PubMed), Embase, BVS Salud, Web of Science, Scopus and Science Direct. The review will follow the Preferred Reporting Items for Systematic Reviews and Meta-Analyses extension for Scoping Reviews checklist. Inclusion and exclusion criteria will be used for literature screening and mapping. Screening and data charting will be conducted by a team of four reviewers.</p> Registration <p>This protocol is registered on the Open Science Framework (OSF) platform, available at https://doi.org/10.17605/OSF.IO/Q9W3P</p>","author":"Henrique Sant’Anna Dias","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"71be90fff32552470daf6236e698c3d8dda5e5de66ff86a714e3a88245a6fd18","category":"Interdisciplinary"}