{"title":"iFixit ลดคะแนนซ่อมง่าย iPhone 14 เหลือ 4/10 บอกระบบตรวจสอบอะไหล่ทำให้การซ่อมยุ่งยากมาก","link":"https://www.blognone.com/node/135839","date":1695211455000,"content":"<div><div><div><p>เมื่อปีที่แล้ว iFixit ได้<a href=\"https://www.blognone.com/node/130494\">ให้คะแนน</a>การซ่อมง่ายของ iPhone 14 ด้วยตัวเลขที่สูงที่สุดในรอบหลายปีสำหรับ iPhone คือ 7 เต็ม 10 เนื่องจากเครื่องสามารถเปิดได้ง่าย ทั้งหน้าจอและด้านหลังเครื่อง พร้อมบอกว่าน่าจะเป็นต้นแบบให้ iPhone รุ่นถัด ๆ ไป แต่ล่าสุด iFixit เปลี่ยนใจแล้ว</p>\n<p>iFixit บอกว่าได้ปรับลดคะแนนการซ่อม iPhone 14 ลง จาก 7 ลงมาเหลือเพียง 4 คะแนนเท่านั้น โดยบอกว่าการให้คะแนนตอนนั้นเป็นเรื่องของฮาร์ดแวร์ ที่แกะประกอบได้ง่าย แต่ตอนนี้การซ่อม iPhone 14 ทำได้ยากและซับซ้อนขึ้นเนื่องจากซอฟต์แวร์ของ iPhone</p>\n<p>ปัญหานี้เกิดจากการเปลี่ยนอะไหล่ชิ้นส่วน ซึ่งหากร้านซ่อมแซมทั่วไปจะเปลี่ยนให้ ชิ้นส่วนนั้นก็ต้องสั่งซื้อตรงจากแอปเปิล แถมต้องทำการยืนยันการว่ามีการเปลี่ยนเข้าชิ้นส่วนซีเรียลนั้น ๆ เข้าไปใน iPhone เครื่องที่ระบุ ผ่านระบบอนุมัติของแอปเปิลอีกด้วย โดยหากใช้ชิ้นส่วนอื่นหรือไม่ได้ยืนยัน การใช้งานจะปรากฏข้อความเตือนขึ้นมา และอาจใช้งานที่เกี่ยวข้องกับชิ้นส่วนนั้นไม่ได้ด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a65f60c7f89e06e2c99f07d7909fd0cd.jpg\" /></p>\n<p>ถึงแม้กระบวนการดังกล่าวจะฟังดูถูกต้องในแง่ของผู้ผลิตสมาร์ทโฟน แต่ iFixit บอกว่าร้านซ่อมแซมหลายแห่งพบว่าขั้นตอนการยืนยันขออนุมัติในระบบแอปเปิลยุ่งยากมาก จนไม่คุ้มที่จะให้บริการซ่อมแซมนี้ ฉะนั้นหากมองในแง่การซ่อมเองหรือการซ่อมที่ไม่ได้ทำผ่านศูนย์ทางการของแอปเปิล คะแนนการซ่อมง่ายจึงต้องปรับลดลง</p>\n<p>ชิ้นส่วนที่ iFixit ระบุว่าจะพบปัญหาข้อความเตือนเมื่อเปลี่ยนอะไหล่ใน iPhone 14 ก็มีจำนวนรายการเพิ่มมากกว่าอดีต จากเดิมมีเฉพาะ Touch ID หรือ Face ID ก็เพิ่มมาทั้งแบตเตอรี่ หน้าจอ กล้องหน้า กล้องหลัง ส่วนชาร์จไร้สาย และ Taptic Engine</p>\n<p>iFixit ยังอธิบายเพิ่มเติมว่าคะแนนที่ลงมาระดับ 4/10 นี้คือ ไม่แนะนำให้ซ่อมเอง และการปรับคะแนนนี้ก็เป็นไป<a href=\"https://www.ifixit.com/News/75533/how-ifixit-scores-repairability\">ตามระบบ</a>ที่ iFixit กำหนดไว้นานแล้ว ซึ่งหากแอปเปิลอัพเดตซอฟต์แวร์เพื่อลดปัญหาดังกล่าว คะแนนก็อาจปรับเปลี่ยนได้อีกครั้ง</p>\n<p>ที่มา: <a href=\"https://www.ifixit.com/News/82493/we-are-retroactively-dropping-the-iphones-repairability-score-en\">iFixit</a> ผ่าน <a href=\"https://www.ign.com/articles/ifixit-lowers-iphone-14-repairability-score\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ifixit\">iFixit</a></div><div><a href=\"/topics/iphone-14\">iPhone 14</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"71c29d309247f55dae3871952f3197818130548c8de1b80bf221def237a94424","category":"Thai"}