{"title":"Activated carbon adsorption for mitigating the harmful effects of antibiotics on the biological activated sludge: Effect on heterotrophic kinetics through respirometry","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11086?af=R","date":1722432483000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3e8e4da8-a636-4dfa-9d46-16e5e116cb03/wer11086-toc-0001-m.png\" alt=\"Activated carbon adsorption for mitigating the harmful effects of antibiotics on the biological activated sludge: Effect on heterotrophic kinetics through respirometry\" />\n<p>Addition of activated carbon minimizes the noxious effect of different antibiotics on the activated sludge kinetics. A comprehensive respirometric study allows to determine the role of the antibiotic and the activated carbon in the heterotrophic kinetics.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Conventional wastewater treatment plants (WWTPs) are not designed for the abatement of antibiotics, and their effluents are one of the main entry ways of these emerging contaminants to the aquatic environment, causing major concern due to their toxicity, persistence, and bioaccumulation. When wastewater containing antibiotics enters the bioreactor, they can impact microbial communities of the activated sludge, affecting biodegradation processes of organic matter and nutrients. There is scarce information about the effect of activated carbon on the activated sludge within the bioreactor in presence of antibiotics. In light of this, the effect of representative antibiotics, ciprofloxacin (CIP), nalidixic acid (NAL), and erythromycin (ERY), on the performance of a conventional activated sludge of a WWTP was analyzed by respirometry with and without activated carbon. NAL and ERY negatively affected the net heterotrophic biomass growth rate (<i>r′</i>\n<sub>\n   <i>x,H</i>\n</sub>), with reduction percentages of 26%–90% and 31%–81%, respectively. The addition of activated carbon mitigated this effect, especially for ERY, with increments of even 8% in the <i>r′</i>\n<sub>\n   <i>x,H</i>\n</sub> for the hybrid process when working with 5 ppm of ERY and 80 ppm of activated carbon compared with the value in the absence of antibiotic and activated carbon. This effect was attributed to the enhanced retention of ERY, in comparison to NAL, on the surface of the activated carbon, probably due to its higher molecular size and affinity towards the activated carbon (log <i>K</i>\n<sub>\n   <i>ow</i>\n</sub> = 3.06). This effect was more marked at low sludge retention times (below 8 days).</p>\n<h2>Practitioner points</h2>\n<p>\nCiprofloxacin (CIP), nalidixic acid (NAL), and erythromycin (ERY) were studied.\nNAL and ERY exerted negative impact on heterotrophic growth rate.\nEffect of antibiotics on microorganisms in the presence of activated carbon was studied.\nActivated carbon was mainly relevant for ERY due to its adsorption retention.\nEnhancement by activated carbon was more significant at low sludge retention times.\n</p>","author":"Eva Díaz, \nLaura García‐Menéndez, \nJuan Carlos Leyva‐Díaz, \nSalvador Ordóñez","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"71c31d49a1c40ed3a18c7fc2aee1c1b908f9ce4d3ec784e3e8a5c8ee67983678","category":"Environment"}