{"title":"Myosteatosis and the clinical outcomes of patients with liver cirrhosis: A meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310017","date":1726149600000,"content":"<p>by Haojie Xue, Yihan Liu, Yang Liu, Han Li, Qian Liang, Longhui Ma, Junying Liu, Ming Zhao</p>\r\nObjectives <p>This study aimed to examine the potential correlation between myosteatosis and the prognosis of patients diagnosed with liver cirrhosis by a meta-analysis.</p> Methods <p>Cohort studies of relevance were acquired through comprehensive searches of the Medline, Web of Science, and Embase databases. To account for heterogeneity, a random-effects model was employed to combine the findings.</p> Results <p>The meta-analysis included 10 retrospective and four prospective cohort studies, encompassing a total of 4287 patients diagnosed with cirrhosis. The pooled findings indicated a notable decline in transplant-free survival (TFS) among individuals with liver cirrhosis and myosteatosis compared to those without this condition (risk ratio: 1.94; 95% confidence interval: 1.61 to 2.34, <i>p</i> &lt; 0.001; I<sup>2</sup> = 49%). The predefined subgroup analyses demonstrated consistent findings across various categories, including Asian and non-Asian studies, prospective and retrospective cohort studies, patients with cirrhosis overall and those who underwent transjugular intrahepatic portosystemic shunt, studies with different follow-up durations (&lt; or ≥ 24 months), studies employing univariate and multivariate analyses, and studies with and without an adjustment for sarcopenia (<i>p</i> &gt; 0.05 for all subgroup differences). Additionally, Egger’s regression test indicated the presence of significant publication bias (<i>p</i> = 0.044). However, trim-and-fill analysis by including three hypothesized studies showed consistent results.</p> Conclusions <p>The presence of myosteatosis in individuals diagnosed with liver cirrhosis may potentially be linked to a poor TFS prognosis. Further investigations are required to ascertain whether enhancing myosteatosis could potentially yield a survival advantage for this particular patient population.</p>","author":"Haojie Xue","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"71c5e308d720bdf26502f098c950b123eecf5211054aee9fbbdd6532695e995e","category":"Interdisciplinary"}