{"title":"The retention efficiency of a large dam and reservoir eutrophication in a tropical coastal watershed under a rainfall reduction scenario","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2645?af=R","date":1711775050000,"content":"<h2>Abstract</h2>\n<p>Tropical coastal rivers transport significant amounts of materials, and the dam's retention efficiency can affect hydrological processes generating impacts on reservoirs, such as eutrophication. Nevertheless, climate change projects uneven regional rainfall reduction, affecting surface water circulation and consequently the dam retention efficiency with possible effects on reservoir eutrophication. Here, we investigated the water, suspended particulate matter, and nutrient mass-balance budgets in a large reservoir under a lowest rainfall year and effects on reservoir eutrophication in a tropical coastal watershed. Under low rainfall condition, the annual water budget showed that the dam water retention was limited, but the dam retained around 75% of the suspended particulate matter fluxes from the rivers. In terms of nutrients, the dam exported TN, TP and D-Si while retaining PO<sub>4</sub>\n<sup>3−</sup> on average; however, these circumstances fluctuated depending on the sample event. The reservoir's trophic state varied from mesotrophic to eutrophic possible reflecting the reduced dam's nutrient retention efficiency under influence of the low rainfall condition. However, 2 years following our sampling period, supereutrophic conditions and algal bloom were measured. Because human activities account for the majority of N and P loads across the watershed, mainly to soils, this biological response has been attributed to a greater rainfall regime that transfers N and P from soils to the reservoir.</p>","author":"Fernanda Albuquerque dos Reis Veríssimo, \nMauricio Mussi Molisani","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"71d897d1a46bc0001a1e7742bacc8790e64ae6fc585e779e9e6ea99d8fabf7cd","category":"Environment"}