{"title":"A cryptic syngameon within Betula shrubs revealed: Implications for conservation in changing subarctic environments","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13689?af=R","date":1713357560000,"content":"<h2>Abstract</h2>\n<p>Arctic and subarctic ecosystems are rapidly transforming due to global warming, emphasizing the need to understand the genetic diversity and adaptive strategies of northern plant species for effective conservation. This study focuses on <i>Betula glandulosa</i>, a native North American tundra shrub known as dwarf birch, which demonstrates an apparent capacity to adapt to changing climate conditions. To address the taxonomic challenges associated with shrub birches and logistical complexities of sampling in the northernmost areas where species' ranges overlap, we adopted a multicriteria approach. Incorporating molecular data, ploidy level assessment and leaf morphology, we aimed to distinguish <i>B. glandulosa</i> individuals from other shrub birch species sampled. Our results revealed three distinct species and their hybrids within the 537 collected samples, suggesting the existence of a shrub birch syngameon, a reproductive network of interconnected species. Additionally, we identified two discrete genetic clusters within the core species, <i>B. glandulosa</i>, that likely correspond to two different glacial lineages. A comparison between the nuclear and chloroplast SNP data emphasizes a long history of gene exchange between different birch species and genetic clusters. Furthermore, our results highlight the significance of incorporating interfertile congeneric species in conservation strategies and underscores the need for a holistic approach to conservation in the context of climate change, considering the complex dynamics of species interactions. While further research will be needed to describe this shrub birches syngameon and its constituents, this study is a first step in recognizing its existence and disseminating awareness among ecologists and conservation practitioners. This biological phenomenon, which offers evolutionary flexibility and resilience beyond what its constituent species can achieve individually, may have significant ecological implications.</p>","author":"Lyne Touchette, \nJulie Godbout, \nManuel Lamothe, \nIlga Porth, \nNathalie Isabel","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"71d99d0acd7d3e7d8d0d18155b113ad4574942003a8f5b4b96d31993c6b88e3c","category":"Environment"}