{"title":"Matthew Panzarino Interviews Greg Joswiak and John Ternus About the New iPad Pro","link":"https://techcrunch.com/2021/04/25/interview-apple-executives-on-the-2021-ipad-pro-stunting-with-the-m1-and-creating-headroom/","date":1619632419000,"content":"\n<p>Matthew Panzarino, writing for TechCrunch:</p>\n\n<blockquote>\n  <p>“We’ve always tried to have the best display,” says Ternus. “We’re\ngoing from the best display on any device like this and making it\neven better, because that’s what we do and that’s why we, we love\ncoming to work every day is to take that next big step.</p>\n</blockquote>\n\n<p>One thing I noticed watching <a href=\"https://daringfireball.net/2021/04/spring_loaded_thoughts_and_observations\">the event last week</a> is that Apple never describes iPads as “tablets”. They compare performance to “other devices” or, in Ternus’s words above, “any device like this”. I get why Apple is reluctant to call iPads “tablets”, but it’s hard to dance around it.</p>\n\n<p>Panzarino mentions this reluctance to use to the T-word in this bit, about how Apple sees the dynamic between Macs and iPads:</p>\n\n<blockquote>\n  <p>If you follow along, you’ll know that Apple studiously refuses to\nenter into the iPad vs. Mac debate — and in fact likes to place\nthe iPad in a special place in the market that exists\nunchallenged. Joswiak often says that he doesn’t even like to say\nthe word tablet.</p>\n\n<p>“There’s iPads and tablets, and tablets aren’t very good. iPads\nare great,” Joswiak says. “We’re always pushing the boundaries\nwith iPad Pro, and that’s what you want leaders to do. Leaders are\nthe ones that push the boundaries leaders are the ones that take\nthis further than has ever been taken before and the XDR display\nis a great example of that. Who else would you expect to do that\nother than us. And then once you see it, and once you use it, you\nwon’t wonder, you’ll be glad we did.”</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/28/panzer-joz-ternus\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"71f11c4c1120c447d1c7badff41f07c97525a0b8b97f841f5fa07187c1dcba29","category":"Tech"}