{"title":"A Guide To CSS Debugging","link":"https://smashingmagazine.com/2021/10/guide-debugging-css/","date":1633514400000,"content":"<p>We’ve all been there, at the end of completing CSS for a layout and — what’s that? Ah! An extra scrollbar! Or maybe an element is an unexpected color. And on some browsers, that new feature just doesn’t seem to be working.</p>\n<p>Debugging — regardless of the language — is never a favorite task. CSS, like other languages, becomes easier to debug when you take time to learn a bit about its quirks. It also helps to become familiar with tools to help you both debug and prevent creating bugs in the first place.</p>\nCommon Causes Of CSS Bugs\n<p>The first step in debugging is taking a step back and identifying the primary cause of the issue. In my experience, CSS layout issues often fall out of one of the following categories:</p>\n<ol>\n<li><strong>Overflow of content from its parent</strong> resulting in extra or unexpected scrollbars and content being pushed out of the regular viewport area.</li>\n<li><strong>Inheriting browser inconsistencies</strong> leading to mixed results across browsers and devices.</li>\n<li><strong>Unexpected inheritance from the cascade</strong> where multiple styles override one another, which may cause alignment and spacing issues, among other things.</li>\n<li><strong>CSS resiliency failures from DOM changes</strong>, including when child elements have gained wrapping divs or additional elements are unexpectedly added.</li>\n</ol>\n<p>We’ll review debugging for each category by learning common culprits for these issues and see how to use dev tools and other methods to pinpoint the offending styles. Of course, we’ll discuss possible resolutions to these bugs as well.</p>\nGeneral Debugging Tips\n<p>When something has gone wrong in your CSS, you can begin by using your favorite browser’s built-in DevTools to:</p>\n<ul>\n<li>toggle off rules one at a time</li>\n<li>toggle all rules off and bring them back one at a time</li>\n<li>remove or relocate elements</li>\n</ul>\n<p>Due to the global nature of CSS, the problematic style for an element may be located in its parent, grandparent, or even further back up the tree. DevTools will display the rules most applicable to the element based on specificity at the top of the pane and then provide a stack trace of the cascade and inherited styles.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d64674cf-bcf3-4692-81f0-52a4210f8bbf/1-debugging-css.png\" /></p>\n<p>You can also try to isolate the specific layout issue by either placing only that part into a local file or using an online editor like CodePen or CodeSandbox. Be aware that using those editors may insert extra opinions that your local environment doesn’t have. For example, CodePen defaults to using the Normalize reset, which may introduce new problems if you’re not already using it. Toggle off any settings that don’t work for your project. Then, you can use DevTools to copy in the relevant HTML. </p>\n<p>After that, another handy feature is to open the context menu (\"right click\" or equivalent) for your element and then select \"Copy &gt; Copy styles\" from the menu. Repeat for each nested element as needed.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/937b8355-6a16-4be4-9754-edefc5fa9c51/2-debugging-css.png\" /></p>\n<p>If the problem no longer exists after isolating it, it’s likely that an ancestor element is leading to the difficulties. You may choose to isolate starting from higher up the DOM tree, or you’ll likely need to inspect inheritance more closely. We’ll talk about inheritance a bit more later on.</p>\n<p>If you can resolve the problem in your isolated component, you can bring the updated styles back into your main project stylesheet.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e1cec8f3-8489-4ade-9e1f-64e676ab1cda/3-debugging-css.png\" /></p>\n<p>Chrome, Edge, Firefox, and Safari also have a way to track the changes you’ve made and save them to make it easier for you to copy over any updates. </p>\n<ul>\n<li><strong>Chrome/Edge</strong><br />Use the \"kebab\" more menu to select \"More Tools &gt; Changes\" to open that panel. Additionally, you can persist your changes by using the <a href=\"https://developer.chrome.com/blog/new-in-devtools-65/#overrides\">local overrides</a> feature.</li>\n<li><strong>Firefox</strong><br />The \"Changes\" panel should be already available by default and next to the \"Computed\" tab.</li>\n<li><strong>Safari</strong><br />Also offers the \"Changes\" panel by default, located in the same tab bar as the \"Styles\".</li>\n</ul>\n<p><strong>Recommended Reading</strong>: <em>“<a href=\"https://developer.mozilla.org/en-US/docs/Tools/Page_Inspector/How_to/Examine_and_edit_CSS\">Examine And Edit CSS</a>,” Firefox Developer Tools, MDN Web Docs</em></p>\n<p>More ideas, tips, and tools will be discussed next.</p>\nDebugging Overflow\n<p>Overflow is usually one of the most apparent issues and can be pretty frustrating. It’s not always evident at a glance <em>which</em> element is causing overflow, and it can be tedious to try to comb through elements using dev tools inspectors.</p>\n<blockquote>“CSS is designed to not lose content, to not cause harm. In order to not cause harm, we show what overflows by default.”<br /><br />— Miriam Suzanne, <a href=\"https://www.oddbird.net/2019/10/03/css-is-weird/\">Why Is CSS So Weird?</a> (video)</blockquote>\n\n<p>Thinking about it another way, the infamous meme of \"CSS is Awesome\" is, in fact, correct and intentional behavior <em>if</em> the base box was purposely set smaller than the size needed to accommodate that text. (If you’re interested, the original creator, <a href=\"https://css-tricks.com/css-is-awesome/#comment-1609829\">Steven Frank, stopped by CSS Tricks to explain the origin</a>).</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fd6b8c16-c463-4232-8253-f2680978109a/4-debugging-css.png\" /></p>\n<p>A tried and true method to begin figuring out which element is responsible for overflow is to add the following CSS:</p>\n<pre><code>* {\n  outline: 1px solid red;\n}\n</code></pre>\n\n<p>Why <code>outline</code> instead of <code>border</code>? Because it will not add to the element’s computed DOM size. Adding borders will change element appearances if they’re already using a border and may falsely cause additional overflow issues.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/987c2f96-8f82-4df0-b6da-70323260b592/5-debugging-css.png\" /></p>\n<p>The intent of using <code>outline</code> is to reveal element boundaries and visualize how elements are nested. For example, if overflow is causing unexpected scrollbars, an outline can help point out which element is pushing out of the viewport.</p>\n<p>In addition to this manual method, Firefox reveals scrolling elements and specify which elements have children causing overflow, as seen in this screenshot.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/fbbc550d-9eab-48eb-9a7d-373d7704e80e/6-debugging-css.png\" /></p>\n<h3>Common Causes Of Overflow</h3>\n<p>Typically when we’re concerned about overflow problems, it’s from a mismatch of width allowances between a parent element and its children.</p>\n<p>One of the first things to check is if an element has set an absolute <code>width</code> without a responsive method to allow it to fully resize downwards. For example, a <code>600px</code> box will trigger overflow on viewports narrower than <code>600px</code>. Instead, you may be able to adjust to add in a <code>max-width: 100%</code> so that the element will also responsively resize:</p>\n<pre><code>.wide-element {\n  width: 600px;\n  max-width: 100%;\n}\n</code></pre>\n\n<p>An example of when this would not be a complete solution is when the element triggering overflow also has margins that increase its computed size within its parent. In the following example, the paragraph is still forced outside the <code>main</code> element due to its horizontal margin.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b241cfd7-c46e-4ad9-be2d-d4c75ce99146/7-debugging-css.png\" /></p>\n<p>Fortunately, we can account for that margin by using the CSS math function <code>calc</code> to subtract the total area used by the horizontal margins:</p>\n<pre><code>p:first-of-type {\n  width: 800px;\n  max-width: calc(100% - 6rem);\n  margin: 3rem;\n}\n</code></pre>\n\n<p>Now, all that said, it’s not often we should be supplying absolute widths for elements. More often, it would be best to define only <code>max-width</code> if you need to control an element’s size. Again, this reduces bugs related to responsively sizing it. In fact, we can completely resolve the issues for our example by removing both the <code>width</code> and <code>max-width</code> values, which allows the paragraph’s default behavior to let it appropriately adjust within the available space of the <code>main</code> parent.</p>\n<p>However, there are situations when the solutions we looked at make sense, such as applying <code>max-width: 100%</code> to create responsive images. And for some flexbox-based layout methods, you’ll also see <code>width</code> or <code>flex-basis</code> used with <code>calc</code> for the reason of accounting for margin.</p>\n<p>Another common trigger for overflow has to do with one of the recognized <a href=\"https://wiki.csswg.org/ideas/mistakes\">mistakes in the design of CSS</a> by the CSS Working Group. Number 6, in fact, which is that <code>box-sizing</code> should have defaulted to <code>border-box</code> instead of <code>content-box</code>.</p>\n<p>All browsers currently ship with the legacy decision to set the element box model to use <code>content-box</code>, which means that an element’s border and padding are <em>added</em> to the computation of the element’s size. So, if you set absolute dimensions for width and/or height, you need to account for the extra space for any added border and padding.</p>\n<p>To simplify this behavior, a best practice is to ensure your styles include resetting all elements to use <code>border-box</code>. This reduces the chance of overflow in many instances and makes the CSS layout more predictable due to removing complications from including borders and padding in the final element dimensions.</p>\n<pre><code>*,\n*::before,\n*::after {\n  box-sizing: border-box;\n}\n</code></pre>\n\n<p>Other causes of overflow fit a little better into the categories of bugs we’ll review next.</p>\nDebugging Browser Inconsistencies\n<p>While we’re living in a golden age of near-parity between browsers for critical features, there are still some legacy choices that can interfere. Every browser ships with a default stylesheet called <em>user-agent</em> (UA) <em>styles.</em></p>\n<p>Here’s an example of how those styles appear in the primary browsers:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8b483389-60b2-4816-9b6d-d58171d41ab2/8-debugging-css.png\" /></p>\n<p>These happen to be highlighting one of those defaults that can be another common trigger for overflow. The <code>body</code> element has margin attached in every browser, with the top ones as commented:</p>\n<pre><code>body {\n  /* Chromium and Firefox */\n  margin: 8px;\n  /* Safari/webkit */\n  margin-top: 8px;\n}\n</code></pre>\n\n<p>You may be familiar with the concept of a CSS reset. These have evolved over the years as both CSS and browser support have improved but resetting the <code>body</code> back to <code>margin: 0</code> is usually a feature.</p>\n<p>If you use CodePen, the default reset is <a href=\"https://necolas.github.io/normalize.css/\">Normalize.css</a>, authored by Nicolas Gallagher and initially released in 2012. It can be found in many, many projects and is quite an opinionated reset. However, it’s worth noting that it has not been updated since November 2018.</p>\n<p><strong>Note</strong>: <em>Another timely note here is that Internet Explorer will reach <a href=\"https://docs.microsoft.com/en-us/lifecycle/faq/internet-explorer-microsoft-edge#:~:text=Yes%2C%20Internet%20Explorer%2011%20is%2CInternet%20Explorer%20(IE\">end of life officially on June 15, 2022</a>%20mode.)). This means that many features are needed not only in resets but within our stylesheets, in general, will no longer be required!</em></p>\n<p>CSS has been improving rapidly in the last couple of years, and of course, browsers are continually modernizing. An alternative reset that fits better with more modern projects is <a href=\"https://piccalil.li/blog/a-modern-css-reset/\">Andy Bell’s Modern CSS Reset</a>. This reset is enough to smooth out the handful of things common to most projects that are still inconsistent cross-browser, while not being overly opinionated. It also considers a few basic accessibility features. Andy explains each rule of the reset, and I’ve found it to be a solid starting point.</p>\n<p>Let’s look at a few modern browser inconsistencies that can cause layout bugs.</p>\n<h3>Overflow from Viewport Units and Scrollbars</h3>\n<p>Without removing the <code>margin</code> on the <code>body</code>, our simple example from the overflow section triggers overflow. That’s because we used <code>100vw</code> as one of the possible values for the <code>width</code> of the <code>main</code> element. Since it’s not subtracting the <code>margin</code>, it experiences overflow due to <code>100vw</code> being <code>16px</code> wider than the available space between the body’s margins.</p>\n<p>Depending on the browser and operating system, you may also experience browser scrollbar widths upsetting the <code>100vw</code> calculation as well. Currently, the fix is to update to <code>100%</code> if you can.\nSoon we’ll also have the <code>scrollbar-gutter</code> property to help us account for scrollbar widths. This property is being extended in <a href=\"https://drafts.csswg.org/css-overflow-4/#sbg-ext\">CSS Overflow Module Level 4</a> and has gained support in Chromium browsers from version 94. Bramus has <a href=\"https://www.bram.us/2021/07/23/prevent-unwanted-layout-shifts-caused-by-scrollbars-with-the-scrollbar-gutter-css-property/\">an excellent breakdown of</a> <a href=\"https://www.bram.us/2021/07/23/prevent-unwanted-layout-shifts-caused-by-scrollbars-with-the-scrollbar-gutter-css-property/\"><code>scrollbar-gutter</code></a> of how it will work and what it will help solve. The summary of the solution is to make sure you leave room for scrollbars while achieving an even gap appearance on both sides of the content by adding: <code>overflow: auto; scrollbar-gutter: stable both-edges;</code>.</p>\n<p><strong>Note</strong> :<em>If you aren’t sure your content requires scrollbars but know that it may need them sometimes, be sure to use the <code>auto</code> value for overflow. This tells the browser only to add them when the element needs them to accommodate the content. That said, users can customize their preferences to always show scrollbars, which is why the <code>scrollbar-gutter</code> property will be extra valuable!</em></p>\n<p>It can also be problematic to set <code>min-height: 100vh</code> on the body without removing the margin first. There are other issues with <code>100vh</code> specifically, and those have to do with how different devices and browser combinations have implemented the calculation for <code>100vh</code>.</p>\n<p>While <code>100vh</code> appears to work on most desktop contexts, you may have experienced the frustration of having what <em>seems</em> like unexpected behavior, particularly when tested on iOS in WebKit browsers. Within a fixed layout set to <code>100vh</code>, the bottom part of the website content is stuck behind the browser chrome, making it inaccessible when scrolling is prevented. For example, in a fixed height mobile menu or a single page app or game trying to fill no more than the available viewport height.</p>\n<p><a href=\"https://allthingssmitty.com/2020/05/11/css-fix-for-100vh-in-mobile-webkit/\">Matt Smith went seeking a solution</a> and discovered in some scenarios the <code>100vh</code> issue can be resolved by using the following combination:</p>\n<pre><code>html {\n  height: -webkit-fill-available;\n}\n\nbody {\n  min-height: 100vh;\n  /* mobile viewport bug fix */\n  min-height: -webkit-fill-available;\n}\n</code></pre>\n\n<p>This solution is imperfect, and I suggest testing on an actual device to ensure it works for your layout.</p>\n<p>Jen Simmons also <a href=\"https://developer.apple.com/videos/play/wwdc2021/10029/\">shared a technique</a> (timestamp: 13m) that is available in Safari 15 to adjust this behavior with the help of CSS environment variables. The <code>safe-area-inset-bottom</code> will be <code>0</code> when not applicable and dynamically adjust when it does apply. This environment variable can be used for padding, margin, and within <code>calc</code> as shown:</p>\n<pre><code>body {\n  min-height: calc(100vh — env(safe-area-inset-bottom));\n}\n</code></pre>\n\n<p>The CSS Working Group has an improved solution in draft to address this category of issues, which will be a set of new units for \"<a href=\"https://drafts.csswg.org/css-values-4/#viewport-relative-lengths\">Large, Small, and Dynamic Viewport Sizes</a>.\" These are intended to better correspond with the dynamic behavior of the changing browser chrome as is the cause of the WebKit troubles.</p>\n<p>Here’s a summary of the current draft (note that these may still have some changes before they are stable in browsers):</p>\n<ul>\n<li><strong>Small viewport-percentage units (svh, svb, svw, svi)</strong><br />Equivalent to the remaining viewport space when all dynamic UI elements are expanded (ex. URL bar and virtual keyboard), and will not change its value even as the browser chrome changes.</li>\n<li><strong>Large viewport-percentage units (lvh, lvb, lvw, lvi)</strong><br />The size opposite of small, calculated to assume all dynamic UI elements are retracted.</li>\n<li><strong>Dynamic viewport-percentage units (dvh, dvb, dvw, dvi)</strong><br />The unstable value of the visible viewport space that changes along with dynamic browser chrome changes.</li>\n</ul>\n<h3>Typography Element Properties</h3>\n<p>UA styles also include default styles for common typography elements such as headings, paragraphs, and lists. Typically, CSS resets or frameworks will have already addressed these things. And, while you may not consider differences in these properties to be \"bugs,\" it’s helpful to understand that they are not the same defaults cross-browser since these styles are some of the most impactful.</p>\n<p>The main note here is that if you notice an inconsistency, you may want to select your preferred value (such as a particular <code>font-size</code> for an <code>h1</code>) and add it to your stylesheet.</p>\n<h3>Differences In Browser Feature Support</h3>\n<p>Browser differences in feature support wins as the most frustrating category, stretching from modern browsers back to the beginning of CSS. Quite simply, not all browsers support all CSS properties equally.</p>\n<p>As mentioned earlier, we are in a time of near feature parity but <em>also</em> in a time of rapid development and growth of the CSS language. So the issues we have due to feature support are shrinking, but at the same time, we’re in a holding pattern as we wait for the new things to reach general availability.</p>\n<p>Fortunately, we have several tools available to help research feature support during development and to help address inconsistencies.</p>\n<p>The one you may already know about is <a href=\"https://caniuse.com/\">caniuse</a>, which lists support tables for both CSS and JavaScript features. The caveat to be aware of here is that the browser usage data is based on <a href=\"https://gs.statcounter.com/\">Statcounter</a>, a sampling of 2 million websites. The percentages, therefore, may not match your audience and should only be one data point in trying to determine whether it’s \"safe\" to use a particular feature for your project.</p>\n<p>Another helpful tool is the VSCode extension <a href=\"https://marketplace.visualstudio.com/items?itemName=webhint.vscode-webhint\">webhint</a>, which is also powering part of the Issues panel in Edge. Webhint alerts you about features that may have lower browser support to help you be aware during development. You can configure what browsers are considered by including a <a href=\"https://webhint.io/docs/user-guide/configuring-webhint/browser-context/\"><code>browserslist</code></a> in your package.</p>\n<p>Knowing about feature support during development helps you make an informed solution. But sometimes, it’s not about whether a feature is strictly supported but whether or not the property has undergone syntax changes. For example, sometimes properties are released with \"vendor prefixes.\" You’ve likely seen these — ones that begin with <code>-webkit</code> or <code>-moz.</code></p>\n<p>Usually, the stable version of the property does not continue to have a prefix, but it’s best to include the prefixed version for the broadest support. Fortunately, you can automate this step instead of doing it manually with the popular autoprefixer package. In addition, there is support for including it in many build processes, such as postCSS (the method I use). Like webhint, it looks at your <code>browserlist</code> to determine what level of support to provide prefixed properties.</p>\n<p>Beyond these tools, each browser’s dev tools have a method of signifying when that browser doesn’t support a property. Chromium, Safari, and Firefox show a yellow warning triangle alongside some other styling and a hover-triggered property to denote an unsupported property.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c31fb803-aae3-4f82-9a67-c5595edd0778/9-debugging-css.png\" /></p>\n<p>Reviewing how to handle a lack of support for a feature is a bit beyond the scope of this article. And, providing fallbacks if needed or setting up solutions as progressive enhancements is going to be unique. That’s why setting yourself up with tools to help check support during development is so important. Then, you can create a solution that fits the level of support you need instead of having a complete solution that you then have to debug and define a fallback for once you get bug reports.</p>\nUnexpected Cascading Layout Inheritance\n<p>Ok, so you feel you’re using well-supported CSS features. And you’ve just added a new section to your site, and you feel pretty confident about the CSS. But when you go to look at it in the browser, things seem incorrect.</p>\n<p>Particularly when using a framework or design system and then also writing custom CSS, we can encounter bugs related to the cascade and inheritance. Something that works in isolation may not work when placed within a screen layout.</p>\n<p>Fortunately, all browser dev tools allow tracing the cascade. By reviewing the Styles panel, we can see what rules are overriding our styles. Or, we can locate a parent that is adding a layout method we weren’t expecting for our child component.</p>\n<p>This simple example shows that the rule for <code>main *</code> is \"winning\" the cascade for applying <code>color</code> to the paragraph. Dev tools manipulate the order in the Styles panel to show the most applicable styles on top. Then, we can see that the color property for just <code>p</code> is crossed-out as an extra indicator that that rule definition is not applied.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3242cd21-e4fb-4adb-bfc9-fbdd964ced73/10-debugging-css.png\" /></p>\n<p>Let’s take a quick step back to CSS basics on the cascade. For this example, some of you may have realized that <code>main *</code> has equal specificity to <code>p</code>. But the other very critical part of the cascade is the order of rules, and here is the order from the stylesheet for the example:</p>\n<pre><code>body {\n  color: #222;\n}\n\np {\n  color: #444;\n}\n\nmain * {\n  color: hsl(260, 85%, 25%);\n}\n</code></pre>\n\n<p>If we want to make sure the rule for just <code>p</code> \"wins,\" then we either need to make sure it follows the <code>main</code> rule or increase its specificity.</p>\n<p>This basic feature of CSS is extremely powerful but can be perceived as a \"bug\" if you aren’t as familiar with how it works. And it can certainly be frustrating if you are tasked with deploying a new feature on a legacy codebase or required to use a framework where it’s more challenging to get around inherited specificity.</p>\n<p>Solving issues due to the cascade often doesn’t have an easy answer. It’s worth the time to step back from the immediate problem and examine the layers of styles coming together to identify the best place to make a change. Recognize that an <code>!important</code> could cause you further issues related to specificity down the line, so try out reordering properties if possible first. Or, you may want to switch to setting up \"components,\" which provide a layer of scoping for styles and encourage being more intentional about inheritance.</p>\n<p>Speaking of layers — speeding through the spec process is another new feature that was designed specifically to assist in orchestrating the cascade and alleviating clashes. At present, the Cascade Layers spec (@layer) has gained experimental support in all the top browsers. For more info on this upcoming feature, check out the excellent <a href=\"https://www.bram.us/2021/09/15/the-future-of-css-cascade-layers-css-at-layer/\">overview on CSS layers by Bramus</a>.</p>\n<p><strong>Note</strong>: <em>Please make sure to check the <a href=\"#resources-for-debugging-css\">resources at the end of this article</a> for a few links related to checking CSS specificity.</em></p>\nCSS Resiliency Failures From DOM Changes\n<p>Sometimes, a carefully crafted CSS solution stops working. In my experience, that often happens due to the underlying DOM changing. When we add CSS based on the current DOM, our solution isn’t resilient to change.</p>\n<p>For example, if we create a grid layout rule for a list defined as <code>.grid li</code>, and then the DOM structure changes to be a set of <code>article</code> elements, the CSS will break.</p>\n<p>Or, if we set up a series of icons that fit perfectly within the original space, but then the client needs to add an icon, and it causes overflow.</p>\n<p>These examples really show why CSS is a valuable skill. If you can write scalable, DOM-independent CSS, your solutions will scale, and you will reduce the likelihood of this category of bugs.</p>\n<p> Similar to creating an API in another programming language, it’s a worthwhile endeavor to consider how your CSS rules will be used beyond the current problem you’re solving.</p>\n<p>Debugging this category usually means tracing back to the original rules to see if they can be extended to work for the updated context. Again, you can use dev tools to find the applied rules and even follow the reference link to go to the source.</p>\n<p><strong>Note</strong>: <em>For more tips on how to handle this category with specific things to consider, review my article on <a href=\"https://moderncss.dev/developing-for-imperfect-future-proofing-css-styles/\">future-proofing CSS styles</a>.</em></p>\nLayout Swaps To Help Avoid CSS Bugs\n<p>Let’s look at a few specific examples that may cause layout bugs and how to address them.</p>\n<h3>Layout Spacing</h3>\n<p>Once flexbox was introduced, many grid layout solutions were released that all had some math to compute the width of the flex children. In addition, that width had to be aware of the addition of <code>margin</code> to add space between the children.</p>\n<p><strong>Good News</strong>: <em>The <code>gap</code> property for flexbox is now supported in all evergreen browsers!</em></p>\n<p>CSS grid also supports the <code>gap</code> property. The advantage of <code>gap</code> over <code>margin</code> is that it will always only apply <em>between</em> elements, regardless of orientation. So, no more funky business of trying to attach <code>margin</code> to the \"correct\" side or having to use negative margin on the parent to counteract nested margin.</p>\n<p>Unlike <code>margin</code>, the use of <code>gap</code> is less likely to cause overflow since it never applies to the outer edge of the elements. However, you may still experience overflow if the children cannot resize to a narrower width.</p>\n<h3>Handling Element Widths</h3>\n<p>If either your flex or grid children are causing overflow, here are two methods you may try as upgrades.</p>\n<p>For flex, ensure you use <code>flex-basis</code> instead of <code>width</code> and that the <code>flex-shrink</code> value is set to <code>1</code>. These properties will ensure that the element is allowed to be reduced in size.</p>\n<p>For grid, <a href=\"https://smolcss.dev/#smol-css-grid\">a method I often use</a> to achieve auto-wrapping behavior for grid children is the following:</p>\n<pre><code>grid-template-columns: repeat(auto-fit, minmax(30ch, 1fr));\n</code></pre>\n\n<p>But, this prevents elements shrinking below that minimum width of <code>30ch</code>. So, instead, we can update to this solution that keeps our minimum on larger viewports/within larger parents while still allowing child elements to shrink within narrower spaces:</p>\n<pre><code>grid-template-columns: repeat(auto-fit, minmax(min(100%, 30ch), 1fr));\n</code></pre>\n\n<p>I often find CSS functions very handy in these sorts of scenarios. If you’re unfamiliar, you may enjoy my article on <a href=\"https://moderncss.dev/practical-uses-of-css-math-functions-calc-clamp-min-max/\">practical uses of CSS functions</a>.</p>\n<p>Outside of a grid or flex context, we can achieve a similar behavior for elements to prevent setting an absolute width. We discussed in the overflow section how absolutes could often cause problems. But, there are, of course, times when we do want to provide some width parameters.\nOnce again, my preferred method for setting a flexible width uses the CSS function of <code>min()</code>. In this example, it is a bit of a shorthand for setting both <code>width</code> and <code>max-width</code> at once. The <code>min()</code> function will use the <em>smaller</em> computed value, which dynamically changes as the element’s context changes:</p>\n<pre><code>width: min(100vw - 2rem, 80ch);\n</code></pre>\n\n<p>The <code>min()</code> function accepts more than two values, so you could even add a percentage value here as well. Then, your container would be responsive not just to the viewport but when nested in other containers as well, reducing overflow bugs even further—and achieving our mission of creating scalable, DOM-independent styles!</p>\n<p>Review the use of <code>min()</code> as a container style as well as to make grid children more flexible in this CodePen:\n<a href=\"https://codepen.io/5t3ph/pen/bbac005dc0486ad4f80b5e222c1deae2\">min() and CSS Grid for responsive containers (codepen.io)</a></p>\n<h3>Cumulative Layout Shift</h3>\n<p>A more recent hot topic in site performance and related metrics is <a href=\"https://web.dev/cls/\">Cumulative Layout Shift (CLS)</a>. This is the Google Lighthouse score for how much elements shift or jump during page load. Some offenders are pretty obvious, such as ads and popup banners. Those things use motion and are typically late or purposely delayed in loading.</p>\n<p>Now, before you go attacking the problem, make sure there is one. Chrome and Edge include the \"Lighthouse\" panel in dev tools which you can use to run a report for both desktop and mobile versions of your site. If CLS is not a problem, that score will be less than 0.1 and be displayed with a green indicator.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9c8c34ce-77ab-40dc-8c20-7d9d5ab2aac7/11-debugging-css.png\" /></p>\n<p>Two other things that may affect your site are images and custom fonts.</p>\n<p>Fairly recently, all browsers have begun to reserve space for images <em>if</em> they include <code>width</code> and <code>height</code> attributes. Those attributes provide the two necessary pieces of information for the browser to calculate the image’s aspect ratio and hold that space within the page layout.</p>\n<p>However, due to responsive design, many of us are used to stripping those attributes assuming that CSS will take over. <a href=\"https://www.youtube.com/watch?v=4-d_SoCHeWE\">As Jen Simmons explains</a>, it’s time to add those back in. In addition, you may need to tweak your responsive image CSS slightly to include the following somewhat more specific rule, which will allow the image to respond to narrower contexts without losing its aspect ratio:</p>\n<pre><code>img[width] {\n  height: auto;\n}\n</code></pre>\n\n<p>As for custom fonts, the issue can come in here when the custom font and the designated system fallback font have a significant mismatch. In years past, we’d call it FLOUT (flash of unstyled text). This \"flash\" is from the delay in time between the initial page load and the custom font loading.</p>\n<p>In the example video from my own site that has this problem, I’ve used the Network Conditions panel in Edge to load the site with \"Network throttling\" set to \"Slow 3G.\"</p>\n<p>In my case, the actual CLS score doesn’t indicate the problem is severe enough to stress about resolving. However, if the font loading delay causes lots of elements to shift, that’s when it is worth looking into ways to alleviate the shifting problem.</p>\n<p>Sometimes you can select a fallback system font that better matches the custom font so that the relative size is a closer match. Or, you can reduce the effect by setting a minimum size on the parent elements or adjusting other layout attributes so that it doesn’t cause a significant shift when the font loads.</p>\n<p>Simon Hearne did <a href=\"https://simonhearne.com/2021/layout-shifts-webfonts/\">a deep dive into what causes layout shifts due to fonts</a> as well if you’d like to learn more about the problem, especially if you’re working on a more text-heavy site where the impact on CLS is more significant. They conclude that the ultimate solution to strictly address the layout shift is to use <code>font-display: optional</code> but concede that this is not optimal from a design perspective. Simon provides more solutions to help you select the right path for your site, including a handy CodePen to help you test fallbacks. Google also provides a resource describing <a href=\"https://web.dev/preload-optional-fonts/\">preloading fonts</a>.</p>\n<h3>Resources For Debugging CSS</h3>\n<p>We covered some frequent causes of CSS bugs and how to address them. Here are more resources that can help you with debugging CSS:</p>\n<ul>\n<li>Ahmad Shadeed wrote an ebook (paid) called <a href=\"https://debuggingcss.com/\">Debugging CSS</a></li>\n<li><a href=\"https://developer.mozilla.org/en-US/docs/Learn/CSS/Building_blocks/Debugging_CSS\">MDN has a dedicated resource on debugging CSS</a>, which covers more about using dev tools</li>\n<li>Additionally, you may find the MDN article on <a href=\"https://developer.mozilla.org/en-US/docs/Learn/Tools_and_testing/Cross_browser_testing/HTML_and_CSS\">handling common HTML and CSS problems</a> useful</li>\n<li>Worth another mention is Miriam Suzanne’s video: <a href=\"https://www.oddbird.net/2019/10/03/css-is-weird/\">Why is CSS So Weird?</a></li>\n<li>To check on and better understand CSS specificity, try out this tool from Kitty Giraudel called \"<a href=\"https://kittygiraudel.github.io/selectors-explained/\">Selectors Explained</a>\"</li>\n</ul>\n<p>Additionally, outside of the popular browser’s dev tools, you may find these two alternates helpful due to their extra tools and features:</p>\n<ul>\n<li><a href=\"https://polypane.app/\">Polypane</a> (paid) is a browser that shows you multiple views of your site to test responsive design but also has additional features that can help you catch bugs early.</li>\n<li><a href=\"https://chrome.google.com/webstore/detail/visbug/cdockenadnadldjbbgcallicgledbeoc?hl=en\">VisBug</a> is a Chromium extension that gives you extra info about elements, which can also help pinpoint issues.</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"71f8e75e3cb51e0117dad5aa0f23e59c4e8d42151dec71d8d957b0fd27851827","category":"Tech"}