{"title":"Daily Telescope: The sword of Orion contains a brilliant reflection nebula","link":"https://arstechnica.com/?p=1981202","date":1699275647000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/7BDD430A-DE13-4203-A107-6471A305AFD1-800x567.jpg\" alt=\"Orion and the Running Man Nebula.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/7BDD430A-DE13-4203-A107-6471A305AFD1.jpg\">Enlarge</a> <span>/</span> Orion and the Running Man Nebula. (credit: David Beverly)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light; a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It is November 6, and we're looking toward one of the most prominent constellations in the Northern Hemisphere's night sky.</p>\n<p>The Orion constellation likely needs no introduction, but for readers who are not astrophotographers, the Running Man Nebula may be less well-known. It can be found in the top-most part of Orion, in the \"sword.\" This is a reflection nebula in that it consists largely of clouds of interstellar gas that reflect the light of nearby stars. The nebula is relatively close to Earth, as celestial objects go, at 1,500 light-years away.</p></div><p><a href=\"https://arstechnica.com/?p=1981202#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1981202&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7201139eace29dfe2f04021c52abb312e6a83f1c8ea823a1f1b837a31fd95332","category":"Tech"}