{"title":"HashiCorp Vault Surpasses 100 Integrations with 75 Partners","link":"https://www.hashicorp.com/blog/hashicorp-vault-surpasses-100-integrations-with-75-partners","date":1634567400000,"content":"<img src=\"https://www.datocms-assets.com/2885/1634334557-vault-100-integrationsbanner.png\" /><p><a href=\"https://www.vaultproject.io/\">HashiCorp Vault</a>, the leader in identity-based security solutions and centralized secrets management, is used by some of the largest organizations in the world. Companies in many different industries rely on Vault to keep secrets and application data secure by driving zero trust security initiatives with a single workflow. At this year’s HashiConf Digital Partner Summit, HashiCorp is announcing that the Vault Integration Program has surpassed 100 integrations across 75 partners. The program has seen tremendous growth in recent years, growing 300% since 2019.</p>\n<h2><a href=\"#streamlining-security-workflows-for-business-critical-apps-and-systems\">»</a><a></a>Streamlining Security Workflows for Business-Critical Apps and Systems</h2>\n<p>The HashiCorp <a href=\"https://www.vaultproject.io/docs/partnerships\">Vault Integration Program</a>, which is designed to help software vendors integrate and support their offerings with Vault, offers organizations verified solutions so they can maintain consistent workflows and strengthen their security posture across their preferred technology stacks.</p>\n<p>Vault’s growing ecosystem supports out-of-the-box integrations for centralized secrets and key management for critical business systems and databases, streamlined authorization methods, and integrations with leading identity providers (IDPs) for identity-based security controls. For advanced security use cases that require organizations to have hardware-backed security modules, Vault seamlessly integrates with a variety of on-premises and cloud-based hardware security modules (HSMs) to meet regulatory compliance mandates. The result is improved productivity for security, DevOps, and business application teams without compromising security and productivity. Over the last year, in addition to deploying integrations with several new partners, Vault has deepened partnerships with leading companies such as F5, GitHub, MongoDB, RedHat, ServiceNow, Snowflake, and VMWare to support multiple integrations.</p>\n<p>As Burzin Patel, our VP of Global Alliances, explains, “It’s critical for organizations shifting applications to the cloud to streamline machine authorization and authentication across clouds, on-premises, and low-trust networks. Our ecosystem partners play an important role in delivering streamlined workflows for securing, storing and tightly controlling access to secrets and other sensitive data through Vault. The rapid growth of our Vault Integration Program is a testament to the growing need for automated workflows to make zero trust security a reality, and we are thrilled about the reception of HashiCorp across our partner ecosystem.”</p>\n<h2><a href=\"#rapidly-growing-ecosystem-for-hashicorp-cloud-platform\">»</a><a></a>Rapidly Growing Ecosystem for HashiCorp Cloud Platform</h2>\n<p>In April of 2021, HashiCorp launched Vault on the <a href=\"https://cloud.hashicorp.com/\">HashiCorp Cloud Platform</a> (HCP) on Amazon Web Services (AWS), a managed service that offers push-button deployment of centralized secrets management. As demand grows for managed security services that scale with growing infrastructure needs, HashiCorp partners have contributed to a rapidly growing ecosystem of supported integrations for HCP Vault. Since launch, partners like F5, GitHub, and Okta have validated their <a href=\"https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations\">integrations </a>on HCP Vault, and HashiCorp is delighted to see the ecosystem continue to expand.</p>\n<p>At the HashiConf Digital Partner Summit, HashiCorp is inviting partners to <a href=\"https://www.hashicorp.com/blog/github-f5-okta-among-new-hcp-vault-integrations\">join the roster of companies that have already</a> validated their integrations on HCP. Additionally, these partners have been issued our newly announced HCP Vault Verified badge, which will be displayed on the redesigned partner pages and available for these partners to use on their digital properties.</p><img src=\"https://www.datocms-assets.com/2885/1634334710-vault-integrator-badge.png\" /><h2><a href=\"#what-our-partners-are-saying\">»</a><a></a>What Our Partners Are Saying</h2>\n<p><strong>Aerospike</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/aerospike\">Aerospike’s Vault integrations</a> allow Vault to generate dynamic database credentials to manage and control access for database users as well as use Aerospike as a storage backend for Vault deployments.</p>\n<blockquote>\n<p>“HashiCorp is an important partner to Aerospike, and we currently have three integrations with Vault that streamline secrets management for joint customers leveraging our real-time NoSQL data platform. A key integration between Aerospike Database and Vault reduces the attack surface against malicious actors and leverages policies and credentials managed by Vault. Together we are helping our customers to lower the overhead needed to scale and secure database management.” — Srini Srinivasan, Chief Product Officer, Aerospike</p>\n</blockquote>\n<p><strong>Datadog</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/datadog\">Datadog’s Vault integration</a> monitors Vault activity and performs service checks to determine whether Vault is sealed or unsealed, if the server is unreachable, or if a server has not yet been initialized. The integration can also alert users when a new leader has been elected in a Vault cluster.</p>\n<blockquote>\n<p>“Datadog and HashiCorp have worked together to build integrations across Terraform, Vault, Nomad, Consul, and most recently we validated our Consul integration work with the HashiCorp Consul Service on Microsoft Azure. The Terraform Datadog Provider is a great example of our tight integration, and is among the most popular top providers used. Together we are enabling our customers to drive scale, monitoring, and infrastructure with code rather than sweat.” — Ilan Rabinovitch, Senior Vice President, Product, Datadog</p>\n</blockquote>\n<p><strong>F5</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/f5-networks\">F5’s Vault integration</a> automates certificate lifecycle management with Vault for applications anywhere (public cloud or private cloud) using a Vault agent and AS3 templating to update expiring certificates.</p>\n<blockquote>\n<p>“F5 and HashiCorp have delivered several jointly developed solutions to automate and simplify multi-cloud complexity through integrations that enable organizations to more seamlessly manage their application workloads and infrastructures across datacenter and multi-cloud environments.  \"The Vault integration with BIG-IP leverages automation and dynamic short-lived certificates to help break down silos and to improve our customers’ security posture. We look forward to a collaborative partnership as we continue developing solutions to help customers evolve their cloud architectures.” — Phil de la Motte, Vice President, Business Development, F5</p>\n</blockquote>\n<p><strong>GitHub</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/github\">GitHub’s Vault integration</a> authenticates into Vault using GitHub’s OIDC authentication feature or JWT Auth, which allows developers to use their GitHub identity to authenticate to Vault.</p>\n<blockquote>\n<p>“GitHub and HashiCorp have a longstanding partnership being driven by enterprise adoption of multi-cloud and their need to scale these environments. The GitHub platform integrates across the HashiCorp portfolio, allowing organizations to adopt a strong CI/CD workflow and increase developer velocity. GitHub and HashiCorp offer a common blueprint for consistent workflows for developers in multi-cloud environments adaptable to the needs of any enterprise. We look forward to our continued partnership to further deliver value to our joint customers.” — Jeremy Epling, Vice President of Product, GitHub</p>\n</blockquote>\n<p><strong>MongoDB</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/mongodb\">MongoDB’s Vault integration</a> allows Vault to generate dynamic database credentials to manage and control access for database users and API keys programmatically.</p>\n<blockquote>\n<p>“MongoDB Atlas has integrations for Terraform and Vault. We have partnered with HashiCorp and continue to work with them to extend and deepen these integrations based on customer needs. We’re really proud of the partnership and what we've accomplished. The close working relationship has resulted in the Terraform MongoDB Atlas Provider being one of the most popular providers available in the Terraform Registry. Additionally, among the integrations with Vault, MongoDB Atlas offers supported Vault plugins for database users and programmatic API keys. We look forward to continued work with HashiCorp to deliver best-in-class solutions for our joint customers.” — Andrew Davidson, Vice President, Cloud Products, MongoDB</p>\n</blockquote>\n<p><strong>Red Hat</strong></p>\n<p><a href=\"https://www.hashicorp.com/partners/tech/red-hat\">Vault’s Helm chart </a>is certified by Red Hat and supported on Red Hat OpenShift. Using the OpenShift console, users can leverage a repeatable process to get up and running with secret management on Kubernetes in just minutes.</p>\n<blockquote>\n<p>“Kubernetes-enabled software offers customers a broad range of applications and infrastructure to meet unique IT needs and support modern workloads. As the industry’s leading enterprise Kubernetes platform, Red Hat OpenShift is supported by a robust partner ecosystem to further enable cloud-native applications and container orchestration across hybrid cloud footprints. By collaborating with partners such as Hashicorp, we are able to offer customers greater flexibility, agility and scalability.” — Lars Herrmann, Vice President, Partner Ecosystems, Product &amp; Technologies, Red Hat</p>\n</blockquote>\n<h2><a href=\"#join-the-vault-integration-program\">»</a><a></a>Join the Vault Integration Program</h2>\n<p>To learn more about the <a href=\"https://www.vaultproject.io/docs/partnerships\">Vault Integration Program</a> and to apply to become a validated partner, please visit <a href=\"https://www.hashicorp.com/partners/become-a-partner#technology\">our Become a Partner</a> page.</p>","author":"Megan LaFlamme","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"72055636b5e89f0ef4cacdb27c9d7506c3fdc4fbd0fbe7af64a29b93a76c219e","category":"Tech"}