{"title":"Apple Vision Pro Likely to Launch in UK and Canada by End of 2024, Asia and Rest of Europe Soon After","link":"https://www.macrumors.com/2023/07/07/apple-vision-pro-launch-uk-canada-end-of-2024/","date":1688721998000,"content":"Apple's Vision Pro is set to launch in the United States early next year, and Apple is discussing the United Kingdom and Canada as two of the first international markets to get the mixed reality headset by the end of 2024, although \"a final decision hasn't been made,\" according to sources cited by <em>Bloomberg</em>'s Mark Gurman.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Vision-Pro-at-Steve-Jobs-Theater.jpeg\" alt width=\"1600\" height=\"900\" />\r<br />\nIn his <a href=\"https://www.bloomberg.com/news/articles/2023-07-07/apple-vision-pro-headset-to-launch-in-us-stores-by-appointment\">latest report</a>, Gurman says Apple is looking at bringing the Vision Pro to Europe and Asia soon after, with Apple engineers working to localize the device for France, Germany, Australia, China, Hong Kong, Japan, and Korea.\r<br />\n\r<br />\nApple will also sell the Vision Pro through its U.S. online store in early 2024 before expanding online elsewhere, according to the report.\r<br />\n\r<br />\nApple is said to be already preparing the retail launch of its Vision Pro headset in the U.S., with plans in place for special areas in stores where customers can become accustomed to the new $3,500 device. Most stores are initially expected to have only one to two demo units due to limited supply and the high cost of the devices, and Apple is expected to stock head bands and light seals in multiple different sizes. From the report:\r<br />\n<blockquote>The company will designate special areas in the stores with seating, headset demo units and tools to size accessories for buyers. While the device will be sold at all of Apple’s roughly 270 US locations, the company is planning the sections for the Vision Pro initially at stores in major areas — such as New York and Los Angeles — before rolling them out nationwide, according to people with knowledge of the plans.</blockquote>According to Gurman, Apple will ask in-store buyers to make an appointment to purchase the Vision Pro, similar to the strategy it used for the Apple Watch in 2015. During the appointment, staff will ensure the device is the correct fit for them, and users will be asked in advance for any ophthalmic prescriptions via an online portal so that the right lens inserts can be made available.\r<br />\n\r<br />\nApple is also said to be developing an iPhone app that scans a person's head, in addition to a physical machine that will calculate similar measurements. Online purchasers will also be asked to upload any eye prescription data and use the face scan app to work out the right accessory sizing, reports Gurman. \r<br />\n\r<br />\nApple does not anticipate partnering with third-party resellers to offer the Vision Pro until at least 2025, due to the complex supply chain logistics and staff training involved in handling the device and advising customers, adds the report.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/07/apple-vision-pro-launch-uk-canada-end-of-2024/\">Apple Vision Pro Likely to Launch in UK and Canada by End of 2024, Asia and Rest of Europe Soon After</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-likely-to-launch-in-uk-and-canada-by-end-of-2024-asia-and-rest-of-europe-soon-after.2395278/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"72087780e5dc8f3045f5dd439834254057e3769e1d98a16d065285cf5324b5d5","category":"Apple"}