{"title":"The distribution of global tidal marshes from Earth observation data","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13852?af=R","date":1721196440000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Tidal marsh ecosystems are heavily impacted by human activities, highlighting a pressing need to address gaps in our knowledge of their distribution. To better understand the global distribution and changes in tidal marsh extent, and identify opportunities for their conservation and restoration, it is critical to develop a spatial knowledge base of their global occurrence. Here, we develop a globally consistent tidal marsh distribution map for the year 2020 at 10-m resolution.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time period</h2>\n<p>2020.</p>\n<h2>Major taxa studied</h2>\n<p>Tidal marshes.</p>\n<h2>Methods</h2>\n<p>To map the location of the world's tidal marshes at 10-m resolution, we applied a random forest classification model to Earth observation data from the year 2020. We trained the classification model with a reference dataset developed to support distribution mapping of coastal ecosystems, and predicted the spatial distribution of tidal marshes between 60° N and 60° S. We validated the tidal marsh map using standard accuracy assessment methods, with our final map having an overall accuracy score of 0.85.</p>\n<h2>Results</h2>\n<p>We estimate the global extent of tidal marshes in 2020 to be 52,880 km<sup>2</sup> (95% CI: 32,030 to 59,780 km<sup>2</sup>) distributed across 120 countries and territories. Tidal marsh distribution is centred in temperate and Arctic regions, with nearly half of the global extent of tidal marshes occurring in the temperate Northern Atlantic (45%) region. At the national scale, over a third of the global extent (18,510 km<sup>2</sup>; CI: 11,200–20,900) occurs within the USA.</p>\n<h2>Main conclusions</h2>\n<p>Our analysis provides the most detailed spatial data on global tidal marsh distribution to date and shows that tidal marshes occur in more countries and across a greater proportion of the world's coastline than previous mapping studies. Our map fills a major knowledge gap regarding the distribution of the world's coastal ecosystems and provides the baseline needed for measuring changes in tidal marsh extent and estimating their value in terms of ecosystem services.</p>","author":"Thomas A. Worthington, \nMark Spalding, \nEmily Landis, \nTania L. Maxwell, \nAlejandro Navarro, \nLindsey S. Smart, \nNicholas J. Murray","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"720975d8cd699eaf3c02259b321cfc284615142c867e0cec06a153afc236a471","category":"Environment"}