{"title":"These incredibly useful Mac keyboard shortcuts will help you work faster and smarter","link":"https://www.macworld.com/article/233064/10-most-useful-macos-keyboard-shortcuts.html","date":1621411200000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>If you’re not using keyboard shortcuts on your Mac, you’re missing out on a big part of the reason why so many people love Apple’s desktop operating system. Thanks to Apple’s integration of hardware and software, you’ll rarely have to reach for your mouse or trackpad once you learn to speak the language of the keys.</p>\n\n\n\n<p>Whether you’re using Mojave or Big Sur, MacOS has many shortcuts, but there are a few that everyone should know. They start with that “⌘” symbol. That’s the Command key, and it’s the key to all the shortcuts listed here. It works kind of like the Control key on a Windows PC, except it’s in a handier spot—typically on both sides of the space bar. In the following examples, an example like “⌘+A” typically means you need to hold down the Command button and press A or press both at the same time.</p>\n\n\n\n<p>We’re not talking about super common shortcuts with related Windows counterparts—such as ⌘+A to select all, ⌘+C to copy, or ⌘+F open the Find prompt—but rather the ones that you may not be familiar with if you’re new to Mac. If these shortcuts get you hooked, you can even make your own for everything from the system to specific apps by going to <em>System</em> <em>Preferences </em>&gt; <em>Keyboard </em>&gt; <em>Shortcuts</em> and then choosing one of the options on the left. </p>\n\n\n\n<h2>Open the Spotlight search tool</h2>\n\n\n\n<p><strong>⌘+Space bar</strong>: This is probably the most useful shortcut of all. Whenever you want to find a file on your Mac, just tap this shortcut and type the name of the file you’d like the find in the prompt that pops up. The results are instant. Spotlight will also search through things like iMessages, bookmarks, and the full text of files on your hard drive. It’s also a quick way to find and open apps you don’t keep on your dock.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-spotlight.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Command+spacebar: It’ll change the way you work.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Immediately quit any app</h2>\n\n\n\n<p><strong>⌘+Q</strong>: Use this command to shut down any app immediately. This command doesn’t just minimize the app (as sometimes happens when you hit the red “X” button at the top of any Mac app)—it completely shuts it down.</p>\n\n\n\n<h2>Take screenshots or record the screen</h2>\n\n\n\n<p>As you can probably imagine, we use these shortcuts a lot here at Macworld. There are actually several ways you can take a screenshot on a Mac.</p>\n\n\n\n<p><strong>⌘+Shift+3</strong>: Screenshot the entire visible window. If you can see it on your Mac’s screen, it’ll show up in the screenshot.</p>\n\n\n\n<p><strong>⌘+Shift+4</strong>: Screenshot a specific area of the screen with the help of a rectangular cropping tool. This is the one I use the most, and it’s also great for sharing images or snippets of text on social media.</p>\n\n\n\n<p><strong>⌘+Shift+5:</strong> Beginning with macOS Mojave, Apple made it easy to see all the screenshot tools at once with this shortcut. Press it, and you’ll see a toolbar that gives you options for capturing the entire screen, capturing a specific window, or capturing a specific portion of a window. You can also use it to record either the entire screen or a portion of it and choose where to save the image or video file. (By default, screenshots save to the desktop.)</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-screenshot-toolbar.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>The toolbar for screenshots allows you to shoot specific areas of the screen,</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Hide apps instantly</h2>\n\n\n\n<p><strong>⌘+H</strong>: Here’s one for sneaky folks. If you’re looking at something you don’t want an approaching boss, parent, or friend to see, tap this shortcut and the active open window will vanish. To start using the app again, press the app’s icon on either the dock or the App Switcher.</p>\n\n\n\n<p>You can do this for <i>all</i> active apps by holding down ⌘+Option and pressing your mouse on any visible part of your desktop. Every app will “Hide.” It’s a great way to declutter your desktop. </p>\n\n\n\n<p>If you simply want to minimize an app, press ⌘+M, but its preview will still show up on the right side of your dock.</p>\n\n\n\n<h2>Quickly switch between active apps</h2>\n\n\n\n<p><strong>⌘+Tab</strong>: <i>Holding</i> ⌘ and then tapping Tab opens the App Switcher, which lets you easily switch between all active apps by tapping Tab until you land on the one you want.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-big-sur-app-switcher.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>Honestly, I tend to just click on apps from the dock, but many Mac users <em>love</em> this feature.</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Switch between different windows in an app</h2>\n\n\n\n<p><strong>⌘+~</strong>:This one makes research a heck of a lot easier. Let’s say you have two documents open from Apple’s Pages app: one with your notes and one with your draft. This shortcut lets you easily switch between the two (or more) documents. I find it’s particularly helpful if I’m working on a MacBook with a smaller screen where the split-view interface might feel too cramped.</p>\n\n\n\n<h2>Quickly access the search/address bar in Safari</h2>\n\n\n\n<p><strong>⌘+L</strong>: Reaching for your mouse to activate Safari’s search bar wastes a lot of time. Press this shortcut while you’re using Safari, and the cursor will jump up to the search bar, where you can type out either a search term or an URL. This shortcut also works with Google Chrome. (You can also use it on Windows with the Control key.)</p>\n\n\n\n<p>Safari has some other great keyboard shortcuts, too: <strong>⌘+T</strong> opens a new tab, and <strong>⌘+Z</strong> reopens the last tab you (possibly accidentally) closed. If you want to reopen an accidentally closed tab in Chrome or Opera, you can press <strong>⌘+Shift+T</strong>.</p>\n\n\n\n<h2>Force-quit an App</h2>\n\n\n\n<p><strong>⌘+Option+Q</strong>: If an app is locked up (and ⌘+Q isn’t working for whatever reason), use this shortcut to force the app to quit.</p>\n\n\n\n<p>You can also choose multiple apps to force-quit by pressing <strong>⌘+Option+Esc (Escape)</strong>, which is much like using Control-Alt+Delete on a PC. Instead of the Task Manager, though, you’ll get a window that says Force Quit Applications and you can choose which app you want to close from there.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/macos-big-sur-force-quit.jpg?quality=50&amp;strip=all&amp;w=1024\" /><figcaption><p>It’s also just a convenient way to shut down a lot of apps at once.</p>\n</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Immediately lock your Mac</h2>\n\n\n\n<p><strong>⌘+Control+Q</strong>: If you’re stepping away from your desk at home or the office and you don’t want someone snooping around on your Mac, press this shortcut and your Mac will immediately switch to the lock screen. It’s a heck of a lot faster than doing it through the menu bar.</p>\n\n\n\n<h2>Use Quick Look to preview files</h2>\n\n\n\n<p><strong>Click+Space Bar: </strong>If you want to see what a file looks like but you don’t want to waste time opening the associated app, select the file in a Finder folder and then press the space bar. (This also works with files on the desktop.) A full-page preview will pop up—and with Markup options, too. This works for everything from images and PDFs to Microsoft Excel files.</p>\n\n\n\n<p>You can also select multiple files to preview at once by holding down the Command key as you select them and then pressing <strong>⌘+Y</strong>. (⌘+Y also works for single files, but in that case it’s less convenient.) Once that window is open, you can navigate between the files with the arrow keys in the upper left.</p>\n\n\n\n<h2>Startup keyboard commands no longer work on M1 Macs</h2>\n\n\n\n<p>Apple has a set of keyboard commands you can use to make your Mac do certain tasks at startup. For example, if you want to <a href=\"https://www.macworld.com/article/224955/how-to-reset-a-macs-nvram-pram-and-smc.html\">zap the Mac’s NVRAM, reset the SMC</a>, or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/guide/mac-help/use-macos-recovery-on-an-intel-based-mac-mchl338cf9a8/mac&amp;xcust=1-1-233064-0-0-0&amp;sref=https://www.macworld.com/feed\">boot into Recovery mode</a>, there are keyboard combinations that you hold down while booting your Mac. </p>\n\n\n\n<p>Those keyboard combinations work only with Macs that use Intel processors. The new M1 Macs and upcoming Macs that have Apple silicon do not use these keyboard combinations. We have a <a href=\"https://www.macworld.com/article/340211/how-to-access-recovery-mode-safe-mode-and-other-boot-modes-on-an-m1-mac.html\">guide to help you find the troubleshooting modes on Apple silicon Macs</a>.</p>\n</div>","author":"Leif Johnson","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"720c4bb8c94ff50b2d7446bdc9c2fed30785677ab920e488e649bf10f9ff7584","category":"Apple"}