{"title":"Landscape influences on thermal sensitivity and predicted spatial variability among brook trout streams in the southeastern USA","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4305?af=R","date":1715639179000,"content":"<h2>Abstract</h2>\n<p>Warming water temperatures as a result of climate change pose a major threat to coldwater organisms. However, the rate of warming is not spatially uniform due to surface-ground-water interactions and stream and watershed characteristics. Coldwater habitats that are most resistant to warming serve as thermal refugia and identifying their locations is critical to regional aquatic conservation planning. We quantified the thermal sensitivity of 203 streams providing current and potential habitat for brook trout (<i>Salvelinus fontinalis</i>) across nearly 1000 linear km of their native range in the southern and central Appalachian Mountains region, USA, and characterized their spatial variability with landscape variables available in the National Hydrography Dataset. Using the Bayesian framework, we calculated the maximum slope of the logistic function relating paired weekly mean air temperature and stream temperature as an index of stream thermal sensitivity. Streams differed greatly in thermal sensitivity and those with more resistant water temperature regimes (i.e., thermal refugia) were consistently characterized by southerly latitudes and groundwater input. Landscape variables derived from a principal component analysis explained 16% of the variation in thermal sensitivity, indicating that the existing landscape variables were modestly successful in explaining spatial thermal heterogeneity. Using our model and spatial interpolation, we predicted thermal sensitivity at 8695 stream segments potentially suitable for brook trout in the study region. Thermal refugia were more common southward presumably due to higher elevations, but elsewhere they were also clustered at finer spatial scales. Our analysis informs prioritizing habitat conservation and restoration of this native salmonid and other aquatic organisms that depend on coldwater habitats in a warming world.</p>","author":"George P. Valentine, \nXinyi Lu, \nC. Andrew Dolloff, \nCraig N. Roghair, \nJacob M. Rash, \nMevin B. Hooten, \nYoichiro Kanno","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"72187cb62947956906993a543262057528b2212caec93e117711fd5ba41b7849","category":"Environment"}