{"title":"Latent Class Analysis: A Data Discovery Approach for Exploring Dietary Intake Patterns among Sudanese Children Aged 0 to 2","link":"https://www.preprints.org/manuscript/202406.0787/v1","date":1718184200000,"content":"Objective: To employ Latent Class Analysis (LCA) to investigate dietary intake patterns among Sudanese children aged 0 to 2 years and to examine the association of these patterns with sociodemographic factors.\nMethods: This study leveraged the Sudan Multiple Indicator Cluster Survey (MICS) 2014 data to uncover dietary intake patterns among 7,362 children using latent class analysis (LCA). We investigated class memberships concerning demographic and socioeconomic factors. The model's adequacy was determined using several fit indices, including BIC, AIC, entropy, CAIC, and SABIC, providing a holistic evaluation of the model's accuracy in capturing dietary behaviors.\nResults: Three latent classes were identified: Class 1 (55%) with an average nutrition composition, Class 2 (28%) with limited nutrition composition, and Class 3 (17%) with good nutrition composition. Significant associations were found between latent class membership and sociodemographic factors, particularly mother's education level and household wealth. The three-class solution provided the best balance between model fit and class distinction.\nConclusions: The LCA revealed distinct dietary intake patterns and underscored the influence of sociodemographic factors on child nutrition. The findings suggest that targeted nutritional interventions should be developed according to the specific needs of different latent classes. The study also highlights the utility of LCA as a robust statistical and machine learning tool in public health research, capable of informing tailored interventions and policies for improving child nutrition.\nImplications: The study emphasizes the importance of maternal education and socio-economic status in shaping dietary behaviors of children in Sudan. It implies the need for policies that address educational disparities, food security, and economic development as part of comprehensive nutritional interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"721981a66c65a3406a598244ff533b5156a8c493a0fd5fc8883b5f9c240b9c9f","category":"Interdisciplinary"}