{"title":"Wade Wilson is kidnapped by the TVA in Deadpool and Wolverine teaser","link":"https://arstechnica.com/?p=2002681","date":1707762587000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Wade Wilson (Ryan Reynolds), aka Deadpool, is back to save the MCU: \"I am Marvel Jesus.\" </p></div>\n<p>After some rather lackluster performances at the box office over the last year or so, Marvel Studios has scaled back its MCU offerings for 2024. We're getting just one: <a href=\"https://en.wikipedia.org/wiki/Deadpool_%26_Wolverine\"><em>Deadpool and Wolverine</em></a>. Maybe one is all we need. Marvel released a two-minute teaser during yesterday's Super Bowl. And if this is the future of the MCU, count us in. The teaser has already racked up more than 12 million views on YouTube, and deservedly so. It has the cheeky irreverence that made audiences embrace Ryan Reynold's R-rated superhero in the first place, plus a glimpse of Hugh Jackman's Wolverine—or rather, his distinctive shadow. And yes, Marvel is retaining that R rating—a big step given that all the prior MCU films have been resoundingly PG-13.</p>\n<p><strong>(Some spoilers for the first two films below.)</strong></p>\n<p>Reynolds famously made his first foray into big-screen superhero movies in 2011's <a href=\"https://en.wikipedia.org/wiki/Green_Lantern_(film)\"><em>The Green Lantern</em></a>, which was a box office disappointment and not especially good. But he found the perfect fit with 2016's <a href=\"https://en.wikipedia.org/wiki/Deadpool_(film)\"><em>Deadpool</em></a>, starring as Wade Wilson, a former Canadian special forces operative (dishonorably discharged) who develops regenerative healing powers that heal his cancer but leave him permanently disfigured with scars all over his body. Wade decides to become a masked vigilante, turning down an invitation to join the X-Men and abandon his bad-boy ways.</p></div><p><a href=\"https://arstechnica.com/?p=2002681#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2002681&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"721bfa1415ff3347128c02aaf0b262229e636e17436d674d910a5592aea080fa","category":"Tech"}