{"title":"Ensuring Operational Performance and Environmental Sustainability of Marine Diesel Engines through the Use of Biodiesel Fuel","link":"https://www.preprints.org/manuscript/202408.0004/v1","date":1722502636000,"content":"The article considers the issues of ensuring operational performance and environmental sustainability of marine diesel engines by using biodiesel fuel. The research was conducted on 5S60ME-C8 MAN-B&amp;W Diesel Group and 6DL-16 Daihatsu Diesel marine diesel engines, which were operated using RMG380 petroleum fuel and B10 and B30 biodiesel fuels. The efficiency of biofuel usage was assessed based on environmental (reduced nitrogen oxide concentration in exhaust gases) and economic (increased specific effective fuel consumption) criteria. It was found out that the use of B10 and B30 biofuels provides reduction of nitrogen oxides concentration in exhaust gases by 14.71–25.13 %, but at the same time increases specific effective fuel consumption by 1.55–6.01 %. Optimum fuel injection advance angles were determined that ensure the best thermal energy, economic and environmental performance of diesel engines. The optimum angle of biofuel supply advance is determined experimentally and should correspond to the limits recommended by the diesel engine operating instructions. It has been  proven experimentally that the use of biofuel increases the environmental sustainability of marine diesel engines by 13.75–29.42 %. It increases the diesel engines environmental safety in case of emergency situations, as well as accidental and short-term emissions of exhaust gases with an increased content of nitrogen oxides into the atmosphere - phenomena that are possible in starting modes of diesel engine operation, as well as in modes of sudden load changes. It is the increase in the environmental friendliness of marine diesel engines in the case of using biofuel that is the most positive criterion and contributes to the intensity of biofuel use in power plants of sea vessels.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"721c4472ed4e161059a7a3519a122d4421269df7b19e92408678140624ad4a50","category":"Interdisciplinary"}