{"title":"First evidence of marine turtle gastroliths in a fossil specimen: Paleobiological implications in comparison to modern analogues","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302889","date":1715004000000,"content":"<p>by Giovanni Serafini, Caleb M. Gordon, Jacopo Amalfitano, Oliver Wings, Nicole Esteban, Holly Stokes, Luca Giusberti</p>\r\n\r\nSemi-articulated remains of a large chelonioid turtle from the Turonian strata (Upper Cretaceous; ca. 93.9–89.8 Myr) near Sant’Anna d’Alfaedo (Verona province, northeastern Italy) are described for the first time. Together with the skeletal elements, the specimen also preserves pebbles inside the thoracic area which are lithologically distinct from the surrounding matrix. These allochthonous clasts are here interpreted as geo-gastroliths, in-life ingested stones that resided in the digestive tract of the animal. This interpretation marks the first reported evidence of geophagy in a fossil marine turtle. SEM-EDS analysis, together with macroscopic petrological characterization, confirm the presence of both siliceous and carbonatic pebbles. These putative geo-gastroliths have morphometries and size ranges more similar to those of gastroliths in different taxa (fossils and extant) than allochthonous “dropstone” clasts from the same deposit that were carried by floating vegetation A dense pitted pattern of superficial erosion is microscopically recognizable on the carbonatic gastroliths, consistent with surface etching due to gastric acids. The occurrence of a similar pattern was demonstrated by the experimental etching of carbonatic pebbles with synthetic gastric juice. Gut contents of modern green sea turtles (<i>Chelonia mydas</i>) were surveyed for substrate ingestion, providing direct evidence of geophagic behavior in extant chelonioids. Comparison with modern turtle dietary habits may suggests that the pebbles were ingested as a way to supplement calcium after or in preparation for egg deposition, implying that the studied specimen was possibly a gravid female.","author":"Giovanni Serafini","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7220f40dbe001d02d2e577850b8d81834de7474bdd9d219c99814a60a2fbefe4","category":"Interdisciplinary"}