{"title":"Hands-On With the New M3 Pro MacBook Pro","link":"https://www.macrumors.com/2023/11/07/m3-macbook-pro-hands-on/","date":1699394562000,"content":"MacBook Pro models with the M3 and M3 Pro chips are available starting today, and <em>MacRumors</em> videographer Dan Barbera was in New York so he popped over to the Grand Central station <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a> to pick up a new machine to demo to <em>MacRumors</em> readers.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nDan purchased the M3 Pro MacBook Pro, which is a model that hasn't gotten a lot of attention. Apple provided reviewers with new Macs equipped with M3 and M3 Max chips, but we've heard little about the new M3 Pro. For context, the M3 Pro has 150GB/s memory bandwidth, while the <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> Pro had 200GB/s.\r<br />\n\r<br />\nApple also tweaked the 12-core M3 Pro to have six performance cores and six efficiency cores rather than the eight performance cores and four efficiency cores the ‌M2‌ Pro chip has, which will impact overall performance. Dan's MacBook Pro is the 16-inch $2,499 version with a 12-core CPU, 18-core GPU, 18GB Unified Memory, and a 512GB SSD.\r<br />\n\r<br />\nOn Geekbench 6, the M3 Pro earned a single-core score of 3085 and a multi-core score of 15155. Comparatively, the 16-inch MacBook Pro with ‌M2‌ Pro chip that has a 12-core CPU and 19-core GPU earned a single core score of 2643 and a multi-core score of 14206.\r<br />\n\r<br />\nThe M3 Pro outperforms the ‌M2‌ Pro, but not by a lot. Single-core speed is up 16.7 percent, while multi-core speed is up 6.7 percent. Note that this is one benchmark result so there could be some variance, but it is in line with what we expected.\r<br />\n\r<br />\nGPU performance is nearly flat. The M3 Pro MacBook Pro earned an OpenCL score of 51093, while the equivalent ‌M2‌ Pro version had a score of 50302 for a difference of 1.6 percent.\r<br />\n\r<br />\nOther than the M3 chips, there's not much new with the MacBook Pro models. The M3 Pro and M3 Max come in a Space Black color, which is much darker than expected in person, and it is indeed resistant to fingerprints as Apple promised.\r<br />\n\r<br />\nThe only other new feature is a slight change to the brightness of the display, which is 600 nits for SDR content, up from 500 nits. You won't see any other changes, with the machine offering the same design and internal specs.\r<br />\n\r<br />\nWe'll have a video of the M3 Max MacBook Pro coming up in the future, as those machines will start delivering to customers later this week.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 14 &amp; 16\" </a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/07/m3-macbook-pro-hands-on/\">Hands-On With the New M3 Pro MacBook Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-new-m3-pro-macbook-pro.2410222/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7223680b1c44f1c03f42e3c5a85b2588af7be508480d76e627fec22ae3a515d5","category":"Apple"}