{"title":"Transcription factor CrWRKY42 coregulates chlorophyll degradation and carotenoid biosynthesis in citrus","link":"https://academic.oup.com/plphys/article/195/1/728/7613365?rss=1","date":1708646400000,"content":"<span><div>Abstract</div>Chlorophyll degradation and carotenoid biosynthesis, which occur almost simultaneously during fruit ripening, are essential for the coloration and nutritional value of fruits. However, the synergistic regulation of these 2 processes at the transcriptional level remains largely unknown. In this study, we identified a WRKY transcription factor, CrWRKY42, from the transcriptome data of the yellowish bud mutant “Jinlegan” ([<span>Citrus unshiu</span> × <span>C. sinensis</span>] × <span>C. reticulata</span>) tangor and its wild-type “Shiranui” tangor, which was involved in the transcriptional regulation of both chlorophyll degradation and carotenoid biosynthesis pathways. CrWRKY42 directly bound to the promoter of <span>β-carotene hydroxylase 1</span> (<span>CrBCH1</span>) and activated its expression. The overexpression and interference of <span>CrWRKY42</span> in citrus calli demonstrated that <span>CrWRKY42</span> promoted carotenoid accumulation by inducing the expression of multiple carotenoid biosynthetic genes. Further assays confirmed that CrWRKY42 also directly bound to and activated the promoters of the genes involved in carotenoid biosynthesis, including <span>phytoene desaturase</span> (<span>CrPDS</span>) and <span>lycopene β-cyclase 2</span> (<span>CrLCYB2</span>). In addition, CrWRKY42 could bind to the promoters of <span>NONYELLOW COLORING</span> (<span>CrNYC</span>) and <span>STAY-GREEN</span> (<span>CrSGR</span>) and activate their expression, thus promoting chlorophyll degradation. The overexpression and silencing of <span>CrWRKY42</span> in citrus fruits indicated that CrWRKY42 positively regulated chlorophyll degradation and carotenoid biosynthesis by synergistically activating the expression of genes involved in both pathways. Our data revealed that CrWRKY42 acts as a positive regulator of chlorophyll degradation and carotenoid biosynthesis to alter the conversion of citrus fruit color. Our findings provide insight into the complex transcriptional regulation of chlorophyll and carotenoid metabolism during fruit ripening.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"7228bceb3d7f491a859c8edd0c642e7e9681bcb4a0d59045efae684d90fe9bd5","category":"Environment"}