{"title":"2021 Philly Bike Expo: Bishop Bikes Columbus SLX/MAX Track Bike – jarrod bunk & john watson","link":"https://theradavist.com/2021/12/2021-philly-bike-expo-bishop-bikes-columbus-slx-max-track-bike/","date":1638363625000,"content":"<p>It wouldn’t be <a href=\"https://phillybikeexpo.com/\" target=\"_blank\">Philly Bike Expo</a> coverage without a <a href=\"https://bishopbikes.com/\" target=\"_blank\">Bishop Bikes</a> gallery and for 2021, photographer <a href=\"https://www.instagram.com/hopecyclery/?hl=en\" target=\"_blank\">Jarrod Bunk</a> selected this beautiful Columbus tubing track bike.</p>\n<p>Where do I even begin here? At first, I thought Chris brought back the <a href=\"https://theradavist.com/2013/02/2013-nahbs-bishop-raw-c-record-track/\" target=\"_blank\">2013 NAHBS track bike</a> I photographed, and then I thought it was <a href=\"https://theradavist.com/2013/02/2013-nahbs-bishop-bike-drillium-revival-track-bike/\" target=\"_blank\">his personal blue track bike</a>, stripped raw since it has the same Drillium Revival stem. Upon closer examination, this is true-to-form Chris Bishop doing his thing with the simplest form of bicycle. I just got off the phone with Chris Bishop where we spent a good forty-five minutes discussing this bike. There’s a lot going on with this “simple” machine so let’s get to it!<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-18.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><em>“Can you just clear coat my frame?” Every framebuilder has a customer ask this at some point and it’s a contentious subject with lots of opinions abound – even typing this, I know someone will interject their own opinion on the matter in the comments – but Chris is of the mindset that wet clear coats are not formulated to bond to raw metal. So, before we go any further, this is not a wet clear bike…</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-13.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>What this frame is coated with is clear Cerakote done by Todd at <a href=\"https://paintbytodd.com/\" target=\"_blank\">Paint by Todd</a> in Selinsgrove,PA. Todd has long painted bikes for various builders. For example, he used to paint Drew from Engin’s bikes. Todd and Chris Bishop discussed possibilities for this frame before the Philly Bike Expo, stating that <em>“it might work, or it might not work, but worst-case scenario, we’ll just stip the frame again and paint it.”</em></p>\n<p>In short, the only way to be 100% sure your frame will last for years is to paint it.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-4.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>About the frame. Chris has long built with Columbus SLX and MAX tubing but this frame is built with the all-new Omnicron SLX and MAX tubesets. The tubing is still rifled like the old SLX and it’s easier to work with and rides incredibly well. On a track bike, you need stiffness, moreso than other bikes I’d even argue, with tight clearances and direct power transfer of the utmost importance, a noodly track bike is counter to its intended use.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-10.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>That’s what Chris went with a 1 1/8″ front triangle, versus 1″. That extra 1/8″ in diameter makes the bike stiffer without adding a considerable weight penalty. The top tube is a Columbus Spirit tube, designed for traditional long point lugs to add just a bit more stiffness as well.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-6.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Chris thins his lugs and machines the seat tube cluster in house, making it into a sexy fastback design.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-11.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-12.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-32.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The fork is a Columbus MAX fork, hence the beefier blades. MAX and MX-L (Eddy Merckx’s proprietary MAX tubeset) are great additions to any traditional steel bike. The blades are robust but still offer a much more dampened ride when compared to carbon fork blades.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-30.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-33.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Earlier in this post, I mentioned I was confused as to when this frame was built. Back in 2013, I documented Chris’ <a href=\"https://theradavist.com/2013/02/2013-nahbs-bishop-bike-drillium-revival-track-bike/\" target=\"_blank\">personal track bike that featured this Drillium Revival Cinelli 2a track stem</a>, amongst other components. This stem is indeed from that bike.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-29.jpg?fit=1024,9999&amp;quality=75\" /> <img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-19.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Chris dug into his parts bin for the Campagnolo NR Pista hubs, Record cranks, but the wheels are hand-built by <a href=\"https://www.instagram.com/cutlassvelo/?hl=en\" target=\"_blank\">Cutlass Velo</a> using Astral rims with Shamal decals found on eBay. They’re wider than the traditional Shamal wheels and build up nicer too! Oh and that <a href=\"https://shop.44rn.com/\" target=\"_blank\">AARN Chainring</a> really ties the room together!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP-22.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>As for the geometry of the frame, protractor wizards will note the parallel angles of 75º and super short chainstays, measuring in at 384mm.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/PBE-2021-BISHOP.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Yep. Chris Bishop done diddit again for the Philly Bike Expo and once again, we’re stoked to be hosting not only his lovely bikes but Jarrod’s exceptional photos.</p>\n<p>The post <a href=\"https://theradavist.com/2021/12/2021-philly-bike-expo-bishop-bikes-columbus-slx-max-track-bike/\">2021 Philly Bike Expo: Bishop Bikes Columbus SLX/MAX Track Bike</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"72299ca11a22d0fb45bf49e728baf17ef164e1b915186ea876e8a764ac375bda","category":"Cycling"}