{"title":"Effects of different enzymatic hydrolysis techniques on volatile flavor compounds and nutritional metabolites of soybean meal yogurt","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13920?af=R","date":1727846901000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study explores enzymatic hydrolysis as a method of modifying soybean meal (SM). It can reduce the particle size, improve flavor, and convert macromolecules into absorbable nutrients. The purpose is to provide technical information regarding the use of SM. Papain alone, and a combination of papain and acid protease, and a mixture of papain, acid protease, and <i>Lactiplantibacillus plantarum</i> were employed for the enzymatic hydrolysis of SM.</p>\n<h2>RESULTS</h2>\n<p>Sensory evaluation and nutritional and flavor analyses were performed with yogurt produced after SM enzymatic hydrolysis. The enzymatic hydrolysis improved yogurt quality significantly in comparison with non-enzymatically hydrolyzed soybean meal yogurt (SMY) by accelerating the decrease in pH and shortening the duration of fermentation. Enzymatic hydrolysis also reduced beany flavors and bitterness and enhanced the aromatic compound, flavor-related amino acid, and organic acid content, rendering the yogurt more appealing to consumers. Microstructural analysis revealed favorable characteristics that textural and rheological properties of the yogurt produced after enzymatically hydrolyzed SM were improved.</p>\n<h2>CONCLUSION</h2>\n<p>In this study, the biotechnological approach was used to demonstrate the efficacy of enzymatic hydrolysis in improving the quality and value of SM, promoting the efficient application of SM in the food industry. © 2024 Society of Chemical Industry.</p>","author":"Yaxin Yan, \nXiangrong Fan, \nDong Hua, \nXiaoqing Liu, \nChunling Li, \nZixuan Li, \nMiao Bai, \nYaru Zhang, \nHe Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"722c8eb03bbdd52983b51af2fe7a89c41644116fcc41b91f339985eb63887e36","category":"Environment"}