{"title":"Induction of out‐of‐season spawning in an intensively reared walleye (Sander vitreus) broodstock","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.196?af=R","date":1720492777000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6974fe5c-b30b-4be0-b994-31ce4be97823/aff2196-gra-0001-m.png\" alt=\"Induction of out-of-season spawning in an intensively reared walleye (Sander vitreus) broodstock\" />\n<p>This study aimed to apply photothermal manipulations to three groups of walleye broodstock to induce out-of-season spawning and obtain a year-round supply of walleye eggs. We manipulated photothermal regimes for three groups of broodstock to induce spawning in February (early), April (in-season), and July (late-season). Our results suggest that early out-of-season spawning for walleye is possible but comes with tradeoffs of smaller egg size and lower larval survival.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The commercial viability of walleye (<i>Sander vitreus</i>) as an aquaculture species requires that walleye gametes are available year-round so that multiple cohorts of walleye can be brought to market throughout the year. This study aimed to apply photothermal manipulations to three groups of walleye broodstock to induce out-of-season spawning and obtain a year-round supply of fertilized walleye eggs. We manipulated photothermal regimes for three groups of broodstock to induce spawning in February (early), April (in-season), and July (late-season). In autumn, water temperatures were chilled to 8°C in all treatments. The duration of the chill period varied for each treatment with the early, in-season, and late treatments remaining chilled for 6, 18, and 30 weeks, respectively, before being warmed to induce spawning. Fecundity was significantly lower for late-season broodstock. Egg size and gonadosomatic index were significantly smaller in the early-season treatment. Fertilization success was similar for early and in-season treatments but was 0% for eggs from the late-season treatment. Larval survival was significantly lower for walleye from early-season broodstock. Our results suggest that early out-of-season spawning for walleye is possible but comes with tradeoffs of smaller egg size and lower larval survival.</p>","author":"Tyler J. Firkus, \nColton Branville, \nJared Neibauer, \nChristopher Hartleb, \nKendall Holmes, \nEmma Hauser, \nGregory Fischer","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"7239829af63f0d08f447c8705ec56d57a65fe0189652be4275176a3a931f8955","category":"Environment"}