{"title":"Spotlight: Arundel Sport bottle cage review","link":"https://cyclingtips.com/2021/05/spotlight-arundel-sport-bottle-cage-review/","date":1620002220000,"content":"<p>Arundel has long produced some of our <a href=\"https://cyclingtips.com/2019/06/the-best-bottle-cages-ct-recommends/\" target=\"_blank\">favourite bottle cages</a>. For me, the original <a href=\"https://cyclingtips.com/2019/11/ten-products-i-loved-in-2019-dave-rome/\" target=\"_blank\">Mandible Carbon</a> remains my pick of the bunch for its bottle-holding security, low weight, reliability, and versatile looks. Meanwhile, the <a href=\"https://cyclingtips.com/2016/12/ten-products-i-loved-in-2016-james-huang/\" target=\"_blank\">Dave-O</a> is the favourite of our Global Tech Editor James Huang for the same reasons. However, neither of these carbon cages are cheap. </p>\n\n\n\n<p>Enter the Mandible Sport, a nylon-reinforced plastic cage based on the Dave-O carbon cage. At 49 g, it’s 17 grams heavier than the Dave-O carbon. Similarly that material isn’t quite as rigid in its construction as the carbon version. But beyond those two sacrifices, it manages to tick just about every other box a good bottle cage should. </p>\n\n\n\n<p>The cage features two sets of mounting holes for extra control over placement height. And the one-piece construction also seems impressively durable with no rubber or similar to wear or get lost. The cage can certainly take a knock, too. </p>\n\n\n\n<p>Most importantly, the cage flexes to fit the bottle, providing rattle-free security without a death grip that can make sippy time tricky. We fitted these cages to a number of our test bikes at the recent <a href=\"https://cyclingtips.com/tag/2021-cyclingtips-road-bike-field-test/\" target=\"_blank\">Australian-based Field Test</a> and didn’t suffer a single ejected bottle – nor have I since. Meanwhile, the wide opening makes it easy to get the bottle into place. All of this is to say the cages are perfectly well suited to road, gravel and mountain bike use. </p>\n\n\n\n<p>My criticisms of this product are minimal but worth noting. The low-profile design requires the use of low-profile button head or similar bolts; otherwise your bottles are likely to get scratched up. </p>\n\n\n\n<p>Arundel offers the cage in red, yellow, green, powder blue, black, white, pink, and orange. All of these are singular colours, and in my opinion the coloured variants (black is great) can look quite cheap compared to other cages that take a dual-tone approach. Lastly, the pricing is perhaps a few dollars more than expected, but hey, it does work really well. </p>\n\n\n\n<p>Of course, the Arundel Sport is far from the only excellent-value plastic cage on the market. Others well deserving of mention include the Bontrager BAT (now made from recycled fishing nets), Specialized’s Rib Cage II, and the Elite Custom (great for the tarmac, but known to drop bottles when off-road). You can learn about these in our <a href=\"https://cyclingtips.com/2019/06/the-best-bottle-cages-ct-recommends/\" target=\"_blank\">favourite bottle cages feature article</a>. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Arundel-Sport-bottle-cage-review-cyclingtips-3-1340x754.jpg\" /><figcaption>The Arundel Sport is a basic cage that gets the basics right. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Arundel-Sport-bottle-cage-review-cyclingtips-4-1340x754.jpg\" /><figcaption>No fancy packaging here. In fact, the cages don’t even include bolts. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Arundel-Sport-bottle-cage-review-cyclingtips-1-1340x754.jpg\" /><figcaption>The Arundel Sport offers two sets of mounting holes, a feature that provides more adjustment than many other cages. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Arundel-Sport-bottle-cage-review-cyclingtips-2-1340x754.jpg\" /><figcaption>I quite like how the black cages look on most bikes. The colour options are a bit too much for me though. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Arundel-Sport-bottle-cage-review-cyclingtips-5-1340x754.jpg\" /><figcaption>The Arundel Sport against my beloved Arundel Mandible Carbon. You can buy four or five Sports for the cost of the carbon cage. </figcaption></figure></li></ul></figure>\n\n\n\n<p><strong>Price:</strong> US$19 / AU$18 (yes, the Australian pricing is surprising)<br /><strong>Weight:</strong> 49 g (47 g claimed)<br /><strong>More info:</strong> <a href=\"https://www.arundelbike.com/product/sport/\" target=\"_blank\">arundelbike.com</a></p>\n\n\n<p>    </p><div>\n    <div>\n\t<em>Follow the link to see previous products we’ve reviewed in our <a href=\"//cyclingtips.com/tag/spotlight/”\" target=\"“_blank”\">Spotlight series</a>.</em>    </div>\n    </div>\n\t<p></p>\n\n\n\n\n<p>The post <a href=\"https://cyclingtips.com/2021/05/spotlight-arundel-sport-bottle-cage-review/\">Spotlight: Arundel Sport bottle cage review</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"723a45177fb38b7114d52f6ccc0a8a156cd6d79a94d29fbc9f4ac1f77b232196","category":"Cycling"}