{"title":"Ming-Chi Kuo Says Apple’s AR/VR Headset Will Weigh Less Than 150 Grams","link":"https://9to5mac.com/2021/03/22/kuo-apple-headset-to-have-ultra-short-focal-length-lenses-and-weigh-less-than-150-grams/","date":1617059248000,"content":"\n<p>Filipe Espósito, writing for 9to5Mac:</p>\n\n<blockquote>\n  <p>As mentioned by Kuo, current virtual reality headsets typically\nweigh over 300 grams and have a bulky form factor, which is\nsomething Apple wants to solve for its own headset. Apple’s VR\ndevice is expected to adopt Fresnel’s hybrid ultra-short focal\nlength lens that have improved field of view, as well as reduced\nweight and thickness.</p>\n\n<p>The analyst believes that the new Apple-built headset will weigh\nless than 150 grams, which will be a big advantage when compared\nto similar devices that currently exist. The device will be\nequipped with lenses made of plastic instead of glass, which are\nlighter — but details about the durability of the material are\nunknown.</p>\n</blockquote>\n\n<p>Of course an Apple headset would be <em>much</em> lighter than the hardware currently on the market. That’s exactly the sort of thing Apple excels at. No flagship Android phone even approaches the size and weight of the iPhone 12 Mini. And there <a href=\"https://daringfireball.net/linked/2017/10/16/caldwell-smartwatches-women\">still</a> aren’t any serious rivals to Apple Watch that are anywhere near as small as the larger 44mm models, let alone the 40mm ones. (It’s debatable whether there are any serious rivals to Apple Watch, period, but that’s another topic.)</p>\n\n<p><strong>Update:</strong> Paraphrased question from a few readers: “<em>But what about AirPods Max, they’re heavier than most noise-cancelling headphones?</em>” That is a good counterexample, but it’s not like AirPods Max are the only AirPods, or even the mainstream AirPods. “Max”, in Apple parlance, is an excuse to be heavy: The Pro Max iPhone models are heavy phones.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/03/29/kuo-apple-headset\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"723dc36ae0796e01e693ad4c0b53c55ba247c84a0bee79b40d92707726a4ead5","category":"Tech"}