{"title":"Critérium du Dauphiné 2023 - contenders and prediction","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/criterium-du-dauphine-2023-contenders-and-prediction","date":1685706702000,"content":"\n      <p>The Critérium du Dauphiné dates back to 1947 and has become a crucial race for riders preparing for the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in July. Spanning eight days from Sunday June 4, 2023 until Sunday June 11, 2023, the Dauphiné provides valuable insight into the form of riders ahead of the upcoming Grand Tour, giving each of the Tour hopefuls an early chance to assess their competition. </p>\n<div></div>\n<p>This year's edition of the Dauphiné has a mixture of hilly and mountainous stages with a 31.1km-long individual time trial halfway through the race. Towards the end of the week the peloton tackles the Alps on stages seven and eight, both featuring over 4,000 metres of climbing.</p>\n<p>One rider is going into this race as a clear favourite to win, but there's nevertheless a stacked start list of riders who will all be looking to challenge him for the victory. We look at some of the favourites who could be in with the chance of taking the overall title at this year's Critérium du Dauphiné. </p>\n<h3><b>Jonas Vingegaard, Jumbo-Visma </b></h3>\n<p>Jonas Vingegaard will certainly be the favourite going into the week-long race having won the Tour de France in 2022 and given his strong form so far this season<span>. He also has previous form here, coming second in the Critérium du Dauphiné last year behind his teammate Primož Roglič, making it a one-two for Jumbo-Visma. </span>Vingegaard will be back in France in July, looking to defend his Tour title, and the Dauphiné will be his final test against some of his rivals before the Grand Départ. </p>\n\n<p><span>We've only caught small glimpses of the Danish rider's form so far this year. His most recent race was in early May at the Itzulia Basque Country where he dominated, claiming the overall victory and securing three stage wins. I</span>n his last race before that at Paris-Nice however, Vingegaard was faced with a stronger line-up featuring his key rival Tadej Pogačar (UAE Team Emirates). While Vingegaard beat Pogačar in the quest for yellow last year, the Slovenian was in exceptionally good form in the first part of the season and Vingegaard was no match for him at Paris-Nice.</p>\n<p><span>Since the Itzulia Basque Country, Vingegaard has been preparing for the upcoming races at <a href=\"https://3w2laoqdu9rstcyy-4052516910.shopifypreview.com/blogs/rouleur-performance/heading-high-to-peak-at-the-tour-de-france-the-theory-v-reality\">an altitude training camp</a>. While his primary focus is on defending his Tour title, the Critérium du Dauphiné will give an indication as to how well his preparation has been going and give insight into his current form. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-03452_31ce251e-e738-453a-8ab5-cf6353e48fb5.jpg?v=1685536049\" alt /></span><em><span>Jonas Vingegaard during the Tour de France </span></em> </p>\n<h3><b>Adam Yates, UAE Team Emirates</b></h3>\n<p>Since joining UAE Team Emirates at the beginning of the season, Adam Yates has proven that his decision to make the move from Ineos Grenadiers was a wise one. He kicked off his season with his new team at the UAE Tour, achieving a third-place finish overall and claiming a stage victory at the summit of Jebel Hafeet. While his performances at Tirreno-Adriatico and the Volta <span>a Catalunya didn't produce the same results, he bounced back a month later by securing the overall at the Tour of Romandie. </span></p>\n<p>Yates has experienced a mixed bag of results at the Critérium du Dauphiné in the past. He finished seventh in 2016, second in 2018, DNF in 2019, and 17th in 2020. He is a talented climber and should remain in the mix with the likes of Vingegaard in the high mountains, but it is the time trial stage that may hinder his chances at usurping Vingegaard to overall victory. Over his career, he's been inconsistent at producing results in an ITT, losing most of his time in these stages against his GC opponents. Yates will hope to produce a similar performance against the clock as he managed at Romandie last month (when he finished third), but he'll desperately want to avoid losing vital time to Vingegaard. </p>\n<h3>David Gaudu (Groupama-FDJ)</h3>\n<p>Frenchman David Gaudu is the only rider on the Dauphiné start list to have finished above Jonas Vingegaard in a GC competition since the 2022 Itzulia Basque Country. He managed that feat at Paris-Nice back in March, where he surprised everyone by taking the fight to winner Tadej Pogačar, eventually finishing 53 seconds down and 46 seconds ahead of Vingegaard.</p>\n<p>He'll be hoping he can replicate that form and get another one over on Vingegaard in one of his country's most prestigious races, but was quite summarily beaten the last time the two faced each other at Itzulia in April.</p>\n<p>Gaudu then looked well off the pace when it came to the Ardennes Classics, failing to finish any of them, but stage racing has been a much more fertile ground for him during his career. Should he have rediscovered the strength he showed in March, he should provide a proper test for Vingegaard when the race reaches the Alps. </p>\n<h3><b>Jai Hindley, Bora-Hansgrohe </b></h3>\n<p>Jai Hindley, the 2022 <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> winner, is set to make his debut at the Tour de France this year. But before that he will be racing in the Critérium du Dauphiné, where he'll be hoping to make his mark as a Tour contender. Like many of the other riders preparing for the upcoming races, Hindley has also been training at altitude since his last race Liège-Bastone-Liège back in May. </p>\n<p>The Australian has had a solid start to the season, delivering consistent performances with a number of top 20 finishes in both one-day races and stage races. His best placing so far in a stage race has been eighth at the Volta a Catalunya but outside of the Giro, Hindley has generally lacked podium places in shorter stage races. The main question will be if he can buck that trend be able to place on the podium here. Nevertheless, what we've learnt about the 27-year-old through his Giro exploits is that even if he doesn't finish well in the build-up, we shouldn't underestimate him at the Tour de France in a month's time. </p>\n<p><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/heading-high-to-peak-at-the-tour-de-france-the-theory-v-reality\"><em><strong>Read more: Heading high to peak at the Tour de France</strong></em></a></p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-06378.jpg?v=1685537005\" alt /></b><em>Jai Hindley racing in Tirreno-Adriatico </em></p>\n<h3><b>Daniel Martínez, Ineos Grenadiers </b></h3>\n<p>Daniel Martínez is the only rider lining up to this year's Critérium du Dauphiné that has won a previous edition. In 2020, the Colombian beat Thibaut Pinot, Tadej Pogačar and Guillaume Martin to first place after slowly making his way up the GC rankings over the shortened five-stage race. Since his win three years ago, Martínez has gone on to win Itzulia Basque Country in 2022 and the Volta ao Algarve this year. Going into this year's Critérium du Dauphiné, he'll need to display better performances than he did at Paris-Nice and Itzulia where he finished well adrift and didn't even feature in the GC fight.</p>\n<h3><b>Mikel Landa, Bahrain-Victorious</b></h3>\n<p>Mikel Landa came second behind Jonas Vingegaard at Itzulia Basque Country this year, putting in a consistent showing over his favoured terrain. Although he narrowly missed out on a stage win, Landa and his team will be bolstered by the fact he was one of the only riders to really come close to defeating Vingegaard head-to-head. The Basque has perhaps had one of his strongest ever starts to the season, finishing well within the top-10 of every stage race he's competed in so far and solidified his spring with third at La Flèche Wallonne.</p>\n<p>At the Dauphiné, Landa will be supported by a strong team, including Jack Haig and Wout Poels. It'll be in the high mountains later in the race that he'll look to really make the difference against everyone else, but like a lot of those featured in this list, the 31.1km time trial may scupper his hopes of pulling on yellow next week. Nevertheless, Landa be the one of the main challengers for Vingegaard to overcome, but it still feels an outside shot that he'll be able to turn podium placings into wins and finally land an overall victory in a WorldTour stage race.</p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-06676_33c24f8c-f46e-498e-b1e0-973243c99aa6.jpg?v=1685537207\" alt /></b><em>Mikel Linda during the 2023 Tirreno-Adriatico </em></p>\n<h3><b>Enric Mas, Movistar </b></h3>\n<p>Going into his fifth Tour de France, Enric Mas will be preparing in the same way he has since 2020, by riding the Dauphiné. However, the Movistar rider has had generally poor results in this race, finishing 20th in 2020, 11th in 2021 and not finishing last year.</p>\n<p>Much like his compatriot Landa, Mas has an impressive consistency to place highly when he wants to, having landed two second-place finishes at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, as well as a fifth and sixth place finishes at the Tour de France. Unlike Landa, Mas has won a WorldTour stage race, the Tour of Guangxi in 2019, but has not been able to accomplish that feat yet in Europe against tougher opposition and over much more testing terrain.</p>\n<p>The Spaniard has already sized himself up against the likes of Vingegaard, Landa, and Roglič in some of the earlier races this year, securing a top 10 in the overall at both Tirreno-Adriatico and Itzulia Basque Country. We'd expect to see Mas trouble the top-10 for the first time at the Dauphiné, but whether he'll be able to achieve a podium is another question. </p>\n<h3><b>Ben O’Connor, AG2R Citroën Team </b></h3>\n<p>Last year, Ben O'Connor showcased winning potential as he finished third behind Primož Roglič and Jonas Vingegaard at the Dauphiné. He was looking to be a key contender for the upcoming Tour after that impressive performance but his experience there was cut short due a crash in the early stages, leading to his withdrawal after stage nine. Nonetheless, he made a strong comeback a month later at the Vuelta, securing a top 10 finish. </p>\n<p>The Australian has had a low key start to the year and still has a lot to prove as a GC rider. Better suited to the climbs, the time trial may be his sticking point for a podium place. In the past two editions he's placed 13th and 14th on the ITT, and last year lost over a minute to eventual winner Roglič in a similarly distanced time trial to this year's. If he doesn't lose too much time against the clock, he may be able to make up the time in the mountains, but he'll have to try and limit any damage. </p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-06736.jpg?v=1685537374\" alt /></b><em>Ben O'Connor racing in Tirreno-Adriatico</em><b> </b></p>\n<h3><b>Other contenders</b></h3>\n<p><strong>Julian Alaphilippe</strong> (Soudal-Quick-Step) is a rider who will certainly bring excitement to the Critérium du Dauphiné he if he can recapture some of the sparkle he's been somewhat missing since his horrible crash at Liège-Bastogne-Liège last year. With two previous stage wins in this race, Alaphilippe will be motivated to add more victories, especially in front of his home crowd and in preparation for another possible stint in the yellow jersey at the Tour after it's Grand Départ in the Basque Country. </p>\n<p><strong>Richard Carapaz</strong> (EF Education-EasyPost) should be in contention for overall victory here but his start to life at EF Education-EasyPost has belied his ability so far. Wins in the Ecuadorian national road race and at this week's Mercan'Tour Classic Alpes-Maritimes one-day race indicates he's still packing his trademark punch, but a rough start to stage racing this year means he's an unknown quantity entering the Dauphiné.<b><br /></b></p>\n<p><strong>Ethan Hayter</strong> (Ineos Grenadiers) could be in with a chance of a stage victory while his teammate <strong>Egan Bernal </strong>may be eyeing a second WorldTour GC top 10 as he continues his <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/egan-bernal-its-about-character-not-the-numbers\">recovery from extensive injuries</a>. Bernal and Ineos will keep expectations tempered heading into the race, but top 10 finishes at Romandie and the Tour de Hongrie show the 26-year-old is on the up.</p>\n<p>For Movistar, <strong>Matteo Jorgenson</strong> could be another contender. The American came second behind Yates at the Tour de Romandie this year, beating the UAE Team Emirates rider in the time trial. Trek-Segafredo rider <strong>Giulio Ciccone</strong> could also be a rider in with a chance of a stage win, especially during stage seven and eight, as well as a decent overall placing.</p>\n<p><span>While the Critérium du Dauphiné is renowned for its challenging climbs, this year's race offers relatively little in the way of fast finishes. Still, sprinters such as</span> <strong>Sam Bennett</strong> (Bora-Hansgrohe) and <strong>Dylan Groenewegen</strong> (Jayco-Alula) have turned up to search for some climbing legs before the Tour, but may find the lumpy finishes are better suited to more versatile fast finishers like Hayter, <strong>Ethan Vernon</strong> (Soudal-Quick-Step), or <strong>Christophe Laporte</strong> (Jumbo-Visma).</p>\n<h3><b>Prediction </b></h3>\n<p>We think that <strong>Jonas Vingegaard</strong> will secure the general classification title for Jumbo-Visma for a second year running. He's proven to be on winning form so far this season, and in a ruthless dominant fashion in some cases, so we expect to see him on top of the podium at the end of the week. </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"723d22aa2a7dab63148403aeac19d0e7db55af67b6dc72cc84deab146b2e073f","category":"Cycling"}