{"title":"Apple Maps Redesign Expands to Austria, Croatia, Czechia, Hungary, Poland, and Slovenia","link":"https://www.macrumors.com/2023/04/07/apple-maps-redesign-expands-6-countries/","date":1680856138000,"content":"Apple today <a href=\"https://www.apple.com/hr/newsroom/2023/04/apple-brings-new-map-to-austria-croatia-czechia-hungary-poland-and-slovenia/\">announced</a> that its revamped Maps app is rolling out across Austria, Croatia, Czechia, Hungary, Poland, and Slovenia. The new experience provides more detailed road coverage, better navigation, custom-designed 3D models of popular landmarks, Flyover, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/Apple-Maps-update-hero.jpg\" alt width=\"1960\" height=\"1102\" />\r<br />\nMaps can also help drivers in Austria, Czechia, Hungary, and Poland with certain electric vehicles plan trips that include appropriate stops for charging by analyzing elevation changes and other factors along a route. Meanwhile, transit riders in Austria, Croatia, Czechia, Hungary, Poland, and Slovenia can find nearby stations more easily and pin favorite lines. Riders will also receive notifications when it’s time to get off at their stop.\r<br />\n\r<br />\nLook Around is also expanding to all of these countries starting today, offering high-resolution street-level imagery in the Maps app. The feature is similar to Google's Street View, but with smoother transitions when panning and zooming.\r<br />\n\r<br />\nAs noted by <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a> expert <a href=\"https://www.justinobeirne.com/new-apple-maps-expansion-18\">Juston O'Beirne</a>, this is the eighteenth time that Apple has expanded its new map data since its public launch in September 2018. It has expanded to the U.K., Ireland, Canada, Spain, Portugal, Italy, Australia, New Zealand, Singapore, France, Germany, and select other countries and territories.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/07/apple-maps-redesign-expands-6-countries/\">Apple Maps Redesign Expands to Austria, Croatia, Czechia, Hungary, Poland, and Slovenia</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-maps-redesign-expands-to-austria-croatia-czechia-hungary-poland-and-slovenia.2386145/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"72420cc863946c458b134b4ba85d1377feb7ff2b32ecfaf36ca3b533df13d45a","category":"Apple"}