{"title":"What NASA wants to see from SpaceX’s second Starship test flight","link":"https://arstechnica.com/?p=1984906","date":1700260951000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/F_EPRK4akAA1Pme-800x533.jpeg\" alt=\"SpaceX's Starship rocket on a launch pad in Texas awaiting liftoff on a test flight.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/F_EPRK4akAA1Pme.jpeg\">Enlarge</a> <span>/</span> SpaceX's Starship rocket on a launch pad in Texas awaiting liftoff on a test flight. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>NASA managers are in South Texas this weekend as SpaceX prepares to launch its second full-sized Starship rocket. If the rocket flies perfectly, it will unlock additional tests beginning as soon as next year to prove that SpaceX can transfer hundreds of tons of super-chilled methane and liquid oxygen between two spaceships in orbit.</p>\n<p>This is a fundamental part of the architecture SpaceX has designed to fly Starship missions beyond low-Earth orbit. With two NASA fixed-price contracts valued at more than $4 billion, SpaceX is on the hook to develop and fly two human-rated lunar landers based on the Starship design (and likely many more missions, assuming these first two work as advertised).</p>\n<p>Depending on who you ask, SpaceX may need to launch a dozen or more refueling tankers to fill up the methane and liquid oxygen tanks on the Starship lunar lander, which will have emptied its tanks just to get into low-Earth orbit following launch on top of a Super Heavy booster. The Starship lander will use this fuel to boost itself out of low-Earth orbit toward the Moon, descend to the lunar surface with astronauts, and climb back into space to deliver the crew to their Earth return vehicle—an Orion spacecraft.</p></div><p><a href=\"https://arstechnica.com/?p=1984906#p3\">Read 46 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1984906&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7243086db7f57574fe0dd00787b97aa25ded6dc23a810c7e1fc7429a799d2a00","category":"Tech"}