{"title":"กลุ่มบริษัทอิออนธนสินทรัพย์ เพิ่มศักยภาพธุรกิจพร้อมขับเคลื่อนสู่องค์กรดิจิทัลด้วย SAP S/4HANA จาก IT One","link":"https://www.blognone.com/node/133205","date":1680492600000,"content":"<div><div><div><p><strong>กรุงเทพฯ – 27 มีนาคม 2566 –  ไอทีวัน (IT One)</strong> ผู้ให้บริการด้านไอทีและดิจิทัลโซลูชันครบวงจร ครอบคลุมทั้งด้านดิจิทัล คลาวด์ และระบบรักษาความปลอดภัย ได้รับความไว้วางใจจาก  บมจ.อิออนธนสินทรัพย์  ให้เป็นที่ปรึกษาในโครงการ SAP S/4 HANA ให้แก่กลุ่มบมจ.อิออนธนสินทรัพย์  เพื่อยกระดับในระบบการบริหารจัดการทรัพยากรองค์กร  ด้วย SAP S/4HANA เวอร์ชั่นใหม่ที่ตอบโจทย์ในการใช้ข้อมูลเข้ามาเป็นส่วนสำคัญในการขับเคลื่อนธุรกิจขององค์กร เพื่อเพิ่มประสิทธิภาพในการทำงานและขีดความสามารถในการแข่งขัน</p>\n<p><img alt=\"alt=&quot;enter image description here&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/a23d4249c94e3da827519ee1837e5e58.jpg\" /></p>\n<p><img alt=\"alt=&quot;enter image description here&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/b105126b99d3018137e5aa640fa18ed9.jpg\" /></p>\n<p><strong><em>นางสาวนพนิดา สุขจิระ – เจ้าหน้าที่ฝ่ายบริหาร บริษัท ไอทีวัน จำกัด</em></strong></p>\n<p></p>\n<p><strong>นางสาวนพนิดา สุขจิระ - เจ้าหน้าที่ฝ่ายบริหาร บริษัท ไอทีวัน จำกัด</strong>  กล่าวว่า “ในยุคปัจจุบันที่ธุรกิจการเงินเข้าถึงผู้คนได้ด้วยปลายนิ้ว ข้อมูลที่ถูกต้อง มีความปลอดภัย และความรวดเร็วกลายเป็นปัจจัยที่จะช่วยสร้างแต้มต่อทางธุรกิจ และเพิ่มความสามารถในการแข่งขันให้ตอบรับกับโลกการเงินที่เปลี่ยนแปลงรวดเร็ว ไอทีวัน ได้นำเสนอ SAP S/4HANA ซึ่งเป็นเทคโนโลยีเวอร์ชั่นใหม่ให้กับ 10 บริษัทในกลุ่มของ AEON Financial Service ครอบคลุมทั้งในประเทศไทยและในต่างประเทศ ได้แก่ ประเทศกัมพูชา เมียนมา เวียดนาม และลาว ในการเข้ามาช่วยปรับระบบการจัดการ ปรับปรุงโครงสร้างข้อมูลให้สามารถทำงานร่วมกันได้อย่างราบรื่นและเป็นมาตรฐานเดียวกันทั้งกลุ่ม ซึ่งจะช่วยให้ธุรกิจมองเห็นภาพรวมที่ชัดเจนและวางแผนได้อย่างมีประสิทธิภาพ รวมทั้งสามารถวิเคราะห์ข้อมูลเชิงลึกเพื่อช่วยในการตัดสินใจทางธุรกิจได้รวดเร็วมากยิ่งขึ้นอีกด้วย”</p>\n<p>สำหรับความท้าทายของโปรเจกต์นี้ คือ การปรับกระบวนการทำงานของบริษัททั้ง 10 แห่ง ให้อยู่ในรูปแบบที่เป็นมาตรฐานเดียวกัน เพื่อช่วยให้การรวบรวมข้อมูลและการประมวลผลเมื่อต้องการเห็นภาพรวมของทั้งองค์กรทำได้ง่ายขึ้น รวมถึงการสร้างมาตรฐานการทำงานใหม่ร่วมกัน เพื่อเพิ่มประสิทธิภาพ และความฉับไวในการทำงานให้มากยิ่งขึ้น</p>\n<p><img alt=\"alt=&quot;enter image description here&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/b09b3b13108b5b32344fb36b26ec86d6.jpg\" /></p>\n<p><strong><em>นายพรธเนศร์ แซ่โค้ว – ผู้จัดการโครงการ บริษัท ไอทีวัน จำกัด</em></strong></p>\n<p><strong>นายพรธเนศร์ แซ่โค้ว – ผู้จัดการโครงการ บริษัท ไอทีวัน จำกัด</strong>  กล่าวเสริมว่า “การพัฒนาและติดตั้งตัวระบบ SAP S/4HANA เวอร์ชั่นใหม่นี้ได้เข้ามาช่วยอัปเกรดระบบของอิออนธนสินทรัพย์ ที่จากเดิมทำงานอยู่บนระบบ ERP SAP ECC 6.0 ให้สอดคล้องกับฟังกชั่นที่ทางอิออนฯ ใช้งานอยู่ในปัจจุบัน ซึ่งประกอบด้วย</p>\n<p>1.<strong>Finance</strong> โดยครอบคลุมทั้ง 3 ระบบ ได้แก่ 1. ระบบบัญชี ซึ่งดูแลในเรื่องของการบันทึกข้อมูลทางบัญชี 2. ระบบควบคุมต้นทุน ซึ่งช่วยในเรื่องของการควบคุมดูแลทั้งในแง่ของต้นทุนและผลกำไร รวมถึงการสร้างรายงานเพื่อวิเคราะห์ผลดำเนินการในมุมมองต่างๆ และ 3. ระบบงานที่ใช้ในการบันทึกข้อมูลรายการทางการเงินโดยละเอียด เพื่อจัดเก็บข้อมูลการบริหารจัดการเครื่องมือทางการเงิน ซึ่งจะเข้ามาสนับสนุนการทำงานเกี่ยวกับการทำสัญญา ทั้งด้านการกู้ยืมเงิน รวมถึงธุรกรรมทางการเงินที่ป้องกันความเสี่ยงจากอัตราดอกเบี้ย</p>\n<p>2.<strong>Sourcing and Procurement</strong> โดยครอบคลุม ระบบจัดซื้อและจัดการวัสดุคงคลัง โดยระบบนี้จะช่วยอำนวยความสะดวกในกระบวนการจัดซื้อและการจัดการสินค้าคงคลังสำหรับของพรีเมี่ยมและอุปกรณ์สำนักงาน”</p>\n<p><img alt=\"alt=&quot;enter image description here&quot;\" src=\"https://www.blognone.com/sites/default/files/externals/d155b51ba06f44a3cf0f0be5a53906f3.png\" /></p>\n<p><strong><em>Mr. Kazumasa Oshima  - Chief Financial Officer &amp; Director, AEON Thana Sinsap (Thailand) Public Co. Ltd.</em></strong></p>\n<p><strong>Mr. Kazumasa Oshima  - Chief Financial Officer &amp; Director, AEON Thana Sinsap (Thailand) Public Co. Ltd.</strong> กล่าวว่า “ความคาดหวังของลูกค้านั้น มีแนวโน้มเพิ่มขึ้นมากอย่างต่อเนื่อง และต้องการเลือกบริการทางการเงินที่ตรงกับความต้องการมากที่สุด ซึ่งดิจิทัลทรานส์ฟอร์เมชันเป็นปัจจัยสำคัญที่ทำให้บริษัทเดินหน้าได้ต่อเนื่อง ไม่เพียงแต่ระบบงานส่วนหน้าที่ต้องยกระดับ แต่รวมถึงระบบงานภายในด้วย เพื่อให้การดำเนินงานมีประสิทธิภาพมากที่สุด และผู้บริหารสามารถตัดสินใจได้อย่างทันท่วงที ระบบ SAP S/4HANA เวอร์ชั่นใหม่จึงเป็นกุญแจในการเปลี่ยนผ่านระบบงานภายในสู่ดิจิทัล ช่วยให้องค์กรมีมุมมองเชิงวิเคราะห์ทางธุรกิจที่ชัดเจนและละเอียดมากขึ้น พร้อมทั้งสามารถจัดการกับข้อมูลขนาดใหญ่ได้ภายในไม่กี่วินาที ซึ่ง SAP S/4HANA เวอร์ชั่นใหม่นี้ไม่ได้มีแค่ขีดความสามารถที่โดดเด่น แต่เสถียรภาพของระบบก็โดดเด่นด้วย เพราะเรานำระบบนี้ไปใช้กับบริษัท 10 แห่งในประเทศต่างๆ พร้อมกัน โดยเปลี่ยนจากระบบที่ติดตั้งในองค์กรไปอยู่บนคลาวด์ ซึ่งเป็นระบบที่ช่วยสนับสนุนให้องค์กรพร้อมก้าวสู่ทศวรรษใหม่ได้เป็นอย่างดี”</p>\n<p>“สิ่งสำคัญในการเลือกใช้เทคโนโลยี คือ จะต้องสามารถพัฒนาให้เทคโนโลยีเข้ามาช่วยตอบโจทย์ความท้าทายขององค์กรให้ได้ ไม่ว่าจะเป็นเรื่องการบริหารต้นทุน การเพิ่มประสิทธิภาพการทำงาน ปรับขั้นตอนการทำงาน หรืออื่นๆ ก็ตาม ซึ่งด้วยความเชี่ยวชาญและประสบการณ์ของไอทีวัน เราได้นำเทคโนโลยีและกระบวนการทำงาน มาประสานร่วมกันได้อย่างมีประสิทธิภาพ เพื่อให้เกิดประโยชน์สูงสุด และสร้างการเติบโตที่ยั่งยืนให้กับลูกค้ากลุ่ม AEON Financial Service” <strong>นางสาวนพนิดา</strong> กล่าวทิ้งท้าย</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/it-one\">IT One</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7249c9fc5fd14c03901a5dcfadf553436ad0c27d0c6bafb353dbdd999fcfcb19","category":"Thai"}