{"title":"Integrated chronic care models for people with comorbid of HIV and non-communicable diseases in Sub-Saharan Africa: A scoping review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299904","date":1710511200000,"content":"<p>by Rumbidzai Chireshe, Tawanda Manyangadze, Keshena Naidoo</p>\r\nBackground <p>Integrated health care is an approach characterized by a high degree of collaboration and communication among health professionals. Integration of HIV/NCD is recommended to enhance the quality of healthcare services being provided. Duplication of limited resources is minimized, and a holistic care approach is promoted by shifting from acute and reactive care to care that embraces patient-centredness that includes promotive health and disease surveillance. The high burden of HIV disease in sub-Saharan Africa (SSA) combined with the increasing prevalence of chronic non-communicable diseases (NCDs) necessitates a review of how health systems has been doing to deliver quality integrated care for people living with HIV (PLWH) and comorbid chronic NCDs.</p> Methods <p>A scoping review was conducted to identify and describe all publications on integrated chronic care management models at the primary care level in the SSA context, particularly those that addressed the care of PLHIV with co-morbid chronic NCDs. The inclusion and exclusion criteria were applied, and duplicates were removed.</p> Results <p>A total of twenty-one articles were included in the final review. Integrated healthcare systems were reported in only eight SSA countries–(South Africa, Uganda, Kenya, the United Republic of Tanzania, Zambia, Malawi, Zimbabwe and Swaziland). Integrated care systems adopted one of three health models. These included added-on NCD services to previously dedicated HIV care facilities, expansion of primary care facilities to include HIV care and establishment of integrated care services. Short-term benefits included staff capacitation, improved retention of patients and improved screening and detection of NCDs. However, the expansion of existing services resulted in an increased workload with no additional staff. A significant positive change noted by communities was that there was less or no stigmatisation of people living with HIV when attending dedicated HIV clinics.</p> Conclusion <p>Evidence of integrated healthcare services for PLWH and co-morbid of NCDs in SSA is scanty. Data on some short-term benefits of integrated care was available, but evidence was absent on the long-term outcomes. Randomized clinical trials with clearly defined comparator groups and standardized measures of HIV and NCD outcomes are needed to demonstrate non-inferiority of integrated against non-integrated care.</p>","author":"Rumbidzai Chireshe","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7250dc7b65821f177597d725d31b17d275a485ac74ae993d1a453ba42a3b0b37","category":"Interdisciplinary"}