{"title":"Meta Acquired a Neural Interface Startup in 2019","link":"https://www.theverge.com/2019/9/23/20881032/facebook-ctrl-labs-acquisition-neural-interface-armband-ar-vr-deal","date":1708107747000,"content":"\n<p>Nick Statt, reporting for The Verge in September 2019:</p>\n\n<blockquote>\n  <p>Facebook today announced that it will acquire <a href=\"https://www.theverge.com/2018/6/6/17433516/ctrl-labs-brain-computer-interface-armband-hands-on-preview\">neural interface \nstartup CTRL-Labs</a>, a company that makes a wristband \ncapable of transmitting electrical signals from the brain into \ncomputer input. </p>\n\n<p>The deal, which <a href=\"https://www.bloomberg.com/news/articles/2019-09-23/facebook-to-buy-startup-for-controlling-computers-with-your-mind\">Bloomberg reports</a> is worth somewhere \nbetween $500 million and $1 billion, is the most substantial \nacquisition Facebook has made in the last half decade, since it \n<a href=\"https://www.theverge.com/2014/3/25/5547456/facebook-buying-oculus-for-2-billion\">paid $2 billion to acquire virtual reality company Oculus VR in \n2014</a>. </p>\n</blockquote>\n\n<p>I don’t remember noting this acquisition at the time, but a friend reminded me of it the other day after <a href=\"https://daringfireball.net/linked/2024/02/14/zuckerberg-vision-pro\">my sort-of “<em>Whoa, what?!</em>” reaction</a> to Mark Zuckerberg just casually suggesting that hand-tracking might be merely a stopgap interface for XR headsets until we have “neural interfaces”.</p>\n\n<p>From that same Verge report:</p>\n\n<blockquote>\n  <p>Bosworth says CTRL-Labs, which was co-founded by Internet Explorer \ncreator and neuroscientist Thomas Reardon, “will be joining our \nFacebook Reality Labs team where we hope to build this kind of \ntechnology, at scale, and get it into consumer products faster.” </p>\n\n<p>Patrick Kaifosh is CTRL-Labs’ other co-founder, and he is also a \nneuroscientist. Reardon, the company’s CEO, left his career in \nsoftware engineering to study neuroscience and received his PhD \nin 2016. </p>\n</blockquote>\n\n<p>That’s quite the second career for Reardon. If I recall correctly, Internet Explorer was fairly popular at one time.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/02/16/meta-neural-interface\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7251c8b065ce62055db9ce44d24ec74f3a6957ab24c569335890fb60f5feaa40","category":"Tech"}