{"title":"Severe Obesity Defined by Percentiles of WHO and Cardiometabolic Risk in Youth with Obesity","link":"https://www.preprints.org/manuscript/202409.1940/v1","date":1727252755000,"content":"Background/Objectives: The pediatric definition of severe obesity (OB) depends on the body mass index (BMI) references. We evaluated different BMI derived metrics of the World Health Organization (WHO) system to define which cut-off is associated with the highest cardiometabolic risk (CMR); Methods: In this multicentric study data were obtained by 3727 youths (1937 boys; 2225 children, 1502 adolescents. severe OB was defined as BMI &amp;gt;99th percentile (BMI99), BMI97 ≥120% or BMI Z-score &amp;gt; 3 (WHO tables). The continuous CMR Z-score (sum of residual standardized for age and sex of waist-to-height ratio, systolic and diastolic blood pressure, triglycerides, and HDL-Cholesterol x -1) and the cluster of at least two CMR factors (hypertension, high triglycerides, low HDL-Cholesterol and high waist-to-height ratio) were calculated; Results: Continuous CMR Z-score was significantly higher both in children or adolescents with severe OB defined by 120% BMI97 compared to BMI &amp;gt;99th (p &amp;lt;0.0001), while it was lower only in adolescents with severe OB defined by 120% BMI97 compared to BMI Z-score &amp;gt;3 (p &amp;lt;0.0001). Compared to BMI97 ≥120%, BMI Z-score &amp;gt;3 had higher specificity, but lower sensitivity in identifying children and adolescents with clustered CMR factors; Conclusions: The definition of severe OB based on BMI97 ≥120% is superior to BMI99 but it is inferior to BMI Z score &amp;gt;3 as far as the association between severe OB and CMR factors is concerned. Pediatricians should take into consideration the implications of the use of different BMI metrics in those countries that recommend the WHO system.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"72512449a338f04449caecd7a228578a0a721d3b60e70979573923efa5a47478","category":"Interdisciplinary"}