{"title":"Vintage Pinot is pure heart in his final Giro d’Italia","link":"https://www.cyclist.co.uk/in-depth/thibaut-pinot-giro-ditalia","date":1684517031000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/thibaut-pinot-giro-ditalia\">Vintage Pinot is pure heart in his final Giro d’Italia</a></p>\n\n<p>Even in a sleeveless shirt we would still be able to see the heart Thibaut Pinot so valiantly wears on his sleeve. Not an ounce of emotion is ever shielded from view. Everything is displayed on the road. We witnessed that today.</p>\n\n\n\n<p>Stage 13 of the <a href=\"https://www.cyclist.co.uk/in-depth/giro-ditalia-watch-live-stages-route-riders-teams-start-list\" target=\"_blank\">Giro d’Italia</a>, its route cut down due to inclement weather, bypassed the Great St. Bernard Pass and began in Le Châble, at the foot of the <a href=\"https://www.cyclist.co.uk/in-depth/switzerland-croix-de-coeur-cycling\" target=\"_blank\">Croix de Coeur</a>. Groupama-FDJ’s Pinot made his way into the leading group and there he stayed. The dogged determination that so many have come to know and love from the frequently romanticised Frenchman was on display.  </p>\n\n\n\n<p>It was painfully obvious how hard Pinot was riding, launching attack after attack after attack. A perseverance unrivalled from a man unchained. A rider free from the illness felt in the first week. A rider free from the descending demons that plagued him for years. Yet Pinot’s matches were rapidly being burnt on the final climb. No matter, he would still attack and attack and attack, even after briefly being distanced by EF Education-EasyPost’s Jefferson Cepeda. In the end, breakaway companion Einer Rubio of Movistar would blow out his flame in the final sprint. </p>\n\n\n\n<p>At the finish line in Crans Montana, the beautiful scenery of Switzerland painted a backdrop at odds with the broken rider at its centre. Pinot was crouched over his bike, <a href=\"https://twitter.com/friebos/status/1659578807336984577?s=20\" target=\"_blank\">head resting on his handlebars</a>.  </p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/switzerland-croix-de-coeur-cycling\">Switzerland’s gift to the Giro: Croix de Coeur Big Ride</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/5-best-thibaut-pinot\">Cyclist’s 5 favourite Thibaut Pinot moments</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/giro-ditalia-watch-live-stages-route-riders-teams-start-list\">Giro d’Italia 2023: Everything you need to know including route, favourites, how to watch and start list</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>I don’t believe in the phrase that someone ‘wants it more’, that’s not measurable. How can you try and invalidate Rubio’s win? You can’t. He fought hard to stay in contention. He played it smart. He won his first Grand Tour stage. </p>\n\n\n\n<p>What if Pinot hadn’t attacked so many times? What if he saved his energy? What if the trio worked together? Perhaps, perhaps, perhaps. But that’s how Pinot races: with his heart on his sleeve and as a true entertainer in the sport. One who will be remembered long after his retirement at the end of the season, one remembered for his valiant attempts to try, one who perfected the feat of drawing in spectators all over the world, both on the roadside and at home, not just for his wins. </p>\n\n\n\n<p>No, Thibaut Pinot didn’t win on Stage 13, but his evolution as a cyclist was on full display. And keep in mind that <a href=\"https://www.cyclist.co.uk/in-depth/why-we-love-thibaut-pinot\" target=\"_blank\">the last time</a> I wrote about Pinot’s second place on a stage last season, he won the next day at the Tour of the Alps. All eyes on Stage 14 of the Giro d’Italia then, for the man with the indomitable human spirit in the mountains jersey. </p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/thibaut-pinot-giro-ditalia\">Vintage Pinot is pure heart in his final Giro d’Italia</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"72525431b9ceb065782be4b3a6d7b41cfb581971897d84cf980a04339f8fd40b","category":"Cycling"}