{"title":"COVID-19 mortality sentinel surveillance at a tertiary referral hospital in Lusaka, Zambia, 2020–2021","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003063","date":1711720800000,"content":"<p>by Jonas Z. Hines, Priscilla Kapombe, Adam Mucheleng’anga, Stephen L. Chanda, Amos Hamukale, Mweene Cheelo, Kashala Kamalonga, Leigh Tally, Mwaka Monze, Muzala Kapina, Simon Agolory, Andrew F. Auld, Patrick Lungu, Roma Chilengi</p>\r\n\r\nDeaths from COVID-19 likely exceeded official statistics in Zambia because of limited testing and incomplete death registration. We describe a sentinel COVID-19 mortality surveillance system in Lusaka, Zambia. We analyzed surveillance data on deceased persons of all ages undergoing verbal autopsy (VA) and COVID-19 testing at the University Teaching Hospital (UTH) mortuary in Lusaka, Zambia, from April 2020 through August 2021. VA was done by surveillance officers for community deaths and in-patient deaths that occurred &lt;48 hours after admission. A standardized questionnaire about the circumstances proximal to death was used, with a probable cause of death assigned by a validated computer algorithm. Nasopharyngeal specimens from deceased persons were tested for COVID-19 using polymerase chain reaction and rapid diagnostic tests. We analyzed the cause of death by COVID-19 test results. Of 12,919 deceased persons at UTH mortuary during the study period, 5,555 (43.0%) had a VA and COVID-19 test postmortem, of which 79.7% were community deaths. Overall, 278 (5.0%) deceased persons tested COVID-19 positive; 7.1% during waves versus 1.4% during nonwave periods. Most (72.3%) deceased persons testing COVID-19 positive reportedly had fever, cough, and/or dyspnea and most (73.5%) reportedly had an antemortem COVID-19 test. Common causes of death for those testing COVID-19 positive included acute cardiac disease (18.3%), respiratory tract infections (16.5%), other types of cardiac diseases (12.9%), and stroke (7.2%). A notable portion of deceased persons at a sentinel site in Lusaka tested COVID-19 positive during waves, supporting the notion that deaths from COVID-19 might have been undercounted in Zambia. Many had displayed classic COVID-19 symptoms and been tested before death yet nevertheless died in the community, potentially indicating strained medical services during waves. The high proportion of cardiovascular diseases deaths might reflect the hypercoagulable state during severe COVID-19. Early supportive treatment and availability of antivirals might lessen future mortality.","author":"Jonas Z. Hines","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7256116c15a5ecffbc143c79173a645ea2b9934baf90ccfa467f9104d3dca271","category":"Environment"}