{"title":"Is agricultural production detrimental to Greece's ecological sustainability? Evidence from the dynamic ARDL simulations and bootstrap causality analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12358?af=R","date":1722998683000,"content":"<h2>Abstract</h2>\n<p>Agricultural production (AP) can play a prominent role in establishing food security. However, AP has an innate relationship with nature's demand and supply sides. Furthermore, unsustainable AP can harm a country's ecological sustainability by increasing the ecological deficit (i.e., the disparity between ecological footprint and biocapacity). In that respect, this research econometrically examines the AP–ecological deficit link in Greece for the 1965–2018 period. The following findings are revealed in this study. First, the ecological deficit and AP in Greece have a cointegrating relationship. Second, besides energy use and income, AP significantly contributes to Greece's ecological deficit in the long run. Third, the dynamic autoregressive distributed lag simulations show that the short run effect of a positive (negative) shock in AP on Greece's ecological deficit is insignificant. However, in the long run, the impact of a positive (negative) shock in <i>AP</i> gradually becomes significant and intensifies (decreases) the ecological deficit in Greece. Last, the bootstrap causality test with the Fourier approximation generally confirms these findings, revealing that unidirectional causality runs from AP to the ecological deficit. These results indicate that unless sustainability measures are strictly followed in the energy and agricultural sectors, AP could continue undermining Greece's long-run ecological sustainability.</p>","author":"Alper Karasoy","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"725c8dbb1a83e40bdec01b2465344c3cce2fe27c0f72325feaa258d6f6a91c65","category":"Environment"}