{"title":"Review: Nanoleaf's HomeKit-Enabled Lines Offer Futuristic Accent Lighting","link":"https://www.macrumors.com/review/nanoleaf-lines/","date":1636410729000,"content":"<a href=\"https://nanoleaf.me\">Nanoleaf</a>, known for its HomeKit-enabled accent lights, recently launched its most futuristic and modern looking lighting product yet - <a href=\"https://www.macrumors.com/2021/10/14/nanoleaf-lines-led-light-bars/\">Lines</a>. Lines are modular LED light bars that are illuminated at the back and can be arranged into different patterns and shapes for a unique design.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/nanoleaf-lines-music.jpg\" />\r\n<br />\r\nPrior Nanoleaf products have all been panels in various shapes with LED lights in the corners, but the Lines are something entirely different and may appeal to those who don't care for the panel look. Lines are priced starting at $200, so this is a high-end accent lighting product.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-colors-rainbow.jpg\" />\r\n<br />\r\nLines are white plastic light bars that are 11 inches long and .78 inches thick, and the idea is to connect lines together with hexagon-shaped connectors, creating different patterns and designs. The Nanoleaf app can be used for designing a Lines setup, and once a favorite shape has been decided on, the Lines can be mounted to the wall.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-components.jpg\" />\r\n<br />\r\nMounting Nanoleaf's Lines is hassle free. Just make your design, test out the lights, and then transfer the shape to the wall using the adhesive tape. There are detachable plastic plates that hold the adhesive and pull tabs so you can remove the Lines from the wall without damage. It's probably Nanoleaf's best setup in terms of relocating/removing the hardware. I took the Lines off of the wall a couple of times to move them and had no issues.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-connector.jpg\" />\r\n<br />\r\nNanoleaf's products are HomeKit-enabled, so setup is as simple as opening up the Nanoleaf app and then scanning a <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> code. You might run into a snag if you don't have a 2.4GHz WiFi network available, but for the most part, it should be a seamless experience.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-connected.jpg\" />\r\n<br />\r\nOnce set up, turned on, and connected, the Lines magic happens. Nanoleaf is using backlighting for the Lines, and it's a neat effect with millions of color options. Lines offer a unique look that's different from the other Nanoleaf products, and I can't get over how cool it is. Each Line can be set to two separate colors, and there's little blending, so you get these distinct shade mixes that are visually striking.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-on-floor.jpg\" />\r\n<br />\r\nWith Nanoleaf's Hexagons and Triangles, the lighting panels are bright enough to replace a traditional light, but that's not the case with Lines. Lines, like Nanoleaf's wood-colored Elements, are accent lighting and are not bright enough to work as a standard light. That said, at 100 percent brightness, they're still able to put out a decent amount of light and are bright enough that I prefer to run them at about 50 percent brightness since they're in my line of sight.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-back-leds.jpg\" />\r\n<br />\r\nWhen not lit up, Nanoleaf's Lines suffer from a problem that plagues most of the other Nanoleaf products - they're not that attractive on the wall. I am not a fan of the look of the Lines when they're turned off. The Lines are made from a stark white plastic and when off, they really stand out. Nanoleaf is making covers for the Lines that turn them black or pink, and that might improve the look when they're deactivated. The skins are shipping sometime in the future, and Nanoleaf says more designs are coming.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-turned-off.jpg\" />\r\n<br />\r\nI can forgive how the lines look when not lit just because of how vibrant and eye-catching they are when activated. You can choose from tons of different colors and pick a static look, or set up scenes with rotating colors in different patterns. Nanoleaf has some preset designs and an entire Nanoleaf gallery where you can download designs other people have created.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-colors-pastels.jpg\" />\r\n<br />\r\nNanoleaf's robust selection of lighting scenes is so convenient and one of my favorite parts of the Nanoleaf ecosystem. You can always find something fresh and interesting when browsing through the different looks that have been uploaded if you don't feel like putting the effort in to create your own designs. You can preview scenes or save them to your library and use them regularly.\r\n<br />\r\n\r\n<br />\r\nThe Lines are designed to be controlled through the Nanoleaf app, but you can also swap through your saved scenes using the hardware-based controller. Nanoleaf Lines support rhythm functionality as well, and you can use Rhythm scenes to set them to light up with music.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-blues.jpg\" />\r\n<br />\r\nLines are ‌HomeKit‌ compatible and can be assigned to Rooms and controlled alongside other ‌HomeKit‌ devices with <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> voice commands. The Home app offers little control functionality beyond activating/deactivating the Lines or setting them to a static color, so the Nanoleaf app is the primary control method. The Nanoleaf app incorporates all of your ‌HomeKit‌ products and the interface can be confusing, but the Nanoleaf section is straightforward and has the controls for the Lines.\r\n<br />\r\n\r\n<br />\r\nI didn't have connectivity issues with the Lines during my time testing them, and I did spend about a month with them before writing my review, so they feel fairly reliable. I've also been using other Nanoleaf products for years with few connectivity problems beyond needing to reset the WiFi connection every so often.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/nanoleaf-lines-rainbow-colors.jpg\" />\r\n<br />\r\nPricing is the major negative with the Lines. It's $200 for nine LED light bars, and another three costs $70, and that's not money that everyone is going to want to spend on accent lighting.\r\n<br />\r\n\r\n<br />\r\n<h2>Bottom Line</h2>\r\n<br />\r\nIf Nanoleaf's Lines fit your personal aesthetic and your budget, I don't think you're going to be disappointed picking them up. Lines are not the most attractive wall decor when not turned on, but when lit, they're colorful, futuristic, and fun.\r\n<br />\r\n\r\n<br />\r\nI find the Lines to be a great addition to my home office, and I think they complement any kind of gaming room, PC setup, theater setup, or TV room, and I suspect kids would enjoy them too. I wish Nanoleaf could sell these at a more affordable price point, and I love everything about them but their high price tag.\r\n<br />\r\n\r\n<br />\r\n<h2>How to Buy</h2>\r\n<br />\r\nLines can be <a href=\"https://nanoleaf.me/en-US/products/nanoleaf-lines/\">pre-ordered from the Nanoleaf website</a> for $199. Each set includes nine Lines, with add-ons of three Lines available in expansion packs priced at $70. Nanoleaf says that pre-orders are expected to ship in late November.\r\n<br />\r\n\r\n<br />\r\n<em><small>Note: Nanoleaf provided MacRumors with set of Lines and a Lines expansion pack for the purpose of this review. No other compensation was received.</small></em><div>Tag: <a href=\"https://www.macrumors.com/guide/nanoleaf/\">Nanoleaf</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/nanoleaf-lines/\">Review: Nanoleaf's HomeKit-Enabled Lines Offer Futuristic Accent Lighting</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-nanoleafs-homekit-enabled-lines-offer-futuristic-accent-lighting.2322456/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=u6umvcoijTY:MrQZg3y2WME:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=u6umvcoijTY:MrQZg3y2WME:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/u6umvcoijTY\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7278d059faddb62b1fb1b169ba51c266d9863e4b4dce52f2a3b55ddc87f7e86a","category":"Apple"}