{"title":"Protocol for the establishment of a serine integrase-based platform for functional validation of genetic switch controllers in eukaryotic cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303999","date":1716472800000,"content":"<p>by Marco A. de Oliveira, Lilian H. Florentino, Thais T. Sales, Rayane N. Lima, Luciana R. C. Barros, Cintia G. Limia, Mariana S. M. Almeida, Maria L. Robledo, Leila M. G. Barros, Eduardo O. Melo, Daniela M. Bittencourt, Stevens K. Rehen, Martín H. Bonamino, Elibio Rech</p>\r\n\r\nSerine integrases (Ints) are a family of site-specific recombinases (SSRs) encoded by some bacteriophages to integrate their genetic material into the genome of a host. Their ability to rearrange DNA sequences in different ways including inversion, excision, or insertion with no help from endogenous molecular machinery, confers important biotechnological value as genetic editing tools with high host plasticity. Despite advances in their use in prokaryotic cells, only a few Ints are currently used as gene editors in eukaryotes, partly due to the functional loss and cytotoxicity presented by some candidates in more complex organisms. To help expand the number of Ints available for the assembly of more complex multifunctional circuits in eukaryotic cells, this protocol describes a platform for the assembly and functional screening of serine-integrase-based genetic switches designed to control gene expression by directional inversions of DNA sequence orientation. The system consists of two sets of plasmids, an effector module and a reporter module, both sets assembled with regulatory components (as promoter and terminator regions) appropriate for expression in mammals, including humans, and plants. The complete method involves plasmid design, DNA delivery, testing and both molecular and phenotypical assessment of results. This platform presents a suitable workflow for the identification and functional validation of new tools for the genetic regulation and reprogramming of organisms with importance in different fields, from medical applications to crop enhancement, as shown by the initial results obtained. This protocol can be completed in 4 weeks for mammalian cells or up to 8 weeks for plant cells, considering cell culture or plant growth time.","author":"Marco A. de Oliveira","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"727f94aa703f14ccd1c8d2e089c6cefbc316419354b6b8b74d4edcda77c02e69","category":"Interdisciplinary"}