{"title":"Announcing Controlled Remote State Access for Terraform Cloud and Enterprise","link":"https://www.hashicorp.com/blog/announcing-controlled-remote-state-access-for-terraform-cloud-and-enterprise","date":1620144000000,"content":"<p>There are many security challenges to consider when running an infrastructure provisioning workflow based on infrastructure as code. Assessing who has access to what information at every step of the workflow should be a primary focus. For example, state files can contain information such as passwords or private keys and, in many cases, should be considered sensitive. We recommend securely storing state files remotely through a backend, like Terraform Cloud, which offers encrypted transmission and storage. However, users can still obtain and reference state information, even without explicit permission, by using the <code>terraform_remote_state</code> data source.</p>\n<p>With a new Controlled Remote State Access feature in Terraform Cloud and Terraform Enterprise, users now have a new way to establish granular controls for state accessibility.</p>\n<h2><a href=\"#controlled-remote-state-access\">»</a><a></a>Controlled Remote State Access</h2>\n<p>The new remote state sharing feature is designed to help manage which workspaces have access to each others’ state files while using the <code>terraform_remote_state</code> data source. This is important because the data source requires access to the entire remote state file.</p>\n<p>With Controlled Remote State Access, each workspace in Terraform Cloud and Enterprise will now see a new setting on the General Settings page. The remote state sharing option will allow users to share the current workspace’s state globally within the organization, restrict sharing to specified workspaces, or not allow sharing at all.</p><img src=\"https://www.datocms-assets.com/2885/1620074040-tfcremotestateaccess01.gif\" /><p>The default sharing configuration for all <em>new</em> workspaces is to restrict sharing its state with any other workspaces. All <em>existing</em> workspaces will continue to be globally shared within their organization. HashiCorp does recommend reviewing whether any existing workspace states should be shared and configuring the remote state sharing setting in accordance with the <a href=\"https://en.wikipedia.org/wiki/Principle_of_least_privilege\">principle of least privilege</a>.</p>\n<p>Terraform Enterprise customers will also find a new setting in the admin portal. This separate remote state sharing option will configure the default setting for every workspace in that environment to either be shared globally or not shared at all.</p><img src=\"https://www.datocms-assets.com/2885/1620074090-tferemotestateaccess01.png\" /><h2><a href=\"#terraform-core-updates\">»</a><a></a>Terraform Core Updates</h2>\n<p>The latest release of Terraform Cloud and Terraform Enterprise has one more security-focused update not related to state file accessibility. You’ll notice there are new, incremental versions of many Terraform Core releases. These versions have been added to address security bulletin <a href=\"https://discuss.hashicorp.com/t/hcsec-2021-12-codecov-security-event-and-hashicorp-gpg-key-exposure/23512\">HCSEC-2021-12</a>. We have taken steps to ensure existing workflows will not break on existing releases of providers, but we do recommend updating to the latest incremental version of Terraform within your workflows. Additional information about Terraform updates for HCSEC-2021-12 can be found in the following <a href=\"https://discuss.hashicorp.com/t/terraform-updates-for-hcsec-2021-12/23570\">link</a>.</p>\n<h2><a href=\"#summary\">»</a><a></a>Summary</h2>\n<p>HashiCorp takes a security-first posture in its commercial product offerings. Our focus is on addressing the concerns of organizations considering our cloud and self-managed offerings to run their business. Controlled Remote State Access builds on this posture by adding a new, more granular way to control accessibility to each Terraform workspace’s state file.</p>\n<p><a href=\"https://www.terraform.io/cloud\">Terraform Cloud</a> is free to try, and organizations can <a href=\"https://www.hashicorp.com/products/terraform/pricing\">upgrade to the Team &amp; Governance or Business tiers</a> at any time. To get started, <a href=\"https://app.terraform.io/signup/account\">sign up</a> for Terraform Cloud and follow our <a href=\"https://learn.hashicorp.com/collections/terraform/cloud-get-started\">Get Started</a> tutorial or contact <a href=\"https://www.hashicorp.com/contact-sales/terraform\">HashiCorp Sales</a> if you’re interested in self-managing Terraform Enterprise. For more information on security and compliance, see our <a href=\"https://www.hashicorp.com/security\">Security at HashiCorp</a> page.</p>","author":"Kyle Ruddy","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"72848d49a3ca20e85c4f7b3524d7f242eb349f82808fc03044dd2d8d49c37a07","category":"Tech"}