{"title":"The Pixel 8 Pro can now read body temps, if you swipe it across your face","link":"https://arstechnica.com/?p=1998991","date":1706209739000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/floorp_5XZKhTMqBo-980x492.png\" /></div>\n          <p>\n            Step 1: get the phone as close to your face as possible.                           [credit:\n                              Google                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Most Pixel 8 Pro owners have probably forgotten that there's an infrared temperature sensor on the back of the phone next to the LED camera flash. But it's still there, and almost four months after launch, it's getting a new feature: body temperature measurement. The four-month hold-up is because body temperature sensors are regulated as medical devices, so Google needed FDA approval to enable the feature. The company has <a href=\"https://blog.google/products/pixel/google-thermometer-app-body-temperature/\">a blog post</a> detailing the feature, which says: \"In clinical trials, our software algorithm was able to calculate body temperature in the range of 96.9°F–104°F (36.1°C–40°C) to within ±0.3°C when compared with an FDA-cleared temporal artery thermometer. In layman's terms, this means the Pixel body temperature feature is about as accurate as other temporal artery thermometers.\" The feature only works in the US.</p>\n<p>Like everything about the Pixel 8 Pro's temperature sensor, the basic feature idea sounds fine (if not <a href=\"https://arstechnica.com/gadgets/2020/06/huaweis-temperature-taking-smartphone-is-the-most-2020-phone-of-2020/\">several years late</a>), but the execution leaves much to be desired. Google has <a href=\"https://support.google.com/fitbit/answer/14505224?hl=en&amp;sjid=4492064105263558135-NA#zippy=%2Chow-do-i-take-a-body-temperature-measurement%2Chow-do-i-see-my-recent-temperature-results-in-the-thermometer-app%2Chow-do-i-delete-previous-measurements-in-the-thermometer-app%2Chow-do-i-change-temperature-units-in-the-thermometer-app%2Chow-do-i-adjust-settings-in-the-thermometer-app%2Cwhy-dont-i-see-the-thermometer-app-or-the-option-to-take-body-temperature%2Chow-do-i-troubleshoot-errors-seen-in-the-thermometer-app%2Chow-do-i-interpret-my-results-in-the-thermometer-app\">a support page</a> detailing how to use the body temperature sensor, and you'll need to slowly swipe the phone across your entire face over four seconds to get a reading. The sensor needs to be extremely close to your face to work; Google says it wants the phone \"as close as possible to the skin without touching.\" If you wear glasses, you'll need to take them off, because the phone needs to be so close to your face it will hit them. If you manage all that, you'll get a body temperature reading that you can save to your Fitbit profile.</p>\n<p>We found the temperature sensor to be the <a href=\"https://arstechnica.com/google/2023/10/pixel-8-pro-review-the-best-android-phone/2/\">biggest negative mark</a> in our Pixel 8 Pro review. I'm not entirely sure a well-executed temperature sensor would be a useful feature on a phone, but the Pixel 8's temperature sensor is just such a hassle to use. Besides forehead measuring, it can also check the temperature of objects, but it only has a range of two inches. There's also no camera feed or any targeting system to be sure of what you're measuring—you get a blank screen with a \"measure\" button, you press it, and a number appears. Temperature sensing also stops the instant it reads any single temperature—it's not continuous. All the user experience problems made the temperature sensor <a href=\"https://9to5google.com/2023/11/12/pixel-8-pro-temperature-sensor/\">instantly forgettable</a>. The body temperature addition isn't helping and feels like a feature that would be better suited for a smartwatch.</p></div><p><a href=\"https://arstechnica.com/?p=1998991#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998991&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7287d5a2b2a087c7d01d953b919eecddf0e4c51867e59b1b12226dc96883d668","category":"Tech"}