{"title":"294 Development of a model to predict forage intake and growth of bottle-fed Holstein calves","link":"https://academic.oup.com/jas/article/102/Supplement_2/216/7665056?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Models to predict intake and growth of preweaning calves have received less attention than postweaning calves. The objective was to develop a model to predict forage intake and growth of bottle-fed Holstein calves. Data on milk intake, alfalfa hay intake, and body weight (BW) of 40 Holstein calves from birth to 200 d of age were acquired from Abdelsamei (1989). Milk and forage intake equations were those used by Lancaster et. al. (2021; 10.1093/jas/skaa406). NASEM growth equation evaluation and new equation development were performed using a dataset compiled from the literature by Hildebrand et al. (2022; 10.1093/jas/skac064.321). The mean absolute error to predict milk intake was less for WOOD at peak milk less than 10.88 kg/d, and was less for NASEM at peak milk greater than 10.88 kg/d. A combination of NASEM and WOOD milk yield equations to predict milk intake resulted in CCC of 0.969 and MB of -0.74% and was used to predict milk intake in subsequent analyses. Prediction of forage intake by TED06, BAK76, TED09A, TED09B, and HOL82 had CCC of 0.878, 0.920, 0.729, 0.874, and 0.234 with MB of -17.49, -1.58, -64.40, -35.60, and -341.16%, respectively. Prediction of BW for the same intake equations with the NASEM growth equation had CCC of 0.876, 0.929, 0.819, 0.864, and 0.402 with MB of -21.54, -14.67, -30.10, -25.13, and -99.78%, respectively. With observed BW, prediction of forage intake by TED06, BAK76, TED09A, TED09B, and HOL82 resulted in CCC of 0.935, 0.936, 0.958, 0.964, and 0.640 with MB of -0.55, 6.57, -11.90, -8.83, and -92.26%, respectively, indicating high precision and moderate accuracy. With observed forage intake, prediction of BW by the NASEM growth equation resulted in CCC of 0.926 and MB of -17.08% indicating high precision and poor accuracy. Evaluation of the NASEM growth equation in Holstein cattle resulted in CCC of 0.329 and MB of 61.47%. A new growth equation was developed: EBG, kg/d = 0.78498 ± 0.24035*RE, Mcal/d^(0.78500 ± 0.06033)*EBW, kg^(-0.14323 ± 0.0742) with RMSE = 0.0599 ± 0.0207 and R<sup>2</sup> = 0.8795 ± 0.1078. With observed forage intake, prediction of BW with the new growth equation resulted in CCC of 0.992 and MB of -0.11%. With the new growth equation, prediction of forage intake by TED06, BAK76, TED09A, TED09B, and HOL82 resulted in CCC of 0.914, 0.766, 0.881, 0.901, and 0.412 with MB of 15.47, 40.53, 18.11, 17.02, and -172.88%, respectively. Prediction of BW resulted in CCC of 0.978, 0.940, 0.968, 0.969, and 0.701 with MB of 2.83, 8.91, 3.87, 3.92, and -38.73%. In conclusion, prediction of forage intake and BW in Holstein calves were hindered by use of the NASEM growth equation, and a new growth equation more precisely and accurately predicted forage intake and body weight.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"728bbce2f8f0a8049ec713c7b56f32ab37ea5d93393a33793773a66840d0ad7e","category":"Environment"}