{"title":"macOS Monterey: The best features coming to your Mac this fall","link":"https://www.macworld.com/article/348192/macos-12-monterey-features-universal-control-shortcuts-safari-focus-compatilibity-release-beta-how-to-install.html","date":1623097093000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>The next version of macOS is called Monterey. It’s the first major update to macOS since the big shift in macOS 11 Big Sur, which was introduced at WWDC last year. Here are the top features of <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/macos/monterey-preview/&amp;subid1=1-1-348192-0-0-0\">macOS Monterey</a>, which will be released this fall following a public beta period beginning in July.</p>\n\n\n\n<h2>Universal Control</h2>\n\n\n\n<p>Apple users often switch between devices, and with Universal Control, you can now use a single mouse and keyboard between your Mac and iPad. If you’re using a MacBook, its keyboard and trackpad can be used with the iPad. You can even drag and drop files between devices and perform gestures on the MacBook trackpad to navigate the iPad.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-universal-control.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Universal Control can connect to three devices.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Additionally, Universal Control can do something that Apple’s Craig Federighi said would appeal to pros: You can connect three devices and navigate between them. During the keynote, Federighi used a 24-inch iMac, 13-inch M1 MacBook Pro, and an iPad, and was able to move the cursor between all three devices. He showed how you can take a file from the iPad, drag it through the MacBook Pro, and then drop it into a Final Cut Pro project.</p>\n\n\n\n<p>Here are the Macs that are compatible with Universal Control: </p>\n\n\n\n<ul><li>2016 and later MacBook Pro</li><li>2016 and later MacBook</li><li>2018 and later MacBook Air</li><li>2017 and later iMac </li><li>Late 2015 and later 27-inch iMac</li><li>iMac Pro</li><li>2018 and later Mac mini</li><li>2019 and later Mac Pro</li></ul>\n\n\n\n<p>Here are the iPads that are compatible:</p>\n\n\n\n<ul><li>iPad Pro</li><li>3rd generation and later iPad Air</li><li>6th generation and later iPad</li><li>5th generation and later iPad mini</li></ul>\n\n\n\n<p>Other requirements:</p>\n\n\n\n<ul><li>All devices must be signed in to iCloud with the same Apple ID using two-factor authentication.</li><li>For wireless connectivity, all devices must have Bluetooth, Wi-Fi, and Handoff turned on and within 30 feet of each other. </li><li>iPad and Mac cannot be sharing a cellular and internet connection.</li><li>For USB connections, you must trust your Mac on the iPad.</li></ul>\n\n\n\n<h2>Shortcuts for Mac</h2>\n\n\n\n<p>Shortcuts on iOS and iPadOS has become a popular tool to create automations. In macOS Monterey, Shortcuts for Mac will be available, bringing over the same powerful functionality. Apple said during the keynote that Automator, the previous automation app, will continue to be supported and that Automator workflows can be imported to Shortcuts.</p>\n\n\n\n<h2>Safari</h2>\n\n\n\n<p>Safari on the Mac gets a UI facelift to support its new tab-focused features. The tab bar takes on the color of the site you’re reading and the toolbar is more compact with the buttons that currently surround it—Home, Share, Privacy Report, Show Downloads—collected into a menu to the right of the address bar.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-safari-tab-groups.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Safari’s tabs gets new treatment in macOS Monterey, with a UI redesign and new Tab Groups.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The new Tab Groups allows you to save a set of tabs so you can access them later. Your Tab Groups are available on all the Macs that you use, and are also updated across all of your Apple devices.</p>\n\n\n\n<h2>AirPlay to Mac</h2>\n\n\n\n<p>With AirPlay to a Mac, you can now take the media from your iPhone and iPad and use AirPlay to stream on your Mac. You can also stream from an app; for example, you can draw using your iPad, and use AirPlay to stream your activity onto a Mac so others can watch. Apple showed the 24-inch iMac during its AirPlay to Mac presentation, which subtly implies that this feature might work only with Macs equipped with Apple silicon. But we won’t know for sure until we get our hands on the beta.</p>\n\n\n\n<h2>FaceTime and Messages</h2>\n\n\n\n<p>FaceTime and Messages share new features that will also be available in <a href=\"https://www.macworld.com/article/348123/ios-15-features-facetime-notifications-sharing-live-text-compatilibity-release-beta-how-to-install.html\">iOS 15</a>. These new features make it a lot easier to incorporate media into your conversations.</p>\n\n\n\n<p>The new SharePlay support allows people to share an experience while watching video, listening to music, or even an app window while on a FaceTime call. The people on the call can control the media that’s playing, and the callers can even make a playlist. SharePlay works with Apple TV and Apple Music; support for other services will depend on those services adopting the SharePlay API and updating their services with support.</p>\n\n\n\n<p>With Share with You, you now have more ways to handle the items that people send you in Messages. Apps such as Photos, Podcast, News, Safari, and TV will now have sections with the items people shared with you.</p>\n\n\n\n<p>When you’re using FaceTime on your Mac, people using Windows or FaceTime can join in. When they receive the FaceTime link, they’ll have to use the latest version of the Google Chrome or Microsoft Edge browser, and they’ll also need H.264 video encoding support in order to send video from their device.</p>\n\n\n\n<h2>Focus</h2>\n\n\n\n<p>The new Focus feature allows you to set time periods that filter or block your notifications. For example, you can set up a Work focus that will filter your notifications and only deliver work-related ones. Apple will supply a set of Focus modes, and you also can create your own.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/macos-monterey-focus.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The new Focus feature is also available in iOS 15. </figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Quick Note</h2>\n\n\n\n<p>Like iPadOS 15, you’ll be able to create notes on the screen without having to launch the Notes app. You can add images to Quick Notes, and links in a note open up to that specific page in your browser. All your Quick Notes are collected in the Notes app and accessible on all of your devices.</p>\n\n\n\n<p>The Notes app also has a new Activity view that lets you see revisions made by others in a shared note. The people in that shared notes can get notifications just by typing their name.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"728eab4f3f14d8f8fb3433967a482b0aa2b634a7439c0f4f396f8b4aedce72e0","category":"Apple"}