{"title":"เผยวิธีซื้อกิจการสไตล์ Apple: เน้นบริษัทเล็ก เชี่ยวชาญเทคโนโลยีเฉพาะ และทุกอย่างเป็นความลับ","link":"https://www.blognone.com/node/122474","date":1619946408000,"content":"<div><div><div><p>เราเห็นข่าวบริษัทเทคโนโลยีขนาดใหญ่ ทำดีลซื้อกิจการบริษัทอื่นกันอยู่เรื่อย ๆ แต่ในบรรดาบริษัทใหญ่เหล่านั้น แอปเปิลกลับมีรูปแบบการซื้อกิจการที่แตกต่างจากคนอื่น ซีอีโอ Tim Cook ได้เปิดเผยในการประชุมผู้ถือหุ้นประจำปี ว่าในช่วง 6 ปีที่ผ่านมา แอปเปิลซื้อกิจการบริษัทอื่นไปแล้วเกือบ 100 แห่ง เฉลี่ยแล้วทุก 3-4 สัปดาห์ (<a href=\"https://www.blognone.com/node/121883\">ข่าวเก่า</a>)</p>\n<p>CNBC ได้สัมภาษณ์พนักงานในบริษัทที่แอปเปิลซื้อกิจการไปหลายคน พบว่ากลยุทธ์ของแอปเปิลเวลาซื้อกิจการคือเน้นซื้อตัวทีมงานวิศวกรให้เข้ามาเป็นพนักงานแอปเปิล มากกว่าสนใจการซื้อตัวกิจการบริษัทและสินค้า (acquihire) แอปเปิลจึงนิยมซื้อสตาร์ทอัพขนาดเล็กมากกว่า มีข้อมูลว่าวิธีประเมินมูลค่าเวลาซื้อกิจการ แอปเปิลใช้วิธีนับจำนวนพนักงานสายเทคนิคคูณด้วยตัวเลขหนึ่งออกมา และไม่มีการให้มูลค่าจากแบรนด์ หรือฐานลูกค้าเดิม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bc16462e1b70855b74b4dbfce60de4d4.jpg\" /></p>\n<p>วิธีการซื้อกิจการของแอปเปิล มักเริ่มต้นจากฝ่ายพัฒนาภายในพบปัญหาอุปสรรคใดอยู่ ก็จะส่งเรื่องให้แผนกเจรจาซื้อกิจการ ไปค้นหาบริษัทที่มีทีมงานซึ่งเชี่ยวชาญเรื่องดังกล่าว และซื้อกิจการเพื่อให้ได้ทีมงานเข้ามาในบริษัท ตัวอย่างเช่น<a href=\"https://www.blognone.com/node/35176\">ดีล AuthenTec</a> ในปี 2012 ที่พัฒนาเป็นตัวสแกน Touch ID หรือในปี 2010 แอปเปิลซื้อ Siri Assistant ที่มาเป็น Siri ตั้งแต่ iPhone 4S โดยช่วงหลังหัวข้อที่แอปเปิลซื้อกิจการเข้ามาตลอดคือ AR, VR, AI, ระบบแผนที่, ระบบสุขภาพ และเซมิคอนดักเตอร์ ตัวอย่างเช่น <a href=\"https://www.blognone.com/node/104939\">Akonia</a>, <a href=\"https://www.blognone.com/node/116355\">NextVR</a>, <a href=\"https://www.blognone.com/node/114169\">Xnor․ai</a>, <a href=\"https://www.blognone.com/node/115631\">Voysis</a> หรือ <a href=\"https://www.blognone.com/node/108166\">PullString</a></p>\n<p>เมื่อเป็นแอปเปิลที่นิยมทำทุกอย่างให้เป็นความลับ การซื้อกิจการก็มีแนวทางแบบนี้เช่นกัน โดยข้อกำหนดหนึ่งที่แอปเปิลระบุให้พนักงานบริษัทที่ถูกซื้อกิจการทำ คือห้ามอัพเดตข้อมูลใน LinkedIn ว่าตอนนี้ย้ายมาทำงานให้แอปเปิล และหากมีข่าวหลุดออกไป พนักงานทุกคนก็ห้ามตอบคำถามนี้ไม่ว่าจะเป็นเพื่อนหรือคนในครอบครัว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d968e85b1aa9313070439dc77d493c62.jpg\" /></p>\n<p>อีกข้อกำหนดที่แอปเปิลระบุไว้ เนื่องจากบริษัทต้องการตัวพนักงาน ฉะนั้นพนักงานบริษัทเดิมจึงห้ามลาออกจากแอปเปิลในเวลาที่กำหนด ซึ่งแอปเปิลก็ให้หุ้นบริษัทแบบที่ทยอยขายได้ในช่วงเวลาที่กำหนดเป็นสิ่งจูงใจ</p>\n<p>อย่างไรก็ตามหากย้อนดูดีลในอดีตของแอปเปิล ก็มีดีลขนาดใหญ่อยู่เช่นกัน อาทิ การ<a href=\"https://www.blognone.com/node/111040\">ซื้อธุรกิจชิปโมเด็มจาก Intel</a> มูลค่า 1,000 ล้านดอลลาร์ หรือ <a href=\"https://www.blognone.com/node/58945\">Beats</a> มูลค่า 3,000 ล้านดอลลาร์</p>\n<p>ที่มา: <a href=\"https://www.cnbc.com/2021/05/01/how-apple-does-ma-small-and-quiet-with-no-bankers.html\">CNBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div><div><a href=\"/topics/business\">Business</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7291370f4bff4dd0886dc78d6ee2f721d6b1d6704b7a2128aff38ae6272a3629","category":"Thai"}