{"title":"Lipid Composition-, Medium pH-, and Drug Concentration-Dependent Membrane Interactions of Ibuprofen, Diclofenac, and Celecoxib: Hypothetical Association with Their Analgesic and Gastrointestinal Toxic Effects","link":"https://www.preprints.org/manuscript/202405.1100/v1","date":1715908222000,"content":"Among nonsteroidal anti-inflammatory drugs, ibuprofen, diclofenac, and celecoxib have been frequently used in multimodal analgesia. Recent studies challenge the conventional theory that they exhibit activity and toxicity by acting on cyclooxygenase selectively. We compared their membrane interactions that may be associated with analgesic and gastrointestinal toxic effects. Biomimetic membranes suspended in buffers of different pH were prepared with 1-palmitoyl-2-oleoylphosphatidylcholine, sphingomyelin, and cholesterol to mimic neuronal membranes and with 1,2-dipalmitoylphosphatidylcholine to mimic gastrointestinal mucosae. The membrane interactivity was determined by measuring fluorescence polarization. At pH 7.4, the drugs interacted with neuro-mimetic membranes to decrease membrane fluidity at pharmacokinetically-relevant 0.5–100 μM. Celecoxib was most potent, followed by ibuprofen and diclofenac. At pH 4.0 and 2.5, however, the drugs increased the fluidity of 1,2-dipalmitoylphosphatidylcholine membranes at 0.1–1 mM corresponding to gastroduodenal lumen concentrations after administration. Their membrane fluidization was greater at gastric pH 2.5 than at duodenal pH 4.0. Low-micromolar ibuprofen, diclofenac, and celecoxib structure-specifically decrease neuronal membrane fluidity, which hypothetically could affect signal transmission of nociceptive sensory neurons. Under gastroduodenal acidic conditions, high-micromolar ibuprofen, diclofenac, and celecoxib induce fluidity increases of membranous phosphatidylcholines that are hypothetically associated with gastrointestinal toxic effects, which would enhance acid permeability of protective mucosal membranes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7293ea076e9f1187b31e2fa88df299263670bef8eab2d5d5e48112d77269c02f","category":"Interdisciplinary"}