{"title":"‘I’ve been understudy to Laura Kenny for most of my career’ - Katie Archibald on dealing with pressure in the run-up to Olympics","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/i-ve-been-understudy-to-laura-kenny-for-most-of-my-career-katie-archibald-on-the-dealing-with-pressure-in-the-run-up-to-olympics","date":1698403699000,"content":"\n      <p><span>The success that Great Britain has had in track cycling is perhaps one of the nation’s biggest sporting success stories. London 2012 marked a turning point for the sport, where gold medals were won by Team GB riders like they were going out of fashion. Since then, there have inevitably been ups and downs as each Olympic cycle rolls by, but the British squad hasn’t left a Games without a gold medal, making a name for itself as a track cycling powerhouse, with talent methodically churned through the conveyor belt.</span></p>\n<div></div>\n<div></div>\n<p><span>But like in all high-performance sports, success doesn’t come without ruthless years of hard work and a cut-throat system that tests not only athletes' physical strength but also their mental fortitude. Scottish rider Katie Archibald has been a crucial part of the GB women’s endurance track programme since she made her Great Britain debut at the 2013 European Track Championships. Two Olympic gold medals and four World titles later and Archibald remains at the very top of the sport in 2023, a favourite for the Paris 2024 Olympic Omnium, Madison and Team Pursuit gold medals in less than a year’s time.</span></p>\n<p><span>With such illustrious </span><span>palmarès</span><span>, Archibald rarely goes into a track competition without a target on her back. She’s always one to watch – in fact, she’s become so good that the surprise isn't when she wins, but when she doesn't. The 29-year-old is currently leading the 2023 UCI Track Champions League – a new, five-round series with the aim of making track cycling more engaging to modern audiences – and with the Olympics fast approaching, the pressure on her to perform is greater than ever.</span></p>\n<p><span>“I’ve been understudy to Laura Kenny for most of my career and it’s only recently that I’ve realised what a blessing that’s been,” Archibald explained, speaking the day before the second round of the UCI Track Champions League in Berlin.</span></p>\n<p><span>“I’ve seen Laura go to races – particularly elimination races – and there were, what felt to me, like several years where, if she got on the start line for a devil, she was going to win that race. It meant that I’ve been able to learn from how she coped with those pressures, or when she didn’t cope with those pressures and I’ve just not had them myself because even on the days when it should all be on me, in the back of my head I go, well Laura’s the boss.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TMX_154639_1024x1024.jpg?v=1698399885\" /></span></p>\n<p><span>With the 2024 Olympics in mind, five-time gold medallist Kenny hasn’t yet been officially ruled out of selection, but Stephen Park, the performance director of British Cycling, told the </span><a href=\"https://www.telegraph.co.uk/cycling/2023/08/01/laura-kenny-not-compete-paris-2024-olympics-birth-baby/\" target=\"_blank\"><span>Telegraph</span></a><span> in August: \"I think it’s going to be a stretch for her to come back for Paris,” given the recent birth of her second child. Archibald points to Kenny’s career break in 2017 when the older rider took time off to give birth to Albie, her first child, as a key turning point in the Archibald's career.</span></p>\n<p><span>“There were occasions in 2017 when I was Omnium world champion and Laura was away having Albie [her first child] and it meant that there was this dynamic shift that made me learn to walk by myself which was useful,” Archibald explained. “Having a successful team means there is a culture that helps you cope with that pressure, you don’t need it spoon fed to you, it’s lessons that you pick up from the people around you, like how to not freak out. But I do, I still do, I get very nervous and I struggle with it but I don’t think in an unsustainable way.”</span></p>\n<p><span>It’s not just during competition that the stress is high for professional athletes. Many track cyclists from nations rich with talent often discuss the team dynamics when it comes to selection criteria for key events. There’s only one spot for the individual sprint or the omnium at the Olympic Games, for example, and often it's much more than just one rider who wants it. Emma Finucane, the current sprint world champion, </span><a href=\"https://www.globalcyclingnetwork.com/racing/news/its-a-team-event-but-were-fighting-each-other-emma-finucane-on-the-internal-battle-for-olympics-selection\" target=\"_blank\"><span>spoke to GCN</span></a><span> recently about how British sprinters are “starting to maybe not speak to each other anymore” with this in mind. Does this attitude exist amongst the women’s endurance athletes too?</span></p>\n<p><span>“Something that I’ve always admired about the sprint team is that they mingle more than the endurance team between the male and the female squads,” Archibald responded when questioned. “They are individuals first and they put those individuals into a team – that’s a consequence of their event format in that a team sprint goes P1, P2 and P3 and you have to look out for each other, but not to the same extent that you do in a team pursuit team.”</span></p>\n<p><span>“With the endurance squad, everything we do is on this foundation of the team pursuit, that's your way to get to an Olympic Games to represent your country and get an entry into the team so that then you can do special things as an individual. If you're not able to contribute there you almost have to be twice as good as an individual rider. Because of that we end up as a very tight-knit squad and very reliant on each other and supportive of each other.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TMX_191051_1024x1024.jpg?v=1698399904\" />Archibald explained that the nature of the team pursuit leads to a unique feeling amongst the riders vying for those spots in the Olympic team.</span></p>\n<p><span>“I think that gives us different selection dynamics because it’s more ‘in your face’ that if I go faster, you go faster. It’s obviously just more stressful the more of you there are in the squad. When I was in the Rio cycle there were only five of us so we knew we were going to take five to the Games and there was emotional stress and tears when one person didn’t get to ride, but everything until that moment was created in an environment where you support each other. That makes it easier to take those setbacks and non-selections because you'd rather not be selected for the best team in the world than be on the start line and come eighth.”</span></p>\n<p><span>“Maybe it’s easier to say for me because I am the person who usually does get on the start line, so I perhaps shouldn’t have such a voice on this, but that’s the way I feel about it,” she continued.</span></p>\n<p><span>Although the famed Olympic rings loom ominously in the distance as Archibald looks ahead to next year, she appears extremely focused on her current task in hand: winning the UCI Track Champions League overall. She explains that she is hoping to build her form steadily towards the final round of the League in London in November to take the overall title, without making the tactical errors she believes she did in the series last year.</span></p>\n<p><span>In some ways, what comes next for Archibald after that final round of the league in London is relatively clear: she’s likely to ride the Omnium, Madison and Team Pursuit at the Paris Olympics, leading the race for selection for these events by far. But as she seems aware of herself, it won’t be her physical ability holding her back from getting to the Games and winning Olympic medals, but her skill at managing the weight of expectation to carry the mantle for Team GB’s track cycling success into a new era.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"72941ba59f5e58d988f5e8b743d142b0ef941d32fed81f821b4cc20aef9047c7","category":"Cycling"}