{"title":"Bike brakes explained: disc brakes vs rim brakes vs V-brakes","link":"https://www.bikeradar.com/advice/buyers-guides/bike-brakes/","date":1683280800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2022/12/DSC00852-95d025a.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Scott Solace eRide 10 against a church wall\" title=\"Scott Solace eRide 10 against a church wall\" />                                            <p>Modern braking for bikes is dominated by three systems: the disc brake, the caliper rim brake and the V-brake.</p>\n<p>The hydraulic disc brake is rapidly taking over, with its widespread adoption on road bikes following the much earlier swap to discs on mountain bikes.</p>\n<p>That increasingly leaves caliper rim brakes and V-brakes as the domain of cheaper bikes, although some top-tier road teams outside of the WorldTour still race on rim brakes.</p>\n<p>Here’s everything you need to know about bike brakes, including the different types of brakes available, how they work, and a short history of every brake that has ever existed.</p>\n<h2>What type of brakes does your bike have?</h2>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2022/01/LIOS-Bullet-Rival-disc-AXS-02-788a0c0.jpg?quality=90&amp;resize=556%2C723\" width=\"556\" height=\"723\" alt=\"The LIOS Bullet Rival disc AXS road bike is equipped with SRAM Rival hydraulic disc brakes\" title=\"LIOS Bullet Rival disc AXS - 02\" /></div>    <figcaption><div>\n    <figcaption><span>The majority of new bikes now use disc brakes.</span>\n    </figcaption><span>\n                    <i>Dave Caudery / Our Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/Canyon-Endurace-AL7.0-04-1a21ba5.jpg?quality=90&amp;resize=556%2C723\" width=\"556\" height=\"723\" alt=\"Shimano 105 rim brakes on Canyon road bike\" title=\"Canyon Endurace AL7.0 04\" /></div>    <figcaption><div>\n    <figcaption><span>Rim brakes used to dominate on road bikes but now mainly feature on entry-level builds.</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Ridgeback-Speed-03-91f3943.jpg?quality=90&amp;resize=556%2C723\" width=\"556\" height=\"723\" alt=\"With the Ridgeback Speed commuter Ridgeback has opted for V-brakes\" title=\"Ridgeback Speed 03\" /></div>    <figcaption><div>\n    <figcaption><span>V-brakes are still common on commuter and town bikes.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Our Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>There are three main types of brakes on modern bikes: disc brakes, rim brakes and V-brakes. We’ll cover each of them in turn.</p>\n<p>The majority of new bikes, whether that’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bikes</a>, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bikes</a> or <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bikes/\">hybrid bikes</a>, now use disc brakes that operate by pushing pads housed in a caliper against a brake rotor attached to the wheels’ hubs. We’ll go into different types of disc brake below.</p>\n<p>Over the past five years, <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a> have rapidly taken over from rim brakes, which push brake pads against the wheel’s rim. There are good reasons for that, mainly related to more efficient and consistent stopping, whatever the weather.</p>\n<p>On that note, and as we mentioned at the top, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-disc-brakes/\">mountain bike disc brakes</a> have been commonplace at all levels for years, providing powerful stopping power uninfluenced by trail conditions.</p>\n<p>Disc brakes and caliper rim brakes take the lion’s share of braking duties across most bikes, but you’ll also find V-brakes on some cheaper urban or <a href=\"https://www.bikeradar.com/advice/buyers-guides/whats-the-best-bike-for-commuting/\">commuting bikes</a>.</p>\n<p>These also work on the rim and are attached to frame bosses on either side of the wheel. V-brakes (also known as direct-pull cantilever brakes) are operated via a cable that runs from one side of the brake and across the top, pulling the two halves together.</p>\n<p>There are other brake designs out there, but they’re a rarity on mainstream bikes. Still, we’ll give you a full rundown at the end of this article.</p>\n<h2>Anatomy of a bike brake</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The brake levers and shifters are usually separate on a flat-bar bike.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>Almost all bike brakes are operated using a lever mounted on the handlebars.</p>\n<p>On bikes with a flat handlebar, including mountain bikes, there’s usually a brake lever separate from the bike’s gear shift levers.</p>\n<p>Drop-bar road bikes and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> usually combine the brake lever and gear shifter into one unit (with separate units for the front and rear brakes), although older bikes had separate shifters on the down tube, and you can sometimes see shifters at the ends of the bars.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Road bikes normally have the brake lever and shifter built into one unit.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>Single-chainring groupsets (known as 1x, or ‘one-by’) will have one brake lever with a gear shifter built-in, while the other lever will only work as a brake.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\">Singlespeed bikes</a> have levers that just operate the brakes, as there are no gears to operate.</p>\n<p>When you operate the brake lever, either it pulls a cable or pushes hydraulic fluid through a hose. In either case, there’s a physical line to the brake caliper from the lever.</p>\n<p>We’ll explain the differences between how rim and disc brakes work in detail below, but in both cases, applying the brakes pushes pads against a braking surface to generate friction and heat to slow or stop the bike.</p>\n<h2>How do disc brakes work?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Whether on a road or gravel bike, disc brake calipers are found in the same place. The caliper above shows the flat-mount standard.</span></figcaption><span> <i>Shimano</i></span></div>\n<p>In a disc brake, the brake pads are housed in a caliper bolted to the frame.</p>\n<p>The front brake caliper is attached to the left fork blade and the rear brake usually to the left chainstay, but occasionally to the left seatstay or between the two. They house brake pads that act on a rotor attached to the wheel’s hub, pressing against this to slow the bike.</p>\n<p>The brake caliper is either mounted on posts protruding from the bike’s frame (usually found on mountain bikes). This standard is referred to as post-mount.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Shimano and other brands now offer flat-mount MTB brakes at multiple levels.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Flat-mount is an evolution of this and sees the caliper bolted to a designated flat surface on the frame (the default system now used on road bikes, gravel bikes and some <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">cross-country mountain bikes</a>).</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">Disc brake pads</a> are typically made from an organic, sintered or semi-metallic compound, each with its own advantages and disadvantages depending on the type of riding you’re doing.</p>\n<h3>Disc brake rotors</h3>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Rotors are attached to the hub in the centre of the wheel.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>The disc brake rotor is usually made of steel and sized between 140mm and 203mm in diameter, with larger rotors used where stronger braking is needed, such as on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\">downhill mountain bikes</a>.</p>\n<p>The rotor may be connected to the wheel hub with either six bolts or using Shimano’s Centerlock system, where a lockring screws onto threads in the hub.</p>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> This kind of terrain calls for big disc rotors.</span></figcaption><span> <i>Andy Lloyd / Marin Bikes</i></span></div>\n<p>Centerlock is seen on the majority of <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">road bike wheels</a>. The lockring is usually threaded on its inside face and tightened with a cassette lockring tool.</p>\n<p>You can also buy externally flanged lockrings, which tighten with a <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> cup tool. Some wheels need an externally flanged lockring because the axle is too wide for a tool to fit on an internal flange.</p>\n<p>One potential issue with disc brakes is that the rotor can get quite hot when in use. This can lower braking efficiency and also cause the rotor to warp.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Some of Shimano’s rotors use cooling fins to reduce heat build-up.</span></figcaption><span> <i>Simon von Bromley / Our Media</i></span></div>\n<p>Brake manufacturers try to get around this in a few ways; first, rotors and pads may include cooling fins to help lower their operating temperature. It’s the method used by Shimano in its road and mountain bike rotors.</p>\n<p>Second, rather than being made in one piece, the rotor may be ‘floating’. This is where the braking surface is riveted to a carrier spider that bolts to the wheel hub. When it heats up, a floating rotor should expand more evenly than a solid rotor and so is less likely to distort. The float also helps even out pressure between the pads acting on the two sides of the rotor.</p>\n<p>Finally, rotors may be made of a sandwich of steel with an aluminium core, which again helps with heat dissipation and also reduces weight.</p>\n<h3>Hydraulic disc brakes</h3>\n<div></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Hydraulic disc brakes can be trickier to maintain than cable-operated brakes, but usually require less maintenance overall.</span></figcaption><span> <i>Oscar Huckle / Our Media </i></span></div>\n<p>In a hydraulic disc brake, a piston in the brake lever pushes hydraulic fluid through the brake hose when the brake is applied. The fluid pushes the brake pads together and against the brake rotor. When the brake is released, a spring pushes the pads away from the rotor and back into their housings.</p>\n<p>Hydraulic disc brakes will work efficiently with convoluted hose runs from the brake levers to the brakes, so they are a good option for triathlon and <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bikes</a> with internal hose routing.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The majority of disc brakes have a single pair of pistons.</span></figcaption><span> <i>James Huang</i></span></div>\n<p>Most hydraulic disc brakes have one piston on each side of the rotor, but disc brakes designed for downhill riding often have a total of four pistons to allow more braking force to be applied.</p>\n<p>Disc brakes use a wide variety of pad designs and shapes. If you’re replacing your pads, you need to be careful that your new ones will fit your brake caliper.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Learning how to bleed brakes is a key skill for any dedicated mechanic.</span></figcaption><span> <i>Kaden Gardener / Our Media</i></span></div>\n<p>Hydraulic disc brakes have the advantage that there’s no friction in the hose and so all your braking effort is transmitted to the brake.</p>\n<p>As the hydraulic line is a closed system, there’s less maintenance required than a cable-operated brake, though the system may need bleeding occasionally if it gets contaminated. Learning <a href=\"https://www.bikeradar.com/advice/workshop/how-to-bleed-shimano-disc-brakes/\">how to bleed brakes</a> is a key skill for any committed home mechanic.</p>\n<p>The pads will also need to be replaced when they get worn or contaminated with oil or other substances, which reduce braking efficiency.</p>\n<p>Different brands use different hydraulic fluids in their brakes. It’s important to use the right one if you need to bleed the brakes, to avoid damage and possible failure of your equipment’s seals. Boiling the brake fluid is potentially a problem with prolonged, hard braking as well.</p>\n<h3>Cable (mechanical) disc brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The TRP Spyres use a dual-piston design.</span></figcaption><span> <i>Dave Caudery / Our Media </i></span></div>\n<p>In a cable-operated disc brake (sometimes referred to as a mechanical disc brake), the physical connection between the lever and the brake caliper is made with a wire cable.</p>\n<p><span>The cable pulls a lever on the caliper, which usually pushes a pad on each side of the caliper into contact with the rotor. SRAM’s Avid cable-operated disc brakes only move the outboard brake pad. The rotor pushes against a static inboard pad.</span></p>\n<h3>Hydraulic disc brakes vs cable disc brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mechanical disc brakes are subject to cable stretch and dirt ingress.</span></figcaption><span> <i>Oscar Huckle / Our Media</i></span></div>\n<p>Due to the frictional loss and stretch in the cable, cable-operated disc brakes lose out to hydraulics both in out-and-out braking force and modulation, but the best models are still more efficient than the majority of rim brakes.</p>\n<p>Cable disc brakes are a cheaper option than hydraulic brakes, so are often found on lower-spec bikes, and are easier to fix out in the wilds.</p>\n<p>However, most mid-to-high-end bikes with disc brakes will have a hydraulic system for good reason.</p>\n<h2>Rim brakes</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Some riders still favour rim brakes thanks to their simplicity and low weight.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Side-pull caliper brakes were the primary choice for road bikes for decades.</p>\n<p>They’re lightweight and can provide strong braking, although they’re much more susceptible to performance degradation in the wet than disc brakes.</p>\n<p>Braking performance can be degraded on carbon rims in the wet too, and there’s a risk of overheating with prolonged braking on carbon brake tracks.</p>\n<p>It’s for those reasons, plus the opportunity to fit wider <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road bike tyres</a> and to make carbon rims lighter if they’re not used for braking duties, that modern road machines have moved substantially to disc brakes.</p>\n<p>That said, a pair of well set-up rim brakes on alloy rims are more than sufficient for nearly all riders. Bikes equipped with rim brakes are also usually significantly cheaper than their disc equivalents, even if they’re hard to come by on the latest releases.</p>\n<p>There’s a wide variety of different caliper brake designs out there, and we’ve explained some of the more common types below.</p>\n<h3>Single-pivot caliper brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A retro cycling trend that won’t be coming back into fashion.</span></figcaption><span> <i>James Huang / Our Media</i></span></div>\n<p>In days gone past, single-pivot caliper rim brakes were the norm.</p>\n<p>With these, both arms rotated around a single, centred pivot, which theoretically allowed the brake to self-centre and track an out-of-true rim more effectively than a dual-pivot brake. These brakes were attached via a single bolt in the fork crown and the rear brake bridge.</p>\n<p>Centre-pull brakes were the norm in the peloton (more on these later) until the introduction of the <a href=\"http://bikeretrogrouch.blogspot.co.uk/2013/10/endangered-species-single-pivot.html\" target=\"_blank\">legendary Campagnolo Record sidepull brake</a> in the early 1960s, which was both lighter and nearly as powerful as the centre-pull design.</p>\n<p>Side-pull brakes quickly became favoured by the pros and, with roadies of the past just as keen to imitate the peloton as today’s riders, the demand for side-pull brakes grew massively, with most manufacturers bringing their own imitation of Campagnolo’s revolutionary brake to market, quickly marginalising the poor old centre-pull.</p>\n<p>Campagnolo’s single-pivot design remained largely unchanged until the late 80s, when dual-pivot caliper brakes were introduced by Shimano.</p>\n<p>Single-pivot caliper brakes are rarely seen these days because they have been superseded in almost all cases by dual-pivot caliper brakes.</p>\n<h3>Dual-pivot caliper brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Dual-pivot brakes are an improvement on the classic single-pivot side-pull brake.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Just like single-pivot brakes, dual-pivot brakes are mounted by a single bolt in the fork crown and brake bridge, but they have a yoke that attaches to this and separates the pivot points for the two arms.</p>\n<p>This design offers greater mechanical advantage than a single-pivot design and is also far easier to centre.</p>\n<p>Dual-pivot caliper brakes are best thought of as a combination of the actions of a centre-pull (more to come on that) and side-pull brake – the offset pivots mean that the two arms follow a similar path when the brake is applied.</p>\n<p>A dual-pivot brake will often come in slightly heavier than a single-pivot brake, but the difference is marginal with modern, featherweight designs.</p>\n<p>Clearance for wide tyres is typically quite limited with dual-pivot caliper brakes – you can usually squeeze in a 28mm tyre – but long-arm versions of the brakes are available for those who want to use <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mudguards-fenders-a-buyers-guide/\">mudguards on their road bike</a>.</p>\n<h3>Direct-mount caliper brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Direct-mount brakes mount via posts integrated into a frame.</span></figcaption><span> <i>Matthew Allen / Immediate Media</i></span></div>\n<p>Direct-mount caliper brakes mount via posts integrated into the frame.</p>\n<p>They’re now the norm on high-end rim brake road bikes because they can offer stronger braking, alongside increased clearances and purported – if very small – aero benefits.</p>\n<p>While similar in appearance and mounting to some direct-mount centre-pull brakes, they are mechanically different because they’re not operated by a straddle cable.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Rim brakes mounted under the bottom bracket are fortunately a thing of the past.</span></figcaption><span> <i>Markus Greber</i></span></div>\n<p>Since the two caliper arms are not connected to each other, applying the brakes can result in the two half calipers moving apart from each other, particularly on skinny seatstays, which reduces braking efficiency and modulation. For this reason, you’ll often see a thin metal bridge connecting the two sides of the rear brake.</p>\n<p>Bike makers went through a phase of positioning the rear direct-mount caliper under the bottom bracket. This wasn’t a good idea: the brake was in the firing line for road dirt and tended to rub against the wheel rim under heavy pedalling loads. Fortunately, it’s a thing of the past on the latest road bikes.</p>\n<h3>Centre-pull caliper brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Centre-pull brakes use a straddle cable to pull two arms together.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Centre-pull brakes operate in a similar fashion to dual-pivot caliper brakes, but are actuated by a straddle cable that is attached to both arms. Both of the pads travel in an upwards direction.</p>\n<p>Centre-pull brakes were the norm in the peloton until the introduction of the aforementioned Campagnolo Record brake and its many imitators.</p>\n<p>The brakes offer excellent power, modulation and generous clearances, but require additional hardware over a side-pull design (straddle cable, cable hanger) and typically weigh quite a bit more.</p>\n<p>Centre-pull brakes have enjoyed brief periods of popularity for various purposes since then, and remained popular on cheaper road bikes and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-touring-bike-how-to-choose-the-right-one-for-you/\">touring bikes</a> until the early 1980s. You will most commonly see centre-pull brakes in the wild on bikes from this period.</p>\n<p>These days, smaller manufacturers such as Rene Herse and Paul Components continue to make centre-pull brakes, with modern designs that offer generous clearances and exceptional power (especially when mounted using braze-on studs), still making them a compelling choice for touring and randonneuring bikes.</p>\n<p>As an aside, the legendary Campagnolo Delta introduced in 1985 was (sort of) a centre-pull design and is often considered to be one of the most beautiful brakes of all time. It is still coveted by collectors of retro bike parts <a href=\"https://www.bikeradar.com/features/5-of-the-all-time-worst-pieces-of-road-tech/\">despite its extremely questionable functionality</a>.</p>\n<h2>V-brakes</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> V-brakes work in a similar way to traditional cantilever brakes.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>V-brakes – or direct-pull cantilever brakes by their proper name – work in a similar way to traditional cantilever brakes (see below), with the two halves bolted to bosses welded to the frame.</p>\n<p>They are side actuated, with the cable housing fixed to one arm by way of a ‘noodle’, and the inner cable clamped to the other. As the cable is pulled through the housing, the two arms are drawn towards one another, moving the pads towards the rim.</p>\n<p>V-brakes were introduced at a time when suspension was becoming more common and, as a V-brake system does not require a fixed cable stop on the frame or fork, they quickly became popular on mountain bikes, eventually supplanting the traditional cantilever brake in most cases.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> V-brakes on a 2011 mountain bike.</span></figcaption><span> <i>Steve Behr / Immediate Media</i></span></div>\n<p>V-brakes didn’t become widely popular for use on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cyclocross-bikes/\">cyclocross bikes</a> because the reduced clearance between the pads and rim, and the proximity of the ‘straddle’ cable and tyre, can cause issues in especially muddy conditions.</p>\n<p>While V-brakes have been replaced by disc brakes on the vast majority of mountain bikes, they remain popular on hardy touring bikes, some hybrids and tandems, with even the biggest manufacturers offering modern brakes that are more powerful and easier to set up than ever before.</p>\n<p>V-brakes can be prone to rubbing if they’re not cared for though, as the two sides may not pull back from the rim symmetrically if not set up right and kept clean.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> V-brakes still feature on commuter and town bikes.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>V-brakes use a different cable pull ratio to cantilever brakes (cantilever brakes use the same cable pull ratio as caliper brakes) so a special long-pull lever, which pulls through roughly double the amount of cable as a regular lever, must be used.</p>\n<p>This makes regular V-brakes incompatible with road levers without the use of a <a href=\"http://problemsolversbike.com/products/brakes/travel_agents_-_6416\" target=\"_blank\">Travel Agent-style, cable pull converter</a>. (<a href=\"https://link.monetizer101.com/shop-rest/api/track/deeplink/608?sourceUrl=http%3A%2F%2Fwww.wiggle.co.uk%2Ftektro-rl520-drop-bar-brake-lever%2F\" target=\"_blank\">Tektro’s RL520 brake lever</a> and a few others are the exceptions here because they’re optimised for use with regular V-brakes.)</p>\n<p>Short-arm, mini-V brakes that work with road levers do exist, but further exacerbate clearance issues.</p>\n<h2>Every brake that has ever existed</h2>\n<p>Rather like the history of life on earth, the bike brake has gone through an evolutionary journey on its way to the apex stoppers that rule the world today. For the brake nerd, here’s a guide to the hopeful monsters that have roamed the earth attached to bicycles past from BikeRadar’s deputy editor, <a href=\"https://www.bikeradar.com/author/jackluke/\">Jack Luke</a>.</p>\n<p>Most were destined to extinction, but a few live on in forgotten niches of the cycling world.</p>\n<h3>Drum brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Sturmey drum brakes are not great stoppers, but look cool.</span></figcaption><span> <i>Robert Smith Photography</i></span></div>\n<p>In a drum brake, the brake lever pulls a cable to operate pads enclosed within the hub. These are pushed outwards towards a braking surface on the inside of the hub, to slow the bike down.</p>\n<p>The design means that the braking surface is fully enclosed and so is weather resistant. But the brake is heavy and prone to overheating. Drum brakes are a bit of a living fossil, as they’re still found in Dutch bikes and as drag brakes on older tandems, but pretty much nowhere else.</p>\n<h3>Coaster brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You may find coaster brakes on Dutch bikes.</span></figcaption><span> <i>George Scott / Our Media</i></span></div>\n<p>Another living fossil that lives on in bikes from the Netherlands, the coaster brake works on the rear wheel. Stop pedalling and the bike will freewheel, but turning the pedals backwards will operate the braking mechanism.</p>\n<p>Again, the advantage is that the brake is weatherproof. It also means there’s no bar-mounted brake lever and no cabling, lowering maintenance needs. But like the drum brake, it’s heavy and prone to overheating. It’s also easy to lock up, causing skidding.</p>\n<h3>Cantilever brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cantilever brakes are seldom seen nowadays.</span></figcaption><span> <i>Brother Cycles </i></span></div>\n<p>A recent extinction event has been the near-demise of the cantilever brake; it wasn’t so long ago that it was the go-to stopper on cyclocross bikes, before it was out-competed by the disc brake. You can still find cantis on some touring and tandem bikes, and they live on among die-hard cyclocross traditionalists.</p>\n<p>The canti is a rim brake with the brake calipers screwed onto bosses on the bike’s fork blades and seatstays. There’s a separate caliper on each side, with lever arms protruding outwards, which are connected by a straddle wire. Applying the brake pulls up the straddle wire and applies the brakes.</p>\n<p>The design has the advantages that it’s very light, gives very wide clearance and can exert a lot of leverage on the wheel rim. On the down side, setup can be tricky, resulting in poor, noisy performance if it’s not done right.</p>\n<h3>U-brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> U-brakes are still commonly used on BMXs.</span></figcaption><span> <i>Dia Compe / ISON</i></span></div>\n<p>Enjoying a brief heyday in the 1980s, like a cantilever brake the U-brake is mounted to frame bosses. It has the same issues of adjustment and maintenance as a traditional cantilever and also problems with leverage, clearance and clogging. You still find U-brakes on BMX bikes though, thanks to their low profile.</p>\n<h3>Hydraulic rim brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Magura hydraulic rim brakes offer more modulation than conventional brake cables.</span></figcaption><span> <i>Steve Behr / Our Media </i></span></div>\n<p>Another living fossil, the hydraulic rim brake uses a hydraulic cylinder on each side to push the brake pads against the wheel rim. Magura’s H series hydraulic rim brake is still available and uses this tech, although the system is now only available for flat-bar bikes. It’s less efficient than disc brakes and has a whole lot of proprietary parts.</p>\n<h3>Roller cam brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The concept of a roller cam brake briefly ported over to aero road bikes.</span></figcaption><span> <i>James Huang / Immediate Media</i></span></div>\n<p>Roller cam brakes are a fascinating design, which is similar to a centre-pull caliper, but uses a triangular cam that moves over rollers (hence the name) in place of a straddle wire to actuate the brake arms.</p>\n<p>This can be hard to visualise, so we recommend you <a href=\"https://youtu.be/9DAPHdCGvoE?t=135\" target=\"_blank\">have a look at this video</a>, which shows the brakes in operation. The design is interesting because altering the shape of the cam can alter the characteristics of the braking.</p>\n<h3>Rod brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> This bike is fitted with rod brakes.</span></figcaption><span> <a href=\"https://commons.wikimedia.org/wiki/File:Raleigh_tourist_rod-brake,_ca._1980-01.jpg\"><strong>periwinklekog / Creative Commons</strong></a></span></div>\n<p>Rod brakes used steel rods in place of cables to pull both sides of a braced caliper upwards, striking the inside diameter of the rim.</p>\n<p>If you ride a bike with these brakes, you’ve most likely either nicked a bike from outside a butcher’s shop or enjoy tinkering with stationary steam engines.</p>\n<h3>Spoon brakes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A metal spoon brake pressed against the rear wheel to bring it to a stop, or at least slow it down</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>When <a href=\"https://www.bikeradar.com/features/routes-and-rides/sweden-3-day-penny-farthing-race/\">pennyfarthings</a> with solid tyres were the acme of bike tech, spoon brakes were the stoppers of choice. Spoon brakes were practically the same as a rod brake, but used the outside diameter of the tyre as a braking surface. This is basically a more elegant version of jamming your precious shoes between your frame and wheel. Mercifully gone and forgotten.</p>\n<h3>Fixed-gear braking</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Yes, technically fixed counts too.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>And for the sake of the pedants out there, we do realise a <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-fixies-and-singlespeed-bikes/\">fixed gear</a> is technically speaking a brake. While we would never recommend relying solely on a fixed cog for braking (what if your chain rolls off the cog or chainring?) unless you’re on the track, and it’s not road-legal in the UK, slowing your bike down with your meaty calves is an experience worth trying.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"729a1a55106745162e1da96c18c80ade7dc35dc7164e4e052650df9b4efd6825","category":"Cycling"}