{"title":"Particulate Matter-Induced Oxidative Stress &ndash; Recent Mechanistic Insights from In Vitro Studies","link":"https://www.preprints.org/manuscript/202404.0131/v1","date":1712036853000,"content":"Inhaled particulate matter (PM) is a key player in the millions of yearly deaths worldwide related to air pollution. The oxidative potential of PM provides an indication of its ability to promote an oxidative environment. When the human lungs are exposed to PM, the reactive oxygen species (ROS) generated in such oxidative environment, if excessive, may lead to cell damage via oxidative stress. Inflammation, endoplasmic reticulum stress, airway remodeling, and many different cell death modes (apoptosis, ferroptosis, pyroptosis, among others) can be triggered by oxidative stress via complex molecular pathways, which also involve the adaptive cellular response. But ROS can also directly interact with macromolecules such as proteins and lipids, as well as nucleic acids, having been reported to induce DNA damage and epigenetic modifications, which jeopardizes homeostasis. These facts have been extensively studied in in vitro models and confirmed in in vivo models.In this review, we delve beyond conventional assessments of airborne particles, discussing their oxidative potential and the PM-induced ROS-mediated cellular damage observed in in vitro models. The close link between oxidative stress and inflammation, and the manifestation of different cell death modes is highlighted by reviewing the latest literature. The effects of ROS on the balance of DNA damage and repair, carcinogenicity and epigenetics interplay are then analyzed. Finally, we expand on the latest reports on the antioxidants’ potential to counteract the deleterious effects of ROS, and disclose future perspectives for the topic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"729cd1d87b7d3bc2c9d77adfa7d5374c0ae8cdb9a53a662f7aa48ed68d51e099","category":"Interdisciplinary"}