{"title":"Mac Gaming to Gain DirectX 12 Support via CrossOver 23","link":"https://www.macrumors.com/2023/06/03/mac-to-gain-directx-12-support-via-crossover/","date":1685783605000,"content":"CrossOver will gain support for DirectX 12 starting this year to enhance the experience of playing Windows games on macOS, CodeWeavers this week <a href=\"https://www.codeweavers.com/blog/mjohnson/2023/6/1/unleashing-the-gaming-revolution-crossover-macs-directx-12-support-update\">announced</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/diablo-directx-12-support.jpg\" alt width=\"1500\" height=\"976\" />\r<br />\nCrossOver allows macOS, Linux, and ChromeOS users to run Windows apps <a href=\"https://www.macrumors.com/2020/11/18/run-windows-software-on-m1/\">as if they were native</a> by translating Windows APIs into their Mac equivalents. CrossOver currently only supports Microsoft's DirectX 11. DirectX 12 is the latest collection of graphics rendering APIs available on Windows and Xbox, promising better performance, efficiency, and optimal use of multiple CPU and GPU cores.\r<br />\n\r<br />\nSupport for DirectX 12 games will be added to CrossOver on a per-title basis to circumvent bugs. From CodeWeavers' press release:<blockquote>We have the beginnings of DirectX 12 support, and our QA team has confirmed that Diablo II Resurrected is running on macOS with early pre-alpha builds of CrossOver 23, which will be released later this summer. There are still bugs, but the fact that it's running at all is a huge win.\r<br />\n\r<br />\nWhile we are elated with this breakthrough, we acknowledge that our journey has just begun. Our team's investigations concluded that there was no single magic key that unlocked DirectX 12 support on macOS. To get just Diablo II Resurrected running, we had to fix a multitude of bugs involving MoltenVK and SPIRV-Cross. We anticipate that this will be the case for other DirectX 12 games: we will need to add support on a per-title basis, and each game will likely involve multiple bugs.</blockquote>The first game to gain DirectX 12 support in CrossOver will be \"Diablo II Resurrected,\" but CodeWeavers plans to add more titles in the future. CodeWeavers <a href=\"https://www.codeweavers.com/crossover#compatibility\">maintains a compatibility database</a> so you can see what may work work well with the software.  \r<br />\n\r<br />\nThe first beta of CrossOver 23 is set to be released this summer, followed by the official launch later this year.<div>Tags: <a href=\"https://www.macrumors.com/guide/mac-gaming/\">Mac Gaming</a>, <a href=\"https://www.macrumors.com/guide/apple-silicon/\">Apple Silicon</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/03/mac-to-gain-directx-12-support-via-crossover/\">Mac Gaming to Gain DirectX 12 Support via CrossOver 23</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/mac-gaming-to-gain-directx-12-support-via-crossover-23.2391432/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"72a4c08f7f0f0d0b737921e84025dc719a01f53a1b5e65843e478cb1e9eb5bac","category":"Apple"}