{"title":"Revisiting and Rethinking on Staging (Severity and Complexity) Periodontitis from the New Classification System: A Critical Review with Suggestions for Adjustments and a Proposal of a New Flowchart","link":"https://www.preprints.org/manuscript/202406.1763/v1","date":1719352835000,"content":"This critical review revisited the new classification system for periodontitis, specifically for staging, suggesting modifications, and introducing a new flowchart for a better clinical evaluation. It evaluated articles published between 2018 and 2024 in the English language, which had an educational motivation focused on staging periodontitis. PubMed/MEDLINE, Web of Science, and Embase databases were used to retrieve the articles. The focus questions involved the analysis of all parameters for staging periodontitis. A total of 836 articles were initially found; 388 duplicated were excluded; 448 were evaluated by title and abstract; 26 articles followed for full-text reading, and 6 articles were included in this critical review (k=0.98). All articles included detailed parameters and steps about how to diagnose periodontitis. Therefore, it was possible to observe instability and “gray zones” in the staging step, which was due to a lack of priority and an organized order sequence. This review suggests the severity parameters cannot be overcome by complexity parameters, following a cumulative sequence: CAL (1st), RBL (2nd), TLP (3rd), and, after, complexity parameters. An exception must be permitted only for complexity factors between Stages III and IV that can change the initial Stage (III or IV) obtained through the severity analysis, but only between themselves. Moreover, for patients without tooth loss or with TLP of ≤4 teeth (without need for complex rehabilitation) and presenting any type of drifting or flaring or a secondary traumatic occlusion, it cannot be a justification for moving the diagnosis from Stage III to Stage IV.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"72a609eddcf360f7c4902d88c2e4cae6df02468560fe4579417c63cc10505ad2","category":"Interdisciplinary"}