{"title":"Apple has a new online storefront and there’s a lot to see","link":"https://www.macworld.com/article/352583/apple-online-store-redesign-cards-tab-products.html","date":1628081137000,"content":"<div>\n<section><div></div></section><p>We may have seen the last ‘Be Right Back.’ message on the Apple Store. After inexplicably going down for about an hour late Tuesday night, the online Apple Store returned with a new tab, <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/store&amp;subid1=1-1-352583-1-0-0\">a new look</a>, and a whole lot of new puns.</p>\n\n\n\n<p>While Apple has been selling products online for years, it hasn’t had a true storefront that encouraged browsing <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techcrunch.com/2015/08/06/apple-com-removes-standalone-store-tab-emphasizes-curation-in-huge-redesign/&amp;xcust=1-1-352583-1-0-0&amp;sref=https://www.macworld.com/feed\">since the last redesign in 2015</a>. With this new look, products still have to buy links that go to dedicated sections of the store, but you no longer need to jump through hoops or search for a specific product to browse the digital shelves. The leftmost tab next to the Apple logo now says “Store” as it did six years ago, and clicking it brings you to what Apple describes as “The best way to buy the products you love.” </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-store-down.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Will Apple still need to shut down the entire store to add something new?</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>It certainly is a better experience and is much closer to the iOS and iPadOS apps. The front page of the store is filled with links to Apple’s family of products as well as a series of cards advertising the latest stuff with clever slogans like “Stick Out” (MagSafe), “Blast Past Fast” (iPhone 12), and “A world of winning looks” (Apple Watch International Collection bands). You can still find products the old way, but the new design is more likely to encourage impulse buying. For example, the AirTag is spotlighted as well as the HomePod mini. Shopping assistance and tech support is also easier to find with dedicated cards in the center of the page.</p>\n\n\n\n<p>The look is fairly busy with numerous rows of cards and clickable elements, but overall it’s a letter experience. And it’s possible that Apple might not need to take the store down for hours every time it needs to add a new product, a strange quirk that has is endearing to Apple fans and confounding to anyone looking to buy a product during shutdown times. Apple hasn’t announced anything about back-end changes to the store, and since it also took down the Apple Store app when updating Apple.com it’s entirely possible the practice could continue.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"72a97721b378d41659b78234399b230eb24f779763d11ec6edde8d51ee9e4e56","category":"Apple"}