{"title":"Acute strength exercise training impacts differently the HERV-W expression and inflammatory biomarkers in resistance exercise training individuals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303798","date":1715868000000,"content":"<p>by Lucas Vinicius Morais, Samuel Nascimento dos Santos, Tabatah Hellen Gomes, Camila Malta Romano, Patricia Colombo-Souza, Jonatas Bussador Amaral, Marina Tiemi Shio, Lucas Melo Neves, André Luis Lacerda Bachi, Carolina Nunes França, Luiz Henrique da Silva Nali</p>\r\nBackground <p>Human Endogenous Retroviruses (HERVs) are fossil viruses that composes 8% of the human genome and plays several important roles in human physiology, including muscle repair/myogenesis. It is believed that inflammation may also regulate HERV expression, and therefore may contribute in the muscle repair, especially after training exercise. Hence, this study aimed to assess the level of HERVs expression and inflammation profile in practitioners’ resistance exercises after an acute strength training session.</p> Methods <p>Healthy volunteers were separated in regular practitioners of resistance exercise training group (REG, n = 27) and non-trained individuals (Control Group, n = 20). All individuals performed a strength exercise section. Blood samples were collected before the exercise (T0) and 45 minutes after the training session (T1). HERV-K (HML1-10) and W were relatively quantified, cytokine concentration and circulating microparticles were assessed.</p> Results <p>REG presented higher level of HERV-W expression (~2.5 fold change) than CG at T1 (p&lt;0.01). No difference was observed in the levels of HERV-K expression between the groups as well as the time points. Higher serum TNF-α and IL-10 levels were verified post-training session in REG and CG (p&lt;0.01), and in REG was found a positive correlation between the levels of TNF-α at T1 and IL-10 at T0 (p = 0.01). Finally, a lower endothelial microparticle percentage was observed in REG at T1 than in T0 (p = 0.04).</p> Conclusion <p>REG individuals exhibited a significant upregulation of HERV-W and modulation of inflammatory markers when compared to CG. This combined effect could potentially support the process of skeletal muscle repair in the exercised individuals.</p>","author":"Lucas Vinicius Morais","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"72ac952fc4a140b312dd5511298143801a24c595f7811404ea34f53b557abde0","category":"Interdisciplinary"}