{"title":"Learn these iPhone gestures to tap and swipe like a pro","link":"https://www.macworld.com/article/230655/iphone-touch-gestures-and-commands.html","date":1632479400000,"content":"<div>\n<section><div></div></section><p>Since the iPhone 13 is mostly screen, getting around requires a little finger dexterity. Everything from the navigation to customization can be done with gestures and there’s a lot to know. So whether you’re upgrading from an iPhone 8 or have been using the home indicator since the iPhone X, check out our guide to every gesture and command you need to know.</p>\n\n\n\n<h2>Navigation</h2>\n\n\n\n<p><strong>Return Home:</strong> Let’s start with the most basic of Home button features: returning to the home screen. Just swipe up from the bottom of the screen. Easy!</p>\n\n\n\n<p><strong>Wake it up:</strong> You can still raise the phone to wake it like you can on other modern iPhones or tap the side button. Modern iPhones also support tap-to-wake: just tap the display to wake it up.</p>\n\n\n\n<p><strong>Jump between apps:</strong> Swipe left or right along the bottom edge of the phone to jump back and forth between apps. You can sort of “flick” from the bottom corners, moving your finger up and over, to “bounce” between the apps, or just slide directly side-to-side along the bottom edge.</p>\n\n\n\n<p><strong>App switcher:</strong> Want to see all your running apps? Swipe up from the bottom edge and pause for a second with your finger still on the display. App cards will quickly pop up, and you can lift your finger off and swipe around through them.</p>\n\n\n\n<p><strong>Close an app:</strong> You shouldn’t have to do this often, but if you need to kill an app from the app switcher (see above), just swipe up on the app card. It doesn’t need to be the topmost card, and you can even swipe away multiple apps at once.</p>\n\n\n\n<h2>Customization</h2>\n\n\n\n<p><strong>Edit the home screen:</strong> Hold down on an app until the menu shows up. Then select <em>Edit Home Screen</em>. All of your apps will start to wiggle and have an (X) icon in the corner. Tap-and-hold apps to move them around, drag them on top of each other to make a folder. Tap the (X) icon to delete them. From the home screen, tap Done in the upper right to return your screen to normal.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/apps-wiggle-ios-100813114-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/apps-wiggle-ios-100813114-large.jpg?auto=webp\" /></a><figcaption><p>To move apps, put them in folders, or delete them, you need to get to the “app wiggle” state.</p>\n</figcaption></figure></div>\n\n\n\n\n<p><strong>Hide a home screen:</strong> When in “wiggle mode,” you can tap the dots at the bottom of the screen above the dock to see a list of all of your screens. Then tap the checkmark below them to hide it from view.</p>\n\n\n\n<p><strong>Add widgets to the home screen:</strong> Also in “wiggle mode,” you’ll see a “+” symbol in the top left corner. Tap it and you’ll be taken to the screen of widgets, where you’ll be able to scroll through the ones from apps you have installed. Tap one you like, pick the size you want, and tap <em>Add Widget</em>. Then move it where you want on the home screen.</p>\n\n\n\n<p><strong>Delete a widget:</strong> Tap and hold on a widget and select <em>Remove Widget</em>.</p>\n\n\n\n<h2>Quick shortcuts</h2>\n\n\n\n<p><strong>Take a screenshot:</strong> Simply press the side button and the volume up button at the same time.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/iphone-x-buttons-100813097-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/iphone-x-buttons-100813097-large.jpg?auto=webp\" /></a><figcaption><p>All of your iPhone’s buttons are on the sides, but only one is called the “Side button.”</p>\n</figcaption></figure></div>\n\n\n\n\n<p><strong>App icon options:</strong> The latest iPhones don’t have 3D Touch, but they do most of the things 3D Touch used to do with a simple long press. Tap-and-hold on a web link to see a preview window with a list of options (Open in Safari, Add to Reading List, Copy Link, and so on). You can do the same with dates and times to quickly make calendar events or reminders, addresses to view them in Maps or get directions, and more.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/10/long-press-ios-100813115-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/10/long-press-ios-100813115-large.jpg?auto=webp\" /></a><figcaption><p>Most of the features of 3D Touch are now replicated with a long press.</p>\n</figcaption></figure></div>\n\n\n\n\n<p><strong>Reachability:</strong> If you’re having trouble reaching stuff at the top of your iPhone’s screen, this feature can help. Drag down on the bottom edge of the display to shift everything down. Drag up again (or wait a few seconds) to return it to normal. If Reachability isn’t working, you can turn it on in Settings &gt; <em>Accessibility</em> &gt; <em>Touch</em>.</p>\n\n\n\n<p><strong>Notifications:</strong> You still swipe down from the top of the screen, just as with other iPhones. But on modern iPhones with a camera notch and no Home button, there are two “swipe from the top of the screen” gestures; swipe from the <em>left</em> side of the sensor notch to get to your notifications.</p>\n\n\n\n<p><strong>Control Center:</strong> With the bottom of the screen consumed with other home gestures, the control center swipe has moved to the top of the screen. Just swipe from the <em>right</em> side of the sensor notch. The right “horn,” if you will. Most of the icons in the Control Panel can be long-pressed to open settings or expanded functions.</p>\n\n\n\n<p><strong>Invoke Siri:</strong> Just press and hold the side button for a couple of seconds. Once the Siri interface pops up, you can issue your command or ask your question without saying “Hey, Siri” first. Of course, you can still invoke Siri hands-free by saying, “Hey, Siri!”</p>\n\n\n\n<p><strong>Apple Pay:</strong> Tap the side button twice. You’ll have to authenticate the purchase with either Face ID or your passcode. A tip: don’t hold your phone to the payment terminal, <em>then</em> authenticate it, then hold it back to the payment terminal again. Just double-tap that side button and look at your iPhone to authenticate with Face ID in one quick motion, and then tap it to the payment terminal.</p>\n\n\n\n<p><strong>Power off and S.O.S.:</strong> To get the power off slider and S.O.S. button, press <em>and hold</em> the side button and either volume button for a few seconds. You’ll feel a quick tap-tap-tap.</p>\n\n\n\n<p><strong>Temporarily disable Face ID:</strong> The above command (press and hold the side button and either volume button) also disables Face ID temporarily. You <em>must</em> use your passcode to unlock your phone (after which Face ID functionality will be restored). This quick easy gesture is designed to be done without looking, even in your pocket, with a tap-tap-tap vibration to let you know it worked. This way if your phone is taken from you or seized by law enforcement, they can’t unlock it simply by holding it up to your face.</p>\n\n\n\n<p><strong>Force reset:</strong> Quickly tap the volume up button, then the volume down button, then press <em>and hold</em> the side button until the Apple logo appears (usually 10 to 20 seconds). If your iPhone is totally unresponsive, this is the first thing you should try. </p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2017/11/how-to-iphone-x-power-off-100742258-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2017/11/how-to-iphone-x-power-off-100742258-large.jpg?auto=webp\" /></a><figcaption><p>If your iPhone is unresponsive, try pressing Volume Up, Volume Down, then press and hold the Side button until the Apple logo shows up (around 15 to 20 seconds).</p></figcaption></figure></div>\n\n\n\n\n<h2>Text tinkering</h2>\n\n\n\n<p><strong>Invoke the Edit Bar:</strong> Your iPhone 13 has a hidden Edit Bar that makes it a little easier to cut, copy, paste, undo, and redo. In any text entry field, just tap the screen with <em>three fingers</em>, holding them on the screen for a second or two.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/07/ios13-gestures-shortcutbar-100802301-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/07/ios13-gestures-shortcutbar-100802301-large.jpg?auto=webp\" /></a><figcaption><p>If you’re not a fan of all that swiping, tap with three fingers to bring up the Edit Bar.</p>\n</figcaption></figure></div>\n\n\n\n\n<p><strong>Undo and Redo:</strong> If you don’t want to use the Edit Bar, you can quickly undo or redo your last command or text entry. A three-finger swipe to the left will Undo, and a three-finger swipe to the right will Redo.</p>\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2019/07/ios13-gestures-undoredo-100802303-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2019/07/ios13-gestures-undoredo-100802303-large.jpg?auto=webp\" /></a><figcaption><p>Three-finger swipes to the left and right make Undo and Redo a breeze.</p>\n</figcaption></figure></div>\n\n\n\n\n<p><strong>Cut, Copy, and Paste:</strong> If the Edit Bar is too slow for you, you can use some three-finger gestures to cut, copy, and paste in a flash. A three-finger “pinch” gesture will Copy the selected text. A second three-finger pinch will Cut it. Then just do the gesture in reverse (a three-finger un-pinch) to Paste.</p>\n\n\n\n<p><strong>Move the cursor:</strong> In any text entry field, simply tap-and-drag the cursor to wherever you want it to go. Tap-and-hold on the space bar on the on-screen keyboard. You’ll see all the letter keys turn blank, and then you can move the text input cursor by dragging your finger around the whole keyboard area as though it were a touchpad. </p>\n\n\n\n<p><strong>Select text:</strong> Double-tap a word to select that word, or triple-tap a word to select the whole sentence. Quadruple-tap to select an entire paragraph! Drag the endpoints left or right to change your text selection.</p>\n\n\n\n<p><strong>Drag the scroll bar:</strong> Twitter, Safari, Apple News, you name it; if you see a scroll bar on the right side of the display, simply tap and hold it until you feel a little haptic feedback and the scroll bar grows wider. Then you can drag it up and down to quickly fly up and down the page. If you’re having trouble “grabbing” the scroll bar, try holding just a little further away from the edge of the screen—if you’re close to the edge, it doesn’t work well.</p>\n\n\n\n<p><strong>Select multiple apps:</strong> In many apps that let you select items (like Photos or Files) you can select multiple items by tapping-and-dragging with two fingers.</p>\n\n\n\n<h2>Safari</h2>\n\n\n\n<p><strong>Jump to the top of the page:</strong> Tap the area right below the notch to jump directly to the top of the page no matter how far down you’ve scrolled.</p>\n\n\n\n<p><strong>Move between tabs: </strong>You can get to your open tabs two ways: Tap the tab icon in the bottom left or swipe left or right on the bottom address bar to switch tabs</p>\n\n\n\n<p><strong>Add a bookmark:</strong> Tap and hold the bookmark icon to find the shortcut for adding the current page to your bookmarks.</p>\n\n\n\n<p><strong>Go back or forward:</strong> Swipe on the left or right edge of the screen to go back or forward to the most recent page.</p>\n\n\n\n<p>M<strong>ove a tab to a group:</strong> New to Safari in iOS 15 are Tab Groups, which let you organize tabs into easy-to-find collections. Tap and hold on the address bar and select Move to Tab Group to add any open tabs to a new or existing group.</p>\n\n\n\n<p><strong>Start a private browsing session:</strong> Tap and hold on the new tab icon in the bottom right corner to select <em>Private</em> or <em>New Private Tab</em>.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"72af1ec45f2b6f491dc5ab94d219373b8524d6fee350aa0cfe92b3ebde37561a","category":"Apple"}