{"title":"Recruitment and Losses through the Life Cycle for Intertidal Clams in Willapa Bay, Washington","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/7411697?af=R","date":1722582357000,"content":"<p>When bivalve aquaculture production relies on natural recruitment, yields may decline due to density-independent constraints at multiple life stages. These life stage transitions include larval settlement, which is typically variable with rapid losses of newly settled individuals and the additional mortality from predation or abiotic factors (e.g., temperature, desiccation, and physical disturbance) as the bivalves grow. Recruitment monitoring and outplants were used to evaluate the potential limiting factors affecting different life stages in two nonnative clam species, Manila clams, <i>Ruditapes philippinarum</i>, and softshell clams, <i>Mya arenaria</i> in Willapa Bay, Washington, USA. Recruits (250–500 <i>µ</i>m) did not differ in cumulative abundance in 2023 relative to prior years of monitoring (five recruitment seasons between 2011 and 2017). Recruits surviving to the end of the summer represented 12% or less of those that had arrived, but still showed spatial patterns consistent with rates of arrival. Manila clams outplanted across an elevation gradient suffered high mortality below mean lower low water regardless of size class (small: 8 mm and large: 20 mm), where native rock crabs (<i>Cancer productus</i>) were abundant. Clam growth declined at higher tidal elevations consistent with inundation time. European green crabs (<i>Carcinus maenas</i>) were relatively abundant at midtidal levels where commercial clam aquaculture typically occurs in the bay and where small clams were particularly reduced without predator protection from mesh. While these data support that green crabs may be reducing survival of 1-year-old clams at midintertidal elevations, they also identify earlier bottlenecks to repopulating commercial clam beds, which point out why seeding clams is used to maintain consistent production. Further exploration is needed before green crabs can be singled out as a new limit on clam yields relative to the roles of predation across the size classes of clams in Willapa Bay.</p>","author":"Emily W. Grason, \nLidia Garcia, \nElla Ong, \nJennifer L. Ruesink, \nSofia Priyadarsani Das","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"72c24dfe4f686969a1e2a29d59cad73f02f062517790111865a491d082622a71","category":"Environment"}