{"title":"Tour de France 2023 stage 13 preview - a summit finish to Grand Colombier","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-13-preview","date":1689264388000,"content":"\n      <p><b>Distance: </b>137.8km<br /><b>Start location: </b>Châtillon-sur-Chalaronne<br /><b>Finish location: </b>Grand Colombier<br /><b>Start time: </b>13:45 CEST<br /><b>Finish time (approx): </b>17:12 CEST</p>\n<p>It’s Bastille Day at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, which means crowds of partying locals out on the roadside, French riders itching to get into the breakaway, and an expedient press demanding a home winner. It’s always a point of pride for the host nation to perform well on the day of their national holiday celebrating the storming of the Bastille prison during the 1789 revolution, yet they’ve toiled in recent years, with Warren Barguil’s success in Foix during the 2017 edition their only victory on this day in the last 18 years. </p>\n<div></div>\n<p>Unless a French rider has by now surprisingly emerged as one of the top GC contenders, that baron run is unlikely to come to an end today, as this stage finishes atop the only Jura Mountains summit of the race, and one of this Tour’s hardest climbs: Grand Colombier. Visually striking for the aesthetically pleasing way its so-called ‘lacets’ roads that weave up the mountain, and a total brute with excessive length and frequent brutally steep ramps, it’s the kind of huge mountain top finish where the GC riders take the spotlight, and swallow up the break to contest for the stage win themselves. </p>\n<p>That was certainly the case in 2020, the only other time a Tour stage has finished at its peak. Jumbo-Visma set a ferocious tempo up the whole climb, with Wout van Aert, Tom Dumoulin and Sepp Kuss each taking huge turns, and succeeded in dramatically ending Egan Bernal’s hopes of defending his yellow jersey title by distancing him early. It was a masterful display of control on behalf of Jumbo’s leader Primož Roglič, but also one that exemplified the oft-quoted maxim of how the Tour can be lost on days like this, it can’t be won; Roglič might have ended the day safely in yellow, but he didn’t land a killer blow to his Slovenian compatriot Tadej Pogačar, who stuck on his wheel the whole climb and beat him in the sprint to win the stage. One week later, Pogačar stunned him to take the yellow jersey in the now-famous Planche des Belles Filles time trial. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tappa13.jpg?v=1688382756\" alt /></p>\n<p><i>Stage 13 profile sourced via ASO</i></p>\n<p>Unlike in 2020, the riders will reach the foot of Grand Colombier having only climbed the uncategorised rise to the Hauteville-Lompnes plateau. As well as rendering a breakaway win less likely (the lack of any early mountains make it hard for any stage-hunting climbers to get into the break), this could also lead to some strange, atypical results between the GC favourites, as sometimes this kind of sudden change from flat, easy racing to brutal, uphill climbing can take a rider's legs a while to adjust to. </p>\n<p>The beginning of Grand Colombier is an especially rude awakening, too, with the slope quickly kicking up to over 9%, and featuring many more similarly steep ramps throughout the gruelling 17.4km ride to the top. It’s a mountain that's characterised by its uneven gradient, constantly fluctuating above and beneath its average of 7.1%, and is therefore impossible to ride a steady tempo up. If any GC contenders fail to get into a rhythm, their dreams of the yellow jersey will end today. </p>\n<h3>Contenders</h3>\n<p><strong>Tadej Pogačar</strong> (UAE Team Emirates) and <strong>Jonas Vingegaard</strong> (Jumbo-Visma) have been closely following each other since the last mountain stage, keeping just 17 seconds between them on GC. We expect stage 13 to be a day where we see that time gap change, and potentially even the wearer of the yellow jersey. <br /><br />Pogačar has won on the slopes of Grand Colombier before and will want to replicate such a performance in an attempt to put himself in the race lead. The Slovenian is close behind his rival Vingegaard and has not yet been in the leader's jersey, so this could be a perfect opportunity. We’ve seen both riders launch attacks where the other hasn’t been able to hold their wheel, but who will have the legs and tactics to drop the other in this stage? <br /><br /><strong>Jai Hindley</strong> (Bora-Hansgrohe), however, sits close behind in third place, and he proved his climbing abilities on stage five with a long-range attack in the Pyrenees. He’ll also need to make sure he keeps ahead of those sitting behind him on the GC, as there is only a 1:18 gap between himself and <strong>Carlos Rodríguez</strong> (Ineos Grenadiers), who is in fourth. <br /><br />While Ineos have Rodríguez in fourth place, <strong>Tom Pidcock</strong> sits behind him in eighth. Pidcock looked the strongest he's been so far on Sunday's last summit finish at Puy de Dôme, but the longer climb to the top of Grand Colombier will be a huge test of the Briton's ability to stick with the purer climbers. Fellow Brit <strong>Simon Yates</strong> (Jayco-Alula) is just above him in the standings and has looked in great form so far, and the long climb is much more suited to him that anything that's been climbed so far.. <br /><br /><strong>Thibaut Pinot</strong> (Groupama-FDJ) thrust himself back into the top-10 on GC after breaking away on stage 12 and will maybe given slightly more leeway to make a late escape on the final climb given his six minute deficit to the top two. The French rider hasn't won a stage since 2019, when he won atop the Col du Tourmalet, and is hungry for a stage win as this is his last Tour before retiring. <br /><br />AG2R Citroën Team may use this as an opportunity for <strong>Ben O’Connor</strong> to gain some time back, but it's more likely he'll try to hang in with the GC contenders to try and take the stage. He was part of the successful breakaway on stage 10, the Australian finishing third that day. But this is the first of three mountain stages, and the team may choose to protect Felix Gall instead, who sits three minutes outside the top-10 overall.<br /><br /><strong>Pierre Latour</strong> (TotalEnergies) has been a common sight in the break over the Tour, but it was on the Puy de Dôme that he really showed his climbing abilities. Although he was beaten by Israel-Premier Tech’s <strong>Micheal Woods</strong> (another contender for the stage) on the final gradients, Latour went all out to take second place. He'll be keen to secure a stage win and will be on the lookout for the opportunity if a breakaway can defy expectations and stay away.</p>\n<h3>Prediction</h3>\n<p>We think <strong>Tadej Pogačar</strong> will win stage 13 and put himself into the yellow jersey as the parcours suit him slightly better with one long effort to the finish line rather than multiple tough climbs. </p>\n<p><em>Cover photo by Zac Williams/SWPix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"72cb1d6b2584ce6e7149c04148717ea5ba656bac57cb2345de3895e90084c165","category":"Cycling"}