{"title":"YouTube and Spotify Are Not Launching Vision Pro Apps Either","link":"https://www.bloomberg.com/news/articles/2024-01-18/youtube-and-spotify-join-netflix-in-not-launching-apple-vision-pro-apps","date":1705653215000,"content":"\n<p>Mark Gurman and Ashley Carman, reporting for Bloomberg (Gurman has been killing it this week on the Vision Pro apps beat — he’s breaking all of these stories):</p>\n\n<blockquote>\n  <p>Google’s YouTube and Spotify Technology SA, the world’s most \npopular video and music services, are joining Netflix Inc. in \nsteering clear of Apple Inc.’s upcoming mixed-reality headset. </p>\n\n<p>YouTube said in a statement Thursday that it isn’t planning to \nlaunch a new app for the Apple Vision Pro, nor will it allow its \nlongstanding iPad application to work on the device — at least, \nfor now. YouTube, like Netflix, is recommending that customers use \na web browser if they want to see its content: “YouTube users will \nbe able to use YouTube in Safari on the Vision Pro at launch.” </p>\n\n<p>Spotify also isn’t currently planning a new app for visionOS — the Vision Pro’s operating system — and doesn’t expect to enable \nits iPad app to run on the device when it launches, according to a \nperson familiar with matter. But the music service will still \nlikely work from a web browser. </p>\n</blockquote>\n\n<p>Spotify’s fuck-you to Apple I don’t find surprising, given the <a href=\"https://daringfireball.net/linked/2022/01/27/spotify-airplay\">longstanding animosity</a> between them. But YouTube is a surprise to me, and it’s a sign of how profoundly different the relationship is between Google and Apple today from the pre-Android era. In 2007, before third-party apps were even supported on iOS, YouTube was a built-in app on the original iPhone. (Apple designed and made the app; Google provided the back-end APIs and, obviously, the content.) Then-Google-CEO (and then-Apple-board-member!) Eric Schmidt was invited on stage by Steve Jobs to demo the YouTube app and sing the praises of both the iPhone and the Apple-Google partnership. That Apple-made Google-supported YouTube app was <a href=\"https://en.wikipedia.org/wiki/IPhone_OS_3\">still a built-in default app on iOS when the iPad launched in 2010</a>.</p>\n\n<p>So for both the original iPhone and iPad, YouTube was part of the system software. For Vision Pro, there’s no app at all, not even the iPad app.</p>\n\n<p>Regarding Netflix’s pass on Vision Pro, a little birdie informed me that until this week, the Netflix iPad app was available for those with access to Vision Pro hardware, and it worked just fine. This birdie still has the Netflix iPad app installed on their Vision Pro. Perhaps people at Netflix would disagree with just how well it worked — I don’t know — but I get the strong impression that the decision was political/strategic/spiteful, not technical. Entertainment is not the sole purpose of Vision Pro, but it’s a major one — and surely the primary one for many buyers — and it’s launching without the two biggest video entertainment apps in the world. Apple expected Netflix’s iPad app to be there on launch day.</p>\n\n<p>This isn’t a dealbreaker — watching Netflix through Safari should be OK (albeit without offline downloads, a huge factor for using Vision Pro on airplanes), and many people think of YouTube as a website, not an app. But there’s no way around it: this is a bad look for Apple, not for Netflix or Google. The buck stops with Tim Cook on this. He should have been on the horn with Ted Sarandos and Sundar Pichai and worked this out. It’s his company that’s launching a $3,500 headset.</p>\n\n<p>It’s also worth pointing out that these corporate pissing matches are reciprocal. I doubt we’ll see any calls for Netflix, YouTube, or Spotify to be investigated by antitrust regulators over their refusal to allow their iPad apps to run on Vision Pro. But imagine if Netflix and Spotify <em>wanted</em> to be on Vision Pro on launch day and Apple refused, to leave more room in the spotlight for Apple TV+ and Apple Music. People would lose their shit. We might even get <a href=\"https://daringfireball.net/2023/12/beep_beep\">a testy tweet from Elizabeth Warren</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/19/youtube-spotify-vision-pro\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"72da2186ae41c8707779c76daadde2a9afb0c52184937e1e186f5ef4b776c60b","category":"Tech"}