{"title":"Description of a new endemic Enteromius (Teleostei: Cyprinidae) from the upper Malagarazi in Burundi: Lessons for a protected area under implementation","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15652?af=R","date":1727770425000,"content":"<h2>Abstract</h2>\n<p>Recent collecting efforts in the upper Malagarazi basin (2013–2022) allowed for an integrative study based on qualitative (colour), quantitative (meristic and metric), and barcoding gene [mtDNA, cytochrome c oxidase (COI)] data of specimens similar to <i>Enteromius</i> sp. ‘ascutelatus’, being a previously identified, potentially, new species. Based on these data, the present study confirms its identification as a new species for science, which is here formally described as <i>Enteromius nzigidaherai</i> sp. nov. This new species belongs to the group of <i>Enteromius</i> species for which the last unbranched ray of the dorsal fin is flexible and devoid of serrations along its posterior edge. This species has a horizontal series of black spots at the midlateral level of the sides. Three congeneric species, known from the Congo basin sensu lato, with two of them also found in the upper Malagarazi basin, are most similar to it. However, <i>E</i>. <i>nzigidaherai</i> sp. nov. is distinguished from the two sympatric upper Malagarazi species, that is, <i>E. quadrilineatus</i> and <i>E. lineomaculatus</i>, at least by two meristics and two morphometrics. It is also distinguished from <i>E. urostigma</i>, known from the upper Congo basin, by two meristics and one, apparently related, morphometric. In addition, a barcoding (mtDNA, COI) study revealed that the specimens of <i>E. nzigidaherai</i> sp. nov. form a well-supported, separate lineage, with a K2P genetic distance of more than 10% with specimens identified as <i>E. quadrilineatus</i> and <i>E. lineomaculatus</i>, both originating from the upper Malagarazi basin and for which tissue samples were available. Finally, the new species was found to be endemic to the upper reaches of two left bank affluents of the upper Malagarazi basin: the Muyovozi and the Kinwa. However, both affluents are threatened by human activities, which seem to have resulted in its local disappearance as recent intensive collecting efforts in the latter affluent have remained unsuccessful. The species should thus be considered Critically Endangered (CR) according to IUCN criteria B1ab(ii,iv)c(i,iii). Therefore, it is hoped that the present description draws renewed attention to the importance of aquatic protection in the region by highlighting the need for the effective establishment of the Malagarazi Nature Reserve and concern for its optimal delimitation to efficiently protect the entire ichthyofauna of the upper Malagarazi, without excluding the fish species confined to its affluent rivers.</p>","author":"Anatole Bigirimana, \nTchalondawa Kisekelwa, \nLuis M. da Costa, \nCharlotte E. T. Huyghe, \nGaspard Banyankimbona, \nEmmanuel J. W. M. N. Vreven","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"72eb52841e0601f414b9fb8bd6efed109d3eeee233ba227f10cd9a83b27d81a9","category":"Environment"}