{"title":"Immune response and protection efficacy of formalin‐killed vaccines against Streptococcus iniae in four‐finger threadfin Eleutheronema tetradactylum","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14009?af=R","date":1724947508000,"content":"<h2>Abstract</h2>\n<p>Four-finger threadfin, <i>Eleutheronema tetradactylum</i> farming in southern Taiwan has been facing disease problems caused by <i>Streptococcus iniae</i> since 2018. The development of a vaccine against infectious <i>S</i>. <i>iniae</i> in the cultured threadfin industry is necessary. Thus, this study aimed to examine the efficacy of threadfin immunized formalin-killed cells (FKC) from <i>S</i>. <i>iniae</i> GSI-111 for 42 days post-vaccination (dpv) using two doses of FKC alone (a booster at 14 dpv) as group A, and FKC mixed with ISA763A adjuvant using a single dose as group B or double doses as group C. Immunoglobulin (Ig)-M was purified from threadfin, and rabbit anti-threadfin IgM polyclonal antibodies were used to detect antibody level in immunized fish; the vaccinated group A displayed higher levels at 3 dpv and all vaccinated treatments demonstrated high antibody levels between 14 and 42 dpv. All vaccine groups showed significantly higher values of lysozyme activity at 42 dpv compared with the control group; the vaccinated A group peaked at 14 dpv. The expression profiles of pro-inflammatory and immune-related genes, <i>TNF-α</i>, <i>IL-12A</i>, and <i>C2</i> were upregulated at 3 dpv, while <i>CD8A</i> and chemokine receptor <i>CXCR4</i> were upregulated at 42 dpv. Finally, the threadfins were challenged with <i>S</i>. <i>iniae</i> at 42 dpv. The average relative percent survival was 96% for vaccination A and B treatments, and 100% for vaccination C treatment. In summary, this study demonstrated that FKC vaccines whether formulated with an adjuvant could stimulate immune response and effective protect threadfins against <i>S</i>. <i>iniae</i> infection.</p>","author":"Yin‐Ze Shi, \nAndre Giovanni, \nLi‐Wu Cheng, \nWen‐Rou Huang, \nPei‐Chi Wang, \nShih‐Chu Chen","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"72f15fdf70b4113eaaa41d42e93d0792af1d808bd6f513196db4d8e4a7005c69","category":"Environment"}