{"title":"The safety of maxillary sinus floor elevation and the accuracy of implant placement using dynamic navigation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304091","date":1716472800000,"content":"<p>by Miaomiao Yang, Yongqing Ma, Wenli Han, Zhe Qu</p>\r\nObjective <p>To date, it remains a challenge to conduct maxillary sinus floor elevation (MSFE) owing to heterogeneity of anatomical structures and limited operative visibility of the maxillary sinus. The aim of this study is to investigate the safety of MSFE and the accuracy of implant placement using dynamic navigation.</p> Methods <p>Forty-two implants were placed in thirty-five patients requiring implantation in posterior maxilla with dynamic navigation. They were assigned to either lateral window sinus floor elevation (LWSFE) group (n = 22) or transcrestal sinus floor elevation (TSFE) group (n = 20) according to the residual alveolar bone height (RBH). Platform deviation, apex deviation and angular deviation between actual and planned implant placement were measured in precision evaluation software. Three deviations of two groups were compared via SPSS 22.0 software.</p> Results <p>Neither accidental bleeding nor perforation of Schneiderian membrane occurred in any patients. The actual window position of LWSFE was consistent with the preoperative design. There were no significant differences in platform, apex and angular deviations between the two groups (P &gt; 0.05).</p> Conclusion <p>In this study the dynamic navigation harvested clinically acceptable safety of MSFE and accuracy for implant placement in posterior maxillary region. The dynamic navigation would provide the clinician with assistance in achieving precise preoperative planning and reducing complications in surgical procedures. The granular bone grafts used in the LWSFE did not significantly affection on the accuracy of the simultaneous implant placement under the guidance of dynamic navigation.</p>","author":"Miaomiao Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"72f1be44e177a25a21f4257ba77d1cb1403d9745a6c7caac4771047cc587af8f","category":"Interdisciplinary"}