{"title":"TDF: Vingegaard twists the knife","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tdf-vingegaard-twists-the-knife","date":1689791401000,"content":"\n      <p><span>In a 1994 essay about the World Chess Championships published in </span><i><span>Granta </span></i><span>magazine the author Julian Barnes shared an anecdote about the British Grandmaster Nigel Short and American Grandmaster Yasser Seirawan, who had once confused the British journalist Dominic Lawson with their repeated use of an abbreviation in their conversations: “TDF”. Lawson had assumed it was shorthand for some kind of strategy or series of moves. “At first he didn’t want to confess his chessic ignorance,” wrote Barnes. “But after Short and Seirawan had used the expression several times, he finally cracked and inquired. ‘Trap. Dominate. F*ck,’ the two grandmasters chanted back at him.”</span></p>\n<div></div>\n<p><span>I contend that the tired and hackneyed cliché of cycling being chess on wheels is an accurate one, but far less in the sense that the strategies and tactics overlap than in the fact that trapping, dominating and f*cking is what you need to do to the other cyclists in the race: in order to win bike races, riders must necessarily crush the bodies and spirits of their rivals. “When you see an enemy lying on the ground, what’s your first reaction?” asked Tim Krabbé in his novel </span><i><span>The Rider</span></i><span>. “To help him to his feet. In road racing, you kick him to death.”</span></p>\n<p><span>Chess can be, contrary to its reputation as a quiet, polite, respectful game where games are started and finished with handshakes, an arena of psychological sadism and contempt. The journalist Stephen Moss wrote in his book </span><i><span>The Rookie</span></i><span>: “You loathe your opponent; you want to maim, kill, destroy him.” I have been insulted in incredibly imaginative ways by complete strangers on the other side of the world in the chatbox while playing games on chess.com (my response is to be unfailingly polite, not because I feel particularly polite at that point, but because I know it will piss them off).</span></p>\n<p><span>Jonas Vingegaard might have a nice face, but he’s showing signs of being a killer. In an implacable display of dominance in stage 17 of the 2023 Tour de France to Courchevel, which crossed the epic and tough Col de la Loze, he and his Jumbo-Visma team definitively cracked his rival Tadej Pogačar. Just a few days ago, pundits were asking what the actual process was for deciding the general classification in the event of a dead heat, so close had the battle been between Vingegaard and Pogačar over the first two weeks of the race. Yesterday, in the Combloux time trial, Vingegaard plunged a knife into the Slovenian’s ambitions to win the yellow jersey; on the Col de la Loze, he twisted it.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg17_vingegaard01_2023_1024x1024.jpg?v=1689791357\" alt /></div>\n<p><span>Vingegaard is the best rider in this Tour de France. He now sits 7:35 ahead of Pogačar, while third-placed Adam Yates is at 10:45. He has the strongest team, and they have the best strategy. Jumbo-Visma are not making many mistakes, and though they received questions about some of their tactics in the first two weeks of the race, from the perspective of week three, suddenly they are looking like the smartest, and strongest, guys in the room. Chess players often talk about the ‘truth’ of a position, which is to say the inherent strength and possibility that each player has in the arrangement of their pieces. Looking back down from the summit of the Col de la Loze to the opening two weeks of the 2023 Tour de France reveals the ‘truth’ of that opening phase of the race: that Vingegaard and Jumbo suspected that Pogačar was chipping away not only at the seconds that separated him from the yellow jersey, but also far deeper into his own reserves.</span></p>\n<p><span>Of course, there are mitigating factors. Pogačar rode a full and fulfilling Classics season; then he broke his wrist. Vingegaard concentrated his efforts on the Tour and had a trouble-free year. But nevertheless, Vingegaard has now established psychological supremacy over Pogačar. (And I think he’s been looking for this for a long time. The cool and diffident reaction to the Slovenian’s offers of handshakes following stages of the Tour last year and this might just be an introvert being an introvert, but it might also be a meaningful statement of intent.)</span></p>\n<p><span>For a while, their contrasting approaches, temperaments, strategies and racing styles looked like an absorbing and even match. Pogačar’s aggressive and expressive attacking and punching were the romantics’ counterpoint to Vingegaard’s defensive diesel classicism. Pogačar is extroverted and goofy; Vingegaard is quiet and serious. The Slovenian races, and wins, the Tour of Flanders, Strade Bianche, Liège-Bastogne-Liège and Il Lombardia. Vingegaard does stage races, and disappears after the Tour. </span></p>\n<p><span>But Vingegaard’s methodology has won out. You could argue that there’s not much to love in his riding style and his team’s composition and strategy. They have one of the best few climbers in the world, Sepp Kuss, working exclusively as a domestique, even though he looks like he could realistically envisage a podium finish at a Grand Tour. They have Wout van Aert, who can do just about everything. Behind them, they have a supremely strong set of domestiques, who are routinely five or six-strong deep into the mountain stages. And Jumbo didn’t even bring Giro champion Primož Roglič to the Tour. They are organised, plan well and don’t do much press. And their figurehead, unfailingly polite, is a machine, who looks as good at racing the Tour de France as any winner ever has. </span></p>\n<p><span>Vingegaard had already killed the race yesterday. It was clear that we weren’t going to learn anything new on stage 17 that the stage 16 time trial hadn’t already told us. When Pogačar was dropped on the lower slopes of the Col de la Loze, the race was even more over than it already had been, yet Vingegaard and Jumbo-Visma’s first reaction was not to maintain their pace and play it safe while Pogačar faltered. Instead, they put Kuss on the front, lifted the pace, and kicked their opponent to death.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"72f307b416e036d6a021c6696449e664429a44ea235b5d656e132b2f3361cd84","category":"Cycling"}