{"title":"Effect of Pulsed Feeding of GIFT Strain of Tilapia in Biofloc System Using Inland Saline Water","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/6079177?af=R","date":1680764400000,"content":"<p>Feed is one of the major inputs in aquaculture system and constitutes 60%–80% of total production costs of tilapia. Inappropriate selection of feed quality and the feeding strategy affects the feed utilization resulting in high food conversion ratio (FCR). A 60 days experiment was conducted to evaluate the growth performance and immuno-physiological responses of GIFT tilapia, (<i>Oreochromis niloticus</i>) by pulsed feeding under biofloc culture system in inland saline water. For the experiment, feeding pattern in pulsed was followed viz., <i>in situ</i> biofloc with daily feeding (T1), <i>in situ</i> biofloc with alternate day feeding (T2), <i>in situ</i> biofloc with every third day feeding (T3), <i>in situ</i> biofloc with no feeding (T4), and clear water control with daily feeding (C) each in triplicates. Biofloc based treatment receiving daily feeding (T1) resulted in significantly (<i>P</i> &lt; 0.05) higher average body weight, weight gain, and specific growth rate (SGR) compared to control. T1 and C showed a significantly similar feed conversion ratio (FCR) and protein efficiency ratio (PER). Fish maintained in T4 grew the least and survival was lowest (85%). The immunological parameters showed a significant difference (<i>P</i> &lt; 0.05) for nitroblue tetrazolium (NBT) and myeloperoxidase content whereas no significant difference (<i>P</i> &gt; 0.05) for lysozyme activity was observed. Higher NBT activity was observed in biofloc based treatments compared to control. Activity of superoxide dismutase (SOD), catalase (CAT), and glutathione peroxidase (GPx) activity were considerably higher (<i>P</i> &lt; 0.05) in biofloc based treatments than control. Among biofloc based treatments the antioxidant activities were lower in T1. The carbohydrate metabolism enzymes lactate dehydrogenase (LDH) and malate dehydrogenase (MDH) were lower in T1, T2, and T3 compared to control and T4. In conclusion, <i>in-situ</i> biofloc with daily feeding is found to be effective in growth improvement and to elicit immune-physiological responses in GIFT tilapia under pulsed feeding using biofloc based system.</p>","author":"Sonia Solanki, \nNarinder K. Chadha, \nParamita B. Sawant, \nHarikrishna Vungurala, \nArun Sudhagar, \nIoannis Vatsos","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"72fb8f78a5296e3742face3c34a7953af3f2d83ae1b185fc21871addffa55a9b","category":"Environment"}