{"title":"Description of a ‘plankton filtration bias’ in sequencing-based bacterial community analysis and of an Arduino microcontroller-based flowmeter device that can help to resolve it","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303937","date":1716904800000,"content":"<p>by Corentin Fournier, Alexander Fiedler, Maximilian Weidele, Harald Kautz, David Schleheck</p>\r\n\r\nDiversity studies of aquatic picoplankton (bacterioplankton) communities using size-class filtration, DNA extraction, PCR and sequencing of phylogenetic markers, require a robust methodological pipeline, since biases have been demonstrated essentially at all levels, including DNA extraction, primer choice and PCR. Even different filtration volumes of the same plankton sample and, thus, different biomass loading of the filters, can distort the sequencing results. In this study, we designed an Arduino microcontroller-based flowmeter that records the decrease of initial (maximal) flowrate as proxy for increasing biomass loading and clogging of filters during plankton filtration. The device was tested using freshwater plankton of Lake Constance, and total DNA was extracted and an 16S rDNA amplicon was sequenced. We confirmed that different filtration volumes used for the same water sample affect the sequencing results. Differences were visible in alpha and beta diversities and across all taxonomic ranks. Taxa most affected were typical freshwater Actinobacteria and Bacteroidetes, increasing up to 38% and decreasing up to 29% in relative abundance, respectively. In another experiment, a lake water sample was filtered undiluted and three-fold diluted, and each filtration was stopped once the flowrate had reduced to 50% of initial flowrate, hence, at the same degree of filter clogging. The three-fold diluted sample required three-fold filtration volumes, while equivalent amounts of total DNA were extracted and differences across all taxonomic ranks were not statistically significant compared to the undiluted controls. In conclusion, this work confirms a volume/biomass-dependent bacterioplankton filtration bias for sequencing-based community analyses and provides an improved procedure for controlling biomass loading during filtrations and recovery of equivalent amounts of DNA from samples independent of the plankton density. The application of the device can also avoid the distorting of sequencing results as caused by the plankton filtration bias.","author":"Corentin Fournier","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7305041df2759768dbcac7617a83263de9f4c20352eaf72a71a5b85cb2f9dd56","category":"Interdisciplinary"}