{"title":"The Health and Well-Being of Community Members Living Closer to a Coal Mine in Limpopo Province, South Africa: Perceptions of Residence","link":"https://www.preprints.org/manuscript/202409.1567/v1","date":1726837799000,"content":"Coal mining activities frequently result in negative effects that spread to neighboring populations, affecting their general health and well-being. The lack of published research on these effects in the Limpopo province motivated the quest to have local communities assess how mining has affected their health. This study explored the perceived health and well-being outcomes of community members residing around a coal mine in the Limpopo Province, South Africa. The study was conducted in three sub-villages closest to Tshikondeni Coal Mine, namely, Mukomawabane, Bileni, and Mutele B. A qualitative methodology, adopting an exploratory design, was employed. Eighty-one participants, aged 18 to 80, were purposively sampled from the selected sub-villages. Data was collected through one-on-one unstructured interviews captured as field notes, complemented by audio recordings. Throughout the study, ethical research principles of approval and permission, informed consent, privacy anonymity and confidentiality as well as avoidance of harm and benefits were strictly adhered to. Content analysis was used to analyze the data. The findings of the study revealed that many members of the communities residing around the Tshikondeni coal mine are suffering from self-proclaimed respiratory-related conditions (fourteen Asthma, ten TB, three sinuses, three coughs, and one chest pain) perceived to be caused by coal dust. Participants expressed concerns about widespread deforestation from coal mine operations with resultant soil erosion and land degradation as well as the dam that the mine left unfenced, where their livestock is hunted and drowned by crocodiles. In addition, the study reveals twenty-four participants’ concerns about the non-compensation of their cracked houses resulting from mine blasting operations. This study highlights that communities closer to coal mines experience physical, mental, and social well-being challenges, emphasizing the urgent need for extensive research to validate the various self-proclaimed respiratory problems. The concerns of communities are justified as deforestation, soil erosion, and land degradation threaten food security due to the loss of soil fertility and reduced livestock grazing area subsequently impacting the community’s livelihoods. The non-compensation of cracked houses causes frustration, anxiety, sadness, and worry among community members, negatively impacting their mental health. The South African Department of Health, Environmental Affairs, and Mineral and Energy should work together, to ensure the implementation of policies to protect communities closer to mines against harmful mining operations, non-compliance, and negligence.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"730692c9a773df4151e175462e2f83bb699985af20eda97bae68f706292bf716","category":"Interdisciplinary"}