{"title":"102 Combination and individual vaccines for bovine viral diarrhea virus and infectious bovine rhinotracheitis effects on reproductive cyclicity and immune response","link":"https://academic.oup.com/jas/article/102/Supplement_3/269/7757287?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Vaccines are known to impact both the immune and reproductive systems. The objective of this research was to identify immunological and cyclic differences following vaccination for Bovine Viral Diarrhea Virus (BVDV) and/or Infectious Bovine Rhinotracheitis (IBR). Brahman cows (n = 15) were administered PGF<sub>2α</sub> to regress corpus lutea on d -3. Animals (d 0) were immunized (2mL, intramuscular injection) with one of three treatments: 1) Modified Live Vaccine (MLV) for BVDV and IBR (BVD+IBR; n = 5), 2) MLV for BVDV only (BVD; n = 5), or 3) sterile saline (CON; n = 5). Blood samples (30 mL/cow) were collected (d -3, 0, 2, 4, 6, 8, 10, and 14) and peripheral blood mononuclear cells (PBMC) were isolated. PBMC were incubated with propidium iodide and antibodies for specific surface cell markers (CD4, CD8, CD25, CD14, CD86, and CD335). An Amnis FlowSight flow cytometer determined cell type percentage. BVDV and IBR antibody concentrations were analyzed in serum samples (d -3, 0, and 14). Plasma samples (d 0, 2, 4, 6, 8, 10, and 14) were evaluated for interferon (IFN)-γ, interleukin (IL)-1α, IL-1β, IL-4, IL-6, IL-8, IL-10, IL-17A, macrophage inflammatory protein (MIP)-1α, MIP-1β, IL-36RA, interferon-gamma-induced protein (IP)-10, monocyte chemoattractant protein (MCP)-1, tumor necrosis factor (TNF) α, and vascular endothelial growth factor (VEGF) A concentrations by a MagPix multiplex machine using a MILLIPLEX Bovine Cytokine/Chemokine Magnetic Bead Panel. Progesterone (d 0, 2, 4, 6, 8, 10, and 14) and estradiol (d 0) concentrations were determined by RIA. Differences in antibody titers, PBMC populations, and cytokine concentrations were analyzed as repeated measures using PROC MIXED (SASv9.4). Forty percent of BVD+IBR animals experienced abnormal estrus cycles, but no BVD or CON animals did. There was a treatment effect on BVD titer concentration with BVD animals having greater titer concentrations than CON (<span>P</span> = 0.02) but similar concentrations to BVD+IBR (<span>P</span> = 0.18). There was a treatment by time interaction (<span>P</span> &lt; 0.0001) on IBR titers with BVD+IBR animals having greater titer concentrations on d 14 compared with BVD and CON. Treatment had no effect on leukocyte populations (<span>P</span> ≥ 0.1409), but all populations differed over time (<span>P</span> ≤ 0.0045). Antigen presenting cells (CD14+) and natural killer cells (CD335+) were affected by a treatment and time interaction (<span>P</span> ≤ 0.0479). BVD animals had increased CD14+ cells on d 2, 4, 8, and 14 compared with CON, but CON had a greater CD335+ cell population compared with BVD and BVD+IBR on d 10. There tended to be or was a significant treatment by day interaction for IL-1α (<span>P</span> = 0.08), IL-1b (<span>P</span> = 0.03), IL-10 (<span>P</span> = 0.06), IFN-γ (<span>P</span> = 0.05), IP-10 (<span>P</span> = 0.02), MIP-1α (<span>P</span> = 0.02), MIP-1 b (<span>P</span> = 0.01), TNFα (<span>P</span> = 0.01), and VEGFA (<span>P</span> = 0.03). IL-1a, IL-10, IL-1b, and MIP-1 b increased in BVD+IBR from d 0 to 4 or 6 then decreased but not in CON or BVD. Increased VEGFA was observed in CON compared with BVD and BVD+IBR animals. Overall, BVD+IBR resulted in abnormal cycles and changes in cytokine concentrations and leukocyte populations. USDA is an equal opportunity provider and employer.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7306856f9355c758b0e0aa2f7fc59d79b4615e760a54e12b7ecc023552bceb44","category":"Environment"}