{"title":"Grooming reciprocation in Himalayan tahr and the cognitive constraint hypothesis","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13408?af=R","date":1709810886000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/add20396-5430-4794-bfc1-42d0242ac09e/eth13408-toc-0001-m.png\" alt=\"Grooming reciprocation in Himalayan tahr and the cognitive constraint hypothesis\" />\n<p>Reciprocity is often believed to be rare because of its cognitive requirements, which are thought to exceed the capabilities of most animals. This so-called cognitive constraint hypothesis predicts that, if reciprocation ever occurs among animals, it must necessarily be immediate. In this study, we show that Himalayan tahr, a cognitively unsophisticated ungulate, are able to reciprocate grooming over long time frames, thus falsifying the cognitive constraint hypothesis.</p>\n<br />\n<h2>Abstract</h2>\n<p>The cognitive constraint hypothesis maintains reciprocity is rare among animals because it requires cognitive capabilities that are rare, if not absent, in animals. In particular, it suggests that temporal discounting, limited memory, and limited capability of complex calculations make long-term reciprocation essentially impossible for animals. The cognitive constraint hypothesis therefore predicts that, if reciprocity ever occurs in animals, it should always be immediate. In this study, we tested for long-term reciprocation in Himalayan tahr (<i>Hemitragus jemlahicus</i>), a species that is not notable for its advanced cognitive capabilities. We showed that tahr are able to reciprocate grooming over extended time periods, that is, that they groom preferentially those individuals from which they receive more grooming even when all cases of immediate reciprocation are excluded from analysis. These results do not support the cognitive constraint hypothesis. We note the cognitive constraint hypothesis makes two silent assumptions: that all reciprocation is necessarily calculated and that it is based on partner control processes. We suggest these assumptions are unwarranted, and that most group living animals base their ability to reciprocate on emotionally based partner choice.</p>","author":"Gabriele Schino, \nCarola Manzoni, \nMassimiliano Di Giovanni","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"7314b515eb43df41ca505fedec019d94428749b54b1411db49c71d7d9413b327","category":"Environment"}