{"title":"Google ลบโค้ดที่เกี่ยวกับฟีเจอร์ Fast Pair ทั้งหมดออกจาก AOSP ย้ายไป Google Play","link":"https://www.blognone.com/node/135689","date":1694520160000,"content":"<div><div><div><p>ฟีเจอร์ <strong>Fast Pair</strong> ของ Google นั้นเป็นฟีเจอร์พื้นฐานสำหรับการค้นหา และเชื่อมต่ออุปกรณ์ต่าง ๆ ครั้งแรกได้ง่ายขึ้น ซึ่ง Fast Pair ถือเป็นโค้ดส่วนหลักของโมดูลด้านการเชื่อมต่อใน AOSP ล่าสุดกลับพบว่าโค้ดที่เกี่ยวข้องกับฟีเจอร์ดังกล่าวถูกออกจาก AOSP โดย Google เป็นคนลบเอง แต่ฟีเจอร์นี้จะยังมีอยู่กับโทรศัพท์ Android ที่มี Google Play Services ติดมากับเครื่อง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/47ee5501fc4ac33ad89970d9dd5d37b2.jpg\" /><em>รูปภาพจาก X/Twitter ของคุณ Mishaal Rahman</em></p>\n<p>การลบโค้ดชุดนี้ออกจาก AOSP จะส่งผลให้อุปกรณ์ที่ใช้ระบบปฏิบัติการ Android ที่ไม่มี Google Play Services ไม่สามารถใช้ฟีเจอร์ Fast Pair ได้ ซึ่งอุปกรณ์ที่ได้รับผลกระทบเต็ม ๆ คืออุปกรณ์ที่ AOSP ในประเทศจีน ทางแก้เบื้องตนคือ OEMs บางเจ้าของจีนต้องสร้างฟีเจอร์คล้ายกับ Fast Pair เพื่อเชื่อมต่อกับอุปกรณ์ต่าง ๆ ขึ้นมาแทน แต่ก็จะเชื่อมต่อได้แค่อุปกรณ์ของแบรนด์ตัวเองเท่านั้น</p>\n<p>ก่อนหน้านี้ Google อยากให้ฟีเจอร์ Fast Pair เป็นที่แพร่หลายบน Android ทาง Google เลยนำ Fast Pair เข้ามาใน AOSP โดยวางให้เป็นส่วนหลักของโมดูลด้านการเชื่อมต่อกับอุปกรณ์ต่าง ๆ โค้ดของ Fast Pair และ HalfSheet UX (ป๊อปอัพ UI ที่ปรากฎเมื่ออุปกรณ์ถูกพบเจอ) อัปโหลดเข้าไปใน AOSP และปล่อยใน Android เวอร์ชัน 13 แต่ล่าสุดโค้ดเหล่านี้กลับถูกลบโดย Google ไปเมื่อไม่กี่วันก่อนหน้านี้ ซึ่งข้อมูลถูกพบโดยผู้ใช้งาน X/Twitter นาม Mishaal Rahman</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f835cfb1516fa778e1af8fe01f632a0e.jpg\" /></p>\n<p>แนวทางการย้ายฟีเจอร์ต่างๆ ของแอนดรอยด์จาก AOSP ออกไปยัง Google Play Services เป็นแนวทางที่กูเกิลทำต่อเนื่องเรื่อยมา โดย Android 14 เองก็ย้ายฐานข้อมูล Certification Authority สำหรับการตรวจสอบใบรับรองเข้ารหัส<a href=\"https://www.xda-developers.com/android-14-root-certificates-updatable/\">ไปยัง Google Play Services เช่นกัน</a></p>\n<p>AOSP หรือ Android Open Source Project คือชอร์ชโค้ดของระบบปฎิบัติการ Android ที่ Google นำมาเผยแพร่ฟรีสำหรับนักพัฒนาที่สนใจนำไปพัฒนาต่อ</p>\n<blockquote><p>Google has deleted all code related to Fast Pair from AOSP.Fast Pair is Google's proprietary standard for simplifying the first time discovery and pairing of nearby devices over Bluetooth Low Energy. It's available on most Android devices through the Google Play Services app.… <a href=\"https://t.co/TtUBnofcYE\">pic.twitter.com/TtUBnofcYE</a></p>\n<p>— Mishaal Rahman (@MishaalRahman) <a href=\"https://twitter.com/MishaalRahman/status/1701304928700899749?ref_src=twsrc%5Etfw\">September 11, 2023</a></p></blockquote>\n<p>ที่มา - <a href=\"https://twitter.com/mishaalrahman/status/1701304928700899749?s=46&amp;t=rU18nHl265EM0eKPhNrIzQ\">Mishaal Rahman</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/aosp\">AOSP</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/google-play\">Google Play</a></div><div><a href=\"/topics/android\">Android</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"731644a9043d7e4f090f60eaac1abdbf8957aadc173e217977636b6f479ee158","category":"Thai"}