{"title":"ปรับกลยุทธ์และพัฒนานวัตกรรม ฝ่าวิกฤติ Digital Disruption รับมือทุกกระแสการเปลี่ยนแปลง ด้วยการสร้างระบบไอทีที่แข็งแกร่ง รวดเร็ว และคุ้มค่า","link":"https://www.blognone.com/node/126054","date":1638415800000,"content":"<div><div><div><p><strong>Leverage modernization technology to drive the business growth</strong></p>\n<p>โลกดิจิทัลกำลังพลิกโฉมรูปแบบธุรกิจ ทางองค์กรจึงต้องคิดใหม่ ทำใหม่ เกี่ยวกับการบริการลูกค้าและประสบการณ์ (Customer Experience) โดยใช้ข้อมูลเป็นตัวเร่งให้เกิดนวัตกรรมและการเปลี่ยนแปลง โดยสถาปัตยกรรมข้อมูลเดิม (Legacy architecture) อาจจะไม่สามารถตอบสนองความต้องการด้านความเร็ว ความยืดหยุ่น และนวัตกรรมใหม่ ๆ ที่เกิดขึ้นในปัจจุบันและในอนาคตได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ea159b30ef0e6388d3c7ee9db03ab1a3.png\" /></p>\n<p><strong>Challenge State:</strong></p>\n<p><strong>The difficult state to build cloud-native and microservices infrastructure.</strong></p>\n<p>การปรับปรุงโครงสร้าง architecture บนระบบโครงสร้างพื้นฐาน ให้รองรับงาน innovation และงาน development ต่าง ๆ ในรูปแบบของ microservice หรือ cloud-native นั้น จึงอาจจะมีความซับซ้อนและยุ่งยากอยู่มาก ทั้งเรื่องการจัดหาอุปกรณ์ (Hardware compatibility) การติดตั้งระบบ และการจัดการข้อมูลในเวลาเดียวกัน เพื่อให้รองรับการขยายตัวของข้อมูลที่มีประมาณเพิ่มขึ้นอย่างรวดเร็ว และรองรับการขยายตัวของ service ที่จะต้องสามารถทำงานในรูปแบบของ automatic scaling และ CI/CD pipeline ได้ และยังต้องมีความปลอดภัยสูงสุดในการป้องกันข้อมูล ป้องกันการเข้าถึงระบบ และรองรับการสำรองข้อมูลด้วย</p>\n<p><strong>IBM Spectrum Fusion – HCI</strong> เข้ามาตอบโจทย์ในความท้าทายนี้ให้กับลูกค้าที่มุ่งเน้นทางด้านการพัฒนานวัตกรรม เพื่อขับเคลื่อนองค์กร หรือพัฒนาระบบเพื่อเพิ่มฐานลูกค้ามากขึ้น โดยโครงสร้างจะประกอบไปด้วย</p>\n<ul>\n<li>Compute/Storage/High Speed Network 100GbE, Rack 42U, Top of Rack switch</li>\n<li>Red Hat OpenShift System deploy on bare-metal ทำให้ใช้งานได้อย่างรวดเร็ว และใช้งานได้ทั้ง container และ VMs ภายใต้ระบบเดียวกัน single management platform</li>\n<li>Software Defined Storage ช่วยจัดการเรื่องของ Global data access และการทำ data tiering ไปยัง disk, tape หรือ cloud ได้</li>\n<li>สามารถเชื่อมต่อ External storage แบบ NFS กับ Storage เดิมทั้ง Dell-EMC/NetApp/Spectrum Scale หรือ S3 protocol ได้</li>\n<li>Backup software bundled สามารถใช้งานสำรองข้อมูลผ่าน IBM Spectrum Protect Plus ได้โดยไม่ต้องเสียค่าใช้จ่ายเพิ่มเติม</li>\n<li>รองรับการทำงานแบบ Hybrid cloud เช่น IBM Cloud Satellite, Red Hat ACM</li>\n<li>เริ่มต้นการใช้งานระบบด้วย ระบบขนาดเล็กได้ตั้งแต่ 56TB usable เป็นต้นไป</li>\n</ul>\n<p><strong>IBM Spectrum Fusion – HCI มาในรูปแบบของ Hyper-converged “Ready Infrastructure for container technology”</strong></p>\n<p><strong>อ่านข้อมูลเพิ่มเติม:</strong> <a href=\"https://www.ibm.com/blogs/systems/ibm-rolls-out-spectrum-fusion-hci-all-in-one-cloud-native-storage/\">https://www.ibm.com/blogs/systems/ibm-rolls-out-spectrum-fusion-hci-all-in-one-cloud-native-storage/</a></p>\n<ul>\n<li>รองรับ workload แบบ container, cloud-native หรือ microservices technology</li>\n<li>รองรับการทำงาน virtual machine (VMs) และ container สามารถนำมาใช้งานภายใต้ single platform เดียวกัน ผ่าน “Red Hat OpenShift” ซึ่งทำการ deploy อยู่ในระบบ HCI แบบ on bare-metal โดยไม่มี Hypervisor layer เข้ามากั้น ทำให้ workload ที่ทำงานอยู่บนระบบนี้ สามารถใช้งานได้อย่างเต็มประสิทธิภาพ รองรับทั้งงาน Opensource และ Enterprise software</li>\n<li>ลดค่าใช้จ่ายซ้ำซ้อนเรื่องของ virtualize license ลงไปได้ เนื่องจากรูปแบบของ Infrastructure deploy on bare-metal จะไม่เสีย Hypervisor และ Management license</li>\n<li>ลดค่าใช้จ่าย Operating Systems (OS) license เมื่อ deploy ในรูปแบบของ container จะเป็นลักษณะของการ share OS และ Bin/Lib จึงช่วยลดค่าใช้จ่ายลงไปได้อย่างมาก</li>\n<li>Single point support เมื่อเกิดปัญหา ลูกค้าสามารถเปิด ticket  case จากทาง IBM จุดเดียวเพื่อวิเคราะห์ปัญหาและติดต่อประสานงาน ลดความซับซ้อนยุ่งยาก ทำให้แก้ปัญหาได้รวดเร็ว</li>\n</ul>\n<p><strong>Business use case:</strong></p>\n<p><strong>Digital Insurance – Digital Claim Processing System</strong></p>\n<p>ธุรกิจทางด้านประกันภัย (Insurance) ทั้งระบบ Car insurance หรือ Health Insurance ก็ตาม เริ่มหันมามุ่งเน้นเรื่องการพัฒนาระบบให้รองรับการพัฒนานวัตกรรมมากขึ้น  อย่างเห็นได้ชัด ทั้งเรื่องที่ปรึกษาทางด้านสุขภาพหรือจะเป็นการพัฒนาระบบซื้อขายประกันแบบต่างๆ เพื่อเพิ่มความพึงพอใจ ความถูกต้องให้กับลูกค้า</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6126edd6500130861f9333cfb5a14512.png\" /></p>\n<p>ระบบหนึ่งที่น่าสนใจคือ <strong>Digital Car Claim Processing System</strong> ถูกพัฒนาเพื่อตอบโจทย์เรื่องของการลด process และ ลดเวลาของการยื่นเคลมเอกสารจนถึง payment และ approve process จะต้องเกิดความถูกต้องโปร่งใส โดยระบบดังกล่าวนี้ช่วยให้การทำเคลม process ของลูกค้าลดเวลาไปได้ จากเป็นเดือนเหลือเพียง 5.5วัน เท่านั้น (รวมเวลาการตัดสินใจจากบุคคลที่ 3 ใน manual process รวมอยู่ประมาณ 3-5 วันแล้ว) โดยลูกค้าสามารถทำ claim process เสร็จสิ้นภายใน 1 สัปดาห์ (Business day)</p>\n<p>การพัฒนาระบบนี้นั้น อยู่บนพื้นฐานของโครงสร้างแบบ microservices และ cloud-native เพื่อมุ่งเน้นการพัฒนา application/API process และการทำงานสามารถนำเอา <strong>IBM Business Automation</strong> เข้ามาช่วยทำเรื่องของ RPA process สามารถจำลองข้อมูล เพื่อแสดงข้อมูลของลูกค้าในการประเมินผล, การรีวิวราคาประเมินและคำนวณเวลาเบื้องต้นในการเคลมระบบ โดยใช้พื้นฐานของข้อมูลเดิมมาทำ analytic และดึงข้อมูลเก่ามาใช้งานผ่าน Global data access, การทำ Reporting claim, Internal evaluate claim และ Notification สามารถแจ้งเตือนเมื่อถึง process ต่างๆ ให้กับลูกค้าและทีมได้</p>\n<p>ทั้งนี้ application ทั้งหมดยังรองรับการเข้าถึงข้อมูลของลูกค้าอย่างปลอดภัยผ่าน policy ข้อกำหนดต่างๆ ผ่านทางระบบโครงสร้างที่มีความปลอดภัยสูง มีการ identify ตัวตน ก่อนเข้าถึงระบบ และสามารถเข้าถึง สืบค้น(Discovery) ข้อมูลได้อย่างรวดเร็ว และสามารถเก็บข้อมูลลูกค้าได้เป็นเวลานานผ่านการทำ data archiving หรือ backup เพื่อความปลอดภัยของข้อมูลลูกค้า</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c056815b073a50268fbe6372bd2ec4a7.jpg\" /></p>\n<p>สอบถามข้อมูลเพิ่มเติมได้ที่ บริษัท คอมพิวเตอร์ยูเนี่ยน จำกัด<br />\nโทร 02 311 6881 # 7151, 7156<br />\nemail : <a href=\"mailto:cu_mkt@cu.co.th\">cu_mkt@cu.co.th</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d18a66d30b9ba46c8900f9ec6d9177e3.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/computer-union\">Computer Union</a></div><div><a href=\"/topics/ibm\">IBM</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"73174533a2ba847d50497c6025999c02afbd34383b0f416445d57474b2092d97","category":"Thai"}