{"title":"Apple Releases Rapid Security Response Updates for iOS 16.5.1 and macOS 13.4.1 to Fix Actively Exploited Vulnerability","link":"https://www.macrumors.com/2023/07/10/apple-releases-ios-16-5-1-macos-13-4-1-rsrs/","date":1689010283000,"content":"Apple today released Rapid Security Response (RSR) updates that are available for <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> users running the iOS and iPadOS 16.5.1 updates and the <a href=\"https://www.macrumors.com/roundup/macos-13/\">macOS Ventura</a> 13.4.1 update. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Rapid-Security-Response-Feature-1.1.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nRapid Security Response updates are designed to provide iOS and macOS users with security fixes without the need to install a full software update. Today's updates address an actively exploited WebKit vulnerability, so it is a good idea to update as soon as possible. \r<br />\n\r<br />\niOS Security Response 16.5.1 is available through the standard Software Update mechanism in the ‌iPhone‌ or ‌iPad‌ Settings app, but is a quick update, requiring just a couple of minutes to download the update and then a quick restart for the install process. The macOS update can be installed through System Settings. \r<br />\n\r<br />\nOnce the Rapid Security Response update is installed, iOS 16.5.1 users and ‌macOS Ventura‌ 13.4.1 users will see an updated version of the software, and tapping on the version in the About section of Settings will display information about the installed OS version and the Rapid Security Response update. Those who want to disable Rapid Security Response updates on ‌iPhone‌ can do so by <a href=\"https://www.macrumors.com/2022/09/12/ios-16-remove-rapid-security-response-update/\">following our how to</a>. The updates can <a href=\"https://www.macrumors.com/how-to/disable-rapid-security-response-updates-mac/\">also be disabled on the Mac</a>.\r<br />\n\r<br />\nApple has been testing the Rapid Security Response feature since last year, with RSRs first introduced with the launch of <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a> and ‌macOS Ventura‌.<br />This article, \"<a href=\"https://www.macrumors.com/2023/07/10/apple-releases-ios-16-5-1-macos-13-4-1-rsrs/\">Apple Releases Rapid Security Response Updates for iOS 16.5.1 and macOS 13.4.1 to Fix Actively Exploited Vulnerability</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-releases-rapid-security-response-updates-for-ios-16-5-1-and-macos-13-4-1-to-fix-actively-exploited-vulnerability.2395527/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"73204678846a7e87d7c70a08da93a03e565c6a43337cc3b87666b23b39bbf783","category":"Apple"}