{"title":"New Method of Isolation and Deriving Cell Line from Frozen Nervous Tissue","link":"https://www.preprints.org/manuscript/202405.1868/v1","date":1716960992000,"content":"The extraction of cell cultures from fresh tissue is a process that requires significant computa-tional resources and is associated with substantial overheads. The objective of our research is to de-vise a rapid, straightforward, and efficient technique for the cultivation of neuronal cells derived from frozen biological material. We utilized freshly isolated hippocampus and cerebral cortex tissue from rats, in addition to whole brain tissue. This tissue underwent digestion and processing to yield a cellular suspension. This suspension was subsequently cryopreserved using a variety of cryopro-tectants: CTS™ Synth-a-Freeze™, SpermFreeze®, and a medium supplemented with 10% DMSO. CTS™ Synth-a-Freeze™ is a commercially available cryoprotectant typically employed in the preservation of cellular cultures, while the addition of 10% DMSO to the medium is a conventional technique for the cryopreservation of cells to mitigate damage. The innovative aspect of our meth-odology is the application of SpermFreeze®, a product used for the cryopreservation of sperm in in vitro clinics. We postulated that SpermFreeze® might enhance the viability and quality of the cryo-preserved neuronal cells, given the delicate and energetically demanding nature of both sperm and neuronal cells. The ultimate objective was to ascertain whether a cryoprotectant formulated for sperm could augment the post-thawing efficacy of our nervous system cells. This investigation intro-duces an innovative methodology for the optimization of neuronal cell isolation and cryopreserva-tion from animal-derived tissues.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7321615a38ea77d717fd6d7d7c9aa1b447c38c6ff42c7154d7c02fe1599afa44","category":"Interdisciplinary"}