{"title":"Cadmium‐induced global DNA hypermethylation promoting mitochondrial dynamics dysregulation in hippocampal neurons","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24083?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Environmental cadmium exposure during pregnancy or adolescence can cause neurodevelopmental toxicity, lead to neurological impairment, and reduce cognitive abilities, such as learning and memory. However, the mechanisms by which cadmium causes neurodevelopmental toxicity and cognitive impairment are still not fully elucidated. This study used hippocampal neurons cultured in vitro to observe the impact of cadmium exposure on mitochondrial dynamics and apoptosis. Exposure to 5 μM cadmium causes degradation of hippocampal neuron cell bodies and axons, morphological destruction, low cell viability, and apoptosis increase. Cadmium exposure upregulates the expression of mitochondrial fission proteins Drp1 and Fis1, reduces the expression of mitochondrial fusion-related proteins MFN1, MFN2, and OPA1, as well as reduces the expression of PGC-1a. Mitochondrial morphology detection demonstrated that cadmium exposure changes the morphological structure of mitochondria in hippocampal neurons, increasing the number of punctate and granular mitochondria, reducing the number of tubular and reticular mitochondria, decreasing mitochondrial mass, dissipating mitochondrial membrane potential (ΔΨm), and reducing adenosine triphosphate (ATP) production. Cadmium exposure increases the global methylation level of the genome and upregulates the expression of DNMT1 and DNMT3α in hippocampal neurons. 5-Aza-CdR reduces cadmium-induced genome methylation levels in hippocampal neurons, increases the number of tubular and reticular mitochondria, and promotes cell viability. In conclusion, cadmium regulates the expression of mitochondrial dynamics-related proteins by increasing hippocampal neuron genome methylation, changing mitochondrial morphology and function, and exerting neurotoxic effects.</p>","author":"Huixia Geng, \nQihang An, \nJie Song, \nDongling He, \nHuimin Han, \nLai Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"73259342fb4a9ba78c9c4adecb64e22a0de764ae9fed5b01a2bfc6d0284c51d2","category":"Environment"}