{"title":"Cycle lane removal disproportionately affects young people, charity warns","link":"https://www.cyclist.co.uk/news/9168/cycle-lane-removal-disproportionately-affects-young-people-charity-warns","date":1611764845000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-01-27T16:36:00+00:00\">27 Jan 2021</span></div>    </div></div><p class=\"short-teaser\">\nCycling UK says youth unemployment concerns exacerbated by lack of safe and affordable transport options while young firmly support lanes</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2019/01/commute-traffic-lights.jpg?itok=1J52K149\" />  </div>\n<div class=\"field field-name-body\">\n      <p> Young people will be disproportionately affected by the removal of cycle lanes, Cycling UK has warned.</p>\n<p>The national cycling charity says that under 25s, who support bike lanes more than older age groups, are both harder hit by the economic impact of the <a href=\"/tags/coronavirus\">coronavirus pandemic</a> and have more limited access to safe, affordable travel.</p>\n<p>A YouGov survey carried out on behalf of the charity revealed 71% of 18 to 24-year-olds support the creation of new cycle lanes compared to 55% of over-54s, with students 77% in favour.</p>\n<p>Cycling UK claims that to achieve the government's target of doubling levels of cycle activity by 2025, more lanes need to be created and their removal because of opposition by a small vocal minority will hit young people the hardest.</p>\n<p>It also cites the rising cost of driving since the 1990s, pricing out young people, and <a href=\"/tags/coronavirus\">coronavirus</a> concerns putting many off taking public transport.</p>\n<p>Duncan Dollimore, Cycling UK head of campaigns, said: 'The UK needs to look to a future after the pandemic and support all those young people at the start of their careers or just about to begin them – part of that has to consider the transport choices available to them.</p>\n<p>'Youth unemployment is projected to increase, and this will only be further exacerbated if cheap and efficient transport choices, like cycling is denied to them. The cost of buying and running a car, concerns about or a lack of public transport can all be significant barriers to work for young people, but could be overcome for many if we had safe networks of separated cycle lanes.'</p>\n<div class=\"field field-name-field-see-related field-type-node-reference field-label-above\">      <div class=\"field-label\">See related&nbsp;</div>\n  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/buying-guides/7883/best-cheap-turbo-trainers-top-turbo-trainers-on-a-budget\">Best cheap turbo trainers: Top turbo trainers on a budget</a></div>      <div class=\"field-item odd\"><a href=\"/tutorials/938/how-to-create-a-cycling-training-plan\">How to create the ultimate cycling training plan</a></div>      <div class=\"field-item even\"><a href=\"/in-depth/1792/how-to-avoid-fading-on-a-long-ride\">How to avoid fading on a long ride</a></div>    </div></div><p>\nRuby Seber, a 23-year-old coffee shop worker in Glasgow who cycles to work, said: 'It's the quickest, most affordable and healthiest option for me, as well as a great way to get some fresh air. However, cycle lanes are very sporadic and so it often doesn't feel very safe.</p>\n<p>'No other form of transport is an option for me as I'm at the bottom of the list for vaccinations and I'm reluctant to use public transport. Fortunately Glasgow City Council decided to keep the road through Kelvingrove Park closed to vehicles which has been great – I hope they make more similar decisions in the future.'</p>\n<p>Dollimore added: 'It isn't anti-car as some people claim, but it is unashamedly pro-bike and pro-people.' </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/general-news\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"73272db6e79c19b777b8e95e5c3dc69b82fef3b06de72d2b4b2edbb6f57ce095","category":"Cycling"}