{"title":"Apple Music Classical Now Available to Download on the App Store","link":"https://www.macrumors.com/2023/03/28/apple-music-classical-now-available/","date":1679997104000,"content":"Apple has <a href=\"https://www.apple.com/newsroom/2023/03/apple-music-classical-is-here/\">announced</a> the release of <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> Classical, which is now <a href=\"https://apps.apple.com/app/apple-music-classical/id1598433714\">available to download in the App Store</a>. Apple originally planned to launch a classical music app in 2022, but the app was not announced until this year. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Apple-Music-Classical-hero.jpg\" alt width=\"1960\" height=\"1102\" /><blockquote>\"We love music — that's really what we're all about — and classical music is foundational to music of all genres,\" said Oliver Schusser, Apple's vice president of Apple Music and Beats. \"Apple Music Classical is a dedicated app that is great for classical experts as well as anyone who is new to classical, with the largest classical music selection in the world, the very best search and browse capabilities, the most premium sound experience with Spatial Audio, and thousands of exclusive recordings. We believe this is the very best classical music streaming experience available anywhere, and for us, this is just the beginning.\"</blockquote>\r<br />\n\r<br />\nThe new ‌‌Apple Music‌‌ Classical app offers ‌‌Apple Music‌‌ and <a href=\"https://www.macrumors.com/guide/apple-one/\">Apple One</a> subscribers access to over five million classical music tracks, including new high-quality releases, in addition to hundreds of curated playlists, thousands of exclusive albums, and other features like composer bios and deep dives on key works.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Apple-Music-Classical-Screenshots.jpeg\" alt width=\"1599\" height=\"907\" />\r<br />\nThe app offers a simpler interface for interacting with classical music specifically. Unlike the existing ‌‌Apple Music‌‌ app, ‌‌Apple Music‌‌ Classical allows users to search by composer, work, conductor, catalog number, and more. Users can get more detailed information from editorial notes and descriptions. ‌Apple Music‌ Classical also features lossless audio of up to 24 bit/192 kHz throughout the service so listeners can experience the nuances of every performance.\r<br />\n\r<br />\n‌Apple Music‌‌ Classical is based on Primephonic, a classical music streaming service that Apple <a href=\"https://www.macrumors.com/2021/08/30/apple-acquires-primephonic-classical-music-service/\">acquired in 2021</a>. ‌Apple Music‌‌ Classical will only support iOS devices running iOS 15.4 or newer, and an Android version of the app is coming soon, according to Apple. Apple made the app <a href=\"https://www.macrumors.com/2023/03/09/apple-music-classical-available-for-pre-order/\">available for pre-order earlier this month</a>.\r<br />\n\r<br />\n<div></div>\r<br />\nThe app is currently available in English, German, Spanish, French, Italian, Brazilian Portuguese, and Dutch. Note that the app is not available in China, Japan, Korea, Russia, Taiwan, and Turkey. <div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music-classical/\">Apple Music Classical</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/28/apple-music-classical-now-available/\">Apple Music Classical Now Available to Download on the App Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-classical-now-available-to-download-on-the-app-store.2385048/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7331492d57aa938d8bcaefa81c3075d948a47c2f6bb099eb546b20b2336fde43","category":"Apple"}