{"title":"ชวนดู 3 แพลตฟอร์มในงาน AIS Business Digital Future 2023  2024: DIGITAL INDUSTRY EVOLUTION เมื่อ AIS Business จะกลายเป็นแกนกลางให้ธุรกิจในการก้าวสู่ยุคต่อไป","link":"https://www.blognone.com/node/136973","date":1701252000000,"content":"<div><div><div><p>ในงาน AIS Business Digital Future 2024: DIGITAL INDUSTRY EVOLUTION ที่ผ่านมามีการนำเสนอถึงเทคโนโลยีและแนวทางการใช้งานบริการต่างๆ ของ AIS ต่อโลกธุรกิจที่ต่างไปจากการใช้งานของผู้ใช้ทั่วไปที่มักใช้งานเครือข่ายโทรศัพท์มือถือทั้งบริการ 5G และบริการอินเทอร์เน็ตบ้าน แต่ในโลกธุรกิจนั้นมีความต้องการใช้งานเทคโนโลยีในรูปแบบที่ต่างออกไปจากผู้ใช้ตามบ้านทั่วไป หลายองค์กรมีแนวทางที่ใช้งานต่างกันแม้จะเป็นเครือข่าย 5G เหมือนกันก็ตาม</p>\n<p>งานครั้งนี้ AIS Business เล่าถึง 3 แพลตฟอร์มหลักของ AIS ที่ให้บริการแก่ลูกค้าระดับองค์กร ได้แก่ AIS Cloud X, PARAGON Platform, และ CPaaS ที่สามารถให้บริการระบบไอทีขององค์กรได้ครบวงจรตั้งแต่ระดับแอปพลิเคชันที่องค์กรใช้งานโดยตรงไปจนถึงระดับโครงสร้างพื้นฐานที่องค์กรต่างๆ ไม่ต้องเสียทรัพยากรมาดูแลเอง</p>\n<p><strong>AIS Cloud X บริการคลาวด์ในประเทศที่พร้อมใช้งานวันนี้</strong></p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/2RXgLN5.jpg\" /></p>\n<p>บริการตัวแรกคือ AIS Cloud X นั้นเป็น<a href=\"https://www.blognone.com/node/130509\">บริการที่เปิดตัวตั้งแต่ปี 2022 ที่ผ่านมา</a>และมีการให้บริการต่อเนื่อง โดยรองรับความต้องการขององค์กรธุรกิจต่างๆ ที่ต้องการใช้คลาวด์ ในประเทศ ทั้งการประมวลผล (IaaS), การเก็บข้อมูล, DR Backup และต้องการความปลอดภัยและเชื่อถือได้สูง ซึ่ง AIS มีมาตรฐานในระดับ Sovereign Cloud จาก VMware และให้บริการบน Data Center ระดับ Telecom Grade ที่ได้เปรียบจากการเชื่อมต่อตรงกับโครงข่ายความเร็วสูงของ AIS และยังเชื่อมต่อกับ Hyperscale Cloud เช่น Microsoft Azure, AWS เพื่อทำ Hybrid / Multi Cloud ได้อย่างดีด้วย</p>\n<p><strong>AIS PARAGON Platform เพื่อพัฒนาแอปพลิเคชันบนเครือข่าย 5G</strong></p>\n<p>AIS PARAGON Platform ช่วยให้นักพัฒนา และองค์กรที่ต้องการใช้งาน 5G และ Edge Computing สามารถทำได้อย่างสะดวกและรวดเร็วขึ้น โดยแพลตฟอร์มนี้ ช่วยให้จัดการทั้ง 5G และ Edge Computing ได้ในที่เดียว ทำให้รวมเอาทั้งความได้เปรียบของเครือข่าย 5G มารวมกับแอปพลิเคชันต่างๆ ที่เคยจำเป็นต้องติดตั้งใกล้กับบริเวณที่ใช้งาน ไม่ว่าจะเป็นการวิเคราะห์ข้อมูลจากเซ็นเซอร์ต่างๆ ในโรงงาน การวิเคราะห์ภาพความละเอียดสูง</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/BCD2PMy.jpg\" /><br />\n<em>ระบบคลังสินค้าอัตโนมัติ</em></p>\n<p>ในงานครั้งนี้ AIS Business ได้นำแอปพลิเคชันต่างๆ ที่สามารถใช้งาน AIS PARAGON Platform มานำเสนอจำนวนมาก เช่น ระบบการวิเคราะห์ข้อมูลด้วยปัญญาประดิษฐ์ ที่ออฟฟิศหรือโรงงานจะสามารถวิเคราะห์ภาพ ตรวจสอบการทำงานว่าเป็นไปตามข้อกำหนด เช่น การใส่หมวกนิรภัยในพื้นที่ควบคุม การเก็บข้อมูลจากเซ็นเซอร์ต่างๆ หรือการควบคุมหุ่นยนต์ผ่านเครือข่าย</p>\n<p>โซลูชันกลุ่มหนึ่งที่นำมาสาธิตในงานครั้งนี้ คือโซลูชันสำหรับธุรกิจลอจิสติก ที่ครอบคลุมตั้งแต่ระบบหุ่นยนต์ในคลังสินค้าที่สามารถทำงานอัตโนมัติเต็มรูปแบบไปจนถึงบริการแผนที่เพื่อการจัดการรถขนส่งต่างๆ ให้องค์กรสามารถรวมเข้าไปเป็นส่วนหนึ่งของการจัดการลอจิสติกภายในองค์กร</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/6U97V9q.jpg\" /></p>\n<p>AIS PARAGON Platform นั้นเปิดให้องค์กรสามารถพัฒนาหรือเลือกใช้แอปพลิเคชันเหล่านี้ไปพร้อมกับการใช้งานโครงข่าย 5G โดยเฉพาะการประมวลผลที่สามารถอยู่ใกล้กับโรงงานหรือสำนักงานมากๆ ด้วยบริการ MEC (Multi-access Edge Computing) และหากมีความต้องการใช้งานเครือข่าย 5G ในรูปแบบที่เฉพาะ ต้องการความปลอดภัยและเสถียรภาพสูงแยกออกจากเครือข่ายทั่วไปก็สามารถเลือกใช้บริการ Private 5G เป็นเครือข่ายส่วนตัวที่ AIS เข้ามาดูแลโดยเฉพาะได้เช่นกัน</p>\n<p><strong>CPaaS แพลตฟอร์มจัดการการสื่อสารได้อย่างเต็มรูปแบบ</strong></p>\n<p>บริการตัวที่ 3 ที่นำมาสาธิตในงานคือ CPaaS ที่เป็นแพลตฟอร์มสำหรับการจัดการการสื่อสารได้หลากหลายรูปแบบ เหมาะสำหรับองค์กรที่ต้องการพัฒนาแอปพลิเคชัน หรือระบบงานที่ต้องมีการสื่อสารกับลูกค้า โดยการเชื่อมต่อ API กับ CPaaS เพียงที่เดียว แต่สามารถสื่อสารได้ทั้งการโทร การส่งข้อความ และการเชื่อมต่อกับ 3rd party อื่นๆ เช่น Microsoft Teams, Zoom, ERP, CRM พร้อมความสามารถ พิเศษ​ เช่น Number Masking API</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/YwzwCtZ.jpg\" /></p>\n<p>แนวทางการใช้งาน CPaaS สำคัญที่สาธิตในงานครั้งนี้คือบริการส่งสินค้าต่างๆ ที่เดิมผู้ใช้มักได้รับหมายเลขโทรศัพท์แปลกๆ จากพนักงานส่งสินค้า หากลูกค้าไม่ได้รับสายและมีคำสั่งพิเศษบางอย่าง เช่น ผู้รับไม่อยู่บ้านต้องฝากไว้บางจุดก็อาจจะทำให้ส่งสินค้าไม่สำเร็จไปเลย CPaaS เปิดทางให้บริษัทขนส่งสามารถใช้ Number Masking API โปรแกรมให้หมายเลขโทรออกกลายเป็นหมายเลขขององค์กรเท่านั้น ทำให้ลูกค้าเห็นทันทีว่าเป็นบริษัทขนส่งโทรเข้ามา และหากโทรผ่านแอปพลิเคชั่น พนักงานขนส่งเองก็อาจจะไม่ต้องเห็นหมายเลขโทรศัพท์ลูกค้าแม้แต่น้อย ลดความเสี่ยงข้อมูลลูกค้าหลุดไปได้อีกชั้น</p>\n<p>CPaaS เปิดทางให้องค์กรสามารถปรับแต่งการใช้งานโทรศัพท์ได้หลากหลาย เช่น ลูกค้าสามารถโทรเข้ามายังองค์กรแล้วระบบสามารถส่งสายเข้าไปยังพนักงานที่ดูแลลูกค้ารายนั้นอยู่ได้ในทันทีโดยลูกค้าไม่ต้องคุยกับโอเปอร์เรเตอร์แม้แต่น้อย แต่ระบบสามารถเชื่อมกับ CRM ภายในองค์กรได้โดยตรง</p>\n<p><strong>บริการระดับองค์กรที่ได้รับการพิสูจน์แล้วจากองค์กรขนาดใหญ่จำนวนมาก</strong></p>\n<p>นอกจากการนำเสนอแพลตฟอร์มต่างๆ แล้ว ในงาน AIS Business Digital Future 2024: DIGITAL INDUSTRY EVOLUTION ครั้งนี้ลูกค้าของ AIS ที่ทั้งธุรกิจค้าปลีก, ลอจิสติก, และภาคการผลิต ก็มาร่วมงานนำเสนอแนวทางการใช้งานแพลตฟอร์มต่างๆ ของ AIS Business กันอย่างเนืองแน่น แสดงให้เห็นว่าแพลตฟอร์มของ AIS Business พร้อมให้บริการแล้ว</p>\n<p>Siam Toyota Manufacturing (STM) เล่าถึงการวางเครือข่าย IoT จำนวนมากเพื่อตรวจสอบการผลิต พร้อมกับการใช้ Energy Platform ที่ AIS Business พัฒนาร่วมกับสภาอุตสาหกรรมแห่งประเทศไทย (FTI) มาใช้งานเพื่อให้ปรับปรุงการใช้พลังงานในโรงงานได้ดีขึ้น เดิมนั้นระบบเหล่านี้ต้องอาศัยคนจดข้อมูลจากเซ็นเซอร์ต่างๆ หลังจากนั้นก็ปรับมาใช้ Wi-Fi และ LoRA ที่เป็นคลื่นที่ใช้งานได้เสรี แต่กลับพบว่าเครือข่ายนั้นขาดความเสถียร การปรับปรุงล่าสุดที่ AIS เข้าไปร่วมมือคือการใช้เครือข่าย 5G ทำให้สามารถใช้งานเครือข่ายได้อย่างเต็มประสิทธิภาพ สามารถเชื่อมต่อข้อมูลทั้งการใช้พลังงานและข้อมูลการผลิตเข้ากับระบบ ERP ได้ทันที</p>\n<p><img alt=\"No Description\" src=\"https://i.imgur.com/4pzyyVV.jpg\" /></p>\n<p>Somboon Advance Technology (SAT) เล่าถึงการใช้ระบบคลังสินค้าอัตโนมัติ ระบบขนส่งแบบไร้คนขับ เพิ่มประสิทธิภาพการจัดการคลังสินค้าดีขึ้นกว่า 60% โดยระบบเหล่านี้ต้องการเครือข่ายไร้สายที่เสถียรและมี latency ที่ต่ำเพื่อให้ควบคุมจากศูนย์กลางได้ ขณะที่ Hutchison Ports Thailand ผู้ให้บริการท่าเรือแหลมฉบัง ใช้งานเครือข่าย 5G เพื่อการสั่งการรถบรรทุกไร้คนขับที่นับเป็นท่าเรือแห่งแรกที่ใช้งานร่วมกันทั้งรถบรรทุกไร้คนขับและรถบรรทุกมีคนขับปกติร่วมกันในพื้นที่เดียวกัน</p>\n<p><strong>แพลตฟอร์มเพื่อการทำธุรกิจในโลกยุคต่อไป</strong></p>\n<p>บริการต่างๆ ที่ AIS Business นำเสนอในงานครั้งนี้ แสดงให้เห็นถึงความพร้อมที่จะให้บริการภาคธุรกิจอย่างเต็มรูปแบบ และสามารถให้บริการในทุกระดับตั้งแต่ระดับโครงข่ายที่เป็นจุดแข็งของ AIS มาโดยตลอด ไปจนถึงระดับแอปพลิเคชันที่องค์กรต่างๆ ต้องการใช้งาน แนวทางนี้และลูกค้าของ AIS Business ที่มายืนยันว่าสามารถใช้งานบริการต่างๆ ได้แล้วในธุรกิจจริง น่าจะทำให้เราได้เห็นธุรกิจต่างๆ เข้ามาใช้แพลตฟอร์มของ AIS Business มากยิ่งขึ้นต่อไปในอนาคต</p>\n<p><strong>สำหรับองค์กรธุรกิจในทุกภาคอุตสาหกรรมที่สนใจแพลตฟอร์มต่างๆ  ของทาง AIS Business สามารถศึกษาข้อมูลเพิ่มเติมได้ที่ <a href=\"https://www.ais.th/business/enterprise\">https://www.ais.th/business/enterprise</a></strong></p>\n<p><strong>AIS Business พร้อมเป็นพันธมิตรดิจิทัล  ที่มั่นใจได้  เพื่อพัฒนาธุรกิจและสังคมไทย เติบโต  อุ่นใจ  ไปด้วยกัน</strong><br />\n<strong>\"Your Trusted Smart Digital Partner\"</strong></p>\n<p><strong>ปรึกษาและวางแผนพัฒนาเทคโนโลยี  เพื่อรองรับการทำงาน  และต่อยอดธุรกิจได้ที่</strong><br />\n<strong>Email: business@ais.co.th</strong><br />\n<strong>Website: <a href=\"https://www.ais.th/business/enterprise\">https://www.ais.th/business</a></strong></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais-business\">AIS Business</a></div><div><a href=\"/topics/ais\">AIS</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7335609dd31f97081d159784ddb2af7e72e5cdd4d6b5192f54f911af45a87623","category":"Thai"}