{"title":"Three Products We Might See at WWDC 2023","link":"https://www.macrumors.com/2023/03/31/wwdc-2023-product-rumors/","date":1680302259000,"content":"Apple <a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">this week announced</a> the official dates for the 34th annual Worldwide Developers Conference, with the annual WWDC keynote event set to take place on Monday, June 5. The keynote is where Apple unveils new versions of iOS, macOS, watchOS, and tvOS, and sometimes, we get hardware announcements.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/wwdc-2023.jpeg\" alt width=\"2048\" height=\"1151\" />\r<br />\nRumors this year suggest there are at least three new devices that are set to be unveiled in the middle of the year, and Apple could use WWDC to show them off.\r<br />\n\r<br />\n<h2>15-inch MacBook Air</h2>\r<br />\nWe've heard multiple rumors of a larger-screened <a href=\"https://www.macrumors.com/guide/15-inch-macbook-air/\">15.5-inch MacBook Air</a>, which is supposed to <a href=\"https://www.macrumors.com/2023/03/05/new-macbook-airs-by-summer-gurman/\">launch by the summer</a>. Set to be sold alongside a new version of the 13.6-inch <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>, a 15-inch ‌MacBook Air‌ would give customers looking for a larger-screened lightweight machine an option that isn't the MacBook Pro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/macbook-air-cyber.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nThe 15.5-inch ‌MacBook Air‌ will be just slightly bigger than the old 15.4-inch MacBook Pro, and it will be sized in between the 14 and 16-inch MacBook Pro models. We're expecting the 15.5-inch ‌MacBook Air‌ to look like a larger version of the 13.6-inch ‌MacBook Air‌ that was introduced last year, with no real notable design changes.\r<br />\n\r<br />\nIt's not entirely clear which chips the 15-inch ‌MacBook Air‌ will use because the timing is odd. It's late for Apple to use the <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> chips that first came out last year, but early for the debut of the <a href=\"https://www.macrumors.com/guide/m3/\">M3</a>. Kuo has said the new ‌MacBook Air‌ models will use ‌M2‌ and ‌M2‌ Pro chips, while <em>9to5Mac</em> has said that it will use new ‌M3‌ chips.\r<br />\n\r<br />\nFor more on the rumors about the 15-inch ‌MacBook Air‌, we <a href=\"https://www.macrumors.com/guide/15-inch-macbook-air/\">have a dedicated 15-inch MacBook Air guide</a>.\r<br />\n\r<br />\n<h2>Mac Pro</h2>\r<br />\nThe <a href=\"https://www.macrumors.com/guide/2022-mac-pro/\">Mac Pro</a> is the last Mac that Apple needs to update to Apple silicon to eliminate all Intel chips. When the first Apple silicon chip was introduced in 2020, Apple said it would take a few years to complete the transition, and 2023 is the year that will happen.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/Mac-Pro-Feature-Teal.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nWe are expecting a new <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a> in 2023, with the machine set to feature the same general design as the existing ‌Mac Pro‌. It will use the same stainless steel frame and aluminum housing with easy access to the interior components.\r<br />\n\r<br />\nThe Apple silicon ‌Mac Pro‌ is expected to use an \"‌M2‌ Ultra\" chip with up to a 24-core CPU and up to a 76-core GPU, with support for at least 192GB RAM.\r<br />\n\r<br />\nRight now, Apple silicon chips are limiting in terms of upgrades, which could affect the ‌Mac Pro‌. Apple silicon Macs do not have user-upgradeable RAM because the memory is tied to the motherboard, and the same goes for the GPU. The ‌Mac Pro‌ may not have a user upgradeable GPU or upgradeable RAM unless Apple makes some kind of unforeseen update to the way Apple silicon chips are built or implemented in the machine.\r<br />\n\r<br />\nRumors have suggested that the ‌Mac Pro‌ is coming in the first half of the year, and Apple has in the past used WWDC to unveil machines targeted at developers and designers, so there is a good possibility we'll see the ‌Mac Pro‌ revealed at Apple's event.\r<br />\n\r<br />\nFor more on what to expect from the ‌Mac Pro‌, we <a href=\"https://www.macrumors.com/guide/2022-mac-pro/\">have a Mac Pro guide</a>.\r<br />\n\r<br />\n<h3>Mac Studio</h3>\r<br />\nApple introduced the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> in March 2022, and the machine is something of a <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> and ‌Mac Pro‌ hybrid. It uses <a href=\"https://www.macrumors.com/guide/m1-max/\">M1 Max</a> and <a href=\"https://www.macrumors.com/guide/m1-ultra/\">M1 Ultra</a> chips and is in theory due for a refresh, but the fate of the <a href=\"https://www.macrumors.com/roundup/mac-studio/\">Mac Studio</a> is unclear with a new ‌Mac Pro‌ on the horizon.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/08/mac-studio-pink.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nA refreshed version of the ‌Mac Studio‌ would use ‌M2‌ Max and ‌M2‌ Ultra chips, the same chips rumored for the ‌Mac Pro‌. It is not clear how Apple would differentiate the ‌Mac Studio‌ and ‌Mac Pro‌ if both were using the same chip technology, so there may not be an ‌M2‌ series ‌Mac Studio‌.\r<br />\n\r<br />\nAs of now, there are no rumors of a new ‌Mac Studio‌, so it's not likely we'll see it at WWDC, but it's not impossible.\r<br />\n\r<br />\n<h2>AR/VR Headset</h2>\r<br />\nApple has pushed back the unveiling of its AR/VR \"mixed\" reality headset multiple times if rumors are to be believed, but we could finally see it shown off at the 2023 Worldwide Developers Conference. Back in February, <em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> said the device would <a href=\"https://www.macrumors.com/2023/02/15/apple-ar-vr-headset-launch-june/\">get a WWDC introduction</a> with shipping to come later in the year, but it's still not a sure thing.\r<br />\n\r<br />\n<div><img src=\"https://images.macrumors.com/article-new/2023/02/apple-mixed-reality-headset-concept-by-david-lewis-and-marcus-kane.jpg\" alt width=\"1600\" height=\"900\" /><em>Apple headset concept by <a href=\"https://twitter.com/Dtalkingtech\">David Lewis</a> and <a href=\"https://twitter.com/marcusckane\">Marcus Kane</a></em></div>\r<br />\nJust this week, Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> said that Apple had <a href=\"https://www.macrumors.com/2023/03/30/kuo-apple-headset-may-not-appear-at-wwdc/\">pushed back mass production</a> on the headset, which could mean that it won't make an appearance at WWDC. According to Kuo, Apple \"isn't very optimistic\" about whether the headset will be able to create an \"<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> moment,\" causing uncertainty around whether the headset will be previewed at WWDC.\r<br />\n\r<br />\nA delay in mass production does not necessarily mean a delay in the unveiling as rumors have always indicated that Apple's plan is to show off the headset well ahead of when it launches, but a mixed reality headset at WWDC is no longer a sure thing as Apple could wait until later in the year to introduce it.\r<br />\n\r<br />\nIn terms of rumors, the AR/VR headset sounds a lot like the first-generation Apple Watch. It's an expensive device with limited functionality and limited consumer appeal, which Apple will improve upon with subsequent releases.\r<br />\n\r<br />\nThe first version of the mixed reality headset is rumored to be priced at around $3,000, and Apple does not expect it to sell well. Employees have expressed concern about the limited usefulness of the device, and Apple doesn't seem to have a tentpole app to sell it with. Apple is focusing heavily on communication and avatar development, but whether this will interest consumers remains to be seen.\r<br />\n\r<br />\nRumors indicate the headset will have some high-end technology with 4K micro OLED displays and more than a dozen cameras for tracking everything from facial expressions to hand gestures, but there are major downsides as well, such as the need to wear an external battery pack to power the device.\r<br />\n\r<br />\nA built-in battery was too heavy, so Apple has designed a hip-worn battery that will power the headset for approximately two hours before it needs to be recharged. Apple is said to have been aiming to create a comfortable, lightweight design with a sleek, curved visor with a mesh backing and an adjustable band.\r<br />\n\r<br />\nSome Apple employees are reportedly concerned about the product and have questioned whether the device is a \"solution in search of a problem\" that isn't \"driven by the same clarity\" as other Apple products.\r<br />\n\r<br />\nA full overview of everything we know about Apple's AR/VR headset can be found <a href=\"https://www.macrumors.com/roundup/ar-vr/\">in our AR/VR headset roundup</a>.\r<br />\n\r<br />\n<h2>New Software</h2>\r<br />\nAt WWDC, Apple will introduce <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, iPadOS 17, <a href=\"https://www.macrumors.com/roundup/macos-13/\">macOS Ventura</a> 14, tvOS 17, and watchOS 10, plus if the headset is introduced, we could see the first version of <a href=\"https://www.macrumors.com/guide/xros/\">xrOS</a>, the software designed to run on the device.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/iOS-17-Icon-Mock-Feature-Feature.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nOf these updates, ‌iOS 17‌ always <a href=\"https://www.macrumors.com/roundup/ios-17/\">garners the most interest</a> and it's generally the only software we hear about ahead of launch. ‌iOS 17‌ is apparently aimed at adding some of the \"most requested features\" that users have been wanting, though there's no word on what these features might be.\r<br />\n\r<br />\nThere is no major \"tentpole\" addition like the Lock Screen overhaul in <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a>, but it sounds like there could be some useful quality of life improvements. We do know that ‌iOS 17‌ is expected to feature support for the AR/VR headset, major <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a> updates, and support for sideloading apps in European countries.\r<br />\n\r<br />\nMore of what we've heard about ‌iOS 17‌ <a href=\"https://www.macrumors.com/roundup/ios-17/\">can be found in our iOS 17 roundup</a>.\r<br />\n\r<br />\n<h2>WWDC Dates and Viewing Info</h2>\r<br />\nThe Worldwide Developers Conference will start on Monday, June 5 and last through Friday, June 9. For non-developers, the keynote event on June 5 will be of the most interest.\r<br />\n\r<br />\nThe keynote event is likely to start at 10:00 a.m. Pacific Time, and it will be broadcast live on Apple's website, on the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>, and on YouTube. <em>MacRumors</em> will have full coverage of Apple's announcements both here on MacRumors.com and through our <a href=\"https://twitter.com/macrumorslive?lang=en\">MacRumorsLive Twitter account</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/31/wwdc-2023-product-rumors/\">Three Products We Might See at WWDC 2023</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/three-products-we-might-see-at-wwdc-2023.2385518/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"733fd8c1a48a7c21663056d033097d34dcd9433c159b587518264ce2ac2228fa","category":"Apple"}