{"title":"BikeRadar Rides | The Fred Whitton Challenge – the UK’s toughest sportive","link":"https://www.bikeradar.com/features/routes-and-rides/fred-whitton-challenge/","date":1639566043000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/The-Fred-Whitton-This-is-hardcore-09-3e66812.jpg?quality=90&amp;resize=620,413\" />                                            <p><em>This feature was originally published in issue 386 of <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription\" target=\"_blank\">Cycling Plus magazine</a>.</em></p>\n<hr /><p>After more than seven hours in the saddle, the moment I’ve been dreading and sweating over for months has finally arrived.</p>\n<p>The 33 per cent inclines are almost comically steep, the tarmac as cracked as my mental resolve.</p>\n<p>I strain every sinew to rotate the pedals. My speed hovers at 5km/h and a fellow rider pushing his bike overtakes me.</p>\n<p>This is Hardknott. This is hardcore. And this is the Fred Whitton, the most famous and feared sportive in the nation, gracing the Lake District after an enforced hiatus last year.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fred Whitton Challenge is arguably the UK’s toughest sportive, with more than 100 miles on the notoriously tough roads of the Lake District.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<h2>The UK’s toughest sportive?</h2>\n<p>Held in memory of Fred Whitton, the racing secretary of the Lakes Road Club who died of cancer in 1998, the Fred began life the following year.</p>\n<p>It’s since raised millions for charity and also raised plenty of heart rates, with the iconic – and often super-steep – climbs of Kirkstone, Hardknott and Wrynose in its midst along the 183km route, and well over 3,000m of relentless climbing in total.</p>\n<p>Almost as tough as crossing the Fred finish line is getting a spot in the massively over-subscribed ballot, and I’m one of the questionably ‘lucky’ entrants in 2021.</p>\n<p>It’s my first attempt at the Fred and I’ve spent the past months riding Somerset’s hills in the big ring in prep.</p>\n<p>My biggest events to date – an Ironman triathlon, city-centre marathons – have all taken place on pancake-flat roads and in perfect weather conditions, and were largely a battle with my stamina and psychology.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cycling Plus editor Matt Baird valiantly volunteered to ride the 2021 Fred Whitton Challenge.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>The Fred, however, feels different. It’s going to be a tussle with topography and a wrestle with the weather.</p>\n<p>I won’t be the only one controlling my narrative today – the gods of the Lake District will also decide my fate.</p>\n<p></p>\n<h2>Feet in the clouds</h2>\n<p>The September date of 2021’s Fred ensures that all riders wanting to start between 6am and 7am need lights.</p>\n<p>Judging by the sizeable queue heading into the HQ before daybreak, I’m not the only one whose dreams are plagued by missing the checkpoints at Braithwaite and Calder Bridge.</p>\n<p>Cyclists start pouring out of the starting gate at 6am and I join the procession at 6.30am, a steady stream of glowing lights disappearing into Grasmere’s morning mist.</p>\n<p>The mood is convivial, but we’re aware of the terrors – Kirkstone, Honister, Hardknott and Wrynose to name just four – to come.</p>\n<p>Like those Japanese horror movies, there are ominous frights before the tension is unbearably cranked up at the finale, the first coming after a sharp left south of Ambleside.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The 183km route rolls almost relentlessly from start to finish.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>It’s a relative molehill compared to the mountains to come, but Holbeck Lane instantly has me gasping for breath and already exiting that big ring, my breakfast of three brioche buns starting to rise.</p>\n<p>It’s not even a climb that figures in Fred mythology, but what follows certainly is.</p>\n<p>At 7km long and rising to 454m, Kirkstone Pass is the longest single climb and highest point of today’s riding.</p>\n<p>The steady gradient ensures most riders can remain in their saddles until the latter stages, and we soon have our feet in the clouds.</p>\n<p>Spirits are high and encouragement is shared from rider to rider, our mood lifted further by a crowd cheering our progress from outside the weather-beaten Kirkstone Pass Inn.</p>\n<p>A pint and a sausage baguette are tempting, but it’s three hours until first orders and the 15km-long glide to Ullswater awaits.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Lake District provides a dramatic backdrop throughout.</span></figcaption><span></span></div>\n<p>On smooth and quiet roads, with the sun sneaking through the clouds, it’s an utter thrill and a chance to put some miles on the clock ahead of the challenges that lie in store.</p>\n<p>It also reveals a classic Lake District vista, the land of Wordsworth and Wainwright, Beatrix Potter and my favourite episode of Mortimer &amp; Whitehouse: Gone Fishing.</p>\n<p>Pleasure is soon swapped for pain, a common Fred theme, when the 343m-high Matterdale End arrives.</p>\n<p>Again, the gradient is relatively constant and is intermittently punctuated with crowds gamely swapping the Hollyoaks omnibus in bed for cheering on a bunch of Lycra-clad strangers.</p>\n<section><div>\n        <h3>The Fred Whitton in numbers</h3>\n<h4>3,366m</h4>\n<p>Elevation gain on the 183km route</p>\n<h4>1999</h4>\n<p>Year ‘the Fred’ was first held</p>\n<h4><strong>1,324</strong></h4>\n<p>Finishers in 2021</p>\n<h3>Try it for yourself</h3>\n<p>The 2022 Fred Whitton Challenge will revert to its spring slot on the UK sportive calendar and is scheduled to take place on Sunday 8 May.</p>\n<p>Entries are granted through a ballot, open between Monday 3 January and Sunday 23 January 2022 via the <a href=\"https://www.fredwhittonchallenge.co.uk/entry/\" target=\"_blank\">Fred Whitton website</a>.</p>\n<p>You can, of course, pit yourself against the Lake District route outside of the event.</p>\n<ul><li><a href=\"https://www.komoot.com/tour/599906960\" target=\"_blank\">Download the full route from Komoot</a></li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Pleasure &amp; pain</h2>\n<p>The route takes another sharp left at the second Troutbeck on the course onto the busy A66 to Keswick.</p>\n<p>It’s the day’s least memorable passage, but another chance to get some miles in, with the 11.30am cut-off weighing heavily on my mind.</p>\n<p>From forgettable to indelible is the section from Keswick via Derwent Water to Borrowdale, a glorious stretch of ancient woodlands, waterfalls and looming mountains that could have been lifted from the Pyrenees.</p>\n<p>Slightly reducing my enjoyment is a rider who decides to draft an inch behind my wheel, a risky move given I haven’t showered for 48 hours due to a Windermere water shortage.</p>\n<p>Pleasure is again traded for pain with the arrival of the horrid Honister Pass. With 25 per cent gradients, we’re again bunched tightly together, and collisions are narrowly averted as riders weave and unclip before they topple.</p>\n<p></p>\n<p>My speed drops to single figures and doesn’t become much higher on the nervy descent to Buttermere, flanked by drystone walls.</p>\n<p>It’s a dream for confident descenders, but I’m proving every bit the ‘father-of-two who dabbles in triathlon’ stereotype with my tentative downhill skills.</p>\n<p>Beautiful Buttermere gives way to the sight of today’s first feed station, a cake-heavy buffet seemingly devised by Mary Berry.</p>\n<p>The queue is understandably huge, so I skip the cupcakes as the 333m-high Newlands Pass stands between me and the Braithwaite checkpoint.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Riders travel from far and wide to tackle ‘the Fred’.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>It’s another exposed and narrow climb, with a steep ravine to the left adding to the precariousness.</p>\n<p>The 8km often-straight descent to Braithwaite is the reward, and spirits are evidently high as the satisfying beep of the timing system signifies the halfway stage of the Fred.</p>\n<p>The inevitable rain arrives at Whinlatter Forest and, like sticking on Radiohead at a house party, it’s a complete mood-changer.</p>\n<p>Calls of “good luck”, “nice bike” and “nearly at the top” are replaced with groans about the weather and a realisation that we still have 70km to go before reaching the triple-header of Hardknott, Wrynose and Blea Tarn, whose very names even intimidate this soft southerner.</p>\n<h2>From despair to here</h2>\n<p>Loweswater marks a new low as the relentless rain persists and a series of unspectacular but incrementally exhausting climbs are tackled, my subdued mood not helped by a passing car lodging an Ed Sheeran earworm in my head.</p>\n<p>At ‘just’ 290m high, the Cold Fell ascent rarely figures in the Fred’s top trumps conversation, but it’s a monotonous brute, with the decommissioned scar on the landscape that is the Sellafield nuclear power plant matching my power output.</p>\n<p>It’s become a war of attrition, and I fear a puncture or mechanical will break my resolve. “You lot are mad!” shouts a dog walker and I’m inclined to agree.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Only the strongest survive this ride.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>From nowhere, a makeshift motivational tunnel of colour and noise appears on the horizon.</p>\n<p>Raucous spectators, gazebos and a giant sound system line the route and my Ed Sheeran earworm is swiftly replaced with very loud European techno. I feel like a pro rider and my downbeat mood becomes euphoric.</p>\n<p>I’m not sure who they are or where they came from (did they even exist?), but I thank them for their contagious energy.</p>\n<p>The rain clears and the second feed station at Calder Bridge arrives. This time, I hit the cakes, bananas and jelly babies with gusto, knowing that the next checkpoint is imminent and I’ve 25km to conserve energy before Hardknott Pass, the bane of my subconsciousness, finally arrives.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Refuelling before the ominious arrival of Hardknott Pass.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>After a brief sojourn on the A595, the road follows the course of the River Esk to the base of arguably Britain’s most famous cycling climb and a major part of Fred folklore.</p>\n<p>The maiden road closure of the day comes into force and with it my first double-take of Hardknott Pass. We’re actually going to cycle up that thing?</p>\n<p>A tiny ramp over the river forces me into my easiest gear before the 393m-high Hardknott even begins – so much for all that big ring training.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Hardknott Pass is the Fred Whitton Challenge’s trademark climb – an impossibly steep ascent straight up the hillside.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>My aim is to make it to the top aboard my bike. Standing before me is one of the steepest roads in the UK, with gradients that reach one in three.</p>\n<p>I’ve barely seen a soul since Calder Bridge, but half of the Fred’s field seem to be in various degrees of distress on Hardknott’s battered blacktop.</p>\n<p>I take the outside of the switchbacks, which top out at over 30%, where it appears slightly less vertical, plotting a path through those trying to save their sinews by walking.</p>\n<p>My calves feel shredded, my lungs emptied and my heart oversized, but I make it to the peak after 2.2km at an average gradient of 14 per cent. The descent is just as exhausting, a continual battle to keep my speed low, not fly over the handlebars or overshoot a corner.</p>\n<p>It’s so steep that my glasses nearly fall from my head, and my eyes ache from staring so intently for potholes and greasy patches.</p>\n<p>My brake pads are in similar levels of pain and my bib shorts probably need incinerating. This is getting expensive.</p>\n<p></p>\n<h2>Sucker punch</h2>\n<p>In a devious move by the course designers, Hardknott is only the first climb in this trilogy of tarmac terror.</p>\n<p>Up next is the 393m Wrynose, similarly steep and savage on both the approach and exit, before Blea Tarn adds a final sucker punch to my crying calves.</p>\n<p>It’s the toughest triple-header I’ve faced since watching the High School Musical trilogy in one sitting (don’t ask).</p>\n<p>But what rewards await on the approach to Ambleside, with some of the UK’s – make that the world’s – prettiest scenery dappled in autumnal sunlight.</p>\n<p>Even a slightly extended route due to a fallen tree can’t stop my delight as Grasmere beckons.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Reward for the day’s efforts.</span></figcaption><span> <i>Chris Sansom</i></span></div>\n<p>I cross the line after 9:42 hours of riding, with 3,366 metres of climbing and 5,200 calories burnt over 183.5km.</p>\n<p>My watch tells me I have 1 per cent of stamina remaining and I use that to buy a burger and take a seat next to Paul Loftus MBE, president of the Fred Whitton Challenge, to watch an Elvis impersonator belting out <em>Suspicious Minds</em>.</p>\n<p>Paul asks if I’d come up to ride the next edition in May and, despite the head-to-toe soreness, my reply is an instant yes. Hopefully, my new brake pads will arrive in time…</p>\n<section><div>\n        <h3>Three more hilly UK sportives for 2022</h3>\n<h4>The Lakeland Loop</h4>\n<ul><li><strong>Date:</strong> 17 April 2022</li>\n</ul><p>If you’re training for the Fred or didn’t get a spot, then the Lakeland Loop is ideal prep or a brilliant challenge in its own right. The 111km route also takes in the passes of Whinlatter, Hardknott and Wrynose, with plenty of lumpy stuff in-between.</p>\n<h4>Hampshire Hilly Hundred</h4>\n<ul><li><strong>Date:</strong> 8 May 2022</li>\n</ul><p>Cumbria doesn’t monopolise the hilly sportive calendar, with this event starting in Winchester and boasting the climbs of Beacon Hill, Watership Down and Windmill Hill over its 111 or 160km routes. Expect 1,219m of total elevation gain for the latter.</p>\n<h3>Dartmoor Classic</h3>\n<ul><li><strong>Date:</strong> 19 June 2022</li>\n</ul><p>The Dartmoor Classic has long been an essential fixture on the UK calendar, regularly attracting 4,000 entrants to Devon. The three open-road routes all venture into the rugged hills of Dartmoor National Park, with the 3,400m of climbing on the longest 177km route comparable to the Fred.</p>\n<p>\n\n    </p></div>\n    </section>","author":"Matt Baird","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"734072ed3e7df31f8be0beb207ad6019cb9192bd8f5c87c8614cac9a8bfd16ca","category":"Cycling"}