{"title":"A new High Power Mode is the best reason to splurge on an M1 Max MacBook Pro","link":"https://www.macworld.com/article/546425/16-inch-macbook-m1-max-pro-high-power-mode.html","date":1634891400000,"content":"<div>\n<section><div></div></section><p>There are a lot of things to like about the <a href=\"https://www.macworld.com/article/545699/macbook-pro-13-14-16-inch-compared-m1-m1-pro-m1-max.html\">new MacBook Pro</a>, but if you’re on the fence about spending an extra $600 on an M1 Max model, a new macOS setting might convince you. Along with the battery-saving <a href=\"https://www.macworld.com/article/348837/macos-monterey-low-power-mode-system-preferences-how-to-enable.html\">Low Power Mode</a> introduced in macOS Monterey, Apple is also offering a High Power Mode that will eke every bit of performance out of the new chips.</p>\n\n\n\n<p>The new setting, which was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/10/18/macos-monterey-high-power-mode/s-monterey-high-power-mode/&amp;xcust=1-1-546425-1-0-0&amp;sref=https://www.macworld.com/feed\">spotted in the latest macOS beta</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/10/21/new-macbook-pros-high-power-mode/&amp;xcust=1-1-546425-1-0-0&amp;sref=https://www.macworld.com/feed\">confirmed to Macrumors by Apple</a>, was <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/09/28/macos-monterey-high-power-mode/&amp;xcust=1-1-546425-1-0-0&amp;sref=https://www.macworld.com/feed\">originally reported by 9to5Mac</a> weeks before the new MacBook Pros arrived. According to the text in the macOS Monterey beta, the high-performance mode will be used for processor-intensive tasks such as video rendering and 3D modeling. The text of the option in System Preferences reads: “Your Mac will optimize performance to better support resource-intensive tasks. This may result in louder fan noise,” so it’s clearly designed for extreme tasks. </p>\n\n\n\n<p>The new feature will presumably be available in the macOS Monterey build that ships with the new MacBook Pro.</p>\n\n\n\n<p>After the M1 MacBook Air introduced a fanless design, Apple’s new MacBooks contain a pair of fans. However, the fan in the 13-inch MacBook Pro rarely needs to spin, and Apple claims that the MacBook Pro’s “advanced thermal systems move 50 percent more air, even at lower fan speeds” so you won’t hear them very often. However, High Power Mode will apparently push the processor hard enough so one or both fans activate.</p>\n\n\n\n<p>According to Macrumors, which confirmed details of the new setting with Apple, High Power Mode will only be available for the 16-inch MacBook Pro with the M1 Mx processor, which starts at $3,099. It will not be available for M1 Pro models or the 14-inch MacBook Pro with the M1 Max processor. It’s not clear why the smaller MacBook doesn’t have the same feature, but it likely has something to do with heat and battery life.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"734c2b8a3d4cb6c9c2a536dd336818787b7425b4da863b2dd3a58df9f14f33f6","category":"Apple"}