{"title":"Safety and immunogenicity of booster vaccination and fractional dosing with Ad26.COV2.S or BNT162b2 in Ad26.COV2.S-vaccinated participants","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002703","date":1712844000000,"content":"<p>by Catherine Riou, Jinal N. Bhiman, Yashica Ganga, Shobna Sawry, Frances Ayres, Richard Baguma, Sashkia R. Balla, Ntombi Benede, Mallory Bernstein, Asiphe S. Besethi, Sandile Cele, Carol Crowther, Mrinmayee Dhar, Sohair Geyer, Katherine Gill, Alba Grifoni, Tandile Hermanus, Haajira Kaldine, Roanne S. Keeton, Prudence Kgagudi, Khadija Khan, Erica Lazarus, Jean Le Roux, Gila Lustig, Mashudu Madzivhandila, Siyabulela F. J. Magugu, Zanele Makhado, Nelia P. Manamela, Qiniso Mkhize, Paballo Mosala, Thopisang P. Motlou, Hygon Mutavhatsindi, Nonkululeko B. Mzindle, Anusha Nana, Rofhiwa Nesamari, Amkele Ngomti, Anathi A. Nkayi, Thandeka P. Nkosi, Millicent A. Omondi, Ravindre Panchia, Faeezah Patel, Alessandro Sette, Upasna Singh, Strauss van Graan, Elizabeth M. Venter, Avril Walters, Thandeka Moyo-Gwete, Simone I. Richardson, Nigel Garrett, Helen Rees, Linda-Gail Bekker, Glenda Gray, Wendy A. Burgers, Alex Sigal, Penny L. Moore, Lee Fairlie</p>\r\n\r\nWe report the safety and immunogenicity of fractional and full dose Ad26.COV2.S and BNT162b2 in an open label phase 2 trial of participants previously vaccinated with a single dose of Ad26.COV2.S, with 91.4% showing evidence of previous SARS-CoV-2 infection. A total of 286 adults (with or without HIV) were enrolled &gt;4 months after an Ad26.COV2.S prime and randomized 1:1:1:1 to receive either a full or half-dose booster of Ad26.COV2.S or BNT162b2 vaccine. B cell responses (binding, neutralization and antibody dependent cellular cytotoxicity-ADCC), and spike-specific T-cell responses were evaluated at baseline, 2, 12 and 24 weeks post-boost. Antibody and T-cell immunity targeting the Ad26 vector was also evaluated. No vaccine-associated serious adverse events were recorded. The full- and half-dose BNT162b2 boosted anti-SARS-CoV-2 binding antibody levels (3.9- and 4.5-fold, respectively) and neutralizing antibody levels (4.4- and 10-fold). Binding and neutralizing antibodies following half-dose Ad26.COV2.S were not significantly boosted. Full-dose Ad26.COV2.S did not boost binding antibodies but slightly enhanced neutralizing antibodies (2.1-fold). ADCC was marginally increased only after a full-dose BNT162b2. T-cell responses followed a similar pattern to neutralizing antibodies. Six months post-boost, antibody and T-cell responses had waned to baseline levels. While we detected strong anti-vector immunity, there was no correlation between anti-vector immunity in Ad26.COV2.S recipients and spike-specific neutralizing antibody or T-cell responses post-Ad26.COV2.S boosting. Overall, in the context of hybrid immunity, boosting with heterologous full- or half-dose BNT162b2 mRNA vaccine demonstrated superior immunogenicity 2 weeks post-vaccination compared to homologous Ad26.COV2.S, though rapid waning occurred by 12 weeks post-boost.\r\nTrial Registration: The study has been registered to the South African National Clinical Trial Registry (SANCTR): DOH-27-012022-7841. The approval letter from SANCTR has been provided in the up-loaded documents.","author":"Catherine Riou","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"73578941864e6883bd16351af4acd55cafbe8a31dd1a806cbe2d919ad9cf7b8e","category":"Environment"}