{"title":"Artemisia argyi extracts overcome lapatinib resistance via enhancing TMPRSS2 activation in HER2‐positive breast cancer","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24202?af=R","date":1715774307000,"content":"<h2>Abstract</h2>\n<p>Breast cancer stands as the predominant malignancy and primary cause of cancer-related mortality among females globally. Approximately 25% of breast cancers exhibit HER2 overexpression, imparting a more aggressive tumor phenotype and correlating with poor prognoses. Patients with metastatic breast cancer receiving HER2 tyrosine kinase inhibitors (HER2 TKIs), such as Lapatinib, develop acquired resistance within a year, posing a critical challenge in managing this disease. Here, we explore the potential of <i>Artemisia argyi</i>, a Chinese herbal medicine known for its anti-cancer properties, in mitigating HER2 TKI resistance in breast cancer. Analysis of the Cancer Genome Atlas (TCGA) revealed diminished expression of transmembrane serine protease 2 (TMPRSS2), a subfamily of membrane proteolytic enzymes, in breast cancer patients, correlating with unfavorable outcomes. Intriguingly, lapatinib-responsive patients exhibited higher TMPRSS2 expression. Our study unveiled that the compounds from <i>Artemisia argyi</i>, eriodictyol, and umbelliferone could inhibit the growth of lapatinib-resistant HER2-positive breast cancer cells. Mechanistically, they suppressed HER2 kinase activation by enhancing TMPRSS2 activity. Our findings propose TMPRSS2 as a critical determinant in lapatinib sensitivity, and <i>Artemisia argyi</i> emerges as a potential agent to overcome lapatinib via activating TMPRSS2 in HER2-positive breast cancer. This study not only unravels the molecular mechanisms driving cell death in HER2-positive breast cancer cells induced by <i>Artemisia argyi</i> but also lays the groundwork for developing novel inhibitors to enhance therapy outcomes.</p>","author":"Chien‐Yi Ho, \nCheng‐Yen Wei, \nRuo‐Wen Zhao, \nYi‐Lun Ye, \nHui‐Chi Huang, \nJen‐Chih Lee, \nFang‐Ju Cheng, \nWei‐Chien Huang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"735f3cf75f50506eafbf80b0f412c47a02f0727aa3ddc82d3aef7f5ab67a8394","category":"Environment"}