{"title":"114 The efficacy of a natural fungus (Duddingtonia flagrans) in reducing gastrointestinal nematode indicators in lambs","link":"https://academic.oup.com/jas/article/102/Supplement_1/107/7618025?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Sustainable and profitable small ruminant production in the US is affected by infections with gastrointestinal nematodes (GIN), especially the blood sucking GIN, Haemonchus contortus. The overuse and misuse of available drug classes has led to multi-drug resistant GIN that pose significant challenges to parasite control on many farms. The objective of this study was to evaluate the effectiveness of a natural fungus (<span>Duddingtonia flagrans</span>; Bioworma, International Animal Health) in reducing GIN larval counts and other GIN indicators in hair sheep wethers. Eighteen St. Croix (n = 9) and Barbados Blackbelly (n = 9) wethers (227 ± 1.4 days of age and 29.7 ± 0.6 kg BW) were dewormed (d 0) with a combination of levamisol (Prohibit; 8 mg/kg BW) moxidectin (Cydectin; 0.2 mg/kg BW) and albendazole (Valbazen; 7.5 mg/kg BW) prior to the start of feeding according to the manufacturer’s recommendations for feeding BioWorma. At this time, lambs were separated into two treatment groups (n = 9/group), split into 3 replications per treatment group and placed on six pasture paddocks (0.06 ha; n = 3 per paddock) after accounting for breed, initial fecal egg count (FEC) and BW. Lambs were then fed daily either a grain supplement ration (corn and soybean meal) with Livamol with Bioworma (LIV) or without (CON) at 2% of their BW for 98 d. LIV was added to the ration based on total lamb BW/paddock. To evaluate the effect of LIV treatment, BW and body condition scores (BCS) were recorded every 2 wk for 98 d. Blood and fecal samples were also collected for determination of packed cell volume (PCV) and FEC. Pooled treatment group feces (d 0 – 98) were collected and cultured to determine GIN genera. A subset of animals/treatment (n = 3) will be harvested to determine abomasal worm counts. Data were analyzed using repeated measures in a mixed model, and FEC were log transformed before analysis. Following deworming (d 0), FEC were reduced by 100% by d 14. There was a mixed population of GIN at the start of the study (averaging 54%, 42%, 1.2% and 1.8% for H. contortus, Tricostrongylus spp., Oesphagostomum spp. and Nematodirus spp., respectively). LIV with Bioworma supplementation had no impact on BW, BCS, PCV or FEC in this study averaging 34.2 ± 0.3 kg, 2.5 ± 0.04, 34.7 ± 0.5% and 150.9 eggs per gram, respectively. Under the conditions of this study, Bioworma® supplementation had no influence on GIN indicators measured up to 100 d of grazing. This research will be continued during subsequent grazing seasons to determine the effect of continued supplementation on lamb parasite load and performance as well as pasture infestation levels.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7361efab86c31421cba3276c46c482d4449390c978ceedd1b0df3d202f6761f3","category":"Environment"}