{"title":"Ubisoft เปิดตัว Ghost Recon Frontline แนว Battle Royale ทีม 3 คน, โดนแฟนๆ รุมประท้วง","link":"https://www.blognone.com/node/125129","date":1633488086000,"content":"<div><div><div><p>Ubisoft เปิดตัว Ghost Recon Frontline เกมใหม่ในจักรวาล Ghost Recon ที่ยึดแนวทาง Battle Royale ตามสมัยนิยม (แต่ไม่รู้ว่าออกช้าเกินไปไหม) ด้วยแผนที่ขนาดใหญ่ มีผู้เล่น 102 คน (แบ่งเป็นทีม 3 คน) และเปิดให้เล่นแบบ free-to-play</p>\n<p>Ghost Recon Frontline ระบุว่าตัวเองต่างจากเกม Battle Royale ทั่วไป เพราะมีรูปแบบการเล่นเป็นทีม และไม่ได้ฆ่ากันจนเหลือทีมสุดท้ายอย่างเดียว แต่มีภารกิจในแผนที่เพื่อเก็บข่าวกรอง (intel) เมื่อมีทีมที่เก็บข่าวกรองได้มากพอแล้ว จะสามารถเรียกเฮลิคอปเตอร์มาที่ drop zone เพื่อออกจากเกาะ (ถือเป็นทีมที่ชนะ) เกมยังไม่มีกำแพงไฟที่ลดขนาดแผนที่ลงในตอนท้าย</p>\n<p>ผู้เล่นจะได้รับบทเป็นทหารรับจ้างไปทำภารกิจบนเกาะชื่อ Drakemoor มีระบบแผนที่เปลี่ยนไปตามสภาพอากาศ เช่น กลางคืน ฝนตก มียานพาหนะให้ขับขี่ และสามารถเลือกตัวละครได้จากหลายคลาส เบื้องต้นมีให้เลือก 3 คลาสคือ Assault, Support, Scout ในอนาคตจะมีคลาสอื่นๆ ตามมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/065889572f91e4ce70822d07021c71e0.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/19b95cfa5d54f63aef1a472808687b1b.jpg\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/912c9b3b5a719ab26ab002481e6faed3.jpg\" /></p>\n<p>Ubisoft บอกว่า Ghost Recon Frontline เป็นการปรับทิศทางใหม่ของซีรีส์ไปสู่เกมแนว PvP แบบผู้เล่นจำนวนมากๆ เกมรองรับการเล่นข้ามแพลตฟอร์ม จะออกบน Xbox Series X|S, Xbox One, PS5, PS4, พีซี, Stadia, Amazon Luna โดยจะเปิดทดสอบเบต้าแบบปิดในวันที่ 14 ตุลาคมนี้</p>\n<p>อย่างไรก็ตาม การเปิดตัว Ghost Recon Frontline ดูไม่เป็นที่ถูกใจของแฟนๆ Ghost Recon เท่าไรนัก ตอนนี้คลิปใน YouTube มีอัตรา dislike สูงกว่า like และ<a href=\"https://www.reddit.com/r/GhostRecon/\">โดนรุมถล่มใน Reddit</a></p>\n<p>เสียงวิจารณ์มักไปในทางว่า เกมแนวนี้มีอยู่เยอะแล้ว ไม่มีใครต้องการเล่นเกม Battle Royale ของ Ubisoft หรอก, รูปแบบเหมือนเกม Call of Duty: Warzone มากเกินไป, หาเงินแบบ microtransaction และการมาทำ Frontline อาจเป็นสัญญาณว่า Ubisoft จะไม่สนใจทำเกม Ghost Recon แบบดั้งเดิมอีกต่อไป เป็นต้น</p>\n<p>ที่มา - <a href=\"https://news.ubisoft.com/en-us/article/46Lv1AhBE1jRpEWT1vAAbM/ghost-recon-frontline-introduces-massive-freetoplay-multiplayer-battles\">Ubisoft</a>, <a href=\"https://venturebeat.com/2021/10/05/fans-rebel-after-ubisoft-announces-ghost-recon-frontline/\">VentureBeat</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ghost-recon\">Ghost Recon</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/ubisoft\">Ubisoft</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7363126d0c12e0947bc3492448f9dcc6a42a28cb994d1d4cf7794e46a00d5098","category":"Thai"}