{"title":"Strava Adds Direct Messaging Feature: How It Works In 2 Minutes!","link":"https://www.dcrainmaker.com/2023/12/messaging-feature-minutes.html","date":1701698692000,"content":"<p><span>﻿</span><span>﻿</span></p>\n<p>This is not a complex feature, nor hard to use. Starting today, the “social network for athletes” includes the most social of features: Texting. Or rather, direct messaging.</p>\n<p>This new feature lets you (optionally) accept direct messages from nobody, mutually following each other, or only people you follow. Within that, you can send text messages as well as a dedicated button for sharing Strava routes. Further, you can send GIFs – because obviously, messages without memes are nothing but failed KOM attempts. And there you go – in two sentences, you know everything there is to know about this feature.</p>\n<p>But, since you clicked on this headline or video, I’ll show you how it works. First up, as always with new Strava features, it might not immediately show up on your account. Do the usual dance of ensuring your app is updated, opening/closing your app, getting a coffee, or just coming back next week. Once that’s done, you’ll see a new message box icon in the upper right corner of the Strava dashboard page:</p>\n<p><img title=\"IMG_0585.jpg\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0585.jpg\" width=\"355\" height=\"768\" /></p>\n<p>There’s no desktop option at this time; it’s app-only first. While I generally agree with the app-first thinking (since that’s where the vast majority of Strava’s 100M+ users live), I do feel like this is a feature that should have some parity offered.</p>\n<p>Next, when you tap that, you’ll see a Settings icon, which gives you the three filtering options for inbound messages: Following (only people you follow), Mutuals (only if you follow each other), Nobody (aka Leave Me the Eff Alone!). The default is ‘Following’.</p>\n<p><img title=\"IMG_0586.jpg\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0586.jpg\" width=\"355\" height=\"768\" /><img title=\"IMG_0587.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0587.png\" width=\"355\" height=\"768\" /></p>\n<p>Next, you can tap the pencil at the top to create a new group chat session. Either just one with one person, or others. Your favorites are bubbled to the top:</p>\n<p><img title=\"IMG_0589.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0589.png\" width=\"355\" height=\"768\" /> <img title=\"IMG_0590.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0590.png\" width=\"355\" height=\"768\" /></p>\n<p>From here you can type text messages, and most notably, that little route icon next to the text box is a quick-select for choosing a route from your saved Strava Routes. You can add a note alongside that route.</p>\n<p><img title=\"IMG_0591 2.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0591-2.png\" width=\"355\" height=\"768\" /> <img title=\"IMG_0592 2.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0592-2.png\" width=\"355\" height=\"768\" /></p>\n<p>When the other people receive that route, they’ll be able to save it to their accounts, which in turn will generally sync automatically to their watches/GPS bike computers/etc… (e.g., Garmin/Wahoo/Hammerhead/Suunto/COROS/etc…).</p>\n<p>Next, and most importantly, you can type a forward slash: / to open up shortcut commands, which at the moment is just GIPHY. That in turn lets you then add text which searches for GIFs to add to the messages. It’s a bit weird, as you have to keep hitting ‘shuffle’ till you find one you like. But eventually, you find something suitable:</p>\n<p><img title=\"IMG_0594 2.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0594-2.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_0595.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0595.png\" width=\"235\" height=\"509\" /> <img title=\"IMG_0596.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0596.png\" width=\"235\" height=\"509\" /></p>\n<p>Like any other notification, these will show up as a push notification from Strava, such as to your home screen. Further, you can send links, which will enumerate the ‘featured image’ from that site/link – but you can’t send photos by themselves. And, once you realize all your friends do is send llama or eggplant memes, you can mute the conversation as well:</p>\n<p><img title=\"IMG_0605.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0605.png\" width=\"235\" height=\"509\" /><img title=\"IMG_0604.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0604.png\" width=\"235\" height=\"509\" /><img title=\"IMG_0599.PNG\" src=\"https://media.dcrainmaker.com/images/2023/12/IMG_0599.png\" width=\"235\" height=\"509\" /></p>\n<p>Overall, this is a feature that’s probably long overdue – albeit, I don’t think it’s a feature most people will use a ton. Instead, I expect it to be a feature that is sparingly useful, but super useful when you do. A really good example is if you go on a group ride/run with someone you’ve never met before, and you end up following each other on Strava post-ride, this is a handy way to message them for other contact details (since I always forget post-ride). And it also avoids having to randomly post your e-mail address in the comments section of your completed workout.</p>\n<p>Whereas I don’t anticipate most friends will use this amongst each other, except perhaps to share routes. Though even for that I’d just tend to tap the button to share a route to a text message or e-mail group.</p>\n<p>But ultimately, as the self-proclaimed social network for athletes, having a message feature just makes sense. Albeit, I wouldn’t mind being able to send photos too, for example, extra ride/run photos from a group ride that didn’t make the cut for inclusion to my activity photos.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"73664663b0ef37979959ffffc8b108268e21ec7373fd04fbf5dfff09e99ede2c","category":"Cycling"}