{"title":"Exogenous Fatty Acids Remodel the Muscle Fatty Acids Composition of the GIFT Tilapia (Oreochromis niloticus)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/2715178?af=R","date":1710399600000,"content":"<p>To reduce the negative impact of fish oil substitutes on the fatty acid composition of farmed fish, this experiment utilized different types of oils as dietary lipid sources for GIFT tilapia. Tilapia oil (FO) was used as the control, along with corn oil (CO), linseed oil (LO), algae oil (AO), and a mixture of linseed oil and algae oil in various ratios of 1 : 2, 1 : 1, and 2 : 1 (LA12, LA11, and LA21) to reshape the fatty acid profile of GIFT tilapia (0.205 ± 0.005 g) in the muscle. The weight gain and specific growth rate of tilapia in the LO and control groups were significantly higher than in other treatments (<i>P</i> &lt; 0.05). Meanwhile, despite the AO group exhibited the highest docosahexaenoic acid (DHA) content (<i>P</i> &lt; 0.05), it also exhibited the highest levels of malondialdehyde content and superoxide dismutase activity (<i>P</i> &lt; 0.05). The mRNA expression levels of <i>Δ</i>6/<i>Δ</i>5 fatty acyl desaturase 2 (<i>Δ</i>6/<i>Δ</i>5FADs2), <i>Δ</i>4 fatty acyl desaturase 2 (<i>Δ</i>4FADs2), acetyl-CoA carboxylase <i>α</i> (ACC<i>α</i>), and elongase of very long chain fatty acids 5 (ELOVL5) in the hepatopancreas of LO group were exhibited a significant upregulation compared to the control (<i>P</i> &lt; 0.05). The synthesis of DHA and eicosapentaenoic acid (EPA) in the muscles of LA12, LA11, and LA21 groups increased as the proportion of DHA decreased in the diets. In conclusion, the edible value of fatty acids of tilapia muscle, especially n-3 long-chain polyunsaturated fatty acids, can be significantly improved by adjusting the oil source in the diet through lipid metabolism.</p>","author":"Zhenye Liang, \nZongzheng Jiang, \nSen Wu, \nYujia Zhai, \nShuqi You, \nChang Xu, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"7369d551f8dc0a43286bb66942155fa78137b4a1e63fbb80f36d47df3ee8d8ea","category":"Environment"}