{"title":"India Is Considering EU-Style Charger Rules That Would Block Older iPhones From Sale","link":"https://www.reuters.com/technology/apple-warns-indias-eu-style-charger-rules-will-hit-local-production-target-2023-12-05/","date":1701826379000,"content":"\n<p>Aditya Kalra and Munsif Vengattil, reporting for Reuters from New Delhi:</p>\n\n<blockquote>\n  <p>India wants to implement a <a href=\"https://www.reuters.com/technology/eu-countries-lawmakers-clinch-deal-single-mobile-charging-port-2022-06-07/\">European Union rule</a> that will \nrequire smartphones to have a universal USB-C charging port, and \nhas been in talks with manufacturers about introducing the \nrequirement in India by June 2025, six months after the deadline \nin the EU. While all manufacturers including Samsung have agreed \nto India’s plan, Apple is pushing back. [...] </p>\n\n<p>In a closed-door Nov. 28 meeting chaired by India’s IT ministry, \nApple asked officials to exempt existing iPhone models from the \nrules, warning it will otherwise struggle to meet production \ntargets set under India’s production-linked incentive (PLI) \nscheme, according to the meeting minutes seen by Reuters. [...] </p>\n\n<p>In terms of market share, Apple accounts for 6% of India’s booming \nsmartphone market, compared with just about 2% four years ago. \nApple suppliers have expanded their facilities and make most \niPhone 12, 13, 14 and 15 models in India for local sales and \nexports, Counterpoint Research estimates. Only iPhone 15 has the \nnew universal charging port. Apple told Indian officials in the \nmeeting that the “design of the earlier products cannot be \nchanged,” the document showed. </p>\n\n<p>Consumers in India’s price-conscious market prefer buying older \nmodels of iPhones which typically become cheaper with new \nlaunches, and India’s push for the common charger on older \nmodels could hit Apple’s targets, said Prabhu Ram, head of the \nIndustry Intelligence Group at CyberMedia Research. “Apple’s \nfortunes in India have primarily been tied to older generation \niPhones,” he said. </p>\n</blockquote>\n\n<p>I was under the impression that the EU’s USB-C requirement will only apply to <em>new</em> devices, but maybe not? A plain reading of <a href=\"https://www.europarl.europa.eu/news/en/press-room/20220930IPR41928/long-awaited-common-charger-for-mobile-devices-will-be-a-reality-in-2024\">this EU press release</a> suggests that all phones sold, starting in 2025, must have USB-C charging ports:</p>\n\n<blockquote>\n  <p>By the end of 2024, all mobile phones, tablets and cameras sold in \nthe EU will have to be equipped with a USB Type-C charging port. \nFrom spring 2026, the obligation will extend to laptops. </p>\n</blockquote>\n\n<p>That would mean, starting in January 2025, that the only iPhones available in the EU will be this year’s iPhones 15 and next year’s iPhones 16. A new fourth-generation iPhone SE with USB-C would give Apple a much-needed lower-priced model. The second-gen SE came in 2020; the current third-gen SE in 2022.</p>\n\n<p><strong>See also:</strong> <a href=\"https://9to5mac.com/2023/12/05/usb-c-charging-port-law-india/\">Ben Lovejoy at 9to5Mac</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/12/05/india-usbc-iphones\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7369e47c1dc49ed5c91d77d3eb59ca340bdc9981071139bc36ec46aea675393e","category":"Tech"}