{"title":"How to switch from Fitbit to Apple Watch","link":"https://www.macworld.com/article/1787395/how-to-switch-from-fitbit-to-apple-watch.html","date":1704644100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Switching from a Fitbit smartwatch or tracker to an Apple Watch does means changing the way you view your goals, targets, and achievements, and will initially alienate and frustrate Fitbit users switching to the Apple fitness regime.</p>\n\n\n\n<p>You’ll get used to it but Apple hasn’t made it easy for switchers to find a natural match for their beloved Fitbit familiarity. As with getting fit, you need to work at it. In the end, you’ll miss some Fitbit features but prefer the overall Apple Watch experience.</p>\n\n\n\n<p>Apple’s Activity app focuses primarily on <strong>Movement</strong>, <strong>Exercise</strong>, and <strong>Standing</strong> rather than Fitbit’s more straightforward <strong>Step</strong>, <strong>Floor</strong>, and <strong>Distance</strong> measurements.</p>\n\n\n\n<p>Fitbit users will be put out by Apple’s different approach to fitness and health metrics, but there are ways to make the transition easier and force the Apple Watch to behave more like a Fitbit.</p>\n\n\n\n<p>Fitbit switchers will have to show some patience and flexibility when moving to the Apple Watch and may never get the same simple joy they previously enjoyed with Fitbit, but the Apple Watch does offer much better smartwatch functionality and closer interaction with the iPhone.</p>\n\n\n\n<p><strong>About me</strong>: I’ve been a Fitbit user since the original Classic pedometer in 2009. I have reviewed Fitbits, from clip-on trackers to smartwatches, but it looks to me like now is the time to change to an Apple Watch, despite my love of being a Fitbit user.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>Apple Watch Series 9</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img width=\"2400\" height=\"1350\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?quality=50&amp;strip=all\" loading=\"lazy\" alt=\"Apple Watch Series 9\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-S9-carbon-neutral-lineup-230912.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" />\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://www.macworld.com/article/2066958/apple-watch-series-9-vs-series-8-s9-chip-display-storage.html\" target=\"_blank\">Read our review</a>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tFrom $399\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0CHX8SZQS?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$349 at  Amazon</a>\t\t\t\t\t\t\t\t\t\t\t<span> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://bestbuy.7tiv.net/c/321564/633495/10014?prodsku=6539358&amp;u=https://api.bestbuy.com/click/-/6340268/pdp&amp;intsrc=CATF_4831&amp;subid1=1-1-1787395-5-2064755-9934\" target=\"_blank\">$349 at  Best Buy</a>\t\t\t\t\t\t\t\t\t\t\t<span> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://goto.walmart.com/c/321564/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https://www.walmart.com/ip/Apple-Watch-Series-9-GPS-41mm-Starlight-Aluminum-Case-with-Starlight-Sport-Loop/5053502765&amp;subid1=1-1-1787395-5-2064755-9934\" target=\"_blank\">$349 at  Walmart</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<h2>Why switch from Fitbit to Apple Watch?</h2>\n\n\n\n<p>Since being bought by Google in 2019, Fitbit devices appear to have slipped down the new owner’s priority list for new features and enhancements.</p>\n\n\n\n<p>Indeed, the latest Fitbit smartwatches have actually lost features, and are now more like fitness trackers in a smartwatch shape. The newest versions of the Fitbit Versa and Fitbit Sense (Versa 4 and Sense 2) are not as advanced as their predecessors (Versa 3 and Sense). They have been kneecapped in terms of on-device apps and “streamlined” (Fitbit’s words) on former favorites such as challenges and social groups. Just read our sister title Tech Advisor’s reviews of the latest <a href=\"https://www.techadvisor.com/article/1341013/fitbit-versa-4-review.html\" target=\"_blank\">Fitbit Versa 4</a> and <a href=\"https://www.techadvisor.com/article/1345848/fitbit-sense-2-review.html\" target=\"_blank\">Sense 2</a> and PCWorld’s take on <a href=\"https://www.pcworld.com/article/2192644/fitbit-doesnt-back-its-products-so-why-should-you.html\" target=\"_blank\">how Fitbit updates are killing its trackers</a>.</p>\n\n\n\n<p>The Versa 4 and Sense 2 basically had their third-party app support ripped out and lost even some of Fitbit’s own functions, such as Music Control and, weirdly for a Google product, Google Assistant.</p>\n\n\n\n<p>Google appears to be focusing on its own more expensive Pixel Watch, which incorporates Fitbit health tracking. If you want a proper smartwatch, Fitbit is now the wrong solution unless you choose the <a href=\"https://www.techadvisor.com/article/2108052/google-pixel-watch-2-review.html\" target=\"_blank\">Google Pixel Watch</a>. Google even states that the Pixel Watch features “Fitbit’s most accurate heart rate tracking yet”—another slap in the face for iPhone-using Fitbit fans.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Google-Pixel-Watch-vs-Fitbit.jpg?quality=50&amp;strip=all&amp;w=1149\" alt=\"Google Pixel Watch and Fitbit Sense 2 smartwatches\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Google-Pixel-Watch-vs-Fitbit.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Google-Pixel-Watch-vs-Fitbit.jpg?resize=287%2C300&amp;quality=50&amp;strip=all 287w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Google-Pixel-Watch-vs-Fitbit.jpg?resize=768%2C802&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Google-Pixel-Watch-vs-Fitbit.jpg?resize=1149%2C1200&amp;quality=50&amp;strip=all 1149w\" width=\"1149\" height=\"1200\" /><figcaption>Google Pixel Watch (top) and Fitbit Sense 2</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>As the Google Pixel watch works only with Android, iPhone users must switch to Apple’s Watch for smart features. Fitbit’s trackers do have basic smart features—such as notifications—but if you want a proper watch experience with your iPhone, Google/Fitbit is forcing you to Apple.</p>\n\n\n\n<p>The Google Pixel Watch is also more expensive than Fitbit smartwatches—starting at $349/£339 compared to the Versa 4 at $199/£179. That said, switching to the Apple Watch is not cheap either, with Watch prices starting at $249/£219 (SE) and rapidly rising to $799/£799 (Ultra 2).</p>\n\n\n\n<p>iPhone users will soon face the inevitable and must look at the Apple Watch as an alternative smartwatch, or just move to the top-end Fitbit trackers rather than smartwatches—such as the more-than-able <a href=\"https://www.techadvisor.com/article/2129660/fitbit-charge-6-review.html\" target=\"_blank\">Fitbit Charge 6</a>.</p>\n\n\n\n<h2>Setting up</h2>\n\n\n\n<p>As you’d expect from Apple, setting up the Watch is a simple process, where Fitbit setup can be a bit hit and miss over Wi-Fi. </p>\n\n\n\n<p>Compatible apps from your iPhone are automatically added to the Watch.</p>\n\n\n\n<p>You’ll have to get used to more than one iPhone app rather than the solitary Fitbit app as Apple spreads the settings and data across three apps: Watch, Health, and Activity</p>\n\n\n\n<p>So far, so good…</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Fitbit-Today-vs-Apple-Watch-Activity-app-summary.jpg?quality=50&amp;strip=all\" alt=\"Fitbit app Summary vs Apple Activity Summary\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Fitbit-Today-vs-Apple-Watch-Activity-app-summary.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Fitbit-Today-vs-Apple-Watch-Activity-app-summary.jpg?resize=300%2C220&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Fitbit-Today-vs-Apple-Watch-Activity-app-summary.jpg?resize=768%2C564&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"752\" /><figcaption>Apple’s Activity rings are certainly colorful, but Fitbit users will initially miss the simple Step and Distance counts.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Steps</h2>\n\n\n\n<p>Counting the number of steps you make during the day is at the core of Fitbit metrics. While the daily 10,000-step target is not based on actual science, it’s well held by medics that even gentle walking to this level is definitely good for your health in many ways.</p>\n\n\n\n<p>10,000 steps are about the same as walking four to five miles, depending on your stride, and a number that has been linked to a decreased risk of cardiovascular disease (heart disease, stroke, and heart failure), multiple types of cancer, and dementia.</p>\n\n\n\n<p>Fitbit uses Steps as its primary goal, although you can switch this to Distance, Calories, or Active Zone Minutes if you prefer—but Steps will always remain an important target. Apple, on the other hand, does not regard steps as one of its three primary fitness goals (Move, Activity, Stand). Apple instead concentrates its red Activity Move ring on how many active calories you’ve burned, the green Exercise ring on how many minutes of brisk activity you’ve done, and the blue Stand ring on how many times in the day you’ve stood and moved for at least one minute each hour.</p>\n\n\n\n<p>Steps is an easier metric to relate to than active calories, and I think that Apple is over-thinking its motivational metrics here.</p>\n\n\n\n<p>And what if you want to keep counting the number of steps you make each day via the Apple Watch?</p>\n\n\n\n<h2>How to add Steps count to your Apple Watch face</h2>\n\n\n\n<p>While you can see steps inside the Activity app, Apple doesn’t offer a way to display it as a complication on the face, so you need a third-party app such as Pedometer++.  </p>\n\n\n\n<p>This is how you add steps to the Apple Watch via complications.</p>\n\n\n\n<ol>\n<li>Press the Digital Crown to see the Home Screen, then tap the App Store.</li>\n\n\n\n<li>Type in Pedometer (you can use your iPhone to type if you find it easier; you’ll be prompted) and tap Search.</li>\n\n\n\n<li>Once Pedometer++ is installed, you can set the complication</li>\n\n\n\n<li>Go to the My Watch app on your iPhone and at the top, you’ll see My Faces. Choose the Activity Digital clock face—this is the closest you’ll get to mimicking a Fitbit Versa or Sense clock face with stats on show.</li>\n\n\n\n<li>You can change the text color and other settings here, but for now, look for <em>Complications</em>.</li>\n\n\n\n<li>Here you can set Steps as one of the complications and it should then show up on your clock face where you told it to. I chose <em>Steps</em> as the Top Left Complication, Heart Rate in the top right, and <em>Steps &amp; Distance</em> at the Bottom.</li>\n</ol>\n\n\n\n<p>Note that, unlike with Fitbit, the step count that now shows on your Apple Watch clock face isn’t a live step count but is updated on a regular basis.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-shows-steps-distance.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch showing Steps and Distance\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-shows-steps-distance.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-shows-steps-distance.jpg?resize=300%2C238&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-shows-steps-distance.jpg?resize=768%2C610&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"813\" /><figcaption>It’s possible to have steps shown on the Apple Watch but it’s not automatic.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Just note, if you set the bottom complication to <em>Steps &amp; Distance</em> you get a more accurate step count than you do in the top left <em>Steps</em> one. Neither is a live step count, so depending on when they update, you’ll often see different step counts.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit users are going to have to rewire their fitness-measurement brain when switching to the Apple Watch. Steps are not entirely out but the motivating Red, Green, and Blue Activity rings take a little getting used to. Some will prefer steps to be at the forefront, but it’s like you’ve changed personal trainer, you’ll find new motivation tactics work in the end.</p>\n\n\n\n<h2>Floors</h2>\n\n\n\n<p>Apple and Fitbit count the number of floors you walk/climb each day using the built-in barometric altimeter to count “flights climbed” based on atmospheric pressure changes.</p>\n\n\n\n<p>Again, Apple doesn’t regard the floor/flight metric as a primary measurement, and you have to go through the same rigmarole as you did with steps if you want to show flights on your Apple Watch face. Otherwise, the stats for flights climbed is found in the Activity app with some scrolling down to get to the numbers.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Floors climbed is not used as a main fitness metric, so you’ll you need to use a complication as described in the Steps section above.</p>\n\n\n\n<h2>Distance</h2>\n\n\n\n<p>It’s the same story for showing the distance you walked, run, or hopped through the day. You can set it as a complication in the Activity Digital clock face—at the bottom in <em>Steps &amp; Distance</em> works well enough.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Like steps, then you need to manually set up a complication to see the distance traveled.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-calorie-count-goal.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch calorie count goal\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-calorie-count-goal.jpg?quality=50&amp;strip=all 1000w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-calorie-count-goal.jpg?resize=300%2C180&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-calorie-count-goal.jpg?resize=768%2C460&amp;quality=50&amp;strip=all 768w\" width=\"1000\" height=\"599\" /><figcaption>Apple equates calories with movement.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Calories</h2>\n\n\n\n<p>Counting calories either in or out of the body is quite a subjective process, so Apple’s insistence on Calories Burned as a primary goal seems an oddly unequal one.</p>\n\n\n\n<p>Many people equate calories burned as a weight-loss rather than movement metric, and it could suggest that fitness is about being slim rather than being healthy. Fitbit, to its credit, doesn’t even show Calories as a metric to child accounts. Calories can be a toxic measurement.</p>\n\n\n\n<p>Apple uses your personal information–height, weight, gender and age–plus other daily activity metrics—including your Active Metabolic Rate or AMR— to calculate how many calories you burn.</p>\n\n\n\n<p>Fitbit devices combine your basal metabolic rate (BMR) based on the physical data you entered into your Fitbit account (height, weight, sex, and age) with the rate at which you burn calories at rest plus your activity and heart-rate data (AMR) to estimate your calories burned at rest and in exercise.</p>\n\n\n\n<p>Fitbit considers that at least half the calories you burn in a day are used up maintaining vital body functions (such as breathing, blood circulation, and heartbeat). Because your body burns calories when you’re sleeping or not moving when you wake up Fitbit shows you the calories already burned, and this number increases throughout the day.</p>\n\n\n\n<p>The number you see on your Fitbit device is your total calories burned for the whole day. The number you see on the Apple Watch is just the supposed calories burned through exercise.</p>\n\n\n\n<p>It is not as accurate a measurement as counting steps, and it’s a curious one for Apple to hang its hat on. While it’s easy to compete with friends or plan a day based around walking, boasting about calorie burn is just not a real thing.</p>\n\n\n\n<p>Most activity tracker users don’t regularly change their physical data—for example, weight—so as this changes, the calorie count becomes less accurate.</p>\n\n\n\n<p><strong>Switcher tip:</strong> No device is accurate at calculating—let’s be honest, estimating—the number of calories burned, but the red ring on the Apple Watch Activity app is a primary goal Fitbit users will just have to get used to when they switch. Please, Apple, allow users to customize this ring to Steps.</p>\n\n\n\n<h2>Active Zone Minutes (AZM)</h2>\n\n\n\n<p>Fitbit counts Active Zone Minutes (AZM) as your time spent in any heart-pumping activity. Its default goal is based on the medically recommended 150 minutes of moderate activity or 75 minutes of vigorous activity per week.</p>\n\n\n\n<p>It rates your activity based on your age and resting heart rate, and then determines which of three active zones you reach during the day. The harder you work the more credit you get: one minute in the Fat Burn zone earns you one active zone minute (AZM). A minute in the Cardio or Peak zones earns you two AZMs.</p>\n\n\n\n<p>Fitbit devices buzz you as you enter each zone.</p>\n\n\n\n<p>While Apple’s Activity app relies on arm motion and the Watch’s accelerometer to track Movement (the red calories ring), the Exercise measurement (green ring) uses the accelerometer and heart-rate sensor and GPS.</p>\n\n\n\n<p>The Exercise ring tracks how many minutes you spent exercising during the day. Apple Watch measures your heart rate and movement to count Exercise minutes and fill up your Exercise ring. Apple says it is looking for any activity that’s at least as intense as a brisk walk.</p>\n\n\n\n<p>By using the Workout app, you help the Watch count Exercise minutes more accurately.</p>\n\n\n\n<p>Your Apple Watch is looking for an elevated heart rate while sensing movement.</p>\n\n\n\n<p><strong>Switcher tip:</strong> If you are happy with a simple Exercise goal, then Apple’s Exercise ring is easier to understand than Fitbit’s Active Zone Minutes, but you get more detailed breakdowns from Fitbit on heart-rate during exercise—nicely visualized in the Fitbit app.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Ultra - Workouts\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-Ultra_-review.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>You can start a Workout  in the dedicated Watch app, or the Watch itself will suggest it after 10-15 minutes of suspected exercise</figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<h2>Exercise</h2>\n\n\n\n<p>What Fitbit calls “Exercise” is called “Workouts” by Apple.</p>\n\n\n\n<p><strong>Workouts tracked by Fitbit</strong>: Walk, Run, Bike, Elliptical, Stairclimber, Interval Workout, Hike, Yoga, Circuit Training, Pilates, Martial Arts, Kickboxing, Swim, Outdoor Workout, Spinning, Golf, Bootcamp, Tennis, Treadmill, Weights, Workout.</p>\n\n\n\n<p><strong>Workouts tracked by Apple Watch</strong>: Walk, Run, Cycling, Elliptical, Rower, Stair Stepper, HIIT, Hiking, Yoga, Functional Strength Training, Dance, Cooldown, Core Training, Pilates, Tai Chi, Swimming, Wheelchair, Multisport, Kickboxing.</p>\n\n\n\n<p>Both activity devices can automatically sense that you have started certain forms of exercise and suggest you begin tracking them.</p>\n\n\n\n<p><strong>Fitbit will automatically track</strong>: Aerobic workout, Elliptical, Outdoor bike, Run, Sports, Swim, Walk.</p>\n\n\n\n<p><strong>Apple Watch will automatically track</strong>: Indoor Walk, Outdoor Walk, Indoor Run, Outdoor Run, Outdoor Cycling, Elliptical, Rowing Machine, Pool Swim, Open Water Swim.</p>\n\n\n\n<p>You can turn off auto-workout detection on both devices if you find it bothersome, which it can be if you are out and about moving around for longer than 15 minutes.</p>\n\n\n\n<p>Apple gives you much more on-wrist detail about your workout when it’s ended or paused, plus split information during your run or walk. Fitbit users have to swipe to get as much on-wrist data during exercise.</p>\n\n\n\n<p>Both Fitbit and Watch app store and share past exercise/workout data in more detail on the phone in the Days of Exercise (Fitbit) or Activity (Watch) sections. Fitbit’s data visualizations are more simple and easy to digest. Apple’s are more hardcore sports science in looks. The simple exerciser will prefer Fitbit’s friendlier graphics. More dedicated sports enthusiasts will dig Apple’s graphs.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?quality=50&amp;strip=all&amp;w=1197\" alt=\"Fitbit Exercise data vs Apple Watch Workout data graphs\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?resize=150%2C150&amp;quality=50&amp;strip=all 150w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?resize=300%2C300&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?resize=768%2C770&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Exercise-vs-Apple-Watch-Workout.jpg?resize=1197%2C1200&amp;quality=50&amp;strip=all 1197w\" width=\"1197\" height=\"1200\" /><figcaption>Apple’s post-workout summary is nicely detailed and laid out—for once, its fitness graphs are better looking than Fitbit’s.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>On a tracked walk or run, the Apple Watch will show you the workout duration, active calorie burn, heart rate bpm, average pace and distance. With more swiping, Fitbit shows you workout duration, steps, active zone minutes, active calorie burn, heart rate bpm, average pace and distance.</p>\n\n\n\n<p><strong>Switcher tip:</strong> In the moment, the Apple Watch gives you more detail than Fitbit about your exercise, but the casual exerciser will take some getting used to Apple’s pro sports data displays.</p>\n\n\n\n<h2>Hourly Activity</h2>\n\n\n\n<p>One of my favorite health prompts is Fitbit’s Hourly Activity tracking, which suggests you get up and walk at least 250 steps an hour—you set which consecutive hours you want to be prompted on.</p>\n\n\n\n<p>Apple takes this further by making it one of its primary goals, with its own blue ring in the Activity app.</p>\n\n\n\n<p>Apple calls it <strong>Stand</strong>, and that’s nearly all you have to do: get up out of your chair and mooch about a bit for a minute, and you are rewarded with a ping and a congratulations if you haven’t got up for the first 50 minutes of the hour. Wheelchair users get a prompt to Roll instead of Stand.</p>\n\n\n\n<p>Fitbit’s 250-step rule makes you work harder for your hourly reward than Apple’s Stand count. You can get a Stand point if you get up and wander off to the toilet in the night.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Both Hourly Activity and Stand are helpful, and Fitbit users will quickly appreciate the lower threshold of the Apple Watch’s Stand metric, but that’s maybe just me being lazy.</p>\n\n\n\n<h2>Motivation</h2>\n\n\n\n<p>Apple is much more lively when it comes to suggesting you pick up the pace when it comes to hitting your goals, although the Watch can be told to quit the personal-trainer chat.</p>\n\n\n\n<p>It’s also politer, with a Good Morning message that reminds you of the Watch’s battery level—particularly important given the Watch’s feeble battery life.</p>\n\n\n\n<p>At first, I found the activity rings to be too simplistic compared to Fitbit’s raw step count. But the more I used the Apple Watch, the better I appreciated the rings as a quick motivating signal, and the numbers are also included on the Digital Activity clock face.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit users might miss the weekly Fitbit Progress Report email that summarizes your 7-day effort across multiple statistics. But for during-the-day motivation, the Apple Watch is a better motivator.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Resting-Heart-Rate.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Resting Heart Rate graph\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Resting-Heart-Rate.jpg?quality=50&amp;strip=all 1000w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Resting-Heart-Rate.jpg?resize=256%2C300&amp;quality=50&amp;strip=all 256w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Resting-Heart-Rate.jpg?resize=768%2C902&amp;quality=50&amp;strip=all 768w\" width=\"1000\" height=\"1174\" /><figcaption>Apple measures your Resting Heart rate over time</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Heart</h2>\n\n\n\n<p>Monitoring your heart rate is core to both Fitbit and Apple Watch, and both do an excellent job at using this data to power insights into your exercise and general health.</p>\n\n\n\n<p>Both calculate the number of times the heart beats per minute—your heart rate in bpm—using a technology tongue-twistingly called photoplethysmography.</p>\n\n\n\n<p>When your heart beats, capillaries expand and contract based on blood volume changes. To determine your heart rate, the optical heart-rate sensor in the Fitbit and Apple Watch flashes green LEDs hundreds of times per second to detect these volume changes in the capillaries above your wrist. Then your device calculates how many times your heart beats per minute.</p>\n\n\n\n<p>Your <strong>Resting Heart Rate (RHR)</strong> is the number of times your heart beats per minute when you’re still and well-rested and not dashing around, lifting weights or playing tennis. In general, your RHR should be between 60-100 bpm. Under 60 is normal for super-fit athletes.</p>\n\n\n\n<p>Your heart rate will increase when you are more physically active (your heart is working to pump more oxygen-rich blood around your body), and both devices use this data to determine how much energy you are using while exercising.</p>\n\n\n\n<p>Your target heart rate should be about 50-70% of your maximum heart rate during moderate-intensity activity like walking. To find your normal maximum heart rate, subtract your age from 220. During more intense exercise activity, your target heart rate should be about 70-85% of your maximum heart rate.</p>\n\n\n\n<p>Both Fitbit and Apple Watch can also check <strong>Heart Rate Variability (HRV)</strong>, which is the variation in time between heartbeats. People with a higher HRV have better cardiovascular fitness and might be more resilient to stress. Mindfulness, meditation, sleep, and physical activity can help improve your HRV. A significant drop in HRV may indicate that your body is experiencing illness, stress, or depression or anxiety.</p>\n\n\n\n<p>To get to your HRV data from your Apple Watch, open the Health app on your iPhone, tap Browse and then choose Heart. Here you can find your Heart Rate, Resting Heart Rate, Heart Rate Variability, Walking Heart Rate Average, Cardio Recovery and Cardio Fitness, plus High Heart Rate Notifications and electrocardiogram (ECG) readings.</p>\n\n\n\n<p>Fitbit users should check the Health Metrics section of the Fitbit mobile app, where they can see their Breathing Rate, Resting Heart Rate, and Heart Rate Variability. In the Today section of the Fitbit app there are heart-rate and cardio-fitness graphs. Heart Rate Notifications can be found here, too.</p>\n\n\n\n<p>Another important heart rating is known as <strong>VO2 max</strong>, which is the maximum volume of oxygen your body can import, transport and utilize in a single minute during intense physical activity. Fitbit and Apple use VO2 max in their Cardio Fitness scores, but Fitbit uses multiple workout data to determine its score where Apple uses just the heart and motion sensors during an Outdoor Walk, Outdoor Run, or Hiking workout in the Workout app.</p>\n\n\n\n<p>The electrical sensors on your Fitbit or Apple Watch detect your heart rhythm. When you use a special electrocardiogram (<strong>ECG</strong>) app, your heart rhythm data is analyzed for signs of Atrial fibrillation (AFib), which is a type of irregular heart rhythm, caused when the upper chambers of the heart beat out of rhythm.</p>\n\n\n\n<p>An ECG can help diagnose some heart conditions, such as abnormal heart rhythms and coronary heart disease (heart attack and angina).</p>\n\n\n\n<p>You can check your ECG with the Fitbit Charge 5, Fitbit Sense and Fitbit Sense 2, and on Apple Watch Series 4, Series 5, Series 6, Series 7, Series 8 or Ultra; the ECG app is not supported on Apple Watch SE or Fitbit Versa 3 &amp; 4.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>Apple Watch Ultra 2</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img width=\"2400\" height=\"1350\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?quality=50&amp;strip=all\" loading=\"lazy\" alt=\"Apple Watch Ultra 2\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" />\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://www.macworld.com/article/2087162/apple-watch-ultra-vs-ultra-2-s9-display-double-tap-storage-battery.html\" target=\"_blank\">Read our review</a>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t$799 (base)\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0CHX7J5Z3?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$749 at  Amazon</a>\t\t\t\t\t\t\t\t\t\t\t<span> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://bestbuy.7tiv.net/c/321564/633495/10014?prodsku=6539358&amp;u=https://api.bestbuy.com/click/-/6560074/pdp&amp;intsrc=CATF_4831&amp;subid1=1-1-1787395-5-2064833-9934\" target=\"_blank\">$749 at  Best Buy</a>\t\t\t\t\t\t\t\t\t\t\t<span> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.adorama.com%2Facw2ucoam.html&amp;publisher_slug=macworld&amp;exclusive=1&amp;article_name=macworld&amp;article_url=https%3A%2F%2Fwww.macworld.com%2Ffeed&amp;u1=1-1-1787395-5-2064833-9934\" target=\"_blank\">$799 at  Adorama</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<p><strong>Switcher tip:</strong> Both Apple and Fitbit measure the same heart measurements. It’s easier to see your current heart rate on the Fitbit clock face, although you might have to tap to find it if you are on another measurement display. You can set it as a feature on the Apple Watch’s Digital Activity clock face, but actual data is still a tap away.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Sleep-vs-Apple-Watch-Sleep.jpg?quality=50&amp;strip=all\" alt=\"Fitbit Sleep vs Apple Watch Sleep\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Sleep-vs-Apple-Watch-Sleep.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Sleep-vs-Apple-Watch-Sleep.jpg?resize=300%2C166&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Sleep-vs-Apple-Watch-Sleep.jpg?resize=768%2C424&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Fitbit-Sleep-vs-Apple-Watch-Sleep.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1024\" height=\"566\" /><figcaption>Fitbit’s  Sleep graph is easier to understand than Apple’s</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Sleep</h2>\n\n\n\n<p>The duration and quality of sleep is now seen as a major and significant health metric. Measuring sleep length and quality, and then trying to improve both is also a fascinating project. After all, going to bed earlier is surely easier than running a half marathon. Having a decent night’s sleep is not always easy, however, and so knowing your sleep quality by the minute can be a useful tool.</p>\n\n\n\n<p>Both Apple Watch and Fitbit can track your sleep and do so in similar ways.</p>\n\n\n\n<p>Apple Watch can estimate the time you spend in each sleep stage—Core, Deep and REM—as well as when you might have woken up.</p>\n\n\n\n<p>Fitbit estimates your sleep stages using a combination of your movement and heart-rate patterns. While you’re sleeping, it tracks the beat-to-beat changes in your heart rate, known as heart rate variability (HRV), which fluctuate as you transition between Light, Deep, and REM sleep stages.</p>\n\n\n\n<p>Fitbit’s Sleep Stages graph (viewed in the Fitbit iPhone app) is better looking and more informative than Apple’s (in the iPhone’s Health app), which looks a little squashed and fuzzy. </p>\n\n\n\n<p>Fitbit shows the most recent and a 30-day average of your sleep stages, and can benchmark this against people of a similar age and gender. It also shows your estimated oxygen variation here, but hides some detailed data (your Snore Score, Sleeping Heart Rate and Restlessness) behind the Fitbit Premium paywall.</p>\n\n\n\n<p>Apple shows most recent, weekly, monthly and six-monthly sleep data in rather difficult to gauge column graphs. It also shows your respiratory rate, and sleep duration over the past seven days.</p>\n\n\n\n<p>While both Fitbit and Apple can monitor your sleep, Apple’s recently improved sleep-tracking functionality is let down by the Watch’s much shorter battery life.</p>\n\n\n\n<p>I also found Fitbit’s sleep tracking to be more accurate, registering restless sleep better than Apple.</p>\n\n\n\n<p>The Apple Watch SE and Series 8 have a battery life of between 18 and 24 hours, depending on your usage.</p>\n\n\n\n<p>The Fitbit Versa 4 has a 6-day battery life, which means it is far less likely to die on you during the time you are sleeping.</p>\n\n\n\n<p>If you charge your Watch overnight, sadly sleep tracking is impossible. To ensure you can get sleep data every night, you’ll need to top of the Watch battery during the day, each day. With Fitbit, you need worry maybe twice a week at most.</p>\n\n\n\n<p>Where there are no third-party alternatives for Fitbit chargers, there are many for the Apple Watch as charging is a more pressing issue! There are some great charging stations that power up not just the Watch but also your iPhone and AirPods at the same time. Check out our roundup of the <a href=\"https://www.macworld.com/article/668468/best-apple-watch-chargers-stands-docks.html\" target=\"_blank\">best Apple Watch chargers, stands and docks</a>.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit’s sleep analysis is better, but Apple is catching up. But if sleep measurement is important to you, then switching from Fitbit to Apple watch means you must be methodical in your daytime device charging to ensure that the Watch is powered up for the night.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Series 8 battery life\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_7.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>Be prepared for more frequent charging with the Apple Watch than with Fitbit</figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<h2>Battery life</h2>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>Apple Watch SE (2nd generation)</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img width=\"1920\" height=\"1080\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png\" loading=\"lazy\" alt=\"Apple Watch SE (2nd generation)\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?quality=50&amp;strip=all 1920w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/apple-watch-se-2.png?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" />\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://www.macworld.com/article/1370015/apple-watch-se-2019-2022-design-specs-features-price.html\" target=\"_blank\">Read our review</a>\n\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t$249 (GPS only)\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://goto.walmart.com/c/321564/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https://www.walmart.com/ip/Apple-Watch-SE-2nd-Gen-GPS-40mm-Midnight-Aluminum-Case-with-Midnight-Sport-Band-S-M/1409379636&amp;subid1=1-1-1787395-5-1062020-9934\" target=\"_blank\">$229 at  Walmart</a>\t\t\t\t\t\t\t\t\t\t\t<span> | </span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<a href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.target.com%2Fp%2Fgoogle-pixel-watch-wifi-black-obsidian%2F-%2FA-87424817%3F&amp;publisher_slug=macworld&amp;exclusive=1&amp;article_name=macworld&amp;article_url=https%3A%2F%2Fwww.macworld.com%2Ffeed&amp;u1=1-1-1787395-5-1062020-9934\" target=\"_blank\">$299.99 at  Target</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t\n\n\n<p>The Watch SE and Series 8 have an 18-hour battery life, or 36 hours in Low Power Mode, which disables Always On display, heart rate notifications, background heart-rate and blood oxygen measurements, and the start workout reminder</p>\n\n\n\n<p>The Fitbit Versa 3 &amp; 4 and Sense 1 &amp; 2 should keep going for 6 days, so need a top up at least once a week.</p>\n\n\n\n<p>if you can afford it, the Apple Watch Ultra boasts a 36-hour battery life.</p>\n\n\n\n<p>We’ve mentioned the much weaker battery life of the Apple Watch—less than a third compared to the average Fitbit—when we investigated the different approaches to sleep monitoring. In fact, the process is much the same except for the risk with Apple that the Watch’s battery might give up halfway through the night if it isn’t charged enough.</p>\n\n\n\n<p>This means Fitbit switchers need to get into a new charging routine, remembering to charge during the day at some point. Using the supplied Apple Watch Magnetic Fast Charger to USB-C Cable is the fastest way to charge the Apple Watch but there are some excellent multi-device chargers that combine charging for iPhone, AirPods and Apple Watch.</p>\n\n\n\n<p>The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://makezens.com/shop/4-in-1-magsafe-watch-wireless-charging-station-white/&amp;xcust=1-1-1787395-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Zens 4-in-1 MagSafe + Watch Wireless Charging Station</a> can wirelessly fast-charge all three Apple devices at the same time, plus a fourth device via a wired port. A cheaper alternative is the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://alogic.co/uk/alogic-magspeed-3-in-1-wireless-15w-charging-station.html#231=309&amp;xcust=1-1-1787395-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Alogic MagSpeed 3-in-1 Wireless Charging Station</a>.</p>\n\n\n\n<p>It takes about two and a half hours to fully charge the Apple Watch. Charging a Fitbit is faster; around 1.5 to 2 hours, depending on the model.</p>\n\n\n\n<p>Note that to fast-charge an Apple Watch you need the USB-C Apple Watch Magnetic Charging Cable, rather than the USB-A version.</p>\n\n\n\n<p>One aspect where the Apple Watch wins: once it’s done charging, you get a notification on your iPhone letting you know it’s reached 100%.</p>\n\n\n\n<p><strong>Switcher tip:</strong> You’ll need to charge the Apple Watch more often than the Fitbit.</p>\n\n\n\n<h2>Skin Temperature</h2>\n\n\n\n<p>Both Fitbit and Apple Watch can measure the temperature on the skin’s surface overnight, and show you a personal baseline skin temperature, based on up to 30 days of data. Fitbit takes three nights data to start a baseline reading; Apple five nights.</p>\n\n\n\n<p>Fitbit Sense and Fitbit Sense 2 use a dedicated sensor to estimate your skin temperature variation each night. Fitbit Charge 4, 5 &amp; 6, Inspire 2 &amp; 3, Luxe and Versa series gauge your nightly skin temperature variation through existing sensors.</p>\n\n\n\n<p>Fitbit takes a measurement every minute you are sleeping; Apple every five seconds.</p>\n\n\n\n<p>The Apple Watch Series 8 &amp; 9 and Apple Watch Ultra 1 &amp; 2 measure skin temperature, using two temperature sensors—one on the back crystal near your skin, and another under the display.</p>\n\n\n\n<p>Note that changes in room temperature, bedding, circadian rhythm and menstrual cycle will affect the readings.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Both Fitbit and Apple’s skin temperature graphs will show you variation, which can be used to show the possible onset of a fever or changes in the menstrual cycle.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Blood-Oxygen-SPO2.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Blood Oxygen SpO2\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Blood-Oxygen-SPO2.jpg?quality=50&amp;strip=all 1000w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Blood-Oxygen-SPO2.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Blood-Oxygen-SPO2.jpg?resize=768%2C430&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Blood-Oxygen-SPO2.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1000\" height=\"560\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Oxygen Saturation (SpO2)</h2>\n\n\n\n<p>Your blood oxygen saturation (SpO2) is the percentage of your blood that contains oxygen, carrying it from your lungs to the rest of your body. It’s a useful metric to understand your overall health and wellness.</p>\n\n\n\n<p>It is especially important if you have a condition that can cause a reduction of blood oxygen levels, including chronic obstructive pulmonary disease (COPD), asthma, acute respiratory distress syndrome (ARDS), anemia, pneumonia, lung cancer, cardiac arrest, and heart failure, among others, as well as assessing individuals with sleep disorders such as sleep apnea.</p>\n\n\n\n<p>Fitbit users can check this in the Health Metrics section of the mobile app (under Today).</p>\n\n\n\n<p>Apple Watch users find their SpO2 score in the iPhone’s Health app under Respiratory and Blood Oxygen.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit’s data is a little easier to understand as its app has much nicer graphs, but the data is still there to be found for Apple Watch users.</p>\n\n\n\n<h2>Weight</h2>\n\n\n\n<p>Weighing yourself with an Apple Watch is not going to work, but Fitbit does offer its own set of digital scales, the <a href=\"https://www.techadvisor.com/article/720933/fitbit-aria-air-review.html\" target=\"_blank\">Fitbit Aria Air</a>, which will Bluetooth your weight to your Fitbit app.</p>\n\n\n\n<p>Apple Watch users can manually log their weight in the iPhone’s Health app.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Linking your Fitbit to the Aria scale is easier than manual logging.</p>\n\n\n\n<h2>Wheelchair users</h2>\n\n\n\n<p>Apple is much better for wheelchair users, who will appreciate the fitness algorithms and sensors specifically designed to help them track their activity. When the Wheelchair setting is turned on, the iPhone tracks pushes instead of steps and registers different types of push, speed, and terrain. Instead of a Stand goal, there’s Roll.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit doesn’t offer any special features for wheelchair users, so this is a welcome switch when used with your iPhone.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Mindfulness.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Mindfulness\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Mindfulness.jpg?quality=50&amp;strip=all 952w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Mindfulness.jpg?resize=300%2C171&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Mindfulness.jpg?resize=768%2C437&amp;quality=50&amp;strip=all 768w\" width=\"952\" height=\"542\" /><figcaption>Apple’s Mindfulness breathing app is much the same as Fitbit’s Relax guided breathing.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Guided Breathing</h2>\n\n\n\n<p>Fitbit’s Guided Breathing tool (the Relax app on the device) helps you take regular and deep breaths over a two-minute period—editable to up to ten minutes.</p>\n\n\n\n<p>Apple’s Mindfulness app on the Watch has two one-minute functions, editable to up to five minutes: Breathe (much like Fitbit’s Guided Breathing) and Reflect, which shows you some on-screen gloopy blobs to focus on while you think about one thing in particular.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Both Fitbit’s Guided Breathing and the Apple Watch’s Mindfulness apps are easy ways to calm down and improve your breathing whenever you want to during the day. Fitbit users will find the Apple approach very similar.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Achievement-Badges-Awards.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Achievement Badges Awards\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Achievement-Badges-Awards.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Achievement-Badges-Awards.jpg?resize=300%2C206&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Achievement-Badges-Awards.jpg?resize=768%2C526&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"701\" /><figcaption>Apple’s Fitness awards are shiny but not as much fun at Fitbit’s</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Achievement awards</h2>\n\n\n\n<p>Fitbit is a real champion of giving users fun awards for passing various milestones in their exercise activities. You’d get cheery badges when you walked the equivalent of the Sahara (2,983 miles) or climbed as high as a Rainbow (700 floors in a day). The further you walked, the better the Shoe badge, from Boast Shoes (5,000 steps in a day) to Olympian Sandals if you managed to walk 100,000 steps in a day.</p>\n\n\n\n<p>You can see your badge collection by clicking on your name in the Account section of the Fitbit app.</p>\n\n\n\n<p>Apple’s Watch badges can be found by swiping left twice on the Watch’s Activity app. These are rather abstract in a weird cheap-sports-shirt kind of way, and therefore difficult to get to know and love; see our feature on <a href=\"https://www.macworld.com/article/231140/how-to-get-all-of-the-apple-watch-activity-challenge-badges.html\" target=\"_blank\">how to get all the Apple Watch activity challenge badges</a>. Fitbit’s are far more motivational.</p>\n\n\n\n<p><strong>Switcher tip:</strong> If you love collecting achievement badges, Fitbit gets the award. Apple’s are just random colours and patterns, with the numbers hidden within like a visual riddle. It wouldn’t take much for Apple to remedy this—hire a better designer.</p>\n\n\n\n<h2>Challenges</h2>\n\n\n\n<p>One of the joys of being a Fitbit user was the company’s Challenges and Adventures, for which you could win trophies, competing either against yourself or friends. There were virtual races around real-world geographies, solo adventures and competitions such as the Work Week Hustle and even a fun Bingo game made up of fitness goals.</p>\n\n\n\n<p>Sadly—and this is a big reason why many Fitbit users are worried that owner Google is going to ruin the Fitbit experience—these have now all been stopped; or in Fitbit/Google talk “streamlined”.</p>\n\n\n\n<p>This is so that the Fitbit app can be “enhanced” with Google technology, although there is no sign yet that this Google technology with be as much fun as the old Fitbit offered.</p>\n\n\n\n<p>Fitbit users can, thankfully, still compete with friends on the Leaderboard and earn badges (see earlier section) for personal achievements. The Fitbit Leaderboard is a real motivation and to lose that would be the death knell for Fitbit in the eyes of many of its users.</p>\n\n\n\n<p>Apple issues a monthly challenge to its Watch users to provide an incentive to stay active and motivated and to form healthy habits. Apple Watch challenge examples include burning 20,000 calories in a month, doing 20 workouts and closing the activity rings a certain number of times.</p>\n\n\n\n<p>You can also share your Activity rings with friends and family for motivation, and invite friends to compete in a seven-day competition. You earn points by filling your Activity rings, getting a point for every percentage point you add to your rings each day. Whoever has the most points at the end of the competition wins.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit was once the clear leader in friends and family fitness challenges but has now given up aside from the terrific Leaderboard. Apple’s challenging process isn’t obvious and it could win a big steal on Fitbit with a bit of effort making this easier and more fun. Many Fitbit users won’t switch because their friends are also invested in the platform.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Health-data.jpg?quality=50&amp;strip=all&amp;w=1154\" alt=\"Apple Health app data\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Health-data.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Health-data.jpg?resize=288%2C300&amp;quality=50&amp;strip=all 288w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Health-data.jpg?resize=768%2C799&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Health-data.jpg?resize=1154%2C1200&amp;quality=50&amp;strip=all 1154w\" width=\"1154\" height=\"1200\" /><figcaption>Apple spreads its health and fitness data between apps. The Health app stores a lot of data</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Fitness and Health Apps</h2>\n\n\n\n<p>Both Fitbit and Apple have on-device and in-phone apps that you use to track or monitor various activities or health metrics.</p>\n\n\n\n<p><strong>Health apps on Apple Watch</strong>: Activity, Workout, Heart Rate, Mindfulness, Sleep, Blood Oxygen, ECG (Series 8 and Ultra), Cycle Tracking.</p>\n\n\n\n<p><strong>Health apps on Apple iPhone</strong>: Watch, Health, Fitness</p>\n\n\n\n<p><strong>Apps on Fitbit device</strong>: ECG, EDA Scan, Exercise, Relax, Today</p>\n\n\n\n<p><strong>Fitbit apps on Apple iPhone</strong>: Fitbit</p>\n\n\n\n<p>On the iPhone, Apple has a Watch app for settings, and a Health app for collecting your fitness and health data. Some data is quite buried in the Health app, and is not easy to find until you get used to it. There’s also an Activity app on the Watch that has an icon that looks exactly like the Fitness app on the iPhone, which is a little confusing.</p>\n\n\n\n<p>Fitbit’s mobile app is much more approachable, like a friendly personal trainer or kindly doctor than Apple’s bland or austere scientist approach.</p>\n\n\n\n<p>The Fitbit graphs are far more colorful and understandable, and store data more granularly than Apple.</p>\n\n\n\n<p><strong>Switcher tip:</strong> If you use your Fitbit mobile app a lot, you’ll be disappointed in Apple’s busy Health app. If you just use your Fitbit tracker or smartwatch, you’ll quickly get used to the Apple Activity app on the Watch—although it’s again more basic in the data you can find there.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Alarms-Timers-Stopwatches.jpg?quality=50&amp;strip=all\" alt=\"Apple Watch Alarms Timers and Stopwatches\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Alarms-Timers-Stopwatches.jpg?quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Alarms-Timers-Stopwatches.jpg?resize=300%2C225&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/Apple-Watch-Alarms-Timers-Stopwatches.jpg?resize=768%2C576&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"768\" /><figcaption>The Apple Watch stopwatches are more scientific in looks than Fitbit’s.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Watches, timers, and alarms</h2>\n\n\n\n<p>As its name suggests, the Apple Watch takes itself seriously as a timepiece as well as a smart wrist computer.</p>\n\n\n\n<p>There are nearly 60 Apple Watch faces to choose from, and many can be customized with what Apple calls “complications”—those parts on display that are not telling the main time.</p>\n\n\n\n<p>Fitbit users switching to the Apple Watch should start with the Activity Digital watch face as this will most closely mimic the standard Fitbit clock face.</p>\n\n\n\n<p>Available complications are numerous (at least 40), but the main metric that Fitbit users will want (Steps) is frustratingly not one of them. See above for the steps (ahem) you need to take to get your step count, distance, and other fitness metrics showing on the Apple Watch.</p>\n\n\n\n<p><strong>Timers</strong>: Fitbit users can use a Countdown timer and a Stopwatch on the Versa and Sense. Timers on the Apple Watch come with eight presets and the ability to add your own custom countdown. The Apple Watch has four different types of Stopwatch: Analog, Digital, Graph, and Hybrid.</p>\n\n\n\n<p><strong>Alarms</strong>: Setting an alarm is much the same on the Apple Watch as it is on the Fitbit. In addition, you can also use Siri to set an alarm on the Watch.</p>\n\n\n\n<p><strong>Switcher tip:</strong> There are more and better-looking timers on the Apple Watch, and the Alarms are about the same.</p>\n\n\n\n<h2>Notifications</h2>\n\n\n\n<p>All modern Fitbits can be set to receive phone and messenger app notifications when your phone is nearby, and with the Versa 3 &amp; 4 and Sense 1 &amp; 2 Fitbit users can even answer calls on your wrist, and select from Quick Replies to Android devices.</p>\n\n\n\n<p>With a Wi-Fi or cellular connection, the Apple Watch can make &amp; answer phone calls, and send &amp; receive messages even if the iPhone isn’t nearby.</p>\n\n\n\n<p>Messages read easier on the larger-screen Watches, and service was more consistent than on Fitbit, which can suddenly forget to show notifications for no apparent reason.</p>\n\n\n\n<p><strong>Switcher tip:</strong> While notifications on Fitbit are handy, if sometimes a little hit or miss, notifications on the Apple Watch are a noticeable step up.</p>\n\n\n\n<h2>Voice assistants</h2>\n\n\n\n<p>Before the app culling, Fitbit smartwatches had access to both Amazon Alexa and Google Assistant—neither available on the Apple Watch, which of course prefers its own Siri voice assistant. Fitbit Versa 4 and Sense 2 retain Alexa but Google has kept its own voice assistant for its Pixel Watch.</p>\n\n\n\n<p><strong>Switcher tip:</strong> If Siri is your favorite on the iPhone, then moving to the Apple Watch will be a welcome simplification of voice assistants.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"The app screen on an Apple Watch SE 2022\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/10/Apple-Watch-SE-2022-review-7.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>More apps on Apple Watch, if a little fiddly to find</figcaption></figure><p>Henry Burrell / Foundry</p></div>\n\n\n\n<h2>Smart apps</h2>\n\n\n\n<p>In pushing its own Android-only Pixel Watch on Fitbit users, Google has effectively given up on third-party app usage on its smartwatches, which no longer are worthy of the ‘smart’ title, outside of the fitness and health functions.</p>\n\n\n\n<p>Google wants the Pixel Watch to be the Android answer to the iPhone’s companion Apple Watch.</p>\n\n\n\n<p><strong>Apps on Fitbit devices</strong>: The Sense 2 has the most apps, including Alarms, Amazon Alexa, ECG, EDA Scan, Exercise, Fitbit Pay, Relax, Settings, Timers, Today, and Weather.</p>\n\n\n\n<p><strong>Apps on Apple Watch</strong>: Activity, Alarms, App Store, Audiobooks, Blood Oxygen, Calculator, Calendar, Camera Remote, Compass, Contacts, Cycle Tracking, ECG, Find Devices, Find Items, Find People, Heart Rate, Home, Mail, Maps, Medications, Memoji, Messages, Mindfulness, Music, News, Noise, Now Playing, Phone, Photos, Podcasts, Reminders, Remote, Settings, Shortcuts, Sleep, Stocks, Stopwatch, Timers, Tips, Voice Memos, Walkie-Talkie, Wallet, Weather, Workout, and World Clock.</p>\n\n\n\n<p>And that’s just the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/guide/watch/apdf1ebf8704/watchos&amp;xcust=1-1-1787395-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">apps built into the Apple Watch</a>. You can add many other third-party apps, such as Facebook Messenger, Citymapper, and, my handy but useful favorite, Bus Times.        </p>\n\n\n\n<p>It’s possible to read your emails on the Watch, although it’s a bit of a squint even on the 49mm Ultra screen.</p>\n\n\n\n<p>Getting directions (Walking, Driving, Public Transport, Cycling) is something that a Fitbit Watch could never do. It’s easier on a phone, but it’s possible, if a little fiddly, on the Watch.  </p>\n\n\n\n<p><strong>Switcher tip:</strong> Fitbit users will be bowled over by the scope of third-party apps available on the Apple Watch compared to the new, “streamlined” Fitbit smartwatches. But Watch’s main built-in apps are the most useful, and the best of the rest mainly connect to the iPhone and display the data on your wrist. To be fair, Fitbit never really had much in the way of on-wrist apps but that meager list is not growing.                          </p>\n\n\n\n<h2>Music on Apple Watch</h2>\n\n\n\n<p>Removed from the Versa 4 and Sense 2, Music Control was a handy function that remains on the Versa 3 and original Sense. Double-click the side button and there are shortcuts that include Music Control, which will work with Apple Music, Spotify, Audible, and other audio apps that are on your phone. It meant you could change songs without having to take your phone out of your pocket, which can be a safer solution when phone theft is a risk, and just easier in any case.</p>\n\n\n\n<p>That’s a function now removed from the latest Fitbits, so if phone-free audio control is a handy feature for you, the Apple Watch’s Music app is for you. </p>\n\n\n\n<p>I did find the Watch’s Music app confusing, though. “Now Playing” seems set to a song I maybe played a few weeks ago. But you can activate albums and playlists downloaded to the Watch or select from your iPhone’s list. </p>\n\n\n\n<p>Spotify Premium users can stream music, podcasts and audiobooks from Apple Watch, and also download them to play offline without an internet connection. Free service Spotify customers can use the Watch to control Spotify on other devices.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Forget music control on the older Fitbits, the Apple Watch rules supreme on music, podcasts and audiobooks.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3817561/comprar-apple-watch-se-2022.png\" alt=\"Apple Watch SE 2022\" loading=\"lazy\" /></figure><p>Apple</p></div>\n\n\n\n<h2>Which Apple Watch to switch from Fitbit</h2>\n\n\n\n<p>Fitbit has a wider range of trackers and watches: from the $79 / £49 <strong>Fitbit Ace 3</strong> for kids, the $99 / £84 <strong>Fitbit Inspire 3</strong> tracker, fashion-market $129 / £99 <strong>Fitbit Luxe</strong> tracker, and $159 / £139 <strong>Fitbit Charge 6</strong> super fitness tracker to the smartwatches, $199 / £179 <strong>Fitbit Versa 4</strong> and top-end $249 / £219 <strong>Fitbit Sense 2</strong>.</p>\n\n\n\n<p>It also sells the Fitbit-based <strong>Google Pixel Watch 2</strong> (from $349 / £349) but as that is Android only, we are excluding that from our thoughts.</p>\n\n\n\n<p>Apple sells the entry-level <strong>Apple Watch SE</strong> (from $249 / £219), <strong>Apple Watch Series 9</strong> (from $399 / £399) and top-end Apple Watch Ultra 2 ($799 / £799). </p>\n\n\n\n<p>Fitbit’s non-watch trackers remain great value and very capable fitness trackers and act rather than look like a watch. Indeed, even the entry-level Inspire 3 can show you the time as well as Steps, Distance, and so on, and link with your phone for all the popular messaging notifications and connect to your phone’s GPS.</p>\n\n\n\n<p>The Charge 6 has its own built-in GPS and ECG app. Fitbit smartwatch users not yet ready to switch to Apple Watch might instead change ‘down’ to Fitbit trackers such as the Inspire 3 or Charge 6.</p>\n\n\n\n<p>Fitbit’s recent “streamlining” (let’s call it downgrading) of its smartwatches, effectively removing the third-party apps and handy features such as Music Control, mean that they are most at threat from the Apple Watch as Google is pushing its Versa/Sense users to the Pixel Watch.</p>\n\n\n\n<p>Here, the Apple Watch SE is the main alternative. It is significantly cheaper than the Watch 9 but very similar in features. It’s a little smaller (in 40mm or 44mm cases sizes) than the Watch 8 (41mm or 45mm) and offers about a fifth less viewable screen area due to its larger bezels, lacks the always-on display and omits the blood-oxygen and ECG apps plus temperature sensing. Otherwise, it offers the same experience as the Series 9 for a lot less cash.</p>\n\n\n\n<p>Read our <a href=\"https://www.macworld.com/article/1383536/apple-watch-series-8-se-2-design-performance-features-price.html\" target=\"_blank\">Apple Watch 8 vs SE 2 comparison</a> and <a href=\"https://www.macworld.com/article/671574/best-apple-watch.html\" target=\"_blank\">best Apple Watch</a> feature.</p>\n\n\n\n<p>The Apple Watch SE is equivalent to the Fitbit Versa 4, and the Watch 9 to the Fitbit Sense 2. Remember that we prefer the older but more functional Versa 3 and Sense to the above Fitbit watches and that you can probably find these cheaper. But as you are considering switching from Fitbit, it’s the Apple Watch choice that is more important here.</p>\n\n\n\n<p>If you don’t require detailed blood-oxygen and ECG readings (see Oxygen Saturation and Heart sections above), the SE is a great and more affordable option than the Series 9 or Ultra 2.</p>\n\n\n\n<p>The Watch 9 boasts a newer third-generation optical heart sensor than the Apple Watch SE 2 but still uses the 2nd-gen sensor. The Watch 9’s temperature sensor can help with the menstrual cycle and fertility tracking.</p>\n\n\n\n<p><strong>Switcher tip:</strong> Get your credit card ready. And read our live round-up of the <a href=\"https://www.macworld.com/article/672795/best-apple-watch-deals.html\" target=\"_blank\">best Apple Watch deals</a>.</p>\n\n\n\n<div><div>\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t1.  Apple Watch SE – switch from Fitbit Versa \t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"1920\" height=\"1080\" alt=\"Apple Watch SE – switch from Fitbit Versa \" src=\"https://images.techadvisor.com/cmsdata/reviews/3818083/review-apple-watch-se-2022.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>Pros</p>\n\t\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tLeast expensive Apple Watch\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tBoasts most Watch features\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<p>Cons</p>\n\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tSmaller screen than Apple Watch 8\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tNo ECG or blood-oxygen apps\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tNo always-on function\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t$249 (GPS only)\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://goto.walmart.com/c/321564/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https://www.walmart.com/ip/Apple-Watch-SE-2nd-Gen-GPS-40mm-Midnight-Aluminum-Case-with-Midnight-Sport-Band-S-M/1409379636&amp;subid1=1-1-1787395-6-1062020-9934\" target=\"_blank\">$229 at  Walmart</a><a href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.target.com%2Fp%2Fgoogle-pixel-watch-wifi-black-obsidian%2F-%2FA-87424817%3F&amp;publisher_slug=macworld&amp;exclusive=1&amp;article_name=macworld&amp;article_url=https%3A%2F%2Fwww.macworld.com%2Ffeed&amp;u1=1-1-1787395-6-1062020-9934\" target=\"_blank\">$299.99 at  Target</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/1370015/apple-watch-se-2019-2022-design-specs-features-price.html\" target=\"_blank\">\n\t\t\t\t\t\tApple Watch SE (2nd generation) review \t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div>\n\t\t\t\t\t</div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t2.  Apple Watch Series 9 – switch from Fitbit Sense \t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"2400\" height=\"1350\" alt=\"Apple Watch Series 9 – switch from Fitbit Sense \" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_9.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>Pros</p>\n\t\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tLarger screen option\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tECG and blood-oxygen apps\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tAlways-on screen\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<p>Cons</p>\n\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tExpensive compared to Fitbit and Watch SE\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tFrom $399\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0CHX8SZQS?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$349 at  Amazon</a><a href=\"https://bestbuy.7tiv.net/c/321564/633495/10014?prodsku=6539358&amp;u=https://api.bestbuy.com/click/-/6340268/pdp&amp;intsrc=CATF_4831&amp;subid1=1-1-1787395-6-2064755-9934\" target=\"_blank\">$349 at  Best Buy</a><a href=\"https://goto.walmart.com/c/321564/565706/9383?veh=aff&amp;sourceid=imp_000011112222333344&amp;u=https://www.walmart.com/ip/Apple-Watch-Series-9-GPS-41mm-Starlight-Aluminum-Case-with-Starlight-Sport-Loop/5053502765&amp;subid1=1-1-1787395-6-2064755-9934\" target=\"_blank\">$349 at  Walmart</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/2066958/apple-watch-series-9-vs-series-8-s9-chip-display-storage.html\" target=\"_blank\">\n\t\t\t\t\t\tApple Watch Series 9 review \t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div>\n\t\t\t\t\t</div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\t3.  Apple Watch Ultra 2 – for extreme athletes\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<img width=\"2400\" height=\"1350\" alt=\"Apple Watch Ultra 2 – for extreme athletes\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/Apple-Watch-Ultra-2-Trail-Loop-orange-beige-230912.jpg?quality=50&amp;strip=all\" loading=\"lazy\" />\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>Pros</p>\n\t\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tLargest Apple Watch screen\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tRugged design\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tCustomizable Action Button\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tBetter battery life than SE and Series 9\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<p>Cons</p>\n\t\t\t\t\t\t\t\t<ul>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tExpensive\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t<li> \n\t\t\t\t\tBulky\t\t\t\t\t</li> \n\t\t\t\t\t\t\t\t\t\t\t\t\t</ul> \n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<span>\n\n\t\t\t\t\t\t\t\tPrice When Reviewed:\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t$799 (base)\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0CHX7J5Z3?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$749 at  Amazon</a><a href=\"https://bestbuy.7tiv.net/c/321564/633495/10014?prodsku=6539358&amp;u=https://api.bestbuy.com/click/-/6560074/pdp&amp;intsrc=CATF_4831&amp;subid1=1-1-1787395-6-2064833-9934\" target=\"_blank\">$749 at  Best Buy</a><a href=\"https://shop-links.co/link/?url=https%3A%2F%2Fwww.adorama.com%2Facw2ucoam.html&amp;publisher_slug=macworld&amp;exclusive=1&amp;article_name=macworld&amp;article_url=https%3A%2F%2Fwww.macworld.com%2Ffeed&amp;u1=1-1-1787395-6-2064833-9934\" target=\"_blank\">$799 at  Adorama</a>\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/2087162/apple-watch-ultra-vs-ultra-2-s9-display-double-tap-storage-battery.html\" target=\"_blank\">\n\t\t\t\t\t\tApple Watch Ultra 2 review \t\t\t\t\t</a>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div>\n\t\t\t\t\t</div>\t\t</div>\n\n\t\t</div></div>\n\n\n\n\n\n\n\n\n\n\n\n<h2>Summary</h2>\n\n\n\n<p>It looks like owner Google is pushing away from Fitbit-branded smartwatches in favor of its own Pixel Watch, which includes Fitbit’s health and fitness features.</p>\n\n\n\n<p>Google wants to go head-to-head with Apple in the smartwatch market, and it can’t be fighting on two fronts.</p>\n\n\n\n<p>Sadly, that leaves iPhone-using Fitbit owners out of improvements’ way as the Pixel Watch is Android only.</p>\n\n\n\n<p>There are plenty of me-two activity trackers out there, but Fitbit’s own trackers are far superior—so if you want to stay with Fitbit then maybe an Inspire, Luxe or Charge is your best bet.</p>\n\n\n\n<p>But if iPhone users want smartwatch features, they should consider the Apple Watch over the ever-decreasing Fitbit Versa or Sense series watches.</p>\n\n\n\n<h2>How Apple could win over more Fitbit users</h2>\n\n\n\n<p>The big thing that stopped me for a long time moving from Fitbit to the Apple Watch is the Watch’s feeble battery life. Fixing that would benefit all Watch users so Apple’s should stop shouting about fast charging and start making its devices last longer. </p>\n\n\n\n<p>In the end I bit the bullet and make sure I charge the Watch fully during the day when at my desk.</p>\n\n\n\n<p>While moving motivation from Steps to Apple’s red, green and blue Activity rings is like changing your personal trainer, getting used to all of the Apple Watch’s extra features is like moving to a whole new gym—lots of the same equipment is there, but some of it works in a different way and there’s some exciting new equipment to try out, too.</p>\n\n\n\n<p>Apple could quickly win over a lot of Fitbit users by customizing its Activity rings to include good old-fashioned Steps, or at least make it a core complication on the Apple Watch.</p>\n\n\n\n<p>If Apple could make inviting friends and family more straightforward, give some more personality to its achievement badges, and create some fun challenges, Fitbit users would find making the switch to Apple Watch so much easier.</p>\n\n\n\n<p>These are not complex or difficult things to do. Maybe Apple just doesn’t realise how many new Watch users are just waiting to make the switch from Fitbit.</p>\n\nApple Watch, Health and Beauty, Wearable Fitness Devices, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"736f28cf869ea771030e758d66789ae12eeb6ab975899eaf8539fee33060993e","category":"Apple"}