{"title":"Limited contamination by trace metals in city colonies of the ant Temnothorax nylanderi (Foerster, 1850)","link":"http://link.springer.com/10.1007/s11252-024-01629-8","date":1738368000000,"content":"<h3>Abstract</h3>\n                    <p>In urban environments, trace metals are a widespread class of pollutants that represent a major threat to organisms. Contamination levels in insects differ greatly among habitats, and a basic assumption is that individual contamination depends, at least in part, on environmental contamination. Ants are major actors in ecosystems, but surprisingly little information is available on trace metal contamination of ants in urban environments. Ants could be particularly sensitive to their local environment due to sedentary nesting but their social life could limit contamination. In this study, we assessed whether city colonies of the ant <em>Temnothorax nylanderi</em> (Foerster, 1850) differed from forest colonies in their trace metal contamination, and we tested whether larger colonies tolerate pollution better, then showing a lower level of contamination. We collected ant colonies and soil from five city parks in Paris and five forests around Paris, and we quantified the concentration of five trace metals. We found that despite living in a more contaminated habitat for cadmium, copper and zinc, city colonies were not more contaminated than forest colonies. Lead was the only trace metal more present in the city habitat than the forest habitat, for which city colonies were more contaminated than forest colonies. Interestingly, for lead, contamination decreased when colony size increased, suggesting that living in large groups limits pollutant contamination. Our results suggest that city colonies overcome certain trace metal exposure. We argue that analysing whole colonies is important to take into account social life.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"7379adc0aff29c8f8550d24d0bab48acdc10b7f89446d0e50d0c1e19f7047edb","category":"Environment"}