{"title":"Apple to Settle Trade Secret Lawsuit With SoC Startup Rivos","link":"https://www.macrumors.com/2024/02/09/apple-settles-rivos-lawsuit/","date":1707521387000,"content":"Apple has reached an agreement with Rivos, the SoC company <a href=\"https://www.macrumors.com/2022/05/02/apple-sues-rivos-trade-secret-theft/\">that it sued in 2022</a> for theft of trade secrets, reports <em><a href=\"https://www.bloomberg.com/news/articles/2024-02-09/apple-is-settling-chip-secrets-theft-case-against-startup-rivos\">Bloomberg</a></em>. Rivos will submit to a forensic examination of its systems to remove any confidential Apple information.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/apple-silicon-1-feature.jpg\" width=\"1422\" height=\"800\" />\r<br />\nRivos hired more than 40 employees from Apple, including several former high-ranking engineers, leading Apple to file a lawsuit in May 2022. Apple accused Rivos of poaching employees and stealing chip trade secrets via those employees. Rivos is designing SoCs that would compete with Apple's A-series and M-series chips.\r<br />\n\r<br />\nAccording to Apple, at least two engineers hired by Rivos took \"gigabytes of sensitive SoC specifications and design files\" during their last few days at Apple. The employees used USB drives and AirDrop to transfer sensitive Apple material to their own personal devices, and allegedly stole presentations on unreleased SoCs.\r<br />\n\r<br />\nApple asked for an injunction against the employees that joined Rivos to prevent them from continuing to leak sensitive data, and it sought compensation for the loss caused by trade secret misappropriation and Rivos' \"unjust enrichment\" at Apple's expense. Apple wanted a \"reasonable royalty rate\" from Rivos on future products, and had requested a jury trial.\r<br />\n\r<br />\nRivos and Apple are aiming to finalize their settlement by March 15, and are working through the remediation process.<div>Tag: <a href=\"https://www.macrumors.com/guide/lawsuit/\">Apple Lawsuits</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/09/apple-settles-rivos-lawsuit/\">Apple to Settle Trade Secret Lawsuit With SoC Startup Rivos</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-settle-trade-secret-lawsuit-with-soc-startup-rivos.2419053/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"738498a1beb86e83385e830870880eeb3953defd0fa13366957e6b5fb3fc1703","category":"Apple"}