{"title":"Scientists built a tiny robot to mimic the mantis shrimp’s knock-out punch","link":"https://arstechnica.com/?p=1788373","date":1630361123000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/mantis2CROP-800x559.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/mantis2CROP.jpg\">Enlarge</a> <span>/</span> An interdisciplinary team of roboticists, engineers, and biologists modeled the mechanics of the mantis shrimp’s punch and built a robot that mimics the movement. (credit: Second Bay Studios and Roy Caldwell/Harvard SEAS)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The mantis shrimp boasts one of the most powerful, ultrafast punches in nature—it's on par with the <a href=\"https://www.newscientist.com/article/2182882-mantis-shrimps-punch-with-the-force-of-a-bullet-and-now-we-know-how/\">force generated</a> by a .22 caliber bullet. This makes the creature an attractive object of study for scientists eager to learn more about the relevant biomechanics. Among other uses, it could lead to small robots capable of equally fast, powerful movements. Now, a team of Harvard University researchers has come up with a new biomechanical model for the mantis shrimp's mighty appendage, and it built a tiny robot to mimic that movement, according to <a href=\"https://www.pnas.org/content/118/33/e2026833118\">a recent paper</a> published in the Proceedings of the National Academy of Sciences (PNAS).</p>\n<p>“We are fascinated by so many remarkable behaviors we see in nature, in particular when these behaviors meet or exceed what can be achieved by human-made devices,” <a href=\"https://www.seas.harvard.edu/news/2021/08/robot-mimics-powerful-punch-mantis-shrimp\">said senior author Robert Wood,</a> a roboticist at Harvard University's John A. Paulson School of Engineering and Applied Sciences (SEAS). “The speed and force of mantis shrimp strikes, for example, are a consequence of a complex underlying mechanism. By constructing a robotic model of a mantis shrimp striking appendage, we are able to study these mechanisms in unprecedented detail.”</p>\n<p>Wood's research group made headlines several years ago when it constructed <a href=\"https://en.wikipedia.org/wiki/RoboBee\">RoboBee</a>, a tiny robot capable of partially untethered flight. The ultimate goal of that initiative is to build a swarm of tiny interconnected robots capable of sustained untethered flight—a significant technological challenge, given the insect-sized scale, which changes the various forces at play. In 2019, Wood's group <a href=\"https://www.nature.com/articles/s41586-019-1322-0\">announced its achievement</a> of the lightest insect-scale robot so far to have achieved sustained, untethered flight—an improved version called the RoboBee X-Wing. (Kenny Breuer, writing in Nature, <a href=\"https://www.nature.com/articles/d41586-019-01964-3\">described it</a> as \"a tour de force of system design and engineering.\")</p></div><p><a href=\"https://arstechnica.com/?p=1788373#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788373&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"73865628ab54870c1e0feca2caf022922aa528dd33b33e38c32ac6631cf01487","category":"Tech"}