{"title":"374 Efficacy of phytase and/or chromium tripicolinate supplementation on nutrient digestibility and blood metabolites in grower pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/244/7757116?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Phytase supplementation is widely used in diet formulations to enhance nutrient use efficiency in pigs, while supplemental chromium tripicolinate has been shown to help optimize glucose metabolism by enhancing insulin sensitivity. Therefore, the objectives of this metabolism study were to examine potential synergies of these additives to evaluate if nutrient digestibility and/or blood metabolites could be improved in grower pigs. Grower pigs [n = 6; body weight (BW) = 21.8 ± 0.19 kg; Genesus genetics] were randomly allotted by initial BW to four treatments in a 2 x 2 factorial arrangement of treatments. Treatment (Trt) 1 consisted of a control diet without phytase while Trt 2 had decreased levels of calcium and phosphorus with added phytase (1,500 FYT/kg; HiPhorius; dsm-firmenich, Plainsboro, NJ). Treatment 3 was the control diet without phytase with added chromium from chromium tripicolinate (200 ppb; Chromax, Kent Nutrition Group, Inc., Muscatine, IA) while Trt 4 consisted of the diets with decreased levels of calcium and phosphorus with added HiPhorius (1,500 FYT/kg) and chromium tripicolinate (200 ppb). With six metabolism crates available and four treatment groups, it took a 4-wk duration to allow for each pig to be evaluated on each of the four treatments. The pigs were allowed a 4-d acclimation period followed by a 3-d collection period with the experimental diets fed at 4% BW divided into two meals each day. Water was added at 2.5 times the amount of feed fed each day. A second group of grower pigs (n = 6; BW = 19.6 ± 0.12 kg; Genesus) were utilized following the same procedures as above and pooled with the first group for data analysis. On the last day of the collection period, blood samples were collected before the meal (fasting) and then 2 h after the meal (post-meal). Added phytase resulted in a reduction (<span>P</span> &lt; 0.05) in fasting blood urea nitrogen. Nitrogen digestibility and nitrogen retention were both improved (<span>P</span> &lt; 0.01) with pigs fed supplemental phytase. Furthermore, dry matter digestibility was also improved (<span>P</span> &lt; 0.001) in pigs fed added phytase. Supplemental chromium was without effect on any of the nitrogen and/or dry matter digestibility measurements. These data suggest that supplemental phytase has positive effects by significantly improving nitrogen and dry matter digestibility with no further improvements observed from supplemental chromium.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7397833bb105a11ee11ba38ac6c6b7c02d90aa3ba7b8324970ed6022d98c673a","category":"Environment"}