{"title":"Review: Aqara Camera Hub G2H and Sensors Offer Easy Setup and Fast Response Times in Compact Designs","link":"https://www.macrumors.com/review/review-aqara-camera-hub-g2h-and-sensors/","date":1614960291000,"content":"<a href=\"https://www.aqara.com/en/home.html\">Aqara</a> makes a range of <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>-compatible smart home devices for multiple regions around the world. This review takes a look at six of Aqara's most popular products, including the <a href=\"https://www.macrumors.com/2020/10/09/aqara-g2h-homekit-secure-video-camera/\">Camera Hub G2H</a>, Motion Sensor, Door and Window Sensor, Water Leak Sensor, Vibration Sensor, and Single Switch Module T1.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-main.jpeg\" alt=\"\" width=\"2016\" height=\"1134\" class=\"aligncenter size-full wp-image-787053\" />\r\n<br/>\r\n\r\n<br/>\r\nWith this broad selection of accessories, supported by the Camera Hub G2H, I was able to create a varied <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> setup and put Aqara's devices to the test. While Aqara does have its own app for controlling and setting up the accessories, it is possible to control, automate, and manage them entirely through Apple's Home app.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Designs</h2>\r\n<br/>\r\nAll of the Aqara smart home devices share the same minimalist design language. With the exception of the Water Leak Sensor, they each use a smooth, matte white plastic, almost like the texture of the <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>, with gray accents. The result feels high quality, and there is clear consistency across the family of devices.\r\n<br/>\r\n\r\n<br/>\r\nI was very impressed by each product's design and it is noticeable how compact these devices are compared to many of their &zwnj;HomeKit&zwnj; competitors. This is especially important with smart home devices, where being discreet and fading into the background is vital.\r\n<br/>\r\n\r\n<br/>\r\n<h2>Setup</h2>\r\n<br/>\r\nFor the Camera Hub G2H, users simply need to plug in the included micro-USB cable and <a href=\"https://apps.apple.com/us/app/aqara-home/id1248669703\">download the Aqara app</a> to begin the setup process. The Aqara app recognizes the Camera Hub on the network very quickly and automatically adds it to the Home app with all features, such as <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a>, ready to go. \r\n<br/>\r\n\r\n<br/>\r\nUnlike many other smart home accessories I have used before, the G2H issues voice alerts to inform you about the status of the device, such as when it has been detected, is searching for a network, or has been successfully connected.\r\n<br/>\r\n\r\n<br/>\r\nSetting up each of the other Aqara devices was even simpler. First, you open the Aqara app and select which accessory you would like to add. Then, you pull out the blue battery tab to power on the accessory and hold down the small pairing button. The Camera Hub G2H then issues voice alerts to clearly inform you that the new device has been detected, and a few moments later, added.\r\n<br/>\r\n\r\n<br/>\r\nThe voice alerts from the G2H are very loud and not entirely necessary, but the feature does add some clarity to what is going on in the pairing process at any given time.\r\n<br/>\r\n\r\n<br/>\r\nI would have preferred it if I did not need to use a proprietary app, but overall, Aqara's setup process is one of the easiest I have experienced with &zwnj;HomeKit&zwnj;. Where other accessories I have used have struggled to connect to the network or taken a few minutes to pair, Aqara's process was quick and hassle-free.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Camera Hub G2H</h3>\r\n<br/>\r\nThe <a href=\"https://www.aqara.com/us/g2h_camera_hub.html\">Camera Hub G2H</a> is a 1080p HomeKit-enabled smart camera with a 140-degree wide-angle lens. The camera features <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a>, two-way audio, and night-vision.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-camera-hub-g2h-2.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787060\" />\r\n<br/>\r\n\r\n<br/>\r\nThe base of the G2H rotates and folds out to orient the camera in any preferred direction, and it is also magnetic to attach to walls via a small metal plate included in the box. This plate can be affixed to a surface with an adhesive pad or directly screwed in. I was impressed by the amount of flexibility that the camera's fold-out base afforded, especially compared to some other smart cameras, and it was easy to quickly get it facing in the right direction.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-camera-hub-g2h-stand.jpeg\" alt=\"\" width=\"2016\" height=\"1134\" class=\"aligncenter size-full wp-image-787061\" />\r\n<br/>\r\n\r\n<br/>\r\nThe camera is powered via a standard micro-USB cable. Some other smart home cameras, such as the Logitech Circle 2, use a proprietary power cable, which makes it difficult to get hold of a longer cable if placing the camera further away from a power outlet, so the G2H's use of micro-USB makes it easy to obtain a longer cable if the one included in the box is insufficient for your setup.\r\n<br/>\r\n\r\n<br/>\r\nThe Camera Hub's support for <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a> allows it to encrypt and store footage in <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> rather than on servers handled by Aqara. Recordings can be viewed in Apple's Home app, and all motion and people detection is done on-device for privacy purposes. Using ‌&zwnj;HomeKit Secure Video&zwnj;‌ requires an upgraded ‌&zwnj;iCloud&zwnj;‌ storage plan. Apple's 200GB plan supports one ‌&zwnj;HomeKit Secure Video&zwnj;‌ camera, while the 2TB plan supports up to five cameras.\r\n<br/>\r\n\r\n<br/>\r\nThe G2H also offers a standard night-vision mode and uses a small color-changing LED to indicate the device's status. While it is clear that the camera is not as crisp as some 4K alternatives and the colors were a little washed out, it copes well with different lighting situations and is more than acceptable for monitoring an area of the home. \r\n<br/>\r\n\r\n<br/>\r\nIn addition, the G2H features &zwnj;HomeKit&zwnj; two-way audio, allowing users to hear live audio from the camera and even communicate through its speaker via the Home app. The G2H's microphone apparently performs ambient noise reduction, but this was not especially noticeable to me during daily use. The speaker is very loud for its size and easily projects across a large room, and while it does not deliver the clearest possible sound, its quality is adequate for a brief voice message.\r\n<br/>\r\n\r\n<br/>\r\nWhat makes the G2H different from many other cameras on the market is that it also functions as a Zigbee hub, allowing it to work as a local control center for other devices. This means that users do not need to connect a separate hub to their router to control Aqara's range of devices. As someone that already has a cluttered router with the likes of Philips Hue and Soma Connect Hubs taking up space and ethernet ports, the fact that the G2H doubles as a hub is an excellent idea, and it is good to see smart home accessory manufacturers finding innovative ways to stop relying on router-connected hubs.\r\n<br/>\r\n\r\n<br/>\r\nThe only downside to this solution is if you wish to use other Aqara devices without the camera, you would need to purchase a dedicated <a href=\"https://www.aqara.com/us/smart_home_hub.html\">Aqara hub</a>.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Motion Sensor</h3>\r\n<br/>\r\nThe <a href=\"https://www.aqara.com/us/motion_sensor.html\">Aqara Motion Sensor</a> can detect movement within a range of 22 feet and 170 degrees. You can use the sensor to detect unexpected motion, such as to be alerted to a potential intruder, or simply for home automation to activate lights and other smart home devices.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-motion-sensor-2.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787063\" />\r\n<br/>\r\n\r\n<br/>\r\nThe sensor is incredibly compact and light, making other motion sensors that I have used, such as the Philips Hue Motion Sensor, feel needlessly large and heavy. There is an LED embedded behind the sensor portion of the device to indicate status, but this remains off most of the time to fit in with the discreet design.\r\n<br/>\r\n\r\n<br/>\r\nFurthermore, Aqara's motion sensor includes an optional fully-articulated stand, to allow for precise orientation. This base is adhesive to attach to a wall, and since the whole package is so light, I expect it would easily be strong enough to hold it. The stand makes Aqara's motion sensor much more versatile and easy to set up than many other motion sensors.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Door and Window Sensor</h3>\r\n<br/>\r\nAqara's <a href=\"https://www.aqara.com/us/door_and_window_sensor.html\">Door and Window Sensor</a> can detect whether a door or window is open or closed. The sensor can be used to alert users with a notification from the Home app when a door or window is opened unexpectedly, and the sensor can also activate &zwnj;HomeKit&zwnj; scenes, such as turning on lights when a door is opened. You can use <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> to ask if a door or window is open, or simply check the Home app.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-door-and-window-sensor.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787062\" />\r\n<br/>\r\n\r\n<br/>\r\nThe Aqara Door and Window Sensor works with most types of doors, windows, and other fixtures with similar mechanisms, such as drawers, cabinets, and more, allowing for a gap of up to 22mm between the two parts.\r\n<br/>\r\n\r\n<br/>\r\nI was struck by how small the sensor was, especially compared to the Elgato Door and Window Sensor, which is considerably thicker and bulkier. During daily use, the sensor was extremely responsive and updated the status in the Home app with virtually no delay.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Water Leak Sensor</h3>\r\n<br/>\r\nWhenever the <a href=\"https://www.aqara.com/us/water_leak_sensor.html\">Aqara Water Leak Sensor</a> detects water, it sends a notification via the Home app to your devices to alert you to leaks and potential flooding. While the main purpose of such a sensor is these alert notifications, it is also possible to set it to trigger &zwnj;HomeKit&zwnj; scenes.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-water-leak-sensor.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787066\" />\r\n<br/>\r\n\r\n<br/>\r\nNo wiring or screws are required to set up the sensor. You simply need to place it on a flat surface where you suspect dripping, leaking, or flooding could occur. The underside of the sensor has two sensitive leak probes which are able to detect up to 0.5mm of water, which is more than enough to be aware of an emergency leak.\r\n<br/>\r\n\r\n<br/>\r\nThe sensor has a durable IP67 water and rust-proof housing, and has a glossy plastic exterior for better water resistance.\r\n<br/>\r\n\r\n<br/>\r\nTo test the water sensor I tried tipping small amount of water under the device, and it immediately issued an alert notification to my devices via the Home app. After drying the sensor off on a towel, it was able to sense water again immediately.\r\n<br/>\r\n\r\n<br/>\r\nThough the speed of the water detection was impressive and I was pleased that very little water was needed to initiate a detection, I was frustrated by the button on the sensor. The other Aqara devices have a small round button on their exterior for pairing, but due to the need for water resistance, the pairing button on the Water Leak Sensor is hidden under the top of the shell. Not only was it initially unclear where the button actually was, but it was also very difficult to press in due to the thickness of the shell. While it is true that users will very rarely have to press the button, I was disappointed that it was unclear where the button was, even after looking at the instruction manual, and that it required such a large amount of pressure to depress.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Vibration Sensor</h3>\r\n<br/>\r\nWhenever the <a href=\"https://www.aqara.com/us/vibration_sensor.html\">Aqara Vibration Sensor</a> detects unexpected vibration, it will send an alert to your devices, much like the Water Leak Sensor. It can detect tilts, drops, jolts, and vibrations.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-vibration-sensor-2.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787065\" />\r\n<br/>\r\n\r\n<br/>\r\nThe Vibration Sensor is extremely versatile. For example, you could adhere the sensor to a drawer or object to be alerted when it used, or even attach it to a window to alert to breakages as a security measure. Again, while the main purpose is alert notifications, you could easily integrate the Vibration Sensor into a &zwnj;HomeKit&zwnj; automation.\r\n<br/>\r\n\r\n<br/>\r\nWhile the sensor seems to be sensitive enough to be useful, it does seem to take up to around ten seconds to reset, and I noticed that it is not quite as responsive as the other Aqara devices. Nevertheless, I was confident that the sensor could provide an alert notification when needed, but it simply lacked the seemingly instantaneous response of the other Aqara devices.\r\n<br/>\r\n\r\n<br/>\r\n<h3>Single Switch Module T1</h3>\r\n<br/>\r\nThe <a href=\"https://www.aqara.com/en/single_switch_T1_no-neutral.html\">Single Switch Module T1</a> is installed behind a wall switch and can be used to make ceiling fans, power outlets, light switches, and more part of your smart home setup.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/aqara-review-t1-switch-no-neutral.jpeg\" alt=\"\" width=\"4032\" height=\"2268\" class=\"aligncenter size-full wp-image-787064\" />\r\n<br/>\r\n\r\n<br/>\r\nThe Single Switch Module was smaller than expected, but quite heavy for its size, and I am unsure how comfortable I am with this much weight tugging on the wires behind my switches.\r\n<br/>\r\n\r\n<br/>\r\nDespite being installed behind a switch, the T1 works in a very similar way to the other Aqara accessories and pairs the same way, by holding down a small button on the device. The main difference is that you can specify what exactly is being activated by the T1 in the Home app.\r\n<br/>\r\n\r\n<br/>\r\nMy main takeaway from using the T1 is that the instructions included in the box could have been much better. It was not clear to me how the module should be installed, which is essential when it comes to rewiring a switch. As a result, I would not encourage anyone to undertake installation without significant confidence.\r\n<br/>\r\n\r\n<br/>\r\n<h2>HomeKit Support</h2>\r\n<br/>\r\nThe Aqara app's ability to add accessories automatically to the Home app, combined with the company's embrace of &zwnj;HomeKit&zwnj; features such as Secure Video or two-way audio, makes for &zwnj;HomeKit&zwnj; support that is generally as good as it gets.\r\n<br/>\r\n\r\n<br/>\r\nI did not receive any \"no response\" indicators from any of the accessories in my time using them, and they seemed to be consistently connected to my network.\r\n<br/>\r\n\r\n<br/>\r\nWhen using the Home app to control the accessories, they were just as responsive as in Aqara's own app. The same cannot be said for some other smart home providers such as Philips Hue, where there is a clear advantage to using the company's own app. With the exception of the Vibration Sensor, which stuck out as distinctively less responsive and sensitive than the others, I was struck by just how responsive the devices were in general. Any changes in status detected by an accessory were updated in the Home app almost immediately.\r\n<br/>\r\n\r\n<br/>\r\nThis is key for devices such as a Motion Sensor, where you would want lights to come on immediately in response, for example. It also has the added effect of instilling more confidence in the devices themselves to do their job in the background.\r\n<br/>\r\n\r\n<br/>\r\n<h2>The Bottom Line</h2>\r\n<br/>\r\nThe Aqara accessories set a high standard in terms of design, ease-of-use, reliability, and responsiveness that some other brands could learn a lot from. I like Aqara's compact, aesthetic designs, the pairing process was easy, and Apple &zwnj;HomeKit&zwnj; was well-integrated. Above all, Aqara's devices worked exactly as they should.\r\n<br/>\r\n\r\n<br/>\r\nWith competitive price points, Aqara's selection of &zwnj;HomeKit&zwnj; accessories make for a very compelling package within any smart home setup. \r\n<br/>\r\n\r\n<br/>\r\n<h2>How to Buy</h2>\r\n<br/>\r\nAqara's full range of &zwnj;HomeKit&zwnj; accessories is available in the U.S. via <a href=\"https://www.amazon.com/stores/Aqara/page/C2BFB250-C977-49DB-99B1-C8392CDC7B7C?ref_=ast_bln\">Amazon</a>.\r\n<br/>\r\n\r\n<br/>\r\n<ul>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/Aqara-Security-Family-Friendly-Wireless-Surveillance/dp/B08F2DBP3Y?ref_=ast_sto_dp\">Camera Hub G2H</a> - &#36;69.99 (currently with a 20 percent discount, along with an additional five percent off with the code: AQARAG2H until March 7)</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/Aqara-RTCGQ11LM-Motion-Sensor-White/dp/B07D1CRRVF?ref_=ast_sto_dp\">Motion Sensor</a> - &#36;20.19</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/Aqara-MCCGQ11LM-Window-Sensor-White/dp/B07D37VDM3?ref_=ast_sto_dp\">Door and Window Sensor</a> - &#36;17.99 (currently out of stock but expected to return soon)</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/Aqara-11LM-SJCGQ-Water-Sensor/dp/B07D39MSZS?ref_=ast_sto_dp\">Water Leak Sensor</a> - &#36;18.99</li>\r\n<br/>\r\n<li><a href=\"https://www.amazon.com/Aqara-Vibration-Sensor-Automation-Compatible/dp/B07PJT939B?ref_=ast_sto_dp\">Vibration Sensor</a> - &#36;19.19</li>\r\n<br/>\r\n</ul>\r\n<br/>\r\n\r\n<br/>\r\nThe Single Switch Module T1 is unavailable in the United States as it is designed for the UK and EU market. For customers in these regions, Aqara's devices are available through <a href=\"https://www.aqara.com/us/where-to-buy.html\">third-party distributors</a>.\r\n<br/>\r\n\r\n<br/>\r\n<em><small>Note: Aqara provided <em>MacRumors</em> with a Camera Hub G2H, Motion Sensor, Door and Window Sensor, Water Leak Sensor, Vibration Sensor, and Single Switch Module T1 for the purpose of this review. No other compensation was received.</small></em><div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a>, <a href=\"https://www.macrumors.com/guide/aqara/\">Aqara</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/review/review-aqara-camera-hub-g2h-and-sensors/\">Review: Aqara Camera Hub G2H and Sensors Offer Easy Setup and Fast Response Times in Compact Designs</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/review-aqara-camera-hub-g2h-and-sensors-offer-easy-setup-and-fast-response-times-in-compact-designs.2287199/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=52wmSdZXrPs:Joo8teXhg08:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=52wmSdZXrPs:Joo8teXhg08:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/52wmSdZXrPs\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"73a83a99785a466b32e1808754da4cffa621b5c64c702bc41d1dd438b89a5891","category":"Apple"}