{"title":"Some major apps won’t be available on Vision Pro","link":"https://www.macworld.com/article/2212139/major-apps-wont-be-available-vision-pro.html","date":1705670098000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As a wise man once <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=XxbJw8PrIkc&amp;xcust=1-1-2212139-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">shrieked</a>, “Developers, developers, developers.” A platform lives and dies according to the quality of its third-party software ecosystem. With this in mind, things are looking grim for Vision Pro, Apple’s imminently launching mixed-reality headset, after it this week emerged that several of the biggest apps for iPhone, Mac, and other Apple devices will <em>not</em> be available for visionOS, at least initially.</p>\n\n\n\n<p>YouTube, according to a report Thursday by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2024-01-18/youtube-and-spotify-join-netflix-in-not-launching-apple-vision-pro-apps&amp;xcust=1-1-2212139-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Bloomberg</a>, will not be building a native app for Vision Pro. Nor will the iPad app run on the headset. Instead, a spokesperson said, YouTube users will be encouraged to use the service through a browser.</p>\n\n\n\n<p>Nor does Spotify currently plan to create a visionOS app, or expect its iPad app to run on Apple’s headset. Here too the browser will be your friend… probably. “The music service will still likely work from a web browser,” Bloomberg reports, somewhat less than reassuringly. Of course, Apple would prefer everyone to use its own Apple Music streaming service, but Spotify remains a considerably <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.insidermonkey.com/blog/5-most-popular-music-streaming-services-1175165/&amp;xcust=1-1-2212139-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">more popular offering</a> and this seems like a big gap. Spotify famously isn’t available as a default option for HomePod, but it’s a hugely successful app on the iPhone, currently ranking number one in the music category.</p>\n\n\n\n<p>The third big name that will be missing from Vision Pro’s library when it launches at the start of February is Netflix, in what <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2024-01-17/watching-netflix-on-apple-vision-pro-you-ll-have-to-use-the-web&amp;xcust=1-1-2212139-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Bloomberg</a> Wednesday described as “a high-profile snub of the new technology by the world’s biggest video subscription service.” Yet again, the existing iPad app won’t work, nor will there be a new native app for the visionOS platform, so you’ll have to watch Netflix content through the browser, or not at all.</p>\n\n\n\n<p>Apple mostly has a good relationship with developers, despite its occasionally <a href=\"https://www.macworld.com/article/1788560/sherlocking-valencell-apple-watch-patents-developers.html\">controversial</a> <a href=\"https://www.macworld.com/article/678103/different-think-the-shabby-greed-of-apples-app-adverts.html\">treatment</a> of them, and the iOS App Store is one of the great business success stories of our time. However, not all of its platforms have proved popular for third-party software. Many big names, for example, have declined to make apps for the Apple Watch and Instagram still famously doesn’t have a native iPad app.</p>\n\n\n\n<p>A shortage of compelling third-party apps doesn’t appear to have significantly held back the Apple Watch, which gets by thanks to its excellent first-party health and fitness offerings. But the Apple Watch, in computing terms, is a peripheral, serving as a specialist backup to a more versatile device: the iPhone. By contrast, Apple’s hope is that the Vision platform will eventually replace iOS as the central hub for users’ computing lives, and in that context, it is essential for developers to get on board.</p>\n\n\n\n<p>Perhaps, in time, they will. But for now, some heavy hitters are taking the approach of sitting back and seeing if Vision Pro is a success. And without those apps in its corner, the chances of it being a success just got a bit lower.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"73d53585bb2f402d763aa899baf7575dead391480d1ba3f435a2c3e62f9e326a","category":"Apple"}