{"title":"Buffered Lugol's Iodine Preserves DNA Fragment Lengths","link":"https://academic.oup.com/iob/article/doi/10.1093/iob/obae017/7683270?rss=1","date":1718323200000,"content":"<span><div>Synopsis</div>Museum collections play a pivotal role in the advancement of biological science by preserving phenotypic and genotypic history and variation. Recently, contrast-enhanced X-ray computed tomography (CT) has aided these advances by allowing improved visualization of internal soft tissues. However, vouchered specimens could be at risk if staining techniques are destructive. For instance, the pH of unbuffered Lugol's iodine (I<sub>2</sub>KI) may be low enough to damage deoxyribonucleic acid (DNA). The extent of this risk is unknown due to a lack of rigorous evaluation of DNA quality between control and experimental samples. Here, we used formalin-fixed mice to document DNA concentrations and fragment lengths in nonstained, ethanol-preserved controls and 3 iodine-based staining preparations: (1) 1.25% weight-by-volume (wt/vol.) alcoholic iodine (I<sub>2</sub>E); (2) 3.75% wt/vol. I<sub>2</sub>KI; and (3) 3.75% wt/vol. buffered I<sub>2</sub>KI. We tested a null hypothesis of no significant difference in DNA concentrations and fragment lengths between control and treatment samples. We found that DNA concentration decreases because of staining—potentially an effect of measuring intact double-stranded DNA only. Fragment lengths, however, were significantly higher for buffered I<sub>2</sub>KI and control samples, which were not, themselves, significantly different. Our results implicate buffered I<sub>2</sub>KI as the appropriate choice for contrast-enhanced CT imaging of museum wet collections to safely maximize their potential for understanding genetic and phenotypic diversity.</span>","author":"","siteTitle":"Integrative Organismal Biology Current Issue","siteHash":"ad96bcf7a80ab7e3a1a88c34298d761f9695964c0badbbef4e1166baa6580fcc","entryHash":"73d878b6feb6eaf3d85c3fa0b7aedfec2bdeb77beb1713c56b0ba6ceb8a26bdf","category":"Environment"}