{"title":"‘Road bike’ category launched for UK time-trials for increased accessibility and fairer rankings","link":"https://www.cyclist.co.uk/news/road-bike-time-trials","date":1681827040000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/news/road-bike-time-trials\">‘Road bike’ category launched for UK time-trials for increased accessibility and fairer rankings</a></p>\n\n<p>The UK’s national governing body for time-trials, <a href=\"https://www.cyclingtimetrials.org.uk/\" target=\"_blank\">Cycling Time Trials</a> (CTT), has introduced a new road bike category for its events, to make time-trialling fairer and more accessible to people who don’t have a time-trial bike.</p>\n\n\n\n<p>From today, riders who race a road bike with drop handlebars and spoked wheels can enter any event in the CTT calendar and get road bike-specific results, so will no longer have to enter a ‘road bikes only’ event. </p>\n\n\n\n<p>This means riders without a time-trial bike won’t be competing against those kitted out with a super-aero TT frame with tri-bars and a rear disc wheel, in what CTT describes as making ‘time-trialling available to everybody.’ CTT’s <a href=\"https://www.spindata.co.uk/\" target=\"_blank\">Spindata</a> rankings system currently doesn’t acknowledge the type of bike ridden but will now separate road bike results from those set on TT bikes and publish distinct road bike rankings.  </p>\n\n\n\n<p>A rider will need to complete just three road bike rides to be included in Spindata’s road bike rankings. </p>\n\n\n\n<p>Andrea Parish, CTT Chair, said; ‘Having a separate road bike competition and rankings system is very much part of the process of taking time-trialling back to the “every person’s sport” that it once was – and to where it needs to be for the future. In a rider survey last year, the message came back very strongly that people wanted to ride road bikes and they wanted a separate competition.  </p>\n\n\n\n<p>‘If you have a road bike, even if it cost £150 off eBay, you can enter an open event. The whole thing is about giving people an opportunity. You’ve got a road bike, so time-trial.’ </p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/news/filament-track-bike\">Could this foam-filled £7,250 track bike rival the Team GB Hope HB.T?</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/la-fleche-wallonne-preview\">La Flèche Wallonne: Routes, how to watch, teams and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/what-is-a-road-bike\">What is a road bike? Every part explained in simple terms</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>From today:</p>\n\n\n\n<ul><li>All CTT time trial events will recognise road bikes as a distinct category of racing, with results presented on the CTT website filterable to show the road bike results within each event. Team time trial results can be filtered to show teams where riders were all competing on road bikes. </li><li>Riders will be able to indicate which category (road bike or TT bike) they are entering and can amend that up to the closing date. </li><li>If a rider decides to change which type of bike they will be riding after the closing date, they can do so and the organiser can amend their details. </li><li>Rider profiles will be updated with personal bests separated into TT bike and road bike categories. </li><li>Riders can set a default of road bike or TT bike on their profile to streamline their entries. </li><li>Spindata will be updated to recognise road bike results distinct from time trial bike results, and award points accordingly. There will be separate rankings published on Spindata for road bikes. </li><li><a href=\"https://resultsheet.co.uk/\" target=\"_blank\">ResultSheet</a> will recognise the new road bike category. </li><li>It will no longer be necessary for organisers to list separate road bike only events to support a road bike category in their events, but there will be no change to the event listings for the 2023 season. </li></ul>\n<p>The post <a href=\"https://www.cyclist.co.uk/news/road-bike-time-trials\">‘Road bike’ category launched for UK time-trials for increased accessibility and fairer rankings</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"73d9db568b154d9e155aa6553b9465ded94d3369bfa3078519ece341bef47246","category":"Cycling"}