{"title":"A modified supraorbital surgical approach for enucleation- exenteration in dromedary camels (camelus dromedarius): Clinical study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306710","date":1724940000000,"content":"<p>by Mohamed Marzok, Mohamed A. Nazih, Adel I. Almubarak, Thnaian A . Al-thnaian, Khalid M. Alkhodair, Mohamed Tharwat, Mohamed W. El-Sherif</p>\r\n\r\nEnucleation and exenteration are widely utilized ophthalmic procedures in veterinary field. Enucleation in camels is like other large animals, typically performed under the influence of heavy sedation and loco-regional analgesia. The aim of the current study was to introduce a new surgical approach to enucleate the eye of camels through supraorbital fossa approach. for that purpose, the technique was applied to seven camels referred to the King-fisal teaching veterinary hospital for unilateral enucleation. Assessment of applicability, safety and feasibility of this technique was done. All procedures were performed in the kush (sitting) position under the influence of heavy sedation with Xylazine HCl in combination with retrobulbar nerve block. A \"C\" shaped skin incision was made in the skin and fascia of the supraorbital fossa to enter the orbital cavity, after which the periorbital fat was gripped, dissected and removed. Bleeding controlled by electrocautery and visible large blood vessels were ligated. After ligation the optic nerve and ophthalmic blood vessels, the eyeball was dissected sharply and freed from the orbital bony attachment. Finally, the orbital fascia and skin were sutured with simple interrupted pattern separately. The approach proved successful in all camels, with the enucleation procedure being both feasible and easily performed. The mean surgical time was approximately 46.6±12.4 minutes. The minimal occurrence of short and long-term complications was encouraging, and the cosmetic outcomes were notably improved. The supraorbital approach is a safe and effective technique for camel ophthalmic surgery, showing advantages in exposure and minimal complications. Further research is needed for validation and broader clinical applications.","author":"Mohamed Marzok","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"73def4a8487b90e45acefd36a672729c2e6171347ec172429576d765d3f66d37","category":"Interdisciplinary"}