{"title":"CircVCAN promotes glioma progression through the miR‐488‐3p/MEF2C‐JAGGED1 axis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24328?af=R","date":1723027049000,"content":"<h2>Abstract</h2>\n<p>Gliomas are the most prevalent primary malignant brain tumors worldwide. Growing evidences indicate that circular RNAs (circRNAs) play an important role in the regulation of biological behavior of tumors. We aimed to investigate the role and mechanism of circVCAN in glioma. RNase R treatment was utilized to assess the cyclic properties of circVCAN. CircVCAN, miR-488-3p, and myocyte enhancer factor 2C (MEF2C) levels in glioma tissues and cells were detected by reverse transcription real-time polymerase chain reaction (RT-qPCR), and the localization of them in glioma cells was determined with fluorescence in situ hybridization. Furthermore, a variety of biologically functional assessments were used to validate the role of circVCAN in glioma. The regulatory mechanisms of circVCAN, miR-488-3p, and MEF2C were further confirmed by double luciferase reporter gene assay, RNA immunoprecipitation and RNA pull-down assay, and the binding of MEF2C to JAGGED1 was revealed by chromatin immunoprecipitation. Additionally, a xenograft tumor model was constructed to demonstrate the effect of circVCAN on tumor growth in vivo. Our results indicated that circVCAN was more stable than its linear RNA and was significantly upregulated in gliomas. CircVCAN overexpression stimulated glioma cells to proliferate and metastasize, but circVCAN silencing exerted the opposite effect. Meanwhile, silencing circVCAN inhibited tumor growth in vivo. Moreover, we found that circVCAN interacted with miR-488-3p to regulate MEF2C expression, and miR-488-3p inhibition or MEF2C overexpression reversed the inhibitory effect on malignant bio-behaviors mediated by circVCAN knockdown in glioma cells. MEF2C promoted the transcription of JAGGED1, and circVCAN knockdown reduced the binding between MEF2C and JAGGED1. Collectively, circVCAN is a carcinogenic circRNA in glioma, and the circVCAN/miR-488-3p/MEF2C-JAGGED1 axis could serve as a potential target for the management of glioma.</p>","author":"Shude Yang, \nShuo Gao, \nZhiqiang Dong","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"73df96a9b5596ad000ac60cb9f87de2d3d300f34f85feaa9e892a7739c654043","category":"Environment"}