{"title":"iPad Pro OLED Display Production Reportedly to Begin Around February","link":"https://www.macrumors.com/2023/11/08/ipad-pro-oled-display-production-february-report/","date":1699481908000,"content":"LG and Samsung plan to begin mass production of OLED display panels for the next-generation iPad Pro models around February 2024, according to a report today from <a href=\"https://biz.chosun.com/it-science/ict/2023/11/08/ARI7VWL4TZDMZKCRI2NZ2AKS3Y/\">South Korea's <em>Chosun Ilbo</em></a>. The news was highlighted by the <a href=\"https://www.oled-info.com/chosun-lgd-and-sdc-will-produce-10-million-amoled-displays-apples-ipads-next\">website <em>OLED-Info</em></a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/iPad-Pro-OLED-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n<em>Bloomberg</em>'s Mark Gurman expects new 11-inch and 13-inch iPad Pro models with <a href=\"https://www.macrumors.com/2023/09/03/gurman-new-ipad-magic-keyboard-to-feature-aluminum/\">OLED displays, an M3 chip, and an aluminum Magic Keyboard</a> to launch next year. With mass production of the OLED displays reportedly not beginning until February, it seems unlikely that the next iPad Pro models would be ready to launch in March, a common month for Apple to announce new products. It seems more likely that the next iPad Pro models would be announced at WWDC in June or later, but Apple's plans could still change.\r<br />\n\r<br />\nThe current iPad Pro models are equipped with LCD panels, and the 12.9-inch model also features mini-LED backlighting for increased brightness and a higher contrast ratio. OLED technology would eliminate the need for backlighting, with benefits including even higher contrast ratio with deeper blacks, lower power consumption, and more. Apple is expected to use <a href=\"https://www.macrumors.com/2023/04/17/ipad-pro-2024-oled-hybrid-tech/\">very thin hybrid OLED displays</a> with a combination of flexible and rigid materials, which could allow for the next iPad Pro models to be slightly thinner.\r<br />\n\r<br />\nThere have been rumors about the iPad Pro adopting OLED technology for several years, and it seems that it will finally happen next year. The next iPad Air, iPad mini, and entry-level iPad are all expected to stick with LCD panels.\r<br />\n\r<br />\nApple last updated the iPad Pro line in October 2022, with key new features at the time including the M2 chip, Wi-Fi 6E and Bluetooth 5.3 support, hover functionality for the second-generation Apple Pencil, and support for ProRes video recording.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/oled-ipad-pro/\">OLED iPad Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#11-iPad-Pro\">11\" iPad Pro (Caution)</a>, <a href=\"https://buyersguide.macrumors.com/#12-9-iPad-Pro\">12.9\" iPad Pro (Caution)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ipad.137\">iPad</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/08/ipad-pro-oled-display-production-february-report/\">iPad Pro OLED Display Production Reportedly to Begin Around February</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ipad-pro-oled-display-production-reportedly-to-begin-around-february.2410359/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"73e945aa870539a9e6f4fa243b0c297fcd18e4aff0e0af2ca28ec05d5aef1a4c","category":"Apple"}