{"title":"Bike frame materials explained: carbon vs aluminium vs steel vs titanium","link":"https://www.bikeradar.com/advice/buyers-guides/bike-frame-materials/","date":1636383600000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Bike-frame-materials-compared-cd48a54-19271ce.jpg?quality=90&amp;resize=620,413\" />                                            <p>Choosing what material you want your frame to be made from is one of the key decisions to make when buying a bike.</p>\n<p>Bike frames have been made from a variety of different materials over the years, with steel originally dominating. Now the major choice is between aluminium and carbon fibre, although steel and titanium still feature commonly.</p>\n<p>Each frame material has its pros and cons, depending on your priorities as a rider, including weight, budget, longevity and the performance characteristics you want from the frame and, as a result, the bike.</p>\n<p>What are the key properties of aluminium, steel, titanium and carbon fibre to consider when it comes to buying a bike?</p>\n<p>We spoke to two experts to find out: Richard Lambert from UK titanium and steel bike specialists Enigma, and Liam Glen, a mechanical engineer who currently works for Airbus, as well as being a former professional cyclist and the winner of the 2021 Highland Trail 550 bikepacking race (we’ve got a <a href=\"https://www.bikeradar.com/features/pro-bike/2021-highland-trail-550-bikes/\">gallery of Liam’s singlespeed Stooge Cycles Scrambler</a>).</p>\n<h2>Aluminium frames</h2>\n<p>Aluminium is the go-to metal for budget to mid-range frames, providing a combination of low weight, stiffness and affordability that’s hard to beat.</p>\n<h3>Alloy or aluminium?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Aluminium frames are often referred to as “alloy”, although all metals used for bike frames are technically alloys.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>You’ll often see aluminium frames referred to as “alloy”. That’s because pure aluminium would be much too soft to form into a bike frame, so it’s mixed with other elements to alter its physical properties.</p>\n<p>In fact, all metal bike frames are made of alloys for the same reason. Steel is itself an alloy of iron, and titanium is predominantly alloyed with aluminium and vanadium.</p>\n<p>When it comes to aluminium frames, numbers such as 6061 and 7005 – the two most common aluminium alloys used – are a code for the additives (chiefly silicon and magnesium) that are mixed with the aluminium to form each alloy. Every ‘recipe’ has slightly different properties.</p>\n<h3>How is an aluminium bike frame made?</h3>\n<p>“All metals have quite similar strength-to-weight ratios,” Glen says. “It’s factors like the width of tubing and its wall thickness that are more important than their strength.”</p>\n<p>It’s relatively easy to manipulate aluminium tubing to give it different properties along its length and aluminium tubes are usually butted, to ensure stiffness where it’s needed, and save weight where it’s not.</p>\n<hr /><h4>What is tube butting?</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Butting helps to save weight where it’s not needed, and improve strength and stiffness where it is.</span></figcaption><span> <i>Ribble Cycles</i></span></div>\n<p>Bike tubing, whatever it’s made of, is usually butted. This means it’s thicker at its ends, where there’s more stress and you need more material for the joints to other tubes, while it’s thinner in the middle to save weight.</p>\n<p>Straight gauge tubes are consistent throughout in their thickness, with consistent properties to match. Single-butted tubes are thicker at one end (for example, at the bottom bracket junction), double-butted tubes are thicker at both ends and triple-butted tubes further reduce the thickness in the middle of the tube.</p>\n<hr /><p>Butting is only part of the story and you’ll often see premium alloy frames described as “hydroformed”, which describes the process of adapting the shape of a tube using high-pressure fluid and a mould.</p>\n<p>High-end aluminium bikes are more advanced than ever and this process can help form complex shapes to influence the characteristics of a particular part of a frame, including weight, strength and comfort. Many of the latest aluminium frames also sport aerodynamic design features.</p>\n<p>Aluminium tubing is usually welded together to make the frame. A raw weld can be quite bumpy in appearance, but this is often smoothed down after welding for a cleaner look on premium frames. It also helps save a little weight. Once an aluminium frame has been welded, it will be heat treated to return the alloy to its full strength.</p>\n<p>“You’re applying a lot of heat to a localised area [when welding], which can change the metal’s properties locally and make the welds the weakest area,” says Glen. Tempering after welding helps to alleviate this.</p>\n<h3>What are the properties of an aluminium frame?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The latest aluminium road bikes can produce a ride to match their carbon fibre counterparts.</span></figcaption><span> <i>Steve Sayers / Immediate Media</i></span></div>\n<p>Aluminium is the material used for the majority of cheaper bike frames but it’s still a popular choice for some pricier, performance-focused frames, both on the road and, in particular, for mountain bikes.</p>\n<p>While the exact properties of an aluminium alloy frame will vary from one bike to the next, typically it’s relatively lightweight with a high level of stiffness, robust and around a fifth of the price of carbon fibre.</p>\n<p>An alloy frame can actually be lighter than a carbon fibre one at a similar price, although expensive carbon frames will always be lighter still.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Aluminium is well-suited to the rough and tumble of mountain biking.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>Aluminium is much less dense than steel.</p>\n<p>As a result, an aluminium frame can be made with oversized tubing to achieve a high level of stiffness, with thicker walls, while still being lighter. According to Ribble, the tube wall thickness of an aluminium alloy frame will commonly be twice that of steel, with tube diameters in the region of 20-30% larger.</p>\n<p>Aluminium frames historically had a reputation for being uncomfortable, due to the relative stiffness of the material and lack of shock absorption, but the latest frame building techniques, as well the trend towards wider tyres on road bikes, mean many alloy bikes offer a much-improved ride quality.</p>\n<p>While aluminium frames offer an impressive balance of strength, stiffness and low weight, aluminium alloys can be prone to long-term fatigue, unlike steel and titanium.</p>\n<p>However, aluminium frames tend to be less susceptible to crash or accidental damage than carbon frames. As a result, aluminium remains a popular frame material on all mountain bikes, as well as being a smart option for privateer road racers on a budget.</p>\n<h4>Pros of an aluminium bike frame</h4>\n<ul><li>Stiffness-to-weight ratio</li>\n<li>Affordability</li>\n<li>More durable than carbon</li>\n</ul><h4>Cons of an aluminium bike frame</h4>\n<ul><li>Stiffness can result in a harsh ride quality</li>\n<li>Aluminium fatigues over time</li>\n<li>Difficult to repair</li>\n</ul><h2>Steel frames</h2>\n<p>“Steel is real”, as the old adage goes, and was the material traditionally used for bike frames.</p>\n<p>In fact, steel was the staple of frame building for around 100 years, even at pro level, right up until the mid-1990s, when aluminium alloy frames started to take over – with only a brief spell in the pro road peloton – and the first carbon fibre frames were tried out.</p>\n<h3>Lugged or welded?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Colnago, the masters of lugged frames.</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>There are two main construction methods for steel frames, either using lugs or not.</p>\n<p>Lugged frames see the tubes slotted into cast steel lugs at their joints then brazed together. Frames without lugs feature tube junctions that are welded together or fillet brazed.</p>\n<p>Lugged construction used to be common, with classic steel frames often having very elaborately fretted lugs, but welding tends to result in a lighter frame and there’s less clean-up needed than with brazing, which typically results in excess material at the joints that needs to be removed afterwards.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Steel was the go-to option for bicycle frames for more than 100 years.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>On the other hand, according to Glen, brazing needs a lower temperature than welding, so there’s likely to be less alteration of the steel’s properties, leading to a stronger joint.</p>\n<p>Like the tubes in aluminium alloy frames, steel tubes are typically butted to make them lighter. There’s more variety in tube shapes in modern steel frames, rather than the round sections of old.</p>\n<h3>Wide variety of steels</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Reynolds has been producing steel tubing since 1898.</span></figcaption><span> <i>David Caudery/Immediate Media</i></span></div>\n<p>Most performance-minded steel bikes are made from chromoly steel, with high-tensile steel seen on cheap, low-end frames.</p>\n<p>Different compositions of steel have different properties. Reynolds 531 is a classic alloy used for bike frames, with the 531 referring to the proportion of manganese, carbon and molybdenum in the alloy.</p>\n<p>There are plenty more options now, though, from tubeset providers including Dedacciai and Columbus.</p>\n<p>Lambert points to the wide variety of different tube compositions and profiles available for steel, which he says is not the same for other frame tubing. That means you can build up a very sturdy frame for touring or one that’s lighter in weight, depending on what’s chosen.</p>\n<p>Stainless steels are also an option. On average, they’re weaker than chromoly steels, although specialist stainless steels have been developed for bike making that are as strong as, or stronger than, chromoly, says Glen.</p>\n<h3>What are the properties of a steel frame?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> While aluminium and carbon are now more popular, steel afficiandos still swear by the original frame material.</span></figcaption><span> <i>Andy Lloyd / Immediate Media</i></span></div>\n<p>The main downsides of steel are its weight and cost. It’s heavier than aluminium and more expensive to manufacture on a mass scale, ensuring aluminium remains the preferred option for most of today’s metal bike frames.</p>\n<p>However, while steel is much denser (and heavier) than aluminium, it’s stronger and more durable, too. This means frame builders can use smaller-diameter, thinner-walled tubes and maintain the required level of stiffness, though the weight penalty remains.</p>\n<p>Unlike aluminium – and, as we’ll come on to, carbon fibre – it can also be (relatively) easily repaired, if damaged.</p>\n<p>Similarly, steel also has a fatigue limit – it can withstand stress below its fatigue limit an infinite number of times without resulting in failure, again unlike aluminium, which will wear with time.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Steel remains a popular option for touring and bikepacking bikes.</span></figcaption><span> <i>Duncan Philpott / Immediate Media</i></span></div>\n<p>The natural damping properties of steel can result in a “springy” – read: comfortable – ride quality, too, even if it’s not a match for the stiffness-to-weight ratio of aluminium.</p>\n<p>For all of these reasons, steel is a popular option for boutique and custom bikes, as well as touring and bikepacking frames, where weight is less of a concern. Steel offers better value than titanium, and durability and longevity are key.</p>\n<p>That said, steel frames, unless made of stainless steel, need to be painted to stop external corrosion and can be coated inside the tubes too in order to stop rust.</p>\n<h4>Pros of a steel bike frame</h4>\n<ul><li>Strong, durable and won’t fatigue</li>\n<li>Easy to repair</li>\n<li>Comfort</li>\n<li>More affordable than titanium</li>\n</ul><h4>Cons of a steel bike frame</h4>\n<ul><li>Relatively heavy</li>\n<li>More expensive than aluminium</li>\n<li>Less advanced tube shapes than aluminium</li>\n<li>Will corrode if not properly treated</li>\n</ul><h2>Titanium frames</h2>\n<p>Titanium is often viewed as a luxurious option, partly due to its ride quality and cost, as well as the fact a titanium bike is often touted as a “bike for life”.</p>\n<p>Most metals have a defined number of load cycles before they’re likely to fail. Titanium is far more resilient to repeated stresses and strains, and this means skilled frame fabricators can build frames lighter and with more compliance without risk of failure.</p>\n<h3>Titanium alloys</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Titanium has a timeless appeal as a frame material.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div>\n<p>Like aluminium and steel frames, titanium is an alloy and there are also different grades available to frame builders.</p>\n<p>The AL3 2.5V alloy (containing 3% aluminium and 2.5% vanadium) is the most common grade used for titanium frames. 6AL 4V tubing is notably stronger – and more difficult to work with, as a result – and is sometimes used for high-performance frames or individual areas where stiffness is key, such as the head tube and bottom bracket sleeve.</p>\n<p>Enigma, for example, uses the stiffer, higher-grade 6AL 4V alloy, also known as grade five titanium, for its performance bikes, rather than the 3AL 2.5V alloy (or grade nine) in its more compliant Etape frameset.</p>\n<p>Titanium alloys are also highly fatigue resistant, which means that they can flex without failing. Moots, for example, uses flex in the titanium chainstays to provide pivotless suspension at the rear of its Mountaineer and <a href=\"https://www.bikeradar.com/features/are-the-90s-back-moots-amazingly-anodised-soft-tail-equipped-gravel-bike/\">Routt YBB</a> framesets.</p>\n<h3>What are the properties of a titanium bike frame?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The latest titanium frames can be designed to offer a stiff, sporty ride.</span></figcaption><span> <i>Robert Smith / Immediate Media</i></span></div>\n<p>Titanium has distinct advantages over other metals for a bike frame. It’s less dense than steel so a frameset can be lighter while still having thicker-walled tubes. A titanium tube is half the weight of a steel tube of the same tensile strength. Enigma’s titanium tubesets typically are 0.9mm thick at their thinnest point, against 0.5mm for steel.</p>\n<p>That makes it harder to dent a titanium frame and, since titanium doesn’t corrode, the frame doesn’t need painting, so scratches and chips aren’t an issue either. The raw finish typical of titanium frames looks great too, although there’s no reason why a titanium frame can’t be painted.</p>\n<p>On the other hand, titanium is a lot more difficult to work with than steel, according to Enigma’s Lambert. “You have to be careful over cleanliness and control of the welding process, in particular purging oxygen, for which Enigma uses argon gas,” he says.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> What’s not to like about details like this?</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>It used to be that there were few titanium tubesets available and they weren’t designed specifically for bikes. This gave titanium frames a reputation for being over-flexy. Lambert says that’s not an issue now, as there’s more choice of bike-specific tubing, while design features such as tapered steerers and wider <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket standards</a> mean that titanium frames can be designed to be as stiff as the application demands.</p>\n<p>That said, titanium still has a reputation for offering a comfortable ride quality in the hands of a good frame builder.</p>\n<p>The flip side is that titanium is the most expensive metal option, often eclipsing the price of a carbon frameset.</p>\n<h4>Pros of a titanium bike frame</h4>\n<ul><li>Strong, durable and won’t fatigue</li>\n<li>Lighter than steel</li>\n<li>Ride quality</li>\n<li>Raw finish or painted</li>\n</ul><h4>Cons of a titanium bike frame</h4>\n<ul><li>Hard to work with</li>\n<li>Not as light as carbon or high-grade aluminium</li>\n<li>Expensive</li>\n</ul><h2>Carbon fibre frames</h2>\n<p>Ever since Lance Armstrong won the 1999 Tour de France on a Trek 5500 OCLV, carbon fibre has been the go-to material for high-performance bike frames.</p>\n<p>And for good reason. Carbon fibre is a highly-adaptable wonder material that can be shaped and fine-tuned to precise requirements, balancing stiffness, comfort and aerodynamic performance.</p>\n<p>Carbon isn’t without its downfalls, though. Carbon fibre bike frames are expensive – well into five figures at the top-end of the market – and can be more susceptible to crash damage than other materials.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Carbon fibre really came to the fore in the early 2000s.</span></figcaption><span> <i>Tim de Waele / Getty Images</i></span></div>\n<h3>How is a carbon fibre bike frame made?</h3>\n<p>A carbon bike frame is made up of layers of carbon fibre (fibres woven into sheets) embedded in a matrix of epoxy resin. The carbon fibres give it strength, the resin holds it together.</p>\n<p>“Carbon has the highest strength-to-weight per ply,” says Glen. “But that’s only in one direction, so it’s stacked at multiple angles in a bike frame. That means that its strength-to-weight goes down a little, but it’s still higher than other materials.”</p>\n<p>Most frames are made by layering up many sheets of carbon fibre/resin material, called “prepreg”, with different grades and orientations used in different places in the frame. Look, for example, says that its 795 Blade frame is made using over 800 different pieces of prepreg.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> An oven is used to cure a carbon frame in production.</span></figcaption><span> <i>Octavio Passos / Getty Images</i></span></div>\n<p>“The resin gives the frame impact tolerance and compression strength,” says Glen. “There are relatively few companies making prepreg and many frames are made by third parties, so most frames will be made with the same resins. It’s the lay-up that bike makers specialise in and that also gives their frames their different qualities.”</p>\n<p>The need to master lay-up adds another layer of complexity to carbon frame design. Bike brands also don’t know how individual end-users will ride their frames. That leads to a degree of over-engineering of carbon frames to ensure that they can handle abnormal loads, says Glen.</p>\n<h4>Monocoque or tube-to-tube construction?</h4>\n<div>\n    <img /></div><div><figcaption><span><i></i> Colnago is one of the few brands to use a lugged construction for a carbon fibre frame.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>Once the different layers in the frame have been assembled, which is done by hand, the frame is placed in a heavy metal mould and heated under pressure to bond the different layers together.</p>\n<p>In a monocoque frame, a different mould is needed for each size of bike, making setup for a new frame design expensive.</p>\n<p>The alternative, which is used for a few custom frames, is tube-to-tube construction, where pre-formed carbon fibre tubes are cut to length and either wrapped in extra carbon fibre at the joints or glued into carbon fibre lugs. The <a href=\"https://www.bikeradar.com/reviews/components/bike-frames/road-bike-frames/colnago-c64-first-ride-review/\">Colnago C64</a> is a classic example of the latter method of construction, while <a href=\"https://www.bikeradar.com/features/pro-bike/pro-bike-kristian-houses-condor-leggero-sl/\">Condor’s carbon framesets</a> use tube-to-tube construction.</p>\n<p>A very limited number of bike manufacturers have used machines to weave their own carbon fibres into tubes. It’s a process which has been used for some BMC and Time framesets.</p>\n<h3>What are the properties of a carbon fibre frame?</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Carbon frames can be moulded into complex aerodynamic shapes.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>A key difference between carbon fibre and all metals is that the composite nature of carbon fibre makes it anisotropic, which means that its physical properties are different in different directions.</p>\n<p>An everyday example of an anisotropic material is a piece of wood; you can easily split it lengthways, but it’s a lot harder to break across the grain.</p>\n<p>It’s the same with carbon fibre, which means the layout of different pieces is crucial to how the frame rides and how strong it is. It’s why you’ll repeatedly find references to “lay-up” in marketing materials for carbon bikes.</p>\n<p>The other important factor is the modulus of the carbon fibre used. Higher modulus fibres will be stiffer, but they’re also more brittle, so even a frame marketed as “high modulus” will be made of a mix of different grades of carbon fibre. Higher modulus carbon fibre is also more expensive, but the end result will be a lighter frame for the same strength.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Carbon fibre is a wonder material when it comes to frame design, but it’s not without its drawbacks.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>You’ll sometimes find other materials incorporated into carbon frames, too. An example is Bianchi’s Countervail technology, used in many of its frames, which integrates a layer of viscoelastic material into the carbon lay-up, which Bianchi says helps to dampen vibrations.</p>\n<p>The advantages of carbon fibre are well known, given the propensity of bike brands to sing the praise of their all-conquering, high-end carbon frames.</p>\n<p>The ability to carefully curate the properties of each part of the frame means carbon frames can be designed to meet the specific demands of the bike and the type of riding it’s designed for.</p>\n<p>Carbon fibre can be used to make a frame that’s extremely light and extremely stiff, with the option to wrap the carbon into complex, aerodynamic tube shapes, while still considering ride quality and comfort.</p>\n<h3>It’s not all good news</h3>\n<p>That will cost you, though, and carbon fibre isn’t always the best option for cheaper frames, where more affordable aluminium options can offer similar – or better – ride characteristics, for less money.</p>\n<p>Another disadvantage of carbon fibre over metal frames is that it can’t be reamed or tapped to provide threads to allow components to be screwed in. That means <a href=\"https://www.bikeradar.com/features/bicycle-bearings-everything-you-need-to-know/\">bearings</a> typically have to be pushed into the frame, or a metal insert needs to be added to house threaded bearings.</p>\n<p>Press fit bottom bracket bearings, in particular, have a reputation for creaking, while metal inserts will add weight to a bike and may introduce alignment issues if not done right.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Carbon frames can be susceptible to crash damage.</span></figcaption><span> <i>Kenzo Tribouillard / Getty Images</i></span></div>\n<p>Carbon fibre is also quite easy to crush, so it can be easily damaged in areas such as quick-release drop-outs. That’s why carbon bikes often have metal drop-outs or inserts for thru-axles, or include metal protectors for these areas.</p>\n<p>Bangs and bashes can also cause damage to the interior of frame tubes, which may not be visible from the exterior and which can cause a frame to break unexpectedly. If your carbon frame has a bash or a heavy crash, you should get it inspected before riding it again. It may require ultrasound or X-ray inspection to detect internal damage.</p>\n<p>If you do break your carbon frame, there are limited options to recycle, whereas with metal frames that’s easy. The value of titanium, in particular, means that it’s unlikely to end up in landfill.</p>\n<h4>Pros of a carbon fibre bike frame</h4>\n<ul><li>Excellent stiffness-to-weight ratio</li>\n<li>Highly adaptable</li>\n<li>Can be moulded into aerodynamic tube shapes</li>\n</ul><h4>Cons of a carbon fibre bike frame</h4>\n<ul><li>Expensive</li>\n<li>Prone to wear and crash damage</li>\n</ul><h2>What other frame materials are available?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A bamboo bike? You bet!</span></figcaption><span> <i>Oli Woodman / BikeRadar</i></span></div>\n<p>While carbon fibre, titanium, steel and aluminium are by far the most common material used for bike frames, there are a handful of rarer options, too.</p>\n<p>You’ll sometimes see frames described as scandium. It’s far too rare an element to be used for an entire bike frame though, and scandium frames are actually an alloy of aluminium with a small percentage of scandium, along with other metals. The scandium content is there to up the strength of the alloy tubing.</p>\n<p>Some bikes and bike parts have been made of magnesium alloy and it keeps threatening to make a comeback, with niche frames made from the material. Magnesium alloy is lighter than aluminium and also stronger, although it’s less stiff. It had its heyday in the early 1990s when the Kirk Precision bike frame was raced at the Tour de France. The Pinarello Dogma was made of magnesium as late as 2006. Vaast also produces a range of magnesium frames, including the <a href=\"https://www.bikeradar.com/reviews/bikes/gravel-bikes/vaast-a-1-review/\">Vaast A/1 gravel bike</a>.</p>\n<p>Natural materials have found a niche in bike frames. Several brands sell bikes with frame tubes made of bamboo. <a href=\"https://www.bikeradar.com/features/routes-and-rides/riding-5000-miles-on-a-bamboo-bicycle/\">Riders report that it’s comfortable</a>, doing a good job of damping road vibrations. It results in a bike that’s a bit heavier than other materials and, although the bamboo tubes boast great eco credentials, they may need lugs and resins to join them that are less environmentally sound.</p>\n<p>Flax has also been used as a component of bike frames, usually in combination with carbon fibre, as it’s claimed that it absorbs vibration better than carbon alone. It’s used in the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/look-765-ultegra-review/\">LOOK 765 </a>endurance bike range and was also featured in a series of bikes <a href=\"https://www.bikeradar.com/news/museeuw-flax-bike-launch/\">launched in the mid-2000s by racing legend Johan Museeuw</a>.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"7400bf5c5d0f0fd46ba657b1e4ee15a50cd17db113619872638bd51528531522","category":"Cycling"}