{"title":"Intra-articular corticosteroid injections for osteoarthritis: A qualitative study of patients’ and clinicians’ experiences","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311668","date":1729692000000,"content":"<p>by Andrew J. Moore, Cecily K. Palmer, Karen L. Barker, Rachael Gooberman-Hill, Andy Judge, Vikki Wylde, Michael R. Whitehouse</p>\r\nBackground <p>Osteoarthritis is a leading cause of joint pain and disability. Intra-articular corticosteroid injections (IACs) are often used in primary care once other recommended treatments have failed. Evidence shows that IACs provide short-term relief of osteoarthritis symptoms, yet little is known about patients’ and primary care clinicians’ experiences and beliefs about their use. We explored patients’ and primary care clinicians’ views about IACs, including the benefits, disadvantages, perceived risks of treatment, when they are used, and factors that affect decision-making.</p> Methods <p>We conducted individual interviews with patients and primary care clinicians and used inductive thematic analysis to investigate their views and experiences of intra-articular corticosteroid injections for osteoarthritis (IACs).</p> Findings <p>We interviewed 38 patients and 19 primary care clinicians. We identified 6 patient themes: variation in access; awareness of IACs; views of risk and trust; effectiveness of IACs; variation in onset and effect duration; and an alternative to undesirable treatments. In the interviews with clinicians, we identified an overarching theme of caution and competence, which included eight subthemes: confidence and (dis)comfort with practical procedures; risk of adverse outcomes; training; uncertainty about evidence and guidelines; technical uncertainties; IACs use on the osteoarthritis pathway; perceived benefits and impacts of IACs; and the possibility of placebo.</p> Conclusion <p>Patients and clinicians valued IACs’ potential to relieve symptoms and improve quality of life. Variability in patients’ access to treatment appears related to clinicians’ confidence in delivering injections and their concerns about the evidence base. Variation in dose frequency and timing reflect clinicians’ uncertainty about current guidance. Despite variation in effectiveness patients preferred IACs to other forms of pain medication and to delay or avoid surgery. IACs were mostly used as an adjunct treatment before surgery was offered. These findings can inform further research into the effectiveness of IACs and improvements in information and guidance.</p>","author":"Andrew J. Moore","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7404defabed2bc0748fabca848c78b24d00ac22ee489bfe88044fd3d26290080","category":"Interdisciplinary"}