{"title":"Sublethal Sodium Hypochlorite Exposure: Impact on Resistance-Nodulation-cell Division (RND) Efflux Pump Overexpression, and Cross-Resistance to Imipenem","link":"https://www.preprints.org/manuscript/202407.2477/v1","date":1722407555000,"content":"Sodium hypochlorite (NaOCl) is widely used in public healthcare facilities; this exposure can result in the development of bacterial tolerance to disinfectant, which has known links to antibiotic cross-resistance. However, the mechanism through which cross-resistance to antibiotics and disinfectants develops remains ambiguous. Therefore, this study aimed to examine the phenotypic, and transcriptomic changes caused by disinfectant exposure in gram-negative bacteria and determine the cause of cross-resistance to antibiotics. The results demonstrated that the misuse of disinfectants plays an important role in the emergence of disinfectant resistance and in the increase in antibiotic resistance. Antibiotic resistance may occur from exposure of gram-negative bacteria to subminimal inhibitory concentrations (MICs) of NaOCl. Ten passages of gram-negative bacteria in increasingly higher subMICs of NaOCl disinfectant was sufficient to increase the MIC to &amp;gt;2,500 µg/ml NaOCl, particularly in K. pneumoniae and P. aeruginosa. To determine the development of cross-resistance to antibiotics due to NaOCl exposure, the MICs for each antibiotic before and after exposure of each strain to sublethal concentrations of NaOCl were compared. After overnight incubation with a sublethal concentration of NaOCl, a statistically significant increase in MIC was only observed for imipenem (P&amp;lt;0.01). Investigation of the mechanism of cross-resistance by means of transcriptome analysis revealed that 1,250 µg/ml NaOCl-adapted K. pneumoniae and P. aeruginosa strains increased resistance to imipenem due to increased expression of the resistance-nodulation-cell division (RND) efflux pumps, such as AcrAB-TolC and MexAB/XY-OprM. Therefore, we suggest that exposure to NaOCl can influence the expression of RND efflux pump genes, contributing to imipenem cross-resistance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"740b1751da4b8ba5c828034abe2f22b086c60bf4126c8d7f96e64c29f775aa6a","category":"Interdisciplinary"}