{"title":"Did Facebook fuel political polarization during the 2020 election? It’s complicated.","link":"https://arstechnica.com/?p=1956517","date":1690553672000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/facebook-the-social-megaphone-800x450.jpg\" alt=\"Did Facebook fuel political polarization during the 2020 election? It’s complicated.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/facebook-the-social-megaphone.jpg\">Enlarge</a> (credit: Getty Images | Aurich Lawson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Over the last several years, there have been growing concerns about the influence of social media on fostering political polarization in the US, with critical implications for democracy. But it's unclear whether our online \"echo chambers\" are the driving factor behind that polarization or whether social media merely reflects (and arguably amplifies) divisions that already exist. Several intervention strategies have been proposed to reduce polarization and the spread of misinformation on social media, but it's equally unclear how effective they would be at addressing the problem.</p>\n<p>The <a href=\"https://socialmediaarchive.org\">US 2020 Facebook and Instagram Election Study</a> is a joint collaboration between a group of independent external academics from several institutions and Meta, the parent company of Facebook and Instagram. The project is designed to explore these and other relevant questions about the role of social media in democracy within the context of the 2020 US election. It's also <a href=\"https://about.fb.com/news/2023/07/research-social-media-impact-elections/\">a first</a> in terms of the degree of transparency and independence that Meta has granted to academic researchers. Now we have the first results from this unusual collaboration, detailed in four separate papers—the first round of over a dozen studies stemming from the project.</p>\n<p>Three of the papers were published in a special issue of the journal Science. The <a href=\"https://www.science.org/doi/10.1126/science.ade7138\">first paper</a> investigated how exposure to political news content on Facebook was segregated ideologically. The <a href=\"https://www.science.org/doi/10.1126/science.abp9364\">second paper</a> delved into the effects of a reverse chronological feed as opposed to an algorithmic one. The <a href=\"https://www.science.org/doi/10.1126/science.add8424\">third paper</a> examined the effects of exposure to reshared content on Facebook. And the <a href=\"https://www.nature.com/articles/s41586-023-06297-w\">fourth paper</a>, published in Nature, explored the extent to which social media \"echo chambers\" contribute to increased polarization and hostility.</p></div><p><a href=\"https://arstechnica.com/?p=1956517#p3\">Read 32 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956517&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"740e4299b66c71e9f63551c6cd3aac8ad2face19b50c1a637b9f38f07b8ea23e","category":"Tech"}