{"title":"Google ปล่อย Pixel Drop เดือนมิถุนายน ปล่อยอัพเดตแบบจัดเต็ม","link":"https://www.blognone.com/node/134356","date":1686738235000,"content":"<div><div><div><p>Google ได้ปล่อย <strong>Pixel Feature Drop</strong> ประจำเดือนมิถุนายนออกมาแล้ว ซึ่งมีหลายฟีเจอร์ที่ผู้ใช้งานหลาย ๆ คนต่างรอคอย โดยการ Update ขนานใหญ่นี้มาพร้อมกับ Update ของ Android 13 QPR 3 beta</p>\n<p>Feature ใหม่ที่เป็นส่วนหนึ่งของ Feature Drop ประจำเดือนมิถุนายน คือ ปรับปรุงประสิทธิภาพโดยรวมของอุปกรณ์, แก้บั๊คต่าง ๆ และ June security patch โดย Update ไม่ได้ออกให้กับเฉพาะมือถือ Pixel เท่านั้น แต่ยังออกให้กับอุปกรณ์ Pixel ตัวอื่น ๆ ด้วย โดยใน Pixel Phone มีฟีเจอร์เด่น ๆ ดั้งนี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/52ce6f8db2c12d075983367f044dd243.png\" /></p>\n<p><strong>Emergency Sharing &amp; Safety Check</strong> : ใช้เสียงของคุณสั่งการ Google Assistant เพื่อเริ่ม Emergency Sharing หรือ กำหนดช่วงเวลาสำหรับ Safety Check ซึ่งมีการยกตัวอย่างการใช้งานจาก กิจกรรมอย่างการวิ่งตอนกลางคืน ซึ่งเราสามารถตั้งให้ Pixel แจ้งเตือนเพื่อให้เราตอบกลับว่ายังปลอดภัยอยู่ได้ แต่ถ้าเราไม่ตอบเนื่องจากเกิดเหตุการณ์ต่าง ๆ ในเวลาที่กำหนด ตัว Pixel จะทำการส่งตำแหน่งที่อยู่ไปให้กับ Emerrgency Contacts ที่เราตั้งไว้ ซึ่ง Emergency Sharing นี้จะเปิดใช้งานตอนเกิด Car Crash Detected ด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dabcba64342b1ff4c9b3e61f5b32096f.png\" /></p>\n<p><strong>Macro Focus สำหรับวิดีโอ</strong> : ใน Pixel 7 Pro มีฟีเจอร์ Macro Focus สำหรับการถ่ายรูปนิ่งระยะใกล้ ใน Update ตัวนี้ทำให้ใช้ Macro Focus สำหรับการถ่ายวิดีโอได้แล้ว<br />\n<strong>Hands-Free Photos</strong> : ใน Pixel 6 หรือใหม่กว่า ผู้ใช้งานจะสามารยกมือขึ้นมาเพื่อสั่งให้ Pixel ถ่ายภาพได้ และยังกำหนดเวลานับถอยหลังก่อนถ่ายได้ไม่ว่าเป้น 3 วินาที หรือ 10 วินาทีก็ตาม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/59cd2d1e84154c7ad79a87823a3d896b.png\" /></p>\n<p><strong>Wallpapers แบบใหม่</strong> : ใน Pixel 6 หรือใหม่กว่า ผู้ใช้สามารถนำรูปต่าง ๆ มาทำเป็น Cinematic Wallpapers ในแบบฉบับของ Pixel ได้ ซึ่ง Pixel จะใช้ AI แปลงภาพ 2D ปกติของเราเป็น Dynamic 3D อีกทั้งยังมีอิโมจิใหม่ ๆ มากกว่า 4,000 อิโมจิ ทำให้สร้างสรรค์ Wallpapers ได้ตามใจผู้ใช้งาน</p>\n<p>นอกจากนี้ยังมีการ เพิ่มเสียงใหม่ ๆ ให้กับ Google Assistant, ปรับระดับความสั่นของเครื่อง, เข้าถึง Google Home ได้ผ่าน Lock Screen และ ใช้ Google AI เรียนรู้พฤติกรรมการชาร์จโทรศัพท์เพื่อช่วยยืดอายุแบตเตอรี่ของโทรศัพท์ได้</p>\n<p>ที่มา - <a href=\"https://blog.google/products/pixel/feature-drop-june-2023/\">Google</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel\">Google Pixel</a></div><div><a href=\"/topics/google\">Google</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"741274ffedcfe978878d350c02231cdeaa0e5bf33d3ff47b19b1036ec08e4927","category":"Thai"}