{"title":"Land use determines Mediterranean ecosystems' multifunctionality more than plant richness or habitat composition","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14568?af=R","date":1709702618000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e83b3e88-58dd-45d3-97c2-e4633e501005/jpe14568-toc-0001-m.png\" alt=\"Land use determines Mediterranean ecosystems' multifunctionality more than plant richness or habitat composition\" />\n<p>Our results highlight the importance of remnant native forest to provide multiple ecosystem functions and the potential to restore them and complement these uses with sustainable agriculture. By merging landscape and ecosystem approaches we provide specific numbers regarding the proportion that each land use should have in order to maximise biodiversity conservation and/or functioning in these charismatic environments.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nLocal and landscape diversity loss, habitat fragmentation and land-use changes commonly co-occur and impair ecosystem multifunctionality, yet they are often studied in isolation. Therefore, we ignore the relative importance of these drivers of ecosystem change or whether or not they interact to determine ecosystem functioning.\n\nWe measured how changes in local (plant richness) and landscape (different land uses) diversity, land use (orchards, shrubland, pine, oak and mixed forests) and habitat sise, and their interactions, affected the functioning of Mediterranean ecosystems. At 49 plots, we measured 17 above- and below-ground functions, related to nutrient cycling, carbon sequestration and biotic interactions. Additionally, we generated different combinations of plots to compose artificial landscapes where multifunctionality and biodiversity conservation can be maximised, in order to aid land managers to preserve or design functional and diverse areas.\n\nThe relative importance of local and landscape attributes varied slightly depending on the target function, yet land use was by far the strongest predictor of most functions and multifunctionality above local plant biodiversity, habitat sise or landscape diversity. Oak and mixed forest were the most multifunctional land uses but were functionally wcomplemented by other land uses that maximised some individual functions.\n\nThe relative proportion of each land use within optimal landscapes varied if the target was biodiversity conservation (with an even dominance of land uses), carbon stocks or multifunctionality (highly dominated by native oak and mixed forests).\n\n<i>Synthesis and applications</i>: Our results highlight the importance of remnant native forest to provide multiple ecosystem functions and the potential to restore them and complement these uses with sustainable agriculture. By merging landscape and ecosystem approaches we provide specific numbers regarding the proportion that each land use should have in order to maximise biodiversity conservation and/or functioning in these charismatic environments.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLa pérdida de diversidad local y de paisaje, la fragmentación del hábitat y los cambios en el uso del suelo suelen ocurrir de forma simultánea, perjudicando la multifuncionalidad del ecosistema, sin embargo, suelen ser estudiados de forma aislada. Por lo tanto, ignoramos la importancia relativa de estos impulsores del cambio del ecosistema o si interactúan o no para determinar el funcionamiento del ecosistema.\n\nMedimos cómo los cambios en la diversidad local (riqueza de plantas) y de paisaje (diferentes usos del suelo), el uso del suelo (cultivos, matorrales, pinares, encinares y bosques mixtos) y el tamaño del hábitat, y sus interacciones, afectan al funcionamiento de los ecosistemas mediterráneos. En 49 parcelas, medimos 17 funciones, relacionadas con el ciclo de nutrientes, el secuestro de carbono y las interacciones bióticas. Adicionalmente, generamos diferentes combinaciones de parcelas para componer paisajes artificiales donde se maximizaba la multifuncionalidad y la conservación de la biodiversidad, con el fin de proveer a las administraciones las áreas a preservar con alta diversidad y funcionamiento.\n\nLa importancia relativa de los atributos locales y del paisaje varió levemente dependiendo de la función estudiada, sin embargo, el uso del suelo fue, con mucha diferencia, el predictor más importante en la mayoría de las funciones y la multifuncionalidad por encima de la biodiversidad vegetal local, el tamaño del hábitat o la diversidad del paisaje. El encinar y el bosque mixto fueron los usos desuelo más multifuncionales, pero se complementaron con otros usos del suelo que maximizaron algunas funciones individualmente.\n\nLa proporción relativa de cada uso de suelo dentro de los paisajes óptimos varió si el objetivo era la conservación de la biodiversidad y las reservas de carbono (con proporciones similares) o la multifuncionalidad (altamente dominada por encinares nativos y bosques mixtos).\n\nSíntesis y aplicaciones: Nuestros resultados resaltan la importancia de los bosques nativos remanentes para proporcionar múltiples funciones ecosistémicas y el potencial para restaurarlos y complementar estos usos con agricultura sostenible. Al combinar los enfoques de paisaje y ecosistema, proporcionamos números específicos con respecto a la proporción que debe tener cada uso del suelo para maximizar la conservación de la biodiversidad y/o el funcionamiento del ecosistema en estos entornos de gran valor ecológico.\n</p>","author":"Paula Lopezosa, \nSantiago Soliveres, \nLluís Serra, \nSoraya Constán‐Nava, \nMiguel Berdugo","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"741870755d0ac9afcf023e0a1f4d1d899d618e0327fe56afb25a3f86e733234f","category":"Environment"}