{"title":"Reddit API changes are imminent. Here’s what’s happening to your favorite apps","link":"https://arstechnica.com/?p=1951212","date":1688153060000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1258545135-800x533.jpg\" alt=\"Apollo for Reddit on AppStore displayed on a phone screen and Reddit logo on the website displayed on a screen\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/GettyImages-1258545135-scaled.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/apollo-for-reddit-on-appstore-displayed-on-a-phone-screen-news-photo/1258545135\">Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's been a contentious journey, but Reddit's new API pricing will take effect on July 1. What started as a fight over creating an affordable option for valued third-party Reddit apps has evolved into a bitter battle pitting Reddit against indignant developers, mods, and users. Protests remain, but some users are now preparing to exit the platform, including some of Reddit's most seasoned moderators.</p>\n<p>Where does that leave third-party developers, some of which said they would have to pay Reddit $20 million annually to continue? Ars Technica spoke with developers to learn where their apps stand, how some will manage to stay afloat, and what Reddit's changes mean for the future.</p>\n<h2>Surviving apps</h2>\n<p>When Reddit announced that, starting on July 1, it would no longer permit free API access except for certain non-commercial apps, many Reddit app developers responded by telling users that they were unsure if they could keep the apps running. Now that the new API pricing ($12,000 per 50 million API requests) is set to be reality, here's a look at the most popular apps that will still be available.</p></div><p><a href=\"https://arstechnica.com/?p=1951212#p3\">Read 63 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1951212&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"741d0d772339e69899aa0f2bef507f58eebc1461570abd32581a59f360f25852","category":"Tech"}