{"title":"Siri Will Learn Your Music Preferences With HomePod Software 17.4","link":"https://www.macrumors.com/2024/03/04/homepod-siri-music-preferences-17-4/","date":1709591529000,"content":"Alongside iOS 17.4, iPadOS 17.4, and tvOS 17.4, Apple plans to release a <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> 17.4 software update that adds a small but meaningful change to <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/homepod-blue-green.jpg\" width=\"2500\" height=\"1406\" />\r<br />\n‌Siri‌ will be able to learn what a user's preferred media service is, which means that there won't be a need to include an app name when asking ‌Siri‌ to play content or go through the process to set a default third-party app.\r<br />\n\r<br />\n‌HomePod‌ users have been able to play songs, podcasts, audiobooks, and other media using supported third-party apps through a ‌Siri‌ request for quite some time now, but this needed to be set up in the Settings section of the Home app. The option was fairly hidden, so some ‌HomePod‌ users might have forgotten the feature was even available. From Apple's release notes:<blockquote>This update enables Siri to learn your preferred media service, so you no longer need to include the name of the media app in your request.</blockquote>With ‌HomePod‌ 17.4, ‌Siri‌ will learn preferences and use those preferences to select apps. If you have YouTube Music, for example, you won't need to say \"Play [song name] on YouTube Music\" to bypass <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>, nor will you need to set YouTube Music as your default music service in the Home app.\r<br />\n\r<br />\n‌Siri‌ already works this way on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and asks users for their preferred app when playing content for the first time. As ‌Siri‌ has been updated to set a preference automatically, Apple has removed the Home app option that let users select a default media service.\r<br />\n\r<br />\nThird-party apps that work directly with the ‌HomePod‌ include YouTube Music, Deezer, Pandora, TuneIn, and iHeartRadio. Streaming music services need to support ‌HomePod‌ for the feature to work, and not all do. Note that popular music service Spotify can play content through a ‌Siri‌ request on ‌HomePod‌, but it uses the ‌iPhone‌ to do so.\r<br />\n\r<br />\nAlong with ‌Siri‌ support for a preferred music service, the ‌HomePod‌ 17.4 update also includes performance and stability improvements. The ‌HomePod‌ 17.4 software will see a release as soon as this week.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a>, <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#HomePod\">HomePod (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#Homepod-Mini\">HomePod Mini (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/homepod-homekit-carplay-home-auto-technology.193\">HomePod, HomeKit, CarPlay, Home &amp; Auto Technology</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/04/homepod-siri-music-preferences-17-4/\">Siri Will Learn Your Music Preferences With HomePod Software 17.4</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/siri-will-learn-your-music-preferences-with-homepod-software-17-4.2421061/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7421151760df515874a9e0d9baafd2630ee8af5c5be8cd5bd30fe720b59639e4","category":"Apple"}