{"title":"Phenolic composition and bioactivities of sea buckthorn (Hippophae rhamnoides L.) fruit and seeds: an unconventional source of natural antioxidants in North America","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13386?af=R","date":1709127611000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Sea buckthorn (<i>Hippophae rhamnoides</i> L.) was introduced into Canada in the early 2000s. This plant bears fruits with high commercial value in other countries due to its premium oil. Nevertheless, sea buckthorn berries are also a rich source of bioactives with nutraceutical potential, especially the variety grown in Newfoundland (Canada), which has not previously been characterized. As such, this study evaluated the composition of polyphenols in sea buckthorn pomace and seeds, as well as their prospective health-promoting effects.</p>\n<h2>RESULTS</h2>\n<p>Polyphenolic identification by high-performance liquid chromatography–ultraviolet–mass spectrometry–time of flight revealed the presence of 24 compounds in the seeds and 16 compounds in the pomace, including phenolic acids, flavonoids, and tannins, with ellagic acid derivative IV (pomace, 52.13 μg g<sup>−1</sup>) and (+)-catechin (seeds, 690.8 μg g<sup>−1</sup>) being the most dominant. Sea buckthorn extracts displayed <i>in vitro</i> antidiabetic and anti-obesity potential by inhibiting α-glucosidase (71.52–99.31%) and pancreatic lipase (15.80–35.61%) enzymes, respectively. The extracts also protected low-density-lipoprotein cholesterol (50.97–89.67%) and supercoiled DNA (35.11–79.84%) from oxidative damage.</p>\n<h2>CONCLUSION</h2>\n<p>Sea buckthorn berries grown in Canada showed promising health benefits induced by their rich and diverse polyphenolic profile and need to be considered for further commercial expansion as a bioactive-loaded superfruit. © 2024 Society of Chemical Industry.</p>","author":"Renan Danielski, \nFereidoon Shahidi","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"743655135073cc30c131214d7efe4a0828a3d6d3332ecce9fc2065db1836035a","category":"Environment"}