{"title":"449 Comparative study on performance, carcass traits and meat quality of different varieties of guinea fowl","link":"https://academic.oup.com/jas/article/102/Supplement_3/260/7757191?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The purpose of this study was to evaluate productive, reproductive performance, carcass characteristics, chemical composition and meat quality of four varieties of guinea fowl. A total of 200 guinea fowls from White, Pearl, Lavender and Mixed varieties were reared in an intensive production system from 0 to 20 wk of age. Guinea fowl keets were reared provided with balanced recommended ration (Starter diet: ME 2,950 kcal/kg, CP 23% for initial 8 wk; Grower diet: ME 2,950 kcal/kg, CP 16% for 9 to 16 wk and Layer diet: ME 2,900 kcal/kg, CP 17% from 17 wk till the end of the laying period). There was no significant (<span>P</span> &lt; 0.05) difference found in body weight (BW) from 0 to 20 wk old guinea fowl. However, BW of Pearl variety was greater than other varieties numerically (Table 1). At adult age, a total of 40 birds (10 from each variety) were slaughtered according to standard method and carcasses were cut into parts. Weights were taken for all carcass parts. Proximate analysis and meat quality were performed on breast and thigh meat, as well as on abdominal fat of the studied guinea fowls. Carcass weight (930.33 ± 27.37 g), dressing percentage (67.6 ± 0.013%), breast weight (228.33 ± 13.68 g) and thigh weight (166.33 ± 6.69 g) of Pearl variety was significantly (<span>P</span> &lt; 0.001) greatest (Table 2). Measured abdominal fat (23 ± 0.13) was found to be significantly (<span>P</span> &lt; 0.001) greatest in Pearl variety. Furthermore, there was no significant difference found in crude protein among breast and thigh meat of different varieties. The ether extract (EE) and crude fiber (CF) of breast (EE: 0.27, CF:0.33) and thigh meat (EE: 0.20, CF:0.33) of Lavender variety was significantly (<span>P</span> &lt; 0.05) less than other varieties (Table 3). In case of reproductive parameters, Pearl variety exhibited better egg fertility (65.72 ± 6.10) numerically and significantly greater (<span>P</span> &lt; 0.001) hatchability percentage (76.75 ± 3.88) than other varieties. Meat color values of all the varieties of guinea fowl found in this study are in line with the demands of poultry consumers (Table 4). Regarding water holding capacity (WHC) and drip loss (DL), there was no discernible difference (<span>P</span> &gt; 0.05). Considering all the parameters especially cooking loss (CL) and pH, there was a noticeable difference (<span>P</span> &lt; 0.05) in which the Lavender (CL: 24.81 ± 0.69, pH:6.12 ± 0.05) and White variety (CL: 25.35 ± 0.69, pH: 6.11 ± 0.05) performed better than the other varieties.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7437fb2b3d96b7c71f4f834b1163ba6db4feda54d3620877e44df69f6057d8f5","category":"Environment"}