{"title":"US gov’t will slap contractors with civil lawsuits for hiding breaches","link":"https://arstechnica.com/?p=1801922","date":1633610765000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/05/capitol-640x404.jpg\" />\n      <p>(credit: <a href=\"https://secure.flickr.com/photos/stephenmelkisethian/10320387414/in/photolist-gHYFC3-eXLmxh-kBfsDM-59Djtu-8aa75K-fuvnjp-8aGU6y-3caBxD-5Gpt2f-8DS2v1-GGph-saP4-6dZqa8-7PvzBT-7PzySq-6eBUk1-GGfP-ut59t-2d76ui-5i5jP6-2d76xD-dMUy9X-3bSSVE-eECrU4-bEN4rA-4nDYh6-9wvKXB-eXyZrg-PVpjm-bG83H-oGSwUj-6s5fSg-px8th-9q58gK-5Dt9xf-7u4KHf-7LYcuj-6s9o4f-4ycZkP-8bkR9g-5vc8eS-8RBTuR-62CQL1-6FZTXZ-aLDCV-9cRYh2-6xfsdZ-eSPUQx-CPuRy-eXyYPn\">Stephen Melkisethian</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In a groundbreaking initiative announced by the Department of Justice this week, federal contractors will be sued if they fail to report a cyber attack or data breaches. The newly introduced \"Civil Cyber-Fraud Initiative\" will leverage the existing <a href=\"https://en.wikipedia.org/wiki/False_Claims_Act\" target=\"_blank\">False Claims Act</a> to pursue contractors and grant recipients involved in what the DoJ calls \"cybersecurity fraud.\" Usually, the False Claims Act is used by the government to tackle civil lawsuits over false claims made in relation to federal funds and property connected with government programs.</p>\n<h2>Cyber contractors chose silence “for too long”</h2>\n<p>\"For too long, companies have chosen silence under the mistaken belief that it is less risky to hide a breach than to bring it forward and to report it,” states Deputy Attorney General Lisa O. Monaco, who is pioneering the initiative. \"Well, that changes today. We are announcing today that we will use our civil enforcement tools to pursue companies, those who are government contractors who receive federal funds, when they fail to follow required cybersecurity standards—because we know that puts all of us at risk. This is a tool that we have to ensure that taxpayer dollars are used appropriately and guard the public fisc and public trust.\"</p>\n<p>The introduction of the Civil Cyber-Fraud Initiative is the \"direct result\" of the department's ongoing thorough review of the cybersecurity landscape ordered by the deputy attorney general in May. The goal behind these review activities is to develop actionable recommendations that enhance and expand the DoJ's efforts for combating cyber threats.</p></div><p><a href=\"https://arstechnica.com/?p=1801922#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1801922&amp;comments=1\">Comments</a></p>","author":"Ax Sharma","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"743f650d45e5ff6fbb85c9ae1cd5c81145a2b7f1df712a6945a3258f0daff178","category":"Tech"}