{"title":"Monitoring the after-effects of ischemic stroke through EEG microstates","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300806","date":1711116000000,"content":"<p>by Fang Wang, Xue Yang, Xueying Zhang, Fengyun Hu</p>\r\nBackground and purpose <p>Stroke may cause extensive after-effects such as motor function impairments and disorder of consciousness (DoC). Detecting these after-effects of stroke and monitoring their changes are challenging jobs currently undertaken via traditional clinical examinations. These behavioural examinations often take a great deal of manpower and time, thus consuming significant resources. Computer-aided examinations of the electroencephalogram (EEG) microstates derived from bedside EEG monitoring may provide an alternative way to assist medical practitioners in a quick assessment of the after-effects of stroke.</p> Methods <p>In this study, we designed a framework to extract microstate maps and calculate their statistical parameters to input to classifiers to identify DoC in ischemic stroke patients automatically. As the dataset is imbalanced with the minority of patients being DoC, an ensemble of support vector machines (EOSVM) is designed to solve the problem that classifiers always tend to be the majority classes in the classification on an imbalanced dataset.</p> Results <p>The experimental results show EOSVM get better performance (with accuracy and F1-Score both higher than 89%), improving sensitivity the most, from lower than 60% (SVM and AdaBoost) to higher than 80%. This highlighted the usefulness of the EOSVM-aided DoC detection based on microstates parameters.</p> Conclusion <p>Therefore, the classifier EOSVM classification based on features of EEG microstates is helpful to medical practitioners in DoC detection with saved resources that would otherwise be consumed in traditional clinic checks.</p>","author":"Fang Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7450bf0f01802fa3cace3ac379a134eabde05e2cf6521886f3fd95f447667a9d","category":"Interdisciplinary"}