{"title":"Ecological speciation in sympatric palms: 5. Evidence for pleiotropic speciation genes using gene knockout and high-throughput phenotyping","link":"https://academic.oup.com/evolinnean/article/doi/10.1093/evolinnean/kzae017/7740485?rss=1","date":1724457600000,"content":"<span><div>Abstract</div>Theoretical models predict that sympatric, ecological speciation may be facilitated more readily when so-called ‘magic traits’ are present, linking traits under divergent selection with assortative mating. Such traits might be encoded by pleiotropic genes, that is, genes that affect multiple, apparently unrelated, phenotypes. However, few convincing examples of sympatric speciation exist, and empirical evidence for the role of magic traits in driving such speciation is rare. One of the strongest cases of sympatric speciation is the <span>Howea</span> palms of Lord Howe Island, Australia, comprising the sister species <span>Howea belmoreana</span> and <span>Howea forsteriana</span>, which have diverged due to soil substrate preferences and flowering time displacement. Here we investigate the role that pleiotropy may have played in the speciation process by carrying out high-throughput phenotyping experiments using 1830 <span>Arabidopsis thaliana</span> plants with knockouts of candidate <span>Howea</span> ‘speciation genes’. We identify several genes that show signatures of adaptive divergence between the <span>Howea</span> species and demonstrate pleiotropic roles in soil stress tolerance and flowering time, consistent with the <span>Howea</span> speciation scenario—notably, <span>Howea</span> orthologues of the <span>A. thaliana</span> loci <span>At2-MMP</span>, <span>DCL1</span>, <span>RCD1</span>, <span>SAL1</span>, and <span>SIZ1</span>. Empirical evidence is provided, therefore, for a range of pleiotropic genes with the potential to have driven sympatric speciation by generating magic traits which link divergent selection to non-random mating.</span>","author":"","siteTitle":"Evolutionary Journal of the Linnean Society Current Issue","siteHash":"3a6bf3189332aa8d860b0369d5aa2ac065f7385b7c3f4543469ad2a55950d26a","entryHash":"74558afbfcec3b18c4186b367bace6a1a2b629c929cc12497cfecfd33e2667cc","category":"Environment"}