{"title":"Apple will reportedly launch two new 4th-gen AirPods models in 2024","link":"https://www.macworld.com/article/2174810/three-brand-new-sets-airpods-on-way-report.html","date":1702909252000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s AirPods headphones range, like its tablets, will soon have gone an entire calendar year with no updates or new products (unless you count the USB-C ArPods Pro case). That’s less of a shock than with the iPad—there weren’t any new AirPods in 2017 and 2018 either—but many Apple fans remain rather disappointed that the AirPods Max in particular haven’t received any attention in 2023.</p>\n\n\n\n<p>According to a new report, however, Apple intends to correct that oversight next year. There will be an updated version of the AirPods Max in 2024, according to the latest installment of Mark Gurman’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-12-17/apple-2024-plans-new-low-end-airpods-vision-pro-larger-iphone-16-oled-ipad-lq9jhed4&amp;xcust=1-1-2174810-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, along with <em>two</em> new editions of the standard AirPods. This, Gurman claims, is part of an attempt to simplify a set of products that have “left consumers confused about which AirPods to buy.”</p>\n\n\n\n<p>The problem, he explains, is that Apple <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2174810-1-0-0&amp;u=https://www.apple.com/airpods/\" target=\"_blank\">currently sells</a> two separate generations of non-Pro AirPods (the 2nd gen at $129 and the 3rd gen at $179) but fails to adequately convince customers why the costlier pair is worth the larger outlay. Buyers assume the 3rd gens must have better features but can’t see how, and end up plumping for the cheaper option (or even going for a different brand entirely), leaving revenue on the table. This makes Apple sad.</p>\n\n\n\n<p>Next year, Gurman predicts, Apple will completely clear out the non-Pro AirPods line and replace it with two new models, the more expensive of which will get a raft of new features, such as active noise cancellation, that are currently restricted to the AirPods Pro. (He doesn’t get into branding. Could the company do something similar to its newest Apple Pencil, and use generational branding on the costlier model only? We could get “AirPods (4th generation)” and “AirPods SE,” for example.) Both new AirPods will make the switch from Lightning to USB-C and get redesigns of both earbuds and charging case.</p>\n\n\n\n<p>In comparison to this overhaul, the updated AirPods Max may seem rather underwhelming. According to Gurman, that product hasn’t made enough sales to justify a major revamp, so the 2024 model will be different only in getting new color finishes and a USB-C charging port. That seems unlikely to stimulate much of a sales boost, but perhaps we’re underestimating the impact of, say, <a href=\"https://www.macworld.com/article/1532375/yellow-iphone-color-launch-spring-holding-back.html\">yellow</a>.</p>\n\n\n\n<p>That leaves the AirPods Pro, which got an update as recently as fall 2022 and are far less in need of attention than the other AirPods. Gurman says a refresh is planned, but not until 2025. He says early plans for this launch are “focusing on comfort.”</p>\n\n\n\n<p>You can keep up with all the latest news and rumors with our <a href=\"https://www.macworld.com/article/673885/airpods-pro-lite-release-date-price-specs-rumours.html\">new AirPods superguide</a>.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"745e2c9e63c022676735cc09ae4a09483e7832516bef1c874d8103b31992f4bd","category":"Apple"}