{"title":"ป๋าสุด AMD เปิดตัว FidelityFX Super Resolution คู่แข่ง DLSS เปิดให้ NVIDIA Pascal ใช้ด้วย","link":"https://www.blognone.com/node/122955","date":1622536402000,"content":"<div><div><div><p>AMD เปิดตัว FidelityFX Super Resolution หรือ FSR ระบบอัพสเกลด้วยแมชชีนเลิร์นนิ่ง คล้ายกับ DLSS ของฝั่ง NVIDIA พร้อมโชว์ตัวอย่างเกม Godfall ความละเอียด 4K ตั้งค่าระดับ Epic เปิด ray tracing บน RX 6800 XT เฟรมเรตเพิ่มขึ้นจาก 49 fps บนความละเอียดแบบ native เป็น 78 fps หรือเพิ่มขึ้นกว่า 59% เมื่อเปิด FSR โหมด Ultra Quality</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e1fd2da1622d1f0d8565628651a465b9.jpg\" /></p>\n<p>FSR มีระดับการตั้งค่า 4 ระดับ คือ Ultra Quality, Quality, Balanced และ Performance โดยเฟรมเรตเกม Godfall เพิ่มเป็น 78 fps, 99 fps, 124 fps และ 150 fps ตามลำดับ หรือเพิ่มขึ้นอีกราว 100 fps ในโหมด Performance แลกมาด้วยคุณภาพภาพที่ลดลง อาจเหมาะสำหรับการเล่นเกมบนโน้ตบุ๊ก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2a1bb6af3d24d36f0b714daa5c2d81aa.jpg\" /></p>\n<p>FSR รองรับการใช้งานบนจีพียูตระกูล RX6000, RX5000, RX500 และ RX Vega รวมถึงซีพียู Ryzen ที่มีจีพียู Radeon ออนบอร์ด และยังรองรับจีพียูตระกูล Pascal ของ NVIDIA พร้อมโชว์ตัวอย่างเกม Godfall รันที่ความละเอียด 1440p ตั้งค่า Epic ด้วย GTX 1060 ได้เฟรมเรตเพิ่มจาก 27 fps เป็น 38 fps เมื่อเปิด FSR โหมด Quality</p>\n<p>AMD ระบุว่า FSR ทำให้นักพัฒนาไม่ต้องเขียนโค้ดพิเศษเพื่อรองรับการทำงานของ FSR เหมือน DLSS ปัจจุบัน FSR ทำงานร่วมกับเกมเอนจิ้นและสตูดิโอกว่า 10 แห่ง และเตรียมเปิดให้ใช้งานในเกม Godfall เป็นเกมแรก วันที่ 22 มิถุนายนนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d26337b9b81f50b777ce87a5b2dd0259.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.amd.com/en/events/computex\">AMD Computex Keynote</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/amd\">AMD</a></div><div><a href=\"/topics/radeon\">Radeon</a></div><div><a href=\"/topics/gpu\">GPU</a></div><div><a href=\"/topics/graphic\">Graphic</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"745fea80086f250ac74a1d4eb33673d51fec09669b62ead82ab42423f8ce6de1","category":"Thai"}