{"title":"Geraint Thomas launches charitable cycling trust for young people","link":"https://www.cyclist.co.uk/news/10209/geraint-thomas-charitable-cycling-trust","date":1635243750000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>26 Oct 2021</span></div>    </div></div><p>\nIneos Grenadiers rider aims to help 5000 children in Wales and England</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/sportpicturescymru-5016-_dsc5486_.jpg?itok=jSjA1W_L\" />  </div>\n<div>\n      <p> 2018 <a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\" target=\"_blank\">Tour de France</a> winner <a href=\"/tags/geraint-thomas\" target=\"_blank\">Geraint Thomas</a> has today launched a charitable trust which aims to help young people enjoy cycling regardless of their individual circumstances.</p>\n<p>The trust plans to support children from 7 to 18 years of age in Wales and England, with the aim to help a target of 5,000 children enjoy the spirit of cycling over the next 10 years.</p>\n<p>Thomas said, 'I'm thrilled to be launching this trust – it's something I've been passionate about and to see it all come together is amazing.</p>\n<p>'The trust is about giving back and helping children across Wales and England enjoy cycling, whatever the discipline, and through this trust if we can give people the same thrill and excitement I get riding my bike that would be great.’</p>\n<p>The trust has several key aims, including to provide a grant fund and support programme for young people; to work in partnership with other cycling organisations to promote cycling; to develop a network of community volunteer mentors to support young people's participation within the sport, and to partner with local organisations, clubs and schools who can make referrals and applications for support.</p>\n<p>The double Olympic Champion is no stranger to giving back. During the Covid pandemic in 2020, Thomas took matters into his own hands by <a href=\"/news/8062/geraint-thomas-raises-360k-for-nhs-charities-with-mammoth-zwift-rides\" target=\"_blank\">raising over £375,000 for the NHS Heroes in Wales</a> by undertaking three consecutive 'Zwift Shifts' on his <a href=\"/reviews/667/the-best-turbo-trainers-a-buyers-guide\" target=\"_blank\">turbo trainer</a> in his garage in Cardiff.</p>\n<p>While the trust recognises that cycling provides many benefits, there are still many barriers preventing young people taking part in cycling. These include the affordability of bikes, skills to repair bikes, basic safety equipment, storage, knowledge of how to ride safely and accessibility to opportunities to ride.</p>\n<p>The trust further stated that cycling needs to be widened to a more diverse audience, ensuring young people from all protected characteristics and social backgrounds are given the opportunity to participate.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/8998/how-to-keep-your-feet-warm-while-cycling-in-winter\">How to keep your feet warm while cycling in winter</a></div>      <div><a href=\"/in-depth/10158/gallery-a-paris-roubaix-for-the-ages\">Gallery: A Paris-Roubaix for the ages</a></div>      <div><a href=\"/buying-guides/2191/buyers-guide-18-cold-weather-riding-essentials\">Buyer's guide: 18 cold weather riding essentials</a></div>    </div></div><p>\nAdrian Coles, chair of the trustees for the GTCT, said, 'Our ambitions are to grow year on year and to simply achieve a positive sustainable impact for the younger generation.</p>\n<p>'We are looking to work with organisations who feel they can positively contribute to our journey as we grow from today onwards.'</p>\n<p><em>Image credits: SportPictureCymru</em> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"745fbde6753738b968c7f1aa472350c0457eacb83cdb96f4e97d1db1745f9533","category":"Cycling"}