{"title":"macOS Monterey: 40 Tips, Tricks, and Features You Might Have Missed","link":"https://www.macrumors.com/guide/macos-monterey-tips/","date":1638470343000,"content":"Apple released <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> to the public in the fall, and the new desktop OS brings a whole slew of useful new features and changes to apps like Safari, Maps, <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, Notes, <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, Messages, and more.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nBeyond the headline features, Apple has also made numerous tweaks and changes to macOS that aim to make the time you spend using your Mac‌ more efficient, more functional, and more enjoyable. To that end, we've pulled out 40 additions and improvements to Monterey, some of which may have gone under your radar, and we've highlighted 20 of them in the video up above. Keep reading to refresh your memory or perhaps learn something new.\r\n<br />\r\n\r\n<br />\r\n<h3>1. Click to Save Photos in Messages</h3>\r\n<br />\r\nThere's a good chance you'll want to save the photos you receive in the Messages app to your ‌Photos‌ library, and ‌macOS Monterey‌ makes this easier than ever. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/1-Save-IMessage-photos.jpg\" />\r\n<br />\r\nYou no longer have to right-click or open the image (or stack of images) to save it. Simply click the <strong>Save to Photos</strong> button to the right of the image instead.\r\n<br />\r\n\r\n<br />\r\n<h3>2. Change Mouse Pointer Color</h3>\r\n<br />\r\nApple has made it possible to change the color of the mouse pointer from the standard white outline and black fill, to pretty much any color combination you want. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/2-change-cursor-color.jpg\" />\r\n<br />\r\nTo do so, go to <strong>System Preferences -&gt; Accessibility</strong>, then click <strong>Display</strong> (under \"Vision\") in the left column. Click the <strong>Pointer</strong> tab in the window of options, and you'll find <strong>Pointer outline color</strong> and <strong>Pointer fill color</strong> settings. Click the color swatch to choose a custom color from the palette that appears. You can always click <strong>Reset</strong> to revert to the default colors.\r\n<br />\r\n\r\n<br />\r\n<h3>3. Manage APFS Snapshots in Disk Utility</h3>\r\n<br />\r\nIn the macOS Disk Utility app, you now have access to individual APFS drive snapshots. An APFS snapshot is a read-only copy of its parent APFS volume, taken at a particular moment in time, and you can maintain these snapshots and copy items from them, provided you know what you're doing (see Disk Utility's Help menu for more).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/3-APFS-snapshots.jpg\" />\r\n<br />\r\nTo view them as a list, simply select a volume and choose<strong> View -&gt; Show APFS Snapshots</strong> from the menu bar. The fixed order list shows you the name, creation date, and cumulative size of each snapshot, while the most recent snapshot has a partition symbol beside its \"Tidemark.\" Select a snapshot from the list and you can right-click or use the ellipsis button at the bottom left corner of the list to mount the snapshot, rename it, and delete it.\r\n<br />\r\n\r\n<br />\r\n<h3>4. Test Network Quality</h3>\r\n<br />\r\nIt's now possible to measure the quality of your Mac's internet connection directly from within macOS. Simply open a Terminal window and type <strong>networkQuality</strong> into the command prompt. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/4-network-quality.jpg\" />\r\n<br />\r\nAfter a short while, you'll have an upload/download measurement, along with the number of \"flows\" (test packets) used for the responsiveness (network round trips) test. The upload/download capacity is roughly the same result metric you get from online internet speed tools like Speedtest by Ookla, although it tests upload and download concurrently rather than sequentially. \r\n<br />\r\n\r\n<br />\r\n<h3>5. Protect Mail Activity</h3>\r\n<br />\r\nIn the Mail app, a new feature called Mail Privacy Protection prevents senders from using invisible pixels to collect information about you. It does this by preventing senders from knowing when you open their email, and masks your IP address so that it can't be linked to your other online activity or used to determine your location.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/5-protect-mail-privacy.jpg\" />\r\n<br />\r\nTo turn on the feature in Mail, select <strong>Mail -&gt; Preferences...</strong> in the menu bar, click the <strong>Privacy</strong> tab, and then check the box next to <strong>Protect Mail Activity</strong>. If you leave it disabled, you can still independently opt to <strong>Hide IP address</strong> and <strong>Block All Remote Content</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>6. AirPlay to Mac</h3>\r\n<br />\r\nIn ‌macOS Monterey‌, you can ‌<a href=\"https://www.macrumors.com/guide/airplay/\">AirPlay</a>‌ content from an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> straight to your Mac, or even from one Mac to another Mac. Start playing a song/podcast or video on your ‌‌iPhone‌‌ or ‌‌iPad‌‌, tap the ‌AirPlay‌ icon in the app's media playback interface, and then select your Mac from the list of ‌AirPlay‌ devices.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/6-airplay-to-mac.jpg\" />\r\n<br />\r\nIf it's music or a podcast, the audio should start playing through your Mac's speakers or any external speakers connected to your Mac, and you can control playback on your Mac by opening the Control Center. Video should automatically play on your Mac's display in fullscreen mode, and you can control playback directly on your Mac by moving the mouse and selecting the onscreen playback controls.\r\n<br />\r\n\r\n<br />\r\nNote that ‌AirPlay‌ only works on <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> 2018 and later, MacBook Pro 2018 and later, <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> 2019 and later, <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a>, ‌iMac‌ Pro, and <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a> 2019.\r\n<br />\r\n\r\n<br />\r\n<h3>7. Hello Screensaver</h3>\r\n<br />\r\nmacOS 12 includes two new screen savers worth checking out. \"Hello\" is a homage to the original Macintosh that writes the iconic word on the screen in joined-up handwriting, while \"Monterey\" offers simpler slow transitions through hills and valleys in different shades of pink, purple, and blue.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/7-hello-screensaver.jpg\" />\r\n<br />\r\nThe Hello screen saver cycles through various colors, and there are several themes to choose from including <strong>Soft Tones</strong>, <strong>Spectrum</strong>, and <strong>Minimal</strong>. Soft Tones uses the pastel colors introduced with the new iMacs and matching colored text, while Spectrum uses more saturated shades with lighter text. Minimal shows the \"Hello\" wording in black, white, and gray.\r\n<br />\r\n\r\n<br />\r\nBy default, the screen saver will display \"Hello\" in multiple languages, but you can force it to use only your native language by toggling off <strong>Show 'hello' in all languages</strong> in the <strong>Screen Saver Options</strong>. A <strong>match system appearance toggle</strong> is also available for use to match light and dark mode preferences.\r\n<br />\r\n\r\n<br />\r\n<h3>8. Convert Image Quick Action</h3>\r\n<br />\r\nConvert Image is a new pre-installed Quick Action in Finder that can quickly convert an image file from one format (JPG, HEIC and PNG) to another. It also lets you change the file size (small, medium, large, or actual size) and lets you choose whether to keep the file's metadata in the converted image.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/8-convert-image.jpg\" />\r\n<br />\r\nTo use the Convert Image Quick Action, right-click (or Ctrl-click) an image file and then select <strong>Quick Actions -&gt; Convert Image</strong>. Choose your settings in the dialog that appears, then hit <strong>Convert</strong>. You'll also see the Quick Action in the Finder preview pane when viewing images.\r\n<br />\r\n\r\n<br />\r\n<h3>9. Create a Safari Tab Group</h3>\r\n<br />\r\nTab Groups in Safari aim to make organizing and preserving your open browser tabs more manageable without having to have those tabs active. They offer a way to easily save and manage related tabs, such as those used when planning trips or shopping, or groups can be used to store the tabs you visit daily.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/9-tab-groups.jpg\" />\r\n<br />\r\nTo create a new Tab Group, click the <strong>Show Sidebar</strong> icon next to the traffic lights and then select <strong>New Tab Group</strong>. (Alternately, click the down arrow next to the <strong>Show Sidebar</strong> icon and select either <strong>New Empty Tab Group</strong> or <strong>New Tab Group With X Tabs</strong>, \"X\" being the number of tabs currently open. Any Tab Groups you create are listed in the sidebar for easy switching.\r\n<br />\r\n\r\n<br />\r\n<h3>10. Change QuickTime Playback Speed</h3>\r\n<br />\r\nIn macOS, you can now adjust the playback speed of video in Apple's native QuickTime Player. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/10-quicktime-playback-speed.jpg\" />\r\n<br />\r\nSimply click the chevrons in the bottom-right corner of the media controls overlay and select your preferred speed from 0.5x to 2.0x.\r\n<br />\r\n\r\n<br />\r\n<h3>11. Compact Safari Tab Bar</h3>\r\n<br />\r\nIn early beta versions of macOS, Apple introduced a default compact and unified Safari design that did away with the dedicated URL and search interface, instead letting any individual tab be used for navigation input. The design caused an outcry from many users, which led Apple to walk back the change and reinstate the original design in which the URL/search bar sits at the top of the Safari window, with your tabs arranged below it. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/11-compact-tabs-bar.jpg\" />\r\n<br />\r\nHowever, if you liked the Compact tab bar design, you can find it as an option in <strong>Safari -&gt; Preferences...</strong>. Click the <strong>Tabs</strong> tab and select <strong>Tab Layout: Compact</strong> to turn on the original compact tab bar that merged everything together.\r\n<br />\r\n\r\n<br />\r\n<h3>12. Erase Contents and Settings</h3>\r\n<br />\r\nFollowing in the footsteps of the ‌iPhone‌ and ‌iPad‌, Apple silicon Macs and Intel Macs with a T2 security chip (2017-2020 models) now have an \"Erase All Content and Settings\" option available in ‌macOS Monterey‌.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/12-erase-content-settings.jpg\" />\r\n<br />\r\nNot only does this effectively erase all user data and user-installed apps from your Mac without reinstalling macOS, it also signs out your <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a>, removes your <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a> fingerprints, purchases, and all Apple Wallet items, and turns off <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> and Activation Lock, making it far easier to restore your Mac to like-new factory settings.\r\n<br />\r\n\r\n<br />\r\nClick the<strong> Apple () symbol</strong> in the menu bar and select <strong>System Preferences...</strong>. When the preferences pane appears, select <strong>System Preferences -&gt; Erase All Content and Settings</strong> from the menu bar, and then follow the onscreen instructions provided by the Erase Assistant.\r\n<br />\r\n\r\n<br />\r\n<h3>13. Low Power Mode</h3>\r\n<br />\r\nIn ‌macOS Monterey‌, Low Power Mode reduces the system clock speed and the display brightness of your Mac in order to extend battery life. So if you're doing less intensive tasks like watching videos or browsing the web, you can turn it on to eke even more out of your Mac's battery.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/13-low-power-mode.jpg\" />\r\n<br />\r\nOpen <strong>System Preferences</strong> and click the <strong>Battery</strong> pane. Then, in the sidebar, select <strong>Battery</strong>, and check the box next to <strong>Low power mode</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>14. Turn Off Shared With You for Specific Contacts</h3>\r\n<br />\r\nIn the Messages app, there's a new \"Shared with You\" feature that takes content you've received in Messages and makes it available in the relevant app on your Mac. So if someone shares an <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> song with you, for example, the song will be listed in the For You section of ‌Apple Music‌. Similarly, if someone shares a website link, it shows up in the \"Shared with You\" section of the Safari start page.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/14-turn-off-shared-with-you.jpg\" />\r\n<br />\r\nYou may not want content shared by a particular person appearing in other apps, in which case you can turn it off for individual contacts. To do so, select the conversation thread in Messages, click the <strong>info (i) icon</strong> in the top-right corner, and uncheck the box next to <strong>Show in Shared with You</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>15. Add Links to Quick Notes</h3>\r\n<br />\r\nMonterey includes a new productivity feature called Quick Notes that offers a quicker way to jot down things without you having to go in and out of the Notes app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/15-add-link-quick-notes.jpg\" />\r\n<br />\r\nQuick Notes can also detect the app you're currently using or that you just recently used, and provides a dropdown menu at the top of the editor window from which you can add a link to the specific message you're viewing in Mail, or the website you were just viewing in Safari, for example. When a note includes such a link, you can just click the link and you'll be taken directly to the related content.\r\n<br />\r\n\r\n<br />\r\n<h3>16. Memoji User Profile</h3>\r\n<br />\r\nIn ‌macOS Monterey‌, you can use an animated Memoji as your Mac user profile instead of a standard static image. Go to <strong>System Preferences -&gt; Users &amp; Groups</strong>, and then hover your pointer over the circled profile picture and click <strong>edit</strong>. There you'll find a full gallery of Memoji characters, including any you've made yourself, and you can customize them in various ways, right down to the frames of their glasses and the clothes they're wearing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/16-memoji-user-profile.jpg\" />\r\n<br />\r\nNext time you log in to your Mac, you'll see your animated Memoji avatar there to welcome you. And if you get your login password wrong a few times, just watch the expression on their face go from mildly irritated to irate. If you leave them hanging, they may even take a nap...\r\n<br />\r\n\r\n<br />\r\n<h3>17. Select Text in Quick Look Previews</h3>\r\n<br />\r\nInvoked with a press of the spacebar, Quick Look is a great way to swiftly preview files in Finder without opening them in their associated app or the dedicated Preview app. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/17-quick-look-text-selection.jpg\" />\r\n<br />\r\nFor whatever reason, Apple in previous versions of macOS removed the ability to select text in a document when viewed in Quick Look for copying/pasting elsewhere. In Monterey, however, this ability has quietly, and happily, been reinstated. Not only that, Apple's Live Text feature means the text you select needn't be in a document – you can also highlight text displayed in a photo and perform different tasks on it, such as translation and web search.\r\n<br />\r\n\r\n<br />\r\n<h3>18. Blur Your Background on a FaceTime Call</h3>\r\n<br />\r\nIn ‌macOS Monterey‌, Apple has brought several enhancements to ‌FaceTime‌, including Portrait mode in video calls. With this mode enabled, you can blur your background so that the focus is on you rather than what's behind you.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/18-facetime-portrait-mode.jpg\" />\r\n<br />\r\nTo enable it, open ‌FaceTime‌, then click the Control Center icon in the menu bar and select <strong>Video Effects -&gt; Portrait Mode</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>19. Add Shortcuts as Quick Actions</h3>\r\n<br />\r\nThanks to the introduction of the Shortcuts app to macOS, you can now add shortcuts as Quick Actions to execute in Finder. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/19-shortcuts-quick-actions.jpg\" />\r\n<br />\r\nSimply launch the Shortcuts app, and then drag shortcuts from <strong>All Shortcuts</strong> to <strong>Quick Actions </strong>in the sidebar. You can then make the shortcuts accessible in Finder's right-click contextual menu by checking them in <strong>System Preferences -&gt; Extensions -&gt; Finder</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>20. Maps Interactive Globe</h3>\r\n<br />\r\nIn Monterey, Apple has enhanced the Maps app to include a new globe view that allows you to spin the world around and zoom into different regions on Earth.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/20-maps-interactive-globe.jpg\" />\r\n<br />\r\nIn previous versions of Maps, zooming out would present you with a flat world map, but the new globe view gives you a three-dimensional view of Earth from space that's a lot more fun to navigate. You can drill down into areas, where you'll find more detailed information on vast geological features like mountain ranges, deserts, forests, and oceans.\r\n<br />\r\n\r\n<br />\r\n<h3>21. FaceTime Links</h3>\r\n<br />\r\nIn Monterey, you can enable anyone, even if they don't have an Apple device, to join a ‌FaceTime‌ call with you by creating a link to a ‌‌FaceTime‌‌ conversation that can be shared anywhere. Using this new link facility, friends and family members who do not have an Apple account can log into a ‌‌FaceTime‌‌ call with you using a web browser opened on any non-Apple device, whether that's a Windows PC or an Android phone.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/21-facetime-links.jpg\" />\r\n<br />\r\nSimply click <strong>Create Link</strong> in the ‌FaceTime‌ interface, and then select a method of sharing your link from the Actions menu, e.g. over Messages or Mail. Once you've sent the link and the recipient opens it, they'll be directed to a webpage where they can enter their name to join the conversation. Once they've joined the call, they'll have the usual ‌‌FaceTime‌‌ options to mute their microphone, disable video, switch the camera view, and leave the call.\r\n<br />\r\n\r\n<br />\r\n<h3>22. Spot Mic and Camera Access</h3>\r\n<br />\r\nWhen an app is using the camera or the microphone on your ‌Mac‌, a small indicator light will appear in the menu bar just next to the Control Center icon (if you have the menu bar hidden, it'll appear in the top-right corner of the desktop). \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/22-mic-camera-access.jpg\" />\r\n<br />\r\nLike in iOS, a green dot means an app is currently using the camera, while an orange dot means an iOS app is currently using the microphone. If you click the Control Center, you'll see which app is responsible for using the camera or mic. This way, they can't be accessed in the background without your knowledge, and you can be sure that apps aren't sneakily recording conversations or videos.\r\n<br />\r\n\r\n<br />\r\n<h3>23. Offline Dictation</h3>\r\n<br />\r\nKeyboard dictation on Apple silicon Macs now protects user privacy by performing general dictation processing on-device, meaning it's completely offline. (Dictated search requests remain server-based, however.) And thanks to on-device dictation, users with Apple silicon Macs can also dictate text of any length without a timeout.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/23-keyboard-dictation.jpg\" />\r\n<br />\r\nWith keyboard dictation, you can dictate text anywhere you can type it, and the feature improves the more you use it, personalizing over time. The <strong>Start Dictation</strong> command can be found in the <strong>Edit</strong> menu of text-based apps.\r\n<br />\r\n\r\n<br />\r\n<h3>24. Full Keyboard Access</h3>\r\n<br />\r\nApple has expanded its Full Keyboard Access options so that you don't have to use a mouse or trackpad to use your Mac. These settings can be found in <strong>System Preferences -&gt; Accessibility -&gt; Keyboard</strong>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/24-full-keyboard-access.jpg\" />\r\n<br />\r\nWith Full Keyboard Access enabled, the item on the screen that has focus is highlighted. You can customize the color, contrast and size of the highlight using the <strong>Options</strong> in the <strong>Navigation</strong> tab. When Full Keyboard Access is turned on, you can quickly show the Full Keyboard Access shortcuts by pressing Tab-H, then using the arrow keys to navigate the lists.\r\n<br />\r\n\r\n<br />\r\n<h3>25. View File Path</h3>\r\n<br />\r\nIn Finder, you can now press the <strong>Option</strong> key while holding the pointer over a file or folder to momentarily show the path bar, so you can easily see where the file or folder is located. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/25-view-file-path.jpg\" />\r\n<br />\r\nYou can also <strong>right-click</strong> (Ctrl-click) a folder in the path bar to open it in Terminal, or copy the file path to that folder. Lastly, you can also <strong>Shift-click</strong> a folder to see or navigate to any subfolders in the same directory.\r\n<br />\r\n\r\n<br />\r\n<h3>26. Go to Folder Window</h3>\r\n<br />\r\nIt's easy to miss, but Monterey includes an enhanced version of the Go to Folder menu bar option in Finder (<strong>Go -&gt; Go to Folder...</strong>).\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/26-go-to-folder.jpg\" />\r\n<br />\r\nInstead of a dialog, the command brings up a Spotlight-style floating search bar that features a vastly improved auto-complete engine and even a Recents list.\r\n<br />\r\n\r\n<br />\r\n<h3>27. Add to Quick Note</h3>\r\n<br />\r\nWe've already mentioned Quick Notes' ability to include links to emails, web URLs, and so on. But the <strong>New Quick Note</strong> command deserves special mention when used in conjunction with Safari.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/27-add-to-quick-note.jpg\" />\r\n<br />\r\nHighlight some webpage elements, such as text and images, then right-click (Ctrl-click) and select <strong>New Quick Note/Add to Quick Note</strong>. Now, the next time you click the captured elements in the Quick Note you created, you'll be taken to the original webpage with the highlighted elements still there. You can also reopen the note by clicking on your highlights. \r\n<br />\r\n\r\n<br />\r\n<h3>28. View Shared iCloud Files in Finder</h3>\r\n<br />\r\nThere's a new <strong>Shared</strong> collaboration folder for the Finder sidebar, where you can easily find documents shared with you over <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> or using the collaboration features in Apple's productivity apps. It can display information such as invitation status, the person who last modified the file, and other sharing-related metadata to help you manage your shared files.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/28-icloud-shared.jpg\" />\r\n<br />\r\nTo add/remove the ‌iCloud‌ Shared folder to the Finder sidebar, select <strong>Finder -&gt; Preferences...</strong>, click the <strong>Sidebar</strong> tab, and then click the checkbox next to (‌iCloud‌) <strong>Shared</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>29. Automate a Focus Mode for Specific Apps</h3>\r\n<br />\r\nApple's new Focus feature in Monterey lets you set up your Mac to help you be in the moment and zone in on a single thing. It does this by filtering notifications based on what you're doing, and you can customize Focus modes for specific scenarios, such as when you open particular apps.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/29-automate-focus-mode.jpg\" />\r\n<br />\r\nWhen setting up a Focus mode in <strong>System Preferences -&gt; Notifications &amp; Focus</strong>, click the <strong>+</strong> button at the bottom of the box labeled <strong>Turn On Automatically</strong>, and then select <strong>Add App Based Automation</strong>. You'll then be prompted to select which apps automatically turn on the Focus mode upon launching. \r\n<br />\r\n\r\n<br />\r\n<h3>30. Right-click to Translate Text</h3>\r\n<br />\r\nThe Translate feature from Safari is available system-wide in ‌macOS Monterey‌. Just select some text and right-click (Ctrl-click) to bring up the <strong>Translate</strong> option, which works with several languages.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/30-translate.jpg\" />\r\n<br />\r\nNot only can you read and copy the translated text, click the <strong>play</strong> button and you can get macOS to say it out loud to you so that you can better understand the verbal pronunciation.\r\n<br />\r\n\r\n<br />\r\n<h3>31. Change Playback Speed and Skip Silences in Voice Memos</h3>\r\n<br />\r\nApple has added a couple of welcome features to the Voice Memos app. You can now opt to automatically skip silences in recordings during playback, and also change the playback speed.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/31-voice-memos-playback-speed.jpg\" />\r\n<br />\r\nSimply select an audio recording, click the controls icon in the top-right corner of the window, and you'll find both settings under \"Playback Speed.\"\r\n<br />\r\n\r\n<br />\r\n<h3>32. Spatialize Stereo Effect</h3>\r\n<br />\r\nApple has included a new audio feature called \"Spatialize Stereo\" that takes any non-Dolby stereo mix and creates a virtual spatial audio environment out of it. To access it, connect a pair of <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> or <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a> headphones to your Mac and start playing some audio. Next, click the Control Center icon in the menu bar, and then click the <strong>Sound</strong> volume bar. You should see the option to <strong>Spatialize Stereo</strong> in the dropdown beneath your headphones. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/32-spatialize-stereo.jpg\" />\r\n<br />\r\nNote that Spatialize Stereo is different from Spatial Audio. Spatial Audio with support for Dolby Atmos creates a three-dimensional experience by moving sound all around you. Spatialize Stereo on the other hand is Apple's attempt to simulate the effect of having sound coming at you from different directions in a virtual environment. It doesn't utilize Dolby Atmos, but it works with basically any content. \r\n<br />\r\n\r\n<br />\r\n<h3>33. Automatic Window Resizing</h3>\r\n<br />\r\nMonterey is a lot more display-aware than previous versions of macOS, and will automatically resize a window to fit a secondary screen. This means you don't need to manually reduce the size of a window to fit it onto a smaller display, for example.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/33-window-resizing.jpg\" />\r\n<br />\r\nThe automation works both when you drag a window manually to another display or click-hold on the <strong>green traffic light</strong> in the top-left corner of the window to select another connected display. Note that the window options in the green traffic light menu also include tiling windows for hassle-free Split View management when working with two apps open side by side.\r\n<br />\r\n\r\n<br />\r\n<h3>34. Always Show Full-screen Menu Bar </h3>\r\n<br />\r\nIn previous versions of macOS, launching an app in fullscreen mode automatically hides the menu bar, which means that you have to hover the mouse pointer over the top of the screen to reveal it. However, in Monterey, you can force the menu bar to always remain visible in fullscreen mode, along with all its menus and items.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/34-force-menu-bar-fullscreen.jpg\" />\r\n<br />\r\nTo do so, go to <strong>System Preferences -&gt; Dock &amp; Menu Bar</strong>, and in the <strong>Dock &amp; Menu Bar</strong> options, uncheck the box next to <strong>Automatically hide and show the menu bar in full screen</strong>.\r\n<br />\r\n\r\n<br />\r\n<h3>35. Import Photo Libraries</h3>\r\n<br />\r\nThe ‌Photos‌ app has been updated in Monterey to enable the importing of photos from another ‌Photos‌ library. To do so, select <strong>File -&gt; Import...</strong> from the menu bar to bring up a file browser window.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/35-import-photo-libraries.jpg\" />\r\n<br />\r\nOnce you've selected the ‌Photos‌ library, you can review its contents before importing it into your main library. \r\n<br />\r\n\r\n<br />\r\n<h3>36. Control HomeKit Devices From Menu Bar</h3>\r\n<br />\r\nWith the Shortcuts app coming over to Mac from iOS, you can now add specific shortcuts to different parts of macOS. We've already mentioned that you can make them available as Quick Actions in Finder, but you can add them to your menu bar, too.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/36-menu-bar-homekit.jpg\" />\r\n<br />\r\nWhen you've dragged some shortcuts into the <strong>Menu Bar</strong> section of the Shortcuts app, a new menu item will appear in the menu bar listing those shortcuts, allowing you to control <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> devices from your desktop, for example.\r\n<br />\r\n\r\n<br />\r\n<h3>37. Change MacBook Pro Refresh Rate</h3>\r\n<br />\r\nIf you have a 14-inch or 16-inch MacBook Pro, you can adjust the refresh rate of the Liquid Retina XDR display, which is useful if you want to match it to video content you might be editing. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/37-change-refresh-rate.jpg\" />\r\n<br />\r\nGo to <strong>System Preferences -&gt; Displays</strong>, and then click the <strong>Display Settings...</strong> button. If you're using an external monitor, select your MacBook Pro's built-in Liquid Retina XDR display in the side column, then click the dropdown next to Refresh Rate and choose from the following: 120Hz (ProMotion), 60 Hertz, 59.94 Hertz, 50 Hertz, 48 Hertz, and 47.95 Hertz.\r\n<br />\r\n\r\n<br />\r\n<h3>38. Use Tags in Notes and Reminders</h3>\r\n<br />\r\nBoth the Reminders and Notes apps support tags, a much-requested feature that means you can now use hashtags to help you organize your notes and reminders and find stored notes and to-dos more easily. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/38-tags-notes-reminders.jpg\" />\r\n<br />\r\nTags can be a powerful method of organization, because there's no limit to how many you can have, and a single note or reminder can include multiple tags, so the same note/reminder can show up in different tagged categories that you've created (something Smart Folders are useful for generating). Also, when you input a hash symbol, macOS will conveniently suggest existing tags for you to pick below the cursor.\r\n<br />\r\n\r\n<br />\r\n<h3>39. Turn On Private Relay</h3>\r\n<br />\r\nIn Monterey, Apple introduced ‌iCloud‌ Private Relay for Mac, a feature of all ‌‌iCloud‌‌+ paid plans that's designed to encrypt all of the traffic leaving your computer so no one can intercept it or read it. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/39a-private-relay.jpg\" />\r\n<br />\r\nPrivate Relay works by sending web traffic to a server that is maintained by Apple to strip the IP address. Once the IP info has been removed, Apple sends the traffic to a second server maintained by a third-party company that assigns a temporary IP address and then sends the traffic to its destination, a process that prevents your IP address, location, and browsing activity from being used to create a profile about you.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/39-private-relay.jpg\" />\r\n<br />\r\nThe checkbox to enable Private Relay can be found in <strong>System Preferences -&gt; Apple ID</strong>, and you can also turn it on and off for individual networks in the <strong>Network</strong> preference pane (shown above). Once ‌‌iCloud‌‌ Private Relay is enabled, you can choose how the assigned IP address uses geographical information to conceal your actual location. If you still want to receive local content when you're browsing in Safari, the IP address can maintain your general location without being specific (the default setting), or if you want the relay to be more private, the IP address can simply include your country and time zone.\r\n<br />\r\n\r\n<br />\r\n<h3>40. Resume Copy in Finder</h3>\r\n<br />\r\nIn Finder, Apple has made it easier to know how long copying files will take, thanks to a new pie chart progress indicator. What's more, it's also added the ability to start or pause a long copy and resume it at a later time.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/12/40-resume-copy.jpg\" />\r\n<br />\r\nIf you cancel a copy midway through, a ghosted version of the file or folder will remain in the destination location. Just click it and you'll be given the option to <strong>Finish Copying</strong> it, or you can <strong>Keep the Resumable Copy</strong> for finishing the transfer at a later time. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-monterey.234\">macOS Monterey</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/macos-monterey-tips/\">macOS Monterey: 40 Tips, Tricks, and Features You Might Have Missed</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macos-monterey-40-tips-tricks-and-features-you-might-have-missed.2325942/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vW_ucfnQhDo:ma66LjD1hJ0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=vW_ucfnQhDo:ma66LjD1hJ0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"745fb98499d61733067d6b84f5bd0c49df5706fbf49ce85304ea55896af0b58b","category":"Apple"}