{"title":"242 Comparison of GnRH administration day in the 7&amp;7 Synch versus 8&amp;6 Synch Protocol for fixed-timed artificial insemination in beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_2/192/7664987?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The research aimed to investigate the impact of reducing the time interval for progesterone exposure on the ovulatory follicle just before performing fixed-timed artificial insemination (FTAI). This was achieved by adjusting the timing of administering a gonadotropin-releasing hormone agonist (GnRH; specifically, 100 µg gonadorelin, known as Cystorelin). The study assessed the effectiveness of two estrous synchronization protocols, the “7 &amp; 7 Synch” and a modified protocol, by examining estrus expression (EE) and the resulting pregnancy rates (PR) following FTAI. The research utilized frozen conventional Angus semen from Select Sires, Inc. (Plain City, OH), and involved 66 Angus-cross heifers from the beef cattle research unit near Fayetteville at the University of Arkansas. To ensure consistency, the heifers were divided into two treatment groups based on their cyclicity status (CYC) and age. CYC status was determined by assessing a reproductive tract score (RTS) 1 wk before the synchronization process. RTS scores ranged from 1 to 5, with RTS 1-3 indicating pre- or peripubertal status and scores of 4 and 5 indicating cycling. Heifers with an RTS of 1 and 2 were excluded from the study before synchronization commenced. Both treatment groups involved the insertion of a controlled internal drug-releasing device (CIDR; specifically, Eazi-breed, containing 1.38 g of progesterone) into the vagina on d -14. Simultaneously, a prostaglandin F2α analogue (PGF; 500 µg cloprostenol sodium, known as Synchsure) was administered. In the first treatment group (7&amp;7), GnRH was administered on d -7, while in the second group (8&amp;6), GnRH was given on d -6. In both cases, PGF was administered on d 0 when the CIDR was removed, precisely 72 ± 1 h before FTAI, along with another dose of GnRH. Estrus expression (EE) was assessed during FTAI by examining Estrotect patches (Rockway Inc., Spring Valley, WI). EE was considered present when a patch had 50% or more of its color rubbed off, and it was deemed absent when less than 50% of the color had worn off. Pregnancy rates (PR) were determined through ultrasound examination on d 55. EE and PR were analyzed by treatment using the GLIMMIX procedure on SAS 9.4 (SAS Institute Inc., Cary, NC). Statistical differences were declared at α ≤ 0.05 and tendencies declared between 0.05 &lt; <span>P</span> ≤ 0.1. Heifers on the 8&amp;6-d protocol had greater rectal temperatures at breeding compared with 7&amp;7-d heifers (<span>P</span> &lt; 0.0001). AI pregnancy rates were greater in heifers on the 8&amp;6-d protocol compared with the heifers on 7&amp;7-d protocol (<span>P</span> = 0.625) with average pregnancy rates of 39.4% and 30.3%, respectively. Overall, pregnancy rate was greater as well for the 8&amp;6-d heifers compared with the 7&amp;7-d heifers (<span>P</span> = 0.044), with mean overall pregnancy rates of 78.8% and 54.5%, respectively.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"746517d7f437ca66647ecf61ca330d4a78f2b398b14d90d448a2e8ac959de378","category":"Environment"}