{"title":"Expression of dehydroshikimate dehydratase in poplar induces transcriptional and metabolic changes in the phenylpropanoid pathway","link":"https://academic.oup.com/jxb/article/75/16/4960/7684934?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Modification of lignin in feedstocks via genetic engineering aims to reduce biomass recalcitrance to facilitate efficient conversion processes. These improvements can be achieved by expressing exogenous enzymes that interfere with native biosynthetic pathways responsible for the production of the lignin precursors. <span>In planta</span> expression of a bacterial 3-dehydroshikimate dehydratase in poplar trees reduced lignin content and altered the monomer composition, which enabled higher yields of sugars after cell wall polysaccharide hydrolysis. Understanding how plants respond to such genetic modifications at the transcriptional and metabolic levels is needed to facilitate further improvement and field deployment. In this work, we acquired fundamental knowledge on lignin-modified poplar expressing 3-dehydroshikimate dehydratase using RNA-seq and metabolomics. The data clearly demonstrate that changes in gene expression and metabolite abundance can occur in a strict spatiotemporal fashion, revealing tissue-specific responses in the xylem, phloem, or periderm. In the poplar line that exhibited the strongest reduction in lignin, we found that 3% of the transcripts had altered expression levels and ~19% of the detected metabolites had differential abundance in the xylem from older stems. The changes affected predominantly the shikimate and phenylpropanoid pathways as well as secondary cell wall metabolism, and resulted in significant accumulation of hydroxybenzoates derived from protocatechuate and salicylate.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"746cbd0092aa8903cfcf83adb3b88e595184903f733bdf25c223aa67467663fd","category":"Environment"}