{"title":"Rocket Report: Iran reaches orbit; Chinese firm achieves impressive landing test","link":"https://arstechnica.com/?p=1998963","date":1706270412000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/1705954208960-800x577.jpg\" alt=\"First and second stages of Blue Origin's &quot;New Glenn&quot; test vehicle.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/1705954208960.jpg\">Enlarge</a> <span>/</span> First and second stages of Blue Origin's \"New Glenn\" test vehicle. (credit: Blue Origin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.28 of the Rocket Report! There's a lot going on in the world of launch as always, but this week I want to take this space for a personal message. I have just announced the forthcoming publication of my second book, <em>REENTRY</em>, on the Falcon 9 rocket, Dragon spacecraft, and development of reusable launch. <a href=\"https://www.penguinrandomhouse.com/books/759707/reentry-by-eric-berger/\">Full details here</a>. I worked very hard to get the inside story.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Europe seeks to support small launch companies</strong>. The European Space Agency and European Commission have selected five launch companies to participate in a new program to provide flight opportunities for new technologies, a sign of a greater role the European Union intends to play in launch, <a href=\"https://spacenews.com/esa-and-eu-collaborate-on-launch-initiative/\">Space News reports</a>. The effort seeks to stimulate demand for European launch services by allowing companies to compete for missions in the European Union’s In-Orbit Demonstration and Validation technology program. Proposals for the program's first phase are due to ESA at the end of February.</p></div><p><a href=\"https://arstechnica.com/?p=1998963#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998963&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"746d613579f70b3b374333386eda1a3589ba572b80f1ce9840e88fae4c160293","category":"Tech"}