{"title":"High-Resolution Melting Analysis Potential for Saccharomyces cerevisiae var. boulardii Authentication in Probiotic-Enriched Food Matrices","link":"https://www.preprints.org/manuscript/202409.0492/v1","date":1725586871000,"content":"Since the mid-1990s probiotics have been proven to support the treatment of several gastrointestinal diseases. Additionally, probiotics have been taken as a common panacea for civilization diseases. To date, the only probiotic yeasts with evidence of health-promoting effects are Saccharomyces cerevisiae var. boulardii. The probiotic properties are strain-dependent, whereby it is crucial to develop methods to verify the probiotic-enriched food authentication including the growing number of dietary supplements with simplified commercialisation procedures. Due to the significant genetic similarity of S. cerevisiae var. boulardii to S. cerevisiae, qPCR-HRM analysis was tested, which has a very high sensitivity for polymorphism detection and enables simultaneous identification of the microorganism in the presence of the reference sample. The effectiveness of interspecies primer pairs and intragenus primer pairs designed to amplify heterogeneous regions was examined. HRM analysis using primers for 18SrRNA and ITS allowed for identification of S. cerevisiae var. boulardii at the species level. S. cerevisiae var. boulardii was efficiently identified at the variety level with amplification of HO and RPB2 in the single- and multi-component DNA extracts. The RPB2 amplicon showed the highest intraspecies differentiation power. The predominance of S. cerevisiae var. boulardii in the mixtures tested was crucial for identification using qPCR-HRM analysis and quantitatively corresponded to the strain content in the probiotic-enriched food matrices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"74899b9b8ff23a7d408522c659a53e7235ae2856c1141bdd6c7de8d41ba9fd12","category":"Interdisciplinary"}