{"title":"Productivity versus environmental sustainability: A broadscale assessment of freshwater aquaculture's technical efficiency and ecological efficiency in China's inland provinces","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13057?af=R","date":1709962791000,"content":"<h2>Abstract</h2>\n<p>Promoting the productivity and environmental sustainability of aquaculture is critical in ensuring its healthy development. This study assesses freshwater aquaculture's technical efficiency and ecological efficiency in China's 19 inland provinces from 2008 to 2019, aiming to reveal its productivity and environmental sustainability status. We employ the three-stage Data Envelopment Analysis-CCR (T-DEA-CCR) and three-stage Slack-Based Measure-DEA (T-SBM-DEA) methods to explore the technical efficiency and the ecological efficiency while accounting for environmental conditions and random errors. The average technical efficiency and ecological efficiency during 2008–2019 are 0.857 and 0.702, respectively, indicating substantial scope for enhancing the productivity and environmental sustainability of China's inland aquaculture. We further investigate the regional development using the club convergence, finding that the provincial-level technical efficiencies have already achieved population convergence while the ecological efficiencies diverge into two clubs, suggesting that Chinese freshwater aquaculture's productivity and environmental sustainability have different development pathways. Acknowledging the pivotal roles of environmental protection and growers' training in aquaculture's productivity and environmental sustainability, policymakers may institute funding and recognition to foster the adoption of innovative, environmentally responsible practices by operators.</p>","author":"Zhina Wang, \nXuan Chen, \nLongzhong Shi, \nXiaoheng Zhang, \nYijuan Hu","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"748b11655c06d5c22e48a8745ae96aa40b6659861c13ece02c105a71db8201f6","category":"Environment"}