{"title":"Meet this unique, compact Android phone from a Japanese toaster company","link":"https://arstechnica.com/?p=1813307","date":1637089896000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/3-1-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/3-1.jpg\">Enlarge</a> <span>/</span> The Balmuda Phone. It's designed to be held.  (credit: Balmuda)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's not every day you see a smartphone launch that truly looks like something new and different, but say hello to the \"<a href=\"https://tech.balmuda.com/jp/phone/\">Balmuda Phone</a>.\" This is a unique, compact little Android phone, totally out of left field, from a<em> luxury Japanese toaster maker.</em> You can't make this stuff up.</p>\n<p>Usually, these \"random company made a smartphone\" stories are all the same and involve calling up a turnkey smartphone manufacturer and getting a generic phone made. These turnkey smartphone operations have brought us wonderful products, like the <a href=\"https://www.theverge.com/circuitbreaker/2017/7/12/15958242/huawei-kfc-special-edition-smartphone-colonel-sanders\">KFC phone</a> or the <a href=\"https://www.youtube.com/watch?v=x9jj9E3UnhE\">Pepsi P1</a>, but that's not what Balmuda is doing here. The company made a phone because it has a new idea for a phone, with a focus on a compact, rounded-over design rather than the huge slab rectangles that dominate smartphone design. It's a phone designed around human hands and not the rectangle-shaped components that make up a phone.</p>\n<p>To quote the website (through Google Translate) the company says: \"The Balmuda Phone was designed for a shape that fits naturally in your hand. To achieve this, not only is the back curved, but the shape when viewed from the front is actually wrapped in a gentle curve—even the display. In other words, the <span>Balmuda Phone</span> is the only smartphone whose proportions do not include any straight lines.\"</p></div><p><a href=\"https://arstechnica.com/?p=1813307#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1813307&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7496584415af0ef82d4aaf9cc46f1e4d3668e8c847e60e0270091d6e2d19699e","category":"Tech"}