{"title":"Supercritical CO2 fluid extract from Stellariae Radix ameliorates 2,4‐dinitrochlorobenzene‐induced atopic dermatitis by inhibit M1 macrophages polarization via AMPK activation","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24145?af=R","date":1713250800000,"content":"<h2>Abstract</h2>\n<p>Yin chai hu (Radix Stellariae) is a root medicine that is frequently used in Chinese traditional medicine to treat fever and malnutrition. In modern medicine, it has been discovered to have anti-inflammatory, anti-allergic, and anticancer properties. In a previous study, we were able to extract lipids from Stellariae Radix using supercritical CO<sub>2</sub> extraction (SRE), and these sterol lipids accounted for up to 88.29% of the extract. However, the impact of SRE on the development of atopic dermatitis (AD) has not yet been investigated. This study investigates the inhibitory effects of SRE on AD development using a 2,4-dinitrochlorobenzene (DNCB)-induced AD mouse model. Treatment with SRE significantly reduced the dermatitis score and histopathological changes compared with the DNCB group. The study found that treatment with SRE resulted in a decrease of pro-inflammatory cytokines TNF-α, CXC-10, IL-12, and IL-1β in skin lesions. Additionally, immunohistochemical analysis revealed that SRE effectively suppressed M1 macrophage infiltration into the AD lesion. Furthermore, the anti-inflammatory effect of SRE was evaluated in LPS + INF-γ induced bone marrow-derived macrophages (BMDMs) M1 polarization, SRE inhibited the production of TNF-α, CXC-10, IL-12, and IL-1β and decreased the expression of NLRP3. Additionally, SRE was found to increase p-AMPK<sup>T172</sup>, but had no effect on total AMPK expression, after administration of the AMPK inhibitor Compound C, the inhibitory effect of SRE on M1 macrophages was partially reversed. The results indicate that SRE has an inhibitory effect on AD, making it a potential therapeutic agent for this atopic disorder.</p>","author":"Wei Wu, \nLe Song, \nHong Wang, \nLu Feng, \nZhenkai Li, \nYanqing Li, \nLe Li, \nLi Peng","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"749e97e6af0ae9aea18cd1395ce9dd5e6c100f5038f9829a857ba2c05dac2edc","category":"Environment"}