{"title":"Muc-Off’s new powdered bike wash is plastic-free and BYO-water","link":"https://cyclingtips.com/2021/07/muc-offs-new-powder-bike-wash-is-plastic-free-and-byo-water/","date":1627606276000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Muc-Off-punk-powder-650x366.jpg\" /></div><h2>Muc-Off's new powdered bike wash is plastic-free and BYO-water</h2><p>\n</p><p>Spray-on bike wash products have long been popular for sprucing up muddied bikes. British company Muc-Off arguably helped kick off the category by creating a spray-on surfactant wash for the mountain bike world, and since then we’ve seen just about every other bicycle maintenance brand offer a competing product to assist with hosing off a bike. </p>\n\n\n\n<p>However, almost all of these products contain a high percentage of water that is being shipped around the world in plastic containers. And while some brands offer a more eco-friendly concentrate that you dilute yourself, even these are typically stored in single-use plastic. </p>\n\n\n\n<p>Muc-Off recently announced a plan to save 200 tonnes of plastic by 2023, and the company’s all-new Punk Powder sachets that turn water into bike wash are a big part of this strategy. I guess it gives a new meaning to “greenwashing”. </p>\n\n\n\n<p>The hot-pink-branded company claims that its Punk Powder is the world’s first plastic-free bike cleaner. The product provides two small 30 g powder sachets which each make up 1 litre of cleaner by adding water. According to the company, Punk Powder uses 92% less packaging than the equivalent 2 litres of regular bike cleaner. </p>\n\n\n\n<p>Punk Powder (the name pains me to write) is said to be made from biodegradable ingredients, three-quarters of which are plant-based. It’s apparently also vegan, but there’s no word if it’s gluten-free. </p>\n\n\n\n<p>The packaging is equally eco-conscious, too. “The packaging is 100% plastic-free and petroleum-free and is made from more than 50% renewable raw materials, with vegetable-based inks used for printing on the packaging”, reads the press release. “Each sachet is compostable and certified to EN 13432 standard, so riders can enjoy conscience-free cleaning. The two sachets come packed in a recycled FSC card box, which even comes with instructions for converting it into a handy funnel, so no powder will go to waste.” </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Muc-Off-punk-powder-1-1340x754.jpg\" /><figcaption>While it could just be me and my childhood love for coloured sherbet, that packaging sure makes Punk Powder look like a tasty candy. Best to keep it away from children and adult-children. </figcaption></figure>\n\n\n\n<p>Using the powder is as simple as filling up a pre-existing 1-litre cleaner bottle, adding one sachet of powder, and shaking. Don’t have a suitable trigger spray bottle? Muc-Off has a new aluminium spray bottle (shown above) that will be available as a bundle with the powder for £30 (US$42 / AU$57). Two sachets of Punk Powder are priced at £15 (US$21 / AU$28). </p>\n\n\n\n<p>The idea of a powder-based cleaner is seemingly new to the cycling world, but it’s almost the status-quo with self-service car wash stations that typically add a powdered detergent to water tanks. This product won’t change the world, but shipping less water around the world sure seems like a positive step. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/muc-offs-new-powder-bike-wash-is-plastic-free-and-byo-water/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"749f7336a8067a7441a31b4e4b0236472ec4240ea5f89f58acfd7092153e302b","category":"Cycling"}