{"title":"<i>Enterococcus</i> spp. in fish: Analysis of the presence and resistance in samples from Tri-City, Poland","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306826","date":1720533600000,"content":"<p>by Anita Kukułowicz, Izabela Steinka, Maria Gardocka</p>\r\n\r\nThe growing concern over antibiotic resistance in foodborne pathogens necessitates comprehensive assessments of its prevalence and associated risks in various food products. The present study aimed to assess the occurrence of <i>Enterococcus</i> spp. in samples of fish purchased at various points of sale in the Tricity region. The selection of products (n = 74) was based on their availability and included both fish caught in the Baltic region and products imported from, Vietnam, China, Norway, and European Union (EU) countries. For bacterial isolation, samples were inoculated into selective broth, and the growth of enterococci was assessed based on turbidity. Positive cultures were confirmed by a change in color in bromocresol purple broth and were isolated on Slanetz-Bartley agar. Bacteria were present in all tested samples regardless of the degree of raw material processing as follows: frozen (F)– 55%, fresh/raw (FS)– 70.6%, thawed (DF)– 30%, smoked (S)– 50%, and the packaging methods, modified atmosphere packaging (MAP)– 34.4%, unit packaging (UP)– 75%, and sold in bulk (SB)– 76.9%, with an overall frequency of occurrence of 58.1%. The number of bacteria ranged from not detected to 4.28-log cfu/g, with the lowest mean values for thawed fish and those packed in MAP. Tests conducted on 24 strains isolated from samples showed their varied sensitivity to tetracyclines. Single cases of multidrug resistance of the tested strains were also observed. The conducted statistical analysis did not show statistically significant differences in the count of enterococci based on the origin, degree of processing, or packaging (p &lt; 0.05). Moreover, differences in strain sensitivity to ampicillin were observed. Detected cases of resistance, especially to tetracycline, require careful monitoring and action to limit the health risks associated with resistant bacterial strains in food products.","author":"Anita Kukułowicz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"74a2382dfc953bba268efc75d08362aa1bfffd3fe6a0dd3b27686b902cb1efda","category":"Interdisciplinary"}