{"title":"‘Pogačar can win everything’: Philippe Gilbert Q&A","link":"https://www.cyclist.co.uk/in-depth/philippe-gilbert-interview","date":1681464309000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/philippe-gilbert-interview\">‘Pogačar can win everything’: Philippe Gilbert Q&amp;A</a></p>\n\n<p>Philippe Gilbert is one of the greatest cyclists of all time, winner of four of the five <a href=\"https://www.cyclist.co.uk/in-depth/all-you-need-to-know-about-the-classics-monuments-cobbles\" target=\"_blank\">Monuments</a> with a podium in the other and wins in all three Grand Tours, and now, having retired at the end of 2022, he’s teamed up with GCN to be their motorbike reporter during races and has a new documentary as part of GCN+’s ‘Legends’ series, which is <a href=\"https://plus.globalcyclingnetwork.com/watch/5120403\" target=\"_blank\">out now</a>.</p>\n\n\n\n<p>We were lucky enough to get some time with Gilbert to discuss retirement, the current state of things in the men’s peloton, <a href=\"https://www.cyclist.co.uk/tags/soudal-quickstep\" target=\"_blank\">QuickStep</a> and <a href=\"https://www.cyclist.co.uk/reviews/classified-powershift-hub-review\" target=\"_blank\">Classified</a>.</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-970x647.jpeg\" alt srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-970x646.jpeg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-300x200.jpeg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-768x512.jpeg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-750x500.jpeg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-465x310.jpeg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-620x413.jpeg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2-350x233.jpeg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-2.jpeg 1000w\" /><figcaption>ASO/Pauline Ballet</figcaption></figure>\n\n\n\n<p><strong>How are you finding life on the Eurosport/GCN motorbike?</strong></p>\n\n\n\n<p>It’s not easy, you still have to fight to get in position and you have to be aware of all the people who don’t really respect the space and sit on the road with kids, with their dogs, things like that. You see so many people not realising the danger, at the <a href=\"https://www.cyclist.co.uk/in-depth/tour-of-flanders-2023-highlights\" target=\"_blank\">Tour of Flanders</a> we passed about 2cm from someone’s head maybe 10/15 times, it’s quite scary because if you hit them at like 60kmh we’d crash but they might die. It’s a lot of stress.</p>\n\n\n\n<p><strong>How has retirement been so far?</strong></p>\n\n\n\n<p>I’ve stayed busy, always working on something and I don’t regret retiring or miss racing. I followed the whole race at Flanders and even after two hours the guys were cooked, there was so much stress and so many crashes happening and I was really happy to not be on the bike.</p>\n\n\n\n<p><strong>Do you have any regrets from your racing career apart from not winning Milan-San Remo?</strong></p>\n\n\n\n<p>Yeah of course San Remo <a href=\"https://www.cyclist.co.uk/in-depth/striving-for-milan-san-remo-philippe-gilbert-profile\" target=\"_blank\">I was trying to win a lot</a> and never succeeded but that’s how it is. I was really close to the pink jersey at the <a href=\"https://www.cyclist.co.uk/tags/giro-ditalia\" target=\"_blank\">Giro d’Italia</a> and I would’ve loved to have had it for at least one day, then I would’ve been leader of the three Grand Tours for at least a day. I won stages in the three Grand Tours but if you can say I won stages and was leader in all three, that would be even more special. I missed it for I think one or two seconds, I was second for maybe a week but I was never able to close the gap.</p>\n\n\n\n<p><strong>How does the level of competition compare now to 10/20 years ago?</strong></p>\n\n\n\n<p>Everything is more. Bikes are faster, the equipment, clothing, helmets, even glasses, shoes, everything is faster and of course the general level of riders is much higher. When I turned pro there were about 50 riders at a high level and the rest were a lot less but now, it’s like, even the last guy is really strong. The general level is really high.</p>\n\n\n\n<figure><img width=\"970\" height=\"538\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-970x538.jpg\" alt=\"philippe_gilbert_profile_01\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-970x538.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-300x167.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-768x426.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-1536x852.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-750x416.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01-1140x633.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/03/06000155/philippe_gilbert_profile_01.jpg 2000w\" /><figcaption>Sean Hardy</figcaption></figure>\n\n\n\n<p><strong>What do you think of Wout van Aert gifting his win to Christophe Laporte at Gent-Wevelgem?</strong></p>\n\n\n\n<p>There was a big reaction to that, I can understand he was happy to give it away, even if it’s a WorldTour race and a big Classic in Belgium, and he was hoping to get even more help from his team in the coming races after doing it, but honestly I think it’s always better when you see guys fighting for a win. Even if they are teammates I think it’s nicer when they really fight like they do in other sports.</p>\n\n\n\n<p><strong>So they should’ve sprinted like SD Worx at Strade Bianche?</strong></p>\n\n\n\n<p>Honestly if I was Laporte I wouldn’t be happy to win like that. If I were in that situation I wouldn’t accept it, I would say, ‘Okay, I understand you want to give it to me but I want to win only from being the best.’</p>\n\n\n\n<p><strong>Now you’re not a rider is there anything you would change to improve races?</strong></p>\n\n\n\n<p>I think all the races are good for the moment, we’re living in a golden age of cycling, it’s hard to imagine it being any better. We’re always seeing the best riders fighting from a long way out, so I don’t think that we even need to try to do it better.</p>\n\n\n\n<p><strong>You have a new documentary as part of the ‘Legends’ series on GCN+, are there any active riders you think are worthy of a ‘Legends’ documentary?</strong></p>\n\n\n\n<p>I think the goal is to have as many documentaries as possible and actually we have a lot of big riders racing today that are already making history. Van Aert deserves one, <a href=\"https://www.cyclist.co.uk/news/tadej-pogacar-greatest-of-all-time\" target=\"_blank\">Tadej Pogačar</a> deserves one, Mathieu van der Poel deserves one, Tom Pidcock. I wouldn’t say all the Grand Tour winners because you need to be a bit special, Pidcock <em>is </em>special – he was Olympic champion on the mountain bike, he won on the road, he’s doing cyclocross, same thing for Van der Poel and Van Aert, and Pogačar is winning everything. I’d say those four deserve one.</p>\n\n\n\n<p><strong>No Remco Evenepoel?</strong></p>\n\n\n\n<p>Oh yeah, of course, I forgot him. He won a Grand Tour and Classics plus World Championships, he’s quite unique because he won everything in the youth categories. Primož Roglič has a good story coming from ski jumping and becoming one of the best cyclists in history winning the Vueltas and a lot of other races. These riders are not like everyone else.</p>\n\n\n\n<figure><img width=\"970\" height=\"645\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-970x645.jpeg\" alt srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-970x646.jpeg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-300x200.jpeg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-768x511.jpeg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-750x499.jpeg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-465x310.jpeg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-620x413.jpeg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1-350x233.jpeg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-1.jpeg 1000w\" /><figcaption>ASO/Pauline Ballet</figcaption></figure>\n\n\n\n<p><strong>What do you think Wout van Aert is doing wrong in the Classics?</strong></p>\n\n\n\n<p>He’s still only 28, at this age I was just starting to win. There’s still time for him and I still believe that a human is only really strong when they’re 27/28, then you can hold it to 34/35. There are seven or eight years when you’re at the top before you start to go down, so I think his better years are still to come in the Classics.</p>\n\n\n\n<p><strong>So Pogačar still has another ten years at the top?</strong></p>\n\n\n\n<p>I think those guys, like him and Remco, are different. They’re quicker than anyone else but I don’t think they’ll have this improvement, they’re just ready earlier. Eddy Merckx stopped when he was 31. Those kinds of phenomenons are ready from age 18 to 30/31, then it’s hard, mentally and physically, when you do so much at a young age; it’s hard to hold on.</p>\n\n\n\n<p><strong>Do you think Pogačar could win Paris-Roubaix?</strong></p>\n\n\n\n<p>I think if he wants he can win everything. He’s able to win time-trials, mountain stages, Classics, Grand Tour GCs, even bunch sprints if it’s a bit uphill. He can win everything.</p>\n\n\n\n<p><strong>Do you think Remco could win the Tour of Flanders?</strong></p>\n\n\n\n<p>When you see the way Remco was racing Druivenkoers-Overijse and the Brussels Cycling Classic in 2021, it’s like the same course as Flanders with cobbles and small hills, and he won those really easily. So when you can do that I think you can also do Flanders.</p>\n\n\n\n<p><strong>Who will win in the Ardennes Classics this year?</strong></p>\n\n\n\n<p>If Pogačar is like that then it’s going to be hard, but it will still be a nice challenge between him and Evenepoel for <a href=\"https://www.cyclist.co.uk/tags/liege-bastogne-liege\" target=\"_blank\">Liège</a>. Evenepoel is not really fast in a sprint on the flat, he can beat him when it’s slightly uphill but on the flat Pogačar is faster. For Evenepoel it will be like Pogačar in Flanders, he’ll have to come to the finish alone.</p>\n\n\n\n<p><strong>Who will win the Tour de France this year?</strong></p>\n\n\n\n<p>Honestly it’s so impressive to see Pogačar that good so early in the season. I’ve never seen Grand Tour contenders being that ready so early in the season, I think it was already win number ten in Flanders. If you compare that to a few years ago when maybe a Tour contender would have ten days of <em>racing</em> by now but he has ten wins. It’s unique what he’s doing.</p>\n\n\n\n<p><strong>Do you think Pogačar will be the best rider ever when he retires?</strong></p>\n\n\n\n<p>Well, it’s still a long way when you see what Eddy Merckx did; he’s starting to compete with Merckx but he’s still a really long way off. Of course, it’s a different time and you can’t really compare because now we have an international bunch of riders from Australia, America, even Africa. At the time of Merckx it was only Belgium, France, some Dutch, some Italians, some Spanish, and that was pretty much it. Now it’s really worldwide so it’s different, competition is much higher. </p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-970x647.jpeg\" alt srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-970x646.jpeg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-300x200.jpeg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-768x512.jpeg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-750x500.jpeg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-465x310.jpeg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-620x413.jpeg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3-350x233.jpeg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-paris-roubaix-aso-pauline-ballet-3.jpeg 1000w\" /><figcaption>ASO/Pauline Ballet</figcaption></figure>\n\n\n\n<p><strong>There has been a lot of talk about Soudal-QuickStep not being as good in the Classics because they’re focussing on Remco and the Giro, do you think that’s true or have they just not quite been on form?</strong></p>\n\n\n\n<p>For sure they’ve invested around Remco so they couldn’t invest in one big leader for the Classics, they just kept the squad they had but I think they also lost two important riders in Iljo Keisse and Zdeněk Štybar. Those two were really important for the group, big captains; they’re not there and they’ve not been replaced, it’s new guys coming in without experience and I can feel they miss a captain in the team to guide the leaders. They miss one killer too, one guy who is able to handle the pressure, to say, ‘Okay guys today it’s up to me I’m going to make it.’ I feel like there’s no one able to speak like that in the bus before the start.</p>\n\n\n\n<p><strong>Do you think that Remco-first strategy is a good decision or do you think they should stick with Classics?</strong></p>\n\n\n\n<p>I understand that they want to invest in Remco; he’s Belgian, he’s the first Belgian rider since Lucien Van Impe to have a hope of GC wins and it’s not only hope, he can do it. He’s won 11/12 stage races plus the Vuelta, we haven’t seen that for 40 years or more in Belgium so as a Belgian team they want to invest in that and make history together.</p>\n\n\n\n<p><strong>Do you think Alaphilippe will re-find his form?</strong></p>\n\n\n\n<p>I hope he will because I like him, but it seems that he’s struggling. It’s still early in the season though and I hope for him that he’ll make it back.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/news/tadej-pogacar-greatest-of-all-time\">Opinion: Tadej Pogačar is the Greatest Of All Time</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/striving-for-milan-san-remo-philippe-gilbert-profile\">Striving for Milan-San Remo: Philippe Gilbert profile</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/all-you-need-to-know-about-the-classics-monuments-cobbles\">Cycling spring Classics 2023: Race dates, Monuments, cobbles and live TV guide</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p><strong>You’re involved with Classified, do you think it will spread further in the WorldTour soon?</strong></p>\n\n\n\n<p>Yeah, I think it’s nice to see innovation into equipment. I think it’s a really good innovation and I really believe there’s a future for it, but you know when you’re new you need to sign deals with everyone and grow it so people get to know and trust it. It’s just a matter of time though, I think riders will use it more and more in the future. With only one chainring in front it’s easier to fix the length of the chain, when you have two in front the chain has to be just long enough to get on both the big chainring and the small one, but when you only have one chainring up front it’s easier to decide which length you need for your chain. It also means that when you’re on a descent and hit a hole, or you’re on the cobbles and there’s a lot of vibration, the chain has a lot less risk of dropping.</p>\n\n\n\n<p><strong>Do you think it would’ve changed any of your results when riding?</strong></p>\n\n\n\n<p>I don’t know but I think it’s definitely a big advantage when you go for an uphill sprint because you can shift from the small to the big chainring really quickly and you can do it when you’re in max effort, 1,500 watts, so you don’t have to stop pedalling. I tested it and the first time I was scared to do it because it’s the reflex we have to slow down our pedalling but the second time I did it full and it’s really no problem, and then it’s much faster to shift and accelerate uphill</p>\n\n\n\n<p><strong>Do you think fellow Classified investor Tom Boonen is regretting his Colnago comments after Pogačar won Flanders?</strong></p>\n\n\n\n<p>Yeah I think so, but the thing is, I saw the show and actually it didn’t really come from Tom but because he was the biggest name on the table he got all the shit. It’s always the same, when you have a big name you have the responsibility, but his reaction was good after and I think it’s all good now.</p>\n\n\n\n<p><strong>In your career was there a bike you rode that you felt gave you an advantage over the others?</strong></p>\n\n\n\n<p>There was always difference between equipment, some are better some are worse. At the end of the day it’s also about how you feel yourself because the geometry of the frames are not the same and we’re all different, sometimes you’ll feel better on one brand than another.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-647x970.jpg\" alt srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-1365x2048.jpg 1365w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/philippe-gilbert-gcndiscovery-2.jpg 1707w\" /><figcaption>GCN/Discovery</figcaption></figure></div>\n\n\n<p><strong>Now you’ve retired, what bike do you ride now?</strong></p>\n\n\n\n<p>Now I use Specialized. I was really impressed when I rode the bike for the first time in 2017 and I did three big years with Specialized and then when I retired we were trying to get a sponsorship deal still and we decided to go with Specialized because, at pretty much the same offer as other brands, I chose the one I liked the most. I’m really happy to be back with them and I feel really great. I don’t ride much anymore but I did the 240km Flanders sportive after six months having not done more than 150km so I didn’t know how I would go, but I was feeling so good on the bike and so efficient that I still did a great ride. It wasn’t a race, of course, but I rode quite fast, I’d say I passed maybe 7,000/8,000 people on the day. That was quite a good feeling.</p>\n\n\n\n<p><strong>Are you ready for a last minute call up from Patrick Lefevere then?</strong></p>\n\n\n\n<p>No no no, honestly my level is really far from a pro.</p>\n\n\n\n<p><em>You can <a href=\"https://plus.globalcyclingnetwork.com/watch/5120403\" target=\"_blank\">watch Philippe Gilbert’s ‘Legends’ documentary on GCN+ now</a></em>.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/philippe-gilbert-interview\">‘Pogačar can win everything’: Philippe Gilbert Q&amp;A</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"74a24c023fa3c2cf84c3493b93e2ee17a75cc1c735c4d00f8a49baddf8892b94","category":"Cycling"}