{"title":"Prospective Analysis of Cannabidiol's Effectiveness in Post-Exercise Recovery: An integrative Systematic Review and Research Agenda","link":"https://www.preprints.org/manuscript/202405.0517/v1","date":1715182742000,"content":"Recovery between physical efforts is essential for optimal performance in sports. Dietary supplements like cannabidiol (CBD) have been proposed to facilitate recovery and performance optimization. This systematic review aimed to: a) systematize the scientific evidence on CBD for recovery, b) associate CBD's biomedical properties with those required for optimal fatigue recovery, and c) recommend a future research agenda. Searches across databases identified 70 relevant studies from 1990-2022, including 38.6% preclinical, 31.4% clinical trials, and 30.0% reviews/meta-analyses across various populations like mice, rats, epileptics, and athletes. CBD demonstrated potentially beneficial properties for athlete recovery such as anti-inflammatory, neuroprotective, anxiolytic, and analgesic effects with doses ranging from 5-600mg administered orally, intravenously, and via other routes. However, rigorous confirmatory research specifically in athlete populations is lacking. While CBD appears promising for facilitating recovery and performance optimization, further randomized placebo-controlled trials are needed to test the acute and chronic effects of different CBD dosing regimens in athletes. Future research should focus on elucidating CBD's physiological mechanisms of action as they relate to post-exercise recovery, as well as its comparative effectiveness versus conventional medications and therapies. Advancing our understanding of CBD's role in athlete recovery could provide new therapeutic strategies to optimize recovery and performance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"74a4becb2bf82b11fe0858046ac0244f7ea92c1dde4f721cc72db3fae04d82a9","category":"Interdisciplinary"}