{"title":"User preferences and consumer acceptability of boiled plantain in rural and urban localities in Cameroon","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13090?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>An understanding of the preferences of different stakeholders in the plantain value chain in rural and urban segments in Cameroon is important for the selection and adoption of new plantain cultivars. Boiled plantain is one of the most commonly consumed food products from this crop in Cameroon. Gendered food mapping and consumer testing with two plantain landraces (<i>Batard</i> and <i>Big Ebanga</i>) and a plantain-like hybrid (<i>CARBAP K74</i>) was carried out in rural and urban areas in the West and Littoral regions of Cameroon.</p>\n<h2>RESULTS</h2>\n<p>Plantain users in these two regions were categorized into producers, traders, processors, and consumers. Preferences indicated that raw plantain should bear long and large fruits, with heavy bunches, and an orange pulp color, whereas boiled plantain should present with a yellow color and a soft and mealy pulp, with a good plantain aroma. <i>Batard</i> and <i>Big Ebanga</i> were liked moderately by consumers, whereas <i>CARBAP K74</i> was liked slightly. <i>CARBAP K74</i> was on par with <i>Batard</i> and <i>Big Ebanga</i> for some attributes, except for color and sweetness.</p>\n<h2>CONCLUSION</h2>\n<p>More emphasis should be given to attributes such as color, firmness, and taste for the development of new plantain clones to be adopted by end users consuming boiled green plantain. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Gérard Ngoh Newilah, \nCédric Kendine Vepowo, \nRaymonde Nya Nzimi, \nCédric Kuate Kengne, \nAnnie Takam Ngouno, \nClaudin Karim Nana, \nVivien Meli Meli, \nInocent Gouado, \nDominique Dufour, \nDidier Mbeguie‐A‐Mbeguie","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"74a5d99bb4593ed84461f4533e0079ea8a26b6d6619724f36126a835b86880df","category":"Environment"}