{"title":"127 Utilizing predictive models for bone mineral content and bone mineral density as a tool to assess dietary phosphorous","link":"https://academic.oup.com/jas/article/102/Supplement_2/52/7664814?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Dietary phosphorous is a necessary nutrient for bone development in pigs at all stages of its growing. Deficiencies in phosphorous decrease bone mineral content (BMC) and bone mineral density (BMD) and may be a causative of lameness. However, the normal range expected in whole body (WB) and individual bones for BMC and BMD in commercial pigs has been poorly defined. Therefore, our objectives were to 1) model normal WB bone density at multiple timepoints in wean to finish pigs, and 2) determine the extent to which individual bone (femur and 3<sup>rd</sup> metatarsal) BMC and BMD could predict WB BMC and BMD. Mixed sex pigs [Camborough (1050) x 337, PIC] were utilized and included freshly weaned ~21 d (n = 8), ~44 d of age (n = 24), ~84 d of age (n = 24) and ~154 d of age (n = 24). Pigs were individually penned. Excluding weaning age, at each age group pigs were randomly assigned to diets adequate, marginally deficient, or deficient in available phosphorus (avP) and fed for 3, 4, and 6 wk (age group 44, 84, 154, respectively). Within each age group, diets were formulated to meet nutrient and energy requirements except for avP and pigs fed ad libitum. On-test and off-test body weight (BW) and feed intake and gain to feed ratio were assessed for each age group. At the end of each feeding period, all pigs were euthanized and WB, femur (F) and 3<sup>rd</sup> metatarsal (M) BMC and BMD determined by dual X-ray absorptiometry (DXA). Data were analyzed using linear and generalized additive models that predicted response variables (BMC or BMD) as a function of BW or age. Only pigs fed adequate avP diets were used in the model fit. Pigs fed adequate avP diets increased BMD with age (0.22, 0.42, 0.84 and 1.10 g/cm<sup>2</sup>, days of age 21, 44, 84 and 154 respectively, <span>P</span> &lt; 0.001). Within day of age 84, marginally and deficient avP diets reduced BMC and BMD by 21 to 41% (<span>P</span> = 0.002) and 12 to 25% (<span>P</span> = 0.006), respectively. Within day of age 154, marginally and deficient avP diets reduced BMC and BMD by 9% (<span>P</span> = 0.05) and 6 to 8% (<span>P</span> = 0.06), respectively. Body weight record and individual bone (F and M) BMC and BMD from pigs fed deficient avP diets were used to predict WB BMC and BMD and the mean square error of prediction was selected as a criterion to evaluate the ability of the models to detect these inadequately fed pigs. Using the selected models, pigs fed nutritionally deficient diets were detected due to 2- to 7-fold increase in MSE of predicted WBMD or WBMC compared with pigs fed adequate diets. These models can be used to assess bone development and strength in growing pigs and to infer the adequacy of avP level supplied in their diets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"74a5225d473426aad3e9486144a05d3ae176c9188b50d110940bb8185cc87f47","category":"Environment"}