{"title":"4 ประเด็นความเป็นส่วนตัวควรรู้กับการเล่นแอป Clubhouse","link":"https://www.blognone.com/node/121219","date":1613500502000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>สัปดาห์นี้แอป Clubhouse กลายเป็นแอปยอดฮิตของประเทศไทย โดยวันนี้ห้องที่ตั้งโดยนายปวิน ชัชวาลพงศ์พันธ์ นักวิชาการไทย<a href=\"https://www.blognone.com/node/118118\">ผู้ตั้งกลุ่มรอยัลลิสต์มาร์เก็ตเพลส</a> มีคนเข้าฟังเต็มความจุ 6,000 คนถึงสองห้อง และช่วงค่ำห้องที่ตั้งโดยนายธนาธร จึงรุ่งเรืองกิจ และปิยบุตร แสงกนกกุล อดีตสมาชิกสภาผู้แทนราษฎรพรรคอนาคตใหม่ก็มีผู้เข้าฟังจนเต็มและมีการเปิดห้องเพิ่มเติมอีกเช่นกัน</p>\n<p>แต่ขณะที่ความนิยมในตัวแอปกำลังพุ่งสูงขึ้นอย่างรวดเร็วจนหลายคนอาจจะตัดสินใจหาซื้ออุปกรณ์ iOS เพื่อมาใช้งานแอปนี้โดยเฉพาะ เราควรตระหนักว่าแอป Clubhouse มีแนวทางความเป็นส่วนตัวที่ต่างจากแอปอื่นๆ พอสมควร ผมแนะนำ 4 ประเด็นความเป็นส่วนตัวสำหรับการใช้งาน Clubhouse ที่ควรตระหนัก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5cfc91cc37e47cd36eaf3fa67282a1fa.png\" ></p>\n<h3>บังคับใช้หมายเลขโทรศัพท์ พยายามดึงหมายเลขติดต่อ</h3>\n<p>Clubhouse ใช้หมายเลขโทรศัพท์มากกว่าบริการสื่อสังคมออนไลน์อย่างอื่นมาก การลงทะเบียนต้องใช้หมายเลขโทรศัพท์เท่านั้น เทียบกับทวิตเตอร์ที่สามารถอีเมลได้ (หากใช้งาน Gmail <a href=\"https://support.google.com/a/users/answer/9308648?hl=en\">ยังสามารถใช้ alias ได้ด้วย</a>)</p>\n<p>สิ่งที่ทำให้ Clubhouse ต่างจากแอปอื่นอย่างชัดเจนคือระบบการชวนเพื่อนในช่วงนี้ ผู้ที่จะชวนเพื่อนให้เข้าไปใช้งาน Clubhouse ได้จะต้องส่งรายชื่อติดต่อ (contact) ทั้งหมดให้กับ Clubhouse และทาง Clubhouse จะใช้หมายเลขติดต่อนี้แนะนำคนอื่นๆ ที่เข้ามาใช้งานให้เราไป follow อย่างต่อเนื่อง</p>\n<h3>เปิดเผยการนั่งฟังเฉยๆ</h3>\n<p>โดยทั่วไปแล้วแพลตฟอร์มต่างๆ มักแนะนำคอนเทนต์ให้เพื่อนหรือผู้ติดตามของเราต่อเมื่อเรา \"กระทำ\" กับคอนเทนต์ในแพลตฟอร์ม เช่นการกดรีทวีตหรือกดไลค์บนทวิตเตอร์, การคอมเมนต์หรือกดไลค์บนเฟซบุ๊ก หรือ YouTube Live ที่จะรู้ว่าใครดูวิดีโอใดต่อเมื่อแชตในระบบเท่านั้น แต่กรณีของ Clubhouse นั้น การกดเข้าไปร่วมฟังในห้องหนึ่งๆ จะเป็นการเปิดเผยว่าเรากำลังฟังทันที ผู้ที่ follow เราอยู่บน Clubhouse จะเห็นว่าเราอยู่ในห้องใดบน timeline ของแอป รวมถึงผู้ร่วมห้องจะเห็นรายชื่อของผู้ที่ฟังในห้องอยู่ทั้งหมด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/73f2cc4d552e42cceda29cc9a54e89aa.jpg\" ></p>\n<h3>ไม่เข้ารหัสหมายเลขผู้ใช้ และหมายเลขห้อง ทำให้อาจถูกดักฟังว่าฟังหรือพูดในห้องใดอยู่</h3>\n<p>ตัวแอป Clubhouse ใช้<a href=\"https://www.agora.io/en/\">แพลตฟอร์ม Agora</a> เพื่อกระจายเสียงไปยังผู้ใช้ เมื่อผู้ใช้เข้าห้องในแอป ตัวแอปจะเชื่อมต่อตรงไปยังเซิร์ฟเวอร์ของ Agora เช่น <code>qos-america.agoralab.co</code> โดยแพ็กเก็ตที่เชื่อมต่อนั้น<a href=\"https://cyber.fsi.stanford.edu/io/news/clubhouse-china\">ไม่เข้ารหัสข้อมูลการเชื่อมต่อ (metadata)</a> ทำให้ผู้ที่สามารถดักฟังการเชื่อมต่อจะเห็นหมายเลขประจำตัวผู้ใช้ และหมายเลขห้องในแอปได้</p>\n<p>ในกรณีที่ร้ายแรงที่สุด หากผู้ดักฟังสามารถเข้าฟังห้องเดียวกับเหยื่อที่ถูกดักฟังได้ก็จะรู้ว่าหมายเลขไอพีต้นทางของผู้พูดคือชื่อผู้ใช้ใดในแอป</p>\n<h3>มีการอัดเสียงเก็บไว้</h3>\n<p>Clubhouse ประกาศใน<a href=\"https://www.notion.so/Privacy-Policy-cd4b415950204a46819478b31f6ce14f\">นโยบายความเป็นส่วนตัว</a>ระบุว่าบริษัทจะเก็บเสียงของแต่ละห้องไว้ชั่วคราว เพื่อสอบสวนในกรณีที่มีการร้องเรียน โดยทั่วไปแล้วไฟล์เสียงของแต่ละห้องจะถูกลบเมื่อห้องปิดตัวลงและไม่มีการร้องเรียนใดๆ แต่หากมีการร้องเรียนในห้อง ทางแอปก็จะเก็บไฟล์เสียงไว้จนกว่าการสอบสวนจะเสร็จสิ้น</p>\n<p>ข้อจำกัดเหล่านี้อาจจะไม่ได้เป็นเรื่องร้ายแรงสำหรับคนจำนวนมาก (หลายคนอาจจะอัพโหลดรายชื่อติดต่อในทุกแอปแชตอยู่แล้ว) แต่ก็ควรตระหนักว่าแอปยังไม่มีตัวเลือกความเป็นส่วนตัวที่ละเอียดเท่าแพลตฟอร์มอื่นๆ ในกรณีที่มีการพูดคุยในเรื่องอ่อนไหวก็ควรตระหนักว่าแพลตฟอร์มยังมีประเด็นความปลอดภัยและความเป็นส่วนตัวที่ควรปรับปรุงอีกหลายจุด</p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/clubhouse\">Clubhouse</a></div><div class=\"field-item odd\"><a href=\"/topics/privacy\">Privacy</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"74c77879d9c73674489225f64fc97485907db6ea7e87f473a360ef00cdd48e90","category":"Thai"}