{"title":"Apple Says Third-Party Apps Can Take Full Advantage of ProMotion With Plist Entry, Core Animation Bug Fix Coming","link":"https://www.macrumors.com/2021/09/24/apple-promotion-third-party-app-support/","date":1632530032000,"content":"After developers discovered that their apps <a href=\"https://www.macrumors.com/2021/09/24/iphone-13-pro-third-party-promotion-limitations/\">are not currently able</a> to use 120Hz ProMotion refresh rates for all animations, there was confusion over whether it was a limitation imposed for battery life or a bug. Apple has now provided clarification.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iphone-13-promotion-display.jpg\" />\r\n<br />\r\nApple told <em>MacRumors</em> that all third-party apps can take full advantage of 120Hz ProMotion refresh rates, but developers will need to declare that their apps use higher frame rates by adding an entry to their app's plist. Documentation on the required plist entry will be made available to developers soon.\r\n<br />\r\n\r\n<br />\r\nApple is requiring this opt-in step to provide higher fresh rates only to apps that will benefit from the technology, which will optimize battery life on <a href=\"https://www.macrumors.com/roundup/iphone-13-pro/\">iPhone 13 Pro</a> and Pro Max devices.\r\n<br />\r\n\r\n<br />\r\nIt's worth noting that this opt-in process is designed for apps that need full ProMotion support. Standard UI animations in <em>all</em> third-party apps automatically get the benefits of the the higher and lower frame rates available with ProMotion without developers having to change anything. \r\n<br />\r\n\r\n<br />\r\nThere is also a bug that is affecting some animations built using Core Animation that Apple says will be fixed in an upcoming software update.\r\n<br />\r\n\r\n<br />\r\nAs developers have discovered, standard UI animations within third-party apps work with ProMotion display technology automatically, and that's true for all apps. Apps that will be able to benefit from the faster frame rates will be able to add that support and will be on par with Apple's own apps. \r\n<br />\r\n\r\n<br />\r\nAt the current time, with support limited to standard animations, there can be a noticeable difference between an interaction like scrolling and another interaction like closing a popup. If you're scrolling through Twitter on an ‌iPhone 13 Pro‌ or Pro Max, for example, you'll see the smooth scrolling experience, but the animations that have not yet been updated to 120Hz are limited to 60Hz, and these animations are noticeably less smooth. This problem will be ironed out as developers adopt full support for the ProMotion feature in the future. \r\n<br />\r\n\r\n<br />\r\nProMotion display technology is designed to provide an adaptive refresh rate ranging from 10Hz to 120Hz. The <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>'s refresh rate shifts based on what's on the screen in order to preserve battery life, as the 120Hz refresh rate eats up battery quicker. If you're looking at a static page on the web for example, the refresh rate will slow down, but it will speed back up as you scroll. ProMotion functionality is available on the ‌iPhone 13 Pro‌, ‌iPhone 13 Pro‌ Max, and <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models. \r\n<br />\r\n<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a>, <a href=\"https://www.macrumors.com/roundup/iphone-13-pro/\">iPhone 13 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-13\">iPhone 13 (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#iPhone-13-Pro\">iPhone 13 Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/24/apple-promotion-third-party-app-support/\">Apple Says Third-Party Apps Can Take Full Advantage of ProMotion With Plist Entry, Core Animation Bug Fix Coming</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-says-third-party-apps-can-take-full-advantage-of-promotion-with-plist-entry-core-animation-bug-fix-coming.2313288/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C2KTuXzktSA:GaxLN9DrEN8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=C2KTuXzktSA:GaxLN9DrEN8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/C2KTuXzktSA\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"74d78bc83697b38814a625b6977c08e8326b6a3572cb05c610c05cd65bc9dbea","category":"Apple"}