{"title":"Light quality and spatial variability influences on seedling regeneration in Hawaiian lowland wet forests","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14775?af=R","date":1725884623000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c472806d-5133-481f-a1c8-5810c10eb282/jpe14775-toc-0001-m.png\" alt=\"Light quality and spatial variability influences on seedling regeneration in Hawaiian lowland wet forests\" />\n<p>The native-dominated and partially invaded forests still hold conservation value, despite variation among sites. Seedling additions could be targeted to different R:FR environments and at different spatial scales, but the lack of a strong relationship between R:FR and seedling number suggests that other factors besides light quality should be considered in seedling enrichment or other management activities.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTropical forest understories tend to be light-limited. The red-to-far-red ratio (R:FR) is a useful and reliable index of light quality and its spatial variability can influence competition between native and non-native seedlings. While per cent light transmittance has been quantified in some Hawaiian lowland wet forests (HLWF), no information exists on how the spatial distribution of understorey light varies in relation to species invasion, or if patterns of seedling regeneration and light are linked.\n\nWe measured the R:FR of light in the understorey to assess light quality in three HLWF forest types: native-dominated, partially invaded and <i>Psidium cattleyanum-</i> (strawberry guava) dominated to quantify light quality in the understorey (0–50 cm height). We also identified relationships between light quality and native and non-native seedling presence, diversity and abundance. Together, these data can help to determine the restoration potential of HLWF.\n\nLinear mixed-effect modelling showed that native-dominated forests had significantly greater R:FR than <i>P. cattleyanum</i>-dominated forests, demonstrating a transformation in the light environment with increased invasion. Heterogeneity in R:FR varied more across sites than among forest types. In both native-dominated and partially invaded forests, there were more native seedlings in the low-quality R:FR (0.0–0.40) category and fewer in the medium- (0.41–0.70), and high-quality (≥0.71) light categories than would be expected by chance, and there were no native seedlings in the <i>P. cattleyanum</i>-dominated forests.\n\nNative-dominated forests had greater species richness and abundance of native seedlings than the partially invaded forests, likely due to propagule availability. However, the spatial clustering of seedlings, the mismatch of native seedlings in light environments less suitable, and a considerable proportion of open high-quality microsites, highlights that conditions are not optimal for native species in HLWF in the long term.\n\n<i>Synthesis and applications.</i> The native-dominated and partially invaded forests still hold conservation value, despite variation among sites. Seedling additions could be targeted to different R:FR environments and at different spatial scales, but the lack of a strong relationship between R:FR and seedling number suggests that other factors besides light quality should be considered in seedling enrichment or other management activities.\n</p>","author":"Jodie R. Rosam, \nLaura Warman, \nRebecca Ostertag, \nRyan Perroy, \nSusan Cordell","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"74d7456b73dfadeba8c205d360aee0843a3405ec7875f3f86d6d613a197d6b5a","category":"Environment"}