{"title":"Effectiveness of trans-nasal humidified rapid insufflation ventilatory exchange compared with standard facemask oxygenation for pre- and apneic oxygenation during anesthesia induction: A meta-analysis based on randomized controlled trials","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302626","date":1714485600000,"content":"<p>by Delai Zheng, Yi Yao, Chuan Luo, Yanhui Yang, Bogang Chen, Nana Li, Yi Wang</p>\r\nPurpose <p>To further identify the effectiveness of trans-nasal humidified rapid insufflation ventilatory exchange (THRIVE) for pre- and apneic oxygenation during the anesthesia induction by comparison to facemask ventilation (FMV) based on current available evidence.</p> Methods <p>Medline, EMBASE, Web of Science, Cochrane Library and CNKI databases were searched from inception to December 22, 2023 for available randomized controlled trials (RCTs). Primary outcomes were PaO<sub>2</sub> and PaCO<sub>2</sub> after intubation and safe apnoea time. Secondary outcomes included the O<sub>2</sub> desaturation, end expiratory carbon dioxide (EtCO<sub>2</sub>) and complications. The effect measures for continuous and categorical outcomes were separately the mean difference (MD) and relative risk (RR) with 95% confidence interval.</p> Results <p>Twelve RCTs with 403 patients in the THRIVE group and 401 patients in th FMV group were included. Pooled results demonstrated that the PaO<sub>2</sub> after intubation was significantly higher (MD = 82.90mmHg, 95% CI: 12.25~153.54mmHg, P = 0.02) and safe apnoea time (MD = 103.81s, 95% CI: 42.07~165.56s, P = 0.001) was longer in the THRIVE group. Besides, the incidence rate of O<sub>2</sub> desaturation (RR = 0.28, 95% CI: 0.12–0.66, P = 0.004) and gastric insufflation (RR = 0.26, 95% CI: 0.13–0.49, P&lt;0.001) was significantly lower in the THRIVE group.</p> Conclusion <p>Based on current evidence, THRIVE manifested better effectiveness representing as improved oxygenation, prolonged safe apnoea time and decreased risk of complications compared to standard FMV in surgical patients. Therefore, THRIVE could be served as a novel and valuable oxygenation technology for patients during anesthesia induction.</p>","author":"Delai Zheng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"74d8746ea420d9f9afe16354424ca24a620cbe5405db9dbe7aaea5c24ae4add5","category":"Interdisciplinary"}