{"title":"Kakao Webtoon เผยเปิดตัวในไทย 4 วันแรก สร้างรายได้แล้วกว่า 10 ล้านบาท","link":"https://www.blognone.com/node/123979","date":1627646408000,"content":"<div><div><div><p>Kakao Webtoon แพลตฟอร์มอ่านการ์ตูนจากเกาหลี ซึ่งเปิดตัวในไทยเมื่อวันที่ 7 มิถุนายนที่ผ่านมา ล่าสุด Kakao Webtoon ออกมาเผยตัวเลข หลังเปิดตัวในไทย 4 วัน สร้างรายได้ให้ Kakao Webtoon ประเทศไทยสูง 330,000 ดอลล่าร์สหรัฐ หรือกว่า 10 ล้านบาท ทุบสถิติการทำรายได้สูงสุดในช่วงเปิดตัวแอปพลิเคชันในรอบ 8-10 ปีที่ผ่านมาของตลาดรวมเว็บตูนโลก</p>\n<p>เบื้องต้น Kakao Webtoon คัดเลือกเว็บตูนที่ได้รับความนิยม Kakao Page ในเกาหลีมาแปลไทยจำนวนตอนนี้กว่า 90 เรื่อง โดยเรื่องที่คาดว่าจะเป็นแม่เหล็กดึงดูดคนอ่านคือ Solo Leveling, Overgeared, Tomb Raider King หรือที่นิยมอีกแนวคือโรแมนซ์แฟนตาซี เช่น มงกฎสีมรกต, ใจว่างเปล่าของดัชเซส, ปล่อยฉันจากพันธนาการ, เป็นตัวร้ายก็ต้องตายเท่านั้น และ ศิษย์ทั้งห้าของชาร์ล็อตต์ เป็นต้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/88b2d86d2a51574f5d142a483a77860a.jpg\" /></p>\n<p>Kakao Webtoon มีรูปแบบสร้างรายได้จากการจ่ายเพื่อปลดล็อกอ่านตอนต่อไป หรืออ่านฟรีด้วยโมเดล Wait or Pay คือรอราว 3-7 วันเพื่ออ่านฟรี ปัจจุบัน Kakao Webtoon มียอดดาวน์โหลดกว่า 5 แสนครั้ง มียอดผู้ใช้งานรายวัน 1 แสนราย ตั้งเป้าภายในปีนี้ มียอดโหลด 3 ล้านครั้ง ผู้ใช้งานรายวัน 1 ล้านราย</p>\n<p>ดร.ยางวอน ฮยอน กรรมการผู้จัดการ Kakao Webtoon ประเทศไทย พูดถึงความท้าทายในการเจาะตลาดประเทศไทยเว็บเถื่อน การละเมิดลิขสิทธิ์ยังคงเป็นความท้าทายสูงสุดเสมอ ซึ่งจากการตรวจสอบพบว่ามีการละเมิดลิขสิทธิ์เนื้อหาของ Kakao Webtoon ไปร่วม 50 เรื่องแล้ว แต่ในขณะเดียวกันก็เชื่อว่าคนอ่านต้องการสัมผัสประสบการณ์การอ่านของแท้ ซึ่ง Kakao Webtoon ก็มีรูปแบบอ่านฟรีอยู่แล้ว นอกจากนี้ยังมีความท้าทายจากคู่แข่งมากหน้าหลายตา ทั้ง  LINE Webtoon, Comico และ WeComics</p>\n<p>ในขณะที่แพลตอร์มอื่น เปิดให้นักวาดอิสระเข้ามาแชร์ผลงานตัวเองได้ หรือ UGC (User-Generated Content) แต่ Kakao Webtoon เน้นจับมือกับครีเอเตอร์แบบ b2b หรือทำสัญญากับสตูดิโอมากกว่า อย่างในไทยเองก็ร่วมกับ รอมแพง ผู้แต่ง บุพเพสันนิวาสมาสร้างเว็บตูน ซึ่งจะเปิดให้อ่านภายในปีนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ec955c234f970baa096456983f00dd52.jpg\" /></p>\n<p>ส่วนสาเหตุที่เลือกไทยเป็นประเทศแรกในการเปิดตัวนอกเกาหลี เนื่องจากคนไทยมีการใช้อินเทอร์เน็ตมากถึง 69.5% มีใจที่เปิดกว้างและชื่นชอบวัฒนธรรมเกาหลี หลังจากนั้นก็เปิดตัวในไต้หวัน และเตรียมจะเปิดตัวในอินโดนีเซีย, สหรัฐฯ ส่วนแพลตฟอร์มในเกาหลีที่ชื่อว่า Daum (ของ Kakao เช่นกัน) เตรียมเปลี่ยนชื่อมาเป็น Kakao Webtoon</p>\n<p>ที่มา - งานแถลงข่าว</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kakao-corp\">Kakao Corp</a></div><div><a href=\"/topics/manga\">Manga</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"74e144c28b63898b4834e02ecd05dec58112eed7a207491aa9553d5fc6edbc64","category":"Thai"}