{"title":"Here's How Interactive Widgets Work in macOS Sonoma","link":"https://www.macrumors.com/guide/how-widgets-work-macos-sonoma/","date":1687516684000,"content":"In macOS Sonoma, Apple has changed the widgets landscape. No longer do widgets have to be hidden offscreen and largely forgotten in the Notifications Center panel. Now they live right on your desktop – and they're interactive, too.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/Widgets-on-Your-Mac-Thumb-3.jpg\" alt width=\"2500\" height=\"1406\" />\r<br />\nIt's worth noting from the off that widgets can still be parked in Notification Center, but now they can also be dragged out onto the desktop. The first widget can be placed anywhere, then Apple provides placement guidance for subsequent widgets by displaying a widget-shaped outline, indicating where they can be snapped into position in relation to the others. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Screenshot-2023-06-23-at-11.19.20.jpg\" alt width=\"2880\" height=\"1144\" />\r<br />\nAlternatively, if you right-click on an empty space on the desktop, the menu that appears includes a new \"Edit Widgets...\" option. Selecting this brings up a widget gallery, which – thanks to a new Continuity feature between Apple devices – also includes widgets from your iPhone in all available sizes. So even if you don't have the corresponding Mac app, you can still use the iOS widget right on your desktop. Simply drag it from the gallery into an available space.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/widgets-macos.jpg\" alt width=\"2880\" height=\"1800\" />\r<br />\nIf you're running the macOS Sonoma beta, trying out iPhone widgets is a good way to get used to their interactivity until third-party developers have a chance to bake this into their Mac widgets. As it stands, only Apple's own widgets offer (sometimes buggy) interactions. \r<br />\n\r<br />\nIn the Home app widget, for example, you can control specific accessories by clicking the individual buttons to turn them on and off.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/home-widget.jpg\" alt width=\"728\" height=\"354\" />\r<br />\nIf you right-click a widget, any available customization options appear in the contextual menu. Widgets are available in Small, Medium, and Large sizes, and all include an option to \"Remove Widget\" if you want to get rid of it. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/widgets-fade.jpg\" alt width=\"2880\" height=\"1800\" />\r<br />\nLastly, when not in use, widgets fade into the background by taking on the color of your wallpaper, so you can concentrate on the active app or window. \r<br />\n\r<br />\nWidgets have evolved in macOS Sonoma. By bringing them in from the dark and out into the open workspace of your desktop, users are actively encouraged to work alongside them. What are your thoughts on Apple's new take on Mac widgets? Are you more likely to use them in their new guise? Let us know in the comments.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macos-sonoma/\">macOS Sonoma</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macos-sonoma.243\">macOS Sonoma</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/how-widgets-work-macos-sonoma/\">Here's How Interactive Widgets Work in macOS Sonoma</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heres-how-interactive-widgets-work-in-macos-sonoma.2393921/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"74e24508924195b61985bd2e88e9199ba98307bfca4fd38f0f54b15b64f1a18c","category":"Apple"}