{"title":"Can you fool a monkey with a magic trick? Only if it has opposable thumbs","link":"https://arstechnica.com/?p=1928725","date":1680644219000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<figure>\n    <div>\n        A Humboldt's squirrel monkey is fooled by the \"French Drop\" magic trick. Credit: E. Garcia-Pelegrin et al., 2023    </div>\n        <figcaption>\n        <div>A Humboldt's squirrel monkey is fooled by the \"French Drop\" magic trick. Credit: E. Garcia-Pelegrin et al., 2023 </div>\n    </figcaption>\n    </figure>\n<p>The key to a successful sleight-of-hand magic trick is how well a magician manipulates the audience's perception, especially of manual movements, since that is crucial to how we anticipate another's actions. To learn more about how humans experience such misdirection, researchers in the UK performed simple magic tricks for three species of monkeys to see if they could be fooled. They found that only those species with at least partially opposable thumbs were fooled, suggesting that having similar anatomy (and therefore biomechanical ability) plays a vital role in the illusion. They described their results in <a href=\"https://www.repository.cam.ac.uk/handle/1810/347615\">a new paper</a> published in the journal Current Biology.</p>\n<p>“Magicians use intricate techniques to mislead the observer into experiencing the impossible,\" <a href=\"https://www.eurekalert.org/news-releases/984586?\">said co-author Elias Garcia-Pelegrin</a>, who practices magic and conducted this research while completing his PhD at the University of Cambridge. \"It is a great way to study blind spots in attention and perception. By investigating how species of primates experience magic, we can understand more about the evolutionary roots of cognitive shortcomings that leave us exposed to the cunning of magicians. In this case, whether having the manual capability to produce an action, such as holding an item between finger and thumb, is necessary for predicting the effects of that action in others.”</p>\n<p>The researchers focused on three species with different hand anatomies and associated biomechanical abilities: yellow-breasted Capuchin monkeys, Humboldt's squirrel monkeys, and common marmosets. For instance, Capuchins are known for their manual dexterity, due in part to the fact that they can individually control their fingers. So they can perform a scissor grip (holding an object between the sides of two fingers), as well as a precision grip (bringing the thumb to the index or middle finger). They can even probe, pinch, or enclose an object with both hands, much like humans, and use stone tools to crack nuts.</p></div><p><a href=\"https://arstechnica.com/?p=1928725#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1928725&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"74e29fb964b3fef634c23f7effeb99ef2f666608f3d46b33ee5022e30dc1e0e1","category":"Tech"}