{"title":"Growth and population structure of Odaxothrissa mento and Brycinus leuciscus from the lower reaches of the White Volta in Ghana","link":"https://onlinelibrary.wiley.com/doi/10.1111/lre.12457?af=R","date":1717763034000,"content":"<h2>Abstract</h2>\n<p>The growth and population structure of two small pelagics: <i>Odaxothrissa mento</i> and <i>Brycinus leuciscus</i> were studied based on 1-year data collected from the White Volta at Yapei in northern Ghana. The species were assessed using an R package TropFishR. The von Bertalanffy growth parameters were estimated with an asymptotic length (<i>L</i>\n<sub>∞</sub>) of 13.65 cm TL (CI<sub>95%</sub>: 11.29–17.29), growth curvature of .32/year (CI: .14–.63) for <i>Odaxothrissa mento</i> and <i>L</i>\n<sub>∞</sub> of 8.85 cm TL (CI<sub>95%</sub>: 8.17–11.02) and growth curvature of 1.57/year (CI<sub>95%</sub>: .64–1.57) for <i>Brycinus leuciscus</i>. The computed total mortality (<i>Z</i>) was 2.25/year, the natural mortality (<i>M</i>) was .91/year and fishing mortality (<i>F</i>) was 1.34/year for <i>Odaxothrissa mento</i> while <i>Z</i> = 4.5/year, <i>M</i> = 2.8/year and <i>F</i> = 1.7/year were estimated for <i>Brycinus leuciscus.</i> Results indicate that the stock of <i>Odaxothrissa mento</i> is slightly overexploited with a current exploitation rate (<i>E</i>) of .60/year which is above the optimum exploitation rate (<i>E</i>\n<sub>opt</sub>) of .5. However, the stock of <i>Brycinus leuciscus w</i>as found to be underexploited with a current exploitation rate (<i>E</i>) of .38 year<sup>−1</sup>. The estimated age at 50% capture for <i>Odaxothrissa mento</i> and <i>Brycinus leuciscus</i> were 3.4 years and .65 years, respectively, with their corresponding lengths at 50% capture of 9.14 cm and 5.67 cm, which are close to the mean lengths of the population in the present study. Mean length at first sexual maturity (<i>L</i>\n<sub>m</sub>) for <i>Odaxothrissa mento</i> is estimated as 5.2 and 4.2 cm TL for females and males while <i>L</i>\n<sub>m</sub> of 3.5 cm and 4.5 cm were estimated for females and males of <i>Brycinus leuciscus</i>, respectively. The estimated longevity (<i>t</i>\n<sub>max</sub>) of <i>Odaxothrissa mento</i> and <i>Brycinus leuciscus</i> was 9.7 years and 1.7 years, respectively, indicating that <i>Odaxothrissa mento</i> is a long-lived species while <i>Brycinus leuciscus</i> is a short-lived species. This conforms to the exploitation pattern of the species and thus requires species-specific management interventions.</p>","author":"Evelyn Nhyiraba Quarshie, \nElliot Haruna Alhassan, \nSeth Mensah Abobi","siteTitle":"Wiley: Lakes & Reservoirs: Science, Policy and Management for Sustainable Use: Table of Contents","siteHash":"0c37a2f8fab2f38bae7a8df98c682fefad0ef1d621f3013d69fd39589935ccea","entryHash":"74e3f8ec94634a0bf5b4fe6c4550b2114e7fc04031c60d9fdadcbacacb76402c","category":"Environment"}