{"title":"Formula E’s first visit to a proper American racetrack saw packed stands","link":"https://arstechnica.com/?p=1956870","date":1690542032000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/2023-Portland-ePrix-1-800x533.jpg\" alt=\"A Jaguar Formula E car with Mt Hood in the background\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/2023-Portland-ePrix-1.jpg\">Enlarge</a> <span>/</span> I can think of maybe one other race track that has a volcano for a backdrop. (credit: Sam Bloxham/Formula E)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Jaguar Land Rover provided a flight from Washington, DC, to Portland and two nights in a hotel so we could attend the Formula E race. Ars does not accept paid editorial content.</aside>\n<p>PORTLAND, Ore.—This year's Formula E season draws to a close this weekend, with the final two rounds taking place in London. The title fight is a three-way contest, with Avalanche Andretti's Jake Dennis leading Envision Racing's Nick Cassidy and Jaguar TCS Racing's Mitch Evans. Last month, the series held a race here in the US on the opposite coast of its traditional home in Brooklyn. Formula E did something outside its comfort zone, holding a race at permanent road course—Portland International Speedway. And as Ars found out, it was a good decision; this leafy race track with its volcano backdrop felt like a much better venue for Formula E than a humid parking lot next to the Hudson River.</p>\n<p>It was also our first opportunity to see the series' new cars in action, and they're significantly lighter and more powerful than the <a href=\"https://arstechnica.com/cars/2018/11/formula-es-new-season-is-going-to-be-much-faster-as-this-video-shows/\">Gen2 machines</a>. As ever, the drivers have a lot of work to do to manage energy in the cars, thanks to restricted telemetry to their engineers in the pit lane and new tires that prioritize sustainability over outright grip.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/2023-Portland-ePrix-2.jpg\"><img alt=\"Portland saw the Gen3 cars reach their highest ever top speeds.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/2023-Portland-ePrix-2-980x653.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/2023-Portland-ePrix-2.jpg\">Portland saw the Gen3 cars reach their highest ever top speeds.</a> (credit: Simon Galloway/Formula E)</p></div>\n<h2>This isn’t a city center street circuit</h2>\n<p>Portland was not the first Formula E race we've attended; <a href=\"https://arstechnica.com/cars/2015/03/racing-goes-electric-at-the-track-with-formula-e-the-first-e-racing-series/\">we were on hand</a> to see the series' rather chaotic Miami ePrix in 2015, and Ars logos even ran on a pair of cars at <a href=\"https://arstechnica.com/cars/2015/06/the-first-all-electric-formula-e-season-dramatically-concludes-in-london/\">that year's London ePrix</a>. Miami was not a repeat event for the sport, and the Long Beach ePrix in California was held only twice, in 2015 and 2016.</p></div><p><a href=\"https://arstechnica.com/?p=1956870#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956870&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"74e417ce7b02fe9f46f166ea34246b303cd165330ff7f2b7225c03ad4cfb4b46","category":"Tech"}