{"title":"'Apple Payments Services' Company Likely Behind New Apple Wallet Features in UK, Potentially More to Follow","link":"https://www.macrumors.com/2023/09/28/apple-payments-services-behind-uk-wallet-features/","date":1695906939000,"content":"An Apple-acquired company now renamed \"Apple Payments Services\" is likely behind the new <a href=\"https://www.macrumors.com/how-to/view-uk-bank-account-balance-apple-wallet/\">UK-exclusive Apple Wallet features</a> in iOS 17.1, potentially hinting that Apple has plans to launch additional financial services in the country.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/credit-kudos-apple.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nLast year, <a href=\"https://www.macrumors.com/2022/03/23/apple-acquires-uk-banking-startup/\">Apple acquired Credit Kudos</a>, a UK open banking startup that sought to help lenders make better decisions. <em>MacRumors</em> has now learned  that Apple filed to change the name of Credit Kudos to Apple Payments Services Limited in July. \"Credit Kudos\" is now simply a trading name of Apple Payments Services.\r<br />\n\r<br />\nCredit Kudos offered insights and scores based on loan applications drawn from transaction and loan outcome banking data, sourced by the UK's open banking framework. The ability to see account balances directly in Apple Wallet is a new UK-exclusive feature in iOS 17.1, powered by the country's regulated open banking API. Since Credit Kudos' expertise focused on UK open banking, it seems highly likely that last year's acquisition is behind the new feature. \r<br />\n\r<br />\nIt is not clear what Apple has planned for Credit Kudos' technology in the future, but it is almost certain that it extends beyond balance visibility in Apple Wallet, especially considering Apple paid £131 million ($170 million) for the company in March 2022. The relatively recent decision to rename the company to Apple Payments Services similarly suggests that the company's work is ongoing. <em>MacRumors</em> understands that 31 employees left Credit Kudos following Apple's acquisition, but a team of over a dozen employees, as well as co-founder and CEO Freddy Kelly, remain at the company. \r<br />\n\r<br />\nCredit Kudos's API offered lenders a way to get faster, automated decision-making about loans with reduced risk and higher rates of acceptance. It is therefore plausible that the company's technology could aid Apple with the launch of <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> in the UK. The UK is among Apple's most important markets, with the country possessing the largest number of Apple Stores outside the United States and China, and new features and services are often first to reach the UK after launching in the U.S.\r<br />\n\r<br />\nApple's main credit product, ‌Apple Card‌, is available exclusively in the United States. It is possible that Apple could modify Credit Kudos's technology to work with the U.S.'s growing open banking sector to strengthen ‌Apple Card‌'s credit checker, but Apple could also use it to credit check ‌Apple Card‌ applications in the UK directly since Credit Kudos is a licensed credit reference agency.\r<br />\n\r<br />\nCredit markets and financial regulation vary massively in countries around the world, so it would not be straightforward for Apple to launch ‌Apple Card‌ internationally. Apple would likely need to seek specific solutions to make lending decisions in each country, so it seems plausible that Credit Kudos could be the chosen credit checking platform for the UK.\r<br />\n\r<br />\nFollowing the success of ‌Apple Card‌ in the U.S., it could make sense for Apple to expand into overseas markets. While visiting Germany in 2019, Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> <a href=\"https://www.macrumors.com/2019/09/30/tim-cook-visits-germany/\">confirmed his interest</a> in launching ‌Apple Card‌ internationally.\r<br />\n\r<br />\nApple often acquires smaller businesses to bolster its technologies and expertise without obviously or immediately rolling it into a product or service. On the other hand, many acquisitions do go on to be key parts of Apple's ecosystem. In recent years, Apple has acquired businesses such as <a href=\"https://www.macrumors.com/2017/12/11/apple-acquires-shazam/\">Shazam</a>, a music recognition service, and <a href=\"https://www.macrumors.com/2019/06/25/apple-acquires-self-driving-car-startup-drive-ai/\">Drive.ai</a>, an autonomous vehicles company. Acquired apps such as <a href=\"https://www.macrumors.com/2020/03/31/apple-acquires-weather-app-dark-sky/\">Dark Sky</a> and <a href=\"https://www.macrumors.com/2017/03/22/apple-acquires-popular-automation-app-workflow/\">Workflow</a> were folded into or became new Apple apps. Specialized classical music streaming service <a href=\"https://www.macrumors.com/2021/08/30/apple-acquires-primephonic-classical-music-service/\">Primephonic</a> is one of the latest companies to be integrated into existing Apple products, becoming the <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> Classical app.<div>Tags: <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a>, <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/28/apple-payments-services-behind-uk-wallet-features/\">'Apple Payments Services' Company Likely Behind New Apple Wallet Features in UK, Potentially More to Follow</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-payments-services-company-likely-behind-new-apple-wallet-features-in-uk-potentially-more-to-follow.2405276/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"74ef0e0492fe97f0d1df10d9655a7e40c25c8d7eb61373461c6f4570e900f220","category":"Apple"}