{"title":"Review: Nvidia’s $600 GeForce RTX 4070 Super is one of its best values","link":"https://arstechnica.com/?p=1995760","date":1705413645000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/IMG_1490-800x533.jpeg\" alt=\"The GeForce RTX 4070 Super Founders Edition. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/IMG_1490.jpeg\">Enlarge</a> <span>/</span> The GeForce RTX 4070 Super Founders Edition.  (credit: Andrew Cunningham)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Judging by the comments on YouTube reviews, you'd think Nvidia's RTX 4070, launched in April of 2023 for $599, was a terrible graphics card. The reaction wasn't as brutal as it was among commenters and reviewers for the 4060 Ti a month later (a \"<a href=\"https://www.youtube.com/watch?v=Y2b0MWGwK_U\">waste of sand</a>,\" declared Gamers Nexus), but you'd usually find praise for its power efficiency but criticism of its price (high for a xx70 card) and its performance improvement relative to the previous generation (only about as fast as an RTX 3080, sometimes less).</p>\n<p>Those are all largely valid criticisms. But the 4070 is actually Nvidia's most popular RTX 4000-series desktop GPU, at least according to the (admittedly flaky and opaque) <a href=\"https://store.steampowered.com/hwsurvey/videocard/\">Steam Hardware Survey data</a> for December 2023. It's not in the top 10—this is dominated by older midrange GeForce cards that have been out a lot longer—but it's doing better than Nvidia's other 40-series desktop cards and better than every one of AMD's RX 7000-series cards put together.</p>\n<p>The release of the RTX 4070 Super should help bring the enthusiast commentariat version of reality and the Steam Hardware Survey's version of reality into closer sync with one another. At the same $599 price—still more than the $499 of the 2070 Super or 3070, but not higher than the 4070—you get performance that Nvidia says is more in line with the RTX 3090. And the power efficiency remains quite impressive, though power use overall is up just a bit from the regular 4070.</p></div><p><a href=\"https://arstechnica.com/?p=1995760#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1995760&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"74faf8b192502d91ed66d66b80e96f34c4d451d98c4739bbf95aab69d7b65c59","category":"Tech"}