{"title":"Catalytic Pyrolysis of Low-Density Polyethylene Waste","link":"https://www.preprints.org/manuscript/202407.1022/v1","date":1720765009000,"content":"Plastics, once regarded as a revolutionary material shaping modern society, now poses an unprecedented threat to our environment. Household solid waste sorting stations produce several fractions, one of which contains a high concentration of Low-Density Polyethylene (LDPE) film waste (packaging, sunscreen film, etc.). This fraction is difficult to recycle because it contains quite a lot of impurities. Usually, it is sent to the cement factories that burn it together with other fuels. However, with some processing techniques such catalytic pyrolysis this fraction could be valorized. In this paper the experiments which were carried out at a laboratory scale installation, in batches with a processing capacity of 1-3 kg of waste. The pyrolysis reactor is connected to a distillation column giving the possibility to separate the fractions. The gaseous and liquid fractions were characterized by GC-FID-TCD (gases) and GC-MS (liquids) analysis. Natural catalysts such as bentonite or clinoptilolite were studied and used in the melting of plastic mass to simplify the process as much as possible. To test the activity of the catalysts, the pyrolysis of LDPE granules was initially studied. It was found that natural zeolites are much more active than bentonite and that a minimum concentration of 5-10% is needed to have a positive effect on the composition of the fractions (increasing the weight of the light fractions C1-C6, C6-C10 and C11-C13) in relation to the heavy fractions C13-C20 and C20+. Catalytic pyrolysis gives a completely different distribution of light hydrocarbons. The best catalyst selected from LDPE lab experiments, was then tested upon the pyrolysis of plastic film waste obtained by a waste treatment plant. The research objective reported in this paper was to obtain a fraction of combustible gases in the largest possible proportion, which can be much easier exploited by burning in an engine that drives an electric generator.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"74fa1a05f9c843983b0450e9a5929afc67dc6196ec451e5ac280db346f55cf95","category":"Interdisciplinary"}