{"title":"Retention of per- and polyfluoroalkyl substances by syringe filters","link":"http://link.springer.com/10.1007/s10311-024-01718-2","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Per- and polyfluoroalkyl substances (PFAS) are being increasingly measured in water and wastewater due to emerging toxicity concerns and strict regulatory limits. Previous studies have filtered water samples to remove suspended solids before PFAS analysis. However, filtration may introduce negative bias to measured PFAS concentrations. Using a well-controlled syringe pump assembly, we evaluated retention of six perfluoroalkyl carboxylates, three perfluoroalkyl sulfonates, one fluorotelomer sulfonate, and two perfluorooctane sulfonamides by glass-fiber, glass-fiber cellulose acetate, nylon, polyethersulfone, polypropylene, polyvinylidene fluoride/ difluoride, and surfactant-free cellulose acetate filters. The impacts of water quality and operational parameters were also investigated for select filter types. We found that PFAS were retained on all filters, with the glass-fiber cellulose acetate filters demonstrating the lowest retention. For all filters, PFAS retention was linearly related to chain length and hydrophobicity above certain thresholds (<em>i.e.</em>, log D higher than 1.5). Importantly, more PFAS were retained at low filtrate volumes, and ~ 30 mL filtrate was required before the retention efficiencies stabilized. Solution pH only affected the retention of perfluorooctane sulfonamides. Pore size (<em>i.e.</em>, 0.20, 0.45, 0.70 µm), filtration rate (<em>i.e.</em>, 0.5, 1.0 mL min<sup>−1</sup>), and PFAS concentration (<em>i.e.</em>, 10, 100 µg L<sup>−1</sup>), did not exert major influences on PFAS retention. The presence of dissolved organic matter improved PFAS permeation. Based on the reported results, filtration introduces bias and is not recommended for sample pretreatment.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"74ff72f7eff5d5e80572a37bd96c54b24b27ac0097ac73cd7f168c5011a9f88a","category":"Environment"}