{"title":"Evaluating the impact of COVID-19 on routine childhood immunizations coverage in Zambia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003407","date":1722348000000,"content":"<p>by Kelvin Mwangilwa, Charles Chileshe, John Simwanza, Musole Chipoya, Davie Simwaba, Nathan Kapata, Mazyanga Lucy Mazaba, Nyuma Mbewe, Kapina Muzala, Nyambe Sinyange, Isaac Fwemba, Roma Chilengi</p>\r\n\r\nThere are growing concerns about the comeback of vaccine-preventable diseases. Epidemics exert shocks which affect other health performance indicators such as routine immunizations. Early model forecasts indicate decreased use of immunization services, which puts children at greater risk. Concerns about an increase in morbidity and mortality for illnesses other than COVID-19, particularly in children missing routine vaccinations, are of public health interest. In this study, we evaluate COVID-19 effects on the uptake of routine immunization in Zambia.This was an interrupted time series study. National data on routine immunization coverage between January 2017 and December 2022 were analyzed. Interrupted time series analysis was performed to quantify changes in immunization utilization. To determine if changes in the underlying patterns of utilization of immunization service were correlated with the commencement of COVID-19, seasonally adjusted segmented Poisson regression model was utilised.Utilization of health services was similar with historical levels prior to the first case of COVID-19. There was a significant drop in immunization coverage for measles dose two (RR, 0.59; 95% CI: 0.43–0.80). A decreased slope was observed in immunization coverage of Rotavirus dose one (RR, 0.97; 95% CI: 0.96–0.98) and Rotavirus dose two (RR, 0.97; 95% CI: 0.96–0.98). A growing slope was observed for Oral Poliovirus two (RR, 1.007; 95% CI: 1.004–1.011) and Oral Poliovirus three (RR, 1.007; 95% CI: 1.002–1011). We also observed a growing slope in BCG Bacille Calmette-Guerin (BCG) (RR, 1.001; 95% CI: 1.000–1011) and Pentavalent one (RR, 1.00; 95% CI: 1.001–1008) and three (RR, 1.004; 95% CI: 1.001–1008).The COVID-19 pandemic has had a number of unintended consequences that have affected the use of immunization services. Ensuring continuity in the provision of health services, especially childhood immunization, during pandemics or epidemics is crucial. Therefore, Investing in robust healthcare infrastructure to withstand surges, training and retaining a skilled workforce capable of handling emergencies and routine services simultaneously is very cardinal to avoid vaccine-preventable diseases, causing long-term health effects especially child mortality.","author":"Kelvin Mwangilwa","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7500df4a38938173a59124832da55e61fa8dd3370459b963c458ab01cd6f6107","category":"Environment"}