{"title":"Samsung Fulfilling Nearly All of Apple's iPhone 15 OLED Display Orders","link":"https://www.macrumors.com/2023/09/12/iphone-15-oled-display-orders-dominated-by-samsung/","date":1694519100000,"content":"Samsung appears to have secured a monopoly in the supply of <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> displays this year, after Chinese-based BOE once again failed to get formal approval from Apple to mass produce the required OLED panels.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-15-Pro-Blue-Front-Perspective-Feature-Orange.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nBOE, which was supposed to be supplying OLED displays for the standard ‌iPhone 15‌ and larger ‌iPhone 15‌ Plus, was awaiting conditional approval from Apple in <a href=\"https://www.macrumors.com/2023/03/27/apple-samsung-oled-iphone-15-panels/\">March</a>, but it was delayed after the manufacturer experienced problems with light leakage around the portion of the OLED display where the pill and hole cutouts secure the space necessary for the TrueDepth camera and <a href=\"https://www.macrumors.com/guide/mask-face-id/\">Face ID</a>.\r<br />\n\r<br />\nHowever, the issues appear to have been so entrenched that Apple ended up dropping the order, leading BOE to miss its chance to become one of the initial suppliers. According to Korea's <a href=\"https://m.etnews.com/20230912000100\"><em>ETNews</em></a>, the amount originally allocated to BOE has been transferred to Samsung Display.\r<br />\n\r<br />\nLG Display, which is supplying OLED panels for both <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> models, has received conditional approval only for the smaller ‌iPhone 15 Pro‌, with formal approval for the ‌iPhone 15 Pro‌ Max still expected this month. That leaves Samsung as the only current supplier of OLED panels for all four ‌iPhone 15‌ models, with its production volume a lot bigger than originally planned.\r<br />\n\r<br />\nAs a result, Samsung is said to be increasing orders for related materials and parts, placing 20% more orders for September and October than it did in August alone.\r<br />\n\r<br />\nSamsung is supplying low-temperature polycrystalline silicon (LTPS) thin-film transistor (TFT) panels for the standard ‌iPhone 15‌ and ‌‌iPhone 15‌‌ Plus models, suggesting that the more affordable devices will continue to lack ProMotion support and an always-on display option like Apple's Pro models have.\r<br />\n\r<br />\nMeanwhile, the higher-tier ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max models are using low-temperature polycrystalline (LTPO) TFT OLED panels. The LPTO panels feature 120Hz ProMotion support and a 1Hz refresh rate capability that enables an idle Lock Screen to stay visible without significantly impacting battery.\r<br />\n\r<br />\nAlong with the <a href=\"https://www.macrumors.com/guide/dynamic-island/\">Dynamic Island</a> coming to the ‌iPhone 15‌ and ‌iPhone 15‌ Plus, one rumor in February <a href=\"https://www.macrumors.com/2023/02/22/iphone-15-more-power-efficient-oled-displays-rumor/\">suggested</a> that all ‌iPhone 15‌ models could be equipped with a more power-efficient OLED display driver chip manufactured on a 28nm process, allowing for reduced power consumption that could ultimately lead to improved battery life across the board.\r<br />\n\r<br />\nWhile ‌iPhone 15 Pro‌ models are still expected to feature improved battery life thanks to the inclusion of a faster A17 chip built on the new 3-nanometer production process, it is not known whether a new display driver is contributing to the Pro models' improved power efficiency.\r<br />\n\r<br />\nAs for BOE, an unnamed official in the display industry told <em>ETNews</em> it remained uncertain whether the manufacturer's quality approval will be made in 2023, and even if it was approved, very few quantities would be allocated this year, given Samsung's supply dominance in this area.<div>Tags: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a>, <a href=\"https://www.macrumors.com/guide/boe/\">BOE</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/12/iphone-15-oled-display-orders-dominated-by-samsung/\">Samsung Fulfilling Nearly All of Apple's iPhone 15 OLED Display Orders</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsung-fulfilling-nearly-all-of-apples-iphone-15-oled-display-orders.2401135/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"750119a3b545acf4ca69aa3c02317f9d374a4cbc740b94b6860716ef067c53c1","category":"Apple"}