{"title":"Apple Vision Pro is doomed because everyone is using it wrong","link":"https://www.macworld.com/article/2227609/apple-vision-pro-doomed-using-wrong.html","date":1707219000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The Vision Pro has only been out a few days now and already the Macalope is afraid he has to put his hoof down. Please, no more wearing the Vision Pro in public, at least until we can figure out what’s going on.</p>\n\n\n\n<p>That should only take a decade or so.</p>\n\n\n\n<p>The Macalope’s not going to link to them but so far we’ve seen people eating a meal in a restaurant wearing the Vision Pro, people crossing the street in the Vision Pro, and people driving down the highway wearing the Vision Pro.</p>\n\n\n\n<p>Not surprisingly, some of these turned out to be the same guy. That’s an odd coincidence, isn’t it?</p>\n\n\n\n<p>There is definitely a lot of performative behavior going on here. If you’re wearing a Vision Pro driving down the highway in a Cybertruck on autodrive and making gestures that don’t actually do anything in visionOS, then you’re performing. Some of these people have subsequently admitted to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://gizmodo.com/apple-vision-pro-tesla-driver-arrested-autopilot-1851224830&amp;xcust=1-1-2227609-1-0-0&amp;sref=https://www.macworld.com/feed\">making up fake scenarios</a> with the device to get social media attention.</p>\n\n\n\n<p>People doing things for <em>attention?</em> Well. Now the Macalope has seen everything.</p>\n\n\n\n<p>Are they deliberately trying to make you hate the Vision Pro? Possibly, but that’s probably less the case than they are simply trying to promote themselves.</p>\n\n\n\n<p>How should we treat these Vision Pro lapses in judgement? After spending years railing against Google Glass, the Macalope can’t very well suddenly say it’s okay to be out and about wearing a Vision Pro.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>Wait, can he? No, seems like that would be lazy.</p>\n\n\n\n<p>The one thing he’ll say for laziness, though, is it’s really easy. But, no, he’s not going to do that.</p>\n\n\n\n<p>There are, of course, some big differences between Glass and Vision Pro. Glass was an aggressive social device (the Macalope is trying not to use “in your face” here but it’s really hard) that included facial recognition technology. Vision Pro is, at least currently, more aimed at media consumption and productivity. It still is capable of capturing video, of course, but it’s also far more obtrusive, certainly from a distance. No one’s going to secretly record you entering that store that got canceled because of the owner’s odious views on Taylor Swift and Chad McFootball (I think that’s his name). You can see people wearing a Vision Pro coming from a mile away. And then safely cross the street to avoid them. Less because the Vision Pro is such a threat to you and more because anyone wearing one out for a stroll is probably not someone you want to try to strike up a conversation with. All they want to talk about is their Vision Pro.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/UvkgmyfMPks?si=Dog3ZNOxEeH_ax2s&amp;xcust=1-1-2227609-1-0-0&amp;sref=https://www.macworld.com/feed\">Casey Neistat</a> performed an experiment using the Vision Pro on the streets of New York that was somewhat charming. Toward the end of his video, Neistat notes that the Vision Pro in its current form is a glimpse of the future, a future that will feature a much smaller headset. And when that happens, you can expect to see more and more Vision Pros (and similar devices) in the wild. This is a future that some are <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://disconnect.blog/apples-vision-pro-lacks-any-real-vision/&amp;xcust=1-1-2227609-1-0-0&amp;sref=https://www.macworld.com/feed\">actively arguing against</a>.</p>\n\n\n\n<p>To be honest, the Macalope is pretty leery of it, too, and is pretty opposed to it in public. Want to use the Vision Pro in the privacy of your own home? Knock yourself out. Spatial computing currently seems to have some rough edges but it’s an interesting new interaction model. You want to watch a movie or otherwise check out on an airplane? Yeah, okay. Being stuck in a tin can hurling through the sky with 150 strangers is an acceptable time to check out.</p>\n\n\n\n<p>But you want to be in a headset and interact with the horny one on the street? Hard pass. Unless we’re specifically talking about the Vision Pro for a bit. But that 15 minutes is gonna be it.</p>\n\n\n\n<p>The slippery slope to being fully sucked into a digital world has turned into a greased water flume at an off-brand theme park, fast and dangerous. There is a time and a place for everything. The Vision Pro’s is behind closed doors.</p>\n\nVirtual Reality, Wearables</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7504fe4ef76853ae0bb11da6b0886f4d1867334e2de618dbfad8d10361310ecb","category":"Apple"}