{"title":"Climate change and its consequences on the climatic zoning of Coffea canephora in Brazil","link":"http://link.springer.com/10.1007/s10668-023-03051-0","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Coffee production has a large share in Brazilian agribusiness and a cultural and social importance in the country. Worldwide, Brazil is the largest producer of arabica coffee and the second largest of canephora species. In 2020, national production was 14.3 million bags of canephora coffee. Few studies on canephora coffee adaptation to climate changes can be found in the literature. Thus, our goal was to identify areas suitable for <em>Coffea canephora</em> cultivation in Brazil under CMIP-5 climate change framework. The study was carried out for the entire country using data on average air temperature data for the entire year, November, and the coldest month, as well as average annual accumulated water deficit for the period of 1960–2020. These data were gathered from the Meteorological Database for Teaching and Research (BDMEP) of the National Institute of Meteorology of Brazil-INMET (Brazil 1992). Furthermore, BCC-CSM1.1 climate model was used at 125 × 125 km resolution to simulate future climate using WorldClim 2 data for 2041–2080, in the Representative Concentration Pathway (RCP) scenarios 2.6, 4.5, 6.0, and 8.5. Potential climate changes can negatively impact canephora coffee plantations in all CMIP5 RCP scenarios studied. The BCC-CSM1.1 scenarios showed a 65% reduction in total areas suitable for coffee cultivation in Brazil. Rondônia and Bahia were states with the greatest impact of climate change since they had the largest reduction in areas suitable for canephora coffee growth. Currently, both states are major <em>C. canephora</em> producers and can therefore directly compromise regional economy. Thermal excess was the most common class for future scenarios, averaging 56.76% of the entire country.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"7510b423cff04be7dfb1d4da7e46434026e32a0780649c9a783f3719c8c8a1b4","category":"Environment"}