{"title":"From environmental responses to adaptation: the roles of plant lncRNAs","link":"https://academic.oup.com/plphys/article/195/1/232/7584821?rss=1","date":1705795200000,"content":"<span><div>Abstract</div>As sessile organisms, plants are continuously exposed to heterogeneous and changing environments and constantly need to adapt their growth strategies. They have evolved complex mechanisms to recognize various stress factors, activate appropriate signaling pathways, and respond accordingly by reprogramming the expression of multiple genes at the transcriptional, post-transcriptional, and even epigenome levels to tolerate stressful conditions such as drought, high temperature, nutrient deficiency, and pathogenic interactions. Apart from protein-coding genes, long non-coding RNAs (lncRNAs) have emerged as key players in plant adaptation to environmental stresses. They are transcripts larger than 200 nucleotides without protein-coding potential. Still, they appear to regulate a wide range of processes, including epigenetic modifications and chromatin reorganization, as well as transcriptional and post-transcriptional modulation of gene expression, allowing plant adaptation to various environmental stresses. LncRNAs can positively or negatively modulate stress responses, affecting processes such as hormone signaling, temperature tolerance, and nutrient deficiency adaptation. Moreover, they also seem to play a role in stress memory, wherein prior exposure to mild stress enhances plant ability to adapt to subsequent stressful conditions. In this review, we summarize the contribution of lncRNAs in plant adaptation to biotic and abiotic stresses, as well as stress memory. The complex evolutionary conservation of lncRNAs is also discussed and provides insights into future research directions in this field.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"752a542422f635466d6b898a1c8f1346a069a021c35d4a9143c2137aa498873a","category":"Environment"}