{"title":"Do Magnetic murmurs guide birds? A directional statistical investigation for influence of Earth’s Magnetic field on bird navigation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304279","date":1717596000000,"content":"<p>by Prithwish Ghosh, Debashis Chatterjee, Amlan Banerjee, Shiladri Shekhar Das</p>\r\n\r\nThis paper delves into the intricate relationship between changes in Magnetic inclination and declination at specific geographical locations and the navigational decisions of migratory birds. Leveraging a dataset sourced from a prominent bird path tracking web resource, encompassing six distinct bird species’ migratory trajectories, latitudes, longitudes, and observation timestamps, we meticulously analyzed the interplay between these avian movements and corresponding alterations in Magnetic inclination and declination. Employing a circular von Mises distribution assumption for the latitude and longitude distributions within each subdivision, we introduced a pioneering circular-circular regression model, accounting for von Mises error, to scrutinize our hypothesis. Our findings, predominantly supported by hypothesis tests conducted through circular-circular regression analysis, underscore the profound influence of Magnetic inclination and declination shifts on the dynamic adjustments observed in bird migration paths. Moreover, our meticulous examination revealed a consistent adherence to von Mises distribution across all bird directions. Notably, we unearthed compelling correlations between specific bird species, such as the Black Crowned Night Heron and Brown Pelican, exhibiting a noteworthy negative correlation with Magnetic inclination and a contrasting positive correlation with Magnetic declination. Similarly, the Pacific loon demonstrated a distinct negative correlation with Magnetic inclination and a positive association with Magnetic declination. Conversely, other avian counterparts showcased positive correlations with both Magnetic declination and inclination, further elucidating the nuanced dynamics between avian navigation and the Earth’s magnetic field parameters.","author":"Prithwish Ghosh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"752d25daefcbb26c593ac97dde7482522aff64273d1f29775af6c64295ed4257","category":"Interdisciplinary"}