{"title":"Preclinical safety assessment of modified gamma globin lentiviral vector-mediated autologous hematopoietic stem cell gene therapy for hemoglobinopathies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306719","date":1720447200000,"content":"<p>by Mohammad Shadid, Archana Shrestha, Punam Malik</p>\r\n\r\nPreviously, we reported the development of a human <sup>A</sup>γ-globin gene lentivirus (LV), G<sup>b</sup>G, which expresses high levels of HbF to correct the sickle cell anemia (SCA) phenotype in the Berkeley SCA mouse model, and then modified the γ-globin gene by substituting glycine at codon 16 with aspartic acid in the <sup>A</sup>γ-globin gene to generate G<sup>b</sup>G<sup>M</sup> LV. In the present study, we evaluated the long-term safety of human <sup>A</sup>γ-globin gene carrying G<sup>b</sup>G<sup>M</sup> LV in wild-type mice after primary and secondary transplants of G<sup>b</sup>G<sup>M</sup>-modified hematopoietic stem cells (HSC) over 18 months. The safety of the G<sup>b</sup>G<sup>M</sup> bone marrow transplant was assessed by monitoring the effects on body weight, hematology, histopathology, malignancy formation, and survival. Mice transplanted with Mock-transduced and spleen focus forming virus (SFFV) γ-retroviral vector (RV)-transduced HSC served as negative and positive controls, respectively. The mean donor-cell engraftment was comparable across Mock, G<sup>b</sup>G<sup>M</sup> LV, and SFFV RV groups. There were no significant differences in body weight, clinical signs, immunophenotype, or histopathology in the G<sup>b</sup>G<sup>M</sup>-treated mice compared to controls. Four SFFV RV-treated mice, but none of the G<sup>b</sup>G<sup>M</sup>-treated mice, developed donor-derived, vector-positive lymphomas as demonstrated by flow cytometry analysis and in situ hybridization. These results highlight the safety of the administration of G<sup>b</sup>G<sup>M</sup> LV-modified HSC with long-term follow-up after primary and secondary transplants in mice. This data supported the initiation of phase 1/2 first-in-human SCA clinical trial in the United States.","author":"Mohammad Shadid","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"752fbd398b021753a5594684635a974ba9dedd2cfa5d4b98f255adf826dfbeb4","category":"Interdisciplinary"}