{"title":"On Scanning QR Codes With Your iPhone","link":"https://www.macrumors.com/2023/06/19/qr-code-scanning-easier-ios-17/","date":1687215133000,"content":"\n<p>Tim Hardwick, on a tweaked feature in iOS 17 beta 1:</p>\n\n<blockquote>\n  <p>Apple in iOS 13 decided to redesign QR code scanning so that the\nlink appeared as a yellow button within the camera viewfinder\nitself. However, in doing so, it created a new problem: The button\nwould rove around in the viewfinder if the camera lens was also in\nmotion, which made tapping it even more tricky than before.</p>\n\n<p>Thankfully, in iOS 17, Apple has made another small, and this time\nwelcome, change that improves the situation immeasurably. Now when\nyou scan a QR code, the link button automatically appears at the\nbottom of the Camera interface. So instead of chasing the dancing\nlink around the viewfinder, you can simply tap its fixed location\nabove the shutter button.</p>\n</blockquote>\n\n<p>My tip for scanning QR codes is not to use the Camera app at all. Instead, enable iOS’s hidden built-in Code Scanner app in Contol Center. Go to Settings → Control Center, and under More Controls, enable Code Scanner. (This is also a good reminder that you can disable Control Center items you seldom use.) Now when you encounter a QR code, just pull down Control Center and use the Code Scanner app.</p>\n\n<p>Worth keeping in mind, too, that when you use the regular Camera app to scan a QR code, if you open the link, it opens in Safari. With the Code Scanner app in Control Center, links open in a sandboxed in-app web view, which is more private. The only downside is that if you want to keep the opened the page around, you’ll need to open it in Safari from within Code Scanner.</p>\n\n<p>Code Scanner is a fantastic little “do one thing and do it well” app, but because you can only get to it via Control Center but it’s not shown in Control Center by default, most people don’t even know it exists. It’s truly a hidden gem.</p>\n\n<p><strong>Update:</strong> Turns out you can also launch the Code Scanner app <a href=\"https://daringfireball.net/misc/2023/06/code-scanner-via-search.jpeg\">by searching for it on the iOS home screen</a>. Nice!</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/19/qr-codes-iphone\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"75360a097e0969763c81daf4805f29d4d97aac4da15f9ae13388ef1b12c16a9d","category":"Tech"}