{"title":"Alternative reproductive tactics and evolutionary rescue","link":"https://academic.oup.com/evlett/article/8/4/539/7630433?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>Almost all life on earth is facing environmental change, and understanding how populations will respond to these changes is of urgent importance. One factor that is known to affect the speed by which a population can evolve when faced with changes in the environment is strong sexual selection. This increases the adaptive capacity of a population by increasing reproductive skew toward well-adapted (usually) males who will, on average, be best able to compete for matings. This effect could potentially be disrupted when males pursue alternative reproductive tactics (ARTs), whereby males within a species exhibit qualitatively different behaviors in their pursuit of matings. ARTs are diverse, but one common class is those expressed through condition-dependent polyphenism such that high-quality, well-adapted males compete aggressively for mates and low-quality, poorly adapted males attempt to acquire matings via other, nonaggressive behaviors. Here, using an individual-based modeling approach, we consider the possible impacts of ARTs on adaptation and evolutionary rescue. When the ART is simultaneous, meaning that low-quality males not only engage in contests but also pursue other tactics, adaptive capacity is reduced and evolutionary rescue, where a population avoids extinction by adapting to a changing environment, becomes less likely. This is because the use of the ART allows low-quality males to contribute more maladaptive genes to the population than would happen otherwise. When the ART is fixed, however, such that low-quality males will only use the alternative tactic and do not engage in contests, we find the opposite: adaptation happens more quickly and evolutionary rescue when the environment changes is more likely. This surprising effect is caused by an increase in the mating success of the highest quality males who face many fewer competitors in this scenario—counterintuitively, the presence of males pursuing the ART increases reproductive skew toward those males in the best condition.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"75490a05ef63a62e1d16585fe2ba550de558455f1964c2eab77886ae3482cfed","category":"Environment"}