{"title":"Large Ensemble Exploration of Global Energy Transitions Under National Emissions Pledges","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004754?af=R","date":1729663416000,"content":"<h2>Abstract</h2>\n<p>Global climate goals require a transition to a deeply decarbonized energy system. Meeting the objectives of the Paris Agreement through countries' nationally determined contributions and long-term strategies represents a complex problem with consequences across multiple systems shrouded by deep uncertainty. Robust, large-ensemble methods and analyses mapping a wide range of possible future states of the world are needed to help policymakers design effective strategies to meet emissions reduction goals. This study contributes a scenario discovery analysis applied to a large ensemble of 5,760 model realizations generated using the Global Change Analysis Model. Eleven energy-related uncertainties are systematically varied, representing national mitigation pledges, institutional factors, and techno-economic parameters, among others. The resulting ensemble maps how uncertainties impact common energy system metrics used to characterize national and global pathways toward deep decarbonization. Results show globally consistent but regionally variable energy transitions as measured by multiple metrics, including electricity costs and stranded assets. Larger economies and developing regions experience more severe economic outcomes across a broad sampling of uncertainty. The scale of CO<sub>2</sub> removal globally determines how much the energy system can continue to emit, but the relative role of different CO<sub>2</sub> removal options in meeting decarbonization goals varies across regions. Previous studies characterizing uncertainty have typically focused on a few scenarios, and other large-ensemble work has not (to our knowledge) combined this framework with national emissions pledges or institutional factors. Our results underscore the value of large-ensemble scenario discovery for decision support as countries begin to design strategies to meet their goals.</p>","author":"Jacob Wessel, \nGokul Iyer, \nThomas Wild, \nYang Ou, \nHaewon McJeon, \nJonathan Lamontagne","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"755c6601c49edf3bd1f72456c1367930fea8e4e0c1ce959e7465477a4a6a5b41","category":"Environment"}