{"title":"Rainfall, peak river flow and flow variability drive spatio‐temporal change in the extent of riparian woodland in an African protected area savanna","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2685?af=R","date":1720519027000,"content":"<h2>Abstract</h2>\n<p>Verbal accounts, supported by limited ground-based and satellite images, reveal decreasing riparian woodland and a loss of large trees along the rivers of the Kruger National Park (KNP, South Africa) over the last century. A multi-decadal analysis was conducted to identify trends in extent and possible drivers of riparian woodland change. Aerial and satellite imagery (1936–2018) were used to quantify changes in the extent of riparian woodland at 18 sites on 14 rivers in KNP. These changes were compared in a multivariate time-series with river flow and local rainfall. Particular attention was paid to cumulative flow effects, as well as the frequency and magnitude of large infrequent disturbances such as droughts and floods. Riparian tree cover fluctuated over the time period, and the trajectory of change varied between sites. Most (11) sites experienced a decrease in overall riparian tree cover over ~80 years, with these declines being significant at six sites. Peak flow and maximum rainfall events were strongly associated with these decreases, indicating that flood events are potentially the biggest driver of tree loss from the system. Indeed, the mega-flood event of 2000 and subsequent large floods have resulted in substantial declines in riparian woodland extent in recent decades. Alternatively, flow variability and cumulative rainfall significantly influenced woodland expansion in isolated cases. With global change models predicting more erratic rainfall and an increased likelihood of large infrequent disturbances, together with increasing demands to abstract more water, the long-term future of these dynamic habitats and their associated biota here is uncertain.</p>","author":"J. A. Weiss, \nM. D. Cramer, \nD. I. Thompson","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"755f5301848d3796f6efb0252e32675589525a12da850b89e40432688a0b2e2e","category":"Environment"}