{"title":"Webb telescope probes the chemistry in a hot gas giant’s atmosphere","link":"https://arstechnica.com/?p=1934727","date":1682537709000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Screen-Shot-2023-04-26-at-2.48.02-PM-800x368.png\" alt=\"Image of several orbits showing their relative position.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/Screen-Shot-2023-04-26-at-2.48.02-PM.png\">Enlarge</a> <span>/</span> WASP-39b is much closer to its host star than any of our Solar System's planets are to the Sun. (credit: <a href=\"https://exoplanets.nasa.gov/exoplanet-catalog/5673/wasp-39-b/\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Up until a few decades ago, the only planets we knew about were in our own Solar System, and that shaped the way we thought about planet formation and planetary chemistry. Now, with the identification of a large population of exoplanets, we have a lot of examples of things we've never seen before: mini Neptunes, super Earths, and hot Jupiters abound.</p>\n<p>Figuring out what all these new things tell us is a bit of a mixed bag. It's relatively easy to determine a planet's density and how much energy it will receive from its host star. But a given density is typically compatible with a range of materials—solid rock can work out to be the same as a large metal core and puffy atmosphere, for example. And the planet's temperature will depend heavily on things like the composition of its atmosphere and how much light its surface reflects.</p>\n<p>So figuring out what we're looking at when we see data on an exoplanet is hard. But with the successful commissioning of the Webb Space Telescope, we're starting to get a bit further. In Wednesday's issue of Nature, scientists used data from the new telescope to infer the chemistry of a hot gas giant and find that there are things going on that we wouldn't see in our own Solar System.</p></div><p><a href=\"https://arstechnica.com/?p=1934727#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934727&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7560c8eb4763fb996c22655bc20893562447bd89156dbf48c0ad63234395a62e","category":"Tech"}