{"title":"Mark Zuckerberg อัพเดต: Threads ต้องหาวิธีดึงผู้ใช้งานเพิ่มขึ้น, มวยกรงกับ Elon \"ยังไม่แน่ใจ\"","link":"https://www.blognone.com/node/135042","date":1690560656000,"content":"<div><div><div><p>Reuters รายงานเนื้อหาจากการประชุมพนักงานทาวน์ฮอลล์ของ Meta หลังจากบริษัท<a href=\"https://www.blognone.com/node/135021\">รายงานผลประกอบการไตรมาส</a> ซึ่งบริษัทมีทิศทางรายได้เติบโตดี กำไรเพิ่มขึ้น</p>\n<p>ซีอีโอ Mark Zuckerberg พูดถึง Threads แอปโซเชียลตัวหนังสือที่หวังแข่งกับ Twitter/X ของ Elon Musk ว่าแม้ตอนนี้มีคนสมัครใช้งานมากกว่า 100 ล้านบัญชี แต่จะดีกว่านี้ถ้าทั้งหมดหรือสักครึ่งหนึ่ง ยังใช้งานแอปนี้อยู่ตลอด ซึ่งเรายังไปไม่ถึงจุดนั้น แม้เป็นเรื่องไม่เกินคาด แต่เขาก็หวังว่าตัวเลขการใช้งานจะดีขึ้น เมื่อแพลตฟอร์มใส่ฟีเจอร์ใหม่มากขึ้น เช่น การใช้งานผ่านเดสก์ท็อป หรือปรับปรุงระบบเสิร์ช</p>\n<p>Chris Cox หัวหน้าฝ่ายผลิตภัณฑ์เสริมประเด็นนี้ว่า แนวทางปรับปรุงเรื่องนี้ อาจใส่เทคนิคใหม่เพื่อดึงให้คนใช้งานมากขึ้น เช่น นำโพสต์สำคัญจาก Threads ไปแสดงใน Instagram เป็นต้น</p>\n<p>Zuckerberg ยังตอบคำถามเรื่อง Metaverse เขาคาดว่าเทคโนโลยีนี้จะมีการใช้งานแพร่หลายหลังปี 2030 เป็นต้นไป ตอนนี้บริษัทพัฒนาเทคโนโลยีต่อเนื่อง เพื่อให้พร้อมที่สุดในวันที่ทุกอย่างลงตัว รวมทั้งยืนยันว่าการดำเนินงานส่วนนี้ยังเป็นไปตามแผนกำหนด</p>\n<p>ส่วน Cox ยังอัพเดตตัวเลขของ <a href=\"https://www.blognone.com/node/134893\">Llama 2 โมเดล AI ถามตอบ</a>ที่โอเพนซอร์ส และใช้งานทางการค้าได้เลยหากแพลตฟอร์มมีผู้ใช้งานน้อยกว่า 700 ล้านคน ว่าตอนนี้มีรีเควสของใช้งานแล้วมากกว่า 150,000 ครั้ง</p>\n<p>สุดท้าย Zuckerberg ตอบคำถามพนักงานเรื่อง<a href=\"https://www.blognone.com/node/134488\">ศึกมวยกรงกับ Elon Musk</a> ว่า ยังไม่แน่ใจจะสามารถจัดได้หรือไม่</p>\n<p>ที่มา: <a href=\"https://www.reuters.com/business/media-telecom/meta-plans-retention-hooks-threads-more-than-half-users-leave-app-2023-07-28/\">Reuters</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3ed877eb414e9f61d980683d06a20d61.png\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/threads\">Threads</a></div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/metaverse\">Metaverse</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7568b222fbed81c602b0468899738c4e370bff408d9f37f7147938801fcd4789","category":"Thai"}