{"title":"Apple buying Disney isn’t the fairy tale it once was","link":"https://www.macworld.com/article/2032120/apple-disney-merger-netflix-growth.html","date":1692181800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The close corporate ties between Disney and Apple have created all sorts of speculation over the years that the two companies might end up being <em>one</em> company. Steve Jobs sat on the Disney board, and Disney CEO Bob Iger sat on Apple’s. In his memoir, Iger even suggested that had Jobs lived, the two companies might have combined.</p>\n\n\n\n<p>That speculation was always ridiculous to me. But these are different times, and Disney and Apple are very different companies than they were a couple of decades ago. This is why, when <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.hollywoodreporter.com/business/business-news/disney-apple-deal-1235559416/&amp;xcust=1-1-2032120-1-0-0&amp;sref=https://www.macworld.com/feed\">The Hollywood Reporter</a> took the possibility of an Apple purchase of Disney seriously, I realized that the speculation I used to roll my eyes at when I was the editor of Macworld now seems…not that implausible, actually.</p>\n\n\n\n<h2>Apple of your eye</h2>\n\n\n\n<p>Apple has spent the last decade transforming right before our eyes, perhaps so slowly that we didn’t even notice. Today’s Apple is not the company Jobs left behind. Apple generated $108 billion in revenue in fiscal 2011. In its last four quarters–and keep in mind, these were middling quarters in the eyes of Wall Street–it generated $93 billion <em>in profit</em> (on total revenue of $384 billion).</p>\n\n\n\n<p>The iPhone alone has become a $160 billion-a-year business. The Mac is at a high water mark, the iPad has recovered to post solid numbers in the last few years, and the new “Wearables, Home and Accessories” product category–buttressed by the Apple Watch and AirPods–has eclipsed them both. And then there’s Apple’s market cap, which this summer became the first in history to reach $3 trillion.</p>\n\n\n\n<p>This is not the Apple of 1987, or 1997, or 2007. The Apple of the 2020s is one of the world’s most valuable and profitable companies. It has enormous resources at its disposal, and its investors still expect the company to keep growing.</p>\n\n\n\n<h2>Wishing on a dimming star</h2>\n\n\n\n<p>Disney is also not the company it was. The advent of streaming media challenged the company’s business model in numerous ways. As the owner of cable and broadcast TV channels–most notably ABC and ESPN–Disney has been hit hard by lost revenue due to people cutting the cord and dropping their cable and satellite TV subscriptions.</p>\n\n\n\n<p>To build for the future, Iger invested in launching Disney+, bought 20th Century Fox, started the process of integrating Hulu into Disney’s offerings, and launched an ancillary ESPN streaming service. The result was some enormous expenses, but for a while investors were okay with that.</p>\n\n\n\n<p>Late last year, though, Wall Street got impatient with entertainment companies losing money in order to stake out ground in the streaming wars. All of a sudden, companies like Disney are under huge scrutiny to boost profits and growth (while presumably also planning for the future). It’s the reason Iger’s successor, Bob Chapek, was fired–and Iger returned to the head of Disney.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Disney+ home screen on a TV\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/05/disneyplus.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>Disney has invested heavily in streaming services, but its investors are getting impatient about a return on that investment.</p></figcaption></figure><p>Disney</p></div>\n\n\n\n<p>It’s a tough problem to solve, even for a CEO as accomplished as Iger. And it’s why there are scenarios where Iger sells off portions of Disney’s assets in order to better position itself–whether that’s for the future, or just for a sale.</p>\n\n\n\n<h2>Tech giants eat first</h2>\n\n\n\n<p>One of the key observations in the Hollywood Reporter piece comes from an “industry veteran” quoted anonymously: “There will end up being three or four platforms and everybody else gets hollowed out and acquired… There will be Apple, Amazon, Netflix and one other.”</p>\n\n\n\n<p>This is, perhaps, the story of the entertainment business in the 2020s: tech companies like Apple, Amazon, and Google are so huge, and have access to so much money, that they’re simply in a dominant position at a moment when entertainment companies are weak. Apple and Amazon have dabbled in streaming media, launching original content services and buying sports rights, but they’re playing a larger game. They want to grow their ecosystems as a part of a larger strategy. Companies like Disney, Warner Bros. Discovery, and NBC Universal don’t have that luxury–the content piece is their entire strategy.</p>\n\n\n\n<p>Consider the rights for sporting events. At some point, all the traditional companies will be outbid for those rights by tech companies–because the tech companies will be able to justify the purchase price by tying it into building that larger ecosystem.</p>\n\n\n\n<p>Which brings us back to that entertainment industry veteran’s statement. In my mind, Disney is an entertainment giant and Apple is a tech giant–meaning, illogically, that I view them as companies of equal stature. And perhaps they once were, but they’re not anymore. The games played by Disney and its peers in the entertainment industry are small potatoes compared to those played by Apple and its peers.</p>\n\n\n\n<h2>Why would Apple want Disney?</h2>\n\n\n\n<p>So if it’s inevitable that in an era of streaming media, the tech industry will eat the entertainment industry whole, why would Apple buy Disney?</p>\n\n\n\n<p>It could be as simple as this: It’s potentially an avenue of further growth for Apple. If Apple believes integrating Disney’s intellectual property, customer experiences (theme parks! cruises!), and the rest into its ecosystem will form a virtuous circle that will send Apple’s revenues and profits ever higher, that’s probably reason enough. When you’re as big as Apple, you need to get creative in order to seek growth.</p>\n\n\n\n<p>If this sounds outlandish, well, if I traveled back in time to 2011 and told you that Apple would be producing some of the best TV shows in the world, wouldn’t that seem bizarre? And yet the company has grown and changed–and will continue to.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Disney CEO Bob Iger at Apple WWDC23\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/08/iger-wwdc23.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>As Disney CEO Bob Iger said at WWDC23, Apple and Disney together can create “real-world magic.”</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>But leaving the growth aside for a moment, there’s also this: Apple and Disney <em>do</em> have ties. They do feel similar in so many ways. From the Imagineers working on new Disneyland features to the VFX artists at Industrial Light &amp; Magic to the animators at Pixar, so much of Disney is located at the same intersection of Technology and the Liberal Arts that Apple calls home. (And when I look at the bill for my last family trip to Disneyland, I recognize that both companies are very good at charging me a lot of money.)</p>\n\n\n\n<p>Maybe it’s that simple. If the tech industry really is about to consume the entertainment business, Apple and Disney would probably be the best match. I wonder what Tim Cook thinks about that possibility.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"757a832adc079b7ad47e7d93e65df5c23e640ea38624350cba6b59987a3ca2ef","category":"Apple"}