{"title":"CT and MR utilization and morbidity metrics across Body Mass Index","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306087","date":1719583200000,"content":"<p>by Mina Dawod, Paul Nagib, John Zaki, Luciano M. Prevedello, Amna A. Ajam, Xuan V. Nguyen</p>\r\nObjective <p>Obesity is a high-morbidity chronic condition and risk factor for multiple diseases that necessitate imaging. This study assesses the relationship between BMI and same-year utilization of CT and MR imaging in a large healthcare population.</p> Methods <p>In this retrospective population-based study, all patients aged ≥18 years with a documented BMI in the multi-institutional Cosmos database were included. Cohorts were identified based on ≥1 documented BMI in 2021 within pre-defined ranges. For each cohort, we assessed the percentage of patients undergoing head, neck, chest, spine, or abdomen/pelvis CT and MR during the same year. Disease severity was quantified based on emergency department (ED) visits and mortality.</p> Results <p>In our population of 49.6 million patients, same-year CT and MR utilization was 14.5 ±0.01% and 6.0±0.01%, respectively. The underweight cohort had the highest CT (25.8±0.1%) and MR (8.01 ± 0.05) imaging utilization. At high extremes of BMI (&gt;50 kg/m<sup>2</sup>), CT utilization mildly increased (18.4±0.1%), but MR utilization decreased (5.3±0.04%). While morbidity differences may explain some BMI-utilization relationships, lower MR utilization in the BMI&gt;50 cohort contrasts with higher age-adjusted mortality (1.8±0.03%) and ED utilization (32.4±0.1%) in this cohort relative to normal weight (1.5±0.01% and 25.7±0.02%, respectively).</p> Conclusion <p>Underweight patients had disproportionately high CT/MR utilization, and high extremes of BMI are associated with mildly higher CT and lower MR utilization than the normal weight cohort. The elevated mortality and ED utilization in severely obese patients contrasts with their lower MR imaging utilization. Our findings may assist public health efforts to accommodate obesity trends.</p>","author":"Mina Dawod","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"758348e4248c2e861ac2e07c06cf15278396921bef59b309bfb56e1ba97bedb8","category":"Interdisciplinary"}