{"title":"GoPro เปิดตัว HERO10 Black ถ่ายวิดีโอ 5.3K ได้ที่ 60 เฟรมต่อวินาที พร้อมปรับปรุงประสิทธิภาพหลายด้าน","link":"https://www.blognone.com/node/124795","date":1631805038000,"content":"<div><div><div><p>GoPro เปิดตัวกล้องแอคชั่นแคมเรือธงใหม่ HERO10 Black มาพร้อมโปรเซสเซอร์ใหม่ GP2 พร้อมกับปรับปรุงคุณภาพทั้งภาพและวิดีโอครั้งใหญ่</p>\n<p>HERO10 Black ถ่ายภาพนิ่งได้ที่ 23.6 ล้านพิกเซล ส่วนวิดีโอถ่ายได้สูงสุด 5.3K ที่ 60 เฟรมต่อวินาที, 4K ที่ 120 เฟรมต่อวินาที และ 2.7K ที่ 240 เฟรมต่อวินาที พร้อมปรับปรุงประสิทธิภาพการถ่ายภาพและวิดีโอในพื้นที่แสงน้อยด้วย พร้อม HyperSmooth (เทคโนโลยีกันสั่นเหมือน gimbal แต่เป็นซอฟต์แวร์ของ GoPro) เวอร์ชัน 4.0 ปรับปรุงใหม่หลายด้าน ทำให้การกันสั่นดีขึ้นกว่าเดิมมาก</p>\n<p>GoPro ยังใส่เลนส์ SuperView มาให้กล้องแอคชั่นแคมใหม่ด้วย สามารถถ่ายภาพได้ในมุมกว้างขึ้น พร้อมโหมดถ่ายวิดีโอ 5.3K ที่ 30/25/24 เฟรมต่อวินาที (เมื่ออัพเดตเฟิร์มแวร์ที่จะปล่อยวันที่ 16 พฤศจิกายนนี้) พร้อมซัพพอร์ต Max Lens Mods ของ GoPro</p>\n<p>ส่วนแสดงผลของตัวกล้อง GoPro ใส่หน้าจอด้านหน้ามาให้ พร้อมกับจอหลังแบบสัมผัส และยังสามารถทำงานเป็นเหมือนเว็บแคมได้ตั้งแต่เปิดใช้งาน, มีระบบชาร์จเร็ว รวมถึงเพิ่มฟีเจอร์ถ่ายโอนข้อมูลเข้าสมาร์ทโฟนหรืออุปกรณ์อื่น ๆ เพิ่มเติมจากอัพโหลดขึ้นคลาวด์และถ่ายโอนผ่านระบบไร้สาย และเพิ่มฟีเจอร์อัพโหลดวิดีโอขึ้นคลาวด์ระหว่างชาร์จแบตเตอรี่</p>\n<p>สำหรับตัว GoPro HERO10 Black ราคาจำหน่ายอยู่ที่ 399.98 ดอลลาร์เมื่อซื้อพร้อมสมัครสมาชิก GoPro (หรือผู้ที่มีสมาชิกอยู่แล้วก็ซื้อราคานี้ได้เลย) โดยค่าใช้จ่ายสมาชิกอยู่ที่ 49.99 ดอลลาร์ต่อปี หรือ 4.99 ดอลลาร์ต่อเดือน แต่ถ้าไม่ต้องการสมัครสมาชิก ราคาขายของกล้องจะอยู่ที่ 499.99 ดอลลาร์</p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2021/09/16/gopro-debuts-the-hero10-black-action-camera/\">TechCrunch</a>, <a href=\"https://www.theverge.com/2021/9/16/22675730/gopro-hero-10-black-announcement-gp2-high-frame-rate-auto-upload\">The Verge</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/355a235847fc1cb7023f9c1ff53d420c.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/gopro\">GoPro</a></div><div><a href=\"/topics/action-camera\">Action Camera</a></div><div><a href=\"/topics/camera\">Camera</a></div></div></div>","author":"nutmos","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"758623ee9d1c7babe66ee60f33c38a8b98ee9af9d370415653d1961b154b645a","category":"Thai"}