{"title":"[ลือ] AirPods จะมีรุ่นใหม่ในปีหน้า: ทั้ง AirPods 4 และ AirPods Max เปลี่ยนมาใช้พอร์ต USB-C","link":"https://www.blognone.com/node/136416","date":1698300264000,"content":"<div><div><div><p>รายงานข้อมูลจาก Mark Gurman แห่ง Bloomberg คนเดิม คราวนี้ว่าด้วยกลุ่มสินค้า AirPods ที่จะขายในปี 2024 รายละเอียดดังนี้</p>\n<p>Gurman เริ่มต้นอธิบายปัญหาปัจจุบันของแอปเปิลว่า <a href=\"https://www.blognone.com/node/125337\">AirPods 3</a> ซึ่งใช้ดีไซน์แบบ AirPods Pro แต่ไม่มีจุกอินเอียร์ ยอดขายที่ไม่เป็นไปตามที่แอปเปิลคาดหวังนัก ลูกค้ามักตัดสินใจซื้อ <a href=\"https://www.blognone.com/node/108751\">AirPods 2</a> ดีไซน์เดิมที่ราคาถูกกว่าและแอปเปิลก็ยังขายอยู่ ฉะนั้นเพื่อแก้ปัญหานี้ แอปเปิลต้องรื้อไลน์สินค้าใหม่ทั้งหมด</p>\n<p>โดยเขาบอกว่าแอปเปิลจะออก AirPods 4 ในปี 2024 แยกย่อยเป็น 2 รุ่น ดีไซน์นั้นคล้ายกับ AirPods 3 และ AirPods Pro โดยรุ่นที่ราคาสูงกว่าจะได้ฟีเจอร์หลายอย่างแบบ AirPods Pro เช่น ตัดเสียงรบกวน, เคสชาร์จรองรับการส่งเสียงสำหรับค้นหาใน Find My เป็นต้น ส่วนรุ่นราคาถูกกว่าไม่ได้ฟีเจอร์เหล่านี้</p>\n<p>AirPods 4 ยังเปลี่ยนมาใช้พอร์ต USB-C ตามแนวทางปัจจุบันของแอปเปิลไปด้วย จะทำให้เหลือ AirPods Max เป็นสินค้าเดียวของ AirPods ที่ใช้ Lightning โดยแอปเปิลจะออก AirPods Max รุ่นใหม่ที่เป็น USB-C มาพร้อมกันด้วย อย่างไรก็ตาม Gurman บอกว่า AirPods Max ใหม่นี้อาจไม่มีฟีเจอร์อื่นเพิ่มเติม</p>\n<p>สุดท้าย Gurman บอกว่า AirPods Pro รุ่นใหม่จะไม่มีมาในปีหน้า แต่กำหนดออกคือปี 2025 เลย</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/articles/2023-10-25/apple-airpods-plans-4th-generation-low-end-3rd-generation-pro-and-usb-c-max\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f408c4d30b5a06bc79f7c0a335615fa2.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/airpods\">AirPods</a></div><div><a href=\"/topics/rumors\">Rumors</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7591a4d687d82aeb74a9f13714278ada5d4b4dcf66de740152fe67f59a4826c8","category":"Thai"}