{"title":"Tadej Pogačar signs new deal with UAE until 2027","link":"https://cyclingtips.com/2021/07/tadej-pogacar-signs-new-deal-with-uae-until-2027/","date":1627631620000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033323-344-650x433.jpg\" /></div><h2>Tadej Pogačar signs new deal with UAE until 2027</h2><p>\n</p><p>Tour de France winner Tadej Pogačar has renewed his contract with UAE Team Emirates. His contract ran through 2026 already making it one of the longest contracts in procycling but the Slovenian adds another year to that. He will turn 29 in the final year of this contract.</p>\n\n\n\n<p>On his way home from Tokyo where Pogačar took the bronze medal in the Olympic road race, he made a quick stop over in the United Arab Emirates to sign the new contract with the team he joined in 2019.</p>\n\n\n\n<p>“I am really happy to be able to commit my future to the team and stay here for the next years,” he was quoted in the team’s press release. “I feel at home here, it feels like a big family. This team is a really good fit for me and I am fortunate to say that I have not only found colleagues but friends. I’m excited for the years ahead and what they will bring, hopefully more success for me and for the team. I hope we are inspiring lots of kids to ride bikes.”</p>\n\n\n\n<p>Pogačar is only 22 years young but has already won two Tour de France titles, a monument in Liège-Bastogne-Liège and World Tour stage races like Tirreno Adriatico and the UAE Tour this season and the Amgen Tour of California in 2019. He won nine Grand Tour stages already, three in every Grand Tour he started in. </p>\n\n\n\n<p>UAE Team Emirates manager Mauro Gianetti has already started building a team around the Slovenian rider. In Juan Ayuso UAE Team Emirates have the most promising young rider of this moment. The 18-year-old Spaniard won the Giro U23 with a three-minute margin in June and joined the pro ranks straight after with a second place in his first race with the team, the Prueba Villafranca – Ordiziako Klasika. New Zealand rider Finn Fisher Black is also one of the young, exciting talents to join the team.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/tadej-pogacar-signs-new-deal-with-uae-until-2027/\">Read More</a>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7592a8a68adfd72a3358081410a62855a888b8b26fcd4f1e72c02fbd804d42be","category":"Cycling"}