{"title":"Physicochemical and Sensory Evaluation of Lemon Grass Leaves extracts Enriched Soy Yoghurt from Soybeans (Glycine Max) Milk","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400013?af=R","date":1710512671000,"content":"<h2>Abstract</h2>\n<p>There are challenges in the utilization of soybean-based foods due to undesirable associated flavors. This study aimed to prepare soybean based yoghurt with different amounts of lemon grass extract in the ratios of 0, 25, 50, 75, and 100 µl per litter of soy yoghurt as shown by figure 1. The table 1 and 2 summarized results of different treatments of Soybeans based yoghurt analyzed for protein by Kjedhal method, fats by Soxhlet method, total ash by muffle furnace method. Soluble crude fiber was determined by dry oven method, pH, titratable acidity, syneresis and viscosity, by AOAC method, total phenolic compounds by spectrophotometric method. Sensory analysis was done by effective tests with 10 panelists using five hedonic scale tools. From the study, the results indicate that moisture content range from (89.3-89.6%); protein content (5.5-6.8%); fat (2.7-3.6%); total ash (0.43-0.53%); crude fiber (0.06-0.33%) and carbohydrate (0.59-0.93%). The level of pH range from 4.30-5.59; viscosity (2.85-3.17 pa.s); titratable acidity, (0.01-0.07 g\\l) and synersis (6.44-7.56) and total phenolic compound (8.59-18.40 mg/g). Most of the parameters did not show any significant variations while the pH and total phenolic compounds varied significantly between the treatments. In addition, figure 2 detailed sensory evaluation results of treatments and that the treatment with highest level of lemon grass extract was the most liked. In conclusion, incorporation of lemon grass extract can help improved the level of phenolic compounds and sensory properties of yoghurt.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Nyiranshuti Angelique, \nKipkorir Koskei, \nMarguerite Niyibituronsa","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"75a75b7eba0a1a04c2daba95ad12a510d60aaec6bf608a89635ba1c552d9ec5b","category":"Environment"}