{"title":"Habitat persistency analysis with HEM‐PEAK: A novel approach for the assessment of hydropeaking impacts and mitigation measure design","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4291?af=R","date":1715316579000,"content":"<h2>Abstract</h2>\n<p>Hydropeaking is one of the most severe pressures of hydropower on aquatic ecosystems. The discharge fluctuations due to turbine operations cause frequent shifts in hydraulic habitat characteristics such as flow velocity and water depth. Those rapid changes on a daily or sub daily basis, however, are beyond the possibilities of evolutionary adaptations of aquatic organisms, especially for fish in their sensitive early life stages. Thus, one central aim in terms of the evaluation of hydropeaking impacts or the design of mitigation measures is the analysis or establishment of hydraulically stable habitat conditions. This study presents a novel habitat assessment tool to quantify hydraulically stable habitat conditions in the form of a persistency of suitable habitats in hydropeaking reaches. The HEM-PEAK tool determines areas that contain equal ranges of depth-averaged flow velocity and water depth for both base flow and peak flow in three categories. Those areas also exclude dewatering sites, which have to be seen as ‘residual risk for stranding’. In the present study, the model was used to evaluate the YOY habitats of brown trout and grayling. The model was tested for 14 hydropeaking reaches to evaluate the quantity of habitat persistency for different morphological characteristics, such as straight, winding, alternating gravel bars and bifurcation reaches. The findings reveal that there is no relationship between hydraulically stable habitat conditions with reach scale bed slope or the magnitude of dewatering areas. However, the changes in specific discharge in relation to bankfull width could be negatively related to the magnitude of hydraulically stable habitat conditions independent of the morphological type. This relationship is minor for summer scenarios compared to spring, as the initial habitat quality during the increased base flow conditions is already limiting the availability of suitable habitats which might have persistency during peak flow. In detail, several self-forming bars like point bars and artificial structures like groins and coarse rip-rap could be determined, which could be explicitly addressed in terms of mitigation measure design based on the application of the HEM-PEAK tool.</p>","author":"C. Hauer, \nG. Unfer, \nP. Holzapfel, \nM. Tritthart","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"75b2c7481a593482f27e7ae6d76986afad67527fdc51bf769d066fbcae678882","category":"Environment"}