{"title":"Gravity‐driven packed bed filter, with copper‐impregnated activated carbon, for continuous water disinfection in absence of electricity","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11114?af=R","date":1726988400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7ae3cb7e-24ef-4432-bec2-899b098ca3d4/wer11114-toc-0001-m.png\" alt=\"Gravity-driven packed bed filter, with copper-impregnated activated carbon, for continuous water disinfection in absence of electricity\" />\n<p>Gravity-driven water disinfection unit can disinfect <i>Escherichia coli</i> containing water, maintaining the constant water flow (150 mL/h) during the disinfection process. KOH-treated copper nanoparticle-impregnated activated carbon was used for the disinfection process. It can completely disinfect 10<sup>4</sup> CFU mL<sup>−1</sup> bacteria over 6 h.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Availability of safe drinking water is a major concern in many parts of the world. While many filtration units operating on various principles are available to combat this, most require electricity, which may not be consistently available in such areas. In the present study, we have designed and demonstrated a water disinfection system that can operate purely on gravity, without any electricity. For this, a potassium hydroxide modified copper-impregnated activated carbon (KOH-Cu-AC) hybrid was used as a filter medium for disinfection, because it is less expensive, with performance comparable to previously reported hybrids containing silver. To maintain a constant water flow rate under gravity, during disinfection, a Mariotte bottle was used as the reservoir of the contaminated water. Using this and a constant head between the bottle and the treated water exit point, the required water-filter contact time of 25 min (for decontamination) is maintained in the filter column, regardless of tank-fill level. The demonstrated lab-scale system can perform disinfection of simulated contaminated water (with an initial concentration of 10<sup>4</sup> CFU mL<sup>−1</sup>\n<i>Escherichia coli</i>), for at least 6 h, with a flow rate of 150 mL h<sup>−1</sup>. The disinfection performance from the gravity-based filter was further validated with the conventional pump-driven filter, used for continuous disinfection of drinking water. Equivalence of results between pump- and gravity-driven operations helps us to eliminate the need for power, without any compromise in disinfection efficacy. Finally, copper concentration from treated water (106 ppb at steady state) remains very well within the safe limit (1000 ppb as per USEPA guideline). Hence, the lab-scale design of gravity-based packed bed filter will be useful for domestic and community-based supply of safe drinking water in resource-constrained areas, because it eliminated electricity requirement of conventional power-driven systems.</p>\n<h2>Practitioner Points</h2>\n<p>\nCost-effective KOH-Cu-AC hybrid is developed as a disinfection material.\nMariotte bottle used for maintaining constant disinfected water flow rate works without any electrical power supply.\nThis system can be used for getting on-spot, continuous disinfected water supply.\nThe concentration of copper in the treated water is well within the safety limit.\nIt can be applicable in rural and remote areas (no electric power source) as well as natural calamity-affected areas.\n</p>","author":"Mohana Mukherjee, \nShankar Ramachandran, \nRajdip Bandyopadhyaya","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"75b30ea12d42b19dc5afaf3ca776fc5555ddff86ccca8c2b719ce02aa861031b","category":"Environment"}