{"title":"A Deep-Dive Into GoPro Hero 10 Overheating","link":"https://www.dcrainmaker.com/2021/09/a-deep-dive-into-gopro-hero-10-overheating.html","date":1633009559000,"content":"<p></p>\n<p>If you’ve been around this site long enough, you now I occasionally go down rabbit holes. And by ‘down’, I mean I find myself a rabbit hole – go and acquire a large drilling platform, and go so far down and through that rabbit hole that one might be left asking where the rabbits are.</p>\n<p>In this case, after nearly a month of testing the GoPro Hero 10 Black in daily use (actually, two cameras), I posted my <a href=\"https://www.dcrainmaker.com/2021/09/gopro-hero-10-black-in-depth-review.html\">full in-depth review</a>, both here on the site, <a href=\"https://www.youtube.com/watch?v=U79xNlX8Qow\">and on YouTube</a>. In general as I’ve said before, for action cams and drones, YouTube is where it’s at these days in terms of where most people look for that kind of content. Nonetheless, I know many athletes use GoPro cameras – so I tend to cover action cam bits here too on the written site.</p>\n<p>In any event, after launch I had seen some reports of overheating on the Hero 10. Of course, overheating of cameras and action cameras is nothing new. Be it past GoPro’s, or even my phone – in the right hot conditions a camera will overheat. Just ask my iPhone how many times this past summer at the beach it overheated and had to be left alone for a bit. But generally speaking, such overheating usually comes from lack of airflow over a device – something that didn’t really impact my GoPro Hero 10 testing.</p>\n<p>After all, I mainly test an action camera doing actiony things. Cycling, running, hiking swimming, paragliding, etc…</p>\n<p>Still, at the same time I also use GoPro’s constantly for more static filming, be it attaching to the ceiling <a href=\"https://www.dcrainmaker.com/2020/03/saris-mp1-nfinity-motion-platform-rocker-plate-review.html\">above rocker plates to show how movement</a> works, or using it as an alternative angle inside the gondola in the <a href=\"https://dcrainmaker.com/support\">DCR Quarantine Corner series</a>. Part of the appeal of an action camera is the places you can stash it and still get the shot.</p>\n<p>But in all my action testing – I saw zero overheating, while others were seeing overheating while sitting at a desk in certain high-end resolutions frame rates as low as 18 minutes. So, I set out to test it.</p>\n<p>What I thought would be a simple video ended up turning into a rabbit hole of astronomical proportions. Some 40 tests in all, including dive cases to the bottom of the lake, superheating my bathroom to 104*F, and a never ending bout of cycling in circles to try and figure out when and where it’ll overheat. Since the point of this project was a video more so than a post, you’ll find all the details above. There’s some pretty interesting surprises in there too! But I figured I’d at least post it here to the site, so folks that aren’t subscribed to the DCRAINMAKER YouTube channel would see it.</p>\n<p>Thus go forth and enjoy this rando rabbit hole! Thanks for watching!</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/09/DSC_6204.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/09/DSC_6204_thumb.jpg\" /></a></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"75b892d5c0f9875f22716fbdff98fd74376b9cce6dfca59d983128a5de4a88db","category":"Cycling"}