{"title":"Substantiation and Effectiveness of Remote Monitoring System Based on IoMT Using Portable ECG Device","link":"https://www.preprints.org/manuscript/202407.2025/v1","date":1721960684000,"content":"Cardiovascular disease is a major global health concern, with early detection being critical. This study assesses the effectiveness of the portable ECG device, based on Internet of Medical Things (IoMT) technology, for remote cardiovascular monitoring during daily activities. We conducted a clinical trial involving 2,000 participants who wore the HiCardi device while engaging in hiking activities. The device monitored their ECG, heart rate, respiration, and body temperature in real-time. If an abnormal signal was detected while a physician was remotely monitoring the ECG at the IoMT monitoring center, he notified the clinical research coordinator (CRC) at the empirical research site, and the CRC advised the participant to visit a hospital. Follow-up calls were made to determine compliance and outcomes. Of the 2,000 participants, 318 showed abnormal signals, and 182 were advised to visit a hospital. Follow-up revealed that 139 (76.37%) responded, and 30 (21.58% of those who responded) sought further medical examination. Most visits (80.00%) occurred within one month. Diagnostic approaches included ECG (56.67%), ECG and ultrasound (20.00%), ultrasound alone (16.67%), ECG and X-ray (3.33%), and general treatment (3.33%). Seven participants (23.33% of those who visited) were diagnosed with cardiovascular disease, including conditions such as arrhythmia, atrial fibrillation, and stent requirements. The portable ECG device using the patch-type electrocardiograph detected abnormal cardiovascular signals, leading to timely diagnoses and interventions, demonstrating its potential for broad application in preventative health care.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"75cce621dc948f5f4d0a4aab0e9f1749663373c75314c99021f2ff01cdd1baee","category":"Interdisciplinary"}