{"title":"Timing of dietary zinc additions during gestation for improved piglet survival","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae030/7624368?rss=1","date":1709856000000,"content":"<span><div>Abstract</div>The objectives of this study were to determine a practical approach to feeding elevated dietary zinc (Zn) to gestating sows in a commercial setting and to confirm preweaning mortality could be reduced by feeding high Zn to sows during different periods of gestation. The study was conducted at a commercial sow farm in the upper Midwest. Mixed parity sows (<span>n</span> = 267) over three consecutive weekly farrowing groups (sows farrowing within 1 wk) were assigned randomly to one of the three dietary treatments within parity. Treatments consisted of: (1) control sows fed a corn–soybean meal diet containing 206 mg/kg total supplemental Zn supplied by zinc hydroxychloride; (2) breed-to-farrow: as control + 147 mg/kg supplemental Zn as ZnSO<sub>4</sub> (353 mg/kg total supplemental Zn) fed from 5 d after breeding to farrowing; and (3) day 110-to-farrow: as control fed from breeding to farrowing + 4,079 mg/kg supplemental Zn as ZnSO<sub>4</sub> (4,285 mg/kg total supplemental Zn) starting day 110 of gestation until farrowing. At farrowing, individual piglets were weighed and identified within 12 h of birth. Data were analyzed using PROC GLIMMIX of SAS and the model considered the fixed effect of dietary treatment and random effect of farrowing group. Dietary treatments did not affect number of total pigs born per litter. For breed-to-farrow sows, there was an increase in the percentage of pigs born alive compared to sows fed the control and day 110-to-farrow treatments (<span>P</span> &lt; 0.001). The number of stillborn pigs expressed as a percentage of total litter size at birth decreased for breed-to-farrow sows (<span>P</span> &lt; 0.001) compared with control or day 110-to-farrow sows. Mortality of low birth weight piglets from birth to weaning did not differ among dietary treatments (<span>P </span>= 0.305); however, a trend for decreasing post-natal mortality (<span>P </span>= 0.068) of normal birth weight pigs was observed for pigs born to sows fed elevated Zn 5 d before farrowing. In conclusion, feeding elevated Zn to sows throughout gestation increased the proportion of pigs born alive suggesting that elevated gestational Zn intake makes piglets more robust to endure the stresses of farrowing and decreases intrapartum mortality. Under the conditions of this study, elevated Zn intake of sows did not influence piglet post-natal survival. However, feeding high zinc throughout gestation may decrease piglet mortality during the parturition process.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"75d326c4d64d16581c06c27b1c09fa2d111560ff1eba91d7a4828a59a6043215","category":"Environment"}