{"title":"Hands-On With the New AirPlay-Compatible Sonos Era Speakers","link":"https://www.macrumors.com/2023/04/04/sonos-era-hands-on/","date":1680639806000,"content":"Sonos in March <a href=\"https://www.macrumors.com/2023/03/07/sonos-announces-era-100-era-300-speakers/\">introduced new Era 100 and Era 300 speakers</a>, and as Sonos devices compete with the <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> and <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a>, we thought we'd pick up the Era speakers to see how they compare to both Apple's product offerings and past Sonos speakers.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe <a href=\"https://www.sonos.com/en-us/shop/era-100\">Sonos Era 100</a> features a cylindrical design that's not too far off from the ‌HomePod‌, and the pricing is about the same too at $249. Designed to be a compact speaker, the Era 100 works with more than 100 streaming services for music, radio, and audiobooks, including <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a>.\r<br />\n\r<br />\nTruePlay measures the acoustics of the room to tailor the sound, and there are advanced tuning options for more personalization. The Era 100 sounds similar to the Sonos One, and while it's slightly better in quality, it won't be worth picking up the Era 100 over the Sonos One if you already have that speaker. Between the Era 100 and the ‌HomePod‌, the ‌HomePod‌ has the better sound.\r<br />\n\r<br />\nThe <a href=\"https://www.sonos.com/en-us/shop/era-300\">Sonos Era 300</a> is a higher-end speaker and pricier than any of Apple's HomePods at $449. It is designed to provide 360 degree sound with six drivers, and like Apple's devices, it supports spatial audio and Dolby Atmos (if you have two Era 300s). It offers all of the same optimization and customization options as the Era 100. While the Era 100 has a standard speaker design, the Era 300 is a little more experimental, similar to the Play:5.\r<br />\n\r<br />\nAs for sound, the Era 300 beats prior Sonos speakers and Apple's HomePods. It's bigger than the ‌HomePod‌, and all the audio equipment inside provides impressive sound. Spatial audio combined with this audio quality sounds incredible, and in comparison to the ‌HomePod‌, it provides a deeper, fuller sound with more bass.\r<br />\n\r<br />\nIn addition to using the Sonos support for music apps, the Era 100 and Era 300 support playback over <a href=\"https://www.macrumors.com/guide/airplay/\">AirPlay</a> 2 from Apple devices or from any Bluetooth-enabled phone or tablet. Prior Sonos speakers were WiFi only, so the option to use Bluetooth makes the speaker easier for guests to use.\r<br />\n\r<br />\nGoogle, Amazon Alexa, and Sonos voice assistants are available if you want to control the Sonos speakers with voice commands, and a physical switch at the back turns the microphone off if you want to be sure the speaker isn't listening to what's going on in the room.\r<br />\n\r<br />\nThere is an included USB-C port that can be used with adapters to connect legacy audio devices or a router using an adapter, and on the top of the speakers, there are buttons for physical control, including play/pause and skipping songs.\r<br />\n\r<br />\nThe full-size ‌HomePod‌ is better than the Era 100 in our opinion, but the Era 300 blows them both away. It is the most expensive speaker at $449, but if you're looking for the best surround sound experience that offers features like spatial audio, Dolby Atmos, and ‌AirPlay‌ 2, it's worth checking out.<div>Tag: <a href=\"https://www.macrumors.com/guide/sonos/\">Sonos</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/04/sonos-era-hands-on/\">Hands-On With the New AirPlay-Compatible Sonos Era Speakers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-the-new-airplay-compatible-sonos-era-speakers.2385898/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"75dcd03db81a140d43ad920881142aa5b6861fa18967d7c339bfe739f533c4f3","category":"Apple"}