{"title":"The Virtual Reality and Augmented Reality Adoption Impact on Customer Loyalty for the Fashion Brands","link":"https://www.preprints.org/manuscript/202307.1408/v3","date":1712661071000,"content":"Technology can be seen everywhere and has been integrated into our lives.We are always using technology and enjoying the convenience brought by technology. However, physical retailers and e-commerce companies are also gradually adopting advanced technologies. Technology improves the purchasing environment and purchasing experience. Virtual reality and augmented reality have been hotly discussed in recent years. Technology, although virtual reality and augmented reality technology have not yet matured, it can be said that they will in the future It has great development potential. Virtual reality and augmented reality are also beginning to sprout in the retail industry. However, research on the acceptance of the use of virtual reality and augmented reality in the apparel shopping process is still lacking because This study explores how usefulness, ease of use, hedonicity, customer experience, customer engagement and satisfaction. To influence customer loyalty, this study adopted questionnaire survey and convenience sampling methods, and collected a total of 308 valid questionnaires. The analysis method used confirmatory factor analysis and structural equation model to verify the research hypothesis relationship. The results of this study found. Hedonic has a significant impact on customer loyalty, while usefulness, ease of use, customer experience, customer engagement and satisfaction Satisfaction does not have a significant impact on customer loyalty. This study explains the academic contribution of the research results. The practical implications in marketing are put forward, and specific suggestions and directions for future research are given.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"75de7f48a019e642fe3a23e3926d86c36f4d6f28216d69a373f65549df6734dd","category":"Interdisciplinary"}