{"title":"รัฐแคลิฟอร์เนีย และอีก 32 รัฐฟ้อง Meta ว่าเป็นแพลตฟอร์มที่ทำร้ายเยาวชน","link":"https://www.blognone.com/node/136390","date":1698229164000,"content":"<div><div><div><p>รัฐแคลิฟอร์เนีย และอีก 32 รัฐฟ้อง Meta บริษัทแม่ของ Facebook และ Instagram เกี่ยวกับการทำร้ายเยาวชนโดยกล่าวหาว่าแพลตฟอร์มโซเชี่ยลของ Meta ถูกออกแบบ และมีฟีเจอร์ที่ทำร้ายจิตใจเยาวชน</p>\n<p>สำนวนส่งฟ้องความยาว 233 หน้า ยื่นต่อศาลรัฐบาลกลางทางตอนเหนือของแคลิฟอร์เนีย กล่าวหาว่า Meta ละเมิดกฎหมายคุ้มครองผู้บริโภคของรัฐ และกฎหมายของรัฐบาลกลางที่มุ่งปกป้องความเป็นส่วนตัวของเด็กอายุต่ำกว่า 13 ปี ส่วนรัฐอื่น ๆ เช่น ฟลอริดา ยูทาห์ และเวอร์มอนต์ ยื่นฟ้องแยกคดี เท่ากับว่าตอนนี้มีรัฐทั้งหมด 41 รัฐ และวอชิงตัน ดี.ซี. กำลังดำเนินการทางกฎหมายกับ Meta อยู่</p>\n<p>การดำเนินการทางกฎหมายครั้งนี้เน้นย้ำถึงวิธีที่รัฐต่าง ๆ พยายามจัดการกับอันตรายด้านสุขภาพจิตที่อาจเกิดขึ้นจากแพลตฟอร์มโซเชียลมีเดีย รวมถึงปัญหาภาพลักษณ์ ความวิตกกังวล และภาวะซึมเศร้า ซึ่งรัฐแคลิฟอร์เนีย และรัฐอื่น ๆ หวังว่า Meta จะเปลี่ยนแปลงแนวทางปฏิบัติของบริษัทให้เปลี่ยนการตั้งค่าเริ่มต้น และจำกัดระยะเวลาที่คนหนุ่มสาวใช้แอปเพื่อลดการดึงคนหนุ่มสาวให้เข้าไปพัวพันกับวิดีโอ และรูปภาพที่เป็นอันตรายได้</p>\n<p>จากการสำรวจของ Pew Research Center ระบุ ปัจจุบันวัยรุ่นจำนวนมากเลิกใช้งาน Facebook มากขึ้นแต่ Instagram ยังคงได้รับความนิยมในสหรัฐฯ โดยมีผู้ใช้งานในสหรัฐฯ ที่เป็นวัยรุ่นใช้ Instagram ประมาณ 22 ล้านคนต่อวัน</p>\n<p>ระยะเวลาที่วัยรุ่นใช้บนโซเชียลมีเดียเริ่มเป็นปัญหาที่เพิ่มขึ้น โดยเฉพาะเมื่อแพลตฟอร์มต่าง ๆ ใช้อัลกอริธึมเพื่อแนะนำเนื้อหาที่พวกเขาคิดว่าผู้ใช้ชอบดู ซึ่งในปี 2022 อัยการสูงสุดทั่วประเทศเริ่มสอบสวน TikTok ที่อาจสร้างความอันตรายต่อคนหนุ่มสาว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/702cd3cd2b47c83404c61f87c92ff8e7.png\" /></p>\n<p>ที่มา - <a href=\"https://www.latimes.com/california/story/2023-10-24/facebook-parent-meta-sued-instagram-young-people\">Los Angeles Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/meta\">Meta</a></div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/instagram\">Instagram</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"75e2d90b1f74550cf8a883ba70820eee02bf2cf2c71b7764284ab9d462f921d1","category":"Thai"}