{"title":"Degradation autocatalytic epoxidation of oleic acid derived from palm oil via in situ performic acid mechanism","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14498?af=R","date":1729164230000,"content":"<h2>Abstract</h2>\n<p>Owing to the increasing demands for eco-friendly epoxides derived from vegetable oils, much effort has been made regarding the epoxidation of oleic acid in recent years. However, to date, there is a paucity of studies on the autocatalytic epoxidation specifically epoxidized oleic acid as it is not fully utilized. The autocatalytic epoxidation of oleic acid was carried out by using in situ generated performic acid to produce epoxidized oleic acid. Performic acid was formed by mixing formic acid (as oxygen carrier) and hydrogen peroxide (as oxygen donor). A maximum relative conversion to oxirane (RCO) achieved was 87% at optimal formic acid molar ratio to oleic acid under following conditions: (1) reaction temperature: 75°C, (2) stirring speed: 300 rpm, (3) formic acid/oleic acid molar ratio: 2.5, and (4) hydrogen peroxide/oleic acid molar ratio: 1.0. The degradation of epoxidized oleic acid after oxirane ring opening invites hydroxylation reaction take place called alcoholysis and hydrolysis. The hydroxyl value from alcoholysis was 346.9 mg KOH/g while the hydroxyl value of hydrolysis was 296.4 mg KOH/g using autocatalyzed reaction. In conclusion, high and low hydroxyl value has their own benefits as intermediate product for polymer application such as flexible polyurethane and rigid polyurethane.</p>","author":"Hamzah Hafizuddin Habri, \nAhmad Shauqi Abrar Shahrizan, \nIntan Suhada Azmi, \nNorhafini Hambali, \nAmnani Shamjuddin, \nSubhan Salaeh, \nMohd Jumain Jalil","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"75e60043f18330c424e2e35d7c4916643352ea546948e141d2d6483de395537a","category":"Environment"}