{"title":"The Relationship between Wind Conditions and Fire Ignition Causes: Central Portugal Case Study","link":"https://www.preprints.org/manuscript/202405.0146/v1","date":1714728157000,"content":"In recent decades the Mediterranean area observed an increase in large fires, despite the decrease in the number of fire ignitions, following a worldwide tendency. Climate change has been the main culprit for large burnt areas, and alterations of forest ecosystems, resulting in the increased recurrence of forest fires. In Portugal, the analogous trend resulted in the destruction of large rural, urban and industrial areas, where after the 2017 months of June and October catastrophic events, the government implemented the 2019 specific policies for preventing fire outbreaks and defending the forest against fires. This compulsory policy demanded that landowners and local governments alike needed to contact specific authorities requesting authorization for their intentions to clean properties in and around urban areas, roads, and forest limits. Despite policy and careful monitoring, ignitions still occur, and in many cases resulting from the implementation of such policies. The study analyses the before and after policy implementation, considering 6904 ignitions records from the period between 2014 and 2023 from the central area of Portugal, covering the transition area between the agricultural fields of the Tagus valley and the Monte-junto-Estrela Mountain range, the district of Santarém. The authorization to use fire in clearance practices is granted according to a set of weather conditions, temperature, wind intensity, and relative humidity, when analyzing fire ignitions with the average daily wind intensity at the site of the occurrence, we observed that more than half of wildfires occur on days with winds between 10 and 20 Km/h, whereas intensities greater than 30 Km/h only 1% of the total occurrences, and of these 22% occurred due to the use of fire in the burning of agricultural leftovers and cut and piled bushes. The circulation of the thermal depression in the Iberian Peninsula gives rise to increasing intensity throughout the day, reaching a maximum in the late afternoon, this factor combined with the misjudgment of safe conditions leads us to suggest stricter intervals and the need for awareness of daily variation in conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"75e6053928498d5cc82366fab88cff223c73d4f04b836b4e73530eb49a9e9514","category":"Interdisciplinary"}