{"title":"Jon Stewart’s new Apple TV+ series: Old man yells at cloud—but it hits the spot","link":"https://arstechnica.com/?p=1799516","date":1633022743000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/stewart-apple-listing-800x423.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/stewart-apple-listing.png\">Enlarge</a> <span>/</span> Jon Stewart is back on TV to set some things on fire. (credit: Apple TV+ / Busboy)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In Jon Stewart's first-ever conversation with an Apple TV+ studio audience, he offers a curious send-off—in fact, it argues against the point of <a href=\"https://www.hollywoodreporter.com/tv/tv-news/jon-stewart-returns-with-current-affairs-series-for-apple-exclusive-4083290/\">his new multi-million dollar hosting deal</a>. \"You're probably just going to look at aggregated clips of\" this first episode of <a href=\"https://tv.apple.com/us/show/the-problem-with-jon-stewart/umc.cmc.4fcexvzqezr25p9weks6sxpob\"><em>The Problem With Jon Stewart</em></a>, he says, instead of subscribing to Apple TV+. It's a bit meandering, followed by a joke about pirating episodes of <em>Ted Lasso</em>.</p>\n<p>If anybody can show up to a new streaming service and make a joke at the expense of subscriptions, it's probably Stewart. Online video sharing—and we're talking the renegade kind, uploaded by fans and shared freely—greatly contributed to <em>The Daily Show</em>'s massive cultural footprint before <a href=\"https://arstechnica.com/gaming/2015/02/jon-stewart-leaving-the-daily-show-later-this-year/\">Stewart left that show behind in 2015</a>. And as you may have noticed, the TV landscape has dramatically changed since then. These days, every major player is throwing stuff at the video-streaming wall to see what sticks (or, <a href=\"https://arstechnica.com/gaming/2020/10/quibi-streaming-service-shutting-down-after-less-than-one-year-1-75-billion/\">in Quibi's case last year, what absolutely doesn't</a>).</p>\n<p>So after six years off the \"fake news\" desk, what path does Stewart and Apple's new production take? His aforementioned joke may suggest a series that's meant to be shared and remixed in small clips, but <em>The Problem</em> arrives with a different modus operandi: empathy, not sound bites, and patience, not pulverization. You can arguably pluck out some zingers tailor-made for quick swipes on a service like TikTok, but Stewart seems more invested in relishing the full 44 minutes of each episode. As a result, this fake-news innovator spends the runtime of his new series punting the \"fake\" out of his reputation, expectations be damned.</p></div><p><a href=\"https://arstechnica.com/?p=1799516#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799516&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"75ead2997a84bf7a9b64bdc722cdba99ecc58576550edff56d64ca0cdee43fe6","category":"Tech"}