{"title":"PSLBII-22 Antioxidant potential and in vitro digestibility of two varieties of industrial hemp (cannabis sativa) supplemented in beef cattle diet","link":"https://academic.oup.com/jas/article/102/Supplement_3/659/7757876?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The use of industrial hemp in animal research is gaining much attention in recent years. However, there is little information known about the antioxidant potential and digestibility of different hemp varieties supplemented in cattle diet. The objective of this study was to determine the antioxidant potential and in vitro digestibility of different hemp varieties supplemented in cattle diet. Two varieties of industrial hemp were supplemented at 20 g in 200 g of commercial diet into Trt 1 (0 g of hemp), Trt 2 (20 g of sour kush variety) and Trt 3 (20 g of rogue variety) for in vitro digestibility study using Ankom Daisy<sup>II</sup> incubator. The experimental design was a 3 x 3 factorial design with 3 feed types and 3 digestion times (12, 24, 36 h). Rumen samples were used as inoculum with the recommended buffers for the Daisy<sup>II</sup> incubator. Total polyphenol content and antioxidant capacity were determined using Folin-Ciocalteu assay and 2,2-diphenyl-1-picrylhydrazyl (DPPH) radical scavenging assay respectively. Data were analyzed using mixed procedure in SAS 9.4, means were separated with Tukey at 5% alpha. There was no significant (<span>P</span> &lt; 0.05) difference in antioxidant capacity and digestibility between the two varieties of industrial hemp. Likewise, no significant interactions was observed. Conclusively, the two industrial hemp varieties used in this study had similar antioxidant capacities and digestibility, thereby, similar benefits can be derived from supplementing any of these varieties in animal diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"75ec76d3a8b4c88630d3538a7df9bafd0aaf3f6e059ee5acd219af370036dacd","category":"Environment"}