{"title":"The Influence of Organizational Culture on Procurement Practices: A Multi-industry Perspective","link":"https://www.preprints.org/manuscript/202407.0795/v1","date":1720606705000,"content":"This qualitative study investigates the influence of organizational culture on procurement practices across multiple industries, aiming to enrich understanding of how cultural dynamics shape decision-making, supplier relationships, and strategic outcomes within procurement departments. Through semi-structured interviews with procurement professionals, organizational leaders, and industry experts, data were gathered to explore the impact of leadership styles, ethical frameworks, industry dynamics, and external influences on procurement strategies. Findings reveal that transformational leadership fosters innovation, strategic alignment, and long-term partnerships in procurement, whereas transactional and autocratic styles may prioritize cost efficiency over broader strategic goals. Ethical cultures within organizations significantly influence supplier selection criteria and procurement decisions, highlighting the importance of integrating ethical standards consistently to mitigate risks and enhance organizational reputation. Industry-specific dynamics necessitate adaptive procurement strategies tailored to technological advancements, regulatory requirements, and market conditions. Effective supplier relationship management practices, emphasizing trust, transparency, and mutual value creation, enhance procurement effectiveness and resilience. Organizational structures, including centralized, decentralized, and hybrid models, play crucial roles in optimizing procurement operations. Learning cultures promoting continuous improvement and knowledge sharing foster innovation and resilience in procurement practices. External factors such as market volatility, regulatory changes, and geopolitical risks underscore the need for adaptive procurement strategies and robust risk management practices. This study contributes to theoretical insights and practical implications for aligning organizational culture with strategic procurement objectives to optimize effectiveness, mitigate risks, and drive sustainable value creation across supply chains.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"75f80accd625aa7c27dd26ff47451ca9fc477194a9941ca11bcebc4a0d2f1f0e","category":"Interdisciplinary"}