{"title":"Patient characteristics and telehealth are associated with attendance rates in an outpatient rehabilitation infant bridge program","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301219","date":1711548000000,"content":"<p>by Tiana T. Nguyen, Sang S. Pak, Matthew J. Miller</p>\r\nObjective <p>To describe the characteristics of patients who received outpatient therapy services through an infant bridge program using telehealth mode of service delivery and to identify if attendance rates vary by mode of service delivery. We hypothesized that telehealth visits will increase attendance rates.</p> Design <p>Retrospective, cross-sectional study.</p> Setting <p>UCSF Benioff Children’s Hospital outpatient infant bridge program.</p> Participants <p>Eighty infants with a history of NICU admission and scheduled for a therapy appointment between June 1, 2019 and December 31, 2020 were included in the study. Participants had an average(SD) gestational age of 34.63(4.41) weeks and length of stay was 43.55(56.03) weeks. The majority were English-speaking (96.3%), White (37.5%), and had commercial insurance (72.5%).</p> Main outcome measure <p>Descriptive analyses were conducted across the entire group along with service delivery model subgroup analysis. Logistic regression was performed to assess patient characteristics associated with attendance and if service delivery model influences attendance.</p> Results <p>In the analysis of 596 scheduled visits, there were more completed telehealth sessions than for in-person sessions (90.0% versus 84.1%, <i>p</i> = .011). For in-person sessions, infants (N = 40) with lower birth gestational ages (<i>p</i> = .009), longer length of stay (<i>p</i> = .041), and Medi-Cal insurance (<i>p</i> = .006) were more likely to have ≥2 missed appointments. For the telehealth sessions, infants (N = 40) who had longer length of stay (<i>p</i> = .040) were more likely to have ≥2 missed appointments. There is a higher likelihood of ≥2 missed appointments for patients with a longer length of stay (OR = 1.02, 95% CI [1.01, 1.03]) and for in-person service delivery when compared to telehealth (OR = 6.25, 95% CI [1.37, 28.57]).</p> Conclusions <p>Telehealth was associated with higher likelihood of attendance, revealing that telehealth has the potential to increase access to early therapy services for certain populations. Future studies with larger sample sizes to determine which populations benefit from telehealth is recommended.</p>","author":"Tiana T. Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"75fdc655d827da37eb5e36cdab3195fe72db40e50b4b86d7a44d2d4c240b7e83","category":"Interdisciplinary"}