{"title":"The antimicrobial activity of an antiseptic soap against <i>Candida Albicans</i> and <i>Streptococcus Mutans</i> single and dual-species biofilms on denture base and reline acrylic resins","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306862","date":1720706400000,"content":"<p>by Camilla Olga Tasso, Beatriz Ribeiro Ribas, Túlio Morandin Ferrisse, Jonatas Silva de Oliveira, Janaina Habib Jorge</p>\r\n\r\nTo evaluate the effect of antiseptic soap on single and dual-species biofilms of <i>Candida albicans</i> and <i>Streptococcus mutans</i> on denture base and reline resins. Samples of the resins were distributed into groups (n = 9) according to the prevention or disinfection protocols. In the prevention protocol, samples were immersed in the solutions (Lifebuoy, 0.5% sodium hypochlorite solution and PBS) for 7, 14 and 28 days before the single and dual-species biofilms formation. Overnight denture disinfection was simulated. In the disinfection protocol, samples were immersed in the same solutions during 8 hours after the single and dual-species biofilms formation. Antimicrobial activity was analyzed by counting colony-forming units (CFU/mL) and evaluating cell metabolism. Cell viability and protein components of the biofilm matrix were evaluated using confocal laser scanning microscopy (CLSM). Data were submitted to ANOVA, followed by Tukey’s post-test (α = 0.05) or Dunnett’s T3 multiple comparisons test. In the prevention protocol, Lifebuoy solution effectively reduced the number of CFU/mL of both species. In addition, the solution decreased the cell metabolism of the microorganisms. Regarding disinfection protocol, the Lifebuoy solution was able of reduce approximately of 2–3 logs for all the biofilms on the denture base and reline resin. Cellular metabolism was also reduced. The images obtained with CLSM corroborate these results. Lifebuoy solution was effective in reducing single and dual-species biofilms on denture base and reline resins.","author":"Camilla Olga Tasso","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"75ff1e139d6417e56d090e7776335cbb473f86b4325559ef251ed8ca62de1594","category":"Interdisciplinary"}