{"title":"Not Everyone Likes Manatees: Fishers' Perceptions Unveil Opportunities and Challenges for Manatee Conservation in the Swamp Complex of Ayapel, Colombia","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4258?af=R","date":1727679600000,"content":"<h2>ABSTRACT</h2>\n<p>Greater Caribbean manatees <i>Trichechus manatus manatus</i> face complex conservation challenges throughout their distribution range, many of which are associated with human factors; and in consequence, the subspecies is considered Endangered (EN) by the International Union for Conservation of Nature (IUCN). Human-related threats as hunting for meat consumption, collisions with boats, entanglement in fishing nets, pollution and loss of habitat put the Greater Caribbean manatee at risk in Colombia. Studies aiming to describe traditional knowledge and local perceptions provide information that can be useful to design local manatee conservation programmes. We analyse the fishers' perceptions regarding manatees in Ayapel, Córdoba. One hundred semi-structured interviews were conducted, focusing on personal data, fishing practices, perceptions and knowledge about the manatees. According to the interviews, bycatch is the greatest threat to manatees (56%), followed by pollution (16%), whereas boat collisions (12%), hunting (11%) and drought (5%) are lower ranking threats. Our results demonstrated that participants have a good understanding of manatee biology and ecology. However, a human–manatee conflict was evidenced, as 39% of fishers consider that manatees negatively impact fishing by competition for the fishing resources and/or by damaging fishing gear. We recommend strengthening awareness about the importance of manatee to guarantee an optimal management of this subspecies and its habitat. Fishers should be directly involved in the formulation of management and conservation plans for the subspecies, as their knowledge becomes critical to understanding and mitigating the risks to manatee populations. This work has a clear application to understand the human factor in manatee recovery not only in our study area but also in other locations where manatees share habitat with people, particularly in marginalized human communities.</p>","author":"María Mercedes Ordoñez‐Nieto, \nNataly Castelblanco‐Martinez, \nKarick Jotty‐Arroyo","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"7602381e32ce4bdc850f49f3c9f440a36598530b211170f631e1ad196db80044","category":"Environment"}