{"title":"Omloop Het Nieuwsblad 2021: Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/omloop-het-nieuwsblad-2021-preview","date":1614195898000,"content":"\n      <p><i><span style=\"font-weight: 400;\">‘The season starts at Omloop!’</span></i></p>\n<p><span style=\"font-weight: 400;\">Ah, here we go again. Belgium's Opening Weekend will soon be upon us. For many, Omloop Het Nieuwsblad marks the traditional start of the cycling season.</span></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p><span style=\"font-weight: 400;\">This is the first opportunity for the cobble specialists to strut their stuff. Omloop is swiftly followed by Kuurne-Brussels-Kuurne the following day, which rounds out the Opening Weekend action.</span></p>\n<p><span style=\"font-weight: 400;\">Some of the sport’s biggest names have won Omloop Het Nieuwsblad, namely Eddy Merckx, Anna van der Breggen and Johan Museeuw.</span></p>\n<p><span style=\"font-weight: 400;\">The 2020 edition of Omloop het Nieuwsblad was one of the few races unaffected by the global pandemic, and took place in late February as originally planned. </span></p>\n<p><span style=\"font-weight: 400;\">In the men’s race, the selection at the front was reduced to three riders when Jasper Stuyven, Soren Kragh Andersen and Yves Lampaert went clear over the revered Kapelmuur. An attack from Lampaert dropped Kragh Andersen into the final kilometers, but Stuyven was the strongest in the sprint, claiming his first Omloop Het Nieuwsblad.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/kuurne-brussels-kuurne-2021-preview\">Kuurne-Brussels-Kuurne 2021: Preview</a><br></strong></em></p>\n<p class=\"p1\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\"><em><strong>The 2021 Men's Early Season: The Rouleur Racing Guide</strong></em></a></p>\n<p class=\"p1\"><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><em><strong><span class=\"s1\">The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></em></a></p>\n<p>The women's race also saw a first-time winner. Annemiek van Vleuten won solo in the rainbow jersey after a decisive attack on the Kapelmuur, despite a mechanical issue earlier on. The result only added to her remarkable, evergrowing palmares. </p>\n<p>As doubts have circled around the broadcasting rights of Omloop, it's also encouraging that the women's race could be <a href=\"https://twitter.com/OwenRogers/status/1362905981630480387\" target=\"_blank\" rel=\"noopener noreferrer\">streamed on the Proximus Facebook page.</a></p>\n<h4><b>Route</b></h4>\n<p>Last year's action clearly displayed that the Kapelmuur and Bosberg climbs are the pivotal points in the race. Pitching up to 19.8% at it’s steepest, the Muur in particular has the potential to swing the tide, despite being less than 500 meters in length. If you're not one of the riders passing the chapel at the summit in the lead, you have little chance of winning.</p>\n<p>The exact details of the 2021 route for both the men’s and women’s race are yet to be revealed. No fans will be allowed at the start, finish or on any of the cobbled sections throughout the event.</p>\n<p>A <a href=\"https://www.nieuwsblad.be/cnt/dmf20210223_93517566\" target=\"_blank\" rel=\"noopener noreferrer\">story from Nieuwsblad</a> suggested we're in for 200km of racing, with 13 climbs and 9 cobbled sections. This means that the route appears to be unchanged from last year. Among the climbs, we will see the Valkenberg (0.5km @ 8.1%), a famous climb which is often used in the Amstel Gold Race. The Muur and Bosberg sections remain unchanged, with a flat 13km run-in to the finish following the completion of the Bosberg.</p>\n<h4><b>The Contenders - Men</b></h4>\n<p><span style=\"font-weight: 400;\"><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032615-238_1024x1024.jpg?v=1613043029\" alt=\"Van Aert, Van der Poel, Alaphilippe\"><i>Julian Alaphilippe, Mathieu van der Poel and Wout Van Aert (Image credit: </i><i>Nico Vereecken / PN / SWPix</i><i>)</i></span></p>\n<p>Omloop is the first WorldTour one-day classic of the season. Therefore, all nineteen WorldTour teams will be in attendance. The ProTeams that have been given a wildcard are: Alpecin-Fenix, B&amp;B Hotels, Bingoal-Wallonie Bruxelles, Sport Vlaanderen, Arkéa-Samsic and Total Direct Énergie.</p>\n<p>There are three names to look out for at the cobble classics in 2021: <strong>Wout Van Aert,</strong> <strong>Mathieu van der Poel</strong> and <strong>Deceuninck-Quick-Step</strong>. </p>\n<p>However, Van Aert will not ride Omloop this year, he will start his season at Strade Bianche in March.</p>\n<p>Mathieu van der Poel is a more complex case. The Dutchman had not planned to be on the startline for Omloop either, instead racing the UAE Tour. After winning the opening stage in the UAE in emphatic style, Alpecin-Fenix stepped out of the race due to a staff member testing positive for COVID-19. We wait to see whether Van der Poel will instead opt to ride Omloop Het Nieuwsblad. If he is to start, he will have a target on his back from kilometre zero.</p>\n<p>Nonetheless, that makes Deceuninck-Quick-Step the favourites. The team are synonymous with the cobble classics, and of course, Julian Alaphilippe was the only rider able to stay with Van Aert and Van der Poel at the Tour of Flanders last season. That is, until he collided with a moto, ending his chances and his season.</p>\n<p>Essentially, Deceuninck-Quick-Step must make their presence known early on in proceedings. Although the start list for the 2021 edition is not yet official, <strong>Florian Sénéchal, Kasper Asgreen, Yves Lampaert, Julian Alaphilippe </strong>and <strong>Zdeněk Štybar</strong> are all set to start for the Belgian side. That makes at least five riders who could feasibly win the race - Štybar did in 2019.</p>\n<p>By sending their riders up the road on the attack early and often, Deceuninck force the other teams into working hard early on, where they will burn through their domestiques. On paper, this means Deceuninck should have a numerical advantage in the latter stages.</p>\n<p>This is precisely how Deceuninck have approached the classics of late.</p>\n<p>With weather often playing a key factor, things rarely play out as they seemingly should in the Belgian classics, which is exactly why we love them!</p>\n<p>AG2R Citroen have turned their attention to the cobble classics with their 2021 signings - two-time winner <strong>Greg Van Avermaet</strong> has joined and will partner up with <strong>Oliver Naesen</strong>. <strong>Sep Vanmarcke</strong> is another former winner, the 2012 victor has joined Israel Start-Up as their cobble leader.</p>\n<p><strong>Tim Wellens</strong> and <strong>Philippe Gilbert </strong>will lead Lotto Soudal, but young starlet<strong> Florian Vermeersch</strong> could act as Lotto’s secret weapon.</p>\n<p>It would be foolish not to mention last year's winner - <strong>Jasper Stuyven</strong> has now shown that he can win a cobble classic at WorldTour level, and alongside <strong>Mads Pedersen</strong>, Trek-Segafredo cannot be underestimated. </p>\n<p><strong>Søren Kragh Andersen</strong> finished third last season, alongside the likes of <strong>Tiesj Benoot</strong> and <strong>Nils Eekhoff</strong>, Team DSM have a genuine chance.</p>\n<p>Oh, we almost forgot, there is a rider named<strong> Peter Sagan</strong> in the peloton, heard of him? He didn’t race in Belgium in 2020 and was underwhelming in his 2019 classics campaign, but you can never write-off the Slovak. BORA’s new signing <strong>Nils Politt</strong> will act as his sidekick.</p>\n<p>And finally, we are likely to see Britain’s <strong>Tom Pidcock</strong> in his first cobble classic for the Ineos Grenadiers.</p>\n<p><b>The Contenders - Women</b></p>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032619-003_1024x1024.jpg?v=1613043127\" alt=\"Annemiek van Vleuten\"></b><em>Annemiek van Vleuten</em><i><span style=\"font-weight: 400;\"><em> </em>won Omloop Het Nieuwsblad in 2020. (Image credit: </span></i><i><span style=\"font-weight: 400;\">Tim van Wichelen / Cor Vos / SWPix</span></i><i><span style=\"font-weight: 400;\">)</span></i></p>\n<p><span style=\"font-weight: 400;\">At this point, we know much less regarding the provisional women’s startlist, which makes it more difficult to pick potential winners. However, fifteen wildcard teams will join the nine Women's WorldTour teams, including Team Jumbo-Visma Women and Lotto Soudal Ladies. </span></p>\n<p><b>Annemiek van Vleuten</b><span style=\"font-weight: 400;\"> will be back to defend her crown. The Dutchwoman has moved away from Mitchelton-Scott following a successful five-year spell to join Movistar. She has dominated an array of races in women’s cycling over the past decade, can she now continue that form with the Spanish outfit?</span></p>\n<p><span style=\"font-weight: 400;\"><span>With the departure of Van Vleuten, we are likely to see </span><b>Sarah Roy</b><span> and</span><b><span> </span>Grace Brown</b><span> given a greater leadership opportunity for Team BikeExchange. The duo finished one-two at the Australian National Championships earlier this month.</span></span></p>\n<p><span style=\"font-weight: 400;\">Trek-Segafredo’s </span><b>Lizzie Deignan</b><span style=\"font-weight: 400;\"> returned to her very best in 2020, winning La Course, GP de Plouay and Liege-Bastogne-Liege. She has already won Omloop het Nieuwsblad in 2016, her previous entry at the race, and therefore is among the very top contenders. With </span><b>Elisa Longo Borghini</b> – who <span style=\"font-weight: 400;\">had her best season yet in 2020 – alongside Deignan, Trek enter with a great chance.</span></p>\n<p><b>Marta Bastianelli </b><span style=\"font-weight: 400;\">has finished second at Omloop Het Nieuwsblad two years in a row. She’ll lead </span><b>Alé BTC Ljubljana</b><span style=\"font-weight: 400;\">, can she make it third-time lucky?</span></p>\n<p><em><span style=\"font-weight: 400;\">Cover image: Pauline Ballet / SWpix</span></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"760be1a4af2f91e7bc3151a78ca64e2ce76c3ae81bc8f729b2453a13eaf74088","category":"Cycling"}