{"title":"PSIX-27 Ultrasound scanning of carcass traits in Katahdin lambs for predictive breeding value and marketing premium","link":"https://academic.oup.com/jas/article/102/Supplement_3/800/7757919?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Ultrasound scanning (USS) technique has been routinely used in performance testing of meat animals, such as swine and beef cattle. This study is to evaluate USS application in organic lamb production, selection, and the accuracy of carcass traits and market value prediction. Ewes (n = 60) were bred, pregnancy diagnosed at 40 d post-mating, and their suckling lambs were assigned to two groups, a non-creep feeding (control) and creep feeding (treatment) group. Each group was balanced with sexes and litter size when allocated into groups at 30-d of age. All lambs had unrestricted suckled their dams during pasture grazing or grazing with creep feeding supplementation until weaning. There were 28 control and 32 treatment group lambs presented at weaning 90 d of age. Lambs were continued to graze as two groups on fescue-based pasture or grazing with creep feeding supplementation till marketing at 120 d. Weaning body weight (BW), average daily gain (ADG), and post-weaning growth weight were significantly (<span>P</span> &lt; 0.05) greater than control 24.0 kg, 226 g/d, and 28.0 kg for treatment group compared with control group at 21.3 kg, 196 g/d, and 25.3 kg, respectively. However, AGD was not significantly increased during the post-weaning creep supplementary feeding period. The ultrasound scanned carcass traits increase in creep feeding over control lambs at weaning and post-weaning measurements (Figure 1). The average ultrasound scanned back fat depth, loineye muscle depth, muscle width, and loineye muscle area were 2.2 mm, 17.9 mm, 45.6 mm and 5.8 cm<sup>2</sup> at weaning age of 90 d; and 2.6 mm, 20.9 mm, 48.0 mm, and 7.0 cm<sup>2</sup> at 120 d, respectively. The correlative associations (Table 1) between carcass traits and lamb BW, such as loineye muscle depth (LED), loineye muscle width (LEW), loineye muscle depth (LED) and loineye muscle area (LEA), and LEA were significantly improved (<span>P</span> &lt; 0.05) with increased BW. However, there was no difference in these traits due to treatment except backfat depth, which was significantly higher for treatment and females. Creep supplementary feeding lambs during pre-weaning has increased ADG and weaning weight; therefore, will enhance market values of organically raised lambs. The results indicate that USS technique is worthy of application in meat lamb selection, post-weaning performance and market premium prediction.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"761f1d140490d7beab50f1cf6b4b81a8c87db0d14f3f4daa1a26edda35716774","category":"Environment"}