{"title":"A giant 32-inch iMac is reportedly in testing–but not coming anytime soon","link":"https://www.macworld.com/article/1986404/apple-giant-32-inch-imac-testing.html","date":1689006849000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Head to <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1986404-1-0-0&amp;u=https://www.apple.com/mac/\" target=\"_blank\">Apple’s website</a> and the largest iMac you’ll find has a relatively petite 24-inch screen after the 27-inch model was retired in 2022. Fans of the larger form factor, however, have some cause for optimism, because the rumored 32-inch iMac has reportedly entered the early testing phase of development.</p>\n\n\n\n<p>While that means it’s more likely to eventually ship, there’s still a long way to go. Mark Gurman, the Bloomberg leaker-analyst who started the rumor <a href=\"https://www.macworld.com/article/1966933/imac-larger-than-30-inches-development-launch-specs.html\">last month</a>, warned in the subscribers-only edition of this weekend’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-07-09/apple-vision-pro-xr-headset-will-take-years-to-become-key-part-of-business-ljvfzfvr&amp;xcust=1-1-1986404-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a> that the new machine won’t launch until late 2024 at the absolute earliest, and could well appear at some point in 2025.</p>\n\n\n\n<p>Gurman, whose weekly newsletter schedule gives him an incentive to drip-feed leaks, also offered further detail on top of the earlier prediction. Having previously said only that the new iMac would have a screen larger than 30 inches, he is now indicating that it will, as widely guessed, be close to the same size as the <a href=\"https://www.macworld.com/article/667913/apple-pro-display-xdr-review-hands-on.html\">Pro Display XDR</a>, a 32-inch panel that also happens to be the largest screen—not just iMac—Apple has ever shipped.</p>\n\n\n\n<p>Apple’s Mac development team appears to be extremely busy. Before the 32-inch iMac arrives, we can expect the M3 update to the 24-inch iMac to launch, either in late 2023 or early 2024, according to Gurman. Following that launch, the focus will shift to something even larger: the research firm Omdia has claimed that Apple is working on an iMac with an astonishing <a href=\"https://www.macworld.com/article/1795989/oled-display-ipad-macbook-32-42-inch-imac.html\">42-inch OLED screen</a>. That’s reportedly pegged for a 2027 launch, assuming it ever becomes a reality.</p>\n\n\n\n<p>You can keep up with the latest rumors with our <a href=\"https://www.macworld.com/article/1484743/24-inch-imac-release-date-specs-m2-m3-processor-price.html\">new iMac superguide</a>. If you don’t want to wait for the new models to appear, however, it’s worth checking the best prices on the current range with our regularly updated <a href=\"https://www.macworld.com/article/672803/best-imac-deals.html\">iMac deals</a> roundup.</p>\n\niMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"762b3b00cbb372508e9297f0e339b78a0f330edb9e7faa5845fa5cb85e22fe12","category":"Apple"}