{"title":"Diet variation and trophic impact of weakfish, Cynoscion regalis, within multiple marine habitats of the eastern United States","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15897?af=R","date":1723462909000,"content":"<h2>Abstract</h2>\n<p>Weakfish (<i>Cynoscion regalis</i>) is not federally managed but feeds on species of management and ecological interest. We examined the trophic ecology of weakfish in Chesapeake Bay and the coastal and offshore waters of the eastern United States. For these areas, we determined the dominant prey of weakfish; identified how much diet variation was explained by the factors: season, size class, and year; and quantified prey biomass removed by weakfish from 2007 to 2019. In general, diet composition was mostly dominated by Engraulidae, Osteichthyes (bony fishes), and Mysidacea, and significantly varied by season and size class in Chesapeake Bay and coastal waters, although this was less dramatic in Chesapeake Bay. The total amount of variance explained by the three factors was 23.1% (Chesapeake Bay) and 14.7% (coastal waters), with year not being a significant factor in explaining weakfish diet variation for these areas. Weakfish total prey biomass removal occurred primarily in coastal waters in the fall and small size class (annual mean: approximately 41,038 t; maximum: approximately 63,793 t). Highly opportunistic feeders, weakfish cannibalism also played an essential part of their diet. These results have implications for fisheries and ecosystem management of weakfish when considering ecological interactions in regulatory approaches, such as recruitment and cannibalism, competition with federally managed fishes, and the natural mortality of their prey.</p>","author":"Angel Reyes Delgado, \nBrian E. Smith","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"762dc2434025315ed9f2cbfda9c89a68fe3a9afbeccd7c8ff00217abf3c26078","category":"Environment"}