{"title":"Bitwarden ประกาศจะรองรับระบบ Passkey เร็ว ๆ นี้","link":"https://www.blognone.com/node/134014","date":1685005019000,"content":"<div><div><div><p>ในช่วงหลัง ๆ มานี้ระบบ <strong>Passkey</strong> เริ่มเป็นที่นิยมมากขึ้นเรื่อย ๆ ด้วยความที่ตัว Passkey นั้นใช้งานค่อนข้างง่ายลดความเสี่ยงจากการใช้รหัสเดิมซ้ำ ๆ และลดยุ่งยากจากใช้ระบบยืนยันตัวตนแบบ 2 Fator Authentication ได้ด้วย ซึ่งเราสามารถใช้ Passkey แทนการใส่ password แบบเดิม ๆ ในเว็บไซต์ต่าง ๆ ได้เลย โดยจากการที่ <a href=\"https://www.blognone.com/node/133682\">Google นำร่องรองรับ Passkey ไปก่อนหน้านี้แล้ว</a> ล่าสุดทาง Bitwarden ซึ่งเป็นหนึ่งแอปฯ จัดการรหัสผ่านยอดนิยมก็ได้ประกาศที่จะรองรับ Passkey ในเร็ว ๆ นี้เช่นกัน</p>\n<p>ทาง Bitwarden ได้ประกาศแผนการว่าจะรองรับ Presskey ภายในปีนี้ ซึ่งระบบจะให้ผู้ใช้งานสามารถจำแนก Passkey ประเภทต่าง ๆ ที่ใช้ในแต่ละเว็บไซต์ได้ โดยจะรองรับกับบัญชีผู้ใช้งานส่วนตัว และบัญชีธุรกิจบน Bitwarden</p>\n<p>Bitwarden จะให้ผู้ใช้งานใช้ Passkey ทดแทนระบบ 2FA และการใช้ master password แบบเก่า แต่ถ้าผู้ใช้งานยังไม่อยากใช้ตัว Passkey นี้ ก็ยังสามารถเก็บระบบ password แบบเดิมได้ ในกรณีที่เกิดการความผิดพลาดระหว่างการใช้งาน Passkey ได้</p>\n<p>Passkey มีข้อดีกว่ารหัสผ่านทั่วไป เนื่องจากการใส่อักขระใส่ทั่วไปจะถูกแทนที่ด้วยการคีย์รหัสเฉพาะที่จะผูกกับบัญชีผู้ใช้งาน ซึ่งทำให้รหัสที่ได้จะไม่ซ้ำกัน และยังได้รับการป้องกันผ่านระบบ Biometric อย่าง การสแกนนิ้ว หรือสแกนใบหน้าอีกด้วย ซึ่ง Passkey นั้นมีความปลอดภัยกว่าระบบ 2FA เนื่องจากระบบ 2FA สามารถถูกเจาะโดยการโคลนซิมหรือวิธีการโจมตีอื่น ๆ ได้</p>\n<p>โดย Bitwarden ยังไม่ได้ระบุว่าจะเริ่มใช้งาน Passkey เมื่อไหร่ แต่ก็คาดว่าจะรองรับภายในช่วงเดือนกรกฎาคมของปีนี้ครับ</p>\n<p>ที่มา - <a href=\"https://www.androidpolice.com/bitwarden-announces-passkey-support/\">Android Police</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/bitwarden\">Bitwarden</a></div><div><a href=\"/topics/passkey\">Passkey</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"76361331a2728ce4755f3dd1427bd05d5edd899106fa3cabd6eee7532851d0b0","category":"Thai"}