{"title":"217 Weaning weight associated with improved nursery pig growth rate","link":"https://academic.oup.com/jas/article/102/Supplement_2/224/7664944?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Heavier body weight (BW) at weaning is associated not only with heavier birth weight, but also with heavier downstream BW at nursery exit and at fixed-time marketing. To further address management implications of wean weight (WW), this study evaluated WW impact on nursery pig start-up, gain to feed ratio (G:F), and performance variation from 6 to 20 kg BW. Individual BW were collected at the time of weaning using the LeeO individual animal identification system. Pigs (n = 1,054; PIC 800 x DNA 241 F1) were blocked by wean age (20.1 ± 0.8 d) and sex, ranked in order of individual WW (5.94 ± 1.35 kg), and split into eight WW groups each representing 12.5% of the weaning population (<span>P</span> &lt; 0.05; Table 1). Similar sized pigs were housed together (12 pigs/pen, 11 replicate pens/WW group) and fed a common 4-phase nursery diet for 42 d post-wean. Pen weights and feed disappearance were recorded at d 7, 14, 21, and 42, and individual BW were collected at d 42. Data were analyzed using linear mixed effects models in the lme4 package of R. Body weight differences (<span>P</span> &lt; 0.05) between each WW group were evident on d 0 and through d 7 post-weaning. The lightest 12.5% of the weaning population had the greatest (<span>P</span> &lt; 0.001) individual pig BW coefficient of variation (CV) at weaning and d 42 whereas no differences (<span>P</span> &gt; 0.05) in d 42 BW CV were evident among the other WW groups. During the first week post-weaning, average daily feed intake (ADFI) diverged (<span>P</span> &lt; 0.05) between the lightest 12.5% (113 g/d) and the heaviest 25% (134 g/d) of the wean population. From d 0 to 42, the lightest 12.5% WW pigs had slower average daily gain (ADG; <span>P</span> &lt; 0.001), less ADFI (<span>P</span> &lt; 0.001), and reduced exit BW (<span>P</span> &lt; 0.001) than the other WW groups. Neither ADG nor ADFI differed (<span>P</span> &gt; 0.05) among the median 50% of the population from d 0 to 42. No differences (<span>P</span> &gt; 0.10) in overall nursery G:F between any WW groups were observed. Across the population, regression analysis indicated a 0.45 kg increase in WW resulted in a 1.0 kg increase (linear, <span>P</span> &lt; 0.001) in nursery exit BW. Moreover, both ADG and ADFI as a percentage of BW increased as WW decreased, suggesting lighter WW pigs have competitive growth capacity to their heavier WW counterparts through 20 kg BW. Data demonstrates WW influences nursery exit weight of pigs fed a common diet. Future research should explore solutions to increase growth rate of light WW pigs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"763c8e994a2603d115ec79630938c5fb7178f4cf229b3a29c6af8c18eaafe3d8","category":"Environment"}