{"title":"Apple ยอมเพิ่มหน้าแอปแนะนำจากรัฐบาลรัสเซีย ช่วงตั้งค่าเริ่มต้น iPhone เครื่องใหม่","link":"https://www.blognone.com/node/121807","date":1616380469000,"content":"<div class=\"field field-name-body field-type-text-with-summary field-label-hidden\"><div class=\"field-items\"><div class=\"field-item even\"><p>เมื่อปี 2019 <a href=\"https://www.blognone.com/node/113470\">รัฐบาลรัสเซียออกกฎหมายบังคับให้คอมพิวเตอร์ สมาร์ทโฟน และทีวี ที่ขายในประเทศรัสเซีย ต้องลงแอปที่รัฐบาลอนุมัติมาด้วย</a> เช่น แอปเบราว์เซอร์ แอปส่งข้อความ หรือแอปแอนตี้ไวรัส</p>\n<p>ที่ผ่านมา Apple ยังไม่ได้ทำตาม แต่ภายในเดือนเมษายนนี้ Apple จะเริ่มเพิ่มขั้นตอนแอปแนะนำจากรัฐบาลรัสเซียในช่วงตั้งค่าเริ่มต้น iPhone เครื่องใหม่ ผู้ใช้สามารถเลือกดาวน์โหลดหรือไม่ก็ได้</p>\n<p>กฎหมายนี้ จะปรับเงินจากผู้ที่จำหน่ายอุปกรณ์ที่ไม่ลงแอปเหล่านี้ ซึ่งส่วนใหญ่จะไปกระทบกับตัวแทนจำหน่ายรายย่อย แต่กับ Apple ที่วางจำหน่ายมือถือ iPhone ผ่าน Apple Store ค่าปรับนี้จึงมาลงที่ Apple โดยตรง ทำให้ต้องตัดสินใจว่าจะยอมทำตาม หรือจะยอมถอยจากตลาดรัสเซียโดยสิ้นเชิง</p>\n<p>แม้ Apple ไม่ถึงกับยอมลงแอปแนะนำจากรัฐบาลมาในเครื่อง และนี่ก็ไม่ใช่ครั้งแรกที่ Apple ยอมทำตามกฎหมายรัฐบาลต่างชาติ แม้อาจสุ่มเสี่ยงกับความปลอดภัยของข้อมูลส่วนตัวผู้ใช้ เพราะก่อนหน้านี้ Apple เคยยอมเก็บข้อมูล iCloud และกุญแจถอดรหัสข้อมูลผู้ใช้ ไว้กับผู้ให้บริการคลาวด์ในประเทศจีน รวมถึงคอยลบแอปที่รัฐบาลจีนขอ ออกจาก App Store ของประเทศจีนอีกด้วย</p>\n<p>แต่การยอมแนะนำแอปในรัสเซียครั้งนี้ แสดงให้เห็นว่าเป็นอีกครั้งที่ Apple ยอมอ่อนข้อให้รัฐบาลที่ต้องการควบคุม หรือสอดส่องข้อมูล และการใช้งานอินเทอร์เน็ตของประชากร ซึ่งแม้แอปเหล่านี้จะไม่ได้พัฒนาโดยรัฐบาลเอง แต่ก็มักจะเป็นแอปที่รัฐบาลสามารถควบคุมได้ง่าย</p>\n<p>คงต้องติดตามต่อไปว่าการ “พบกันครึ่งทาง” ของ Apple ในครั้งนี้ จะเป็นการเปิดประตูให้รัฐบาลประเทศอื่นๆ ที่ต้องการควบคุมและเข้าถึงข้อมูลผู้ใช้ ทำตามอย่างหรือไม่</p>\n<p>ที่มา - <a href=\"https://www.wired.com/story/apple-russia-iphone-apps-law/\">Wired</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/413530381997801dcb9a213b69a21a2d.jpg\" alt=\"\" /></p>\n</div></div></div><div class=\"field field-name-taxonomy-vocabulary-1 field-type-taxonomy-term-reference field-label-above\"><div class=\"field-label\">Topics:&nbsp;</div><div class=\"field-items\"><div class=\"field-item even\"><a href=\"/topics/apple\">Apple</a></div><div class=\"field-item odd\"><a href=\"/topics/russia\">Russia</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"763d9884d1cf936ad25359901a7fed66bdf11e4e4c790cad4cd88b02920c1941","category":"Thai"}