{"title":"An NLP-based novel approach for assessing national influence in clause dissemination across bilateral investment treaties","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298380","date":1710252000000,"content":"<p>by Shahadat Uddin, Haohui Lu, Wolfgang Alschner, Dori Patay, Nicholas Frank, Fabio S. Gomes, Anne Marie Thow</p>\r\n\r\nInternational investment agreements (IIAs) promote foreign investment. However, they can undermine crucial health programs, creating a dilemma for governments between corporate and public health interests. For this reason, including clauses that safeguard health has become an essential practice in IIAs. According to the current literature, some countries have played a pivotal role in leading this inclusion, while others follow the former ones. However, the existing literature needs a unique approach that can quantify the influence strength of a country in disseminating clauses that explicitly mention health provisions to others. Following an NLP (Natural Language Processing)-based text similarity analysis of Bilateral Investment Treaties (BITs), this study proposes a metric, ‘Influence’ (<i>INF</i>), which provides insights into the role of different countries or regions in the propagation of IIA texts among BITs. We demonstrate a comprehensive application of this metric using a large agreement dataset. Our findings from this application corroborate the evidence in the current literature, supporting the validity of the proposed metric. According to the <i>INF</i>, Germany, Canada, and Brazil emerged as the most influential players in defensive, neutral, and offensive health mentions, respectively. These countries wield substantial bargaining power in international investment law and policy, and their innovative approaches to BITs set a path for others to follow. These countries provide crucial insights into the direction and sources of influence of international investment regulations to safeguard health. The proposed metric holds substantial usage for policymakers and investors. This can help them identify vital global countries in IIA text dissemination and create new policy guidelines to safeguard health while balancing economic development and public health protection. A software tool based on the proposed <i>INF</i> measure can be found at https://inftool.com/.","author":"Shahadat Uddin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7640810c134c3664b731b3fd52389f85a5457c2cb1dd41701796694a089f3dc9","category":"Interdisciplinary"}