{"title":"Fresh vs. Preserved Specimens: Length‐Weight Relationships of Fishes from the Western Amazon (Napo Basin, Ecuador)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/2430326?af=R","date":1719493483000,"content":"<p>Length-weight relationship (LWR) studies are important for fish taxonomical analysis, ecological assessments, management, and conservation practices. Although LWR studies can use measurements of either fresh or preserved specimens, few studies have directly compared these methods. This study analyzed the effect of preservation on LWR of ten small-sized freshwater fish species from the Curaray River basin (Napo Basin), eastern Ecuador. 255 wild specimens were measured, weighed, fixed in formalin, and finally preserved in 70% ethanol. 287 specimens from the same species batch were measured again after preservation. We estimated LWR curves with linear regressions and compared slopes and intercepts between fresh and preserved specimens. The preservation process altered weight significantly for all ten species and altered both weight and length for two species. The magnitude of change varied according to the morphology and maximum size of each species. Smaller individuals exhibited greater proportional weight losses. LWR estimates for eight of the species are new to science. These results present new evidence of the preservation effects in LWR studies as well as a compilation of the varying results reported in the literature. We conclude that measurements on fresh specimens should be encouraged for LWR studies. However, recognizing that this is not always feasible, studies using preserved specimens should consider the effects of preservation on body length and weight.</p>","author":"Karla S. Barragán, \nJunior Chuctaya, \nDaniel Escobar-Camacho, \nJosé Vieira, \nAndrea C. Encalada, \nPragyan Dash","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"7641fcac713fd447041d8d29e6cf14c9bb763af1cc5e6ea6ee87aeb73bb38b84","category":"Environment"}