{"title":"Microsoft changes course, gives gamers a reason to stick with Windows 10","link":"https://arstechnica.com/?p=1781356","date":1626720322000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Screenshot-7465-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Screenshot-7465.png\">Enlarge</a> <span>/</span> Microsoft has advertised \"Xbox Velocity Architecture\" to summarize a range of game-loading boosts for its newest consoles. The upcoming DirectStorage API is primed to bring some of those benefits to Windows PCs, but now that it is spread across two OSes, with varying speed expectations on each, will it have the same impact? (credit: Microsoft)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Microsoft's <a href=\"https://arstechnica.com/gadgets/2021/06/microsoft-details-windows-11-with-new-ui-and-android-app-support/\">Windows 11 unveiling</a> in June came with announcements across the company's many departments, including <a href=\"https://arstechnica.com/gaming/2021/06/gaming-on-windows-11-directstorage-api-auto-hdr-will-require-os-update/\">a warning from the company's gaming division</a>: you'll need Windows 11 to play games that employ select \"next-gen\" APIs, particularly the new DirectStorage API.</p>\n<p>On Friday, the company's DirectX team walked that OS restriction back.</p>\n<p>\"Microsoft is committed to ensuring that when game developers adopt a new API, they can reach as many gamers as possible,\" DirectX Program Manager Hassan Uraizee writes in explaining that <a href=\"https://devblogs.microsoft.com/directx/directstorage-developer-preview-now-available/\">the upcoming DirectStorage API will no longer be Windows 11-exclusive</a>. This statement comes alongside Microsoft's launch of a DirectStorage preview program that will let developers immediately begin testing this feature in intensive 3D software. The API, among other things, redirects I/O calls for 3D graphical assets directly to a computer's GPU.</p></div><p><a href=\"https://arstechnica.com/?p=1781356#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781356&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"764da52ffd44327ee01c4f0db44fbc215d932ffe50b8fe691a1d519cf7e7a73c","category":"Tech"}