{"title":"Unraveling the Genomic Landscape and Stress Responses of Cowpea Thaumatin-Like Proteins: A Comprehensive Analysis","link":"https://www.preprints.org/manuscript/202409.0657/v1","date":1725883669000,"content":"Cowpea (Vigna unguiculata (L.) Walp.) is an important legume cultivated mainly in regions with limited water availability across the African and American continents. Its productivity is significantly affected by environmental stresses. Thaumatin-like proteins (TLPs), which belong to the PR-5 (Pathogenesis-Related 5) protein family, are known to be responsive to both biotic and abiotic stresses. However, their role remains controversial, with some TLPs associated with plant defense (particularly against fungal infections) and others associated with drought response. In this study, we evaluated the structural diversity and gene expression of TLPs in cowpea (VuTLPs) under different stress conditions, including biotic [mechanical injury followed by inoculation with Cowpea Aphid-borne Mosaic Virus (CABMV) or Cowpea Severe Mosaic Virus (CPSMV)] and abiotic (root dehydration). Genomic anchoring of VuTLPs revealed 34 loci encoding these proteins. Neighbor-joining analysis clustered the VuTLPs into three distinct groups. We identified 15 segmental duplication and six tandem duplication gene pairs, with the majority of VuTLP genes found to be under purifying selection. Promoter analysis associated VuTLPs with bHLH, Dof-type, and MYB-related transcription factors, supporting their diverse roles. Diversity in VuTLP function was also observed in their expression profiles under various stress conditions. Gene expression data showed that most VuTLPs are recruited within the first minutes after stress imposition, except in the root dehydration assay, where most transcripts were induced 150 minutes post-stress, a finding also validated by qPCR. Moreover, the data suggest that VuTLPs exhibit functional specialization depending on the stress condition, highlighting their diverse roles and biotechnological potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"766aa97caf92d234973146cd3eeaf12ff1eb6482284d0861c24cf3936cce70c6","category":"Interdisciplinary"}