{"title":"Apple Vision Pro Captures 3D Spatial Videos and Photos","link":"https://www.macrumors.com/2023/06/06/vision-pro-3d-videos-photos/","date":1686070285000,"content":"Apple's new Vision Pro headset is equipped with an array of cameras for everything from eye scanning to gesture tracking, but it also has an external camera for capturing photos and videos.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/vision-pro-video-recording.jpg\" alt width=\"1595\" height=\"897\" />\r<br />\nThe 3D camera on the Vision Pro takes 3D photos and records 3D videos that can be viewed back on the headset. Apple says that the feature is designed to allow users to relive their memories like never before. Standard photos from an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or another device can also be viewed on the headset, but the 3D images will be much more immersive.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/vision-pro-3d-video.jpg\" alt width=\"1492\" height=\"839\" />\r<br />\nSpatial videos and photos are designed to have \"incredible depth\" according to Apple, which lets the user \"see into a moment.\" They can be expanded and zoomed in just like a regular photo.\r<br />\n\r<br />\nThere is a button at the top of the headset that is designed to let users capture spatial videos or photos, and while recording is ongoing, the headset's external display flashes with an animation that lets the people around you know that video is being recorded.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/vision-pro-camera-button.jpg\" alt width=\"744\" height=\"418\" />\r<br />\nWith the recording indicator, no one will be able to use Vision Pro record video or take images in secret, which is a problem that prior headsets have faced. Google Glass, Google's now-defunct AR smart glasses, allowed for surreptitious photo and video recording in public spaces. Google came under fire for its capabilities, and some businesses even began banning the use of Google Glass.\r<br />\n\r<br />\nIt is not clear if Apple will face some of the same issues with Vision Pro, but it at least makes it clear when a video is being recorded thanks to the unique external display. It's also not as lightweight and wearable as Google Glass, so it is unlikely many people will be wearing the Vision Pro out in public.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/06/vision-pro-3d-videos-photos/\">Apple Vision Pro Captures 3D Spatial Videos and Photos</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-captures-3d-spatial-videos-and-photos.2391916/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"766d9c3f637e88e6fbf4414c88f8f4ba0b72a594c22c7251b6fa8649a61da645","category":"Apple"}