{"title":"Bipartisan bill would force Big Tech to offer algorithm-free feeds, search results","link":"https://arstechnica.com/?p=1811685","date":1636493491000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/getty-us-capitol-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/12/getty-us-capitol.jpg\">Enlarge</a> <span>/</span> The dome of the United States Capitol Building in Washington, DC. (credit: <a href=\"https://www.gettyimages.com/detail/photo/united-state-capitol-royalty-free-image/889829480?adppopup=true\">Getty Images | Phil Roeder</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A bipartisan group of lawmakers in the House of Representatives introduced a bill that would force social media platforms to allow people to use the site without algorithms that filter or prioritize the content that users see. The bill joins a similar act proposed in the Senate, and together, the bills suggest that lawmaker animus toward social media companies isn’t going away.</p>\n<p>“Consumers should have the option to engage with Internet platforms without being manipulated by secret algorithms driven by user-specific data,” Rep. Ken Buck (R-Colo.) said in a statement to Ars. Buck introduced the <a href=\"https://www.documentcloud.org/documents/21100363-buck_030_xml-filter-bubble\">bill</a> with three cosponsors, Reps. David Cicilline (D-R.I.), Lori Trahan (D-Mass.), and Burgess Owens (R-Utah).</p>\n<p>“Facebook and other dominant platforms manipulate their users through opaque algorithms that prioritize growth and profit over everything else,” Rep. Cicilline said in a statement. “And due to these platforms’ monopoly power and dominance, users are stuck with few alternatives to this exploitative business model, whether it is in their social media feed, on paid advertisements, or in their search results.”</p></div><p><a href=\"https://arstechnica.com/?p=1811685#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811685&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"76872e6d3c9757046f01fcb082896ef092a0e5411551597084c94c408f2b842a","category":"Tech"}