{"title":"The Collatz Conjecture \"The Nonexistence of Divergent Orbits, through a Dynamic Diophantine Linear Analysis of Codification","link":"https://www.preprints.org/manuscript/202408.0985/v1","date":1723620421000,"content":"We define the function $Col: \\mathbb{N} \\to \\mathbb{N}$ as the Collatz function, given by $3n + 1$ if $n$ is odd and $\\displaystyle\\frac{n}{2}$ if $n$ is even  \\cite{Lagarias1990}. The conjecture postulates that for any positive integer, at some point, its iteration will reach 1, or equivalently, every orbit will fall into the periodic cycle $\\{4, 2, 1\\}$. Two conditions would invalidate the conjecture: the existence of a divergent orbit or the presence of another cycle. In 2019 Terence Tao \\cite{tao} proved that almost all orbits converge to the trivial cycle of $\\{1,4,2\\}$, in this work we will prove the non-existence of divergent orbits.  The central idea is to decompose the dynamic system $Col$ into a binary dynamic system, generated by different compositions of two functions. This differs from a typical dynamic system, which is generated by the iteration of a single function. We consider the   system generated by the functions $\\theta, \\psi: \\mathbb{R} \\to \\mathbb{R}$, defined as $\\displaystyle\\theta(x) = \\frac{x}{2}$ and $\\displaystyle\\psi(x) = \\frac{3x + 1}{2}$, denoted as $\\langle \\theta, \\psi \\rangle$. We examine sequences of functions in $\\langle \\theta, \\psi \\rangle$ of the form $S_k(x) = s_k \\circ S_{k-1}(x)$ with $s_k \\in \\{\\theta, \\psi\\}$.  We define a function that assigns to each element of these sequences an integer, called the minimum value positive integer or simply the minimum value. This corresponds to the smallest positive integer $n$ such that $S_k(n)$ is an integer. As we will prove later, the minimum value is monotonically increasing, meaning that increasing the terms of the sequence will never result in a value lower than the previous one. Based on this behavior, we distinguish two types of sequences: stable ones, where the minimum value is constant from a certain point, and unstable ones, where the minimum value is divergent.  The main result for unstable sequences is that when the slope of the sequence is divergent, the sequence is unstable. From this result, we can prove that there are no divergent orbits for the function $Col$.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"768f2293cc9b0ad5c9887293527b4958b6a33df5ccc30873a9d7e5b1352aae77","category":"Interdisciplinary"}