{"title":"The iPhone 13 is coming: How big of a leap will it be, really?","link":"https://www.macworld.com/article/355170/iphone-13-launch-how-big-of-a-leap.html","date":1631184300000,"content":"<div>\n<section><div></div></section><p>If you’re on a site like Macworld.com, reading articles about an unannounced iPhone in advance of its September 14 launch, it’s safe to say you’re a pretty big fan. Or at least, you’re dialed-in to the world of smartphones enough to know one Geekbench score from the next. For you, the improvements in each iPhone are probably notable, even exceptional. But are they really <em>that</em> impactful? Let’s take a look at the <a href=\"https://www.macworld.com/article/234814/2021-iphone-13-rumors-specs-price-release.html\">most significant four rumored iPhone 13 upgrades</a>—performance, cameras, ProMotion, and always-on display—and consider whether they will <em>really</em> matter for the average iPhone user.</p>\n\n\n\n<h2>Performance and the A15 SoC</h2>\n\n\n\n<p>We took a closer look at <a href=\"https://www.macworld.com/article/339688/apple-silicon-a15-processor-cpu-gpu-neural-engine-preview-speed-ram.html\">what to expect from the A15 processor</a> earlier this year. Still made with a 5nm manufacturing process, we can expect most of the improvements to the A15 to come from architectural changes and simply making the chip bigger. Which often means a little hotter and more power-hungry. (Apple is expected to increase the battery capacity to offset this.)</p>\n\n\n\n<p>The short story here is that the A15 is probably going to be somewhere around 10-15 percent faster than the A14 present in the iPhone 12. If Apple finally moves to <a href=\"https://www.pcworld.com/article/3410279/samsungs-next-gen-ram-will-make-your-phone-way-faster-but-the-galaxy-note-10-wont-get-it.html\">LPDDR5 memory</a>, then specific tasks that are bottlenecked by memory bandwidth should be significantly faster than that. And the company will almost certainly lean hard into image processing and neural network performance. </p>\n\n\n\n<p>Faster is always better, and we have no reason to believe that the A15 will be anything other than the fastest smartphone processor anywhere. The only thing is, there’s just nothing that really taxes the A14. Or for that matter, the A13. Your average person isn’t going to notice a significant difference in the things they do most (social media, web browsing, email, Messages, and so on) between a two-year-old iPhone and the one Apple releases this year. Without some spectacular new gotta-have-it software feature that just doesn’t run on a lesser SoC, the A15 won’t be a game-changer for your average iPhone user. We’ll probably only really appreciate the speed bump three years down the line when we notice that iOS 18 runs a lot better on an iPhone 13 than an iPhone 12.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/apple-a14-chip.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Will the A15 chip run circles around the A14? Probably not.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>ProMotion 120Hz display</h2>\n\n\n\n<p>While we probably won’t notice the improved performance of the A15 anywhere outside of a benchmark chart, we will almost certainly feel the improved smoothness and responsiveness of a 120Hz ProMotion display. If the iPad Pro is anything to go by, it makes a difference you can certainly feel when you scroll through your Twitter or Instagram feed.</p>\n\n\n\n<p>Unfortunately, this feature is rumored to be limited to the iPhone 13 Pro and Pro Max, which seriously limits its reach. And while 120Hz displays definitely make things feel smoother, the touch responsiveness of the iPhone is already so good you’re not likely to notice a huge change there. It’s great for reducing Apple Pencil latency on the iPad Pro, but that’s not a consideration here unless Apple also announces iPhone support for its stylus.</p>\n\n\n\n<p>So for those “Pro” buyers, this is an upgrade that even an average person might not notice. You’ll probably hear things from iPhone 12 Pro buyers like “it’s so much <em>faster</em>,” because smoother scrolling and interface animations have the effect of making things <em>seem</em> faster. But in reality, unless you’re comparing them side by side, it probably won’t be a huge deal.</p>\n\n\n\n<h2>Camera improvements</h2>\n\n\n\n<p>We know the iPhone 13 will have improvements to the camera (every iPhone does!), but it’s not entirely clear what they may be. Some rumors state that the entire iPhone 13 lineup will get the LiDAR sensor, rather than just the Pro models. That makes AR apps run a little better and portrait mode work in the dark, but it’s really not a big deal. The camera array in leaked schematics shows a larger camera area with bigger cutouts for the lenses, which suggests a new lens array and possibly new larger sensors underneath. Some say autofocus is coming to the UltraWide camera, and Portrait Mode will be available while shooting video.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/iphone-12-pro-lidar-camera.jpeg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The iPhone 13’s camera will look like the iPhone 12’s camera, but will it take noticeably better photos?</p></figcaption></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>All nice upgrades, but none of these are game-changers. This is the steady march of smartphone progress we’ve come to expect, and for your average everyday consumer, the difference between the quality of a “pull out your iPhone real quick and snap a pic for the Insta” on the iPhone 12 and iPhone 13 will not be huge. Professionals who pixel-peep at edge cases are probably going to see significantly improved performance in the most challenging scenarios, but daily snapshotting is likely to be pretty similar.</p>\n\n\n\n<p>The next big advances in iPhone photography will probably come from very high-resolution sensors (48 megapixels vs. the 12 megapixels we’re used to) and new designs like periscope lenses that could allow for extreme optical telephoto. Those sorts of features have been rumored for the <a href=\"https://www.macworld.com/article/352696/2022-iphone-14-rumors-specs-design-release-date.html\">iPhone 14</a> next year, not the iPhone 13.</p>\n\n\n\n<h2>Always-on display</h2>\n\n\n\n<p>It’s rumored that the iPhone 13 will feature an always-on display somewhat similar to that on the Apple Watch. It’s unclear how this would work exactly, and what information would be shown, but this has <em>huge</em> potential. This is the sort of feature we hope to see on all iPhone 13 models, not just the Pro models, because it can change the way we use our iPhones. All that time they sit flat on a desk or table…it’s not difficult to pick up your iPhone to check the time or see if you have important notifications, but it’s far better not to have to!</p>\n\n\n\n<p>Android phones have had this feature for years, with various implementations. At its most basic, simply being able to glance at the time without even reaching for your phone to turn it on is always useful, especially in a dark room, but there are so many other ways this could change the way we use our iPhones. We can only hope that if the iPhone 13 does have an always-on display, it’s on all the phones (not just the Pro models), and it’s somewhat customizable. If Apple does it right, an always-on display could be the marquee feature of the iPhone 13.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/iphone-rumor-always-on.jpg?quality=50&amp;strip=all\" /><figcaption><p>An always-on display could be one of the best reasons to buy an iPhone 13.</p></figcaption></figure><p>EverythingApplePro</p></div>\n\n\n\n<h2>An iPhone 12s in all but name</h2>\n\n\n\n<p>Shortly after the release of the iPhone 12, there were rumors that this year’s model would be the iPhone 12s. That doesn’t seem likely (Apple sort of retired the “S” branding back with the iPhone XS), but this does appear to be the same sort of upgrade we used to get with the “S” model iPhones. It’s got a new faster processor and a couple of new features, but the overall design hasn’t changed and everything else is the same but a little better.</p>\n\n\n\n<p>Sure, there’s supposed to be a smaller notch and that’s nice, but it’s still a notch. Yeah, the cameras will be better, but it doesn’t appear we’re in for the kind of step-change we saw when Apple added a whole second or third camera module to the back. Face ID is said to still be the only biometric authentication, despite long-running rumors of Apple developing improved under-display fingerprint technology.</p>\n\n\n\n<p>It’s enticing to think that Apple may still surprise us with some really important new feature that didn’t leak out to the rumor mill. It’s possible, but these days it seems to happen so rarely. Usually, we have a really good idea of what the new iPhone will bring before Apple unveils it and it’s unlikely the iPhone 13 launch is any different.</p>\n\n\n\n<p>There’s nothing wrong with an iPhone that is, broadly speaking, basically the same as last year’s model but a bit better. Most people don’t upgrade every year, so they’re going to be floored by the improvement over their iPhone XS or XR. And it’s not like Apple is way behind its competitors and has to make huge leaps to catch up. Apple can’t reinvent the wheel every year and we shouldn’t expect them to, nor should we only consider the new iPhone to be good if it’s full of radical changes. </p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"76976583a1c80e67535a6a589bf5a943c5df0244f5cab96bf3d11496b2014d4f","category":"Apple"}