{"title":"NURVV Run In-Depth Review","link":"https://www.dcrainmaker.com/2021/02/nurvv-run-in-depth-review.html","date":1613164335000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-Review.jpg\"><img width=\"720\" height=\"480\" title=\"NURVV-Run-Review\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"NURVV-Run-Review\" src=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-Review_thumb.jpg\" border=\"0\"></a></p>\n<p>There have been many running efficiency products over the years, usually designed to analyze aspects of your running technique, and then ideally provide real-time (during run) or post-run feedback on how to improve. The form of these products varies, but are often somehow connected to your shoes. Insoles are popular, as are small pods. And most of them then connect to your phone. Some also your GPS watch.</p>\n<p>To which, NURVV pretty much said: Yes, all of that please. Also…add GPS in too.</p>\n<p>Their ultimate goal is to be a single cohesive platform from data collection (including insoles inside your shoes, and GPS attached to your shoes) to real-time coaching feedback via a smartphone app, to post-run analysis. And on a purely technical level – they do actually achieve that. Sure, I’ll quibble about the GPS accuracy and a few other usability aspects that could use some improvement. But on the whole – they’ve done *far* more than any previous product in this category.</p>\n<p>The challenge though for NURVV is actually not technical or product. Rather, it’s alignment of market purpose to market users. But…we’re getting ahead of ourselves. First, let’s talk hardware.</p>\n<p>Actually, first a quick note that NURVV sent over these media loaner units to test. Once I’m done here, they’ll get them shipped back to them. It’s how I roll. If you found this review useful, hit up the links at the end, or consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<h3><span style=\"font-weight: bold;\">The Hardware:</span></h3>\n<p><img width=\"720\" height=\"480\" src=\"https://media.dcrainmaker.com/images/2020/11/DSC_1141.jpg\"></p>\n<p>First up is the hardware, which is critical (and required) for the entire NURVV system. Unlike some units you’ll buy, this is very shoe-size specific. Depending on your shoe size, they’ve got one of six different insole sizes. Thus, resale of these is unlikely unless you find a buyer of the same size. Here’s the box they come in:</p>\n<p><img width=\"720\" height=\"480\" src=\"https://media.dcrainmaker.com/images/2020/11/DSC_1143.jpg\"></p>\n<p>And here’s the contents:</p>\n<p><img width=\"720\" height=\"480\" src=\"https://media.dcrainmaker.com/images/2020/11/DSC_1146.jpg\"></p>\n<p>Essentially you’ve got the insoles themselves, a charging connector (+ micro USB cable), and then the NURVV pods that connect to the insoles.</p>\n<p>You can see the insoles are crazy thin. Each insole has 16 sensor/pressure pads spread across the full surface (32 if you count both insoles):</p>\n<p><img width=\"720\" height=\"480\" src=\"https://media.dcrainmaker.com/images/2020/11/DSC_1159.jpg\"></p>\n<p>These sensors then provide data, including the foot strike location and pronation information. Whereas aspects like elevation or distance/pace will be derived from the pods.</p>\n<p>To get them installed, you’ll remove your existing insole for a moment, and then slide these underneath it, then replace the insoles again. This is notable compared to a few other systems I’ve tried that act as the insole that your sock touches. In my experience those products eventually die due to the constant rubbing between sock and insole (just as your insoles eventually normally wear out). But by placing these below the normal/main insole that should alleviate this a bit. But realistically that’ll take a long time to find out.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_2893.jpg\"><img width=\"720\" height=\"480\" title=\"DSC_2893\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"DSC_2893\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_2893_thumb.jpg\" border=\"0\"></a></p>\n<p>The company says they’ll last 1,500mi (2,400km) of running, after which they can be replaced for $80 (you don’t have to throw away the pods). To help you on the math, they’d last a year if you did ~30mi/50km a week.</p>\n<p>Speaking of the pods, they attach on the outside edge of your shoe, via a thin ribbon cable that you’ll ideally not notice. The entire insole + cable/connector comes in at 22g each, which I also didn’t notice (but I don’t wear lightweight shoes). The pods are 55g each, and I haven’t noticed those on my gigantic feet either.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_1155.jpg\"><img width=\"720\" height=\"480\" title=\"DSC_1155\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"DSC_1155\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_1155_thumb.jpg\" border=\"0\"></a></p>\n<p>Now, I say ‘ideally’, because that’s the best way to describe it. In my case, on my first run, my (poor) choice of socks that day meant the cable was rubbing on my ankle skin, which in turn meant I left a small blood trail the entire run. No really, I’m not kidding. I have photos. It looks like I was attacked by a squirrel on my run.</p>\n<p>This was largely my fault – I should have worn socks that didn’t expose any skin for that run, until my skin got used to that slight bit of rubbing. Each shoe will be different, as will each foot. Now two months later, I don&#8217;t notice it at all (nor am I leaving a bloody trail in the snow).</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2020/11/2020-11-08-16.30.26_thumb.jpg\"></p>\n<p>Each pod is exceptionally well attached to the ribbon clamp. Arguably a bit too well some days, but it’s definitely not going anywhere. With a fair bit of force though, you can unlock/snap it from the shoe clamp, to then charge it in the charging connector.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_2885.jpg\"><img width=\"355\" height=\"237\" title=\"DSC_2885\" style=\"display: inline; background-image: none;\" alt=\"DSC_2885\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_2885_thumb.jpg\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_2886.jpg\"><img width=\"355\" height=\"237\" title=\"DSC_2886\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"DSC_2886\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_2886_thumb.jpg\" border=\"0\"></a></p>\n<p>The charging doohickey charges both pods at the same time. The battery life of the pods is unfortunately only about 5 hours, so many runners will likely have to charge at least once per week to get through a full slate of workouts. The app will tell you exactly how much running time is remaining:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7983.png\"><img width=\"357\" height=\"770\" title=\"IMG_7983\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7983\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7983_thumb.png\" border=\"0\"></a></p>\n<p>While I’m going to cover the app in more detail in the next section, that’ll mostly be for the analytics side. For now, let’s continue with some app settings type stuff related to the hardware. For example, above in that screenshot, I can also see the exact firmware version of both pods, as well as the serial numbers. I can toggle on and off autopause, which will do exactly as it says if you stop for a stoplight or an ice cream mid-run.</p>\n<p>Also up there is the ANT+ ID for the internal footpod. This is because the unit can broadcast as an ANT+ footpod to devices, namely Garmin &amp; Wahoo watches, to connect to it for more stable pace. In fact, you could even use this for Zwift running if you want to, as it would broadcast as the running footpod that Zwift needs.</p>\n<p>In addition, it can also connect via ANT+ &amp; Bluetooth Smart to heart rate sensors (straps, or even Garmin watches broadcasting), as well as via their Apple Watch app from an Apple Watch. I’ll give credit here, they’ve done the homework and thought this through, and implemented it properly. One has to wonder how a tiny startup can properly get heart rate via an Apple Watch, yet a billion-dollar company like Peloton is too lazy to enable Apple Watch HR broadcasting via a tiny Apple Watch app to their Peloton Bikes. I mean…just sayin’.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7987.png\"><img width=\"357\" height=\"770\" title=\"IMG_7987\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7987\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7987_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7988.png\"><img width=\"357\" height=\"770\" title=\"IMG_7988\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7988\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7988_thumb.png\" border=\"0\"></a></p>\n<p>Now, that said – it’s actually not working for me anymore. I mean, it was until yesterday – happily paired to a chest strap, except then I went to re-do the pairing screen. Partly for this review, and partly to check something else out, and since then I can’t get it to re-pair as a sensor. I haven’t troubleshot extensively, but I was wearing like 6 heart rate sensors at the time (and just one right now) – so invariably it should have found *something*.</p>\n<p>Within the settings you can also test the sensors. Which is like playing a light-up version of Twister with your feet. Though it serves zero training purpose, it’s fun and satisfying. Of course, it’s also (primarily) there for troubleshooting.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7985.png\"><img width=\"357\" height=\"770\" title=\"IMG_7985\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7985\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7985_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7986.png\"><img width=\"357\" height=\"770\" title=\"IMG_7986\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7986\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7986_thumb.png\" border=\"0\"></a></p>\n<p>Finally, within the settings you can change the units of measurement and connect to Strava. Given the platform doesn’t have any other exporting method, connecting to Strava is kinda important.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7990.png\"><img width=\"357\" height=\"770\" title=\"IMG_7990\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7990\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7990_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7989.png\"><img width=\"357\" height=\"770\" title=\"IMG_7989\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7989\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7989_thumb.png\" border=\"0\"></a></p>\n<p>At the same time – I don’t really understand who the consumer is here that wouldn’t likely have a TrainingPeaks account. Thus the lack of connection option beyond Strava (including lack of TrainingPeaks) is kinda weird. Same goes for lack of ability to export any workout files manually if you wanted to, such as to analyze elsewhere.</p>\n<p>Which, makes it as good a time as any to dive deeper into the app.</p>\n<h3><span style=\"font-weight: bold;\">The App and Data:</span></h3>\n<p>As odd as it may seem, in many ways the hardware isn’t the primary piece of the NURVV platform puzzle. Yes, it’s fed into the app and shown in numerous places, but it’s also not actually going to be critical path to every interaction you have in the app. A lot of what the app is trying to get you to do is shed light on how much you should be running each day/week, based on keeping you healthy and safe. As any running coach will tell you – the most important thing in coaching running to getting an athlete to the starting line healthy.</p>\n<p>It’s far too common in running to add too many ‘miles’ too quickly, resulting in injury. Because the NURVV app is not only tracking your miles, but shifts in your running form, it can theoretically detect where things are faltering, and tell you to pull back a bit. This includes looking at risk areas like balance and footstrike, but also more simplistically your overall running training load. But that does assume it’s aware of all your training load. If you do runs without it (or, forget to turn it on), it skews the data.</p>\n<p>Now when it comes to capturing a run, you’ve got two basic options:</p>\n<p>A) Run with your phone, and the app running, connected to the pods<br />\nB) Run without your phone, with the pods track everything, and download it later.</p>\n<p>I’ve primarily done the second option, since I’m mainly interested in the after the fact data. But I have done some ‘coached’ runs using the app live. So we’ll start on that real quick. For example, yesterday I did one where I went in and had it create a new Pace Coach workout. For this one, I selected a Performance Run, which allowed me to choose a target score. This score varies based on intensity. So it offered a suggestion, based on my current training load, and then I tweaked it based on how I felt:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7992.png\"><img width=\"357\" height=\"770\" title=\"IMG_7992\" style=\"display: inline; background-image: none;\" alt=\"IMG_7992\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7992_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7994.png\"><img width=\"357\" height=\"770\" title=\"IMG_7994\" style=\"display: inline; background-image: none;\" alt=\"IMG_7994\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7994_thumb.png\" border=\"0\"></a></p>\n<p>The tweaking is important, because in my case I’m also doing cycling workouts too – which this can’t account for. So I leaned it slightly easier, which it then showed me a focus on technique with a specific cadence and footstrike length, which is basically then driving my pace.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7995.png\"><img width=\"357\" height=\"770\" title=\"IMG_7995\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7995\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7995_thumb.png\" border=\"0\"></a></p>\n<p>My issue here though is that’s an exceptionally low cadence by most metrics. If one were to ask my running/triathlon coach about my cadence, he’d mostly laugh at how low it is – even for me. And while I’m not here to preach on high or low cadence and the benefits of it, in general there’s plenty of studies showing the benefits of a moderate to higher cadence (not crazy high). Whereas this workout was <strong>specifically slowing my cadence down</strong>. I’ve never seen a coach or study try and indicate things going that direction (especially down to 160spm). if that’s self-selected, sure, but that’s not the case here.</p>\n<p>Thus: Why is it trying to drive my cadence? At no point does it explain that (other than telling me approximately every 15 seconds the entire run to slow my cadence). More so though, before I created this workout, it actually told me I shouldn’t run more than 6.3 additional miles the rest of this week (Next 7 days, bottom left screen) to prevent injury – yet here it is suggesting an 8.13mi workout (right screenshot). These two don’t mesh.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7817.png\"><img width=\"357\" height=\"770\" title=\"IMG_7817\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7817\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7817_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7997.png\"><img width=\"357\" height=\"770\" title=\"IMG_7997\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7997\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7997_thumb.png\" border=\"0\"></a></p>\n<p>Sure, the lowered suggested 7-day numbers were mostly because I had forgotten on some runs to start it at the beginning of the run – thus it thinks I’m running less than I really am. But that’s irrelevant here. If it truly believes in its own recommendation, it shouldn’t be telling me to run 30% longer than the recommendation max, especially in a single workout</p>\n<p>In any case, I went ahead and ran anyway at the easy pace I had planned, and soon it was showing me my step length and cadence, as well as pace and distance. And it very persistently, for the entire run, let me know my cadence was too high still – approximately every 10-15 seconds. Each mile it would audibly tell me my lap pace as well.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7832.png\"><img width=\"357\" height=\"770\" title=\"IMG_7832\" style=\"display: inline; background-image: none;\" alt=\"IMG_7832\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7832_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7840.png\"><img width=\"357\" height=\"770\" title=\"IMG_7840\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7840\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7840_thumb.png\" border=\"0\"></a></p>\n<p>There aren’t any other data pages to switch to, at least for this workout. What you see above is the sum total of it. Nor did it give me any other guidance for this workout. Also, notably – there are no interval workouts or such in the app – everything is about changing cadence or stride length.</p>\n<p>I finished up my run at 7 miles (as opposed to the 8+ it wanted), for no particular purpose other than that’s the route I had set out. At this point, it gave me a summary screen showing my run score and target – which, I think were pretty darn close – though, I was a mile shorter than it thought I’d be.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7850.png\"><img width=\"357\" height=\"770\" title=\"IMG_7850\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7850\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7850_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_7851.png\"><img width=\"357\" height=\"770\" title=\"IMG_7851\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_7851\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_7851_thumb.png\" border=\"0\"></a></p>\n<p>Within the history of that workout, you can also see more general stats too:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8001.png\"><img width=\"237\" height=\"510\" title=\"IMG_8001\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8001\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8001_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8002.png\"><img width=\"237\" height=\"510\" title=\"IMG_8002\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8002\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8002_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8003.png\"><img width=\"237\" height=\"510\" title=\"IMG_8003\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8003\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8003_thumb.png\" border=\"0\"></a></p>\n<p>The less normal stats are of course the pronation and footstrike ones, which you can tap on to see more information. For example, first, we&#8217;ll start with the pronation bits. All of this is impressive data, from a geek&#8217;s standpoint. And I can then tap to see the recommendation.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8004.png\"><img width=\"237\" height=\"510\" title=\"IMG_8004\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8004\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8004_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8005.png\"><img width=\"237\" height=\"510\" title=\"IMG_8005\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8005\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8005_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8006.png\"><img width=\"237\" height=\"510\" title=\"IMG_8006\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8006\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8006_thumb.png\" border=\"0\"></a></p>\n<p>However, the first line of <em>“How can I improve?”</em> somewhat encapsulates my issue with many running efficiency products:</p>\n<blockquote>\n<p>“How can I improve? If running pain-free, you may be best advised not to change your Pronation.”</p>\n</blockquote>\n<p>Which, I’m running perfectly pain-free. Thus, many running coaches and PT type folks would say: Don’t break what’s not broken.</p>\n<p>On the flip-side, some PT folks would say my pronation is so horrible I should be doing all those things up above to increase flexibility in an effort to stave off long-term injury down the road. And thus this is what the core of NURVV is trying to address – tracking this data long term. The idea that I could do these exercises over time and then see the results in the app. Some of the suggestions are relatively easy, such as ankle stretches. Whereas others, like trying to increase step-width – seem like a recipe for injury disaster without proper guidance.</p>\n<p>Of course, I’m not a doctor. And I’m sure there will be some folks in the comments that’ll give guidance on what to do – probably even conflicting guidance between each other.</p>\n<p>Moving along, we’ve got the same detail for footstrike:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8007.png\"><img width=\"237\" height=\"510\" title=\"IMG_8007\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8007\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8007_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8008.png\"><img width=\"237\" height=\"510\" title=\"IMG_8008\" style=\"border-image: none; display: inline; background-image: none;\" alt=\"IMG_8008\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8008_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8009.png\"><img width=\"237\" height=\"510\" title=\"IMG_8009\" style=\"border-image: none; display: inline; background-image: none;\" alt=\"IMG_8009\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8009_thumb.png\" border=\"0\"></a></p>\n<p>And again, it’s cool data, if you’re in need of changing your footstrike pattern.</p>\n<p>Beyond those two metrics, all of the other metrics are pretty standard running watch stats – things like cadence, elevation, calories, heart rate, etc… So really, the main value here is those two metrics: footstrike and pronation. There’s also training load, which you can see in the above screenshots, though again, most running watches above $200 these days are providing a training load element. An exception to that being an Apple Watch user, which wouldn’t get that kind of data.</p>\n<p>You can see some of the training load data within the Running Health page, which aims to encapsulate all of this into a single chart – showing their core metrics overlaid in one chart, along with the breakdowns below it:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8013.png\"><img width=\"357\" height=\"770\" title=\"IMG_8013\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8013\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8013_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8014.png\"><img width=\"357\" height=\"770\" title=\"IMG_8014\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8014\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8014_thumb.png\" border=\"0\"></a></p>\n<p>You can then dive into each of these sections to get more detail and plotting over the last 30 days, also notably the runs I managed to @#$#-up forgetting to press record/start in mid-January. Sigh.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8018.png\"><img width=\"237\" height=\"510\" title=\"IMG_8018\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8018\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8018_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8016.png\"><img width=\"237\" height=\"510\" title=\"IMG_8016\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8016\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8016_thumb.png\" border=\"0\"></a>&nbsp;<a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/IMG_8017.png\"><img width=\"237\" height=\"510\" title=\"IMG_8017\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"IMG_8017\" src=\"https://media.dcrainmaker.com/images/2021/02/IMG_8017_thumb.png\" border=\"0\"></a></p>\n<p>Now, I showed above starting a workout using the app, but you can also start a workout using just the pods/shoes without your phone. To do that you’ll head outside and stand around like you normally would to find GPS. Except this time you’ll press the small button on the inside of each pod:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_2890.jpg\"><img width=\"720\" height=\"480\" title=\"DSC_2890\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"DSC_2890\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_2890_thumb.jpg\" border=\"0\"></a></p>\n<p>Somewhere between 15 and 45 seconds later, it’ll find GPS, and give you a different color coding. At which point, you can press the big side button to start recording your workout. When you’re done, you can simply power off the pods to save it.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_2890-1.jpg\"><img width=\"720\" height=\"480\" title=\"DSC_2890\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"DSC_2890\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_2890_thumb-1.jpg\" border=\"0\"></a></p>\n<p>And in fact, this is how I did the vast majority of the workouts. At which point, when you turn back on the shoes/pods it’ll sync to the smartphone app and upload the workout to Strava automatically.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-47.png\"><img width=\"665\" height=\"482\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-47.png\" border=\"0\"></a></p>\n<p>Thus, let’s talk about that GPS then.</p>\n<h3><span style=\"font-weight: bold;\">Accuracy:</span></h3>\n<p>Accuracy of the NURVV running hardware could be evaluated in a few different ways. I’d categorize them:</p>\n<p>A) Insole pressure detection aspects<br />\nB) Running stride detection aspects<br />\nC) GPS accuracy of the pods</p>\n<p>We could also then evaluate things like the recovery metrics and such too. But that gets away from data-driven science and into more coaching philosophies. So, let’s focus on the sensor-driven numbers.</p>\n<p>First, we’ve got the insole pressure aspects, which drives analysis such as pronation or footstrike. For that, I don’t have secondary sensor systems to validate it. And ironically, while there is a location very close to me here in Amsterdam that can do that live gait analysis and then see if the two mesh – they’re currently closed due to COVID-19 restrictions. So that limits that (though, I can’t export that data anyway, so that’s moot too).</p>\n<p>Second, I then tried to look at aspects like cadence accuracy, but unfortunately the NURVV platform only exports to Strava, and when you download the original file from Strava, that’s stripped out. There isn’t a way to natively just download the original .FIT file or such with that data included.</p>\n<p>Thus leaving me with GPS accuracy of the hardware pods (non-phone scenario). And I think this is part of the challenge. Simply put: It’s not good.</p>\n<p>For example, this run against the FR745, Polar Grit X, and Wahoo RIVAL, where the NURVV pods are often well offset – some 50m or more, into the trees, water, or buildings:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-48.png\"><img width=\"722\" height=\"267\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-48.png\" border=\"0\"></a></p>\n<p>Or this run, where even the 15-year-old Garmin FR305 easily bested it, with NURVV often off in the water or woods.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-49.png\"><img width=\"722\" height=\"345\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-49.png\" border=\"0\"></a></p>\n<p>Which isn’t to say every aspect of the run is bad. For example, later that same run you’ll see it handles one loop of the triangle island fine, and the track mostly fine for two loops. The stadium caused some issues though.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-50.png\"><img width=\"722\" height=\"451\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-50.png\" border=\"0\"></a></p>\n<p>Or this other track run, which at first looks OK, till you realize the number of times that black line of NURVV crosses the football field.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-51.png\"><img width=\"722\" height=\"372\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-51.png\" border=\"0\"></a></p>\n<p>Of course, if you use it with a phone (in my case an iPhone 11 Pro), then the track is spot-on as it doesn&#8217;t use the GPS from the pods. But of course, that requires taking your phone with you.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-52.png\"><img width=\"722\" height=\"279\" title=\"image\" style=\"border: 0px currentcolor; border-image: none; display: inline; background-image: none;\" alt=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-52.png\" border=\"0\"></a></p>\n<p>So on one hand, while I do appreciate the concept of putting the GPS pods in there, I don’t think it adds anything for this target market. After all, this level of GPS accuracy won’t be acceptable to my Mom for her casual daily runs for general fitness, let alone anyone that’s training for a goal. Not to mention you’d never hear the end of it from your Strava buddies when you uploaded non-stop drunk GPS tracks.</p>\n<p>I think this is an area where they should have taken the approach that Stryd did – which is to create a 3rd-party 1st integration platform (with Garmin, Polar, Suunto, COROS), and then sync those files with GPS data back to their own platform. From there they can merge it with the more advanced data from the pod and create one cohesive picture.</p>\n<p>But that sets aside the bigger problem I’ve found over the last 3 months for me, which ended up being something more simplistic: I forget to press start on my shoes.</p>\n<p>Seriously, since mid-November, I’ve probably forgotten to press start on the recording for about half my runs. Sometimes I’ll remember later in the run, but sometimes not. That’s because I’m primarily using them for post-run analysis, as opposed to during-run coaching using the phone, as the coached phone workouts are basically all just cadence driven workouts. If you were doing coaching (perhaps if they expanded more), then you’d more easily remember because it’s part of pressing start.</p>\n<p>But for after-run analysis, this is where a Garmin Connect IQ or similar watch app would be able to give you notice that it’s not connected yet, reminding you to start them up – or even starting them automatically.</p>\n<p>Ultimately though, beyond GPS – it’s not possible for me to adequately compare and measure accuracy for these devices.</p>\n<h3><span style=\"font-weight: bold;\">Wrap-Up:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2020/11/2020-11-08-16.30.06_thumb.jpg\"></p>\n<p>It’s plausible – likely even – I’m just not the right customer for running efficiency type products. And while the NURVV running system is by far the best attempt I’ve seen in this category, it’s still a really tough pitch for me to recommend. I struggle to see who the people are that would spend $299 on a pair of insoles atop a running watch, only to get data that’s not really integrated between the two of them (yet). And even if it was integrated, much of the information is duplicate in nature with what modern watches from Garmin and Polar provide – with only a handful of pieces like pronation and foot strike that’s unique.</p>\n<p>Which isn’t to say it’s useless. Certainly there’s plenty of studies out there that show the benefits of some of the ideas they’re trying to install, and certainly, reducing running injury is a kinda-important thing for runners….to keep running. And I can see the framework of what the company has laid out there. To use the house analogy a second, they’ve framed up one heck of a house. You can clearly see the outlines of rooms – though the wallboard or flooring isn’t there yet. But you can even see the foundation for a pool outback. But as you walk around the house you realize it’s far from finished. It’s probably got another round of construction to the point you’d want to live in it yet. Someday – definitely, but today is a tough pitch.</p>\n<p>Ultimately, I want to see these things fleshed out. I want to see integration with the platforms that a buyer of this device would expect: Integration with TrainingPeaks, true and full integration with Garmin devices (NURVV says this is coming next quarter), structured workouts beyond just cadence drills from the coaching app (the help guides hint at this), improve GPS accuracy, and have proper data export beyond just basic Strava sync. Give me all that, find a way for me to remember to press the darn start buttons, and I’m there…or here. I’m somewhere – it’s cool, and eventually I want to be onboard that.</p>\n<p>With that – thanks for reading!<br />\n<div data-aff-template='A' data-aff-template-random>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the NURVV Run Insole Running System or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n<div class='fv-product-ad-item fv-product-ad-item-id-120720 fv-product-ad-item-links'><a href='https://www.amazon.com/Nurvv-Insole-Running-Activity-Tracker/dp/B08L71TTR5/ref=as_li_ss_tl?dchild=1&keywords=Nurvv&qid=1606545998&sr=8-2&linkCode=ll1&tag=dcr07-20&linkId=c0bb6e8f1c9aac1be9ff659232154e22&language=en_US' data-href-amz-ca=\"https://www.amazon.ca/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr0d-20\" data-price-ca=\"700 CAD\" data-href-amz-com_au=\"https://www.amazon.com.au/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcrainmaker06-22\" data-price-com_au=\"433 AUD\" data-href-amz-co_uk=\"https://www.amazon.co.uk/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcraicom-21\" data-href-amz-es=\"https://www.amazon.es/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr08-21\" data-amz-localizations=\"4\" target='_blank'><img width=\"720\" height=\"402\" src=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-720x402.png\" class=\"fv-product-ad-thumb wp-post-image\" alt=\"\" srcset=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-720x402.png 720w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-200x112.png 200w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-125x70.png 125w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet.png 1491w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a><div><h4 class='fv-product-title'><a href='https://www.dcrainmaker.com/2021/02/nurvv-run-in-depth-review.html' target='_blank'>NURVV Run Insole Running System</a></h4><div><a target='_blank' class='fv-product-ad-link fv-product-ad-link-text fv-product-ad-link-amazon' href='https://www.amazon.com/Nurvv-Insole-Running-Activity-Tracker/dp/B08L71TTR5/ref=as_li_ss_tl?dchild=1&keywords=Nurvv&qid=1606545998&sr=8-2&linkCode=ll1&tag=dcr07-20&linkId=c0bb6e8f1c9aac1be9ff659232154e22&language=en_US'data-href-amz-ca=\"https://www.amazon.ca/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr0d-20\" data-price-ca=\"700 CAD\" data-href-amz-com_au=\"https://www.amazon.com.au/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcrainmaker06-22\" data-price-com_au=\"433 AUD\" data-href-amz-co_uk=\"https://www.amazon.co.uk/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcraicom-21\" data-href-amz-es=\"https://www.amazon.es/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr08-21\" data-amz-localizations=\"4\">Amazon <span class='fv-product-ad-text-price'>$300</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<div data-aff-template='B' data-aff-template-random style='display: none'>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the NURVV Run Insole Running System or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n<div class='fv-product-ad-item fv-product-ad-item-id-120720 fv-product-ad-item-links'><a href='https://www.amazon.com/Nurvv-Insole-Running-Activity-Tracker/dp/B08L71TTR5/ref=as_li_ss_tl?dchild=1&keywords=Nurvv&qid=1606545998&sr=8-2&linkCode=ll1&tag=dcr07-20&linkId=c0bb6e8f1c9aac1be9ff659232154e22&language=en_US' data-href-amz-ca=\"https://www.amazon.ca/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr0d-20\" data-price-ca=\"700 CAD\" data-href-amz-com_au=\"https://www.amazon.com.au/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcrainmaker06-22\" data-price-com_au=\"433 AUD\" data-href-amz-co_uk=\"https://www.amazon.co.uk/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcraicom-21\" data-href-amz-es=\"https://www.amazon.es/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr08-21\" data-amz-localizations=\"4\" target='_blank'><img width=\"720\" height=\"402\" src=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-720x402.png\" class=\"fv-product-ad-thumb wp-post-image\" alt=\"\" srcset=\"https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-720x402.png 720w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-200x112.png 200w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet-125x70.png 125w, https://media.dcrainmaker.com/images/2021/02/NURVV-Run-transparnet.png 1491w\" sizes=\"(max-width: 720px) 100vw, 720px\" /></a><div><h4 class='fv-product-title'><a href='https://www.dcrainmaker.com/2021/02/nurvv-run-in-depth-review.html' target='_blank'>NURVV Run Insole Running System</a></h4><div><a target='_blank' class='fv-product-ad-link fv-product-ad-link-logo fv-product-ad-link-amazon' href='https://www.amazon.com/Nurvv-Insole-Running-Activity-Tracker/dp/B08L71TTR5/ref=as_li_ss_tl?dchild=1&keywords=Nurvv&qid=1606545998&sr=8-2&linkCode=ll1&tag=dcr07-20&linkId=c0bb6e8f1c9aac1be9ff659232154e22&language=en_US'data-href-amz-ca=\"https://www.amazon.ca/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr0d-20\" data-price-ca=\"700 CAD\" data-href-amz-com_au=\"https://www.amazon.com.au/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcrainmaker06-22\" data-price-com_au=\"433 AUD\" data-href-amz-co_uk=\"https://www.amazon.co.uk/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcraicom-21\" data-href-amz-es=\"https://www.amazon.es/dp/B08L71TTR5?SubscriptionId=AKIAIIWZVTXZYIZVROWA&amp;tag=dcr08-21\" data-amz-localizations=\"4\"><span class='cart-icon'></span><span class='logo'>Amazon</span><span class='buy-now'>Buy Now</span> <span class='fv-product-ad-logo-price'>$300</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"7699bda54e47ec4a700350b0795f8a3fa4547e1e25ca585620c3ecb21705e84a","category":"Cycling"}