{"title":"Analysis of Microstructural Evolution during the Sintering Process of Aluminum Matrix Nanocomposites Reinforced with Al4C3, Using X-ray and HRTEM","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.593/7719719?rss=1","date":1721779200000,"content":"<span>The mechanical alloying technique, also known as the high-energy ball milling process, is an effective way to produce composite metal powders with a controlled microstructure. This method is essential for generating a homogeneous distribution of nano-sized dispersoids in a ductile matrix, such as aluminum or copper-based alloys. The intermetallic Al4C3 phase has become a popular reinforcing material due to its excellent physical and mechanical properties, including heat resistance, thermal cyclic endurance, wear protection, and low linear expansion. Al4C3 powder was initially manufactured by mechanically milling aluminum and graphite powder, subsequently, Al4C3 was used to fabricate Al matrix nanocomposites through mechanical milling and sintering processes. To analyzing the microstructural evolution, the Al-Al<sub>4</sub>C<sub>3</sub> composite was sintered at 550°C for different sintering times of 2, 4 and 6 hours. The obtained samples were analyzed using X-ray diffraction (XRD) and high resolution transmission electron microscopy (HRTEM) techniques. Structural analyses were carried out through the convolutional multiple whole profile (CMWP) fitting program to determine the crystallite size and dislocation density; both strengthening contributions were calculated using the Langford–Cohen and Taylor equations. Figure 1. shows the crystallite size distribution from CMWP ﬁtting program using area average mean crystallite size, &lt;x&gt; area, the median and variance, m and log normal standard deviation, σ<sub>LN</sub>. The TEM brigth-field image (see Figure 1b) shows the aluminum carbide nanoparticles distribution into the Al matrix of the Al-12 sample, the rod-shaped particles are about 60 nm long and 10 nm wide. Image also shows the rounded crystallites within the Al matrix, as indicated by the arrows. The inset illustrates the distribution of crystallite sizes, which has been derived from the TEM images.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"769af880bbb3bcdc210b256583c0ca25b7cca53df7a4acc7968f7f42f9c42c27","category":"Environment"}