{"title":"Delta-5 elongase knockout reduces docosahexaenoic acid and lipid synthesis and increases heat sensitivity in a diatom","link":"https://academic.oup.com/plphys/article/196/2/1356/7682471?rss=1","date":1716681600000,"content":"<span><div>Abstract</div>Recent global marine lipidomic analysis reveals a strong relationship between ocean temperature and phytoplanktonic abundance of omega-3 long-chain polyunsaturated fatty acids, especially eicosapentaenoic acid (EPA) and docosahexaenoic acid (DHA), which are essential for human nutrition and primarily sourced from phytoplankton in marine food webs. In phytoplanktonic organisms, EPA may play a major role in regulating the phase transition temperature of membranes, while the function of DHA remains unexplored. In the oleaginous diatom <span>Phaeodactylum tricornutum</span>, DHA is distributed mainly on extraplastidial phospholipids, which is very different from the EPA enriched in thylakoid lipids. Here, clustered regularly interspaced short palindromic repeats/CRISPR-associated protein 9–mediated knockout of delta-5 elongase (<span>ptELO5a</span>), which encodes a delta-5 elongase (ELO5) catalyzing the elongation of EPA to synthesize DHA, led to a substantial interruption of DHA synthesis in <span>P. tricornutum</span>. The <span>ptELO5a</span> mutants showed some alterations in transcriptome and glycerolipidomes, including membrane lipids and triacylglycerols under normal temperature (22 °C), and were more sensitive to elevated temperature (28 °C) than wild type. We conclude that PtELO5a-mediated synthesis of small amounts of DHA has indispensable functions in regulating membrane lipids, indirectly contributing to storage lipid accumulation, and maintaining thermomorphogenesis in <span>P. tricornutum</span>. This study also highlights the significance of DHA synthesis and lipid composition for environmental adaptation of <span>P. tricornutum</span>.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"76b89afb327320b6fd9c095c5b1de182c2952819a77ad032631de67bf696a409","category":"Environment"}