{"title":"แอปเปิลปลดพนักงานหญิงที่ร้องเรียนว่าโดนบุลลี่ ด้วยเหตุผลว่าเธอเปิดเผยข้อมูลลับ","link":"https://www.blognone.com/node/124681","date":1631255080000,"content":"<div><div><div><p>ช่วงนี้แอปเปิลตกเป็นข่าวเกี่ยวกับการปฏิบัติต่อพนักงานหลายประเด็น ก่อนหน้านี้คือการห้ามตั้งห้อง Slack คุยกันเรื่องการกลั่นแกล้งและเหยียดในที่ทำงาน จน<a href=\"https://www.blognone.com/node/124598\">พนักงานต้องเขียนจดหมายเปิดผนึกถึง Tim Cook</a></p>\n<p>ล่าสุดมีพนักงานหญิงอีกราย ชื่อ Ashley Gjøvik มีตำแหน่งเป็นผู้จัดการอาวุโสงานวิศวกรรม (Senior Engineering Program Manager) ได้ระบุว่าเธอถูกแอปเปิลไล่ออกด้วยเหตุผลที่เธอเปิดเผยข้อมูลลับของบริษัท</p>\n<p>ในช่วงหลายเดือนที่ผ่านมา Ashley ทวีตเกี่ยวกับเรื่องการเหยียด, การสอดแนมพนักงาน และความปลอดภัยในสถานที่ทำงาน โดยเธอระบุว่าเริ่มชูประเด็นด้านความปลอดภัยในสถานที่ทำงานมาตั้งแต่เดือนมีนาคม แต่ถูกตอบโต้และข่มขู่กลับทันที เธอจึงเตรียมตัวว่าอาจจะถูกไล่ออกได้ และมันก็เกิดขึ้นจริง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c7381acabe83a67d668409aa613c938d.jpg\" /></p>\n<p>Ashley บอกว่าเธอเป็นห่วงสุขภาพเพราะสำนักงานแอปเปิลที่เธอประจำอยู่นั้นเคยมีประวัติการปนเปื้อนของของเสีย รวมถึงเธอยังโดนเหยียดและกลั่นแกล้งจากหัวหน้าและสมาชิกทีม นอกจากนี้เธอยังไม่สบายใจกับนโยบายที่แอปเปิลบังคับให้เชื่อม Apple ID ส่วนตัวของพนักงานเข้ากับบัญชีที่ทำงาน เพราะเมื่อ 3 ปีที่แล้วเธอเคยโดนฝ่ายกฎหมายบังคับให้ส่งข้อความแชททั้งหมดไปให้ และห้ามลบข้อมูลใดๆ ออกก่อน เธอแย้งว่าแชทเหล่านี้เป็นของส่วนตัวมาก เพราะมีแม้กระทั่งรูปโป๊ของตัวเธอเองอยู่ด้วย แต่ฝ่ายกฎหมายก็ไม่ยอมและบังคับให้ส่งข้อมูลทั้งหมดให้ เพียงแต่ระบุว่ามันจะถูกเก็บอยู่ใน \"ล็อคเกอร์หลักฐานถาวร\"</p>\n<blockquote><p>Sooo, <a href=\"https://twitter.com/hashtag/Apple?src=hash&amp;ref_src=twsrc%5Etfw\">#Apple</a> has pics of my boobs. During a discovery thing 3yr ago, legal forced me to hand-over all my texts. They refused to let me delete anything, even \"fully personal,\" even when I said \"by fully personal I mean nudes.\" They said they're in their \"permanent evidence locker\"</p>\n<p>— Ashley M. Gjøvik (@ashleygjovik) <a href=\"https://twitter.com/ashleygjovik/status/1428495420917837826?ref_src=twsrc%5Etfw\">August 19, 2021</a></p></blockquote>\n<p>Ashley ขอหยุดพักงานเมื่อต้นเดือนสิงหาคมระหว่างที่แอปเปิลสอบสวนเรื่องทั้งหมด และเมื่อวานนี้เจ้าหน้าที่จากแอปเปิลส่งอีเมลถึง Ashley ว่าขอพูดคุยกับเธอในเรื่องนี้ทันที แต่เธอตอบกลับไปว่าขอคุยทางอีเมลแทนเพราะจะได้มีหลักฐาน อย่างไรก็ตามเจ้าหน้าที่คนดังกล่าวตอบกลับมาว่า Ashley ไม่ให้ความร่วมมือจึงจะสอบสวนเรื่องนี้ต่อด้วยข้อมูลที่มีอยู่ พร้อมทั้งปิดการเข้าถึงระบบภายในของแอปเปิลทันที</p>\n<blockquote><p>Any bets if I get a literal knock on my physical door from <a href=\"https://twitter.com/hashtag/Apple?src=hash&amp;ref_src=twsrc%5Etfw\">#Apple</a> today? <a href=\"https://t.co/oFqw4VFaGi\">pic.twitter.com/oFqw4VFaGi</a></p>\n<p>— Ashley M. Gjøvik (@ashleygjovik) <a href=\"https://twitter.com/ashleygjovik/status/1436078307859066890?ref_src=twsrc%5Etfw\">September 9, 2021</a></p></blockquote>\n<p>หลังจากนั้นเพียงไม่กี่ชั่วโมง Ashley ก็ได้รับอีเมลอีกฉบับว่าเธอถูกให้พ้นสภาพการเป็นพนักงาน มีผลในวันถัดไป</p>\n<p>ด้านโฆษกของแอปเปิลได้บอกกับเว็บไซต์ The Verge ว่าแอปเปิลพยายามสร้างบรรยากาศที่ดีในที่ทำงาน และสอบสวนทุกเรื่องอย่างเต็มที่ แต่จะไม่กล่าวถึงพนักงานคนใดคนหนึ่ง</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/2021/9/9/22666049/apple-fires-senior-engineering-program-manager-ashley-gjovik-for-allegedly-leaking-information\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"76ba9d75bc3d43574128797f30f69fc05f3f51989aeb353cde584117ffea0e59","category":"Thai"}