{"title":"The economics of covering California’s water system with solar panels","link":"https://arstechnica.com/?p=1750875","date":1616163736000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ca_aqueduct-800x533.jpg\" alt=\"Lots of California's water delivery system is exposed to the air.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/ca_aqueduct.jpg\" class=\"enlarge-link\" data-height=\"2048\" data-width=\"3072\">Enlarge</a> <span class=\"sep\">/</span> Lots of California's water delivery system is exposed to the air. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.nsf.gov/news/mmg/mmg_disp.jsp?med_id=77102&amp;from=\">NSF</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A major factor driving the growth of solar power in the US has been the economics of large, utility-scale solar projects. The scale of plants ensures that their developers can buy components in bulk, use larger, more robust hardware, and install everything efficiently. That's in major contrast to most distributed installations, like rooftop solar.</p>\n<p>But these installations do come with downsides. They often occur on undeveloped land, which can offset some of their positive contributions to climate change, especially if the land that has to be cleared was sequestering carbon. Ideally, it would be better to find a way to mix the best features of both—use previously developed sites, but on a scale that puts them on par with dedicated installations.</p>\n<p>One of the solutions that has been floated (pun intended) is to put the panels on reservoirs. Reservoirs are large and already developed, and there's a side benefit of floating the panels onto the water: it cuts down on evaporation, potentially enhancing the value of the reservoir. Now, researchers have examined an alternative: covering all of California's open-air aqueducts, which supply one of the most productive agricultural regions on the planet, with photovoltaics.</p></div><p><a href=\"https://arstechnica.com/?p=1750875#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1750875&comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"76c3c6910b9eabfd9119fd527e490f2675bf7901574ef96630575500fbaf08cb","category":"Tech"}