{"title":"Prediction of edapho-climatic parameters in the incidence of <i>Campylobacter</i> spp. in northwestern Mexico","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002812","date":1714053600000,"content":"<p>by Yasiri Flores, Andrea Chaves, Gerardo Suzán</p>\r\n\r\n<i>Campylobacter</i> spp. is one of the main causes of enteric zoonotic infections worldwide. In Mexico, although a commonly detected pathogen in both children and adults, there is limited surveillance and few studies. The northern part of Mexico stands out for an unnoticed outbreak of <i>Campylobacter jejuni</i> due to contaminated drinking water, which caused an abrupt increase in Guillain-Barré syndrome in the local population. Although it is suggested that its distribution in nature is related to edaphic and climatic factors, this relationship is scarcely known. To understand abiotic factors driving the occurrence and prevalence of <i>Campylobacter</i> spp. in three municipalities from three states in northwestern Mexico (Chihuahua, Sonora, and Baja California), we used the kriging interpolation method of unsampled areas and the correspondence analysis of 23 environmental variables. Of the three municipalities evaluated, Janos in Chihuahua (CHIH), has the highest number of geographic areas classified as high and medium incidence, followed by Santa Cruz, Sonora (SON) and Mexicali, Baja California (BC). Mexicali (BC) edaphic variables limit the potential incidence of the bacterium, mainly due to the lack of soil moisture and its difficulty of surviving on dry surfaces, related to electrical conductivity and salinity. Janos (CHIH) presents limitations in terms of soil water availability, although its presence is more heterogeneous (2 to 8 months). Santa Cruz (SON) has the highest soil water availability (4 to 5 months), and presents pH, texture and low percentage of salinity conditions for the potential incidence of <i>Campylobacter</i> spp. Mexicali (BC) reports a temperature in the warmest month of up to 43°C, which could influence the presence of thermophilic species. The annual precipitation is another limiting factor for the potential incidence of <i>Campylobacter</i> spp. since it does not exceed 509.5 mm, contributing to Janos (CHIH) as the municipality with the highest potential incidence of this bacterium.","author":"Yasiri Flores","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"76c448d1115c1a8057d58429e6b0a77ffb753541d737fd002f406d5b00c2b7d7","category":"Environment"}