{"title":"Planting environment affects effectiveness of genotype diversity in increasing biomass and yield of a spring wheat mixture","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae076/7739919?rss=1","date":1724371200000,"content":"<span><div>Abstract</div>Genotype diversity is an important component of biodiversity, and has potential positive effects on ecological processes, such as primary productivity. Recent studies suggest that crop cultivar mixtures can improve biomass or yield, however, the generality and size of this effect, as well as the underlying mechanisms are unclear. We selected nine genotypes of spring wheat (<span>Triticum aestivum</span> L.), and tested monocultures (of one genotype) and mixtures (of nine genotypes) to verify whether the positive effect of genotype diversity could be observed. Meanwhile, we arranged two planting environments, real field and artificial pot conditions, to clarify how the effect of genotype diversity depends on environmental conditions. Results showed that the effect of genotype diversity was highly dependent on the planting environment; compared with monocultures, mixtures significantly improved aboveground biomass and grain yield of spring wheat in pots by 14.5% and 8.2%, respectively, while no improvements were observed in the field. In pots, positive complementarity effects dominated the positive net effect by offsetting negative sampling effects, while no significant diversity effects were observed in the field. The greater trait differences in pots were more favorable for resource-use complementarity and reducing intraspecific competition, which might be the main reason for the large positive complementary effect in pots. Our results suggest that increasing the biomass and grain yield of spring wheat by providing genotypic diversity was supported by specific ecological mechanisms and could be achievable. However, environmental conditions in actual production may limit its efficacy, and more extensive field experiments are thus needed to verify the effectiveness of genotype diversity.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"76cf699a9cb3eedbd0857f72bf82d1d41fe22446939a8269580c166226ee6e26","category":"Environment"}