{"title":"Multimodal Optical Imaging of Ex Vivo Fallopian Tubes to Distinguish Early and Occult Tubo-Ovarian Cancers","link":"https://www.preprints.org/manuscript/202409.1008/v1","date":1726139165000,"content":"There are currently no effective screening measures to detect early or occult tubo-ovarian cancers resulting in late-stage detection and high mortality. This work explores whether an optical imaging catheter can detect early-stage tubo-ovarian cancers or precursor lesions where they originate in the fallopian tubes. This device collects co-registered optical coherence tomography (OCT) and autofluorescence imaging (AFI). OCT provides three-dimensional assessment of underlying tissue structures; autofluorescence imaging provides functional contrast of endogenous fluorophores. Ex vivo fallopian tubes (n=28; n=7 cancer) are imaged; we present methods for the calculation of and analyze eleven imaging biomarkers related to fluorescence, optical attenuation, and OCT texture for their potential to detect tubo-ovarian cancers and other lesions of interest. We visualize folded plicae, vessel-like structures, tissue layering, hemosiderin deposits, and regions of fibrotic change. High grade serous ovarian carcinoma appears as reduced autofluorescence paired with homogenous OCT and reduced mean optical attenuation. Specimens containing a cancerous lesion demonstrate significant increase in median autofluorescence intensity and decrease in entropy compared specimens with no lesion. Non-cancerous specimens demonstrate an increase in optical attenuation in the fimbriae when compared to the isthmus or ampulla. We conclude that this approach shows promise and merits further investigation of diagnostic potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"76d2ff04dfde1852660683281f20d8eb91c4a4f6eabc97352f68d674306e1d9c","category":"Interdisciplinary"}