{"title":"Fathers’ engagement in a parenting program primarily intended for female caregivers: An early qualitative process evaluation in Western Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003520","date":1728655200000,"content":"<p>by Joshua Jeong, Juliet K. McCann, Alina Bhojani, Zane Maguet, Malia Uyehara, Michael Ochieng</p>\r\n\r\nParenting programs predominantly target one caregiver of the child or most commonly the child’s mother. However, fathers are also important caregivers whose engagement in interventions can benefit child health, nutrition, and development. In August 2023, a qualitative process evaluation was conducted during the first quarter of implementation to assess initial fidelity, quality, and outcomes of a parenting program in rural Western Kenya. In-depth interviews were conducted with female and male caregivers along with in-depth interviews and focus group discussions with program delivery agents. This secondary analysis specifically focused on stakeholders’ perceptions of father involvement in the program and aimed to identify barriers and facilitators to fathers’ participation, initial program impacts when fathers were involved, and recommendations for increasing father inclusion. Thematic content analysis was conducted, and data were triangulated across stakeholder groups. Overall, relatively few fathers participated in the program. Nevertheless, for the rare cases of participating fathers, stakeholders highlighted positive changes in fathers’ caregiving attitudes and practices. Key barriers to fathers’ program engagement included restrictive gender norms and perceived opportunity costs. Stakeholders suggested several strategies for better reaching fathers, including providing financial incentives and flexible scheduling of sessions. Overall, we found that fathers’ participation and program experiences were starkly different from those of mothers. Gender-responsive program adaptations and father-targeted implementation strategies are likely to increase the fathers’ engagement in parenting programs, which in turn may facilitate greater program impacts on family caregiving and child outcomes. Future evaluations of parenting programs should combine qualitative and quantitative approaches to more comprehensively assess program impacts on fathers and over time.","author":"Joshua Jeong","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"76d3661456d49e84f546f8610509adc280a89596bfffbf4fdaec988a961e5c05","category":"Environment"}