{"title":"Crowd pleasers: The good guys get their moment at the Vuelta a España","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-good-guys-get-their-moment-at-the-vuelta-a-espana","date":1694894757000,"content":"\n      \n<p><span>This has been a fierce <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>, at times unhinged and uncontrollable. Stacked with drama, inter-team rivalries, and organisational failings, there have been enough sub-plots for a multi-season drama. But tired from the chaos, the final weekend has settled on a crowd pleaser: enough of the turmoil – let the nice guys win.</span></p>\n<p><span>Two days after Jumbo-Visma put their squabbling behind them to finally back Sepp Kuss, they certified their commitment to the American, as he, Jonas Vingegaard and Primož Roglič crossed the line as one in Guadarrama, the latter two pointing to Kuss, anointed as an incredibly popular champion-elect.</span></p>\n<div></div>\n<p><span>Ten minutes before the Jumbo trident put on their best smiles in a show of unity, another nice guy was winning, Wout Poels, holding off Remco Evenepoel’s late sprint to win the twentieth stage and cap off a highly impressive three weeks.</span></p>\n<p><span>Poels has had his glory moments in his career – Liège-Bastogne-Liège in 2016, stages of Paris-Nice, Critérium du Dauphiné and Tirreno Adriatico – but mostly the Dutchman has worked tirelessly for leaders. While at Team Sky, he led Chris Froome to <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and Vuelta a España victories, and Geraint Thomas also counted him as a key lieutenant at the Tour. With Bahrain-Victorious, he’s done a similar job. Similar to Kuss, Poels has been a</span><span> selfish super-domestique, turning himself inside out for the benefit of others. </span></p>\n<p><span>The parallels between the pair have continued during this Vuelta: like Kuss, Poels has also been afforded his own opportunities. Indeed, it could have been him winning the sixth stage that Kuss did, Poels also forming part of that day’s large breakaway that changed the entire trajectory of the race.</span></p>\n<p><span>Sixth at Javalambre shot Poels up to fourth overall, and that meant, for a few days at least, he was given the same level of protection as his team’s designated GC hope, Mikel Landa. A terrible stage nine and poor time trial, however, saw him repositioned as Landa’s chief bodyguard. Rather than be subdued, Poels roused himself, the Dutchman delivering a series of final week performances that were arguably stronger than anyone else in the race.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1680538341.jpg?v=1694894632\" /><span>After finishing third on stage 16, he set a searing pace up the Angliru that only the Jumbo Three and Landa could follow; then, on the penultimate day, he proved that his advancing years – he will be 36 in a fortnight – is no barrier to quality, keeping Evenepoel, 12 years his junior, at bay in the Sierra just north of Madrid. It capped off what has been a glorious two months for one of the peloton's most respected and friendliest riders. Until July, he had never won a stage of a Grand Tour, but he broke his hoodoo by taking a maiden Tour de France victory. Exactly two months later, he has added a Vuelta stage to his </span><em><span>palmarès</span></em><span>. It was like the cycling Gods had finally permitted Poels the rewards he deserved.</span></span></p>\n<p><span>Professional sport can be brutal and unforgiving; it spits out the weak ones and promotes those with a colder side, athletes who can separate emotion from their decision-making. This Vuelta has had its acts of reality, of tough men triumphing over nice men, but Poels’ and Kuss’ victories show that sport does still have space reserved for the ones less feted.</span></p>\n<p><span>The affable and genteel Kuss is regarded as one of the most courteous Grand Tour winners, certainly the fans’ choice, and definitely Spain’s adopted champion. But Poels’ achievement, and especially his performances in this incredibly demanding final week, also warrant recognition.</span></p>\n<p><span>As the race reaches its end point in Madrid, it does so with the entire peloton and race staff happy to be putting the many struggles, unforeseen challenges and avoidable incidents behind them. But it arrives in the Spanish capital as a race championing and promoting the good folk, proof that sometimes the nice guys do win.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"76e1b21a4f104ee0722bba1c79f0619af7c07421aded62549dcabc70940d5d17","category":"Cycling"}