{"title":"Evaluation of the Ability of Wasp Venom Bioinspired Peptides (Fraternine-10 and Octovespin) in the Disaggregation and Anti-aggregation of Amyloid-&beta; and &alpha;-Synuclein Fibrils","link":"https://www.preprints.org/manuscript/202404.2004/v1","date":1714528922000,"content":"Many neurodegenerative diseases are directly related to the formation of toxic protein aggregates, such as Parkinson’s and Alzheimer’s diseases, which are associated with the aggregation of alpha-synuclein (α-syn) and beta-amyloid (Aβ ), respectively. In this context, protein fibrils are the hallmark of these neurodegenerative diseases. In this sense, planning or designing compounds that are capable of preventing or reducing the formation of protein aggregation in the brain can be of fundamental importance for the curative treatment of these diseases. This work presents an in silico and experimental study to investigate the inhibitory potential of the ligands Octovespin (bioinspired by the wasp venom Polybia Occidentalis) and Fraternine-10 (bioinspired by the wasp venom Parachartergus fraternus wasp) against the aggregation of fibrils of the peptides Aβ(17-42) and α-syn, respectively. Using molecular docking and molecular dynamics simulations with 100 ns, the disaggregation capacity of these ligands was studied. The results obtained indicate that Octovespin and Fraternine-10 interact with the Aβ and α-syn protein fibrils throughout the simulation time. The RMSD values and the interactions with amino acids responsible for fibril aggregation demonstrate that both Octovespin and Fraternine-10 have a significant disaggregation potential, which corroborates the observations in vitro and in vivo. Furthermore, experimental results of Fraternine-10 demonstrate an anti-aggregation effect, indicating that it can promote the disaggregation of fibrils and prevent them from aggregating again to form oligomers. These discoveries qualify these molecules as potential candidates to become medicines against Parkinson’s and Alzheimer’s diseases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"76eb59032b3f69261b396a9abde51e54a62da33daa8a6f5ea071b14b689bef8f","category":"Interdisciplinary"}