{"title":"Exploring the Dual Functionality of Plant Pulvini Using a Physical Modeling Approach","link":"https://academic.oup.com/icb/article/63/6/1331/7147573?rss=1","date":1682899200000,"content":"<span><div>Abstract</div>Pulvini are plant motor organs that fulfill two conflicting mechanical roles. At rest, pulvini function as rigid beams that support the cantilevered weight of leafy appendages. During thigmonastic (touch-induced) or nyctinastic (“sleep”-induced) plant movements, however, pulvini function as flexible joints capable of active bending. I hypothesized that the ability to alternate between these roles emerges from the interaction of two structural features of pulvini: anisotropically reinforced parenchyma cells comprising the body of the pulvinus and a longitudinally stiff but flexurally pliant vascular bundle running through the pulvinus core. To investigate how these two components might interact within biological pulvini, I built a set of pulvinus-inspired physical models with varying combinations of these elements present. I compared the abilities of the models to (1) resist imposed bending deformation (i.e., act as rigid beams) and (2) exhibit bending deformation when asymmetrically pressurized (i.e., act as actively deformable joints). Pulvinus models displayed the greatest ability to resist bending deformation when both an anisotropically reinforced parenchyma and a vasculature-like core were present. Disruption of either element reduced hydrostatic fluid pressures developed within the models, resulting in a decreased ability to resist externally applied forces. When differentially pressurized to induce active bending, the degree of bending achieved varied widely between models with and without adequately reinforced parenchyma elements. Bending, however, was not influenced by the presence of a vasculature-like core. These findings suggest that biological pulvini achieve their dual functionality by pairing anisotropically reinforced parenchyma tissues with a longitudinally stiff but flexurally pliant vascular core. Together, these elements compose a hydrostatic skeleton within the pulvinus that strongly resists external deformation when pressurized, but that bends easily when the balance of fluid pressures within it is altered. These results illustrate the emergent nature of pulvinus motor abilities and highlight structural specialization as an important aspect of pulvinus physiology.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"76f29eada4905ed4b950b5b19b60375210b49e64128d27f19b120bd9d9bab626","category":"Environment"}