{"title":"Causal associations of air pollution with rheumatoid arthritis: A transethnic Mendelian randomization study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307514","date":1727186400000,"content":"<p>by Ao He, Hainan Li, Shan Ouyang, Jia He, Zhuo Gong, Qingzhu Zhou, Songmei Wang, Xian Zhao</p>\r\nBackground <p>Rheumatoid arthritis is a common rheumatic disease, and its onset is closely related to genetic and environmental factors, however, the relationship between air pollution and RA is still hotly debated. Further investigation of the relationship between air pollution and rheumatoid arthritis is conducive to a comprehensive understanding of the risk factors of the disease, providing certain value for the clinical prevention and treatment of RA.</p> Methods <p>We used a Two-Sample Mendelian Randomization approach, integrating the large-scale public genomewide association study, to assess the genetically predicted causal effect of air pollution (including: PM2.5, PM2.5–10, PM10, nitrogen dioxide, nitrogen oxides) on RA in European and European East Asian populations, respectively. Indicators related to air pollution (2,505 individuals to 423,796 individuals), including European and East Asian populations were obtained from the Integrative Epidemiology Unit open GWAS project. Published East Asian RA data were also obtained from the IEU open GWAS project (212,453 individuals), while large-scale publicly available European RA data were obtained from finngen R10 (13,621 cases and 262,844 controls). Inverse variance weighting was used as the primary analytical method, complemented by MR-egger, Weighed median, and Weighted mode results. Cochran Q tested for heterogeneity, and MR-Egger regression analyses were performed to test for multiplicity. leave-one-out analysis allowed for the robustness and reliability were assessed.</p> Results <p>No statistically significant effects of PM2.5, PM2.5–10, PM10, nitrogen dioxide, nitrogen oxides and RA were observed in either European or East Asian populations. Results from European data: PM2.5 (IVW OR: 0.71; 95% CI: 0.27–1.91; p = 0.498; number of SNPs: 5), PM2.5–10 (IVW OR: 1.20; 95% CI: 0.61–2.40; p = 0.596; number of SNPs: 15), PM10 (IVW OR: 1.69; 95% CI: 0.84–3.39; p = 0.142; number of SNPs: 9), nitrogen dioxide (IVW OR: 3.88; 95% CI: 0.19–77.77; p = 0.375; number of SNPs: 2), nitrogen oxides (IVW OR: 0.51; 95% CI: 0.16–1.67; p = 0.268; number of SNPs: 4). East Asian data results: PM2.5 (IVW OR: 1.16; 95% CI: 0.98–1.38; p = 0.086; number of SNPs: 4), PM2.5–10 (IVW OR: 1.14; 95% CI: 0.95–1.38; p = 0.166; number of SNPs: 2), PM10 (IVW OR: 0.95; 95% CI: 0.81–1.11; p = 0.503; number of SNPs: 3), nitrogen dioxide (IVW OR: 0.87; 95% CI: 0.76–1.00; p = 0.051; number of SNPs: 6), nitrogen oxides (IVW OR: 0.96; 95% CI: 0.82–1.14; p = 0.671; number of SNPs: 3). No signs of pleiotropy or heterogeneity were observed in the MR-Egger intercept, MR-PRESSO and Cochrane’s Q (p&gt;0.05). In addition, no outliers were found in the MR-PRESSO analysis. The results were further validated by leave-one-out tests, confirming the robustness of the findings.</p> Conclusions <p>We performed transethnic MR analysis suggesting that there may not be a genetically predicted causal relationship between air pollution and RA.</p>","author":"Ao He","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"76f6b03cd185f9ef0dd6dbafa2ef1862e6a3e42046f82b6f439d70890ba55e06","category":"Interdisciplinary"}