{"title":"Tencent บีบเวลาเล่นเกม Honor of Kings ในเด็กอายุต่ำกว่า 18 เหลือวันละ 1 ชม. และวันหยุด 2 ชม.","link":"https://www.blognone.com/node/124076","date":1628132638000,"content":"<div><div><div><p>บริษัทเทคโนโลยีรายใหญ่ในจีนกำลังถูกกดันจากรัฐบาลจีนในหลายๆ ด้าน ตั้งแต่ด้านการผูกขาด เนื้อหาบนโซเชียลมีเดีย และเกม ซึ่งเป็นเนื้อหาที่รัฐบาลพยายามควบคุมมานานแล้ว โดยเฉพาะประเด็นเด็กติดเกม ถึงขั้น<a href=\"https://www.blognone.com/node/124036\">เปรียบเทียบเกมกับสารเสพติดเลยทีเดียว</a></p>\n<p>ก่อนหน้านี้ ผู้เยาว์อายุต่ำกว่า 18 ปีได้รับอนุญาตให้เล่น Honor of Kings สูงสุด 1.5 ชั่วโมงในวันปกติและ 3 ชั่วโมงในวันหยุด ซึ่งเป็นไปตามคำสั่งของรัฐบาลที่ออกกฎในปลายปี 2019 ล่าสุด Tencent ออกกฎเข้มงวดขึ้น ลดเวลาเหลือเล่นได้แค่วันละ 1 ชั่วโมงในวันธรรมดา และ 2 ชั่วโมงสำหรับวันหยุด และยังคงกฎห้ามเล่นช่วงเวลา 22.00 น. ถึง 8.00 น. ไว้ด้วย</p>\n<p>มาตรการใหม่ของ Tencent ยังจำกัดการซื้อของในเกม โดยผู้เล่นอายุระหว่าง 12-16 ปีสามารถใช้จ่ายได้เพียง 200 หยวน ต่อเดือน ส่วนผู้เล่นอายุระหว่าง 16-18 ปี จำกัดไว้ที่ 400 หยวนต่อเดือน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9b486ebfe4081d2fc69262cd4ec8b463.jpg\" /></p>\n<p>Honour of Kings เป็นหนึ่งในเกมที่ได้รับความนิยมสูงสุด มีผู้เล่นหลักร้อยล้านต่อวัน พัฒนาโดยสตูดิโอ TiMi Studio Group ซึ่งเป็นบริษัทลูกของ Tencent โดย Honor of Kings กลายเป็นวิดีโอเกมเกมแรกในโลกบนทุกแพลตฟอร์มที่มีผู้ใช้เฉลี่ยมากกว่า 100 ล้านคนต่อวัน ข้อมูลจาก Sensor Tower ระบุด้วยว่าตัวเกมทำรายได้ถึง 2.6 พันล้านดอลลาร์จากการซื้อในแอปในปีที่แล้ว ถือเป็นเกมที่ทำกำไรได้มากที่สุดในโลก</p>\n<p>ที่มา - <a href=\"https://www.scmp.com/tech/big-tech/article/3143779/tencent-cuts-kids-playing-time-flagship-game-honour-kings-appease\">SCMP</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tencent\">Tencent</a></div><div><a href=\"/topics/honor-of-kings\">Honor of Kings</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/china\">China</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7701d75d65a31120c3a2184b8eb929716e5d0ecc0a4fad8e67dfcb9127983d32","category":"Thai"}