{"title":"Online Screening Tool for Detection of Psychosocial Stress and Mental Health Disorders in Parents and Their Children in Early Childhood: Results from the SKKIPPI Cohort Study","link":"https://www.preprints.org/manuscript/202406.0512/v1","date":1717763927000,"content":"Early childhood may be a stressful period for families with a significant impact on parents’ mental health and the child’s healthy development. The goal of the SKKIPPI cohort study was to assess the occurrence and determinants of psychosocial stress and mental health disorders in parents as well as in their offspring in early childhood in three German regions.\nBased on random samples from three residents' registration offices, parents with infants up to 12 months of age at the time of sampling, were invited to participate in the study. A screening online questionnaire was newly developed, available in four languages, to assess common psy-chosocial stressors and mental health problems of parents with small children.\nThe study enrolled 4,984 mothers and 962 fathers. The most common potential psychosocial stressors at baseline were professional problems (mothers 22%, fathers 33%), lack of social sup-port (20%, 14%), and severe, negative experiences in childhood (22%, 16%). Obses-sive-compulsive thoughts (21%, 16%), depressive (9%, 9%) and anxiety symptoms (11%, 7%) were the most frequently reported mental health problems by both parents. Regulatory prob-lems of the child were reported by between 1.5% and 5.1% of parents.\nThe SKKIPPI study showed that a substantial proportion of parents are burdened by psychoso-cial problems and suffer from mental health problems in the first years after birth. Early pre-ventive and low-threshold support measures should be available in the health and social care system. The newly developed questionnaire can be used to screen in the relevant populations in order to avoid disturbances in the mother-child attachment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7702c43e2fa2771122e95bdcde202593977633cd6f118de332c69b1e6acb5ed5","category":"Interdisciplinary"}