{"title":"Insertion of a miniature inverted-repeat transposable element into the promoter of OsTCP4 results in more tillers and a lower grain size in rice","link":"https://academic.oup.com/jxb/article/75/5/1421/7439903?rss=1","date":1700524800000,"content":"<span><div>Abstract</div>A class I PCF type protein, TCP4, was identified as a transcription factor associated with both grain size and tillering through a DNA pull-down-MS assay combined with a genome-wide association study. This transcription factor was found to have a significant role in the variations among the 533 rice accessions, dividing them into two main subspecies. A <span>Tourist</span>-like miniature inverted-repeat transposable element (MITE) was discovered in the promoter of <span>TCP4</span> in <span>japonica/geng</span> accessions (<span>TCP4</span><sup>M+</sup>), which was found to suppress the expression of <span>TCP4</span> at the transcriptional level. The MITE-deleted haplotype (<span>TCP4</span><sup>M-</sup>) was mainly found in <span>indica/xian</span> accessions. ChIP-qPCR and EMSA demonstrated the binding of TCP4 to promoters of grain reservoir genes such as <span>SSIIa</span> and <span>Amy3D in vivo</span> and <span>in vitro</span>, respectively. The introduction of the genomic sequence of <span>TCP4</span><sup>M+</sup> into different <span>TCP4</span><sup>M-</sup> cultivars was found to affect the expression of <span>TCP4</span> in the transgenic rice, resulting in decreased expression of its downstream target gene <span>SSIIa</span>, increased tiller number, and decreased seed length. This study revealed that a <span>Tourist</span>-like MITE contributes to subspecies divergence by regulating the expression of <span>TCP4</span> in response to environmental pressure, thus influencing source-sink balance by regulating starch biosynthesis in rice.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"771a948b34b00f627d0b945c59daaa0ef9505dab82347d1697aa22653bf943a8","category":"Environment"}