{"title":"A Study of the Electro-Optical Properties of Silicon-Based Top-Emission OLED","link":"https://www.preprints.org/manuscript/202410.0483/v1","date":1728369937000,"content":"This research aims to develop top-emission OLEDs (Organic Light light-emitting diodes) that exhibit enhanced electro-optical properties regarding color purity, luminance, efficiency, stability, and longer lifetime. To achieve this aim, we have used silicon wafer substrates with a thickness of 675 m. Top-emission OLED fabrication on silicon wafer substrates requires careful material selection and layer configuration. This device structure is described as follows: Silicon/Al (100 nm)/ HATCN (10 nm)/ Dic-TRZ: Ir(mppy)3 (40 nm)/ TPBi (30 nm)/ LiF 1.2 nm / Al 19.9 nm. LiF/Al combination is used as the semi-transparent cathode. Research on top-emission OLEDs has demonstrated the importance of silicon wafer substrates in enhancing electro-optical properties. The optical properties of top-emission OLEDs are significantly influenced by factors such as the semitransparent cathode layer's thickness and the anode layer's surface roughness. Study findings encompass the impact of microcavity on TEOLEDs, dopant concentration on device performance, and device thermal conductivity and lifetime. To create a highly efficient top-emission OLED on a silicon substrate, we meticulously fine-tuned parameters such as the thickness of the cathode Al layer (19.9 nm), the organic layer thickness (HIL - HATCN 10 nm, HTL - NPB 30 nm, ETL - TPBi 30 nm, EML - DIC–TRZ: Ir(mppy)3 40 nm), and the dopant concentration. Electro-optical performance has been significantly improved through optimization, especially in devices with high dopant concentrations. The 38% dopant concentration experiments resulted in a peak current density of 201.97 mA/cm2, a luminance of 4776 cd/m2, and an efficiency of 2.36 cd/A at 9 V. In addition, the high dopant concentration has resulted in a narrow spectral range, indicating a strong microcavity effect. Additionally, Si-TEOLEDs were tested for lifetime under these specific conditions, exhibiting a half-life of 420 hours.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7723e87c364e631f4c4636c16c4a912d98bd85771699bec9f73df7073deb4f52","category":"Interdisciplinary"}