{"title":"Method for Revealing the Violation of Synchronization in the Operation of Geomagnetic Observatories of Intermagnet Network","link":"https://www.preprints.org/manuscript/202405.1148/v1","date":1715938590000,"content":"The integration of magnetic observatories of many countries into the Intermagnet network has provided researchers with new opportunities to investigate many geophysical processes. The joint processing of measurement evidence from magnetic observatories located in various geolocations makes it possible to better understand the dynamics of the interaction of solar plasma fluxes with the Earth's magnetosphere. For the correct interpretation of the dynamics of physical processes, the accuracy of the time reference of measurement results is of great importance. The measurement results of local observatories were transformed to a unified ecliptic coordinate system oriented towards the Sun in order to extract small variations in the magnetic field occurring before the magnetic storm commencement. Before transforming the coordinates, a constant component equal to the average daily value of the magnetic field components was removed from the results of minute-by-minute measurements. Owing to the averaging evidence from 84 magnetic observatories of the Intermagnet network, variations in the magnetic field of cosmic origin, preceding the magnetic storm commencement were detected. The correlation analysis of these variations recorded by different observatories revealed the presence of time shifts between the data series of different observatories. Only 62% of the observatories had a relative data shift within the range of ± 1 minute. Before the joint data processing in order to efficient use of data recorded with a time shift a method for correcting time shifts has proposed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"772caaced28749fa770e1be8e182e29f818c4b9f4ccf28cb936591a900c793af","category":"Interdisciplinary"}