{"title":"Hormonal Replacement Therapy Reduces the Severity of Climacteric Symptoms among BRCA Mutation Carriers Who Have Surgical Menopause While Mindfulness-Based Stress Reduction May Evoke Adverse Effects","link":"https://www.preprints.org/manuscript/202406.0729/v1","date":1718143440000,"content":"Breast Cancer Associated Susceptibility Proteins Type 1/2 (BRCA1/2) promote cellular functioning by modulating NRF2-mediated antioxidant signaling. Redox failure in women with BRCA1/2 insufficiency increases the risk for breast/ovarian/uterine cancers. Risk‐reducing salpingo‐oophorectomy (RRSO) is a prophylactic surgery of the reproductive organs, which is frequently conducted by the age of 40 to lower the occurrence of cancer in women with BRCA1/2 mutations. However, abrupt estrogen decline following RRSO causes ovarian failure, which implicates various cellular physiological processes, resulting in increased release of free radicals and subsequent severe onset of menopausal symptoms. Comfort measures (e.g., hormonal replacement therapy (HRT) and mindfulness-based stress reduction (MBSR)) may improve chronological menopause-related quality of life, but their specific effects are not clear in women with gene mutations. Aiming to fill the gap, this study used path analysis to examine the effects of HRT and MBSR on menopausal symptoms among RRSO patients (N = 199, mean age = 50.5 ± 6.7 years). HRT alleviated menopausal symptoms in BRCA2 carriers and women who were physically active, premenopausal at the time of RRSO, had a high BMI, and had no history of breast cancer. It increased the severity of urogenital symptoms in those with a history of cancer. MBSR, on the other hand, was associated with increased intensity of most menopausal symptoms. The results suggest that young women undergoing recent RRSO may benefit from HRT at an individual level while their need for extensive measures to optimize their psychological wellbeing is ongoing. Adverse effects of MBSR, which are captured in the present study imply that MBSR may interfere with redox sensitivity associated with estradiol fluctuations in BRCA1/2 carriers. Investigations are needed to test this hypothesis and elaborate on the underlying mechanisms in those women.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"772d1c9aa53d0115f9cbef3547ad2fbe5b802227025c2e5909bc0f340af0afab","category":"Interdisciplinary"}