{"title":"Apple Announces Third-Party Products That Work With ‘Find My’ Network","link":"https://www.apple.com/newsroom/2021/04/apples-find-my-network-now-offers-new-third-party-finding-experiences/","date":1617825038000,"content":"\n<p>Apple Newsroom:</p>\n\n<blockquote>\n  <p>Apple today introduced the updated Find My app, allowing\nthird-party products to use the private and secure finding\ncapabilities of Apple’s Find My network, which comprises hundreds\nof millions of Apple devices. The Find My network accessory\nprogram opens up the vast and global Find My network to\nthird-party device manufacturers to build products utilizing the\nservice, so their customers can use the Find My app to locate and\nkeep track of the important items in their lives. […]</p>\n\n<p><a href=\"https://www.vanmoof.com/\">VanMoof</a>’s latest S3 and X3 e-bikes, <a href=\"https://www.belkin.com/\">Belkin</a>’s SOUNDFORM Freedom\nTrue Wireless Earbuds, and the <a href=\"https://chipolo.net/\">Chipolo</a> ONE Spot item finder make\nup the first group of innovative third-party accessories that work\nwith Find My. These products will allow users to locate where they\nleft their ride, their earbuds at the gym, their backpack, and so\nmuch more. Additional third-party device manufacturers will offer\nFind My-enabled products and accessories soon.</p>\n</blockquote>\n\n<p>A somewhat unusual announcement. We’re all expecting Apple to announce its own “AirTags” tracking beacons imminently, but here’s Apple promoting third-party products, including a tag-like product from Chipolo that seems directly competitive with what we expect AirTags to be, and wireless earbuds from Belkin that obviously compete against AirPods. (<a href=\"https://www.belkin.com/us/p/P-AUC002/\">According to Belkin’s website</a>, these new earbuds cost $100 but aren’t shipping until June.) But it makes sense: Apple wants third-party products to use the Find My network. And if Apple really is on the cusp of announcing AirTags (and perhaps updated AirPods too), this is how they do it. Promote their partners’ products this week, ahead of their own announcements.</p>\n\n<p>Conspicuously absent from the list, of course, is <a href=\"https://www.thetileapp.com/\">Tile</a>. Given <a href=\"https://www.theverge.com/2020/9/24/21453745/spotify-epic-tile-match-coalition-for-app-fairness-apple-app-store-policies-protest\">their membership in Epic’s Coalition for App Fairness</a>, I wouldn’t hold my breath waiting for Apple to promote Tile’s products. And it’s unclear to me whether Tile even <em>wants</em> to be in the Find My app — their spat with Apple <a href=\"https://www.theverge.com/2020/5/29/21274709/apple-tile-european-commission-eu-complaint-app-store-iphone-response/\">is more about their own app competing with Find My</a>, and their accusations that Apple unfairly advantages Find My by not holding it to the same rules as third-party apps that ask for always-on location access. Apple’s solution is this third-party accessory program; Tile’s preferred solution would be Apple allowing Tile’s own app to do everything Find My can do.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/07/find-my-third-party-products\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"772f5e9fa5c555fc246201b535c1d1a2270effa0154285356f2418fa56c6ed9f","category":"Tech"}