{"title":"PSXII-29 Effect of tannins level and diet type on in vitro ruminal fermentation and methane production","link":"https://academic.oup.com/jas/article/102/Supplement_3/786/7757709?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of the study was to evaluate the effect of four levels of a commercial product based on quebracho that contains tannins (Table 1) on three types of diets: Feedlot, Dairy Cattle, and Grazing, using the in vitro gas production technique on ruminal fermentation, dry matter digestibility and methane (CH<sub>4</sub>) production to determine its potential use as a greenhouse gas mitigation strategy in ruminants. An in vitro trial was carried out in a completely randomized block design with a factorial arrangement of 4 [dose: 0, 0.25, 0.50, and 0.75 % of Protein Enhancer (PE)] x 3 [diet types: low (LFD), medium (MFD) and high forage (HFD)]. The fermentation of each treatment was carried out in triplicate in 120 mL amber antibiotic bottles, containing 0.5 g of substrate previously deposited in nylon bags (24 µm pore size) and 60 mL of a mixture of medium and rumen fluid from three Holstein cows. Incubations were replicated in two independent runs (blocks). The gas pressure (PSI) was recorded at 1, 2, 3, 6, 9, 12, 18, 24, 30, 36, 48, 60 and 72 hours of incubation. Gas pressure data were converted to gas volume (y = mL of gas; x = gas pressure PSI). Subsequently, pH was measured, and subsamples for analysis of volatile fatty acids (VFA) by gas chromatography were collected. Methane was analyzed with a Crowcon Gas-Pro detector, while ammoniacal nitrogen with a hybrid multimodal microplate reader. The data were analyzed with the MIXED procedure of SAS, and the comparison of means was analyzed with Tukey and with orthogonal polynomials for doses. An interaction (<span>P</span> &lt; 0.05) was observed between diets and PE levels for CH<sub>4</sub> concentration (%), where the diet with a greater level of forage and the greatest level of PE (0.75%), showed the least concentration (30%, <span>P</span> &lt; 0.05) compared with the control diet of dairy cattle. On average, CH<sub>4</sub> production [mL CH<sub>4</sub>/g dry matter (DM)] were 83.3, 63.6, and 35.3 for LFD, MFD, and HFD, respectively (Table 2). As the dose of PE increased, rumen pH and N-NH<sub>3</sub>decreased (<span>P</span> &lt; 0.05), and the total VFA concentration increased (linear effect, <span>P</span> &lt; 0.05; Table 3). Methane production was less (30%) with the grass-based diet and the greatest level of quebracho-based product with condensed tannins, compared with the dairy cattle diet with 0% condensed tannins. The diet for feedlot cattle was more digestible and, therefore, produced more gas and a greater concentration of CH<sub>4</sub>, in contrast to the grass-based diet, which produces less CH<sub>4</sub>. It is necessary to carry out in vivo trials, particularly in grazing cattle, to evaluate the effect of the quebracho-based product on performance and in vivo methane emission. This study was partially funded by PAPIIT-DGAPA-UNAM (grant IN212523).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7739f2e4f7e0326ff595474991c9ae9008083cd637d2c65e0df297d16b884f33","category":"Environment"}