{"title":"Fall Prevention and Related Factors Among Older Adults in Samutprakarn Province, Thailand","link":"https://www.preprints.org/manuscript/202409.1962/v1","date":1727260908000,"content":"Fall are significant cause of mortality and disability among older adults globally, affecting individual health and society. Addressing preventable factors, such as physical health and environmental conditions, is essential. This cross-sectional study aims to understand the factors that influence fall prevention behaviors among older adults in semi-urban community. \nMethods: A total of 440 older adults were randomly selected from six districts in Samutprakarn Province, Thailand. Well-trained data collectors conducted individual interviews with the participants in community-based setting. \nResults: Multiple logistic regression analysis was conducted, revealing that 96.3% of older adults demonstrated good fall prevention behaviors. The factors significantly associated with these behaviors included being female (OR = 4.39, 95% CI: 1.42-13.52), having good knowledge of fall prevention (OR = 9.19, 95% CI: 2.78-30.38), and perceiving the severity and susceptibility of falls, along with the benefits and barriers to prevention (OR = 11.25, 95% CI: 3.36-37.69). Additionally, sufficient access to health information (OR = 4.94, 95% CI: 1.61-15.16) and strong social support (OR = 4.06, 95% CI: 1.30-12.71) were also significant factors.\nIn conclusion, a high percentage of older adults practiced good fall prevention behaviors, influenced by factors such as gender, knowledge, perception of fall risks, access to health information, and social support. Policy makers should prioritize enhancing health education on fall prevention, improving access to health information, and strengthening social support systems for older adults to further reduce fall-related risks and disabilities.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"774357c6df5d2bab6f3cba2512d0441871a06191126de25b5f376699e4d39f75","category":"Interdisciplinary"}