{"title":"PSII-30 Exploring the prebiotic potential of enzymatically released bioactive components from canola fiber on growth performance and gut health of broiler chickens and weaned piglets","link":"https://academic.oup.com/jas/article/102/Supplement_3/702/7757647?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>In our research, canola meal (CM) was incubated with a specific multi-carbohydrase cocktail and protease to enhance the bioactivity of its fiber components. This process resulted in the enzymatically modified canola meal solubles (ECMS) product, which was obtained following spray-drying of water-soluble fraction of the incubated CM. The ECMS was hypothesized to exhibit prebiotic effects in monogastric animals due to its composition, which includes components resulting from the hydrolysis of non-starch polysaccharides (NSP), such as low-molecular-weight polysaccharides and oligosaccharides. Compared with CM, ECMS contained more crude protein, ash, and phosphorus, and less intact NSP, neutral detergent fiber (NDF), phytate phosphorus, sucrose, and raffinose and stachyose. The objective of this study was to evaluate the effect of ECMS supplementation on the growth performance, nutrient digestibility, gut function and health of broiler chickens and weaned piglets. Ross 308 broiler chickens were assigned to three dietary treatments with 6 birds per cage and 8 replicates per treatment. The birds were raised under a controlled environment for 14 d. The experimental diets consisted of a corn/soybean meal Control diet, a Low ECMS diet containing 1g/kg of ECMS, and a High ECMS diet containing 20 g/kg of ECMS. The results indicated that the High ECMS diet led to a significant increase in feed intake (FI) and body weight (BW) gain compared with both the Low ECMS and the Control diets. No significant differences were observed in feed conversion ratio, pH of ileal and cecal digesta, sialic acids secretion, or apparent total tract digestibility of NDF and nitrogen between birds fed the different diets. <span>Lactobacillus spp.</span> and <span>Enterococcus spp.</span> were significantly more abundant in both the ileal and cecal digesta of birds fed the High ECMS diet compared with the Control diet. Total short-chain fatty acids (SCFA) in the ileal digesta of birds fed ECMS diets significantly increased compared with birds fed the Control diet. Weaned piglets (TN 70 × TN Tempo) were randomly assigned to two dietary treatments with 8 replicate pens in a randomized complete block design. Pigs were fed a corn/soybean meal Control diet containing 50 g/kg of CM and an experimental diet containing ECMS, replacing 20 g/kg of CM, for 3 wk (1 to 21 d post-weaning). The results showed that experimental diets had no significant impact on growth performance. However, the ECMS diet decreased the pH value of the colon contents and increased the population of <span>Biﬁdobacterium</span> in the cecum and colon (<span>P</span> &lt; 0.05). In conclusion, ECMS significantly modulated gut microbiota, increased SCFA production in the ileum, and improved the growth performance of broilers. In weaned piglets, ECMS demonstrated the ability to decrease intestinal pH and stimulate the proliferation of beneficial gut microbiota. Therefore, ECMS could be considered a promising prebiotic in monogastric animal nutrition.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7744dd649a4988f643b3c2ed89beb0570c020d88108f181b47e3a6f31efe8675","category":"Environment"}