{"title":"Typology and implications of verified attacks on health care in Ukraine in the first 18 months of war","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003064","date":1716472800000,"content":"<p>by Hyo-Jeong Kim, Emanuele Bruni, Galyna Gorodetska, Rafael Van den Bergh, Lamia Bezer, Sergiy Artykutsa, Noémie Andriamiseza, Jarno Habicht</p>\r\n\r\nAttacks on health care are part of the spectrum of threats that health care endures during conflict. Protecting health care services against attacks depends on understanding the nature and types of attacks that occur during conflict. The World Health Organisation has implemented the Surveillance System for Attacks on Health Care (SSA) in Ukraine since 2020, and the system has continued to monitor and report on attacks on health care during the war in Ukraine. This study aims to analyse the data reported through the SSA for the first 18 months of the war. This paper involves a retrospective, descriptive study based on the analysis of publicly available SSA data of all incidents of attacks on health care in Ukraine reported through the SSA between February 24<sup>th</sup> 2022 and August 24<sup>th</sup> 2023. Out of the 1503 verified attacks, 37% occurred in the initial six weeks of the war. Attacks involving violence with heavy weapons were among the most common incidents reported (83%). The reported attacks were associated with a total of 113 deaths and 211 injuries among health care workers and patients: 32 (2%) attacks were associated with a death of a health care worker or patient, and 63 (4%) were associated with an injury. Health transports facing attacks had a higher probability of experiencing casualties than other health resources (p&lt;0.0001, RR 3.1, 95%CI 1.9–4.9). In conclusion, the burden of attacks on health care in Ukraine was high and sustained over the course of the first 18 months of the war. Reported casualties were not homogenously distributed among attack incidents, but occurred in a set of high-casualty incidents. Health transports were found to be particularly vulnerable. In addition to continued calls for a cessation of hostilities, prevention, protection, mitigation, and reconstruction strategies are urgently required.","author":"Hyo-Jeong Kim","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"774d9f29d425963cb6664579be5d7fd529aaa6653f087daae4525796c7327e22","category":"Environment"}