{"title":"Apple Announces Alliance With Adobe, NVIDIA, and Others to Develop Pixar's 3D Standard","link":"https://www.macrumors.com/2023/08/01/apple-alliance-to-develop-pixar-3d-standard/","date":1690896688000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/08/pixar-adobe-apple-autodesk-and-nvidia-form-alliance-for-openusd/?1690894762\">announced</a> that it is working with Pixar, Adobe, Autodesk, NVIDIA, and Linux to promote and develop Pixar's 3D Universal Scene Description technology.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/Apple-Alliance-for-OpenUSD-AOUSD-logo.jpg\" alt width=\"1306\" height=\"734\" />\r<br />\nOpen Universal Scene Description (OpenUSD) was created by Pixar Animation Studios as a 3D scene depiction technology that promises significant interoperability among tools, data, and workflows. It is widely recognized for its efficiency and ability simplifying cinematic content creation. Mike Rockwell, Apple's vice president of the Vision Products Group, commented:<blockquote>OpenUSD will help accelerate the next generation of AR experiences, from artistic creation to content delivery, and produce an ever-widening array of spatial computing applications. Apple has been an active contributor to the development of USD, and it is an essential technology for the groundbreaking visionOS platform, as well as the new Reality Composer Pro developer tool. We look forward to fostering its growth into a broadly adopted standard.</blockquote>\r<br />\n\r<br />\nThe Alliance for OpenUSD (AOUSD) seeks to augment the functionalities of OpenUSD and encourage a high level of 3D tool and data interoperability. It will formulate written specifications to define the features of OpenUSD and promote widespread adoption, integration, and implementation of the technology. To learn more about the Alliance for OpenUSD, <a href=\"https://aousd.org\">visit the organization's website</a>.<div>Tags: <a href=\"https://www.macrumors.com/guide/adobe/\">Adobe</a>, <a href=\"https://www.macrumors.com/guide/nvidia/\">Nvidia</a>, <a href=\"https://www.macrumors.com/guide/pixar/\">Pixar</a>, <a href=\"https://www.macrumors.com/guide/linux/\">Linux</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/apple-alliance-to-develop-pixar-3d-standard/\">Apple Announces Alliance With Adobe, NVIDIA, and Others to Develop Pixar's 3D Standard</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-alliance-with-adobe-nvidia-and-others-to-develop-pixars-3d-standard.2397441/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7753f7b8760fb39b0d5fa2aef0adc7cdcb6ef97b8638a50418fb54299c43c90d","category":"Apple"}