{"title":"Sustainable Tourism Industry through Mapping Natural Tourism Potential: Taxonomy Approach","link":"https://www.preprints.org/manuscript/202404.0392/v1","date":1712314323000,"content":"Natural tourist destinations stand out as the most preferred choice in Rembang Regency compared to cultural and artificial tourist destinations. However, until now, there have been no standard indicators established to assess the potential for natural tourism in Rembang Regency, which could assist the Culture and Tourism Office in determining potential tourist locations. In this research, the grouping of natural tourism potential indicators will be carried out based on six main aspects, namely Attractions, Amenities, Accommodation, Activities, Accessibility and Ancillary Services, together with environmental aspects and Human Resources. The procedure for determining natural tourism potential will be developed from the results of this grouping using a taxonomic model. Indicators and the weight of each indicator will be determined using the hierarchical analysis method. The results of this research will produce a taxonomy model that can overcome challenges in managing and utilizing information and knowledge, which in turn will facilitate the process of sharing and utilizing information. Furthermore, the procedures developed will enable accurate and efficient determination of natural tourism potential in accordance with established procedures. This research method will also enable the development of a comprehensive knowledge management system at the Rembang Regency Culture and Tourism Service, through the next stages in the designed taxonomy model. This research is expected to contribute to the sustainable management of natural tourism, which can contribute to the preservation of nature while improving the tourist experience.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7757753feb5d6daa10b86abfde402097f363c1923fb50e6ec54a87aec2f010a6","category":"Interdisciplinary"}