{"title":"Quantitatively Distinguishing the Factors Driving Runoff and Sediment Yield Variations in Karst Watersheds","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037089?af=R","date":1724308470000,"content":"<h2>Abstract</h2>\n<p>Due to the coupled or interconnected relationships among frequent climate extremes, unique geological conditions, discontinuous soil distribution, rugged geomorphology, and highly heterogeneous landscapes in different karst watersheds, few studies were conducted to decouple the relative magnitudes of the climate, lithology, soil, topography, and landscape on soil erosion in karst regions. The objective of this study was to quantify the relative importance of these influencing factors on runoff and sediment yield (SY) in 40 typical karst watersheds in southwest China. To address this issue, the Pearson correlation and random forest were first to select the dominant factors influencing runoff and SY. Subsequently, the partial least squares-structural equation model (PLS-SEM) was used to decouple the complex relationships among runoff, SY and their potential influencing factors. Results showed that climate, lithology, soil, topography and landscape could explain 79% of the runoff variation, and only climate factors have significant impact on runoff for heterogeneous karst watersheds (<i>P</i> &lt; 0.01, path coefficient (<i>β</i>) = 0.589). The explanation of five factors to SY variability is 59%, and the landscape has the greatest impact on SY (<i>P</i> &lt; 0.01, <i>β</i> = −0.458). Different from runoff, climatic factors have no significant influence on SY. By elucidating a complex coupled relationship framework, this study can provide a scientific basis for the formulation of soil and water loss program, and the optimization of land resources and ecological environment sustainable development in karst watersheds.</p>","author":"Si Cheng, \nXingxiu Yu, \nZhenwei Li, \nXianli Xu, \nKelin Wang","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"777dcfed3741d154de46845bb305eedfc019f6d0648fe618162d354f365cbabc","category":"Environment"}