{"title":"Pan-transcriptomic analysis reveals alternative splicing control of cold tolerance in rice","link":"https://academic.oup.com/plcell/article/36/6/2117/7606654?rss=1","date":1707696000000,"content":"<span><div>Abstract</div>Plants have evolved complex mechanisms to adapt to harsh environmental conditions. Rice (<span>Oryza sativa</span>) is a staple food crop that is sensitive to low temperatures. However, its cold stress responses remain poorly understood, thus limiting possibilities for crop engineering to achieve greater cold tolerance. In this study, we constructed a rice pan-transcriptome and characterized its transcriptional regulatory landscape in response to cold stress. We performed Iso-Seq and RNA-Seq of 11 rice cultivars subjected to a time-course cold treatment. Our analyses revealed that alternative splicing-regulated gene expression plays a significant role in the cold stress response. Moreover, we identified <span>CATALASE C</span> (<span>OsCATC</span>) and Os03g0701200 as candidate genes for engineering enhanced cold tolerance. Importantly, we uncovered central roles for the 2 serine-arginine-rich proteins OsRS33 and OsRS2Z38 in cold tolerance. Our analysis of cold tolerance and resequencing data from a diverse collection of 165 rice cultivars suggested that <span>OsRS2Z38</span> may be a key selection gene in <span>japonica</span> domestication for cold adaptation, associated with the adaptive evolution of rice. This study systematically investigated the distribution, dynamic changes, and regulatory mechanisms of alternative splicing in rice under cold stress. Overall, our work generates a rich resource with broad implications for understanding the genetic basis of cold response mechanisms in plants.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"7788ee9d7dc6ec77bd875f125c6d1fd56cd82f9dec7d99d9c9dcbeb19c8949b9","category":"Environment"}