{"title":"Oceanographic Research in Thermaikos Gulf: A Review over Five Decades","link":"https://www.preprints.org/manuscript/202403.1776/v1","date":1711632483000,"content":"Thermaikos Gulf (TG) is a semi-enclosed, river-influenced, marine system situated in the eastern Mediterranean Sea, sustaining both urban coastal regions and ecologically preserved natural areas. Facing a plethora of environmental and anthropogenic pressures, the TG serves as a critical nexus where human activities intersect with marine ecosystems. The second largest city of Greece, Thessaloniki, is located in the northern part of the gulf, while a large environmentally protected zone with multiple river deltas is lying along its western coasts. The quality and health of the TG’s marine environment are tightly linked to the socioeconomic activities of the coastal communities comprising approximately 1.5 million inhabitants. The main features of TG’s environmental dynamics and ecological status have been scrutinized by dedicated research endeavours during the last 50 years. This review synthesizes the seminal findings of these investigations, offering an evaluation of their contribution to research, their present collective impact, and their trajectory toward the future. A severe deterioration of the TG’s environmental quality was detected in the 1970s and 1980s when treatment of urban wastewater was completely absent. A steady trend of recovery was observed after the 1990s, however without achieving, so far, the goal of a “good environmental state”, mandated by national legislation and European directives. The most important research gaps and uncertainties are also discussed and specific recommendations for the improvement of monitoring and understanding about the physical, biochemical, and ecological state of the gulf are provided. The most significant discrepancy is related to the fragmentary monitoring of the TG in both space (partial coverage) and time (temporal gaps), which has been intensified after 2010 due to the reduced funding for environmental research and protection under the severe Greek economic recession. This review aspires to highlight the importance of bolstering monitoring initiatives that can provide continuous observations and further understanding on the TG's ecological and physicochemical conditions. Targeted recommendations, aimed at ameliorating the fragmented monitoring processes, are also provided, advocating for a holistic approach that can safeguard the ecological integrity of the Thermaikos Gulf and uphold its role as a crucial link to marine biodiversity and sustainability in the Mediterranean basin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"778be207bbe520a63f7925acfeb4520274f61d671ee83ceae655b5e64218dfdb","category":"Interdisciplinary"}