{"title":"Stream‐breeding salamander use of headwater stream networks in managed forests of western Washington, USA","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12382?af=R","date":1728873547000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d510cb4c-450a-4403-95d9-d398d6906b2a/eso312382-toc-0001-m.png\" alt=\"Stream-breeding salamander use of headwater stream networks in managed forests of western Washington, USA\" />\n<p>Stream-breeding salamander study species, Left: post-metamorphic torrent salamander (<i>Rhyacotriton</i> spp.); Right: larval giant salamander (<i>Dicamptodon</i> spp.).</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nStream-associated amphibians are sensitive bioindicators in headwater streams across the Pacific Northwest moist coniferous forests of North America. Much of this landscape is intensively managed for timber. Forest Practice (FP) rules determine harvest prescriptions on most private lands in Washington State and cover over 3.7 million hectares. Under these rules, non-fish-bearing headwater streams receive buffers on at least 50% of the stream length, including FP Sensitive Sites that receive 15–17 m radius no-cut patch buffers.\n\nWe evaluated how torrent (<i>Rhyacotriton</i> spp.) and giant (<i>Dicamptodon</i> spp.) salamander relative abundance is influenced by headwater stream network features that correspond to FP Sensitive Sites. In particular, we examined how salamander relative abundance in the two most common FP Sensitive Sites, tributary junctions (TJs) and perennial initiation points (PIPs), compared to densities in non-Sensitive Site stream reaches, hereafter branches. We also evaluated salamander relative abundance and two hydrologic characteristics, dry channel and seeps. We analysed data collected in 2006 and 2007 from 17 amphibian-occupied, non-fish-bearing basins in Western Washington with managed forest ages 30–80.\n\nWe found no relationship between torrent salamander relative abundance and PIPs and TJs or between giant salamander relative abundance and TJs compared to branches. Consistent with expectations, giant salamander relative abundance was less in PIPs than in TJs and branches, and less in first-order than second- and third-order streams. Conversely, torrent salamander relative abundance lacked a clear relationship to stream order. Giant and torrent salamander relative abundance showed a negative relationship with the proportion of dry channels, but torrent salamanders were observed in short reaches of surface water located in predominantly dry channels.\n\nImportantly, reaches with seeps had 123% (CI: +103% to +146%) and 81% (CI: +49% to +121%) greater relative abundance of torrent and giant salamanders, respectively, than reaches without seeps.\n\nPractical implication: Current FP rules protect select side-slope seeps as another category of Sensitive Sites but may too narrowly define the criteria of seeps to protect the full range of those being utilized by stream-breeding salamanders. Studies focused on seeps and adjacent stream channel characteristics may better inform features important to stream-breeding salamanders.\n</p>","author":"Reed Ojala‐Barbour, \nAimee P. McIntyre, \nEric M. Lund, \nMarc P. Hayes","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"778dcbcab55446d2c96e9fd600e622b41fe47f307f565351bab7dae565bdfc2d","category":"Environment"}