{"title":"Unveiling hormone‐stimulated gene mechanisms in prostate cancer: A prognostic model, immune infiltration analysis, and drug sensitivity study","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24118?af=R","date":1713272355000,"content":"<h2>Abstract</h2>\n<p>Hormones promote the progression of prostate cancer (PRCA) through the activation of a complex regulatory network. Inhibition of hormones or modulation of specific network nodes alone is insufficient to suppress the entire oncogenic network. Therefore, it is imperative to elucidate the mechanisms underlying the occurrence and development of PRCA in order to identify reliable diagnostic markers and therapeutic targets. To this end, we used publicly available data to analyze the potential mechanisms of hormone-stimulated genes in PRCA, construct a prognostic model, and assess immune infiltration and drug sensitivity. The single-cell RNA-sequencing data of PRCA were subjected to dimensionality reduction clustering and annotation, and the cells were categorized into two groups based on hormone stimulus-related scores. The differentially expressed genes between the two groups were screened and incorporated into the least absolute shrinkage and selection operator machine learning algorithm, and a prognostic model comprising six genes (ZNF862, YIF1A, USP22, TAF7, SRSF3, and SPARC) was constructed. The robustness of the model was validation through multiple methods. Immune infiltration scores in the two risk groups were calculated using three different algorithms. In addition, the relationship between the model genes and immune cell infiltration, and that between risk score and immune cell infiltration were analyzed. Drug sensitivity analysis was performed for the model genes and risk score using public databases to identify potential candidate drugs. Our findings provide novel insights into the mechanisms of hormone-stimulated genes in PRCA progression, prognosis, and drug screening.</p>","author":"Zhongru Fan, \nQianqian Yu, \nJunpeng Deng, \nKe Wang, \nHongqi Yu, \nXin Fan, \nJianjun Xie","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"779006fdd896a23a7fc06197de9c95e85c8d243c45a3c6138049928961c1fbc6","category":"Environment"}