{"title":"89 Evaluation of repeatability of anogenital distance measured with either a caliper or photogrammetry","link":"https://academic.oup.com/jas/article/102/Supplement_2/245/7664799?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective was to determine the repeatability of anogenital distance (AGD) measurements over time in growing heifers and evaluate the relationship of photogrammetric and caliper AGD measurements. Reproductive success is one of the most important determinants of profitability in the beef industry. However, fertility traits generally have low heritability, and there are few phenotypic traits that correlate to fertility in beef cattle. The AGD is the distance from the center of the rectum to the base of the clitoris. Recently, researchers in dairy cattle have reported a correlation between shorter AGD and improved fertility. In the published dairy research, AGD has been measured with the use of calipers. Photogrammetric measurement could be a quicker and safer way of taking the measurement and easier to implement on farm. Heifers (n = 153), either Angus or Hereford sired by commercial dams, were used in the analysis. Heifers were early weaned at 82 ± 7 d of age. Following weaning, heifers were managed in partially covered, dry lot pens and fed a moderate roughage growing diet. The heifers rotationally grazed predominantly tall fescue pastures beginning in April of 2023. Heifer AGD was evaluated monthly from June to September. Heifers weighed 210 ± 22 kg and 282 ± 6 d of age at the time of the first AGD measurements. Heifer body weight was collected monthly at time of AGD measurements. The heifers were restrained in a squeeze chute and had their tail held in a relaxed upright position and AGD was measured with a caliper. Immediately following caliper measurements, anogenital photographs were taken with an Iphone 14 plus. A white board with a forensic photomacrographic scale attached and the ear tag number recorded on the right corner was held adjacent to the vulva and was included in the photograph. Photographs were converted from HEIC to JPEG. A software program, Digitizer, was used to set the measurement scale using the forensic photomacrographic scale. The AGD was then digitally measured from the center of the rectum to the base of the clitoris. Repeatability of AGD and relationship of caliper and photogrammetric AGD were evaluated using the CORR procedure of SAS 9.4. Caliper AGD measurements were repeatable as all of the time points were moderately correlated (r ≥ 0.47; <span>P</span> ≤ 0.01) throughout the evaluation period. Photogrammetric AGD measurements were also repeatable as all of the time points were correlated (r ≥ 0.21; <span>P</span> ≤ 0.02) throughout the evaluation period. Photogrammetric AGD had a moderate correlation (r ≥ 0.44; <span>P</span> ≤ 0.01) with the caliper AGD measurements. In conclusion, AGD measurements were repeatable in growing heifers regardless of measurement method. Photogrammetric measurements may be a viable option for estimating AGD as they were strongly correlated to caliper measurements of AGD.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7792eb8caf26131aa39188a21e1364af34e591ec2ea298e3543fa1cb93b81366","category":"Environment"}