{"title":"4iiii Precision 3+ Pro Power Meter In-Depth Review","link":"https://www.dcrainmaker.com/2024/02/4iiii-precision-3plus-pro-power-review.html","date":1708017174000,"content":"<p><img title=\"4iiii-Power-Meter-Review.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-Power-Meter-Review.jpg\" width=\"720\" height=\"480\" /></p>\n<p>4iiii has just released its latest power meter, the 4iiii Precision 3+ Pro dual-sided power meter. Admittedly, at this point, the naming scheme has gone off the rails (see the chart later), but from an underlying product standpoint, it’s firmly on the rails and on point. So that’s (mostly) all that matters around these parts. And when it comes to power meters, the most important bit being: Is it accurate?</p>\n<p>However, the second most important bit when discussing a new product is: What’s new?</p>\n<p>In the case of the Precision 3+ (with the “+” part being the new part), that includes a substantial boost in battery life (up to 550+ hours claimed, compared to 100+ hours previously for the dual-sided version), as well as Apple’s FindMy integration built-in (which you can now share an object’s location with friends/family, effectively allowing them to track your rides easily). Additionally, they’ve added something called ‘Automatic Terrain Selector’, which roughly speaking aims to be more responsive to things like cobblestones versus silky smooth roads.</p>\n<p>I’ve been riding the 4iiii Precision 3+ Pro the last month for a slate of rides, mostly focused on road and occasional gravel and cobblestones, as well as plenty of indoor trainer rides too. Ultimately, I’ve been putting it through its paces to see how it handles versus a slate of different trainers.</p>\n<p>Finally, note that this unit is a media loaner, and once this review is complete, it will go back to 4iiii (along with a pile of other beta units they’ve sent). As always, I don’t accept advertising from any company I review – so, if you found this review useful, consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a>, which gets you an ad-free site, plus the behind-the-scenes video series between both myself (and my wife) on everything that happens in the DCR Sports Tech Cave/universe.</p>\n<h3><span><strong>What’s New &amp; Models:</strong></span></h3>\n<p><img title=\"4iiii-PowerMeterRightSide.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-PowerMeterRightSide.jpg\" width=\"720\" height=\"480\" /></p>\n<p>These days, when it comes to power meters, the changes are incremental at best. Simply put, power meters are a mature industry. There’s only so many new features you can add. Which does not however mean there’s a guarantee of accuracy, from new or existing companies. Every new model power meter needs to be evaluated individually.</p>\n<p>Nonetheless, when it comes to features, the Precision 3+ Pro does have a few notable ones, specifically when viewed in the lens as a dual-sided unit (versus their single-sided units, which have gained some of these features already):</p>\n<p><strong>– Added Apple FindMy support:</strong> This basically makes it an Apple AirTag, including the ability to share that device location with specified friends/family</p>\n<p><strong>– Added Terrain Selector:</strong> I’ll dive into this feature a bit more down below, but essentially it changes the chipset components used in real time when it detects rougher terrain conditions. When the pavement is smoother, it turns those bits off to save battery.</p>\n<p><strong>– Increased battery life to claimed 500hrs:</strong> Previously, the claim for the dual-side was listed as “100+” hours. I haven’t been able to realistically validate this claim, given that’s an absolute crap-ton of riding. Note the unit uses CR2032 coin cell batteries, which I prefer as it makes replacements easier.</p>\n<p><strong>– Added support for Shimano Dura-Ace 9200 cranksets:</strong> Of course, that’s really the big ticket item here from a component standpoint, helping you avoid Shimano’s <a href=\"https://www.dcrainmaker.com/2023/02/shimano-r9200p-power-meter-review-astonishingly-bad.html\">own flawed Shimano R9200P DuraAce power meter</a>, yet still using  the same crankset.</p>\n<p><strong>– Reduced thickness (profile) to 5.5mm from 7.5mm:</strong> This is specifically compared to the previous dual-sided unit. Albeit the non+ version prior did get the left-side-only variant down to 5.5mm</p>\n<p><strong>– Being launched on Specialized bikes:</strong> Specifically, Shimano-equipped Specialized S-Works Tarmac SL8 and Aethos models will feature this power meter as an option. This follows a many-year-long partnership with Specialized.</p>\n<p>From a pricing standpoint, it’ll depend on whether you want so-called ‘Factory Install’ or ‘Ride Ready’. Factory install means they install it on your existing crankset, whereas ‘Ride Ready’ means that you just unbox a brand new crankset and off you go (which is what I did here). Here’s that pricing:</p>\n<p><img title=\"Pricing.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Pricing.png\" width=\"718\" height=\"301\" /></p>\n<p>Now, pricing aside, understanding the 4iiii power meter naming scheme has always required a decoder ring. Or, more like a decoder atlas. I’d strongly suggest for their next gen power meters, they change the name somehow and get rid of all the + &amp; Pro addendums. They’re just unnecessary and add confusion. The number of times in this post I typed 4iiii Precision+ 3 Pro or 4iiii Precision 3 Pro+ or some variation thereof would impress you. I’m sure I got it wrong somewhere in here too. And from a business/Google search standpoint, the complexity in the naming greatly hurts brand awareness.</p>\n<p>In any case, here’s the table from them on how each model works out:</p>\n<p><img title=\"4iiii Power Meter Comparison Chart.png\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-Power-Meter-Comparison-Chart-1.png\" alt=\"4iiii Power Meter Comparison Chart.\" width=\"720\" height=\"476\" /></p>\n<p>The TLDR there is that if it has ‘Pro’ in the name, it’s a dual-sided unit. And if it has “+” in the name, it’s their latest generation. No idea what happened to Gen 2, maybe they only count odd numbers in Canada.</p>\n<p>Personally, being a Canadian company, I think they could just call it the 4iiii Poutine Power Meter, which frankly would probably earn them enough viral news stories to kickstart them quite well. Don’t worry, I won’t charge licensing fees for the naming rights.</p>\n<h3><span><strong>In the Box:</strong></span></h3>\n<p><img title=\"DSC_0852.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0852.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In my case, the unit sent for review was a fully boxed pre-installed crankset. That means that I didn’t send in my existing bike’s crankset for review, rather, effectively this was buying a new one. Point is that the process is different if you sent in your own crankset, though, I’d imagine the parts you get back would be exactly the same (since it’s basically just the crankset).</p>\n<p><img title=\"DSC_0853.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0853.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Inside the box you’ll find the crankset wrapped carefully in paper, ready to go from squeaky clean to quickly covered in sweat, road grime, and all manner of sports gels and drinks. And if the unit is destined for a long-course triathlete’s bike? I’m sorry in advance.</p>\n<p><img title=\"DSC_0854.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0854.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In any case, inside the box you’ve got a little flyer about the unit, some install paperwork, then the drive-side crank arm (that’s the right side one with the chainrings installed), as well as the non-drive side arm (the left side). There’s the small cap that you use to seal it all up. Oh, and a sticker.</p>\n<p><img title=\"DSC_0856.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0856.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Here’s a look at the cleanest this left-side crank arm will ever be, including the 4iiii pod installed on it:</p>\n<p><img title=\"DSC_0861.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0861.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Meanwhile, on the right side, you’ll see the pod just under the inner ring, and the wiring ‘tunnel’ connecting to the battery pod compartment towards the upper right. You’ll notice the ANT+ ID listed on it (45298), which is the right-side ANT+ ID. The left side has one too, though once you connect to either side, it pulls in the information from both sides.</p>\n<p><img title=\"DSC_0864.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0864.jpg\" width=\"720\" height=\"480\" /></p>\n<p>So, with that, let’s get it all installed.</p>\n<h3><span><strong>Install &amp; Setup:</strong></span></h3>\n<p>Installation is pretty easy here. Shimano road cranksets are pretty much the easiest things to install on your bike, assuming you’re swapping from an existing Shimano crankset. I will caution that if you’ve got some other crankset on your bike, and aren’t super familiar with bottom bracket standards and such, that you should probably have your bike shop validate you’ve got the right parts. Else, you’ll spend a lot of time and headache till you’ve got all the right parts and tools to get the right bottom bracket in there for it.</p>\n<p>But, if you’re just swapping Shimano for Shimano, my 7-year old daughter can do it. You merely need an Allen wrench, potentially something soft/rubber to lightly whack the crankset out if it’s being stubborn, and then ideally some grease to help it stay happy. And, since Shimano/4iiii didn’t include a tool for that little cap (here, you can buy one on <a href=\"https://amzn.to/3OLjsQt\">Amazon for like $10</a>), you can use a flat-blade screwdriver in a pinch.</p>\n<p><img title=\"DSC_0868.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0868.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In any event, you can see above I’ve removed the existing crank arm. You can find instructions on the internet on how to do that, but all you need to do is:</p>\n<p>1) Loosen the only two bolts there are, on the left-side crankarm<br />\n2) Remove the little plastic cap (you can likely do this with your fingers, or at worse, said screwdriver wedged at an angle)<br />\n3) Take off the left side crank arm, and then just push the right side, with the spindle, out from your bike. If it’s being a bit sticky, just lightly tap it with a rubber mallet to get it to come out.</p>\n<p>Now, we’re ready to put the new one in. Apply a bit of grease to the spindle, anything too much and you can simply just wipe it away after you slide it in.</p>\n<p><img title=\"DSC_0871.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0871.jpg\" width=\"720\" height=\"480\" /></p>\n<p>It’ll look like this. Pro Tip: Don’t forget to hold the chain up over it. Else, you’l complete install the whole thing and swear a bunch, realizing you forgot to get the chain in there.</p>\n<p><img title=\"DSC_0872.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0872.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Next, install the left side crank arm, which should only fit perfectly when exactly opposite the right side.</p>\n<p><img title=\"DSC_0874.JPG\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0874.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The order of operations for installing a left-side Shimano crank arm is:</p>\n<p>1) Ensure it’s nice and snug<br />\n2) Then install the plastic cap to pull the two sides tightly together<br />\n3) Then finally tighten the two bolts, ideally working one after another, not just tightening one entirely and then the next entirely.</p>\n<p>Donezo. Oh, install some pedals first. Then, donezo. Now…you’re ready to roll.</p>\n<h3><span><strong>Daily Ride Usage:</strong></span></h3>\n<p><img title=\"WindmillRiding.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/WindmillRiding.jpg\" width=\"720\" height=\"480\" /></p>\n<p>With everything all configured, it’s time to pair it up to your bike computer or watch (or, app). The 4iiii units will pair across both ANT+ &amp; Bluetooth Smart, with multiple concurrent connections allowed as well. This means that you can basically pair it to any device out there that can talk with power meters. In my case, I’ve tested it with both Garmin watches and bike computers, as well as Wahoo bike computers, and Apple Watches. I’ve also validated enumeration in Zwift and TrainerRoad. But again, it uses industry-standard connection types, so there shouldn’t be any issues here.</p>\n<p>Looking at it on a Garmin bike computer as an example, you’ll search for the power meter. You’ll want to connect via ANT+ ideally, rather than Bluetooth, as more standardized information is sent via ANT+ than Bluetooth on the power meter side. There’s nothing wrong with Bluetooth per se here, it’s just that the ANT+ data stream includes added information like pedal smoothness and torque effectiveness, not seen on the Bluetooth side.</p>\n<p><img title=\"IMG_4876.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4876.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>Once paired up you can name it whatever you’d like. You won’t/shouldn’t need to provide a crank length setting here, as it’s not a power meter pedal.</p>\n<p><img title=\"IMG_4867.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4867-1.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>You can also double-check the battery here, as well as firmware versions:</p>\n<p><img title=\"IMG_4869 2.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4869-2.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>The next thing you’ll want to do is a zero offset. On most bike computers/watches, this will be listed as ‘Calibration’, which is sorta-correct. Technically speaking, calibration is a bit different, but for our purposes, we’ll just call it that. Zero offsetting should be done without any weight on the pedals (no shoes clipped in), and still (no movement).</p>\n<p><img title=\"IMG_4870.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4870.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>It’ll think for a few seconds, and come back with a success confirmation. In the case of 4iiii, success numbers are 1010, where basically the first two digits show the status for one side, and the second two digits show the status for the other side. You can find <a href=\"https://4iiii.zendesk.com/hc/en-us/articles/4410151983764-Powermeter-Zero-Offset-Calibration-Explained\">those status codes here</a>.</p>\n<p><img title=\"IMG_4873.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4873-1.jpeg\" width=\"720\" height=\"500\" /></p>\n<p>As a general rule of thumb, you should calibrate before a ride – ideally once your bike has stabilized for about 10-15 minutes in the new temperature. So here in winter, it’s best to either let your bike hang outside for a few minutes before hitting calibrate, or simply calibrate 10-15 minutes down the road after both you have warmed up and your power meter cooled down.</p>\n<p>With that done, we’ll start pedaling. As we do so we’ll see our power broadcast on the head unit of our choice. Of course, you’ll have needed to add a power meter field or two, to the bike computer. But most bike computers will actually offer to add these automatically when you pair a power meter for the first time. Here you can see power and cadence displayed. I have no idea why I elected to make cadence that gigantic:</p>\n<p><img title=\"4iiii-PowerMeter-DataFields6.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-PowerMeter-DataFields6-scaled.jpeg\" width=\"2016\" height=\"1512\" /></p>\n<p>Generally speaking, I’m looking at either 10-second or 30-second power. This means the power is smoothed for that duration. This doesn’t impact recorded data (which is still at 1-second intervals), just what you see. Power meter data, by nature, tends to be kinda jumpy, so most people will use at least a 3-5 second smoothing, if not more. I generally think of 10s power as my instant power.</p>\n<p><img title=\"4iiii-PowerMeter-DataFields1.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-PowerMeter-DataFields1.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>In terms of responsiveness, I didn’t have any issues here with responsiveness on this unit. We’ll dive into that more down in the accuracy section though. In many ways, power meter reviews are kinda simple (at least, when they work). It’s essentially two basic questions: What and how does it transmit? And then, “Is it accurate?”. Sure, there are other bits like battery performance and crankset compatibility, but the biggie is really accuracy.</p>\n<p>In any event, given it’s a dual-legged system, you’ll see power balance displayed too:</p>\n<p><img title=\"IMG_4879 2.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4879-2.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>Further, you can also display torque effectiveness and pedal smoothness if you’d like. In total, the 4iiii system displays/transmits the following metrics:</p>\n<p>– [ANT+/Bluetooth] Total power (combined left/right)<br />\n– [ANT+/Bluetooth] Power Balance (left/right split)<br />\n– [ANT+/Bluetooth] Cadence (RPM)<br />\n– [ANT+] Torque Effectiveness<br />\n– [ANT+] Pedal Smoothness</p>\n<p>From there, any other data is calculated on your bike computer (e.g. 10-second power is simply the bike computer calculating that). Same goes for things like normalized power, average cadence, total pedal strokes, etc…</p>\n<p>All of this is then recorded in the file, and you can view it after the ride on your bike computer, or from various apps from those companies. Here’s what that power data looks like on Garmin Connect, using any Garmin bike computer or watch:</p>\n<p><img title=\"GC1.png\" src=\"https://media.dcrainmaker.com/images/2024/02/GC1.png\" width=\"720\" height=\"498\" /></p>\n<p>And lower down that page, you’ll see those Torque Effectiveness and Pedal Smoothness stats as well:</p>\n<p><img title=\"GC2.png\" src=\"https://media.dcrainmaker.com/images/2024/02/GC2.png\" width=\"720\" height=\"559\" /></p>\n<p>Frankly, very few people will leverage those last two stats…but hey, they’re there if you want them.</p>\n<p>One of the newer features on the 4iiii unit is the so-called ‘Automatic Terrain Selector’. This feature essentially aims to ramp-up usage of internal hardware components when it detects rougher terrain, and then put those components back to sleep when things are more like silky smooth roads. Generally speaking, rough terrain has always been somewhat challenging for power meters, though that’s largely been solved in the last few years.</p>\n<p>Nonetheless, 4iiii says the new feature (which was previously launched on 4iiii single-sided units, but this is the first dual-sided one), should help in edge cases. From a tech standpoint, they noted:</p>\n<blockquote><p>“The automatic terrain selection was released on the non-drive side last summer but we have continued to refine and have filed for a patent on the tech. Prior to PRECISION 3 firmware version 1.2 we only utilized the accelerometer even though the gyro was physically part of the IMU.</p>\n<p>All firmware’s since the IMU wakes up on startup and during zero offset and both accelerometer and gyro are part of the zero. During periods of rapid cadence change the gyro my engage in any environment where the accelerometer-based algorithm detects suboptimal conditions and then during periods where the IMU is being shaken violently (washboard gravel, cobbles, rumble strips that kind of situation).</p>\n<p>Under the hood our system has a kind of “shake o meter” if you will that takes all the above items and a few more inputs and if the combined end output exceeds the threshold we have set then it activates the gyro and if it is less then it remains in accelerometer mode and therefore conserves battery life.</p>\n<p>With this platform we have always had a vision for adding more features and making it a means to deliver customer solutions beyond just a great training tool which is why we are obsessed with minimal current draw and optimization.”</p></blockquote>\n<p>In terms of real-world accuracy impacts, again, I’ll cover this in the accuracy section below. But I repeatedly rode my bike over both cobblestone sections as well as off-road and gravel paths, and didn’t see any outlier in those areas. Especially notable are high-speed cobbles and bricks, which can have a high-frequency vibrating effect, but again, I didn’t notice any issues there. Given this was a road-bike groupset, it wasn’t used in any sort of crazy MTB rock-filled terrain, but for just about anything you’re going to encounter with a road bike (including some short off-road adventures), I tried to cover it.</p>\n<p>Now, in terms of batteries, the unit uses two CR2032 coin cell batteries. These batteries are found round-the-world easily. 4iiii claims 500 hours of performance between battery swaps. As you might imagine, I don’t have that much time yet on this unit to validate that claim, and given the detail-level on the batteries themselves, I can’t really even estimate if it’s trending towards that. My main concern here isn’t so much whether it hits that claim, but whether they sacrifice anything else to hit that claim.</p>\n<p>In previous releases, 4iiii has tried to push the boundaries of battery life claims to such an extent that there were ANT+/Bluetooth dropouts to watches and bike computers. But they’ve since realized the errors of their ways, and pulled things in a bit. Nobody really cares about having 700 hours instead of 500 hours, when the power data is dropping out. The good news, is I saw no dropouts at all on any watches or bike computers on this unit. So all seems well.</p>\n<p>In terms of changing those batteries, for the left-side (non-drive side), you just simply rotate the little battery cap:</p>\n<p><img title=\"IMG_2319.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2319.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>And then for the right side, you’ll need to undo the three screws to access the battery compartment:</p>\n<p><img title=\"IMG_2320.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2320.jpeg\" width=\"720\" height=\"540\" /></p>\n<p>It’s as easy as that. And given the 500hr claim, this won’t be something you need to do very frequently. Even if you were doing 10hrs of riding per week (which for most people is a lot), then you’d still be looking at basically a year’s worth of battery performance. Which is obviously pretty astounding. Heck, even half of that is still astounding.</p>\n<p>It’s worth mentioning that 4iiii does have an app for doing checking and calibration of the power meter. It’s also here where you can update firmware, de-pair and re-pair the two sides together, and even record data files (via phone). In fact, 4iiii even has an Apple Watch app that will record power meter data and does a pretty darn good job of it too. Of course, with Apple adding native power meter support this past summer, there’s less reason to use other apps. But it’s there.</p>\n<p>Here you can see the unit listed, as well as battery status:</p>\n<p><img title=\"IMG_2296.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2296.png\" width=\"175\" height=\"379\" /> <img title=\"IMG_2298.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2298.png\" width=\"175\" height=\"379\" /> <img title=\"IMG_2299.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2299.png\" width=\"175\" height=\"379\" /></p>\n<p>I can tap to zero offset if I want:</p>\n<p><img title=\"IMG_2292 2.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2292-2.png\" width=\"175\" height=\"379\" /> <img title=\"IMG_2293.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2293.png\" width=\"175\" height=\"379\" /> <img title=\"IMG_2294.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2294.png\" width=\"175\" height=\"379\" /></p>\n<p>As well as tap to get details on the system and firmware versions. There’s the pairing option as well, in the event you need to break-out and re-pair the unit. Again, nothing earth shattering in here, but appreciate it’s there if you need/want it. Most people will never use this, except to set up Apple FindMy integration, which we’ll dive into next.</p>\n<h3><span><strong>Apple FindMy Integration:</strong></span></h3>\n<p><img title=\"IMG_2316.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2316.jpg\" width=\"720\" height=\"480\" /></p>\n<p><a href=\"https://www.dcrainmaker.com/2023/08/4iiii-adds-apple-find-my-feature-to-power-meters-hands-on.html\">4iiii first rolled out Apple’s FindMy integration</a> about 18 months ago, shortly after Apple announced compatibility for 3rd parties. This essentially turns your 4iiii crankset into an Apple AirTag. What’s cool though is that last summer Apple added the ability for you to share your AirTags and other ‘FindMy’ things with specific people. Previously you couldn’t do that. Thus this allows you to essentially share your bike with friends/family (without perhaps sharing your own location the entire time). This can be useful for riding buddies.</p>\n<p>Now, I can hear the complaints already “I’m on Android! Why isn’t 4iiii supporting me. I hate 4iiii!” (Seriously, that’s actually exactly what people said when 4iiii announced this previously)</p>\n<p>Look, <a href=\"https://www.dcrainmaker.com/2019/01/4iiii-tracking-capabilities.html\">4iiii was actually the first company to support Chipolo some 5 years ago</a> in the power meter scene (which supported Android). And what did everyone do? Not care one single bit. Seriously, in every post/video I made about it, nobody cared. Like almost negative interest level. Said differently: When 4iiii did exactly what people asked, nobody actually supported them.</p>\n<p>In any event, my mini-rant over, let’s get to the tech. To set this up, it’s pretty easy. You’re going to remove/replace the battery three times in a row, which then triggers the FindMy activation feature (and a blinking blue light on the power meter, indicating it’s in that mode). From there, you can go ahead and search for it from Apple’s FindMy app on your phone:</p>\n<p><img title=\"IMG_2307.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2307.png\" width=\"175\" height=\"195\" /> <img title=\"IMG_2309.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2309.png\" width=\"175\" height=\"182\" /></p>\n<p>At this point you can give it a name, as well as a preferred icon:</p>\n<p><img title=\"IMG_2310.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2310.png\" width=\"175\" height=\"379\" /> <img title=\"IMG_2312.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_2312.png\" width=\"175\" height=\"379\" /></p>\n<p>After which, you’re done. It’s ready to go. You’ve got access to all the regular AirTag features in terms of finding things. Though, it won’t chirp like an AirTag will. But frankly, if you lose your bike in a couch cushion…that’s on you.</p>\n<p><img title=\"IMG_4885.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4885.jpg\" width=\"175\" height=\"379\" /><img title=\"IMG_4884.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4884.png\" width=\"175\" height=\"379\" /><img title=\"IMG_4886.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4886.jpg\" width=\"175\" height=\"379\" /><img title=\"IMG_4908.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4908.jpg\" width=\"175\" height=\"379\" /></p>\n<p>And, as you can see above, you can share it too. In this case there’s GPLAMA’s 4iiii unit that he’s shared with me. I’ve of course zoomed way out, to protect our various locations.</p>\n<p>Certainly, there’s benefits in this if your bike is stolen, as most people won’t realize the power meter has an AirTag in it. And of course, you can remove the battery (though, a few more steps to do so with the right-side). But in terms of a quick getaway, most people won’t be reaching down to unscrew the battery compartment while stealing your bike from a cafe in front of you. Instead, this will give you a bit of tracking to do exactly what every police department tells you not to do: Chase that mofo down!</p>\n<p>Or, it’ll just tell your family where your bike is, in case you crash and they can’t seem to locate you. Your choice.</p>\n<h3><strong><span>Power Accuracy Testing:</span></strong></h3>\n<p><img title=\"4iiii-Powermeter-ridingalong.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/4iiii-Powermeter-ridingalong.jpg\" width=\"720\" height=\"480\" /></p>\n<p>I’ve long said that if your power meter isn’t accurate, then there’s no point in spending money on one. Strava can give you estimated power that’s ‘close enough’ for free, so if you’re gonna spend money on something it shouldn’t be a random number generator. Yet there are certain scenarios/products where a power meter may be less accurate than others, or perhaps it’s got known edge cases that don’t work. Neither product type is bad – but you just need to know what those use/edge cases are and whether it fits your budget or requirements.</p>\n<p>As always, I set out to determine whether this unit is accurate and precise. In power meters today, one of the biggest challenges is outdoor conditions. Generally speaking, indoor conditions are pretty easy to handle, but I still start there nonetheless. It allows me to dig into areas like low and high cadence, as well as just how clean numbers are at steady-state power outputs. Whereas outdoors allows me to look into water ingest concerns, temperature and humidity variations, and the all-important road surface aspects (e.g. vibrations). For reference, the 4iiii Precision 3+ Pro has a claimed accuracy rate of +/- 1.0%.</p>\n<p>I’m going to go through most of these relatively quickly, unless there’s a specific issue. You can click on any of the data sets to look at the underlying data yourself, if you’d like.</p>\n<p>First up, let’s start with something simple – an indoor ride – an <a href=\"https://analyze.dcrainmaker.com/#/public/757f6aa3-7608-4bbe-6c41-d6574db5b523\">ERG workout in TrainerRoad</a>. This one is actually on the Wahoo KICKR CORE smart trainer, and Favero Assioma Duo dual-sided pedals:</p>\n<p><img title=\"Accuracy-PM1-ERGWorkout.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM1-ERGWorkout.png\" width=\"719\" height=\"263\" /></p>\n<p>As you can see above, the green line of the KICKR CORE is settling down a bit during the warm-up, however, the two power meters (4iiii &amp; Favero) are like best buds here, virtually identical across the board.</p>\n<p>If I look at the left/right power balance split of one section later in the workout, you can see they trend very closely to each other. On the 2nd interval shown below, when my left leg is a bit lower there, you can see it matches on both of them that way. This is one area we’ll keep coming back to in this review. With dual-sided power meters, it can be somewhat challenging to get a bunch of them to agree exactly every time (to other units), but we want them to be pretty darn close – as total power on these units is simply the left side + right side added together.</p>\n<p><img title=\"Accuracy-PM1-ERGWorkout-LeftRight.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM1-ERGWorkout-LeftRight.png\" width=\"718\" height=\"245\" /></p>\n<p>Next, looking at cadence, again we see the units are virtually identical – save the KICKR CORE’s estimated cadence being a bit slow in some cases, which is normal for smart trainers using estimated cadence.</p>\n<p><img title=\"Accuracy-PM1-ERGWorkout-Cadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM1-ERGWorkout-Cadence.png\" width=\"719\" height=\"261\" /></p>\n<p>And then lastly, when we look at the mean-max power graph, which is a great way to see accuracy and alignment over longer periods, we see the two power meters are near identical, with the KICKR CORE a bit higher due to that earlier warm-up phase where it was reading higher. Still, on the whole, this is actually a very pretty chart.</p>\n<p><img title=\"Accuracy-PM1-ERGWorkout-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM1-ERGWorkout-MeanMax.png\" width=\"719\" height=\"216\" /></p>\n<p>Next, we’ve got another structured workout, some 30×30 tests, which is a good place to look at both trainer and power meter responsiveness. This is a quickie I do with all power meters and trainers, so I won’t spend too much time on it here. Nonetheless, <a href=\"https://analyze.dcrainmaker.com/#/public/bf6f0c92-e603-4356-7cda-711fc6afe5e3\">here’s the data (note: the colors have changed here, sorry!):</a></p>\n<p><img title=\"Accuracy-PM2-ERGWorkout-30x30-Overall.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM2-ERGWorkout-30x30-Overall.png\" width=\"719\" height=\"247\" /></p>\n<p>As you can see, again, near identical. The singular exception to that though is the first moment of the first interval, which seemed to catch the Favero unit a bit off guard and got a bit excited. The other units didn’t report that level of excitement.</p>\n<p>In any event, looking at the left-right splits on a few intervals, you can see again, Favero and 4iiii are virtually identical here, especially once power is applied. We see a hair-bit more separation at some of the lower levels while soft pedaling (e.g. 90w), which can be somewhat common for power meters.</p>\n<p><img title=\"Accuracy-PM2-ERGWorkout-30x30-LeftRight.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM2-ERGWorkout-30x30-LeftRight.png\" width=\"718\" height=\"282\" /></p>\n<p>Looking at the mean-max graph, we do see more separation here at the top-end, due to the excitement shown by the Favero unit early on. Again, unclear to me if that’s real-excitement, or fake-excitement. I’d argue it wasn’t real, but it can be difficult to suss out those slight nuances.</p>\n<p><img title=\"Accuracy-PM2-ERGWorkout-30x30-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM2-ERGWorkout-30x30-MeanMax.png\" width=\"719\" height=\"211\" /></p>\n<p>Now, let’s move from a structured workout to a non-structured trainer workout. This time in SIM mode, or simulation mode, where it’s simulating <a href=\"https://analyze.dcrainmaker.com/#/public/2a3c0a98-450b-4644-687e-9e3c8d3d130c\">the terrain gradient in Zwift</a>:</p>\n<p><img title=\"Accuracy-PM3-SIMMode-Overall.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-Overall.png\" width=\"718\" height=\"255\" /></p>\n<p>I know, it’s kinda a mess – such is life (and real-world pedaling). So, let’s zoom in on a few sections, starting with that sprint towards the end there. Looking at that, we can see very good alignment between the three units. There’s really not much to complain about here:</p>\n<p><img title=\"Accuracy-PM3-SIMMode-OverallZoom1.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-OverallZoom1.png\" width=\"718\" height=\"281\" /></p>\n<p>And if I look at that exact same timeframe, but now the left/right power, you can see again, they’re virtually identical between the two units. We see the Favero hold onto the sprint about 1 second longer than the other units (both above/below), which contributes to the average from Favero being slightly higher. But that’s not likely to actually be a Favero problem, but rather the simple reality of 1-second intervals for transmission/reception/recording rates (a blend thereof), driving these data differences. Said differently: It’s not likely a real-world data usage issue, just a recording/comparison issue.</p>\n<p><img title=\"Accuracy-PM3-SIMMode-LeftRightsprint.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-LeftRightsprint.png\" width=\"718\" height=\"283\" /></p>\n<p>Here’s another sprint, where we see the Favero and 4iii units separated quite nicely (in a good way) on the left/right side, with both of those respective sides aligned together:</p>\n<p><img title=\"Accuracy-PM3-SIMMode-OverallZoom2.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-OverallZoom2.png\" width=\"719\" height=\"283\" /></p>\n<p>We’ve then got a blah-boring cadence graph, with things basically perfect:</p>\n<p><img title=\"Accuracy-PM3-SIMMode-OverallCadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-OverallCadence.png\" width=\"719\" height=\"279\" /></p>\n<p>And also a blah-boring perfect mean-max graph. Frankly, you won’t get much more perfect than this, save a tiny bit of differences on the KICKR CORE:</p>\n<p><img title=\"Accuracy-PM3-SIMMode-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM3-SIMMode-MeanMax.png\" width=\"718\" height=\"219\" /></p>\n<p>So, let’s head outside, and <a href=\"https://analyze.dcrainmaker.com/#/dcc/6fe5c354-5df1-47d4-5fff-cd25ca93ce96\">start to toy with things a bit</a>. Here we’ve got a relatively efficient road ride, and looking at the overall plot, obviously, it’s a bit variable:</p>\n<p><img title=\"Accuracy-PM4-Outside1-Overall.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-Overall.png\" width=\"720\" height=\"269\" /></p>\n<p>So, let’s zoom in on a few sections. First up is this section here, which looks very close. Again, the reality of power meters is you’re going to see very slight differences of opinions, especially outdoors. But this is pretty darn close:</p>\n<p><img title=\"Accuracy-PM4-Outside1-OverallZoom1.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-OverallZoom1.png\" width=\"718\" height=\"267\" /></p>\n<p>Here’s another section, again, with very slight differences here as we’re later in the ride:</p>\n<p><img title=\"Accuracy-PM4-Outside1-OverallZoom3.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-OverallZoom3.png\" width=\"719\" height=\"268\" /></p>\n<p>And then if we look at the left/right split of that same section, it’s very very close – save a few seconds here or there we see slight disagreements. But it’s nearly impossible to know in this scenario which one is ‘most’ right. And as we can see above, practically speaking, it’s just not mattering – the total power is so close between them.</p>\n<p><img title=\"Accuracy-PM4-Outside1-LeftRightSplit.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-LeftRightSplit.png\" width=\"719\" height=\"282\" /></p>\n<p>If I look at cadence, all seems identical there. There are two brief moments where cadence drops out for about 3 seconds on the Edge 1040 recording the 4iiii unit. However, this wasn’t just cadence dropping out, but all sensor data. I had a backup recording of the 4iiii on the Apple Watch (via Bluetooth), and I didn’t see the drop-out there. Thus it’s unclear to me if that’s an Edge 1040 thing, or a 4iiii ANT+ thing that happened.</p>\n<p><img title=\"Accuracy-PM4-Outside1-Cadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-Cadence.png\" width=\"718\" height=\"219\" /></p>\n<p>And finally, the mean-max for that ride:</p>\n<p><img title=\"Accuracy-PM4-Outside1-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM4-Outside1-MeanMax.png\" width=\"720\" height=\"214\" /></p>\n<p>Next up, another outdoor ride, this one with some cobbled sections, some off-road sections, lots of road sections, and some sections I spent trying to figure out where TF the road went to. <a href=\"https://analyze.dcrainmaker.com/#/public/a924b7e5-54e1-4181-5086-1f2a9f923f87\">Here’s the data</a>:</p>\n<p><img title=\"Accuracy-PM5-Outside2-Overall.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Overall.png\" width=\"719\" height=\"260\" /></p>\n<p>Now, I want to focus in on a few things with a bit more pickiness. Here’s a zoomed in section that’s virtually identical, for a half-hearted sprint. You can see there’s some slight disagreement on the ramp itself, but they basically get to the same spot.</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint1.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint1.png\" width=\"717\" height=\"261\" /></p>\n<p>And if you look at the left/right power split there, you see the two actually disagree about how I got there. The 4iiii says I had more left power, whereas the Favero says I had more right power. In total, both agree, but individually, they disagree on the composite of that.</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint2.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint2.png\" width=\"720\" height=\"282\" /></p>\n<p>Likewise, this section here. These two units are very similar, albeit the Favero is edging just slightly higher in some spots. Not a ton higher, but just barely higher at higher wattages. Or, one could say the 4iiii is edging barely lower in some higher-wattage spots.</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint3.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint3.png\" width=\"718\" height=\"222\" /></p>\n<p>You can see again that these two disagree on how that composite should be, but agree on that main sprint (point highlighted above), that the total power is the same but the left/right balances are quite a bit different for that exact second in time. Welcome to power meter analysis!</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint3LeftRight.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint3LeftRight.png\" width=\"718\" height=\"282\" /></p>\n<p>In some ways, going down the above rabbit hole can be never-ending.</p>\n<p>However, where it becomes concerning is when a pattern develops between differences in total power. And there is a slight pattern here on some rides (but not all rides), where the Favero unit is a bit higher than the 4iiii unit:</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint4.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint4.png\" width=\"719\" height=\"266\" /></p>\n<p>And if we look at the breakouts there, we notice the 4iiii is reading slightly lower, primarily on the right side, than the Favero pedals. Again, this doesn’t happen often, but happens mainly on surges. Sometimes. But not every time.</p>\n<p><img title=\"Accuracy-PM5-Outside2-Sprint4LeftRight.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-Sprint4LeftRight.png\" width=\"718\" height=\"283\" /></p>\n<p>Again, I can go multiple rides in a row where this doesn’t happen, but then you find a ride where it does happen – and I don’t really have a great reason for it. For my riding and power output, it doesn’t seem to be a major concern, and seems to be fairly minimal, but it does have a slight effect on higher wattages for your total power curve. You can see that here. If I look at the mean-max point for the 10-minute  section, the two units are only a couple of watts apart (totally normal). But as we climb higher and higher, they diverge more.</p>\n<p><img title=\"Accuracy-PM5-Outside2-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM5-Outside2-MeanMax.png\" width=\"720\" height=\"214\" /></p>\n<p>Finally, one last ride from today. In this ride, I was heavily focused on trying to break things. So, I just went out along the rowing basin and sprinted 1,000w repeats over and over again. My goal here was to see if I could cause the right-side to do wonky things. Also, for funnies, I swapped out the Favero pedals for a pair of Garmin Rally RK200’s. I trust both the Favero and Garmin pedals equally, so this seemed like a good next step.</p>\n<p>Here’s<a href=\"https://analyze.dcrainmaker.com/#/public/c876da91-52f8-4413-574c-a94c0e5daa63\"> that fun</a> (with no smoothing applied). That empty chunk about 1/3rd of the way into it is doing some zero offsets and photos:</p>\n<p><img title=\"Accuracy-PM6-SprintFunWide.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM6-SprintFunWide.png\" width=\"719\" height=\"221\" /></p>\n<p>Now, as you can see pretty obviously, these all look really darn similar at a high level. However, there are some slight differences when you zoom in.</p>\n<p>You’ll notice that it’s almost as hard to see those differences here too though. These are very very very close. What’s interesting is that it seems like the Rally is a touch bit higher each time, but in reality, they hit about the exact same point each time, just about 1 second difference. You can see the 4iiii has a smidge bit more smoothing applied as I increase power into the interval, which contributes to the slightly higher overall averages you’ll see in a second. But again, let’s be clear – this is astonishingly close for 1,000w sprints.</p>\n<p><img title=\"Accuracy-PM6-SprintFunZoom1.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM6-SprintFunZoom1.png\" width=\"717\" height=\"219\" /></p>\n<p>If we look at the left/right breakout of this same section, you’ll notice that sometimes Rally/4iiii agree exactly on the breakout balance, and sometimes they don’t. What’s funny though is that they both come to the same agreement on total power. So…yeah, not sure how to reconcile that.</p>\n<p><img title=\"Accuracy-PM6-SprintFunZoom1LeftRight.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM6-SprintFunZoom1LeftRight.png\" width=\"720\" height=\"290\" /></p>\n<p>And finally, the mean-max power. Here you’ll see Rally is slightly higher. I suspect that’s because if you look above, Rally has slightly less smoothing, so it tends to be a bit jumpier as I apply power, giving it a bit of an additive power surplus over the course of the ride. Very slight, but you can see it here more-so than other rides since all I did was sprint repeats.</p>\n<p><img title=\"Accuracy-PM6-SprintFunMeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/Accuracy-PM6-SprintFunMeanMax.png\" width=\"719\" height=\"212\" /></p>\n<p>Anyways, overall, I’m not seeing any accuracy issues on this particular unit with all of my riding or pedaling styles. As always, that can vary from person to person, or even unit to unit sometimes. But in terms of overall accuracy, this seems to stick the landing on both power and cadence accuracy.</p>\n<p><em>(Note: All of the charts in these accuracy portions were created using the <a href=\"https://www.dcrainmaker.com/analyzer\">DCR Analyzer tool</a>. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, running power, GPS tracks and plenty more. You can use it as well for your own gadget comparisons, <a href=\"https://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p><img title=\"RoadRiding.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/RoadRiding.jpg\" width=\"720\" height=\"480\" /></p>\n<p>When it comes to Shimano-based dual-sided power meters, particularly for Shimano’s newer cranksets, it’s been somewhat slim pickings. Shimano’s own power meters offering is, of course, notoriously inaccurate (even with the most recent updates), and that’s largely left you with Stages and 4iiii offerings. Thankfully, both of them seem solid with recent models. In the case of Stages and their Stages LR dual-sided unit, I’d been riding that for quite some time without issue, though I’ve got concerns with the company’s viability and complete and utter lack of customer service department for the past 6-8 months. Which is too bad, as the company has historically been quite solid.</p>\n<p>Meanwhile, 4iiii seems to have both a power meter that’s accurate – and a company that’s financially viable with people answering phones and all the normal things that you do as a company in the power meter space.</p>\n<p>For Apple users, having the FindMy feature is a nice touch, if for nothing other than peace of mind. Given how cheap it is to put an AirTag on your bike in other places, it’s probably not a feature you’d individually pay a ton extra for – but when it’s there, it’s handy. Meanwhile, 4iiii’s ‘Automatic Terrain Selector’ feature seems to do nothing user-facing visible, which is pretty much exactly what I want in a power meter feature. Meaning, I don’t really care how a company arrives at an accurate value, as long as they do. 4iiii could call it ‘Poutine Mode’, and I’d be happy, as long as when I hit those cobblestones or rough patches, it stays accurate. And here it does exactly that.</p>\n<p>Ultimately, I don’t really have any meaningful complaints. My biggest gripe is simply the name is just far too confusing. But that’s not a product problem, rather, a marketing one. And it’s certainly not my problem. And from a consumer standpoint, it’s realistically not a problem you care about either, as once it’s on your bike, you’re just gonna call it the ‘4iiii power meter’.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"779c8db402fc90a2094806e74dff203ae5ef41e2c7932c8e27f512e6ed900e97","category":"Cycling"}