{"title":"Efficacy of mefloquine and its enantiomers in a murine model of <i>Mycobacterium avium</i> infection","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311167","date":1727704800000,"content":"<p>by Antoine Froment, Julia Delomez, Sophie Da Nascimento, Alexandra Dassonville-Klimpt, Claire Andréjak, François Peltier, Cédric Joseph, Pascal Sonnet, Jean-Philippe Lanoix</p>\r\n\r\nThe treatment of <i>Mycobacterium avium</i> infections is still long, complex, and often poorly tolerated, besides emergence of resistances. New active molecules that are more effective and better tolerated are deeply needed. Mefloquine and its enantiomers ((+) Erythro-mefloquine ((+)-EMQ) and (-)-Erythro-mefloquine ((-)-EMQ)) have shown efficacy in both <i>in vitro</i> and <i>in vivo</i>, in a mouse model of <i>M</i>. <i>avium</i> intraveinous infection. However, no study reports aerosol model of infection or combination with gold standard treatment. That was the aim of our study. In an aerosol model of <i>M</i>. <i>avium</i> infection in BALB/c mice, we used five treatment groups as followed: Clarithromycin-Ethambutol-Rifampicin (CLR-EMB-RIF, standard of care, n = 15), CLR-EMB-MFQ (n = 15), CLR-EMB-(+)-EMQ (n = 15), CLR-EMB-(-)-EMQ (n = 15) and an untreated group (n = 25). To evaluate drug efficacy, we sacrificed each month over 3 months, 5 mice from each group. Lung homogenates were diluted and plated for colony forming unit count (CFU) expressed in Log10. At each time point, we found a significant difference between the untreated group and each of the treatment groups (p&lt;0.005). The (+)-EMQ-CLR-EMB group was the group with the lowest CFU count at each time point but never reached statistical significance. The results of each group 3 months after treatment are: (+)-EMQ-CLR-EMB (4.43 ± 0.26), RIF-CLR-EMB (4.83 ± 0.37), (-)-EMQ-CLR-EMB (4.82 ± 0.18), MFQ-CLR-EMB (4.70 ± 0.21). In conclusion, MFQ and its enantiomers appear to be as effective as rifampicin in combination therapy. Further studies are needed to evaluate the ability of these drugs to prevent selection of clarithromycin resistant strains and potential for lung sterilization.","author":"Antoine Froment","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"779d06986bdf5667cbdfd23a18931af3b49c37915daa58dd27c37041f38e79ff","category":"Interdisciplinary"}