{"title":"Viasat’s new broadband satellite could be a total loss","link":"https://arstechnica.com/?p=1954185","date":1689374976000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/vs3art-800x406.jpg\" alt=\"This artist's illustration of the ViaSat-3 Americas satellites shows the spacecraft as it would appear with its large reflector antenna fully deployed.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/vs3art.jpg\">Enlarge</a> <span>/</span> This artist's illustration of the ViaSat-3 Americas satellites shows the spacecraft as it would appear with its large reflector antenna fully deployed. (credit: <a href=\"https://www.viasat.com/space-innovation/satellite-fleet/viasat-3/\">Viasat</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A new Viasat communications satellite launched in April has been crippled by a problem when unfurling its huge mesh antenna. The problem jeopardizes Viasat’s much-needed refresh to its space-based Internet network that would let it better compete with newer broadband offerings from companies like SpaceX and OneWeb.</p>\n<p>Viasat confirmed the antenna problem Wednesday after it was <a href=\"https://www.spaceintelreport.com/viasat-3-satellite-suffers-major-antenna-anomaly-upending-viasat-inc-s-growth-plans-possible-420m-insurance-claim/\">first reported by Space Intel Report</a>. The satellite in question is named ViaSat-3 Americas, and it launched on April 30 as the primary payload on a SpaceX Falcon Heavy rocket from NASA’s Kennedy Space Center in Florida.</p>\n<p>The satellite is one of the most powerful commercial spacecraft ever built, with two solar array wings as wide as a Boeing 767 jetliner capable of generating more than 30 kilowatts of electricity. The solar panels deployed soon after the spacecraft arrived in orbit, and the next step was to unfurl a large reflector to bounce Internet signals between the ground and transmitters and receivers on board the main body of the satellite.</p></div><p><a href=\"https://arstechnica.com/?p=1954185#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1954185&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"779e78689002e17f02d156c4a0f56b976b90c17f9878f3580c26a61aae21a15d","category":"Tech"}