{"title":"First Marvel’s Midnight Suns gameplay footage: XCOM with cards looks rad","link":"https://arstechnica.com/?p=1791251","date":1630528237000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screenshot-8174-980x551.png\" /></div>\n        <p>\n          Flashy cinematic attacks in <em>Marvel's Rising Suns</em> certainly eclipse the kinds of attacks you can pull off in the same developer's <em>XCOM</em> games.                      [credit:\n                        <a href=\"https://www.marvel.com/\">Firaxis / 2K Games / Marvel</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>After getting a world-premiere CGI reveal last week, the new Firaxis strategy game <em>Marvel's Midnight Suns</em> received a full-blown gameplay premiere on Wednesday. Sure enough, it looks exactly like last week's promise of a superhero take on <em>XCOM</em>—yet the new, <a href=\"https://www.youtube.com/watch?v=77Sy3BHRw1w\">six-minute reveal</a> actually makes the upcoming game look like an intriguing twist on Firaxis' well-trod tactics territory.</p>\n<p><em>Midnight Suns</em> is slated to launch in March 2022 on PC and a wide variety of consoles, and it sees <a href=\"https://arstechnica.com/gaming/2016/02/xcom-2-review-best-in-class-tactical-battles-with-a-new-sense-of-style/\">the existing <em>XCOM</em> development team</a> inject deckbuilding and card-based abilities into turn-based, tactical combat. Every battle brings a brand-new Marvel superhero, dubbed The Hunter, into fisticuffs alongside two previously established Marvel superheroes, including members of the Avengers, X-Men, and other ensembles. Each squad member appears to get their own deck of cards, and your makeshift trio must then tap into supernatural powers and fight in <em>XCOM</em>-like combat. At the start of each turn, your fighters flip up six cards from their individual decks.</p>\n<p>When it's a character's turn, they can move around the battlefield up to a certain radius and play up to three cards, which include attacks, buffs for allies, and negative conditions for foes. Some of these emphasize positioning each hero on the battlefield in order to, say, hit a bunch of enemies in a straight line or dump an area-of-effect radius of pain onto a cluster of bad guys. One revealed attack went so far as to smash open a barrier at a cliff's edge, then knock a foe over that newly exposed gap. Each turn has an apparent three-card limit, but it's currently unclear whether that's three cards per hero or three cards for the entire squad during a turn. Either way, players must also mind a squad's \"heroism\" meter, as some supercharged cards expend that meter's points, as noted by an orange number on a card's top-left corner. \"Basic\" attacks and abilities do not use the meter.</p></div><p><a href=\"https://arstechnica.com/?p=1791251#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791251&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"77a448fc0b1aa4d56ca4daacdff8e293bd269056122d1ca0bb1271d48bdf4e5e","category":"Tech"}