{"title":"Google brings “Nearby Share” to Windows, making it easy to transfer files","link":"https://arstechnica.com/?p=1928628","date":1680550964000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/8-800x450.jpg\" alt=\"Google's Nearby Share can quickly send a photo to your computer. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/8.jpg\">Enlarge</a> <span>/</span> Google's Nearby Share can quickly send a photo to your computer.  (credit: Google)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google is bringing Android's \"Nearby Share\" feature to the desktop with a <a href=\"https://blog.google/products/android/nearby-share-windows/\">new Windows app</a>. Google says the new program will make sharing between Windows and Android easier, letting you send files over in just a few clicks and taps.</p>\n<p>Google's Nearby Share has been built into Android for a few years now and allows you to locally transfer files over Wi-Fi, with the initial device-pairing happening over Bluetooth. Nearby share has been kind of tough to use in real life, since most people share files over the Internet. And for personal use, most people only have one Android device, their phone, so there is nothing to share files with. A ton of Android users have Windows PCs, though, so for many this will be the first time Nearby Share has an actual use.</p>\n<p>Using the app is easy. Just download it from the <a href=\"https://android.com/better-together/nearby-share-app/\">Android website</a> and click a few \"next\" buttons in the installer. You need a 64-bit Windows PC (not ARM, ironically) with Bluetooth and Wi-Fi. From there you can easily share by dragging and dropping on Windows or by using the Android \"share\" button and hitting \"Nearby Share.\" You have the option of signing in to the Windows app or not. If you don't you'll need to manually approve every transaction on both the phone and PC. If you sign in, you can set up auto-accept from yourself, anyone in your contacts, or the probably not advisable \"everyone\" option.</p></div><p><a href=\"https://arstechnica.com/?p=1928628#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1928628&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"77b86c95357dbbfe343b35ef9f259fdb0c63282128fd250cc0bd5969e6e85be4","category":"Tech"}