{"title":"Fender bender in Arizona illustrates Waymo’s commercialization challenge","link":"https://arstechnica.com/?p=1754028","date":1617383270000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/GettyImages-1197936703-800x534.jpg\" alt=\"A Waymo self-driving car in Silicon Valley in 2019.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/GettyImages-1197936703.jpg\" class=\"enlarge-link\" data-height=\"3931\" data-width=\"5894\">Enlarge</a> <span class=\"sep\">/</span> A Waymo self-driving car in Silicon Valley in 2019. (credit: Sundry Photography / Getty)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A <a href=\"https://www.phoenixnewtimes.com/news/waymo-arizona-abrupt-stops-angry-residents-are-still-a-problem-11541896\">police report</a> obtained by the Phoenix New Times this week reveals a minor Waymo-related crash that occurred last October but hadn't been publicly reported until now. Here's how the New Times describes the incident:</p>\n<blockquote><p>A white Waymo minivan was traveling westbound in the middle of three westbound lanes on Chandler Boulevard, in autonomous mode, when it unexpectedly braked for no reason. A Waymo backup driver behind the wheel at the time told Chandler police that \"all of a sudden the vehicle began to stop and gave a code to the effect of 'stop recommended' and came to a sudden stop without warning.\"</p>\n<p>A red Chevrolet Silverado pickup behind the vehicle swerved to the right but clipped its back panel, causing minor damage. Nobody was hurt.</p></blockquote>\n<p>Overall, Waymo has a strong safety record. Waymo has racked up more than 20 million testing miles in Arizona, California, and other states. This is far more than any human being will drive in a lifetime. Waymo's vehicles have been involved in a relatively small number of crashes. These crashes have been overwhelmingly minor with no fatalities and few if any serious injuries. Waymo says that a large majority of those crashes have been the fault of the other driver. So it's very possible that Waymo's self-driving software is significantly safer than a human driver.</p>\n\n<p>At the same time, Waymo isn't acting like a company with a multi-year head start on potentially world-changing technology. Three years ago, Waymo announced plans to buy \"up to\" <a href=\"https://media.jaguarlandrover.com/en-us/news/2018/03/waymo-and-jaguar-land-rover-announce-long-term-partnership-beginning-self-driving-0\">20,000 electric Jaguars</a> and <a href=\"https://www.prnewswire.com/news-releases/fca-us-llc-expands-partnership-with-waymo-300657479.html\">62,000 Pacifica minivans</a> for its self-driving fleet. The company hasn't recently released numbers on its fleet size, but it's safe to say that the company is nowhere near hitting those numbers. The service territory for the Waymo One taxi service in suburban Phoenix hasn't expanded much since it launched two years ago.</p></div><p><a href=\"https://arstechnica.com/?p=1754028#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1754028&comments=1\">Comments</a></p>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"77cb926dd62fc39bfe6d6d8e69cb5cdc22bd9fa70536fbe504c6aec9446262bb","category":"Tech"}