{"title":"Everything New in iOS 15.2 Beta 2: Legacy Contacts, Hide My Email Improvements, and More","link":"https://www.macrumors.com/guide/ios-15-beta-2-features/","date":1636499870000,"content":"Apple today released the second beta of an upcoming iOS 15.2 update to developers for testing purposes, and the software update adds quite a few new features. This guide highlights everything new that we've found in the second iOS 15.2 beta.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/iOS-15.2-Everything-New-Feature-Green.jpg\" />\r\n<br />\r\n<h2>Legacy Contacts</h2>\r\n<br />\r\nWith Legacy Contacts, you can <a href=\"https://www.macrumors.com/2021/11/09/ios-15-2-legacy-contact/\">set a trusted person</a> to be able to access your <a href=\"https://www.macrumors.com/guide/apple-id/\">Apple ID</a> and your data (or \"Digital Legacy\") after you die. The person that you designate as your contact can access your photos, messages, notes, files, contacts, calendar events, apps, device backups, and more. <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a> Keychain passwords remain inaccessible, as does licensed media.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/legacy-contact-2.jpg\" />\r\n<br />\r\nThe Legacy Contact option can be accessed by opening up the Settings app, selecting \"Password &amp; Security,\" and choosing \"Legacy Contact\" from the list. From there, you can select a trusted person to access your account after you pass away.\r\n<br />\r\n\r\n<br />\r\n<h2>Find My Lost Item Scanning</h2>\r\n<br />\r\nIn the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> app, Apple has <a href=\"https://www.macrumors.com/2021/11/09/ios-15-2-airtag-scan/\">added a new option</a> for \"Items That Can Track Me.\" Tapping on this allows users to search for nearby items that might be used to track their location.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/apple-unknown-items-scan.jpg\" />\r\n<br />\r\nWhen activated, the Unknown Items feature scans for anything that's nearby, and will let users know either way if there's a device that belongs to someone else nearby. If an item is detected, Apple offers instructions on how to disable the device so that it can no longer be used for tracking purposes.\r\n<br />\r\n\r\n<br />\r\nThere's also a \"Help Return Lost Items\" option that also scans for nearby devices that might be lost, and it works similarly to the tracking scan. If a lost device is found, Apple provides instructions on how to find who it belongs to.\r\n<br />\r\n\r\n<br />\r\n<h2>iPadOS TV app</h2>\r\n<br />\r\nIn <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a>, Apple has introduced a new design for the TV app. The TV app features a sidebar, which makes navigation between the various sections of the TV app simpler.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/tv-app-design-ios-15-2.jpg\" />\r\n<br />\r\nIn iOS 15.2, there's a dedicated \"Store\" tab in the TV app for accessing movies and TV shows that can be purchased. The new design and the addition of a Store tab may help separate <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> content from paid content, as the existing design has been confusing for some users.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/tv-app-store-tab-ios-15-2.jpg\" />\r\n<br />\r\n<h2>Always-On Dark Mode for CarPlay Maps App</h2>\r\n<br />\r\nCode in iOS 15.2 suggests that there's a new option to turn <a href=\"https://www.macrumors.com/guide/ios-dark-mode/\">Dark Mode</a> on permanently for the <a href=\"https://www.macrumors.com/roundup/carplay/\">CarPlay</a> Maps app.\r\n<br />\r\n\r\n<br />\r\n<h2>Hide My Email in the Mail App</h2>\r\n<br />\r\nYou can use Hide My Email <a href=\"https://www.macrumors.com/2021/11/09/macos-monterey-12-1-beta-2-hide-my-email/\">directly from the Mail app</a> after installing the iOS 15.2 beta. When composing an email, just tap on the \"From\" field and select the \"Hide My Email\" option to generate a random email address.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/ios15-mail-privacy-feature.jpg\" />\r\n<br />\r\nHide My Email is available to everyone who has an ‌iCloud‌+ plan, and it's a useful feature for protecting your email address.\r\n<br />\r\n\r\n<br />\r\nAll the emails sent to the random Apple-created email address are forwarded to you so you can respond if needed, but the person on the receiving end does not see your real email address. And if you start getting spam emails from someone, you can just delete the email address and put a stop to it.\r\n<br />\r\n\r\n<br />\r\n<h2>Display Repair Restriction Changes</h2>\r\n<br />\r\nApple today told <em>The Verge</em> that it is <a href=\"https://www.macrumors.com/2021/11/09/apple-lifting-iphone-13-display-restrictions/\">introducing a software update</a> that will change an <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> policy that caused Face ID to be non-functional when repairs were made to a broken display. Apple has a microcontroller that pairs the ‌iPhone 13‌ to its display, and when performing a display repair, the microcontroller must be paired to the display using Apple's tools.\r\n<br />\r\n\r\n<br />\r\nIndependent repair shops do not have access to those tools, and they were upset about being unable to easily perform display repairs. Apple is removing the microcontroller pairing requirement that disabled Face ID for ‌iPhone 13‌ models with swapped displays, and code suggests that the change is in the iOS 15.2 beta.\r\n<br />\r\n\r\n<br />\r\n<h2>Communication Safety</h2>\r\n<br />\r\nWith the second beta of iOS 15.2, Apple is <a href=\"https://www.macrumors.com/2021/11/09/apple-messages-communication-safety-ios-15-2/\">enabling Communication Safety in Messages</a> for children. The feature is designed to scan incoming messages on children's devices for nudity, and it is opt-in and must be enabled by parents. It is limited to the accounts of children and is not the same as the CSAM functionality that Apple still has in development.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/communication-safety-1.jpg\" />\r\n<br />\r\n<h2>Bugs</h2>\r\n<br />\r\nApple says there are a few remaining bugs in the beta. Streaming in the Music app can cause higher CPU usage and faster battery drain, and users who import a verifiable vaccination record are not able to add it to the Wallet app at this time.\r\n<br />\r\n\r\n<br />\r\n<h2>Guide Feedback</h2>\r\n<br />\r\nSee a new feature in iOS 15.2 that's not listed here? Let us know in the comments.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/ios-15-beta-2-features/\">Everything New in iOS 15.2 Beta 2: Legacy Contacts, Hide My Email Improvements, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/everything-new-in-ios-15-2-beta-2-legacy-contacts-hide-my-email-improvements-and-more.2322639/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Kn1-hCJ93_k:kOEbg8G1FWQ:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=Kn1-hCJ93_k:kOEbg8G1FWQ:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"77cf4ea4447a3a870c69a5607f6b7b9ef4852191df707e2274a48d636065658b","category":"Apple"}