{"title":"Cattle and nurse trees shape subtropical forest–grassland ecotones","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14753?af=R","date":1723471490000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/41268bd7-e3c2-4480-a841-90549f9d448a/jpe14753-toc-0001-m.png\" alt=\"Cattle and nurse trees shape subtropical forest–grassland ecotones\" />\n<p>Tree cover can potentially expand on the subtropical South American grasslands. Reductions in cattle densities and increases in rainfall levels associated with climate change could facilitate forest expansion in this region.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSouth American subtropical landscapes are dominated by open grasslands and mosaics of forest–grassland formations. Forests are often restricted to riverine margins with sharp forest–grassland ecotones. Understanding the mechanisms maintaining forest–grassland ecotones is important to anticipate the effects of changing climate and disturbance regimes on the extent of these biomes and the ecosystem services they provide.\n\nWe used a combination of field surveys and long-term field experiments to explore the mechanisms that explain tree cover expansion at the ecotone of riverine forests and grasslands in central Uruguay, within the South American Campos. We assessed the role of tree seed dispersal and seedling establishment limitations, and experimentally tested for the effects of cattle, nurse tree cover and grasses on the recruitment of forest and grassland tree species at the forest–grassland ecotone.\n\nWe found that forest expansion depends on the interplay between cattle and nurse trees. <i>Vachellia caven</i> trees colonize the grassland successfully and facilitate the formation of forest patches by enhancing seed accumulation and seedling establishment of forest tree species. Surprisingly, grass cover had mostly positive effects on early seedling survival of forest tree seedlings. However, cattle limits tree seedling growth and survival, especially of forest tree species. This results in a nucleated vegetation pattern of tree patches that ultimately limits forest expansion.\n\n<i>Synthesis and applications</i>. Tree cover can potentially expand on the subtropical South American grasslands. Reductions in cattle densities and increases in rainfall levels associated with climate change could facilitate forest expansion in this region.\n</p>\n<h2>Resumen</h2>\n<p>\n\nLos paisajes subtropicales de América del Sur están cubiertos predominantemente por pastizales y diversos tipos de mosaicos de bosques y pastizales. Los bosques están frecuentemente restringidos a las orillas de los ríos formando ecotonos muy marcados con los pastizales abiertos. El entendimiento de los mecanismos que mantienen los ecotonos entre los bosques y los pastizales es importante para poder anticipar los efectos que cambios climáticos y en el régimen de perturbaciones pueden tener en la extensión de estos dos tipos de biomas y los servicios ecosistémicos asociados a ellos.\n\nNosotros usamos una combinación de muestreos y experimentos de campo a largo plazo para estudiar los mecanismos que explican el proceso de expansión de la cobertura arbórea en el ecotono de bosques ribereños y pastizales del centro de Uruguay, dentro de la bio-región Campos de América del Sur. Estudiamos los patrones de dispersión de semillas y de establecimiento de plántulas y evaluamos experimentalmente los efectos del ganado, la cobertura herbácea y los árboles nodriza en el establecimiento de especias arbóreas asociadas a los bosques y los pastizales en el ecotono del bosque-pastizal.\n\nEncontramos que la expansión del bosque depende de la interacción entre el ganado y los árboles nodriza. Los árboles de <i>Vachellia caven</i> colonizan el pastizal exitosamente y facilitan la formación de parches boscosos a través de la acumulación de semillas y del mejor establecimiento de juveniles de especies arbóreas asociadas al bosque bajo sus doseles. Curiosamente, la cobertura herbácea tiene efectos predominantemente positivos en la sobrevivencia de las plántulas de las especies arbóreas asociadas al bosque. En cambio, el ganado limita el crecimiento y sobrevivencia de las plántulas, especialmente de las especies arbóreas asociadas al bosque. Como consecuencia de estos efectos, el ecotono se caracteriza por un patrón nucleado de reclutamiento arbóreo formando parches boscosos que no logran expandir la cobertura del bosque.\n\n<i>Síntesis y aplicaciones.</i> La cobertura arbórea puede expandirse en los pastizales de América del Sur. La expansión de los bosques en esta región puede ser facilitada con disminuciones en las densidades del ganado y con aumentos en las precipitaciones asociadas al cambio climático.\n</p>","author":"Milena Holmgren, \nEdwin Bargeman, \nRafael Bernardi, \nAlice Blok, \nJasper Buijs, \nIvan Raniero Hernández‐Salmerón, \nRocío Martínez‐Cillero, \nNestor Mazzeo, \nBart Verdijck","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"77d4ac3bbb847410162af6c463ddb8737a928be3ac1216ec1b16c7f579cfb022","category":"Environment"}