{"title":"Apple announces sweeping EU App Store policy changes—including sideloading","link":"https://arstechnica.com/?p=1999064","date":1706215691000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/iPhone-15-lineup-800x443.jpeg\" alt=\"iPhone 15, iPhone 15 Plus, iPhone 15 Pro, and iPhone 15 Pro Max lined up on a table\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/iPhone-15-lineup-scaled.jpeg\">Enlarge</a> <span>/</span> The iPhone 15 lineup. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>To comply with European Union regulations, Apple has introduced sweeping changes that make iOS and Apple's other operating systems more open. The changes are far-reaching and touch many parts of the user experience on the iPhone. They'll be coming as part of iOS 17.4 in March.</p>\n<p>Apple will introduce \"new APIs and tools that enable developers to offer their iOS apps for download from alternative app marketplaces,\" as well as a new framework and set of APIs that allow third parties to set up and manage those stores—essentially new forms of apps that can download other apps without going through the App Store. That includes the ability to manage updates for other developers' apps that are distributed through the marketplaces.</p>\n<p>The company will also offer APIs and a new framework for third-party web browsers to use browser engines other than Safari's WebKit. Until now, browsers like Chrome and Firefox were still built on top of Apple's tech. They essentially were mobile Safari, but with bookmarks and other features tied to alternative desktop browsers.</p></div><p><a href=\"https://arstechnica.com/?p=1999064#p3\">Read 27 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1999064&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"77dcaaa62657e718c86b807ee425c342ddc3d4c3bc51acdc8edba56a11878f9d","category":"Tech"}