{"title":"Non-canonical bases differentially represented in the sex chromosomes of the dioecious plant Silene latifolia","link":"https://academic.oup.com/jxb/article/75/13/3849/7656699?rss=1","date":1713830400000,"content":"<span><div>Abstract</div>The oxidation of 5-methylcytosine (5mC) to 5-hydroxymethylcytosine (5hmC), 5-formylcytosine (5fC), and 5-carboxylcytosine (5caC), known as oxi-mCs, garners significant interest in plants as potential epigenetic marks. While research in mammals has established a role in cell reprogramming, carcinogenesis, and gene regulation, their functions in plants remain unclear. In rice, 5hmC has been associated with transposable elements (TEs) and heterochromatin. This study utilizes <span>Silene latifolia</span>, a dioecious plant with heteromorphic sex chromosomes and a genome with a large proportion of TEs, which provides a favourable environment for the study of oxi-mCs in individual sexes. Notably, we detected surprisingly high levels of oxi-mCs in <span>S. latifolia</span> comparable with mammals. Nuclei showed enrichment in heterochromatic regions, except for 5hmC whose signal was homogeneously distributed. Intriguingly, the same X chromosome in females displayed overall enrichment of 5hmC and 5fC compared with its counterpart. This fact is shared with 5mC, resembling dosage compensation. Co-localization showed higher correlation between 5mC and 5fC than with 5hmC, indicating no potential relationship between 5hmC and 5fC. Additionally, the promoter of several sex-linked genes and sex-biased TEs clustered in a clear sex-dependent way. Together, these findings unveil a hypothetical role for oxi-mCs in <span>S. latifolia</span> sex chromosome development, warranting further exploration.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"77f7b9ae521b96a8e435633eb4c2faffc551e71e9f70a60f8afa871b80ccaa12","category":"Environment"}