{"title":"Optimizing the mass marking of fish with alizarin red S: an example with glass eels","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15643?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>Fish marking is an essential tool for fisheries management, especially for evaluating the stocking of endangered fish species to support conservation and sustainable use of fish stocks. Batch marking of young European eels <i>Anguilla anguilla</i> (L.) prior to stocking is recommended as the benefits of stocking for the spawning stock can be evaluated by recapturing marked fish over time, therefore mass marking of young eels with substances such as alizarin red S (ARS) is becoming increasingly important. To improve the marking method and reduce marking costs when immersing glass eels in an ARS solution, eight laboratory experiments under varying conditions (e.g., temperature, ARS concentration, immersion time, osmotic induction, fish density) and with ARS from different suppliers were carried out. The results show that optimal marking of glass eels can be carried out in the field or during transport by putting approximately 50 g of glass eels per liter in 150 mg L<sup>−1</sup> ARS solution for 3 h at 10–15°C. Lower concentrations did not result in reliable marking. Water temperatures of 5°C and below can have a stunning effect on the eels and increase mortality significantly, regardless of the concentration of ARS. Glass eel densities below 50 g L<sup>−1</sup> in the marking bath increase marking costs unnecessarily, while a higher density of 100 g L<sup>−1</sup> resulted in significantly higher mortality and lower marking success. A somewhat more difficult but less expensive alternative is to bathe the fish in a saline solution of 1% (10 PSU) of 80 mg L<sup>−1</sup> ARS for 3 h at 10°C. Costs can also be significantly reduced by choice of supplier for ARS, but care should be taken as the quality of the powder appears to vary (mean percentage of sufficiently marked eels ranged from 59% to 91% among suppliers in the present study) and can lead to marking failure. The optimal marking conditions can help ensure that stocked glass eels can be reliably identified in future studies to assess stocking benefits while reducing costs.</p>","author":"Janek Simon","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"77f88d76cc7fc7deefe19ecdd2acce29e971a656772ff2ce223d20f61bb47042","category":"Environment"}