{"title":"An Upcycled Dietary Fiber Rich in Bioactives from Hemp Hulls Supports Digestive Comfort in Healthy Adults: Results from a Randomized, Placebo-Controlled Trial","link":"https://www.preprints.org/manuscript/202409.0094/v1","date":1725267236000,"content":"Background: Dietary fiber is a key component of a health-promoting diet, and it is acknowledged as a short-fall nutrient in most Western diets. Some sources of dietary fiber, such as hemp hull fiber, also include inherent small molecule bioactives that further promote health and well-being. While dietary fiber is a key component that supports digestive health, it also can cause digestive discomfort. Digestive symptoms such as gas, bloating, belly pain, and the resulting decrease in digestive quality of life are common among adults. The aim of this study was to evaluate changes in digestive comfort, in individuals who currently experience digestive discomfort, after consuming either a proprietary dietary fiber supplement from hemp hull, a dietary fiber supplement made from inulin, or a digestible control (maltodextrin). Methods: This study was a completely virtual, double-blind, placebo-controlled, randomized clinical trial of healthy adults. The parallel arm study tested two fiber supplements at a practical dose yielding a “Good Source of Fiber” based on United States Dietary Reference Intakes (2.8 grams of fiber per day) for six weeks. Results Five hundred seventy nine randomized participants provided follow-up outcomes data. Digestion-associated quality of life questionnaire, belly pain, and gas and bloating scores were assessed and found to be superior after hemp hull fiber intake compared to inulin intake at multiple time points in a post-hoc analysis (p&amp;lt;0.05). Conclusion This study demonstrated that a practical dose of bioactive-rich fiber from hemp hull is well-tolerated, provides superior digestive comfort relative to both placebo and inulin fiber, and can aid in reaching total fiber intake goals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"780b78cd70e7f07e906ad71b795d27060407a1caf56c7948044fe38adb828352","category":"Interdisciplinary"}