{"title":"Long‐term studies on West Antarctic Peninsula phytoplankton blooms suggest range shifts between temperate and polar species","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17238?af=R","date":1710745200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c29f01bc-855e-4d6f-8782-2800b7fdc01e/gcb17238-toc-0001-m.png\" alt=\"Long-term studies on West Antarctic Peninsula phytoplankton blooms suggest range shifts between temperate and polar species\" />\n<p>Global warming significantly impacts the Western Antarctic Peninsula. In 30 years of studying phytoplankton in Potter Cove (King George Island, South Shetlands), we observed a shift. From the 1990s to 2009, low biomass and sporadic blooms with large diatoms prevailed. However, between 2010 and 2020, a marked rise in intense blooms, dominated by a newly recorded small diatom species, indicated a noteworthy change. This presence hints at substantial shifts in plankton communities due to warming, potentially affecting the Antarctic food web.</p>\n<br />\n<h2>Abstract</h2>\n<p>The Western Antarctic Peninsula (WAP) experiences one of the highest rates of sea surface warming globally, leading to potential changes in biological communities. Long-term phytoplankton monitoring in Potter Cove (PC, King George Island, South Shetlands) from the 1990s to 2009 revealed consistently low biomass values, and sporadic blooms dominated by cold-water microplankton diatoms. However, a significant change occurred between 2010 and 2020, marked by a notable increase in intense phytoplankton blooms in the region. During this period, the presence of a nanoplankton diatom, <i>Shionodiscus gaarderae,</i> was documented for the first time. In some instances, this species even dominated the blooms. <i>S. gaarderae</i> is recognized for producing blooms in temperate waters in both hemispheres. However, its blooming in the northern Southern Ocean may suggest either a recent introduction or a range shift associated with rising temperatures in the WAP, a phenomenon previously observed in experimental studies. The presence of <i>S. gaarderae</i> could be viewed as a warning sign of significant changes already underway in the northern WAP plankton communities. This includes the potential replacement of microplankton diatoms by smaller nanoplankton species. This study, based on observations along the past decade, and compared to the previous 20 years, could have far-reaching implications for the structure of the Antarctic food web.</p>","author":"Julieta S. Antoni, \nGastón O. Almandoz, \nJesica Goldsmit, \nMaximiliano D. Garcia, \nXimena Flores‐Melo, \nMarcelo P. Hernando, \nIrene R. Schloss","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"780ca129f71c0797c5399cb1f12b6eb8933631797bc534e82fb17fc2501e328c","category":"Environment"}