{"title":"ผู้กำกับเกม Dragon’s Dogma 2 เชื่อว่าเกมมีจุด Fast Travel น้อยจะทำให้ผู้เล่นสนุกกับเกมได้อย่างเต็มที่","link":"https://www.blognone.com/node/137818","date":1706012085000,"content":"<div><div><div><p>Hideaki Itsuno ผู้กำกับเกม <a href=\"https://www.blognone.com/node/134023\">Dragon's Dogma 2</a> ให้สัมภาษณ์กับ IGN เกี่ยวกับระบบ Fast Travel ในเกมว่าทีมพัฒนาต้องการให้ผู้เล่นได้สัมผัสกับโลกของเกมอย่างเต็มที่ จึงจำกัดจุด Fast Travel ให้มีน้อยที่สุด</p>\n<p>Itsuno เข้าใจว่าเกมเมอร์บางคนอาจคิดว่าการเดินทางแบบไม่ Fast Travel น่าเบื่อ แต่เขาเชื่อว่าการเดินทางไม่ได้น่าเบื่อ แต่เป็นเกมนั้นตังหากที่น่าเบื่อ ทางแก้คือทำยังไงก็ได้ให้การเดินทางในเกมมันสนุก</p>\n<p>นั่นเป็นเหตุผลว่าทำไมทีมงานต้องวางองค์ประกอบของเกมไว้ในตำแหน่งที่เหมาะสม เช่น การทำให้ศัตรูเกิดแบบสุ่มเพื่อสร้างประสบการณ์ที่แตกต่างกันทุกครั้งที่เจอ หรือการบีบให้ผู้เล่นเข้าสู่สถานการณ์ที่มองไม่เห็นว่าข้างหน้า 10 เมตรว่าปลอดภัยหรือไม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3b97915594fb04cd966dd5ecb0c4372b.jpg\" /></p>\n<p>ในเกม Dragon's Dogma 2 มี Fast Travel อยู่ 2 แบบ แต่ละแบบจะมีข้อจำกัดเพื่อป้องกันไม่ให้ผู้เล่นพึ่งพาระบบนี้มากเกินไปดังนี้</p>\n<ul>\n<li><strong>Port Crystals</strong> ผู้เล่นสามารถวาร์ปไปยัง Port Crystals ที่วางไว้ทั่วแผนที่ได้แต่ต้องใช้ไอเทมหายากอย่าง Ferrystone</li>\n<li><strong>Oxcarts</strong> รถเกวียนที่เคลื่อนที่ด้วยวัวขนาดยักษ์สำหรับ Fast Travel ตามเส้นทางเฉพาะ แต่ระหว่างทางอาจถูกศัตรูซุ่มโจมตีได้</li>\n</ul>\n<p>Itsuno ยกตัวอย่างสถานการณ์ที่อาจเกิดขึ้นว่าระหว่างที่กำลังนั่งรถเกวียนว่าอาจมีก๊อบลินขวางทาง ทำให้ต้องลงไปสู้ และระหว่างสู้ กริฟฟินตัวหนึ่งอาจโฉบลงมาแล้วทำลายรถทั้งคันด้วยโจมตีเดียว บังคับให้ผู้เล่นต้องเดินเท้าต่อและสาปส่งกริฟฟินตัวนั้นไปตลอดทาง</p>\n<p>ระยะหลังมานี้ระบบ Fast Travel ถูกวิจารณ์ในวงกว้างว่าทำให้เกมเต็มไปด้วยฉากโหลด บางเกมจึงเลือกปรับเปลี่ยนฟีเจอร์นี้ หรือไม่ก็ตัดออกไปเลย ซึ่งตัว Itsuno เองก็ชอบระบบ Fast Travel เพราะมันสะดวกดี แต่ตัวเขาเชื่อว่าการจำกัดจุด Fast Travel ในเกม Dragon’s Dogma เป็นการตัดสินใจที่ถูกต้อง และเชื่อว่าจะทำให้ผู้เล่นเข้าถึงเกมได้อย่างเต็มรูปแบบ</p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/dragons-dogma-2-director-explains-why-less-fast-travel-can-be-a-good-thing\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/dragons-dogma\">Dragon's Dogma</a></div><div><a href=\"/topics/capcom\">Capcom</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7817ffc49a2a70d879193012c55c838197d10a98b5b95b102d9722b5fe77a0ce","category":"Thai"}