{"title":"Amazonian avian biogeography: Broadscale patterns, microevolutionary processes, and habitat-specific models revealed by multidisciplinary approaches","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukad051/7450124?rss=1","date":1700784000000,"content":"<span><div>Abstract</div>Our understanding of Amazonian biogeography is quickly increasing, catalyzed by the growing use of genomic datasets, improved knowledge of species distributions, and the accumulation of new data on the geological and climatic history of the region. The high number of species in Amazonia and their intricate patterns of geographic distribution triggered the development of many diversification hypotheses that shaped historical biogeography as a discipline. Here, we present a historical overview of avian biogeographic studies in Amazonia, their recent advances, outstanding questions, and future directions. We focus on how new approaches have led to novel understandings of the distribution patterns and diversification processes that underpin avian diversity. We show how genomic tools are being used to establish new hypotheses about the drivers of diversification and highlight the importance of recent studies of birds in previously overlooked environments, such as floodplains and open vegetation enclaves. We emphasize the importance of gene flow, species traits, and habitat affinities in studying diversification processes to fully acknowledge the complexity of Amazonian ecosystems and their history. We then discuss the current gaps in Amazonian taxonomic and biogeographic knowledge, with a focus on the issues that we believe hinder our understanding of the field. Amazonia has been facing increasing levels of forest loss due to agricultural expansion, infrastructure development, mining, climate change, and illegal activities catalyzed by weak governance. To halt biodiversity loss, it is crucial to increase our knowledge of the natural history and biogeography of Amazonian species. We suggest increasing incentives for research and training at institutions based in the region, as well as the establishment of partnerships with governments, local communities, NGOs, and international institutions to bring diverse communities together to address crucial questions.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"7817dedee704a931cde06be3854ecca9fe1ddecd20b6ca7902d6378bce24d19c","category":"Environment"}