{"title":"LINE BK มีผู้ใช้งานกว่า 3.4 ล้านราย ชี้ปัจจัยหนุนคือโควิด สินเชื่อดิจิทัลได้รับความสนใจ","link":"https://www.blognone.com/node/125501","date":1635318736000,"content":"<div><div><div><p>LINE BK บริการการเงินบน LINE ก่อตั้งโดยบริษัท Kasikorn LINE ประกาศตัวเลขผู้ใช้งานในโอกาสครบรอบ 1 ปี มีผู้ใช้งานกว่า 3.4 ล้านรายแล้ว โดย นายธนา โพธิกำจร ประธานเจ้าหน้าที่บริหาร Kasikorn LINE ระบุว่าปัจจัยหนุนคือ สถานการณ์โควิด ร้านค้า ร้านอาหารเปิดให้บริการเฉพาะช่องทางออนไลน์ เป็นโอกาสให้ผู้บริโภคได้ลองเปิดใจใช้บริการ LINE BK โดยเฉพาะบริการวงเงินให้ยืม สินเชื่อดิจิทัลใน LINE ที่ได้รับความสนใจจากลูกค้าเป็นอย่างมาก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/76043a9614c2d44ec955a196122ec48c.png\" /></p>\n<p>LINE BK ให้ภาพรวมตัวเลขผู้ใช้บนบริการหลักทั้งสี่ ดังนี้</p>\n<ul>\n<li>บัญชีเงินฝาก 4 ล้านบัญชี มีธุรกรรมโอนเงินมูลค่ารวมกว่า 82,000 ล้านบาท พร้อมทั้งได้ช่วยแจ้งเตือนข้อมูลทางการเงินของลูกค้าผ่านบริการ LINE BK Alerts ไปแล้วกว่า 1 พันล้านครั้ง</li>\n<li>บัญชีเงินออมดอกพิเศษ 1 แสนบัญชี เป็นบริการออมเงินที่ผู้ออมจะได้รับดอกเบี้ยพิเศษ 1.5% ต่อปีเมื่อฝากเงินครบ 12 เดือน หรือ 1.0% ต่อปีเมื่อฝากเงินครบ 6 เดือน</li>\n<li>บัตรเดบิต 1.8 ล้านบัตร ส่วนใหญ่เป็นบัตรประเภทออนไลน์ หมวดหมู่ที่ลูกค้าใช้จ่ายด้วยบัตรเดบิต LINE BK มากที่สุด ได้แก่ อันดับ 1 อาหารและเครื่องดื่ม อันดับ 2 การผูกบัญชีกับ Wallet อันดับ 3 การซื้อสินค้าบนอีคอมเมิร์ซ</li>\n<li>บริการวงเงินให้ยืมกว่า 437,000 บัญชี มียอดปล่อยสินเชื่อไปแล้วกว่า 21,000 ล้านบาท นอกจากนี้ยังพบด้วยว่าสัดส่วนเกือบครึ่งหนึ่งของลูกค้า LINE BK เป็นกลุ่มอาชีพอิสระและอยู่ในพื้นที่ต่างจังหวัดเกือบ 80%</li>\n</ul>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/line-bk\">LINE BK</a></div><div><a href=\"/topics/internet-banking\">Internet Banking</a></div><div><a href=\"/topics/line\">LINE</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7824475db142b9449fd3fe0046823cef1c0ffeed899df1ae3cca52e44ee29df7","category":"Thai"}