{"title":"It’s not enough to trust science on vaccines—others have to as well","link":"https://arstechnica.com/?p=1765440","date":1621267414000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1298099633-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1298099633.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/concentrated-woman-doctor-vaccinating-a-young-woman-royalty-free-image/1298099633?adppopup=true\">Luis Alvarez</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Before the COVID-19 pandemic, it was possible to believe that the US public's skepticism of scientific information had some limits. Once a crisis hit a critical point—when things became a matter of life and death—people would come around, the thinking went.</p>\n<p>Obviously, that hasn't been the case. The US public's skepticism toward science is extending toward one of its most important developments: vaccines. The COVID-19 vaccines offer both the prospect of a return to normal life and limits on the risk of dangerous coronavirus variants evolving—but only if enough people are vaccinated. And that \"but\" is looming larger as states are having to experiment with various inducements to get more people to take the vaccine.</p>\n<p>Given this situation, any data that helps us understand why people might be hesitant to get vaccinated could be valuable. Some researchers have now found a hint that trust in science is more complicated than an individual belief. The societal consensus on trust in science matters, too.</p></div><p><a href=\"https://arstechnica.com/?p=1765440#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765440&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7826a1cd9dbf88542287178c62c307574d6823a73af0f3e7186f9a395489c60f","category":"Tech"}