{"title":"The Effects of Storage in Vegetable Oil on the Proximate Composition and Microbiological Quality of Hot Smoked South African Black Mussels (Choromytilus meridionalis) for Small-Scale Operations","link":"https://www.preprints.org/manuscript/202406.2032/v1","date":1719575961000,"content":"Commercial production of Choromytilus meridionalis (black mussel) and Mytilus galloprovincialis (Mediterranean mussel) contributes to half of the South African marine aquaculture production per year. However, limited ready-to-eat black mussel products are available. The aim of this preliminary study was to investigate the effects of storage (15 days at room temperature) on the total viable counts (TVC), coliforms, proximate composition, and fat oxidation (TBARS) of a small-scale kitchen-based ready-to-eat hot smoked black mussel product preserved with vegetable oil. Three batches of black mussel meat were smoked at 80ºC for 15 minutes. Half of each batch were packaged in sterile glass jars with heated (50ºC) vegetable oil and half without oil. Microbiological analyses were done at days 1, 3, 9 and 15. Proximate composition was determined at day 1 and TBARS at days 1 and 15. Coliforms for all samples throughout the storage period were undetected. TVC plates for mussels stored without oil had no growth at days 1 to 5, however, reached TVC &gt; 5 log10.g-1 at day 15. TVC for mussels with oil increased from 0 at day 1 to &gt; 5 log10.g-1 at day 3 and remained at counts &gt; 5 log10.g-1. There was no significant difference (P &gt; 0.05) in moisture, protein, and ash for mussels stored with oil and those without oil, while significant differences (P &lt; 0.001) in total fat and carbohydrates (10.27 ± 2.10% and 6.80 ± 2.22% with oil, and 5.05 ± 1.49% and 10.59 ± 3.00% without oil) were detected. These differences were due to the presence of additional fats from the vegetable oil. TBARS at day 15 showed no significant difference (P &gt; 0.05) between mussels stored with oil and those without oil. There were no significant differences in TBARS from day 1 to 15 for both oil and without oil. Small-scale kitchen-based smoked black mussels preserved without vegetable oil could be stored for up to 9 days at room temperature.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"782e37667f556d105b8c2f0be00657645039c870c6a8167baae8e2a4c3d45cfe","category":"Interdisciplinary"}