{"title":"Structural Evolution of the Pharmaceutical Peptide Octreotide upon Controlled Relative Humidity and Temperature Variation","link":"https://www.preprints.org/manuscript/202404.0875/v1","date":1713173672000,"content":"Abstract\tOctreotide is the first synthetic peptide hormone, consisted of eight amino acids, that mimics the activity of somatostatin, a natural hormone in the body. During the past decades, advanced instrumentation and crystallographic software established X-ray Powder Diffraction (XRPD) as a valuable tool for extracting structural information of biological macromolecules. The latter was demonstrated by the successful structural determination of octreotide at a remarkably high d-spacing resolution (1.87 Å) (PDB code: 6vc1). This study focuses on the response of octreotide to different humidity levels and temperatures, with a particular focus on the stability of the polycrystalline sample. XRPD measurements were accomplished employing an Anton Paar MHC-trans humidity-temperature chamber installed within a laboratory X’Pert Pro diffractometer (Malvern Panalytical). The chamber is employed to control and maintain precise humidity and temperature levels of samples during XRPD data collection. Pawley analysis of the collected data sets revealed that the octreotide polycrystalline sample is remarkably stable and no structural transitions were observed. The compound retains its orthorhombic symmetry (space group: P212121, a = 18.57744(4) Å, b = 30.17338(6) Å, c = 39.70590(9) Å, d~ 2.35 Å). However, a characteristic structural evolution in terms of lattice parameters and volume of the unit-cell is reported mainly upon controlled relative humidity variation. In addition, an improvement of signal-to-noise ratio in the XRPD data under a cycle of dehydration/rehydration is reported. These results underline the importance of considering the impact of environmental factors, as humidity and temperature, in the context of structure-based drug design, thereby contributing to the development of more effective and stable pharmaceutical products.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"78348b2a72d1b4bccb61d5a0d7d04167efabaa6f9aa6529b16accd3e80699e58","category":"Interdisciplinary"}