{"title":"HighSight โซลูชันโดรนบินอัตโนมัติพร้อมระบบ AI จาก Skyller","link":"https://www.blognone.com/node/125954","date":1637638200000,"content":"<div><div><div><p>ในช่วงไม่กี่ปีที่ผ่านมานี้ หลายอุตสาหกรรมเริ่มสนใจนำเทคโนโลยีโดรน หรือ อากาศยานไร้คนขับ เข้ามาประยุกต์ใช้ในเชิงพาณิชย์ ทั้งกับการตรวจสอบโครงสร้างพื้นฐานในงานอุตสาหกรรม ตรวจสอบแผงโซลาร์ ไปจนถึงการติดตามสถานะของการก่อสร้างว่าเป็นไปตามแผนหรือไม่</p>\n<p>แม้เทคโนโลยีโดรนจะเป็นเทคโนโลยีทันสมัย ทั้งช่วยทุ่นเวลา ลดต้นทุน และลดความเสี่ยงในการทำงานของบุคลากร                         แต่ปัจจุบันเทคโนโลยีนี้ก็ยังมีข้อจำกัดสำคัญหลายประการ เพราะการบินโดรนโดยใช้คนบังคับ มีความซับซ้อนสูง ผู้บังคับต้องบังคับโดรนให้อยู่ในระดับการมองเห็นของสายตา (visual line of sight) ตลอดเวลา ต้องใช้บุคลากรที่มีประสบการณ์ และหลายครั้งเป็นการทำงานเดิมๆ เป็นกิจวัตรและใช้เวลานาน</p>\n<p>Skyller หนึ่งในกลุ่มธุรกิจของบริษัท AI and Robotics Venture (ARV) Venture Builder ของบริษัทลูก ปตท. สผ. (PTTEP) ผู้ให้บริการงานตรวจสอบโครงสร้างพื้นฐานและงานอุตสาหกรรมด้วยโดรนและแพลตฟอร์ม AI มองเห็นศักยภาพของโดรนในการผสานการทำงานร่วมกับระบบ AI และ Machine Learning นำไปสู่การพัฒนา HighSight Solution เทคโนโลยีอากาศยานไร้คนขับ หรือโดรนในกล่อง (drone in a box) ที่สามารถทำงานขับเคลื่อนตัวเองด้วยระบบอัตโนมัติ หรือแบบ Beyond Visual line of sight: BVLOS โดยไม่จำเป็นต้องมีนักบินควบคุมอยู่ในระยะการทำงาน สามารถสั่งการควบคุม ตั้งโปรแกรมทำงาน และดูผลการวิเคราะห์ข้อมูลด้วยระบบ AI ผ่านแพลตฟอร์มของ Skyller ได้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6db6d76a662f1242673fde91ff6eca6c.jpg\" /></p>\n<p>โซลูชัน HighSight เกิดจากการผสานรวมของเทคโนโลยีระหว่างโดรนในกล่อง (drone in a box) ที่ชื่อว่า Horrus กล่องใส่โดรนและระบบที่สามารถชาร์จและส่งต่อข้อมูลกับโดรนโดยบริษัท ARV ที่เพิ่งจะเปิดตัวในช่วงกลางเดือนพฤศจิกายนที่ผ่านมานี้เอง โดยนำมาใช้งานร่วมกับแพลตฟอร์มของ Skyller ที่สามารถเชื่อมต่อข้อมูลกับ Horrus ในการตั้งค่าการทำงาน รับส่งข้อมูล รวมถึงนำข้อมูลมาวิเคราะห์ต่อด้วยระบบ AI ที่เป็นจุดแข็งของ Skyller จึงเกิดเป็นโซลูชันสำหรับการตรวจสอบและเก็บข้อมูลอัตโนมัติ พร้อมการวิเคราะห์และรายงานผลอย่างชาญฉลาด</p>\n<p>HighSight ถูกสร้างขึ้นมาเพื่อแก้ปัญหาในปัจจุบันของการใช้โดรนเพื่อการพาณิชย์ คือ เมื่อมีความต้องการในการใช้งานสูงขึ้น จึงเริ่มเกิดการขาดแคลนบุคลากรที่มีประสบการณ์ และความเชี่ยวชาญในการบินโดรน โดยเฉพาะงานตรวจสอบอุตสาหกรรมและโครงสร้างพื้นฐานที่ต้องอาศัยความเชี่ยวชาญสูง เพราะ การจะเป็นนักบินโดรนมืออาชีพได้ ต้องใช้เวลาในการเรียนรู้และฝึกซ้อมมาก รวมถึงมีค่าใช้จ่ายและค่าแรงที่สูง</p>\n<p>นอกจากนี้แม้นักบินโดรนจะเก่งแค่ไหน แต่ก็ไม่สามารถบังคับโดรนต่อเนื่องได้เป็นระยะเวลาหลายชั่วโมง หรือทำงานที่เป็นกิจวัตรซ้ำไปซ้ำมาได้ทั้งวัน เพราะนักบินจะได้รับผลกระทบจากความเหนื่อยล้า ทำให้การบินโดรนมีสมรรถภาพลดลงเมื่อผ่านไปเป็นเวลานาน แถมยังมีความเสี่ยงในการปฏิบัติหน้าที่ของนักบินโดรน ที่ต้องเดินทางไปมาหลายร้อยกิโลระหว่างพื้นที่ที่ห่างไกลด้วย โซลูชัน HighSight จึงจะเปลี่ยนแปลงวิธีการตรวจสอบและเฝ้าระวังให้ง่าย สะดวก และประหยัดมากขึ้น</p>\n<p>โดรนในกล่อง (drone in a box) หรือ Horrus ประกอบด้วย ตัวกล่อง ทำหน้าที่เป็นทั้งที่เก็บโดรน จุดชาร์จแบตเตอรี่ อัพโหลดข้อมูล อีกทั้งยังสามารถตรวจสอบองค์ประกอบและประสิทธิภาพของตัวโดรนในตัว ซึ่งภายในจะมีโดรนที่ออกแบบมาเป็นพิเศษอยู่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/aad2d1ebba358f66ad1a5668182b7b9d.png\" /></p>\n<p>ตัวโดรนเป็นแบบ 4 ใบพัด มีกล้องตรวจจับสิ่งกีดขวางรอบตัว ทำให้บินได้อย่างปลอดภัยและโฟกัสเป้าหมายได้แบบไม่คลาดสายตา สามารถทำการบินสำรวจและเก็บข้อมูลแบบอัตโนมัติได้ต่อเนื่องประมาณ 30 นาที ระยะทำการประมาณ 6 กิโลเมตร</p>\n<p>โดรนยังสามารถปรับเปลี่ยนเครื่องมือ/อุปกรณ์ ที่แตกต่างกันได้ตามภารกิจที่ได้รับมอบหมาย  และทำงานร่วมกับแพลตฟอร์มของ Skyller เพื่อให้ผู้ใช้งานสามารถวางแผนเส้นทางการบินได้จากระยะไกล (Teleoperation) โดย Skyller ได้พัฒนาแพลตฟอร์มทีมีระบบ AI และ ML ในการช่วยวิเคราะห์ข้อมูล สรุปผลข้อมูล แจ้งเตือนเมื่อพบสิ่งผิดปกติ และรายงานผล เพื่อให้ผู้ใช้งานสามารถติดตามข้อมูลแบบ Real Time ได้ผ่านแพลตฟอร์ม โดยไม่จำเป็นต้องเดินทางไปที่หน้างานที่อาจะเป็นพื้นที่ห่างไกล เช่น แท่นขุดเจาะน้ำมันกลางทะเล หรือพื้นที่ขนาดใหญ่ เช่น คลังสินค้า ไซต์ก่อสร้างขนาดใหญ่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b8fc75afab3403e55b269b2db7c34d49.png\" /></p>\n<p>หลังจากปฏิบัติภารกิจเสร็จ โดรนจะสามารถบินกลับมาที่ศูนย์ควบคุมภาคพื้นดินได้เองโดยอัตโนมัติ เพื่อชาร์จพลังงาน ประมวลผล อัพโหลดภาพถ่าย หรือวิดีโอและข้อมูลต่างๆเข้าสู่ระบบ ผู้ใช้งานสามารถดูข้อมูลได้ผ่านแพลตฟอร์ม Skyller  หรือจะตั้งค่าให้โดรนถ่ายทอดภาพสัญญาณสดแบบเรียลไทม์ก็สามารถทำได้เช่นกัน</p>\n<p>โซลูชัน HighSight สามารถปรับใช้งานได้กับการทำงานหลายรูปแบบในหลากหลายอุตสาหกรรม โดยเน้นไปที่การทำงานแบบเป็นกิจวัตร และการทำงานที่อันตรายเพื่อลดความเสี่ยงของบุคลากรทั้งผู้ตรวจสอบ และนักบินโดรน เช่น</p>\n<p>⦁ บินสำรวจเพื่อติดตามความก้าวหน้าของโครงการก่อสร้าง (Construction Progress Monitoring) เพื่อตรวจเช็คความถูกต้องของการก่อสร้างเทียบกับแบบพิมพ์เขียว</p>\n<p>⦁ การบินสำรวจเพื่อตรวจสอบปริมาตรวัสดุก่อสร้างได้อย่างแม่นยำ (Stockpile Volume Estimation) เช่น ปริมาณ กองทราย หิน ดิน และอื่นๆ ในบริเวณไซต์สิ่งปลูกสร้าง โดยสามารถเก็บสถิติขนาดของกองวัสดุในแต่ละวันเพื่อเปรียบเทียบและวางแผนการใช้งานได้</p>\n<p>⦁ การบินล่าตระเวนเป็นประจำของพื้นที่ที่กำหนดไว้ (Security &amp; Routine Surveillance) เพื่อสำรวจความปลอดภัย โดยตัวโดรนจะมีระบบตรวจจับวัตถุต้องสงสัยและการบุกรุก สามารถสำรวจพื้นที่อาจก่อให้เกิดอันตรายและส่งสัญญาณผ่านแพลตฟอร์ม ไปยังหน่วยงานที่ให้ความช่วยในแต่ละพื้นที่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/923bea4eae9d621433d4a3e75e4ad9c1.png\" /></p>\n<p>ซึ่งจากกรณีตัวอย่างการใช้งานดังกล่าว นอกจาก HighSight จะช่วยแก้ปัญหาด้านบุคลากรที่ต้องทำการบินโดรนแล้ว ยังช่วยให้อุตสาหกรรมต่างๆ เพิ่มประสิทธิภาพ ความแม่นยำ ประหยัดเวลาและค่าใช้จ่ายในการทำงาน อีกทั้งยังช่วยลดความเสี่ยงของผู้ปฏิบัติงาน และเพิ่มความปลอดภัยในการตรวจสอบได้อย่างมาก</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b58be4eaaa996476d62ca7bba8077718.png\" /></p>\n<p>HighSight เตรียมเปิดผู้ที่สนใจสามารถเข้าชมและทดสอบการใช้งานจริงได้ในช่วงไตรมาสแรกของปี 2565 ที่เขตส่งเสริมเมืองอัจฉริยะ ศูนย์วิจัยพัฒนาเทคโนโลยีและนวัตกรรม ปตท.สผ. (PTTEP Technology and Innovation Centre: PTIC) ในพื้นที่วังจันทร์วัลเลย์ จังหวัดระยอง ซึ่งเป็นสถานที่สำหรับฝึกฝน และทดสอบการบินโดรน และเป็นพื้นที่ผ่อนปรนกฎระเบียบที่ใช้ในการบิน (Regulatory Sandbox) เพื่อตอบโจทย์สำหรับการพัฒนาการบินอัตโนมัติได้อย่างมีศักยภาพสูงสุด และสนับสนุนงานสำรวจให้ครอบคลุมมากที่สุด ผู้สนใจสามารถติดต่อ Skyller เพื่อทำการสาธิตผ่านระบบออนไลน์ และยินดีร่วมหารือแนวทางความเป็นไปได้ (Proof of concept) ในการปรับใช้เทคโนโลยีให้ตอบโจทย์ปัญหาและความต้องการของผู้ใช้งาน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6d310c9f21940a566975e6f5cf709290.png\" /></p>\n<p>ในขั้นต้น Horrus จะทำหน้าที่ในการสำรวจความปลอดภัย รอบๆ แนวรั้วของพื้นที่ศูนย์วิจัยพัฒนาเทคโนโลยีและนวัตกรรม ปตท.สผ. (PTIC) ซึ่งเป็นหนึ่งในพื้นที่เขตส่งเสริมเมืองอัจฉริยะ และเป็นโปรเจกต์ที่ ARV และ Skyller ร่วมมือ เพื่อพัฒนานวัตกรรมให้สอดคล้องกับนโยบาย Smart City เพื่อนำมาปรับใช้ในการวางแผนและการดำเนินธุรกิจ</p>\n<p>โดยหวังว่าจะสามารถใช้ประโยชน์จากเทคโนโลยีและนวัตกรรมที่มีอยู่มาช่วยเพิ่มประสิทธิภาพของการให้บริการและพัฒนา       เมืองน่าอยู่ ทันสมัย และการใช้ทรัพยากรได้อย่างมีประสิทธิภาพมากที่สุด ไปพร้อมกับการพัฒนาสังคมยั่งยืน และส่งเสริมคุณภาพชีวิตของคนไทยให้ดียิ่งขึ้นในอนาคต</p>\n<p>หากสนใจสามารถอ่านรายละเอียดเพิ่มเติม และติดต่อได้ที่ <a href=\"https://bit.ly/3Cpovga\">https://bit.ly/3Cpovga</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/arv\">ARV</a></div><div><a href=\"/topics/skyller\">Skyller</a></div><div><a href=\"/topics/robotics\">Robotics</a></div><div><a href=\"/topics/drone\">Drone</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7834816914b171c8a475b373ea322e256e924b171cc98ad2e42a3262f03b5b95","category":"Thai"}