{"title":"Allied Cycle Works launches GRAX: chain lube optimised for gravel","link":"https://cyclingtips.com/2021/05/allied-cycle-works-launches-grax-chain-lube-optimised-for-gravel/","date":1620133202000,"content":"<p>I can’t say I saw this one coming. The American boutique carbon frame maker, Allied Cycle Works, has jumped into the chain lube game with a wax-based drip product. And better yet, the lube is being marketed as one ideally suited to gravel riding and racing. The golden ages of gravel bikes and chain lube have come together. What a time to be alive. </p>\n\n\n\n<p>Named Grax (short for “gravel wax”), the drip chain lube was designed and tested by Dr. Samuel Beckford, a postdoctoral fellow at the Nano Mechanics and Tribology lab at the University of Arkansas. Meanwhile, Allied Cycle Works’ racer <a href=\"https://cyclingtips.com/2020/04/colin-strickland-king-of-kanza/\" target=\"_blank\">Colin Strickland</a> was the real-world tester for the product and its development iterations. And like many new chain lubes of today, Grax comes with a number of lofty claims. </p>\n\n\n\n<p>Designed for use in dirt and slop, Grax is said to be a “novel hydrophobic lubricant” that repels water and mud more efficiently than any other chain lubricant. The claimed outcome is superior durability and efficiency no matter the conditions, and the company is claiming to best the likes of Squirt, Absolute Black and CeramicSpeed. I’ll return to these claims that I have an issue with. </p>\n\n\n\n<p>According to Allied, Grax will last up to 350 miles (560 km) between applications, while extreme conditions (rain and mud) will see that figure reduce to 100 miles (160 km). </p>\n\n\n\n<p>Like every other wax-based lube, Grax won’t work well if there’s pre-existing oil or grease on the chain and therefore a chain stripped to bare metal will lead to best results. It makes sense then that the company is also launching Grax-Off, a non-toxic, biodegradable degreaser to help with initial setup and ongoing upkeep. </p>\n\n\n\n<p>Grax will also be offering pre-treated chain packages, where the initial strip clean of the stubborn factory chain grease is done for you. It’s worth noting that these aren’t race-treated hot-melt wax chains sold by CeramicSpeed, Molten Speed Wax, Zero Friction Cycling and Silca, but rather just thoroughly degreased and drip-lubed chains that are ready to install. Grax’s simpler preparation is certainly indicated in the pricing. </p>\n\n\n\n<p>That pricing is pretty fair across the board. A 4 oz (118 ml) bottle of Grax and the 16 oz (473 ml) bottle of Grax-Off are US$20 each. And from US$75 you get a pre-treated chain along with a bottle of both Grax and Grax-Off. That starting package price is for a SRAM Force AXS chain, however you’ll pay more for other more premium chain options. For example, a Dura-Ace HG901 package is US$93, while an XTR 12-speed chain package is US$109. Not bad. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Silca-pre-waxed-chain-bundle-1-1-1340x754.jpg\" /><figcaption>Grax’s pre-treated chain bundles are a vastly different sales proposition compared to <a href=\"https://cyclingtips.com/2021/04/silcas-pre-waxed-diamond-polished-chains/\" target=\"_blank\">Silca’s new diamond-polished wax chain</a>s.  </figcaption></figure>\n\n\n\n<h2>Those claims </h2>\n\n\n\n<p>Ok, so the self-proclaimed title of the <a href=\"https://cyclingtips.com/2018/03/fast-chain-lube-that-saves-you-money/\" target=\"_blank\">world’s best chain lube</a> is nothing new. In just the past 18 months we’ve heard it from Absolute Black, <a href=\"https://cyclingtips.com/2020/04/silcas-new-super-secret-chain-lube-is-like-hot-melt-wax-in-a-bottle/\" target=\"_blank\">Silca</a>, <a href=\"https://cyclingtips.com/2020/11/ceramicspeeds-new-ufo-drip-lube-is-slicker-longer-lasting-and-far-cheaper/\" target=\"_blank\">CeramicSpeed</a>, and countless others. And there is a common theme amongst all of these new “best” lubes: they’re wax-based, just like Grax. </p>\n\n\n\n<p>Grax has arrived on the market with a <a href=\"https://alliedcycleworks.com/blogs/stories/drivetrain-lubrication-white-paper\" target=\"_blank\">supporting white paper</a> that details the testing procedure used and how Grax just edges out Squirt as the next best-tested lube. Grax’s testing also claims to smash SRAM’s factory-applied chain lube – not at all a high bar to clear and a similar story to that we’ve heard countless times from FrictionFacts, Zero Friction Cycling and others. </p>\n\n\n\n<p>That testing procedure has some sound and proven principles, but it appears to fall into the same trap that <a href=\"https://www.bicycleretailer.com/sites/default/files/downloads/article/The-Importance-of-Using-an-Endurance-Machine.pdf\" target=\"_blank\">Muc-Off fell into a few years back</a>. The reasons for this go deep down a nerdy rabbit hole, but basically, the “full tension test” (FTT) used doesn’t fully replicate how a chain – as part of a multi-speed drivetrain – performs in the real world. This leads to results that don’t align with other published tests, including the <a href=\"https://cyclingtips.com/2018/03/fast-chain-lube-that-saves-you-money/\" target=\"_blank\">extensive wear testing that Adam Kerin of Zero Friction Cycling</a> has been doing over the past few years.  </p>\n\n\n\n<p>To help explain why I question Grax’s test findings I dug deep into my email archives for old correspondence with Jason Smith of <a href=\"https://cyclingtips.com/tag/friction-facts/\" target=\"_blank\">FrictionFacts</a> (now owned by CeramicSpeed), one of the pioneers of bicycle chain efficiency testing. </p>\n\n\n\n<p>“One drawback with the full tension tester is that it does not allow the chain to relax,” Smith explained. “By relaxing, it’s meant that on a traditional drivetrain the top span is under very high tension, then as the chain snakes through the lower spans and articulates back and forth through the pulley wheels it’s under a much lower tension.</p>\n\n\n\n<p>“The lower tension in combination with the reverse articulation allows the links to relax against each other to some extent. What’s been discovered is that some lubricants, particularly solid waxes, need relaxing to refresh the lubricant track as the chain goes through those bottom spans.</p>\n\n\n\n<p>“For practical purposes, when testing, the full tension tester shouldn’t be run for more than a minute or two to capture data. Otherwise the FTT won’t allow the chain to relax and the lubricant to refresh.”</p>\n\n\n\n<p>Smith added that the chain should be moved to an endurance-based machine (that replicates a derailleur-equipped drivetrain) between brief full tension test intervals. Smith also noted significant accuracy issues as a result of heat with running such a machine over an extended period of time.  </p>\n\n\n\n<p>Allied’s white paper for Grax suggests that a FTT machine was used to perform a continuous three-hour test.</p>\n\n\n\n<h2>Probably still a good lube </h2>\n\n\n\n<p>Ok, so I don’t trust the findings of Allied’s supported lab test and I’m still waiting on answers to a few specific questions, but that’s not to say this will be a bad product. I honestly believe this well-priced product will likely perform at least decently well in both trusted controlled tests and the great outdoors.</p>\n\n\n\n<p>The reality is that the likes of Squirt and Smoove have proven that wax lubricant is often the best choice for long dirt-based rides. And in more recent times, the likes of Silca, Absolute Black and CeramicSpeed have since refined the recipe. And so Grax hasn’t needed to reinvent the wheel here, but rather just add a little further water repellency and hopefully ensure the lube still penetrates into the chain link (a common limitation with some wax-based lubes).</p>\n\n\n\n<p>If they’ve done that, then I’m sure they’ve created a good-performing lube that won’t just be suitable for gravel use. </p>\n\n\n\n<p>You can find more information about Grax at <a href=\"https://alliedcycleworks.com/collections/grax\" target=\"_blank\">alliedcycleworks.com</a>. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/allied-cycle-works-launches-grax-chain-lube-optimised-for-gravel/\">Allied Cycle Works launches GRAX: chain lube optimised for gravel</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"78344e896fdde74dbe21070c1d4c43df6d025429c1db32a165b960d4aa6571ed","category":"Cycling"}