{"title":"Apple Working on Under-Display Touch ID, Could Debut in First All-Screen iPhone","link":"https://www.macrumors.com/2023/03/09/apple-researching-under-screen-touch-id/","date":1678365797000,"content":"Apple is continuing to research under-screen fingerprint sensor technology for an iPhone with a view to re-introducing Touch ID in its first full-screen model, according to a new rumor.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Touch-ID-Fingerprint-Sensor-Under-Display-Feature-2.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nEver since Face ID debuted in 2017's iPhone X, Apple's roadmap for Touch ID on iPhones has been murky at best, with some industry observers suggesting that Apple considers Face ID an exclusive all-in-one biometric solution going forward. \r<br />\n\r<br />\nIt's no secret that Apple has been working on a Touch ID system designed to be set under the display since at least 2013, with several patents awarded to the company over the years. However, despite claims that under-screen Touch ID on a future iPhone is unlikely, Apple has, if anything, intensified its research in under-screen fingerprint sensing technology. \r<br />\n\r<br />\nJust this week, Apple was <a href=\"https://www.patentlyapple.com/2023/03/apple-wins-a-touch-id-under-display-patent-focused-on-an-optical-imaging-system-that-operates-in-the-shortwave-infrared-ban.html\">granted a patent</a> relating to under-screen Touch ID that combines shortwave infrared technology with an optical imaging system that could have multiple functions. Not only does the latest embodiment aim to read the user's fingerprint when it touches the display, it could also determine vein pattern, blood oxygenation, pulse, and the presence of gloves and wetness.\r<br />\n\r<br />\nDespite this, recent predictions as to when under-screen Touch ID might be introduced, if at all, have been pushed back. In a September 2021 research note, Kuo had predicted that Apple would launch at least one new iPhone model with an under-screen fingerprint scanner <a href=\"https://www.macrumors.com/2021/09/20/kuo-iphones-with-under-screen-touch-id-now-coming-in-2023-foldable-iphone-in-2024/\">in the second half of 2023</a>. But seven months later, Kuo said Apple was <a href=\"https://www.macrumors.com/2022/03/30/kuo-no-iphone-with-under-screen-touch-id/\">unlikely</a> to release any iPhone models with under-screen Touch ID in 2023 or 2024.\r<br />\n\r<br />\nApple did test an under-screen fingerprint scanner for at least some iPhone 13 models, according to <a href=\"https://www.macrumors.com/2021/01/29/iphone-13-in-display-fingerprint-sensor-optical/\">trusted</a> <a href=\"https://www.macrumors.com/2021/08/23/iphone-13-no-touch-id-under-display/\">reports</a>, but Apple apparently decided not to move forward with the idea.\r<br />\n\r<br />\nIn the latest development, according to <a href=\"https://m.blog.naver.com/PostView.naver?blogId=yeux1122&amp;logNo=223038747724&amp;navType=by\">news aggregator account \"yeux1122\"</a> on the Korean Naver blog, industry sources now believe that Apple will debut under-screen Touch ID in the two to three years following the debut of under-panel Face ID.\r<br />\n\r<br />\nJudging by the pace of development of under-panel technology <a href=\"https://www.macrumors.com/2022/05/10/all-iphone-15-models-pill-and-hole-rumor/\">as outlined in industry consultant Ross Young's roadmap</a>, this suggests we could see a new under-screen version of Touch ID in a 2026 iPhone at the earliest, possibly in the same year that Apple is expected to move both Face ID and the front-facing camera under the display.\r<br />\n\r<br />\nOf course, we cannot be certain that Apple will ever put Touch ID under iPhone screens. There also remains a possibility that Apple instead introduces an iPhone with Touch ID built into the power button, in line with the latest iPad Air and iPad mini models, but there haven't been any rumors to suggest that Apple plans to go down that avenue.<div>Tags: <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a>, <a href=\"https://www.macrumors.com/guide/naver/\">Naver</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/09/apple-researching-under-screen-touch-id/\">Apple Working on Under-Display Touch ID, Could Debut in First All-Screen iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-working-on-under-display-touch-id-could-debut-in-first-all-screen-iphone.2383210/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7838652a0f32b0a4c6a6c415314613ca0ec0eb1a50523d6ef29ca6","category":"Apple"}