{"title":"The Seeds Combining Pyrrolidine Controlling the Framework Al Distribution of FER Zeolites to Enhance Its Performance in the Skeletal Isomerization of n-Butene","link":"https://www.preprints.org/manuscript/202409.0175/v1","date":1725349759000,"content":"FER zeolites has a unique framework structure and acid distribution, and is widely studied as a catalyst for reactions such as n-butene skeletal isomerization and dimethyl ether carbonylation. The BAS located in the 10-MR of FER zeolites serves as the active site for the isomerization reaction of n-butene skeletal to produce isobutene. In contrast, the acid site found in the 8-MR is prone to side reactions, such as polymerization and cracking, which can adversely affect the selectivity of isobutene. This study prepared five types of FER zeolites using different method, inducing Na-form or H-form crystal seeds without organic structure directing agents (OSDAS), using pyridine alone as a template, and combining the seeds with pyridine. The differences in the structure and acid distribution of the five zeolites were investigated, as well as their catalytic performance for the the skeletal isomerization of n-Butene. Experiments and characterization results showed that under hydrothermal synthesis conditions, the FER-PY+SH zeolites synthesized by using both H-form zeolites seeds and pyridine exhibited the highest aluminum concentrations at T1 and T3 positions, along with the greatest BAS of 10-MR. This unique composition contributed to the highest selectivity of isobutene. The FER-PY+SH catalyst was continuously used for 720 hours at 350 ℃, 0.1 MPa, and n-butene mass space velocity of 2.0 h-1 for three recycles on 2160 h. During this period, the conversion of n-butene over 39%, while the selectivity of isobutene exceeded 95%.The catalyst exhibited excellent stability and activity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7838f9c6b8c63e6beb8d0643d9a2f0852db75c290dd10af8dc130ede4a09c7a6","category":"Interdisciplinary"}