{"title":"Root endophyte-mediated alteration in plant H2O2 homeostasis regulates symbiosis outcome and reshapes the rhizosphere microbiota","link":"https://academic.oup.com/jxb/article/75/10/3153/7613331?rss=1","date":1708646400000,"content":"<span><div>Abstract</div>Endophytic symbioses between plants and fungi are a dominant feature of many terrestrial ecosystems, yet little is known about the signaling that defines these symbiotic associations. Hydrogen peroxide (H<sub>2</sub>O<sub>2</sub>) is recognized as a key signal mediating the plant adaptive response to both biotic and abiotic stresses. However, the role of H<sub>2</sub>O<sub>2</sub> in plant–fungal symbiosis remains elusive. Using a combination of physiological analysis, plant and fungal deletion mutants, and comparative transcriptomics, we reported that various environmental conditions differentially affect the interaction between Arabidopsis and the root endophyte <span>Phomopsis liquidambaris</span>, and link this process to alterations in H<sub>2</sub>O<sub>2</sub> levels and H<sub>2</sub>O<sub>2</sub> fluxes across root tips. We found that enhanced H<sub>2</sub>O<sub>2</sub> efflux leading to a moderate increase in H<sub>2</sub>O<sub>2</sub> levels at the plant–fungal interface is required for maintaining plant–fungal symbiosis. Disturbance of plant H<sub>2</sub>O<sub>2</sub> homeostasis compromises the symbiotic ability of plant roots. Moreover, the fungus-regulated H<sub>2</sub>O<sub>2</sub> dynamics modulate the rhizosphere microbiome by selectively enriching for the phylum Cyanobacteria, with strong antioxidant defenses. Our results demonstrated that the regulation of H<sub>2</sub>O<sub>2</sub> dynamics at the plant–fungal interface affects the symbiotic outcome in response to external conditions and highlight the importance of the root endophyte in reshaping the rhizosphere microbiota.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"783be65029fe2ee6f30f37c0ae27b561b25e7d3eb1396a5e5479ba7351ebf5d4","category":"Environment"}