{"title":"Ichthyological Biodiversity and the Fish Value Chain in the Fishing Basins of Bamingui, Bangoran, Koukourou and Nd&eacute;l&eacute;, Partly in the Protected Area Zones of the Central African Republic (CAR)","link":"https://www.preprints.org/manuscript/202407.2471/v1","date":1722387862000,"content":"The 4 headwaters of the Chari fishery basin in the Central African Republic (CAR), Bamingui, Bangoran, Koukourou and N’délé (BBKN), contain a significant ichtyological fauna, although it remains little studied. The species of freshwater fish of the national parks of Bamingui Bangoran and Manovo Gounda St Floris have not been identified in depth. Fish is rich in animal protein and is very popular in the local and national markets. Its exploitation creates jobs for the populations living around BBKN’s fishery basins. Artisanal freshwater fishing contributes to the reduction of poverty of the BBKN population through the revenue it generates. The analysis of biodiversity consisted of identifying the species of fish captured by fishermen and the functional analysis consisted of mapping the key players in the fish value chain, characterizing fishing techniques and doing a social, environmental and economic study of the fish value chain. 250 stakeholders were directly surveyed. The results reveal the advantages for the actors, with a net monthly income of 1334$ for retailers, 1112$ for wholesalers, 889$ for fishmongers, 667$ for restaurateurs, 445$ for carriers and 223$ for fishermen. 18 families of fish including 43 species have been identified. The fish are artisanally caught. Fishing is done in two seasons: the favorable season (February to May) and less favorable season (November to January). The catches by effort units (CPUE) are 17 kg/day, or 510 kg/month and 4 kg/day, or 120 kg/month in the less favorable period. As the value chain is not sustainable, it is important to examine its sustainability","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7843ceeb81b1a4e06e52c96812ae634de1c2c28d4dedf5bd55cc81568c66a563","category":"Interdisciplinary"}