{"title":"17 Effect of branched-chain amino acids on lactating sow and piglet performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/64/7664927?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Sows (n = 360 PIC 1050 and Genesus) were used to investigate the effect of various branched-chain amino acid (BCAA) levels on sow lactation and litter growth performance. Upon entering the farrowing room, sows were blocked by parity group (P0, P2, P3+) and randomly assigned to one of six dietary treatments containing various levels of BCAA. Experimental diets were formulated to various standardized ileal digestible (SID) leucine, isoleucine, and valine levels by replacing cornstarch with L-leucine, L-isoleucine, and L-valine. Levels of the BCAA were expressed as ratios to SID lysine and were formulated at 114 or 180 for Leu, 56 or 64 for Ile, and 64 or 120 for Val. Diets were formulated to be isocaloric (3.23 Mcal ME/kg) and met or exceeded all other NRC (2012) essential amino acid and vitamin and mineral recommendations. Sow body weight (BW), backfat, and body condition score were recorded at the time of entry into the farrowing room and at the time of weaning. Piglet litter weights were recorded after cross-fostering and at weaning to determine litter growth rate. Data were analyzed using generalized linear mixed models with fixed effects of dietary treatment and parity group and a random effect of lactation group. The models were fit using R version 4.3.1 (R Core Team, 2023). The sow and her litter were the experimental unit, and results were considered significant if <span>P</span> ≤ 0.05 and a tendency if 0.05 &lt; <span>P</span> ≤ 0.10. Sows nursed piglets for 21.3 d (<span>P</span> = 0.998). The mean parity by treatment ranged from 3.8 to 3.9 (<span>P</span> = 0.999). After farrowing, the mean estimated sow BW was 219 kg, with a range between treatments of 216 to 221 kg (<span>P</span> = 0.651). On average, sows gained 2.82% of their BW (<span>P</span> = 0.696) with an average daily feed intake (ADFI) of 8.75 kg/d (<span>P</span> = 0.932). However, as expected, sow Leu, Ile, Val, and total BCAA intakes were different across treatments (<span>P</span> ≤ 0.001). Sows entered the farrowing house with an average of 11.50 mm of backfat (<span>P</span> = 0.919) and lost 6.04% backfat through lactation (<span>P</span> = 0.667). Sows started the trial with an average of 14.1 piglets/sow (<span>P</span> = 0.967) and weaned 12.6 piglets per sow (<span>P</span> = 0.981) with a piglet average daily gain of 0.22 kg/d (<span>P</span> = 0.193) and a daily litter growth rate of 2.89 kg/d (<span>P</span> = 0.291). In conclusion, there was no evidence of an effect of the various leucine, isoleucine, and valine levels evaluated in this study on lactating sow and piglet performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"78484e4a89e1925dd64cb81bad82c5c27db39dbd7b3c667211d5bc75cbbc7a79","category":"Environment"}