{"title":"Effects of turmeric, ginger, cinnamon, and garlic essential oils on HSP70, NFκB, oxidative DNA damage, inflammatory cytokines, and oxidative markers in broiler chickens","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae127/7738270?rss=1","date":1724198400000,"content":"<span><div>Abstract</div>In recent years, the use of natural bioactive compounds derived from spices has garnered significant interest in poultry production due to their potential to modulate immune responses and oxidative stress. An investigation into the roles of spices essential oils (EO) on inflammatory cytokines, HSP70 and oxidative markers of broiler chickens was conducted in this study. Four spices consisting of garlic, ginger, turmeric, and cinnamon were processed to obtain their respective EO. Two hundred 1-d-old arbo acre broilers were allotted to 5 treatments consisting of B1 (control), B2 (garlic EO), B3 (ginger EO), B4 (Turmeric EO), and B5 (cinnamon EO), with EOs administered to drinking water at 30% (v/v) in a 49-d trial. Blood was sampled for assessment of hematological parameters, and serum obtained were assayed for inflammatory cytokines, antioxidant activities, nuclear factor kappa B (NFκB), 8-hydroxydeoxyguanosine (8-OHdG), and heat shock protein 70 (HSP70) levels using standard procedures. Results obtained revealed that cinnamon EO enhanced erythrocytic indices, leukocyte profile, catalase, glutathione peroxidase and interleukin 10, lowers interleukin 1 beta (IL-1β) and interferon gamma (IFN-γ), enhanced HSP70 and higher 8-OHdG levels in chicken. Garlic EO enhanced monocytes and superoxide dismutase, while reduced IFN-γ and HSP70, but increased IL-1β and tumor necrosis factor alpha (TNF-α) <strong>NFκB</strong> in broiler chickens. Ginger EO also enhanced erythrocytic indices, total antioxidant activity, lowered IFN-γ and lipid peroxidation, while turmeric EO enhanced total antioxidant activity, catalase and lowered IFN-γ and increased 8ohdg in broiler chickens. In conclusion, this study revealed that ginger and turmeric EO were more beneficial in preventing oxidative DNA damage, cinnamon EO enhanced serum oxidative status and lowered pro-inflammatory cytokines, while garlic EO reduced HSP70 in broiler chickens.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"7852a0513966754772be631dc87ebc7b8c286146a0494127c2da648bb4c2c6d4","category":"Environment"}