{"title":"Beats Partners With Major League Soccer on New Marketing Campaign","link":"https://www.macrumors.com/2024/02/19/beats-major-league-soccer-partnership/","date":1708367992000,"content":"Apple's partnership with <a href=\"https://www.mlssoccer.com\">Major League Soccer (MLS)</a> is expanding with a new agreement that will see Apple's Beats brand become the official consumer audio products partner of MLS. As part of the partnership, Beats will produce exclusive custom headphones for eight MLS clubs, with additional clubs to follow.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/beats-mls-custom.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe eight clubs that will initially receive custom Beats headphones include Atlanta United, Columbus Crew, Inter Miami, LAFC, Nashville SC, NYCFC, St. Louis City SC, and Toronto FC, and MLS players will be featured in Beats marketing campaigns through both Beats and MLS.<blockquote>\"For more than a decade, Beats headphones have been chosen by the world's top athletes to help them get game ready and heighten their focus, while also allowing them to show off their style and personality,\" said Chris Thorne, Beats' CMO. \"We are extremely excited to join forces with the MLS, one of the fastest growing and most dynamic sports leagues in the world. Beats will be working closely with the MLS clubs and top players to deliver amazing experiences throughout the upcoming season.\"</blockquote>The announcement comes just a few days ahead of the new MLS season which will see <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> once again serving as the worldwide home for MLS streaming with <a href=\"https://tv.apple.com/us/channel/tvs.sbd.7000\">MLS Season Pass</a>. MLS Season Pass is available in over 100 countries, with pricing in the U.S. set at $14.99 per month or $99 for the full season. <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> subscribers receive a discounted price of $12.99 per month or $79 for the full season.<div>Tag: <a href=\"https://www.macrumors.com/guide/beats/\">Beats</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/19/beats-major-league-soccer-partnership/\">Beats Partners With Major League Soccer on New Marketing Campaign</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/beats-partners-with-major-league-soccer-on-new-marketing-campaign.2419869/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7852d8d51796d5a30aac4accbc063bd5cd47ba7e5f514f4f074057fc2f5e0a3b","category":"Apple"}