{"title":"Diversity of Mycorrhizal Types Along Altitudinal Gradients in the Tropical Andes","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13923?af=R","date":1728717613000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Mycorrhizal fungi play key roles in the functioning of terrestrial ecosystems. The main types of mycorrhizal associations are arbuscular mycorrhizae, ectomycorrhizae, ericoid mycorrhizae and orchid mycorrhizae. Previous studies have shown that the abundance of plants with different types of mycorrhizal associations change gradually along latitudinal and altitudinal gradients driven by the effects of climate and soil nutrients. We aimed to understand how altitude and climatic and soil variables shape the distribution patterns of tropical plant mycorrhizal types and nitrogen-fixing plants along altitudinal gradients in the Andes.</p>\n<h2>Location</h2>\n<p>Colombian Andean mountain range.</p>\n<h2>Time Period</h2>\n<p>Present day.</p>\n<h2>Major Taxa Studied</h2>\n<p>Plants (vascular and non-vascular).</p>\n<h2>Methods</h2>\n<p>We used a herbarium plant records database and assigned mycorrhizal type to each plant species based on the available literature. Bioclimatic and soil variables were also compiled at a resolution of 10 km. We calculated the proportion of each mycorrhizal association type per grid cell and created a diversity index to explore their spatial distribution and association with abiotic factors based on LMs.</p>\n<h2>Results</h2>\n<p>The diversity of mycorrhizal associations increased with altitude and peaked around 3000 m, in an ecotone belt known as the subpáramo recognised by the high abundance of Ericaceae species. Soil carbon stock and soil total nitrogen were also positively correlated with the diversity of mycorrhizal types. Moreover, the abundance of arbuscular mycorrhizal plants was highest at low elevations and increased with the proportion of nitrogen-fixing plants per cell.</p>\n<h2>Main Conclusions</h2>\n<p>Our results indicate that mycorrhizal associations gradually change along altitudinal gradients in the tropical Andes. Climatic factors and the interactions between climatic and edaphic factors have the greatest explanatory power to predict the distribution of types of mycorrhizal associations along the altitudinal gradient. Based on these results we expect that climate change could potentially alter the distribution of mycorrhizal types in tropical mountains with unknown consequences for ecosystem functions.</p>","author":"Miguel Ángel Rendón Espinosa, \nMarius Bottin, \nAdriana Sanchez, \nCarlos Vargas, \nLauren Raz, \nAdriana Corrales","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"785493ddc644a33edd2df0acf7a0b9792b88e0f6dcdd5ccc8f05db967f3a81d3","category":"Environment"}