{"title":"As coronavirus variants spread, the US struggles to keep up","link":"https://arstechnica.com/?p=1743898","date":1613826031000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/researchers-classroom-mask-800x533.jpg\" alt=\"As coronavirus variants spread, the US struggles to keep up\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/researchers-classroom-mask.jpg\" class=\"enlarge-link\" data-height=\"1600\" data-width=\"2400\">Enlarge</a> (credit: Bing Guan | Bloomberg | Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Across the US, the coronavirus is in retreat. The pandemic is still raging, mind you, with more than 70,000 new cases still reported each day. But since the post-holiday peak in mid-January, the seven-day average of new cases has fallen <a href=\"https://abcnews.go.com/US/covid-19-cases-hospitalizations-continue-massive-drop-january/story?id=75896236\">by nearly 64 percent</a>. Hospitalizations have plunged too. And with <a href=\"https://www.latimes.com/politics/story/2021-02-17/biden-administration-claims-progress-in-covid-19-vaccination-drive\">vaccinations accelerating</a>, there is a glimmer of hope that this downward trend might be the start of Covid’s long slide toward containment, at least in the US and other wealthy countries that are <a href=\"https://www.wired.co.uk/article/coronavirus-vaccine-distribution\">hogging the shots</a>.</p>\n<p>But retreat does not always mean defeat. And <a href=\"https://www.wired.com/story/worrisome-new-coronavirus-strains-are-emerging-why-now/\">the emergence of several worrisome new coronavirus variants</a> with new tricks for spreading faster or evading immune responses presents another possibility: that the current reprieve will only be temporary. Public health experts are urging governments to prepare for a possible new wave of infections driven by variants like B.1.1.7, which has already been identified in more than 1,200 US cases and in nearly every state, <a href=\"https://www.cdc.gov/coronavirus/2019-ncov/transmission/variant-cases.html\">according to data</a> from the US Centers for Disease Prevention and Control.</p>\n<p>That’s more than double the number reported two weeks earlier. But the real number is likely far higher. How much higher? No one knows. That’s because the only way to tell which version of the coronavirus is causing an infection <a href=\"https://www.wired.com/story/microbe-mappers-are-tracking-covid-19s-invisible-traces/\">is to sequence its genome</a>. In this country, that should be easy enough—the US is a sequencing superpower. It has dozens of academic institutions and massive commercial labs with the capacity to crank out genomes at a rapid clip. But the federal government’s response through much of the pandemic didn’t include a plan to mobilize America’s DNA-mappers into a coordinated coronavirus-monitoring corps. SARS-CoV-2 surveillance, well, sucked.</p></div><p><a href=\"https://arstechnica.com/?p=1743898#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1743898&comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"78575ad784bfecca4dfda17dd8555dc29fc19245b34a0c3f80519636d9fd109d","category":"Tech"}