{"title":"No evidence of adaptive tolerance of parasitism in a cavity-nesting brood parasite host","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae058/7723735?rss=1","date":1722297600000,"content":"<span><div>Abstract</div>Acceptance of avian brood parasitism by hosts is one of the most enigmatic aspects of brood parasite–host coevolution. The most common explanation for acceptance of parasitism by hosts of the brown-headed cowbird (<span>Molothrus ater</span>) is evolutionary lag, which suggests that hosts have not had enough time to evolve defenses against parasitism. Alternatively, acceptance may be the optimal strategy when the costs of rejecting parasitism exceed the benefits. The lack of nest site hypothesis applies to secondary cavity-nesting birds that cannot excavate their own nests and predicts that hosts accept parasitism instead of deserting a parasitized nest when there are no vacant nest sites available in which to renest. I tested this hypothesis using the prothonotary warbler (<span>Pronotaria citrea</span>), a commonly parasitized, cavity-nesting cowbird host. I used a paired nest box design and predicted that if hosts accept parasitism because of a lack of alternative nest sites, they should desert parasitized nests and renest in the vacant nest box on their territory. I recorded 37 cases where a nest was parasitized and warblers only deserted 2 parasitized nest boxes for a vacant nest box. Both desertions were attributable to factors other than parasitism and the rate of desertion did not differ from controls that only had a single nest box. Moreover, 7 of the warblers initiated clutches in nest boxes that already contained cowbird egg despite having vacant nest boxes available on their territories. These results indicate that warblers do not accept parasitism because of tolerance, but likely due to evolutionary lag.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"785c29d9c0865692efd3cd4506ef924844e06ffc6e0d69a88fff9ec65fbf7921","category":"Environment"}