{"title":"The Impact of AI on Metal Artifacts in CBCT Oral Cavity Imaging","link":"https://www.preprints.org/manuscript/202405.1971/v1","date":1716976393000,"content":"Objective: This study aimed to assess the impact of artificial intelligence (AI)-driven noise reduction algorithms on metal artifacts and image quality parameters in cone-beam computed tomography (CBCT) images of the oral cavity. Materials and Methods: This retrospective study included 70 patients, 61 of whom were analyzed after excluding those with severe motion artifacts. CBCT scans, performed using a Hyperion X9 PRO 13 × 10 CBCT machine, included images with dental implants, amalgam fillings, orthodontic appliances, root canal fillings, and crowns. Images were processed with ClariCT. AI deep learning model (DLM) for noise reduction. Objective image quality was assessed using metrics such as the differentiation between voxel values (ΔVVs), the artifact index (AIx), and the contrast-to-noise ratio (CNR). Subjective assessments were performed by two experienced readers, who rated overall image quality and artifact intensity on predefined scales. Results: Compared with native images, DLM reconstructions significantly reduced the AIx and increased the CNR (p&lt;0.001), indicating improved image clarity and artifact reduction. Subjective assessments also favored DLM images, with higher ratings for overall image quality and lower artifact intensity (p&lt;0.001). However, the ΔVV values were similar between the native and DLM images, indicating that while the DLM reduced noise, it maintained the overall density distribution. Orthodontic appliances produced the most pronounced artifacts, while implants generated the least. Conclusion: AI-based noise reduction using ClariCT. AI significantly enhances CBCT image quality by reducing noise and metal artifacts, thereby improving diagnostic accuracy and treatment planning. Further research with larger, multicenter cohorts is recommended to validate these findings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"785d143ff0150f6dce92002aaf98a12635132a58f990ec0af84ea81e636f2133","category":"Interdisciplinary"}