{"title":"Apple has a mystery AirTag update—but you probably won’t get it for a while","link":"https://www.macworld.com/article/2122704/airtag-update-firmware-2a61-rollout.html","date":1698843612000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It might be another year until we see a true update to the original AirPods, but Apple is still working behind the scenes to make the current model better. On Tuesday, Apple released firmware update 2A61 but your AirTag probably won’t get it for several weeks.</p>\n\n\n\n<p>Apple doesn’t update its AirTag very often. The <a href=\"https://www.macworld.com/article/1433790/airtag-firmware-update-version-2-0-36.html\">last update</a> (version 2.0.36, build number 2A36) arrived about a year ago and fixed “an issue with the accelerometer not activating in certain scenarios.” Before that, version <a href=\"https://www.macworld.com/article/613588/airtag-find-my-updates-reduce-unwanted-tracking.html\">2.0.24</a> brought new <a href=\"https://www.macworld.com/article/345863/how-to-find-block-disable-airtag-moving-with-you.html\">features to prevent stalking</a>.</p>\n\n\n\n<p>AirTag updates aren’t sent to all devices at once like other software updates. Instead, Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://x.com/aaronp613/status/1719419843085058438?s=20&amp;xcust=1-1-2122704-1-0-0&amp;sref=https://www.macworld.com/feed\">gradually rolls out new updates</a> in stages: one percent of users getting the update this week, 10 percent getting it on November 7, 25 percent getting it on November 14, and the remaining users getting it on November 28. There is a gap in distribution during the week of Thanksgiving. </p>\n\n\n\n<p>Apple hasn’t updated its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/102183&amp;xcust=1-1-2122704-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">“What’s new in firmware updates for AirTag” page</a> with the new firmware, so it’s unclear what the update brings. Apple hasn’t announced any new features for AirTag, so it’s likely to merely be a fix.</p>\n\n\n\n<p>To check what firmware your AirTag is on, you can open the Find My app, then tap the <em>Items</em> tab and your AirTag. Then on the next screen tap the name of the AirTag to see the serial number and firmware.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"786aeced781e9910869cfafa5e83081634c9cc9e308842daeb1a1204a2def1e5","category":"Apple"}