{"title":"A review of data collection methods used to monitor the associations of wild species with marine aquaculture sites","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12890?af=R","date":1706177128000,"content":"<h2>Abstract</h2>\n<p>Aquaculture contributes a significant portion of the global aquatic biomass destined for human consumption. Bivalve and marine finfish aquaculture operations require sea-based farm sites that result in considerable interactions with the natural environment. The addition of feed waste and physical structures (e.g., net pens and longline mussel culture) can provide an attractive artificial reef for many species and studies have shown both positive and negative effects on the surrounding ecosystem due to wild species interactions with aquaculture sites. Assessing these interactions can be complex, depending on the local ecosystem, and several monitoring techniques have been used to accurately determine associations of wild finfish and decapods to marine farms. In this review, we assessed the main methods used to monitor aquaculture-ecosystem interactions. The advantages and disadvantages of each technique are discussed and suggestions to mitigate shortfalls for future studies are outlined. It was evident that combining methodologies should be prioritised to lessen the impact of identified weaknesses of any given approach. Designing studies with complementary approaches may help attain robust data that can be used to further understand aquaculture-ecosystem interactions and the underlying proximate mechanisms.</p>","author":"Greg English, \nMichael J. Lawrence, \nChristopher W. McKindsey, \nAnaïs Lacoursière‐Roussel, \nHannah Bergeron, \nStéphane Gauthier, \nBrendan F. Wringe, \nMarc Trudel","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"787064c13e9ae9689b1c9a930ad8629d4f5b5ad8e602ce534dfec9898bb7f998","category":"Environment"}