{"title":"Function of iron-stress-induced protein A in cyanobacterial cells with monomeric and trimeric photosystem I","link":"https://academic.oup.com/plphys/article/194/3/1397/7321087?rss=1","date":1697587200000,"content":"<span><div>Abstract</div>The acclimation of cyanobacteria to iron deficiency is crucial for their survival in natural environments. In response to iron deficiency, many cyanobacterial species induce the production of a pigment–protein complex called iron-stress-induced protein A (IsiA). IsiA proteins associate with photosystem I (PSI) and can function as light-harvesting antennas or dissipate excess energy. They may also serve as chlorophyll storage during iron limitation. In this study, we examined the functional role of IsiA in cells of <span>Synechocystis</span> sp. PCC 6803 grown under iron limitation conditions by measuring the cellular IsiA content and its capability to transfer energy to PSI. We specifically tested the effect of the oligomeric state of PSI by comparing wild-type (WT) <span>Synechocystis</span> sp. PCC 6803 with mutants lacking specific subunits of PSI, namely PsaL/PsaI (PSI subunits XI/VIII) and PsaF/PsaJ (PSI subunits III/IX). Time-resolved fluorescence spectroscopy revealed that IsiA formed functional PSI<sub>3</sub>-IsiA<sub>18</sub> supercomplexes, wherein IsiA effectively transfers energy to PSI on a timescale of 10 ps at room temperature—measured in isolated complexes and in vivo—confirming the primary role of IsiA as an accessory light-harvesting antenna to PSI. However, a notable fraction (40%) remained unconnected to PSI, supporting the notion of a dual functional role of IsiA. Cells with monomeric PSI under iron deficiency contained, on average, only 3 to 4 IsiA complexes bound to PSI. These results show that IsiA can transfer energy to trimeric and monomeric PSI but to varying degrees and that the acclimatory production of IsiA under iron stress is controlled by its ability to perform its light-harvesting function.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"78710eacd41f8bc5fba76a1e9deb60773f022f90f3131f924d862a8f66c2a2b5","category":"Environment"}