{"title":"Fake Pentagon “explosion” photo sows confusion on Twitter","link":"https://arstechnica.com/?p=1941475","date":1684875702000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/AI_explosion_image-800x450.jpg\" alt=\"A fake AI-generated image of an \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/AI_explosion_image.jpg\">Enlarge</a> <span>/</span> A fake image of an \"explosion\" near the Pentagon that went viral on Twitter. (credit: Twitter)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, a <a href=\"https://twitter.com/AndyBCampbell/status/1660654574644887558?s=20\">tweeted</a> AI-generated image suggesting a large explosion at the Pentagon led to brief confusion, which included a reported small drop in the stock market. It originated from a verified Twitter account named \"Bloomberg Feed,\" unaffiliated with the well-known Bloomberg media company, and was quickly exposed as a hoax. However, before it was debunked, large accounts such as Russia Today had already spread the misinformation,  <a href=\"https://www.washingtonpost.com/technology/2023/05/22/pentagon-explosion-ai-image-hoax/\">The Washington Post reported</a>.</p>\n\n<p>The fake image depicted a large plume of black smoke alongside a building vaguely reminiscent of the Pentagon with the tweet \"Large Explosion near The Pentagon Complex in Washington D.C. — Inital Report.\" Upon closer inspection, local authorities confirmed that the image was not an accurate representation of the Pentagon. Also, with blurry fence bars and building columns, it looks like a fairly sloppy AI-generated image created by a model like <a href=\"https://arstechnica.com/information-technology/2022/09/with-stable-diffusion-you-may-never-believe-what-you-see-online-again/\">Stable Diffusion</a>.</p>\n<p>Before Twitter suspended the false Bloomberg account, it had tweeted 224,000 times and reached fewer than 1,000 followers, according to the Post, but it's unclear who ran it or the motives behind sharing the false image. In addition to Bloomberg Feed, other accounts that shared the false report include “Walter Bloomberg” and “Breaking Market News,\" both unaffiliated with the real Bloomberg organization.</p></div><p><a href=\"https://arstechnica.com/?p=1941475#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941475&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7874c16be38c0f1698d6ec3cd530b7b319f7c5f6e478fd12b4c2741eea7b3dfa","category":"Tech"}