{"title":"Arm announces the Cortex X4 for 2024, plus a 14-core M2-fighter","link":"https://arstechnica.com/?p=1942885","date":1685478547000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/CPU-efficiency-image-1.png-1040x0-1-980x551.png\" alt /></div>\n          <p>\n            An overview of Arm's new chips.                           [credit:\n                              Arm                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Over the weekend, Arm showed off its vision for the next generation of flagship CPUs. As usual, these designs include CPUs in various sizes for different workloads. The 'big' chip this year is the <a href=\"https://community.arm.com/arm-community-blogs/b/announcements/posts/cortex-x4-cpu-performance\">Arm Cortex X4</a>, the 'medium' chip is the <a href=\"https://community.arm.com/arm-community-blogs/b/announcements/posts/arm-cortex-a720-and-cortex-a520-cpus\">Cortex A720</a>, and the 'small' chip is the Cortex A520. The new chips should arrive in Android phones and Windows laptops in 2024.</p>\n<p>Arm claims the big Cortex X3 chip will have 15 percent higher performance than this year's X3 chip, and \"40 percent better power efficiency.\" The company also promises a 20 percent efficiency boost for the A700 series and a 22 percent efficiency boost for the A500.</p>\n<p>The new chips are all built on the new 'Armv9.2' architecture, which adds a \"new QARMA3 algorithm\" for Arm's Pointer Authentication memory security feature. Pointer authentication assigns a cryptographic signature to memory pointers and is meant to shut down memory corruption vulnerabilities like buffer overflows by making it harder for unauthenticated programs to create valid memory pointers. This feature has been around for a while, but Arm's new algorithm reduces the CPU overhead of all this extra memory work to just 1 percent of the chip's power, which hopefully will get more manufacturers to enable it.</p></div><p><a href=\"https://arstechnica.com/?p=1942885#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942885&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"78751af4852a6fe7fe876472b95a299ce3c2663491a5de79653e14f43285616a","category":"Tech"}