{"title":"Zwift Outlines Summer Features, Plus Zwift Hub Firmware Update","link":"https://www.dcrainmaker.com/2023/04/zwift-outlines-summer-features-plus-zwift-hub-firmware-update.html","date":1681402741000,"content":"<p>Yesterday Zwift announced their summer feature plans, which include a number of actually pretty useful features. And in this case, ‘summer’ really means anything vaguely warm, including May. Also, this is not Australian summer, but Austrian summer.</p>\n<p>Atop that, as of today, all Zwift Hub owners can now get the latest firmware that includes automatic calibration anytime you coast for more than 5 seconds. The Zwift Hub was already pretty darn accurate previously, but this increased the accuracy even further.</p>\n<p>And finally, yesterday a judge was set to rule on the <a href=\"https://www.dcrainmaker.com/2023/03/tech-tidbits-supersapiens-dq-for-pro-cyclist-wahoo-zwift-court-update-and-coros-1-on-1-coaching.html#wahoo-zwift-court-case-update\">Wahoo vs Zwift case</a>, specifically Wahoo’s injunction request that Zwift stop selling the Zwift Hub. As of this moment, the court records haven’t been updated yet to specify the results of that hearing. Once they do, I’ll post accordingly.</p>\n<h3><span>Zwift’s Summer Feature Plans:</span></h3>\n<p></p>\n<p>In the last 18 months or so, Zwift has shifted towards pre-announcing many of their upcoming features. Basically they do 4-6 month roadmaps, which is kinda cool actually.</p>\n<p>In this week’s announcement, they cover the spring and summer features that are incoming. I’ll quickly run through them all, but, you can also check out GPLAMA’s video above for more details.</p>\n<p>First up is <strong>Coffee Stop</strong>. This feature lets you jump off the trainer while in the middle of a group ride, and gives you three minutes to get your business done. While it’s named ‘coffee stop’, it could just as easily be named ‘Bathroom Break’, ‘Dropped Towel’, ‘Forgetful Fan’, or ‘Need a Cookie’. This feature works in meet-ups, pacer groups, or even others that you’re free-riding with.</p>\n<p>To access the feature you’ll see a new option on the Zwift Companion App and Zwift action bar (in the game). If you get back early, you can end the coffee stop, or you could just keep waiting till the timer runs out. It remains a bit fuzzy what the limits of this are (e.g., how many times, if more than one, you can use it per ride), but I’m sure we’ll know soon enough once it releases.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/CoffeeStop.jpg\"><img title=\"CoffeeStop\" src=\"https://media.dcrainmaker.com/images/2023/04/CoffeeStop_thumb.jpg\" alt=\"CoffeeStop\" width=\"720\" height=\"405\" /></a></p>\n<p>Next is <strong>Rider Teleport</strong>. This lets you instantly join riders or pacers somewhere else. So for example, let’s say I’m riding along and I see GPLAMA jump on Zwift – I could then instantly ‘Teleport’ to ride with him. Of course, after a few minutes I realize he’s still talking about sheep or something, so I bail to then see DesFit riding – and again Teleport to join him. After about 90 seconds of that, my legs regret their life choices, and then I decide to just Teleport to ride with one of the D Pacer groups and activate a coffee stop. Of course, there’s more practical purposes here, like warming up first before jumping on an ‘A’ pacer group. But it’s cool.</p>\n<p>The one obvious caveat is how this will impact your post-ride maps. On Zwift, it’ll appear as a straight line, but once uploaded to sites like Strava, we’ll have to see if they cleanly remove that line (or the distance associated with it). Hopefully we’ve reached a point in life where these two companies can work together to ensure this is seamless.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/RiderTeleport.jpg\"><img title=\"RiderTeleport\" src=\"https://media.dcrainmaker.com/images/2023/04/RiderTeleport_thumb.jpg\" alt=\"RiderTeleport\" width=\"720\" height=\"405\" /></a></p>\n<p>The rules of Fight Club, err…Teleport Club are:</p>\n<ul>\n<li>Zwifters don’t get distance credit or XP for the distance covered while teleporting.</li>\n<li>Zwifters will get credit for any routes or segments you complete during your ride, as long as they don’t Teleport during that route or segment – either into it, or out of it.</li>\n<li>Teleporting is also disabled during events and races.</li>\n<li>Zwifters cannot Teleport next to another Zwifter participating in an event or race.</li>\n<li>You can only Teleport to Zwifters you follow, and who follow you</li>\n</ul>\n<p>And, by now you’ve probably noticed the <strong>New Action Bar</strong> features. As such, there will be some additional tweaks on the action bar to consolidate items a bit, allowing for a multi-level component where secondary options are consolidated under the first.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/Actionbar.jpg\"><img title=\"Actionbar\" src=\"https://media.dcrainmaker.com/images/2023/04/Actionbar_thumb.jpg\" alt=\"Actionbar\" width=\"720\" height=\"405\" /></a></p>\n<p>Next, there’s the ‘Climb Portal’. This feature is still a wee bit fuzzy, but Zwift says that riders will be able to enter two totally new Zwift climbs, the Col du Tourmalet and Col d’Aspin, all in a totally new Zwift visual experience. Zwift’s exact words are “a visual experience that’s different from anything else in Zwift”. Check out this <a href=\"https://zwiftinsider.com/climb-portal/\">post over on Zwift Insider</a> with a bit more thoughts from, well, inside Zwift.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/ClimbPortal.jpg\"><img title=\"ClimbPortal\" src=\"https://media.dcrainmaker.com/images/2023/04/ClimbPortal_thumb.jpg\" alt=\"ClimbPortal\" width=\"720\" height=\"405\" /></a></p>\n<p>Next, there are <strong>two Club-Related updates</strong>. The first is that Clubs can now toggle to <em><strong>keep everyone together</strong></em> for club events, and then additionally, users can now control notifications for clubs, including whether to have All Club Chat notifications or All Club Notifications.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/ClubNotifications.jpg\"><img title=\"ClubNotifications\" src=\"https://media.dcrainmaker.com/images/2023/04/ClubNotifications_thumb.jpg\" alt=\"ClubNotifications\" width=\"720\" height=\"405\" /></a></p>\n<p>Finally, as of today, V4 Pack Dynamics have also rolled out, Zwift describes these changes as <a href=\"https://forums.zwift.com/t/pack-dynamics-4-release-april-2023/605018\">follows in their update</a> on the Zwift forums:</p>\n<ul>\n<li>Larger packs should have less rider movement than before, with riders holding more consistent positions; your avatar will shuffle around less in the groups.</li>\n<li>Provided the group is riding consistently – as they might do with Pacers – and the pace is not changing drastically, Zwifters that are dropped from a group should now have an easier time bridging back up to the group.</li>\n<li>Zwifters that attempt to breakaway from a group should now have a slightly easier time staying away. This does not guarantee more breakaways, though. You’ll still need to work together to keep the peloton behind you!</li>\n</ul>\n<p>Phew, got all that? Good, let’s chat hardware.</p>\n<h3><span>Zwift Hub Update:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DSC_6623.jpg\"><img title=\"DSC_6623\" src=\"https://media.dcrainmaker.com/images/2023/04/DSC_6623_thumb.jpg\" alt=\"DSC_6623\" width=\"720\" height=\"480\" /></a></p>\n<p>Back when the <a href=\"https://www.dcrainmaker.com/2022/10/zwift-hub-smart-trainer-in-depth-review-the-best-bang-for-your-buck.html\">Zwift Hub released</a>, it was very good. However, there was one mostly minor technical issue that reviewers (including myself) noted, which was a bit of drift initially, and lack of automatic calibration like some higher-end trainers. Zwift has aimed to seemingly fix both of these issues with a new automatic calibration. Essentially the unit will automatically calibrate if you stop pedaling for 5 seconds (at a speed of at least 15KPH/10MPH). This is roughly similar to what other companies do.</p>\n<p>Now, I was actually more interested in the drift bits. Previously I saw it drift about 10w in the first 10 minutes, and then settle down. So, I got the firmware all updated. And while this update was announced a week or two ago, it’s only as of today (April 13th, 2023), that Zwift has fully completed the staged roll-out, meaning that anyone with a Zwift Hub can access it.</p>\n<p>You’ll see the firmware update on your Zwift Companion app. Just tapity-tap your way through to update. Takes about two minutes:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image001-2.png\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image001_thumb-2.png\" alt=\"clip_image001\" width=\"172\" height=\"370\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image0015-1.png\"><img title=\"clip_image001[5]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image0015_thumb-1.png\" alt=\"clip_image001[5]\" width=\"172\" height=\"370\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00110-1.png\"><img title=\"clip_image001[10]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00110_thumb-1.png\" alt=\"clip_image001[10]\" width=\"172\" height=\"370\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image00114-1.png\"><img title=\"clip_image001[14]\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image00114_thumb-1.png\" alt=\"clip_image001[14]\" width=\"172\" height=\"370\" /></a></p>\n<p>Then, go forth and ride. I did that too.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/clip_image001-2.jpg\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/04/clip_image001_thumb-2.jpg\" alt=\"clip_image001\" width=\"720\" height=\"480\" /></a></p>\n<p>Now, many others have covered the automatic calibration, but I was curious on the drift side (remember, 10w previously in first 10 minutes before settling). And we can see here that’s improved. I’m seeing about 5w in ~2 minutes, and then it’s settled:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/DriftSection.png\"><img title=\"DriftSection\" src=\"https://media.dcrainmaker.com/images/2023/04/DriftSection_thumb.png\" alt=\"DriftSection\" width=\"722\" height=\"191\" /></a></p>\n<p>That’s more than good enough for virtually any purpose out there. Here’s the rest of the ride btw, that wobble at 39 minutes is when I iterated through the cassette a bit and then shifted from small ring to big chainring, validating the rest of the ride remained good in the big ring too.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/04/OverallChart.png\"><img title=\"OverallChart\" src=\"https://media.dcrainmaker.com/images/2023/04/OverallChart_thumb.png\" alt=\"OverallChart\" width=\"722\" height=\"152\" /></a></p>\n<p>Very solid performance by the trio of the Stages LR (Shimano DuraAce R9200 variant), Garmin Vector 3, and Zwift Hub. I’ve put in a few months of hard riding on this newer Stages LR variant, inside and out. Rain and hot weather. Snow, hail, misery…and it’s very solid. Full review hopefully out next week, but this is the one-line version of that longer review. Shows what Shimano could have done on their DuraAce R9200 power meter, had they tried.</p>\n<p>In any case, as for the Zwift Hub…now it’s even better than before.</p>\n<p>Now – the real question is whether Zwift will also add in the <a href=\"https://zwiftinsider.com/jetblack-firmware-3-10/\">10hz Bluetooth connectivity and dual-Bluetooth connectivity that JetBlack</a> just added to the JetBlack VOLT series. JetBlack makes the Zwift Hub, though Zwift and JetBlack recently forked (split) the firmware so that Zwift owns development of it.</p>\n<p>In checking with Zwift, they said that they’re “exploring” the 10Hz, but don’t have a decision yet. Same goes for dual-Bluetooth. I’d argue that while the faster BT connectivity would be great, that the dual-Bluetooth is actually more valuable here, primarily just to reduce support confusion with one app taking the only connectivity via Bluetooth. Either way, would be ideal to see Zwift support both.</p>\n<p>–</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"78770a5501d6b86b7213ea0467e028322105ee64362e416d38b1e5d7bad3c61b","category":"Cycling"}