{"title":"272 Relationships of salivary cortisol and automated brush system usage in freestall housed dairy cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/6/7757175?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The dairy industry has seen a significant shift in animal welfare practices, with growing emphasis on providing optimal living conditions for indoor-housed animals. Intensive management of dairy cows has become increasingly common, offering a controlled setting that ensures the well-being and productivity of the cow. Enrichment strategies such as automated brushes are proposed as a means for intensively managed dairy cows to improve their physical, mental, and emotional well-being. These behavioral benefits can contribute to an enriched living environment. Additionally, automated brushes have been shown to decrease cortisol concentrations which can lead to impacts such as heightened immune systems and increased productivity. With this known, the objective of this study was to evaluate the usage of an automated brush systems influence on cortisol concentrations of lactating dairy cows housed in a freestall setting. Cows (n = 29) over three trials (20 d each) were evaluated for duration of brush activity utilizing scan sampling of video recordings (0500 h-0900 h and 1700 h-2100 h; post milking) totaling 8 h/d throughout each trial. Animals were managed in accordance with standard operating procedures of the dairy, and all data was passively collected without influencing behavioral changes. Video capture was performed using a four camera closed-circuit media recording system. Cameras were placed in the corners of the pen, allowing full view of animals interacting with the brush system. Video images were scored using NOLDUS Observer XT. Saliva collection was performed during milking sessions using Salimetrics SalivaBio Children’s Swab kits. Salivary samples were analyzed using commercially available cortisol ELISA kits. Results indicate that cows exhibited greater cortisol concentrations in the mornings compared with the evenings (<span>P</span> = 0.018) and showed increased brush usage in the evenings compared with the mornings (<span>P =</span> 0.019). These findings suggest a pattern where cows tend to have increased cortisol concentrations in the mornings and engage in more brush usage behavior during the evenings. An analysis was conducted to examine relationships between brush usage and cortisol concentration, specifically focusing on the effects of automated brush usage on cortisol levels. Cortisol concentration was only slightly related to brush usage (R<sup>2</sup> = 0.03; <span>P</span> ≤ 0.01). Partitioning the trial in halves provided insight of continuous brush usage and its relation to cortisol. Results illustrate (d 1 to 10), brush usage and cortisol were slightly correlated (R<sup>2</sup> = 0.13; <span>P</span> ≤ 0.01) during the first half of the study, while there was no relationship noted during the second half (R<sup>2</sup> = 0.002; <span>P</span> = 0.22). In conclusion, this study provides valuable insights into the relationship between automated brush systems and cortisol in lactating dairy cows housed in a freestall setting. Though these findings contrast those in literature, this details the need for additional research to elucidate brush usage impact on dairy cow hormonal status.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"787ab0eda3d404ebe762a40f381dc46fc3320337b7574cf3ecad4a261ef59ee0","category":"Environment"}