{"title":"Gas prices are expected to rise due to the truck driver shortage","link":"https://arstechnica.com/?p=1761177","date":1619710648000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/GettyImages-113858227-800x531.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/GettyImages-113858227.jpg\">Enlarge</a> <span>/</span> A shortage of qualified tanker truck drivers may lead to rising gas prices this summer. (credit: Driendl Group/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>There are more than 1.8 million truck drivers in the US, but even so, it's not enough. On Tuesday, the National Tank Truck Carriers <a href=\"https://www.cnn.com/2021/04/27/business/summer-gasoline-shortage/index.html\">raised the alarm</a>, warning that if more people don't start driving trucks soon, the nation might experience fuel shortages and price increases.</p>\n<p>In a more normal year, perhaps 10 percent of the country's fuel tankers might be idle, but NTTC says that number is between 20–25 percent in 2021. \"We've been dealing with a driver shortage for a while, but the pandemic took that issue and metastasized it,\" Ryan Streblow, NTTC's executive VP, told CNN.</p>\n<p>Driving a tanker full of fuel requires more training than hauling bulk cargo in a class 8 truck, but the pandemic sidelined drivers as fuel demand dropped, causing many more drivers to leave the industry. And the schools that could train new drivers were obviously closed for public health reasons, compounding the labor shortage.</p></div><p><a href=\"https://arstechnica.com/?p=1761177#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761177&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"787ebe175a56b7ccd01d5a6720778e2cb072a172828186650e82cacb82c86c01","category":"Tech"}