{"title":"The Open Letter: ‘Call for a Full and Unrestricted International Forensic Investigation Into the Origins of COVID-19’","link":"https://s.wsj.net/public/resources/documents/COVID%20OPEN%20LETTER%20FINAL%20030421%20(1).pdf","date":1615070496000,"content":"\n<p>It’s very much worth reading the open letter signed by 26 scientists. (I’m linking here to the version hosted by The Wall Street Journal, but the type looks weirdly squished. The <a href=\"https://int.nyt.com/data/documenttools/covid-origins-letter/5c9743168205f926/full.pdf\">copy hosted by The New York Times</a> <em>looks</em> better, but in their copy, none of the links are actually links — they’re just blue underlined text. Better to link to the typographically-flawed version that has the actual links. I’m <a href=\"/misc/2021/03/COVID%20OPEN%20LETTER%20FINAL%20030421%20(1).pdf\">hosting a copy</a> for posterity as well.) From the letter:</p>\n\n<blockquote>\n  <p>Although the “collaborative” process of discovery mandated by the\nWorld Health Assembly in May 2020 was meant to enable a full\nexamination of the origins of the pandemic, we believe that\n<a href=\"https://www.who.int/publications/m/item/who-convened-global-study-of-the-origins-of-sars-cov-2\">structural limitations</a> built into this endeavor make it all\nbut impossible for the WHO-convened mission to realize this\naspiration.</p>\n\n<p>Based on our analysis, and as confirmed <a href=\"https://www.who.int/health-topics/coronavirus/origins-of-the-virus\">by the global study</a>\nconvened by the World Health Organization (WHO) and Chinese\nauthorities, there is as yet no evidence demonstrating a fully\nnatural origin of this virus. The zoonosis hypothesis, largely\nbased on patterns of previous zoonosis events, is only one of a\nnumber of possible SARS-CoV-2 origins, alongside the\nresearch-related accident hypothesis.</p>\n\n<p>In particular, we wish to raise public awareness of the fact that\nhalf of the joint team convened under that process is made of\nChinese citizens whose scientific independence may be limited,\nthat international members of the joint team had to rely on\ninformation the Chinese authorities chose to share with them, and\nthat any joint team report must be approved by both the Chinese\nand international members of the joint team.</p>\n\n<p>We have therefore reached the conclusion that the joint team did\nnot have the mandate, the independence, or the necessary accesses\nto carry out a full and unrestricted investigation into all the\nrelevant SARS-CoV-2 origin hypotheses - whether natural spillover\nor laboratory/research- related incident.</p>\n\n<p>We are also concerned that the joint team’s work has been\ninaccurately reported by the media as an independent investigation\nwhose conclusions reflect those of the WHO. The February 9, 2021\n<a href=\"https://news.cgtn.com/news/2021-02-09/Live-WHO-holds-press-conference-on-scientific-research-into-COVID-19-XJv2tyicRa/index.html\">Wuhan joint press conference</a> was a good example of this\nmisunderstanding. Although the findings were those of the joint\nteam, they were <a href=\"https://www.bbc.com/news/world-asia-china-55996728\">widely reported as representing the WHO\nitself</a>.</p>\n</blockquote>\n\n<p>The letter goes on to describe what a truly full investigation would look like.</p>\n\n<div>\n<a  title=\"Permanent link to ‘The Open Letter: ‘Call for a Full and Unrestricted International Forensic Investigation Into the Origins of COVID-19’’\"  href=\"https://daringfireball.net/linked/2021/03/06/open-letter-full-and-unrestricted-international-investigation-covid19\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"788619f91c463631c2b28b33696d2094b0792b168f439373008c099efa62c588","category":"Tech"}