{"title":"Xbox exec says leaked “old emails and documents” have “outdated” info","link":"https://arstechnica.com/?p=1969596","date":1695224345000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/02/dice_spencer-800x533.jpg\" alt=\"Microsoft's Phil Spencer speaks at the DICE conference in Las Vegas.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/02/dice_spencer.jpg\">Enlarge</a> <span>/</span> Microsoft's Phil Spencer speaks at the DICE conference in Las Vegas. (credit: Kyle Orland)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Yesterday's <a href=\"https://arstechnica.com/gaming/2023/09/ftc-v-microsoft-document-leak-outs-detailed-plans-for-mid-gen-xbox-refresh/\">massive leaks from the Microsoft vs. FTC case</a> have a large swath of the gaming world expecting that a more powerful, disc-free Xbox Series X refresh could be coming as soon as next year. But Xbox boss Phil Spencer is warning that players shouldn't put too much stock in what he called \"old emails and documents.\"</p>\n<p>\"It is hard to see our team's work shared in this way because so much has changed and there's so much to be excited about right now, and in the future,\" Spencer <a href=\"https://twitter.com/XboxP3/status/1704233222752571842\">wrote on social media</a> late Tuesday. \"We will share the real plans when we are ready.\"</p>\n<p>Spencer followed up that post with a memo sent to the Xbox team, apologizing for the unintentional disclosure of internal plans. \"I know this is disappointing, even if many of the documents are well over a year old and our plans have evolved,\" the memo reads, in part. \"I also know we all take the confidentiality of our plans and our partners’ information very seriously. This leak obviously is not us living up to that expectation... That said, there’s so much more to be excited about, and when we’re ready, we’ll share the real plans with our players.\"</p></div><p><a href=\"https://arstechnica.com/?p=1969596#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1969596&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"789b5f3e6fd1241b0f800464f41f2d2872834ee128745e6a75cf1401946ea029","category":"Tech"}