{"title":"The impact of green bond issuance on carbon emission intensity and path analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304364","date":1717596000000,"content":"<p>by Haifeng Pang, Changxu Wu, Liucheng Zhang</p>\r\n\r\nReducing carbon emission intensity is crucial for achieving sustainable development. Carbon emission intensity is expressively affected by the issuance of green bonds. Thus, it is imperative to assess the influence of green bond issuance on carbon emissions and examine their correlation. Such research holds great potential to expedite the overhaul and modernization of businesses and to construct a circular economy system. This paper uses the spatial Durbin model to draw empirical conclusions by using data from 26 provinces in China between 2016 and 2021. Firstly, under different spatial matrices, it has been analyzed that an increase of 1% in the issuance of green bonds leads to a reduction of 0.306% or 0.331% in carbon emission intensity. It shows that green bonds have the potential to substantially reduce carbon intensity. Additionally, the intensity of emissions in the current period is driven by the intensity of emissions in the previous period. Secondly, the analysis of mediated transmission suggests that green bonds can ultimately reduce carbon emission intensity by changing the energy consumption structure or improving the efficiency of green technology innovation. Thirdly, the analysis of heterogeneity shows that the inhibitory effect of green bond issuance on carbon emissions is stronger in less economically developed regions than in economically developed regions. There is a significant inhibitory effect of green bond issuance in neighboring provinces on local carbon emission intensity. This effect is present only in provinces in less economically developed regions and not in economically developed regions.","author":"Haifeng Pang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"78a01b725480d67677cc13c5a7b791953f89921fe0efbbd26450d7126fe1fa03","category":"Interdisciplinary"}