{"title":"Effects of Different Organic Materials on the Remediation and Improvement of Secondary Salinized Greenhouse Soil","link":"https://www.preprints.org/manuscript/202404.1665/v1","date":1714034282000,"content":"Soil secondary salinization has seriously affected the greenhouse vegetable production in China. To improve the secondary salinization greenhouse soil and enhance the soil physical-chemical properties in an eco-environmental way, different organic amendments (straw, straw biochar, Trichoderma bio-organic manure, commercial organic manure) were applied using pot experiment for 60 day to comprehensively screen the optimal remediation method. In this study, soil nutrient condition and salt movement were assessed, and predictive models using multi-linear regression (MLR) and Random Forest (RF) were developed to estimate soil salinization parameters. The findings indicated a significant decrease in soil salt content following the application of organic materials compared to the control treatment. Specifically, the addition of straw at a rate of 250g/kg resulted in a 59.38% reduction in soil salt levels after 60 days (P &lt; 0.05). Furthermore, the main salt ions exhibited dynamic changes over the course of the experiment, with reductions observed in Na+, Ca2+, Cl-, and NO3- content under the 250 g/kg straw treatment by 83.63%, 74.67%, 63.26%, 59.07%, respectively, compared to CK (P &lt; 0.05). In addition, the SO42- content under 125 g/kg commercial organic manure amendment reduced by 48.94%, respectively (P &lt; 0.05). Contrary to expectations, the addition of organic materials significantly increased the levels of total nutrients (N/P/K) and available potassium (AK) and phosphorus (AP) in the soil. Specifically, the addition of straw at a rate of 250 g/kg resulted in increases of 18.02%-87.38% in total potassium (TK), 66.67%-200% in total phosphorus (TP), and 142.87%-367.8% in AK after a period of sixty days (P &lt; 0.05). Ultimately, the treatment involving the addition of 250 g/kg of straw demonstrated the most pronounced impact on the physical and chemical properties of the soil. The random forest method shows promise in accurately predicting soil salt and soil sodium adsorption ratio (SAR)indicators, thereby providing a valuable tool for estimating soil properties.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"78a5147043998552593dd46ed02abc70c70de925ebe55ca09dad0f3e4f1f4b07","category":"Interdisciplinary"}