{"title":"[ไม่ยืนยัน] Facebook จะประกาศบังคับใช้กฎแพลตฟอร์มกับทุกคน ไม่เว้นแม้แต่นักการเมือง","link":"https://www.blognone.com/node/123005","date":1622785905000,"content":"<div><div><div><p>จากกรณีโดนัลด์ ทรัมป์ อดีตประธานาธิบดีสหรัฐฯ​ ผู้ซึ่งครั้งหนึ่งทรงอิทธิพลในโซเชียลมีเดียมาก แม้เนื้อหาจะขัดต่อหลักสิทธิพลเมืองและกฎแพลตฟอร์ม ก็ตาม Facebook เองก็เคยยืนกรานว่า ถ้อยคำของประธานาธิบดี คือสิ่งที่ประชาชนมีสิทธิ์รับรู้ และแพลตฟอร์มไม่มีสิทธิ์ปิดกั้น แต่เหตุการณ์บุกรัฐสภาสหรัฐฯเมื่อวันที่ 6 ม.ค. ที่ผ่านมา ทำให้โซเชียลมีเดียต้องกลับมาคิดใหม่ เพราะอิทธิพลของทรัมป์ส่งผลต่อโลกจริงมากกว่าที่คิด</p>\n<p>ล่าสุด มีรายงานอ้างอิงแหล่งข่าวภายใน Facebook 2 ราย ระบุว่า Facebook จะเปลี่ยนนโยบาย บังคับใช้กฎแพลตฟอร์มกับนักการเมืองด้วย โดยจะแถลงนโยบายต่อสังคมเร็วๆ นี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a1e6013853f87ae8aa2599d8667e4924.jpg\" /><br />\nภาพจาก <a href=\"https://www.facebook.com/photo.php?fbid=10103818114983761&amp;set=pb.4.-2207520000..&amp;type=3\">Mark Zuckerberg ถ่ายในปี 2017</a></p>\n<p>ย้อนกลับไปในปี 2019 มาณ์ก ซักเคอร์เบิร์ก เคยกล่าวในปาฐกถาที่ Georgetown University เน้นย้ำบทบาท Facebook จะไม่เป็นผู้ชี้ขาดว่าใครควรพูดอะไร เชื่อว่าต้องยืนยันการแสดงออกอย่างเสรีต่อไป ส่งผลให้กลุ่มสิทธิพลเมืองและนักกฎหมาย วิจารณ์ Facebook อย่างกว้างขวางในขณะนั้น</p>\n<p>สุดท้ายแล้ว ทรัมป์ก็ถูกแบนจากโซเชียลมีเดียใหญ่ทั้งหมด เป็นเรื่องยากที่เขาจะกลับมามีิทธิพลต่อฐานเสียงในโซเชียลมีเดียได้ โดย Facebook ส่งต่อเรื่องแบนทรัมป์ให้ Oversight Board หรือคณะกรรมการอิสระตรวจสอบอำนาจไปพิจารณาแล้ว</p>\n<p>ที่มา - <a href=\"https://www.nytimes.com/2021/06/03/technology/facebook-politicians-posts.html\">The New York Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/donald-trump\">Donald Trump</a></div><div><a href=\"/topics/politics\">Politics</a></div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"78bdb8002e0d20b05e2c9a444c6bd1dd471f69927addadc25124a2f3e2786573","category":"Thai"}