{"title":"All the best Black Friday 2021 deals we can find that are still available [Updated]","link":"https://arstechnica.com/?p=1815967","date":1638034272000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/dealmasterBFFEATURE-800x400.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/dealmasterBFFEATURE.jpg\">Enlarge</a> <span>/</span> A sampling of the best Black Friday deals we've found. </p>  </figure>\n\n\n\n\n      <p><em><b>(Update 11/27/21 12:30 pm EST)</b>: Black Friday is in the rear-view mirror, but with Cyber Monday on the way, most of the better deals from our roundup are still kicking. We've updated our curated list accordingly, making sure prices are up to date and striking out offers that have expired (for now, at least).</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p><strong>Original post (11/26/21 12:40 am EST)</strong>: The turkey has been consumed and the football games are over, which means the avalanche of Black Friday deals has begun. To help you sort through the barrage of breathless retailer promotions, we've pored over every so-called deal we can find, checking price histories and researching whether a product is worth buying in the first place to bring you this hand-picked roundup of the deals most worth your time.</p>\n<p>If you've been following the early Black Friday sales that've ran over the past couple of weeks, many of the offers below may look familiar. Nevertheless, plenty of gadgets and gear we like are available at good prices. We'll update this list continuously, so feel free to bookmark this page in case something you've wanted sees a discount later.</p></div><p><a href=\"https://arstechnica.com/?p=1815967#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1815967&amp;comments=1\">Comments</a></p>","author":"Jeff Dunn","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"78be51c107ae3f8c717aaeb586f9eaee2b141dbc28b8c6daeeac303c43ca1a1b","category":"Tech"}