{"title":"Android 12’s play-as-you-download scheme will make games start twice as fast","link":"https://arstechnica.com/?p=1779434","date":1626110584000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/44-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/44.jpg\">Enlarge</a> (credit: Google)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Google <a href=\"https://youtu.be/e9JCRsLjDr4?t=1101\">is announcing</a> a new trick for Android 12 and the Google Play Store: a play-as-you-download feature for games. If you're downloading a large game, you'll soon be able to start playing before the entire download finishes, letting you jump into gameplay as quickly as possible.</p>\n<p>Play-as-you-download is a feature of several major online game stores. The idea is that you don't need to download the entire game to <em>start</em> playing it, just the data for the game engine, the UI, the first level, and the initial startup sequence. The largest files in any game are the assets for graphics, sounds, and pre-rendered videos, and if you can split those up by \"needed immediately\" and \"needed later\" (like, say, by level), you can save a lot of time in the initial download.</p>\n<p>Google's example GIF shows one 127MB game becoming playable after a user downloads just 20 percent of the game, and the company says, \"We are seeing games being ready to open at least 2 times faster.\" The feature is exclusive to Android 12 because it relies on a new \"<a href=\"https://www.xda-developers.com/google-incremental-file-system-android-big-games/\">Incremental FS</a>\" file system in the forthcoming update. Google describes Incremental FS as a \"special-purpose Linux virtual file system that allows execution of a program while its binary and resource files are still being lazily downloaded over the network, USB, etc.\"</p></div><p><a href=\"https://arstechnica.com/?p=1779434#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779434&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"78d5bd90dac47e148091f90f761fc1eb04a47d153fc29656854982a7f7192bea","category":"Tech"}