{"title":"Thousand Heritage helmet review: An aesthete commuter’s dream","link":"https://www.cyclingtips.com/2023/05/thousand-heritage-helmet-review/","date":1682975331000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front-side-1.jpg?width=1200\" alt=\"Thousand Heritage helmet review: An aesthete commuter's dream\" /></figure><p>Gloria Huang, founder of Thousand Helmets, named her brand after the goal of helping to save 1000 lives. How would they do that? By making a helmet that people actually want to wear. The result was the Thousand Heritage helmet, which quickly grew in popularity for its moto-inspired looks and commuter-driven feature set.</p>\n<p>Thousand have revised its Heritage helmet to include an updated fit for folks with rounder heads, far better ventilation, and a new fit system. Better yet, they’ve done all of this without changing the helmet’s characteristically good looks.</p>\n<h2>Thousand Heritage details</h2>\n<p>The Thousand Heritage helmet, particularly in this colorway, looks more like an equestrian riding helmet than a dedicated bike helmet. That works to its benefit for the most part. The rounded lines and softer edges are a serious change of pace compared to the angular looks most helmets go for. But the helmet’s design isn’t purely for looks!</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-outside-lock.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-outside-lock\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-outside-lock.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-outside-lock.jpg?width=190 190w\" /><figcaption>Out back is a dedicated port to thread your bike lock through. The port door is color-matched and retained via magnets, leading to a satisfying click every time the door is put back in place. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p>Commuter helmets, particularly ones that are locked to the bike, are subject to loads of small bumps and scrapes. Bikes moving back and forth off of racks, things moving around day after day, and the gamut of temperatures mean a tougher outer shell makes a whole lot of sense to protect the helmet’s foam.<span> </span></p>\n<p>There are two main downsides to a stiffer outer shell that the Heritage has: ventilation and weight, the latter of which I’ll get to later. I personally passed on the first generation of the Heritage because of its poor ventilation. The new one adds a pair of larger vents to the front of the helmet as well as a pair to the back. Further, the inside features internally-molded channels that facilitate front-to-back air flow, resulting in what Thousand says is a 70 percent increase in ventilation.</p>\n<p>The helmet still doesn’t feel particularly airy, though there is enough venting to feel airflow while commuting in near 90-degree midday heat.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-side-glasses.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-side-glasses\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-side-glasses.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-side-glasses.jpg?width=190 190w\" /><figcaption>The vents are large enough for tufts of my hair to poke through the helmet. This happens to me with every helmet simply because my hair sticks up, but against the white helmet shell, it is especially obvious. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p>Thousand says that compared to their original Heritage helmet, the Heritage 2.0 fits folks with a rounder head for a more inclusive fit overall. Helmet padding has also been updated to accentuate the helmet’s new ventilation channels.</p>\n<p>Thousand offers an accident replacement program with the purchase of a Heritage helmet. That means if you damage your helmet in an accident, they replace it for free. Further, Thousand offsets 110 percent of the production of each helmet through carbon offset credits.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-inside\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside.jpg?width=190 190w\" /><figcaption>No MIPS slip plane here. The Heritage helmet does have new ventilation channeling, however, something you likely won’t find from other helmets at a similar price point. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p>Each Heritage helmet features include a faux-leather strap that is color-matched to your helmet’s shell color. It also uses a magnetic Fidlock buckle, so you don’t get pinched whenever you buckle your helmet. And finally, there’s a small indent with a magnetic backing that will fit a Thousand-specific tail light. According to Thousand, availability for said light should be later this year.</p>\n<p>The Heritage helmet is available in three sizes and a broad array of colors. I received the Thousand Heritage helmet in size small and the ‘Speedway Creme’  colorway. Thousand doesn’t have a quoted weight, but my personal helmet weighed in at 440 grams.</p>\n<p>This is about the expected weight for a commuter helmet, but it is about a quarter-pound on your head heavier if you’re coming from a road or mountain bike helmet of equal pricing. It may not sound like much, but I felt a difference on longer commutes.</p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-rolling.jpg?width=730\" alt width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-rolling.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-rolling.jpg?width=190 190w\" /><figcaption>I’m not on a motorcycle. I’m not even riding equestrian. I’m on my hog, an electric Orbea Katu-E. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<h2>Commuting with the Heritage</h2>\n<p>I wish I could consider myself an aesthete or someone who cares deeply about the presentation of themselves and their belongings.<span> </span></p>\n<p>Let’s start with sizing. Thousand’s helmets fit far larger than just about any helmet I’ve tried. I am generally smack dab in the middle of size medium in helmets, but for the Heritage, I found my head was either swimming in the size medium or on the large end of a size small. My head felt most comfortable in a size small, but the helmet buckle never quite feels exactly where I want it.<span> </span></p>\n<p>A major case of try before you buy if possible.<span> </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-glasses-front.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-glasses-front\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-glasses-front.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-glasses-front.jpg?width=190 190w\" /><figcaption>Because I am in between sizes, the straps don’t fall perfectly along my head and to my chin. The helmet is still plenty comfortable but I would’ve much preferred the buckle to fall perfectly below my head. You know, for the aesthetics. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p>I am usually one to bring my helmet with me whenever I lock up my bike, but Thousand designed the Heritage to have a lock threaded through. I tried my two go-to locks: an Abus Bordo Granit 6500 folding lock and a Kryptonite New York U-lock. The folding lock was too thick to thread through the helmet’s dedicated hole. My U-lock, which I made as short as possible to make it more difficult to pry open, did not have enough space to lock both a bike and helmet safely.</p>\n<p>The lock you end up threading through this helmet needs to be either more flexible, thinner, or longer to make the port work. Think about a cable lock or a thinner U-lock with a bit of length to accommodate the helmet. Again, try before you buy if you can.<span> </span></p>\n<p>And that comes back to the sheer idea of wearing a helmet. I avoided wearing a helmet while commuting for a number of years, either because I was uncomfortable, because I didn’t want to carry around my helmet, or because I thought my helmet was ugly. The latter is an admittedly silly reason not to wear a helmet, but I would’ve worn this one in this colorway.</p>\n<p><span>That alone makes this a worthwhile helmet in my eyes, despite the extra weight and average ventilation.</span></p>\n<h2>Conclusion</h2>\n<p>This might be a bit of a misnomer, but I think the Thousand Heritage is a helmet for everyone else, but not necessarily for everyone. Many cyclists will be better served by a more traditional-looking helmet, as they will be lighter and better ventilated. However, if you dislike how other helmets look or feel, the Heritage is about as polished as any other helmet I’ve used.</p>\n<p>Folks make compromises all the time in the name of good looks. While there are compromises to be made with the Thousand Heritage helmet, its good looks and solid feature set outweigh them.</p>\n<p>Price: $99</p>\n<p><a href=\"https://www.explorethousand.com/\" target=\"_blank\">explorethousand.com</a></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-back.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-back\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-back.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-back.jpg?width=190 190w\" /><figcaption>The adjustment dial is nondescript. Basic but easy to use. Above the dial is the helmet’s spot for a Thousand taillight that clips on via magnets. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-front\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front.jpg?width=190 190w\" /><figcaption>C’mon, this definitely looks more equestrian helmet than a vintage moto helmet. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-fidlock-buckle.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-fidlock-buckle\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-fidlock-buckle.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-fidlock-buckle.jpg?width=190 190w\" /><figcaption>Faux leather (or vegan leather) looks good, doesn’t wear with sweat, and still offers a premium feel over traditional nylon straps. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure></figure>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside-lock.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-inside-lock\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside-lock.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-inside-lock.jpg?width=190 190w\" /><figcaption>The magnetic lock port from the inside, with a small strap to keep the port door in place. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure></figure>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front-side-1.jpg?width=730\" alt=\"Thousand-Heritage-2-helmet-review-front-side\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front-side-1.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Thousand-Heritage-2-helmet-review-front-side-1.jpg?width=190 190w\" /><figcaption>I love this colorway and the brown faux leather straps in particular. And if you don’t, there are plenty of other options available. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"78d95bd41450a6caab5adfd898cb26715e2c0096f76624ed3753e95049339bbb","category":"Cycling"}