{"title":"From Plants to Pixels: The Role of Artificial Intelligence in Identifying Sericea Lespedeza","link":"https://www.preprints.org/manuscript/202404.1002/v1","date":1713257539000,"content":"The increasing use of Convolutional Neural Networks (CNN) has brought about a significant transformation in numerous fields, such as image categorization and identification. In the development of a CNN model for classifying images of sericea lespedeza (SL; Lespedeza cuneata) from weed images, four architectures were explored: CNN-Model Variant 1, CNN-Model Variant 2, VGG16, and ResNet50. The CNN-Model Variant 1 demonstrated 100 % validation accuracy, while Variant 2 achieved 90.78% validation accuracy. Pre-trained models, like VGG16 and ResNet50, were also analyzed. In contrast, ResNet50's steady learning pattern indicated potential for better generalization. A detailed evaluation of these models revealed that Variant 1 achieved a perfect score in precision, recall, and F1-score, indicating superior optimization and feature utilization. Variant 2 presented a balanced performance, with metrics between 86% and 93%. The VGG16 mirrored the behavior of Variant 2, both maintaining around 90% accuracy, but ResNet50's results revealed a conservative approach for class 0 predictions. Overall, Variant 1 stood out in performance, while both Variant 2 and VGG16 showed balanced results. The reliability of CNN model Variant 1 is highlighted by the significant accuracy percentages, which demonstrate its potential for practical implementation in agriculture. Smartphone application for the identification of SL in a field-based trial has shown promising results with an accuracy of 98%-99%. Using a CNN model with batch normalization has the potential to play a crucial role in redefining and optimizing the management of undesirable vegetation in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"78dd529856b1d6f162b061fe4b71c37035b14d19d2e8c000ed4259320535f4e1","category":"Interdisciplinary"}