{"title":"iOS 17.4 beta brings major App Store changes in the EU, including alternate stores","link":"https://www.macworld.com/article/2218208/ios-17-4-beta-eu-app-store-changes-features-install.html","date":1706210368000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you live in the European Union, iOS 17.4 is going to be a massive upgrade for you. Apple began beta-testing the update on January 25 and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">outlined many of the changes in a press release</a>.</p>\n\n\n\n<p>The primary aim of this release is to comply with the Digital Markets Act in the EU, which has a deadline of March 6. We expect Apple to release iOS 17.4 sometime close to that date.</p>\n\n\n\n<p>There are 600 new APIs, expanded app analytics, functionality for alternative browser engines, access to NFC for mobile payment systems, and options for processing app payments and distributing iOS apps outside the App Store. Commissions are reduced as well, down to 10 percent for the first year for most developers (and for subscriptions past the first year) and 17 percent for all digital transactions. That’s a cut nearly in half compared to rates in the rest of the world.</p>\n\n\n\n<h2>What’s new in iOS 17.4</h2>\n\n\n\n<p>There are no release notes yet for iOS 17.4, but an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2024/01/apple-announces-changes-to-ios-safari-and-the-app-store-in-the-european-union/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple press release</a> goes over all the changes meant for the EU. They include:</p>\n\n\n\n<ul>\n<li><strong>New options for distributing iOS apps from alternative app marketplaces</strong>: New APIs and tools that enable developers to offer their iOS apps for download from alternative app marketplaces.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>New framework and APIs for creating alternative app marketplaces</strong>: Marketplace developers can install apps and manage updates on behalf of other developers from their dedicated marketplace app.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>New frameworks and APIs for alternative browser engines</strong>: Developers can use browser engines, other than WebKit, for browser apps and apps with in-app browsing experiences.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Interoperability request form</strong>: Developers can submit additional requests for interoperability with iPhone and iOS hardware and software features.</li>\n</ul>\n\n\n\n<p>There are new app safety features as well, meant to mitigate the risks Apple says are inherent in getting apps from places other than the App Store:</p>\n\n\n\n<ul>\n<li><strong>Notarization for iOS apps</strong>: A baseline review that applies to all apps, regardless of their distribution channel, focused on platform integrity and protecting users. Notarization involves a combination of automated checks and human review. </li>\n</ul>\n\n\n\n<ul>\n<li><strong>App installation sheets</strong>: Use information from the Notarization process to provide at-a-glance descriptions of apps and their functionality before download, including the developer, screenshots, and other essential information.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Authorization for marketplace developers</strong>: Ensures marketplace developers commit to ongoing requirements that help protect users and developers.</li>\n</ul>\n\n\n\n<ul>\n<li><strong>Additional malware protections</strong>: Prevents iOS apps from launching if they’re found to contain malware after being installed on a user’s device.</li>\n</ul>\n\n\n\n<h2>iOS 17.4: How to install the public beta</h2>\n\n\n\n<p>If you want to be among the first to test iOS 17, you can sign up for the public beta test. The process for installing a beta has changed in iOS 16.4. Here’s how the new process works now:</p>\n\n\n\n<ol>\n<li>Click Sign Up on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Beta page</a> and register with your Apple ID.</li>\n\n\n\n<li>Log in to the Beta Software Program.</li>\n\n\n\n<li>Click <em>Enroll your iOS device</em>.</li>\n\n\n\n<li>Open the <em>Settings</em> app, tap <em>General</em>, then <em>Software Update</em>.</li>\n\n\n\n<li>In the Beta Updates section, select the iOS Public Beta.</li>\n</ol>\n\n\n\n<p>It may take a few moments after registering for the beta option to appear in Software Update.</p>\n\n\n\n<h2>iOS 17.4: How to install the developer beta</h2>\n\n\n\n<p>You’ll need to be registered as an Apple developer. Beginning with iOS 17, you don’t need to be in the $99 per year developer program to access the developer beta. A free developer account will do. You can get one via Xcode or the Apple Developer app in iOS. Here’s how to do it via the Apple Developer app:</p>\n\n\n\n<ol>\n<li>Download the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/apple-developer/id640199958&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Developer App</a> from the App Store.</li>\n\n\n\n<li>Open the app.</li>\n\n\n\n<li>Tap on Account.</li>\n\n\n\n<li>Sign in using your usual Apple ID.</li>\n</ol>\n\n\n\n<p>If you want to sell applications to the App Store you’ll need to pay $99/£79 per year for a paid account. Sign up to the Apple Developer Program (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">here</a>) or through Apple’s Developer App. You can <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/support/compare-memberships&amp;xcust=1-1-2218208-1-0-0&amp;sref=https://www.macworld.com/feed\">compare the free and paid accounts here</a>.</p>\n\n\n\n<p>Registered developers can choose to get the Public Beta instead by selecting <em>iOS Public Beta</em> in the Software Update screen. It may take a little time after registering as a developer for the option to appear in Software Updates.</p>\n\n\n\n<p>Some developers have an Apple ID registered for developer access that is different from the Apple ID associated with their personal Apple account and data. To use a different Apple ID for beta access than is used throughout the rest of iOS, open <em>Settings</em> &gt; <em>General</em> &gt; <em>Software Update</em> &gt; <em>Beta Updates</em> and select the Apple ID at the bottom of the screen.</p>\n\n\n\n<p>Find out everything you need to know about iOS 17 in our <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17 superguide</a>.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"78e178e08032518316d78481ac79c756569d2fd71251daaa64045032aadb0947","category":"Apple"}