{"title":"Barriers and Recommendations for Establishing a COVID-19 Patient Registry in a Regional Setting in the Philippines","link":"https://www.preprints.org/manuscript/202408.2079/v1","date":1724868953000,"content":": The global impact of the COVID-19 pandemic has resulted in substantial morbidity and mortality rates. Consequently, there is a pressing need for clinical research focused on the prevention, diagnosis, and treatment of this disease. To comprehensively study the course of COVID-19 in the Philippine population, it is essential to have a comprehensive dataset that includes relevant treatment and diagnostic information. While individual patient reports related to the disease are available at various institutions in the Philippines, there is a need for a more extensive and representative database to facilitate robust analysis. The purpose of this review is to elucidate various challenges and opportunities as well as propose solutions for the development and implementation of a prospective COVID-19 patient registry within a regional context in the Philippines. The primary clinical objective of establishing this registry was to enhance the accuracy of disease diagnosis. In this review, we present a comprehensive explanation of the systematic rationale, design, and execution of a COVID-19 patient registry in the Western Visayas region of the Philippines. Based on this review, several factors exist that hinder the implementation of a COVID-19 patient registry in the regional setting in the Philippines including lack of funding, facilities, infrastructure, manpower, expertise, and unwillingness of some hospitals to pursue research. We also discussed herewith the proposed program implementation for the establishment of such registry in a regional setting in the Philippines.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"78f2f8a872dc66248dc612e4d548ab57b935cc4ae9f6a5ebf03412954fd11333","category":"Interdisciplinary"}