{"title":"Nacer Bouhanni is still a nightmare","link":"https://cyclingtips.com/2021/03/nacer-bouhanni-is-still-a-terror/","date":1616980800000,"content":"<p>There aren&#8217;t many professional cyclists with a section titled &#8220;Incidents&#8221; on their Wikipedia page. Nacer Bouhanni has many incidents.</p>\n\n\n\n<p>There was the time he hit Jack Bauer at the 2017 Tour de France. And the time he had to be physically separated from Rudy Barbier after Barbier won Paris-Bourges. Or the time he was accused of a &#8220;violent altercation&#8221; with his own director, Roberto Damiani, at Eschborn-Frankfurt. The list goes on.  </p>\n\n\n\n<p>There are only so many headlines one can write about fistfights and pugilism and a history as a boxer before you start to wonder if such things belong in bike racing. </p>\n\n\n\n<p>On Sunday, Bouhanni was disqualified from the one-day Cholet-Pays de la Loire, won by Elia Viviani, after swinging hard from the right side of his leadout man to the far left, pinning Groupama-FDJ&#8217;s Jake Stewart against the barriers. </p>\n\n\n\n<p>Stewart hit the barrier, leaned against it, but managed to keep it upright. He went from contesting the sprint to finishing in 29th. </p>\n\n\n\n<p>Despite Bouhanni&#8217;s long list of &#8220;incidents,&#8221; the penalty for this latest dangerous move was a disqualification. The maneuver could very easily have resulted in a major crash. </p>\n\n\n\n<p>This stands in stark contrast to the penalty for a nearly identical move from Dylan Groenewegen, which had far more disastrous consequences but was, at its core, not any worse than what Bouhanni did on Sunday. </p>\n\n\n\n<p>The jury&#8217;s decision at Cholet-Pays de la Loire further amplifies the arbitrary feel of Groenewegen&#8217;s nine-month ban. Groenewegen&#8217;s maneuver at the Tour of Poland was no more (and possibly less) egregious, but the outcome was compounded by a complete failure of the barriers, resulting in a disastrous crash and horrible injuries. The disparity in penalty, given nearly identical transgressions, is jarring. </p>\n\n\n\n<p>Under the current rules, the UCI clearly penalizes outcomes, not actions. </p>\n\n\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Yo <a href=\"https://twitter.com/BouhanniNacer?ref_src=twsrc%5Etfw\">@BouhanniNacer</a> I would ask you what you was thinking&#8230;but you clearly have no brain cells. The ironic thing is, you told me I had &#8216;no respect&#8217; after the finish. Here&#8217;s an educational video of what &#8216;no respect&#8217; looks like&#8230; 😶 <a href=\"https://t.co/nk5Bp6lE0V\">https://t.co/nk5Bp6lE0V</a></p>— Jake (@jakey_stewart) <a href=\"https://twitter.com/jakey_stewart/status/1376221314021789700?ref_src=twsrc%5Etfw\">March 28, 2021</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/nacer-bouhanni-is-still-a-terror/\">Nacer Bouhanni is still a nightmare</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Caley Fretz","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"78f506ef1f02cd0dcbf6d45a2eeb5896e4adb6b8a38b6e2bcd40312425a7a7b6","category":"Cycling"}