{"title":"Nutrient enrichment—but not warming—increases nitrous oxide emissions from shallow lake mesocosms","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12709?af=R","date":1728768808000,"content":"<h2>Abstract</h2>\n<p>Shallow lakes and ponds play a crucial role in the processing of carbon and other nutrients. However, many lakes and ponds worldwide are affected by climate change and nutrient pollution. How these pressures affect the emission of the greenhouse gas nitrous oxide (N<sub>2</sub>O) is unclear. Warming and eutrophication are expected to increase the production and emission of N<sub>2</sub>O in lakes and ponds, but changes in ecological structure and function may complicate these seemingly straightforward relationships. In this study, we used the world's longest running, mesocosm-based, freshwater climate change experiment to disentangle the effect of nutrient enrichment and warming on N<sub>2</sub>O emissions. We gathered a large dataset on N<sub>2</sub>O concentrations and ancillary variables, comprising three sampling campaigns between 2011 and 2020 and a total of 687 individual mesocosm measurements. Our results demonstrated that nutrient enrichment increased N<sub>2</sub>O emissions, while warming (+2.5–4.0°C and +3.75–6.0°C) had no discernable effect. Our study indicates that curtailing nitrogen influxes into lakes and ponds is the most effective strategy to minimize N<sub>2</sub>O emissions, and while warming may influence N<sub>2</sub>O emissions, it does not appear to be a direct driver. These findings underscore the importance of prioritizing nitrogen mitigation efforts to curb N<sub>2</sub>O emissions from shallow lakes and ponds.</p>","author":"Joachim Audet, \nEti E. Levi, \nErik Jeppesen, \nThomas A. Davidson","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"78ff6dc31cbbacfee9553a3e0a6df21171214fa371eeb85d19ef7dd5de2eadd7","category":"Environment"}