{"title":"Digital descriptors sharpen classical descriptors, for improving genebank accession management: A case study on <i>Arachis</i> spp. and <i>Phaseolus</i> spp.","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302158","date":1714658400000,"content":"<p>by Diego Felipe Conejo-Rodríguez, Juan José Gonzalez-Guzman, Joaquín Guillermo Ramirez-Gil, Peter Wenzl, Milan Oldřich Urban</p>\r\n\r\nHigh-throughput phenotyping brings new opportunities for detailed genebank accessions characterization based on image-processing techniques and data analysis using machine learning algorithms. Our work proposes to improve the characterization processes of bean and peanut accessions in the CIAT genebank through the identification of phenomic descriptors comparable to classical descriptors including methodology integration into the genebank workflow. To cope with these goals morphometrics and colorimetry traits of 14 bean and 16 forage peanut accessions were determined and compared to the classical International Board for Plant Genetic Resources (IBPGR) descriptors. Descriptors discriminating most accessions were identified using a random forest algorithm. The most-valuable classification descriptors for peanuts were 100-seed weight and days to flowering, and for beans, days to flowering and primary seed color. The combination of phenomic and classical descriptors increased the accuracy of the classification of <i>Phaseolus</i> and <i>Arachis</i> accessions. Functional diversity indices are recommended to genebank curators to evaluate phenotypic variability to identify accessions with unique traits or identify accessions that represent the greatest phenotypic variation of the species (functional agrobiodiversity collections). The artificial intelligence algorithms are capable of characterizing accessions which reduces costs generated by additional phenotyping. Even though deep analysis of data requires new skills, associating genetic, morphological and ecogeographic diversity is giving us an opportunity to establish unique functional agrobiodiversity collections with new potential traits.","author":"Diego Felipe Conejo-Rodríguez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"790155c860a28feedaf102929e9b7958876d13c3e221d3d1153efffb2d7ddf83","category":"Interdisciplinary"}