{"title":"One Health Scoping Review of the Epidemiology of Human Fascioliasis across Africa for the Period 2000&ndash;2022","link":"https://www.preprints.org/manuscript/202404.1585/v1","date":1714050458000,"content":"(1)Background: Fascioliasis is considered a neglected tropical disease affecting an estimated 17 million people in more than 70 countries worldwide. The highest prevalence of human fascioliasis is found in regions where livestock farming and consumption of raw or undercooked freshwater plants are common, such as parts of Africa, Asia, Europe, and Latin America. It is responsible for over 90,000 disability-adjusted years of life due to associated abdominal complications. We conducted a study to investigate the prevalence of human fascioliasis through a systematic review and meta-analysis of all available literature in Sun-Saharan Africa.(2). Methods: We screened a total of 126 publications using pubmed online search engine databases; Web of Science and CAB for articles published within a 20-year period between 2000 and 2022. We used a comprehensive search method using a combination of terms, parasite and disease names. The initial search resulted in a screening of articles by title, abstracts and full texts. The relevant information on the prevalence of human fascioliasis in Africa was extracted. Of the 126 publications, 33 articles were selected for meta-analysis. The essential information required was extracted from these documents and determined through statistical analysis in Microsoft Excel for calculating the prevalence of human fascioliasis in sub-Saharan Africa. The variance of each study was assessed using a bimodal distribution and heterogeneity assessment using a I2 index. Analysis was performed using random effects models.(3)Results: A total of 271 articles were searched through the database search and 33 articles were eligible studies that provided qualitative information on the prevalence of human fascioliasis in Africa. These make up 12.17% (n=33). The pooled prevalence estimates for human fascioliasis are 0.032% (IVhet PPE: 0.032% (95%CI 1.4-6.53). The highest prevalence rate was observed in Egypt with a prevalence of 100%. The prevalence of human fascioliasis is very high in some sub-Saharan countries, partly due to neglect of diagnostics, demonstrating the bias of available information for decision-making in human fascioliasis across Africa, given the spatial presence, scarcity and incompleteness are region.(4)Conclusions: The prevalence of Human fascioliasis is very high in some Sub-Saharan Countries partly due to neglect in diagnostics. This presents how highly focal with spatial occurrences, scarcity and patchy the available information for decision making is on Human fascioliasis across the Sub-Saharan African region.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"790481ee5cbed55fec6bf1aa0c2a50c8a2a81e05a3ff41f9ae7ceb468be89109","category":"Interdisciplinary"}