{"title":"iPhone 17 Pro to Feature Apple-Designed Wi-Fi 7 Chip, Analyst Predicts","link":"https://www.macrumors.com/2023/12/15/iphone-17-pro-apple-wifi-7-chip-rumor/","date":1702656427000,"content":"iPhone 17 Pro models in 2025 will be equipped with an Apple-designed Wi-Fi 7 chip, according to Jeff Pu, an analyst who covers companies within Apple's supply chain.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/01/Apple-Wi-Fi-Chip-Feature-Triad.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nIn a research note this week with Hong Kong-based investment firm Haitong International Securities, Pu said the chip could be a long-term threat to Broadcom, which currently supplies Apple with a combined Wi-Fi and Bluetooth chip for iPhones.\r<br />\n\r<br />\nPu believes Apple will expand its in-house Wi-Fi chip to the entire iPhone 18 series in 2026. He did not share any additional details about the chip.\r<br />\n\r<br />\nIn January, <em>Bloomberg</em>'s Mark Gurman reported that Apple was <a href=\"https://www.macrumors.com/2023/01/09/apple-in-house-modem-chips-2024/\">developing its own combined Wi-Fi and Bluetooth chip</a> for use in devices starting in 2025. Later that month, however, supply chain analyst Ming-Chi Kuo said it was a Wi-Fi-only chip and said <a href=\"https://www.macrumors.com/2023/01/26/apple-designed-wi-fi-chip-paused/\">Apple had paused development \"for a while.\"</a> It's unclear if development has resumed.\r<br />\n\r<br />\nLike its <a href=\"https://www.macrumors.com/2023/11/16/apple-in-house-5g-modem-delays/\">long-rumored 5G modem</a> for iPhones, the Wi-Fi chip would allow Apple to further reduce its dependance on external suppliers for components.\r<br />\n\r<br />\nWi-Fi 7 support would allow iPhone 17 Pro models to send and receive data over the 2.4GHz, 5GHz, and 6GHz bands simultaneously with a supported router, resulting in faster Wi-Fi speeds, lower latency, and more reliable connectivity. Wi-Fi 7 can provide peak speeds of over 40 Gbps, a 4× increase over Wi-Fi 6E, according to Qualcomm.\r<br />\n\r<br />\nIn August, Pu said the iPhone 16 Pro models launching next year would also <a href=\"https://www.macrumors.com/2023/08/15/iphone-16-pro-wifi-7-48mp-ultra-wide-rumors/\">feature Wi-Fi 7 support</a>, but not with an Apple-designed chip.<div>Tags: <a href=\"https://www.macrumors.com/guide/jeff-pu/\">Jeff Pu</a>, <a href=\"https://www.macrumors.com/guide/iphone-17/\">iPhone 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/15/iphone-17-pro-apple-wifi-7-chip-rumor/\">iPhone 17 Pro to Feature Apple-Designed Wi-Fi 7 Chip, Analyst Predicts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-17-pro-to-feature-apple-designed-wi-fi-7-chip-analyst-predicts.2413826/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"790b786e32b343d35f1279c6ff3f3d18b49aa0ddc7134cf5b212e8fae69f59cc","category":"Apple"}