{"title":"Compositional and Structural Mapping of Northwest Africa 15507 Angrite","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.008/7719421?rss=1","date":1721779200000,"content":"<span>Angrite meteorites represent interesting sampling of planetary crustal environments. Quench-textured angrites with strong crystal zoning originated from the shallow surface region, with evidence of reducing conditions during solidification. Plutonic angrites have more coarse-grained igneous and metamorphic textures with comparatively less zoning and are interpreted as having equilibrated at greater depth. Plutonic angrites contain the minerals magnetite Fe<sub>3</sub>O<sub>4</sub> comprised of Fe<sup>2+</sup> and Fe<sup>3+</sup>, and rhönite, where Fe<sup>3+</sup> is required by inspection of mineral stoichiometry. NWA 15507 is a plutonic angrite with a microgabbroic texture (mean grainsize ∼1.4 mm) composed of zoned Al-Ti-augite, Ca-bearing olivine, anorthite, with accessory kirschsteinite, rhönite, hercynite, low-Ni kamacite, merrillite, Ti-free magnetite and troilite [<a href=\"#ozae044.008-B1\">1</a>]. Rhönite analyzed by electron-probe microanalysis (EPMA) has the formula Ca<sub>2.04</sub>(Mg<sub>0.32</sub>Fe<sup>2+</sup><sub>4.25</sub>Fe<sup>3+</sup><sub>0.47</sub>Ti<sub>0.33</sub>Al<sub>0.61</sub>)(Si<sub>3.74</sub>Al<sub>2.26</sub>)O<sub>20</sub>, where Fe<sup>3+</sup> was estimated by stoichiometric analysis. During preliminary cathodoluminescence (CL) analysis, complex subgrain and oscillatory zoning was observed in the anorthite. In this study we use a combined approach of electron probe microanalysis (EPMA), cathodoluminescence (CL), electron-backscatter diffraction (EBSD), and laser ablation inductively-coupled plasma mass spectrometry (LA-ICP-MS) to further investigate the anorthite and distribution of Fe<sup>3+</sup> in NWA 15507.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"791a1ee734c26270157c5e4b8942e82608401faeefe1d25c53aae1833b5ae2e0","category":"Environment"}