{"title":"Digital health interventions for improving access to primary care in India: A scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002645","date":1715695200000,"content":"<p>by Lenny Vasanthan, Sindhu Kulandaipalayam Natarajan, Andrew Babu, Mohan S. Kamath, Sureshkumar Kamalakannan</p>\r\n\r\nAccess to quality healthcare remains a challenge in low-and middle-income countries. Vulnerable populations with unmet needs face the greatest challenge in accessing primary care for appropriate and timely healthcare. The use of digital technologies can not only strengthen health systems but also improve access to health care, particularly for the vulnerable. This scoping review aims to assess the various digital health technologies and interventions available for improving access to primary care for the vulnerable in India. This scoping review employed the Joanna Brigg Institute’s (JBI) guidelines and Arksey and O’Malley’s methodological framework. The literature search was conducted in Medline/PubMed, Embase, Web of Science—Core Collection, Scopus, AgeLine, PsycINFO, CINAHL, ERIC, Cochrane CENTRAL, and Cochrane Effective Practice and Organisation of Care (EPOC) Group Specialised Register databases, using the keywords, such as ‘Access’, ‘Healthcare’, ‘Assistive technology’, ‘Digital health’ ‘Vulnerable’, ‘India’ and ‘Healthcare technology’. A two-staged screening of titles and abstracts, followed by full-text was conducted independently by two reviewers, using the Rayyan software. Subsequently, the data was extracted from selected studies using a pre-designed and approved extraction form. The data was then synthesised and analysed narratively. The protocol for this review has been registered with open science forum (OSF) registries (https://osf.io/63pjw/). The search yielded about 3840 records, 3544 records were eligible for screening of titles and abstracts. We included seven studies after a two-round screening and identified seven different technological innovations developed to bridge gaps in access to primary care. The commonly used digital health interventions for improving access to primary care were virtual tele-health systems and mHealth applications in-built within an android smartphone or a tablet. Digital health interventions was either used as a standalone tele-health aid or a collaborative system for community workers, primary care physicians as well as the health service users. The purpose of these innovations was to increase awareness and knowledge to access support for specific aspects of healthcare. Virtual primary health care with the specialist in the hub supporting general physicians at the primary health centres in blocks and districts was another such model used for improving access to primary care. Digital health interventions was also used for mass community screening of disabilities, such as persons with hearing disability. To re-imagine a digitally empowered health systems in India, also inclusive of the vulnerable, it is important to inclusively conceptualise, systematically develop and rigorously evaluate any public health interventions including those that are enabled by digital health interventions to bridge the gaps in access to primary care in India. Such a strategy could address the paucity of evidence in public health interventions and provide sustainable strategies to strengthen health systems in India.\r\nTrial registration: Open Science Framework—Registration Link: https://osf.io/63pjw/.","author":"Lenny Vasanthan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7925ad59fa7861fb4f59ce3d166e338f3ce0f15e75ec3e76074405c20e980b18","category":"Environment"}