{"title":"Temperature acclimation and response to acute thermal stress in the adults of the snow crab Chionoecetes opilio Fabricius, 1788 (Decapoda: Brachyura: Oregoniidae)","link":"https://academic.oup.com/jcb/article/doi/10.1093/jcbiol/ruae040/7710328?rss=1","date":1720569600000,"content":"<span><div>ABSTRACT</div>Ectothermic marine animals vary widely in their tolerance to temperature changes, and polar stenothermal species seem to have poor ability to compensate for a rise in water temperature. The sub-Arctic snow crab (<span>Chionoecetes opilio</span><a href=\"#CIT0017\">Fabricius, 1788</a>) lives in the northwestern Atlantic Ocean and northern Pacific Ocean at temperatures ranging from about −1.5 °C to 4 °C. Since the metabolic costs overtake caloric intake above 7 °C, the snow crab appears to be energetically restricted to cold water. We investigated thermal stress responses in adult male crabs exposed to a sudden temperature increase to 9.5 °C for 24 hr after four weeks of acclimation at 2.5 °C or 5.5 °C. Heart-rate loggers implanted in a limited number of crabs showed 60% increase in cardiac activity during the thermal stress. Surplus oxygen supply in all crabs was inferred by the low hemolymph lactate and unchanged glucose levels, but only the crabs acclimated at 5.5 °C were still active at the elevated temperature. Low heat shock and oxidative stress responses were suggested by the missing upregulation of the genes encoding four heat shock proteins (Hsp70a, Hsc71, Hsp90a2, Hsp60) and the antioxidative enzymes superoxide dismutase and catalase. The trend towards inverse temperature-dependent on the expression of the <span>hsp</span> genes may be related to increased protein damage at low temperatures, or possible trade-offs between costs and benefits of producing heat shock proteins at elevated temperature. Although adult snow crabs seem to be able to cope with short-term heat stress, the tolerance to chronic elevated temperatures should be further examined using a larger number of individuals.</span>","author":"","siteTitle":"Journal of Crustacean Biology Current Issue","siteHash":"8ca07ea220dbc7082c62912ab6b47a7a5a309f6e19a7257844b27bf0267b5f04","entryHash":"793a421747011a7453d91a2cfd8db4899db0acc0e0624a70ed217266b9681aea","category":"Environment"}