{"title":"Health officials rail against Pfizer’s push for COVID boosters—for many reasons","link":"https://arstechnica.com/?p=1779560","date":1626122136000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/GettyImages-1230360472-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/01/GettyImages-1230360472.jpg\">Enlarge</a> <span>/</span> Vials of undiluted Pfizer COVID-19 vaccine. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/vials-of-undiluted-pfizer-covid-19-vaccine-are-prepared-to-news-photo/1230360472?adppopup=true\">Getty | BRENDAN SMIALOWSKI </a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Pfizer has planned to privately brief US health officials on its case for COVID-19 booster shots, but US and global public health officials have not hesitated to publicly blast the idea, calling booster shots unnecessary at this time and unethical in the face of vast inequity in the global vaccine supply.</p>\n<p>Pfizer and its vaccine partner BioNTech made headlines last Thursday with the announcement that it would seek authorization from the Food and Drug Administration in the coming weeks for a booster shot to its two-shot regimen. The companies suggest that a third shot will be necessary between six and 12 months after the second dose. During this window, immunity to the pandemic coronavirus declines, the companies say, particularly in the elderly. A third shot, they say, can boost antibody levels five to 10 times what is seen after the first two.</p>\n<p>But health officials were quick to push back on the booster talk last week, and the responses have only grown more intense in the days since.</p></div><p><a href=\"https://arstechnica.com/?p=1779560#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779560&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7946f909428993ff779eb4cc13aecfde496f15ed2d2c30b6612e28d1a033ae6f","category":"Tech"}