{"title":"Feasibility, acceptability and equity of a mobile intervention for Upscaling Participatory Action and Videos for Agriculture and Nutrition (m-UPAVAN) in rural Odisha, India","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003206","date":1715695200000,"content":"<p>by Emily Fivian, Manoj Parida, Helen Harris-Fry, Satyanarayan Mohanty, Shibanath Padhan, Ronali Pradhan, Pranay Das, Gladys Odhiambo, Audrey Prost, Terry Roopnaraine, Satyaranjan Behera, Philip James, Naba Kishor Mishra, Suchitra Rath, Nirmala Nair, Shibanand Rath, Peggy Koniz-Booher, Heather Danton, Elizabeth Allen, Suneetha Kadiyala</p>\r\n\r\nAddressing undernutrition requires strategies that remove barriers to health for all. We adapted an intervention from the ‘UPAVAN’ trial to a mobile intervention (m-UPAVAN) during the COVID-19 pandemic in rural Odisha, India. In UPAVAN, women’s groups viewed and discussed participatory videos on nutrition-specific and nutrition-sensitive agricultural (NSA) topics. In m-UPAVAN, weekly videos and audios on the same topics were disseminated via WhatsApp and an interactive voice response system. We assessed feasibility, acceptability, and equity of m-UPAVAN using a convergent parallel mixed-methods design. m-UPAVAN ran from Mar-Sept 2021 in 133 UPAVAN villages. In Feb-Mar 2021, we invited 1000 mothers of children aged 0–23 months to participate in a sociodemographic phone survey. Of those, we randomly sampled 200 mothers each month for five months for phone surveys to monitor progress against targets. Feasibility targets were met if &gt;70% received videos/audios and &gt;50% watched/listened at least once. Acceptability targets were met if &gt;75% of those watching/listening liked the videos/audios and &lt;20% opted out of the intervention. We investigated mothers’ experiences of the intervention, including preferences for m-UPAVAN versus UPAVAN, using in-person, semi-structured interviews (<i>n</i> = 38). Of the 810 mothers we reached, 666 provided monitoring data at least once. Among these mothers, feasibility and acceptability targets were achieved. m-UPAVAN engaged whole families, which facilitated family-level discussions around promoted practices. Women valued the ability to access m-UPAVAN content on demand. This advantage did not apply to many mothers with limited phone access. Mothers highlighted that the UPAVAN interventions’ in-person participatory approaches and longer videos were more conducive to learning and inclusive, and that mobile approaches provide important complementarity. We conclude that mobile NSA interventions are feasible and acceptable, can engage families, and reinforce learning. However, in-person participatory approaches remain essential for improving equity of NSA interventions. Investments are needed in developing and testing hybrid NSA interventions.","author":"Emily Fivian","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"794ae978e3a53427a4cb7fe5d6ff44c5e9912e39578748e76d5cb390a5090a99","category":"Environment"}