{"title":"A Novel Latency Composition Analysis for Telerobotic Performance Insights Across Various Network Scenarios","link":"https://www.preprints.org/manuscript/202410.1376/v1","date":1729157804000,"content":"Telerobotics involves the operation of robots from a distance, often using advanced communication technologies combining wireless and wired technologies and a variety of protocols. This application domain is crucial because it allows humans to interact with and control robotic systems safely and from a distance, often performing activities in hazardous or inaccessible environments. Thus, by enabling remote operations, telerobotics not only enhances safety but also expands the possibilities for medical and industrial applications. In some use cases, telerobotics bridges the gap between human skill and robotic precision, making the completion of complex tasks requiring high accuracy possible without being physically present. With the growing availability of high-speed networks around the world, especially with the advent of 5G cellular technologies, applications of telerobotics can now span the gamut of scenarios ranging from remote control in the same room to robotic control across the globe. However, there are a variety of factors that can impact the control precision of the robotic platform and user experience by the teleoperator. One such critical factor is latency, especially across large geographical areas or complex network topologies. Consequently, military telerobotics and remote operations, for example, rely on dedicated communications infrastructure for such tasks. However, this creates a barrier to entry for many other applications and domains, as the cost of dedicated infrastructure would be prohibitive. In this paper, we examine the network latency of robotic control over shared network resources in a variety of network settings, such as a local network, access-controlled networks through Wi-Fi and cellular, and also a remote transatlantic connection between Finland and the United States. The aim of this study is to quantify and evaluate the constituent latency components that comprise the control feedback loop of this telerobotics experience - between a camera feed to observe the telerobotic platform's environment by the operator in one direction and the control communications from the operator to the robot in the reverse direction and to subsequently use these insights to optimize the end-to-end latency for optimizing the user experience. The results show stable average round trip latency of 6.6 ms for local network connection, 58.4 ms connecting over Wi-Fi, 115.4 ms connecting through cellular, and 240.7 ms connecting from Finland to the United States over a VPN access-controlled network. These findings pave the way toward a better understanding of the capabilities and performance limitations of telerobotics activities over commodity networks.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"794eebf28247c6cfdf549bd5e9567a81cbdb5ca7bd0fe15c1c6dd698fc6212a2","category":"Interdisciplinary"}