{"title":"Oral bovine serum albumin administration benefits plasma amino acid profile in blunt snout bream fed high‐fat and high‐energy diet through the TOR signaling pathway","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13022?af=R","date":1712550638000,"content":"<h2>Abstract</h2>\n<p>This study investigated the effect of oral bovine serum albumin (BSA) on plasma amino acid profile and growth performance in blunt snout bream fed high-fat and high-energy diets. A total of 360 fish (average weight: 45.84 ± 0.07 g) were randomly divided into three groups in four replicates and fed with the control, high-fat diet (HFD), and high-energy diet (HED), respectively. After 12 weeks of feeding, fish were orally administered with 10% BSA for 10 h, with the blood and liver sample obtained at 10 h. The results showed no remarkable difference (<i>p</i> &gt; 0.05) in final weight, weight gain rate, feed conversion ratio, protein efficiency ratio, and daily growth rate among dietary treatments. However, fish fed HFD and HED obtained significantly higher energy and nitrogen retention content than the control. Plasma valine and histidine content were more prevalent in fish fed the control diet than in HFD and HED groups. However, BSA significantly enhanced this content with higher values observed in arginine and alanine content than in control diets at 10 h. Significantly higher liver and plasma Aspartate aminotransferase, Xanthine oxidase, and Glutamate dehydrogenase content were found in the HFD than in the control group. However, the administration of BSA at 10 h improved these parameters similar to the control. Meanwhile, protease, Lipase, aminopeptidase N, carboxypeptidase A, and Na<sup>+</sup> K<sup>+</sup>-ATPase were influenced significantly (<i>p</i> &lt; 0.001) by sampling time, dietary treatments, and their interaction. Fish fed with the HFD and HED significantly downregulated (<i>p</i> &lt; 0.05) the <i>akt, bcat2, 4e-bp1</i>, <i>s6k1</i>, and <i>tor</i> expression compared to the control. However, BSA administration at 10 h improved these genes similar to the control. This study indicated that oral BSA administration could benefit plasma amino acid through the TOR signaling pathway in blunt snout bream fed high-fat and high-energy diets.</p>","author":"Kenneth Prudence Abasubong, \nGuang‐Zhen Jiang, \nJean‐Jacques Y. Adjoumani, \nHui‐xing Guo, \nXi Wang, \nYang‐yang Huang, \nYong‐Jun Dai, \nXiang‐Fei Li, \nYan‐zou Dong, \nWen‐bin Liu, \nHesham Eed Desouky","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"794e25fa2fb7c880b22ab8be74199783687527d55dacd8a6980857353e886f55","category":"Environment"}