{"title":"A study on assessing the toxic effects of ethyl paraben on rohu (<i>Labeo rohita</i>) using different biomarkers; hemato-biochemical assays, histology, oxidant and antioxidant activity and genotoxicity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302691","date":1715004000000,"content":"<p>by Hasnain Akmal, Shabbir Ahmad, Muddasir Hassan Abbasi, Farhat Jabeen, Khurram Shahzad</p>\r\n\r\nParabens are being used as preservatives due to their antifungal and antimicrobial effects. They are emerging as aquatic pollutants due to their excessive use in many products. The purpose of this study was to determine the toxic effect of ethyl paraben (C9H10O3) on the hematobiochemical, histological, oxidative, and anti-oxidant enzymatic and non-enzymatic activity; the study also evaluates the potential of ethyl paraben to cause genotoxicity in Rohu <i>Labeo rohita</i>. A number of 15 fish with an average weight of 35.45±1.34g were placed in each group and exposed to ethyl paraben for 21 days. Three different concentrations of ethyl paraben, i.e., T<sub>1</sub> (2000μg/L), T<sub>2</sub> (4000 μg/L), andT<sub>3</sub> (6000 μg/L) on which fish were exposed as compared to the control T<sub>0</sub> (0.00 μg/L). Blood was used for hematobiochemical and comet assay. Gills, kidneys, and liver were removed for histological alterations. The results showed a significant rise in all hemato-biochemical parameters such as RBCs, WBCs, PLT count, blood sugar, albumin, globulin, and cholesterol. An increase in aspartate aminotransferase (AST) and alanine transaminase (ALT) levels directed the hepatocytic damage. Histological alterations in the liver, gills and kidneys of fish were found. Ethylparaben induces oxidative stress by suppressing antioxidant enzyme activity such as SOD, GSH, CAT and POD. Based on the comet assay, DNA damage was also observed in blood cells, resulting in genotoxicity. Findings from the present study indicate that ethyl paraben induces hemato-biochemical alterations, tissue damage, oxidative stress, and genotoxicity.","author":"Hasnain Akmal","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7967688ccb700ce74dfb0a3f9fcc9bb995e1aee1521e612509cbe90dabc7de7f","category":"Interdisciplinary"}