{"title":"Second-Generation Eve Flare Launches With Thread Support","link":"https://www.macrumors.com/2023/05/16/eve-flare-thread-support/","date":1684242060000,"content":"Eve today announced the launch of a <a href=\"https://www.evehome.com/eve-flare\">second-generation Eve Flare light</a>, which comes equipped with Thread support. Eve Flare is a portable, battery-powered lamp that can be used anywhere in the home or garden.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/eve-flare.jpg\" alt width=\"1200\" height=\"675\" />\r<br />\nThe light features an IP65 water resistance rating and it includes a carrying handle so that it can be moved indoors and outdoors, and hung up if desired. The Eve Flare supports millions of colors and can be controlled through the Eve app, the Home app, or with <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> voice commands.\r<br />\n\r<br />\nEve Flare is designed for ambiance rather than for use as a main lamp, and it comes with several pre-selected colors like scarlet and jade, or you can pick your own colors. Color and brightness can be adjusted with voice commands or the app. The next-generation Eve Flare replaces the original model.\r<br />\n\r<br />\nAlong with the Eve Flare, Eve is today introducing the Eve Shutter Switch, which offers an Adaptive Shading function for use with roller shutters. The Eve Shutter Switch can change the position of the shutter based on where the sun is. The Eve Shutter Switch is limited to select regions in Europe.\r<br />\n\r<br />\nBoth the new Eve Flare and the Eve Shutter Switch feature support for Thread, a mesh smart home network system that improves the connectivity and responsiveness of connected products. Eve Shutter Switch and Eve Flare will also receive free Matter firmware updates in the future and will eventually support the Matter smart home standard. \r<br />\n\r<br />\nEve Flare can be purchased from <a href=\"https://www.evehome.com/eve-flare\">the Eve Home website</a> or <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fdp%2FB0C4VS6Y3L\">from Amazon</a> for $100, while Eve Shutter Switch is available in some European countries for 100 euros.<div>Tags: <a href=\"https://www.macrumors.com/guide/eve/\">Eve</a>, <a href=\"https://www.macrumors.com/guide/thread/\">Thread</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/16/eve-flare-thread-support/\">Second-Generation Eve Flare Launches With Thread Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/second-generation-eve-flare-launches-with-thread-support.2389673/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"796b52e7b68c3ecc970952d18f54567bbaac24bf1f232936942d193918178bdf","category":"Apple"}