{"title":"Homologous Targeting Effect of Cancer Cell-Derived Liposomes (Memposomes) Mediated by Cell Adhesion Molecules: Role of E-cadherin","link":"https://www.preprints.org/manuscript/202407.2353/v1","date":1722318323000,"content":"Cell membrane-derived liposomes, termed Memposomes, serve as promising carriers for drug delivery due to their ability to closely mimic cells and efficiently target specific cells. Liposomes derived from cancer cell membranes, in particular, exhibit homologous targeting capabilities, making them potential candidates for cancer-specific drug delivery. However, the underlying mechanisms and specific proteins responsible for this homologous targeting phenomenon remain debated. This study focuses on the role of E-cadherin, a cell adhesion molecule implicated in homophilic adhesion, in influencing the homologous targeting ability of Memposomes derived from cancer cell membranes. E-cadherin expression patterns were assessed in various cell lines, categorizing them into E-cadherin-positive and -negative groups. Memposomes were produced for each group, and their targeting tendencies were evaluated. The study confirmed that E-cadherin expression significantly influenced the homologous targeting ability of Memposomes. Cell lines with higher E-cadherin expression levels exhibited a more pronounced homologous targeting effect. This research demonstrates that cell adhesion molecules, particularly E-cadherin involved in homophilic adhesion, play a pivotal role in influencing the cell targeting ability of Memposomes. The study further validates the stability, safety, and purity of Memposomes, emphasizing their potential as effective drug delivery vehicles for the development of cell-specific therapies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"796b4fab2428a9fd7e55c0489576225db3274194117e823cddd9633299f3ef20","category":"Interdisciplinary"}