{"title":"Video: Tech and bikes from the 2021 men’s Paris-Roubaix","link":"https://cyclingtips.com/2021/10/video-tech-and-bikes-from-the-2021-mens-paris-roubaix/","date":1633481980000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/85A_3077-650x433.jpg\" /></div><h2>Video: Tech and bikes from the 2021 men's Paris-Roubaix</h2><p>\n</p><p>In the six or seven years that I’ve had the privilege of heading to Paris-Roubaix to cover the tech trends for CyclingTips, things have changed immensely.</p>\n\n\n\n<p>It was not that long ago when even the humble box section rim laced to a 32-hole hub with either a hand-sewn FMB or Dugast tubular was seen, if not on a team bike, at least stashed away in a Pro Conti team car waiting to be used just one last time as a spare.</p>\n\n\n\n<p>In the space of two years, tire size jumped from a standard and then huge 28mm to at least 30mm, and for some, a voluminous 32mm. Now that once bulbous 28mm looks like a skinny everyday race tire, and is in some cases.</p>\n\n\n\n<p>Double-wrapped bar tape was everywhere, matched that to cross-style brake lever on the top of the bars, and you had comfort and control taken care of. In addition, there were a plethora of modifications to help the riders somewhat smooth out the savage 250km+ of northern European disused tracks.</p>\n\n\n\n<p>Finding the nuggets of tech gold was a breeze. But as the years have quickly marched on, those unique modifications to team bikes have become a thing of the past. Walking the pits now, it seems that every bike manufacturer has a bike or equipment that is ideally suited to the 50km of cobbles the peloton needs to tackle. As a result, it had become somewhat a bit “samey.” A bit like looking at the endurance road bikes that sit on bike shop floors.</p>\n\n\n\n<p>That said, this year, things did get a bit interesting again. Not so much because of the modifications to bikes but because the trusted tubular had suddenly vanished. In its place, the tubeless tire had become the go-to wheel/rubber of choice. It was a massive change to see. And one that somehow felt like a rapid move in the peloton’s thinking.</p>\n\n\n\n<p>I’ve got a few treats in store in this video from the men’s race – or I’d at least like to think I do. First, I managed to hop inside the Bora-Hansgrohe team mechanic’s truck to see what was going to keep Sagan upright. Unfortunately we know the answer, hopefully. There are also custom bikes, Alpecin-Finix going against the grain, older men collecting wheels, a kit that celebrates a little French heritage, and even a low-fi mod by an ex-Roubaix champion.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/video-tech-and-bikes-from-the-2021-mens-paris-roubaix/\">Read More</a>","author":"Dave Everett","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"796fa12acd5fcaa91f1bf31bbf1489df69f3c98651d0425575f94899fa991d7f","category":"Cycling"}