{"title":"Salicylic acid promotes phenolic acid biosynthesis for the production of phenol acid‐rich barley sprouts","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13365?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Phenolic acid exhibits a variety of well-known physiological functions. In this study, optimal germination conditions to ensure total phenolic acid enrichment in barley sprouts induced by salicylic acid treatment and its effects on sprout physiology and activity, as well as the gene expression of key enzymes for phenolic acid biosynthesis, were investigated.</p>\n<h2>RESULTS</h2>\n<p>When sprouts were treated with 1 mmol L<sup>−1</sup> salicylic acid during germination and germinated at 25 °C for 4 days, the phenolic acid content was 1.82 times that of the control, reaching 1221.54 μg g<sup>−1</sup> fresh weight. Salicylic acid significantly increased the activity of phenylalanine aminolase and cinnamic acid-4-hydroxylase and the gene expression of <i>phenylalanine aminolase</i>, <i>cinnamic acid-3-hydroxylase</i>, <i>cinnamic acid-4-hydroxylase</i>, <i>4-coumaric acid-coenzyme A</i>, <i>caffeic acid O-methyltransferase</i>, and <i>ferulate-5-hydroxylase</i> in barley sprouts. However, salicylic acid treatment significantly increased malondialdehyde and H<sub>2</sub>O<sub>2</sub> content, H<sub>2</sub>O<sub>2</sub> and O<sub>2</sub>\n<sup>−</sup> fluorescence intensity, as well as significantly decreasing sprout length and fresh weight. Salicylic acid treatment markedly increased the activity of peroxidase and catalase and the gene expression of <i>peroxidase</i>, <i>catalase</i>, and <i>ascorbate peroxidase</i> in barley sprouts.</p>\n<h2>CONCLUSION</h2>\n<p>Salicylic acid treatment during barley germination significantly promoted the enrichment of total phenolic acid by increasing the activities and gene expression levels of enzymes involved in the phenolic acid biosynthesis pathway. Salicylic acid induced the accumulation of reactive oxygen species, inhibited sprout growth, and activated the antioxidant system. This study provides a basis for the future development of functional foods using phenol acid-rich plants as raw materials. © 2024 Society of Chemical Industry.</p>","author":"Yongqi Yin, \nMeixia Hu, \nZhengfei Yang, \nJiangyu Zhu, \nWeiming Fang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7980fbb4ba15dfcd1c62deda1a8b551f992105648020830be10e230a8aff4d94","category":"Environment"}