{"title":"Relation between quantitative descriptive analysis and textural analysis of boiled plantain","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12977?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Inadequate consideration of textural quality in conventional breeding pipelines of plantains (from breeders to end-users) results in limited impact. Knowledge of the textural quality characteristics of boiled plantain, as preferred by end-users, could help improve the adoption of new clones when these traits are selected for breeding. The present study aimed to evaluate the relationship between instrumental and sensory texture attributes of boiled plantain genotypes. Consumer testing (Just About Right and Check All That Apply tests), sensory quantitative descriptive analysis (QDA), instrumental texture profile analysis (TPA) and penetrometry were conducted with nine accessions: three landraces and six plantain-like bred hybrids.</p>\n<h2>RESULTS</h2>\n<p>Landraces were considered just-about-right by more than 45% of people for all the sensory attributes (humidity, sweetness, color and firmness), described by characteristics such as smooth on sight, attractive, mealy, firm, plantain taste and yellow. Color and firmness were the most highly scored attributes by panelists for the landraces. Penetrometry discriminated among genotypes better than TPA. Hardness, gumminess, resilience and chewiness were the most discriminatory attributes for TPA, whereas hardness and area under the curve were the most discriminatory attributes for penetrometry. No correlation was found between penetrometry and sensory texture of boiled plantain. For TPA, negative correlations were found between sensory humidity and hardness, as well as between sensory firmness and resilience, whereas a positive correlation was found between resilience and sensory humidity.</p>\n<h2>CONCLUSION</h2>\n<p>Combining QDA and texture measurements can make the selection of plantain hybrids more effective and improve the adoption of new varieties. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Gérard Ngoh Newilah, \nCédric Kendine Vepowo, \nAnnie Takam Ngouno, \nDallonnes Fangueng Kamgo, \nRaymonde Nya Nzimi, \nJonas Tembe Tembe, \nEric Ngombi Ngombi, \nInocent Gouado, \nZoé Deuscher, \nAlexandre Bouniol, \nOluwatoyin Ayetigbo, \nDominique Dufour","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"79816373abce6afc7a12716f45ba66e2f3d02e9196b089138e3b697d3b5b602a","category":"Environment"}