{"title":"Editors-in-chief publishing in dental journals: Concerns in self-publishing","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311997","date":1728655200000,"content":"<p>by Elina Nourmand, Rachel Swed, Rafael Delgado-Ruiz, Georgios Romanos</p>\r\n\r\nEditors-in-chief (EICs) have a significant amount of control over the publications that are accepted in their journals, which may result in ethical predicaments. This study investigates the potential conflict of interest of EICs from various dental journals by quantifying the number of their self-published articles during their years as EIC. Based on representation across many dental disciplines and high impact factors, 67 EICs from 19 dental journals during 1990–2023 were studied. To keep anonymity, each journal was randomly assigned a letter A-S and each editor-in-chief (EIC) was given the same letter as their journal with a random number 1–67. After gathering the years each EIC served, online library resources were searched to enumerate each EIC’s lifetime publications and total self-publications during their term, excluding editorials for both counts. Descriptive statistics were performed to evaluate the results. The results indicate that 16 EICs self-published more than the average of 23.27 articles during their term. When considering EIC tenure, a ratio of self-publications per year was calculated, averaging 2.12 publications. Twenty-two EICs authored more articles annually than the average ratio. After calculating the impact factors of each EIC from the years they serviced their journal, a total of 22 impact factors exceeded the established mean of 2.45. Lastly, when comparing the percentage of self-publications from total lifetime publications, 24 of 67 EICs were above the average. Overall, a significantly increased number of self-publications was detected, presenting potential conflicts of interest for EICs. Therefore, it remains essential to develop clear guidelines and international standards regarding the practice of EICs self-publishing in their journals during their service term.","author":"Elina Nourmand","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7985514df14a8d259270b8512259851ed535aecb988d1d8b64278fd140bb4fde","category":"Interdisciplinary"}