{"title":"Review: Halo Infinite’s campaign finishes the fight—but arrives in tatters","link":"https://arstechnica.com/?p=1817954","date":1638777699000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/halo-inf-listing-800x450.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/12/halo-inf-listing.png\">Enlarge</a> <span>/</span> Chief and \"The Weapon\" bond through adversity in <em>Halo Infinite</em>—and not just in the game's plot or firefights. (credit: Xbox Game Studios / 343 Industries)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<em>Halo Infinite</em> is the best campaign-driven entry since <a href=\"https://arstechnica.com/gaming/2011/05/passing-the-halo-a-defiant-look-at-the-franchises-future/\">343 Industries took over the series in 2011</a>. It is also the messiest <a href=\"https://arstechnica.com/tag/halo/\"><em>Halo</em></a> game yet.\n<p>To be clear, I enjoyed my time with <em>Halo Infinite</em>'s campaign. That's primarily because the game sees 343 finally nail its own <em>Halo</em> \"voice,\" one whose mechanics, gunplay, and physics feel more rooted in the series' past than ever before. Meanwhile, 343 uses clever ideas to modernize and go beyond the foundation established by Bungie. And the game delivers story, dialogue, and sci-fi stakes where they count.</p>\n<p>But there's no way to review this title without complaining about the game's launch state. <em>Halo Infinite</em> may reach new series heights, but its ambition tests the limits of the duct tape keeping the game together.</p>\n<h2>Before we begin, three housekeeping notes</h2>\n<p>First, this is a campaign-exclusive review. Xbox Game Studios has wisely split <em>Halo Infinite</em> into two discrete parts, and the online versus-multiplayer suite has been <a href=\"https://arstechnica.com/gaming/2021/11/surprise-halo-infinites-free-multiplayer-mode-is-available-right-now/\">live as a free-to-play game since November 20</a>. It's quite fun, and I'll have more to say about it in the near future. For this article's purposes, \"<em>Infinite</em>\" refers to the campaign launching on Steam, Windows 10, and Xbox consoles on Wednesday, December 8, not the versus modes.</p></div><p><a href=\"https://arstechnica.com/?p=1817954#p3\">Read 47 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1817954&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"798e4f5f530fab9d3c21706c58d670a5b1a277afdcc57a85a35233d493a05035","category":"Tech"}