{"title":"Deciding where to put them: Sensitivity tests and independent evaluation are critical when using species distribution models to inform conservation translocations","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14616?af=R","date":1712118390000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/15f9e876-0fc5-4b64-b493-e35b3d2f79f8/jpe14616-toc-0001-m.png\" alt=\"Deciding where to put them: Sensitivity tests and independent evaluation are critical when using species distribution models to inform conservation translocations\" />\n<p>Our study adds to our understanding of how different modelling decisions impact SDMs and the downstream conclusions from these models while simultaneously demonstrating a rigorous approach for the use of SDMs in conservation translocation planning.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nConservation translocations are an important tool for combating species declines and population losses. Species distribution models (SDMs) can facilitate the selection of suitable release sites for translocation programs. However, these models can be sensitive to several modelling decisions.\n\nIn this study, we explore the impacts of three key modelling decisions on Maxent models developed to inform reintroductions of the long-toed salamander (<i>Ambystoma macrodactylum</i>) in southwestern Alberta. We specifically test the sensitivity of model predictions to (1) the type of environmental variables used to generate models, (2) whether the background points used to calibrate the models reflects the potential bias in the input locality records and (3) the choice of geographic study extent. We use independent presence-absence data from an extensive field survey to test the accuracy of models based on different decisions.\n\nBoth model predictions and performance were sensitive to these modelling decisions. Models developed using local study extents were more accurate than those based on range-wide extents. Both study extent and type of background points impacted model predictions and performance more than the set of environmental variables included in the models for this species.\n\nWe further demonstrate the impacts of these decisions on the ranking of potential release sites and present a final set of recommendations that accounts for this uncertainty under both current and future climatic conditions. We specifically identify three sites that are expected to be suitable in both present and future time periods as potential release sites for salamander reintroductions in southwestern Alberta.\n\n<i>Synthesis and applications</i>: Our study adds to our understanding of how different modelling decisions impact SDMs and the downstream conclusions from these models while simultaneously demonstrating a rigorous approach for the use of SDMs in conservation translocation planning.\n</p>","author":"Kaegan J. Finn, \nJayna C. Bergman, \nJulie A. Lee‐Yaw","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"7994dc1acd2c31b097c37bb559b58c29cfac6395e1456df67dbf4bb07f6f5347","category":"Environment"}