{"title":"Population dynamics of Blood Cockles (Anadara granosa) in the coastal waters of Letman Village, Kei Kecil District, Southeast Maluku Regency","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12818?af=R","date":1718623124000,"content":"<h2>Abstract</h2>\n<p>The waters of Letman Village, Southeast Maluku Regency are clam fishing grounds which is a source of income for fishermen. One of the shellfish caught is the Blood Cockle (<i>Anadara granosa</i>). The purpose of this study was to analyse and examine the stock of <i>A. granosa</i> clams in Letman village, Kei Kecil District, Southeast Maluku Regency (length and weight frequency) and to determine the mortality rate and exploitation rate of Blood Cockles. This study was conducted between January and June 2022 with a sampling time of once a month for six consecutive months. Random sampling method was used through a free collection at low tide. The total sample collected during the study was 741 individuals. The research data were analysed using FiSAT II program version 3. The smallest size of the sample obtained during the study was 30 mm and the largest was 69 mm. The infinity length (L∞) is 78.50 mm, the growth coefficient (<i>K</i>) is 0.8/year, and the theoretical lifespan of Blood Cockles at a length equal to zero is −0.514/year. Analysis of the total mortality rate (<i>Z</i>) of Blood Cockles (<i>A. granosa</i>) was calculated at 3.90/year with a natural mortality rate (<i>M</i>) of 1.22/year and catchment mortality (<i>F</i>) of 2.68/year, while exploitation rate (<i>E</i>) was at 0.69/year. The addition of new individuals (recruitment) took place every month with varying numbers and the highest recruitment occurred in July and October while the level of exploitation of Blood Cockle in the waters of Letman Village was considered high (<i>overfishing</i>).</p>","author":"Semuel F. Tuhumury, \nDebby A. J. Selanno, \nJulian Tuhumury","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"7995035a5753a64063c0323b93cfa2cc447b37d6e6dc9d6245dd7526a0339097","category":"Environment"}