{"title":"Investigating the Extent and Nature of the Primate Pet Trade on TikTok","link":"https://www.preprints.org/manuscript/202408.1988/v1","date":1724829243000,"content":"With online wildlife trade increasing and viral videos increasing demand, the trade in primates on TikTok is becoming more prevalent. Despite wildlife trade being banned on most social media platforms, the trade in primates persists. TikTok’s policies ban the sale of live animals, and specific terms related to wildlife trade are banned; however, these search term bans are easy to get around, and sellers are still prolific on the site. This study documented primates for sale on TikTok using the search term “for sale monkey” over a four-month period (from mid-July to mid-November 2023) with the aim of determining how widespread primate trade is on TikTok, the legality of advertisements, and which countries advertise the most primates for sale. 42 individual advertisements were identified, spanning 6 different genera of primates and 5 different countries. Spider monkeys, rhesus macaques, and common marmosets were found to be the most commonly advertised species on TikTok. All spider monkeys were advertised from the USA, while the majority of the marmosets were advertised from the UK, and all of the rhesus macaques were advertised from Pakistan. The USA was the only country identified in this study that advertised a range of species, and the only species found in this study that was not advertised in the USA was the mona monkey. 44% of all species recorded were classified as either Endangered or Critically Endangered, and it was found that endangered species were more frequently sold illegally than non-endangered species. The findings of this study underline a need for stricter primate legislation and wildlife law enforcement, especially if the UN’s sustainable development goals are to be achieved by 2030. They also show a need for TikTok to broaden their restrictions on wildlife trade on their app.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"799ec2403495b0af043357dfe8c9308002a0a5af98e7937314f46e32a4828646","category":"Interdisciplinary"}