{"title":"Microallopatric speciation in the relict dung beetle genus Grebennikovius (Coleoptera: Scarabaeidae) in the Eastern Arc Mountains","link":"https://academic.oup.com/isd/article/doi/10.1093/isd/ixae004/7628190?rss=1","date":1710374400000,"content":"<span><div>Abstract</div>The Eastern Arc Mountains (EAMs) in Tanzania and Kenya are renowned for their exceptional species endemism often restricted to isolated mountain blocks. Forest fragmentation during the Pliocene–Pleistocene played a significant role in shaping the EAMs’ biodiversity by facilitating allopatric speciation between different mountains. However, only a few studies focused on species diversification within the same mountain block. In this article, we investigated the taxonomy and evolution of the dung beetle genus <span>Grebennikovius</span>, endemic to the Uluguru Mountains. Our goal was to unravel factors promoting allopatric speciation within a confined geographic area like the Ulugurus. We used an integrative taxonomic approach, combining phenotypic data and COI barcodes to delimit species and reconstructed a timetree of the genus. Molecular and morphological evidence consistently recovered 4 distinct <span>Grebennikovius</span> species, of which 3 are new to science: <span>G. armiger</span> n. sp., <span>G. basilewskyi</span> (Balthasar, 1960), <span>G. lupanganus</span> n. sp., and <span>G. pafelo</span> n. sp. <span>Grebennikovius</span> represents a rare case of microallopatry, with all species occurring in close proximity within different regions of the limited Uluguru forest (∼230 km<sup>2</sup>). We infer that speciation was driven by the interplay between climate fluctuations during the Miocene and mid-Pleistocene, Uluguru topography, and the stability of rainforest ecological conditions. The latter factor probably favored the loss of wings and a specialization for Uluguru microhabitats, reinforcing population isolation and divergence. This study highlights a unique instance of diversification resulting from small-scale speciation events, providing valuable insights into the evolution of Eastern African rainforest arthropods and underscoring the importance of microhabitats conservation.</span>","author":"","siteTitle":"Insect Systematics and Diversity Current Issue","siteHash":"d4d59e2090793e303021830a9c164d689828dc5448b6052be7ec32e87f45cab0","entryHash":"79a2aa88e352c7a71cafee2291471cfbba46e353a87e37fecc7d87aa32b21720","category":"Environment"}