{"title":"Big Epidemiology: the Birth, Life, Death, and Resurgence of Diseases on a Global Timescale","link":"https://www.preprints.org/manuscript/202408.0955/v1","date":1723588076000,"content":"Big Epidemiology is an innovative framework that extends the interdisciplinary approach of Big History to understand disease patterns, causes, and effects across human history on a global scale. This comprehensive methodology integrates epidemiology, genetics, environmental science, sociology, history, and data science to address contemporary and future public health challenges through a broad historical and societal lens. The foundational research agenda involves mapping the historical occurrence of diseases and their impacts on societies over time, utilizing archaeological findings, biological data, and historical records. By analyzing skeletal remains, ancient DNA, and artifacts, researchers can trace the origins and spread of diseases, such as Yersinia pestis in the Black Death. Historical documents, including chronicles and medical treatises, provide contextual narratives and quantitative data on past disease outbreaks, societal responses, and disruptions. Modern genetic studies reveal the evolution and migration patterns of pathogens and human adaptations to diseases, offering insights into co-evolutionary dynamics. This integrative approach allows for temporal and spatial mapping of disease patterns, linking them to social upheavals, population changes, and economic transformations. Big Epidemiology also examines the roles of environmental changes and socioeconomic factors in disease emergence and re-emergence, incorporating climate science, urban development, and economic history to inform public health strategies. The framework reviews historical and contemporary policy responses to pandemics, aiming to enhance future global health governance. By addressing ethical, legal, and social implications, Big Epidemiology seeks to ensure responsible and effective epidemiological research and interventions. This approach aims to profoundly impact how we understand, prevent, and respond to diseases, leveraging historical perspectives to enrich modern scientific inquiry and global public health strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"79b3b302e97da531cfdc9fd77aab1218a04494762e13ce11e7eac6f1133022e5","category":"Interdisciplinary"}