{"title":"Implementation of Controlled Floods for Sediment Management on the Colorado River in Grand Canyon Under Aridification","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4374?af=R","date":1727855071000,"content":"<h2>ABSTRACT</h2>\n<p>In addition to supplying water for agriculture, cities, and industry, the Colorado River traverses the Colorado Plateau, including several of the most unique and valued National Parks and Recreation Areas in the United States. Although the water needs of these landscapes were not considered at the time water allocations were first negotiated, these needs were recognized in subsequent legislation and policy. Management goals address a range of aquatic and riparian resources, including fine sediment (sand, silt, and clay) which, in Grand Canyon, is important for ecological, cultural, and recreational resources. Over ~30 years, stakeholders, resource managers, and scientists collectively developed operational strategies for sediment management to meet goals outlined by an adaptive management program. However, prolonged drought, or “aridification,” resulting in declining runoff and the lowest reservoir storage elevations in decades has challenged those strategies. The paradigm for sustainable sediment management relies on (1) sand accumulation on the bed of the Colorado River during periods of sediment-rich tributary floods from summer/fall thunderstorms, and (2) dam-released controlled (artificial) floods, referred to as High-Flow Experiments (HFEs), to redistribute the accumulated sand to rebuild eroded bar and floodplain deposits. The management protocol, which specifies narrowly defined sand accumulation periods and HFE implementation windows, is based on implementing HFEs in late fall during the period of greatest sediment enrichment, before higher winter releases for hydropower erode the accumulated sand from the riverbed. Low dam releases associated with drought, however, have changed the pattern of sand accumulation and low reservoir elevations have prevented HFE implementation in the defined window. An alternative strategy for HFE planning and implementation was tested opportunistically in April 2023 following lower-than-normal winter dam releases. We present findings from this HFE indicating that sand enrichment and sandbar building equaled or exceeded that of HFEs conducted under the established management protocol. These findings show that management goals for sediment under conditions of prolonged drought may be achievable but will likely require substantial changes in dam management strategies.</p>","author":"Paul E. Grams, \nDavid J. Topping, \nGerard Salter, \nKatherine A. Chapman, \nRobert B. Tusso, \nErich R. Mueller","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"79bd4ec0439fa175fd7e9032842c46ec127b8f202856b4236e1b0555b7addfee","category":"Environment"}