{"title":"Apple’s AirPods Pro killer launches May 18, according to Amazon leak","link":"https://www.macworld.com/article/1799339/beats-studio-buds-plus-amazon-leak-apple-airpods-pro.html","date":1682517818000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While we’re not expecting any <a href=\"https://www.macworld.com/article/673885/airpods-pro-lite-release-date-price-specs-rumours.html\">new AirPods</a> this year other than maybe a new USB-C case, a new leak reveals that Apple has got some headphones in the pipeline. It would appear that a new pair of Beats earbuds will launch next month.</p>\n\n\n\n<p>According to a brief accidental listing on Amazon Tuesday (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/04/25/beats-studio-buds-plus-amazon-listing/&amp;xcust=1-1-1799339-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">via MacRumors</a>), Apple is planning to launch the Beats Studio Buds+ on May 18 with a retail price of $170. That’s $20 more than the Beats Studio Buds that launched last year. It’s not clear whether the new earbuds will replace the existing model or enter the lineup as a higher-priced alternative.</p>\n\n\n\n<p>Compared to the Beats Studio Buds, the listing claims the Studio Buds+ have up to 1.6 times the active noise cancellation and up to 2 times improved Transparency mode. Battery life is also improved, with up to 36 hours of listening time when using the USB-C charging case, compared to 24 hours for the Studio Buds.</p>\n\n\n\n<p>Like the Studio Buds, the Studio Buds+ do not appear to have Apple’s H1 or H2 chip as found in the Powerbeats Pro and the Beats Fit Pro. However, they will bring hands-free Siri, Find My integration, and spatial audio. The Beats Studio Buds+ have a flush in-ear design versus the iconic stems of the AirPods Pro.</p>\n\n\n\n<p>Apple rates the second-gen AirPods Pro for 30 hours of listening time and up to 24 hours of talk time, and claims the second-generation model has 2x better active noise cancellation than the original. They both sport IPX4 water resistance and a charging case, though the Beats Studio Buds+ will charge via USB-C versus Lightning or MagSafe with the AirPods Pro.</p>\n\n\n\n<p>But perhaps the best reason to buy the Beats Studio Buds+ over the AirPods Pro (other than the price) is the range of color options. Along with standard black and ivory, the Beats Studio Buds+ will come in a transparent option that looks similar to the popular Nothing Ear (2) earbuds. </p>\n\n\n\n<p>In our <a href=\"https://www.macworld.com/article/349333/apple-beats-studio-buds-review.html\">4-star review</a> of the original Beats Studio Buds, we praised the design and “crisp sound,” but felt the noise cancellation was “a step behind the state of the art from Apple.” Based on the leak, it sounds like Apple was paying attention.</p>\n\nHeadphones</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"79be6520420d2aa2848e328b2a4191a66f8b264b81027634db4d8481be664f2d","category":"Apple"}