{"title":"นักวิจัยระบุช่องโหว่ Rowhammer ยังเปลี่ยนค่าในแรมได้แทบทุกยี่ห้อ แม้ผู้ผลิตพยายามปิดช่องโหว่แล้ว","link":"https://www.blognone.com/node/125868","date":1637089942000,"content":"<div><div><div><p>การโจมตีแรมแบบ Rowhammer เป็นช่องโหว่ที่<a href=\"https://www.blognone.com/node/66520\">ทีม Project Zero ของกูเกิลสาธิตมาตั้งแต่ปี 2015</a> โดยอาศัยการเปลี่ยนค่าในหน่วยความจำซ้ำๆ จนกระทั่งหน่วยความจำแถว \"ข้างๆ\" นั้นเปลี่ยนค่าไปด้วย และหลังมีรายงานออกมาผู้ผลิตแรมก็พยายามเพิ่มกระบวนการป้องกันการเปลี่ยนข้อมูลเช่นนี้ ล่าสุดทีมวิจัย COMSEC จากมหาวิทยาลัย ETH Zürich ก็ประสบความสำเร็จในการโจมตีแบบ Blacksmith ที่พัฒนาเทคนิคต่อจาก Rowhammer จนเปลี่ยนค่าในแรมได้แทบทุกยี่ห้อในตลาด</p>\n<p>ที่ผ่านมาผู้ผลิตแรมเพิ่มกระบวนการ Target Row Refresh (TRR) เพื่อรีเฟรชไฟฟ้าในแรมบริเวณที่น่าจะถูกโจมตีเพื่อป้องกันการเปลี่ยนค่า แม้ว่าจะมีงานวิจัยแสดงให้เห็นว่ายังพอโจมตีได้บ้างแต่ก็คาดเดาผลได้ไม่แน่นอนนัก แต่ Blacksmith สามารถโจมตีแรมทุกยี่ห้อที่ทีม COMSEC นำมาทดสอบได้สำเร็จ</p>\n<p>Blacksmith อาศัยการเปลี่ยนค่าแรมหลบเลี่ยง TRR โดยอาศัยการเปลี่ยนค่าในแรมเป็นรูปแบบที่คาดเดาได้ยาก (non-uniform patterns) ทีมงานต้องรัน Blacksmith เพื่อตรวจสอบก่อนว่าแรมรุ่นใดโจมตีด้วยรูปแบบใดได้ง่าย แม้ว่าทีมงานจะโจมตีได้สำเร็จเกือบทุกแบรด์แต่บางแบรนด์ก็หารูปแบบการเปลี่ยนค่าแรมที่โจมตีสำเร็จได้ยากมาก และกระบวนการโตมตีใช้เวลานานนับชั่วโมง ขณะที่บางแบรนด์ใช้เวลาเพียงไม่กี่วินาที อย่างไรก็ดีผลการวิจัยไม่ระบุชื่อแบรนด์ไว้ในรายงาน บอกเพียงตัวอักษร A, B, C, D</p>\n<p>ความร้ายแรงของช่องโหว่นี้สูงสุดคือการเปิดเผยข้อมูลลับภายในแรมให้คนร้าย เช่น กุญแจเข้ารหัสข้อมูล โดยคนร้ายต้องมุ่งโจมตีแรมในส่วน page table page เพื่อพื้นที่แรมของโปรเซสอื่นให้มาอยู่ในโปรเซสตัวเอง หากสำเร็จก็สามารถดังข้อมูลออกไปได้</p>\n<p>ที่มา - <a href=\"https://comsec.ethz.ch/research/dram/blacksmith/\">COMSEC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f076b186c9f03056c031d02a395bed17.jpg\" /></p>\n<p>ภาพโดย <a href=\"https://pixabay.com/th/photos/%e0%b8%84%e0%b8%93%e0%b8%b0%e0%b8%81%e0%b8%a3%e0%b8%a3%e0%b8%a1%e0%b8%81%e0%b8%b2%e0%b8%a3-%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b9%8c%e0%b8%94-%e0%b8%8a%e0%b8%b4%e0%b8%9b-%e0%b8%84%e0%b8%ad%e0%b8%a1%e0%b8%9e%e0%b8%b4%e0%b8%a7%e0%b9%80%e0%b8%95%e0%b8%ad%e0%b8%a3%e0%b9%8c-22098/\">PublicDomainPictures</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/memory\">Memory</a></div><div><a href=\"/topics/security\">Security</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"79c8358ef65d998161df6162ab1ff704d2f21079c50928e2a348f1c841d3259f","category":"Thai"}