{"title":"Mercedes-AMG shows off its new F1-based road car hybrid system","link":"https://arstechnica.com/?p=1753494","date":1617208594000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/21C0172_208-source-980x551.jpg\" alt=\"\"></div>\n        <p>\n          Mercedes-AMG has been developing this Project One hypercar—which uses the same powertrain as its all-conquering F1 cars—for a few years now. It's not quite ready yet, but the hybrid system is about to appear on some other Mercedes-AMG road cars.                      [credit:\n                        Mercedes-AMG                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>This week should have seen the start of the New York International Auto Show, but despite its postponement, many of the automakers who would have attended are still showing off their latest new-and-shiny projects online instead. Most of Mercedes-Benz's headlines have come from <a href=\"https://www.greencarreports.com/news/1131722_preview-mercedes-benz-eqs-photos-price-review-specs-info\">its new electric EQS sedan and the humongous 56-inch-wide screen</a> embedded in its dash. I don't know about you, but I'm fast approaching burnout when it comes to huge screens in cars, so I'm far more interested in the details that Mercedes-AMG shared about its new performance hybrid system.</p>\n<p>In 2014, Formula 1 racing adopted a new set of technical regulations as the sport moved from naturally aspirated 2.4 L V8 engines <a href=\"https://arstechnica.com/cars/2014/06/high-tech-hybrids-are-2014s-hottest-race-cars/\">to hybrid powertrains that combine a 1.6 L V6 with a pair of hybrid systems to recover energy from waste heat as well as under braking</a>. The Mercedes-AMG team came out of the starting blocks with a better hybrid powertrain than anyone else and dominated the sport from then on, racking up both the driver's and constructor's world championships that season and every year since.</p>\n<p>I've repeatedly said that F1 technology almost never shows up in street cars, and <a href=\"https://arstechnica.com/cars/2018/11/the-golden-age-tech-speeds-from-racetrack-to-road-faster-than-ever/\">endurance racing is the venue for real racetrack-to-road technology transfer</a>. But in this case, Mercedes-AMG really is translating its F1 hybrid know-how into the brand's street cars.<!--adbreak--></p></div><p><a href=\"https://arstechnica.com/?p=1753494#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753494&comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"79cf3e1ffd48de16f7d9bfc857e606fa0976995cef0cba36e7090519201eeb03","category":"Tech"}