{"title":"Sediment Properties and Benthic Fauna Associated with Stock Enhancement and Farming of Marine Bivalve Populations in Xiangshan Bay, China","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/4729267?af=R","date":1675497600000,"content":"<p>This study was designed to examine the impacts of ark shell <i>Scapharca subcrenata</i> enhancement and suspended oyster <i>Crassostrea sikamea</i> farming on sediment properties and fauna communities in the benthic zone of Xiangshan Bay, China. Ark shell enhancement took place over 319 days, after which sediment samples were collected from each of the three treatment sites: the enhancement area, an oyster farm, and a control area. Sediments from the oyster farming area had significantly higher moisture and acid volatile sulfide content, and the highest Cu, Zn, Pb, and Cd concentrations in all three treatment areas. The ark shell enhancement area has the lowest total organic carbon. No significant difference was found between the mean grain size in each of the three areas. Benthic fauna communities in the ark shell enhancement area were similar to those in the control area. Among the 16 faunal taxa identified, <i>Ruditapes philippinarum</i> was the most abundant species, followed by <i>Glycera onomichiensis</i> and <i>Musculus senhousia</i>. Suspension feeders were not found in the sediment beneath the oyster rafts. Cluster analysis showed a distinct separation between the benthic fauna communities in the oyster farming area and the other two treatment areas. Ark shell enhancement was thus shown to have minimal impact on the benthic environment, while the raft-farmed oysters had significant effects on the sediment structure and the benthic fauna after more than ten years of farming. The differences between the impacts of ark shell enhancement and oyster farming could be attributed to the slowing of water flow caused by oyster rafts.</p>","author":"Xianyin Ping, \nHui Zhang, \nYazhou Jiang, \nJianzhong Ling, \nPeng Sun, \nBaojun Tang, \nHamed Ghafarifarsani","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"79d6f13377a81303b1a86252b1637aee39c32a9bf6f82740f30cac0d8aa8ab8e","category":"Environment"}