{"title":"iOS 14.6 Beta Brings Tweaks to Podcasts App Following Complaints","link":"https://www.macrumors.com/2021/05/11/ios-14-6-tweaks-podcasts-app/","date":1620744318000,"content":"Apple has added a number of features to its Podcasts app in the <a href=\"https://www.macrumors.com/2021/05/10/apple-seeds-ios-14-6-beta-3-to-developers/\">third beta of iOS 14.6</a>, seemingly in an attempt to address some of the <a href=\"https://www.macrumors.com/2021/04/29/users-despair-at-apple-podcasts-app-after-update/\">useability problems</a> introduced <a href=\"https://www.macrumors.com/2021/04/26/apple-releases-ios-14-5/\">in iOS 14.5</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Podcasts-Feature.jpg\" />\r\n<br />\r\n<em>MacRumors</em> contributor Steve Moser spotted the Podcasts app changes in iOS 14.6 beta 3 and its source code, which include new features for marking all episodes as played, removing downloads, and recovering episodes.\r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>Also looks like Apple might let users access their “previous library” (pre- iOS 14.5) in Podcasts in iOS 14.6 beta 3.</p>— Steve Moser (@SteveMoser) <a href=\"https://twitter.com/SteveMoser/status/1391858655436414978?ref_src=twsrc%5Etfw\">May 10, 2021</a></blockquote> </div>\r\n<br />\r\n\r\n<br />\r\niOS 14.5 redesigned the Podcasts library so that all episodes of a show are now displayed by default, which gave the impression to some users that hundreds of episodes stretching back years had been added to their libraries.\r\n<br />\r\n\r\n<br />\r\nIt is no longer possible to delete or remove individual episodes from the library in iOS 14.5, leaving users with the only option of selecting \"Hide Played Episodes\" and then manually marking every unwanted episode as played individually, one by one.\r\n<br />\r\n\r\n<br />\r\nTo make matters worse, users reported that many old episodes that had been listened to were not being marked as played correctly, making the new episodes view troublesome even where the \"Hide Played Episodes\" option in Settings had been enabled.\r\n<br />\r\n\r\n<br />\r\nApple's new \"Mark All As Played\" or \"Mark All As Unplayed\" options for shows in iOS 14.6 will help users deal with the multitude of episodes now seemingly lingering in libraries, and will make it possible to hide old episodes from view when used with the \"Hide Played Episodes\" option.\r\n<br />\r\n\r\n<br />\r\nIn spite of this improvement, users will still have to mark every episode of a podcast that they do not want to listen to as played in order to remove it from view. This is a particular nuisance when listening to podcast episodes in \"oldest to newest\" order. In addition, there is no longer the option to only retain a certain number of unplayed episodes of a show in the library.\r\n<br />\r\n\r\n<br />\r\nIn the iOS 14.6 beta, Apple also added the ability to remove all downloads in a single action, rather than obliging users to do this individually for each desired episode. This may also help some users that said the Podcasts app in iOS 14.5 was hemorrhaging mobile data by downloading all of the episodes that have now been moved directly into libraries.\r\n<br />\r\n\r\n<br />\r\nThe other new feature in the Podcasts app relates to recovering episodes in the Library. There are cautions in iOS 14.6 for removing recovered episodes, which suggests, although it was not visible within the code, that there may be an option to recover episodes.\r\n<br />\r\n\r\n<br />\r\nIt is not clear what exact function this serves, but it is reasonable to speculate that it relates to recovering episodes of shows, presumably ones that were not subscribed to, that were added to the library prior to iOS 14.5. These episodes are currently inaccessible under the design of the Podcasts app in iOS 14.5 due to the changes to the way the library works.\r\n<br />\r\n\r\n<br />\r\nGiven the <a href=\"https://www.macrumors.com/2021/04/29/users-despair-at-apple-podcasts-app-after-update/\">raft of criticisms</a> about the redesign of Apple's Podcasts app in iOS 14.5, it is difficult to not see these changes as a purposeful attempt to go some way to rectify these problems. Even so, there still seems to be more work to do on the Podcasts app to fully address users' complaints about bugs and sorting episodes in the library.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-podcasts/\">Apple Podcasts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/11/ios-14-6-tweaks-podcasts-app/\">iOS 14.6 Beta Brings Tweaks to Podcasts App Following Complaints</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-14-6-beta-brings-tweaks-to-podcasts-app-following-complaints.2295718/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3W907O_RpKg:yhgqfOxcoFs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=3W907O_RpKg:yhgqfOxcoFs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/3W907O_RpKg\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"79d6c255180724cb4554f9d41ba39adb0b866db882b21314a5c37b0811c031fd","category":"Apple"}