{"title":"Shaan Puri’s Bear Case Against Clubhouse","link":"https://twitter.com/ShaanVP/status/1371972261004070913","date":1616016000000,"content":"\n<p>Shaan Puri, in a breezy, fun thread on Twitter:</p>\n\n<blockquote>\n  <p>So… everyone seems to think clubhouse is the “next big thing”\n- but I think it’s going to fail. Here’s how I think it all\ngoes down.</p>\n\n<p>(Disclaimer - I don’t <em>want</em> clubhouse to fail. The world is more\nfun if it wins… but wanting something doesn’t mean it’s going to\nhappen. If it did, then guac would be default included inside every\nbag of chips.)</p>\n</blockquote>\n\n<p>It’s devilishly hard to predict how something popular and growing might eventually peter out. I think Puri is onto something about the limits of Clubhouse’s potential appeal after they run out of early adopters. One factor that’s hard to gauge, but comes up frequently, is the effect of our quarantine on Clubhouse’s appeal. To some degree it seems certain that Clubhouse is at least a little more popular than it would be (or will be) in a world where we’re not all starved for normal social interaction.</p>\n\n<p>But there are some things Clubhouse has going for it that don’t seem to get talked about. One is serendipity. It’s a defining constraint of the platform that everything is live. But that can be a feature, too. Don’t forget that tens of millions of people watch live TV every day. Sometimes, some people just want to turn on the TV and find something, anything, to grab their attention. I think Clubhouse brings something like that to our phones.</p>\n\n<div>\n<a  title=\"Permanent link to ‘Shaan Puri’s Bear Case Against Clubhouse’\"  href=\"https://daringfireball.net/linked/2021/03/17/puri-clubhouse\">&nbsp;★&nbsp;</a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"79d78c9e6e446e427b69b0d17a2d8d642a20814acd303f54b8fae37b461e5960","category":"Tech"}