{"title":"The response of a freshwater copepod to small‐scale, dissipative eddies in turbulence","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12402?af=R","date":1689231600000,"content":"<h2>Abstract</h2>\n<p>The freshwater copepod <i>Hesperodiaptomus shoshone</i> was exposed to a Burgers vortex, a flow feature meant to mimic small-scale, dissipative turbulent eddies found in the organism's environment, to determine how this copepod responds to microscale turbulent flow structures. Male and female <i>H. shoshone</i> were separately exposed to four turbulence intensity levels plus a negative control (i.e., stagnant flow) in two vortex orientations relative to gravity. <i>H. shoshone</i> demonstrates a mild behavioral change in the presence of a Burgers vortex that is dependent on both sex and vortex orientation. <i>H. shoshone</i> swim with fairly linear trajectories across all four levels of turbulence intensity, which is a notable difference from the swimming behavior of marine copepods exposed to the same flow feature. Variations in morphology, physical environment, or ecological niche between <i>H. shoshone</i> and marine copepods are potential factors that may explain the differences in how the species respond to a Burgers vortex. The setal array of <i>H. shoshone</i> differs from the setal array of the previously studied marine copepods, suggesting differences in sensory ability and response. The small pond habitat of <i>H. shoshone</i> is rarely or intermittently mixed, creating a different hydrodynamic landscape compared to the ocean, which may influence the copepod/turbulence interaction. <i>H. shoshone</i> has few, if any, naturally occurring predators whereas marine copepods have many, which may influence the difference in response to microscale turbulence.</p>","author":"Melissa Ruszczyk, \nDonald R. Webster, \nJeannette Yen","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"79e03ce3e60b167f1f25b35b8608e7ef37f9cb8d6302766a84c7dcc91a6f84fc","category":"Environment"}