{"title":"Black Carp Mylopharyngodon piceus (Richardson, 1846) Mouth Gape and Size Preference of a Bivalve Prey","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/5551187?af=R","date":1714374000000,"content":"<p>Black carp <i>Mylopharyngodon piceus</i> (Richardson, 1846) have been widely used as biological control of snails in aquaculture and were imported to the United States in the 1970s and 1980s for this purpose. Prior research emphasizes the species’ propensity to control gastropods, but since subsequent escape and establishment of black carp in portions of the Mississippi River Basin, concerns now focus on the numerous endangered and endemic bivalve species upon which black carp may predate. Black carp mouth gape may limit predation on larger bivalves, but bite force is also a factor. We used regression of fish length to mouth gape of wild-caught black carp and compared these results to tank forage size preference trials with bivalve prey <i>Corbicula fluminea</i> clams. Wild-caught black carp ranged from 429 to 1580 mm total length, a size range larger than measured in previous studies. Regression of fish length and mouth gape indicated greater variability among sizes, as expected from wild versus cultured populations. Clam consumption was size-dependent. Black carp commonly engulfed but did not consume the largest clams in tank feeding trials. Shell width was a better predictor of successful consumption than length or height. Predation was restricted at sizes less than the mouth gape of test black carp as observed by individuals engulfing but failing to consume prey. This result indicates that either bite force or the pharyngeal apparatus gape (i.e., the distance between the pharyngeal teeth and keratinous pad) limited successful crushing of engulfed shells. Bivalve predation by black carp is limited by both a fish’s ability to engulf prey and the ability to fracture the shell of larger prey items that cannot be broken or swallowed whole. The results of this research may be used to assess potential prey sizes of wild black carp and anticipated effects of predation on bivalve communities.</p>","author":"Patrick T. Kroboth, \nBenjamin H. Stahlschmidt, \nDuane C. Chapman, \nPronob Das","siteTitle":"Wiley: Journal of Applied Ichthyology: Table of Contents","siteHash":"411fbab4e21e579add0b45892c8bae33151f2fc1dcfa886f71382f3516ee5117","entryHash":"79e2897c573d5a629160c3cef99e5b28ca216376eaac2ad48be9dcd2cfa6a332","category":"Environment"}