{"title":"277 Estimating the potential effect of Mycoplasma hyopneumoniae infection on swine sustainability","link":"https://academic.oup.com/jas/article/102/Supplement_3/53/7757266?rss=1","date":1726185600000,"content":"<span><div>Abstract</div><span>Mycoplasma hyopneumoniae</span> is the primary causative agent of enzootic pneumonia, one of the most common bacterial pathogens affecting pigs and the main contributor to respiratory comorbidities. Infection with <span>M. hyopneumoniae</span>, commonly observed in growing pigs, results in decreased feed intake and an increase in the number of days to reach market weight. Based on extended days to market, pigs infected with <span>M. hyopneumoniae</span> will have a greater life cycle carbon emissions and water usage than that of non-infected pigs. However, the magnitude of additional carbon footprint and water use in pigs infected with M<span>. hyopneumoniae</span> has never been calculated. Therefore, the objective of this study was to estimate the potential variation in carbon emissions and water footprint generated by <span>M. hyopneumoniae</span> infected pigs. This study was conducted using data from previous publications on <span>M. hyopneumoniae</span> infected pigs in experimental and commercial conditions. The carbon footprint and water usage of pork production was obtained from the literature and was used as a baseline (3,470 kg of CO<sub>2</sub> eq and 1,678 m<sup>3</sup> water eq; both per 1,000 kg of pork carcass weight). The change in average daily gain was estimated and additional days on feed to reach market weight were used to calculate potential carbon and water impact for pigs infected with <span>M. hyopneumoniae</span>. The estimated carbon emissions and water usage of <span>M. hyopneumoniae</span> infected pigs increased in a range of 84.69 to 142.93 kg of CO<sub>2</sub> eq/1,000 kg of pork carcass weight and 40.95 to 69.12 m3 eq/1,000 kg of pork carcass weight respectively, compared with the carbon emissions of non-infected pigs (Table 1). Results of this study showed an increased carbon footprint for <span>M. hyopneumoniae</span> infected pigs by 2 to 4% and water usage increased by 2.5 to 4.1% suggesting that the sustainability of pork production was negatively affected by this bacterial infection. Previous literature on the impact of controlling vaccine-preventable diseases has shown similar results for other swine respiratory pathogens. In addition, these data only included <span>M. hyopneumoniae</span> infected pigs, thus the effect of respiratory co-infections was not estimated and the impact on sustainability metrics may be greater than currently calculated. The application of sustainable practices in animal production, including disease prevention, is key to ensuring a secure food supply for future generations. The carbon and water footprints of swine production are measurements of sustainability, with average daily gain being an important factor.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"79e717cd44412d39a6cda8b83387890f36243bd03e28677a34b24ce7b0426b4e","category":"Environment"}