{"title":"Exploring Subsurface Water Conditions in Dutch Canal Dikes During Drought Periods: Insights From Multiyear Monitoring","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036046?af=R","date":1727275232000,"content":"<h2>Abstract</h2>\n<p>Canal dikes in low-lying polders, as well as in other regions worldwide, are critical infrastructure for flood protection and water management. The subsurface water conditions can cause dike failures during excessive rainfall and prolonged periods of drought. There is a lack of multi-year monitoring of subsurface water conditions in canal dikes and an insufficient understanding of their geohydrological behavior. This study provides and analyses a novel multiyear data set of soil moisture and hydraulic heads (from February 2020 until March 2023) from a monitoring network covering various canal dikes with different characteristics in the western Netherlands. The data, including two extremely dry summers, highlight the impact of meteorological variations on the subsurface water conditions. Non-hydrostatic hydraulic head levels were observed during droughts that can be detrimental to dike stability and that are often not accounted for in safety assessments for drought situations. The effectiveness of various meteorological drought indicators applied to subsurface water conditions was evaluated: the precipitation deficit is the most reliable measure and outperforms the standardized drought indicators (SPEI and SPI). The drought recovery of dikes was analyzed to understand seasonal transitions and the sequence of different failure mechanisms, during dry and wet situations. This analysis also reveals differences between meteorological, soil moisture, and groundwater droughts, highlighting soil's storage capacity after drought and the limitations of meteorological drought indicators as proxies for soil moisture and groundwater. The insights from this study enhance assessments, inspection procedures and the identification of weak spots of dikes and other earthworks of infrastructure.</p>","author":"Bart Strijker, \nTimo J. Heimovaara, \nSebastiaan N. Jonkman, \nMatthijs Kok","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"79e88485e9055aef2ae2d26cafd6cd7538df68bf815848ad0d6c6e204a1e059c","category":"Environment"}