{"title":"Archaeologists recreated three common kinds of Paleolithic cave lighting","link":"https://arstechnica.com/?p=1773827","date":1624127011000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/paleoTOP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/paleoTOP.jpg\">Enlarge</a> <span>/</span> Spanish archaeologists recreated three common types of Paleolithic lighting systems. (credit: Medina-Alcaide et al, 2021, PLOS ONE)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In 1993, a media studies professor at Fordham University named Edward Wachtel visited several <a href=\"https://archaeology-travel.com/thematic-guides/cave-art-in-france/\">famous caves</a> in southern France, including Lascaux, Font-de-Gaume, Les Combarelles, and La Mouthe. His purpose: to study the cave art that has justly made these caves famous. Wachtel was puzzled by what he called \"spaghetti lines\" on the drawings, partially obscuring them. There were also images of, say, an ibex with two heads, a mammal with three trunks, or a bull drawing superimposed over the drawing of a deer.</p>\n<p>His guide for the La Mouthe tour was a local farmer, and since there were no electric lights in this cave, the farmer brought along a gas lantern. When the farmer swung the lantern inside the cave, the color schemes shifted, and the engraved lines seemed to animate. \"Suddenly, the head of one creature stood out clearly,\" Wachtel recalled. \"It lived for a second, then faded as another appeared.\" As for those mysterious spaghetti lines, \"they became a forest or a bramble patch that concealed and then reveled the animals within.\"</p>\n<p>Wachtel subsequently published a paper entitled, \"<a href=\"https://muse.jhu.edu/article/606950/pdf\">The First Picture Show: Cinematic Aspects of Cave Art</a>,\" in which <a href=\"http://csis.pace.edu/~marchese/CS396x/L1/lec1.html\">he concluded</a> that the cave drawings were meant to be perceived in three dimensions—one of them being time. These could have been the first \"protomovies,\" he thought.</p></div><p><a href=\"https://arstechnica.com/?p=1773827#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773827&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7a12dd1acb7e429af18b83db1d3aae2d7d4cfdc53621952f66a49f042a02db3b","category":"Tech"}