{"title":"Samsung Launches New Galaxy S24 Smartphone Lineup","link":"https://www.macrumors.com/2024/01/17/samsung-launches-galaxy-s24-lineup/","date":1705514400000,"content":"Samsung today announced the launch of the <a href=\"https://howl.me/clq3B9tsWBC\">Galaxy S24, Galaxy S24+,</a> and <a href=\"https://howl.me/clq3B9BlD1H\">Galaxy S24 Ultra</a>, its new flagship smartphones that are designed to compete with the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a>, ‌iPhone 15‌ Plus, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a>, and ‌iPhone 15 Pro‌ Max.\r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos</em></div>\r<br />\nArtificial intelligence is the focus of Samsung's new S24 devices, with all three offering Galaxy AI. Galaxy AI supports Live Translate for two-way real-time voice and text translation in phone calls, and an Interpreter function translates live conversations on a split-view so two people can converse in different languages.\r<br />\n\r<br />\nChat Assist can help users perfect conversational tones, and AI built into the Samsung Keyboard can translate messages in real-time in 13 languages. Android Auto is able to summarize incoming messages and suggest relevant replies, Transcript Assist uses AI to transcribe, summarize, and translate recordings, and a Note Assist feature in Samsung Notes offers AI-generated summaries and templates. Samsung also partnered with Google to offer \"Circle to Search,\" an option that lets S24 users circle, highlight, scribble on, or tap items on the S24 display to see search results.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/samsung-galaxy-ultra-1.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nSamsung's high-end Galaxy S24 Ultra pairs AI with camera improvements. Samsung has done away with its 10x zoom lens, opting instead for a Quad Tele System with a 50-megapixel 5x optical zoom lens, which is the optical zoom level that Apple settled on.\r<br />\n\r<br />\nThe S24 Ultra has a larger pixel size and an improved optical image stabilization system to cut down on hand-shake for reduced blur, plus the ProVisual Engine AI system allows for enhanced digital zoom, more light capture in dim conditions, and better noise reduction when recording video. Galaxy AI editing tools allow for edits like erase, recompose, and remaster, and Edit Suggestions suggests tweaks for each photo. Generative Edit can fill in parts of an image background with generative AI when removing an object or correcting a crooked image.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/samsung-galaxy-ultra-2.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nThe Galaxy S24 Ultra is equipped with Qualcomm's Snapdragon Gen 3 Mobile Platform, which Samsung says has been optimized for AI processing and requires enhanced thermal control. All three models support 1 to 120Hz adaptive refresh rates for the displays, with the Ultra offering the brightest Galaxy display to date at 2,600 nits peak brightness. Samsung is using Corning's Gorilla Armor for improved durability and scratch resistance on the Ultra, along with reduced reflection. Like Apple's A17 Pro, Samsung's latest chips support ray tracing for gaming.\r<br />\n\r<br />\nSamsung tweaked the design of the Ultra and it now offers a 6.8-inch flat display that's optimized for viewing, while the Galaxy S24 now measures in at 6.2 inches and the S24+ measures in at 6.7 inches. The screen size enhancements have been made through reductions in bezel size to keep the device size about the same.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/samsung-galaxy-ultra-3.jpg\" width=\"2000\" height=\"1125\" />\r<br />\nSamsung copied Apple's ‌iPhone 15 Pro‌ lineup and the S24 Ultra is available with a titanium frame in gray, black, violet, yellow, green, blue, and orange.\r<br />\n\r<br />\nThe Galaxy S24 Ultra is priced starting at $1,300, the S24+ is priced starting at $1,000, and the S24 is priced starting at $800.\r<br />\n\r<br />\nSamsung's Galaxy S24 lineup is available for pre-order as of today, and Samsung is offering several deals. For <a href=\"https://howl.me/clq3B9BlD1H\">the S24 Ultra</a>, customers can get up to $750 off with a trade-in, along with an exclusive $50 Samsung credit, a free storage upgrade (doubling storage at no cost), and a $100 eCertificate, plus students can get a 15 percent discount.\r<br />\n\r<br />\nFor <a href=\"https://howl.me/clq3B9tsWBC\">the S24+</a>, up to a $650 trade-in credit is available with a $50 Samsung credit, storage upgrade, $75 eCertificate, and a 7.5 percent student discount. For <a href=\"https://howl.me/clq3B9tsWBC\">the S24</a>, up to a $550 trade-in credit is available, along with a $50 Samsung credit, a storage upgrade, a $25 eCertificate, and a five percent discount for students.\r<br />\n\r<br />\nCustomers can also receive 20 percent off Samsung Care+ with Theft and Loss with the purchase of any Galaxy S24 series device.\r<br />\n\r<br />\nBest Buy is offering <a href=\"https://howl.me/clq3B9psIXM\">up to $870 off</a> the S24 series with trade-in and pre-order, with a storage upgrade and up to a $150 Best Buy gift card.\r<br />\n\r<br />\n<em><small>Note: MacRumors is an affiliate partner with Samsung and Best Buy. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><div>Tag: <a href=\"https://www.macrumors.com/guide/samsung/\">Samsung</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/17/samsung-launches-galaxy-s24-lineup/\">Samsung Launches New Galaxy S24 Smartphone Lineup</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/samsung-launches-new-galaxy-s24-smartphone-lineup.2416606/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7a1c4176e1d75efe829c9793a54f4015fbb14d8f63fcc42ea0f6a91ba79f942d","category":"Apple"}