{"title":"The parasitic louse genus Myrsidea (Amblycera: Menoponidae): a comprehensive review and world checklist","link":"https://academic.oup.com/isd/article/doi/10.1093/isd/ixae007/7667553?rss=1","date":1715212800000,"content":"<span><div>Abstract</div><span>Myrsidea</span> Waterston, 1915 (Phthiraptera: Menoponidae) is the most diverse genus of avian chewing lice. <span>Myrsidea</span> has a global distribution, is thought to be highly host-specific, and parasitizes mostly passerine birds. However, the rate of taxonomic studies describing new species is relatively low, and it is thought that much of the diversity of <span>Myrsidea</span> is yet to be discovered. This low rate of taxonomic description for this genus, and many others, may be related to the time-consuming nature of morphological species description and a lack of expertise in louse taxonomy. Furthermore, most of the taxonomic revisions and reviews have focused on specific host families, and no comprehensive review of the morphology and molecular work of <span>Myrsidea</span> has been completed in the last 20 years. Here, we review the taxonomy and systematics of <span>Myrsidea</span> to (i) describe this chewing louse genus and its biological importance; (ii) describe current problems with its taxonomy; (iii) simplify and summarize morphological descriptions; (iv) summarize molecular data; and (v) provide a comprehensive checklist of the <span>Myrsidea</span> species, with all publications and localities of occurrence included. Together, we hope that this information will provide researchers with a single source of information on the genus <span>Myrsidea</span>, making it easier for work to proceed on its taxonomy, systematics, ecology, and evolution. Importantly, our work highlights important gaps in our knowledge of <span>Myrsidea</span>, providing guideposts on where future work on <span>Myrsidea</span> is needed.</span>","author":"","siteTitle":"Insect Systematics and Diversity Current Issue","siteHash":"d4d59e2090793e303021830a9c164d689828dc5448b6052be7ec32e87f45cab0","entryHash":"7a1d458c0780c92a67ff8724fd29cf126ceb862b791b79fa3adc6a127d46e8c8","category":"Environment"}