{"title":"PSVI-17 Effects of maternal nutrition during gestation on second parity F2 offspring growth and organ weights","link":"https://academic.oup.com/jas/article/102/Supplement_3/533/7757730?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Maternal diet influences offspring growth, but the impact of granddam diet on subsequent generations is less explored. We hypothesized that granddam diet would influence second parity F2 offspring growth. The objective of this study was to determine the influence of granddam diet on second parity F2 offspring growth, morphometric measurements, and organ weights. To determine the impact of poor maternal nutrition of F0 dams on second parity offspring of F1 ewes, multiparous Dorset ewes (F0, n = 46) were fed 100% (control), 60% (restricted), or 140% (over) of NRC requirements from d 30 of gestation until parturition. The F1 ewes (n = 37) were bred at 16 to 19 mo of age to one of two related Dorset rams to generate the first parity F2 generation. The following breeding season, F1 ewes (n = 30) were bred to the same rams to generate the second parity F2 generation offspring (n = 58; F2-2), which were identified as CON F2-2 (n = 6 ewes, 12 rams), RES F2-2 (n = 6 ewes, 12 rams), or OVER F2-2 (n = 9 ewes, 13 rams) corresponding to the diets of the F0 granddams. F2-2 offspring body weights (BW) were recorded weekly from birth (d 0) to d 28, every 14 d until d 126, and every 28 d until d 266 of age. Hip height (HH), crown rump length (CRL), heart girth (HG), and body condition score (BCS) were measured at d 0 and d 120 of age. Rams were necropsied at d 284 ± 0.23. Data were analyzed with R Studio with <span>P</span> ≤ 0.05 considered significant and 0.05 &lt; <span>P</span> ≤ 0.10 considered a tendency. Granddam diet and offspring sex were included in the model with animal ID as a random effect where appropriate. On d 210 and d 238, CON F2-2 tended to weigh 6.8% and 6.3% less, respectively, than OVER F2-2 (<span>P</span> = 0.07) but were not different than RES F2-2 at d 210 (<span>P</span> = 0.55) or d 238 (<span>P</span> = 0.15). We did not detect an effect of granddam diet on HH (<span>P</span> = 0.28), CRL (<span>P</span> = 0.31), or HG (<span>P</span> = 0.62) at birth. At d 120, ewes had 3.1% shorter CRL (<span>P</span> = 0.07) and weighed 9.4% less (<span>P</span> = 0.003) than rams. Immediately before necropsy, CON F2-2 rams tended to have 5.9% less BCS compared with RES F2-2 rams (<span>P</span> = 0.07) and 5.6% less BCS than OVER F2-2 rams (<span>P</span> = 0.10). At necropsy, granddam diet did not influence organ weight. Overfed and restricted granddam diet may increase BW and BCS of second parity, second generation offspring, which provides evidence that maternal diet has multigenerational effects on offspring.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7a20a73937ba5f85e0626383b1a87f31632a547ecb7e2ee0bcf9128083f3830d","category":"Environment"}