{"title":"[ลือ] Disney พิจารณาซื้อกิจการ EA หรือบริษัทที่มีขนาดใกล้เคียง","link":"https://www.blognone.com/node/136204","date":1697117177000,"content":"<div><div><div><p>มีรายงานจาก Bloomberg ว่า Disney อาจกำลังพิจารณาซื้อกิจการบริษัทจัดจำหน่ายเกม หนึ่งในนั้นคือ Electronic Arts หลังผู้บริหารประชุมถึงแนวทางธุรกิจของบริษัท ซึ่งหนึ่งในผู้บริหารของ Disney เสนอ Bob Iger ซีอีโอ ให้เปลี่ยนธุรกิจจากแค่เป็นผู้ให้สิทธิ์จัดจำหน่ายเกม กลายเป็นพับลิชเชอร์เอง โดยหนึ่งแนวทางนั้นคือการซื้อกิจการ EA ซึ่งก็มีรายงานว่า Iger ยังไม่ผูกมัดการตัดสินใจใดๆ ทั้งสิ้น</p>\n<p>เมื่อปีที่แล้วมีรายงานว่า EA ได้หารือเกี่ยวกับแผนการที่ให้ Disney เข้าซื้อกิจการ รวมถึง NBCUniversal, Amazon และ Apple ด้วย แต่ต่อมามีรายงานว่าการเจรจากับ NBCUniversal นั้นล้มเหลว</p>\n<p>ก่อนหน้านี้ Disney เคยผู้จำหน่ายเกมมาก่อนจนกระทั่งปี 2016 ทาง Disney ได้ปิดตัวสตูดิโอสร้างเกม แล้วยกเลิกให้บริการเกม Disney Infinity และเปลี่ยนรูปแบบธุรกิจเป็นการขายลิขสิทธิ์ให้ทีมพัฒนาเกมบริษัทต่าง ๆ แทน</p>\n<p>เกมที่ Disney ให้สิทธิ์นำไปทำเกมล่าสุด ได้แก่ Return to Monkey Island, Disney Illusion Island, Star Wars Jedi: Survivor และ Lego Star Wars: The Skywalker Saga</p>\n<p>ส่วนเกมเกมที่กำลังจะออกเร็วๆ นี้ก็มี Avatar: Frontiers of Pandora, Spider-Man 2, Star Wars: Outlaws และเกม Indiana Jones โดย Machine Games ผู้พัฒนา Wolfenstein</p>\n<p>ในช่วงไม่กี่ปีที่ผ่านมา Disney บอกว่าบริษัทมีความกระตือรือร้นที่จะทำงานร่วมกับสตูดิโอทุกขนาดเพื่อขยายแฟรนไซน์ของตัวเองในธุรกิจเกม โดยล่าสุด Disney เน้นย้ำว่ายังไม่จำกัดขอบเขตการนำ IP ของบริษัท ไปใช้พัฒนาเกมสำหรับนักพัฒนาเกมอินดี้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cac7428755566fee16fdd1206324d507.png\" /></p>\n<p>ที่มา - <a href=\"https://www.gamesindustry.biz/disney-reportedly-looking-to-acquire-major-publisher-like-ea\">Gamesindustry.biz</a> via <a href=\"https://www.bloomberg.com/news/features/2023-10-10/has-bob-iger-lost-the-magic-inside-disney-ceo-s-billion-dollar-crisis\">Bloomberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/disney\">Disney</a></div><div><a href=\"/topics/ea\">EA</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/electronic-arts\">Electronic Arts</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7a22b52a0e66dc7c30cb46d16c4de64acea784bd94c33fa5e6df588d33b829aa","category":"Thai"}