{"title":"Solo: A Star Wars Story","link":"https://markpeak.net/solo-a-star-wars-story/","date":1625586140000,"content":"<p>Solo: A Star Wars Story เป็นภาพยนตร์ Star Wars ยุค Disney เรื่องเดียวที่เหลืออยู่ที่ไม่ได้ดูในโรง พอมี Disney+ เข้ามาก็เลยได้ฤกษ์ เปิดดูเป็นเรื่องแรก</p>\n<p>หนังจับความช่วงก่อน Episode IV ประมาณสิบปี เป็นช่วงที่ Han Solo อยู่ในวัยประมาณ 20 เพิ่งออกมาเผชิญโลก และกระแสต่อต้านจักรวรรดิเริ่มก่อตัวขึ้น</p>\n<p>เนื่องจากได้ยินเสียงวิจารณ์มาก่อนหน้าพอสมควร เลยไม่ได้คาดหวังมากนัก พอมาดูจริงๆ ก็พบว่ามันก็ไม่ได้แย่มาก แต่ก็ควรดีกว่านี้ได้อีกมาก</p>\n<ul>\n<li>ปัญหาสำคัญของหนังอยู่ที่นักแสดงนำ Alden Ehrenreich ที่รับบทเป็น Han Solo เพราะบุคลิกไม่ให้ ดูยังไงก็ไม่ใช่ เมื่อบวกกับธีมของหนังที่ต้องการขับบุคลิกของ “Solo วัยหนุ่ม” ออกมาให้เด่นที่สุด มันจึงกลายเป็นแย่ไปเลย</li>\n<li>ตัวละครรองคนอื่นก็แย่เกือบหมด นางเอก แม่มังกร Emilia Clarke ถูกวางบทมาให้เป็น “อดีตคนรักที่มีปริศนา” และต้องลังเลว่าจะเลือกใคร ก็ไปไม่สุดทาง หนังเลือกไม่สุด ดันเลือกอยู่ตรงกลางระหว่างเผยอดีตของ Qi’ra ช่วงที่หายไปให้ขยี้หัวใจ กับการขยี้บททรยศหักหลังกันไปเลย เลยไม่สุดสักทาง กลายเป็นว่าจะรักก็ไม่สุด จะหักหลังก็ยังมีเยื่อใย แล้วไงก็ไม่รู้เหมือนกัน</li>\n<li>ตัวละครอีกตัวคือ Tobias Beckett นักล่าเงินรางวัลที่มีสถานะเป็น mentor/father figure ของ Solo วัยหนุ่มก็กลับมีคาแรกเตอร์ไม่โดดเด่นนัก (เมื่อเทียบกับจักรวาล Star Wars ที่มาตรฐานเรื่องความเด่นสูงมาก) กลายเป็นคุณลุงทั่วไปที่ไม่น่าจดจำ</li>\n<li>คนเดียวที่โดดเด่นคือ Lando Calrissian เวอร์ชันตีความใหม่แบบ Childish Gambino ที่แพรวพราวขึ้นกว่า Lando เวอร์ชันต้นฉบับมาก คนชม Donald Glover กันเยอะมาก ก็ต้องยอมรับว่าเล่นดีจริงๆ</li>\n<li>ช่วงประมาณครึ่ง ชม. แรกของหนังทำดีมาก น่าติดตามมาก แต่พอจบฉากระเบิดรถไฟแล้ว หนังกลับเสียพลังของมันไป</li>\n<li>อีกประเด็นที่ไม่ค่อยชอบนัก (แม้เป็นแฟน Star Wars) คือหนังพยายาม “โยง” กับแง่มุมอื่นๆ ในจักรวาล Star Wars มากเกินไปจนมันค่อนข้าง “แข็ง” (ที <a href=\"https://markpeak.net/star-wars-the-rise-of-skywalker/\">Episode IX</a> ที่ควรโยงเยอะๆ กลับไม่ทำนะ) เหมือนบทหนังมี requirement ว่าต้องโยงกับตำนานจุดโน้น บทพูดในไตรภาคต้นฉบับตรงนั้น ฯลฯ ทำให้ความสนุกในตัวเรื่องเองมันหายไปเยอะ</li>\n<li>Darth Maul เป็นตัวอย่างที่ดีที่สุดของประเด็นนี้ ทำไมหนังต้องขมวดปมจบให้มี Darth Maul ด้วย นอกจากการเอาใจแฟนๆ รุ่นเก่า แล้วยังคิดสาเหตุไม่ออกเลย การมี Darth Maul กลับทำให้แฟนรุ่นใหม่งง และเส้นเรื่องจบไม่ลงในตัวเองด้วยซ้ำ (คือตั้งใจวางไว้ต่อภาค 2 เกินไป พอหนังแป๊กก็คง<a href=\"https://markpeak.net/star-wars-film-hiatus/\">ไม่ได้ทำต่อ</a>) ในขณะที่ตัวร้ายตัวแรก Dryden Vos กลับไม่มีเวลาอธิบายแบ็คกราวน์ของเขามากนักว่าคือใคร ทำอะไร แรงจูงใจคืออะไร</li>\n<li>ตอนท้ายๆ Maul สั่งให้ Qi’ra ไปหาที่ดาว Dathomir รู้สึกคุ้นชื่อมาก จนสุดท้ายมาพบว่าอยู่ในเกม <a href=\"https://markpeak.net/star-wars-jedi-fallen-order/\">Jedi: Fallen Order</a></li>\n<li>อีกปัญหาที่พบคือหนังยาวมาก 135 นาที หลายจุดรู้สึกยืด (เช่น ตอนขับยานพุ่งออกจากกลุ่มเมฆ ที่ต้องไปเติมเชื้อเพลง) สามารถลดเวลาให้กระชับลงกว่านี้ได้ หรือเอาเวลาไปอธิบายส่วนอื่นที่ควรอธิบายดีกว่า</li>\n</ul>\n<p>ภาพรวมก็คือดีใจที่ได้มาดูเรื่องราวของยาน Millennium Falcon สักทีว่าเป็นยังไงมายังไง ที่ Han กับ Lando เล่นพนันกันมันเป็นอย่างไร เจอกับ Chewbacca ได้ยังไง แต่ที่เหลือรู้สึกว่าหนังตั้งใจ “ยัด” ประเด็นมากไป บวกกับนักแสดงที่ไม่ค่อยลงตัว มันเลยไม่ดีเท่าที่ควรจะเป็น</p>\n<p>ในภาพยนตร์ยุค Disney ก็ต้องยอมรับว่า Rogue One ดีที่สุดจริงๆ</p>The post <a href=\"https://markpeak.net/solo-a-star-wars-story/\">Solo: A Star Wars Story</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"7a272c81f0ab4de6ae54334fcee8f94229dd22a43d9c71127cc2d7c654918cb5","category":"Thai"}