{"title":"78 Prolonged heat stress impact on molecular responses of skeletal muscle and growth performance in finishing beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/223/7757341?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Rising temperatures significantly impact cattle production economically, reducing feed intake, efficiency, and growth, leading to substantial losses. Despite these known effects, there remains a paucity of data on the specific responses of skeletal muscle and adipose tissue to heat stress conditions. Therefore, this study aimed to elucidate the effects of prolonged heat stress on the molecular mechanisms of skeletal muscle growth and adipose tissue deposition and physiological response. Thirty-two predominantly Angus beef steers [initial average body weight (BW) = 364 ± 4.60 kg] were subject to a 28-d heat stress period. Steers were randomly allotted to one of two treatment groups (n = 16 steers/treatment) 1) Control (CON), exposed to outdoor environmental temperature-humidity index (THI) of 60; or 2) Heat Stress (HS), subject to THI of 70 to 80 for 8 h then returned to control treatment THI to simulate typical cooldown periods exhibited in instances of HS. Feed intakes were recorded daily, while BW was measured weekly prior to feed delivery. Biopsies of the skeletal muscle from the Longissimus muscle (LM) at the area of the 13th rib and adipose tissue from the subcutaneous fat of the flank region were performed on d 1, 14, and 28 for each individual steer and used for molecular analysis. For gene expression, a repeated measures ANOVA was utilized, acknowledging the individual animal as the experimental unit. The analysis of both gene expression over time and growth performance indicators was conducted using repeated measures ANOVA, with post-hoc analysis via Tukey’s test for specific comparisons. Data presentation includes the standard error of means, with an alpha (α) level set at 0.05 for determining statistical significance. Behavioral signs of heat stress, elevated respiratory rates, were observed with HS steers exhibiting a respiratory rate of 92.92 ± 24.79 breaths per minute (bpm) compared with 60.48 ± 14.94 bpm in CON steers (<span>P</span> &lt; 0.01). Heat stress decreased average daily gain (ADG) during d 0 to 7 (49.11%) and d 15 to 21 (59.14%) compared with the control group (<span>P</span> &lt; 0.01). Dry Matter Intake (DMI; <span>P</span> &gt; 0.1) and feed efficiency (<span>P</span> &gt; 0.1) were not altered in CON vs. HS steers. In skeletal muscle, on d 28 of exposure to heat stress, there was a significant overexpression of Heat Shock Protein (HSP) isoforms 20, 27, and 90 (<span>P</span> &lt; 0.05) relative to the control group, accompanied by increased Myf5 (<span>P</span> &lt; 0.05) gene expression. In adipose tissue, there was upregulation of PPARγ and SCD (<span>P</span> &lt; 0.05), both of which are implicated with adipose tissue differentiation and lipid deposition process. Our findings indicated that HS modifies the expression of genes associated with skeletal muscle growth and adipose tissue deposition, concurrently impairing overall animal growth predominantly through reduced feed intake.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7a281eb6f0c216fb0ba84c0752223130eaa57f2a397829432f718c643a2a022a","category":"Environment"}