{"title":"Decarbonizing university campuses: A business model for food waste management at Istanbul Technical University (İTÜ) Ayazağa Campus, Turkey","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14316?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>Food waste is a significant environmental issue today, as it contributes to depleting natural resources and greenhouse gas emissions from improper management. To address this, alternative food waste management and recovery strategies must be developed to promote nutrient recirculation and move towards decarbonization. University campuses could play a crucial role in pioneering such strategies, through pilot studies and implementation of effective waste management. The aim of this study is to devise a food waste management strategy that provides a more circular and decarbonized economy. A case example was developed based on ITU Ayazağa Campus, Turkey, with annual separated food waste of 577 tonne per year. A Life Cycle Assessment was conducted using the EASETECH software. Four scenarios were evaluated: anaerobic digestion, composting, incineration, and landfill. Of these, incineration resulted in the highest CO<sub>2</sub>-eq savings, but lacked decoupling and circularity of resources. Conversely, anaerobic digestion demonstrated the highest circularity and lowest toxicity. Based on these findings, anaerobic digestion was selected for further investigation. Economic transactions for the anaerobic digestion system's business models were analyzed, including revenues, municipality fees, and operating costs. The new economic model is expected to align with circular economy strategies and promote stakeholder collaboration as a significant social outcome.</p>","author":"Kadriye Elif Maçin, \nOsman Atilla Arıkan, \nMahmut Altınbaş, \nAnders Damgaard","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"7a2979b0de3ae4bae80e7c069be86745fb8e67bac9126c07d7513723dbf1337f","category":"Environment"}