{"title":"After the MacBook Air price cut, will the iPhone 15 Pro get a price hike?","link":"https://www.macworld.com/article/1952142/macbook-air-price-cut-iphone-15-pro-rumors.html","date":1686741300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple released the <a href=\"https://www.macworld.com/article/1948603/15-inch-macbook-air-m2-review.html\">15-inch MacBook Air</a> at WWDC, no one was surprised that the new laptop was merely a larger version of the 13-inch MacBook Air with a slightly large screen, trackpad, and body. What was surprising was the price: Instead of adding $200 or $300 to the price of the existing MacBook Air, making the new model $1,399 or $1,499, Apple priced the new MacBook Air at $1,299 and cut the price of the 13-inch model by $100.</p>\n\n\n\n<p>And if you drill down, the price is even more surprising. The 15-inch Air starts with the “full” M2 Pro processor with 10 GPU cores, which is a $100 upgrade on the 13-inch MacBook Air. That means the 15-inch MacBook Air costs the same as the 13-inch MacBook Air did in May. That’s what you would call a pleasant surprise.</p>\n\n\n\n<p>Does this mean Apple is rethinking its pricing strategy? Perhaps. Then again, Apple also announced the $6,999 Mac Pro and the $3,499 Vision Pro, the two highest-priced products in its catalog. But still, it’s hard not to wonder if the MacBook Air’s aggressive pricing is the start of a new trend.</p>\n\n\n\n<p>This brings us to the iPhone 15 Pro. Reports have been swirling for months that Apple is planning on raising the price of the Pro models. Just this week, in fact, China-based <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://money.udn.com/money/story/11162/7230774&amp;xcust=1-1-1952142-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Economic Daily News</a> reported that the phones may cost as much as $200 more than the equivalent iPhone 14 Pro models, meaning that the iPhone 15 Pro Max could start at $1,299 and top out at $1,800 or higher if Apple offers a 2TB option.</p>\n\n\n\n<p>It bears noting that similar rumors last year claimed the iPhone 14 Pro Max would also get a price hike, but Apple opted to keep the pricing the same. But the rumors about <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">this year’s phone</a> suggest a much bigger upgrade than last year, so it wouldn’t be surprising to see the high-end iPhone get a higher price tag.</p>\n\n\n\n<p>Apple clearly is feeling the pinch of flagging Mac sales, so the MacBook Air’s price cut, while surprising, makes sense. It’s not the same with the iPhone, whose sales remain healthy. So we’d bet the rumors are right this year and for the first time in years, Apple ups the price of the Pro models by at least $100 each.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7a36a22e3e33e02dff1a04e09a70b6d912401153697cea7132f350f482a93b34","category":"Apple"}