{"title":"Elden Ring: Shadow of the Erdtree trailer offers deep lore, giant flaming bosses","link":"https://arstechnica.com/?p=2004796","date":1708530240000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/Screenshot-2024-02-21-at-10.07.10%E2%80%AFAM-800x406.png\" alt=\"Character on horseback overlooking a burning, distant tree\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/Screenshot-2024-02-21-at-10.07.10%E2%80%AFAM.png\">Enlarge</a> <span>/</span> There's a lot of meaning in this image for studied fans of <em>Elden Ring</em>, but confirmation will have to wait until June. (credit: Bandai Namco)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A gameplay reveal trailer for a heavily anticipated expansion to <em>Elden Ring</em> has <a href=\"https://www.youtube.com/watch?v=qLZenOn7WUo\">arrived</a>, and it suggests that more of the big bosses, cryptic but epic-scale storytelling, and brutal combat fans have come to expect will be available in the <em>Shadow of the Erdtree </em>expansion. The downloadable content arrives June 21, 2024, and costs $40; preorders are available now (<a href=\"https://store.steampowered.com/app/2778580/ELDEN_RING_Shadow_of_the_Erdtree/\">Steam</a>, <a href=\"https://store.playstation.com/en-us/product/UP0700-PPSA04610_00-ELDENRINGSOTEE00\">PlayStation</a>, <a href=\"https://www.xbox.com/en-us/games/store/elden-ring-shadow-of-the-erdtree-pre-order/9n5p5sc2rz7k\">Xbox</a>).</p>\n<p><em>Shadow of the Erdtree</em> takes place in \"The Land of Shadow,\" seemingly a kind of prequel setting to the main <em>Elden Ring, </em>potentially inside a deity's dreams. You can never be too sure, but the presence of certain characters, and the suggestion that you will access the new content by touching the arm of a major but previously unexplored character, suggests you will be traveling through their memories, their dreams, or some combination thereof. The very first image you see is of a player character riding up to a cliff and seeing a flaming tree—perhaps not the Erdtree central to the main game, but a precursor of it that is hinted at in the game's lore.</p>\n<p>Gameplay-wise, there are many new things to notice, including hand-to-hand combat, far more powerful crossbows, new spells and weapons, and a whole host of large, epically detailed, seemingly unfair boss battles.</p></div><p><a href=\"https://arstechnica.com/?p=2004796#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004796&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7a45c93cb5bf7f7ef7a8b9c2c7a59d7082d4afb4c0ca27fd0b253f3c0659f3d4","category":"Tech"}