{"title":"The CEO of HyperVerse, a Collapsed Crypto Ponzi Scheme, Does Not Appear to Exist","link":"https://www.theguardian.com/technology/2024/jan/04/chief-executive-of-collapsed-crypto-fund-hyperverse-does-not-appear-to-exist","date":1704747872000,"content":"\n<p>Sarah Martin, reporting for The Guardian:</p>\n\n<blockquote>\n  <p>A man named Steven Reece Lewis was introduced as the chief \nexecutive officer of HyperVerse at an online global launch event \nin December 2021, with video messages of support from a clutch of \ncelebrities released on Twitter the following month, including \nfrom the Apple co-founder Steve Wozniak and actor Chuck Norris. [...]</p>\n\n<p>Guardian Australia has confirmed that neither the University of \nLeeds nor the University of Cambridge has any record of someone by \nthe name Steven Reece Lewis on their databases. No records exist \nof Steven Reece Lewis on the UK companies register, Companies \nHouse, or on the US Securities and Exchange Commission. Adobe, a \npublicly listed company since 1986, has no record of any \nacquisition of a company owned by a Steven Reece Lewis in any of \nits public SEC filings. It is understood that Goldman Sachs could \nfind no record of Reece Lewis having worked for the company. \nGuardian Australia was unable to find a LinkedIn profile for Reece \nLewis or any internet presence other than HyperVerse promotional \nmaterial. </p>\n</blockquote>\n\n<p>A man who doesn’t actually exist sounds like the perfect CEO for any cryptocurrency company.</p>\n\n<p>Also: Looks like <a href=\"https://behindmlm.com/companies/hyperfund/steve-wozniak-2nd-cameo-personality-to-promote-hyperverse/\">the Woz</a> <a href=\"https://behindmlm.com/companies/hyperfund/hyperverse-investor-ropes-chuck-norris-into-ponzi-promo-vid/\">and Norris</a> “endorsements” were scripts they were paid to read through Cameo. </p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/08/hyperverse\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7a48f9ef43e99064f52d97398183f37b0f168f878fd26b3bfa36038d80b208ef","category":"Tech"}