{"title":"Analysis of Research Hot Spots in Chinese and International English Ecohydrological Literature","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2718?af=R","date":1726311855000,"content":"<h2>ABSTRACT</h2>\n<p>To enhance comprehension of current research progress in the field of ecohydrology and to provide valuable references for future related research, policy formulation and international collaboration, this article relies on ecohydrology-related literature and citation records in four databases: China Knowledge Network (CNKI), Wanfang Database, Web of Science (WOS) and Elsevier, up until the end of 2022. We use publication and citation trends analysis along with keyword hotspot analysis using VOS viewer to investigate publication and citation trends in Chinese and English literature. The study systematically analyse the process of keyword changes and research hotspots in Chinese and international English literature, providing a detailed explanation of the differences in research hotspots and the reasons for their formation. The research indicates that since the inception of the term ‘ecohydrology’, relevant literature has displayed sluggish growth alongside rapid development. Additionally, alterations in primary keywords have differed between Chinese and English literature over time. However, ‘groundwater’ has consistently retained a significant amount of attention within Chinese literature. Groundwater has been extensively studied in Chinese literature, with a particular focus on eco-hydrological processes, their effects, modelling and techniques. Similarly, English language literature is abundant with keywords denoting pivotal concepts like the environment, hydrology, fauna and rivers. These areas have been the focal points of research for international scholars. Regional characteristics, ecological conditions, economic development level and scientific research priorities, among other factors, are all significant contributors to the development of the field of ecohydrology. Differences in research hotspots can also be attributed to geographical characteristics, ecological environment conditions and scientific research priorities. Over the past decade, there has been a gradual convergence in research between Chinese and English literature. The current hotspots of research in ecohydrology include basic research, theoretical applications and adaptive wide-area mechanistic research. In the future, the discipline of ecohydrology is likely to face numerous challenges and opportunities related to climate change, resource management, and societal needs. Interdisciplinary collaboration, technological innovation and global cooperation will continue to drive breakthroughs in ecohydrology research.</p>","author":"Mingyang Li, \nXiaodan Zhang, \nFulin Li, \nJiwen Huang, \nZhanhua Li, \nYuzhi Shi, \nSinan Wang","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"7a4ceaf11a16bc9b530ad0c139f00696d85cb2e253f6f4a2267372d7824c274b","category":"Environment"}