{"title":"Review: Aqara's Roller Shade Driver E1, TVOC Air Quality Monitor, and Hub M1S Are Reliable and Well-Designed HomeKit Accessories","link":"https://www.macrumors.com/review/aqara-roller-shade-driver-tvoc-air-quality-monitor/","date":1632339723000,"content":"<a href=\"https://www.aqara.com/en/home.html\">Aqara</a> makes a range of <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>-compatible smart home devices that are stocked in Apple Stores around the world. This review takes a look at some of Aqara's latest products, including its TVOC Air Quality Monitor and Aqara Roller Shade Driver E1, which launches today.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-tvoc-sensoor-roller-shade-driver-hub-m1s-review.jpeg\" />\r\n<br />\r\nWith these new accessories, I was able to add to the <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> setup that I created with some of Aqara's devices <a href=\"https://www.macrumors.com/review/review-aqara-camera-hub-g2h-and-sensors/\">earlier this year</a> and put the company's new additions to the smart home to the test.\r\n<br />\r\n\r\n<br />\r\n<ul><li><a href=\"https://www.macrumors.com/review/review-aqara-camera-hub-g2h-and-sensors/\">Review: Aqara Camera Hub G2H and Sensors Offer Easy Setup and Fast Response Times in Compact Designs</a></li>\r\n<br />\r\n<li><a href=\"https://www.macrumors.com/review/aqara-h1-switches-temperature-sensor-hub-m2/\">Review: Aqara's HomeKit H1 Switches, Temperature Sensor, and Hub M2 Expand Any Smart Home With Easy Setup</a></li></ul>\r\n<br />\r\n\r\n<br />\r\nWhile Aqara does have its own app for controlling and setting up the accessories, it is possible to control, automate, and manage them entirely through Apple's Home app.\r\n<br />\r\n\r\n<br />\r\n<h2>Hub M1S</h2>\r\n<br />\r\nTo connect the new devices, I used the Aqara Hub M1S. The Hub M1S serves as a smart home control center for the wide range of Aqara sensors, controllers, and other child devices using the Zigbee 3.0 protocol, which can connect up to 128 devices. The Hub M1S will also support <a href=\"https://www.macrumors.com/2021/05/11/apple-smart-home-matter-connectivity-standard/\">Matter</a>, a new smart home protocol built by companies including Apple and Amazon, via an over-the-air software update in the future.\r\n<br />\r\n\r\n<br />\r\nIn terms of design, the Hub M1S features a compact, circular design with matte white plastic. There is a patterned speaker grille on the front, an RGB 18-LED ring around the outside, and a convenient ‌HomeKit‌ pairing sticker on the top.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-hub-m1s.jpeg\" />\r\n<br />\r\nUnlike many ‌HomeKit‌ hubs, the M1S plugs directly into a power outlet, with no need for additional cables or adapters. This design is much more convenient, although it comes at the cost of not having an ethernet port for a wired connection to a router. As a result, the Hub M1S connects over Wi-Fi, but I did not notice any significantly slower latency compared to other wired hubs.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-hub-m1s-top.jpeg\" />\r\n<br />\r\nThe design of the hub itself extends further back than one may expect owing to the need for a built-in adapter, but it is slim enough once plugged in to be discreet and broadly as good-looking as you could hope for with such a device.\r\n<br />\r\n\r\n<br />\r\nThe Hub M1S integrates with the Home app seamlessly, initiated by a simple scan of the ‌HomeKit‌ code sticker on the top. The initial pairing process was frustration-free and any subsequent devices paired with the Hub M1S automatically appear in Apple's Home app.\r\n<br />\r\n\r\n<br />\r\nThe Hub M1S also supports all four of the native ‌HomeKit‌ alarm modes and features a surprisingly loud two-watt built-in speaker. The speaker does not sound like a high-fidelity component, but since it is not for music, the quality is adequate for brief alerts and can easily project across a large room. Like other Aqara hubs, the Hub M1S uses its speaker to talk you through the setup process and pairing other accessories, and it can also be used to deliver alerts through automations in the Aqara app.\r\n<br />\r\n\r\n<br />\r\nThe illumination sensor and RGB LED array are similarly configurable in the Aqara app, with options for brightness and color. While the speaker and the LED ring do not integrate directly with the Home app due to Apple's limitations, they do allow the Hub M1S to be used as an alarm, a doorbell, or even a night light via the Aqara app, in addition to its ‌HomeKit‌ capabilities.\r\n<br />\r\n\r\n<br />\r\n<h2>Aqara Roller Shade Driver E1</h2>\r\n<br />\r\nThe Aqara Roller Shade Driver E1 is a new product that allows users to easily retrofit smart home functionality to their existing roller shades by motorizing its beaded cord. The design mirrors other Aqara products with matte white plastic but is surprisingly heavy owing to its motor and internal battery. It feels very substantial and well-built, and is subtle enough to not be an eyesore when attached to a wall.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-roller-shade-driver.jpeg\" />\r\n<br />\r\nThe Roller Shade Driver features a detachable plastic runner on its rear with screw holes to screw directly into a wall. The correct screws and wall anchors come in the box, as well as an optional adhesive strip. While it does demand screwing into a wall, as any other shade driver would require, the installation process is relatively simple thereafter.\r\n<br />\r\n\r\n<br />\r\nThe Roller Shade Driver offers two power modes. You can either operate the device wirelessly, and then recharge its internal battery around every two months via its USB-C port, or leave a power cable inserted all of the time to avoid the need for recharging. \r\n<br />\r\n\r\n<br />\r\nThe Roller Shade Driver comes with a selection of four adapters to accommodate different beaded cords, meaning that it should work with most roller shade cords with beads between three to six millimeters thick, as well as both plastic and metal chains. After simply feeding your shade's cord into the adapter, it is very easy to pair the shades to an Aqara hub like the company's other devices using Zigbee 3.0, with a simple press of the pairing button and instant connection with the Aqara hub, which also automatically adds the shades to the Home app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-roller-shade-driver-adapters.jpeg\" />\r\n<br />\r\nIn the Aqara app, you can tweak the pre-set open and closed positions so that the driver knows when to stop opening or closing the shades and understands percentages within that range. After that, you can use the Home app alone, and set up automations to control the shades, such as based on sunset and sunrise time, or add the shades to scenes and shortcuts. One excellent addition to the design is physical buttons for quick manual control, just in case you do not have a Siri-enabled device nearby and want to close or open the shades.\r\n<br />\r\n\r\n<br />\r\nIn day-to-day use, I found the motor to be much quieter than some competing ‌HomeKit‌ roller shade drivers, and also was much less prone to slippage and loss of the exact open and closed positions. Crucially, I have found that reliable connectivity is the biggest problem with some of the existing brands that offer roller shade drivers, but the Aqara Roller Shade Driver's connection was consistently reliable. Its USB-C port for power and manual buttons are also excellent practical advantages over some competing products.\r\n<br />\r\n\r\n<br />\r\nThe Roller Shade Driver launches today as the product begins to roll out to a range of countries around the world, starting in Europe and Asia.\r\n<br />\r\n\r\n<br />\r\n<h2>TVOC Air Quality Monitor</h2>\r\n<br />\r\nAqara's TVOC Air Quality Monitor is a small HomeKit-enabled temperature, humidity, and air quality sensor that can show this information directly on the sensor itself via an e-ink display. This means you can watch changes in real-time and glance at the current metrics without needing to open <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> or use the Home app, but still feeds these metrics to the Home app for when you want that functionality.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-tvoc-sensor.jpeg\" />\r\n<br />\r\nPairing is extremely fast and easy once you have an Aqara ‌HomeKit‌ hub set up, with a simple press of the top button to pair via Zigbee 3.0, which also automatically adds it to the Home app. The Home app displays the sensor's current temperature, humidity, and air quality information, which allows you to use these metrics to trigger automations, in the Shortcuts app, or simply take a glance at the current statuses in the Home app.\r\n<br />\r\n\r\n<br />\r\nThe design is very small, slim, and compact, with the front perspex being set into the matte white casing. The back of the sensor is flat and magnetic, allowing users to stick it to a surface like a refrigerator if desired.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/aqara-tvoc-sensor-back.jpeg\" />\r\n<br />\r\nThe Air Quality Monitor is powered by two small disposable batteries, which Aqara says should power the device for around a year before needing replacement. When attempting to replace the batteries, I found the plastic backplate extremely difficult to pry off, even needing to use a flathead screwdriver to get enough leverage, but thankfully this won't be something you need to do often.\r\n<br />\r\n\r\n<br />\r\n<h2>The Bottom Line</h2>\r\n<br />\r\nWith these accessories, Aqara maintains its high standards of design, easy pairing, and reliability. The company's support for ‌HomeKit‌ and focus on seamless integration in Apple's Home app continues to be better than many other smart home brands. Aqara's practical designs, easy setup process, and reliable connectivity are still present with the Hub M1S, Roller Shade Driver, and TVOC Air Quality Monitor.\r\n<br />\r\n\r\n<br />\r\nThe Hub M1S, while not quite as full-featured as the Hub <a href=\"https://www.macrumors.com/guide/m2/\">M2</a>, has an outstanding minimal design that cuts down on cables, and I wish more smart home brands would embrace this more practical design for their hubs. Added features such as the speaker LED ring make an otherwise unexciting product more useful, even if these aspects do not integrate with the Home app.\r\n<br />\r\n\r\n<br />\r\nThe Roller Shade Driver is an affordable and convenient way to upgrade your manual roller shades with smart functionality and offers a distinctively better experience than other competing devices that I have tried. Although the need to screw into a wall may put some users off, once completed, the setup is fairly effortless and it becomes a device that works reliably in the background.\r\n<br />\r\n\r\n<br />\r\nThe Air Quality Monitor makes a great addition to any desk with its glanceable e-ink display and minimalist aesthetic, but is also useful within the Home app for any growing ‌HomeKit‌ setup. While it is a little pricey at $44.99, the combination of the e-ink display and ‌HomeKit‌ integration, as well as multiple metrics, will make it worth its cost for many individuals.\r\n<br />\r\n\r\n<br />\r\n<h2>How to Buy</h2>\r\n<br />\r\n<ul>\r\n<br />\r\n<li><a href=\"https://www.amazon.com/Aqara-M1S-Wireless-Automation-Assistant/dp/B092ZTP1ZZ?ref_=ast_sto_dp\">Hub M1S</a> - $49.99 (10% off on-page coupon currently available)</li>\r\n<br />\r\n<li><a href=\"https://www.amazon.com/Aqara-Pollution-Temperature-Humidity-High-Contrast/dp/B094R8RBWT?ref_=ast_sto_dp\">TVOC Air Quality Monitor</a> - $44.99 (10% off on-page coupon currently available)</li>\r\n<br />\r\n<li><a href=\"https://www.amazon.co.uk/Aqara-Requires-Rechargeable-Compatible-Assistant/dp/B097YFL7RS/\">Aqara Roller Shade Driver E1</a> (available in the UK only to start, expanding to other countries in Europe and Asia over the coming weeks)</li>\r\n<br />\r\n</ul>\r\n<br />\r\n\r\n<br />\r\nAqara is currently offering a 15 percent discount on the Roller Shade Driver E1 on its Amazon store in the UK with the promo code <strong>RSDE1PR1</strong>, valid through to September 24, 2021.\r\n<br />\r\n\r\n<br />\r\n<em><small>Note: Aqara provided <em>MacRumors</em> with a Roller Shade Driver E1, TVOC Air Quality Monitor, and Hub M1S for the purpose of this review. No other compensation was received.</small></em><div>Tags: <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, <a href=\"https://www.macrumors.com/guide/aqara/\">Aqara</a></div><br />This article, \"<a href=\"https://www.macrumors.com/review/aqara-roller-shade-driver-tvoc-air-quality-monitor/\">Review: Aqara's Roller Shade Driver E1, TVOC Air Quality Monitor, and Hub M1S Are Reliable and Well-Designed HomeKit Accessories</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-aqaras-roller-shade-driver-e1-tvoc-air-quality-monitor-and-hub-m1s-are-reliable-and-well-designed-homekit-accessories.2312712/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=LfaRdiHXey4:GqQRF7bdcQs:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=LfaRdiHXey4:GqQRF7bdcQs:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/LfaRdiHXey4\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7a5c8080639af2f45b29d1a6664ae016f845ac5cfb57e900b9c607dd955dee43","category":"Apple"}