{"title":"Phenological similarity and distinctiveness facilitate plant invasions","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13839?af=R","date":1715764666000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Darwin posited that invaders similar to native species are less likely to be successful due to competitive exclusion. A key axis across which such competition occurs across angiosperms is the timing of flowering, or reproductive phenology. It has been hypothesized that temporal isolation facilitates the establishment of introduced species. However, our knowledge of how the timing of flowering may influence invasion success is lacking at broader geographic and larger taxonomic scales. To address this impasse, we investigated: (i) how flowering phenology differs between native and non-native species; (ii) whether the flowering phenology of successful invaders is distinct from native taxa; and (iii) whether invasive species tend to be more closely related to natives than other less successful, non-invasive introduced species are.</p>\n<h2>Location</h2>\n<p>California, USA.</p>\n<h2>Time Period</h2>\n<p>Present.</p>\n<h2>Major Taxa Studied</h2>\n<p>Angiosperms.</p>\n<h2>Methods</h2>\n<p>We compiled phenological data for over 6000 angiosperm species across California, a highly invaded biodiversity hotspot, from published flora. Using these data, we assessed the degree of phenological and phylogenetic similarity among native, non-invasive introduced, and invasive species. We also examined how this similarity varies with climate.</p>\n<h2>Results</h2>\n<p>Both non-invasive introduced and invasive species were more phenologically and phylogenetically distant from natives than natives were from each other. However, invasive plants tend to be more similar to native species in terms of flowering phenology and phylogenetic relationships than non-invasive introduced species. Further, the degree of similarity between native and non-native species was mediated by climate, where phenological and phylogenetic similarities were greater in cooler regions.</p>\n<h2>Main Conclusions</h2>\n<p>Together, our results demonstrate that both similarity and distinctiveness can facilitate plant invasions and that invaders just similar enough to the native flora are more likely to be successful.</p>","author":"Daniel S. Park, \nKimberly M. Huynh, \nXiao Feng","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"7a66f3c460760057734f4f081085f527aadcc623b6f7c85a4c39a543b3c82dbc","category":"Environment"}