{"title":"Functional and sensory properties of infant complementary foods formulated from millets, orange-flesh sweet potatoes, carrots, periwinkle and oyster.","link":"https://www.preprints.org/manuscript/202407.1237/v1","date":1721094588000,"content":"The study evaluated the functional and sensory properties of infant complementary foods formulated from millets, orange-flesh sweet potatoes, carrots, periwinkle and oyster. Experimental/cross-sectional design was used. Millet, orange-flesh sweet potato (OFSP), carrots, periwinkle and oyster were purchased, processed into flour using standard methods. The complementary food was formulated on protein basis for infants 6–12 months.  The formulated foods were millet/OFSP flours (70:30), millet/OFSP/carrot/periwinkle (49:29:7:15), and millet/OFSP/carrot/oyster (65:20:5:10). Functional properties were carried out using standard methods. Sixty nursing mothers attending Orogbum Health Centre were systematically sampled for the sensory evaluation. ANOVA was used for the study. The result showed packed density (0.77 g/mL) was significantly higher (p &lt; 0.05) in food formulated from millets/OFSP than in millet/OFSP/carrot/oyster (0.68 g/mL). Loosed density was lowest (0.40 g/mL) in millet/OFSP/carrot/oyster. Carr index from ranged from 42.23 in millet/OFSP/carrot/oyster to 44.41 in millet/OFSP. Wettability was highest (45.03) in millet/OFSP/carrot/periwinkle compared to wettability value (26.53) for millet/OFSP. Solubility ranged from 18.36 to 46.62, with the highest (46.62) in millet/OFSP/carrot/periwinkle. The peak viscosity of the infant complementary food samples ranged from 64.53 rapid visco analyzer units (RVU) to 89.33 RVU. The infant complementary food formulated from millet/OFSP had significantly higher (p &lt; 0.05) acceptability score (6.35).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7a6d122fc26f41bc8ec290fbfcd84fca8be922188d99cc3d3b5548d27362c6e5","category":"Interdisciplinary"}