{"title":"แอร์เอเชียดิจิทัลเข้าซื้อ Gojek ไทย ผนวกเข้ากับแอปใหม่ airasia super app จะเปิดตัวในไทยเร็วๆ นี้","link":"https://www.blognone.com/node/123605","date":1625648271000,"content":"<div><div><div><p>แอร์เอเชียดิจิทัล หน่วยธุรกิจด้านดิจิทัลภายใต้กลุ่มแอร์เอเชีย ประกาศเข้าซื้อ Gojek บริการเรียกรถในส่วนของประเทศไทย บริการต่างๆ ของ Gojek (GoRide, GoFood, GoSend) รวมถึงบริการการชำระเงินผ่าน GoPay สำหรับริการต่างๆ ของ Gojek จะยังคงให้บริการต่อจนถึงวันที่ 31 กรกฎาคม 2564 และแอร์เอเชียกำลังเตรียมการเปิดตัวแอปใหม่ในไทยคือ airasia super app เร็วๆ นี้</p>\n<p>ทาง Gojek แนะด้วยว่าให้ถอนเงินออกจากวอลเลต ภายในวันที่ 31 กรกฎาคมนี้ โดยจะมีการปิดระบบการเติมเงินเข้าอีวอลเลตตั้งแต่วันที่ 7 กรกฎาคม</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f3c28c7a67dcdb2b31a22fefd4e51b37.png\" /></p>\n<p>โทนี่ เฟอร์นันเดส ประธานเจ้าหน้าที่บริหารกลุ่มแอร์เอเชีย กล่าวว่า การประกาศในวันนี้คือ การเริ่มต้นความร่วมมือเชิงกลยุทธ์ระยะยาวอย่างยิ่งใหญ่กับ Gojek โดยเรามีระบบนิเวศธุรกิจดิจิทัลรวมถึงผลิตภัณฑ์และบริการด้านไลฟ์สไตล์ที่ไม่ใช่ของสายการบินกว่า 15 รายการบนแพลตฟอร์มในมาเลเซีย ความร่วมมือครั้งนี้จะทำให้กลุ่มแอร์เอเชียก้าวขึ้นไปอีกขั้น</p>\n<p>ไอรีน โอมาร์ ประธานแอร์เอเชียดิจิทัล กลุ่มแอร์เอเชีย ให้ภาพรวมของกลุ่มดิจิทัลของแอร์เอเชียว่าประกอบด้วยบริษัทดิจิทัลหลัก 3 แห่ง ได้แก่ “airasia super app” แพลตฟอร์มไลฟ์สไตล์สำหรับการท่องเที่ยว อีคอมเมิร์ซ บริการทางการเงิน บริการสั่งซื้อผลิตภัณฑ์พืชผลทางการเกษตรที่ขนส่งตรงจากฟาร์มผลิตภัณฑ์และบริการด้านสุขภาพและการศึกษา, “Teleport” บริษัทร่วมทุนด้านการขนส่งและลอจิสติกส์และธุรกิจฟินเทค “BigPay” ที่กำลังก้าวขึ้นเป็นรายแรกของภูมิภาคในฐานะผู้ให้บริการด้านธุรกรรมธนาคารแบบเสมือน (Virtual Bank) โดยอนาคตเป็นสิ่งที่น่าตื่นเต้น เดินหน้าสร้างสรรค์นวัตกรรมใหม่ๆ มากมาย เพื่อเปิดรับยุคดิจิทัล</p>\n<p>ที่มา - <a href=\"https://www.gojek.com/th/merchant/?umid=ae2c10c0-afac-4237-8857-ad5e007ccede\">Gojek</a>, <a href=\"https://brandinside.asia/air-asia-acquire-gojek-thailand/\">Brandinside</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/airasia\">AirAsia</a></div><div><a href=\"/topics/gojek\">Gojek</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7a6f6d8d80ff8b7ec1b3c9d932c1ceb5a970861d8e5df4b2716c166c8024cd98","category":"Thai"}