{"title":"Bentley has a new plug-in hybrid Flying Spur sedan on the way","link":"https://arstechnica.com/?p=1778344","date":1625587242000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Flying-Spur-Hybrid_Courtesy-of-Bentley-Motors5-980x653.jpg\" /></div>\n        <p>\n          Bentley is adding a second plug-in hybrid to its lineup this year in the form of a new Flying Spur Hybrid.                      [credit:\n                        Bentley                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>British luxury brand Bentley has a second plug-in hybrid in the works to join the <a href=\"https://arstechnica.com/cars/2018/03/a-hybrid-bentley-and-million-dollar-track-cars-wow-at-the-geneva-motor-show/\">Bentayga plug-in hybrid SUV</a>. It's an electrified version of the Flying Spur sedan, and it represents the next step in Bentley's decade-long journey to becoming a completely electric car maker.</p>\n<p>Instead of the usual V8 or W12 engine under the hood, this Bentley makes do with just six cylinders and 2.9 L of displacement. If that sounds a bit familiar, it's because it's a version of the same powertrain you'll find in the <a href=\"https://arstechnica.com/cars/2018/05/porsches-panamera-4-e-hybrid-sport-turismo-is-a-heck-of-a-hybrid/\">hybrid Porsche Panamera</a>. Like Porsche (and Audi), Bentley is owned by Volkswagen Group.</p>\n<p>The output of the V6 has been increased somewhat for use in the Bentley and now provides 410 hp (305 kW) and 406 lb-ft (550 Nm). It works in combination with a 134 hp (100 kW) permanent magnet synchronous motor that's located together with the transmission and is powered by a 14.1 kWh battery pack.</p></div><p><a href=\"https://arstechnica.com/?p=1778344#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778344&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7a7061c592d12707d52b08c6c8554fdec7cc1d883c326f7a982a2c31ffbdae5d","category":"Tech"}