{"title":"Here’s how Honda and GM are building production hydrogen fuel cells","link":"https://arstechnica.com/?p=1998927","date":1706192459000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Ink-Roll-800x450.jpg\" alt=\"a roll of film is coated with fuel cell \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Ink-Roll.jpg\">Enlarge</a> <span>/</span> Anode and cathode \"inks\" are applied to carbon-fiber paper. (credit: GM/Honda)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>BROWNSTOWN, Mich.—Today, a joint venture between General Motors and Honda Motor Company, named Fuel Cell System Manufacturing LLC (FCSM LLC), officially started producing its one and only product—a fuel cell system—on a commercial scale. FCSM officially began in January of 2017 with an initial investment between GM and Honda of $85,000,000. Now, the 70,000-square-foot (6,500 m2) facility in Brownstown, Michigan, houses 80 employees and enough robots, clean rooms, and all sorts of high-tech equipment to make Ironman blush.</p>\n<p>FCSM managing to build fuel cells quickly, reliably, and cost effectively is what's new here, not the fuel cells themselves. And, according to Tetsuo Suzuki, vice president of FCSM LLC, that proved the biggest challenge. \"Our fuel cell system consists of more than 300 individual cells [307 in total], each cell is composed of very expensive materials. If there is a defect in even one cell, the entire stack would be unusable,\" Suzuki said. \"Therefore, we designed all of our mass production processes with a zero-defect mindset.\" Adding, \"We introduced quality control into every process.\"</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/broader-shot-of-assembly.jpg\"><img alt=\"This is the assembly line.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/broader-shot-of-assembly-980x551.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/broader-shot-of-assembly.jpg\">This is the assembly line.</a> (credit: GM/Honda)</p></div>\n<h2>How to build a fuel cell</h2>\n<p>More specifically, each cell consists of several parts, starting with two different liquids that FCSM calls \"inks.\" One ink forms an anode, the other, a cathode. FCSM then pours each liquid onto a carbon-fiber paper, which it then heats to dry. It then precisely cuts these two different papers into shape and bonds them together to form what it calls a unitized electrode assembly, or UEA; the cathode on one side, the anode on the other. Both of the anode and cathode sheets are black, but the cathode sheet is gloss, and the anode sheet is matte.</p></div><p><a href=\"https://arstechnica.com/?p=1998927#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998927&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7a7add235f559912067690ae850dd92a8f4fda64672791612a1c766ee721f317","category":"Tech"}