{"title":"Machine learning-based identification of the risk factors for postoperative nausea and vomiting in adults","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308755","date":1723730400000,"content":"<p>by Hiroshi Hoshijima, Tomo Miyazaki, Yuto Mitsui, Shinichiro Omachi, Masanori Yamauchi, Kentaro Mizuta</p>\r\n\r\nPostoperative nausea and vomiting (PONV) is a common adverse effect of anesthesia. Identifying risk factors for PONV is crucial because it is associated with a longer stay in the post-anesthesia care unit, readmissions, and perioperative costs. This retrospective study used artificial intelligence to analyze data of 37,548 adult patients (aged ≥20 years) who underwent surgery under general anesthesia at Tohoku University Hospital from January 1, 2010 to December 31, 2019. To evaluate PONV, patients who experienced nausea and/or vomiting or used antiemetics within 24 hours after surgery were extracted from postoperative medical and nursing records. We create a model that predicts probability of PONV using the gradient tree boosting model, which is a widely used machine learning algorithm in many applications due to its efficiency and accuracy. The model implementation used the LightGBM framework. Data were available for 33,676 patients. Total blood loss was identified as the strongest contributor to PONV, followed by sex, total infusion volume, and patient’s age. Other identified risk factors were duration of surgery (60–400 min), no blood transfusion, use of desflurane for maintenance of anesthesia, laparoscopic surgery, lateral positioning during surgery, propofol not used for maintenance of anesthesia, and epidural anesthesia at the lumbar level. The duration of anesthesia and the use of either sevoflurane or fentanyl were not identified as risk factors for PONV. We used artificial intelligence to evaluate the extent to which risk factors for PONV contribute to the development of PONV. Intraoperative total blood loss was identified as the potential risk factor most strongly associated with PONV, although it may correlate with duration of surgery, and insufficient circulating blood volume. The use of sevoflurane and fentanyl and the anesthesia time were not identified as risk factors for PONV in this study.","author":"Hiroshi Hoshijima","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7a7e856a7a00a0cd1b4ce350e5dc8852fb61d739eaad4761767f05c6bb1d480a","category":"Interdisciplinary"}