{"title":"Inclusive Maritime Spatial Planning: Stakes at the Regional Level","link":"https://www.preprints.org/manuscript/202410.0221/v1","date":1727948012000,"content":"The paper focuses on the Maritime Spatial Planning (MSP) and the importance of incorporating participatory democracy and inclusivity, from a region-wise perspective. Traditionally MSP is a top-down central government process. Most responsibilities, competencies and jurisdiction lie at the national level, with limited input from local or regional stakeholders. However, the growing complexity of marine activities and the need for sustainable management of marine environment re-quires more inclusive and collaborative approaches. Drawing on the REGINA-MSP project, the paper explores how regional stakeholders can be more effectively engaged in MSP processes. The project, co-funded by the EU/EMFF, aims to consolidate MSP in the member states, through the strengthening of the role of regions and regional stakeholders. It does so, by applying a 3-step methodology, using tools like stakeholder database and ranking, interest-influence matrices and questionnaires. The paper emphasizes that achieving inclusivity in MSP at the regional level is highly associated with involving all relevant stakeholders. The paper identifies seven categories of regional stakeholders. Among them fishers are the ones having the lowest level of engagement and degree of representativeness in the MSP process, despite being among the most traditional marine users, and by association the more experienced holders of citizen science. Regarding regions and regional authorities (NUTS 2), they may also be considered as “outsiders” in the -nationally driven- MSP process, although this can be reversed, using regional and cross-regional Communities of Practice. In conclusion, the paper highlights the value of participatory democracy in MSP, and the importance to go regional and explore a more bottom-up approach that works in favor of advanced participatory democracy and inclusiveness in terms of stakeholders. The REGINA-MSP project provides valuable insights into how this can be achieved through a structured stakeholder engagement and the development of Communities of Practice.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7a8cac6d1ae082b01222198968e0a9180675a1bfef38e4b91c8e665beb31aa9c","category":"Interdisciplinary"}