{"title":"PSXI-25 Re-characterizing beef cattle water intake","link":"https://academic.oup.com/jas/article/102/Supplement_3/770/7757864?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>In the face of a changing climate and growing population, sustainable use of freshwater resources is paramount. Animal agriculture is often viewed as an antagonistic force working against freshwater resource preservation. However, assumptions of water use in beef cattle have cause to be reevaluated. The current published standards for beef cattle water intake were developed from data collected in 1956. Rapid genetic advancement in performance and increasing pressure on animal agriculture to reduce water usage demand that the water intake profiles of cattle be recharacterized. Recently, advancements in water monitoring technologies have granted researchers access to highly informative water intake data. In 2019, we installed RFID-enabled front-end weighing positions equipped with custom metered waterers at our West Virginia University (WVU) Reymann Memorial Research, Outreach, and Education Center (REOC) in Wardensville, WV. In 2022, we installed the same system at the WVU Animal Sciences REOC in Morgantown, WV. These systems allowed us to collect daily body weight (BW) and water intake data on individual animals. From 2019-07-08 to 2024-02-16, 2,020 animals have been evaluated for individual daily BW, feed intake, and water intake at our research locations. Data were collected on animals consigned to the Wardensville Young Sire Performance test by regional beef cattle producers or sourced for research. In total, 1,055 d of data were collected, with data collected during every month, resulting in 149,292 unique daily water intake measurements. Eleven breeds (Angus, Limousin, Angus cross bred, Charolais, SimAngus, Hereford, Simmental, Charolais cross bred, Black Hereford, Akaushi, and Red Angus) were evaluated. The maximum, minimum, and mean age for all animals was 753, 162, and 343 d, respectively. In total, water intake data from 1,255 bulls, 434 steers, and 331 heifers were collected (Table). Our large, highly granular database of individual animal daily water intake has allowed us to generate profiles of water intake for large segments of beef cattle. These findings will aid in the re-standardization of expected water intakes and the improvement of beef cattle sustainability.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7a913e0cc34032dd8fa650f71bbab882e553536b900d05618f7451977f20c7bb","category":"Environment"}