{"title":"How to Improve Surveillance Program for Shiga Toxin-Producing E. coli (STEC): Gap Analysis and Pilot Study","link":"https://www.preprints.org/manuscript/202404.0321/v1","date":1712154813000,"content":"Several pathotypes of enteric E. coli have been identified. The group represented by Shiga toxin-producing E. coli (STEC) is of particular interest. Raw milk and raw milk products are significant sources of STEC infection in humans; therefore, identifying pathogens at the herd level is crucial for public health. Most national surveillance programs focus solely on raw milk and raw milk cheeses that are ready for retail sale, neglecting the possibility of evaluating the source of contamination directly at the beginning of the dairy chain. In order to assess the viability of new molecular methodologies applied to raw milk filters enabling the identification of the presence of STEC serotypes in milk production and apply the same methods to identify the presence of these pathogens in calf feces we analyzed, through a commercial real-time PCR assay, a total of 290 samples coming from 18 different dairy herds; 88 bulk tank milk (BTM), 104 raw milk filters (RMF) and 98 calves’ feces samples. In total 3.4% of BTM, 41.4% of RMF and 73.4% of calves’ feces tested positive for stx presence, supporting our hypothesis that BTM is not a suitable matrix to assess the STEC presence at herd level, underestimating it. Our conclusion is that the surveillance program needs critical and extensive improvements such as RMF and calves’ feces analysis implementation in order to be more efficient in detecting and preventing STEC infections. The epidemiology of these infections and the characteristics of the pathogen clearly show how a One Health approach will be pivotal to improve our capabilities to control the spread of these infections.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7a92ac608da1b984bd701b098136671ef16f8d8f7af166fc77a4cae58eded895","category":"Interdisciplinary"}