{"title":"Protective Effects of Syringic Acid Against Oxidative Damage, Apoptosis, Autophagy, Inflammation, Testicular Histopathologic Disorders, and Impaired Sperm Quality in the Testicular Tissue of Rats Induced by Mercuric Chloride","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24395?af=R","date":1722671598000,"content":"<h2>ABSTRACT</h2>\n<p>Mercury (Hg) is one of the most toxic heavy metals that damage testicular tissue. Mercury chloride (HgCl<sub>2</sub>) is one of the most toxic forms of mercury that can easily cross biological membranes. Syringic acid (SA) is a natural flavonoid found in many vegetables and fruits. In this study, the effects of SA against HgCl<sub>2</sub>-induced testicular damage in rats were determined by biochemical, histopathological, and spermatological analyses. For this study, a total of 35 Spraque Dawley rats were used. Rats were divided into five groups as control, HgCl<sub>2</sub>, SA 50, HgCl<sub>2</sub> + SA 25, and HgCl<sub>2</sub> + SA 50. HgCl<sub>2</sub> was administered intraperitoneal (IP) at a dose of 1.23 mg/kg/bw, while SA was administered by oral gavage at doses of 25 and 50 mg/kg/bw. The rats were then sacrificed, and testicular tissues were removed. HgCl<sub>2</sub> caused an increase in MDA level and a decrease in SOD, CAT, and GPx activity and GSH level in the testicular tissue of rats. HgCl<sub>2</sub> is involved in the increase of eIF2-α, PERK, ATF-4, ATF-6, CHOP, NF-κB, TNF-α, IL-1β, Apaf-1, Bax, and Caspase-3 mRNA expression. HgCl<sub>2</sub> caused a decrease in sperm motility, an increase in the rate of abnormal sperm and sperm DNA fragmentation in rats. However, SA oral administration dose-dependently inhibited endoplasmic reticulum stress, oxidative stress, inflammation, and apoptosis and preserved epididymal sperm quality and testicular histoarchitectures. In conclusion, SA had protective effects against HgCl<sub>2</sub>-induced testicular oxidative damage, inflammation, endoplasmic reticulum stress, and apoptosis.</p>","author":"Serkan Ali Akarsu, \nCihan Gür, \nSefa Küçükler, \nNurhan Akaras, \nMustafa İleritürk, \nFatih Mehmet Kandemir","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7a935a1a16d239a6e1e86ad8cf068fb24813d78c9276960a0adcbdebc5463ac6","category":"Environment"}