{"title":"Characterization of Na0.5Bi0.5TiO3 Single Crystals by X-ray Diffraction, Scanning Electron Microscopy, X-ray Photoelectron Spectroscopy, Optical Absorption, Electric and Thermoelectric Properties Studies","link":"https://www.preprints.org/manuscript/202405.2009/v1","date":1717058559000,"content":"High-quality and large-size single crystals of lead-free Na0.5Bi0.5TiO3 were grown using the Czo-chralski technique. The crystals had pure perovskite structure with rhombohedral symmetry and were translucent in the visible and near infrared spectral ranges recorded in the interval 350-1050 nm. The energy gaps determined from the X-ray photoelectron spectroscopy (XPS) and optical measurements were approximately 2.92 eV. The current-voltage characteristics, depolarization current, dc (σdc) and ac (σac) electrical conductivity, and Seebeck coefficient of the crystals were investigated. The frequency/temperature-dependent electrical properties were also measured and analyzed through complex impedance spectroscopy. An overlapping reversible insulator-metal transition (resistive switching) on nanoscales, caused by the electric field, was detected. This was the first time that most of these investigations were performed for this material. The following conductivity mechanisms of NBT single crystals were identified: (i) quasi-free electron and hole conduction and hopping-charges mechanism at low temperatures, (ii) small polaron conductivity in the middle temperature range, and (iii) a significant contribution of the oxygen vacancies to conductivity in the high temperature range. The activation energy values determined from the conductivity data, the imaginary part of the electric impedance and the modulus indicate that the relaxation process in the high-temperature range is attributable to both single and double ionized oxygen vacancies, in combination with the hopping of electrons between Ti4+ and Ti3+. P-type electrical conductivity was also found. These discoveries create new possibilities of reducing the electrical conductivity of NBT and improving the process of effectively poling this material. The density of the electronic states was investigated using an ab initio method. The energy gap cal-culated for NBT (R3c) was 2.8 eV, and is well comparable to those determined from XPS and optical measurements. Our results indicate the possibility of tuning material properties by inten-tionally creating non-stoichiometry/structural defects (oxygen vacancies, cation excess and cation deficiency).","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7a969cf8fef0caa5eb204039b992341ca9c833fa623cb9862cd0f99ce1fc8a3f","category":"Interdisciplinary"}