{"title":"Plant species composition and key‐species abundance drive ecosystem multifunctionality","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14717?af=R","date":1719833648000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/53ed05cd-2a1a-4438-9cc3-e635cc3484e9/jpe14717-toc-0001-m.png\" alt=\"Plant species composition and key-species abundance drive ecosystem multifunctionality\" />\n<p>We propose that plant community composition and the relative abundance and biomass ratio of key species drive ecosystem multifunctionality. We suggest that selecting the appropriate plant combination under different soil conditions should be emphasized in ecological restoration projects. Our study highlights the differentiated roles of key species on ecosystem functions under different resource conditions. The N fixation in general plays a crucial role in driving ecosystem multifunctionality and the N-fixing plants can serve as restoration tools in nutrient-poor degraded lands.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nGlobal biodiversity loss has generated great interest in the role of plant communities in driving ecosystem functions. There is limited understanding of how soil properties, plant richness and plant community composition interact to affect ecosystem multifunctionality.\n\nWe conducted a constructed ecosystem experiment by simultaneously manipulating soil origin (i.e. fertile farmland soil and relatively infertile bare land soil), plant richness and community composition (one-species monoculture, and all possible two-, three- and four-species combinations of five plants) to evaluate their influence on ecosystem multifunctionality related to the accumulation of biomass, carbon (C) and nitrogen (N) in plants, greenhouse gas emissions, soil nutrients, soil N fixation and mineralization of N and phosphorus (P).\n\nWe found that ecosystem multifunctionality was significantly affected by soil origin, plant community composition and the community-weighted mean (CWM) of plant biomass, but not by plant richness.\n\nWe grouped the community composition into the N-fixing group (including N-fixing plants) and the non-N-fixing group (excluding N-fixing plants). The N-fixing plant group exhibited significantly higher multifunctionality than the non-N-fixing species group in both soil origins. For bare land soil, multifunctionality increased with the increasing relative abundance and biomass ratio of <i>Albizia julibrissin</i> (N-fixing species) in communities, but decreased with the biomass ratio of <i>Platycladus orientalis</i> (non-N-fixing species). For farmland soil, multifunctionality increased with the abundance of <i>Toona sinensis</i> (non-N-fixing species) and the biomass ratio of <i>Albizia julibrissin</i>, but decreased with the abundance and biomass ratio of <i>Morus alba</i> (non-N-fixing species). These results indicate that the key species determining ecosystem multifunctionality vary under different soil conditions.\n\n<i>Synthesis and applications</i>: We propose that plant community composition and the relative abundance and biomass ratio of key species drive ecosystem multifunctionality. We suggest that selecting the appropriate plant combination under different soil conditions should be emphasized in ecological restoration projects. Our study highlights the differentiated roles of key species on ecosystem functions under different resource conditions. The N fixation in general plays a crucial role in driving ecosystem multifunctionality and the N-fixing plants can serve as restoration tools in nutrient-poor degraded lands.\n</p>","author":"Xinshuai Li, \nYouchao Chen, \nFeng Liu, \nXiaoli Cheng, \nQuanfa Zhang, \nKerong Zhang","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"7a9c5a1081a4e8eb925a99bdd8514a4e26fa69c9163cd85f81c5095d6b53775f","category":"Environment"}