{"title":"Validation of the Chemical and Biological Steps Required Implementing an Advanced Multi-Omics Approach for Assessing the Fate and Impact of Contaminants in Lagoon Sediments","link":"https://www.preprints.org/manuscript/202406.1474/v1","date":1718946687000,"content":"The increasing use of chemicals requires a better understanding of their presence and their dynamics in the environment as well as their impact on ecosystems; it is therefore important to set up procedures. The aim of this study was to validate the first steps of an innovative multi-omics approach based on metabolomics and 16S metabarcoding data for future analyses of the contaminants fate and impact in Mediterranean lagoons. First, semi targeted analytical procedures for water and sediment matrices were set up to evaluate the lagoon contamination status. Forty-six compounds were detected, 28 could be quantified in both water (between 0.09 and 47.4 ng/L) and sediment (between 0.008 and 26.3 ng/g) samples using UHPLC-MS/MS instrument. Regarding the non-targeted metabolomics study (UHPLC-HRMS), four sample preparation protocols, based on solid/liquid extractions and an automated pressurized fluid extraction system (EDGE® extractions), were compared in terms of metabolome coverage, efficiency and reproducibility of the extraction methodology. A solid/liquid extraction using acetonitrile/methanol (50/50) solvent was the best protocol. On the other hand, in order to characterize the microbial diversity of the lagoon sediment using metabarcoding, five commercial kits for DNA extraction were evaluated. This study revealed that the DNeasy PowerSoil Pro Qiagen Kit (Promega, USA) was the best compromise for studies assessing microbial diversity in fresh sediment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ab1088fdf7004512182ae67808e34e81090feeb0d8fc37e2047c74ebfafa3df","category":"Interdisciplinary"}