{"title":"Mechanistic Insights on Microbiota-Mediated Development and Progression of Esophageal Cancer","link":"https://www.preprints.org/manuscript/202408.1754/v1","date":1724418217000,"content":"Esophageal cancer (EC) is one of the most common malignant tumors worldwide, and its two major types, esophageal adenocarcinoma (EAC) and esophageal squamous cell carcinoma (ESCC) present a severe global public health problem with an increasing incidence and mortality. Established risk factors include smoking, alcohol consumption, and dietary habits, but recent research highlights the substantial role of oral microbiota in EC pathogenesis. This review explores the intricate relationship between microbiome and esophageal carcinogenesis, focusing on eight significant mechanisms: chronic inflammation, microbial dysbiosis, production of carcinogenic metabolites, direct interaction with epithelial cells, epigenetic modifications, interaction with gastroesophageal reflux disease (GERD), metabolic changes, and angiogenesis. Certain harmful bacteria, such as Porphyromonas gingivalis and Fusobacterium nucleatum, are specifically implicated in sustaining irritation and tumor progression through pathways including NF-κB and NLRP3 inflammasome. Additionally, the review explores how microbial byproducts, including short-chain fatty acids (SCFAs) and reactive oxygen species (ROS), contribute to DNA harm and disease advancement. Furthermore, the impact of reflux on microbiota composition and its role in esophageal carcinogenesis is evaluated. By combining epidemiological data with mechanistic understanding, this review underscores the potential to target microbiota-immune system interplay for novel therapeutic and diagnostic strategies to prevent and treat esophageal cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ab114a38c9884d9aa9c32ead97fd423a5cd1ba5d91aba0389b483a391dd17bd","category":"Interdisciplinary"}