{"title":"Adsorption Characteristics of Illite and Kerogen Oil Phase: Thermodynamics Experiments","link":"https://www.preprints.org/manuscript/202404.0799/v1","date":1712826606000,"content":"In order to study the adsorption process and adsorption characteristics of shale oil at the macro scale, the isothermal adsorption experiments of illite and kerogen on heptadecane (oil phase) solution were carried out by infrared spectrophotometry and gas chromatography-mass spectrometry. The reaction mechanism of alkane solution concentration and temperature in the adsorption process was investigated. The adsorption characteristics of heptadecane on the surface and pores of illite and kerogen were elucidated by adsorption isotherm model and adsorption thermodynamic model. The results show that:  The concentration of alkane solution contributes to the adsorption of illite and kerogen. As the concentration of the solution continues to increase, the adsorption rate gradually slows down. However, the temperature hardly affects the adsorption rate. At 25℃, 50℃ and 60℃, the adsorption process of illite on alkane solution is more consistent with Langmuir model and Freundlich model, respectively. The difference is that Langmuir model is suitable for describing the whole adsorption process of kerogen on alkane solution. 3) The adsorption process of illite and kerogen to heptadecane solution is an endothermic reaction. Heating helps to accelerate the migration rate of alkanes, which is conducive to the adsorption reaction. The research results clarify the adsorption characteristics of shale oil heavy components from the macro level, and fill the research gap in the application of solid-liquid isothermal adsorption physical experiments to the adsorption and occurrence of shale oil.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ab2e10cb0feef6da4b1b90726f2c9e33ce57129dc70535d5b33e1d23b0a22f1","category":"Interdisciplinary"}