{"title":"Cost-effectiveness of applying high-sensitivity troponin I to a score for cardiovascular risk prediction in asymptomatic population","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307468","date":1721397600000,"content":"<p>by Paul Jülicher, Nataliya Makarova, Francisco Ojeda, Isabella Giusepi, Annette Peters, Barbara Thorand, Giancarlo Cesana, Torben Jørgensen, Allan Linneberg, Veikko Salomaa, Licia Iacoviello, Simona Costanzo, Stefan Söderberg, Frank Kee, Simona Giampaoli, Luigi Palmieri, Chiara Donfrancesco, Tanja Zeller, Kari Kuulasmaa, Tarja Tuovinen, Felicity Lamrock, Annette Conrads-Frank, Paolo Brambilla, Stefan Blankenberg, Uwe Siebert</p>\r\nIntroduction <p>Risk stratification scores such as the European Systematic COronary Risk Evaluation (SCORE) are used to guide individuals on cardiovascular disease (CVD) prevention. Adding high-sensitivity troponin I (hsTnI) to such risk scores has the potential to improve accuracy of CVD prediction. We investigated how applying hsTnI in addition to SCORE may impact management, outcome, and cost-effectiveness.</p> Methods <p>Characteristics of 72,190 apparently healthy individuals from the Biomarker for Cardiovascular Risk Assessment in Europe (BiomarCaRE) project were included into a discrete-event simulation comparing two strategies for assessing CVD risk. The standard strategy reflecting current practice employed SCORE (SCORE); the alternative strategy involved adding hsTnI information for further stratifying SCORE risk categories (S-SCORE). Individuals were followed over ten years from baseline examination to CVD event, death or end of follow-up. The model tracked the occurrence of events and calculated direct costs of screening, prevention, and treatment from a European health system perspective. Cost-effectiveness was expressed as incremental cost-effectiveness ratio (ICER) in € per quality-adjusted life year (QALYs) gained during 10 years of follow-up. Outputs were validated against observed rates, and results were tested in deterministic and probabilistic sensitivity analyses.</p> Results <p>S-SCORE yielded a change in management for 10.0% of individuals, and a reduction in CVD events (4.85% vs. 5.38%, p&lt;0.001) and mortality (6.80% vs. 7.04%, p&lt;0.001). S-SCORE led to 23 (95%CI: 20–26) additional event-free years and 7 (95%CI: 5–9) additional QALYs per 1,000 subjects screened, and resulted in a relative risk reduction for CVD of 9.9% (95%CI: 7.3–13.5%) with a number needed to screen to prevent one event of 183 (95%CI: 172 to 203). S-SCORE increased costs per subject by 187€ (95%CI: 177 € to 196 €), leading to an ICER of 27,440€/QALY gained. Sensitivity analysis was performed with eligibility for treatment being the most sensitive.</p> Conclusion <p>Adding a person’s hsTnI value to SCORE can impact clinical decision making and eventually improves QALYs and is cost-effective compared to CVD prevention strategies using SCORE alone. Stratifying SCORE risk classes for hsTnI would likely offer cost-effective alternatives, particularly when targeting higher risk groups.</p>","author":"Paul Jülicher","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7ac0b8a45f6ea6b136be8e183adfe388e3035f7e351319a236f2b90dcb21f7c2","category":"Interdisciplinary"}