{"title":"NYC ePrix: It’s time for Formula E’s annual visit to America","link":"https://arstechnica.com/?p=1779192","date":1625865305000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/4-1017609203-LAT-20190714-MAL02065-980x653.jpg\" /></div>\n        <p>\n          The ABB New York City ePrix is a chance for Formula E to race in front of one of the most dramatic backdrops in racing: the Manhattan skyline.                       [credit:\n                        Glenn Dunbar / LAT Images                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Formula E, the electric car racing series, is back in Brooklyn this coming weekend. It's the series' first time back in North America <a href=\"https://arstechnica.com/cars/2019/07/formula-e-five-years-on-cars-technica-grades-the-electric-racing-series/\">since 2019</a>, having skipped last year for obvious reasons. COVID-19 caused <a href=\"https://arstechnica.com/cars/2020/08/formula-es-six-race-berlin-season-finale-in-pictures/\">most of season six to take place on the concrete of Templehof in Berlin</a>, but season seven saw some return to normality when it began back in February, now with the FIA (which is in charge of global motorsport) blessing it as an official world championship. Ahead of the New York ePrix double-header, Ars checked in with some of the teams and drivers to see how one of our favorite racing series has continued to evolve.</p>\n<p>Although Saturday's race will be the 10th round of season seven, the pandemic has continued to make its presence felt this year. Covid cancelled planned races in Santiago, Chile, and Marrakech, Morocco, and kept spectators from attending rounds in Rome and Valencia, Spain. Their absence was noted, even if it has freed up the drivers' time between on-track sessions.</p>\n<p>\"We're there to entertain people, and not having people there to enjoy what we do has been quite disappointing,\" said Jaguar Racing's Sam Bird. \"It's nice to see fans getting excited, asking for autographs, people having smiles on their faces when they see their favorite drivers or their favorite cars, so yeah it's been tough to not have fans there, and I can't wait to have them back.\"</p></div><p><a href=\"https://arstechnica.com/?p=1779192#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779192&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7ac192ca3abee875907168ac5ae9f0557c481bfe10e656ce83055bad235e0c77","category":"Tech"}