{"title":"Spatial Resolution Impacts on Land Cover Mapping Accuracy","link":"http://link.springer.com/10.1007/s12524-024-01954-7","date":1730419200000,"content":"<h3>Abstract</h3>\n                    <p>Satellite images of different spatial resolutions and separate object classification approaches have been employed for Land Cover (LC) mapping in local and regional projects. Nevertheless, the mapping skills and the attainable accuracy of the LC classification in the current landscape are influenced by the spatial resolution of the datasets utilized and the classification techniques used. In this paper, the effect of the spatial resolution of satellite images (Landsat 8 OLI with 30 m and Sentinel-2 A MSI with 10 m data) on LC mapping accuracy was evaluated by using four non-parametric classification techniques; Random Forest (RF), Neural Network (NN), Support Vector Machine (SVM), and K-Nearest Neighbor (K-NN). The findings showed that SVM could be used efficiently with Landsat 8 (30 m) to classify LC at local and national scale research as it achieved the greatest accuracy utilizing SVM with Overall Accuracy (OA) = 84.44% and K coefficient value (K) = 0.78 followed by RF, K-NN, and NN. SVM has not outperformed other classification methods. Similarly, classification with Sentinel 2-A achieved the greatest accuracy by SVM and RF classifiers, with an average performance for mapping OA = 96.32% with K = 0.956, followed by K-NN and NN, while RF and SVM can be appropriate for classifying LC based on Sentinel-2 A (10 m) images. In addition, SVM and RF have been slightly more efficient than other classification approaches, and Sentinel-2 A-based LC mapping observations were more precise and dependable compared to Landsat 8. Our findings further confirm that both datasets are similar in 88.91% of the outcomes based on the comparison between Sentinel-2 A and Landsat 8 LC maps. Lastly, the spatial resolution of the data has a big effect on how the LC is mapped.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"7ac48ad2908c82cb1b529aebdd88ecb94dc9a812d2c7541d562b0cc93321aa93","category":"Environment"}