{"title":"The iPad Pro is set for its first revamp in over five years","link":"https://www.macworld.com/article/2044018/ipad-pro-magic-keyboard-redesign-m3-chip-oled-display-size.html","date":1693227468000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When Apple <a href=\"https://www.macworld.com/article/232117/2018-ipad-pro-review.html\">launched the new iPad Pro in 2018</a>, it introduced a new design that would influence the rest of Apple’s lineup, including the iPad Air and mini, the iPhone 12, and even the M1 MacBook Pro. Now, five years later, a new report claims Apple is planning a major revamp for the iPad Pro next year.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-08-27/ipad-pro-2024-magic-keyboard-redesigned-tablet-m3-september-12-event-details-lltgk6fv&amp;xcust=1-1-2044018-1-0-0&amp;sref=https://www.macworld.com/feed\">Mark Gurman’s latest Power On newsletter</a>, the iPad Pro is in line for “its first major overhaul in half a decade” following a series of minor updates for the past several generations. The iPad Pro has had three updates since 2018, but Apple focused on internal changes—the chip, camera module, connectivity, and display tech.</p>\n\n\n\n<p>Along with the new design, the updated model is expected to bring several changes, including a slightly larger 13-inch model, OLED displays that are “crisper and brighter, and reproduce colors more accurately,”, and an M3 processor. Other rumored features in development are a new <a href=\"https://www.macworld.com/article/1362947/16-inch-ipad-pro-rumor-size-design-processor.html\">larger model with a 16-inch display</a> and <a href=\"https://www.macworld.com/article/348015/apple-ipad-ipad-mini-ipad-pro-bezels-home-button-wireless-charging-airpower.html\">wireless charging</a>.</p>\n\n\n\n<p>Gurman also claims Apple will introduce a “revamped” Magic Keyboard that “addresses a complaint about the current Magic Keyboard.” Among the changes are a new design with a larger trackpad. to make it “look even more like a laptop.” The current Magic Keyboard, which was introduced in 2020, has a “floating cantilever design” that attaches magnetically and allows for precise viewing adjustments. It also has backlit keys and a built-in USB-C charging port but doesn’t support MagSafe charging.</p>\n\n\n\n<p>Gurman says the updates are still a ways off, with a launch planned for spring or early summer 2024. He says there may be minor updates before then, with the <a href=\"https://www.macworld.com/article/678361/ipad-mini-7-specs-design-processor-release.html\">iPad mini</a> and <a href=\"https://www.macworld.com/article/1998359/next-gen-ipad-air-in-works-launch-schedule-mystery.html\">iPad Air</a> rumored to get new chips.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7ac9a921a2d9374c3811828903d3cb397d34e38a1e390a1110a958fc271ab2a3","category":"Apple"}