{"title":"Google I/O: $1,800 Google Pixel Fold, AI Updates and More","link":"https://www.macrumors.com/2023/05/10/google-io-pixel-fold-ai-announcements/","date":1683746905000,"content":"Google today hosted its <a href=\"https://blog.google/inside-google/google-io-meaning/\">15th annual I/O developer conference</a> in Mountain View, California, highlighting advances in artificial intelligence, changes to Google <a href=\"https://www.macrumors.com/guide/photos/\">Photos</a>, updates to search, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/google-io.jpg\" alt width=\"1184\" height=\"666\" />\r<br />\n<h2>Pixel Fold</h2>\r<br />\nThe Pixel Fold is Google's first foldable smartphone, and it's set to launch in late June. In terms of design, it is similar to the Galaxy Z Fold, as it opens from a smartphone form factor into a tablet form factor.\r<br />\n\r<br />\n<div></div>\r<br />\nThe Pixel Fold features a 7.6-inch display when unfolded, with a resolution of 2208 x 1840 and a 120Hz refresh rate. When folded, the Pixel Fold has a 5.8-inch display with a 2092 x 1080 resolution. It is powered by the latest Google Tensor chip, and is equipped with a 4,821mAh battery.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/google-fold.jpg\" alt width=\"1368\" height=\"768\" />\r<br />\nThere are three cameras, including a 48-megapixel main camera, an ultrawide camera, and a telephoto camera with 5x optical zoom. Other features include a fingerprint scanner built into the power button, facial recognition, IPX8 water resistance, and a 180-degree hinge mechanism at the edges. Preorders for the Pixel Fold <a href=\"https://store.google.com/product/pixel_fold?pli=1&amp;hl=en-US\">are available today</a>, and it is priced at $1,800.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/pixel-fold-2.jpg\" alt width=\"1368\" height=\"768\" />\r<br />\n<h2>Pixel Tablet and Pixel 7a</h2>\r<br />\nAlongside the Pixel Fold, Google today also introduced a new <a href=\"https://blog.google/products/pixel/google-pixel-tablet/\">11-inch Pixel Tablet</a> and the more affordable <a href=\"https://blog.google/products/pixel/pixel-7a-io-2023/\">Pixel 7a smartphone</a>. The Pixel Tablet includes a Charging Speaker Dock that turns it into a smart home control hub, and it is priced at $499.\r<br />\n\r<br />\nThe Pixel 7a is a low-cost smartphone at $499, and it offers an alternative to the Pixel 7 and Pixel 7 Pro.\r<br />\n\r<br />\n<h2>Google Photos</h2>\r<br />\nA new \"Magic Editor\" in Google ‌Photos‌ adds AI editing features, with select Pixel phones to get early access later in 2023. Magic Editor can make complex edits automatically, tweaking specific parts of an image to remove unwanted objects, changing composition by repositioning the subject, and updating elements like the sky.\r<br />\n\r<br />\nMagic Editor can also create new content when repositioning an image to change the way cropping and resizing works, and it is functionality that is likely to expand beyond Pixel phones in the future.\r<br />\n\r<br />\n<h2>Google Maps</h2>\r<br />\nMaps is gaining an updated Immersive View feature that uses AI to fuse Street View and aerial images together to create a digital model of the world for route planning purposes. It will show bike lanes, sidewalks, intersections, and parking for an entire trip, along with information on weather changes throughout the day. The feature will roll out in the coming months in select cities like San Francisco, Tokyo, LA, London, and New York.\r<br />\n\r<br />\n<h2>AI</h2>\r<br />\nArtificial intelligence is a major focus at this year's I/O event with Google announcing several new initiatives.\r<br />\n<ul>\r<br />\n \t<li><strong>Gmail</strong> - \"Help Me Write,\" a generative AI feature, is being added to Gmail. It will be able to write emails for Gmail users when provided with a prompt such as requesting a refund from a company.</li>\r<br />\n \t<li><strong>Bard</strong> - Bard, Google's AI chatbot, is open for anyone to use rather than limited to a small number of people. It is now using \"<a href=\"https://blog.google/technology/ai/google-palm-2-ai-large-language-model/\">PaLM 2</a>,\" Google's next-generation language model that offers better multilingual, reasoning, and coding capabilities. In the near future, Bard will be able to provide rich visuals for queries and users will be able to add images to search prompts.</li>\r<br />\n \t<li><strong>Search Labs</strong> - Search Labs is an experimental initiative that lets users engage with new AI-based search experiences. Search Generative Experience, for example, will bring generative AI directly to the search interface. There are a limited number of test spots <a href=\"https://labs.withgoogle.com\">that users can sign up for</a>.</li>\r<br />\n \t<li><strong>Tailwind</strong> - Project Tailwind is described as an \"AI notebook\" that is designed for students. It takes the information that's input and provides study guides in the form of questions and themes, plus it can organize the material in a way that facilitates studying. Tailwind is part of Search Labs.</li>\r<br />\n \t<li><strong>MusicLM</strong> - MusicLM is designed to turn text descriptions that are input into music for quick songwriting. This is also part of Search Labs and available to a limited number of users.</li>\r<br />\n \t<li><strong>Google Workspace</strong> - Duet AI for Google Workspace allows users to collaborate with AI on writing, creating images from text, turning data into insights, generating backgrounds for video calls, and more. There is <a href=\"https://workspace.google.com/solutions/ai/\">a waitlist to use AI</a> in Workspace.</li>\r<br />\n \t<li><strong>Codey</strong> - Codey offers real-time code completion and generation, and it can be customized to a customer's codebase. It supports more than 20 coding languages, and can help with everything from creating code to debugging and documentation.</li>\r<br />\n \t<li><strong>Imagen</strong> - Imagen can create images for businesses using text input.</li>\r<br />\n</ul>\r<br />\n<h2>Image Context</h2>\r<br />\nTo combat \"deep fake\" images that are generated by AI, Google plans to provide more context for the images that are found through Google Search. Images will show context like when the image and similar images were initially indexed by Google, where an image first appeared, and where else it's been online.\r<br />\n\r<br />\nImage information can be found by clicking on the three dots on an image in Google Images results, swiping up on an image in the Google app, or searching with an image in Google Lens.\r<br />\n<div>Tag: <a href=\"https://www.macrumors.com/guide/google/\">Google</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/10/google-io-pixel-fold-ai-announcements/\">Google I/O: $1,800 Google Pixel Fold, AI Updates and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/google-i-o-1-800-google-pixel-fold-ai-updates-and-more.2389210/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7aca06dae3d6c3c963336e9a234b304c6d33fd05d43dbb05e7831691fcbc6b9b","category":"Apple"}