{"title":"PSIV-28 Determination of the extent and rate of nutrient degradation of potato and other byproducts by rumen microorganisms in vitro","link":"https://academic.oup.com/jas/article/102/Supplement_3/821/7757626?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Byproducts in livestock diets have the potential to reduce the environmental impact of food production and the cost of animal feeding. The objective was to evaluate the extent and rate of nutrient degradability of potato and other byproducts by rumen microorganisms in vitro. Byproducts included barley malt sprouts, fries, dry peel, and hopper, which were supplied by Performix Nutrition Solutions (Nampa, ID). Two in vitro incubators (DAISYII, ANKOM Technology) each with four incubation jars were used to evaluate ruminal degradability of dry matter (DM) and neutral detergent fiber (NDF). Each jar contained 1,600 mL buffer solution (ANKOM Technology), 400 mL rumen contents (collected from two ruminally cannulated cows), 14 filter bags (F57, ANKOM Technology) with 0.5 g of ground byproduct, 14 filter bags with 0.5 g of ground corn (standard), and 14 blank bags. Each jar was purged with CO<sub>2</sub> and filter bags were incubated at 39°C for 0, 3, 6, 9, 12, 24, and 48 h, then removed, rinsed, dried at 55˚C for 48 h, weighed, and analyzed for DM and NDF. Each byproduct was incubated in 3 jars on two different d (6 replicates). Degradation of DM was separated into fractions A (disappearance at 0 h), C (DM remaining after 48 h) and B (100%-A-C). Rate of degradation for fraction B was the slope of the natural logarithms of the DM disappearance. All byproducts were compared with standard corn grain as the control. Fraction A for DM was not different (<span>P</span> &gt; 0.40) for barley malt sprouts (35.4%) and hopper (33.7%), and less (<span>P</span> &lt; 0.05) for dry peel (27.8%) and fries (13.2%) when compared with corn grain (33.4%). Fraction B for DM was greater (<span>P</span> &lt; 0.05) for fries (74.0%), not different (<span>P</span> = 0.44) for hopper (56.1%), and less (<span>P</span> &lt; 0.05) for dry peel (43.6%) and sprouts (37.0%) when compared with corn grain (53.9%). Rate of DM degradation for fraction B was greater (<span>P</span> &lt; 0.05) for fries (9.9%/h) and hopper (7.0%/h), and not different (<span>P</span> &gt; 0.16) for dry peel (4.6%/h) and sprouts (3.0%/h) when compared with corn grain (3.8%/h). Fraction C for DM was greater (<span>P</span> &lt; 0.05) for dry peel (28.6%) and sprouts (27.6%), and not different (<span>P</span> = 0.20) for fries (12.9%) and hopper (10.3%) when compared with corn grain (12.7%). The indigestible fraction of NDF after 48 h of incubation was greatest for dry peel (58.5%), intermediate for sprouts (40.1%) and hopper (36.7%), and least for fries (25.4%; <span>P</span> &lt; 0.05). These results demonstrate that the extent and rate of ruminal DM degradability of various potato and other byproducts differ and may be more or less degradable in the rumen compared with corn grain.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7acbac9683233f1cd67952dcb4447feb8fb46eef50ee808722f27b2348d68ab8","category":"Environment"}