{"title":"Apple Ending Apple Card Partnership With Goldman Sachs","link":"https://www.macrumors.com/2023/11/28/apple-goldman-sachs-partnership-ending/","date":1701212980000,"content":"Apple is ending its credit card partnership with Goldman Sachs, according to <em><a href=\"https://www.wsj.com/finance/banking/apple-pulls-plug-on-goldman-credit-card-partnership-ca1dfb45\">The Wall Street Journal</a></em>. Apple plans to stop working with Goldman Sachs in the next 12 to 15 months, and it is not yet clear if Apple has established a new partnership for the <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/apple-card-1.jpg\" width=\"1600\" height=\"900\" />\r<br />\nApple and Goldman Sachs will dissolve their entire consumer partnership, including the ‌Apple Card‌ and the Apple Savings account. Apple in a statement that was provided to <em><a href=\"https://www.cnbc.com/2023/11/28/apple-is-trying-to-unwind-its-goldman-sachs-credit-card-partnership.html\">CNBC</a></em> said that it will continue to provide \"the best tools and services\" for ‌Apple Card‌ customers.<blockquote>\"Apple and Goldman Sachs are focused on providing an incredible experience for our customers to help them lead healthier financial lives. The award-winning Apple Card has seen a great reception from consumers, and we will continue to innovate and deliver the best tools and services for them.\"</blockquote>Rumors earlier this year suggested that Goldman Sachs wanted to <a href=\"https://www.macrumors.com/2023/06/30/goldman-sachs-apple-partnership-amex/\">get out of its relationship</a> with Apple as part of a plan to cut back on its consumer business. Goldman Sachs at the time was said to be speaking with American Express about a possible takeover, but the ‌Apple Card‌ needs to run on the Mastercard network until 2026 due to a deal established between Apple and Goldman Sachs. Amex also had concerns about aspects of the program such as loan loss rates due to Apple's push to have customers approved, so the status of the talks is not known.\r<br />\n\r<br />\nSynchrony Financial, known as the largest issuer of store credit cards, has considered taking over the ‌Apple Card‌, according to <em>The <a href=\"https://www.macrumors.com/guide/wsj-com/\">Wall Street Journal</a></em>. \r<br />\n\r<br />\nGoldman Sachs and Apple have worked together on the ‌Apple Card‌ since it launched in 2019, and have also teamed up for the high-yield Apple Savings account and the <a href=\"https://www.macrumors.com/roundup/apple-pay/\">Apple Pay</a> Later feature. The partnership <a href=\"https://www.macrumors.com/2023/07/25/apple-goldman-sachs-apple-card-issues/\">has not gone smoothly</a>, with Goldman Sachs running into <a href=\"https://www.macrumors.com/2023/07/25/apple-goldman-sachs-apple-card-issues/\">customer service issues</a> due to long wait times for disputed ‌Apple Card‌ transactions and issues with the Apple Savings account.\r<br />\n\r<br />\nThe U.S. Consumer Financial Protection Bureau <a href=\"https://www.reuters.com/business/finance/us-fed-probes-goldman-sachs-consumer-business-wsj-2023-01-20/\">launched an investigation</a> into Goldman Sachs due to the customer complaints, leading to tension with Apple. Apple is unhappy with the customer service reputation of its ‌Apple Card‌ and Apple Savings products, while some Goldman Sachs executives blame Apple for the regulatory scrutiny. \r<br />\n\r<br />\nGoldman Sachs was new to consumer banking when the ‌Apple Card‌ launched, and to establish a deal with Apple, it is not collecting fees that many credit card issuers receive. The bank does not get a cut of the fee that merchants pay to Apple to accept the ‌Apple Card‌, nor is it able to collect annual fees, late fees, or foreign transaction fees. Goldman Sachs does earn money from loans issued to cardholders who split Apple purchases into installments, but it is not known if Apple will be able to establish a similar deal with another issuer because of the limited revenue the ‌Apple Card‌ provides. <br />This article, \"<a href=\"https://www.macrumors.com/2023/11/28/apple-goldman-sachs-partnership-ending/\">Apple Ending Apple Card Partnership With Goldman Sachs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-ending-apple-card-partnership-with-goldman-sachs.2412297/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7acd5590fbc3a3805aec60bc4ad50118a80ff38d8e12a3754c09cdbabf74b54e","category":"Apple"}