{"title":"How to stay warm and dry on winter rides","link":"https://www.cyclist.co.uk/sponsored/10208/how-to-stay-warm-and-dry-on-winter-rides","date":1635155834000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>1 Nov 2021</span></div>    </div></div><p>\nEssential tips to stay warm on the inside when it’s chilly outside</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/donda_cycling_sponsored.jpg?itok=eh8gyGIi\" />  </div>\n<div>\n      <p> Riding into the depths of winter is a great way of keeping your base fitness up, and can be a lot more rewarding mentally than slogging it out on the turbo trainer. Although the conditions can be a bit more challenging than going for a spin on those balmy summer days, it’s often just a case of having the right kit and some little pre- and mid-ride hacks. Fortunately, we’ve done all the hard miles for you, leaving you with the ultimate guide on how to stay warm and dry out on the bike this winter.</p>\n<h2>Fuel up with warm food and drink</h2>\n<p>A warm meal before heading out into the cold can help you get through those first few miles when your muscles aren’t quite firing and there’s a temptation to turn back home. Porridge is a firm favourite amongst cyclists because of its slow-release energy status, but come winter, it also puts a fire in your belly that not even sub-zero degrees can put out.</p>\n<p>If you haven’t got time for a cafe stop but still want a mid-ride pick me up, one top tip is to swap out your water bottles for a flask or thermal bidon and fill it with tea or coffee</p>\n<h2>Layer your clothing correctly</h2>\n<p>If it looks cold outside when you’re inspecting the elements from the comfort of your home, it can be tempting to don your warmest thermals to help you brave the conditions. The issue with doing this is that it’s easy to forget that, as you ride, your body will naturally create some heat of its own.</p>\n<p>Even the most breathable cycling clothing can soon turn into a damp, sweaty mess, which can leave you cold if the moisture doesn’t wick away quick enough. Instead, it’s best to wear a number of layers that can be peeled off as your ride progresses. Gilets, arm and leg warmers are all ideal pieces for those milder mornings when it’s not quite Baltic.</p>\n<h2>Invest in some winter-specific kit</h2>\n<p>If it is freezing (literally and figuratively), then it’s time to break out the big guns. British brand Donda Cycling has a great range of winter-specific kit and its <a href=\"https://www.decathlon.co.uk/p/mp/donda/torrential-jacket-orange-mens-thermal-cycling-jacket/_/R-p-58963985-6db6-44cb-9369-0da2d83e6b49\" target=\"_blank\"><span>Torrential Jacket</span></a><span> is the jewel in its frosty crown</span></p>\n<p>Offering a premium design with an affordable £80 price tag, the jacket – which is available from Decathlon – has a breathable thermal inside layer that is great at wicking moisture away from hot spots, while its outer is windproof, water resistant and has reflective detailing on the front and back for some added visibility when riding in low light. When paired with the company’s <a href=\"https://www.decathlon.co.uk/p/mp/donda/principal-bib-tights-mens-thermal-bib-tights-black/_/R-p-1c33f327-079b-44c9-bcba-34a126da9337?mc=1c33f327-079b-44c9-bcba-34a126da9337_c1&amp;c=BLACK\" target=\"_blank\"><span>Principal Bib Tights</span></a><span>, you’re ready for anything that the UK’s winter can throw at you.</span></p>\n<h2>Keep your appendages covered</h2>\n<p>Torso and legs sorted, you might be thinking that you’re good to go. But it’s vital to keep all of your body covered and warm – especially the bits that don’t actually move a lot and bear the brunt of the wind, rain and general chill.</p>\n<p>A good pair of gloves can ensure your hands stay comfortable and leave you firmly in control of proceedings, and a snood and hat can keep your nose, mouth and ears covered. For even more protection on wet days, boot covers are an essential purchase. And, even if it’s not sunny, a pair of shades can stop your eyes watering from the cold or getting battered by the wind</p>\n<h2>Plan some mid-ride stops</h2>\n<p>You’re already heading out on a cold-weather spin rather than sitting slouched on the sofa, so you’ve definitely earned a mid-ride stop or two. But that slice of cake and coffee is more than a treat for braving the elements</p>\n<p>Time off the bike and in the warm can help thaw out any parts that have got cold while riding, and can be an ideal time to sort out your layering if you don’t quite have it spot on. Plus, like a hot drink in a thermal bottle, it can help to warm your insides and provide some added motivation during the ride home</p>\n<h2>Up the tempo</h2>\n<p>If you’re riding during the winter months, there’s a good chance that you’re using it as an opportunity to get in some miles ahead of the coming year, allowing you to have a solid base to build your fitness upon come spring.</p>\n<p>It’s great to throw the odd interval session into the mix though – especially if you’re starting to feel the chill during your low-intensity rides. As well as keeping you warm, HIIT or tempo sessions have the added benefit of improving your overall fitness, and time spent in the red will pay dividends come sportive season.</p>\n<h2>Make your bike winter-ready</h2>\n<p>It might sound obvious, but not winter-proofing your bike is a mistake that many riders make. It’s a fairly straightforward task though, and won’t even require a trip to your local bike shop. Installing a set of mudguards should be at the top of your agenda. Their protection comes into their own during the wet winter months and doesn’t only stop you getting covered in road spray, but anyone riding behind you too</p>\n<p>It might also be worth swapping your tyres for ones with beefed-up puncture protection or switching to a tubeless set-up if your wheels are compatible – no one wants to be left fumbling on the side of the road as they change an innertube in the freezing cold, after all</p>\n<p><strong><em>Visit Decathlon to buy <a href=\"https://www.decathlon.co.uk/p/mp/donda/torrential-jacket-orange-mens-thermal-cycling-jacket/_/R-p-58963985-6db6-44cb-9369-0da2d83e6b49\" target=\"_blank\">Donda’s Torrential Jacket</a> and <a href=\"https://www.decathlon.co.uk/p/mp/donda/principal-bib-tights-mens-thermal-bib-tights-black/_/R-p-1c33f327-079b-44c9-bcba-34a126da9337\" target=\"_blank\">Principal Bib Tights</a></em></strong> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/clothing\">Clothing</a></div>    </div></div>","author":"SimonR","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"7acf414c12f6c31c31fe2fa7b1f38dab99f06b1ac40642797002607859226f20","category":"Cycling"}