{"title":"Isolation and characterization of bacteria from the gut of a mesopelagic copepod Cephalophanes reflugens (Copepoda: Calanoida)","link":"https://academic.oup.com/plankt/article/46/1/48/7457342?rss=1","date":1701907200000,"content":"<span><div>Abstract</div>The mesopelagic calanoid copepod <span>Cephalophanes reflugens</span> is characterized by its large eyes with semi-parabolic reflectors. It is hypothesized that the eyes aid in finding crustacean carcasses as food in poor deep-sea light and oligotrophic conditions. Here, the crustacean carcasses-associated luminous, chitin-degrading bacteria may play a vital role in detecting and digesting foods by the copepod. In this study, we collected adult female <span>C. reflugens</span> (<span>n</span> = 9) from the mesopelagic layers off southwestern Japan in the Pacific Ocean and obtained a total of 47 bacterial isolates from the gut contents. None of the isolates were luminescent, but almost half of the isolates were chitinolytic. Based on the 16S rRNA gene sequences, these chitinolytic bacteria were identified as members of the genus <span>Vibrio</span>, <span>Photobacterium</span> and <span>Pseudoalteromonas</span>. In culture experiments at 15°C, most of the chitinolytic isolates efficiently utilized colloidal chitin as the sole carbon source and degraded the carapace strip of shrimp (<span>Litopenaeus vannamei</span>). Some isolates showed these chitinoclastic activities even at low temperatures (&lt;5°C), equivalent to that of the deep-sea waters. The present results imply that chitin-degrading bacteria significantly contribute to chitin digestion in the gut of <span>C. reflugens</span>, whereas the involvement of luminous bacteria in the feeding mechanism remains unidentified.</span>","author":"","siteTitle":"Journal of Plankton Research Current Issue","siteHash":"76dddc2a9ba5dfb3490083b30b542d64431810a1f59aa42d49b14d3439ebc9c8","entryHash":"7ad36a4693a445139a6c48ce9bae222dcfc450fb2a1a5429a6b00402071f13b1","category":"Environment"}