{"title":"Microplastic evidence assessment from water and sediment sampling in a shallow tropical lake","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11123?af=R","date":1725337118000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7621478f-2453-4898-8c27-231143eeba28/wer11123-toc-0001-m.png\" alt=\"Microplastic evidence assessment from water and sediment sampling in a shallow tropical lake\" />\n<p>Findings of microplastic in a shallow tropical lake.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Microplastics (MPs) severely threaten inland waterbodies due to the direct impact of human activities. In the present study, spatial and temporal patterns of MPs in a shallow tropical lake were assessed, describing their size, morphology, and polymer types. Water and sediment samples were collected from Lake Chapala during three seasons, and MPs were quantified with a stereomicroscope. The structure, elemental composition, and polymeric composition were determined via environmental scanning electron microscopy and Fourier transform infrared spectroscopy. The highest average concentration of microplastics in Lake Chapala was detected during the low-water period in April 2022 (2.35 items/L), exceeding the July 2022 rainy season concentration (1.8 items/L) by 0.25 items/L, and sediment concentrations were also higher in April 2022 (219 items/kg) compared to July 2022 (210 items/kg). This study highlights the significant pollution of Lake Chapala with microplastics, emphasizing the need for urgent measures to manage plastic waste and mitigate its environmental impact on aquatic ecosystems.</p>\n<h2>Practitioner Points</h2>\n<p>\nMicroplastic contamination was evaluated in Lake Chapala.\nThe distribution profiles of microplastics were different in each area.\nHeavy metals osmium, tellurium, and rhodium were found associated with the PMs.\nPolymers were found in this study.\n</p>","author":"Samuel Macario Padilla‐Jimenez, \nRodrigo Moncayo‐Estrada, \nDaniel Tapia Maruri, \nDioselina Álvarez‐Bernal","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"7ad553abdfddb34f74374793c3e18f98153f9bb1d1f3a45d1b54097dd202b03c","category":"Environment"}