{"title":"Pixel Watch 2 Hands-On: Here’s everything that’s new!","link":"https://www.dcrainmaker.com/2023/10/pixel-watch-2-hands-on-heres-everything-thats-new.html","date":1696443425000,"content":"<p></p>\n<p>Google has just announced the Pixel Watch 2, and as expected by the rumors, it’s largely incremental upgrades this year. However, some of these updates could be quite notable for athletes, given the focus on higher accuracy sensors and new sports &amp; coaching features. This is an initial hands-on look at things, and then expect a full in-depth review down the road.</p>\n<p>The Pixel Watch 2 will retain the same singular 40.8mm size as previous editions, and with it retains the existing band design. However, the company is introducing a number of new bands including sport bands which they say are “more breathable” than last years edition.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099719.jpg\"><img width=\"720\" height=\"480\" title=\"P1099719\" alt=\"P1099719\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099719_thumb.jpg\" /></a></p>\n<p>Here’s the bulleted list of what’s changed:</p>\n<p>– New 100% recycled aluminum housing<br />– Increased durability of cover glass<br />– Now 10% lighter (weight) due to new aluminum housing<br />– Increased battery life to “full 24 hours” in always-on display mode<br />– Pixel 2 will now run Wear OS 4<br />– New 4-core CPU to increase performance<br />– Faster charge times: 12 hours of usage in 30 minutes of charge time<br />– Added Google Assistant on-watch ability to now query health/fitness stats<br />– Added Watch Backup and restore &amp; phone transfer<br />– Added real-time safety check feature, alerting emergency contacts if you don’t check-in<br />– Adding medical ID to watch, allowing first responders to see medical info<br />– Adding 6 new styles of watch faces<br />– New heart rate sensor: Switched to new “multipath heart rate module design” with 5 photo diodes &amp; 5 LED’s, plus better spacing/coverage<br />– New skin temperature sensor (upgrade over previous non-dedicated sensor method)<br />– New skin dermatological sensor added as well, allowing Fitbit Body response feature<br />– New on-watch zone pacing and heart rate features<br />– New automatic workout detection for 7 new workout/sport types<br />– Added background irregular heart rate notifications<br />– Three colors offered, pricing is $349 for WiFi models, and $399 for cellular models<br />– Available for ordering October 4th (today), and shipping October 12th (next Thursday)<br />– Includes 6 months of Fitbit Premium<br />– Water 50m resistant stays the same, also compatible with existing watch bands</p>\n<p>So, stepping through some of these items briefly, first up is the new ability to query Google Assistant on-device for health stats. An example being to verbally ask it how much you slept last night, or your heart rate. We saw Apple announce this same feature last month for their watches with Siri, albeit that won’t launch till later this year. And remember, companies as big as Apple/Google can’t turn on a dime and copy each other this quickly. These sorts of things have long been in the works by time they’re announced here.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099729.jpg\"><img width=\"720\" height=\"480\" title=\"P1099729\" alt=\"P1099729\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099729_thumb.jpg\" /></a></p>\n<p>Next is the new real-time safety check feature. This essentially works the same as it has on Pixel phones, but now ported to your wrist. You’ll specify a time you expect to be done, and then if you don’t check back in within that timeframe, it’ll automatically notify your emergency contacts (via either cellular from your phone, or cellular built-in to the watch if you have that variant). Additionally, there’s the new medical ID that can be accessed from the watch face.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/PixelwatchSharingLocationRealTime.png\"><img width=\"355\" height=\"237\" title=\"PixelwatchSharingLocationRealTime\" alt=\"PixelwatchSharingLocationRealTime\" src=\"https://media.dcrainmaker.com/images/2023/10/PixelwatchSharingLocationRealTime_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/10/PixelWatchSafetyCheck.png\"><img width=\"316\" height=\"237\" title=\"PixelWatchSafetyCheck\" alt=\"PixelWatchSafetyCheck\" src=\"https://media.dcrainmaker.com/images/2023/10/PixelWatchSafetyCheck_thumb.png\" /></a></p>\n<p>Interestingly, for those with cellar Pixel Watch 2, there’s a feature whereby users who haven’t enabled/activated cellular service on that watch, can still leverage Fitbit’s Safety Signal feature with Fitbit Premium. That feature is basically a background LTE connectivity option for the watch to get that emergency message out. Again, if you have cellular service on the watch via your carrier, then you don’t need Fitbit Premium. But if you didn’t activate that feature with your cellular carrier, then this acts as an alternative.</p>\n<p>Perhaps the biggest feature though is the new optical heart rate sensor. Google says this new “multipath” design (compared to single-path before) now has 5 photo diodes and 5 LED’s on the back of it. Further, they’ve increased the spacing/coverage over the back of the sensor compared to a Pixel Watch 1 sensor. In the case of the multipath configuration, there’s effectively 10 ‘pathways’ between these photo diodes and LED’s, though Google says technically that can be up to 25 pathways.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099726.jpg\"><img width=\"720\" height=\"480\" title=\"P1099726\" alt=\"P1099726\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099726_thumb.jpg\" /></a></p>\n<p>For comparison, here’s a Pixel Watch 1 sensor, which is a pretty basic sensor design that you would have seen in more simplistic Fitbit products. Still, it <a href=\"https://www.dcrainmaker.com/2022/10/google-pixel-watch-in-depth-review-a-promising-start.html#gps-heart-rate-accuracy\">did quite well in my testing</a>, being easily the best Fitbit/Google HR sensor I saw from them at that point, and largely comparable to other top-end units. Google said at the time that a lot of closing that gap was due to more machine learning employed on the watch, than historically done by Fitbit.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/PixelWatch1Sensor.jpg\"><img width=\"720\" height=\"480\" title=\"PixelWatch1Sensor\" alt=\"PixelWatch1Sensor\" src=\"https://media.dcrainmaker.com/images/2023/10/PixelWatch1Sensor_thumb.jpg\" /></a></p>\n<p>In any case, looking forward to my testing to see how this handles in real-life conditions, especially of course hard intervals and other fast-changing heart rate scenarios (including the always-difficult road cycling, due to flexed wrists). Google says it will produce “up to 40% more accurate” heart rate data.</p>\n<p>Now this new optical HR sensor also opens up a number of new features. First, is that it’s got a new skin temperature sensor. This is different from last years skin temperature sensor hardware, and is being leveraged for relative temperature tracking (used within the Fitbit app). However, at this time it’s not being leveraged for women’s cycle tracking-related features. The bottom portion (with SpO2 written on it), is the new skin temperature sensor:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099753.jpg\"><img width=\"720\" height=\"480\" title=\"P1099753\" alt=\"P1099753\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099753_thumb.jpg\" /></a></p>\n<p>With that new skin temperature sensor is a new skin dermatological sensor added as well( called a continuous electrodermal activity (cEDA) sensor), which above is the upper half of the sensor panel, enabling Fitbit Body response feature that looks for tiny bits of sweat to determine things like stressful moments/time periods. Note that previously the Pixel Watch didn’t have a dedicated skin temperature sensor, instead, they used other sensor data to try and proxy that skin temp.</p>\n<p>Now, one slight heart-rate related quirk compared to the Fitbit Charge 6 that was just announced last week, is the Pixel Watch 2  doesn’t have the heart rate broadcasting feature introduced on the Charge 6. Well, at least not yet. Hopefully that’ll happen soon. They had it on demo at the Pixel launch event, with Fitbit Charge 6 units and Peloton Bikes:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099750.jpg\"><img width=\"720\" height=\"480\" title=\"P1099750\" alt=\"P1099750\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099750_thumb.jpg\" /></a></p>\n<p>Next, there’s new on-watch coaching features around both pacing as well as heart rate. This is divided up into a few different chunks. First there’s the ability to set a given pace range (e.g. stay between an upper/lower limit), then there’s the ability to target a specific pace. Meanwhile, on the heart rate side, it’s effectively the same – with the ability to target a specific zone, and you can see your level relative to that target zone. </p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/PixelWatchPacing.png\"><img width=\"722\" height=\"401\" title=\"PixelWatchPacing\" alt=\"PixelWatchPacing\" src=\"https://media.dcrainmaker.com/images/2023/10/PixelWatchPacing_thumb.png\" /></a></p>\n<p>Fitbit also took the opportunity to outline and preview a new Fitbit Labs program, that will leverage the recently revamped Fitbit app to use generative AI (which Fitbit is labeling as ‘Personal AI’) to answer coach-like questions. Fitbit says they’ll start rolling this out early next year to small groups before expanding it:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/FitbitAI2.png\"><img width=\"357\" height=\"208\" title=\"FitbitAI2\" alt=\"FitbitAI2\" src=\"https://media.dcrainmaker.com/images/2023/10/FitbitAI2_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/10/FitbitAI3.png\"><img width=\"362\" height=\"208\" title=\"FitbitAI3\" alt=\"FitbitAI3\" src=\"https://media.dcrainmaker.com/images/2023/10/FitbitAI3_thumb.png\" /></a></p>\n<p>Finally, there’s six new styles of watch faces.</p>\n<p>With that, again, the watch will start shipping next Thursday (Oct 12th), alongside the new Pixel phones. Look for my full in-depth review of the new Pixel Watch 2 sometime around then, to see how well it works in real-life.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"7ad5f22bb93182d20aacae9894ceedc8e5ec06ecafa427caf5413c899fa25faa","category":"Cycling"}