{"title":"A cargo sorting receptor mediates chloroplast protein trafficking through the secretory pathway","link":"https://academic.oup.com/plcell/article/36/9/3770/7706169?rss=1","date":1720051200000,"content":"<span><div>Abstract</div>Nucleus-encoded chloroplast proteins can be transported via the secretory pathway. The molecular mechanisms underlying the trafficking of chloroplast proteins between the intracellular compartments are largely unclear, and a cargo sorting receptor has not previously been identified in the secretory pathway. Here, we report a cargo sorting receptor that is specifically present in Viridiplantae and mediates the transport of cargo proteins to the chloroplast. Using a forward genetic analysis, we identified a gene encoding a transmembrane protein (MtTP930) in barrel medic (<span>Medicago truncatula</span>). Mutation of <span>MtTP930</span> resulted in impaired chloroplast function and a dwarf phenotype. <span>MtTP930</span> is highly expressed in the aerial parts of the plant and is localized to the endoplasmic reticulum (ER) exit sites and Golgi. MtTP930 contains typical cargo sorting receptor motifs, interacts with Sar1, Sec12, and Sec24, and participates in coat protein complex II vesicular transport. Importantly, MtTP930 can recognize the cargo proteins plastidial <span>N</span>-glycosylated nucleotide pyrophosphatase/phosphodiesterase (MtNPP) and α-carbonic anhydrase (MtCAH) in the ER and then transport them to the chloroplast via the secretory pathway. Mutation of a homolog of <span>MtTP930</span> in Arabidopsis (<span>Arabidopsis thaliana</span>) resulted in a similar dwarf phenotype. Furthermore, MtNPP-GFP failed to localize to chloroplasts when transgenically expressed in <span>Attp930</span> protoplasts, implying that these cargo sorting receptors are conserved in plants. These findings fill a gap in our understanding of the mechanism by which chloroplast proteins are sorted and transported via the secretory pathway.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"7ae2a47039fdec2c3bb6ad39c22433f3d6c1ecea6baa60a23f1812db9426aa93","category":"Environment"}