{"title":"206 Effects of breed type and days on trial on feeding behavior in growing goats fed a total mixed diets using GrowSafe feeding technology","link":"https://academic.oup.com/jas/article/102/Supplement_3/398/7757378?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effects of breed and days on trial (DOT) on feeding behavior traits in two breeds of growing goats. Nineteen female goats [n = 10 Alpine; n = 9 Spanish, with average initial ages of 360 d and 352 d, and body weight (BW) of 38.8 ± 2.8 kg and 35.5 ± 3.1 kg, respectively], were randomly assigned within the breed to one of two non-adjacent pens (5 goats/pen), each equipped with GrowSafe feed bunks. A pelletized total mixed ration (TMR) was fed twice per day and goats had ad libitum access to feed, water, and mineral block throughout the 84-d trial. Feeding behavior traits, including feed intake, bunk visit frequency (BVF), head-down duration (HDD), and dry matter intake (DMI) were collected daily using the GrowSafe feeding system. A 14-d interval was used to derive feed behavior traits of individual goats at 42, 56, 70, and 84 DOT. Data were analyzed using a repeated-measures model with a fixed effect of breed, DOT as a repeated measure, and breed x DOT interaction with pen as a random effect. Alpine goats had greater (<span>P</span> &lt; 0.05) initial and final BW (37.6 kg and 51.7 kg, respectively) than Spanish goats (34.7 kg and 46.5 kg, respectively) although DMI (<span>P</span> = 0.10; 1.73 ± 0.31 and 1.39 ± 0.18 kg/d) did not differ. There was not a significant difference (<span>P</span> &gt; 0.05) between breeds for frequency of bunk visits (21.1 vs. 18.6) and bunk duration (<span>P</span> &gt; 0.05). Similarly, the effect of breed on DMI (27.1g/min vs. 22.8 g/min) was non-significant (<span>P</span> &gt; 0.05). Furthermore, breed did not significantly (<span>P</span> &gt; 0.05) affect HDD (31.3 min/d vs 31.9 min/d). However, there was a significant interaction (<span>P</span> &lt; 0.05) between breed and DOT for HDD. In addition, significant differences (<span>P</span> &lt; 0.05) were observed due to the length of DOT for BVD, bunk visit duration, HDD, and eating rate (g/min). Our results suggest that Spanish goats tended to visit feed bunks more frequently per day and tended to consume less feed per visit than their counterpart Alpine goats, and the feeding behaviors of goats change with age. However, further research is warranted to determine changes in the feeding behavior of goats in different production cycles.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7ae4da943636bec567db0c634803379c36ddd4282947eeef9a9ba7966bac1a27","category":"Environment"}