{"title":"'I’ve paid my dues, I always kept fighting': Sam Bennett begins new career chapter with more determination than ever","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/sam-bennett-earning-his-sprinting-place-amid-the-chaos","date":1708245001000,"content":"\n      <p>Sam Bennett is clearly relaxed as he comes down to the lobby of the Ibis Hotel on the outskirts of Aix-en-Provence before his first race of the 2024 season, the Tour de la Provence. And while his large wire-rimmed glasses project a certain studious side, his easy smile and generous laugh reflect the easy-going nature of the amiable Irishman.</p>\n<div></div>\n<div></div>\n<p>Bennett, of course, was one of the fastest rising stars of the peloton when he won two stages and the green jersey in the 2020 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. But his wave of success came to a halt when a series of injuries thwarted his progress in the years that followed.</p>\n<p>The injuries, of course, are well documented. First there was the knee injury before the 2021 Tour de France when a gear slipped during a sprint workout, and he slammed his right knee into the handlebar. Then there was the strained muscle in his left leg that he sustained while doing leg extensions in the off-season before the 2022 season. Finally, there was the hamstring strain sustained when he slipped and fell while running to catch a connecting flight just last winter.</p>\n<p>“There were a lot of highs and a lot of lows the last couple of years,” the 33-year-old says with a gentle laugh as he puts the past few years in perspective. “But that is sport. I’d rather have it that way than to just be average all the time. I just hope I’m done with the low part now. I think I’ve paid my dues. The main thing is that I always kept a professional head. I always kept fighting. And if I keep knocking on the door, eventually someone will answer, even if I have to kick the door down.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Sam_Bennett06_Rouleur_02_2024.jpg?v=1708103221\" alt=\"Sam Bennett\" /></p>\n<p>“If you come into the season ready, you only get better from race to race, because you can absorb the racing and improve,” he continues. “But if you come in on a low, you don’t have the time to get ready in between the early-season races. And you just get worse and worse. And that was the case for me the last two years. I was just in a downward cycle.”</p>\n<p>Yet despite the past years of frustration, two words come to mind as Bennett speaks about the upcoming season—excited and hungry. And while some were skeptical of his move to the French Decathlon – AG2R La Mondiale team—which has never shouldered a world-class sprinter—Bennett insists that the team was an instant fit.</p>\n<p>“I spoke to Stephen Barrett, who has been a trainer with the team for five or six years. He is Irish as well so we have chatted a lot, and he was telling me that the team was going through a lot of changes. He told me they were looking for a sprinter, that they were getting new bikes and making a lot of changes. I knew that I needed to be on a team where I had good backing, a place where I can perform, where I have a good trainer, a good bike, a good program. I needed to be on a team where I had good opportunities because my time is limited. Everything just clicked here, and it really looked like a good fit. I think I am going to come back to my level here.”</p>\n<p>While riders are often up-beat when they start a new season with a new team, Bennett’s enthusiasm clearly runs deep, be it with the staff, the riders, or the equipment. One of the things he is most impressed with is the <a href=\"https://www.rouleur.cc/blogs/desire-journal/the-cheapest-bike-in-the-pro-peloton-decathlon-ag2r-la-mondiale-s-van-rysel-rcr\">new Van Rysel bike</a> the team is riding. The bike brand for the Decathlon sporting goods chain, Van Rysel is a relative newcomer to professional cycling, and it is making its WorldTour debut this year with the team. But while the bike brand may be relatively new, Bennett is thoroughly impressed.</p>\n<p>“The bike is fantastic. It is a competitive bike. It is honestly one of the best bikes I have ridden, and I have ridden some good bikes,” says Bennett, who has spent much of his career on Specialized. “I’ve come from a good brand, and I know what a good bike is. And this is a really good bike. It’s so competitive. It’s light. It’s stable. It’s stiff. It’s fast. It’s aero. And we have got the best stuff on it. We’ve got Continental tyres. We’ve got Shimano. It’s just a really good package. It’s just right there! I’m really impressed. It’s the first year in the WorldTour for Van Rysel and I really hope to have some good victories on it because it is a bike that deserves the credit.”</p>\n<p>Former professional Sébastien Joly has worked as sports director for many French teams including Groupama-FDJ and Direct Energie before coming to Decathlon – AG2R La Mondiale. And after working with Bennett in the team’s first training camps, he is equally impressed with his new sprinter. “He didn’t come to the team to go into a retirement home. That is clear. You can really feel his desire to return. He really wants to be the Sam Bennett he was before. It’s super interesting,”</p>\n<p>“Sam is a really good guy. That comes out right away,” Joly adds. “On a human level, he is someone who really listens and discusses things. And on the bike he is not crazy. He reminds me of Arnaud Démare to be honest, because both are really calm in life. Both sprinters of course, and they really want to win, but always with a lot of respect. As sprinters, they never make any reckless moves. For me that is important.”</p>\n<p>Joly has been working regularly with Bennett to establish the ideal sprint train within the team, something that has not historically been the team’s forte.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Sam_Bennett04_Rouleur_02_2024.jpg?v=1708103251\" alt=\"Sam Bennett\" /></p>\n<p>“We’ve been working on his train,” Joly insists. “In fact, there will be several different trains depending on the races, but I think we can imagine an ideal train with Oliver Naesen and Edvald Boasson-Hagen. There are a lot of teams that would dream of having a guy like Oliver on the team. He knows how to really place a rider in the sprint. And then there is Edvald, who can really take him into the final meters. Both guys are very athletic, but also very smooth riders, and that is what Sam needs in a race.”</p>\n<p>While Bennett has been often sidelined these past years, he has spent significant time watching races and studying how sprinting has evolved. “I cannot remember a time that was more competitive for sprinters. There are just so many good guys today. If you look at last year’s races, how many were won in the last few meters? How many came down to a photo finish? Outside of Jasper Philipsen, there were no guys winning by a bike length anymore. So many sprints just come down to the last 50 meters. But as a result, you can’t move with a lead out train anymore. There are just too many good sprinters trying to get there. So the maximum you want to have is one, maybe two guys in front of you. And I’ve got those guys. Guys like Oliver Naesen and Boasson-Hagen are really experienced. They are calm which is really important. You have to be calm, cool and collected going into a sprint. Then you can just kind of surf and then pop out at the last minute. Perhaps in the smaller races you can have a longer train, but I think in the bigger races I think it is more about coming out in the last few meters.”</p>\n<p>Bennett knows that he will once again have to earn his place amid the chaos and the constant fight for positioning that is part of sprinting. “Even when I was away for six months, I wasn’t able to go where I wanted in the peloton. You have to fight to get your presence back in the bunch. It was a total reset.” <br /><br />But he also likes what he sees in modern sprinting and feels that it suits a power-based rider like himself. “I am a rider that has always relied more on my engine than my sprint. For me it is not about how deep I can go into my lactate. It’s more about being fresh in the final so that I can win off of that. And nowadays that is how racing is.”</p>\n<p>Bennett is obviously eager to be back in the mix, but firstly he is simply happy to be injury free and to once again be in a position where he can focus on the finer details of training and race. “I fell in love with the process again, the whole process of training and preparing for the races. You know, when you have been getting hammered for two and a half years, you are going through the process, but you can just hate it. You are just waiting for it to click again. But since I have been here, I have fallen in love with the process again, and things are coming easier. I think when you see progression, that’s the best motivator. I feel normal again and that’s a good feeling. I really hope it translates to racing. And it should. When you are in love with the process and training is going well, it transfers to the bike.”</p>\n<p>It was clear in the days that followed, that Bennett’s condition was back as he placed eighth in the opening time trial, and then just missed out on victory on the final stage to Arles. The race literally splintered apart when the pack hit the windswept marshlands of the French Camargue, but both Bennett and his Decathlon – AG2R La Mondiale teammates could be seen driving the pace at the front.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Sam_Bennett08_Rouleur_02_2024.jpg?v=1708103116\" alt=\"Sam bennett\" /></p>\n<p>While he came up just short in the final sprint to the line, he understood that there were plenty of positive takeaways. “The guys were incredible looking after me all day, and they gave me a great lead out. It is just unfortunate we didn’t get the win. I thought I had it 20 meters from the line actually, but the final meters were a little downhill and into a headwind. It favored guys coming from behind, and Tom Van Asbroeck [ed. the eventual stage winner] timed it perfectly. But I did everything I could and I know I am there. And having this race in the legs will do me good.”</p>\n<p>Bennett will now head to the UAE later this month before returning to Paris-Nice in March. The Race to the Sun is a race he knows well. After all, he has won no fewer than five stages there, and he will be plenty hungry to add a sixth this year.</p>\n<p>“I don’t have much time left in the sport,” Bennett says. “I do think I have four years left, however, and I don’t want to throw in the towel yet. There is still so much I want to do in the sport. You can always retire, but you can never come back. You only get one shot.”</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7ae856731dc520e4a800fa01fa56c665fef1ed342866540c5a351f1625511af5","category":"Cycling"}