{"title":"Gmail unleashes “email emoji reactions” onto an unsuspecting world","link":"https://arstechnica.com/?p=1973281","date":1696445761000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/24-980x834.jpg\" alt /></div>\n          <p>\n            Gmail emoji reactions below an email (left) and the \"add emoji\" bar on the right.                           [credit:\n                              Google                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Finally, the feature everyone has been asking for: Gmail <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f44f.png\" alt=\"👏\" /> emoji <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f44f.png\" alt=\"👏\" /> reactions <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f44f.png\" alt=\"👏\" />.</p>\n<p>You can now reply to an email just like it's an instant messaging chat, tacking on a \"crying laughing\" emoji to an email instead of replying. Google has a whole <a href=\"https://support.google.com/mail/answer/14080429?visit_id=638319434506118031-3649702038&amp;p=emoji_reactions&amp;rd=1\">support article</a> detailing the new feature, which allows you to \"express yourself and quickly respond to emails with emojis.\" Like a messaging app, a row of emoji reaction counts will appear below your email now, and other people on the thread can tap to add to the reaction count. Currently, it's only on the Android Gmail app, but it's presumably coming to other Gmail clients.</p>\n<p>Of course, email is from the 1970s and does not natively support emoji reactions. That makes this a Gmail-proprietary feature, which is a problem for federated emails that are expected to work with a million different clients and providers. If you send an emoji reaction and someone on the email chain is not using an official Gmail client, they will get <em>a new, additional email</em> containing your singular reactive emoji. Google is not messing with the email standard, so people not using Gmail will be the most affected.</p></div><p><a href=\"https://arstechnica.com/?p=1973281#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1973281&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7aefeda8b1af90709b946a33a856b0b135e948b0b02c3a5abe332c8cc7b875c2","category":"Tech"}