{"title":"Visual Cues, Liking, and Emotional Responses: What Combination of Factors Result in the Willingness to Eat Vegetables among Children with Food Neophobia?","link":"https://www.preprints.org/manuscript/202407.1622/v1","date":1721400966000,"content":"Childhood nutrition is a cornerstone of long-term health, yet many children exhibit reluctance to consume healthy foods such as vegetables. This aversion can be influenced by various factors, including food neophobia and the sensory and visual appeal of the foods presented. Understanding how visual cues affect children's willingness behaviors can provide insights into effective strategies to enhance their dietary habits. This study aims to investigate the liking and emotional responses on the relationships between intrinsic and extrinsic cues and children's willingness to eat and to ask parents to buy. To understand how these factors influence children with food neophobia food-related behaviors and to identify effective strategies to promote healthier eating habits. A sample size consisting of 420 children recruited was needed in this cross-sectional study. A validated and reliable self-administered questionnaire was employed. Independent t-test and ANOVA were used to test the differences between gender and food neophobia means. Spearman correlations were used for correlation analysis. Hierarchical regression analyses were conducted to explore the relationships among intrinsic cues, extrinsic cues, and the mediating effect of liking and emotional responses. Attributes such as plate color and shape significantly influence children's food-related behaviors and their emotions. Liking and emotional responses significantly mediates the relationship between intrinsic/extrinsic cues and willingness. Positive visual cues experiences are crucial for increasing children's inclination to purchase and consume. Positive emotional responses enhance acceptance and purchase. There are significant differences between boys and girls. Boys prefer blue and triangular plates, while girls prefer pink plates and generate more positive emotions. Children with food neophobia will initially experience a disorder, but its negative effects can be mitigated by increasing sensory appeal and emotional engagement. By employing strategies designed to enhance visual cues and liking and emotions, children’s willingness to choose healthy eating habits can be effectively increased.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7af0af22415d6f5ca4263ef8c49e8e284aae2cdf3e8be7c82c7b7805b64e59e4","category":"Interdisciplinary"}