{"title":"Relax, Julian Alaphilippe is back","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/relax-julian-alaphilippe-is-back","date":1685983308000,"content":"\n      <p><span>As others grimaced around him and frantically lunged their bikes towards the line at the end of stage two of the </span>2023 <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/criterium-du-dauphine-all-you-need-to-know\">Critérium du Dauphiné</a>, Julian Alaphilippe set his mouth into a thin line, sat up, took his hands off the handlebars and waved up and down slowly. Calm down, he seemed to be signalling, I’m still here, I’ve still got it. He won the stage by two bike lengths in a style that was reminiscent of the Alaphilippe who ruled the cycling world a few seasons ago. The rider who took victory at the World Championships for two years in a row, who competed with such effortless style and panache, one wondered if his reign at the top would ever come to an end.</p>\n<div></div>\n<p><span>But in cycling, a sport that is perhaps more cruel than it is kind to its protagonists, winning streaks never continue forever. After a slightly lacklustre start to the 2022 season by his standards, it was in last year’s edition of Liège-Bastogne-Liège that Alaphilippe, literally, had a fall from grace. In a mass crash that took out almost half of the peloton on a dreaded day in the Ardennes, Alaphilippe hit the ground hard, suffering a broken shoulder blade, broken ribs and a collapsed lung as a result of the horror accident. Remco Evenepoel went on to win that race and Alaphilippe was left in a hospital bed with a long recovery ahead of him.</span></p>\n<p><span>He raced again over two months later in the 2022 French National Championships where he finished in 13th place. A few weeks later, quite spectacularly, </span><span>Alaphilippe</span> managed a win in a stage of the Tour de Wallonie. For the rest of last year, though, the French rider was quiet. Once on par with supertalents like Tadej Pogačar and Evenepoel, <span>Alaphilippe</span> was forced to watch them succeed as he struggled to make his mark on the remainder of the season. Even his own team manager began to sow seeds of doubt: would we ever see Julian Alaphilippe back at the top? Would he ever return to his showboating, swashbuckling best?</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg02_laporte_alaphilippe01_dauphine_2023_1024x1024.jpg?v=1685982108\" alt /><em>A</em></span><em><span>ttila Valter and Christophe Laporte (Jumbo-Visma) with Julian Alaphilippe (Soudal–Quick-Step) behind (Photo: James Startt)</span></em></p>\n<p><span>To the relief of many French fans, the opening of the 2023 season gave hints that the 30-year-old was nowhere near ready to bow out of professional cycling. He achieved career win number 40 when he outsprinted David Gaudu in a two-up sprint to claim victory in the Faun-Ardèche Classic in March, doing so in his usual, signature Alaphilippe style. It was back to the flamboyant pedalling technique which makes it look like he’s putting all his emotions into the bike, back to the dramatic pain faces and celebrations filled with bravado. </span></p>\n<p><span>If that win was a sign of things to come from Alaphilippe, his win today at the Critérium du Dauphiné was confirmation that the Soudal-Quick-Step rider is still every bit at the level to win against the best. </span><span>Alaphilippe</span> gave an exhibition in how to ride a cagey final sprint: he wasn’t visible in the peloton until the closing kilometres and then was able to freestyle on the wheels of other team’s lead out trains. With artistic flair he flitted from one side of the peloton to the other, not putting his nose into the wind for a second more than necessary, waiting patiently for others to do the work. It was like he just knew where to be with a tactical nous that other riders simply don’t possess.</p>\n<p><span>And, when it was finally time, Alaphilippe opened up his sprint. From a swarm of yellow Jumbo-Visma jerseys, he emerged in a flash of blue and it took just a few short, powerful pedal strokes to get a bike length ahead of everyone else. It was a finish executed with pure class. As he pedalled, the Frenchman made a few quick glances under his arm to check where his rivals were while they scrapped for the places behind him. Fundamentally, even with no lead out and no teammates around him, Alaphilippe made it look easy. His celebration at the finish said it all: you thought I was done? Relax.</span></p>\n<p><span>“I had good legs, I could see everyone was going full gas and the line was getting closer, and I timed my attack to perfection,” he said after the finish, calm and collected in his post-race interview.</span></p>\n<p><span>Alaphilippe’s victory today was not only an important one for him personally, but also for his team, Soudal–Quick-Step, who have suffered a rotten run of luck over the past few weeks as Covid-19 ripped through their <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> squad. Above that still, is the importance that Alaphilippe’s victory at the Dauphiné holds for his home nation. After Christophe Laporte’s win in yesterday’s stage, it is another French winner in a French race, by a rider who the French public hold dearly to their hearts; a fairytale finish indeed.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg02_alaphilippe04_dauphine_2023_1024x1024.jpg?v=1685982131\" alt /></span><em><span>Julian </span>Alaphilippe on the podium after winning stage two of the 2023 Critérium du Dauphiné (Image: James Startt)</em></p>\n<p><span>What’s more, Alaphilippe’s recent return to form helps to build excitement for the start of the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> in just a few weeks time. There is no other race as important as </span><i><span>La Grande Boucle</span></i><span> in the cycling world, and having a French rider take at least a couple of stage wins is almost as important to the organisers as it is to the riders themselves. After a season of doubting if he ever would, Alaphilippe looks to be ready to take up this mantle and contend for victories at the Tour. In fact, the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-route-all-about-the-mountains\">opening stages</a> seem to almost have been designed specifically with the Frenchman in mind.</span></p>\n<p><span>The Grand Départ in the Basque country sees steep climbs and punchy roads aplenty; just the sort of terrain where Alaphilippe is known to be able to make a difference. When he is on a good day, the 30-year-old can be almost unmatchable when he launches a daring attack as the gradients kick up. Whether it will be on the rolling roads around Bilbao on stage one, or on the series of climbs between Vitoria and Saint-Sebastien on stage two, the Critérium du Dauphiné has shown us that we should certainly expect to see Alaphilippe at the front of the Tour this year. He’ll be up against some stiffer competition than he’s facing in the Dauphiné currently with the likes of Pogačar and Mathieu van der Poel on the start list, but his dominant performance today is a clear sign that he is ready for it.</span></p>\n<p><span>There were many who doubted Loulou’s ability to get back to the level he’s currently riding at, but if there were questions over his form, the Frenchman has answered them in the best way possible today: with his legs. During the Classics this year, all talk was about the<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/breaking-into-the-big-three-how-mads-pedersen-made-a-difference-in-the-tour-of-flanders\"> Big Three dominating</a>, but is Alaphilippe edging his way back to make that the Big Four? </span></p>\n<p><span>Interviewers asked him what his victory at the </span>Dauphiné today meant for the Tour de France. \"Promising,\" he replied, with a smile.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7af385481f29f4dbd4f15a1af704fc33b7cd70afb1bec9d9dbf9602b019f109b","category":"Cycling"}