{"title":"Microsoft’s “Windows Subsystem for Android” sounds a lot like Chrome OS","link":"https://arstechnica.com/?p=1776088","date":1624655246000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/27-1-980x735.jpg\" /></div>\n        <p>\n          Little Android guy? How did you get in there?                      [credit:\n                        Ron Amadeo                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Microsoft's <a href=\"https://arstechnica.com/gadgets/2021/06/microsoft-details-windows-11-with-new-ui-and-android-app-support/\">Windows 11 announcement</a> surprised us with the news that the upcoming OS will run Android apps alongside Windows apps. Unfortunately, the keynote was light on details. Will these apps use emulation? Will Windows' existing Linux support be involved? We got our answers shortly after the keynote thanks to a follow-up <a href=\"https://www.youtube.com/watch?v=egZ82QGshX8\">developer talk</a> that dove into some details.</p>\n<p>The feature is officially called the \"Windows Subsystem for Android,\" which should tell you a lot about how the system works. Windows currently has a \"Windows Subsystem for Linux\" (WSL), which uses a subset of the Hyper-V functionality to run Linux apps on a real Linux kernel alongside your Windows apps. (Hyper-V lets a second guest OS access the bare metal hardware instead of running on top of the host OS with less access to resources.) Real Android phones use the Linux kernel, and Microsoft is building an Android framework on top WSL for the Windows Subsystem for Android. It sounds like we're basically getting x86 Android running on Hyper-V.</p>\n<p>Android apps under Windows should feel just like native Windows apps, with a top-level window, taskbar entry, and the ability to be pinned to the start menu. During the presentation, Microsoft said, \"Behind the scenes, we actually create a proxy native app that handles the bridge between the Android app model and the Windows app model.\" Presumably, that means providing things like a start menu shortcut, icons, entries in the app uninstall lists, and other minor Windows wrappings that will make the app feel native.</p></div><p><a href=\"https://arstechnica.com/?p=1776088#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1776088&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7af745e21fa467d1af3586608889597bd0c2e31f04f8668fcac5d63bbfd20656","category":"Tech"}