{"title":"Adsorptive Removal of Methylene Blue by Fe3O4/Fe2TiO5/TiO2 Nanocomposite Fabricated from Natural Ilmenite Sand","link":"https://www.preprints.org/manuscript/202409.2375/v1","date":1727692891000,"content":"A novel nanomaterial was synthesized using natural ilmenite sand via a simple precipitation method, and its ability to remove dyes in wastewater was evaluated using methylene blue (MB). The nanomaterial was synthesized by neutralizing the acid leachate obtained by Ilmenite sand digestion, followed by drying at 180 °C. It was characterized by X-ray diffractometry, Raman spectroscopy, transmission electron microscopy, scanning electron microscopy, X-ray photoelectron spectroscopy, X-ray fluorescence spectroscopy, and Brunauer, Emmett, and Teller surface area analyzer. Synthesized nanoparticles are a composite of Fe3O4/Fe2TiO5/TiO2 with a surface area of 292.18 m2/g pore size distribution with an average pore size of 1.53 nm and pore volume of 0.202 cc/g. The maximum adsorption capacity of 24.573 mg/g was obtained at pH 10 for 10 mg of the nanomaterial used with 10 mg/L MB. Dye concentration was varied in the range of 10-25 mg/L with 5 mg/L increment where equilibrium adsorption capacities of 24.573, 31.012, 41.443, and 52.259 mg/g were obtained with 10, 15, 20, and 25 mg/L, respectively. The adsorbent dosage varied as 10, 25, 45, 65, and 100 mg, and the highest adsorbent capacity of 24.573 mg/g was obtained with 10 mg of the adsorbent and 10 mg/L MB. Adsorption of MB followed pseudo-second-order kinetics with an adsorption capacity of 24.863 mg/g. The intraparticle diffusion model revealed that the MB adsorb in three different stages, and corresponding intra-particle diffusion constants of 1.50, 2.71, 3.38, and 4.41 g/mg min1/2 were calculated with the above dye concentrations. Adsorption followed the Langmuir isotherm model. Thermodynamics parameters ΔG, ΔH, and ΔS were calculated to be -27.5521 kJ/mol at 298 K, 2.571 kJ/mol, and 0.101 kJ/mol, respectively, in the experiments carried out varying the temperature. Regeneration studies of the adsorbent were carried out for five cycles, indicating some activity loss after each cycle.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7b0473cb66482e252aed508c97e41fd1e61b94040ea9034b367f69141a96fee4","category":"Interdisciplinary"}