{"title":"Optimization of computational intelligence approach for the prediction of glutinous rice dehydration","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13445?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Five computational intelligence approaches, namely Gaussian process regression (GPR), artificial neural network (ANN), decision tree (DT), ensemble of trees (EoT) and support vector machine (SVM), were used to describe the evolution of moisture during the dehydration process of glutinous rice. The hyperparameters of the models were optimized with three strategies: Bayesian optimization, grid search and random search. To understand the parameters that facilitate intelligence model adaptation to the dehydration process, global sensitivity analysis (GSA) was used to compute the impact of the input variables on the model output.</p>\n<h2>RESULT</h2>\n<p>The result shows that the optimum computational intelligence techniques include the 3-9-1 topology trained with Bayesian regulation function for ANN, Gaussian kernel function for SVM, Matérn covariance function combined with zero mean function for GPR, boosting method for EoT and 4 minimum leaf size for DT. GPR has the highest performance with <i>R</i>\n<sup>2</sup> of 100% and 99.71% during calibration and testing of the model, respectively. GSA reveals that all the models significantly rely on the variation in time as the main factor that affects the model outputs.</p>\n<h2>CONCLUSION</h2>\n<p>Therefore, the computational intelligence models, especially GPR, can be applied for an effective description of moisture evolution during small-scale and industrial dehydration of glutinous rice. © 2024 Society of Chemical Industry.</p>","author":"Kabiru Ayobami Jimoh, \nNorhashila Hashim, \nRosnah Shamsudin, \nHasfalina Che Man, \nMahirah Jahari","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7b0f4d3e1580c629d9d4c885309083d1eb479d24076a1b81f441b1c5c5bda1ad","category":"Environment"}