{"title":"Changing the polyphenol composition and enhancing the enzyme activity of sorghum grain by solid‐state fermentation with different microbial strains","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13454?af=R","date":1709990940000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Solid-state fermentation (SSF) has been widely used in the processing of sorghum grain (SG) because it can produce sensory improved products. To clarify the influence of different microbial strains on the SSF of SG, especially on the polyphenols content and composition, <i>Lactiplantibacillus plantarum</i>, <i>Saccharomyces cerevisiae</i>, <i>Rhizopus oryzae</i>, <i>Aspergillus oryzae,</i> and <i>Neurospora sitophila</i> were used separately and together for SSF of SG. Furthermore, relationship between the dynamic changes of polyphenols and the enzyme activitiy closely related to the metabolism of polyphenols has also been measured and analyzed. Microstructural changes observed after SSF provide a visual representation of the SSF on the SG.</p>\n<h2>Results</h2>\n<p>After SSF, tannin content (TC) and free phenolic content (FPC) were decreased by 56.36% and 23.48%, respectively. Polyphenol oxidase, <i>β</i>-glucosidase and cellulase activities were increased 5.25-, 3.27-, and 45.57 times, respectively. TC and FPC were negatively correlated with cellulase activity. A positive correlation between FPC and xylanase activity after 30 h SSF became negative after 48 h SSF. The SG surface was fragmented and porous, reducing the blocking effect of cortex.</p>\n<h2>Conclusion</h2>\n<p>Cellulase played crucial role in in promoting the degradation of tannin (anti-nutrient) and phenolic compounds. Xylanase continued to release flavonoids while microbial metabolism consumed them with the extension of SSF time. SSF is an effective way to improve the bioactivity and processing characteristic of SG.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Duqin Zhang, \nQi Wang, \nZhijiang Li, \nZhujiang Shen, \nBin Tan, \nXiaotong Zhai","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7b13f702239e6dd1abe950c468241ad9e6a2bd68956dd33ff016bb90b8d1ec41","category":"Environment"}