{"title":"Dietary Supplementation with Hydrolyzable Tannin Improves Nonspecific Immune Responses, Intestinal Morphology, and Disease Resistance against Vibrio alginolyticus in Whiteleg Shrimp","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/3486022?af=R","date":1710313200000,"content":"<p>This research aimed to evaluate the impact of hydrolyzable tannin on immune responses, intestinal morphology, and resistance to <i>Vibrio alginolyticus</i> in whiteleg shrimp (<i>Penaeus vannamei</i>). In preliminary <i>in vitro</i> experiments, shrimp hemocytes were exposed to different concentrations of hydrolyzable tannin. The findings indicated that hydrolyzable tannin exhibited nontoxic characteristics and could stimulate respiratory burst activity. For the subsequent <i>in vivo</i> trial, shrimp (11.83 ± 0.98 g) were subjected to a 28-day oral administration of diets containing diverse hydrolyzable tannin concentrations (0, 1, 2, 4, and 8 g/kg denoted as control, T1, T2, T4, and T8, respectively). Immune parameters, antimicrobial peptide genes, and intestinal morphology were measured. Significant enhancements were observed in total hemocyte count (THC), phagocytic activity, respiratory burst activity, and phenoloxidase activity (PO) across all treatment groups compared to the control group, particularly in T2 and T4 groups (<i>p</i> &lt; 0.05). The gene expressions of Penaeidin-2, Penaeidin-3, Penaeidin-4, crustin, and lysozyme were markedly higher in the treatment groups, especially in T2 (<i>p</i> &lt; 0.05). Additionally, hydrolyzable tannin contributed to increased intestinal wall thickness after the 28-day feeding trial (<i>p</i>  &lt; 0.05). In a separate challenge experiment, shrimps (11.36 ± 0.66 g) were exposed to <i>V. alginolyticus</i> after 7 days of culture. Notably, T2 and T4 exhibited enhanced resistance, resulting in survival rates of 66.67% and 69.70%, respectively. To conclude, administering 4 g of hydrolyzable tannin per kilogram of feed proved effective in enhancing nonspecific immune responses, improving intestinal morphology, and augmenting resistance to <i>V. alginolyticus</i> in whiteleg shrimp.</p>","author":"Huai-Ting Huang, \nYeh-Fang Hu, \nZhen-Hao Liao, \nYu-Ru Lin, \nYin-Yu Chen, \nYung-Chih Wang, \nJui-Jen Chang, \nFan-Hua Nan, \nDaniel L. Merrifield","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"7b1544d0027db7163b486cbbe8c79f7fc281afe7ce23fddf49173ad067778abb","category":"Environment"}