{"title":"Synthesis of cationic liposome nanoparticles using a thin film dispersed hydration and extrusion method","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300467","date":1712671200000,"content":"<p>by Alessandro Cazzolla, Julie Rose Mae Mondala, Janith Wanigasekara, Joanna Carroll, Noah Daly, Brijesh Tiwari, Alan Casey, James F. Curtin</p>\r\n\r\nLiposome nanoparticles can carry a wide range of therapeutic molecules including small molecules and nucleic acid-based therapeutics. Potential benefits include translocation across physiological barriers, reduced systemic toxicity, and enhanced pharmacokinetic parameters such as absorption, distribution, selective release and optimal elimination kinetics. Liposome nanoparticles can be generated with a wide range of natural and synthetic lipid-based molecules that confer desirable properties depending on the desired therapeutic application Nel et al (2023), Large (2021), Elkhoury (2020). This protocol article seeks to detail the procedures involved in the production of cationic liposomes using thin-film dispersed hydration method with an estimated uniform size of 60–70 nm for targeted drug administration in tumor cells, by modifying the previous one also published by the same authors cited here. The method was carrying out using N-[1-(2,3-dioleoyloxy)propyl]-N,N,N-trimethylammonium methyl (DOTAP, 2 mg) as cationic lipid and cholesterol (0.5 mg) in a molar ratio of 7:3 respectively. The liposomal suspension was obtained and its physical, chemical and biological properties were determined. A two-step extrusion process, using 100 nm and 50 nm polycarbonate membranes, was carried. The results demonstrate generation of liposome nanoparticles with a size of 60–70 nm stable for at least 16 weeks and with an encapsulation efficiency of approximately 81% using Doxorubicin.","author":"Alessandro Cazzolla","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7b16e98addfd0f61a9e216023fcee6bd87d6b360a82d7aae072e39f8b32dc27a","category":"Interdisciplinary"}