{"title":"The prevalence of internalized stigma and its association with HIV viral suppression among fully disclosed adolescents and young adults living with HIV (AYLHIV) receiving HIV care in an HIV clinic in Plateau State, Nigeria","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303360","date":1715608800000,"content":"<p>by Emmanuel O. Osayi, Oluseye Ajayi, John Onyeji, Mercy Isichei, Atiene S. Sagay, Albert Anderson</p>\r\n\r\nInternalized stigma, a condition characterized by negative self-stereotyping and social alienation, recently impacted the adolescents and young adults living with HIV (AYLHIV) epidemic curve and treatment adherence. While prior research has focused on the impact of internalized stigma among adults living with HIV, few studies focused on this AYLHIV. The study aims to determine internalized stigma proportion and its relationship to HIV viral suppression in AYLHIV. A cross-sectional study involved 93 fully disclosed AYLHIV receiving HIV care in Faith Alive Foundation in Jos North, Plateau State, from January to March 2023. Internalized stigma was measured using the adapted Berger HIV Stigma Scale under the domains personalized stigma (18 item questions) and negative self-image subscales (13 item questions), measured on a 4-scale of strongly disagree (1), disagree (2), agree (3), and strongly agree (4). Scores summed up to give the domain composite score with a maximum obtainable score of 72 for personalized stigma and 52 for negative self-image. A total of 93 respondents, female-63 (68%) and male-30 (32%), were involved in the study and their mean age at full disclosure was 15.7 ± 2.8 years. During the study their mean age was 19.5 ± 5.4 years, with 62% (58) ages 10–19 years and 38% (35) ages 20–26 years. Furthermore, 70% of the participants had secondary educational status, 77% had viral load results &lt;1000 copies/ml), and 57% were on ART for up to 6 years. The average scores for personalized and negative self-image were 36.3 and 28.9, with 53% (49/93) and 52% (48/93) scoring higher than the average respectively. Further subclassification of the participants by the presence of internalized stigma domains reported 62% (58/93) with both domains, 20% (19/93) with at least one domain, and 38% (35/93) with none of the domains. Negative self-image stigma was reported more among participants 10–19 years (63%), male (31%), of secondary educational level (71%), virally unsuppressed (23%), and ≤ 6 years on ART (42%). On the other hand, personalized stigma was more among the female participants (73%), ages 20–29 years (41%), educational level (6% and 27% had primary and tertiary level of education respectively), virally suppressed (80%), and up to 6 years on ART (63%). The correlation between the internalized stigma domains and suppressed viral load using a binary multivariate regression method at 95% CI and a p-value of 0.05 was not statistically significant with personalized stigma (<i>p</i> = 0.73) and negative self-image (<i>p</i> = 0.92). The adjusted odds ratio of having internalized stigma among the virally suppressed were personalized stigmas [OR; 1.21, 95% CI; 0.42–3.47] and that of negative self-image [OR; 1.06, 95% CI; 0.38–2.95]. This study showed a high proportion of internalized stigma among females, ages 10–19 years, and virally suppressed with more odds for personalized stigma domain. However, the study reported no statistically significant association between internalized stigma domains and viral suppression.","author":"Emmanuel O. Osayi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7b2fa8d8f74436e2b7cab60213564ac36a83e0e2d1a5a079cedd741310d0b1b7","category":"Interdisciplinary"}