{"title":"Garmin Forerunner 55 In-Depth Review","link":"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html","date":1622631600000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5080.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5080_thumb.jpg\" /></a></p>\n<p>Alongside today’s announcement of the new Forerunner 945 LTE, Garmin has also refreshed its least expensive running watch – the Forerunner 55. This watch is aimed at folks that don’t need all the fancier features of a higher-end Forerunner 245, 745, or 945 series – but still want the core of the run tracking. Of course, as each successive series comes out, these so-called basic running watches get more and more features that ultimately make them far more feature-capable than the last iteration of the mid-range watches.</p>\n<p>The Forerunner 55 has gained the majority of the features that came to the FR245 last time around, including running track mode (for perfect GPS lines at the track), daily suggested workouts, women’s health tracking, PacePro (this is huge), Recovery Time, now full Connect IQ support, and plenty more. Seriously, it’s almost a mini-FR245 now. Except $100 cheaper. True, the FR245 does have a handful of performance-oriented features, but very few unique ones remain at this point.</p>\n<p>I’ve been using the Forerunner 55 for a number of weeks now on workouts and 24×7 wear. Additionally, my wife has also used the FR55 on a number of her workouts too. So I’ve got a pretty good feel on how well the FR55 works, and where its quirks are.</p>\n<p>Note that for this review I’m using a media loaner from Garmin. Once this review is done, I’ll get it boxed back up and sent back to them. After which I’ll likely go out and buy my own for future use. If you found this review useful, you can use the links at the bottom, or consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s get into it.</p>\n<h3><span>What’s New:</span></h3>\n<p></p>\n<p>While all the attention today is on the new LTE capabilities of the just-launched FR945 LTE, the real attention should be on the FR55 and the slate of new features it gets. None of these are ‘new’ to Garmin, but rather, new to this price point. For runners, getting PacePro and Track Run mode specifically are huge. Let alone the Recovery Time and Daily Suggested Workouts. It’s impressive.</p>\n<p>Here’s the full bulleted list of changes:</p>\n<p>– Added PacePro (dynamic course-based pacing for races)<br />\n– Added Daily Suggested Workouts (basically gives you custom running workouts each day based on training/recovery)<br />\n– Added Track mode (makes perfect track workout GPS maps, as well as perfect distance/pacing)<br />\n– Added Virtual Run mode (used on treadmills, to broadcast your pace/heart rate via Bluetooth &amp; ANT+)<br />\n– Added Finish Time Estimator (predicts finish for a given distance)<br />\n– Added Predicated Race Times (shows 5K/10K/Half-marathon/Marathon times based on performance)<br />\n– Added Women’s Health Tracking (allows on-watch entry/tracking for menstrual cycle and pregnancy)<br />\n– Added Recovery Time (hours)<br />\n– Added more sport modes including pool swimming and HIIT<br />\n– Added Connect IQ support for data fields, widgets, and apps (previously only had CIQ watch faces)<br />\n– Added 24×7 respiration rate tracking and widget (outside of workouts)<br />\n– Added customizable lap banners<br />\n– Added customizable auto pause thresholds<br />\n– Switched to widget glances, versus full size widgets (now matching other Garmin watches)<br />\n– Increased standby battery life from 1 to 2 weeks in smartwatch mode<br />\n– Increased GPS battery life from 13 hours to 20 hours<br />\n– Increased from 3 data fields to 4 data fields per page, plus two more custom pages (and you can customize defaults)<br />\n– No more 45/45S split-size differentiator, just one size (42mm with the same 26mm screen).<br />\n– Price remains same at $199USD</p>\n<p>There’s so many big-ticket items in here. PacePro and Track Mode are huge for many runners, but things like Connect IQ data fields means you can use this with Stryd for example, for running power. And then beyond that, every day I use the watch I find all sorts of tiny little features that have changed, things that were rolled down from the FR245, but also from the FR745/945 too. Mostly minor menu option type stuff, but for someone out there, this will be *THE* feature that pushes them over the edge. For others, they won’t care. I’m sure there’s plenty more I haven’t found or realized yet, so I’ll add them above as I spot them.</p>\n<p>Note the FR55 is available in black, white, or aqua. As you’ve probably deduced by now, the version you see in this review is aqua. And yes, this 6’2” very male frame has been rockin’ that in public the last few weeks. Look, after wearing <a href=\"https://www.dcrainmaker.com/2021/01/garmin-lily-fitness-smartwatch.html\">that small purple Lily watch</a>, it’s gonna be hard to phase me.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Forerunner-55-Family-image.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Forerunner-55-Family-image_thumb.png\" /></a></p>\n<p>With that, let’s start using it.</p>\n<h3><span>The Basics:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5037.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5037_thumb.jpg\" /></a></p>\n<p>To begin, the FR55 differs from something like the Venu or Vivoactive series in that it’s got plenty of buttons, as opposed to a touchscreen. There’s no touchscreen here – and frankly, I’m totally good with that. Easier access to quickly iterate through menus or options while on the run. There’s two buttons on the right, and three more on the left. They do as they’re labeled, allowing you to confirm/escape/up/down/light easily.</p>\n<p>That said, if I were to have one complaint about the Forerunner 55 it’s that the display is feeling a bit aged these days. Sure, by itself you probably wouldn’t notice, but when you’re testing side by side the Forerunner 745 or 945LTE, you can easily see the pixilation on the numbers, and it just feels like it’s one iteration overdue for a refresh. The smaller digits just feel 1990’s. I get that Garmin makes the trade-off here in bringing this price point lower by using cheaper displays, but it’s time Garmin, it’s time.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_4999.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_4999_thumb.jpg\" /></a></p>\n<p>Still, despite my disappointment with the screen, the watch functions perfectly fine and viewable as a sport watch, even if a touch slow in occasional non-time-sensitive places (like the final saving of a run). There’s never any issues with readability or clarity, because they aren’t having to make brightness tradeoffs here to save battery power. Also, the screen is always-on, all the time. Again, no battery tradeoffs to make.</p>\n<p>When it comes to watch faces, you can tweak a number of the stock watch faces on the unit itself, customizing some of the data on the screen. Or, you can simply download any of the gazillions of watch faces from Garmin Connect IQ (their app platform), all of which are free.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image001-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image001_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0014-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0014_thumb-1.png\" /></a></p>\n<p>Or, you can even customize a watch-face with your own photos of friends or kittens or whatever the case may be. Your choice.</p>\n<p>While the Forerunner 45 had Connect IQ watch face support, the Forerunner 55 extends that to other Connect IQ app types, including data fields, apps, and widgets. In fact, later in the sport section I hook up the Stryd running power meter Connect IQ data field to show that. Note that if you’re reading this today, it can sometimes take a bit of time (days to weeks) for developers to validate their apps are valid on a given watch. This is one area where Garmin really needs to re-think how this works (for all watches), as many times developers don’t come back and check-off new watches as compatible, even if they’re entirely compatible and it’s just a minor model-name shift. Just in the same way Apple doesn’t require app developers re-validate apps are compatible for every new phone the day its released – instead, it’s based on the underlying markers.</p>\n<p>In any event, geekiness aside, let’s talk some of the basics of data tracking. First up is that as we scroll down in the menus we’ve got widgets – or rather, widget glances. These are smaller glanceable snippets than the full size widgets in the past. And then if you want more data you can tap into them to expand them.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5020.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5020_thumb.jpg\" /></a></p>\n<p>If we crack open the steps tracked one for example, we’ll see that the user interface is changed – now matching that of the recently released Garmin <a href=\"https://www.dcrainmaker.com/2021/04/garmin-venu2-venu2s-smartwatch-review.html\">Venu 2/2S, which is a much cleaner and more stylized look</a>. You can tap to see details like steps over the last week (distance or straight steps):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5021.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5021_thumb.jpg\" /></a></p>\n<p>And then all of this data is of course synced to Garmin Connect via your phone (or, computer if you plug it in). So on Garmin Connect Mobile (that’s the phone app) you’ll get the same data, but you can slice and dice it a gazillion ways, looking at more the analytics side of it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0018-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0018_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00110.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00110_thumb.png\" /></a></p>\n<p>The majority of the default widgets are health and fitness related, including areas like body battery, heart rate, and your daily workouts. All of them have been revamped. Here’s the heart rate one, first showing me my current heart rate, and trend over the last 4 hours. And then I can tap to see my resting heart rate trends over the last 7 days. Note this is not your sleeping resting HR (that’s separate), but your awake resting heart rate.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00112.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00112_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00114.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00114_thumb.png\" /></a></p>\n<p>Meanwhile, Body Battery helps track your energy levels throughout the day, plotted against stress as well if you want. Think of this like old-school Street Fighter style energy. As you sleep or relax on a couch, your energy levels go up. But as you do thinks like workout or a stressful presentation, they go down. Generally it takes a week or two for this to stabilize after you first start wearing the watch, but I find it a fairly good proxy in most cases. Places where it usually goes a bit askew are if you pull an all-nighter, or other ‘WTF’ type moments.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5017.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5017_thumb.jpg\" /></a></p>\n<p>And again, all of this is trackable on Garmin Connect Mobile as well:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00116.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00116_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00118.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00118_thumb.png\" /></a></p>\n<p>All of these heart rate driven functions use the Garmin Elevate V3 heart rate sensor on the bottom. This isn’t quite the newest sensor that was recently launched on the Venu 2/2S (and the FR945LTE), but is still a perfectly fine sensor. Garmin doesn’t enable PulseOx on the FR55, so you won’t get blood oxygen levels with this watch, though, at the moment I’m not sure that’s a huge loss. In any case, you can see the green LED’s below, which shine into your skin and then measure your heart rate:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5155.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5155_thumb.jpg\" /></a></p>\n<p>The optical sensor is on 24×7 to measure and record your resting heart rate. Then in workout mode more power is supplied to it, to handle the challenges of tracking your body bouncing around. We’ll get into that later in the review.</p>\n<p>From a sleep tracking standpoint, the FR55 will track your sleep at night without any button-pushing. It simply does it automatically. Note that no Garmin devices track naps however. Now you’ll get credit for those naps in Body Battery, but not in sleep tracking. Also of note is that the FR55 doesn’t have any on-device sleep widget. For those curious, I checked with Garmin and behind the scenes the device is using the older non-Firstbeat algorithms for sleep. Again, for most people that won’t have any meaningful impact one way or the other, however, the lack of an on-device sleep widget to check your sleep is a bummer (and something Polar has at this price point). Otherwise, you simply need to crack open the Garmin Connect Mobile app:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00120.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00120_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00122.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00122_thumb.png\" /></a></p>\n<p>One widget not shown by default, but that is tracked by default is respiration rate, or your breathing rate. Over the last year some people have used this as a leading indicator for whether or not you may be getting sick. There’s fair evidence to support that (be it COVID or otherwise). Like many metrics, it’s something you can use to do further digging, but don’t consider it the only data point. This is shown both as a widget on the watch (if you enable it), but also on Garmin Connect mobile as well.</p>\n<p>Shifting away from health and fitness widgets, there is the ability to see smartphone notifications (as well as calendar appoints, which I show in the gallery up earlier). For smartphone notifications you can simply read the contents of them and dismiss them, there isn’t the ability to type out a response (textual or verbally). You can also iterate through ones you may have missed too.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5025.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5025_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5026.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5026_thumb.jpg\" /></a></p>\n<p>You can disable this, or limit it to non-workout times if you’d like. The feature utilizes your existing smartphone notification settings, so however you have those set for your phone itself, will carry through here.</p>\n<p>Finally, from a battery standpoint, the FR55 claims two weeks of battery life in standby mode. In doing some casual observations of daily battery burn (with roughly an hour each day of GPS time), I’m not getting anything unexpected there. But I haven’t done a super-deep dive into exact battery specifics for smartwatch mode. However, within the sport section I dive more into the battery specs for GPS-on time, and how those hold up battery-wise, using actual data from the workout files themselves.</p>\n<p>With that, let’s dive deeper into the sports usage.</p>\n<h3><span>Sport Features:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/P1022521.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/P1022521_thumb.jpg\" /></a></p>\n<p>As always, the reason you buy a Garmin watch over any of the more general-purpose watches is for sports usage. And the FR55 piles in a boatload of ‘new’ sport features. Or at least, new to this product line. Everything here has been seen elsewhere in Garmin’s higher-up watches, but never at this price point. The main new sport-specific features include:</p>\n<p>– Added PacePro (dynamic course-based pacing for races)<br />\n– Added Daily Suggested Workouts (basically gives you custom running workouts each day based on training/recovery)<br />\n– Added Track mode (makes perfect track workout GPS maps, as well as perfect distance/pacing)<br />\n– Added Virtual Run mode (used on treadmills, to broadcast your pace/heart rate via Bluetooth &amp; ANT+)<br />\n– Added Finish Time Estimator (predicts finish for a given distance)<br />\n– Added Race Time Predictor (using past performance)<br />\n– Added Recovery Hours (looking at recent workouts and other data)<br />\n– Added more sport modes including pool swimming and HIIT<br />\n– Added Connect IQ Data Field Support (useful for apps like Stryd and others)</p>\n<p>I’m going to talk through most of these in this section, plus just regular sport mode usage. Yes, you can still just go for a run, or to the gym – and it tracks that normally just fine. Or, you can get fancy. Your choice.</p>\n<p>To access the sport menu, simply hit the top right button, which brings up a list of sports:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5156.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5156_thumb.jpg\" /></a></p>\n<p>There’s roughly 18 sports to choose from on the FR55, specifically: Run, Virtual Run, Treadmill, Track Run, Bike, Walk, Bike Indoor, Cardio, Indoor Track, Walk Indoor, Pool Swim, Yoga, Elliptical, HIIT, Stair Stepper, Pilates, Breathwork, and Other. Other being the catch-all anything-bucket for things like Cow Tipping and Couch Surfing.</p>\n<p>Once you choose a sport mode, if GPS-based, it’ll start looking for GPS as well as ensuring your optical HR sensor is all happy and reading.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5159.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5159_thumb.jpg\" /></a></p>\n<p>It’s here you can load up different training plans, workouts, and configure various run settings too. Also, if you have any sensors paired, these will light-up. From a sensor standpoint the FR55 is fairly basic, but it does support external ANT+ &amp; Bluetooth heart rate sensors (such as a chest strap), as well as ANT+ &amp; Bluetooth Smart cycling cadence sensors, speed sensors, and combo speed/cadence sensors.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5160.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5160_thumb.jpg\" /></a></p>\n<p>I tested this with an indoor trainer ride, allowing me to get cadence into the watch itself. There’s no direct power meter support here, but you could technically use the same 3rd party Connect IQ power meter data field on the Forerunner 55 to pair up to a power meter if you wanted to – with the (minor, depending on your point of view) caveats noted in the post.</p>\n<p>Note that you can enable broadcasting of your heart rate, however, that’s only (still, inexplicably) over ANT+ if you use the normal ‘Broadcast HR’ option. That works perfectly fine for some apps, or a Peloton Bike – as they can support ANT+. But if you’re on iOS (such as an iPhone/iPad) and want to connect an app there for your Garmin HR, you won’t be able to do it. At least not directly. Instead, you can scoot around that with the ‘Virtual Run’ profile, which will then show the HR over Bluetooth. Still, c’mon Garmin, it’s 2021 – just make this easy for people (Garmin says this is coming however). Below, you can see me using just the BT heart rate broadcast with Zwift, in cycling mode.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5162.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5162_thumb.jpg\" /></a></p>\n<p>Though, if you want to do a treadmill workout, then the Virtual run profile is indeed ideal, as it’ll your broadcast pace/HR/cadence to apps:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00126.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00126_thumb.png\" /></a></p>\n<p>Now, if you want to load up a training plan/workout/PacePro plan, you’ll hold the middle left button down. It’s here you can do a one-off interval session (customizable on the watch itself), under ‘Intervals’. You can customize the Interval duration based on distance, time, or lap button (open), as well as the number of repeats and rest duration/distance/lap, plus if you want to add a warm-up or cool-down.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5164.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5163_thumb.jpg\" /> <img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5164_thumb.jpg\" /></a></p>\n<p>In this same menu you can load up a PacePro Plan, which allows you to pace a given race. This can be done on a specific race course, which then accounts for the terrain. The idea is that you tell Garmin your desired finish time/pace, and it figures out the best way to pace each mile/KM of that course. You can also customize positive or negative splits accordingly, using Garmin Connect Mobile.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00128.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00128_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00130.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00130_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00132.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00132_thumb.png\" /></a></p>\n<p>After that’s done, you push it to the watch, and you can load it up and go off and pace the race (or, just a training day):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5166.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5166_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5167.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5167_thumb.jpg\" /></a></p>\n<p>Then there’s Estimated Finish Time. This one is super simple. You tell it how far you’re gonna run, with some pre-defined quick-access options (or, you can just use a custom distance), and it’ll figure out how much suffering you have till you finish.</p>\n<p>x<a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5172.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5172_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image001-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image001_thumb-1.jpg\" /></a></p>\n<p>Finally, on this never-ending journey of workout options, there’s also Daily Suggested Workouts, for running. This will actually show the second you tap the Run menu option, and give you a custom workout for the day:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5173.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5173_thumb.jpg\" /></a></p>\n<p>These workouts are based on your recent training, as well as recovery status. Generally speaking, it’ll take a week or two for this to stabilize, but even within that time period it’s pretty good. Some workouts are more complex, and some are simple (like, run X time at Y intensity).</p>\n<p>In addition, you can also download plans from Garmin (also free) for various distances.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/2021-04-21-11.57.48.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/2021-04-21-11.57.48_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/2021-04-21-11.58.01.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/2021-04-21-11.58.01_thumb.jpg\" /></a></p>\n<p>One minor point to mention is that the FR55 is clearly a run-focused watch, and thus doesn’t have all the fancier strength and core type structured workouts with animated step-by-step instructions like the Venu or Vivoactive 4 series. So if that’s something you really want, then you’ll need to probably look at that (or higher) lineup instead.</p>\n<p>When it comes to data field/page customization, this gets more flexibility than the FR45 did. You’ve now got up to 4 data fields per page, and up to 4 customizable pages, plus the heart rate zone, workout, and time data pages.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5176.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5176_thumb.jpg\" /></a></p>\n<p>You don’t get quite as many fields as some of the higher-end watches, but you do get to choose from: Timer, Distance, Pace, Speed, Calories, Heart Rate, HR Zone, Average HR, Lap Time, Lap Distance, Lap Pace, Lap Speed, Average Pace, Average Speed, Cadence, Steps, Time of Day, and your Connect IQ Fields.</p>\n<p>Note the fields do vary a bit based on sport, so the ones above are just an example from the run data fields.</p>\n<p>Also, because this section is already so long and we haven’t even started running yet, note that there’s auto-lap if you want it, which is configurable by distance (not time). There’s also the new lap banner customization, which means you can customize what’s shown on the lap banner when you hit the lap button (or, it hits it). There’s also auto pause, which is off by default, but can be enabled to automatically pause the timer when you stop. And, new to the FR55 s the ability to customize this threshold as well (the FR45 didn’t have that). Also, the GPS options are in here as well, where you can toggle between the aforementioned GPS modes (GPS/GLONASS/GALILEO).</p>\n<p>Now, in the event you’ve selected to do a Track Run (by selecting that in the sport profiles), a couple of quick notables. The Track Run option is newish to Garmin, and came out late last summer, and has since been expanded now to all of Garmin’s running-focused watches, with the FR55 being the last tier to get it. The main thing that the Track Run profile does is make perfectly accurate GPS tracks of your running around that oval. It does this first by learning the track. The first time you go to a new track, it’ll take a couple of loops around the track to learn it. Ensure that you’re recording during this time. Personally, I then save the workout after 2-3 laps, and start a new one. Again, just for the first time I’ve gone to a given track – it’ll remember that track from here on out.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-19.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-19.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/image-20.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-20.png\" /></a></p>\n<p>Note that you’ll want to ensure the lane number matches the lane that you’re running in. This is shown in the “Track Run” settings, and is because each lane is significantly different in length, especially over a longer workout.</p>\n<p>Aside from pretty track loops on Strava, it also gives you far more consistent pacing. This is because it knows exactly where you are on the track, and effectively snaps your pacing and distance to it. Note that on the FR55 (as compared to some of Garmin’s higher-end watches), in Track Mode it’ll lock your lap pace to :05 second increments. So if you’re pacing at 5:05/KM (or mile) and slow down ever so slightly, it won’t show 5:06 or 5:07, it’ll show 5:10. Not a huge deal for many, but something to be aware of.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-21.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-21.png\" /></a></p>\n<p>Another benefit of track mode is that for the most part if you press the button pretty close to the line, you’ll end up with perfect interval distances (e.g. 400m, 800m, 200m, etc). There are rare cases where it’s not perfect (like showing 410m, and this is where I wish Garmin would take the Wahoo RIVAL approach of being a bit more ‘inclusive’ and snapping anything +/-25m to the 100m marker (so 417m becomes 400m), since nobody means to hit the lap button at 417m, they clearly just were late (or, the algorithm slightly off).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-22.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-22.png\" /></a></p>\n<p>Once you’re done with the workout, you’ll see that your GPS track is virtually perfect:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00124.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00124_thumb.png\" /></a></p>\n<p>Now, for fun, here’s what it looks like on those first 2-3 calibration loops, you can see it’s not quite perfect (though very close), and then creeps in closer.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/IMG_3988.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/IMG_3988_thumb.png\" /></a></p>\n<p>Changing topics slightly, the FR55 has the ability to do LiveTrack during a workout, which broadcasts your current position and previous track to friends and family. They’ll receive an e-mail alert, which then allows them to click on a link and follow your progress. Note that this does require you to take your phone with you. Unlike the new FR945LTE, this doesn’t have cellular capabilities built into it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5178.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5178_thumb.jpg\" /></a></p>\n<p>Ultimately, no matter whether you’re doing a regular run or a track mode run, you’ll hopefully end the workout eventually. And when you do, you’ll get a handful of data pages with overview data. Note that you don’t actually get a lot of data here. For example, the summary page is kinda disappointing:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00111.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00111_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00113.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00113_thumb.jpg\" /></a></p>\n<p>It only shows what you see above plus cadence and calories. That’s it. Also, for some reason it takes forever to load. Garmin is digging into why that’s happening to me.</p>\n<p>You can though tap to see your HR zone breakout, and lap splits:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00115.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00115_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00117.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00117_thumb.jpg\" /></a></p>\n<p>Of course, all of this data ends up on Garmin Connect Mobile (and the web too), and you get far more data there. Here’s the summary from a recent interval workout in the forest:</p>\n\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo1\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO1-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo2\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO2-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo3\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO3-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo5\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO5-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo6\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO6-200x132.png\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/06/garmin-forerunner-55-depth-review.html/fr55wo7\"><img src=\"https://media.dcrainmaker.com/images/2021/06/FR55WO7-200x132.png\" /></a>\n\n<p>And then this same information up on Garmin Connect Web too (for desktop access)</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb.png\" /></a></p>\n<p>Further, if you’ve connected Strava, MyFitnessPal, TrainingPeaks, or any other sites, all of those will receive a copy of your workout instantly as well.</p>\n<p>Now, one last new feature is the recovery time. This is the first time we’ve seen recovery time on the lowest-end Garmin watch, and it’s the same algorithm as seen on the higher-end watches. It essentially looks at the workout and a slew of other metrics to determine your recovery time. That time is available immediately following a workout, as well as via the VO2Max/Performance widget. Note that this is specifically ‘Recovery time till the next hard workout’, not just any ole’ normal workout:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00119.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00119_thumb.jpg\" /></a></p>\n<p>The one last thing I want to touch on in the sports section is Garmin’s Incident Detection and Assistance features. Both features are safety-focused and have two slightly different purposes, and roughly build atop the LiveTrack features I mentioned earlier:</p>\n<p><strong>Incident Detection:</strong> This will automatically detect an incident while running/cycling (in a workout specifically), and notifies your predefined contacts with a text message and a LiveTrack link to see exactly where you are.</p>\n<p><strong>Safety Assistance:</strong> This allows you to, with one button, send a predefined message to emergency contacts with your initial location, followed by a live tracking link. The main scenario here being you feel unsafe and want someone to be aware of that.</p>\n<p>Both of these features depend on you having your phone with you. Since the Forerunner 55 doesn’t have cellular in it, you need to be within range of your phone. Both features can be cancelled in the event they’re triggered accidentally. And both features are set up on Garmin Connect Mobile first. It’s here you define emergency contacts.</p>\n<p>Once that’s done, the crash detection will occur while cycling or running during a workout. Essentially, Garmin is looking for forward speed, followed by a significant stopping accelerometer event – and then critically – no further forward progress. Meaning, if you were running along and jumped down a big ledge and kept running, that wouldn’t trigger it, since you continued going. Whereas if you were running, jumped off the ledge, and then face-planted, that would likely trigger it since you ceased making forward progress.</p>\n<p>Note that Garmin isn’t notifying emergency services with the FR55. Instead, they’re notifying your predefined emergency contacts – aka your friends/family/etc. So be sure to pick people who actually want you saved. Just a thought.</p>\n<p>With that, we’ve managed to make it to the end of the sports section. Realistically though, I’ve just scratched the surface of all the features baked into this watch. Like most Garmin watches, there’s literally hundreds if not thousands of combinations. I try and test and utilize the ones that interest me the most, as well as interest other people the most. Again, don’t forget to hit that video at the start of the ‘Basics’ section, where I walk through even more details.</p>\n<h3><span>GPS &amp; HR Accuracy:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5184.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5184_thumb.jpg\" /></a></p>\n<p>In this section I’m going to look at the accuracy of the optical sensor, as well as the accuracy of the GPS. The optical sensor here is the same as piles of previous Garmin watches, using the Garmin Elevate V3 sensor. The GPS chipset is still Sony too. Nonetheless, as I’ve seen countless times before, the same GPS chipset or HR sensors in different watches can result in different accuracy levels. This can be due to firmware version changes, power draw allowances, GPS antenna design, the size and shape of the watch impacting light leakage for optical HR sensors, and plenty more. In other words, I still test them all the same.</p>\n<p>For all these tests I’ve got multiple other recording devices and sensors. As always, no two watches are on the same wrist so as to not interfere with each other. Extra watches are either worn elsewhere on the body (like a running pack) or bike (handlebars), or sometimes hand-carried. Those watches not on the wrist are collecting heart rate data from extra connected HR sensors/straps.</p>\n<p>First up we’ve got a track workout from yesterday. Seems as good a place as any to look at optical HR, and then a quick look at GPS. For the optical HR side we’re comparing the FR945 LTE on one wrist, the FR55 on the other, and then against a Wahoo TICKR X chest strap and a Polar Verity Sense armband. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/68b86f3f-c86f-4837-7f88-9265c565240a\">that data set</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb1_thumb.png\" /></a></p>\n<p>This was a warm-up, followed by a slate of 800’s, and then some 200m sprints. You can see that looking at the 800’s, it’s darn near perfect. Like, nothing of real concern here. These weren’t quite as high intensity as some of my 800’s (hang tight for that in a second), but more than enough to cause difficulties in sensors if need be.  On the 200’s, these were shorter, only 30-seconds long, and thus you can see the FR945LTE with its newer ELEVATE v4 sensor seemed to struggle slightly, whereas the FR55 with it’s older ELEVATE V3 sensor did better. Of course, this could also just be quirks of left vs right hand too.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb3.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb3_thumb.png\" /></a></p>\n<p>That said, even the FR55 was a bit latent on some of these, though did get the gist of it. Whereas the FR945LTE was latent on all of them. Again though, keep in mind these were 30-second all-out sprints, versus more measured intervals.</p>\n<p>If we switch to look at the GPS tracks, all of the Garmin watches were in track mode, which means they snapped perfectly to the track after a quick one-time calibration set (3 loops around the track):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb5.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb5_thumb.png\" /></a></p>\n<p>For comparison, I also had with my the Suunto 9 Peak, which doesn’t have a track mode. As a result, here’s what that looks like when added in:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb7.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb7_thumb.png\" /></a></p>\n<p>While the GPS track isn’t horrible, you can see it’s essentially all over the track (and beyond). Mind you, I stayed in Lane 1 virtually the entire time. This isn’t to poke fun at Suunto’s track here, but to show the power of track mode for watches from Garmin, Wahoo, and COROS that have it.</p>\n<p>Next, let’s take a look at a forest run from yesterday. For this I had the FR945LTE, FR55, FR745, and the Suunto 9 Peak. You can see that overall, at a high level, there’s no crazy pants ones here. <a href=\"https://analyze.dcrainmaker.com/#/public/07d0e5df-3aaf-480c-555a-c4a7d6435d99\">Everyone is roughly in line</a>:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb9.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb9_thumb.png\" /></a></p>\n<p>Now despite all four of the watches using the Sony GPS chipset, you can still see nuanced differences. Some of it may be left side vs right side (body-wise), but I suspect it’s also just differing internal aspects too. Here’s a more dense forest section, leading out to some fields:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb11.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb11_thumb.png\" /></a></p>\n<p>You can see that for most of it, all four watches are within a few meters, though there was a few times towards the bottom section that we saw more separation from some of them, including the FR55 a bit. Of course, fast forward a few seconds and it’s the FR945LTE contemplating a different path:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb13.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb13_thumb.png\" /></a></p>\n<p>And then it’s the Suunto 9 Peak considering alternate facts:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb15.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb15_thumb.png\" /></a></p>\n<p>The point being, none of them are perfect (though, the FR745 comes darn close), but for most people the data will be similar enough, even in the woods. Once I exit the woods, they’re virtually identical.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb17.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb17_thumb.png\" /></a></p>\n<p>Meanwhile, looking at the heart rate on this run, I made this forest run an interval run too. 800’s followed by 200’s, but of course with the complexities of not tripping on roots and such. Overall, things were pretty good:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb19.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb19_thumb.png\" /></a></p>\n<p>Again you see some minor wobbles (more minor this time than last time) on the FR945 LTE during the 200’s (shorter ones at the end), but the FR55 was really solid here. The Polar Verity Sense was solid as always.</p>\n<p>Next, let’s look at an outdoor ride. I realize there’s a lot to take in here, with a lot of lines and a lot of data. Like trying to find Waldo in Where’s Waldo, it’s best to just squint and focus on one thing – or here, one color. The FR945LTE is in yellow, and the FR55 is in red. What I’d consider references would be the TICKR in Blue, and the Polar Verity Sense in green. And if you want to move <a href=\"https://analyze.dcrainmaker.com/#/public/090e4854-b357-4146-43ed-46df7e9910da\">around the graphs</a>, go here.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb21.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb21_thumb.png\" /></a></p>\n<p>Now, the main things you’ll notice is that the FR945LTE seems to have a few more drops and spikes than the FR55 does. In general, I don’t find many wrist-based optical HR sensors that do well road cycling, especially with any intensity changes. The FR55 actually does relatively well here compared to the FR945LTE. It’s not that the FR945LTE is horrible or anything, rather, it’s just what I tend to see sometimes variability-wise. Meanwhile, the FR55 seems to have lucked out more on this ride.</p>\n<p>As for GPS? Zero issues road cycling. Here’s the high level:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb23.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb23_thumb.png\" /></a></p>\n<p>And here’s some tough tunnel sections under the airport runways. Mind you, you’re not getting GPS underground. But rather, I’m interested to see that it properly disengages and re-engages without throwing crazy spikes here and there. And it does that perfectly.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image_thumb25.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb25_thumb.png\" /></a></p>\n<p>Overall though, for GPS accuracy it looks pretty darn good, and for the optical HR sensor, it’s very good. Very few wobbles across any of my data sets, indoors or outdoors, running or cycling – all is spot-on. I haven’t been able to get to a pool yet for pool swimming though, so that’s something I’ll do.</p>\n<p><em>(Note: All of the charts in these accuracy portions were created using the DCR Analyzer tool.  It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, <a href=\"http://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/DSC_5170.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/DSC_5170_thumb.jpg\" /></a></p>\n<p>I’ve gotta wonder if the Polar Ignite/Ignite 2 re-energized Garmin a bit on their budget friendly options. Or perhaps it’s the Apple Watch Series 3 at sub-$200. After all, as I noted recently, those two units had started to make folks question the value of the Forerunner 45 in comparison to the larger non-running features that you’d find on those watches. But this time, Garmin has unequivocally thrown down on the running and training features…hard. They’ve basically taken almost everything found in the higher end Forerunner 245 watch and pulled it into the FR55. Sure, there’s a few minor things, but for any runner out there, they’re likely going to be perfectly happy with this watch.</p>\n<p>If someone wanted me to start training and racing on this watch, versus my usual FR745, it frankly wouldn’t have any any impact running-wise (other sports like cycling, sure). But for running, I easily used this entirely on my interval workouts. Yesterday’s track workout I did 100% looking only at the FR55, pacing each split easily using Track Mode. And the same goes for a number of other runs over the past near-month.</p>\n<p>Now, there’s still some quirks. While Garmin went for the fences on running features, the display just seems out of sync with the rest of their offerings. I’m not asking for AMOLED here, but I shouldn’t so obviously see pixilation on the default watch face due to lack of resolution in 2021. And similarly, with more and more people using watches to broadcast their heart rate to fitness apps, Bluetooth Smart HR broadcasting should be an easy-button. I shouldn’t have to do a clunky workaround using a run profile designed for Zwift, simply to transmit my HR to a fitness app at the gym.</p>\n<p>Minor annoyances aside, this is a very strong watch for Garmin for runners, and in some ways, the fact that they used the existing Elevate V3 sensor seems to have done better than the newer V4 sensor in my testing this round. And ultimately, that’s mostly what this watch is: Taking ‘known good’ features from all of Garmin’s higher end watches, and stuffing them into a lower price point. Worked out pretty well this time.</p>\n<p>With that, thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Garmin Forerunner 55 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Garmin-Forerunner-Running-Suggested-Workouts/dp/B092RCLKHN?dchild=1&amp;keywords=Garmin+Forerunner+55&amp;qid=1622710482&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=31f00699be922d7187dcd45a777f1cd7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Garmin-FR55-Transparent-200x230.png\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-forerunner-45-45s-gps-watch-in-depth-review.html\" target=\"_blank\">Garmin Forerunner 55</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Forerunner-Running-Suggested-Workouts/dp/B092RCLKHN?dchild=1&amp;keywords=Garmin+Forerunner+55&amp;qid=1622710482&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=31f00699be922d7187dcd45a777f1cd7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$200</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F200319%2Fgarmin-forerunner-55\"><span>REI</span> <span>$200</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And finally, here’s a handy list of accessories that work well with this unit (and some that I showed in the review). Given the unit pairs with ANT+ &amp; Bluetooth Smart sensors, you can use just about anything though.</p>\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Cadence Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$33</span></a> </div><p>This is a dual ANT+/Bluetooth Smart cycling cadence sensor that you strap to your crank arm, but also does dual Bluetooth Smart, so you can pair it both to Zwift and another Bluetooth Smart app at once if you want.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-DUAL Chest Strap</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$54</span></a> </div><p>This is one of the top straps I use daily for accuracy comparisons (the others Polar H9/H10 and Wahoo TICKR X). It's dual ANT+/Bluetooth Smart, and in fact dual-Bluetooth Smart too, in case you need multiple connectons.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2020/09/garmin-hrm-pro-chest-strap-depth-review.html\" target=\"_blank\">Garmin HRM-PRO</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Pro-Premium-Real-Time-Dynamics/dp/B085JKM9DR/ref=as_li_ss_tl?dchild=1&amp;keywords=HRM-PRO&amp;qid=1600331698&amp;sr=8-11&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a98371f74dbdd8e2bc81c3acd89468b8&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2020/09/Garmin-HRM-PRO-Transparent-e1605986651314-125x121.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Pro-Premium-Real-Time-Dynamics/dp/B085JKM9DR/ref=as_li_ss_tl?dchild=1&amp;keywords=HRM-PRO&amp;qid=1600331698&amp;sr=8-11&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a98371f74dbdd8e2bc81c3acd89468b8&amp;language=en_US\"><span>Amazon</span> <span>$113</span></a> </div><p>This is the pinnacle of Garmin chest straps, and includes dual ANT+ &amp; Bluetooth Smart, Swimming support, Running Dynamics, as well as back-fill of HR/Steps/Intensity Minutes/Calories if not wearing the watch in certain sports. Note: Not all watches support Running Dynamics/Swimming HR backfill, check your watch first!</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2015/11/garmin-hrm-swimtri-review.html\" target=\"_blank\">Garmin HRM-TRI/HRM-SWIM Straps</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Tri-Heart-Rate-Monitor/dp/B012H8IPQS/ref=as_li_ss_tl?keywords=HRM-TRI&amp;qid=1581594127&amp;sr=8-12-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyTEpCTTVGVFNQVEQ2JmVuY3J5cHRlZElkPUEwOTU2Nzc5MUM1SlJXWU5CMTkxUiZlbmNyeXB0ZWRBZElkPUEwMjUwNjcyM0tOUjNKQUQ2MFU1RCZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33db70ffbc9bca68c7eddb836554012e&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2015/07/Garmin-HRM-TRI-Swim-Bundle-Transparent-125x64.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Tri-Heart-Rate-Monitor/dp/B012H8IPQS/ref=as_li_ss_tl?keywords=HRM-TRI&amp;qid=1581594127&amp;sr=8-12-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyTEpCTTVGVFNQVEQ2JmVuY3J5cHRlZElkPUEwOTU2Nzc5MUM1SlJXWU5CMTkxUiZlbmNyeXB0ZWRBZElkPUEwMjUwNjcyM0tOUjNKQUQ2MFU1RCZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33db70ffbc9bca68c7eddb836554012e&amp;language=en_US\"><span>Amazon</span> <span>$88</span></a> </div><p>While optical HR works on some newer Garmin watches, if you're looking for higher levels of accuracy, the HRM-TRI or HRM-SWIM are less expensive than the HRM-PRO, but lack the Bluetooth connectivity and a few other features.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/11/the-best-garmin-charger-only-9-for-a-two-pack-of-these-pucks.html\" target=\"_blank\">Garmin Puck Charger</a></h4><div><a href=\"https://www.amazon.com/gp/product/B07N18DX6Y/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=76df950221b5d4f0058d81de45525695&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2020/02/GarminPuckCharger-Transparent-110x125.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/gp/product/B07N18DX6Y/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=76df950221b5d4f0058d81de45525695&amp;language=en_US\"><span>Amazon</span> <span>$9</span></a> </div><p>Seriously, this will change your life. $9 for a two-pack of these puck Garmin chargers that stay put and stay connected. One for the office, one for your bedside, another for your bag, and one for your dog's house. Just in case.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Speed Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent-125x95.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$33</span></a> </div><p>This speed sensor is unique in that it can record offline (sans-watch), making it perfect for a commuter bike quietly recording your rides. But it's also a standard ANT+/BLE sensor that pairs to your device. It's become my go-to speed sensor.</p>\n</div></div>\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Garmin Forerunner 55 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Garmin-Forerunner-Running-Suggested-Workouts/dp/B092RCLKHN?dchild=1&amp;keywords=Garmin+Forerunner+55&amp;qid=1622710482&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=31f00699be922d7187dcd45a777f1cd7&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Garmin-FR55-Transparent-200x230.png\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-forerunner-45-45s-gps-watch-in-depth-review.html\" target=\"_blank\">Garmin Forerunner 55</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Forerunner-Running-Suggested-Workouts/dp/B092RCLKHN?dchild=1&amp;keywords=Garmin+Forerunner+55&amp;qid=1622710482&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=31f00699be922d7187dcd45a777f1cd7&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$200</span></a> <a target=\"_blank\" href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=e295c418-295a-447c-b265-734e25f82503&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.rei.com%2Fproduct%2F200319%2Fgarmin-forerunner-55\"><span></span><span>REI</span><span>Buy Now</span> <span>$200</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And finally, here’s a handy list of accessories that work well with this unit (and some that I showed in the review). Given the unit pairs with ANT+ &amp; Bluetooth Smart sensors, you can use just about anything though.</p>\n<div>\n<div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Cadence Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-CadenceSensor-Transparent-125x106.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Cadence-Sensor-Monitor-Pedaling/dp/B07PJKYXW5?keywords=Garmin+cadence+sensor&amp;qid=1581594611&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=1265816811cf6f624fccd0c3b57bc332&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$33</span></a> </div><p>This is a dual ANT+/Bluetooth Smart cycling cadence sensor that you strap to your crank arm, but also does dual Bluetooth Smart, so you can pair it both to Zwift and another Bluetooth Smart app at once if you want.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\" target=\"_blank\">Garmin HRM-DUAL Chest Strap</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/01/Garmin-HRM-DUAL-Transparent-e1605988156205-125x52.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Dual-Heart-Rate-Monitor/dp/B07N3C5WRG?keywords=HRM-DUAL&amp;qid=1581593428&amp;sr=8-3&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=224f822b8e5a0f1225812b227f30a494&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$54</span></a> </div><p>This is one of the top straps I use daily for accuracy comparisons (the others Polar H9/H10 and Wahoo TICKR X). It's dual ANT+/Bluetooth Smart, and in fact dual-Bluetooth Smart too, in case you need multiple connectons.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2020/09/garmin-hrm-pro-chest-strap-depth-review.html\" target=\"_blank\">Garmin HRM-PRO</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Pro-Premium-Real-Time-Dynamics/dp/B085JKM9DR/ref=as_li_ss_tl?dchild=1&amp;keywords=HRM-PRO&amp;qid=1600331698&amp;sr=8-11&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a98371f74dbdd8e2bc81c3acd89468b8&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2020/09/Garmin-HRM-PRO-Transparent-e1605986651314-125x121.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Pro-Premium-Real-Time-Dynamics/dp/B085JKM9DR/ref=as_li_ss_tl?dchild=1&amp;keywords=HRM-PRO&amp;qid=1600331698&amp;sr=8-11&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a98371f74dbdd8e2bc81c3acd89468b8&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$113</span></a> </div><p>This is the pinnacle of Garmin chest straps, and includes dual ANT+ &amp; Bluetooth Smart, Swimming support, Running Dynamics, as well as back-fill of HR/Steps/Intensity Minutes/Calories if not wearing the watch in certain sports. Note: Not all watches support Running Dynamics/Swimming HR backfill, check your watch first!</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2015/11/garmin-hrm-swimtri-review.html\" target=\"_blank\">Garmin HRM-TRI/HRM-SWIM Straps</a></h4><div><a href=\"https://www.amazon.com/Garmin-HRM-Tri-Heart-Rate-Monitor/dp/B012H8IPQS/ref=as_li_ss_tl?keywords=HRM-TRI&amp;qid=1581594127&amp;sr=8-12-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyTEpCTTVGVFNQVEQ2JmVuY3J5cHRlZElkPUEwOTU2Nzc5MUM1SlJXWU5CMTkxUiZlbmNyeXB0ZWRBZElkPUEwMjUwNjcyM0tOUjNKQUQ2MFU1RCZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33db70ffbc9bca68c7eddb836554012e&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2015/07/Garmin-HRM-TRI-Swim-Bundle-Transparent-125x64.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-HRM-Tri-Heart-Rate-Monitor/dp/B012H8IPQS/ref=as_li_ss_tl?keywords=HRM-TRI&amp;qid=1581594127&amp;sr=8-12-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyTEpCTTVGVFNQVEQ2JmVuY3J5cHRlZElkPUEwOTU2Nzc5MUM1SlJXWU5CMTkxUiZlbmNyeXB0ZWRBZElkPUEwMjUwNjcyM0tOUjNKQUQ2MFU1RCZ3aWRnZXROYW1lPXNwX210ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU=&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=33db70ffbc9bca68c7eddb836554012e&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$88</span></a> </div><p>While optical HR works on some newer Garmin watches, if you're looking for higher levels of accuracy, the HRM-TRI or HRM-SWIM are less expensive than the HRM-PRO, but lack the Bluetooth connectivity and a few other features.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/11/the-best-garmin-charger-only-9-for-a-two-pack-of-these-pucks.html\" target=\"_blank\">Garmin Puck Charger</a></h4><div><a href=\"https://www.amazon.com/gp/product/B07N18DX6Y/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=76df950221b5d4f0058d81de45525695&amp;language=en_US\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2020/02/GarminPuckCharger-Transparent-110x125.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/gp/product/B07N18DX6Y/ref=as_li_ss_tl?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=76df950221b5d4f0058d81de45525695&amp;language=en_US\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$9</span></a> </div><p>Seriously, this will change your life. $9 for a two-pack of these puck Garmin chargers that stay put and stay connected. One for the office, one for your bedside, another for your bag, and one for your dog's house. Just in case.</p>\n</div><div><div><h4><a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\" target=\"_blank\">Garmin Speed Sensor V2</a></h4><div><a href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2019/11/Garmin-Speed-Sensor-Transparent-125x95.png\" /></a></div></div><div><a target=\"_blank\" href=\"https://www.amazon.com/Garmin-Speed-Sensor-Bike-Monitor/dp/B07PJKZ7G9?dchild=1&amp;keywords=garmin+speed+sensor&amp;qid=1617702497&amp;sr=8-4&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=2813da7486271b4470d0d74f0a0d7e0c&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$33</span></a> </div><p>This speed sensor is unique in that it can record offline (sans-watch), making it perfect for a commuter bike quietly recording your rides. But it's also a standard ANT+/BLE sensor that pairs to your device. It's become my go-to speed sensor.</p>\n</div></div>\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"7b33202f8949a09c61be65ffbdac5e10b8624573716986e9eb3833817eec1f7d","category":"Cycling"}