{"title":"Insights into Positive Mental Health amid the Covid-19 Pandemic: Evidence from a Study in Croatia","link":"https://www.preprints.org/manuscript/202406.0252/v1","date":1717568710000,"content":"Objective: The Covid-19 pandemic has raised significant concerns about public health, particularly in terms of mental well-being due to heightened fear and uncertainty. The findings of this study are based on a survey conducted to evaluate the mental health status of the general population in Croatia during the Covid-19 pandemic.\nMethods: A survey conducted randomly and cross-sectionally included 588 respondents from all 21 counties in Croatia. The survey gathered demographic data and assessed various factors related to pandemic response measures and mental health using the Mental Health Continuum-Short Form (MHC-SF) scale.\nResults: Despite feeling adequately informed about Covid-19 (76.0%), most respondents (60.8%) expressed concerns about their loved ones during the pandemic. There were significant numbers who felt there was no risk of infection (50.9%) or believed they would not get infected (40.2%), while 72.4% were content with government measures. Statistical analysis indicated that mental health was not significantly different between genders, but age-related differences were evident, with those under 21 experiencing the most distress. The lowest level of psychological and social well-being was observed in respondents who were unemployed.\nConclusions: The study identifies vulnerable groups in the Croatian population during the pandemic, including younger individuals, those on parental leave, students, and the unemployed, who exhibited worse mental health. The importance of implementing targeted mental health interventions to support these vulnerable groups is highlighted by these findings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7b368f55a909634b1bd31cb485ca24faa7f58f3c5839600125d5cc5c505fa9dd","category":"Interdisciplinary"}