{"title":"The new Liv Langma: The WorldTour racer designed for women","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/introucing-the-new-liv-langma","date":1622634912000,"content":"\n      \n<p><span>Women’s-specific bike brand, Liv, has launched the second generation of its Langma range. The Langma was first introduced in 2017 as an all-round bike designed to perform on climbs. The new and improved Langma SL Advanced  (used by the Liv Racing WorldTeam) is said to be lighter, faster, and more responsive than ever.</span></p>\n<p><span>Launched by Bonnie Tu in 2008, and an off-shoot to cycling's mega-brand Giant, Liv bikes are designed specifically for women, by an all-female team. Tu’s motivation to start the brand came through frustration at not being able to find gear that worked for her while training for the Tour of Taiwan and the brand has focused on providing quality women’s-specific gear ever since. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-best-lightweight-climbers-bikes-the-desire-selection\">The best lightweight climbers' bikes – The Desire Selection</a></strong></em></p>\n<p><span>The brand is now title sponsor of women’s WorldTeam, Liv Racing, as well as backing a number of off-road teams and cycling collectives globally. The Langma has taken riders to multiple victories including Coryn Rivera’s 2018 US National Championships victory and 23 stage and overall wins by Marianne Vos.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Langma_1024x1024.jpg?v=1622629197\" /></span></p>\n<p><span>This year alone, it was ridden by Lotte Kopecky to take the win at Le Samyn des Dames as well as a stage win and GC podium at Internationale LOTTO Thüringen Ladies Tour. It’s not just for the fast riders, however, Kopecky’s teammate Pauliena Rooijakkers has been climbing extremely well on the Langma (including 4th on the final HC climb at Vuelta a Burgos Féminas) cementing the bike’s versatility. </span></p>\n<p><span>What is unique about Liv is the brand's attention to the specific needs and differences for women’s geometry. The geometry of Liv bikes including the Langma Disc range is informed by data from real women’s body dimensions including a specific height range all based on research or athlete feedback. </span></p>\n<p><span>Any female rider who has tried to jump on an off-the-peg unisex bike will know the struggle of changing out components designed with men in mind. With Liv, however, the components are all proportional to the size of the frame and therefore the rider — including crank arms, and handlebars with a smaller width and optimised drop reach. This means being able to ride the bike pretty much straight out of the box — a novelty for female riders. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/desire-journal/the-desire-selection\"><em><strong>The Desire Selection – all the best products in cycling</strong></em></a></p>\n<p><span>The name ‘Langma’ is derived from the Tibetan word for Mt Everest which speaks to the mountain goat characteristics that make the bike a lightweight all-round rig that can perform on climbs as well as flats and descents. </span></p>\n<h4><span>Key updates</span></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/MY22_Langma_Advanced_2_Disc_Color_B_Chameleon_Purple_1024x1024.jpg?v=1622567749\" /></div>\n<div>\n\n<em><span>Liv Langma Advanced Disc 2, £2,349,<span> </span><a href=\"https://www.liv-cycling.com/gb/langma-advanced-disc-2-2022\" target=\"_blank\"><strong>Shop Liv</strong></a></span></em>\n</div>\n<br />\n<p><span>The most prominent update for the Langma is the move to disc brakes. As part of that change, the bike can also accommodate 32mm tyres — handy for the women’s pro team with the inaugural women’s Paris Roubaix looming. </span></p>\n<p><span>Some of the other key changes to the new Langma Disc include aerodynamic improvements taken from the EnviLiv model as well as a geometry and build more akin to the Avail ) the brand’s endurance offering. On the top-end Langma Advanced SL Liv have improved transmission stiffness by 21%. </span><span>On the subject of stiffness, the bike is billed as having a 50% improvement on lateral stiffness in the fork from the first generation.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/MY22-Langma-Advanced-Pro-0-Disc-AXS_Color-A-Carb-_1_1024x1024.jpg?v=1622635191\" /></span></p>\n<p><em><span>Liv Langma Advanced Pro 0, £5,599, <a href=\"https://www.liv-cycling.com/gb/langma-advanced-pro-disc-0-axs-2022\" target=\"_blank\"><strong>Shop Liv</strong></a></span></em></p>\n<p><span>Elsewhere, the Advanced SL uses Advanced-Grade Composite layup making it 60g lighter than its predecessor and features a new carbon Variant SLR seatpost that weighs only 141g. The Advanced SL does not appear to be available in the UK at present, and so for now the Advanced Pro 0 (above) is the top-tier model.</span></p>\n<p><span>The new Langma also features carbon Liv Contact SLR Handlebars with an aerodynamic design, ergonomic grip and optimized drop and reach making for improved handling. </span></p>\n<p><span>There are three series of the new Langma Disc with 11 models in total ranging from size XXS to L for heights of between 145cm and 183cm.</span></p>\n<p><span>Prices start at £2,349, visit <a href=\"https://www.liv-cycling.com/gb/bikes/road-bikes/performance-and-racing\" target=\"_blank\">Liv Cycling</a> to see the entire range.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7b3a8bbff36e8e1bf004737cacdc8a350c51e5ba7d0fffee7f4bf09061253c40","category":"Cycling"}