{"title":"Reduced Streamflow From Water Diversion Alters Stream Ecology and Fish Behavior","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4386?af=R","date":1727245569000,"content":"<h2>ABSTRACT</h2>\n<p>Understanding invertebrate and fish responses to altered streamflows is important for water management that balances ecological function and societal needs. We studied the impacts of a significant water diversion on a stream food web, including benthic biofilms, benthic macroinvertebrates (BMI), and drifting macroinvertebrates. In the dry season, drift flux (number of aquatic individuals or biomass/s) and drift concentration (individual/m<sup>3</sup>) were lower below the diversion than above. Drift concentration (biomass/m<sup>3</sup>) was slightly higher below the diversion, due to the presence of large Trichopterans. All measures of drift dropped to nearly zero at the end of the dry season below the diversion, when streamflows were reduced by &gt; 90% below the diversion relative to above, representing a significant loss of food resources for trout. Simultaneously, native Rainbow Trout (<i>Oncorhynchus mykiss</i>) switched from drift to benthic foraging 1 month earlier below the diversion as drift and water velocities declined. The ecology of the benthos was not as impacted by the diversion: BMI densities were higher below the diversion, while benthic biofilm densities were similar at the two sites. The taxonomic composition of BMI was also similar between the sites, but fewer Ephemeroptera entered the drift below the diversion. Overall, the late season decrease in drift below the diversion despite the similar or higher benthic production suggests that streamflows influence food availability for trout even in the absence of benthic responses. Reduced streamflows, due to water diversions as studied here, or due to climate change, will likely reduce food resources and growth opportunities for fishes.</p>","author":"Suzanne J. Rhoades, \nTimothy J. Caldwell, \nNatalie Stauffer‐Olsen, \nTara McKinnon, \nScott McBain, \nRene Henery, \nSudeep Chandra","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"7b3bd290f1fdfbd7a35d7d94092f6bb31f582b097c43617bd3291f0894048a45","category":"Environment"}