{"title":"117 Population structure and genetic diversity of U.S. Polypay Sheep in the National Sheep Improvement Program","link":"https://academic.oup.com/jas/article/102/Supplement_3/32/7757154?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The development of the Polypay breed focused on improving the lifetime productivity of the Western range ewe with the objective of ewes lambing twice a year starting at 1 yr of age. The Polypay was developed at the U.S. Sheep Experiment Station (USSES) in 1968 as a four-breed composite with 25% each of Dorset, Rambouillet, Targhee, and Finnsheep. The breed is versatile and rugged enough to be used extensively in Western sheep production and throughout the Central and Eastern U.S. in intensive accelerated lambing systems. Our objective was to define the current population structure and genetic diversity in this breed using pedigree- and genomic-based methods as the industry adopts genomic selection. Pedigree records from Polypay breeders participating in the National Sheep Improvement Program representing 193 flocks were combined with pedigree records from USSES (n = 162,997) tracing back to the origins of the breed. A subset of these pedigreed sheep from 32 flocks born from 2011 to 2023 were genotyped with the GGP Ovine 50K BeadChip (n = 1,856). Quality control measures were applied for marker and animal call rates and to remove markers in high linkage disequilibrium. Pedigree completeness and quality was 9.6, 2.3, and 4.6 for mean maximum, mean complete, and mean equivalent generations, respectively. Pedigree-based inbreeding for the full data was 2.19%; for the subset of pedigreed animals also genotyped, it was 2.94%. The rate of inbreeding was consistently 0.07%/yr across years (<span>P</span> = 0.88). Measures of genomic inbreeding for genotyped sheep were 1.26% for Wright’s inbreeding coefficient, measured as heterozygote deficiency, and 2.90% for inbreeding based on runs of homozygosity. Ten rams from 8 flocks contributed up to 20.3% of the current gene pool. Pedigree-based measures of effective population size ranged from 70 to 249 while the genomic estimate was 118. Fixed and rare (≤ 0.01) alleles accounted for 3.2% and 1.4% of the markers, respectively. The majority of runs of homozygosity (72.1%) were less than 6 Mb, indicative of founder effects and ancient inbreeding rather than recent inbreeding. Based on principal component (PC) analysis, PC 1 suggested a separation of USSES sheep from the rest. Model-based population structure showed differentiation among flocks as did Wright’s Fixation Index (F<sub>ST</sub>) values with a mean of 0.07. High levels of genetic diversity exist in the Polypay as demonstrated by low inbreeding, high heterozygosity, and large effective population sizes. Population substructure exists in the population as shown by PC analysis, model-based population structure, and F<sub>ST</sub> values. These parameters indicate that sufficient genetic diversity is present to move forward with genomic selection. Genetic diversity measures should be revisited periodically once genomic selection is implemented in the breed. USDA is an equal opportunity provider and employer.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7b44f05bb0b4f0548daafb72c512d480748bbdffe64e12c45cbc496c8e52f6aa","category":"Environment"}