{"title":"iPhone 16 Pro to Feature Major Telephoto Lens Revision","link":"https://www.macrumors.com/2023/10/30/iphone-16-pro-telephoto-lens-revision/","date":1698699290000,"content":"The <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a> Pro models that are coming next year will feature a major camera lens overhaul, according to <em><a href=\"https://money.udn.com/money/story/5612/7540381\">Economic Daily News</a></em>. Apple plans to use more advanced glass molded lenses, which the site says will lead to a thinner and lighter design, lenses that are shorter, and improved optical zoom magnification.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iPhone-16-Cameras-Feature-1.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe updated glass is said to be limited to the Telephoto lens because of the difficult production process and limited production capacity. Apple representatives allegedly recently visited <a href=\"https://www.hoya-opticalworld.com/english/products/moldlenses.html\">molded glass supplier Hoya</a>. Hoya's website says that it is able to produce large numbers of \"highly accurate aspherical glass molded lenses.\" Apple will also source lenses from current supplier Largan Precision.\r<br />\n\r<br />\nThe new lens technology is expected to be more expensive, so the ‌iPhone 16‌ Pro models could face \"price pressure\" next year.\r<br />\n\r<br />\nBack in July, Weibo account Digital Chat Station <a href=\"https://www.macrumors.com/2023/07/18/iphone-16-pro-max-super-telephoto-camera/\">referenced molded glass technology</a> for the ‌iPhone 16‌ Pro models, suggesting that Apple would introduce a \"super\" telephoto lens. Super is a label that is typically applied to cameras that have a focal length of over 300mm, which would far exceed the 120mm zoom of the current 5x tetraprism lens in the 15 Pro Max.\r<br />\n\r<br />\nBoth the ‌iPhone 16‌ Pro and Pro Max are expected to offer the more advanced telephoto capabilities currently limited to the Pro Max, but Digital Chat Station suggested that \"super\" zoom capabilities could be limited to the Pro Max, which would give it even more advanced optical zoom than the 16 Pro.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/30/iphone-16-pro-telephoto-lens-revision/\">iPhone 16 Pro to Feature Major Telephoto Lens Revision</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-16-pro-to-feature-major-telephoto-lens-revision.2409230/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7b5052bda57a98e196f96d602cee25825b7d65e9af566df71c6a19506303f2d0","category":"Apple"}