{"title":"Arc Search for iPhone Merges AI and Web Search in a Browser App","link":"https://www.macrumors.com/2024/01/29/arc-search-iphone-app-ai/","date":1706525252000,"content":"The Browser Company has released a new iPhone app called <a href=\"https://arc.net/blog/arc-search\">Arc Search</a> that aims to reimagine the online search experience by using artificial experience to present web results in a more easily digestible, curated presentation.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/arc-search-app.jpg\" width=\"4137\" height=\"2716\" />\r<br />\nThe app follows the company's <a href=\"https://arc.net\">Arc Browser</a> for Mac, and could be described as an AI chat bot with web access (think <a href=\"https://www.perplexity.ai\">perplexity.ai</a>), wrapped in a clean, minimalist browser interface that quickly builds webpages on the fly based on your search query.\r<br />\n\r<br />\nThe app opens with a search bar and keyboard, and its main AI-powered feature, \"Browse for me,\" reads at least six websites and returns key information about the search query in a neatly presented webpage. \r<br />\n\r<br />\nFor example, when searching \"How to change a car tyre,\" Arc Search creates a page with sections including steps for changing the tyre, safety precautions, necessary tools, positioning the car, and fitting the spare wheel, with links for further reading. \r<br />\n\r<br />\nWhile Arc Search webpages don't always cite sources, the app does feature a \"Dive Deeper\" section at the bottom of the page so users can check whether the information that is being delivered to them is credible.\r<br />\n\r<br />\nApart from the \"Search for me\" feature, which is powered by large-language models from OpenAI and others, users can opt to search with more traditional services like Google, Bing, DuckDuckGo, and Ecosia.\r<br />\n\r<br />\nIn addition, there's a reader mode for clearing cruft from websites, along with the ability to bookmark pages. To keep things tidy, Arc Search also archives tabs after a user-defined period, and blocks GDPR  banners and ads/trackers automatically. \r<br />\n\r<br />\n<div><blockquote><p>a little Sunday surprise for you...<br /><br />meet <a href=\"https://twitter.com/browsercompany?ref_src=twsrc%5Etfw\">@browsercompany</a>'s 2nd product:<br /><br />🔍Arc Search🔎<br /><br />it's a default browser for your iPhone<br />...that BROWSES FOR YOU<br /><br />the origin story is a bit unusual so I wanted to give you the full backstory: <a href=\"https://t.co/pkVQJYN0QQ\">pic.twitter.com/pkVQJYN0QQ</a></p>— Josh Miller (@joshm) <a href=\"https://twitter.com/joshm/status/1751734580124787028?ref_src=twsrc%5Etfw\">January 28, 2024</a></blockquote> </div>\r<br />\n\r<br />\nArc Search is available for free on the App Store [<a href=\"https://apps.apple.com/app/arc-search/id6472513080\">Direct Link</a>] and requires iOS 16 or later, while Arc Browser for Mac can be downloaded from the <a href=\"https://arc.net\">company's website</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/29/arc-search-iphone-app-ai/\">Arc Search for iPhone Merges AI and Web Search in a Browser App</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/arc-search-for-iphone-merges-ai-and-web-search-in-a-browser-app.2417739/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7b53c1db59ec1c1b0c190e848d63d4520b034f96b369c69d3cf212dee03dc407","category":"Apple"}