{"title":"Spatial ecology of moose in Sweden: Combined Sr-O-C isotope analyses of bone and antler","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300867","date":1712757600000,"content":"<p>by Elena Armaroli, Federico Lugli, Anna Cipriani, Thomas Tütken</p>\r\n\r\nThe study of spatial (paleo)ecology in mammals is critical to understand how animals adapt to and exploit their environment. In this work we analysed the <sup>87</sup>Sr/<sup>86</sup>Sr, δ<sup>18</sup>O and δ<sup>13</sup>C isotope composition of 65 moose bone and antler samples from Sweden from wild-shot individuals dated between 1800 and 1994 to study moose mobility and feeding behaviour for (paleo)ecological applications. Sr data were compared with isoscapes of the Scandinavian region, built <i>ad-hoc</i> during this study, to understand how moose utilise the landscape in Northern Europe. The <sup>87</sup>Sr/<sup>86</sup>Sr isoscape was developed using a machine-learning approach with external geo-environmental predictors and literature data. Similarly, a δ<sup>18</sup>O isoscape, obtained from average annual precipitation δ<sup>18</sup>O values, was employed to highlight differences in the isotope composition of the local environment vs. bone/antler. Overall, 82% of the moose samples were compatible with the likely local isotope composition (n = 53), suggesting that they were shot not far from their year-round dwelling area. ‘Local’ samples were used to calibrate the two isoscapes, to improve the prediction of provenance for the presumably ‘non-local’ individuals. For the latter (n = 12, of which two are antlers and ten are bones), the probability of geographic origin was estimated using a Bayesian approach by combining the two isoscapes. Interestingly, two of these samples (one antler and one bone) seem to come from areas more than 250 km away from the place where the animals were hunted, indicating a possible remarkable intra-annual mobility. Finally, the δ<sup>13</sup>C data were compared with the forest cover of Sweden and ultimately used to understand the dietary preference of moose. We interpreted a difference in δ<sup>13</sup>C values of antlers (<sup>13</sup>C-enriched) and bones (<sup>13</sup>C-depleted) as a joint effect of seasonal variations in moose diet and, possibly, physiological stresses during winter-time, i.e., increased consumption of endogenous <sup>13</sup>C-depleted lipids.","author":"Elena Armaroli","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7b60a6528244ec1a83ae0a5146495ee9f12cf80fdb3a77f6ceffe3f093a5c457","category":"Interdisciplinary"}