{"title":"Ford is setting up a new EV battery center in southeast Michigan","link":"https://arstechnica.com/?p=1760415","date":1619539220000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/BatteryFacility_AllenPark_31-980x653.jpg\" /></div>\n        <p>\n          Ford will spend $185 million on a new 200,000-square-foot \"battery center of excellence\" called Ion Park in Michigan. It will join Ford's new Battery Benchmarking and Test Laboratory in Allen Park, Michigan, seen here.                      [credit:\n                        Ford                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>The Ford Motor Company announced on Tuesday that it is creating a new \"global battery center of excellence,\" called Ion Park, in southeast Michigan. Ford says the new facility will work on all aspects of battery technology development, including manufacturing, mining, and recycling, as the automaker looks to a future in which its electric vehicle battery packs are more vertically integrated.</p>\n<p>Ford says Ion Park will have a team of 150 once it's fully operational late next year. It will join Ford's new Battery Benchmarking and Test Laboratory in Allen Park, Michigan. That site, which opened in 2020, is where the company tests new battery cell types, <a href=\"https://arstechnica.com/cars/2020/03/as-volvo-goes-electric-heres-how-its-making-its-batteries-top-notch/\">similar to the Volvo lab we visited early last year</a>.</p>\n<p>Ford says it has already tested more than 150 cells to understand different chemistries and operating conditions at Allen Park.</p></div><p><a href=\"https://arstechnica.com/?p=1760415#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1760415&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7b61d3e0b03dcb2c7eebec937868e82a5ddeb4b3ce742494150428ab5bd098a7","category":"Tech"}