{"title":"Soil moisture conditions alter behavior of entomopathogenic nematodes","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13326?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>A variety of environmental factors can disrupt biotic interactions between plants, insects and soil microorganisms with consequences for agricultural management and production. Many of these belowground interactions are mediated by volatile organic compounds (VOCs) which can be used for communication under appropriate environmental conditions. Behavioral responses to these compounds may likewise be dependent on varying soil conditions which are influenced by a changing climate. To determine how changing environmental conditions may affect VOC-mediated biotic interactions, we used a belowground system where entomopathogenic nematodes (EPNs) – tiny roundworm parasitoids of soil-borne insects – respond to VOCs by moving through the soil pore matrix. Specifically, we used two genera of EPNs – <i>Heterorhabditis</i> and <i>Steinernema</i> – that are known to respond to four specific terpenes – <i>α</i>-pinene, linalool, <span>d</span>-limonene and pregeijerene – released by the roots of plants in the presence of herbivores. We assessed the response of these nematodes to these terpenes under three moisture regimes to determine whether drier conditions or inundated conditions may influence the response behavior of these nematodes.</p>\n<h2>RESULTS</h2>\n<p>Our results illustrate that the recovery rate of EPNs is positively associated with soil moisture concentration. As soil moisture concentration increases from 6% to 18%, substantially more nematodes are recovered from bioassays. In addition, we find that soil moisture influences EPN preference for VOCs, as illustrated in the variable response rates. Certain compounds shifted from acting as a repellent to acting as an attractant and vice versa depending on the soil moisture concentration.</p>\n<h2>CONCLUSION</h2>\n<p>On a broad scale, we demonstrate that soil moisture has a significant effect on EPN host-seeking behavior. EPN efficacy as biological control agents could be affected by climate change projections that predict varying soil moisture concentrations. We recommend that maintaining nematodes as biological control agents is essential for sustainable agriculture development, as they significantly contribute not only to soil health but also to efficient pest management. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Dana Frankenstein, \nMacawan S Luu, \nJennifer Luna‐Ayala, \nDenis S Willett, \nCamila S Filgueiras","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7b6f1b8a3a842ed2470f3b620e8ac1340a9648f2ff1bc1f1b10cde5eef8afe7f","category":"Environment"}