{"title":"GRAS transcription factor PINNATE-LIKE PENTAFOLIATA2 controls compound leaf morphogenesis in Medicago truncatula","link":"https://academic.oup.com/plcell/article/36/5/1755/7601515?rss=1","date":1707177600000,"content":"<span><div>Abstract</div>The milestone of compound leaf development is the generation of separate leaflet primordia during the early stages, which involves two linked but distinct morphogenetic events: leaflet initiation and boundary establishment for leaflet separation. Although some progress in understanding the regulatory pathways for each event have been made, it is unclear how they are intrinsically coordinated. Here, we identify the <span>PINNATE-LIKE PENTAFOLIATA2</span> (<span>PINNA2</span>) gene encoding a newly identified GRAS transcription factor in <span>Medicago truncatula</span>. <span>PINNA2</span> transcripts are preferentially detected at organ boundaries. Its loss-of-function mutations convert trifoliate leaves into a pinnate pentafoliate pattern. PINNA2 directly binds to the promoter region of the <span>LEAFY</span> orthologue <span>SINGLE LEAFLET1</span> (<span>SGL1</span>), which encodes a key positive regulator of leaflet initiation, and downregulates its expression. Further analysis revealed that PINNA2 synergizes with two other repressors of <span>SGL1</span> expression, the BEL1-like homeodomain protein PINNA1 and the C2H2 zinc finger protein PALMATE-LIKE PENTAFOLIATA1 (PALM1), to precisely define the spatiotemporal expression of <span>SGL1</span> in compound leaf primordia, thereby maintaining a proper pattern of leaflet initiation. Moreover, we showed that the enriched expression of <span>PINNA2</span> at the leaflet-to-leaflet boundaries is positively regulated by the boundary-specific gene <span>MtNAM</span>, which is essential for leaflet boundary formation. Together, these results unveil a pivotal role of the boundary-expressed transcription factor PINNA2 in regulating leaflet initiation, providing molecular insights into the coordination of intricate developmental processes underlying compound leaf pattern formation.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"7b7fce8af106644b929a87898f5d32b7a5a5f388aab6114162c18f6c58f0d74f","category":"Environment"}