{"title":"Michelle Arthurs-Brennan – Tweets sex acts and flouts lockdowns, Racist Cycling Weekly Journalist","link":"https://www.hambini.com/michelle-arthurs-brennan/","date":1607949240000,"content":"<p>Michelle Arthurs-Brennan is allegedly the technical writer for the UK cycling magazine, Cycling Weekly. The use of the term &#8220;allegedly&#8221; because the general opinion of the internet is, she has the technical knowledge of a burger flipper.</p>\n\n\n\n<p>She regularly updates her twitter followers with pointless tweets that are typical of those millennials addicted to social media. A cursory scan of this and her website, leads to the conclusion she is married and is around 30 years old. She has no formal technical qualifications or ones that she elects to publicize. She is a feminist, the faintest hint of anything she can attribute to sexism is immediately jumped upon with great glee. The connections she makes to cite sexism are usually pushing the limits of a normal person&#8217;s imagination.</p>\n\n\n\n<p>Also mentioned on her website are her cycling credentials, she runs a female only bicycle team and has qualifications as an NCT journalist (National Council for the Training of Journalists). </p>\n\n\n\n<p>Michelle thinks that as a female, she should be immune to the same level of ridicule as her male counterparts and plays the sexism card when something doesn&#8217;t go her way or she is questioned. She claims she cannot achieve a &#8220;top&#8221; job in the cycling industry because she is female. The reality is she is utterly useless, naïve, acts irresponsibly and doesn&#8217;t have the decency to admit it.</p>\n\n\n\n<p>Here are some examples of her technical incompetence, </p>\n\n\n\n<ul><li>She reviews many items at the same time. For example, to make &#8220;better use of her time&#8221; she changes wheels and tires at the same time and produces discrete reviews about both. It is widely accepted that for analysis to be valid, (where possible) only one variable should be changed at a time. Multivariable analysis does exist but this individual would probably struggle with that concept.</li><li>On reviewing the Basso Diamante bike, she commented that the bottom bracket &#8220;only moves 0.2mm and the headtube is 0.4mm&#8221;. She obviously has little understanding that the more force is applied, the more the deflection. She has read verbatim from the marketing tripe supplied by the manufacturer. She also seems completely oblivious that a movement of 0.2mm is excessive and not something to be proud of.</li><li>The list goes on&#8230;.</li></ul>\n\n\n\n<h2>She likes to publicize her sexual exploits on Twitter&#8230;</h2>\n\n\n\n<p>When you are a prominent face of the cycling media that is scrutinized on an almost minute by minute basis, no company is going to want to be associated with sexually explicit tweets from their employees like the one below which she published to her followers on twitter. She even had the audacity to state it was an &#8220;unpublishable&#8221; comment and then published it anyway to act like the consummate professional that she alleges to be:</p>\n\n\n\n<p></p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;A bad saddle is like the efforts of a ham fisted amateur, aimlessly flicking your clit (clitoris) in the desperate hope that repetition will get the job done&#8221;</p></blockquote>\n\n\n\n<p></p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"362\" height=\"640\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/mabs.jpg\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9399\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/mabs.jpg 362w, https://www.hambini.com/wp-content/uploads/2020/11/mabs-170x300.jpg 170w\" sizes=\"(max-width: 362px) 100vw, 362px\" /></figure>\n\n\n\n<p>She was clearly describing a previous sexual experience<span class=\"has-inline-color has-pale-pink-color\"> </span>where she was having her clitoris stimulated in an effort to make her orgasm by a &#8220;ham fisted amateur&#8221;.  Cringeworthy to put it mildly. </p>\n\n\n\n<p>Any employer is unlikely to want to be associated with these kinds of comments unless it was a publisher writing a sequel for Fifty Shades of Grey. Her post reads like something from the pages of an x rated website.</p>\n\n\n\n<p>Her parents are probably very proud to read the graphic details of their daughter&#8217;s orgasms and ability/inability to have them on the internet.</p>\n\n\n\n<p>Future PLC, the owners of Cycling Weekly are probably wincing.</p>\n\n\n\n<h2>She has little regard for the law. Lockdown breaker.</h2>\n\n\n\n<p>In March 2020, the UK as well as many other countries around the world entered a lockdown to stem the rising infections of Covid 19. Two days after the Lockdown was introduced and the UK government categorically stated the following: </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>You must not leave, or be outside of your home except where necessary. You may leave the home to go to work,  <strong>if you cannot reasonably do so from home</strong></p><cite>UK Government </cite></blockquote>\n\n\n\n<p>The guidance also went further and stated:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Exercise should be limited to once per day, and you <strong>should not travel outside your local area.</strong></p><cite>UK Government</cite></blockquote>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"658\" src=\"https://www.hambini.com/wp-content/uploads/2021/01/image-14-1024x658.png\" alt=\"\" class=\"wp-image-10124\" srcset=\"https://www.hambini.com/wp-content/uploads/2021/01/image-14-1024x658.png 1024w, https://www.hambini.com/wp-content/uploads/2021/01/image-14-300x193.png 300w, https://www.hambini.com/wp-content/uploads/2021/01/image-14-768x494.png 768w, https://www.hambini.com/wp-content/uploads/2021/01/image-14-600x386.png 600w, https://www.hambini.com/wp-content/uploads/2021/01/image-14.png 1126w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption>Screenshot from the gov.uk website</figcaption></figure>\n\n\n\n<p>Michelle decided to stick her middle finger up at all NHS and other Essential Workers. She cared little for those suffering due to the Pandemic and took her bike across Southern England to film a &#8220;B Roll&#8221; segment for what can be assumed to be a Cycling Weekly video. Whilst exercise was allowed under the rules at that time, it was advised to be limited to a maximum of 60 minutes per day and to avoid stopping. She stopped multiple times during this 1 hour 20-minute ride which was clearly not within her local area. </p>\n\n\n\n<p>The UK went into lockdown on 23 March 2020. She filmed on 27 March 2020. NHS hospitals reached maximum capacity <span class=\"has-inline-color has-black-color\">two weeks later which coincided  </span>with the average incubation period for Covid 19. </p>\n\n\n\n<p>She then proceeded to upload the ride to Strava and &#8220;brag&#8221; about her achievements whilst several thousand people were attached to ventilators fighting for their lives. Furthermore, she has filmed segments one handed whilst riding her bike on roads that she herself described as &#8220;rutted and bumpy&#8221;. Irresponsibility and stupidity go hand in hand with this idiotic individual #Covidiot </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"797\" height=\"1024\" src=\"https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-797x1024.jpg\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-7359\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-797x1024.jpg 797w, https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-234x300.jpg 234w, https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-768x987.jpg 768w, https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-1196x1536.jpg 1196w, https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1-600x771.jpg 600w, https://www.hambini.com/wp-content/uploads/2020/04/2020-04-18-14-54-34.00_01_49_00.Still001-1.jpg 1448w\" sizes=\"(max-width: 797px) 100vw, 797px\" /></figure>\n\n\n\n<p>This story gets even more ludicrous because Michelle had requested (to the Police) that the screenshot of her lockdown breaking ride be taken down due to privacy and claiming she was being stalked. </p>\n\n\n\n<p>If anyone wanted confirmation that she selectively applies rules, they only need to look at her Strava profile. </p>\n\n\n\n<p>On the occasions where she claims QOM&#8217;s (Queen of the Mountain, fast sectors) she actively encourages people to look at her Strava profile and even uses Cycling Weekly to promote this. Users are obviously intrigued at where she did it, how she did it and like most cyclists scrutinize each and every variable with a hope of improving their own performance or validating if the claim was motor assisted or not. </p>\n\n\n\n<p>When the same level of scrutiny was applied to her Lockdown flouting rides, she branded it as stalking and was distressed by it. The UK Police were consulted. They consider anything uploaded to social media to be fully consented by the uploader and scrutiny of it to be &#8220;fair game&#8221; so consequently, the screenshot of her ride has remained. Attempting to pass it off as stalking, especially when she has committed multiple offences is laughable and further cements her application of applying rules where she sees fit for her own selfish benefit. </p>\n\n\n\n<h2>Naïve, ignorant and stupid?</h2>\n\n\n\n<p>As proof of her ignorance and naivety, Michelle regularly uploads photographs and videos of her house to Social Media along with maps from Strava and on one occasion an entire video showing her cycle route from her home. Given that her house probably has several thousand pounds of bikes and other valuables within it, she is opening herself up for a &#8220;Strava Theft&#8221;. </p>\n\n\n\n<p>As an example, here is a photograph showing her bright red Honda Civic outside her house, complete with house number for the benefit of her followers (or thieves). </p>\n\n\n\n<p>This was posted after her car was in a crash. No doubt this was done to shame Dixons Carphone Warehouse (A large UK electrical retailer). She was naïve enough to think that insurance companies would handle an insurance claim via Twitter from a nobody writing in text speak. </p>\n\n\n\n<p>The observant would notice that these pictures were clearly taken at dusk so it is quite possible the truck driver did not see her car. Legally, she would be required to leave her parking lights on as that vehicle was not near a kerb.  </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"1002\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/image-3-1024x1002.png\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9485\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/image-3-1024x1002.png 1024w, https://www.hambini.com/wp-content/uploads/2020/11/image-3-300x294.png 300w, https://www.hambini.com/wp-content/uploads/2020/11/image-3-768x752.png 768w, https://www.hambini.com/wp-content/uploads/2020/11/image-3-600x587.png 600w, https://www.hambini.com/wp-content/uploads/2020/11/image-3.png 1127w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>She has an interesting take on her experience and an equally one sided use of journalistic language. She writes </p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;It has been 22 days since your driver hit my <strong>safely</strong> parked car&#8221;.  </p></blockquote>\n\n\n\n<p>Her use of &#8220;safely&#8221; as self-fulfilling language to justify her parking is a skill, she likely learned at Journalist school. She adopts this technique frequently in both her written and verbal media to manipulate arguments in her favor. The ironic thing is she left her lights off and thus the car was not parked safely.</p>\n\n\n\n<p>After a bit of further investigation and irrespective of the lights, anyone with half an ounce of intelligence would not park a car as wide as this Honda Civic in a location that is as narrow as the one shown below <span class=\"has-inline-color has-black-color\">(image of the actual road taken from Google Maps)</span>. The red hatched area denotes the approximate space the car in question would occupy. It is clear to see how narrow the road is.</p>\n\n\n\n<p>Given the dimensions of her car and the width of the road, she seems surprised that her wing mirror was taken off. £5k for a wing mirror, wing and door panel is plainly an exaggeration to further her cause with the insurance company.</p>\n\n\n\n<p>Questioning her choice of parking location may result in a retort of sexism or an accusation of stalking, the response to that is quite simple &#8211; don&#8217;t share it on the internet.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"485\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/image-5-1024x485.png\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9502\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/image-5-1024x485.png 1024w, https://www.hambini.com/wp-content/uploads/2020/11/image-5-300x142.png 300w, https://www.hambini.com/wp-content/uploads/2020/11/image-5-768x364.png 768w, https://www.hambini.com/wp-content/uploads/2020/11/image-5-1536x728.png 1536w, https://www.hambini.com/wp-content/uploads/2020/11/image-5-2048x970.png 2048w, https://www.hambini.com/wp-content/uploads/2020/11/image-5-600x284.png 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /></figure>\n\n\n\n<p>Michelle openly describes her sexual experiences on the internet so it is not a great surprise that she shares her best practice in spatial awareness as well. </p>\n\n\n\n<p>If pro-actively sharing her own personal information (and then complaining about it) wasn&#8217;t already enough, the internet is littered with widely published pictures of her house. It is incredible that she has the audacity to complain about criticism of her illegal Lockdown rides on Strava &#8216;for privacy&#8217; yet the entire interior of her house is available for all to see.</p>\n\n\n\n<p><a href=\"https://themovemarket.com/tools/propertyprices/253-stafford-road-caterham-tandridge-surrey-cr3-6nl\">Photographs from her house here</a></p>\n\n\n\n<p>There is a company registered at the same address, details from<a href=\"https://find-and-update.company-information.service.gov.uk/company/11423746\" target=\"_blank\" rel=\"noreferrer noopener\"> Companies house</a> show this to be registered in the name of Alvit Consultancy as a business of &#8220;information consultancy activities&#8221;. </p>\n\n\n\n<p><a href=\"https://find-and-update.company-information.service.gov.uk/company/07762463\">Michelle also has an entry at Companies House</a>, as the Director of a company called Cyclopark limited. This is interesting in itself as she was only in this position for 66 days. She was appointed on 7 June 2018 and resigned on 13 September 2018.</p>\n\n\n\n<h2>She takes the cycling community for fools</h2>\n\n\n\n<p>Here is Michelle describing her method for testing equipment that she receives (likely for free). If you can get past her rigid monotone voice that sounds like she has a severe case of nasal polyps or a permanent cold, she confidently asserts her testing technique. In short, that reviewing technique is to reel off the specification sheets from marketing departments with additional adjective ensembles lifted from 1980&#8217;s hifi magazines.</p>\n\n\n\n<p>The disorganized Ikea style furniture behind her is laden full of likely &#8220;used once&#8221; cycling paraphernalia that she has no doubt received free from various companies who were keen to get a plug from this individual that has the cheek to call herself a technical writer.</p>\n\n\n\n<p>There is a saying &#8220;It&#8217;s better to keep your mouth shut and let everyone think you are an idiot rather than open it and remove all doubt&#8221;. </p>\n\n\n\n<p>The viewer interaction feedback on the video below speaks for itself. There are more dislikes than likes which is a good indicator of what people thought about her &#8220;technique&#8221;. She was quite critical of a former sexual partner in her tweets, the same level of criticality was applied to her technical expertise by the commenters who rightly shot her down in flames.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"701\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/image-1024x701.png\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9419\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/image-1024x701.png 1024w, https://www.hambini.com/wp-content/uploads/2020/11/image-300x205.png 300w, https://www.hambini.com/wp-content/uploads/2020/11/image-768x526.png 768w, https://www.hambini.com/wp-content/uploads/2020/11/image-1536x1052.png 1536w, https://www.hambini.com/wp-content/uploads/2020/11/image-2048x1402.png 2048w, https://www.hambini.com/wp-content/uploads/2020/11/image-600x411.png 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption><a href=\"https://www.youtube.com/watch?v=uIWvPtWH82M&amp;t=148s&amp;ab_channel=CyclingWeekly\">How we review tech</a></figcaption></figure>\n\n\n\n<p>And here she is filming herself riding one handed (a criminal offence) along a rutted road. If she had crashed and ended up in hospital, that would have diverted valuable medical resources from other people who needed it, weren&#8217;t so selfish and obeyed the rules.</p>\n\n\n\n<p>This rampant disregard for the rules has not gone unnoticed by the cycling community. You don&#8217;t see it on GCN.</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"707\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/image-1-1024x707.png\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9420\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/image-1-1024x707.png 1024w, https://www.hambini.com/wp-content/uploads/2020/11/image-1-300x207.png 300w, https://www.hambini.com/wp-content/uploads/2020/11/image-1-768x530.png 768w, https://www.hambini.com/wp-content/uploads/2020/11/image-1-1536x1061.png 1536w, https://www.hambini.com/wp-content/uploads/2020/11/image-1-2048x1415.png 2048w, https://www.hambini.com/wp-content/uploads/2020/11/image-1-600x414.png 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption><a href=\"https://www.youtube.com/watch?v=uIWvPtWH82M&amp;t=148s&amp;ab_channel=CyclingWeekly\">How we review tech</a></figcaption></figure>\n\n\n\n<p>Whilst on the subject of crashing, she has clearly had an impact with an object at some point. This can be seen by the geometry of her lower front teeth. They are severely misaligned. The level of misalignment is atypical of a congenital defect, whether that is from a cycling crash is unknown. </p>\n\n\n\n<p>The cycling community obviously aren&#8217;t fools and just a few comments from this video sum this up:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Offensive to watch, I am 83 years old. Makes me sick watching this after having family members that fell ill to the Covid-19 virus, no matter what you say the harm is done. Laughing and smiling while we are in a serious crisis and breaking the lockdown. Shows a terrible narcisstic personality. I used to watch this channel with my nephew, but never again. </p></blockquote>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>Is this appropriate? 15000 in your country dead and you deem vloging some drivel as essential travel/work?</p></blockquote>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>As a mechanical engineer with specialization in fluid flow and thermodynamics, what qualifications do you have from your journalism or arts background (degrees?) other than to report (repeat?) what someone&#8217;s marketing department has written or to create invalid test protocols. BTW, I also spent time marketing in a Fortune 50 company unspinning what less competent engineers told me. Without that &#8220;unspin&#8221; capacity, you have no choice but to repeat or to report invalid test results. Finally, as a formerly sponsored amateur triathlete, I wrote several articles picked up and published word for word by media. I worry that might be the current mode of your once well respected publication</p></blockquote>\n\n\n\n<h2>Corruption in the bike industry&#8230; </h2>\n\n\n\n<p>Michelle claims to be impartial and deals with &#8220;experts&#8221; from the industry.  <a href=\"https://www.youtube.com/watch?v=8RlTcac7QUg&amp;t=19s&amp;ab_channel=CyclingWeekly\">The video below</a> was the Cycling Weekly review of &#8220;Aero Helmets&#8221;. Many suspect this video was paid for by the company, Aerocoach. Michelle&#8217;s response to this was:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>It was also suggested that the aero testing video had been paid for. This was not the case. All promotional content is marked clearly as sponsored, as per&nbsp;<a href=\"https://www.asa.org.uk/advice-online/recognising-ads-newspapers-and-magazines.html\">the rules&nbsp;</a>all media must adhere to.</p><cite>Michelle Arthurs Brennan 06 May 2020</cite></blockquote>\n\n\n\n<p>She refers to the UK Advertising Standards Agency in her response. The pertinent rule from the advertising standards agency is this:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>When an advertiser gives a publisher a ‘payment’ or an ‘other reciprocal arrangement’ (e.g. any form of monetary payment, loan of a product/service, any incentive or commission or a product/service has been given free), to create a piece of content &#8211; that content is likely to become subject to consumer protection law. When a brand also has editorial control over that content, it becomes subject to the CAP Code as well.</p><cite>UK Advertising Standards Agency</cite></blockquote>\n\n\n\n<p>In the case of this advert the &#8220;free advertising&#8221; (see further down) at the start of the video is the segment she is denying.</p>\n\n\n\n<p>To give a bit of background, this video was carried out &#8220;in conjunction&#8221; with a UK based company called Aerocoach. They are a company that makes overpriced Time Trial equipment for riders and they have a shambolic reputation for Aerodynamic engineering despite them claiming to be &#8220;The Aero Experts&#8221;.  They were ridiculed and laughed at in the comments of the video, and these were the comments that were not deleted. </p>\n\n\n\n<p>Despite this video allegedly not being paid for (note: payment does not have to be monetary), within the first 15 seconds the viewer is greeted with this:</p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1024\" height=\"698\" src=\"https://www.hambini.com/wp-content/uploads/2020/11/image-2-1024x698.png\" alt=\"Michelle Arthurs Brennan sex act racist cycling weekly writer\" class=\"wp-image-9434\" srcset=\"https://www.hambini.com/wp-content/uploads/2020/11/image-2-1024x698.png 1024w, https://www.hambini.com/wp-content/uploads/2020/11/image-2-300x205.png 300w, https://www.hambini.com/wp-content/uploads/2020/11/image-2-768x524.png 768w, https://www.hambini.com/wp-content/uploads/2020/11/image-2-1536x1047.png 1536w, https://www.hambini.com/wp-content/uploads/2020/11/image-2-2048x1397.png 2048w, https://www.hambini.com/wp-content/uploads/2020/11/image-2-600x409.png 600w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" /><figcaption><a href=\"https://www.youtube.com/watch?v=8RlTcac7QUg&amp;t=19s&amp;ab_channel=CyclingWeekly\">Which Aero Helmet is Fastest</a></figcaption></figure>\n\n\n\n<p>It does not take a rocket scientist to work out this was totally staged and the AeroCoach product placement hoarding was deliberately in full view at the very start of the video. This clearly contravenes the Advertising Standards Agency&#8217;s rules as well as YouTube&#8217;s rules as this video was not highlighted as a &#8220;paid promotion&#8221;, furthermore, Michelle explicitly denied it was paid for in monetary or other terms.</p>\n\n\n\n<p>If that amount of deviousness was not enough, Michelle has given no reason why prominent engineers were banned from commenting on the video above. It&#8217;s possible that Aerocoach asked for these individuals to be banned for fear of ridicule.  Instead, she wanted to take the opinion of Aerocoach, a company who (in the video) stated:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>&#8220;The results we see in the Velodrome match very closely to the things we see outdoors.&#8221;</p><cite>Aerocoach March 2020</cite></blockquote>\n\n\n\n<p>They claim to be &#8220;Aerodynamic Experts&#8221;, have they heard of the concept of wind? Clearly not and the comments from YouTube users were consequently scathing. It should be noted that Cycling Weekly removed many comments. </p>\n\n\n\n<p>Michelle&#8217;s responses concerning the video above have racist undertones. She describes ethnic minorities as having &#8220;not easily verifiable names&#8221; and &#8220;Pseudonyms&#8221; but provides no evidence. It is suspected that her, her husband and their close acquaintances frequent the website 4chan, a website notorious for harboring racists, pedophiles and other extremists. She has a squeaky-clean public image that she likes to portray, her real personality is being shown to the public now.</p>\n\n\n\n<h2>The Takeaways</h2>\n\n\n\n<p>Michelle clearly has some insecurity issues. She seems quite comfortable documenting her previous sexual experiences on the internet and attempts to gain a following by leveraging this. At the faintest hint of not getting her way, she claims the argument against her is &#8216;sexist&#8217;. </p>\n\n\n\n<p>She has demonstrated her ineptitude in Engineering and prefers to regurgitate verbatim from marketing brochures. The slightest criticism of her (lack of) technical knowledge is greeted with a notion of sexism, further backed up by defence from her white-knight friends in the cycling media.</p>\n\n\n\n<p>She has demonstrated total disregard for other members of society and possibly contributed to the UK&#8217;s death toll as well as putting others at risk. </p>\n\n\n\n<p>It must be quite difficult for her mentally when she gets a thorough and deserved roasting from the cycling community on an almost regular basis for her actions. Given that she claims to be a high category cyclist, it probably plays on her mind that some of her competitors at race events are likely to be sniggering and talking about her and her antics behind her back.</p>\n\n\n\n<p>She has stuck two fingers up at all of the people that have made sacrifices through a pandemic for her own self-benefit. </p>\n\n\n\n<p>Unfortunately for her, she can no longer hide under the covers and will forevermore be ridiculed for her diabolical technical knowledge, comedic sex acts (that she publishes) and mindless disregard for other people. Her car parking ability may also now be under scrutiny.</p>","author":"admin","siteTitle":"","siteHash":"cd372fb85148700fa88095e3492d3f9f5beb43e555e5ff26d95f5a6adc36f8e6","entryHash":"7b91b8f00c9ee731b6aa45e8179133c22290866d461f9a700b694dfd13e6f980","category":"Cycling"}