{"title":"Feeding ecology of Moenkhausia collettii (Steindachner, 1882) (Characiformes: Characidae) in streams in the eastern Amazon: Environmental factors and body size","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15743?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>The present study aimed to characterize the diet of <i>Moenkhausia collettii</i> and investigate possible changes due to environmental variations and its body size in streams in the eastern Amazon. The specimens were sampled monthly between April 2019 and March 2020. They were measured for standard length (SL) and total mass (Tm) and eviscerated for analysis of stomach contents. Food items were identified and grouped into categories. Dietary aspects such as food importance index (AI%), trophic niche width, and stomach repletion index (SRI%) were evaluated. Furthermore, generalized linear models (GLMs) were used to evaluate the relation between diet and the SL, as well as between diet and the environmental variables of streams. A total of 355 specimens with SL ranging from 11.06 to 46.03 mm and weight ranging from 0.020 to 2.373 g were evaluated. Out of the 355 stomachs analysed, 88 contained material in an advanced stage of decomposition and 12 were empty. The diet of <i>M. collettii</i> was considered omnivorous, with a tendency toward insectivory. Formicidae was the most important category in the diet of the species, followed by immature Diptera and plant material. The GLMs showed a relationship between the diet and a set of environmental variables such as dissolved oxygen, conductivity, flow, width, depth, wood, leaf bank, and SL. The trophic niche width and feeding intensity increased with the length of the species, as well as in the period of higher precipitation, reinforcing trophic opportunism for <i>M. collettii</i>. Therefore, new studies that combine the traditional method of stomach content analysis, the use of stable isotopes, as well as ecomorphological attributes, are crucial for a profound understanding of the trophic ecology of the ichthyofauna in the face of natural changes occurring in their environment.</p>","author":"Helusa Kyara Silva Barros, \nThiago Augusto Pedroso Barbosa, \nBruno da Silveira Prudente","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"7b92a75b639e4d60b7ee9c21f9aa11e96dbe89ae67eaffb06fe099ec1727b811","category":"Environment"}