{"title":"Quorum sensing effect of chiral d‐glutamine on the modulation of the intestinal microbiota of mice by Lactiplantibacillus plantarum A3","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13360?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Amino acids (AAs) are the building blocks of proteins, but they also serve as biological compounds in biochemical processes, and <span>d</span>-AA isomers are increasingly being recognized as important signaling molecules. As the main organic substrate used by cells in the intestinal tract, the role of the chiral specificity of glutamine is still largely ignored.</p>\n<h2>RESULTS</h2>\n<p>In a previous study, we found that <span>d</span>-glutamine affected the quorum sensing of <i>Lactiplantibacillus plantarum</i> A3, promoted the release of signaling molecule AI-2 and up-regulated the expression of the <i>LuxS</i> gene. The results showed that when <span>d</span>-glutamine and <i>L. plantarum</i> A3 were simultaneously applied to a mouse model, the diversity and abundance of intestinal flora in both male and female mice were increased. Interestingly, the simultaneous effect of <span>d</span>-glutamine and <i>L. plantarum</i> A3 on the bacterial diversity and abundance of male mice was significantly higher than that of female mice. In addition, the combination of <span>d</span>-glutamine and <i>L. plantarum</i> A3 can improve the host microecology by enhancing the population of Firmicutes such as <i>Lactobacillus</i> and <i>Lachnospiraceae</i>, reducing the population of <i>Fusobacterium</i> and <i>Bacteroides</i> and affecting metabolic pathways such as AA metabolism and transporter transport.</p>\n<h2>CONCLUSION</h2>\n<p><span>d</span>-Glutamine, as a signaling molecule, can better stimulate the endogenous <span>d</span>-glutamine synthesis in mice and be utilized by <i>L. plantarum</i> A3. Furthermore, sex differences in the changes of intestinal microflora are also found in this research. This research sheds some light on the adoption of <span>d</span>-AAs combined with lactic acid bacteria in intestinal tract health treatment. © 2024 Society of Chemical Industry.</p>","author":"Ao Zhang, \nYixing Yu, \nYouwei Ji, \nXin Tong, \nXubin Tu, \nYu Liang, \nLiwei Lian, \nDaodong Pan, \nZhen Wu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7b994165a9278018de473db35d99269378e2dfc1be5e837d4c1397ceb6ed9286","category":"Environment"}