{"title":"Kingdom (2019)","link":"https://markpeak.net/kingdom-2019/","date":1692783815000,"content":"<p>เป็นแฟนการ์ตูน Kingdom ของ Yasuhisa Hara อยู่แล้ว พอการ์ตูนถูกดัดแปลงเป็นหนังคนแสดงในปี 2019 ก็เล็งไว้นานแล้ว อยากรู้ว่าจะทำออกมาอย่างไร (ล่าสุดปี 2023 หนังออกมา 3 ภาคแล้ว) ตอนนี้หนัง 2 ภาคแรกมีให้ดูบน Netflix</p>\n<p>หนังภาค 1 หยิบเอาพล็อตช่วงต้นเรื่อง ที่สองเด็กกำพร้า ชินกับเฮียว เติบโตมาด้วยกันบนความฝันว่าจะเป็นนายพลผู้ยิ่งใหญ่ในประวัติศาสตร์ และบังเอิญว่าเฮียว มีหน้าตาคล้ายกับ “อิ๋งเจิ้ง” (ชื่อภาษาญี่ปุ่นคือ เอเซ) กษัตริย์หนุ่มของแคว้นฉิน เลยถูกนำตัวไปเป็น body double เพื่อความปลอดภัย</p>\n<p>เนื้อเรื่องในหนังหยิบเอาช่วงที่อิ๋งเจิ้งต้องต่อสู้เพื่อแย่งบัลลังก์กับน้องชายต่างแม่ เฉิงเจียว (เซเกียว) โดยมีกองกำลังชาวเขาของโยทันวา มาช่วยสนับสนุน</p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/08/kingdom3.jpg\" alt width=\"1024\" height=\"610\" srcset=\"https://markpeak.net/wp-content/uploads/2023/08/kingdom3.jpg 1024w, https://markpeak.net/wp-content/uploads/2023/08/kingdom3-300x179.jpg 300w, https://markpeak.net/wp-content/uploads/2023/08/kingdom3-768x458.jpg 768w, https://markpeak.net/wp-content/uploads/2023/08/kingdom3-700x417.jpg 700w\" /></p>\n<p><img loading=\"lazy\" src=\"https://markpeak.net/wp-content/uploads/2023/08/kingdom2.jpg\" alt width=\"1024\" height=\"422\" srcset=\"https://markpeak.net/wp-content/uploads/2023/08/kingdom2.jpg 1024w, https://markpeak.net/wp-content/uploads/2023/08/kingdom2-300x124.jpg 300w, https://markpeak.net/wp-content/uploads/2023/08/kingdom2-768x317.jpg 768w, https://markpeak.net/wp-content/uploads/2023/08/kingdom2-700x288.jpg 700w\" /></p>\n<p>เนื่องจากว่ารู้เรื่องทั้งหมดอยู่แล้ว การดูหนังเลยดูเพื่อสังเกตว่าหนังดัดแปลงจากการ์ตูนอย่างไรมากกว่า ซึ่งก็ทำออกมาได้ค่อนข้างดีเลย</p>\n<ul>\n<li>ชิน ออกมาดูกุ๊ยๆ แว้นๆ เหมือนในการ์ตูนจริง แต่กลายเป็นบทค่อนข้างน้อยและคาแรกเตอร์ดูแบนๆ</li>\n<li>เอเซ หล่อมาก หล่อเกินในการ์ตูนไปมาก โคตรเท่ เด่นกว่าพระเอกอีก</li>\n<li>โยทันวะ สวยมาก</li>\n<li>แม่ทัพโอกิ เป็นตัวละครที่น่าจะดัดแปลงออกมาเป็นหนังได้ยากมาก (คนธรรมดาที่ไหนจะหน้าตาแบบนั้น) ทำออกมาเป็นหนังก็ดูตลกๆ เล็กน้อย แต่ภาพรวมก็เหมือนดี</li>\n<li>เฮคิ หน้าเข้มกว่าในการ์ตูนมาก ชนิดว่าไม่เอ่ยชื่อไม่มีทางรู้ว่าใคร</li>\n</ul>\n<p>อันที่ชอบคือเราได้เห็นเผ่าคนป่าสวมหน้ากากแบบจริงๆ จังๆ ว่าออกมาเป็นอย่างไร ฉากแอคชั่นต่อสู้ตัวต่อตัวก็ดูเวอร์เกินเบอร์ไปนิดนึง (เตะกันทีลอยไปชนกำแพง) โปรดักชั่นรวมๆ ทำได้ดี แต่ฉากสงครามหมู่ใหญ่รู้สึกใช้คนแสดงน้อยไปหน่อยเลยดูไม่ค่อยสมจริงมาก</p>\n<p></p>\n<p>ในฐานะหนัง คิดว่า Kingdom ดัดแปลงองค์แรกของมังงะ เล่าเรื่องผ่านหนัง 2 ชม. กว่าได้ครบถ้วนในตัวดี คนที่ไม่เคยอ่านมังงะมาก่อนก็น่าจะดูรู้เรื่องและเข้าใจได้ไม่ยาก (แต่อาจไม่อินเท่ากับคนอ่านมังงะที่เข้าใจแบ็คกราวน์เรื่องมากกว่า)</p>\n<p>ในฐานะแฟน ก็แน่นอนว่าต้องไปหาภาค 2 และภาค 3 มาดูกันต่อไป</p>The post <a href=\"https://markpeak.net/kingdom-2019/\">Kingdom (2019)</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"7b9b75645757ec64766ea839d2eaf285e14bfa0d6af0667684763b7365ffef66","category":"Thai"}