{"title":"5 key climbs from the 2021 Tour de France route","link":"https://www.bikeradar.com/features/routes-and-rides/2021-tour-de-france-climbs/","date":1624622400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Col-du-Tourmalet-2019-Tour-de-France-8774bdb.jpg?quality=45&amp;resize=620,413\" />                                            <p>The <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> appears to have reverted to type for the 2021 race, with just three summit finishes and 58km of time trials – the most since 2013 – announced as part of this year’s route.</p>\n<p>The 2020 race showcased all six of France’s mountain ranges and limited time trials to just 36km – and even that was an uphill time trial on the penultimate stage.</p>\n<p>With summit finishes restricted to Montee de Tignes, Col du Portet and Luz Ardiden, the 2021 route looks to favour complete riders who can both climb and time trial.</p>\n<p>But there are still plenty of key climbs packed into the route, including a double ascent of Tour icon Mont Ventoux, the near-ever-present Col du Tourmalet and a testing newcomer in Burgundy among the highlights.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The barren slopes of Mont Ventoux return for the 2021 Tour de France.</span></figcaption><span> <i>Andia / Getty Images</i></span></div>\n<p>Ventoux will be ascended twice on stage 11, showcasing two of the three different routes up the climb, while the Signal d’Uchon features near the end of a daunting 248km stage seven.</p>\n<p>And while there is no space on the route for some Tour favourites, including the Col du Galibier and Alpe d’Huez, the race still features a selection of mouth-watering ascents.</p>\n<p>Here are five key climbs on the <a href=\"https://www.bikeradar.com/news/2021-tour-de-france-route/\">2021 Tour de France route</a>.</p>\n<h2>Signal d’Uchon – stage 7</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Stage seven features a Tour newcomer: the Signal d’Uchon.</span></figcaption><span> <i>ASO</i></span></div>\n<p>In terms of the overall race, the Signal d’Uchon is a small climb and unlikely to cause big problems for the GC contenders.</p>\n<p>But the Pearl of Morvan, as the climb is known, should not be underestimated because it makes its Tour de France debut towards the end of a 249km monster stage from Vierzon to Le Creusot.</p>\n<p>It will be a tough test for weary legs towards the end of a first week that includes a double climb of the Mur de Bretagne, the stage five individual time-trial and the likelihood of crosswinds on the way to Châteauroux the day before.</p>\n<p>Then, 230km into the Tour’s longest stage since 2000, the Signal d’Uchon arrives with a bang – ramping up to an 18 per cent maximum gradient inside the steep final two kilometres.</p>\n<p>An average gradient of 5.7 per cent across 5.7km masks an energy-sapping finale where, with 18km from the 635m summit to the stage finish, the scene could be set for an opportunistic attack.</p>\n<h2>Montée de Tignes – stage 9</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tignes returns to the Tour route having been cut from the 2019 race.</span></figcaption><span> <i>ASO</i></span></div>\n<p>The first summit finish of the 2021 Tour de France, and final climb before the first rest day, is the Montée de Tignes – back by popular demand for the conclusion of stage nine.</p>\n<p>Tignes was supposed to make its Tour debut in the 2019 race only for hail, snow and a mudslide to force an early end to the stage.</p>\n<p>Two years on and the Tour will try again, with stage nine concluding at 2,107m following a 21km climb from the valley floor.</p>\n<p>It’s not the steepest climb, with an average gradient of 5.6 per cent, but there are punchy sections to look out for and it’s the first real opportunity for the yellow jersey contenders to show their hand in the high mountains.</p>\n<h2>Mont Ventoux – stage 11</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Two ascents of Mont Ventoux feature on stage 11, first up the ‘easy’ side.</span></figcaption><span> <i>ASO</i></span></div>\n<p>Mont Ventoux is a climb steeped in Tour de France history. Tom Simpson lost his life on the mountain in 1967, while Raymond Poulidor, Eddy Merckx, Marco Pantani and Chris Froome have all won stages on the barren slopes.</p>\n<p>This is the first time since 2016 that the climb will feature at the Tour. Last time out, Froome – in the yellow jersey – was forced to run part of the way up after a crash.</p>\n<p>Whether you’re on two feet or two wheels, Ventoux is a punishing mountain, with the traditional Tour ascent from Bédoin averaging 8.8 per cent over 15.7km.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Then comes the classic Tour route from Bédoin.</span></figcaption><span> <i>ASO</i></span></div>\n<p>The Bédoin climb is the second of the two ascents on stage 11, with the peloton also tackling the Giant of Provence from the tamer Sault route (24km at 5 per cent) earlier in the race.</p>\n<p>There are three roads to the summit of Ventoux in all and, after arriving at the 1,910m peak from Bédoin, riders will then descend down the third to the finish in Malaucène.</p>\n<h2>Col du Portet – stage 17</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nairo Quintana lit up the Col du Portet in 2018. Who will triumph this time out?</span></figcaption><span></span></div>\n<p>First tackled at the Tour in 2018, the Col du Portet is a relative newcomer to the race, but the inaugural race up its steep slopes, won by Nairo Quintana, has set expectations high.</p>\n<p>Whetting the appetite, stage 17 will already have taken riders up the Col de Peyresourde (13.2km at 7 per cent) and Col de Val Louron-Azet (7.4km at 8.3 per cent) before the snake-like slopes of the Portet.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Geraint Thomas was in the yellow jersey when the Col du Portet made its Tour de France debut in 2018.</span></figcaption><span> <i>SWPix.com</i></span></div>\n<p>The Portet is relentless, with an 8.7 average gradient across the 16km climb, but steeper pitches at the start and end will sap every last sinew of energy.</p>\n<p>Long, numbing straight sections and steep hairpins make for spectacular viewing, with the gradient hitting double digits early on and holding for a good few kilometres.</p>\n<p>There are moments where it eases slightly, but the kick up out of the tunnel – on sluggish, poorly surfaced tarmac – ramps back up to more than 10 per cent for the summit finish finale.</p>\n<h2>Col du Tourmalet – stage 18</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Col du Tourmalet features on a Tour route for the 84th time.</span></figcaption><span> <i>ASO</i></span></div>\n<p>Stage 18 concludes with the 13.3km climb to Luz Ardiden, at an average gradient of 7.4 per cent, but a Tour icon serves up the aperitif: the Col du Tourmalet.</p>\n<p>As the highest paved mountain pass in the French Pyrenees, the first rider across the summit at 2,115m up will bag the <a href=\"https://www.bikeradar.com/features/tour-de-france-prize-money/\">Tour’s Souvenir Jacques Goddet prize</a>.</p>\n<p>The Tourmalet is one of the Tour’s most famous climbs and this will be the 84th time the mountain has featured in the race.</p>\n<p>The 2021 route will climb the 17.1km eastern side from Sainte-Marie-de-Campan with an average gradient of 7.4 per cent ahead of the summit finish on Luz Ardiden.</p>","author":"Colin Henrys","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"7ba338f5c53333a974320664d8eb619712fd27ab51cb34ddda0a152287ada788","category":"Cycling"}