{"title":"Flavonols improve tomato pollen thermotolerance during germination and tube elongation by maintaining reactive oxygen species homeostasis","link":"https://academic.oup.com/plcell/article/36/10/4511/7727725?rss=1","date":1722816000000,"content":"<span><div>Abstract</div>Elevated temperatures impair pollen performance and reproductive success, resulting in lower crop yields. The tomato (<span>Solanum lycopersicum</span>) <span>anthocyanin reduced</span> (<span>are</span>) mutant harbors a mutation in <span>FLAVANONE 3-HYDROXYLASE</span> (<span>F3H</span>), resulting in impaired flavonol antioxidant biosynthesis. The <span>are</span> mutant has reduced pollen performance and seed set relative to the VF36 parental line, phenotypes that are accentuated at elevated temperatures. Transformation of <span>are</span> with the wild-type <span>F3H</span> gene, or chemical complementation with flavonols, prevented temperature-dependent reactive oxygen species (ROS) accumulation in pollen and restored the reduced viability, germination, and tube elongation of <span>are</span> to VF36 levels. Overexpression of <span>F3H</span> in VF36 prevented temperature-driven ROS increases and impaired pollen performance, revealing that flavonol biosynthesis promotes thermotolerance. Although stigmas of <span>are</span> had reduced flavonol and elevated ROS levels, the growth of <span>are</span> pollen tubes was similarly impaired in both <span>are</span> and VF36 pistils. RNA-seq was performed at optimal and stress temperatures in <span>are</span>, VF36, and the <span>F3H</span> overexpression line at multiple timepoints across pollen tube elongation. The number of differentially expressed genes increased over time under elevated temperatures in all genotypes, with the greatest number in <span>are</span>. These findings suggest potential agricultural interventions to combat the negative effects of heat-induced ROS in pollen that lead to reproductive failure.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"7ba48e8f4aa533a743fabfa28b205ea1a055f73dd015b34ea8e0efe75c00c624","category":"Environment"}