{"title":"Knowledge and Beliefs of Clinical Trials Among Adults in Poland","link":"https://www.preprints.org/manuscript/202404.0381/v2","date":1713863901000,"content":"Clinical trials, by contributing to the development of diagnostics and to the search for modern, more effective, and safer therapies, have become one of the most important elements of the healthcare system. The aim of this study was to assess Poles' knowledge and beliefs about clinical trials. Methods: The survey was conducted among Poles aged 18 and over with the help of external company, Ariadna, which is an independent research panel. The questionnaire contained 22 questions, of which 13 questions concerned beliefs and attitudes towards clinical trials. Results: One thousand and seventy-nine participants took part in the study (N = 1079). The mean age of respondents was 44.96 years (SD = 16.30). Slightly more women (N = 568, 52.6%) than men (N = 511, 47.4%) took part in the study. Among the respondents, 86.5% (N = 933) were aware of clinical trials. The main sources of information about clinical trials were the media (53.8%) including the Internet (N= 355, 32.9%), TV (N = 175, 16.2%), press (N = 30, 2.8%) and radio (N = 21, 1.9%). 43.2% (N = 466) of respondents reported little knowledge of clinical trials, while more than three quarters (N = 805, 75.2%) said they would like to learn more about clinical trials. Most respondents (N = 879, 81.4%) agreed with the statement that participation in a clinical trial is completely voluntary, and more than half (N = 580, 53.7%) agreed with the statement that hospitals participating in clinical trials provide better healthcare. The statement that the results of clinical trials are made available to the public was disagreed with by 37.2% (N = 402) of participants. Only 30.3% (N = 327) of participants agreed that clinical trials should be conducted with children. Conclusions: Poles rate their knowledge of clinical trials as low and would like to learn more. To reach the largest possible group of Polish patients, parallel educational activities on multiple levels may have the best effect. Poles' knowledge of clinical trials is mainly based on commercial sources. Further studies in different groups, i.e., clinical trial patients and investigators, are needed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7bb2a07eaf4c8d8d57d77bcae5acb4cdcc8cff2a636a4780e0e6addcddfd0dec","category":"Interdisciplinary"}