{"title":"Lysine specific demethylase 1 inhibits sodium arsenite activation of HSCs by regulating SESN2/AMPK/ULK1 signaling pathway activity","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24184?af=R","date":1715774307000,"content":"<h2>Abstract</h2>\n<p>Lysine specific demethylase 1 (LSD1) is a histone demethylase that specifically catalyzes the demethylation of histone H3K4 (H3K4me1/2) and regulates gene expression. In addition, it can mediate the process of autophagy through its demethylase activity. Sestrin2 (SESN2) is a stress-induced protein and a positive regulator of autophagy. In NaAsO<sub>2</sub>-induced mouse fibrotic livers and activated hepatic stellate cells (HSCs), LSD1 expression is decreased, SESN2 expression is increased, and autophagy levels are also increased. Overexpression of LSD1 and silencing of SESN2 decreased the level of autophagy and attenuated the activation of HSCs induced by NaAsO<sub>2</sub>. LSD1 promoted SESN2 gene transcription by increasing H3K4me1/2 in the SESN2 promoter region. 3-methyladenine (3-MA) and chloroquine were used to inhibit autophagy of HSCs, and the degree of activation was also alleviated. Taken together, LSD1 positively regulates SESN2 by increasing H3K4me1/2 enrichment in the SESN2 promoter region, which in turn increases the level of autophagy and promotes the activation of HSCs. Our results may provide new evidence for the importance of LSD1 in the process of autophagy and activation of HSCs induced by arsenic poisoning. Increasing the expression and activity of LSD1 is expected to be an effective way to reverse the autophagy and activation of HSCs induced by arsenic poisoning.</p>","author":"Yingwan Zhang, \nTian Tian, \nCai Liang, \nJunli Wang, \nJiayuan Zhang, \nShanshan Tian, \nRujia Xie, \nTing Yang, \nBing Han","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7bb718511e917e8833c96f8dc708024e4a58f38d5f74eef2e60c58c02d7ec032","category":"Environment"}