{"title":"Apple Music Spatial Audio to Get Dynamic Head Tracking in the Fall","link":"https://www.macrumors.com/2021/06/08/apple-music-dynamic-head-tracking-fall/","date":1623140219000,"content":"Apple is currently <a href=\"https://www.macrumors.com/2021/06/07/apple-music-spatial-audio-lossless-available/\">rolling out</a> spatial audio and lossless audio for Apple Music, offering subscribers a more immersive and higher-quality audio experience. Later this year, however, Apple will also bring dynamic head tracking to songs in the Apple Music catalog.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/apple-music-spatial-audio.jpg\" />\r\n<br />\r\nFrom the FAQ section of a newly updated <a href=\"https://support.apple.com/en-us/HT212182\">Apple support document</a>:\r\n<br />\r\n<blockquote><strong>Is spatial audio with dynamic head tracking available for music?</strong>\r\n<br />\r\n\r\n<br />\r\nWe are excited to announce that spatial audio with dynamic head tracking is coming to Apple Music in the fall. Dynamic head tracking creates an even more immersive experience for spatial audio. It brings music to life by delivering sound that dynamically adjusts as you turn your head. And you can experience spatial audio with dynamic head tracking on AirPods Pro and AirPods Max with a compatible iPhone or iPad.</blockquote>When you consider Apple's current implementation of dynamic head tracking, it's not entirely clear how it will apply to music. In its existing form, dynamic head tracking can be experienced when watching video on iPhone and iPad with headphones that support spatial audio, but it's the video element that's key. \r\n<br />\r\n\r\n<br />\r\nSpatial audio uses the gyroscope and accelerometer in the ‌headphones‌ and the iOS device to track the motion of your head and your ‌device's position, comparing the motion data, and then remapping the sound field so that it stays anchored to your device even as your head moves.\r\n<br />\r\n\r\n<br />\r\nApple Music videos with spatial audio enabled already support dynamic head tracking in this way, but given that there's no visual element involved when listening to audio tracks, Apple presumably has a different implementation in mind that will create more depth to the listening experience. Individual instruments and effects may remain locked in place in a virtual soundstage when you turn your head, evoking the experience of being in the audience at a live gig, for example. \r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>So obviously it makes no sense for Apple Music tracks to support Spatial Audio with head tracking enabled. Imagine walking down the street wearing your AirPods Pro – it'd sound like all the instruments were emanating from your coat pocket.</p>— Tim Hardwick (@waxeditorial) <a href=\"https://twitter.com/waxeditorial/status/1394984034871222275?ref_src=twsrc%5Etfw\">May 19, 2021</a></blockquote> <blockquote><p>Circling back to this. It appears that vanilla Apple Music tracks *will* in fact support dynamic head tracking in the fall in some form.🤔 <a href=\"https://t.co/lJta1Sj7qt\">https://t.co/lJta1Sj7qt</a></p>— Tim Hardwick (@waxeditorial) <a href=\"https://twitter.com/waxeditorial/status/1402175589809897474?ref_src=twsrc%5Etfw\">June 8, 2021</a></blockquote> </div>\r\n<br />\r\nAt any rate, Apple says that Apple Music subscribers will be able to experience it for themselves \"in the fall,\" which is also when iOS 15 will be released to the public, so the two could well drop together. <div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/08/apple-music-dynamic-head-tracking-fall/\">Apple Music Spatial Audio to Get Dynamic Head Tracking in the Fall</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-spatial-audio-to-get-dynamic-head-tracking-in-the-fall.2299780/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=x-ZOdF6mNXo:rJNkTQqarPk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=x-ZOdF6mNXo:rJNkTQqarPk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/x-ZOdF6mNXo\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7bc1e1098ec3028da8a174f221f5f893fe0a15e09c4ca80de22b73ff0bd903e9","category":"Apple"}