{"title":"STUB1 promotes the degradation of HSPB1 and induces ferroptosis in lung cancer cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24296?af=R","date":1714044906000,"content":"<h2>Abstract</h2>\n<p>Lung cancer is a common malignancy characterized by ferroptosis, an iron-dependent form of cell death caused by excessive lipid peroxidation. The disruption of the ubiquitination system plays a crucial role in tumor development and spread. In recent years, there has been increasing interest in utilizing ferroptosis for lung cancer treatment; however, the precise mechanism of how ubiquitination modulates ferroptosis remains unclear. We used databases to analyze STUB1 expression patterns in lung cancer tissues compared to normal tissues and performed immunohistochemistry. The functional role of STUB1 was investigated through gain-of-function and loss-of-function experiments both in vitro and in vivo. Malondialdehyde levels, Fe2<sup>+</sup> content, and cell viability assays were employed to evaluate ferroptosis status. Downstream targets of STUB1 were identified through screening and validated using immunoprecipitation and ubiquitination assays. Our findings demonstrate that STUB1 is downregulated in lung cancer cells and functions as an inhibitor of their growth and metastasis both in vitro and in vivo while promoting ferroptosis. Mechanistically, STUB1 induces ferroptosis through E3 ligase-dependent degradation of the ferroptosis suppressor HSPB1. Furthermore, our study elucidated the specific types and sites of modification on HSPB1 mediated by STUB1. This research establishes STUB1 as a tumor suppressor influencing proliferation of lung cancer cells as well as the epithelial-mesenchymal transition process associated with it. Importantly, our work highlights the role of STUB1 in ubiquitination-mediated degradation of HSPB1, providing insights for potential treatments for lung cancer.</p>","author":"Aishanjiang Tieliwaerdi, \nAbudu Aini, \nMulatijiang Amuti, \nYiliyaer Aierken, \nMaimaitijiang Nijiati, \nBo Luo","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7bd36a09773127555c4c4fa6d252cade489c909ba3a4902ddb2fe1e33c689d13","category":"Environment"}