{"title":"The relationship between dietary phosphorus and peripheral neuropathy in the general population of the United States: A preliminary research","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299566","date":1710511200000,"content":"<p>by Chunli Wu, Zhe Wu, Yanling Chen, Huirong Xu, Kejian Li</p>\r\nBackground <p>Dietary phosphorus intake may serve as a potential predictor for peripheral neuropathy (PN). While past research has predominantly focused on the relationship between dietary phosphorus and bone health, relatively little is known about its role in the nervous system, particularly its association with PN.</p> Methods <p>A cross-sectional study was conducted using data from NHANES 1999–2004. Participants were categorized into different dietary phosphorus intake groups, and the relationship between dietary phosphorus and PN was explored using multifactorial logistic regression, restricted cubic splines (RCS) analysis, and threshold effect analysis based on dietary intake.</p> Results <p>The final study included 7726 participants, with 1378 diagnosed with PN and 6348 without. The study revealed a U-shaped non-linear relationship between dietary calcium and magnesium intake levels and PN, indicating that both excessive and insufficient dietary phosphorus intake may increase the risk of PN. Specifically, the incidence rates in the first quintile (1.433, 95% CI: 1.080–1.901), the fourth quintile (1.284, 95% CI: 1.000–1.648), and the fifth quintile (1.533, 95% CI: 1.155–2.035) significantly higher than the second quintile, with an overall trend showing a decrease followed by an increase in incidence rates. The results of RCS and threshold effect analysis indicate that when dietary phosphorus intake is below 939.44mg, the risk of PN decreases with increasing dietary phosphorus intake. On the contrary, when dietary phosphorus intake exceeds 939.44mg, the risk of PN increases with increasing dietary phosphorus intake.</p> Conclusion <p>This study reveals a U-shaped correlation between dietary phosphorus intake and PN. Future research should further elucidate the molecular mechanisms underlying this association, providing guidance for more scientifically informed dietary adjustments to prevent the occurrence of PN.</p>","author":"Chunli Wu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7bdacc08f0c9af1ff4fbb0e458f1b165d8b68f592459bf83777681c76148329f","category":"Interdisciplinary"}