{"title":"How to encrypt Time Machine backups","link":"https://www.macworld.com/article/353731/encrypt-time-machine.html","date":1630054800000,"content":"<div>\n<section><div></div></section><p>Concerned about your Mac’s startup SSD or hard disk drive falling into someone else’s hands? Encrypting the startup volume prevents access to that drive unless they know an account password password or, in some cases, possess the correct hardware to unlock the contents.</p>\n\n\n\n<p>Apple automatically enables drive encryption for the startup volume on any Intel Mac with a T2 Security Chip and on all M1-based Macs. For other Intel Macs, when you enable FileVault the startup volume becomes encrypted, too. (FileVault on all Macs also enables boot protection, which keeps your encrypted drive locked down until you validate your login with an authorized account.)</p>\n\n\n\n<p>But what of backups? If you use Time Machine via a local or networked drive, your backed-up files are easily accessible if someone detaches the drive and plugs it into another computer.</p>\n\n\n\n<p>Time Machine encompasses data encryption in one of two ways:</p>\n\n\n\n<ul><li><strong>Encrypt the backup:</strong> Time Machine lets you choose to encrypt a backup when you begin the backup process for the first time on a volume. After selecting a listed volume in the Time Machine preference pane’s Select Disk dialog, you can check “Encrypt backups.” When you click Use Disk, you’re prompted to enter a password. This can be useful if you want each backup to have a separate password,  or each person backing up over a network wants to select and retain a private password. (If you want to enable encryption later, the backup has to start from scratch; Time Machine won’t encrypt a non-encrypted archive.)</li><li><strong>Encrypt the partition:</strong> In the Finder, you can Control-click a Time Machine volume that’s formatted as HFS+ (Mac OS Extended) or APFS, select <em>Encrypt</em>, and enter a password, and the entire volume becomes encrypted. When you select the volume for a Time Machine backup, it automatically checks the “Encrypt backups” box—because the volume is encrypted. You should not be prompted for the volume’s password as it’s already mounted.</li></ul><div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-encrypt-external-drive-1.png?w=1106\" /><figcaption>You can opt to encrypt an entire Time Machine volume.</figcaption></figure></div>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-select-time-machine-backup-for-encryption.png?w=1002\" /><figcaption>Select a volume and check “Encrypt backups” to encrypt a specific backup.</figcaption></figure></div>\n\n\n\n<p>In the Time Machine preference pane, the current backup volume or backup will show the word Encrypted under the volume’s name when encryption is active.</p>\n\n\n\n<p>The password you enter should be strong and you need to store it on your own—macOS doesn’t make a record in the system Keychain. You can use 1Password or another manager to keep a record. Or use another system that lets you keep encrypted notes. Even write it in a paper notebook you can keep secure—though it doesn’t help you if it’s lost, stolen, or destroyed.</p>\n\n\n\n<p>Time Machine should secure the password to the volume or backup as long as you’re in the current session. After restarting and in some other cases, you may be prompted to re-enter the volume password. You may never be asked to re-enter for a local or networked Time Machine backup password unless you change your backup destinations for the Mac you’re backing up.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Bill.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7be59995846334b9f9c3060b30a91d53d2fe2a35c12758b7ed236ebb48f8c2d1","category":"Apple"}