{"title":"As-Built Monitoring of Concrete Structures","link":"https://www.preprints.org/manuscript/202407.1809/v1","date":1721749959000,"content":"In the digital age, 3D as-built monitoring of structures and buildings  is becoming increasingly important. It provides the basis for automated quality  control and progress monitoring through as-built and as-planned model- comparisons, as well as 3D modelling for automated repair, refurbishment and  reuse in existing construction. Especially for 3D model-based manufacturing  processes such as additive manufacturing, efficient as-built monitoring is essen- tial to ensure the quality and accuracy of buildings and products.  Therefore, three different 3D scanning devices have been evaluated for 3D as- built monitoring of concrete structures with different characteristics: An indus- trial handheld laser scanner commonly used in automotive and mechanical en- gineering, a mobile device with lidar for commercial public use, and a terrestri- al laser scanner commonly used for surveying. The devices were tested on 3D  printed, cast, and assembled structures of different sizes and geometries.   The scan results are compared to the as-planned models based on their dimen- sional distances using Cloud-to-Cloud Comparison (C2C). The results show  that the applicability is highly dependent on the size, geometric complexity and  surface texture of the concrete structures. While small and flat structures can be  captured completely and with micrometer accuracy using the handheld industri- al laser scanner, terrestrial laser scanners are suitable for capturing large struc- tures and environments. The handheld, photogrammetry-based mobile device  has demonstrated the broadest applicability for concrete structures. The accura- cy and coverage of the point cloud results were respectively high. Therefore,  photogrammetry-based scanning with advanced mobile devices is a cost- effective, fast and portable alternative for 3D as-built monitoring and data ac- quisition of a wide range of concrete structures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7bed7851fe776608464a2177d0d8b678b115e30a6ee29457d44850001e3f1de3","category":"Interdisciplinary"}