{"title":"Machine Learning for Predicting Neutron Effective Dose","link":"https://www.preprints.org/manuscript/202404.1821/v1","date":1714275525000,"content":"The calculation of effective doses is crucial in many medical and radiation fields, in order to ensure safety and compliance with regulatory limits. Traditionally, Monte Carlo codes using detailed human body computational phantoms have been used for such calculations. Monte Carlo dose calculations can be time-consuming and require expertise in different processes when building the computational phantom and dose calculations. This study employs various machine learning (ML) algorithms to predict the organ doses and effective dose conversion coefficients (DCCs) for different anthropomorphic phantoms. A comprehensive data set comprising neutron energy bins, organ labels, masses, and densities is compiled from Monte Carlo studies, and is used to train and evaluate the supervised ML models. This study includes a broad range of phantoms, including those from the International Commission of Radiation Protection (ICRP-110, ICRP-116 phantom), the Visible-Human Project (VIP-man phantom), and the Medical Internal Radiation Dose Committee (MIRD-Phantom), with row data prepared using numerical data and organ categorical labeled data. Extreme gradient boosting (XGB), gradient boosting (GB), and the random forest-based Extra Trees regressor are employed to assess the performance of the ML models against published ICRP neutron DCC values using the mean square error, mean absolute error, and R² metrics. The results demonstrate that the ML predictions significantly vary in lower energy ranges and vary less in higher neutron energy ranges, while showing good agreement with ICRP values at mid-range energies. Moreover, the categorical data models align closely with the reference doses, suggesting the potential of ML in predicting effective doses for custom phantoms based on regional populations, such as the Saudi voxel-based model. This study paves the way for efficient dose prediction using ML, particularly in scenarios requiring rapid results without extensive computational resources or expertise. The findings also indicate potential improvements in data representation and the inclusion of larger data sets to refine model accuracy and prevent overfitting. Thus, ML methods can serve as valuable techniques for the continued development of personalized dosimetry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7bfae1de8cb08fdea1b55f462b4dded8db4209dd03458731604fb1812e0897fa","category":"Interdisciplinary"}