{"title":"The association between smoking and cervical human papillomavirus infection among women from indigenous communities in western Botswana","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302153","date":1717768800000,"content":"<p>by Billy M. Tsima, Keneilwe Motlhatlhedi, Kirthana Sharma, Patricia Rantshabeng, Andrew Ndlovu, Tendani Gaolathe, Lynnette T. Kyokunda</p>\r\nIntroduction <p>Cervical cancer, a malignancy caused by infection with oncogenic human papillomavirus, disproportionally affects women from low resource settings. Persistence of human papillomavirus infection may mediate an association between tobacco use and cervical cancer. In limited resource settings, women from indigenous communities are often marginalized and do not benefit from evidence-based interventions to prevent tobacco use or cervical cancer due to the limited reach of mainstream healthcare services to these communities. This study determined the association between smoking and high-risk human papillomavirus infection among women from indigenous communities in western Botswana.</p> Methods <p>A cross-sectional study of women in indigenous communities was conducted between June and October 2022. Demographic, clinical and self-reported smoking data were collected. Cervical cytology and HPV DNA testing for high-risk human papillomavirus genotypes were performed. Multilevel multivariable logistic regression models were fit to evaluate the association between smoking and high-risk human papillomavirus infection while adjusting for potential confounders.</p> Results <p>A total of 171 participants with a median (interquartile range) age of 40 (31–50) years from three settlements and two villages were recruited for the study. Of these, 17% were current smokers, 32.8% were living with HIV and high-risk human papillomavirus DNA was detected in 32.8% of the cervical specimens. Women who were current smokers, were nearly twice as likely to have cervical high-risk human papillomavirus infection compared to non-smokers (Adjusted Odds Ratio (95% CI); 1.74(1.09, 2.79)) after controlling for confounders.</p> Conclusion <p>These data underscore the need for effective tobacco control to help mitigate cervical cancer risk in this setting. These findings can help inform decisions about targeted cervical cancer prevention and tobacco cessation interventions for women from indigenous communities.</p>","author":"Billy M. Tsima","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7bfb81ff724d356d78d1f0a30e1294bdb9a206834945c1264027b3db40446786","category":"Interdisciplinary"}