{"title":"Hibifolin protected pro‐inflammatory response and oxidative stress in LPS‐induced acute lung injury through antioxidative enzymes and the AMPK2/Nrf‐2 pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24233?af=R","date":1718077862000,"content":"<h2>Abstract</h2>\n<p>ALI is a grave medical ailment that manifests as abrupt inflammation of the lungs and diminished oxygen levels. It poses a considerable challenge to the medical fraternity, with elevated rates of morbidity and mortality. Our research endeavors to investigate the potential of hibifolin, a flavonoid glucuronide, imbued with potent antioxidant properties, and its molecular mechanism to combat LPS-induced ALI in mice. The study utilized ICR mice to create an ALI model induced by LPS. Prior to LPS administration, hibifolin was given at 10, 30, or 50 mg/kg, or dexamethasone was given at 1 mg/kg to assess its preventative impact. Changes in lung tissue, pulmonary edema, and lipid peroxidation were analyzed using H&amp;E stain assay, lung wet/dry ratio assay, and MDA formation assay, respectively. Activity assay kits were used to measure MPO activity and antioxidative enzymes (SOD, CAT, GPx) activity in the lungs. Western blot assay was used to determine the phosphorylation of Nrf-2 and AMPK2 in the lungs. Hibifolin demonstrated a concentration-dependent improvement in LPS-induced histopathologic pulmonary changes. This treatment notably mitigated pulmonary edema, lipid peroxidation, and MPO activity in ALI mice. Additionally, hibifolin successfully restored antioxidative enzyme activity in the lungs of ALI mice. Moreover, hibifolin effectively promoted Nrf-2 phosphorylation and reinstated AMPK2 phosphorylation in the lungs of ALI mice. The results indicate that hibifolin could effectively alleviate the pathophysiological impact of LPS-induced ALI. This is likely due to its antioxidative properties, which help to restore antioxidative enzyme activity and activate the AMPK2/Nrf2 pathway. These findings are valuable in terms of enhancing our knowledge of ALI treatment and pave the way for further investigation into hibifolin as a potential therapeutic option for lung injuries.</p>","author":"Yung‐Lun Ni, \nHuan‐Ting Shen, \nYan‐Yan Ng, \nShih‐Pin Chen, \nShiuan‐Shinn Lee, \nChing‐Chi Tseng, \nYung‐Chuan Ho, \nYu‐Hsiang Kuan","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7bfd25228ad99d563266b2a238e0d2ee1a93f1d958ca3fb74dbf5a9daea2e5a2","category":"Environment"}