{"title":"Mining versus Indigenous Protected and Conserved Areas: Traditional Land Uses of the Anisininew in Red Sucker Lake First Nation, Manitoba, Canada","link":"https://www.preprints.org/manuscript/202404.1458/v1","date":1713853154000,"content":"Indigenous traditional land uses, including hunting, fishing, sacred activies and land-based education at Red Sucker Lake First Nation (RSLFN) in Manitoba, Canada are impacted by mining. Traditional land use maps and interviews were undertaken with 21 Indigenous people from RSLFN, showing many traditional land uses are concentrated on greenstone belts. The interviews revealed that mining exploration has resulted in large petroleum spills, noise distress, personal property destruction, wildlife die-offs and animal population declines, which negatively impact RSLFN’s traditional land use practices, ecosystem integrity, and community health. Red Sucker Lake First Nation (RSLFN) people want their territories’ land and water protected for traditional uses, culture and ecological integrity. Towards this goal, their Island Lake Tribal Council sought support for an Indigenous-protected and conserved area (IPCA) in their territory outside of existing mining claims, but without success. Governments need to partner with Indigenous nations to reach their biodiversity targets, particularly considering northern Canada’s peatlands, including those in Island Lake, surpassing the Amazon forests for carbon storage. Critical minerals and gold’s role in renewable energy and geopolitics have colonial governments undermining Indigenous rights, climate stabilization and biodiversity. With extractivism prioritized, the environmental impacts of mining extend to not only the mines but also the extensive development required to facilitate extraction including roads, hydro and ports to ship the minerals with proposals for a national Northern Corridor to run nearby.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7bfd4e3f33f6afc20e338ad253ff5a69fc5c01bfb1f5cd0feda7c52b3bba63f0","category":"Interdisciplinary"}