{"title":"Self‐organised pattern formation promotes consumer coexistence by fluctuation‐dependent mechanisms","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14663?af=R","date":1727178268000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9f152b17-3227-4772-911d-f6496c6e4ab6/fec14663-toc-0001-m.png\" alt=\"Self-organised pattern formation promotes consumer coexistence by fluctuation-dependent mechanisms\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/13/species-coexist-by-shaping-the-environment-to-aid-competitors/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nIn spatially extended ecosystems, habitat heterogeneity facilitates coexistence of species if each competitor experiences environmental conditions in a particular habitat that provide a growth advantage compared to other species, thereby making it locally competitively superior. If the competitive hierarchy among species is the same everywhere, heterogeneity-facilitated coexistence is possible provided that superior competitors disperse maladaptively towards unfavourable habitats or if they hedge insufficiently against fluctuating environmental conditions.\n\nWe use a generic two-patch metacommunity model to show that the latter mechanisms also operate in metacommunities with homogeneous habitat quality when heterogeneous biomass distributions emerge from self-organised pattern formation. The model consists of an abiotic resource, an autotroph producer and two competing heterotroph consumer species of which one is always competitively inferior to the other, irrespective of resource availability.\n\nIf the induced biomass patterns are static in time, a lower dispersal rate can allow the inferior competitor to avoid competitive exclusion by retaining most of its biomass in the patch with the higher resource density. However, if the biomass patterns fluctuate spatio-temporally, the inferior competitor must adopt a higher dispersal rate than the superior competitor to persist. This increased movement enables the inferior competitor to effectively distribute its biomass across space, thereby achieving a higher growth rate during periods of recovery from local population minima.\n\nStrikingly, we find a novel coexistence mechanism that emerges if the competitors differ in their abilities to induce pattern formation. Similar to relative nonlinearity in resource use (based e.g. on a gleaner–opportunist trade-off), the dominant species modifies the spatial or spatio-temporal variation in the distribution of the resource in a way that favours its competitor. This prevents competitive exclusion due to differently effective dispersal strategies.\n\nWe conclude that while temporal instabilities that cause, for example, predator–prey oscillations are usually regarded as jeopardising species' persistence, spatial instabilities that give rise to self-organised pattern formation should be interpreted more positively, as they provide a generic mechanisms for maintaining diversity in metacommunities without requiring a priori habitat heterogeneity.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/13/species-coexist-by-shaping-the-environment-to-aid-competitors/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Zusammenfassung</h2>\n<p>1. Die Koexistenz von miteinander konkurrierenden Arten kann in natürlichen Ökosystemen durch räumliche Heterogenität ermöglicht werden, wenn jede Art in einem bestimmten Lebensraum Umweltbedingungen vorfindet, die ihr einen Wachstumsvorteil gegenüber anderen Arten verschaffen. Ist die Konkurrenzstärke aller Arten hingegen überall gleich (d.h. in jedem Habitat dominiert die gleiche Art), ist die Koexistenz durch räumliche Heterogenität nur möglich, wenn die konkurrenzstärkeren Arten höhere Ausbreitungsverluste erleiden als die konkurrenzschwächeren Arten oder nicht in der Lage sind, sich gegen schwankende Umweltbedingungen abzusichern.</p>\n<p>2. Anhand eines generischen Modells, welches die Populationsdynamiken eines Nahrungsnetzes auf zwei unterschiedlichen, miteinander verbundenen Habitaten beschreibt, zeigen wir, dass die letztgenannten Mechanismen auch in Metagemeinschaften mit homogener Habitatqualität wirken, wenn heterogene Biomasseverteilungen durch selbstorganisierte Musterbildung entstehen. Das Modell umfasst eine abiotische Ressource, einen autotrophen Produzenten und zwei konkurrierende heterotrophe Konsumentenarten, von denen eine immer konkurrenzstärker ist als die andere, unabhängig von der Ressourcenverfügbarkeit.</p>\n<p>3. Wenn die induzierten räumlichen Biomasseunterschiede zeitlich statisch sind, kann eine geringere Verbreitungsrate des schwächeren Konkurrenten dessen Überleben ermöglichen, indem er den größten Teil seiner Biomasse in dem Habitat mit der höheren Ressourcendichte zurückhält. Wenn die räumlichen Biomasseunterschiede jedoch zeitlichen Schwankungen unterliegen, muss der schwächere Konkurrent eine höhere Verbreitungsrate als der stärkere Konkurrent aufweisen, um zu überleben. Dies ermöglicht es dem schwächeren Konkurrenten, positive Wachstumsphasen in den jeweiligen Habitaten aufgrund einer höheren Anfangsbiomasse effektiver auszunutzen.</p>\n<p>4. Bemerkenswerterweise finden wir einen neuartigen Koexistenzmechanismus, der entsteht, wenn sich die Konkurrenten in ihren Fähigkeiten, Musterbildung (d.h. räumliche Biomasseunterschiede) zu induzieren, unterscheiden. Ähnlich wie bei der Koexistenz durch relative Nichtlinearität in der Ressourcennutzung (z. B. aufgrund des sog. Gleaner-Opportunist-Trade-offs) verändert die dominante Art die räumliche oder räumlich-zeitliche Variation in der Verteilung der Ressource auf eine Weise, die ihren Konkurrenten begünstigt. Dies verhindert das vollständige Verdrängen von Konkurrenten aufgrund unterschiedlich effektiver Verbreitungsstrategien.</p>\n<p>5. Zeitliche Instabilitäten, die z. B. Räuber-Beute-Oszillationen zugrundeliegen, werden in der Regel als Gefahr für das Fortbestehen von Arten angesehen. Demgegenüber sollten räumliche Instabilitäten, die zu selbstorganisierter Musterbildung führen, positiver interpretiert werden, da sie einen generischen Mechanismus für den Erhalt von Biodiversität in Metagemeinschaften bieten, ohne a priori Unterschiede in den Habitaten zu erfordern.</p>","author":"Christian Guill, \nFelix Nößler, \nToni Klauschies","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"7c0e5040b3544d004acbb79bbba86702db6695d22960e685b0782f26e72b528e","category":"Environment"}