{"title":"Halogen Cycling in the Solid Earth","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-111700?TRACK=RSS","date":1721692800000,"content":"<div><p>Each of the halogens constrains a different aspect of volatile cycling in the solid Earth. F is moderately incompatible in the mantle and has a low mobility at Earth's surface, meaning that it is preferentially retained in the mantle and continental crust. In contrast, Cl, Br, and I are strongly incompatible and highly soluble. Chloride is the dominant anion in seawater and many geofluids and a major component of evaporite minerals. Br and I are essential for life and significantly incorporated into organic matter that accumulates in marine sediments. Surficial fluids circulated into continental and oceanic crust incorporate surface-derived halogens into alteration minerals. As a result, subducting slabs and arc lavas are weakly enriched in F and strongly enriched in Cl, Br, and I. Subduction has maintained mantle Cl and Br concentrations at relatively constant levels since Earth's early differentiation, but mantle I/Cl has decreased over time.\n</p><ul>\n<li><span>▪ \n</span>Halogen abundances on the early Earth were affected by I partitioning into Earth's core and possible loss of hydrophilic Cl, Br, and I in an early formed ocean.\n</li>\n<li><span>▪ \n</span>Halogens are powerful tracers of subduction zone processes on the modern Earth, with Cl, Br, and I having a dominantly subducted origin in Earth's mantle.\n</li>\n<li><span>▪ \n</span>The deep subduction cycles of Cl, Br, and I are more similar to that of H<span>2</span>O than they are to F, but the geochemical cycle of each halogen differs in detail.\n</li>\n<li><span>▪ \n</span>Halogen abundance ratios and stable isotope ratios vary systematically in Earth's surface reservoirs, meaning that halogens are powerful tracers of geological fluids and melts.\n</li>\n</ul><p></p></div>","author":"Mark A. Kendrick","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"7c2558fd38094efc7d6969055cc2c25801c1273a9427222d9a66f7385edbbd61","category":"Environment"}