{"title":"The Changing Hydrology of an Irrigated and Dammed Yangtze River: Streamflow, Extremes, and Lake Hydrodynamics","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037841?af=R","date":1727693663000,"content":"<h2>Abstract</h2>\n<p>Understanding the role of anthropogenic activities in the hydrological cycle is critical to support sustainable water management for the Yangtze River Basin (YRB), which experiences extensive dam operation, irrigation and water withdrawal. However, this remains challenging due to insufficient accuracies of existing process-based models for fully depicting anthropogenic activities as part of the hydrological cycle. To this end, this study enhances a national-scale coupled land surface-hydrologic-hydrodynamic model (CLHMS) with a dynamic irrigation scheme for distinct crops, an extended reservoir operation scheme incorporating both water storage anomalies and water demand anomalies, and a cost-function-based approach to link water demands with reservoir operation. The enhanced model is extensively validated against historical streamflow, water storage of 90 reservoirs, and irrigation water withdrawal in the YRB, and the water level and storage of the Poyang Lake (PYL). By setting up controlled experiments in the YRB, we show that the streamflow decreases by 2%–6% due to irrigation and water withdrawal, and manifests an attenuated seasonality due to reservoir operation. At the basin scale, the increasing trend of extreme flood peaks exhibits a reversal under human activities, with the flood mitigation effect of irrigation and water withdrawal accounting for up to 50% of that of reservoir operation. The hydrodynamics of the PYL also exhibits considerable human-induced alterations, with a 1.79 m-decrease in the water level at the end of flood season. Our study sheds light on quantifying anthropogenic hydrologic impacts at basin scales, with important implications for understanding the co-evolution between anthropogenic activities and the hydrological cycle.</p>","author":"Haoran Hao, \nNingpeng Dong, \nMingxiang Yang, \nJianhui Wei, \nXuejun Zhang, \nShiqin Xu, \nDenghua Yan, \nLiliang Ren, \nGuoyong Leng, \nLu Chen, \nXudong Zhou, \nHao Wang, \nLijuan Song, \nHarald Kunstmann","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"7c2ac4ca33a0bd22e28807a287f57cae76646c8ba1891a21c96a5714bf5a25e1","category":"Environment"}