{"title":"Comparison of SF-36 and RAND-36 in Cardiovascular Diseases. A Reliability Study","link":"https://www.preprints.org/manuscript/202409.0158/v1","date":1725349641000,"content":"Background/Objectives: Cardiovascular diseases are one of the leading causes of morbidity and mortality worldwide. Health-related quality of life is crucial to assess the impact of cardiovascular diseases and to guide therapeutic strategies. The Short Form 36 Health Survey and the RAND 36-Item Health Survey questionnaires are common tools for measuring health-related quality of life in patients with cardiovascular disease, but their reliability may vary according to the population studied. The aim of this study is to compare the reliability of the SF-36 and the RAND-36 in a population with cardiac pathology, addressing the question of which of these instruments offers a more consistent and useful measurement in this specific group. Methods: Cross-sectional observational study carried out at the University Hospital of Burgos (Spain). 413 patients with cardiovascular pathology referred to the Cardiac Rehabilitation Unit were included. Patients with incomplete data or who did not participate in the program were excluded. Internal consistency (Cronbach’s alpha), item-total correlation and reliability and a half-half analysis were performed. Results: Both questionnaires showed similar and adequate reliability for patients with cardiovascular pathology. Internal consistency, as measured by Cronbach’s alpha, was above 0.80 for most dimensions, supporting its robustness. Significant inter-item and inter-dimension correlations were found in both scales, except in some specific cases in the dimension ‘Physical Functioning’. The half-half analysis confirmed the good reliability of both scales. Conclusions: Both the SF-36 and the RAND-36 are highly reliable tools for assessing health-related quality of life in patients with cardiovascular disease. The results may have significant implications for clinical practice, helping in the selection of health-related quality of life monitoring instruments and in the evaluation of the efficacy of therapeutic interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7c2be5fbc40c62264f0f91128efc989dca3184a8bd0e86ed34d73ca1f1a68c0b","category":"Interdisciplinary"}