{"title":"Enhanced forward osmosis desalination of brackish water using phase‐separating ternary organic draw solutions of hydroxypropyl cellulose and propylene glycol propyl ether","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11110?af=R","date":1724043609000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/cf0a6581-fa30-4817-b2c2-7d1f802053a7/wer11110-toc-0001-m.png\" alt=\"Enhanced forward osmosis desalination of brackish water using phase-separating ternary organic draw solutions of hydroxypropyl cellulose and propylene glycol propyl ether\" />\n<p>Propylene glycol propyl ether and hydroxypropyl-based draw solutions for forward osmosis process provides high osmotic pressure with easy regeneration using phase separation method.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This study introduces draw solutions for application in forward osmosis (FO) processes, combining mono propylene glycol propyl ether (PGPE) with the cellulose derivative hydroxypropyl cellulose (HPC). A total of 16 unique single-solute and ternary organic draw solutions were prepared and evaluated, leading to the selection of three promising solutions for further investigation. Notably, eight of the initial organic draw solutions demonstrated osmotic pressures exceeding 2.4 MPa. The dynamic viscosities of all draw solutions exhibited a significant reduction with increasing temperature. Among the investigated solutions, the 0.25HPC-3.75PGPE demonstrated the most favorable FO performance, achieving average experimental water fluxes of 11.062 and 9.852 Lm<sup>−2</sup> h<sup>−1</sup> (LMH) against a 1 g/L NaCl brackish feed solution across two FO runs.</p>\n<h2>Practitioner Points</h2>\n<p>\nHydroxypropyl cellulose (HPC, MW ~100,000) was mixed with propylene glycol propyl ether (PGPE) as draw solutes for FO processes.\nSeven combinations of HPC and PGPE produced osmolalities greater than 1000 mOsm/kg.\n0.5HPC-7.5PGPE ternary draw solution achieved experimental water fluxes of 11.062 and 9.852 LMH against 1 g/L NaCl brackish feed solution.\nLeveraging the LCSTs of these ternary organic solutions holds promise for improved separation and regeneration processes.\n</p>","author":"Kudzai Hamish Ruzvidzo, \nRaminder Kaur, \nManish Jain","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"7c315cce7d526332b67b6c5f0f7c7e7ba48ff5e7f0edeb5647f4c43cbb118d4b","category":"Environment"}