{"title":"Notice to Developers: You Could Be Entitled to Between a $250 and $30,000 Payment From Apple","link":"https://www.macrumors.com/2021/08/27/apple-small-developer-assistance-fund/","date":1630072544000,"content":"Apple on Thursday evening announced it has <a href=\"https://www.macrumors.com/2021/08/26/app-store-changes-developer-lawsuit-settlement/\">reached a $100 million settlement</a> that, pending court approval, will resolve a class action lawsuit from U.S. developers who alleged that Apple has a monopoly on the distribution of iOS apps and in-app purchases.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/app-store-gold-banner.jpeg\" />\r\n<br />\r\nAs part of the settlement, some U.S. developers would be entitled to receive a payment from Apple, so long as they meet certain requirements.\r\n<br />\r\n\r\n<br />\r\n<h3>Who is eligible for a payment from Apple?</h3>\r\n<br />\r\nAccording to law firm Hagens Berman, which brought the lawsuit against Apple in 2019, the class includes any current or former U.S. developer of an iOS app that earned less than $1 million through the U.S. App Store in paid downloads and/or in-app purchases/subscriptions per calendar year between June 4, 2015 and April 26, 2021.\r\n<br />\r\n\r\n<br />\r\n<h3>How can I submit a claim for a payment from Apple?</h3>\r\n<br />\r\nEligible developers will be able to submit a claim through the website <a href=\"https://smallappdeveloperassistance.com/\">SmallAppDeveloperAssistance.com</a> once the settlement has received court approval.\r\n<br />\r\n\r\n<br />\r\n<h3>When can I submit a claim for a payment from Apple?</h3>\r\n<br />\r\nDevelopers can sign up on <a href=\"https://smallappdeveloperassistance.com/\">SmallAppDeveloperAssistance.com</a> to be notified when the site launches. No specific timeframe has been provided, but in a court filing, law firm Hagens Berman proposed that the claims period begin within 45 days after court approval. Developers would then have a proposed 120 days to submit a claim.\r\n<br />\r\n\r\n<br />\r\n<h3>How much will my payment be from Apple?</h3>\r\n<br />\r\nEligible developers will be able to receive a payment between $250 and $30,000 from Apple depending on their total App Store earnings between June 4, 2015 and April 26, 2021, as outlined in the chart below from the settlement filing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/apple-developer-settlement-chart.jpg\" />\r\n<br />\r\nAccording to law firm Hagens Berman, a 100% claims rate is not likely, meaning that not all eligible developers will file for a payment from Apple. In that event, the law firm said the minimum payment amounts will increase proportionally, meaning that eligible developers may ultimately receive a larger payment from Apple.\r\n<br />\r\n\r\n<br />\r\nAny leftover funds after payments to developers who submitted a claim would be sent to Girls Who Code, a non-profit organization that works to close the gender gap in computer science and programming, according to the settlement filing.\r\n<br />\r\n\r\n<br />\r\n<h3>Why did Apple agree to this settlement?</h3>\r\n<br />\r\nAccording to the settlement filing, class members who do not opt out \"expressly agree to the appropriateness of Apple's commission structure\" for the App Store, including the Small Business Program. Class members also release their claims against Apple, including any claim that they were \"overcharged\" by virtue of Apple's commission on paid app downloads and/or in-app purchases/subscriptions through the App Store.\r\n<br />\r\n\r\n<br />\r\n<h3>Can I opt out of the settlement?</h3>\r\n<br />\r\nYes. Developers who opt out of the class action lawsuit will not be eligible for a payment from Apple but will retain their individual rights to sue Apple for the claims alleged in the complaint. Details on the opt-out process will likely be shared on the settlement website once it is live, or developers can contact law firm Hagens Berman.\r\n<br />\r\n\r\n<br />\r\n<h3>Where can I get more details about the lawsuit?</h3>\r\n<br />\r\nThe class action lawsuit, Cameron et al v. Apple Inc., was filed in the U.S. District Court for the Northern District of California in June 2019. U.S. District Judge Yvonne Gonzalez Rogers presided over the case. The original complaint is <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.343004/gov.uscourts.cand.343004.1.0_2.pdf\">available on CourtListener</a> and more details are available <a href=\"https://www.hbsslaw.com/cases/apple-ios-app-developers\">on law firm Hagens Berman's website</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2021/08/27/apple-small-developer-assistance-fund/\">Notice to Developers: You Could Be Entitled to Between a $250 and $30,000 Payment From Apple</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/notice-to-developers-you-could-be-entitled-to-between-a-250-and-30-000-payment-from-apple.2308899/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=49-6ZFoxHYs:uOoLF90mfyA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=49-6ZFoxHYs:uOoLF90mfyA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/49-6ZFoxHYs\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7c3b32e5cd90d16ed596f3420fbe6ab8ebbafad006acd5fe50152273c3e904d2","category":"Apple"}