{"title":"Propeller Effects and Elasticity in Aerodynamic Analysis of Small Propeller-Driven Aircraft","link":"https://www.preprints.org/manuscript/202406.0862/v1","date":1718207333000,"content":"The impact of propeller effects and power contribution on the aerodynamics of small aircraft is indispensable. The aerodynamic analysis of wings in flight varies from rigid wing analysis due to wing deflection caused by transferred aerodynamic loads. This paper investigates the intertwined influence of propeller effects and elasticity on the aerodynamics of small propeller-driven aircraft. Through a detailed methodology, a twin-engine propeller-driven aircraft is analyzed as a case study, providing insights into the proposed approach. Two critical analyses are presented: an examination of propeller effects in rigid aircraft and the incorporation of elastic wing properties. The former establishes a foundational understanding of aerodynamic behaviour, while the latter explores the impact of wing elasticity on performance. Validation is achieved through comparative analysis with wind tunnel test results from a similar rigid structure aircraft. Utilizing NASTRAN software, aerodynamic analysis of the elastic aircraft is conducted, complemented by semi-empirical insights. The results highlight the importance of these factors across different angles of attack. Furthermore, deviations from the rigid aircraft configuration emphasize the considerable influence of static aeroelasticity analysis, notably increasing longitudinal characteristics by approximately 20%, while showing a lower impact of 5% in lateral-directional characteristics. This study contributes to enhanced design and operational considerations for small propeller-driven aircraft, with implications for future research and innovation, particularly for the purpose of efficient concepts in advanced air mobility.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7c3d933cef95ab41c7da34c107967a0066f01308bf221caf12d14702603a708c","category":"Interdisciplinary"}