{"title":"Total cycling protection with ABUS","link":"https://www.cyclist.co.uk/sponsored/9876/total-cycling-protection-with-abus","date":1626172007000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>14 Jul 2021</span></div>    </div></div><p>\nABUS helmets don’t just compete at the top level, the brand offers a complete range of best-in-class designs </p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/abus_advertorial.jpg?itok=Vun1gBzH\" />  </div>\n<div>\n      <p> <em>(Clockwise from top left): ABUS Aventor; ABUS Macator; ABUS Viantor; ABUS Viantor; ABUS StormChaser</em></p>\n<p><strong>ABUS helmets don’t just compete at the top level, the brand offers a complete range of best-in-class designs </strong></p>\n<p>Top-tier ABUS helmets like the Airbreaker and Gamechanger are a common sight on the heads of team Movistar pros as they compete for glory on the WorldTour.</p>\n<p>Riders like Alejandro Valverde and Marc Soler demand the utmost from their equipment, and ABUS’s focus on innovation and quality enables it to deliver products that meet those exacting standards.</p>\n<p>What isn’t obvious from ABUS’s visibility at the top of the sport is the brand’s comprehensive range of road and urban helmets that cater for the budget and needs of any rider.</p>\n<p>Their price may differ but the quality, performance and safety of ABUS helmets remain constant throughout the range.</p>\n<h3>ABUS Macator</h3>\n<p><em>£45 (£70 with Mips)</em></p>\n<p>The Macator is the entry point into ABUS’s range but thanks to its features, it punches well above its weight in terms of performance.</p>\n<p>Importantly, alongside the regular version ABUS also offers the Macator with Mips’ slip-plane technology built in – a liner that allows the helmet to move independently and so reduces the rotational violence experienced by the brain in the event of a crash.</p>\n<p>At £70 it’s one of the most affordable helmets on the market to feature Mips technology.</p>\n<p>Remarkable low weight is a key feature in all ABUS helmets, and the Macator weighs just 278g for a size medium.</p>\n<p>Ventilation is good too: five inlet and eight outlet vents help maximise airflow over the rider’s head and the main front vents use a bug mesh to provide protection from stray insects.</p>\n<p>The Macator’s secure fit is taken care of by ABUS’s ‘Zoom Ace Urban’ retention system, which is height-adjustable and fully encloses the head with a band that should ensure there are no pressure points when it is tightened using the tactile non-slip thumbwheel.</p>\n<h3>ABUS Viantor</h3>\n<p><em>£85 (£99 with Mips)</em></p>\n<p>The Viantor is essentially the Aventor’s little brother, and as such adopts much of its more upmarket ABUS sibling’s overall styling.</p>\n<p>There are a few small differences though, such as it coming in a little heavier at 270g for a medium, but the payoff is a considerably reduced price.</p>\n<p>The helmet still uses ‘ActiCage’ shell reinforcement and the ‘Zoom Ace’ adjustable retention system.</p>\n<p>The vent layout is much the same too – huge inlet vents at the front guarantee that airflow over the rider’s head is good at high speed, while big exhaust ports at the helmet’s rear enable heat to escape when you’re working hard to ascend long climbs.</p>\n<p>The Viantor even offers something the Aventor doesn’t – the option of a Mips-equipped version alongside the regular one.</p>\n<p>Offering the additional slip liner safety technology at this price point is yet another reason why an ABUS helmet is a compelling proposition no matter what your budget is.</p>\n<h3>ABUS Aventor</h3>\n<p><em>£114.99</em></p>\n<p>The Aventor places a premium on ventilation and light weight, weighing just 240g in a size medium.</p>\n<p>While ABUS’s sponsored pro teams now use the Airbreaker and Gamechanger on the WorldTour, the Aventor’s design has been proven and refined at the highest level – before the newer helmets came along this was the pro’s helmet of choice for long, hot days in the mountains.</p>\n<p>Like ABUS’s other helmets from the mid-tier upwards, the Aventor’s polycarbonate shell protects the lower edge of the EPS for enhanced durability and an ‘ActiCage’ polymer skeleton strengthens the EPS shell in the event of a crash.</p>\n<p>In the comfort stakes, the Aventor is well-equipped thanks to its antibacterial padding and ABUS’s ‘Zoom Ace’ adjustable retention system. It uses a rugged adjustment wheel that is easy to operate and alter on the fly.</p>\n<h3>ABUS StormChaser</h3>\n<p><em>£130</em></p>\n<p>The StormChaser takes many of its styling and feature cues from the premium Airbreaker. It is lightweight at 227g for a medium, and its smooth low-profile shell delivers good aerodynamic efficiency.</p>\n<p>Seven inlet and 16 outlet vents combine with ABUS’s ‘Forced Air Cooling’ design – sculpted internal channelling set into the EPS shell – to ensure ventilation remains exceptional.</p>\n<p>The helmet uses a skeleton embedded into the helmet’s EPS called ‘ActiCage’ to help maintain the integrity of the helmet under impact. Its polycarbonate shell extends down over the base of the EPS shell, protecting the exposed area from wear and tear.</p>\n<p>Commonly seen being used in the pro peloton, the Stormchaser provides exactly what the modern rider needs and nothing they don’t.</p>\n<p>• <strong>For more information visit <a href=\"https://mobil.abus.com/int/on-road/Bike-helmets/Road\" target=\"_blank\">Abus's website</a> </strong> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/helmets\">Helmets</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"7c4337ffb08282cd20d95a366907acb19dd381e3ebe2cc7971bc514c269ad1d1","category":"Cycling"}