{"title":"Spatial clustering of domestic violence attitudes toward women in Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003261","date":1716904800000,"content":"<p>by Cecilia Richardsen, Djibril M. Ba, Anna E. Ssentongo, Paddy Ssentongo</p>\r\n\r\nViolence against women is a global public health issue associated with increased morbidity and mortality. The United Nations defines violence against women as “any act of gender-based violence that results in, or is likely to result in, physical, sexual, or mental harm or suffering to women, including threats of such acts, coercion or arbitrary deprivation of liberty, whether occurring in public or in private life”. There is paucity of data on the spatial distribution and predictors of violence against women in sub-Saharan Africa. The objective of this study was to investigate the geographical distribution of attitudes toward wife beating in Ghana, a sub-Saharan African country, utilizing data from the 2014 Ghana Demographic and Health Survey (DHS). Participants from over eleven thousand households were surveyed on topics of demographics and justification of wife beating in at least one of five different scenarios. The identification of geographic clusters of men and women who endorsed wife beating was performed using Ripley K functions. The comparison of the spatial distributions of women and men justifying wife beating were performed using spatial relative risk surfaces. The spatial analysis indicated the presence of clusters in women and men’s approval for wife beating compared to those who do not approve of wife beating, with a statistical significance level set at p &lt; 0.01. Major spatial clusters of approval of wife beating were in the Northern region, for both men and women, and in the Upper West region of Ghana for the men participants. This is the first study to explore the geographical distribution of attitudes toward wife beating in Ghana, and revealed evidence of several regional heterogeneous clusters where wife beating was more commonly justified by both men and women. Targeted intervention for reducing the justification of wife beating in Ghana should be focused in these regions.","author":"Cecilia Richardsen","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7c4ccb90aa936c9c83471b60cdaaaf8c35a42a7e1834035c27f7a178283283b0","category":"Environment"}