{"title":"Unpunctual in diversity: The effect of stand species richness on spring phenology of deciduous tree stands varies among species and years","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17266?af=R","date":1711532680000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f26ac75e-5d7c-4345-b46f-9715f31a72b0/gcb17266-toc-0001-m.png\" alt=\"Unpunctual in diversity: The effect of stand species richness on spring phenology of deciduous tree stands varies among species and years\" />\n<p>The timing of the bud-to-leaf transition (budburst) in spring for deciduous trees is not only determined by the weather, but in some species also by the local species richness. This effect is more likely driven by differences in light availability than in temperature and stronger in overall cold than in warm springs. The integration of non-climatic factors such as local species richness could therefore potentially improve current spring greening models, which are an important part of general climate models.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climatic drivers alone do not adequately explain the regional variation in budburst timing in deciduous forests across Europe. Stand-level factors, such as tree species richness, might affect budburst timing by creating different microclimates under the same site macroclimate. We assessed different phases of the spring phenology (start, midpoint, end, and overall duration of the budburst period) of four important European tree species (<i>Betula pendula</i>, <i>Fagus sylvatica</i>, <i>Quercus robur</i> and <i>Tilia cordata</i>) in monocultures and four-species mixture stands of a common garden tree biodiversity experiment in Belgium (FORBIO) in 2021 and 2022. Microclimatic differences between the stands in terms of bud chilling, temperature forcing, and soil temperature were considerable, with four-species mixtures being generally colder than monocultures in spring, but not in winter. In the colder spring of 2021, at the stand level, the end of the budburst period was advanced, and its overall duration shortened, in the four-species mixtures. At species level, this response was significant for <i>F. sylvatica</i>. In the warmer spring of 2022, advances in spring phenology in four-species stands were observed again in <i>F. sylvatica</i> and, less markedly, in <i>B. pendula</i> but without a general response at the stand level. <i>Q. robur</i> showed specific patterns with delayed budburst start in 2021 in the four-species mixtures and very short budburst duration for all stands in 2022. Phenological differences between monocultures and four-species mixtures were linked to microclimatic differences in light availability rather than in temperature as even comparatively colder microclimates showed an advanced phenology. Compared to weather conditions, tree species richness had a lower impact on budburst timing, but this impact can be of importance for key species like <i>F. sylvatica</i> and colder springs. These results indicate that forest biodiversity can affect budburst phenology, with wider implications, especially for forest- and land surface models.</p>","author":"Thilo Heinecke, \nPieter De Frenne, \nKris Verheyen, \nIvan Nijs, \nErik Matthysen, \nMatteo Campioli","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"7c565898d9ddad4fbaf208034bb7c01a6fdc3dafba086555eb46ebaa86a73191","category":"Environment"}