{"title":"Chinese malware removed from SOHO routers after FBI issues covert commands","link":"https://arstechnica.com/?p=2000376","date":1706744042000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/getty-wireless-router-800x533.jpg\" alt=\"A wireless router with an Ethernet cable hooked into it.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/getty-wireless-router.jpg\">Enlarge</a> <span>/</span> A Wi-Fi router. (credit: <a href=\"https://www.gettyimages.com/editorial-images\">Getty Images | deepblue4you</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US Justice Department said Wednesday that the FBI surreptitiously sent commands to hundreds of infected small office and home office routers to remove malware China state-sponsored hackers were using to wage attacks on critical infrastructure.</p>\n<p>The routers—mainly Cisco and Netgear devices that had reached their end of life—were infected with what’s known as KV Botnet malware, Justice Department officials <a href=\"https://www.justice.gov/opa/pr/us-government-disrupts-botnet-peoples-republic-china-used-conceal-hacking-critical\">said</a>. Chinese hackers from a group tracked as Volt Typhoon used the malware to wrangle the routers into a network they could control. Traffic passing between the hackers and the compromised devices was encrypted using a VPN module KV Botnet installed. From there, the campaign operators connected to the networks of US critical infrastructure organizations to establish posts that could be used in future cyberattacks. The arrangement caused traffic to appear as originating from US IP addresses with trustworthy reputations rather than suspicious regions in China.</p>\n<h2>Seizing infected devices</h2>\n<p>Before the takedown could be conducted legally, FBI agents had to receive authority—technically for what’s called a seizure of infected routers or \"target devices\"—from a federal judge. An initial affidavit seeking authority was filed in US federal court in Houston in December. Subsequent requests have been filed since then.</p></div><p><a href=\"https://arstechnica.com/?p=2000376#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2000376&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7c57871483cc6a9d0c9e7544cb88d57e608eaee71192a26e7b73da98fe7ca40c","category":"Tech"}