{"title":"State Of GDPR In 2021: Cookie Consent For Designers And Developers","link":"https://smashingmagazine.com/2021/03/state-gdpr-2021-cookie-consent-designers-developers/","date":1614609000000,"content":"<p><a href=\"https://www.smashingmagazine.com/2021/02/state-gdpr-2021-key-updates/\">Last week</a>, I gave you an update on everything that’s happened with GDPR since 2018. (TL;DR: A lot has changed.) In this article, we’ll look at cookie consent: specifically, the paradox where marketers are heavily reliant on Google Analytics cookie data but need to <strong>comply with regulations</strong>.</p>\n<p>We’ll take a look at two developments that have impacted cookies, plus a third on the horizon. Then I’ll walk you through the risk-based approach that we’ve taken — for the moment, at least. And come back next time for a deep dive into first-party ad tracking as we start to see moves away from third-party cookies.</p>\n<ul>\n<li><a href=\"https://www.smashingmagazine.com/2021/02/state-gdpr-2021-key-updates/\">Part 1: GDPR, Key Updates And What They Mean</a></li>\n<li><strong>Part 2: GDPR, Cookie Consent And 3rd Parties</strong></li>\n</ul>\n<h4>Big Development #1: Cookie Consent</h4>\n<p>In May 2020, the EU <a href=\"https://edpb.europa.eu/sites/edpb/files/files/file1/edpb_guidelines_202005_consent_en.pdf\">updated its GDPR guidance</a> to clarify several points, including two key points for cookie consent:</p>\n<ul>\n<li><strong>Cookie walls</strong> do not offer users a genuine choice, because if you reject cookies you’re blocked from accessing content. It confirms that cookie walls should not be used.</li>\n<li><strong>Scrolling or swiping</strong> through web content does not equate to implied consent. The EU reiterates that consent must be explicit.</li>\n</ul>\n<p>What does this mean for our industry?</p>\n<p>Well, the EU is tightening up on cookie consent — perhaps the most noticeable (and annoying!) aspect of GDPR. Critics say that cookie notices are <strong>a cumbersome block for users</strong>, and don’t do anything to protect user privacy. The EU is trying to change this, by promoting simple, meaningful, equitable options for cookie consent.</p>\n<p>But that restricts what we can do with cookies, and it hints ahead to when the Privacy and Electronic Communications Regulation (PECR) may come into force. More on that shortly.</p>\n<h4>Big Development #2: Google and Apple crack down on third-party tracking; get hit by anti-trust complaints</h4>\n<p>As the big digital players figure out <a href=\"https://www.cyber-duck.co.uk/what-we-do/digital-optimisation/gdpr-compliance\">how to comply with GDPR</a> — and how to turn privacy legislation to their advantage — some have already come under fire.</p>\n<p>Google is being investigated by the UK’s competition watchdog, the Competition and Markets Authority (CMA), for its ‘<a href=\"https://www.reuters.com/article/us-google-britain-idUSKBN29D18Q\">Privacy Sandbox</a>’ initiative, following complaints from adtech companies and publishers.</p>\n<p>The Internet giant, which is also facing an <strong>antitrust investigation</strong> in Italy for <a href=\"https://www.reuters.com/article/us-italy-google-antitrust/italian-watchdog-investigates-google-over-alleged-advertising-market-abuse-idUKKBN27D0MM?edition-redirect=uk\">display advertising</a>, and in the US for its <a href=\"https://techcrunch.com/2020/10/20/justice-department-will-reportedly-file-its-antitrust-lawsuit-against-google-today/\">search advertising services</a>, is looking to remove third-party cookies from Chrome. (Firefox and Safari already block these cookies by default.)</p>\n<p>The complainants say that this change will further concentrate advertising revenue in Google’s hands. Google’s response? The advertising industry needs to make ‘<a href=\"https://www.reuters.com/article/us-google-britain-idUSKBN29D18Q\">major changes</a>’ as it shifts to a ‘web without third-party cookies’.</p>\n<p>Google’s not alone. In October 2020, four French digital advertising lobbies filed an <a href=\"https://www.reuters.com/article/apple-advertisting-france-idUSL1N2HJ237\">antitrust suit</a> against Apple’s forthcoming iOS privacy change, a feature it’s called <strong>App Tracking Transparency</strong> (ATT).</p>\n<p>ATT, coming in an early-spring 2021 release of iOS 14, shifts app users from an opt-out to an opt-in ad-tracking model. With ATT, every app must get your permission to share your Identifier for Advertisers (IDFA), which enables third-party ad tracking across multiple sites and channels.</p>\n<p>The complainants say that by restricting apps’ ad revenue, developers may have to boost app subscriptions and in-app purchases or switch to Apple’s targeted ad platform — all of which will funnel ad spend away from them and towards Cupertino.</p>\n<p>Critics including Facebook have <a href=\"https://techcrunch.com/2021/01/27/apple-app-tracking-transparency/\">slammed the change</a>, saying it’ll hit small businesses who rely on <strong>microtargeted ads</strong>. Apple has defended the move and praised the EU’s defence of citizens’ data privacy.</p>\n<p>To sum up:</p>\n<ul>\n<li>Implied consent doesn’t equal consent under GDPR, according to the EU.</li>\n<li>We should also avoid cookie walls</li>\n<li>Google and Apple are moving against third-party cookies — which some say exploits their dominant market position.</li>\n</ul>\n<p>So what does that mean for us, as designers and developers? First, let’s take a look at why this is important.</p>\n<h3>Here’s What Designers Should Know About Cookies</h3>\n<ul>\n<li><strong>GDPR is critical for you</strong> because you’ll design the points at which cookies are placed, what data is collected, and how it’s processed.</li>\n<li>A <strong>functionality audit</strong> means you can map your cookie activity in the data and compliance layers on your service blueprint.</li>\n<li>It can help to do a cookie audit and gap analysis, i.e. is the existing cookie pattern compliant? What content does it need around it?</li>\n<li>Follow <em>Privacy by Design</em> best practices. Don’t try to reinvent the wheel — if you’ve created a compliant cookie banner, use your proven design pattern.</li>\n<li>Work with your compliance and development teams to <strong>ensure designs meet GDPR</strong> and can be implemented. Only ask for the data you need.</li>\n<li>If you need to compromise, take a risk-based approach. There’s a walk-through of one that we did further down.</li>\n<li>Be aware that your content team may need to <strong>update your privacy policy</strong> as GDPR and your use of cookies evolve.</li>\n</ul>\n<h3>Here’s What Developers Should Know About Cookies</h3>\n<ul>\n<li>Make sure you’re involved upfront about cookie consent and tracking, so what’s decided can be implemented.</li>\n<li>If you’re doing a product or website redesign, a cookie audit using Chrome Dev Tools can show you what <strong>tracking cookies</strong> are being used. Tools like <a href=\"https://www.ghostery.com/\">Ghostery</a> or <a href=\"https://www.cookiebot.com/en/\">Cookiebot</a> give you more detail. </li>\n<li>You should implement the standard cookie opt in/out <strong>as per GDPR guidance</strong>. (Note that while GDPR is standard, the enforcement of it varies across EU countries. There’s more on this further down.) You may stand to lose Google Analytics data. You might also come under pressure to implement things that could be considered as dark patterns. There’s more on this later, with a walk-through of what we did and a look at the risk.</li>\n</ul>\n<p>So that’s where we are today. Oh, and there’s one more thing to be aware of: a piece of <strong>further legislation</strong> that might be coming our way. I like to call it <em>Schrodinger’s Law</em>.</p>\n<h3>Schrodinger’s Law: The ePrivacy Regulation</h3>\n<p>You may have heard of GDPR’s twin sister, the ePrivacy Regulation, who’s lurking on the legislative horizon. If you haven’t, here’s an introduction.</p>\n<p>As I said above, cookie consent — the notice that pops up when you visit a website — is regulated by the GDPR. However, cookies themselves fall under a different piece of legislation, the <strong>ePrivacy Directive of 2002</strong>, commonly known as the Cookie Law. Like GDPR, it aims to protect customer privacy. </p>\n<p>The ePrivacy Directive is due to be replaced by more stringent legislation, the ePrivacy Regulation. (If you’re interested in the difference between EU directives and regulations, EU directives set out the goals for legislation but delegate the implementation of those goals to member states’ legislatures. EU regulations mandate both the goals and the implementation at an EU-wide level.)</p>\n<p> The draft ePrivacy Regulation goes beyond cookies and ad tracking. It applies to all electronic communications, including messaging apps, spam mail, IoT data transfer and more.</p>\n<p>The draft ePrivacy Regulation was first presented by the EU in 2017. However, it has to be agreed by both the European Parliament and the Council of the European Union. (The Council consists of government representatives of each EU member state.)</p>\n<p>This is where it gets messy. Since 2017, the European Parliament and the Council haven’t been able to agree on the scope and detail of the ePrivacy Regulation.</p>\n<p>That’s because some countries — widely thought to include the Nordic states of Finland and Denmark — want to strengthen the current ePrivacy Directive. They want users, for example, to be able to <strong>set acceptance and rejection of tracking cookies</strong> in their browsers, not on every site they visit.</p>\n<p>But other countries, notably Austria and believed also to include those with sizeable digital marketing and advertising sectors, say this is bad for business. It’s thought the 27 EU member states are split down the middle on this issue — and they’re all being heavily lobbied by the tech industry.</p>\n<p>So the draft regulation has been ricocheting back and forth between the European Commission and its Working Party on Telecommunications and Information Society as they try to agree its scope. In November 2020, the Working Party <a href=\"https://data.consilium.europa.eu/doc/document/ST-12891-2020-INIT/en/pdf\">rejected</a> the redrafted legislation once again.</p>\n<p>What happens next? There are two possibilities. <strong>Either a compromise will be reached</strong>, in which case the legislation will be agreed. Because it takes time for legislation to be implemented, the soonest the ePrivacy Regulation could become law is 2025.</p>\n<p>Alternatively, <strong>the legislation cannot be agreed and is withdrawn</strong> by the European Commission. But the EU has staked so much on it. It will be extremely reluctant to take that step.</p>\n<p>That’s why I call it Schrodinger’s Law. It’s hard for us to know how to plan for any cookie-related developments because we simply don’t know what’s happening.</p>\n<h3>So what should I do about cookies right now?</h3>\n<p>Different EU countries are currently implementing the ePrivacy Directive differently. Over in the UK, the ICO (the UK’s data protection authority) is taking a tough stance. It’s requiring <a href=\"https://ico.org.uk/for-organisations/guide-to-pecr/guidance-on-the-use-of-cookies-and-similar-technologies/how-do-we-comply-with-the-cookie-rules/#comply15\">strict consent for analytics cookies</a>, for example, and has spoken out against cookie walls.</p>\n<p>Until — and if — we get consistency from a new ePrivacy Regulation, if you’re based in an EU country, start by following the advice from your national Data Protection Authority. Then watch this space for developments around the ePrivacy Regulation.</p>\n<p> If you’re based outside the EU, make sure you’re giving EU citizens the options required under the GDPR and the ePrivacy Directive.</p>\n<p>However, when it comes down to the detail, there are times when I recommend taking a risk-based approach. That’s what we’ve done at Cyber-Duck — and here’s why.</p>\n<p>Here’s <strong>our original cookie notice</strong>. You see these everywhere. They’re pretty meaningless — users just hit accept and continue on their way.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5015a98f-d1c6-4520-bbb9-4aa35c4a1a44/gdpr-update-original-cookie-banner.png\" /></p>\n<p>But we wanted to be compliant, so we replaced it with this notice. You’ll see that tracking cookies are turned off by default — <strong>in line with ICO guidance</strong>. We knew there was a risk we would lose analytics data as GTM would no longer fire on first load.</p>\n<p>Let’s see what happened.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/075a850f-3306-42ca-8991-ff8acc2d335e/gdpr-update-new-cookie-banner.png\" /></p>\n<p>Problem solved? Actually, no. It just created another problem. The impact was far more significant than we expected:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6681c065-7e13-4aad-86d3-61d47fa952a3/gdpr-update-new-cookie-traffic.png\" /></p>\n<p>Look at the collapse in the blue line when we implemented the new cookie notice. We released the new cookie consent on 17 December and went straight from plenty of tracked traffic to almost zero. (The orange line shows the previous year’s traffic, for comparison.)</p>\n<p>In both the before-and-after scenarios, the default option was by far the most popular. Most users just naturally click on “accept” or “confirm”. That’s tricky, because we now <strong>know so little about the people visiting our site</strong> that we can’t give them the best information tailored to their needs.</p>\n<p>We needed a solution. Analytics and marketing data ultimately drive business decisions. I’m sure we all know how important data is. In this case, it was like putting money in a bank account and not knowing how much we’d spent or saved!</p>\n<p>Some of the solutions that were posed include <strong>design alternatives</strong> (would removing the toggle, or having two buttons with a visual nudge towards the “accept” help?) Or would we enable analytics cookies by default?</p>\n<p>For now, we’ve implemented a compromise position. Marketing and analytics cookies are on by default, with one clear switch to toggle them off:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/81667310-5d1e-4715-9d6e-5bf12f1ab0db/gdpr-update-2nd-iteration-banner.png\" /></p>\n<p>And here’s what that’s done to our stats:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/23ddeffe-cee5-436f-a91e-6551c596c15d/gdpr-update-2nd-iteration-traffic.png\" /></p>\n<p>The new cookie banner was relaunched on 15 January. You can see our website traffic starts to pick back up again. However, we’re not getting the full data we were getting before as Google Tag Manager doesn’t fire unless a user chooses cookies.</p>\n<p>The good news is, we are getting some data back again! But the story doesn’t end here. After we had <strong>turned cookie tracking back on by default</strong>, the attribution model got messed up. It wasn’t attributing to the correct channel in Google Analytics.</p>\n<p>Here’s what we mean:</p>\n<h4>Scenario 1: (Correct Attribution)</h4>\n<ol>\n<li>User lands on our website via a paid ad (PPC) or from the search result (organic)</li>\n<li>User accepts cookies straight away.</li>\n<li>The channel source is attributed correctly, e.g. to PPC.</li>\n</ol>\n<h4>Scenario 2: (Incorrect Attribution)</h4>\n<ol>\n<li>User lands on our website via a paid ad (PPC) or from the search result (organic)</li>\n<li>User visits a few other pages on our website without responding to the cookie banner prompt (banner appears on every page until it gets a response)</li>\n<li>User finally accepts cookie banner after browsing a few pages.</li>\n<li>Attribution comes through as direct — although they originally came from a search engine.</li>\n</ol>\n<p>How does that work? When a user browses other pages on the site, <strong>nothing is tracked until they respond to the cookie prompt</strong>. Tracking only kicks in at that point. So to Google, it looks as though the user has just landed on that page — and they are attributed to Direct traffic.</p>\n<p>Back to the drawing board.</p>\n<p><strong>Note</strong>: <em>I’m sure by now you’re starting to see a pattern here. This entire experience is new for us and there’s not a lot of documentation around, so it’s been a real learning curve.</em></p>\n<p>Now, how could we solve this attribution issue and stop users from navigating around the site until they’ve selected their cookie preference?</p>\n<p>A <strong>cookie wall</strong> is one option we considered, but that would potentially push us further away from being compliant, according to the ICO. (Though you might like to try browsing their site incognito and see if they stick to their own guidance...)</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d657d06c-374e-4c0c-9ec0-0737366dd7da/gdpr-update-cookie-compromise.png\" /> </p>\n<p>But that’s what we’ve chosen to go with. The journey ends here for now, as we’re still gathering data. In the future, we want to <strong>explore other tools</strong> and the potential impact of moving away from Google Analytics.</p>\n<p>So what’s everyone else doing?</p>\n<p>Well, McDonald’s UK offers straightforward on/off buttons:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3138de66-b868-43c0-8735-2489f228e723/gdpr-update-mcdonalds.png\" /></p>\n<p>Coca Cola’s British site nudges you to accept by making the ‘reject’ option harder to find:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/d0488bcc-c323-43fb-be95-588cbface3ee/gdpr-update-coca-cola.png\" /></p>\n<p>Whereas Sanrio just has an option to agree to ad tracking:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/328b6fc2-ace4-40ea-a069-d7956e8eb391/gdpr-update-sanrio.png\" /></p>\n<p>Hello Kitty, hello cookies.</p>\n<p>Die Zeit offers free access if you accept tracking cookies — but for an untracked, ad-free experience you’ll have to pay:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/f5fc212a-3eff-4120-8883-661f8202670e/gdpr-update-zeit.png\" /></p>\n<p>And here’s one of my favourite dark patterns. This restaurant site only has the ‘Necessary’ cookies selected. But it nudges you to the ‘Allow all cookies’ big red button — and when you click that, the analytical and ad cookie boxes are automatically checked and set. <a href=\"https://www.pinchos.se/\">Give it a go here!</a></p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0a7a173b-1844-4ae6-ae2d-d2063c71f360/gdpr-update-pinchos.png\" /></p>\n<p>Even the EU isn’t consistent on its own sites.</p>\n<p>The European Parliament’s cookie consent offers two clear options:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ed83771d-3ab9-4d29-b3f5-5d34218dd527/gdpr-update-euro-parliament.png\" /> </p>\n<p>The CJEU’s site isn’t so clear:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b16022cb-8280-491f-bdf3-537bd4a71ab6/gdpr-update-cjeu.png\" /></p>\n<p>While Europol’s site comes with two pre-checked boxes:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/359fdf24-ed49-458b-b2bb-b79473595601/gdpr-update-europol.png\" /></p>\n<p>And if you look at the sites for the <a href=\"https://www.eu2020.de/eu2020-en\">German presidency of the Council of the European Union</a> (July–December 2020), at first it seems as if there’s no cookies at all:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/aa8c4e88-79f1-4f33-8943-45a738a1ddbb/gdpr-update-eu2020.png\" /></p>\n<p>When you land on the site, there are no cookie banners or prompts. A closer look, with cookie extension tools, shows that no cookies are being placed either.</p>\n<p>So are they capturing any analytics data? The answer is yes.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9e07adc6-6f25-4f5e-bf9e-52d0a039eab1/gdpr-update-piwik.png\" /></p>\n<p>We found this little snippet in their code, which shows they are using ‘Piwik’. Piwik is now known as <a href=\"https://matomo.org/\">Matomo</a>, one of a clutch of new tools that help with cookie compliance along with <a href=\"https://usefathom.com/\">Fathom</a> (server-side tracking) and <a href=\"https://helloconsent.com/\">HelloConsent</a> (cookie management).</p>\n<p>So <strong>alternatives and solutions are emerging</strong>. We’ll take a closer look at that next time — with new alternatives to third-party cookies that will help you take control of your data and get the insight you need to deliver optimum experiences to your customers. Stay tuned!</p>\n<h4>Further Reading</h4>\n<ul>\n<li><a href=\"https://ec.europa.eu/info/law/law-topic/data-protection_en\">Data protection</a> (the EU’s site)</li>\n<li>UK ICO’s <a href=\"https://ico.org.uk/for-organisations/guide-to-pecr/guidance-on-the-use-of-cookies-and-similar-technologies/how-do-we-comply-with-the-cookie-rules/#comply15\">Guidance On Cookies</a></li>\n<li><a href=\"https://www.enforcementtracker.com/\">GDPR Enforcement Tracker</a>, logs fines applied under GDPR</li>\n<li><a href=\"https://www.cyber-duck.co.uk/insights/resources/gdpr-checklist\">GDPR Checklist</a>, by Cyber-Duck — a great place to start</li>\n<li>Overview of <a href=\"https://iclg.com/practice-areas/data-protection-laws-and-regulations/usa\">Data Protection Law in the United States</a>, by ICLG</li>\n<li><a href=\"https://fpf.org/wp-content/uploads/2018/11/GDPR_CCPA_Comparison-Guide.pdf\">GDPR &amp; CCPA Comparison Guide</a>, by DataGuidance and the Future of Privacy Forum</li>\n<li><a href=\"https://iapp.org/news/a/cpra-analysis-the-good-and-bad-news-for-ccpa-regulated-businesses/\">CCPA vs CPRA</a>, from IAPP</li>\n<li><a href=\"https://aws.amazon.com/compliance/security-by-design/\">Security By Design</a> (Amazon)</li>\n<li><a href=\"https://www.smashingmagazine.com/2017/07/privacy-by-design-framework/\">How To Protect Your Users With The Privacy By Design Framework</a>, Heather Burns, Smashing Magazine</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"7c5c90f4ffc3255f9a67d2063277881987eda3eea76e20790de5c346b93104b0","category":"Tech"}