{"title":"Readiness of Health Workers Using Computer, Internet and Mobile Phones in Facing the Healthcare System Digitalization in Timor-Leste: Cross Sectional Study","link":"https://www.preprints.org/manuscript/202404.0013/v1","date":1711983640000,"content":"AbstractBackground: In digitalization era, health care system was conditioned with the health worker’s ability to adapt media of digital technology. Digital technology media was used to strengthening and fasted the health care for patient and community.  Aims: This study aimed to explore the accurate information of health professional utilization digital technology during doing the job at the health facilities in Timor-Leste.  Methods: This study was used correctional study with 56 respondents was participated in the study. Was collected the data from 1 to 30 February 2023.  Was used questioner of google form based for data collection. Data collection was distributed via online with google form to social media as WhatsApp’s, email and face book and twitter to completed by respondents. The inclusive Criteria are: health professional living in Timor-Leste, to able response the questioner. Was used descriptive analysis in this study.  Finding: This study was indicated that majority of health professional was participated in the study as 54,2% man then women have 45,8%. About 100% health professional used hand phone to facilitate their daily activities including related with their work activities.  Other side indicated in digital technology tools use are able to use Microsoft word is 78,3%, able to use Microsoft Excel is 76,7% and able to use Power Point is 81,7%. E-mail use about 89,2%, WhatsApp’s use 81,7%, About 74,2% was used zoom/webinars/Google meet application, about 72,5% sad that they were used computer in the work place until now. Around 96.4% need to improve or deepen their knowledge and skills in using ICT in the future to facilitate they are activity.   Conclusion: Majority of health professional in Timor-Leste was used the computer, internet, hand phone in daily activities. Majority need to gate the training to improve their knowledge, attitude and psychomotor in the future.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7c708171250759df75514ced10d86a0c02f3a4c7c9df494cd5742cc015de7fd3","category":"Interdisciplinary"}