{"title":"Microsoft's New Cloud PC Service Can Stream Windows to Mac and iPad","link":"https://www.macrumors.com/2021/07/15/windows-365-cloud-pc-stream-to-mac-ipad/","date":1626342568000,"content":"Microsoft has <a href=\"https://www.microsoft.com/en-us/microsoft-365/blog/2021/07/14/introducing-a-new-era-of-hybrid-personal-computing-the-windows-365-cloud-pc/\">announced</a> Windows 365, a new Cloud PC service that allows users to stream a Windows desktop via web browser to any device, including Macs and iPads. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/MicrosoftTeams-image-13-1536x822.jpg\" />\r\n<br />\r\nThe service works similar to the company's Xbox Cloud Gaming service – the Windows OS is loaded on a remote computer in the cloud, and Microsoft streams the entire desktop PC experience to the user's device. Microsoft is calling it a \"hybrid Windows for a hybrid world\" where office and remote working interchange.\r\n<br />\r\n<blockquote>Windows 365 provides an instant-on boot experience that enables users to stream all their personalized applications, tools, data, and settings from the cloud across any device including your Mac, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, Linux device, and Android,\" explained Microsoft 365 general manager Wangui McKelvey. \"The Windows experience is consistent, no matter the device. You can pick up right where you left off, because the state of your Cloud PC remains the same, even when you switch devices.\"</blockquote><img src=\"https://images.macrumors.com/article-new/2021/07/MS365Blog_PowerPointImage_960x600_RGB.jpg\" />\r\n<br />\r\nUsers will be able to choose the configuration of the virtual PC, such as the amount of storage and working memory. According to Microsoft, a cloud PC can be configured with up to 512GB and 16GB of RAM.\r\n<br />\r\n\r\n<br />\r\nThere will be two edition options with multiple Cloud PC configurations based on performance needs: Windows 365 Business and Windows 365 Enterprise. Information and files are encrypted and stored in the cloud, to avoid security concerns about leaving sensitive data on local devices.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nThe service will launch in early August and, initially at least, will be offered to business customers on a per-user, per-month subscription basis. Microsoft hasn't mentioned whether a personal product is in the works, but the company has been working from a roadmap that should see all its main services eventually move to a subscription model. \r\n<br />\r\n\r\n<br />\r\nAssuming Microsoft offers a consumer plan down the line, not only should Windows 365 offer a full desktop experience on iPads, it may appeal to owners of Apple silicon Macs who are unable to run Windows through Boot Camp.  <div>Tags: <a href=\"https://www.macrumors.com/guide/microsoft/\">Microsoft</a>, <a href=\"https://www.macrumors.com/guide/windows-365/\">Windows 365</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/15/windows-365-cloud-pc-stream-to-mac-ipad/\">Microsoft's New Cloud PC Service Can Stream Windows to Mac and iPad</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/microsofts-new-cloud-pc-service-can-stream-windows-to-mac-and-ipad.2304328/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PFCGvAIwqOk:9U3h7U5_8x4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=PFCGvAIwqOk:9U3h7U5_8x4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/PFCGvAIwqOk\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7c71c345cf53b507fa21b2bd4443dbdddb7c96261578588feed0a758f5ace263","category":"Apple"}