{"title":"Apple Accuses Former Employee of Stealing Trade Secrets and Leaking Them to Media","link":"https://www.macrumors.com/2021/03/11/apple-employee-stole-trade-secrets-lawsuit/","date":1615495803000,"content":"Apple today filed a lawsuit against Simon Lancaster, a former employee who allegedly used his position within the company to steal \"sensitive trade secret information\" from Apple that was then leaked to a journalist and published in rumor articles.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/project-x-feature-yellow.jpg\" alt=\"\" width=\"2500\" height=\"1406\" class=\"aligncenter size-full wp-image-788446\" />\r\n<br/>\r\nLancaster worked at Apple for more than a decade, using his seniority to attend internal meetings and access documents that Apple says were \"outside the scope of his job's responsibilities.\" Details he obtained were published in media articles that \"cited a 'source' at Apple.\"\r\n<br/>\r\n\r\n<br/>\r\nIn exchange for the leaked information, Lancaster asked the media person he was in contact with for favors, such as providing favorable coverage of a startup company that Lancaster invested in.\r\n<br/>\r\n\r\n<br/>\r\nUntil November 1, 2019, Lancaster was employed as an Advanced Materials Lead and Product Design Architect involved with multiple hardware projects. His role was evaluating materials and prototyping innovations for future hardware devices. He began leaking details to the media contact on November 29, 2018 through text messages, emails, and phone calls.\r\n<br/>\r\n\r\n<br/>\r\nAfter resigning from Apple, Lancaster \"deepened\" his relationship with the media correspondent he was speaking to, and Apple's internal investigation of Apple-owned devices that Lancaster returned after employment suggested that he communicated about \"specific Apple trade secrets\" while also taking \"specific steps\" to seek out additional information. On his last day, Lancaster downloaded a \"substantial number\" of confidential Apple documents.<blockquote>Further, forensic review of the devices Apple provided to Lancaster for his work at Apple shows Lancaster and the Correspondent coordinated to pilfer specific documents and product information from Apple. On numerous occasions, the Correspondent had requested Lancaster obtain specific Apple trade secret documents and information. On multiple occasions, Lancaster then sent the Correspondent certain of the requested confidential materials using Apple-owned devices. On other occasions, Lancaster met with the Correspondent in person to provide them with the requested confidential Apple information.</blockquote>According to Apple, the information that Lancaster shared included details of \"unreleased Apple hardware products, unannounced feature changes to existing hardware products, and future product announcements.\" He also took on a <a href=\"https://www.businesswire.com/news/home/20191122005108/en/Simon-Lancaster-Former-Advanced-Materials-Lead-at-Apple-Joins-Arris-Composites-to-Unlock-Future-of-Consumer-Products\">new role at Arris Composites</a>, a vendor serving under Apple, and Apple says that he accessed confidential information that would assist Arris in addition to leaking Apple documents to the media.\r\n<br/>\r\n\r\n<br/>\r\nApple does not provide detail on which products were leaked by Lancaster, but many of the leaks happened right around October and November of 2019, and concerned what Apple calls \"Project X.\" Just after Lancaster left, in fact, he spoke with the journalist that he leaked details to, congratulating the person on the success of an article that contained details he had leaked.\r\n<br/>\r\n\r\n<br/>\r\nLike all Apple employees, Lancaster signed a \"Confidentiality and Intellectual Property Agreement\" prior to being hired by Apple that prohibits them from sharing secret and proprietary information, plus he attended \"security trainings\" and \"Business Conduct\" events centered on preventing theft of secret documents.\r\n<br/>\r\n\r\n<br/>\r\nApple is now seeking damages that were incurred as a result of the trade secrets that Lancaster stole, with Apple planning to determine the amount at trial. Apple also wants to recover from Lancaster all gains, profits, and advantages that he obtained through the document theft.\r\n<br/>\r\n\r\n<br/>\r\nThe lawsuit was first shared by <em><a href=\"https://appleinsider.com/articles/21/03/11/apple-sues-former-employee-over-device-leaks-to-media\">AppleInsider</a></em> this afternoon. We've included the full document below, and it's a fascinating read that covers leak culture within Apple and the lengths the company will go to in order to put a stop to it.\r\n<br/>\r\n\r\n<br/>\r\n<div class=\"center-wrap\"><iframe class=\"scribd_iframe_embed\" title=\"Apple v. Lancaster\" src=\"https://www.scribd.com/embeds/498354566/content?start_page=1&view_mode=scroll&access_key=key-SV7noD1i75IeuI0OYn1g\" tabindex=\"0\" data-auto-height=\"true\" data-aspect-ratio=\"0.7729220222793488\" scrolling=\"no\" width=\"100%\" height=\"600\" frameborder=\"0\"></iframe><p  style=\"   margin: 12px auto 6px auto;   font-family: Helvetica,Arial,Sans-serif;   font-style: normal;   font-variant: normal;   font-weight: normal;   font-size: 14px;   line-height: normal;   font-size-adjust: none;   font-stretch: normal;   -x-system-font: none;   display: block;\"   ><a title=\"View Apple v. Lancaster on Scribd\" href=\"https://www.scribd.com/document/498354566/Apple-v-Lancaster#from_embed\"  style=\"text-decoration: underline;\">Apple v. Lancaster</a> by <a title=\"View MacRumors's profile on Scribd\" href=\"https://www.scribd.com/user/212523051/MacRumors#from_embed\"  style=\"text-decoration: underline;\">MacRumors</a></p></div><div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/lawsuit/\">lawsuit</a>, <a href=\"https://www.macrumors.com/guide/trade-secrets/\">trade secrets</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/11/apple-employee-stole-trade-secrets-lawsuit/\">Apple Accuses Former Employee of Stealing Trade Secrets and Leaking Them to Media</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-accuses-former-employee-of-stealing-trade-secrets-and-leaking-them-to-media.2288009/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ewrqV9gWWVQ:rXoWfWwqMxg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ewrqV9gWWVQ:rXoWfWwqMxg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ewrqV9gWWVQ\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7c724a854cb60bca8ffe74adcb581fc5a9bed8bfdea05218f7ac5331a31b5031","category":"Apple"}