{"title":"Bardet finishes over 12 minutes down after crashing on Vuelta stage 5","link":"https://cyclingtips.com/2021/08/bardet-finishes-over-12-minutes-down-after-crashing-on-vuelta-stage-5/","date":1629311565000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/bardet-1-650x434.jpg\" /></div><h2>Bardet finishes over 12 minutes down after crashing on Vuelta stage 5</h2><p>\n</p><p>A bad crash in the waning kilometers of Wednesday’s <a href=\"https://cyclingtips.com/2021/08/philipsen-sprints-to-another-win-on-stage-5-of-the-vuelta-a-espana/\" target=\"_blank\">stage 5</a> of the Vuelta a España ended any hopes that Romain Bardet (DSM) may have had of battling for the general classification at the race.</p>\n\n\n\n<p>The pileup occurred with around 11 km to go as the peloton neared approached Albacete at a decent clip. Danish national champion Mads Würtz Schmidt (Israel Start-up Nation) initially went down in a touch of wheels in the middle of the pack, and then numerous others – including overnight leader Rein Taaramäe (Intermarché-Wanty-Gobert Materiaux) – hit the deck behind him.</p>\n\n\n\n<p>Bardet, on the right side of the road, fell heavily and was slow to get back up. The fall left his kit torn in a few places on his back and it took him some time to remount and continue.</p>\n\n\n\n<p>One large group of fallers was able to rejoin the peloton, while Taaramäe and several others would arrive a little ways behind race winner Jasper Philipsen (Alpecin-Fenix), with Taaramäe ultimately ceding the red jersey to Kenny Elissonde (Trek-Segafredo).</p>\n\n\n\n<p>Bardet, however, was among those riding well behind the main pack into the finish. He would eventually arrive more 12:32 down, the third-to-last finisher on the day, but a finisher nonetheless.</p>\n\n\n\n<p>“Romain was able to get to the finish after his crash and the team doctors will assess him this evening and go through checks to make sure he’s OK,” said DSM coach Matt Winston via a statement. “He was in pain riding to the line so we will monitor him closely this evening and see what tomorrow brings.”</p>\n\n\n\n<p>According to the medical report from the race, Bardet suffered injuries to his right knee and “extremities.”</p>\n\n\n\n<figure><div>\n<blockquote><p>After a heavy crash, <a href=\"https://twitter.com/romainbardet?ref_src=twsrc%5Etfw\">@romainbardet</a> is safely across the line with <a href=\"https://twitter.com/ChrisHamo_?ref_src=twsrc%5Etfw\">@ChrisHamo_</a> by his side. Now it's back to the bus for some checks with the doctor.<br /><br />Great to see <a href=\"https://twitter.com/DSM?ref_src=twsrc%5Etfw\">@DSM</a> <a href=\"https://twitter.com/dyneema?ref_src=twsrc%5Etfw\">@dyneema</a> in our bibs doing its job once again <img src=\"https://s.w.org/images/core/emoji/13.0.1/72x72/1f44f-1f3fb.png\" /><a href=\"https://twitter.com/hashtag/LaVuelta21?src=hash&amp;ref_src=twsrc%5Etfw\">#LaVuelta21</a> <a href=\"https://t.co/yq09ZWWn11\">pic.twitter.com/yq09ZWWn11</a></p>— Team DSM (@TeamDSM) <a href=\"https://twitter.com/TeamDSM/status/1428026080728866821?ref_src=twsrc%5Etfw\">August 18, 2021</a></blockquote>\n</div></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/bardet-finishes-over-12-minutes-down-after-crashing-on-vuelta-stage-5/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7c7917a9cea504031d1a24bb7a171b010ada58714105a39fe261304f302d016e","category":"Cycling"}