{"title":"‘Cavendish always steps up at the big ones’ - Mark Renshaw and Michael Mørkøv on keeping the faith in their sprinter","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/cavendish-always-steps-up-at-the-big-ones-mark-renshaw-and-michael-morkov-on-keeping-the-faith-in-their-sprinter","date":1708675201000,"content":"\n      <p><span>When Mark Cavendish lines up to race, there is an air of expectation surrounding the Manxman. It’s not just because he has 163 professional wins to his name, it can also be put down to the narrative arc of the Astana-Qazaqstan rider’s career. A defining moment in Cavendish’s 17 years in the professional peloton is his comeback at the 2021 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, after four winless years in the French three-week race.</span></p>\n<div></div>\n<div></div>\n<p><span>The victories that the 38-year-old took in that particular edition of the Tour gave Cavendish a kind of aura. He made cycling fans believe that anything can happen, nevermind factors like age, sickness, injuries or public opinion being entirely out of favour. Since then, each time Cavendish lines up to race, there’s a bubbling feeling of never quite knowing what he might pull out of the bag. This is a man who has defied expectations once; what can he do next?</span></p>\n<p><span>While the air of magic around Cavendish is exciting, it also means that when things don’t go well for the Manx rider, disappointment is regularly felt and voiced by his fans. At the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour </a>so far, deemed by some as the ‘sprinters World Championships’, Cavendish has finished in 21st and 22nd place in the two sprint stages after it appeared he lost his lead out train on the fast, flat roads of the Middle East. He has already secured a win for Astana this season at the Tour of Colombia, but Cavendish doesn’t look to be able to replicate that sort of performance against a higher calibre sprint field at the UAE Tour so far. </span></p>\n<p><span>Those closest to the British sprinter, however, insist that there is no reason for any panic this early in the season, fully backing Cavendish to win another Tour de France stage win when summer rolls round. Speaking to </span><i><span>Rouleur</span></i><span> ahead of the UAE Tour, Astana-Qazaqstan’s lead-out man, Michael Mørkøv, told of Cavendish’s satisfaction with the team, something his old friend believes will be crucial to helping him to success later in the year.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2029961603_1024x1024.jpg?v=1708635792\" /></span></p>\n<p><span></span><span>“Seeing him on Astana compared to Quick-Step is a different Mark. I always felt that he was a bit, not himself, at Quick-Step because there was always this really huge in-house competition,” Mørkøv explained. “In Astana, I see a much more whole person, more confidence, more happiness, he is the star here. Everybody supports him, there is no discussion about the programme, he is the highest priority.”</span></p>\n<p><span>Mørkøv went on to discuss that Cavendish has the freedom to give input regarding his own race programme on the Kazakh team, something he hasn’t been granted elsewhere.</span></p>\n<p><span>“He gets basically whatever he asks for. He asks for support and he gets support. He asks for staff, he asks for training camps, he gets everything. I have the feeling that he feels really appreciated which puts him in a really good state of mind and physically a very good stage. I’m super confident,” Mørkøv said when asked about his belief in Cavendish’s ability to perform at the highest level in 2024.</span></p>\n<p>Mørkøv isn’t the only of Cavendish’s old teammates who he has been reunited with on Astana-Qazaqstan. Mark Renshaw is one of the team’s sports directors and the Australian spent nine of his 15 years as a professional cyclist racing alongside Cavendish on Highroad, QuickStep, and Dimension Data. Similarly to Mørkøv, Renshaw is adamant that Cavendish has the ability to continue a successful career, despite the constant emergence of younger sprinters in the peloton.</p>\n<p>“He’s extremely focused, has a lot of dedication and is very driven. We’ve known about these characteristics for a long time. He’s been in some amazing teams and had amazing teammates over the years, not just me, so many that have given one hundred and ten percent for him,” Renshaw said. “Being in those teams and having dedicated riders and him being really driven, provides him an opportunity to go over generations of sprinters.”</p>\n<p><span>Renshaw also added that Cavendish is feeling the effects of such a long period spent at altitude over the past winter and stressed that the UAE Tour was not one of the biggest goals of the year for Astana-Qazaqstan. It’s true that there is still plenty of time until July, when Cavendish will aim for his 35th Tour de France stage win. We’ve surely learnt by now to never count Cavendish out, and realistically, it wouldn’t even matter if we did. It’s been proven time and time again that if the Manx sprinter believes in himself and has the support around him, he can defy expectations.</span></p>\n<p><span>“He’s much older now and has many, many victories. I’m not taking away from any of the smaller races, but it won’t change his palmarès if he wins there or not,” Renshaw says. “The big ones are what will change that, and that’s when we see Cavendish always step up. Is winning stages here [at the UAE Tour] or in Tirreno going to change his palmarès? No, he’s judged off the Tour de France.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7c834fc64f4d741d8b7f7d9e3c0f92e4d128f31634911ff8ce47c6923e59cf93","category":"Cycling"}