{"title":"Urbanization and malaria have a contextual relationship in endemic areas: A temporal and spatial study in Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002871","date":1717077600000,"content":"<p>by Merveille Koissi Savi, Bhartendu Pandey, Anshuman Swain, Jeongki Lim, Daniel Callo-Concha, Gbedegnon Roseric Azondekon, Mohammed Wahjib, Christian Borgemeister</p>\r\n\r\nIn West Africa, malaria is one of the leading causes of disease-induced deaths. Existing studies indicate that as urbanization increases, there is corresponding decrease in malaria prevalence. However, in malaria-endemic areas, the prevalence in some rural areas is sometimes lower than in some peri-urban and urban areas. Therefore, the relationship between the degree of urbanization, the impact of living in urban areas, and the prevalence of malaria remains unclear. This study explores this association in Ghana, using epidemiological data at the district level (2015–2018) and data on health, hygiene, and education. We applied a multilevel model and time series decomposition to understand the epidemiological pattern of malaria in Ghana. Then we classified the districts of Ghana into rural, peri-urban, and urban areas using administratively defined urbanization, total built areas, and built intensity. We converted the prevalence time series into cross-sectional data for each district by extracting features from the data. To predict the determinant most impacting according to the degree of urbanization, we used a cluster-specific random forest. We find that prevalence is impacted by seasonality, but the trend of the seasonal signature is not noticeable in urban and peri-urban areas. While urban districts have a slightly lower prevalence, there are still pockets with higher rates within these regions. These areas of high prevalence are linked to proximity to water bodies and waterways, but the rise in these same variables is not associated with the increase of prevalence in peri-urban areas. The increase in nightlight reflectance in rural areas is associated with an increased prevalence. We conclude that urbanization is not the main factor driving the decline in malaria. However, the data indicate that understanding and managing malaria prevalence in urbanization will necessitate a focus on these contextual factors. Finally, we design an interactive tool, ’malDecision’ that allows data-supported decision-making.","author":"Merveille Koissi Savi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7c87c1f9f16a04e0c301e49625939791f3372420c28b2c28e6cc4da1bb2c2f93","category":"Environment"}