{"title":"No driver? No problem—this is the Indy Autonomous Challenge","link":"https://arstechnica.com/?p=1778606","date":1625670963000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/IAC-8-980x735.jpg\" /></div>\n        <p>\n          A whopping 37 different partners contributed to the creation of the AV-21, providing sensors, radars, throttle, brakes, and more to create possibly the most fastest autonomous car ever made.                      [credit:\n                        Gregory Leporati                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>INDIANAPOLIS—At a block party down the road from Indianapolis Motor Speedway (IMS) the day before the Indy 500, engineering students from across the world gathered for a very <em>different</em> kind of car reveal. The AV-21, with its sharp, green-blue Dallara chassis, looks like a typical Indy Lights racecar. However, there's one notable exception: <em>no driver. </em>Its cockpit is crammed with wires, processors, sensors, and a motherboard—essentially, a supercomputer.</p>\n<p>\"It's shaped like a car, but I don't view it as one,\" said Chanyoung Jung, an engineering student from the Korea Advanced Institute of Science and Technology. \"I view it as a robot.\"</p>\n<p>Automobile, robot, or something in between, the AV-21's unveiling was a significant step for the <a href=\"https://www.indyautonomouschallenge.com/\">Indy Autonomous Challenge</a> (IAC), a competition set for October 23 in which driverless cars will race wheel-to-wheel around IMS at potential speeds of more than 180 mph. The winning team will earn a $1.5 million university prize. Organized by IMS and Energy Systems Network (ESN), an Indianapolis-based nonprofit, the race seeks to significantly advance the safety and speed of autonomous vehicles.</p></div><p><a href=\"https://arstechnica.com/?p=1778606#p3\">Read 27 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1778606&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7c8a701007572a85325b9cc8e0dfa96b157bc2afc970f1626bb6148ca674a8da","category":"Tech"}