{"title":"Effects of long‐term different‐scale rice–duck farming on the growth and yield of paddy rice","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13257?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>To maintain rice production and increase revenue, rice–duck (RD) farming is a contemporary ecological cycle technology that has been widely used in Asia. However, due to the clustering activity of duck flocks, the consequences of long-term RD farming on rice growth at different scales are still unknown. Here, we studied RD farming using several different treatments (CK: conventional rice farming; RD1: 667 m<sup>2</sup>; RD2: 2000 m<sup>2</sup>; and RD3: 3333 m<sup>2</sup>).</p>\n<h2>RESULTS</h2>\n<p>The results demonstrated that the maximum tillers, effective spikes, dry matter accumulation, and lodging index of rice under RD farming were significantly decreased by 17.9%, 9.8%, 14.8%, and 17.8%, respectively, which ultimately caused a significant decrease in yield of 10.6%. However, RD farming significantly increased root oxidation activity and the ear-bearing tiller rate of rice by 25.5% and 11.1%, respectively, and improved yield stability. For different scales of RD farming, the lodging resistance index of RD1 was significantly lower than that of RD2 and RD3 by 10.0% and 15.2%, respectively, whereas the root oxidation activity and dry matter accumulation of RD2 were significantly higher than those of RD1 and RD3 by 11.1%, 4.7%, 8.6%, and 5.1%, respectively. For rice yield, there was no significant difference among the different scales.</p>\n<h2>CONCLUSION</h2>\n<p>This long-term experiment helped elucidate the complicated effects of RD farming at different scales on the growth and yield of rice. It is also critical to consider the economic advantages of different scales of RD farming to assess the impact of this system more thoroughly. © 2023 Society of Chemical Industry.</p>","author":"Chaoran Yang, \nNing Han, \nMengting Liu, \nChenghao Wei, \nRuilin Mao, \nChangqing Chen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7c9a78ced0d29e365d9b12fdf769472fb0be95a260f159dc5e9e78157323693c","category":"Environment"}