{"title":"Hyundai reveals US specs for Ioniq 5 electric crossover","link":"https://arstechnica.com/?p=1767450","date":1621959041000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/Large-46092-2022IONIQ5-980x680.jpg\" /></div>\n        <p>\n          This crisply styled thing is the Hyundai Ioniq 5, a new battery-electric vehicle due later this year.                      [credit:\n                        Hyundai                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>It's a good time for new battery-electric vehicles. <a href=\"https://arstechnica.com/cars/2021/05/heres-what-we-know-about-fords-electric-f-150-lightning-pickup/\">Ford's F-150 Lightning electric pickup</a> has been <a href=\"https://arstechnica.com/cars/2021/05/ford-reveals-pricing-for-the-f-150-lightning-pro-work-truck/\">hogging the headlines lately</a>—no surprise, given America's enduring love affair with the half-ton truck. But I'm more excited about Hyundai's next BEV, the Ioniq 5, which should start showing up on roads this fall. <a href=\"https://arstechnica.com/cars/2021/02/this-crisp-looking-crossover-is-hyundais-next-ev-the-ioniq-5/\">We got our first (remote) look at the Ioniq 5 back in February</a>, but this week Hyundai opened up about specifications and features for US-bound Ioniq 5s.</p>\n<p>At first, Hyundai will not sell the Ioniq 5 nationwide. The company will prioritize states with zero-emissions regulations—California, Connecticut, Maine, Maryland, Massachusetts, New York, New Jersey, Oregon, Rhode Island, and Vermont—but also Arizona, Florida, Georgia, North Carolina, Pennsylvania, and Texas. If you don't live in one of those 16 states and you want an Ioniq 5, you'll have to wait until sometime in 2022 to buy one.</p>\n<p>We still don't have pricing information—expect that information closer to release. More details are also coming for a subscription option that sounds a lot like Volvo's Care by Volvo program, which includes insurance and maintenance in its monthly fee.</p></div><p><a href=\"https://arstechnica.com/?p=1767450#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767450&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7c9b38702ea91a47bd9bcd67c6c46b35180d3cdec72dcb24da2de7c573af414f","category":"Tech"}