{"title":"Ulva lactuca polysaccharides combined with fecal microbiota transplantation ameliorated dextran sodium sulfate‐induced colitis in C57BL/6J mice","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13839?af=R","date":1725011125000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Fecal microbiota transplantation (FMT) of healthy donors improves ulcerative colitis (UC) patients by restoring the balance of the gut microbiota. However, donors vary in microbial diversity and composition, often resulting in weak or even ineffective FMT. Improving the efficacy of FMT through combination treatment has become a promising strategy. <i>Ulva lactuca</i> polysaccharides (ULP) have been found to benefit host health by regulating gut microbiota. The effect of the combination of ULP and FMT in ameliorating UC has not yet been evaluated.</p>\n<h2>RESULTS</h2>\n<p>The present study found that supplementation with ULP combined with FMT showed better effects in ameliorating UC than supplementation with FMT alone. Results suggested that FMT or ULP combined with FMT alleviated the symptoms of UC in mice, as evidenced by prevention of body weight loss, improvement of disease activity index and protection of the intestinal mucus. Notably, ULP in combination with FMT was more effective than FMT in reducing levels of cytokines and related inflammatory enzymes. In addition, ULP combined with FMT effectively restored the dysbiosis induced by dextran sulfate sodium (DSS) and further enriched probiotics (such as <i>Bifidobacterium</i>). The production of short-chain fatty acids, especially acetic acid, was also significantly enriched by ULP combined with FMT.</p>\n<h2>CONCLUSION</h2>\n<p>Supplementation of ULP combined with FMT could significantly ameliorate DSS-induced colitis in mice by inhibiting inflammation and restoring dysbiosis of gut microbiota. These results suggested that ULP combined with FMT has potential application in ameliorating UC. © 2024 Society of Chemical Industry.</p>","author":"Zhengqi Liu, \nMenghui Wang, \nYuanyuan Hu, \nJinjin Li, \nWei Gong, \nXiaoming Guo, \nShuang Song, \nBeiwei Zhu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7ca1643f63023c3194928c162f2ef322f715b20c3b90319444950987ea0dfa1d","category":"Environment"}