{"title":"iOS 17.1 finally fixes a three-year-old Private Wi-Fi Address security hole","link":"https://www.macworld.com/article/2118771/ios-17-1-private-address-security-hole-fix.html","date":1698421990000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Here’s <a href=\"https://www.macworld.com/article/2112046/ios-17-1-fixes-significant-location-incoming-calls-image-persistence.html\">another reason you should update to iOS 17.1</a>: the Private Address feature actually works now. Introduced in iOS 14, Private Address (also called Private Wi-Fi Address) was supposed to provide users with a way to avoid being tracked while connecting to Wi-Fi networks. But according to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://arstechnica.com/security/2023/10/iphone-privacy-feature-hiding-wi-fi-macs-has-failed-to-work-for-3-years/&amp;xcust=1-1-2118771-1-0-0&amp;sref=https://www.macworld.com/feed\">Ars Technica</a>, the feature never really worked in the first place because of a security vulnerability. Apple finally fixed it with the latest iOS 17 update.</p>\n\n\n\n<p>The issue, documented as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.cve.org/CVERecord?id=CVE-2023-42846&amp;xcust=1-1-2118771-1-0-0&amp;sref=https://www.macworld.com/feed\">CVE-2023-42846</a> in the Common Vulnerabilities and Exposures database, involved the Private Address feature’s ability to hide an iPhone’s Media Access Control (MAC) address, which is used to define a device’s location on a Wi-Fi network. But, as explained in a <a href=\"https://www.macworld.com/article/1940467/enhance-network-security-private-wi-fi-address.html\">Macworld Mac 911 column about Private Address</a>, “If that MAC address doesn’t change over time, the backend of a hotspot portal could build up a profile of you (or your device) using a variety of clues that…only prove trackable when paired with a fixed network ID.”</p>\n\n\n\n<p>Security researchers Talal Haj Bakry and Tommy Mysk found a vulnerability in Private Address that had been present since it was introduced in iOS 14 in 2020. With the feature on, iOS would respond to address requests with a private address as the source, which made it seem like the feature worked. However, the researchers found that the real, actual MAC address was provided in a different part of the request-response. “From the get-go, this feature was useless because of this bug,” Mysk said to Ars Technica. Mysk posted a 98-second YouTube video explaining the problem and noting that it is fixed in iOS 17.1.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>Ars Technica does state that, “the feature wasn’t useless, because it did prevent passive sniffing,” but it was relatively easy to find the real MAC address and use the information nefariously. Ars also points out that, “the fallout for most iPhone and iPad users is likely to be minimal, if at all.”</p>\n\n\n\n<p>The Private Address feature is found in Settings; tap <em>Wi-Fi</em>, then, with any of the Wi-Fi hotspots that appear, tap the “<em>i</em>” icon. If you <a href=\"https://www.macworld.com/article/2084154/ios-17-1-release-features-fixes-security-updates.html\">install iOS 17.1</a>, you can rest assured that it actually works now.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">Learn more about iOS 17 in our superguide</a>.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7cb0239ed57d9a1416d78e465e984997446c7fd9cd43a50ec34206bbf4c997c8","category":"Apple"}