{"title":"Cross-cultural adaptation and validation of the Lithuanian version of the Spine Functional Index","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299719","date":1710338400000,"content":"<p>by Giedrė Vaičienė, Kristina Berškienė, Vidmantas Zaveckas, Vilma Tamulionytė</p>\r\nBackground <p>Low back pain is one of the most frequent medical problems caused by different factors. It is important to evaluate low back pain by choosing the best suited tool for the specific spine condition and pain severity. The Spine Functional Index (SFI) is a relatively new physical functioning-related questionnaire that can be used to assess different aspects of daily activities and movements. The purpose of this study was to cross-culturally adapt the SFI for the Lithuanian language and to determine its psychometric properties of validity, reliability, construct stability, internal consistency and factor structure.</p> Methods <p>The study was designed as a two-stage observational study. Double forward and backward translations of SFI were performed for cultural adaptation for the Lithuanian language. For evaluation of psychometric properties, 125 participants with non-specific low back pain (duration of symptoms ≥ 6 weeks) rated their pain using Numeric Rating Scale, completed the Lithuanian version of SFI and Oswestry Disability Index. In 3 to 7 days all participants completed Lithuanian version SFI for the second time. The full sample was employed to determine internal consistency, test-retest reliability, construct stability, measurement error, construct validity and factor structure.</p> Results <p>There was good internal consistency and reliability with Lithuanian version of SFI as Cronbach’s α = 0.92 and r = 0.82. Spearman-Brown coefficient was 0.97 representing good construct stability. Measurement error from standard error of the mean (SEM) was 6.96, from Minimal Detectable Change (MDC) was 16.24. Construct validity between the Lithuanian version of SFI and Oswestry Disability Index was excellent (ρ = 0.83), and good between the SFI and Numeric Rating Scale (ρ = 0.55). The factor analysis demonstrated a one-factor solution explaining 35.04% of total variance.</p> Conclusion <p>Lithuanian version of SFI is a new reliable and valid instrument for functional evaluation of back pain in Lithuanian speaking patients.</p>","author":"Giedrė Vaičienė","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7cb819e33554e91fe3e6cdc9c638bc8af44dd5eff7ce29e1df0e8f11f3736989","category":"Interdisciplinary"}