{"title":"Letters from TCA Mentoring Programme","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/letters-from-tca-mentoring-programme","date":1629721965000,"content":"\n      <p><span></span><span>In May this year, women’s cycling union, The Cyclists’ Alliance (TCA), launched a mentorship program called TCAMP to pair new and experienced riders. Also giving female cyclists a chance to explore career options before retiring from the sport, Rouleur has teamed up to give riders interested in journalism and writing a chance to try out their skills. </span></p>\n<div></div>\n<p><span>Here, four riders taking part in the mentorship program write about what the initiative means to them and how they have benefitted from it so far. </span></p>\n<h4><strong>Heidi Franz</strong></h4>\n<p><em>Heidi, 26, is from the USA. She rides for the Rally Cycling Women’s Team.</em></p>\n<p><span>“We all have our unique origin stories in the world of cycling and the diverse backgrounds and turns in the road that led us to bike racing. I remember being a brand new racer, looking up to the stronger women around me who encouraged me and guided me to the crossroads of being elite versus a professional. When I took the step into professional women’s racing at the age of 22, that world was a big question mark for me. I didn’t have years of racing as a junior or U23, and I didn’t have family who were already immersed in that world. It was almost like trying to study a map with no roads. When the TCAMP program started during my second season as a pro, I jumped at the chance to engage and learn from women who had been all over the map. Women who experienced injury, setback, fork after fork in the road, but also satisfaction and pride, and joy in what they do as well. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1319611905_1024x1024.jpg?v=1629720847\" /></span></p>\n<p><em><span>Image: Getty/</span>Luc Claessen<span>/</span><span>Stringer</span></em></p>\n<p><span>There is so much change happening in women’s cycling all the time. The growth is tangible! As I also continue to progress with it and move my own goalposts, I find myself always seeking out the guidance of women who know what it’s like to evolve with the sport itself. Having been matched with a mentor through TCAMP and The Cyclist’s Alliance, I feel like I have this extra boost of confidence - that someone has my back. My mentor can give me honest direction and guidance as I approach a situation I’m unfamiliar with or when I arrive at another crossroads.</span></p>\n\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-cyclists-alliance-rider-survey-part-one-34-earn-no-salary-in-2021\"><span><em><strong><span>Related: The Cyclists' Alliance Survey Part 1</span></strong></em></span></a></p>\n<p><span>The beauty of the mentorship is that it’s not just about racing bikes; it can go so far beyond that. In women’s cycling, we have athletes with incredible skills and jobs outside of cycling, from medical fields to engineering, social justice or the arts. We bring all these skills and backgrounds to the peloton. And when we move on from bike racing, it’s so important to have mentors that help you see the way forward and utilise the skills that we have developed. Mentorship through TCAMP brings clarity to my path forward in the sport and helps me build confidence in my capacity and my decisions”. </span></p>\n<h4><strong>Kerry Jonker</strong></h4>\n<p><em><span>Kerry, 25, is a South African rider racing for French Continental team Macogep Tornatech Girondins de Bordeaux.</span></em></p>\n<p><span>“The TCA mentor program was something I was made aware of when the program launched in 2019, and I was still a club rider. I remember being excited at the prospect of being involved in the program one day to learn from some of the very best in the sport.</span></p>\n<p><span>In 2021 I finally got that email from the TCA announcing their new and improved mentor program, and as a fresh-faced UCI level rider, I was eligible to apply. The TCA formulated a detailed questionnaire to learn more about the applicant’s personality types and from that match mentees to mentors. This really stood out for me as they didn’t just randomly allocate mentors to mentees based on nationality or rider type.</span></p>\n<p><span>Personally, I have been paired with an exceptionally successful athlete who I looked up to even prior to starting my cycling career. Gracie and Roos at TCAMP did such a good job pairing my mentor and me up. When we do chat, I realise some of the suggestions my mentor has for me I’ve already implemented due to us being so similarly minded.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1228684693_1024x1024.jpg?v=1629720982\" /> </span><em><span>Image: Marco Bertorello/Getty</span></em></p>\n<p><span>This is a great thing as it gives me confidence in trusting my mentor and developing a relationship with her. I know that any new advice she gives me is worthwhile, as she clearly knows what she’s doing! One of the greatest benefits of the mentor program is that if I’m unsure of what decision to make about an issue, I can easily flick my mentor a WhatsApp message or call and get their opinion. It’s a nice security blanket knowing that I have someone there to help steer me in the right direction if I need guidance.</span></p>\n<p><span>We are now in the second month of the mentor program, and it has been a learning experience for all involved. The thing to realise is professional cycling is a culmination of many small components. I strongly feel this mentor program can be just one of those aspects that could lead to success. It’s about having that strong support network around you, and the value of a mentor shouldn’t be underappreciated.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related: \"We can change the culture of the sport\" Iris Slappendel interview</a></em></strong></p>\n<p><span>Of course, there was no guarantee I would get anything out of the program. However, I knew at the very least I’d get to know an established athlete who has achieved things I currently can only dream of. Gracie and Roos have been incredibly proactive in sending out conversation starters each month and providing relevant webinars so we can all get the most out of the mentor program and develop not only as professional cyclists but as people too.</span></p>\n<p><span>I believe that for new riders like me and those in the middle of their careers, there is so much to be learnt from those more experienced than us. I also hope that this is a two-way relationship and the mentors can realise how extraordinary their careers have been whilst passing their knowledge on to us fresher and naive folks. We cyclists seem to always be so hard on ourselves, and I’ve seen race winners and national champions be down on themselves and their success. I like to remind them that ‘hey, if my career is as successful as theirs, I’d be over the moon’. So the mentor program can be a nice way for athletes to be reminded of the success they have had.”</span></p>\n<h4><strong>Callie Swan</strong></h4>\n<p><em>Jonker’s teammate, Canadian Callie Swan, is 23</em></p>\n<p><span>“I am now a little over a year in as a TCA member. The TCA basically serves as the UCI Women’s peloton union. However, they offer way more than just their advocacy work, including TCAMP.</span></p>\n<p><span>When The Cyclist’s Alliance Mentorship Program, was announced, I immediately jumped at the chance and signed up. The past year, I have tuned in to their zoom webinars and perused the website. I’ve also used their Contract Health Check service and stayed up to date on the Covid-19 rules continually being updated from the UCI.</span></p>\n<p><span>I have had mentors in the past. All have been wonderful and openly divulged the ins and outs of the men’s world tour. However, I have never had a female cyclist mentor, someone who could relate to me and understands exactly what is going on in the women’s peloton and how to navigate it.</span></p>\n<p><span>Let me introduce “K”, my mentor. K spent years at the top of the sport, guiding the best riders to victory. She understands exactly what it is like to navigate the women’s peloton. She knows every race profile, every rider to watch out for, all the race tactics and analysis, but also off the bike work, like how to contact teams and what a proper CV should look like.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1318653518_1024x1024.jpg?v=1629721088\" /><em>Image: Getty/Luc Claessen<span>/</span><span>Stringer</span></em></span></p>\n<p><span>Upon our first Zoom, we chatted about creating an action plan. Somewhat of a roadmap for my season and beyond. What can I accomplish this year that still has me moving forward even if the race results aren’t there? One thing I have learned is that what goes into results is more than just the training on the bike. Yes, that’s a big factor, but it’s about setting yourself up as best as possible to give yourself a shot at getting that result. You can do this by defining what kind of rider style you are and ensuring that you maximise your talent at races that suit you best. Knowing yourself and what experience you can provide to the team are things that directors also seek out, aside from just the wins!</span></p>\n<p><span>This action plan has kept me focused on the bigger picture. Racing week to week, you can get small-minded and forget about the larger things of life that are happening outside the cycling world’s bubble. K is always posing questions that make me reflect, question, and seek out where I can make the next opportunity for myself.</span></p>\n<p><span>TCAMP could not have come at a better time for me this year. Having a friendly face to chat with each week, analysing and discussing the peloton’s intricacies, has been invaluable for me as I take on my first season in Europe. My biggest takeaway from K so far? Focus on what makes you your best, not what others may think of you!”</span></p>\n<h4><strong>Natasha Badertscher</strong></h4>\n<p><em><span>Natasha, 18, is a multidiscipline rider from Canada.</span></em></p>\n<p><span>“One out of three. The rate at which girls drop out of sports by the age of sixteen is staggering. It is an unfortunate fact that comes to my mind when I think about female sports. Developing young athletes needs to be inclusive. In male-dominated sports, the need for support for young female athletes is ever-present. Working your way to the top of cycling is virtually impossible without a support network. A valuable support network consists of people who can provide expert knowledge, a listening ear, and more. </span></p>\n<p><span>For female athletes, they also need to understand the particular needs of our physiology. My support network comes through my parents and family. It comes through other athletes I meet, teams, coaches, and staff that support the development of female athletes. Building such a network is not an easy task. The Cyclists’ Alliance has created a mentorship program that not only provides the support needed for up and coming athletes but also aids us in fostering important connections. On top of that, The Cyclists’ Alliance is continuing to build an outstanding foundation encouraging the development of female cycling. The data about inequalities that The Cyclists’ Alliance has acquired through research has also encouraged my own advocacy for equality in women’s sport.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-cyclists-alliance-new-three-step-mentor-program\">Related: The Cyclists' Alliance new three-step mentor programme</a></em></strong></p>\n<p><span>My connection with a mentor provides me with access to knowledge that comes from her lived experience in the sport. My mentor also provides me with advice, tips, strategies for racing and training, or even life in general. This aids in reinforcing the holistic approach taken by The Cyclists’ Alliance that promotes well rounded and healthy development of us athletes. The relationship with my mentor is informal, and I love that I can just reach out and feel comfortable sending a quick text message. Her experience both in life and in the peloton have proved to be quite valuable. For example, I can think of her advice before or during a race. This helps me develop my self-reliance as ​the mentor’s role is not to be beside me and show me how to do something, but rather to help me prepare and be the best I can be. </span><span> </span></p>\n<p><span>The mentor program does not only consist of connections with mentors but also provides resources and webinars for athletes. The webinars, led by experts, encourage us to learn more about ourselves, our personalities, and our own boundaries. As it is typically a small group of like-minded individuals attending the webinars, it is a safe space for anyone to ask questions. </span><span> </span></p>\n\n<p><span><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/introducing-rouleur-s-women-s-newsletter\"><em><strong>Sign up to our women's newsletter</strong></em></a></span></p>\n<p><span>I am grateful to be a mentee in the program. The first time I connected with my mentor, I was excited to meet her and was inspired by her journey. I was thrilled to find out that my mentor studied the same subject in university as I will be pursuing. I look forward to furthering my connection with my mentor and someday becoming a mentor to an upcoming athlete as well.”</span></p>\n<p><em><span>Cover image: Sean Hardy</span></em></p>\n<p><strong><em><a href=\"https://cyclistsalliance.org/\" target=\"_blank\">Find out more about The Cyclists’ Alliance and TCAMP</a></em></strong></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7cc08b8983d8d8fe95c1436b00867a9bcc293e3d824c7d579e5a071deda035ca","category":"Cycling"}