{"title":"Supplementation with live Saccharomyces cerevisiae boulardii during the initial 42 days of the feedlot phase in Nellore beef cattle","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae097/7696140?rss=1","date":1718755200000,"content":"<span><div>Abstract</div>This study aimed to assess the effect of <span>Saccharomyces cerevisiae boulardii</span> CNCM I-1079 supplementation during the initial feeding period on the performance of Nellore bulls in a feedlot system. One hundred ninety-eight Nellore bulls were used in a completely randomized block design, with blocking based on weight within each treatment group: light (331.4 kg; 4 pens), medium (349.7 kg; 4 pens), and heavy (362.5 kg; 3 pens). The treatments included CON—a basal diet, and SCB—basal diet plus a probiotic (<span>Saccharomyces cerevisiae boulardii</span> CNCM I-1079; 1.0 × 10<sup>10</sup> CFU/head/d). Experimental diets were administered for the first 42 d (21 d in the step-up phase and 21 d in the finishing diet −870 g concentrate/kg dry matter [<strong>DM</strong>]). Subsequently, both treatment groups were transitioned to the same basal diet for an additional 76 d, completing 118 d on feed. Linear regression analysis was conducted for dry matter intake (<strong>DMI</strong>) data. During the initial 42 d, DMI tended to be higher for SCB (<span>P</span> = 0.09); also bulls fed SCB reached the plateau of the curve at 9.17 kg DMI/d earlier (39 d, R<sup>2</sup> = 0.97) than those fed CON (43 d; R<sup>2</sup> = 0.96) diets. For the first 42 d, the SCB treatment exhibited higher final weight (393.0 vs. 401.4 kg, <span>P</span> = 0.02), total gain (49.3 vs. 53.5 kg, <span>P</span> = 0.02), daily weight gain (1.124 vs. 1.274 kg, <span>P</span> = 0.02), and G:F (0.174 vs. 0.188, <span>P</span> = 0.04). Over the entire 118-d period, SCB-fed bulls had greater final body weight (509.5 vs. 518.0 kg, <span>P</span> = 0.02), total body weight gain (163.7 vs. 170.3 kg, <span>P</span> = 0.01), and average daily gain (1.366 vs. 1.420 kg, <span>P</span> = 0.01). The feed efficiency of SCB-supplemented bulls was 8.05% higher than CON (<span>P</span> = 0.04), and the final carcass weight was 1.69% greater for animals fed SCB (283.8 vs. 288.6 kg, <span>P</span> = 0.04). Total carcass weight gain (110.9 vs. 114.7 kg) and daily carcass weight gain (0.924 vs. 0.956 kg) tended (<span>P</span> = 0.06) to increase by 3.46% in SCB-fed animals compared with those fed CON. Gain yield, carcass conversion, and carcass yield did not differ between treatments. There were no significant differences in the apparent digestibility of DM, crude protein, neutral detergent fiber, and ether extract between treatments. However, starch digestibility (92.7% vs. 88%) was greater for the control treatment (<span>P</span> &lt; 0.001). Including live <span>Saccharomyces cerevisiae boulardii</span> yeast as a probiotic supplement during the initial 42 d in the feedlot enhanced early-stage growth performance in Nellore bulls. Notably, this supplementation carried over carcass gain over the entire feedlot period.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"7cc179a6a4a04bb1e491b66566f8b10b5781bcab32a4ae3c9d253b22a3a85b89","category":"Environment"}