{"title":"G0 arrest gene patterns to predict the prognosis and drug sensitivity of patients with lung adenocarcinoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309076","date":1724076000000,"content":"<p>by Yong Ma, Zhilong Li, Dongbing Li, Baozhen Zheng, Yanfeng Xue</p>\r\n\r\nG0 arrest (G0A) is widely recognized as a crucial factor contributing to tumor relapse. The role of genes related to G0A in lung adenocarcinoma (LUAD) was unclear. This study aimed to develop a gene signature based on for LUAD patients and investigate its relationship with prognosis, tumor immune microenvironment, and therapeutic response in LUAD. We use the TCGA-LUAD database as the discovery cohort, focusing specifically on genes associated with the G0A pathway. We used various statistical methods, including Cox and lasso regression, to develop the model. We validated the model using bulk transcriptome and single-cell transcriptome datasets (GSE50081, GSE72094, GSE127465, GSE131907 and EMTAB6149). We used GSEA enrichment and the CIBERSORT algorithm to gain insight into the annotation of the signaling pathway and the characterization of the tumor microenvironment. We evaluated the response to immunotherapy, chemotherapy, and targeted therapy in these patients. The expression of six genes was validated in cell lines by quantitative real-time PCR (qRT-PCR). Our study successfully established a six-gene signature (CHCHD4, DUT, LARP1, PTTG1IP, RBM14, and WBP11) that demonstrated significant predictive power for overall survival in patients with LUAD. It demonstrated independent prognostic value in LUAD. To enhance clinical applicability, we developed a nomogram based on this gene signature, which showed high reliability in predicting patient outcomes. Furthermore, we observed a significant association between G0A-related risk and tumor microenvironment as well as drug susceptibility, highlighting the potential of the gene signature to guide personalized treatment strategies. The expression of six genes were significantly upregulated in the LUAD cell lines. This signature holds the potential to contribute to improved prognostic prediction and new personalized therapies specifically for LUAD patients.","author":"Yong Ma","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7cc589b8ec6afc7655f00c2afb314024ce0b9afa2bf6fb67f5780411a9c380db","category":"Interdisciplinary"}