{"title":"Real-Time Modelling for Design and Controlling of Material Additive Manufacturing Processes","link":"https://www.preprints.org/manuscript/202409.1540/v1","date":1726754297000,"content":"The use of digital twin and shadow concepts for industrial material processes have promoted new notions to bridge the gap between physical and cyber manufacturing processes. Hence, many multi-disciplinary areas like advanced sensor technologies, material science, data analytics, and machine learning algorithms are employed to create such hybrid systems. On the other hand, new additive manufacturing (AM) processes for metals and polymers based on novel emerging technologies have already shown a promising horizon for manufacturing of sophisticated parts with complex geometries. These processes are going through a major transformation with the emergence of digital technology, hybrid physical-data driven modelling and fast reduced models. This paper presents a fresh look at the hybrid physical-data driven and reduced order modelling (ROM) techniques for digitalization of AM processes within a digital-twin concept. The main contribution is to show the benefits of ROM and machine learning (ML) technology for process data handling, optimization\\controlling and their integration into the real-time assessment of AM processes. Hence, a novel combination of efficient data solver technology and architecturally designed neural network (NN) module has been developed for the transient manufacturing processes with high heating\\cooling rates. Furthermore, a real-world case study has been presented where the combination of hybrid modelling along with ROM and ML schemes are used for an industrial wire arc AM (WAAM) process.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7cc9e9a43c31ac3c4a4dc61acdfb4c437a53f08135bead5e97b1e7aadb95de03","category":"Interdisciplinary"}