{"title":"Giro d'Italia 2021: Stage 11 Preview - the Giro's gravel spectacle","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-stage-11-preview","date":1621347882000,"content":"\n      <p>Stage 11 of the Giro d’Italia is 163km, one of the shorter road stages of this year’s route. However, it could be one of the most action-packed Grand Tour stages in recent memory.</p>\n<p>Strade Bianche is one of the most spectacular classics on the pro racing calendar. It’s eponymous white, gravelled, Tuscan roads set the stunning scene for a gruelling race, where the riders often cross the line in drabs due to the difficulty. With long sections of gravelled roads, Strade is unlike any other race. Well, apart from stage 11 of the 2021 Giro d’Italia.</p>\n<div></div>\n<p>Stage 10 of the race was won by Peter Sagan — his second stage 10 victory in a row. Bora-Hansgrohe put on a masterclass, first dropping the likes of Tim Merlier and Giacomo Nizzolo before placing Sagan in the perfect position to win in Foligno.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/when-the-giro-d-italia-goes-gravel-remembering-2010s-strade-bianche-stage\"><em><strong>When the Giro d’Italia goes gravel: Remembering 2010's strade bianche stage</strong></em></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\"><em><strong>Giro d'Italia 2021 Guide</strong></em></a></p>\n<h4><b>Route</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/T11_Montalcino_alt_1024x1024.jpg?v=1621334954\" /></b></p>\n<p><em><span>Giro d'Italia 2021 stage 11 profile</span></em></p>\n<p>Stage 11 begins in Perugia where the road is flat for the first 45km. Only a couple of short hills interrupt the rhythm before kilometre 93, where the race really kicks-off. The gravel begins here with a 9km gravelled sector. After a brief kick on entry, this sector is largely downhill. Nonetheless, it will introduce the riders to gravel and could start the mayhem with an increased tempo dropping some riders.</p>\n<p>The uncategorised Bibbiano climb follows, and although no KOM points wait at the top, the 8.6% average gradient for over a kilometre could provide a launchpad for those looking to gain an advantage before the next gravel section arrives. However, any advantage gained will not be enough for those already struggling as the next 13.5km are gravelled and largely uphill. This will no doubt cause carnage.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/T11_S01_LumeSpentoW_600x600.jpg?v=1621337513\" /></p>\n<p><em>Passo del Lume Spento #1 profile</em></p>\n<p>An intermediate sprint lies halfway up the climbing section which averages 8.5% for over 3km with a max gradient of 16%. These percentages combined with the gravel will absolutely decimate the field. If any GC contenders are struggling here and lose touch, their dreams of the <em>maglia rosa </em>will be crushed, no questions asked.</p>\n<p>At the end of the gravel waits a short ramp, which is third category and therefore has nine KOM points on offer to the rider that crosses first. </p>\n<p>The riders will then descend for the next 10 kilometres, where if they haven’t been able to already, the director sportifs and everyone watching will be able to take stock of the carnage that has taken place. At the foot of the descent lies a bonus seconds sprint in Castelnuovo dell’Abate. With more gravel and steep climbs still to come, we are unlikely to see a repeat of Remco Evenepoel and Egan Bernal’s rampant sprint on stage 10.</p>\n<p>At this point 26km remain. The penultimate gravel sector begins immediately and is 6.8km in length. This sector takes place largely on a false flat, but also features a short 8% ramp where we could see further differences made.</p>\n<p>A descent follows, and at the foot of that just 12 kilometres are left. If somehow, things are still together, they won’t be for very long as the final gravel sector begins.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/T11_S02_LumeSpentoS_600x600.jpg?v=1621337632\" /></div>\n<div>\n<p><em>Passo del Lume Spento #2 profile</em></p>\n<p>The first 5km of this section are gravelled and this marks the final gravelled roads. The first 1km takes place on another steep ramp, and could be a hotspot for attacks. As the gravel ends, the race doesn’t get any easier. The road shoots uphill yet again and with percentages touching 12%, the strongest will be able to demonstrate their power and the final, decisive gaps will be made.</p>\n<p>The road descends briefly before the final 500 metres take place on the highly technical, narrow streets of Montalcino.</p>\n</div>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVos-SWpix.com1832_1024x1024.jpg?v=1621334803\" /></b><em><span>Image credit: CorVos/SWpix</span></em></p>\n<p>Almost anything could happen on this stage. The number of gravelled kilometres mean an increased chance of mechanicals and crashes, it may also take longer for team cars to get to their riders when they require assistance – <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-angels-in-the-blue-overalls\">though Shimano's neutral service will be on hand</a>. However, the steep percentages combined with gravel roads make for a unique prospect at a Grand Tour. Many of the major GC protagonists could feasibly lose the Giro d’Italia en route to Montalcino, and some good take a significant step towards winning it. </p>\n<p>Given the stage’s similarity to Strade Bianche, it would make sense to look at the GC riders’ career performance at the race:</p>\n<p><strong>Egan Bernal</strong> - 3rd 2021<br /> <strong>Remco Evenepoel</strong> - Never raced<br /> <strong>Alex Vlasov</strong> - Never raced<br /> <strong>Giulio Ciccone</strong> - 32nd 2020<br /> <strong>Atilla Valter</strong> - Never raced<br /> <strong>Hugh Carthy</strong> - Never raced<br /> <strong>Damiano Caruso</strong> - DNF 2012, 37th 2015, 47th 2016, 43rd 2017, DNF 2018<br /> <strong>Dan Martin</strong> - Never raced<br /> <strong>Simon Yates</strong> - 63rd 2021<br /> <strong>Davide Formolo</strong> - 2nd 2020, 24th 2021 <br /> <strong>Daniel Martínez</strong> - 73rd 2016 (aged 19)<br /> <strong>Marc Soler</strong> - DNF 2015, DNF 2016<br /> <strong>Romain Bardet</strong> - 2nd 2018, 20th 2021<br /> <strong>Emanuel Buchmann</strong> - 40th 2021<br /> <strong>Vincenzo Nibali</strong> - 24th 2008, 37th 2010, 15th 2012, 40th 2015, 15th 2016, 44th 2017, DNF 2018, 31st 2019, DNF 2020<br /> <strong>Tobias Foss</strong> - 46th 2021<br /> <strong>Pello Bilbao</strong> - 10th 2021<br /> <strong>João Almeida </strong>- 37th 2021</p>\n<p>Instantly, it’s clear that many of the primary GC riders have never experienced Strade Bianche. Among them, <strong>Remco Evenepoel</strong>, <strong>Alex Vlasov, Dan Martin</strong> and <strong>Hugh Carthy</strong>. Although it may only be slim, this must be considered a disadvantage. The aforementioned riders will probably be happy to come away from the stage reducing their losses.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-gc-battle-begins\">The Battle for the 2021 Giro d'Italia: Taking Stock of the GC</a></strong></em></p>\n<p>On the contrary, <strong>Vincenzo Nibali</strong> and <strong>Damiano Caruso</strong> are among the riders with the most experience at Strade. Although Caruso has never finished particularly well — his best finish was 37th of his five attempts — the Italian will be able to lean on those experiences. Further, Caruso was riding as a domestique throughout his previous Strade appearances. He was assisting Greg Van Avermaet to 2nd place in 2015, for example. We must also take this into account.</p>\n<p>Next, we have the riders that have proven to excel on gravel before: <strong>Egan Bernal, Romain Bardet</strong> and <strong>Davide Formolo</strong>. Bernal finished in a highly impressive third place at this season’s edition of Strade Bianche, only beaten by Mathieu van der Poel and Julian Alaphilippe while finishing ahead of Wout Van Aert and Tadej Pogačar. The gravelled roads will not deter Bernal one bit and his stage winning attack on a similar surface days ago will only add to that confidence. Formolo and Bardet were equally strong when they finished runner-up and both riders will see this as a great opportunity to gain time en masse.</p>\n<div></div>\n<p>So, how will the stage unfold? There will be a plethora of riders and teams that will look to gain presence in the breakaway. This means that the breakaway could take a while to form. The Ineos Grenadiers now hold the <em>maglia rosa</em> which means it is their duty to control, a job which should be straightforward considering their strength in-depth. Ineos will no doubt push on later in the stage with the likes of Filippo Ganna and Gianni Moscon guiding Egan Bernal over the gravel.</p>\n<p>However, if the breakaway features 20 or more riders and are allowed up the road early, they may already have an unassailable lead. Teams without a GC rider include Alpecin-Fenix, Intermarché-Wanty-Gobert Matériaux, Lotto-Soudal and AG2R Citroën. These teams will be aggressive in sending riders up the road in numbers to form a powerful breakaway, where they’ll hope to compete for stage victory. From these teams, <strong>Quinten Hermans</strong>, <strong>Gianni Vermeersch</strong>, <strong>Dries De Bondt</strong>, <strong>Tony</strong> <strong>Gallopin</strong>, <strong>Stefano</strong> <strong>Oldani</strong> and <strong>Thomas</strong> <strong>De</strong> <strong>Gendt</strong> are prime candidates to join the breakaway.</p>\n<p>Separately, the GC teams will also want to send satellite riders up the road — riders that can gain an early advantage in the breakaway with the aim of dropping back to support their leader later in the stage. Ineos will want to limit these riders to prevent others from gaining a tactical advantage. If some of these teams also manage to slip multiple riders into the breakaway, they could also compete for stage victory. Some of these riders include <strong>Diego</strong> <strong>Ulissi</strong>, <strong>Alberto</strong> <strong>Bettiol</strong>, <strong>Samuele Battistella</strong>, <strong>Gianluca</strong> <strong>Brambilla</strong> and <strong>Matteo</strong> <strong>Jorgenson</strong>.</p>\n<h4><b>Prediction</b></h4>\n<p><em><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1317481401_1024x1024.jpg?v=1621347649\" /></em></p>\n<p><em>Davide Formolo (</em><em><span>Image credit: Marco Alpozzi - Pool/Getty Images)</span></em></p>\n<p>The battle for the early breakaway will be fierce, meaning they may struggle to get away quickly and build a sizeable lead. As soon as the peloton hits the gravel, Ineos will light up the race and we could witness multiple GC favourites lose the Giro d’Italia. However, we think it will be<strong> Davide Formolo</strong> clinching stage victory. The Italian was excellent at Strade Bianche last season and must gain time here if he is to finish well overall. By sending the likes of Alessandro Covi and Diego Ulissi into the breakaway, UAE would be in a great position to support Formolo late into the race.</p>\n<p><em><span>Cover image: Tim de Waele/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7ccbe431e0334626f3f71f8ba415d5a21a9cf58d014bd6828ac7e797c6a7cc43","category":"Cycling"}