{"title":"When I look at the yellow iPhone 14, all I see is red","link":"https://www.macworld.com/article/1532375/yellow-iphone-color-launch-spring-holding-back.html","date":1678705200000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Welcome to our Apple Breakfast column, which includes all of the Apple news you missed last week in a handy bite-sized roundup. We call it Apple Breakfast because we think it goes great with a morning cup of coffee or tea, but it’s cool if you want to give it a read during lunch or dinner hours too.</p>\n\n\n\n<h2>The money of color</h2>\n\n\n\n<p>Video games have changed in lots of positive ways since I was mad at them in the 1990s, from improved graphics to a broader outlook that caters, with only a small amount of acrimony, to hardcore and casual gamers alike. But one thing that’s got indisputably worse is the growing dominance of downloadable content (DLC) culture, where studios shamelessly launch half-finished games and then milk their most loyal fans with years of subscriptions and paid-for extras. It makes me nostalgic for the days when you only had to pay once for an eternal masterpiece like Cannon Fodder or Sensible World of Soccer.</p>\n\n\n\n<p>Why are you thinking about DLC, David? Because this week Apple repeated its annual trick of launching a new color midway through an iPhone generation, wowing fans with the excitement of a <a href=\"https://www.macworld.com/article/1534034/iphone-14-plus-yellow-color-announced.html\">yellow enclosure</a>. I feel about delayed color launches much the same way I feel about DLC. I don’t approve.</p>\n\n\n\n<p>“Yellow” is not a brilliant new invention that Apple has had its engineers working on for the past six months. The company could very easily have released the yellow iPhone 14 alongside the other color finishes last fall, but it decided not to for one simple reason: launching a new color is a clever way to gain attention and boost a product just as sales are falling off. It’s a cynical way to <a href=\"https://www.macworld.com/article/1534519/iphone-14-pro-max-canary-yellow-case-apple-watch-bands.html\">grab a few headlines</a> and flog a few extra units.</p>\n\n\n\n<p>Where does the customer figure in all this, other than as a source of revenue? Barely at all. Apple isn’t trying to deliver the best experience to the most people, but to hamper their choice in a way that is calculated to generate the maximum profit.</p>\n\n\n\n<p>If you were buying an iPhone 14 last September and especially like the color yellow, you faced a choice between two compromises: either buy a phone in a color you don’t like as much, or wait, hope Apple benevolently picks yellow as its bonus color this cycle, and then end up buying your new phone at a time that’s less convenient. The same choice faced green-loving iPhone 13 buyers in 2022, and pro-purple iPhone 12 customers in 2021; compromise on color, or compromise on timing. And the same could apply to those loyal early adopters who bought the second-gen HomePod earlier this year but—as was the case with the HomePod mini—may gaze longingly on the additional color options that launch midway through the product’s lifespan. It’s all deeply frustrating and the polar opposite of putting the customer first.</p>\n\n\n\n<p>But this policy, of deliberately holding back appealing elements of a product so you can sell the upgrade further down the line, ties in with a broader strategy of which Apple is often suspected. Why did Apple take so long to bring a large screen to the iPhone, or a stylus to the iPad? Why did widgets and night mode land so much later on iOS than they did on Android? Maybe it’s because the company knew it could sell its devices without those features in the short term, and that they would be useful later on when it needed to persuade customers to buy the next generation. Each Apple product is competing with its own predecessor just as much as with contemporary products from rival manufacturers, and this means the company is motivated to leak out useful features as slowly as possible: release the perfect iPhone tomorrow and you’ve just killed the goose that lays the golden eggs.</p>\n\n\n\n<p>I don’t expect Apple to change its ways any more than I expect video game publishers to stop selling DLC. There’s too much of a financial incentive; the market has spoken. Unless people stop throwing their money at the latest iPhone color, Apple isn’t going to stop holding back colors so they can release them with fanfare a few months later.</p>\n\n\n\n<p>But it does make me frown each spring when a new iPhone color appears and we’re all supposed to be pleased. What use is this now, Tim Apple? What am I supposed to do with this stupid blue phone I’ve been carrying around for six months? Do you think I’m made of money?</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3811721/apple_breakfast_logo.jpg?quality=50&amp;strip=all\" alt=\"Apple Breakfast logo\" loading=\"lazy\" /></figure><p>Foundry</p></div>\n\n\n\n<h2>Trending: Top stories</h2>\n\n\n\n<p>The Mac is about to enter a <strong>performance supercycle</strong> like <a href=\"https://www.macworld.com/article/1534621/heres-how-apple-is-about-to-supercharge-the-mac-lineup.html\">we’ve never seen</a>.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1533160/apple-tv-plus-app-store-ads.html\">Ads are everywhere</a> on Apple devices and it’s <strong>not a good look</strong>, reckons the Macalope.</p>\n\n\n\n<p>If Apple <strong>loves music so much</strong>, why can’t it <a href=\"https://www.macworld.com/article/1531289/apple-music-streaming-itunes-handoff-airplay.html\">get streaming right</a>?</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/1568189/apple-music-classical-app-store-iphone-free-march-28.html\">Apple Music Classical</a> will launch on March 28 with the <strong>‘world’s largest’ catalog</strong>.</p>\n\n\n\n<p>From charging to Face ID, Michael Simon <a href=\"https://www.macworld.com/article/1532043/iphone-myths-debunked-clean-energy-charging-passcode-theft-face-id.html\">debunks</a> 3 recent <strong>iPhone myths</strong>.</p>\n\n\n\n<p><strong>Apple Music Classical</strong> has <a href=\"https://www.macworld.com/article/1568189/apple-music-classical-app-store-iphone-free-march-28.html\">arrived in the App Store</a> at last… but it’s still on “pre-order.”</p>\n\n\n\n<h2>The rumor mill</h2>\n\n\n\n<p>Does the <strong>yellow iPhone</strong> confirm there <a href=\"https://www.macworld.com/article/1534315/yellow-iphone-spring-event-macbook-air.html\">won’t be an Apple spring event</a>?</p>\n\n\n\n<p>Apple’s rumored <strong>$700 price hike</strong> for the iPad Pro is <a href=\"https://www.macworld.com/article/1580952/oled-ipad-pro-price-rumors.html\">as ridiculous as rumors get</a>.</p>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/1533246/iphone-15-leaks-volume-button-mute-switch-display-bezels.html\">latest iPhone 15 leaks</a> confirm <strong>major upgrades</strong> for all four models.</p>\n\n\n\n<p>A <strong>HomePod with a screen</strong> will <a href=\"https://www.macworld.com/article/1653915/homepod-screen-launch-2024-report.html\">reportedly launch</a> in the first half of 2024.</p>\n\n\n\n<p>Apple’s <strong>spring surprise</strong> could be the early arrival of the <a href=\"https://www.macworld.com/article/1532945/macbook-air-m3-chip-15-inch-spring-summer-2023.html\">M3 MacBook Air</a>.</p>\n\n\n\n<p>A <strong>new iMac</strong> might <a href=\"https://www.macworld.com/article/1532296/m3-imac-2023-release.html\">finally arrive</a> later this year.</p>\n\n\n\n<h2>Podcast of the week</h2>\n\n\n\n<p>In <strong>Episode 831</strong>: Your hot takes on the yellow iPhone, Clean Energy Charging, and upcoming new Macs.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>You can catch every episode of the Macworld Podcast on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://open.spotify.com/show/3uyZkE4tjbwNNrJCLsBUAM&amp;xcust=1-1-1532375-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Spotify</a>, <a href=\"https://soundcloud.com/macworld\" target=\"_blank\">Soundcloud</a>, the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://podcasts.apple.com/us/podcast/id563933198&amp;xcust=1-1-1532375-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Podcasts app</a>, or <a href=\"https://www.macworld.com/opinion/podcast\">our own site</a>.</p>\n\n\n\n<h2>Software updates, bugs &amp; problems</h2>\n\n\n\n<p>Apple has <a href=\"https://www.macworld.com/article/1533403/apple-releases-fix-for-siri-remote-disconnection-problem.html\">released tvOS 16.3.3</a>, which includes a fix for a long-running <strong>Siri Remote disconnection</strong> problem.</p>\n\n\n\n<p>And with that, we’re done for this week. If you’d like to get regular roundups, sign up for <a href=\"https://www.macworld.com/newsletters/signup\">our newsletters</a>. You can also follow us <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/macworld&amp;xcust=1-1-1532375-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Twitter</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.facebook.com/Macworld/&amp;xcust=1-1-1532375-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">on Facebook</a> for discussion of breaking Apple news stories. See you next Saturday, enjoy the rest of your weekend, and stay Appley.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"1fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7cd80524686946ef89ed15241a2df93074864799d8c8daae2c2178","category":"Apple"}