{"title":"An exploration of teacher and school-based nurse perceptions of current HPV education offered to students 15–16 years old in post-primary schools in Northern Ireland, UK","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311651","date":1728309600000,"content":"<p>by Terri Flood, Dr. Marian McLaughlin, Dr. Iseult Wilson, Ciara M. Hughes</p>\r\nIntroduction <p>Human papillomavirus virus (HPV) is highest among young adults 15–24 years old. High-risk strains are responsible for the development of cancers including cervical, vaginal, vulvar, anal, oropharyngeal and penile. Despite HPV school-based vaccination programmes in the UK, HPV vaccination uptake rates continue to fluctuate due to misinformation and vaccine hesitancy post COVID-19. The aim of this study is to explore perceptions of post-primary school teachers and nurses regarding the current HPV education provision and the need to provide HPV education to students 15–17 years old when they are most likely to be becoming sexually active.</p> Methods <p>A qualitative study was conducted using online semi-structured interviews between February-August 2022 with post-primary teachers and nurses in Northern Ireland, UK. Stratified random sampling was used to contact schools to recruit participants. Recruitment continued until data saturation was reached. Braun &amp; Clarke’s six-phase framework for reflexive thematic analysis was used to analyse the data.</p> Results <p>Twelve teachers and six nurses participated in the study. Four themes arose based on the analysis including 1) the importance of HPV education 2) self-consent to the HPV vaccine 3) design of the HPV education and 4) delivery of the HPV education. Identified barriers to implementation of HPV education included lack of parental education, religion and the conservative culture of Northern Ireland.</p> Discussion <p>Participants perceived HPV education to be poor or non-existent in their schools but placed high importance on this education. They indicated that a non-judgemental health professional would be the ideal person to deliver interactive HPV education as part of a mandated spiral curriculum.</p> Conclusion <p>HPV education at 15–17 years old provides students with an opportunity to learn about their HPV risk, their HPV vaccination status and an opportunity to self-consent to the HPV vaccine. The Education Authority and Department of Health should support health professionals to deliver consistent robust HPV health information to students of this age.</p>","author":"Terri Flood","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7ce71aaf2516b1091e892c15ddf5bdebf84cc35f834f28cd3d02c8aa11772b6e","category":"Interdisciplinary"}