{"title":"Temporal allele frequency changes in large‐effect loci reveal potential fishing impacts on salmon life‐history diversity","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13690?af=R","date":1714028400000,"content":"<h2>Abstract</h2>\n<p>Fishing has the potential to influence the life-history traits of exploited populations. However, our understanding of how fisheries can induce evolutionary genetic changes remains incomplete. The discovery of large-effect loci linked with ecologically important life-history traits, such as age at maturity in Atlantic salmon (<i>Salmo salar</i>), provides an opportunity to study the impacts of temporally varying fishing pressures on these traits. A 93-year archive of fish scales from wild Atlantic salmon catches from the northern Baltic Sea region allowed us to monitor variation in adaptive genetic diversity linked with age at maturity of wild Atlantic salmon populations. The dataset consisted of samples from both commercial and recreational fisheries that target salmon on their spawning migration. Using a genotyping-by-sequencing approach (GT-seq), we discovered strong within-season allele frequency changes at the <i>vgll3</i> locus linked with Atlantic salmon age at maturity: fishing in the early season preferentially targeted the <i>vgll3</i> variant linked with older maturation. We also found within-season temporal variation in catch proportions of different wild Atlantic salmon subpopulations. Therefore, selective pressures of harvesting may vary depending on the seasonal timing of fishing, which has the potential to cause evolutionary changes in key life-history traits and their diversity. This knowledge can be used to guide fisheries management to reduce the effects of fishing practices on salmon life-history diversity. Thus, this study provides a tangible example of using genomic approaches to infer, monitor and help mitigate human impacts on adaptively important genetic variation in nature.</p>","author":"Antti Miettinen, \nAtso Romakkaniemi, \nJohan Dannewitz, \nTapani Pakarinen, \nStefan Palm, \nLo Persson, \nJohan Östergren, \nCraig R. Primmer, \nVictoria L. Pritchard","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"7ce8e34969483408aed026777422ee48b10bb6359008ec3b6b6833817aa9d8d9","category":"Environment"}