{"title":"How to recover deleted text messages on iPhone","link":"https://www.macworld.com/article/234919/how-to-recover-deleted-text-messages-on-iphone.html","date":1626728526000,"content":"\n<div>\n<section><div></div></section><p>Text messages have a reputation for being informal and inconsequential, but you might have really critical information in there! If you deleted some texts to <a href=\"https://www.macworld.com/article/232651/iphone-other-storage-what-is-it-and-how-do-you-delete-it.html\">clear up space on your iPhone</a> and—whoops!—accidentally got rid of one that’s important, all hope is not lost. </p>\n\n\n\n<p>There are three potential avenues for recovering a deleted text message: You can restore your iPhone to a time before the message was deleted, you might be able to contact your phone provider, and you may be able to use a third-party app. Here’s a brief explanation of all three options.</p>\n\n\n\n<h2>Recover deleted texts using an iCloud backup</h2>\n\n\n\n<p>This is probably the simplest and fastest way to restore missing texts. If you have an iCloud backup from <em>before</em> the time when you deleted the text, you <em>should</em> be able to get it back by restoring your phone to that iCloud backup.</p>\n\n\n\n<div><div><figure><a href=\"https://images.idgesg.net/images/article/2020/12/iphone-backup-100869900-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2020/12/iphone-backup-100869900-medium.jpg\" /></a><figcaption><p>Check to see if your last iCloud backup is before you deleted your text message.</p>\n</figcaption></figure></div></div>\n\n\n\n<p>Open <em>Settings</em>, tap on your Apple ID card at the top, select <em>iCloud</em> &gt; <em>Manage Storage</em> &gt; <em>Backups</em>. You’ll see a list of backups for your devices and can tap on the one for your iPhone to see when it was last backed up. </p>\n\n\n\n<p>Now comes the annoying part. You’ll have to <a href=\"https://www.macworld.com/article/3247828/how-to-set-up-a-new-iphone-by-restoring-it-from-an-older-device.html\">reset your iPhone to factory settings and set it up again</a>, choosing to restore from your iCloud backup during the process. Note that you’ll lose all your data from the time <em>after</em> the backup, so I hope those texts really are important!</p>\n\n\n\n<p>To reset your iPhone go to <em>General</em> &gt; <em>Reset</em> &gt; <em>Erase All Content and Settings</em>. Once your iPhone restarts and begins the setup process, choose to restore from an iCloud backup and select the backup from before you erased your text message. </p>\n\n\n\n<h2>Recover deleted texts from an iTunes or Finder backup</h2>\n\n\n\n<p>If you don’t want to rely on automatic iCloud backups, or don’t have enough iCloud storage space for them, you can back up your iPhone to your PC or Mac using iTunes (or Finder in <a href=\"https://www.macworld.com/article/3404520/macos-catalina-everything-you-need-to-know.html\">macOS Catalina</a> or later). Just as with the previous iCloud method, this requires having a backup from before you deleted the message and the resetting your phone, restoring from that backup. You’ll lose everything from after the backup.</p>\n\n\n\n<div><figure><a href=\"https://images.idgesg.net/images/article/2017/09/itunes_backup_iphone_encrypted-100736704-orig.jpg\"><img src=\"https://images.idgesg.net/images/article/2017/09/itunes_backup_iphone_encrypted-100736704-large.jpg\" /></a></figure></div>\n\n\n\n<p>Connect your iPhone to the PC or Mac you’ve backed it up with. On a PC (or a Mac with an older version of macOS), launch iTunes. On a Mac with macOS Catalina or later, open Finder. In iTunes, click on the iPhone icon in the top left-hand corner. On a Mac running macOS Catalina or later, select your device from the left-hand menu bar in Finder.</p>\n\n\n\n<p>Now choose <em>Restore Backup</em>. All the data you previously backed up will now replace the data on your phone. It will take a few minutes. As long as you haven’t backed up since deleting those text messages, they should now appear in the messaging list on your phone.</p>\n\n\n\n<h2>Restore deleted texts by contacting your carrier</h2>\n\n\n\n<p>Your cell provider might keep a record of text messages you send, at least for awhile. If you’ve deleted a text message that is <em>really</em> critical, you might be able to call your carrier to get a copy of it.</p>\n\n\n\n<p>Note that this will only work for SMS text messages (green bubble conversations), not iMessages (blue bubble conversations). Every iMessage is encrypted on your device and not decrypted until it reaches the recipient, so your carrier wouldn’t be able to keep a record of them.</p>\n\n\n\n<p>In order to get a record of texts from your carrier, you will probably need to jump through a bunch of hoops to prove your identity or even get permission from the other party you were texting. And most carriers only keep records of SMS messages for a limited time—you’re not likely to ever be able to recover a message from a year ago.</p>\n\n\n\n<p>But as a last resort, getting a copy of your SMS messages from your carrier <em>is</em> a possibility, and it’s worth calling the customer support number to ask about it.</p>\n\n\n\n<h2>Restore deleted texts using a third-party app</h2>\n\n\n\n<p>There are quite a few third-party software tools that promise to let you restore deleted data on your iPhone, including deleted texts. It’s a bit of a risk—they’re almost never free and there’s no guarantee they’ll even work. But if you’ve exhausted all other options, and it’s <em>really</em> important, it might be worth a shot.</p>\n\n\n\n<p>Some of the software options with a good reputation online are <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.imobie.com/phonerescue/&amp;xcust=1-1-234919-0-0-0&amp;sref=https://www.macworld.com/feed\">PhoneRescue</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://drfone.wondershare.com/iphone-data-recovery.html&amp;xcust=1-1-234919-0-0-0&amp;sref=https://www.macworld.com/feed\">Wondershare Dr. Fone</a>, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.tenorshare.com/products/iphone-data-recovery.html&amp;xcust=1-1-234919-0-0-0&amp;sref=https://www.macworld.com/feed\">Tenorshare UltData</a>. Much of the time, a deleted message on your iPhone is actually still there in the flash storage, waiting to be overwritten by new data. If that’s the case, one of they programs <em>may</em> be able to restore it.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7ce9b4e01961f331f8e5ed470d66f616604a266292311ae7eea36f72efb9ca81","category":"Apple"}