{"title":"Design and characterization of hyperactive mutants of the <i>Agrobacterium tumefaciens</i> telomere resolvase, TelA","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307590","date":1721916000000,"content":"<p>by Shu Hui Huang, Kayla Abrametz, Siobhan L. McGrath, Kerri Kobryn</p>\r\n\r\nTelomere resolvases are a family of DNA cleavage and rejoining enzymes that produce linear DNAs terminated by hairpin telomeres from replicated intermediates in bacteria that possess linear replicons. The telomere resolvase of <i>Agrobacterium tumefaciens</i>, TelA, has been examined at the structural and biochemical level. The N-terminal domain of TelA, while not required for telomere resolution, has been demonstrated to play an autoinhibitory role in telomere resolution, conferring divalent metal responsiveness on the reaction. The N-terminal domain also inhibits the competing reactions of hp telomere fusion and recombination between replicated telomere junctions. Due to the absence of the N-terminal domain from TelA/DNA co-crystal structures we produced an AlphaFold model of a TelA monomer. The AlphaFold model suggested the presence of two inhibitory interfaces; one between the N-terminal domain and the catalytic domain and a second interface between the C-terminal helix and the N-core domain of the protein. We produced mutant TelA’s designed to weaken these putative interfaces to test the validity of the modeled interfaces. While our analysis did not bear out the details of the predicted interfaces the model was, nonetheless, extremely useful in guiding design of mutations that, when combined, demonstrated an additive activation of TelA exceeding 250-fold. For some of these hyperactive mutants stimulation of telomere resolution has also been accompanied by activation of competing reactions. However, we have also characterized hyperactive TelA mutants that retain enough autoinhibition to suppress the competing reactions.","author":"Shu Hui Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7cf3992b46ea4836c9ea428ec0e5919d53dcb46d07e9f749856ba5df17a4ccbd","category":"Interdisciplinary"}