{"title":"Content Shifu ออก Thailand's Martech Report 2024 รวม Insight ด้าน Martech ในไทย","link":"https://www.blognone.com/node/138197","date":1707897704000,"content":"<div><div><div><p>Content Shifu จับมือกับ Hummingbirds Consulting ออก Thailand’s Martech Report 2024 รวบรวม Insight เกี่ยวกับ Martech (Marketing Technology) ของไทยโดยเฉพาะ</p>\n<p>จากผลสำรวจของ Thailand's Martech Report 2024 พบว่าในปัจจุบันองค์กรส่วนใหญ่มีเป้าหมายในการใช้ Martech ด้านยอดขายเป็นหลัก 88% ด้านประสิทธิภาพในการทำงาน 62% การบริหารความสัมพันธ์กับลูกค้า 44% และ ลดต้นทุน/ค่าใช้จ่ายเป็นอันดับสุดท้ายเพียง 33%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a412f6ef057656b6d63709a1d9004b57.jpeg\" /></p>\n<p>ต่างจากปี 2022 ที่จะเน้นไปที่เป้าหมายเพื่อวิเคราะห์ 21% เพื่อเก็บข้อมูล 17% เพื่อเพิ่มประสิทธิภาพการทำการตลาด 14% และเพื่อเพิ่มยอดขาย 14% มาเป็นอันดับหลังแทน ทำให้เห็นว่าในปีที่ผ่านมาพฤติกรรมของผู้ใช้งาน Martech เปลี่ยนไปและนำ Martech เข้าไปใช้ในกระบวนการทางการตลาดและการทำงานมากขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c2b0bdc90821b1a69a15e91ae8991c3c.jpeg\" /></p>\n<p>หมวดหมู่ Martech ที่ผู้คนให้ความสำคัญในปี 2024 มากที่สุด คือ หมวดหมู่ข้อมูล, หมวดหมู่โซเชียลและความสัมพันธ์ และ หมวดหมู่การพาณิชย์และการขาย โดยข้อมูลเป็นหมวดหมู่ที่ผู้คนให้ความสำคัญสูงถึง 95%</p>\n<p>นอกจากนี้งบที่องค์กรจะลงทุนกับ Martech นั้นมีแนวโน้มเพิ่มขึ้นถึงเฉลี่ย 46% ต่องบการตลาดองค์กร เมื่อเทียบกับปี 2023 ที่ลงทุนเฉลี่ยที่ 10-30%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/81baa4b1a15f530a411d58d8f3888fd7.jpeg\" /></p>\n<p>ปิดท้ายด้วย 10 เครื่องมือที่คนนิยมใช้ในแต่ละหมวดหมู่ซึ่งหมวด Interactive Content ผู้คนนิยมใช้ Canva มากที่สุดมีส่วนแบ่ง 58% ในขณะที่หมวด Generative AI ผู้คนนิยมใช้ Chat GPT มากที่สุดส่วนแบ่ง 68%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ac03ba05017c763432bbaa979b3b74e9.jpeg\" /></p>\n<p><a href=\"https://share.hsforms.com/1bq4yNrTrRbmdI369ER2PYQ2cjoh\">ดาวน์โหลดรายงานฉบับเต็มได้ที่นี่</a></p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/content-shifu\">Content Shifu</a></div><div><a href=\"/topics/thailand\">Thailand</a></div><div><a href=\"/topics/marketing\">Marketing</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7d04d768438533bd97562ce9588331ec919b41779a04043d9d1597cf991a13a8","category":"Thai"}