{"title":"Designing Sticky Menus: UX Guidelines","link":"https://smashingmagazine.com/2023/05/sticky-menus-ux-guidelines/","date":1683889200000,"content":"<p>We often rely on <strong>sticky headers</strong> to point user’s attention to critical features or calls to action. Think of sidebar navigation, CTAs, sticky headers and footers, “fixed” rows or columns in tables, and floating buttons. We’ve already looked into mobile navigation patterns in <a href=\"https://smart-interface-design-patterns.com/\">Smart Interface Design Patterns</a>, but sticky menus deserve a closer look.</p>\n<p>As users scroll, a sticky menu always stays in sight. And typically, it’s considered to be a good feature, especially if the menus are frequently used and especially if we want to <a href=\"https://www.smashingmagazine.com/2012/09/sticky-menus-are-quicker-to-navigate/\">speed up navigation</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/1-sticky-menus-sverigesradio-tv-gids.png\" /></p>\n<p>However, sticky menus also come with a few disadvantages. In his recent article on <a href=\"https://adamsilver.io/blog/the-problem-with-sticky-menus-and-what-to-do-instead/\">Sticky Menus Are Problematic, And What To Do Instead</a>, Adam Silver argues about some common usability issues of sticky menus — and how to solve them. Let’s take a closer look.</p>\nWhen Sticky Menus Are Useful\n<p>How do we decide if a menu should be sticky or not? This depends on the <strong>primary job</strong> of a page. If it’s designed to primarily convey information and we don’t expect a lot of navigation, then sticky menus aren’t very helpful.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/2-sticky-bar-france-tv.png\" /></p>\n<p>However, if we expect users to navigate between different views on a page a lot and stay on the page while doing so — as it often is on long landing pages, <strong>product pages, and filters</strong> — then having access to navigation, A-Z or tabs <a href=\"https://www.nngroup.com/articles/sticky-headers/\">can be very helpful</a>.</p>\n<p>Also, when users <strong>compare features in a data table</strong>, sticky headers help them verify that they always look at the right piece of data. That’s where sticky headers or columns can help and aid understanding. That’s why sticky bars are so frequently used <strong>in eCommerce</strong>, and in my experience, they improve the discoverability of content and speed of interaction.</p>\nKeep Sticky Headers Small, But Large Enough To Avoid Rage Taps\n<p>The downside of sticky menus is that they typically make it more difficult for users to explore the page as <strong>they obscure content</strong>. Full-width bars on mobile and desktop are common, but they need to be compact, especially on narrow screens. And they need to accommodate for <a href=\"https://smart-interface-design-patterns.com/articles/accessible-tap-target-sizes/\">accessible tap sizes</a> to prevent rage taps and rage clicks.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/3-sticky-bar-navigation-postal-service.png\" /></p>\n<p>Typically, that means we <strong>can’t have more than five items</strong> in the sticky bar navigation. The choice of the items displayed in the sticky menu should be informed by the most important tasks that users need to perform on the website. If you have more than five items, you probably might need to look into some sort of an overflow menu, as displayed by <a href=\"https://www.samsung.com/us/tvs/neoqled-tv/picture-quality-sound/\">Samsung</a>.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/4-sticky-overflow-menu-samsung.png\" /></p>\n<p>Whenever users have to deal with forms on a page on mobile, consider replacing sticky menus with accordions. Virtual keyboards typically take <strong>up to 60% of the screen</strong>, and with a sticky bar in view, filling in a form quickly becomes nothing short of impossible.</p>\nAccessibility Issues of Sticky Menus\n<p>By their nature, sticky menus always live on top of the content and often <strong>cause accessibility issues</strong>. They break when users zoom in. They often block the content for keyboard users who tab through the content. They obscure links and other focusable elements. And there is often not <strong>enough contrast</strong> between the menu and the content area.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/5-sticky-sub-menu-navigation-accessibility-issues.png\" /></p>\n<p>Whenever we implement a sticky menu, we need to make sure that focusable elements are still visible with a sticky menu in action. And this also goes for internal page anchors that need to account for the sticky bar with the <strong>scroll-padding</strong> property in CSS.</p>\nAvoid Multiple Scrollbars Of Long Sticky Menus\n<p>When sticky menus become lengthy, the last items on the list <strong>become difficult to access</strong>. We could make them visible with some sort of an <strong>overflow</strong> menu, but often they appear as scrollable panes, causing multiple scroll bars.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/6-sticky-sidebar-navigation-australian-bureau-statistics.png\" /></p>\n<p>Not only does this behavior cause <strong>discoverability issues</strong>, but it’s also often a cause for mistakes and repetitive actions on a page. Ideally, we would prevent it by keeping the number of items short, but often it’s not possible or can’t be managed properly.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/7-accordion-menu-smashing-magazine.png\" /></p>\n<p>A way out is to <strong>show the menu as an accordion instead</strong> in situations when the space is limited, especially on mobile devices. That’s what we do at Smashing Magazine in the checkout, with a button that reveals and hides the contents of the cart when needed.</p>\nPartially Persistent Menus\n<p>Because sticky menus often take up too much space, we could <strong>reveal them when needed</strong> and hide them when a user is focused on the content. That’s the idea behind partially persistent headers: as a user starts scrolling down, the menu disappears, but then any scrolling up prompts the menu to appear again.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/8-partially-persistent-menu.png\" /></p>\n<p>The issue with this pattern is that sometimes users just want to jump back to a previous section of the page or double-check some details in a previous paragraph, and the menu often gets in the way. Page Laubheimer from NN/Group recommends using a <strong>slide-in animation</strong> that <a href=\"https://www.nngroup.com/articles/sticky-headers/\">is roughly 300–400ms long</a> and will preserve the natural feel without being distracting.</p>\nAlternatives To Sticky Menus\n<p>In some situations, we might not need a sticky menu after all. We can avoid their downsides with <strong>shorter pages</strong>, or lengthy pages which repeat relevant calls-to-actions or navigation <em>within</em> the page.</p>\n<p><img src=\"https://files.smashing.media/articles/sticky-menus-ux-guidelines/9-tables-of-contents.png\" /></p>\n<p>We could display a <strong>table of contents</strong> on the top of the page and bring the user’s attention to the table of contents with a back-to-top link at the bottom of the page.</p>\nWrapping Up\n<p>Whenever the job of the page is to help users act, save, and compare, or we expect users to rely on navigation a lot, we might consider displaying sticky navigation. They are most harmful when there isn’t enough space anyway, as it often is with forms on mobile devices.</p>\n<p>Sticky menus do come at a cost, as we need to account for usability and accessibility issues, especially for <strong>zooming, keyboard navigation, and anchor jumps</strong>. Add them if you need them, but be careful in plugging them in by default.</p>\n<p>We need to prioritize what matters and remove what doesn’t. And too often, the focus should lie entirely on content and not navigation.</p>\n<p>You can find more details on <strong>navigation UX</strong> in the <a href=\"https://smart-interface-design-patterns.com\"><strong>video library on Smart Interface Design Patterns</strong></a> 🍣 — with a <strong>live UX training</strong> that’s coming up in September this year.</p><p></p>\n<h3>Further Resources</h3>\n<p>Of course, the techniques listed above barely scratch the surface. Here are wonderful articles around sticky headers, from design considerations to technical implementations:</p>\n<ul>\n<li>“<a href=\"https://adamsilver.io/blog/the-problem-with-sticky-menus-and-what-to-do-instead/\">The Problem With Sticky Menus, And What To Do Instead</a>”, by <a href=\"https://www.linkedin.com/in/adambsilver?miniProfileUrn=urn%3Ali%3Afs_miniProfile%3AACoAAAKPgv4BhBlcQZzpi3QD2sssbjghdYhQI1o\">Adam Silver</a>,</li>\n<li>“<a href=\"https://www.nngroup.com/articles/sticky-headers/\">Sticky Headers: 5 Ways To Make Them Better</a>”, by Page Laubheimer,</li>\n<li>“<a href=\"https://uxdesign.cc/porting-long-scroll-content-to-a-small-screen-a-different-approach-to-sticky-in-page-navigation-ca94f15262fe\">A Different Approach To Sticky In-page Navigation</a>”, by Corey Snyder.</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"7d0bb6818945a92cc17290e72048423ee622f377bf833fb1cd74ec4f0f2bea05","category":"Tech"}