{"title":"Optimized treatment parameter by computer simulation for high-intensity focused ultrasound treatment of uterine adenomyosis: Short-term and long-term results","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301193","date":1711634400000,"content":"<p>by Jae Seok Bae, Jae Young Lee, Hyun Hoon Chung, Maria Lee, Myung Jae Jeon, Hoon Kim, Hee Seung Kim, Kidong Kim, Chang-Soon Lee, Keonho Son, Joon Koo Han</p>\r\n\r\nThis study aimed to investigate the efficacy and safety of using optimized parameters obtained by computer simulation for ultrasound-guided high-intensity focused ultrasound (HIFU) treatment of uterine adenomyosis in comparison with conventional parameters. We retrospectively assessed a single-institution, prospective study that was registered at Clinical Research Information Service (CRiS) of Republic of Korea (KCT0003586). Sixty-six female participants (median age: 44 years) with focal uterine adenomyosis were prospectively enrolled. All participants were treated with a HIFU system by using treatment parameters either for treating uterine fibroids (Group A, first 20 participants) or obtained via computer simulation (Group B, later 46 participants). To assess the treatment efficacy of HIFU, qualitative indices, including the clinically effective dysmenorrhea improvement index (DII), were evaluated up to 3 years after treatment, whereas quantitative indices, such as the nonperfused volume ratio and adenomyosis volume shrinkage ratio (AVSR), on MRI were evaluated up to 3 months after treatment. Quantitative/qualitative indices were compared between Groups A and B by using generalized linear mixed effect model. A safety assessment was also performed. Results showed that clinically effective DII was more frequently observed in Group B than in Group A (odds ratio, 3.69; P = 0.025), and AVSR were higher in Group B than in Group A (least-squares means, 21.61; P = 0.001). However, two participants in Group B developed skin burns at the buttock and sciatic nerve pain and required treatment. In conclusion, parameters obtained by computer simulation were more effective than the conventional parameters for treating uterine adenomyosis by using HIFU in terms of clinically effective DII and AVSR. However, care should be taken because of the risk of adverse events.","author":"Jae Seok Bae","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7d0b049d38f2a2b310098c13b45dda9ddf720556c4ea0751ed9d4081723c1eaf","category":"Interdisciplinary"}