{"title":"Global Assessment of Compound Climate Extremes and Exposures of Population, Agriculture, and Forest Lands Under Two Climate Scenarios","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024EF004845?af=R","date":1725283792000,"content":"<h2>Abstract</h2>\n<p>Climate change is expected to increase the global occurrence and intensity of heatwaves, extreme precipitation, and flash droughts. However, it is not well understood how the compound heatwave, extreme precipitation, and flash drought events will likely change, and how global population, agriculture, and forest will likely be exposed to these compound events under future climate change scenarios. This research uses eight CMIP6 climate models to assess the current and future global compound climate extreme events, as well as population, agriculture, and forestry exposures to these events, under two climate scenarios, Shared Socioeconomic Pathways (SSP), SSP1-2.6 and SSP5-8.5 for three time periods: early-, mid-, and late- 21st century. Climate extremes are derived for heatwaves, extreme precipitation, and flash droughts using locational-dependent thresholds. We find that compound heatwaves and flash drought events result in the largest increases in exposure of populations, agriculture, and forest lands, under SSP5-8.5 late-century projections of sequential heatwaves and flash droughts. Late-century projections of sequential heatwaves and flash droughts show hot spots of exposure increases in population exposure greater than 50 million person-events in China, India, and Europe; increases in agriculture land exposures greater than 90 thousand km<sup>2</sup>-events in China, South America, and Oceania; and increase in forest land exposure greater than 120 thousand km<sup>2</sup>-events in Oceania and South America regions when compared to the historical period. The findings from this study can be potentially useful for informing global climate adaptations.</p>","author":"Tayler A. Schillerberg, \nDi Tian","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"7d112b2b15d9ad1e1738bef149566f164e19c208433c3636a2b2e39ffb4b29e1","category":"Environment"}