{"title":"Evaluation of a Commercially Available Serum Competitive ELISA for Detection of Specific Antibodies to Neospora caninum in Raw Milk of Ruminants","link":"https://www.preprints.org/manuscript/202403.0954/v1","date":1710752312000,"content":"Neosporosis is an infection caused by the protozoan parasite Neospora caninum and has substantial veterinary hazards. Neosporosis cannot be controlled via vaccination or a chemotherapeutic agent. Thus, accurate diagnosis followed by isolation and culling of infected animals is regarded as the most efficient way of control. In vivo diagnosis often relies on serologic testing of the animals, and milk represents a non-invasive and easy to collect sample matrix. However, ELISAs specifically designed for the antibody detection in milk are sometimes not easily available and it is tempting to use ELISA kits designed for use in serum also for milk samples. Herein, we evaluated a widely used commercial ELISA (ID Screen® Neospora caninum competition Multispecies ELISA (ID. Vet, Grabels, France)), developed for detection of N. caninum antibodies in serum samples, for its performance with milk samples instead. Milk samples from dairy ruminants (cows, buffaloes, sheep, goats; n = 149) were tested in parallel with the serum ELISA and a commercial milk ELISA as a standard test (Neospora caninum Milk Competitive ELISA, ID. Vet, Grabels, France). The detected prevalence rates were 42 (28.2%), 26 (17.4%), and 26 (17.4%) using milk ELISA, serum ELISA, and both ELISAs, respectively. Sensitivity, specificity, positive predictive value, and negative predictive value for the serum ELISA used with milk samples were 61.9%, 100%, 100%, 87%, respectively: Agreement and Kappa value between the two ELISAs were 89.3%, and 0.70, respectively. High values of Pearson correlation coefficient (0.991) and area under ROC curve (0.789) demonstrated a high diagnostic performance of serum ELISA also in milk samples. Also, Bland-Altman plot and Histogram describing the frequency of distribution of ELISA optical densities confirmed the high agreement of both serum and milk ELISAs. The current results revealed a high specificity but moderate sensitivity of the serum ELISA used for milk samples compared with the milk ELISA. However, the excellent positive predictive value of the serum ELISA makes it an alternative option in case of unavailability of milk ELISA. With this study, we provided additional evidence that a widely used serum ELISA test kit may also be used for detection of N. caninum antibodies in milk samples.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7d13e08e5de7a593f630b973af175c61f81e9cd640e798cbca0045f99236df54","category":"Interdisciplinary"}