{"title":"Effect of GABA combined with ultrasound stress germination treatment on phenolic content and antioxidant activity of highland barley","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13729?af=R","date":1720528886000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study investigated the effects of γ-aminobutyric acid (GABA) combined with ultrasonic stress germination (AUG) treatment on the phenolic content and antioxidant activity of highland barley (HB). Key variables, including germination times (ranging from 0 to 96 h), ultrasonic power (200–500 W), and GABA concentration (5–20 mmol/L), were optimized using response surface methodology (RSM) to enhance the enrichment of phenolic compounds. Furthermore, the study assessed the content, composition, and antioxidant activities of phenolic compounds in HB under various treatment conditions such as germination alone (G), ultrasonic stress germination (UG), and AUG treatment.</p>\n<h2>RESULTS</h2>\n<p>The study identified optimal conditions for the phenolic enrichment of HB, which included a germination time of 60 h, an ultrasound power of 300 W, and a GABA concentration of 15 mmol L<sup>−1</sup>. Under these conditions, the total phenolic content (TPC) in HB was measured at 7.73 milligrams of gallic acid equivalents per gram dry weight (mg GAE/g DW), representing a 34.96% enhancement compared to untreated HB. Notably, all treatment modalities – G, UG, and AUG – significantly increased the phenolic content and antioxidant activity in HB, with the AUG treatment proving to be the most effective.</p>\n<h2>CONCLUSION</h2>\n<p>These obtained results suggest that AUG treatment is a promising processing method for enriching phenolic compounds and improving antioxidant activity in HB. Subsequently, the AUG-treated HB can be used to develop phenolic-rich germinated functional foods to further broaden the application of HB. © 2024 Society of Chemical Industry.</p>","author":"Yanan Liu, \nYingying Wu, \nYuanqiang Jia, \nFeiyue Ren, \nSumei Zhou","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7d159e6142a031cbf1765ddda57113ec495ff1c158bc952762f18cd1c2c8bf74","category":"Environment"}