{"title":"Boeing hit with a lawsuit over alleged “theft” of SLS rocket tools","link":"https://arstechnica.com/?p=1946274","date":1686180492000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/SLS-Mar-18-2022-1841-800x533.jpg\" alt=\"SLS rocket on the launch pad.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/03/SLS-Mar-18-2022-1841.jpg\">Enlarge</a> <span>/</span> The SLS rocket and Orion spacecraft are seen before the Artemis I launch. (credit: Trevor Mahlmann)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A Colorado-based company, Wilson Aerospace, is suing Boeing for what it claims to be \"theft\" of its intellectual property. At issue is a specific tool, known as a Fluid Fitting Torque Device-3, that Wilson developed and Boeing said it needed to attach four main engines to the Space Launch System rocket.</p>\n<p>The lawsuit was filed Tuesday in US District Court in Seattle, where Boeing was originally based. The lawsuit alleges that Boeing reached out to Wilson in March 2014 after learning that the company had created the special torque device, which can precisely install high-torque fittings and nuts in tightly confined spaces.</p>\n<p>The engine section at the bottom of the Space Launch System rocket, where four RS-25 engines are mated to the large core stage with its propellant and oxidizer tanks, is one such tight space. Boeing is the prime contractor for the core stage of the Space Launch System rocket, which launched NASA's uncrewed Artemis I mission around the Moon in November 2022.</p></div><p><a href=\"https://arstechnica.com/?p=1946274#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1946274&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7d1bdf0e7155f300c5a41abef6c986397527456955af44681e46b06d8b4f1e21","category":"Tech"}