{"title":"Intel fixes high-severity CPU bug that causes “very strange behavior”","link":"https://arstechnica.com/?p=1983867","date":1699995478000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/06/cpu-800x534.jpeg\" alt=\"Intel fixes high-severity CPU bug that causes “very strange behavior”\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/06/cpu.jpeg\">Enlarge</a> </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Intel on Tuesday pushed microcode updates to fix a high-severity CPU bug that has the potential to be maliciously exploited against cloud-based hosts.</p>\n<p>The flaw, affecting virtually all modern Intel CPUs, causes them to “enter a glitch state where the normal rules don’t apply,” Tavis Ormandy, one of several security researchers inside Google who discovered the bug, <a href=\"https://lock.cmpxchg8b.com/reptar.html\">reported</a>. Once triggered, the glitch state results in unexpected and potentially serious behavior, most notably system crashes that occur even when untrusted code is executed within a guest account of a virtual machine, which, under most cloud security models, is assumed to be safe from such faults. Escalation of privileges is also a possibility.</p>\n<h2>Very strange behavior</h2>\n<p>The bug, tracked under the common name Reptar and the designation CVE-2023-23583, is related to how affected CPUs manage prefixes, which change the behavior of instructions sent by running software. Intel x64 decoding generally allows redundant prefixes—meaning those that don’t make sense in a given context—to be ignored without consequence. During testing in August, Ormandy noticed that the <code>REX</code> prefix was generating “unexpected results” when running on Intel CPUs that support a newer feature known as fast short repeat move, which was introduced in the Ice Lake architecture to fix microcoding bottlenecks.</p></div><p><a href=\"https://arstechnica.com/?p=1983867#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1983867&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7d2020754fac17f9628770634269ef68f9d0a951fb96308bd5744fca7f29c21c","category":"Tech"}