{"title":"PSX-15 Effect of starch supplementation on rumen bacterial abundance in Bos taurus indicus steers consuming low-quality forage","link":"https://academic.oup.com/jas/article/102/Supplement_3/745/7757821?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Deficient ruminally available nitrogen caused by a basal diet of low-quality forage can limit microbial growth in the rumen and decrease forage utilization. Protein supplementation is well-documented to improve forage digestibility and performance. Additionally, starch has been evaluated to increase energy supply to grazing cattle when the forage cannot support adequate levels of production. However, most research in this area has been conducted in <span>Bos taurus taurus</span>, especially the response of the rumen microbiome to supplementation. Accordingly, the objective of this study was to evaluate the effects of increasing starch supplementation on rumen bacterial populations in <span>Bos taurus indicus</span> steers supplemented protein and consuming low-quality forage. Ruminal samples were collected from five ruminally-cannulated Brahman steers (BW 420 ± 55 kg) used in a 4×4 Latin square fed a basal diet of King Ranch Bluestem Hay (3.5% CP and 73% NDF) provided ad libitum, and one of four isonitrogenous (130 mg N/kg BW) supplements with increasing levels of starch (2% starch= 100% soybean meal; 20% starch= 73% soybean meal, 26.2% corn, 0.8% urea; 38% starch = 47% soybean meal, 51.6% corn, 1.4% urea; 56% starch= 19% soybean meal, 78.6% corn, 2.4% urea). Rumen content samples were collected via rumen cannula at 4h post-feeding. Microbial DNA was extracted; full length 16S rRNA amplicon libraries were prepared using Kinnex kits and then sequenced on the PacBio Revio platform. Reads were analyzed using DADA2 and QIIME2. Statistical analysis was performed with the GLIMMIX procedure of SAS 9.4 (SAS Inst. Inc., Cary, NC). Firmicutes, Bacteroidata, Actinobacteriota, Verrucomicrobiota, and Euryarchaeota were the most abundant phyla in all treatments (83, 10, 3, 0.4, and 1%, respectively), and were not affected by treatment (<span>P</span> ≥ 0.10). Christensenellaceae R-7 group, Rikenellaceae RC9 gut group, Lachnospiraceae-XPB1014-group, Butyrvibrio, Lachnospiraceae-NK3A20-group, and Prevotella represented the most abundant genera for all treatments (7, 5, 11, 9, 7, and 3%, respectively). Lachnospiraceae-XPB1014-group and Lachnospiraceae-NK3A20-group responded quadratically (<span>P</span> ≤ 0.02) to increasing starch with decreased abundance for the 20% and 38% starch supplement. Comparatively, relative abundance of Butyrvibrio responded quadratically (<span>P</span> &lt; 0.01) with increased abundance in the 20% and 38% starch supplement. Pseudobutyrvibrio increased with supplementation of 20% starch and then decreased as starch supplementation increased (quadratic, <span>P</span> = 0.04). In conclusion, supplementation of starch elicited changes in microbial relative abundance at the genus level with the response in Butyrivibrio suggesting greater fibrolytic activity. Forage and total digestible NDF intake in these steers decreased with increased starch supplementation; however, TDOMI was not affected by starch provision.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7d2f49667acb0a2218640260508ea625832e58c8c556ef31e95157c69ea8484a","category":"Environment"}