{"title":"Effect of food insecurity on depression, anxiety, and stress among resettled Syrian refugees in Ontario","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002571","date":1710511200000,"content":"<p>by Safoura Zangiabadi, Baraa Alghalyini, Fatmeh Zoubi, Hala Tamim</p>\r\n\r\nFood insecurity has been linked to adverse health outcomes, particularly among vulnerable populations such as refugees. The aim of this study was to assess the prevalence of food insecurity and its association with depression, anxiety, and stress among resettled Syrian refugee parents in Ontario. This was a cross-sectional study with a total of 540 Syrian refugee parents who resided in Ontario for an average of four years and had at least one child less than 18 years who were interviewed. Information about food insecurity was collected based on the question “During the past year, did you ever eat less because there was not enough food or money for food?”. Levels of depression, anxiety, and stress were assessed using the Depression Anxiety Stress Scales (DASS-21). Multiple linear regression analyses were performed to evaluate the relationship between food insecurity and depression, anxiety, and stress after adjusting for sociodemographic, migration-, and health-related factors. 44.6% of respondents reported experiencing food insecurity. Of participants, 7.6%, 8.9%, and 8.5% reported severe to extremely severe levels of depression, anxiety, and stress, respectively. Results of the multiple linear regression analysis showed that food insecurity was significantly associated with higher levels of depression (Adjβ = 2.00, p = 0.008), anxiety (Adjβ = 1.53, p = 0.013), and stress (Adjβ = 1.87, p = 0.019). Implementation of effective government interventions and frameworks are essential to reduce food insecurity among resettled Syrian refugees to ultimately improve their mental health outcomes and overall well-being.","author":"Safoura Zangiabadi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7d3013f4f62a6e38286dc946bb8d3974de7e5bb1bb43bc3ffd08803a5cf69e9f","category":"Environment"}