{"title":"Improving the efficiency of adaptive management methods in multiple fishways using environmental DNA","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301197","date":1711980000000,"content":"<p>by Masahiko Nakai, Taku Masumoto, Takashi Asaeda, Mizanur Rahman</p>\r\n\r\nDams and weirs impede the continuity of rivers and transit of migratory fish. To overcome this obstacle, fishways are installed worldwide; however, management after installation is important. The Miyanaka Intake Dam has three fish ladders with different flow velocities and discharges and has been under adaptive management since 2012. Fish catch surveys, conducted as an adaptive management strategy, place a heavy burden on fish. Furthermore, a large number of investigators must be mobilized during the 30-day investigation period. Thus, a monitoring method using environmental DNA that exerts no burden on fish and requires only a few surveyors (to obtain water samples) and an in-house analyst was devised; however, its implementation in a fishway away from the point of analysis and with limited flow space and its effective water sampling frequency have not been reported. Therefore, in 2019, we started a trial aiming to evaluate the methods and application conditions of environmental DNA surveys for the continuous and long-term monitoring of various fish fauna upstream and downstream of the Miyanaka Intake Dam. To evaluate the fish fauna, the results of an environmental DNA survey (metabarcoding method) for 2019 to 2022 were compared to those of a catch survey in the fishway from 2012 to 2022. The results confirmed the use of environmental DNA surveys in evaluating the contribution of fishways to biodiversity under certain conditions and introduced a novel method for sample collection.","author":"Masahiko Nakai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7d33f5a8a48dd555962a5fd0d91ba9afb2f3ec894b2cb78c515414857a50ee18","category":"Interdisciplinary"}