{"title":"Drought shortens subtropical understory growing season by advancing leaf senescence","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17304?af=R","date":1715065153000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e3f5071a-00ea-4b6e-ae44-37d88618fdb9/gcb17304-toc-0001-m.png\" alt=\"Drought shortens subtropical understory growing season by advancing leaf senescence\" />\n<p>We utilized a digital camera system in conjunction with a throughfall exclusion experiment to examine the impact of drought on subtropical understory leaf phenology. Our findings revealed a notable advancement in understory leaf senescence phenology, with an insignificant shift observed in leaf development phenology under experimental drought conditions, ultimately leading to a shortened growing season. Furthermore, this study found pre-season air temperature and pre-season soil moisture as the primary drivers for understory leaf development and senescence phenology, respectively. This study emphasizes the importance of considering water availability for a comprehensive understanding of leaf phenology constraints.</p>\n<br />\n<h2>Abstract</h2>\n<p>Subtropical forests, recognized for their intricate vertical canopy stratification, exhibit high resistance to extreme drought. However, the response of leaf phenology to drought in the species-rich understory remains poorly understood. In this study, we constructed a digital camera system, amassing over 360,000 images through a 70% throughfall exclusion experiment, to explore the drought response of understory leaf phenology. The results revealed a significant advancement in understory leaf senescence phenology under drought, with 11.75 and 15.76 days for the start and end of the leaf-falling event, respectively. Pre-season temperature primarily regulated leaf development phenology, whereas soil water dominated the variability in leaf senescence phenology. Under drought conditions, temperature sensitivities for the end of leaf emergence decreased from −13.72 to −11.06 days °C<sup>−1</sup>, with insignificance observed for the start of leaf emergence. Consequently, drought treatment shortened both the length of the growing season (15.69 days) and the peak growth season (9.80 days) for understory plants. Moreover, this study identified diverse responses among intraspecies and interspecies to drought, particularly during the leaf development phase. These findings underscore the pivotal role of water availability in shaping understory phenology patterns, especially in subtropical forests.</p>","author":"Huanfa Sun, \nLiming Yan, \nZhao Li, \nWanying Cheng, \nRuiling Lu, \nXingli Xia, \nJiaye Ping, \nChenyu Bian, \nNing Wei, \nCuihai You, \nSongbo Tang, \nYing Du, \nJing Wang, \nYang Qiao, \nErqian Cui, \nXuhui Zhou, \nJianyang Xia","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"7d34acb53012ee860cd3668abb514887d6bd83edb62aaa7fc03c164bda1d025f","category":"Environment"}