{"title":"Analysis of the Setomimycin Biosynthetic Gene Cluster from Streptomyces nojiriensis JCM3382 and Evaluation of Its α-Glucosidase inhibitory activity using Molecular Docking and Molecular Dynamics Stimulations","link":"https://www.preprints.org/manuscript/202407.1251/v1","date":1721182609000,"content":"The formation of atroposelective biaryl compounds in plants and fungi is well understood; however, the polyketide aglycone synthesis and dimerization in bacteria remain unclear. Thus, the biosynthetic gene cluster (BGC) responsible for antibacterial setomimycin production from Streptomyces nojiriensis JCM3382 was examined in comparison with the BGCs of spectomycin, julichromes, lincolnenins, and huanglongmycin. Setomimycin BGC includes post-PKS assembly/cycling enzymes StmD (C-9 ketoreductase), StmE (aromatase), and StmF (thioesterase) as key components. The heterodimeric TcmI-like cyclases StmH and StmK are proposed to aid in forming the setomimycin monomer. In addition, StmI (P-450) is predicted to catalyze biaryl coupling of two monomeric setomimycin units, with StmM (ferredoxin) specific to setomimycin BGC. The roles of StmL and StmN, part of the nuclear transport factor 2 (NTF-2)-like protein family and unique to setomimycin BGCs, could particularly interest biochemists and combinatorial biologists. α-Glucosidase, a key enzyme in type 2 diabetes, hydrolyzes carbohydrates into glucose, thereby elevating blood glucose levels. This study aimed to assess the α-glucosidase inhibitory activity of EtOAc extracts of JCM 3382 and setomimycin. The JCM 3382 EtOAc extract and setomimycin exhibited greater potency than the standard inhibitor, acarbose, with IC50 values of 285.14 ± 2.04 μg/mL and 231.26 ± 0.41 μM, respectively. Kinetic analysis revealed that setomimycin acts as a competitive inhibitor of α-glucosidase. Molecular docking demonstrated two hydrogen bonds with maltase-glucoamylase chain A residues Thr205 and Lys480 (binding energy = −6.8 kcal·mol⁻¹), two π-π interactions with Trp406 and Phe450, and one π-cation interaction with Asp542. Residue-energy analysis highlighted Trp406 and Phe450 as key in setomimycin's binding to maltase-glucoamylase. These findings suggest that setomimycin is a promising candidate for further enzymological research and potential antidiabetic therapy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7d4121a1e6eed12df58df49096acd673d828d0ca1fe75acdf51a1b53e19ad591","category":"Interdisciplinary"}