{"title":"Effect of salting and dehydration treatments on the physicochemical and gel properties of hen and duck egg yolks, plasma and granules","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13434?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Salted hen egg yolks are less oily and less flavorful than salted duck egg yolks. However, hen eggs have a more adequate market supply and have a broader application prospect than duck eggs. In the present study, egg yolks, plasma, and granules were dehydrated by adding 1% NaCl to simulate traditional curing process of salted egg yolk. The changes in the pickling process of hen egg yolks (HEY) and duck egg yolks (DEY) plasma and granules were compared to reveal the gelation mechanism and the underlying causes of quality differences in salted HEY and DEY. Salted HEY can be compared with the changes in DEY during the pickling process to provide a theoretical basis for the quality improvement of salted HEY to salted DEY.</p>\n<h2>RESULTS</h2>\n<p>The results showed that both plasma and granules were involved in gel formation, but exhibited different aggregation behaviors. Based on the intermolecular forces, the HEY proteins achieved aggregation mainly through hydrophobic interactions and DEY proteins mainly through covalent binding. According to spin–spin relaxation time, HEY gels immobilized a large amount of lipid and interacted strongly with lipids. DEY gels showed much free lipid and had weak interaction with lipid. The microstructure showed that HEY proteins were easily unfolded to form a homogeneous three-dimensional gel network structure after salting, whereas heterogeneous aggregates were formed to hinder the gel development in DEY. Changes in protein secondary structure content showed that pickling can promote the transformation of the <i>α</i>-helices to <i>β</i>-sheets structure in HEY gels, whereas more <i>α</i>-helices structure was formed in DEY gels.</p>\n<h2>CONCLUSION</h2>\n<p>The present study has demonstrated that different gelation behaviors of hen and duck egg yolk proteins (especially in plasma) through salting treatment led to the difference in the quality of salted HEY and DEY. © 2024 Society of Chemical Industry.</p>","author":"Yujie Su, \nYuanyuan Sun, \nCuihua Chang, \nJunhua Li, \nYundan Cai, \nQianwen Zhao, \nZijian Huang, \nWen Xiong, \nLuping Gu, \nYanjun Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7d42a0f3c822a5f8109f51a881825c1b9a4d3cc592125d6056b2e72c86a2e953","category":"Environment"}