{"title":"Spoiling it for the sprinters: How Pfeiffer Georgi won Brugge-De Panne solo","link":"https://www.cyclingtips.com/2023/03/spoiling-it-for-the-sprinters-how-pfeiffer-georgi-won-brugge-de-panne-solo/","date":1679664495000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/GettyImages-1249135487.jpg?width=1200\" alt=\"Spoiling it for the sprinters: How Pfeiffer Georgi won Brugge-De Panne solo\" /></figure><p><span>On Thursday, Pfeiffer Georgi became only the second rider to win the women’s Brugge-De Panne solo. The pan-flat and often windy race usually comes down to a bunch kick with a roll-call of sprinters such as Kirsten Wild, Lorena Wiebes and, last year, Elisa Balsamo on its <em>palmarès</em>.  </span></p>\n<p><span>Going into this year’s race most would have predicted the hotly anticipated re-match of Lorena Wiebes vs her former Team DSM teammate Charlotte Kool after their close run-ins at the UAE Tour Women in February. The show was postponed at Ronde van Drenthe with Kool having to bow out of the race with illness, but De Panne seemed nailed on to deliver some sprinting spectacle.  </span></p>\n<p><span>Wiebes herself expected Kool to be her biggest threat, saying before the race: “This is one of the few real sprinters’ races. Maybe it will be the first real showdown with Charlotte Kool and Elisa Balsamo. I hope to win here because this race was marked on my calendar in advance.”</span></p>\n<p><span>As well as Kool and Wiebes, their nearest competitors, Chiara Consonni of UAE Team ADQ and Balsamo of Trek-Segafredo were on the start list and, as a result, it seemed bizarre that SD Worx sent a team of just four riders to Thursday’s race while Kool and others would be supported by a full complement of lead out women. </span></p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CqJPGc7MpQa/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CqJPGc7MpQa/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Pfeiffer Georgi (@pfeiffergeorgi)</a></p>\n</div>\n</blockquote>\n<p></p>\n<p><span>In the end, the concept of leadouts was a distant memory come the finish. </span></p>\n<p><span>Team DSM, Canyon-SRAM, and Trek-Segafredo forced the pace on the front heading towards the first passage of De Moeren with former junior world champion Megan Jastrab on the front as the group turned onto the long straight, known for its cruel crosswinds. </span></p>\n<p><span>Jastrab’s efforts leading the strung-out bunch onto De Moeren would prove to be one of the decisive moments of the race. The young American kept the pace high forcing a split with teammate Georgi and Uno-X sprinter and former world champion Amalie Dideriksen. </span></p>\n<p><span>Almost immediately echelons began to form as those directly behind the leading three battled to regain contact while others behind got caught out. Sure enough, as the images from the helicopter panned out, the scene was textbook De Moeren, with echelons scattered all over the unforgiving stretch of wide open road. </span></p>\n<p><span>Balsamo, Wiebes, Christina Schweinberger and Julie de Wilde of Fenix-Deceuninck, Alice Barnes of Human Powered Health, Shari Bossuyt and Maike van der Duin of Canyon-SRAM and Dideriksen and the DSM pair rotated through to keep the pace high and the elastic finally snapped – the decisive split of the race formed. </span></p>\n<p><span>Notably absent from the front was Kool, who had narrowly missed the group. Despite losing their sprinter, however, Georgi and Jastrab continued to work in the group to take advantage of their earlier efforts. Indeed, the presence of Lorena Wiebes and Elisa Balsamo in the group did not elicit the lack of cooperation that it otherwise might have from riders who know their chances are doomed if they reach the line with either rider still in their midst. </span></p>\n<p><span>Despite the best efforts of UAE Team ADQ – including a “Hail Mary” attempt at bridging across from their sprinter, Chiara Consonni – the group’s cooperation meant that they stayed away for the rest of the race. </span></p>\n<p><span>Coming towards the finish, though, the small matter of what to do about Wiebes and Balsamo came to the fore. With DSM, Canyon, and Fenix-Deceuninck benefitting from two riders each the onus would be on those teams to attack the lone sprinters and attempt to get away. </span></p>\n<p><span>With just over 10 km to go the Team DSM pair again used the wind on De Moeren to put the rest of the group under pressure. Unfortunately so much so that, while trying to close down a split, Barnes touched wheels with Schweinberger causing herself and De Wilde to crash hard and leaving Schweinberger and Van der Duin in no-woman’s land. </span></p>\n<p><span>Meanwhile, the remaining riders continued to cooperate in the crosswinds although Balsamo and Wiebes were notably marking one another. As the front six reached the end of De Moeren and two sprinters continued to eye each other  Jastrab launched an attack which, while she didn’t get a gap, provided the perfect launchpad for Georgi to counter from.</span></p>\n<p><span>The former British champion, who had been sat at the back of the group, chose to attack around the left-hand side of a traffic island where Jastrab had just pulled across leaving Wiebes, Dideriksen, and Balsamo, on the other side, to try and chase. </span></p>\n<p><span>After some looking around Balsamo took the initiative to try and close Georgi’s rapidly-increasing gap. The former world champion accelerated for a few moments but looked around to see Wiebes on her wheel and flicked her elbow and in that moment of hesitation between the two sprint favorites, Georgi won the race. </span></p>\n<p><span>With Georgi still in sight, Bossuyt tried again but the group was in disarray and neither Wiebes nor Balsamo had either the legs or the inclination to concertedly chase her for long. With each pull came a lull that allowed the British rider’s gap to increase. Dideriksen accelerated from the back but before she had even made it past Balsamo, who was on the front, was shaking her head in defeat. </span></p>\n<p><span>Despite Georgi having gathered a sizeable gap, Wiebes and Balsamo continued to take up the bulk of the effort in the group behind with the hope of still being able to sprint. Coming under the<em> flamme rouge</em>, though, the DSM rider’s gap was almost 40 seconds and the chasers began to slow right down and look at each other, the win already gone. </span></p>\n<p><span>Turning down towards the finishing straight Balsamo sat towards the back, biding her time. In a head-to-head sprint between the two Wiebes would usually come out on top but the European champion went early, leading the sprint and giving Balsamo room to come off her wheel to rush her at the line and claim second.</span></p>\n<blockquote>\n<div> <a href=\"https://www.instagram.com/p/CqI6Mb7IYOr/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <p></p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p></p></a><p></p>\n<p><a href=\"https://www.instagram.com/p/CqI6Mb7IYOr/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Team DSM (@teamdsm_)</a></p>\n</div>\n</blockquote>\n<p></p>\n<p><span>Georgi’s win marked the third WorldTour victory of the season for Team DSM, for whom most of their 2022 success came from Wiebes. Many wondered how the team would weather losing their star sprinter at the end of 2022 – as well as Floortje Mackaij and Liane Lippert –  but with Kool stepping up, and the likes of Georgi and Jastrab showing their versatility they appear to be thriving. </span></p>\n<p><span>“We knew we couldn’t come to the finish with any of them because they are very fast. We just knew we were going to attack,” Georgi said at the finish. “Megan attacked first and set me up, then I just went as hard as I could. My legs were feeling pretty tired at that point, so it was just giving it everything, and the DS shouting in my ear really helped, just put the head down and go to the line.”</span></p>\n<p><span>Despite not being able to defend her 2022 victory, Balsamo was complimentary of the DSM duo’s efforts. </span></p>\n<p><span>“When you’re alone in a small group and you have to control two riders, it’s never an easy situation to handle. Jastrab was to first to attack and we managed to close the gap, but when Georgi went, I can’t hide that I did not have enough energy to follow. Of course I always race for the victory, but looking how the race went, I’m satisfied both for the result and the performance. I think Georgi and Jastrab from DSM played their numerical superiority in the best way and they rode strongly,” she said.  </span></p>\n<p><span>“I really did my best today, in a tough race, and I really enjoyed it. We expected a hard race, with wind and echelons. That’s what I like about Belgian races and that’s why I liked racing today. We all knew that if someone was able to make an attack and immediately make a gap of 100 meters, it would have been the right move. That’s what Georgi did. I worked together with Wiebes to reduce the gap, but we knew it was hard.”</span></p>\n<p>Thursday’s race was a big win for Team DSM and a confidence boost for Balsamo when it comes to sprinting against Wiebes. However it was hardly a huge loss for the Dutch rider and Team SD Worx. The team was on a five-race winning streak just a few weeks ago and will bring in the cavalry for the bigger cobbled Classics in a few weeks’ time. Their competition, though, is looking stronger than ever.</p>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7d431854be864f3abf606041987852dffbff9c7f16a2c70e50d42331bfb8d322","category":"Cycling"}