{"title":"Formulation of hesperidin‐loaded in situ gel for ocular drug delivery: a comprehensive study","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13407?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Allergic conjunctivitis is one of the most common eye disorders. Different drugs are used for its treatment. Hesperidin is an active substance isolated from <i>Citrus sinensis</i> L. (Rutaceae) fruit peels, with known anti-inflammatory activity but low solubility. It was complexed with cyclodextrin and encapsulated <i>in situ</i> gel to extend its duration in the eye.</p>\n<h2>RESULTS</h2>\n<p>The optimized formulation comprised 1% hesperidin, 1.5% hydroxyethyl cellulose, and 16% poloxamer 407. The viscosity at 25 °C was 492 ± 82 cP, and at 35 °C it was 8875 ± 248 cP, the pH was 7.01 ± 0.03, gelation temperature was 34 ± 1.3 °C, and gelation time was 33 ± 1.2 s. There was a 66% <i>in vitro</i> release in the initial 2 h, with a burst effect. A lipoxygenase (LOX) inhibition test determined that hesperidin was active at high doses on leukotyrens seen in the body in allergic diseases. In cell-culture studies, the hesperidin cyclodextrin complex loaded <i>in situ</i> gel, BRN9-CD (poloxamer 16%, hydroxy ethyl cellulose (HEC) 1.5%), enhanced cell viability in comparison with the hesperidin solution. It was determined that BRN9-CD did not cause any irritation in the ocular tissues in the Draize test.</p>\n<h2>CONCLUSION</h2>\n<p>The findings of this study demonstrate the potential of the <i>in situ</i> gel formulation of hesperidin in terms of ease of application and residence time on the ocular surface. Due to its notable LOX inhibition activity and positive outcomes in the <i>in vivo</i> Draize test, it appears promising for incorporation into pharmaceutical formulations. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Sefa Gözcü, \nHeybet Kerem Polat, \nYakup Gültekin, \nSedat Ünal, \nNasıf Fatih Karakuyu, \nEsra Köngül Şafak, \nOsman Doğan, \nEsra Pezik, \nMuhammet Kerim Haydar, \nEren Aytekin, \nNihat Kurt, \nBurak Batuhan Laçin","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7d499c642f724ec938e880ebf51575573f7de92c0c519d8192b003a0a99d674b","category":"Environment"}