{"title":"Effect of Directional Partial Ordering in L12 CSRO Domains on Dislocations Behavior in FCC Multicomponent Alloys via 4D-STEM Diffuse-Scattering Fluctuation and Correlation Analysis","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.649/7719699?rss=1","date":1721779200000,"content":"<span>Multicomponent alloys, such as medium and high entropy alloys (M/HEA), have attracted considerable attention from researchers in recent decades owing to their exceptional mechanical properties [<a href=\"#ozae044.649-B1\">1</a>,<a href=\"#ozae044.649-B2\">2</a>]. While they are initially considered as random solid solutions, recent studies have suggested that their properties can be further tuned by inducing nanoscale local ordering, such as chemical short-range ordering (CSRO) [<a href=\"#ozae044.649-B3\">3</a>,<a href=\"#ozae044.649-B4\">4</a>]. However, the influence of CSRO on the mechanical behavior of M/HEA is still being debated [<a href=\"#ozae044.649-B5\">5</a>]. Here, we identify three major sources of this ambiguity. First, the characterization of CSRO is challenging in M/HEAs because of their complex chemical compositions and similar atomic scattering cross-sections, which hinder the detection and analysis of the structure or presence of CSRO in some alloys [<a href=\"#ozae044.649-B6\">6</a>,<a href=\"#ozae044.649-B7\">7</a>]. Second, the contribution of CSRO to mechanical properties can be overshadowed by the presence of other nanoscale defects in the materials. Third, the commonly adopted assumption that the interaction mechanism between CSRO and dislocations is analogous to that between nanoscale long-range ordering (LRO) precipitates and dislocations may not hold due to the imperfect ordering in CSRO domains.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"7d611ef8438e44837595a40a16453f76073868cfd2ed48a2b7aaf76c04093eae","category":"Environment"}