{"title":"Health risk and germ cell toxicity of five commercially available sachet waters in Nigeria: a public health concern","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae101/7702351?rss=1","date":1719878400000,"content":"<span><div>Abstract</div><div>Background</div>Sachet water is the most common form of portable water commercially available in Nigeria.<div>Methodology</div>Using the murine sperm count and sperm abnormality assay, the germ cell toxicity of five common commercially available sachet waters in Nigeria was assessed in this study. The levels of hormones such as Follicle Stimulating Hormone (FSH), Luteinizing Hormone (LH) and Total Testosterone (TT); and activities of catalase (CAT), alanine aminotransferase (ALT), superoxide dismutase (SOD), aspartate aminotransferase (AST), and alkaline phosphatase (ALP) were evaluated. The heavy metal and physicochemical parameters of the sachet waters were also analyzed. Healthy male mice were allowed to freely drink the sachet waters for 35 days after which they were sacrificed.<div>Results</div>The findings indicated that the concentrations of some heavy metals (As, Cr, and Cd) in the sachet waters exceeded the limit by regulatory organizations. The data of the total carcinogenic risk (TCR) and total non-carcinogenic risk (THQ) of some heavy metals associated with the ingestion of sachet water for adults and children showed that the values exceeded the acceptable threshold, and thus, is indicative of a high non-carcinogenic and carcinogenic risks. The data of the sperm abnormality assay showed that in the exposed mice, the five sachet waters induced a statistically significant (<span>P</span> &lt; 0.05) increase in abnormal sperm cells and a significantly lower mean sperm count. Additionally noted were changes in the serum activities of TT, FSH, ALP, AST, ALT, and LH.<div>Conclusion</div>Thus, the sachet waters studied contained agents that can induce reproductive toxicity in exposed humans. This is of public health importance and calls for immediate action by regulatory bodies.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"7d63d1c2f90539be495ac4b69a94014026a3be40d2c2ef47031cb748aba8723d","category":"Environment"}