{"title":"Mechanisms of the effect of fertility policies on the labor-capital income gap","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301347","date":1714140000000,"content":"<p>by Wei Cui, An-Wei Wan, Yuan Zheng</p>\r\n\r\nThis paper investigates the impact mechanism by which an incentive-based fertility policy may reduce the labor income share. First, the specific paths through which this impact mechanism is realized are analyzed using the production function. It is found that an incentive-based fertility policy triggers high savings, which implies more, cheaper, and more readily available capital to be invested in production. A distribution system that earns income based on factor contributions results in more gains for capital than labor, i.e., a lower share of labor income and a wider income gap between labor and capital. Second, the impact mechanism includes three theoretical hypotheses. They are that an encouraging fertility policy is negatively related to labor income share; this relationship is valid provided that the study subject is in a closed economy; and that capital intensification is a mediator variable of fertility policy affecting labor income share. Finally, to further corroborate the impact mechanism in this paper, a Hansen threshold panel model is applied to verify that the effect of fertility policy on labor income share has a threshold effect. This indicates that the effect of the former on the latter changes significantly before and after the change in fertility policy, confirming the existence of an impact mechanism. The established literature has paid little attention to the impact of incentivised fertility policies on the labour income gap. Using capital intensification as the mediating variable, this paper demonstrates the existence of the former effect on the latter. In view of this, under the encouraged fertility policy, this paper proposes specific measures to enhance the labor income share in order to narrow the income gap between labor and capital.","author":"Wei Cui","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7d65c4b945adf1936cb988ae91e391d72386d18a7d03d688d515f663224355e5","category":"Interdisciplinary"}