{"title":"Using Communicative Analysis to Evaluate Engagement in a Community-Based, Expert-Led Public-Health Intervention","link":"https://www.preprints.org/manuscript/202403.1850/v1","date":1711714684000,"content":"The focus of this article is the evaluation of the quality and the degree of community engagement in an expert-based, public-health communicative intervention for Alcohol Use Disorder (AUD). In 2023 the Canadian Alcohol Use Disorder Society collaborated with a grass-roots community health group, a regional health authority, and an academic participatory researcher to organize a working group to mount a social-marketing campaign to increase community support for AUD medical treatment in family-practice settings in a rural community in British Columbia. The partnership working group conducted a series of activities in the school system, the town council, and the community. This article covers the formative evaluation and the summative evaluation of the working group's effectiveness. The formative evaluation (\"lessons learned\" and \"recommendations\") consists of consensus evaluations of the quality of each activity using a variety of data sources. The formative evaluation followed improvement science methods and used consensus meetings to provide and reflect on formal and informal feedback. Formative results reflect the consensus of the participants in the working group and they record the reactions in the community. The summative evaluation measures evidence of community engagement found in transcribed text from meeting minutes. The summative evaluation used theory-based frameworks and text data visualization to assess the engagement dynamics of the working group. The summative evaluation helps to put the formative evaluation into perspective as communicative action. The summative evaluation validates the formative evaluation by revealing the communicative dynamics of engagement which resulted in the community’s increased capacity to understand and support Alcohol Use Disorder Treatment options. The working group and the entire intervention was seen by the participants and the public as a success and capable of replication. In a small community, it instilled new understandings and attitudes, bringing an emerging awareness of medication as an optional health mitigation strategy for Alcohol Use Disorder. Our study furthers this overall assessment by using theoretical constructs and analysis of communicative records to trace engagement characteristics of interest to researchers, societies, and community groups contemplating similar interventions in the future. The study also validates the effectiveness of communicative analysis as a measure of social-marketing for expert-based public  health interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7d6cebfe648cbcfca6e10303eaeccf10b5e3f1201ab3e22eb3e2ff2a73077314","category":"Interdisciplinary"}