{"title":"PSIII-3 Evaluation of remote detection of heart rate, respiratory rate, and body temperature for improved detection of bovine respiratory disease in high-risk receiving calves","link":"https://academic.oup.com/jas/article/102/Supplement_2/262/7664919?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate the effectiveness of the VetGuardian remote monitor to create data-driven detection of bovine respiratory disease (BRD) by identifying vital sign abnormalities for early disease detection. Male calves (n = 20, initial body weight = 213 ± 3 kg) were purchased from regional auction markets and shipped to the University of Arkansas Stocker Receiving Unit. Upon arrival, calves were weighed, branded, received an identification tag, vaccinated, dewormed, and bulls were castrated. On d 1, the remote sensor was used to monitor all calves while restrained in the chute system detecting their body temperatures, and heart and respiratory rates. The remote sensor was placed in 1 of 2 locations for recordings: 1) in front of chute to capture the head, or 2) on the side of chute capturing the torso. Each calf was assigned to a scan location (10 calves/scan location). For all calves, rectal temperatures were also recorded manually, and heart and respiratory rates were determined by thoracic auscultation. Before processing and for the following 28 d, cattle were observed daily for clinical BRD. If presenting symptoms of BRD and if rectal temperature was ≥ 40°C, cattle were deemed morbid and treated with an antibiotic according to a standard preplanned protocol. For any cattle that were examined for BRD the remote sensor was again used for a minimum of 5 min to compare with manual recordings. Statistical analyses were performed using the CORR, MIXED, and MEANS procedures of SAS 9.4 with sex as a random effect and individual calf specified as the subject. There was a positive correlation between manual recordings of rectal temperatures and remote recordings from the head (0.67; <span>P</span> = 0.04) and the side (0.88; <span>P</span> = 0.0008). Remote recordings did not correlate (<span>P</span> ≥ 0.21) with manual recordings for heart rates. However, there was a positive correlation (0.79; <span>P</span> = 0.01) between manual respiratory rates and the side scans, but no relationship (<span>P</span> = 0.16) between manually collected respiratory rates with head scans. LSMeans for temperature data collected manually or by the remote sensor at either location did not differ (<span>P</span> ≥ 0.34). LSMeans for heart rate differed between manual and remote measurements from either location (<span>P</span> ≤ 0.0008). Manual measurements for respiratory rate did not differ <span>(P</span> = 0.26) from remote recordings from the side; however, differed (<span>P</span> &lt; 0.0001) from recordings from the head. In conclusion, the VetGuardian remote sensor varied from manual recordings for heart rates, regardless of sensor location. Scan location had an influence on accuracy of respiratory rate recordings, and body temperature recordings from either location did not differ from manual measurements. Preliminary data should be used for further investigation of this remote sensor.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7d8250832ed195349dfd8ac19755bda5c826cb375bc312ba1103c3c7e79257c0","category":"Environment"}