{"title":"Six ways Apple is planning to radically transform the MacBook Pro","link":"https://www.macworld.com/article/354107/macbook-pro-sizes-m1x-display-camera-ports.html","date":1630757100000,"content":"<div>\n<section><div></div></section><p>Numerous reports—some from very reliable sources—say that Apple will <a href=\"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-price-release.html\">introduce a new MacBook Pro</a> in just a few short weeks. This isn’t any ordinary speed bump release, however. The new MacBook Pro promises to put Apple’s flagship laptop in a new light and set the momentum for future releases. Let’s take a look at what we could see in the next MacBook Pro and how these new features will transform the laptop from what we’re familiar with into something completely new.</p>\n\n\n\n<h2>New MacBook Pro: Apple silicon</h2>\n\n\n\n<p>Apple’s M1 System on a Chip (SoC) took the industry by storm when it was revealed last November in the <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a>, <a href=\"https://www.macworld.com/article/234819/macbook-air-m1-review-an-absolutely-stunning-debut-for-apple-silicon-in-a-mac.html\">MacBook Air</a>, and <a href=\"https://www.macworld.com/article/234842/m1-mac-mini-review-the-mac-with-the-best-ever-bang-for-your-buck.html\">Mac mini</a>. Its performance blew past expectations (and Intel CPUs) and extended battery life so much that it boggled the mind. </p>\n\n\n\n<p>Now that initial impressions of Apple silicon are out of the way, it’s time for the company to show what else is in store. And the idea that the next Apple SoC could be significantly faster than the <a href=\"https://www.macworld.com/article/234823/apple-m1-chip-specs-performance-features-power-efficiency.html\">M1</a> makes this the most exciting thing that will happen with the new MacBook Pro.</p>\n\n\n\n<p>Various reports state that the SoC in the new MacBook Pro will be called the M1X, and it could have a 10-core CPU, with eight performance cores and two efficiency cores. That’s double the number of performance cores of the M1. Also, the M1X could support a maximum of 64GB of RAM—the M1’s max is 16GB.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/m1-hero-apple.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The M1 had a successful debut, but now it’s time to see how much further along Apple can take its own silicon.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>On top of the CPU boost, graphic performance will jump ahead, too. The M1X could be available in 16 or 32 graphics core options, a big jump from the seven or eight graphics cores in the M1. Apple’s SoC uses a Neural Engine for AI and machine learning tasks, and that will likey get a big boost too. The M1 has a 16-core Neural Engine, but we haven’t heard as to how those improvements will be implemented.</p>\n\n\n\n<p>Add it all up, and what you get is performance that transforms the new MacBook Pro from a solid, high-end laptop to one that’s more worthy of the “Pro” moniker. In comparisons of the M1 to Intel CPUs available last November, we saw performance improvements of over 80 percent in some tests, with many other tests in the 50 to 70 percent improvement range. We can’t imagine what the jump in M1X performance will be over the Intel CPU in the 16-inch MacBook Pro, but we know it’ll be impressive.</p>\n\n\n\n<h2>New MacBook Pro: Sizes</h2>\n\n\n\n<p>Apple introduced the <a href=\"https://www.macworld.com/article/178944/mbpromain.html\">first MacBook Pro in 2006</a> as a replacement for the PowerBook. The first release was a 15-inch model, then came <a href=\"https://www.macworld.com/article/180036/17mbpro.html\">a huge 17-inch model</a> a few months later, and finally the <a href=\"https://www.macworld.com/article/198667/13inch-macbookpro.html\">13-inch MacBook Pro in 2009</a>. In 2012, Apple introduced <a href=\"https://www.macworld.com/article/1167286/macbook_pro_with_retina_display_redefines_the_concept_of_a_pro_laptop.html\">the Retina display in the laptop</a> and focused the lineup on 13- and 15-inch models. Retina’s ability to create higher screen resolutions negated the need for a 17-inch laptop and it’s been that way since.</p>\n\n\n\n<p>After all these years, the MacBook Pro is undergoing a change in its sizes—and the change actually started nearly two years ago with the <a href=\"https://www.macworld.com/article/233574/16-inch-macbook-pro-2019-review.html\">introduction of the 16-inch MacBook Pro</a>, which replaced the 15-inch model. To accompany the 16-inch laptop, Apple is also rumored to reveal a 14-inch MacBook Pro this fall. </p>\n\n\n\n<p>The 16-inch MacBook Pro isn’t that much bigger than the 15-inch model it replaced. That’s because Apple reduced the bezels around the screen, resulting in a larger amount of usable display. We’ll see a similar treatment in the new 14-inch MacBook Pro: It could be a smidge bigger physically than the 13-inch, but its bezels will be much thinner. Essentially, with the new MacBook Pro, you get a bigger screen without an obviously bigger overall size.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/16-inch-macbook-pro-2019.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 16-inch MacBook Pro actually made its debut two years ago. But the new one will use Apple silicon instead of Intel CPUs and AMD GPUs. </p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Now, the sizes of the MacBook Pro may not seem like a big deal. As we’ve seen in past iterations of the laptop, performance can influence the size of the laptop you decide upon. With Intel MacBook Pros, the larger the laptop, the higher the performance, and many users would rather have the smaller form factor without the speed sacrifice. </p>\n\n\n\n<p>Reports have said that the new 14- and 16-inch MacBook Pro will both have the M1X SoC, and that the performance will be the same between the two sizes. If that’s the case, picking a MacBook Pro becomes a lot easier, since you don’t need to worry about any performance sacrifices. Like the iPhone 12 mini and the iPhone 12, you’ll be basing your decision on screen size, not performance.</p>\n\n\n\n<p>The 13-inch design may not entirely go away, however. Apple currently offers four standard configurations of the 13-inch MacBook Pro, two with Apple’s M1 System on a Chip, and two with Intel processors.  Apple could keep the M1 models and possibly reduce the price, while replacing the Intel models with the new 14-inch MacBook Pro that feature the next generation of Apple silicon.</p>\n\n\n\n<h2>New MacBook Pro: Mini-LED display</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/235002/ipad-pro-mini-led-display.html\">Mini LED</a> is a display technology that made its Apple debut in the <a href=\"https://www.macworld.com/article/343706/ipad-pro-2021-faq-price-specs-features-release-date.html\">2021 iPad Pro</a> and we could see it make its way to the new MacBook Pros. The specs for a mini LED MacBook Pro display will likely be very similar to what’s on the iPad Pro: 1,000 nits of brightness (up from 500 nits on the current model), 1,000,000 to 1 contrast ratio, and support for the P3 wide color gamut. And with Mini LED’s backlighting, you’ll see less light bleed and a better dynamic range of color.</p>\n\n\n\n<p>MacBook Pro displays have always been very good, but lately, it feels like Apple has stalled with its laptop display advancements. The implementation of Mini LED is another feature that helps the MacBook Pro feel like it’s a cutting-edge product. Pros whose work involves fine detail will appreciate the improvement. But even regular users will appreciate the boost in brightness and clarity, which should be a tremendous improvement over the prior generation.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ipad-pro-2021-m1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 12.9-inch iPad Pro was Apple’s first product with a Mini LED display.</p></figcaption></figure><p>Dominik Tomaszewski/IDG</p></div>\n\n\n\n<h2>New MacBook Pro: 1080p FaceTime HD camera</h2>\n\n\n\n<p>The 720p FaceTime camera that is currently in the MacBook Pro is an embarrassment. It produces subpar image quality, and you and your colleagues are reminded of that every time you participate in an online meeting or FaceTime call. How can a pro laptop have such a crappy camera?</p>\n\n\n\n<p>If the rumors are true, Apple will outfit the new MacBook Pro with the superior 1080p FaceTime HD camera that is used in the <a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\">24-inch iMac</a>. It’s better at handling poor lighting conditions and produces far better image quality. It’s a really good camera, and it needs to be in the next MacBook Pro to transform the online experience to one that you can enjoy. </p>\n\n\n\n<p>Unfortunately, it doesn’t look like Face ID will be making an appearance just yet, but we’ll take what we can get</p>\n\n\n\n<h2>N<strong>ew MacBook Pro: The return of ports</strong></h2>\n\n\n\n<p>For a large number of people, their laptop is the primary (and often only) computer. So it helps if that laptop provides what’s needed not just processing-wise, but with ports, too. Currently, the 13-inch MacBook Pro has two Thunderbolt 3/USB-C ports, and the 16-inch model has four. That’s not enough. If you’re charging while using the laptop, that’s one port occupied. Connect an external display, and you’ve already filled up the ports on a 13-inch MacBook Pro. What if you need to connect a third display, or an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT208544&amp;xcust=1-1-354107-1-0-0&amp;sref=https://www.macworld.com/feed\">external GPU</a> box, or a mixer, or an external drive array, or a video capture device, or a microphone, or an SD card reader…you get the idea. You run out of ports quickly.</p>\n\n\n\n<p>The MacBook Pro is often used for production work, so the number of available ports is important to connect the gear needed to get stuff done. Sure, you can invest in a Thunderbolt hub, but you have enough to carry already. The MacBook Pro needs more ports.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/13-inch-macbook-pro-ports.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>How is it that a pro laptop like the 13-inch MacBook Pro has only two ports?</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>And it sounds like that could happen with the new 14- and 16-inch MacBook Pro. Various reports have stated that Apple is going to include more Thunderbolt ports, likely four like the 16-inch MacBook Pro. (I’d love to see four on the 14-inch MacBook Pro and six on the 16-inch model.) It’s also possible that Apple will add an HDMI port and reinstate the SD Card reader (which was in the MacBook Pro from 2009 to 2016). That would be huge for pro users.</p>\n\n\n\n<p>There’s also a rumor that Apple will equip the MacBook Pro with a magnetic power adapter connector similar to the old MagSafe cable. I can remember numerous times I’ve tripped over my current MacBook Pro power cord and sent the laptop plunging to the floor. It’s a miracle my laptop still works. A power connector like the first iteration of MagSafe in MacBooks from 2006 to 2016 would be a great addition and a lifesaver for the laptop. </p>\n\n\n\n<h2><strong>New MacBook Pro: The end of the Touch Bar</strong></h2>\n\n\n\n<p>One of the early rumors about the new MacBook Pro is that the Touch Bar could be replaced by traditional Function keys. I’ve written about <a href=\"https://www.macworld.com/article/351326/macbook-pro-ditch-touch-bar-rumors-function-keys.html\">my dislike for the Touch Bar</a> and I’ve heard from plenty of Macworld readers about how <a href=\"https://www.macworld.com/article/352235/macworld-podcast-macworld-is-so-wrong-about-safari-and-the-touch-bar.html\">wrong I am</a>.  It’s a very polarizing feature and removing it would be just divisive. </p>\n\n\n\n<p>So despite my dislike for the Touch Bar and hope for it to go away, I actually don’t think it will. Apple sees it as a pro-level feature and they don’t believe it to be problematic—at least not anymore after they modified it to bring back the Escape key. It’s a feature that provides even more separation from the MacBook Air, which Apple promotes as its consumer-level laptop.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/touch-id-button-magic-keyboard.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Touch ID button on the new MacBook Pro will probably look like the one on the Magic Keyboard.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Whether the Touch Bar stays or goes, you can count on the MacBook Pro having Touch ID. It’s possible Apple will update the Touch ID button with new sensors and it will look more like the Touch ID button on the external Magic Keyboard. There are also rumors that it could have a glowing ring. If we can’t have Face ID yet, we’ll be quite happy with an improved Touch ID button—it’s such a convenient alternative to looking up and typing in passwords.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7d832b09a150b5b11aa0ae9229e31f1c008c5c632f589022f22a95d86c79140e","category":"Apple"}