{"title":"Katie Compton banned four years for anti-doping rule violation","link":"https://cyclingtips.com/2021/08/katie-compton-banned-four-years-for-anti-doping-rule-violation/","date":1628710368000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/kcompton1-650x433.jpg\" /></div><h2>Katie Compton banned four years for anti-doping rule violation</h2><p>\n</p><p>Katie Compton, who won 15 straight US national cyclocross titles between 2004 and 2018, has received a four-year suspension for an anti-doping rule violation.</p>\n\n\n\n<p>According to a statement from USADA, Compton “tested positive for an anabolic agent as the result of an out-of-competition drug test on September 16, 2020.” The control was done using Carbon Isotope Ratio testing, which is designed to tell the difference between banned anabolic agents and the anabolic androgenic steroids that are naturally produced by the body.</p>\n\n\n\n<p>Compton’s ban officially began on September 16 of last year, the date of her positive test, and results obtained since then have been vacated.</p>\n\n\n\n<p>In a statement, Compton denied having taken banned substances.</p>\n\n\n\n<p>“I provided a sample for USADA in September 2020 that came back negative for any banned substances, it was not even atypical,” she wrote. “That news was communicated to me in the same way it has always been via a letter from USADA. I’ve received that same letter after every test I’ve submitted for the last 19 years. In early February of 2021, after returning from a difficult race season, I learned that the same sample from September was re-analyzed due to a bio-passport irregularity and found to be positive for an exogenous anabolic steroid. This was devastating news to me as I have never intentionally or knowingly put anything like that into my body. I know how delicate women’s hormones are, and I would never choose to take anything to jeopardize my health and, as a result, suffer irreparable damage to my endocrine system. And not only that, I never took anything for ethical and moral reasons; I’ve been a strong proponent of clean sport my entire career and feel doing anything to enhance one’s own natural ability is cheating, full stop.</p>\n\n\n\n<p>“Despite deciding to retire in March, I also felt the need to try and defend myself and my reputation. I hired a lawyer and did my best to investigate how the substance got into my system but was unsuccessful in finding that answer. Over the past six months, I learned that I cannot prove that I didn’t intentionally take anything, and I can’t afford to keep fighting knowing the outcome will be the same regardless. Unfortunately, seeing that it was five months between the sample collection and the notification, trying to figure what allegedly got into my body proved to be impossible, and I have decided to stop fighting an expensive and difficult battle and accept the sanction.”</p>\n\n\n\n<p><em>This is a developing story. Check back for more.</em></p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/katie-compton-banned-four-years-for-anti-doping-rule-violation/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7d8938be259ff408d9afe918090a6465bb2a346078fcdc0bcda34a58e245dc89","category":"Cycling"}