{"title":"Microsoft accounts can go passwordless, making “password123” a thing of the past","link":"https://arstechnica.com/?p=1795400","date":1631718398000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/microsoft-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/microsoft.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Microsoft has been working to make passwordless sign-in for Windows and Microsoft accounts a reality <a href=\"https://arstechnica.com/gadgets/2018/09/microsoft-offers-completely-passwordless-authentication-for-online-apps/\">for years now</a>, and today those efforts come to fruition: <a href=\"https://www.theverge.com/2021/9/15/22675175/microsoft-account-passwordless-no-password-security-feature\">The Verge reports</a> that starting today, users can completely remove their passwords from their Microsoft accounts and opt to rely on Microsoft Authenticator or some other form of verification to sign in on new devices. Microsoft added passwordless login support for work and school accounts <a href=\"https://techcommunity.microsoft.com/t5/azure-active-directory-identity/passwordless-authentication-is-now-generally-available/ba-p/1994700\">back in March</a>, but this is the first time the feature has been offered for regular, old individual Microsoft accounts.</p>\n<p>Passwordless accounts improve security by taking passwords out of the equation entirely, making it impossible to get any kind of access to your full account information without access to whatever you use to verify your identity for two-factor authentication. Even if you protect your Microsoft account with two-factor authentication, an attacker who knows your Microsoft account password could still try that password on other sites to see if you've reused it anywhere. And some forms of two-factor authentication, particularly SMS-based 2FA, <a href=\"https://arstechnica.com/information-technology/2018/08/password-breach-teaches-reddit-that-yes-phone-based-2fa-is-that-bad/\">have security problems of their own</a>.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/Screen-Shot-2021-09-15-at-9.55.32-AM.png\" /><p>The warning message you'll see when you turn on the passwordless account feature. (credit: Andrew Cunningham)</p></div>\n<p>Microsoft has offered passwordless authentication for Windows 10 and Microsoft accounts <a href=\"https://arstechnica.com/gadgets/2019/01/latest-windows-10-build-makes-setup-quieter-passwords-optional/\">for a while now</a>, and if you're already taking advantage of those features, nothing about how you sign in to your devices has to change. You just need to visit the <a href=\"https://account.microsoft.com/\">Microsoft Account site</a>, go to the Security tab, select \"Advanced security options,\" and turn on the passwordless account feature to remove your password entirely.</p></div><p><a href=\"https://arstechnica.com/?p=1795400#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1795400&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7d91ef577d6ea68d534a650ea5d4b8f054b7eb5cb819bb2b0c50bd8294fdcb3f","category":"Tech"}