{"title":"Retinoid orphan receptor gamma t (rorγt) promotes inflammatory eosinophilia but is dispensable for innate immune-mediated colitis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300892","date":1711029600000,"content":"<p>by Alvaro Torres-Huerta, Katelyn Ruley-Haase, Theodore Reed, Antonia Boger-May, Derek Rubadeux, Lauren Mayer, Arpitha Mysore Rajashekara, Morgan Hiller, Madeleine Frech, Connor Roncagli, Cameron Pedersen, Mary Catherine Camacho, Lauren Hollmer, Lauren English, Grace Kane, David L. Boone</p>\r\n\r\nInflammatory bowel diseases (IBD) result from uncontrolled inflammation in the intestinal mucosa leading to damage and loss of function. Both innate and adaptive immunity contribute to the inflammation of IBD and innate and adaptive immune cells reciprocally activate each other in a forward feedback loop. In order to better understand innate immune contributions to IBD, we developed a model of spontaneous 100% penetrant, early onset colitis that occurs in the absence of adaptive immunity by crossing villin-TNFAIP3 mice to RAG1<sup>-/-</sup> mice (TRAG mice). This model is driven by microbes and features increased levels of innate lymphoid cells in the intestinal mucosa. To investigate the role of type 3 innate lymphoid cells (ILC3) in the innate colitis of TRAG mice, we crossed them to retinoid orphan receptor gamma t deficient (Rorγt<sup>-/-</sup>) mice. Rorγt<sup>-/-</sup> x TRAG mice exhibited markedly reduced eosinophilia in the colonic mucosa, but colitis persisted in these mice. Colitis in Rorγt<sup>-/-</sup> x TRAG mice was characterized by increased infiltration of the intestinal mucosa by neutrophils, inflammatory monocytes, macrophages and other innate cells. RNA and cellular profiles of Rorγt<sup>-/-</sup> x TRAG mice were consistent with a lack of ILC3 and ILC3 derived cytokines, reduced antimicrobial factors, increased activation oof epithelial repair processes and reduced activation of epithelial cell STAT3. The colitis in Rorγt<sup>-/-</sup> x TRAG mice was ameliorated by antibiotic treatment indicating that microbes contribute to the ILC3-independent colitis of these mice. Together, these gene expression and cell signaling signatures reflect the double-edged sword of ILC3 in the intestine, inducing both proinflammatory and antimicrobial protective responses. Thus, Rorγt promotes eosinophilia but Rorγt and Rorγt-dependent ILC3 are dispensable for the innate colitis in TRAG mice.","author":"Alvaro Torres-Huerta","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7d920eec48fe8cef7f4fef74d26275ccef52a8a6d1da1acf1e49f71d5926577d","category":"Interdisciplinary"}