{"title":"Measuring social norms related to child marriage among married women and men in Niger","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307595","date":1722002400000,"content":"<p>by Pooja Sripad, Jessie Pinchoff, Chaibou Dadi, Leanne Dougherty</p>\r\nBackground <p>Child marriage remains prevalent in the Sahel region. Pervasive norms regarding child marriage, and sexual behavior persist. We explored norms from multiple perspectives to strengthen interventions aimed at delaying age at marriage.</p> Methods <p>This study analyzed a cross-sectional household survey conducted in Niger in 2022 with women aged 15–49 (n = 2,726) and a subset of their male household members aged 15–59 (n = 1,136). Separate logistic regression models assessed factors associated with three descriptive (e.g., perception of what others do) and injunctive (e.g., perception of a group’s approval or disapproval) normative outcomes related to practices that support marriage as soon as a girl reaches puberty and beliefs related to premarital sex.</p> Results <p>Our study found a greater proportion of men described early marriage as protective from the fear of socially induced ruined marital prospects for women (70% vs. 64%), while women expressed its protection from being harassed (62% compared to 42%). The injunctive norm outcome that “my neighbors think that one should marry off one’s daughter as soon as she reaches puberty” was significantly associated with the belief that child marriage was protective for females among women (OR = 4.49; 95% CI 3.13. 5.50) and men (OR = 8.21; 95% CI 5.88, 11.45).</p> Conclusions <p>Programs addressing child marriage should consider both male and female perspectives to address differences and foster an environment where communities and families shift norms to delay early marriage.</p>","author":"Pooja Sripad","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7da6172b279fcc7bbc45253db8ae6cc485c6ca9f6439cb38244f351652b31c9d","category":"Interdisciplinary"}