{"title":"The effects of neck exercise in comparison to passive or no intervention on quantitative sensory testing measurements in adults with chronic neck pain: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303166","date":1714744800000,"content":"<p>by Daniel Osborne, Ferozkhan Jadhakhan, Deborah Falla</p>\r\nBackground <p>Previous systematic reviews have identified the benefits of exercise for chronic neck pain on subjective reports of pain, but not with objective measures such as quantitative sensory testing (QST). A systematic review was conducted to identify the effects of neck specific exercise on QST measures in adults with chronic neck pain to synthesise existing literature and provide clinical recommendations.</p> Methods <p>The study protocol was registered prospectively with PROSPERO (PROSPERO CRD42021297383). For both randomised and non-randomised trials, the following databases and trial registries were searched: AMED, CINAHL, Embase, Google Scholar, Medline, PEDro, PubMed, Scopus, SPORTDiscus, Science Citation Index and Social Science Citation Index from Web of Science Core Collection, clinicaltrials.gov, GreyOpen, and ISRCTN registry. These searches were conducted from inception to February 2022 and were updated until September 2023. Reference lists of eligible studies were screened. Study selection was performed independently by two reviewers, with data extraction and quality appraisal completed by one reviewer and independently ratified by a second reviewer. Due to high heterogeneity, narrative synthesis was performed with results grouped by exercise type.</p> Findings <p>Three trials were included. Risk of bias was rated as moderate and the certainty of evidence as low or moderate for all studies. All exercise groups demonstrated statistically significant improvement at an intermediate-term follow-up, with progressive resistance training combined with graded physical training demonstrating the highest certainty of evidence. Fixed resistance training demonstrated statistically significant improvement in QST measures at a short-term assessment.</p> Interpretation <p>Fixed resistance training is effective for short-term changes in pain sensitivity based on low-quality evidence, whilst moderate-quality evidence supports progressive resistance training combined with graded physical training for intermediate-term changes in pain sensitivity.</p>","author":"Daniel Osborne","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7da8c1cf6eb0fbcb7229adbf4d9af60feb92cc031a80354b3ccc0e212f09251b","category":"Interdisciplinary"}