{"title":"Open source espresso machine is one delicious rabbit hole inside another","link":"https://arstechnica.com/?p=1927022","date":1680025297000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/arduino_espresso1-800x1067.jpeg\" alt=\"Opened-up espresso maker on a kitchen counter\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/arduino_espresso1.jpeg\">Enlarge</a> <span>/</span> How far is too far to go for the perfect shot of espresso? Here's at least one trail marker for you. (credit: Norm Sohl)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Making espresso at home involves a conundrum familiar to many activities: It can be great, cheap, or easy to figure out, but you can only pick, at most, two of those. You can spend an infinite amount of time and money tweaking and upgrading your gear, chasing shots that taste like the best café offerings, always wondering what else you could modify.</p>\n<p>Or you could do what Norm Sohl did and <a href=\"https://sohl.substack.com/p/espresso-and-open-source-hardware\">build a highly configurable machine out of open source hardware plans and the thermal guts of an Espresso Gaggia</a>. Here's what Sohl did, and some further responses from the retired programmer and technical writer, now that his project has circulated in both open hardware and espresso-head circles.</p>\n<p>Like many home espresso enthusiasts, Sohl had seen that his preferred machine, the Gaggia Classic Pro, could be modified in several ways, including adding a proportional–integral–derivative (PID) controller and other modifications to better control temperature, pressure, and shot volumes. Most intriguing to Sohl was <a href=\"https://gaggiuino.github.io/#/\">Gaggiuino</a>, a project that adds those things with the help of an Arduino Nano or <a href=\"https://blog.adafruit.com/2021/03/05/new-product-stm32f411-blackpill-development-board/\">STM32 Blackpill</a>, a good deal of electrical work, and open software.</p></div><p><a href=\"https://arstechnica.com/?p=1927022#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1927022&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7daf0bbe0ecd02933681292397b7d719eb3855f1bd6bc7dcbe9368fbf104b110","category":"Tech"}