{"title":"Principles of Reasoning Dynamics","link":"https://www.preprints.org/manuscript/202405.1027/v2","date":1721740442000,"content":"This paper proposes a new dynamic analysis of reasoning. It makes the following contributions. First, the current states of the psychology of reasoning are critically reviewed from theoretical and empirical perspectives. The long-standing controversies between logicians and psychologists are clarified by introducing the gauge theoretic structure. The debates between the mental logic theory and the mental models theory are carefully reviewed by identifying the problem types used in the empirical studies. Certain mental fluctuations are found and a quantum theoretic solution is examined. Second, it solves the measurement problem within the Hamiltonian framework. The modeling structure underlying reasoning dynamics is the electrodynamics. They are both the single-charge dynamic systems sharing the U(1) symmetry. The mental logic theory and the mental models theory are now characterized as wavefunctions in a unified account of the dynamic analysis with the yes/no measurements. The stochastic sampling method is introduced to solve the measurement problem, which has a wide range of applications in social sciences. Third, a novel metatheoretic framework of reasoning dynamics within Lagrangian framework is proposed. It solves the “Man vs. Men” problem via gauge theoretic modeling, by making the distinction between the global level and the local level. At each level, the gauge transformations are applied to achieve the global symmetry and the local gauge symmetry. It explains the meanings of the gauge principle and the Nether theorem. Fourth, the special theory of relativity is applied to address the “Man vs. Men” problem. It explains how to draw the global language cone and the individualized local language cones. Finally, it points out that borrowing modeling methods from physics has a long tradition in psychology. The present work utilizes the conceptual and modeling methods found in modern theoretical physics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7db6991de3c981332e791006f24b3aecc63430142751d8d19a85225b74fffadc","category":"Interdisciplinary"}