{"title":"Tim Bray: ‘Mourning Google’","link":"https://www.tbray.org/ongoing/When/202x/2024/01/15/Google-2024","date":1705715854000,"content":"\n<p>Tim Bray:</p>\n\n<blockquote>\n  <p>But those Ten Blue Links surfaced by the PageRank-that-was had a \nspecial magic. I found them intensely human, a reflection of the \nvoices populating what remains of the Web, the only platform \nwithout a vendor. This was true when I was there and I said so, \nbut was laughed at. </p>\n\n<p>And now, in Anno Domini 2024, Google has lost its edge in search. \nThere are plenty of things it can’t find. There are compelling \nalternatives. To me this feels like a big inflection point, \nbecause around the stumbling feet of the Big Tech dinosaurs, the \nWeb’s mammals, agile and flexible, still scurry. They exhibit \ncreative energy and strongly-flavored voices, and those voices \nstill sometimes find and reinforce each other without being sock \npuppets of shareholder-value-focused private empires. </p>\n</blockquote>\n\n<p>That line: <em>the Web’s mammals, agile and flexible, still scurry</em>.</p>\n\n<p>That resonates. I’d expand that to <em>indie</em> mammals, whether writing web or native apps — or often now, both. One of the indie mammals today, one that fits the bill for a “compelling alternative” to Google Search, is <a href=\"https://kagi.com/\">Kagi</a>. I’d been using DuckDuckGo for many years as my primary search engine, but I switched to Kagi in the summer of 2022 and haven’t looked back. I’ve been paying $10/month for a <a href=\"https://blog.kagi.com/unlimited-searches-for-10#ultimate\">Professional plan</a> (unlimited searches per month, unlimited access to Kagi’s FastGPT and Universal Summarizer) and I’m <em>this close</em> to upgrading to the $25/month Ultimate plan just to support this crazy company.</p>\n\n<p>Kagi search isn’t just good for a Google alternative, I flat out prefer its results to Google’s. Better results in a far better presentation. The only thing I find myself resorting to Google Search for are <em>old</em> links — when searching for news or specific articles that are, I don’t know, maybe more than 10 years old, no search engine seems able to compete with Google. But for everything else, I prefer Kagi. I go weeks at a time not using Google Search.</p>\n\n<p>Kagi has no ads — it’s entirely supported by users paying for their excellent service. It’s never going to topple Google, but the man behind Kagi, Vladimir Prelovac, isn’t trying to. He’s just making a search engine — <a href=\"https://kagi.com/orion/\">and web browser!</a> — that are trying to be as good as they can possibly be. Just trying to make something great.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/19/bray-google-kagi\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7dca623c2a63edfe1d6eff1524efda83fa25539ae91b009700d384ccc5a710c4","category":"Tech"}