{"title":"Changes in water‐soluble taste compounds of tilapia (Oreochromis niloticus) fillets subjected to different thawing methods during long‐term frozen storage","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13542?af=R","date":1715257709000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The taste of fish is highly dependent on the composition of free amino acids (FAAs) and nucleotides. The present study aimed to investigate the effect of long-term frozen storage periods (−18 °C, up to 6 months) and thawing methods [water thawing (WT, 25 °C), air thawing (AT, 25 °C), and chilled air thawing (CAT, 4 °C)] on the taste quality of tilapia (<i>Oreochromis niloticus</i>) fillets.</p>\n<h2>RESULTS</h2>\n<p>The results showed that increase in bitter FAAs of CAT samples was 150.57% at 6 months of storage, which was lower than that of AT and WT. Glycine was the most abundant FAA and CAT maintained the highest sweet FAAs (249.90 mg/100 g). Additionally, the inosine monophosphate (IMP) of CAT samples were 1.18 and 1.09 times higher than that of WT and AT, respectively, at a frozen period of 6 months. In particular, the increase in equivalent umami concentration (EUC) values ranged from 24.25% to 103.16% in the three groups during the first 2 months. Data from principal component analysis (PCA) and orthogonal partial least-squares discrimination analysis (OPLS-DA) indicated that the taste quality was highly correlated with high levels of FAAs, hypoxanthine inosine (HxR) and hypoxanthine (Hx) as the storage time progressed.</p>\n<h2>CONCLUSION</h2>\n<p>In general, CAT is beneficial in maintaining the taste quality of tilapia fillets during frozen storage, and frozen durations for 2 months enhances the umami flavor. This study provides useful information for the preservation of frozen aquatic products during the storage and thawing, and enrich the theoretical knowledge of the flavor chemistry of fish products. © 2024 Society of Chemical Industry.</p>","author":"Hongli Wang, \nYingying Wang, \nKe Xu, \nSaikun Pan, \nWenzheng Shi, \nXichang Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7de2b65be938157a5e135d1b1e53361f9cfbd8bc83cf9333bdbfb61bccda2645","category":"Environment"}