{"title":"Your Magic Keyboard just got a rare update to fix a serious security flaw","link":"https://www.macworld.com/article/2199398/magic-keyboard-firmware-update-2-0-6-bluetooth-flaw.html","date":1704988971000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As we wait for the next round of software updates to hit our devices, Apple has released a rare update to one of its oldest accessories. The Magic Keyboard has been updated to Firmware Version 2.0.6, a security update that patches a Bluetooth vulnerability. The following models will get the update:</p>\n\n\n\n<ul>\n<li>Magic Keyboard</li>\n\n\n\n<li>Magic Keyboard (2021)</li>\n\n\n\n<li>Magic Keyboard with Numeric Keypad</li>\n\n\n\n<li>Magic Keyboard with Touch ID</li>\n\n\n\n<li>Magic Keyboard with Touch ID and Numeric Keypad</li>\n</ul>\n\n\n\n<p>If you have one of these models, you don’t have to do anything to install the firmware update. According to Apple, the installation will occur in the background when the keyboard is actively paired to a device running iOS, iPadOS, macOS, or tvOS.</p>\n\n\n\n<p>According to Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT214050&amp;xcust=1-1-2199398-1-0-0&amp;sref=https://www.macworld.com/feed\">security notes</a>, the update fixes a flaw that could let an attacker hijack your device’s Bluetooth connection:</p>\n\n\n\n<div><div>\n<h3><strong>Bluetooth</strong></h3>\n\n\n\n<ul>\n<li><strong>Impact:</strong> An attacker with physical access to the accessory may be able to extract its Bluetooth pairing key and monitor Bluetooth traffic</li>\n\n\n\n<li><strong>Description: </strong>A session management issue was addressed with improved checks.</li>\n\n\n\n<li><strong>CVE-2024-0230:</strong> Marc Newlin of SkySafe</li>\n</ul>\n</div></div>\n\n\n\n<p>To check the firmware version of your Magic Keyboard, make sure it is connected to your Mac, then go to System Settings &gt; <em>Bluetooth</em> and in the My Devices section, look for your keyboard. Then click the Info (i) button to see information about the device.</p>\n\nKeyboards, Security Software and Services</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7de5a9617cdc8faed76aac63b566596e32cc896f755a2ebddd00da86f9ad6b7d","category":"Apple"}