{"title":"Development of a Variable-Rate Spraying System for Small Amounts of Liquid Rhizobial Inoculation Based on Increment PID Control","link":"https://www.preprints.org/manuscript/202404.0072/v1","date":1712017183000,"content":": To improve the efficiency of rhizobial inoculation operations and address the current situation of rhizobial inoculation being labor-intensive, a spraying and control system for variable rate application (VRA) of liquid rhizobia was developed. The system can accurately regulate the spraying rate of liquid rhizobia according to the desired rate of rhizobia by incremental Proportional Integral Derivative (PID) closed-loop control algorithm, making it particularly suitable for precise spraying with small amounts. In the laboratory experiment of precise flow control, variation coefficient of spraying nozzle from 0.10 MP to 0.20 MP pressure were no more than 1.2%. A clear linear relationship was observed between the spraying rate and pressure. The maximum response time was 1.93 seconds, while the average response time was 1.62 seconds when controlling the spraying system for small amounts. Field trial was conducted in Heilongjiang Agricultural Xianghe Farm of China. Average seeds number and 100-seed weight of soybean plant with rhizobia inoculation treatment were better than control group, and average yield of spraying liquid rhizobia agent with full base fertilizer increased by 232.5 kg/hm2, representing a significant 7.4% improvement over the control group. The results of these trails clearly showed the positive effect of the spraying and control system for liquid rhizobial inoculation, which has superior to existing inoculation manners, and provides an important technical support for the widespread adoption of rhizobia technology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7df1959dafe02df58249d1a31ed3741a8af9127d8ea335a8d28b709819aee4e3","category":"Interdisciplinary"}