{"title":"Effects of pesticides on soil bacterial, fungal and protist communities, soil functions and grape quality in vineyards","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12327?af=R","date":1714124710000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/14474bfa-8cf0-4eed-89d4-d20477cf5a64/eso312327-toc-0001-m.png\" alt=\"Effects of pesticides on soil bacterial, fungal and protist communities, soil functions and grape quality in vineyards\" />\n<p>Investigating effects of vineyard management practices, Steiner et al. show, that richness of three essential microbial taxa (bacteria, fungi and protists) was only marginally reduced or not affected by herbicides. By contrast, soil copper content was a more consistent factor shaping microbial community compositions in all three groups. Microbe-associated soil functions were not affected by copper but soil respiration was consistently reduced by herbicide application. Remarkably, grape quality parameters in vineyards without herbicides remained more often below a critical thresholds for good wine-making.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nPesticides can have unintentional effects on non-target organisms and change biotic communities. Such changes might be particularly important in soil microbial communities, which drive many ecosystem functions and may affect crop quality.\n\nHere, we investigated, in a three-year study, how vegetation control (by herbicide application) and soil copper content (from long-term copper-based fungicide application) affect biodiversity and the community structure of soil bacteria, fungi and protists, and associated soil functions (respiration, decomposition) in Swiss vineyards. Furthermore, we determined the effects of these two management practices on grape quality as the most direct ecosystem service to farmers.\n\nAcross all study years, the community composition of microorganisms was affected by herbicide application, however, a significant loss of operational taxonomic units (OTUs) was only observed in fungi and protists. Soil copper content reduced OTU richness of bacteria and protists in some years but had no significant effect on fungal richness. Copper changed the community composition in all three groups of soil microorganisms. While we found no effect of copper on soil functions, herbicide application reduced microbial respiration and biomass by about 39% and 45%, respectively. However, decomposition rates remained virtually unchanged by any pesticide. Yeast assimilable nitrogen (YAN) levels in grape were below the critical threshold of 140 mg/L in 40% of the vineyards without herbicide application and the variety <i>Chasselas</i>, whereas in vineyards with herbicide application, it was only 20%.\n\nApplication of pesticides led to changes in richness and composition of soil microbial communities and directly reduced some soil functions (microbial biomass and respiration) but not all (decomposition). Some grape quality parameters can be indirectly enhanced by pesticide application, highlighting the trade-off between the interests of nature conservation and the interests of the farmer. Balancing these two diverging interests requires the establishment of alternative vineyard management allowing reduced pesticide application.\n</p>","author":"Magdalena Steiner, \nLaurent Falquet, \nAnne‐Laure Fragnière, \nAndrew Brown, \nSven Bacher","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"7df2c495c1f2058e398edca632b5d3631fc2096cdb2784cfc00d4de3d735eecb","category":"Environment"}