{"title":"Interview: How System Shock balanced faithful recreation and modern design","link":"https://arstechnica.com/?p=1942252","date":1685544720000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/thumbnail-800x335.png\" alt=\"Cyborg pointing a pistol in front of a screen in System Shock\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/thumbnail.png\">Enlarge</a> <span>/</span> Remaking and remastering a revered game may be nearly as tricky as remaking a space station employee as a cyborg enforcer. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>After nearly seven years of development, more than a decade after Stephen Kick first started looking into the rights, and almost 30 years after its release, <a href=\"https://systemshock.com\"><em>System Shock </em>is back</a>. It's simultaneously just how you remember it and also quite new.</p>\n<p>One of the unique aspects of this <a href=\"https://arstechnica.com/gaming/2023/02/system-shock-remake-demo-fuses-modern-design-to-a-retro-fps-rpg-package/\">new version of the game</a> from Nightdive Studios is how it mixes the concepts of \"remake\" and \"remaster,\" which are typically applied as binary labels. The levels, puzzles, enemies, weapons, and items are largely the same, though they look and feel different. The textures, visual effects, audio logs, and engine are redone, and some story elements have been tweaked for cohesion. Not all the door codes are the same (except <a href=\"https://www.polygon.com/22667576/deathloop-easter-egg-0451-arkane-looking-glass-studios\">the famous one</a>), and some rooms and hallways are redesigned for better navigation. Is this something of a ... remake-ster?</p>\n<p>I asked Stephen Kick, CEO of Nightdive, and Larry Kuperman, director of business development, how the developer decided which changes to make to one of gaming's most revered and influential classics to make it accessible to a modern audience. They were more than prepared for the question, seemingly having asked it of themselves.</p></div><p><a href=\"https://arstechnica.com/?p=1942252#p3\">Read 42 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942252&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7dfc04f6dfebaa78c8902ec6c6faeea786a3ef492040a78bd27ca9cf6743c8c7","category":"Tech"}