{"title":"‘The Media Coverage of Kamala Harris and Bluetooth Is Ridiculous’","link":"https://charlotteclymer.substack.com/p/the-media-coverage-of-kamala-harris","date":1638985570000,"content":"\n<p>Charlotte Clymer:</p>\n\n<blockquote>\n  <p>Last night, the journalists behind Politico’s West Wing Playbook\nthought it wise to publish a story on the VP’s preference for\nwired headphones — because she’s concerned over the vulnerability\nof Bluetooth-enabled devices like AirPods — and then fleshed out\nthe piece with an insinuation that she’s being paranoid.</p>\n\n<p>On Twitter, reporter Alex Thompson, one of the folks on the\nbyline, <a href=\"https://twitter.com/AlexThomp/status/1468002290695032834?s=20\">echoed this part from the piece</a>: that some aides felt\nVP Harris was being “a bit paranoid” over security and attached it\nto an anecdote over Harris, then California Attorney General,\ninstructing her staff not to leave visitors alone in her office.</p>\n\n<p>The critical bit about her ordering staff to not leave visitors\nalone in her office — the Office of the Attorney General of\nCalifornia — seems especially absurd. It’s a legal office. It’s a\ngovernment office. There are confidential documents. Someone left\nalone could plant a listening device. So many operational security\nconcerns.</p>\n\n<p>It doesn’t make sense.</p>\n</blockquote>\n\n<p>I’m not aware of any actual exploits that iPhone/AirPods users should worry about, but it certainly isn’t silly or “paranoid” that the vice president of the United States doesn’t want to take unnecessary risks.</p>\n\n<p>Clymer links to <a href=\"https://www.thedailybeast.com/well-actually-vice-president-kamala-harris-is-right-bluetooth-is-a-risk\">this solid piece from The Daily Beast</a> summarizing infosec concerns around Bluetooth. By its very nature, Bluetooth is a location beacon, for example.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/12/08/harris-bluetooth\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7dfd4ab42f25132098c72e2969c4f07488224581760c92059250b90e5c89e69d","category":"Tech"}