{"title":"Involvement of brassinosteroids and abscisic acid in spikelet degeneration in rice under soil drying during meiosis","link":"https://academic.oup.com/jxb/article/75/5/1580/7456119?rss=1","date":1701302400000,"content":"<span><div>Abstract</div>Spikelet degeneration in rice (<span>Oryza sativa</span> L.) is a serious physiological defect, and can be regulated by soil moisture status and phytohormones. This study investigated the possibility that brassinosteroids (BRs) in collaboration with abscisic acid (ABA) are involved in mediating the effect of soil drying during meiosis on spikelet degeneration in rice. Three rice cultivars were field grown and three irrigation regimes including well watered (WW), moderate soil drying (MD), and severe soil drying (SD) were imposed during meiosis. MD significantly decreased spikelet degeneration in comparison with WW, due mainly to the alleviation in oxidative damage via enhancing ascorbate–glutathione (AsA–GSH) cycle activity in young panicles, and SD exhibited the opposite effects. Enhanced AsA–GSH cycle strength, decreased oxidative stress, and spikelet degeneration rate were closely associated with the synergistically elevated BR and ABA levels in young panicles in MD. In contrast, low BR and excessive ABA levels led to an increase in spikelet degeneration in SD. The three cultivars exhibited the same tendencies. The intrinsic link among AsA-GSH cycle, oxidative stress, spikelet degeneration rate, and BR and ABA levels was further verified by using transgenic rice lines and chemical regulators. BRs or ABA play a unique role in regulating spikelet degeneration. Synergistically increased BR and ABA levels in MD could work together to strengthen AsA–GSH cycle activity, leading to a reduction in oxidative damage and spikelet degeneration. On the other hand, a severe imbalance between low BR and excessive ABA levels may have contributed to the opposite effects in SD.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"7e01482e2815d94a2b194d85b70f9d56ff5a9dc5a94749c7dba3ae33053d5829","category":"Environment"}