{"title":"YouTube TV launches 4K support and offline playback for an extra $20","link":"https://arstechnica.com/?p=1776978","date":1624986993000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/YouTube-TV.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/YouTube-TV.jpg\">Enlarge</a> <span>/</span> YouTube TV </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>YouTube TV is adding 4K support and offline playback, but it's going to cost you. Google <a href=\"https://support.google.com/youtubetv/answer/10383365\">detailed</a> YouTube TV's <a href=\"https://blog.youtube/news-and-events/experience-live-sports-4k-plus-and-other-new-features-youtube-tv/\">\"4K Plus\" subscription</a> add-on, which costs an extra $20 on top of the standard $65-per-month plan, for a total of $85 per month. 4K Plus might sound like it will simply provide a resolution bump, but subscribing to the higher tier will also unlock a new offline playback feature and unlimited simultaneous streaming over home Wi-Fi. The latter feature is otherwise limited to three streams per account. The one no-extra-cost feature of today's announcement is 5.1 audio support, which is rolling out to all YouTube TV members.</p>\n<p>YouTube TV is Google's US-only pay-per-month service meant to replace a cable TV subscription. For the base price of $65 a month, you get access to a bundle of major cable TV channels, like ESPN, CNN, MTV, Cartoon Network, Discovery, Nickelodeon, Comedy Central, TBS, TNT, USA, NFL Network, and more. The major US TV networks—CBS, ABC, NBC, and Fox—are all included. In addition to paying extra for 4K, you can also tack on other premium add-ons like cable TV movie channels such as HBO, Stars, Showtime, and Cinemax. Sports packages, including NFL Red Zone, are available as well. Just like cable, YouTube TV is quite expensive and keeps getting more expensive. Google just <a href=\"https://arstechnica.com/information-technology/2020/06/youtube-tv-att-tv-directv-choose-the-same-day-to-raise-prices/\">raised the price</a> to $65 last year.</p>\n<p>Even if you pay the extra $20, it sounds like 4K content will be hard to come by. Google says that \"4K playback is available on select live and on-demand content from these networks: Discovery, ESPN, FOX Sports, FX, Nat Geo, NBC Sports, and Tastemade.\" The lack of 4K content isn't YouTube TV's fault, though. While Internet streaming services like Netflix, Disney Plus, Amazon Prime Video, and YouTube have all been on the 4K content train for some time, cable TV networks are still primarily producing content in 720p or 1080p. YouTube TV is essentially cable, and there's just not that much 4K content available.</p></div><p><a href=\"https://arstechnica.com/?p=1776978#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1776978&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7e04330da30e63d6ecd09c31d11d2c84ab17c81f08a69bd07e86aa016408f7ff","category":"Tech"}