{"title":"Biden admin wants Europe to reject forced payments from Big Tech to ISPs","link":"https://arstechnica.com/?p=1942584","date":1685118385000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/getty-dollars-euros-800x532.jpg\" alt=\"A pile of money from the US and Europe, including 50 and 100-dollar bills along with 100, 200, and 500-euro notes.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/getty-dollars-euros.jpg\">Enlarge</a> (credit: Getty Images | Alan Schein)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Biden administration urged Europe to reject the telecom industry plan to make Big Tech companies pay for Internet service providers' network expansions and upgrades. In <a href=\"https://www.ntia.gov/other-publication/2023/united-states-comments-european-consultation-future-electronic\">comments</a> submitted to the European Commission last week, the US Commerce Department's National Telecommunications and Information Administration (NTIA) said that mandating payments from online platforms to ISPs would \"distort competition\" and undermine net neutrality.</p>\n<p>\"Mandating direct payments to telecom operators in the EU absent assurances on spending could reinforce the dominant market position of the largest operators,\" the US submission said. \"It could give operators a new bottleneck over customers, raise costs for end users, and alter incentives for CAPs/LTGs [content and application providers and large traffic generators] to make efficient decisions regarding network investment and interconnection. It is difficult to understand how a system of mandatory payments imposed on only a subset of content providers could be enforced without undermining net neutrality.\"</p>\n<p>European broadband providers said in their <a href=\"https://arstechnica.com/tech-policy/2023/05/telcos-detail-plan-to-charge-big-tech-firms-for-access-to-internet-users/\">comments</a> that they should be allowed to demand new fees from online companies that account for over 5 percent of a telco's average peak traffic. Telco lobby groups claimed that Europe needs \"a fair contribution based on a framework that allows balanced negotiations between telcos and large traffic generators who obtain the most benefit from telecom investment, while creating a high-cost burden with their traffic and exerting disproportionate power across markets.\"</p></div><p><a href=\"https://arstechnica.com/?p=1942584#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942584&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7e077b26ef52d883dcd79db83b935f28865c64231abae9db3ded06870f1a7577","category":"Tech"}