{"title":"The key to the Mac’s survival isn’t a new Air–it’s the next iPad Pro","link":"https://www.macworld.com/article/1658491/mac-ipad-pro-future.html","date":1678876200000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>I’ve never felt the need to choose between the iPad and the Mac. I use and value them both. But over the last few years, it’s started to feel like both the Mac and the iPad are increasingly limited by an artificial barrier that Apple has placed between them.</p>\n\n\n\n<p>The iPad has slowly become more Mac-like without ever really reaching the promised land. The Mac, meanwhile, has failed to pick up many features from the iPad.</p>\n\n\n\n<p>I admire the discipline Apple has had in keeping its product lines separate, but it feels like that decision is starting to harm the futures of both products. The Mac and the iPad are on a collision course, and I’m concerned that they’re both about to run into the brick wall that Apple has erected between them.</p>\n\n\n\n<h2>Not quite a Mac</h2>\n\n\n\n<p>In the iPad Pro era (i.e., the last eight years), Apple has put a lot of effort into building Mac-like features into iPadOS. Rather than just knocking off Mac features, Apple has tried to reinvent that functionality in an iPad context.</p>\n\n\n<div><figure><img src=\"https://images.techadvisor.com/cmsdata/features/3818810/ipad-pro-12-9-pouces.jpg?quality=50&amp;strip=all\" alt=\"ipad-pro-12-9-pouces.jpg\" loading=\"lazy\" /><figcaption>Apple makes attempts to develop iPadOS into its own, with mixed results. </figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>When it works well, as it did with the 2020 addition of cursor support, it can be a triumph. But too often, the additions seem limited or partial in ways that serve to highlight how much more powerful the Mac is. Files is like Finder, but more limited. Stage Manager is like Mac windowing, but more limited. Some fundamentals of iPadOS (like the audio subsystem, which can only play from a single app at a time and can’t record system or app audio) were built for the limited world of the iPhone and seemingly never revisited.</p>\n\n\n\n<p>And, of course, even with full keyboard and trackpad support, the closest iPadOS has been allowed to come to a MacBook is with add-on accessories like the Magic Keyboard. An <a href=\"https://www.macworld.com/article/230739/why-apples-next-laptop-should-run-ios.html\">iPadOS-based laptop might be worth trying</a>, but it never will exist because it infringes on the Mac’s turf.</p>\n\n\n\n<h2>One MacBook, no exceptions</h2>\n\n\n\n<p>While the iPad has always specialized in flexible ergonomics, the design of the MacBook line has been frozen in amber since the early 2010s. You can buy numerous Windows-based laptops that experiment with ergonomics in interesting ways that break the laptop paradigm of two permanently attached rectangles. While those PCs can be weird, they also offer a level of ergonomic flexibility that the Mac can’t. MacBooks are laptops, and that’s all they are allowed to be.</p>\n\n\n\n<p>Of course, it’s hard to be a convertible mobile computer if there’s no way to control the device without a keyboard and trackpad. Rumor has it that Apple might finally add a touchscreen to MacBooks in a couple of years–which would be an earth-shaking development if PCs hadn’t had them for ages now. The addition of the Apple Pencil has been another big boost for the iPad, but the Mac can only use one if you connect it to an iPad and draw on the iPad’s screen.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3697165/16-inch-macbook-pro_review.jpg?quality=50&amp;strip=all\" alt=\"16in MacBook Pro\" loading=\"lazy\" /><figcaption>Apple’s paradigm for the MacBook hasn’t changed in decades. Maybe it’s time.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Still, the Mac has all the power and flexibility that the iPad–even the iPad Pro–lacks. I can do every aspect of my job on a MacBook Air from pretty much anywhere in the world. Podcasting alone makes that a no-go for the iPad Pro, and there are numerous other features on the iPad Pro that are just not quite as powerful or flexible as those on macOS.</p>\n\n\n\n<h2>Let’s explore the middle</h2>\n\n\n\n<p>Sometimes I look back at all the effort Apple has made with the iPad Pro and wonder if it was worth it. All the additions of Mac-ish features have added complexity that’s probably lost on most users of iPadOS, and the power users for whom they were intended are probably well aware of all the ways they don’t really match up the Mac features they’re duplicating.</p>\n\n\n\n<p>I want to see what happens when the walls come down. Today’s iPad Pro is powered by the same chip that’s in the MacBook Air. Would it be such a cataclysm if I could simply reboot that iPad into macOS or run macOS inside a virtual machine?</p>\n\n\n\n<p>Likewise, what if the Mac had a touchscreen and Apple Pencil support and came in shapes that weren’t the traditional laptop? What if the Mac began to offer the ergonomic flexibility that iPadOS is so good at? What if I ripped the keyboard off a MacBook and had the option to switch to a touch-based mode that was essentially iPadOS?</p>\n\n\n\n<p>I’m not quite saying that macOS and iPadOS need to merge together. But I am starting to wonder if users would be better served if the iPad Pro could be more like a Mac and the MacBook could be more like an iPad Pro. (Of course, in this scenario, there would also still be traditional laptops running macOS and lower-end iPads running iPadOS).</p>\n\n\n\n<p>For years now, Apple has pushed the iPad Pro up into a neither-fish-nor-fowl space where, as hard as it tries, it can’t ever be a Mac. Meanwhile, the Mac can’t ever be an iPad. It feels like the time has come for the barriers to come down and for Apple to let these two product lines spread their wings. As long as the Mac and the iPad aren’t allowed to use the strengths of one another, I fear that neither will become the best version of themselves.</p>\n\niPad, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7e07ebcc5e5919b20ebd84f59d37e7f6a35da85d9f1bf0b061dfffb076422d70","category":"Apple"}