{"title":"The dream of an all-screen iPhone is closer than ever–but still very far away","link":"https://www.macworld.com/article/2165194/all-screen-design-iphone.html","date":1702039952000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Ever since the launch of the first iPhone in 2007, Apple has been pushing closer and closer to its ideal of an all-screen design. The original model spurned the hardware keyboards of contemporary BlackBerry devices in order to fit in more screen space; ten years later the Home button was removed too, opening up yet more real estate. But to this day, Apple has been unable to finish the job because it needs to find space–first a notch, later a Dynamic Island–for the selfie camera and front-facing biometric sensors.</p>\n\n\n\n<p>Well, that might be about to change. As reported by Korean-language <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thelec.kr/news/articleView.html?idxno=24568&amp;xcust=1-1-2165194-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">The Elec</a> (via <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/12/06/iphone-under-display-camera/&amp;xcust=1-1-2165194-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors</a>), Apple supplier LG Innotek “has begun advanced development” of a new under-panel camera, or UPC. “It is presumed,” the site adds, “that this is intended to prepare for the implementation of full-screen Apple iPhones.”</p>\n\n\n\n<p>By installing the front-facing sensors under the screen, the makers would remove the need for a dead area with no pixels. There would be no visible hole or imperfection in the smooth expanse of the display. (Would Apple keep the Dynamic Island as a purely software-based screen element that can be removed entirely while playing games or watching films? After pushing it so hard as a feature rather than a bug, I think it might.)</p>\n\n\n\n<p>UPCs are not without their disadvantages, which explains why Apple hasn’t done this before now. The fact that light has to pass through the screen before entering the camera’s aperture can reduce picture quality, for example. But LG Innotek thinks it has cracked this issue with a special lens it’s developing (and has patented) called ‘Freeform Optic.’ This can reduce the aberration of the optical system and increase the light ratio, the company boasts.</p>\n\n\n\n<p>We’ve heard somewhat similar tales before now, and the idea of an all-screen iPhone has been bandied around for almost as long as there have been iPhones. (Back in March 2022, for instance, we covered a report that suggested the iPhone 15 Pro could have <a href=\"https://www.macworld.com/article/625530/iphone-15-pro-under-display-face-id.html\">under-screen Face ID</a>.) So we should be realistic. Firstly, this is some way from reaching the point of a commercial launch, with The Elec warning that any iPhone with this new feature will be released after 2026; it definitely won’t appear in the <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">iPhone 16</a>. Second, for projects this far from completion, any number of things could change or go wrong, and the entire concept could be shelved without warning.</p>\n\n\n\n<p>Still, it’s a nice idea, isn’t it? Place your pre-orders for the iPhone 19 Pro now!</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7e0995d8bb5e89bd679d34263b7275e733f3b0f1edbdf43deabb5ba55989b465","category":"Apple"}