{"title":"Litter Decomposition in Retreating Coastal Forests","link":"http://link.springer.com/10.1007/s12237-024-01358-3","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Rising sea levels lead to the migration of salt marshes into coastal forests, thereby shifting both ecosystem composition and function. In this study, we investigate leaf litter decomposition, a critical component of forest carbon cycling, across the marsh-forest boundary with a focus on the potential influence of environmental gradients (i.e., temperature, light, moisture, salinity, and oxygen) on decomposition rates. To examine litter decomposition across these potentially competing co-occurring environmental gradients, we deployed litterbags within distinct forest health communities along the marsh-forest continuum and monitored decomposition rates over 6 months. Our results revealed that while the burial depth of litter enhanced decomposition within any individual forest zone by approximately 60% (decay rate = 0.272 ± 0.029 yr<sup>−1</sup> (surface), 0.450 ± 0.039 yr<sup>−1</sup> (buried)), we observed limited changes in decomposition rates across the marsh-forest boundary with only slightly enhanced decomposition in mid-forest soils that are being newly impacted by saltwater intrusion and shrub encroachment. The absence of linear changes in decomposition rates indicates non-linear interactions between the observed environmental gradients that maintain a consistent net rate of decomposition across the marsh-forest boundary. However, despite similar decomposition rates across the boundary, the accumulated soil litter layer disappears because leaf litter influx decreases from the absence of mature trees. Our finding that environmental gradients counteract expected decomposition trends could inform carbon-climate model projections and may be indicative of decomposition dynamics present in other transitioning ecosystem boundaries.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"7e172c412c7b7c314e6da570641bd078e7effd7880f26e34030fc69e0c886e41","category":"Environment"}