{"title":"Analysis of Long-Term Creep Response Characteristics of High Rock Slopes considering Cumulative Effects of Earthquakes","link":"https://www.preprints.org/manuscript/202407.0792/v1","date":1720616440000,"content":"In mountain-gorge areas, the rock creep is the critical process for high rock slopes failure. During long-term rock creep, slopes might encounter earthquakes and form further creep after earthquakes. This complex mechanical response process can easily lead to the slope failure. Based on a high rock slope in the Nujiang River Basin, this paper analyzes deformation characteristics and dynamic response characteristics by using FLAC3D software, considering combined effects of multiple earthquakes and long-term creep. Results show that when the amplitude increases, the shear strength of the slope decreases and the risk of instability increases under combined actions of creep and earthquakes. Earthquakes promote the development of creep and induce the accumulation of damage on the slope surface and in the slope. The delayed effect becomes more pronounced as the slope height increases. We need to consider deformation differences of the slope further. The ground motion response on the slope surface is stronger than those in the slope, with the peak occurring at the top of the slope. Earthquakes have a greater impact on the middle and top of the slope surface, where cumulative damage and crack development begin. Reinforcement should be considered in these two places. Vertical earthquake has a great effect on the dynamic response. The phenomenon of slope resonance leads to a larger MPGA in the vertical direction than in the horizontal direction. Nonlinear and damping characteristics of the slope and the frequency of seismic waves cause the MPGA to decrease with the increase of amplitudes. This study could promote the development of high rock slope failure mechanism and provide references for the prevention of landslides in the Nujiang River Basin.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7e194017f2d7fd1d3dc4fb4d046d2e0808d7f07d046501d5cecc6d757b69f84a","category":"Interdisciplinary"}