{"title":"Tolerability and efficacy of switching anti-fibrotic treatment from nintedanib to pirfenidone for idiopathic pulmonary fibrosis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305429","date":1718287200000,"content":"<p>by Keishi Sugino, Hirotaka Ono, Mikako Saito, Masahiro Ando, Eiyasu Tsuboi</p>\r\nBackground <p>In real-world studies, the rate of discontinuation of nintedanib (NT) varies from 4% to 53%. Switching anti-fibrotic treatment in patients with idiopathic pulmonary fibrosis (IPF) has not been adequately investigated, and data on the tolerability and efficacy of changes in anti-fibrotic treatment is limited in clinical practice.</p> Objective <p>To identify factors associated with poor continuation of NT, efficacy and predictors of deterioration after switching from NT to pirfenidone (PFD) in patients with IPF.</p> Subjects and methods <p>One hundred and seventy patients with IPF in whom NT was introduced between April 2017 and March 2022 were included to investigate NT continuation status and the effect of switching to PFD.</p> Results <p>A total of 123 patients (72.4%) continued NT for 1 year and had a significantly higher %forced vital capacity (FVC) at NT introduction than those who discontinued within 1 year (80.9% ± 16.3% vs. 71.9% ± 22.1%, P = 0.004). The determinant of poor NT continuation was the high GAP stage. On the other hand, 28 of 36 patients who discontinued NT because of disease progression switched to PFD. Consequently, FVC decline was suppressed before and after the change. The predictor of deterioration after the switch was a lower body mass index.</p> Conclusions <p>In patients with IPF, early NT introduction increased continuation rates, and switching to PFD was effective when patients deteriorated despite initial NT treatment.</p>","author":"Keishi Sugino","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7e1a1193738f7d71b4f469e1e664112cfd6fd59840af61c39cdf2dfe5bfd9581","category":"Interdisciplinary"}