{"title":"Into the unknown: The role of post‐fire soil erosion in the carbon cycle","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17354?af=R","date":1717225200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/56b52533-b351-421f-a067-dd8a56b3d9a6/gcb17354-toc-0001-m.png\" alt=\"Into the unknown: The role of post-fire soil erosion in the carbon cycle\" />\n<p>Carbon (C) redistribution associated with fire-enhanced soil erosion is speculated to affect the global C cycle, yet remains unquantified. Here we estimate the magnitude of post-fire soil organic carbon (SOC) erosion by water and assess its capacity to act as a C sink or source. Results indicate that post-fire SOC erosion is a quantitatively important process in the overall C balance of fires; and that the C sink ability of SOC water erosion alone during the first post-fire year could account for around 13% of the C emissions produced by wildland fires.</p>\n<br />\n<h2>Abstract</h2>\n<p>Wildfires directly emit 2.1 Pg carbon (C) to the atmosphere annually. The net effect of wildfires on the C cycle, however, involves many interacting source and sink processes beyond these emissions from combustion. Among those, the role of post-fire enhanced soil organic carbon (SOC) erosion as a C sink mechanism remains essentially unquantified. Wildfires can greatly enhance soil erosion due to the loss of protective vegetation cover and changes to soil structure and wettability. Post-fire SOC erosion acts as a C sink when off-site burial and stabilization of C eroded after a fire, together with the on-site recovery of SOC content, exceed the C losses during its post-fire transport. Here we synthesize published data on post-fire SOC erosion and evaluate its overall potential to act as longer-term C sink. To explore its quantitative importance, we also model its magnitude at continental scale using the 2017 wildfire season in Europe. Our estimations show that the C sink ability of SOC water erosion during the first post-fire year could account for around 13% of the C emissions produced by wildland fires. This indicates that post-fire SOC erosion is a quantitatively important process in the overall C balance of fires and highlights the need for more field data to further validate this initial assessment.</p>","author":"Antonio Girona‐García, \nDiana Vieira, \nStefan Doerr, \nPanos Panagos, \nCristina Santín","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"7e1fd5b594b64edc48b32b4f282b6d53b5ce9f591ebdb3f01de7cb7b1dfbe0a9","category":"Environment"}