{"title":"Performance evaluation and application of host-specific <i>Bacteroidales</i> and mitochondrial DNA markers to identify sources of fecal contamination in river water in Japan","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000210","date":1709733600000,"content":"<p>by Bikash Malla, Kazuki Yamamoto, Kotomi Furukawa, Eiji Haramoto</p>\r\n\r\nMicrobial source tracking (MST) using host-specific <i>Bacteroidales</i> and mitochondrial DNA (mtDNA) markers is an efficient tool to identify the sources of fecal contamination in environmental water. This study evaluated and updated the previously reported performances of seven host-specific <i>Bacteroidales</i> markers (three human-, two cattle-, and two pig-specific). Additionally, the performance of a cattle-specific Bovine mtDNA and a pig-specific Swine mtDNA marker were evaluated and then applied to MST of river water samples collected in Yamanashi Prefecture, Japan. We collected 48 fecal-source samples, including raw sewage, secondary-treated sewage, an effluent of a domestic wastewater treatment tank, pig feces, pig wastewater, and cattle feces, which were quantitatively analyzed using host-specific <i>Bacteroidales</i> and mtDNA markers. BacHum and <i>gyrB</i> markers (human-specific), BacR and Bovine mtDNA markers (cattle-specific), and Pig2Bac and Swine mtDNA markers (pig-specific) were judged the best-performing markers. Then, these selected markers were applied to MST to identify the sources of fecal contamination in 59 river water samples collected at 21 sites. Of them, 20 (95%), 21 (100%), and 16 (76%) sites were positive for at least one human, cattle, and pig marker, respectively, indicating the need for immediate action and monitoring to control fecal pollution.","author":"Bikash Malla","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"7e2b3dd1480e7f70e8333f42ab0718339ccf27fb3c139f4cb5a52c6665e1a156","category":"Environment"}