{"title":"Identification of gonadal associated genes in black tiger shrimp (Penaeus monodon) using transcriptome analysis and high‐throughput sequencing","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16128?af=R","date":1668758400000,"content":"<h2>Abstract</h2>\n<p>Black tiger shrimp (<i>Penaeus monodon</i>) is a commercially important species. It is reported to have low reproductive maturation rates in captivity. To improve the production of this species via sustainable aquaculture, genetic techniques are required to improve its maturation rates. However, to date, reports on <i>P. monodon</i> reproduction at a transcriptional level are limited. To address this, we conducted transcriptome sequencing of the ovaries and testes of <i>P. monodon</i> using high-throughput sequencing to identify sex-related pathways and genes. A total of 75.74 Gb of clean data were generated from nine gonadal tissue libraries. We obtained 62,276 unigenes with a mean length of 1452 bp and N50 of 2423 bp. A total of 11,411 significantly differentially expressed genes (DEGs) were identified between the testis and developed ovaries. Enrichment analysis of the DEGs identified 415 significantly enriched GO terms and 106 enriched KEGG pathways. Genes related to the <i>P. monodon</i> ovaries were enriched in the steroid biosynthesis, mRNA surveillance, nucleocytoplasmic transport, oxidative phosphorylation and DNA replication pathways. Five upregulated and five downregulated ovarian genes were confirmed using RT-PCR. This investigation has thus identified important sex-related functional genes, GO terms and pathways in <i>P. monodon</i>. In particular, we identified several important genes and pathways related to gonadal development, such as GnRH/GnRHR-like, Hsp90, PCNA, cathepsin L, Wnt signalling pathway and ovarian steroidogenesis pathway, which provide important insights into the mechanism analysis and sex regulation of shrimp gonadal development. The results will provide reference data for future research into the reproductive biology of shrimp, which will aid in improved black tiger shrimp breeding in captivity.</p>","author":"Yundong Li, \nFalin Zhou, \nNingning Su, \nSong Jiang, \nQibin Yang, \nJianhua Huang, \nLishi Yang, \nShigui Jiang","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"7e37df14d69db7c4b27f3675d0c73b7da1b3b72643731e966c86b0b676c056c7","category":"Environment"}