{"title":"Cervical microbiota dysbiosis associated with high-risk Human Papillomavirus infection","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302270","date":1714140000000,"content":"<p>by Natalia Zeber-Lubecka, Maria Kulecka, Michalina Dabrowska, Katarzyna Baginska-Drabiuk, Maria Glowienka-Stodolak, Andrzej Nowakowski, Aneta Slabuszewska-Jozwiak, Bożena Bednorz, Ilona Jędrzejewska, Magdalena Piasecka, Jolanta Pawelec, Elzbieta Wojciechowska-Lampka, Jerzy Ostrowski</p>\r\n\r\nHigh-risk Human Papillomavirus (HR-HPV) genotypes, specifically HPV16 and HPV18, pose a significant risk for the development of cervical intraepithelial neoplasia and cervical cancer. In the multifaceted cervical microenvironment, consisting of immune cells and diverse microbiota, <i>Lactobacillus</i> emerges as a pivotal factor, wielding significant influence in both stabilizing and disrupting the microbiome of the reproductive tract. To analyze the distinction between the cervical microbiota and <i>Lactobacillus</i>-dominant/non-dominant status of HR-HPV and non-infected healthy women, sixty-nine cervical swab samples were analyzed, included 44 with HR-HPV infection and healthy controls. All samples were recruited from Human Papillomavirus-based cervical cancer screening program and subjected to 16s rRNA sequencing analysis. Alpha and beta diversity analyses reveal no significant differences in the cervical microbiota of HR-HPV-infected women, including 16 and 18 HPV genotypes, and those with squamous intraepithelial lesion (SIL), compared to a control group. In this study we identified significantly lower abundance of <i>Lactobacillus mucosae</i> in women with HR-HPV infection compared to the control group. Furthermore, changes in bacterial diversity were noted in <i>Lactobacillus</i> non-dominant (LND) samples compared to <i>Lactobacillus</i>-dominant (LD) in both HR-HPV-infected and control groups. LND samples in HR-HPV-infected women exhibited a cervical dysbiotic state, characterized by <i>Lactobacillus</i> deficiency. In turn, the LD HR-HPV group showed an overrepresentation of <i>Lactobacillus helveticus</i>. In summary, our study highlighted the distinctive roles of <i>L</i>. <i>mucosae</i> and <i>L</i>. <i>helveticus</i> in HR-HPV infections, signaling a need for further research to demonstrate potential clinical implications of cervical microbiota dysbiosis.","author":"Natalia Zeber-Lubecka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7e385afab507e8d616cd45982cd7918ef525c8a94be6deee84b19e089acbb6d6","category":"Interdisciplinary"}