{"title":"Exploring the Interplay of Bud Load and Pruning Type in Shaping 'Xinomavro' (V. vinifera L.) Vine Growth, Yield, and Berry Composition","link":"https://www.preprints.org/manuscript/202409.1748/v2","date":1729064251000,"content":"'Xinomavro' (V. vinifera L.) is an important native red wine grape variety in Northern Greece, particularly in PDO (Protected Designation of Origin) regions. Despite its significance, there is limited research on the effects of pruning type and severity on 'Xinomavro' vine physiology, yield, and berry quality across diverse environmental conditions. This study aimed to address this knowledge gap and provide growers with crucial information for optimizing vineyard management practices. The study was conducted over two consecutive years (2016 and 2017) in a vineyard in Thessaloniki, Northern Greece. Four treatments ( B12:12 buds on 6 spurs; B24:24 buds on 12 spurs; M12:12 buds on 2 canes; M24:24 buds on 4 canes) combining two bud load levels (12 or 24 count nodes) and two pruning types (short spurs or long canes) were applied to 'Xinomavro' vines in complete block randomized design. The vine water status, gas exchange, canopy characteristics, yield components, and berry composition were measured. Bud load and pruning type significantly influenced vine canopy development, microclimate, and yield components. Short pruning with high bud load (B24) resulted in denser canopies and higher yields, whereas cane pruning (M12 and M24) led to more open canopies and improved berry quality indicators. Treatment effects on berry composition were inconsistent across years, but showed a tendency for higher anthocyanin and total phenol content in cane-pruned vines.  This study demonstrated that pruning type (short or long fruiting units) may have a greater impact on vine growth, yield, and berry composition than bud load alone in 'Xinomavro' vines. Cane pruning appears to be a more effective strategy for achieving vine balance and potentially improving grape quality under given experimental conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7e3f97397115ac8b709b8c473b0c91d03d26626a7bfb0fcdc5ea5043c9c52ff3","category":"Interdisciplinary"}