{"title":"Back in business: Get back to cycling in Europe","link":"https://www.cyclist.co.uk/sponsored/10153/back-in-business-get-back-to-cycling-in-europe","date":1633098347000,"content":"<span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>12 Oct 2021</span></div>    </div></div><p>\nDestination inspiration as you build up to your next European cycling holiday</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/cycling_mallora.jpg?itok=t_Fzj7zD\" />  </div>\n<div>\n      <p><span>As we head into the cooler winter months, it’s a good time to start dreaming of and planning ahead for your next cycling adventure abroad. If you’re an American Express® Cardmember, it’s also a good time to think about building up your Avios, the world-leading travel rewards currency, to make that trip more affordable and luxurious.</span></p>\n<p><span>So, as international travel gets more feasible and everyone’s itching to get back on their bike abroad, read on for our top picks for your next cycling holiday in Europe – and to find out more about the Card that can help get you there.</span></p>\n<h3><span>Mallorca</span></h3>\n<p><span>If you’re keen to get away sooner rather than later, Mallorca is a great destination for some winter sun, with around 300 days of sunshine a year. Many famous climbs in the region offer a good but manageable challenge, with plenty of gorgeous landscapes and scenery to take in.</span></p>\n<p><span>For example, the sharply winding Sa Calobra is one of the most beautiful rides in the world and arguably the hardest ride on the island – especially since you start with the descent down to the coast. And in this case, what goes down must come up!</span></p>\n<p><span>If you visit in spring, you can take part in the Mallorca 312, which traverses 312km around the island and is on many a keen cyclist’s bucket list.</span></p>\n<h3><span>Flanders</span></h3>\n<p><span>Best known for the Spring Classics and for the challenges of the famous cobbled streets, you may want to plan your holiday for the quieter (and more predictable in terms of weather) summer months.</span></p>\n<p><span>If you stay in the Oudenaarde area, you'll have easy access to the cobbled streets that make up part of the Tour de Flanders to test your technical skills, while also being surrounded by the culture and history of Belgium. There’s even the Tour of Flanders Museum in Oudenaarde, where you can learn all about the history of the sport in Flanders.</span></p>\n<h3><span>Girona</span></h3>\n<p><span>There’s a reason all the pros live in Girona. It has access to some of the most beautiful and diverse cycling routes in Europe and has a strong cycling culture – hosting some of the biggest cycling events and festivals on the continent, such as the Sea Otter Europe.</span></p>\n<p><span>Highlights include the unbeatable range of dedicated cycling cafes, many of which are run by former pros including Rory Sutherland and Christian Meier, and the extensive network of greenways, historical roads, rural tracks to explore against the stunning Mediterranean scenery.</span></p>\n<p><span>Top routes include the 353km Pirinexus cycle loop through the Spanish and French Pyrenees in the Catalan region, and the coastal route from Lloret-Tossa de Mar to Sant Feliu de Guíxols.</span></p>\n<h3>French Alps</h3>\n<p><span>Thanks to the Tour de France and Giro d’Italia, the French Alps have some of the most famous climbs in the world. They’re a great destination for any experienced cyclist who wants to see if they’ve got what it takes.</span></p>\n<p><span>The climbs are challenging, the scenery is spectacular, and you’re in the land of wine and cheese so you can reward yourself after a hard day’s riding. With the Alps having big ski and cycling seasons, there are plenty of hotels and chalets to choose from which are set up for those travelling to enjoy outdoor activities.</span></p>\n<p><span>Some of the top climbs include the Col de la Madeleine from Feissons-sur-Isère (length: 24.5km, altitude gain: 1,543m), one of the most challenging climbs in the French Alps and one of the most featured in the Tour de France, and the Col du Galibier from Valloire (length: 18.1km, altitude gain: 1,245m), which is another Tour de France favourite.</span></p>\n<p><span><br />\n<div>\n<div>\n    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/cycling_french_alps.jpg?itok=FUhHwJOy\" />  </div>\n</div>\n<p></p></span></p>\n<h3><span>The Danube</span></h3>\n<p><span>If you’re looking for more of a holiday than a major cycling challenge, the road that runs along the Danube river is often listed as one of Europe’s most beautiful cycling routes. It’s a mostly flat, comfortable and gentle ride for the warm summer months, and therefore makes a great family holiday.</span></p>\n<p><span>The river route runs 2,896km through several countries from the source in Germany, passing through Austria, Slovakia, Hungary, Croatia and Serbia all the way to the Black Sea in Romania – so there are lots of sections to choose from.</span></p>\n<h3><span>The Algarve</span></h3>\n<p><span>A great destination for road cyclists due to the year-round sunny weather (although it can get windy!) and abundance of great cycling roads, the Algarve offers a mixture of gentler coastal rides and more challenging rides up in the mountains. If you visit in February, you can catch your favourite riders in the Volta ao Algarve, one of the smaller professional races in the season.</span></p>\n<p><span>One of the benefits of the Algarve for cycling is it’s not the most obvious destination, so you can enjoy a bit more peace and quiet than you might in the nearby Mediterranean islands. And perhaps one of the best things about choosing Portugal is that you can enjoy a delicious Pastel de Nata with your coffee when you stop for a break.</span></p>\n<h3><span>Planning for and enhancing your trip</span></h3>\n<p><span>You should have no problem finding travel agents and accommodation suited to keen cyclists in these destinations, but it’s also worth thinking outside of the box about how to make the most of your holiday.</span></p>\n<p><span>For example, if you’re a small business owner planning your next trip, then the British Airways American Express® Accelerating Business Card offers a great opportunity. Cardmembers can use their routine business spend (be that on advertising, technology, office supplies, travel or utilities – to name just a few) to earn accelerated Avios, the world-leading travel rewards currency. Avios can be put towards a wide range of travel experiences such as reward flights, flight upgrades, hotel stays and car hire. Plus, the Card also comes with an attractive Annual Bonus, and for a limited time</span><span>*</span><span> a significant Welcome Bonus for new Cardmembers too.</span></p>\n<p><span>It’s also worth checking and keeping up to date with travel guidance as you plan your trip, so you’re able to properly enjoy the well-earned riding break that you've planned.</span></p>\n<p><em><span>To find out more about the British Airways American Express Accelerating Business Card and to explore the full range of new and improved benefits, please see <a href=\"https://www.americanexpress.com/uk/business/partners/british-airways-business-cards.html\" target=\"_blank\">here</a> for terms and conditions.</span></em></p>\n<p><strong>Representative Example: Interest rate for purchases: 22.2% p.a variable. Rep 97.6% variable based on £250 annual fee and assumed annual credit amount of £1,200**.  Please borrow responsibly.</strong></p>\n<p><span><br />\n<div>\n<div>\n    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/insert_main_wide_image/public/2021/10/amex_banner.jpg?itok=yyn7ltbB\" />  </div>\n</div>\n<p></p></span></p>\n<p><span>Dreaming of your next cycling getaway? The British Airways American Express Accelerating Business Card can help you get there. For a limited time only, new Cardmembers can earn a Welcome Bonus of 60,000 Avios* when spending £5,000† on the Card in the first three months – one of the most rewarding Avios bonus offers ever from American Express.</span></p>\n<p><span>And that’s not all – the updated Card has a new tiered Avios Annual Bonus that gives Cardmembers 10,000 bonus Avios for every £20,000 spent, up to three times per calendar year††. This means Cardmembers can earn up to an additional 30,000 bonus Avios annually. Combined with the earn rate of 1.5 Avios for every £1 spent on purchases‡, business owners have the opportunity to earn up to 120,000 Avios each year, if they spend £60,000† on their Card. This amount of Avios is enough for two peak economy return flights from London to destinations such as New York or Dubai‡‡.</span></p>\n<p>Exclusively with this Card, Cardmembers can also enjoy an increased earn rate with On Business, British Airways’ loyalty programme for businesses, earning 2 On Business Points for every eligible £1 spent with British Airways§. </p>\n<p><strong>Promoter: American Express Services Europe Limited has its registered office at Belgrave House, 76 Buckingham Palace Road, London, SW1W 9AX, United Kingdom. It is registered in England and Wales with Company Number 1833139 and authorised and regulated by the Financial Conduct Authority.</strong></p>\n<p><em>*For a minimum period of 2 months and a maximum period of 5 months. Offer may be withdrawn or modified at any time after 2 November 2021.</em></p>\n<p><em>**Terms apply. Applicants must be UK residents aged 18 years old or over and are subject to approval. All information including Representative APR and Representative Example is correct as at 7 October 2021. Interest rates link to the Bank of England base rate. See amex.co.uk for details. American Express Services Europe Limited is authorised and regulated by the Financial Conduct Authority.</em></p>\n<p><em>†Please ensure you spend responsibly. Increasing borrowing on your Card could have consequences if the balance is not paid in full. It may take longer to clear the balance and you may incur interest charges on the outstanding balance.</em></p>\n<p><em>††You will be awarded 10,000 bonus Avios (Avios Annual Bonus) once you have spent and charged £20,000 on purchases on your Card, up to three times each calendar year. Interest, fees (including default fees), balance transfers, cash advances (including transactions treated as cash), loading of prepaid cards, American Express Travellers Cheque purchases or foreign exchange transactions and any amounts that are subsequently re-credited to your Card Account by way of refunds or other types of credit, are not eligible towards the bonus. Your Account must be in good standing at the time of earning the bonus. Please note, it can take up to one month for the bonus Avios to be awarded to your Account once you have met the required spend.</em></p>\n<p><em>‡Cardmembers are awarded 1.5 Avios for every eligible £1 spent and charged per transaction. Avios are not earned on interest, fees (including default fees), balance transfers, cash advances (including transactions treated as cash), loading of prepaid cards, American Express Travellers Cheque purchases or foreign exchange transactions; and any amounts that are subsequently re-credited to your Card Account by way of refunds or other types of credit. Please refer to full benefit terms and conditions associated with your Card Account for all eligibility criteria. Avios are issued and redeemed subject to British Airways Executive Club terms and conditions and will be reflected on your British Airways Executive Club account.</em></p>\n<p><em>‡‡120,000 Avios plus £100 per person for two peak economy return flights from London. Reward Flight Savers are British Airways’ best value reward flights. Reward Flight Saver offers customers great value flights with a low, flat fee to cover taxes, fees and carrier charges and a fixed Avios amount. To be eligible for Reward Flight Saver, you need to have collected at least one Avios in the past 12 months. If you are not eligible for Reward Flight Saver, you’ll be shown the standard reward flight price instead with full taxes, fees and charges. To find out more about Reward Flights and/or Reward Flight Saver, click here. Standard Reward Flights will be the same Avios amount but full taxes, fees and charges will be payable. (All Avios amounts quoted were correct as 13 September 2021). Reward flights are subject to availability.</em></p>\n<p><em>§The Company will earn Two (2) On Business Points for every eligible £1 spent on qualifying flights directly with British Airways on the Card. One (1) On Business Point comprises the additional earn for purchasing a qualifying flight with this Card Account (the Amex Accelerator), the other On Business Point is your base On Business Point earn. Please refer to full benefit terms and conditions associated with your Card Account for all benefit eligibility criteria. On Business Points are issued and redeemed subject to On Business Programme terms and conditions</em></p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/destinations\">Destinations</a></div>    </div></div>","author":"HughA","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"7e47e15c47f89a9934b024266d67ed11d47663fb3e42a8ecb6b46dfb8a198e22","category":"Cycling"}