{"title":"Short-Term Electrical Demand Forecast Modeling Considering External Influences: A Comprehensive Study","link":"https://www.preprints.org/manuscript/202406.1550/v2","date":1728659321000,"content":"Short-term electrical demand forecasting is crucial for the effective operation of new electrical networks. This necessity arises from the requirement for more timely demand information compared to traditional networks, as well as the integration of new energy sources into the electrical grid. Most existing forecasting methodologies fail because they do not consider the nonlinearities of the system, and because they neglect to represent important external influences on the problem; in other words, they are not based on a holistic approach to electricity demand forecasting. In this study, we present a new approach to developing an electrical demand forecasting model, and consider a case study to evaluate the importance of several factors affecting electricity consumption and forecast accuracy. We use an ISO NE (Independent System Operator New England) dataset that represents the total electrical load of several New England cities from January 2017 to December 2019. This dataset includes 23 independent variables, such as meteorological data, economic indicators and market information. Our study presents a pipeline for building electrical demand forecast models using time series information as input. By carefully selecting variables and representing external factors, we demonstrate the feasibility of generating a more accurate forecasting model with reduced computational resources. Our results show that incorporating external factors can enhance model accuracy by up to 60%. To handle large input datasets, variable selection is crucial for reducing dimensionality while maintaining accuracy, enabling the effective application of deep learning models. Simulations reveal that deep learning models with no more than three intermediate layers and an optimal number of neurons perform efficiently. The CNN+LSTM composite model achieved the lowest error rate at 0.15%, surpassing previously studied models, including standalone CNN and LSTM approaches, which had error rates of 0.8% and 1.44%, respectively. The CNN's feature extraction abilities, combined with the LSTM's strength in handling time-series data, were instrumental in achieving superior performance across most scenarios.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7e4daccf128dd427936717ef8b990c3e72edd0f66ebc9a5825081ffffcb80e4e","category":"Interdisciplinary"}