{"title":"HashiCorp Ambassador Call for Submissions","link":"https://www.hashicorp.com/blog/hashicorp-ambassador-call-for-submissions","date":1611165600000,"content":"<p>As we look ahead to 2021, open source remains at the heart of our products and communities.</p>\n<p>In the spirit of open source, there are three key elements to growing our community and making it accessible to everyone: knowledge sharing, kindness, and mentorship. A project’s strength consists of both code quality and the welcoming community and ecosystem built around it.</p>\n<p>In our inaugural year of the program, we are grateful to have welcomed Ambassadors who embody all of the above and more.</p>\n<p>While 2020 was challenging in many ways, we are mindful of the opportunity we had to create connections with and between this community of 48 Ambassadors.</p><img src=https://www.datocms-assets.com/2885/1611170599-mehdi.png alt=Credit: @mehdilaruelle><p>Credit: <a href=\"https://twitter.com/mehdilaruelle/status/1301041497823944704\">@mehdilaruelle</a></p><img src=https://www.datocms-assets.com/2885/1611170704-kerim-jacob.png alt=Credit: @ksatirli & @arctiqjacob><p>Credit: <a href=\"https://twitter.com/ArctiqJacob/status/1299763323286753281/retweets/with_comments\">@ksatirli &#x26; @arctiqjacob</a></p><p>We are proud of the fact that participants in this year's program are pillars of our principles. They seek to interact with kindness and respect, whether in-person or online.</p><img src=https://www.datocms-assets.com/2885/1611170818-bas.png alt=Credit: @bbaassssiiee><p>Credit: <a href=\"https://twitter.com/bbaassssiiee/status/1317067183877480448\">@bbaassssiiee</a></p><p>They share knowledge openly and broadly, benefiting our community by making our tools more accessible.</p><img src=https://www.datocms-assets.com/2885/1611170975-april.png alt=Credit: @theapriledwards><p>Credit: <a href=\"https://twitter.com/TheAprilEdwards/status/1298620281192423424\">@theapriledwards</a></p><img src=https://www.datocms-assets.com/2885/1611171063-larry.png alt=Credit: @mrlesmithjr><p>Credit: <a href=\"https://twitter.com/mrlesmithjr/status/1284136299927089154\">@mrlesmithjr</a></p><p>With early access to new releases, many Ambassadors publish launch day technical overviews, providing interested users with access to in-depth knowledge from day 1.</p><img src=https://www.datocms-assets.com/2885/1611171075-kyler.png alt=Credit: @kymidd><p>Credit: <a href=\"https://twitter.com/kymidd/status/1316412914161651712\">@kymidd</a></p><p>In 2021 we will look to expand this program, and continue to create space for meaningful interactions. We aim to make Ambassadors more visible to the community and will roll out ways to accomplish this throughout the year. For now, please follow along with the <a href=\"https://twitter.com/i/lists/1285555707123847168\">2020 Ambassadors on Twitter</a>.</p>\n<p>Have you, or someone you know, created content or organized (virtual) events around HashiCorp tools in 2020? Has there been someone who has been particularly helpful in your journey or insightful with their feedback? We are accepting applications and nominations from community members who have been active in 2020 to recognize efforts in sharing knowledge around HashiCorp tools. This work makes our community more vibrant and collaborative, and supports the health of the broader ecosystem.</p>\n<p>Please share those stories by submitting your <a href=\"https://www.hashicorp.com/ambassador-nominations\">application or nomination</a>, including specific examples of how these potential ambassadors engaged within the community by <strong>February 24, 2021</strong>.</p>\n<p><em>We look forward to your submissions! Please reach out to <a href=\"mailto:ambassadors@hashicorp.com\">ambassadors@hashicorp.com</a> if you have any questions.</em></p>","author":"Alexandra Freeman","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"7e52b689517d372b0ab6014ca85ef60e8aba90e523d07dfe58eb875d40d5a44a","category":"Tech"}