{"title":"Widespread Evidence for Rapid Recent Changes in Global Range and Abundance of Threespine Stickleback (Gasterosteus aculeatus)","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12866?af=R","date":1729281235000,"content":"<h2>ABSTRACT</h2>\n<p>The threespine stickleback, <i>Gasterosteus aculeatus</i>, has undergone dramatic increases in abundance in parts of its historical native range, and it is also undergoing a major range expansion. We review available information and discuss the vectors and sources of the species' range expansions, the genetic characteristics of recently founded populations and the ecological consequences of both stickleback introductions and increases in abundance. Dramatic range expansions occurred in the Caspian Sea drainage, large rivers in the Black Sea drainage, reservoirs of the Rhine basin, isolated lakes in North America and Japan and remote islands in the Arctic. Likely reasons for these range expansions include canal construction, accidental inclusion with stocking of commercially valuable fish, intentional release by aquarists and fishermen and climate change. In some cases, range expansions of stickleback were likely facilitated by genetic admixture of previously separated lineages, as well as by high-standing genetic variation that promotes rapid adaptation to new habitats. Accordingly, range expansions are often accompanied by striking increases in abundance, although these are two distinct processes. Notably, population growth within the species' native range, particularly in the White and Baltic Seas, has been observed alongside expansions into new areas. Where stickleback colonise new habitats or increase in abundance, extensive ecological impacts on ecosystems typically occur. Given these massive and widespread changes, the species has the potential to provide considerable insight into the evolutionary and ecological effects of human impacts on aquatic ecosystems.</p>","author":"Aleksander A. Makhrov, \nEaston Y. K. Houle, \nAndrew P. Hendry, \nAlison M. Derry, \nDmitry L. Lajus","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"7e54da778d09d29eb9d5b7eaf9ca8e5bf91cdb6b105d809c46621560fc72be18","category":"Environment"}