{"title":"OLED displays aren’t coming to the MacBook Pro anytime soon","link":"https://www.macworld.com/article/2104132/macbook-pro-oled-displays-2026.html","date":1697125647000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While we’ve heard rumors that <a href=\"https://www.macworld.com/article/2102929/ipad-air-mini-pro-oled-display-rumors.html\">iPads with OLED displays could be coming next year</a>, the path for OLEDs to come to the MacBook Pro is a little longer–try just under three years from now, maybe more.</p>\n\n\n\n<p>Ross Young of Display Supply Chain Consultants <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bloomberg.zoom.us/webinar/register/WN_lWrE5XzyQkSCqFzJhqor1w#/registration&amp;xcust=1-1-2104132-1-0-0&amp;sref=https://www.macworld.com/feed\">spoke at a Bloomberg-sponsored webinar</a> and provided insight on Apple’s ability to implement OLED into its MacBook Pro. He stated that it would take a few years for Apple’s manufacturing partners to set up production for laptop OLEDs. He believes a MacBook Pro with an OLED display won’t ship until 2026 or 2027, when it has an M4 or M5 processor.</p>\n\n\n\n<p>The current 14- and 16-inch MacBook Pro use mini-LED displays, which debuted with the M1 models in 2021. The switch to OLED would provide better power efficiency, likely increasing battery life, and offer better color and brightness. As seen with the iPhone, OLED displays produce darker blacks, better contrast, and higher brightness than LCD and LED screens. Several PC laptops already have OLED displays, including models from Dell, Acer, and Samsung.</p>\n\n\n\n<p>Young did state that the iPad Pro could ship with OLEDs as soon as next year, and the iPad Air and iPad mini may get the technology in 2026. This falls in line with other recent reports from <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://omdia.tech.informa.com/blogs/2023/apple-ipad-panel-purchasing-plan-and-forecast&amp;xcust=1-1-2104132-1-0-0&amp;sref=https://www.macworld.com/feed\">Omdia</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://m.blog.naver.com/yeux1122/223232907661&amp;xcust=1-1-2104132-1-0-0&amp;sref=https://www.macworld.com/feed\">yeux1122’s blog</a>. Young tracks the manufacturing and production of displays and has a history of accurate reports.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7e5651bccea7eadeda8ba5dec25f8ec70ace35433389ff80f3f4fc22d1b0865b","category":"Apple"}