{"title":"Status of and Challenges to the Establishment and Retention of Young, Beginning, and Minority-Owned Logging Businesses in Florida and Georgia","link":"https://academic.oup.com/jof/article/122/2/131/7395583?rss=1","date":1699488000000,"content":"<span><div>Abstract</div>Most logging businesses in the US South are owned by White males, many of whom are approaching retirement. The purpose of this study was to evaluate the characteristics of logging businesses with a young owner, beginning (new) business owner, and businesses owned by members of a minority group (YBM). In-person interviews were conducted with twelve YBM logging business owners in Florida and Georgia to gather information on business characteristics and perceived barriers to the formation of these businesses. The YBM business owners were more educated, employed more workers, and had similar capital investments relative to other logging business owners. These owners stated that difficulty recruiting quality employees, high startup costs, lack of industry connections, and high insurance premiums were unique obstacles to establishing YBM businesses. Purposeful actions by the forest industry, policymakers, and other stakeholders may encourage the formation and retention of YBM logging businesses.Study Implications: As the current generation of logging business owners leaves the industry, it is important to develop new businesses. New businesses will likely be owned by young owners, mid-career professionals starting new logging businesses (beginning businesses), and businesses owned by members of a minority group (YBM). Targeted efforts by loggers’ associations, the forest industry, and other stakeholders that provide business management training, develop a skilled workforce of equipment operators and log truck drivers, and promote policies that result in affordable insurance may encourage the establishment and retention of YBM businesses.</span>","author":"","siteTitle":"Journal of Forestry Current Issue","siteHash":"f325018648ab04fba35e6e1191e9c9d953f9458bd233a7a41545c2e465328e3b","entryHash":"7e626d0f73acfdf68adf1304ddd4c20b29af8aa12a6dbb589d1f044ac23785a7","category":"Environment"}