{"title":"Apple’s M3 will reportedly keep adding CPU and GPU cores to boost performance","link":"https://arstechnica.com/?p=1939234","date":1684166476000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/Apple-M2-chips-M2-Pro-230117-800x450.jpg\" alt=\"Apple's M2 Pro chip. Unsurprisingly, Apple is already testing its replacement. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/Apple-M2-chips-M2-Pro-230117.jpg\">Enlarge</a> <span>/</span> Apple's M2 Pro chip. Unsurprisingly, Apple is already testing its replacement.  (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Many Apple Silicon Macs still haven't made the jump from the M1 generation to the M2, and the Mac Pro is still using an Intel processor, but some app developers have already begun to see signs that Apple is testing members of the M3 chip family.</p>\n<p>Bloomberg's Mark Gurman <a href=\"https://www.bloomberg.com/news/newsletters/2023-05-14/apple-m3-chip-mac-specifications-and-features-cpu-gpu-and-ram-increase-details-lhngxmx4\">relays</a> that the M3 chip in question has a 12-core CPU with six high-performance cores and six high-efficiency cores, plus 18 graphics cores and 36GB of memory. This all suggests the chip is some kind of M3 Pro, like the kind you'd find in a 14- or 16-inch MacBook Pro or a high-end Mac mini; the current base model M2 Pro uses six high-performance CPU cores, four high-efficiency cores, and 16 GPU cores. We can only guess at the specs of the regular M3, the M3 Max, or the M3 Ultra.</p>\n<p>Though Apple has (mostly) ditched Intel, the two companies have taken a similar approach to improving their processors' performance in recent years: lean on architectural upgrades and small clock speed boosts to improve single-threaded performance on the big CPU cores while adding an increasing number of small high-efficiency cores to bolster multi-threaded performance for pro-level workloads that can use every CPU core you throw at them.</p></div><p><a href=\"https://arstechnica.com/?p=1939234#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939234&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7e6362395a62d117972ad068deaba2908aad5a418961f9ec399ac66820c87dac","category":"Tech"}