{"title":"The Goldilocks Dilemma: the optimal management strategy for invasive trees in the Atlantic Forest","link":"http://link.springer.com/10.1007/s10530-024-03383-6","date":1727740800000,"content":"<h3>Abstract</h3>\n                    <p>This study addresses the broader issue of invasive species management, particularly within the context of highly biodiverse yet threatened ecosystems such as the Atlantic Forest in Brazil. Effective management strategies are paramount to mitigate the ecological impact of invasive species on native ecosystems. Using the case of <em>Artocarpus heterophyllus</em> Lam. (Moraceae), a tree native to Southeast Asia that has become invasive in some urban tropical forests in Brazil, we developed a management approach based on the tree’s life cycle and vital rates. Our disturbance analysis showed that a management strategy focused on the survival and growth of JUVENILES 1 and ADULTS 1 would be effective in reducing the population growth rate (λ). Elasticity analyses, on the other hand, indicate that the best management options are those based on the survival rates of JUVENILES 1, ADULTS 1, and ADULTS 2. To reduce the population’s λ, our management simulations suggest that small interventions are sufficient, targeting a reduction of up to 5% in survival rates, particularly in the reproductive classes. In contrast, our simulations highlight that interventions involving the removal of 30% of the population or more per year have a minimal effect on reducing the population growth rate, while gradual, long-term management is more effective. Excessive management, defined as large-scale interventions that can open large gaps in the forest (e. g. exceeding 70% removal per year), would be unnecessary, could result in the waste of financial resources, and could hinder native species’ ability to colonize the environment.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"7e6e94a8177cc901128c4c7767add5530aa91205e8742114e18e1d4d1c4bf4a4","category":"Environment"}