{"title":"The thermal impact of stored water as supplementary energy source for a solar air heater","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14297?af=R","date":1709812904000,"content":"<h2>Abstract</h2>\n<p>Solar energy system optimization is a critical consideration for expanding its reach and competitiveness against traditional energy sources. This study specifically targets solar flat plate collectors, focusing on the concept of solar air collectors with an innovative enhancement strategy. To fulfill energy requirements across various applications like heating and drying, setting up collector arrays, such as solar air and water heaters, becomes imperative for meeting desired energy outputs. This research employs numerical analysis to investigate the energy efficiency of a modified solar air heater (MSAH). The enhancement involves integrating a parallelepiped enclosure filled with water, connected to a solar flat plate water collector, into the collector's rear. This water-filled enclosure serves as a storage tank for the solar water heater. Simulation using the Fluent CFD code is conducted based on meteorological conditions at the Renewable Energy Development Center (CDER) in Bouzaréah, Algeria. Numerical outcomes are compared with experimental findings. Results indicate the positive impact of utilizing the water storage tank as an additional energy source. This modification leads to a substantial 57% performance increase in the MSAH compared with the standard version. This elevated efficiency remains consistent even during periods of reduced solar radiation, owing to the supplementary energy contribution from the solar water heater. In contrast, the standard version's performance hinges solely on available solar radiation for energy generation. This research underscores the potential of combining solar air and water heaters to enhance solar energy systems' efficiency and dependability, facilitating their practical implementation and sustainable utilization.</p>","author":"Hakim Semai, \nAmor Bouhdjar","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"7e6f92bf6871c470b3873f549b47ef4067a77b2e9ca122bcff518e4c73bf79fd","category":"Environment"}