{"title":"PSXIII-19 Levels of multicarbohydrase complexes on digestibility and rumen fermentation characteristics for feedlot cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/797/7757922?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Feeding exogenous enzymes has the potential to increase the digestibility of nutrients and modify rumen fermentation in diets for feedlot cattle, on the other hand, the effect of the inclusion of corn ethanol co-products on nutrient digestibility is still controversial. We hypothesized that the supplementation of enzyme complex improves nutrient digestibility and increases ruminal pH of feedlot cattle receiving a finishing diet and the inclusion of DFS (corn dry bran/fiber plus distillers solubles) has no effect on rumen fermentation and nutrients digestibility. The objective of this study was to evaluate the use of doses of multicarbohydrase complexes and the inclusion of DFS on nutrient digestibility and rumen fermentation. Ruminally cannulated Nellore steers [n = 30; Initial body weight (BW) = 250 kg] were used in a randomized complete block design in a 2 × 3 factorial arrangement. Factor 1 was defined by the inclusion of DFS [15% or 45% of dry matter (DM)], and factor 2 was the doses of multicarbohydrase complexes (0, 0.75 and 1.0 g/10 kg of DM). The diets contained 8.5% sugar cane bagasse, 44 or 73% ground flint corn, 15 or 45% DFS, 0.5 or 1.5% urea and 2% mineral mix plus monensin with the respective enzyme complex doses. The digestibility assessment was carried out based on the assessment of nutrient consumption (offered and non-consumed feed) and total feces production on d 18 to 22 of the study. Ruminal fluid collection was carried out on d 23 of the study, every 3 h, and samples were analyzed to determine ruminal fluid pH, volatile fatty acids (VFA) proportion and ammonia nitrogen concentration. Orthogonal contrasts were performed to evaluate the effects of enzyme complex doses with a significance level of 5%. Two contrasts were tested to compare: 1) 0 g of enzyme vs. inclusion of enzyme, and 2) 0.75 g of enzyme vs. 1.0 g. There was an interaction (<span>P</span> ≤ 0.05) for protein digestibility. The inclusion of multicarbohydrase complexes increased crude protein (CP) digestibility in diets with 45% DFS, with no effect on diets containing 15% DFS. Feeding the enzyme complex increased (<span>P</span> ≤ 0.05) the ether extract digestibility. Feeding 45 vs 15% DFS had no effect on the digestibility of nutrients (<span>P</span> ≥ 0.05). There was no DFS inclusion and doses of enzymes interaction for ruminal fermentation variables. The DFS inclusion did not affect the VFA and ruminal ammonia; however, the inclusion of 45% DFS increased the ruminal pH (6.40 vs. 6.23). The doses of multicarbohydrase complexes did not affect the ruminal pH, VFA and ammonia concentration; however, decreased the acetate:propionate ratio. In conclusion, the enzyme complex had minor effects on nutrient digestibility but improved rumen fermentation, while feeding 45% DFS in the diet had no effect on nutrient digestibility and increased rumen pH.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7e7421aadaf15d15706dc47da633e81a829990855e57cf9ae1adb4cf6646e4cd","category":"Environment"}