{"title":"Responses of Showy Leopard Frog Larvae (Lithobates spectabilis) to the Presence of Introduced Rainbow Trout in Mexico","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4254?af=R","date":1727071924000,"content":"<h2>ABSTRACT</h2>\n<p>The introduction of invasive fish for aquaculture can significantly impact native aquatic fauna, especially in regions where native amphibians have a biphasic life cycle. We conducted three laboratory experiments to assess the effects of introduced rainbow trout (<i>Oncorhynchus mykiss</i>) aquaculture on the native showy leopard frog (<i>Lithobates spectabilis</i>) in Mexico. We aimed to understand the effects of trout visual and chemical cues on tadpole behaviour, and the long-term effects of chemical cues (in interaction with tadpole density) on tadpole growth, development and survival. In Experiment 1, we exposed groups of tadpoles to the visual cue of a trout, comparing their refuge use and position within the tank to a control group. In Experiment 2,we exposed groups of tadpoles to trout chemical cues contrasting their refuge use to a control group. In Experiment 3, we exposed tadpoles at different densities to trout chemical cues for a prolonged period, recording their growth, development and survival. Results showed that tadpoles did not alter refuge use in response to trout visual cues but positioned themselves farther from these cues compared to controls. Tadpoles increased refuge use in response to chemical cues. Long-term exposure to chemical cues did not affect tadpole growth, development or survival, but higher densities led to lower survival rates. Our findings suggest that trout farming, through fish escapement or untreated farm water discharge containing trout chemical cues, could trigger behavioural responses in <i>L.</i>\n<i>spectabilis</i> larvae, increasing refuge use and local tadpole densities, ultimately compromising their survival and, potentially, species persistence.</p>\n<h2>Resumen</h2>\n<p>La introducción de peces invasores para la acuacultura puede afectar significativamente a la fauna acuática nativa, especialmente en regiones con anfibios nativos de ciclo de vida bifásico. Realizamos tres experimentos de laboratorio para evaluar los efectos del cultivo de trucha arcoíris introducida (<i>Oncorhynchus mykiss</i>) sobre la rana manchada nativa (<i>Lithobates spectabilis</i>) en México. Nuestro objetivo fue comprender los efectos de las señales visuales y químicas de las truchas sobre el comportamiento de los renacuajos, y los efectos a largo plazo de las señales químicas (en interacción con la densidad de los renacuajos) sobre el crecimiento, desarrollo y supervivencia de los renacuajos. En el Experimento 1, expusimos grupos de renacuajos a la señal visual de una trucha y comparamos su uso de refugio y posición con un grupo control. En el Experimento 2, expusimos grupos de renacuajos a señales químicas de las truchas y registramos su uso de refugios en contraste con un grupo control. En el Experimento 3, expusimos renacuajos en diferentes densidades a señales químicas de truchas durante un período prolongado, registrando su crecimiento, desarrollo y supervivencia. Los resultados mostraron que los renacuajos no alteraron el uso del refugio en respuesta a las señales visuales de las truchas, pero se posicionaron más lejos de las señales en comparación con los controles. Los renacuajos aumentaron el uso de refugios en respuesta a señales químicas. La exposición prolongada a señales químicas no afectó el crecimiento, el desarrollo o la supervivencia de los renacuajos, pero densidades más altas condujeron a tasas de supervivencia más bajas. Nuestros hallazgos sugieren que el cultivo de truchas, a través del escape de peces o la descarga de agua de granja no tratada que contiene señales químicas de la trucha, desencadena respuestas de comportamiento en las larvas de <i>L. spectabilis</i>, aumentando el uso de refugios y las densidades locales de renacuajos, comprometiendo en última instancia su supervivencia y potencialmente la persistencia de la especie.</p>","author":"Carlos A. Flores, \nMichael R. Crossland, \nMedardo Arreortúa, \nEdna González‐Bernal","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"7e7b24258b0b4c491b3a20be562053c356ff527ebc389532aa73c1b47703a2d2","category":"Environment"}