{"title":"Preparation of hyaluronic acid‐loaded liquid‐core hydrogel beads with acceptable mechanical properties and thermal stability","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13406?af=R","date":1709729074000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Hyaluronic acid liquid-core hydrogel beads (HA-LHB) is a good way for oral intake of HA. However, HA may affect the reaction–diffusion of sodium alginate (SA) and Ca<sup>2+</sup> leading to poor mechanical properties, since HA is a polyanionic electrolyte having electrostatic effect and a certain spatial site-blocking effect.</p>\n<h2>Results</h2>\n<p>The mechanical properties of HA-LHB were modified from bathing solution, core solution and secondary calcium bath time. The mechanical properties varied with the SA structure and concentration in bathing solution, where SA with high G (guluronic acid) segment compounded with SA with high M (mannuronic acid) segment at a mass ratio of 7:3 with a 11 g kg<sup>−1</sup> concentration showed the best mechanical properties. The secondary calcium bath can greatly improve the mechanical properties due to the tight network formed by bidirectional crosslinking, and 15 min reaction reached the plateau if Ca<sup>2+</sup> is sufficient. And the mechanical properties were positively correlated with calcium lactate concentration only at &lt;70 g kg<sup>−1</sup> in core solution, but the diffusion of Ca<sup>2+</sup> was hindered by the tight gel network at higher concentrations. Moreover, the mechanical properties can be maintained during heat treatment, due to the rearrangement of alginate network structure.</p>\n<h2>Conclusion</h2>\n<p>Our results suggested that the problem of poor mechanical properties of LHB in the presence of high HA concentration can be avoided by process control, which may broaden the development of HA and popping boba market. © 2024 Society of Chemical Industry.</p>","author":"Hang Li, \nQinyi Zhang, \nLing Chen, \nYongzhi Wang, \nZheng Ai, \nTianmeng Zhang, \nFei Liu, \nFang Zhong","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7e7cb67b1cff3c553566f9b4498c2e4cbf86b8354338a352acb9556c0901515e","category":"Environment"}