{"title":"Apple’s Weather app is working again for now, but has the issue been fixed?","link":"https://www.macworld.com/article/1682239/weather-app-ios-ongoing-system-issues.html","date":1680661771000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re like us, one of the first things you do each morning is to check the weather app on your iPhone. If it returned a blank screen this morning, it’s not an issue with your Wi-Fi—Apple’s systems have been having serious problems all day. But after more than half a day of intermittent outages, the service has been restored. However, it remains to be seen whether the Weather app itself eeds a larger fix to prevent it from happening again.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/systemstatus/&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Apple’s System Status page</a> earlier Tuesday, the Weather app had “ongoing” issues since 11:00 pm ET Monday and the service “may be slow or unreliable.” Apple notes that “some users are affected,” but based on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/__Casanova_____/status/1643224924616523777&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">anecdotal</a> <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/cocolileeee/status/1641891732051853312&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">evidence</a>—including Macworld’s own experience—the issue appeared to be quite widespread. It also appeared to affect the Weather widget, which displayed “No weather data” even when the weather properly appeared in the app.</p>\n\n\n\n<p>Apple responded to queries on Twitter with a message saying they are “currently working on a solution for the Weather app outage and will post an update online.” Later in the afternoon, Apple’s status page was all green and the warning indicator had been lifted.</p>\n\n\n\n<figure><div>\n<blockquote><p>Thank you for your patience. We are currently working on a solution for the Weather app outage and will post an update online here: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/waNYZdXpJm&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/waNYZdXpJm</a> <br /><br />Please send us a Direct Message if you have any additional questions. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://t.co/GDrqU22YpT&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">https://t.co/GDrqU22YpT</a></p>— Apple Support (@AppleSupport) <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/AppleSupport/status/1643263340276326405?ref_src=twsrc%5Etfw&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">April 4, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>Some Macworld staffers have experienced on-and-off issues with the Weather app over the past several weeks. At times, the app is slow to load or doesn’t load at all. Quitting the app and relaunching has been a quick workaround, but even that doesn’t always work. So while Apple has given us the green light (literally, it’s no longer yellow on Apple’s status page) it’s not clear if there isn’t a need for a larger fix to the app. Some reports suggested that an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/04/04/ios-16-4-1-expected-soon/&amp;xcust=1-1-1682239-1-0-0&amp;sref=https://www.macworld.com/feed\">iOS 16.4.1 update</a> could be imminent to fix the underlying issue which has reportedly been cropping up for weeks. Apple doesn’t update its apps independently from the system, so any fix will need to arrive as part of an iOS update.</p>\n\n\n\n<p>Of course, it’s not the end of the world since there are numerous ways to get weather conditions and forecasts on your phone. However, after Apple <a href=\"https://www.macworld.com/article/1440719/dark-app-weather-app-shutting-down-january-1.html\">shuttered the popular Dark Sky app</a> on January 1, the stock iOS Weather app—which picked up many of the Dark Sky features—is likely the go-to source for weather information for many more users. So while it’s working now, we’ll be on the lookout for possible storms on the horizon.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7e818cb00c140be928223d4cb5faafe81d35bfaf2eac663fa39fa60e8a298dd5","category":"Apple"}