{"title":"Evaluation of the Correlation Between Depression Intensity and Inflammation Levels in Patients with Major Depressive Disorder: A Case-Control Study","link":"https://www.preprints.org/manuscript/202407.1951/v1","date":1721836440000,"content":"The primary objective of this study is to determine the existence of a significant correlation between inflammation levels, as measured by inflammatory markers IL-6, IL-1β, and TNF-α, and the severity of depressive symptoms assessed using HAM-D assessment scale. This could provide additional evidence supporting the hypothesis that inflammation plays a notable role in the pathogenesis of depression. The data analysis supports the hypothesis that the biological mechanisms of inflammation contributes to the clinical manifestations of depression. Elevated levels of inflammatory markers, especially interleukins (IL6, IL1β), tumor necrosis factor-alpha (TNFα), and C-reactive protein (CRP) have been identified in patients with major depressive disorder compared to the findings in healthy controls. Materials and Methods: Inflammatory markers (IL-6, IL-1β, and TNF-α) were measured in a sample of 31 patients hospitalized at the Socola Institute of Psychiatry in Iasi, Romania, and compared to a control group with no psychiatric or inflammatory conditions. One of the main objectives is to determine if there is a significant correlation between inflammation levels, measured by inflammatory markers (IL-6, IL-1β, and TNF-α), and the severity of depressive symptoms assessed using HAM-D scores. Conclusions: The study results suggest a significant correlation between inflammation levels measured by inflammatory markers IL-1β and IL-6 and the severity of depressive symptoms evaluated by HAM-D scores in the study group. These findings support the hypothesis that inflammation may play an important role in the development or exacerbation of depressive symptoms. The relationship between inflammation and depression is also influenced by risk and protective factors that require further research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7e8ce95985a01b9d7e7bc5bf12ee1ea53609059989c7977933a737d8107574ea","category":"Interdisciplinary"}