{"title":"Accenture แชร์การปรับตัวธุรกิจ เมื่อเข้าสู่ยุคใหม่ด้วย Generative AI","link":"https://www.blognone.com/node/134693","date":1688566292000,"content":"<div><div><div><p>Accenture บริษัทที่ปรึกษาด้านเทคโนโลยีและธุรกิจ ประกาศเตรียมลงทุน 3 พันล้านดอลลาร์ใน Generative AI เพื่อปรับโฉมองค์กรให้ลูกค้า โดยมีการนำ Data &amp; AI ผลักดันการเติบโตและเพิ่มประสิทธิภาพให้กับลูกค้าในทุกอุตสาหกรรม</p>\n<p>เหตุผลที่ Accenture เริ่มลงทุนใน AI เนื่องจากกระแสที่มาแรงเช่น ChatGPT ทำเห็นโอกาสความสามารถที่หลากหลายในการนำมาใช้พัฒนาธุรกิจ  ซึ่ง Accenture ได้ทำการสำรวจเก็บข้อมูลพบว่า 57% ของผู้บริหาระดับสูงมีแผนจะใช้ ChatGPT เพื่อการเรียนรู้ในปีนี้ และอีก 42% ระบุว่าต้องการลงทุนจำนวนมากใน AI</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5f77e7cb40f9a5a3f7ae37fcd691d2fc.png\" /></p>\n<p>คุณจุน เชียง ลี กรรมการผู้จัดการอาวุโส Data &amp; AI ภูมิภาคเอเชียตะวันออกเฉียงใต้ของเอคเซนเชอร์ได้ให้ข้อมูลเกี่ยวกับ Generative AI พบว่า 100% ของผู้บริหารในไทยรู้สึกได้รับแรงบันดาลอย่างมากกับความสามารถใหม่ๆ ของ AI foundation</p>\n<p>ในส่วนของการนำ AI มาใช้ประโยชน์ ตอนนี้หลายองค์กรวางแผนที่จะทดลองใช้ AI Foundation มาช่วยดำเนินงานต่างๆ ในอีก 3-5 ปีข้างหน้า ซึ่งคาดว่าจะสามารถนำมาใช้ใน Process automation มากถึง 70% รองลงมาคือ Customer Support 69%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/339ede4af9bbab9e639a245dd6f74a42.png\" /></p>\n<p>ทาง Accenture ได้ทำการสำรวจเรื่องเวลาการทำงานและความเป็นไปได้ที่ศักยภาพของ AI จะเข้าไปมีผลในแต่ละธุรกิจทั้ง 19 อุตสาหกรรมในสหรัฐอเมริกาปี 2021 พบว่ามีธุรกิจที่ AI จะเข้าไปมีศักยภาพสูงสำหรับงานด้านอัตโนมัติ (Higher potential for automation) คือ อุตสาหกรรมธนาคาร 54% และประกันภัย 48% แต่ถ้าแยกเป็นอาชีพพบว่า งานประเภทแอดมิน AI จะเข้าไปมีผลสูงถึง 57%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fbcb2a6fe3b21cc90ae836adb19aa0af.png\" /></p>\n<p>Accenture ได้แนะนำ 6 ขั้นตอนสำคัญในการนำ AI ไปปรับใช้สำหรับองค์กร</p>\n<p>1.เริ่มต้นจากคน: บริษัทควรลงทุนและเตรียมคนให้พร้อมกับการใช้ Genertative AI เพื่อสามารถนำมาประยุกต์ใช้ได้จริง</p>\n<p>2.ศึกษาเชิงลึก: ควรเริ่มตั้งแต่ตอนนี้ บริษัทอาจเริ่มด้วยการทดลองกับข้อมูลที่มีความเสี่ยงต่ำและงานที่ต้องใช้ความคิดสร้างสรรค์ พร้อมกับสำรวจว่าเทคโนโลยีจะช่วยสร้างความแตกต่างและนำไปสู่นวัตกรรมใหม่ๆ</p>\n<p>3.มีความรับผิดชอบ: ทุกองค์กรควรมีกรอบกำหนดการใช้ AI ที่ชัดเจน เพื่อบริหารความเสี่ยงและแนวปฏิบัติที่สอดคล้องกับหลักการและกฎหมายที่เกี่ยวข้อง</p>\n<p>4.เตรียมข้อมูลให้พร้อม: สำหรับการใช้งานทางธุรกิจ Generative AI จำเป็นต้องมีข้อมูลอย่างละเอียดเพื่อบริบทในการทำงาน ดังนั้นองค์กรจึงต้องมีแนวทางเชิงกลยุทธ์และระบบในการจัดหา พัฒนา ปรับแต่ง คุ้มครอง และปรับใช้ข้อมูลด้วย</p>\n<p>ตัวอย่างเช่นการที่ Accenture จะนำ AI เข้าไปช่วยพัฒนาธุรกิจมีทั้ง 2 แบบ ทั้ง Generative AI และ Fine-tuning model ที่มีการฝึกโมเดลภาษาเพื่อให้ได้ผลลัพธ์เฉพาะบริษัทนั้น</p>\n<p>5.ลงทุนในพื้นฐานเทคโนโลยีที่ยั่งยืน: บริษัทต่างๆ จำเป็นต้องมีโครงสร้างพื้นฐานด้านเทคนิค, สถาปัตยกรรม, การดำเนินงาน และโครงสร้างการกำกับดูแล เพื่อใช้ในการประมวลผลโมเดลภาษาขนาดใหญ่และในขณะเดียวกันก็ควรดูต้นทุนและการใช้พลังงานด้วย เนื่องจากการประมวลผลของ AI จะมีการปล่อยก๊าซคาร์บอนไดออกไซด์ออกมาด้วย ดังนั้นควรมีการศึกษาและดูแลเรื่องความยั่งยืน</p>\n<p>6.เร่งพัฒนานวัตกรรมในระบบนิเวศ: การสร้างโมเดลพื้นฐานเป็นเรื่องที่ต้องอาศัยต้นทุนและความซับซ้อนสูง และต้องใช้ระบบประมวลผลขนาดใหญ่ ซึ่งอาจจะมีแค่องค์กรขนาดใหญ่เท่านั้นที่ทำได้ ดังนั้น การมีเครือข่ายพันธมิตรที่เหมาะสม จึงเป็นหัวใจสำคัญที่ช่วยให้เกิดการเปลี่ยนแปลงได้อย่างรวดเร็ว</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/accenture\">Accenture</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7e91532997f01262c66f64bb6f31fe6ba739c830ce5b4cdbd1d9fd533313438c","category":"Thai"}