{"title":"Stomatal behaviour and water relations in ferns and lycophytes across habits and habitats","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae041/7717551?rss=1","date":1721433600000,"content":"<span><div>Abstract</div>Stomatal anatomy and behaviour are key to managing gas exchange fluxes, which require coordination with the plant vascular system to adequately supply leaves with water. Stomatal response times and regulation of water loss are generally understudied in ferns, especially across habits (i.e. epiphytic and terrestrial) and habitats (i.e. wet mesic and dry xeric environments). Our objectives were to (i) determine if hydraulic and anatomical traits that control water use are correlated with their habitats (i.e. xeric, mesic) and habits (i.e. epiphytic, terrestrial) for ferns and lycophytes across taxa, and (ii) explore how those traits and others like average leaf water residence time correlate with stomatal function using a subset of closely related species. Epiphytic species had lower vein densities than terrestrial species, while xeric species had higher vein densities than mesic species. Xeric ferns also had smaller stomata than mesic ferns but had similar stomatal densities. Further, in a subset of mesic and xeric ferns, the xeric ferns had higher maximum stomatal conductance and water content, as well as shorter average stomatal opening responses to light intensity, but stomatal closing times did not differ. Finally, shorter stomatal opening and closing responses were correlated with shorter water residence time. Our study highlights anatomical and physiological differences between ferns and lycophytes, which may partially explain habitat preference based on their optimization of light and water.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"7e9b9bcd2b8272ff4e3b0b12e22b2c034f4d42b4a22a11fa0dde3d5c2086dd6e","category":"Environment"}