{"title":"Inside the making of National Geographic’s A Real Bug’s Life docuseries","link":"https://arstechnica.com/?p=1996489","date":1706103934000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/bugslife2TOP-800x533.jpg\" alt=\"closeup of a jumping spider\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/bugslife2TOP.jpg\">Enlarge</a> <span>/</span> A bold jumping spider struggles to survive in New York City in <em>A Real Bug's Life</em>, narrated by Awkwafina. (credit: National Geographic/Jamie Thorpe)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Pixar's 1998 animated film <a href=\"https://en.wikipedia.org/wiki/A_Bug%27s_Life\"><em>A Bug's Life</em></a> celebrated its 25th anniversary last year, and National Geographic decided to mark the occasion with a new science docuseries, <a href=\"https://ondisneyplus.disney.com/show/a-real-bugs-life\"><em>A Real Bug's Life</em></a>, narrated by Awkwafina. As with the Pixar film, the bugs (and adjacent creatures) are the main characters here, from cockroaches, monarch butterflies, and praying mantises to bees, spiders, and even hermit crabs. The 10 episodes tell their stories as they struggle to survive in their respective habitats, capturing entire ecosystems in the process: city streets, a farm, the rainforest, a Texas backyard, and the African savannah, for example.</p>\n<p>The genesis for the docuseries lies in a rumored sequel to the original film. That inspired producer Bill Markham, among others, to pitch a documentary series on a <em>real</em> bug's life to National Geographic. \"It was the quickest commission ever,\" Markham told Ars. \"They said yes literally over a weekend. It was such a good idea, to film bugs in an entertaining family way with Pixar sensibilities.\" And thanks to the advent of new technologies, plus a couple of skilled \"bug wranglers,\" the team captured the bug's-eye view of the world beautifully.</p>\n<p>According to Director of Photography Nathan Small, long tube-like probe lenses enabled the camera crew to capture footage from inside tiny cracks and holes to better document the buggy behavior. They also made better use of macro lenses. \"Before when we had macro lenses, they were all quite long, and the background would be really smooshy with everything out of focus,\" Small told Ars. \"We tried to shoot everything from very low, very wide angles with lots of context, so you can experience the world from the point of view of the animal and see how it sits in its location, rather than just a smooshy background.\"</p></div><p><a href=\"https://arstechnica.com/?p=1996489#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1996489&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7ea000ad0867214e78781c0a8bdf82fa038a2fdfd9e6534f7915663a27235994","category":"Tech"}