{"title":"A full‐scale operational digital twin for a water resource recovery facility—A case study of Eindhoven Water Resource Recovery Facility","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11016?af=R","date":1711350000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a63e37e7-b088-4b8d-b5f8-ccfde3d96536/wer11016-toc-0001-m.png\" alt=\"A full-scale operational digital twin for a water resource recovery facility—A case study of Eindhoven Water Resource Recovery Facility\" />\n<p>The Eindhoven digital twin provides the plant operators and managers with a decision-support tool for real-time plant simulation, calamity detection, and scenario analysis. It includes an automated data preprocessing pipeline, a detailed mechanistic full-plant process model, and an interactive user interface.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Digital transformation for the water sector has gained momentum in recent years, and many water resource recovery facilities modelers have already started transitioning from developing traditional models to digital twin (DT) applications. DTs simulate the operation of treatment plants in near real time and provide a powerful tool to the operators and process engineers for real-time scenario analysis and calamity mitigation, online process optimization, predictive maintenance, model-based control, and so forth. So far, only a few mature examples of full-scale DT implementations can be found in the literature, which only address some of the key requirements of a DT. This paper presents the development of a full-scale operational DT for the Eindhoven water resource recovery facility in The Netherlands, which includes a fully automated data-pipeline combined with a detailed mechanistic full-plant process model and a user interface co-created with the plant's operators. The automated data preprocessing pipeline provides continuous access to validated data, an influent generator provides dynamic predictions of influent composition data and allows forecasting 48 h into the future, and an advanced compartmental model of the aeration and anoxic bioreactors ensures high predictive power. The DT runs near real-time simulations every 2 h. Visualization and interaction with the DT is facilitated by the cloud-based TwinPlant technology, which was developed in close interaction with the plant's operators. A set of predefined handles are made available, allowing users to simulate hypothetical scenarios such as process and equipment failures and changes in controller settings. The combination of the advanced data pipeline and process model development used in the Eindhoven DT and the active involvement of the operators/process engineers/managers in the development process makes the twin a valuable asset for decision making with long-term reliability.</p>\n<h2>Practitioner Points</h2>\n<p>\nA full-scale digital twin (DT) has been developed for the Eindhoven WRRF.\nThe Eindhoven DT includes an automated continuous data preprocessing and reconciliation pipeline.\nA full-plant mechanistic compartmental process model of the plant has been developed based on hydrodynamic studies.\nThe interactive user interface of the Eindhoven DT allows operators to perform what-if scenarios on various operational settings and process inputs.\nPlant operators were actively involved in the DT development process to make a reliable and relevant tool with the expected added value.\n</p>","author":"Saba Daneshgar, \nFabio Polesel, \nSina Borzooei, \nHenrik R. Sørensen, \nRuud Peeters, \nStefan Weijers, \nIngmar Nopens, \nElena Torfs","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"7ea8af29c7070d8129ca43044044031a1d74230f27b0624e7ae89716f31f211a","category":"Environment"}