{"title":"8 things to do instead of watching Paris-Roubaix","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/8-things-to-do-instead-of-watching-paris-roubaix","date":1617984096000,"content":"\n      <p><span>After more on and offs than Ross and Rachel, it’s been official for a while: Paris-Roubaix has been postponed. That means no men’s race and no debut edition for the women this Sunday, so what to do instead? Don’t worry, we’ve got you covered:</span></p>\n<div></div>\n\n<h4><span>Do your own local cobbles ride</span></h4>\n<p>I made my own up in London a few years ago on Paris-Roubaix morning and felt very hardcore, even if it ended up virtually being 15 laps of Wapping. </p>\n<h4>Live in the past</h4>\n<p>Grab drinks and snacks then hunker down to watch a full replay of the 2019 Paris-Roubaix edition. Take in a race from another era: the dust, the drama, the fancy dress, crowds drinking, shouting and hugging, back in a time when corona was only uttered in the supermarket beverage aisle. (A Sunday in Hell is also recommended).</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_2005795_rouba-3_1024x1024.jpg?v=1617979975\" /></p>\n<h4>Sulk</h4>\n<p>Wear head-to-toe black and spend the day sulking. When questioned by family or friends about your foul mood, break silence by exclaiming “You wouldn’t understand!” like an exasperated teenager.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-2021-preview\"><em><strong>Read our full preview of the postponed 2021 Paris-Roubaix</strong></em></a></p>\n<h4>Read</h4>\n<p>Read Emile Zola’s classic Germinal and realise that Paris-Roubaix is still a walk in the park compared to how life used to be in the northern French mining communities through which the race passes. </p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_579856_cycl-173_1024x1024.jpg?v=1617979706\" /></span></p>\n<h4><span>Shower</span></h4>\n<p><span>R</span><span>oll around in the garden, then take a freezing cold shower while your mates crowd in and take photos of you looking depressed. Post on Instagram and wait for the likes to roll in #Roubaixready</span></p>\n<h4>Watch a better race</h4>\n<p>Watch the opening stage of the Presidential Tour of Turkey. (Only joking, the lawn needs mowing.)</p>\n<h4>Buy Rouleur</h4>\n<p>Buy issue <a href=\"https://www.rouleur.cc/products/issue-102-true-grit\">102 of Rouleur</a>. Our True Grit issue, celebrating rough riders and the routes less travelled, is a surefire antidote to the Roubaix blues.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW1_3999_cf729313-7f74-46b6-a71a-5fbc2b639d15_1024x1024.jpg?v=1617980028\" /></p>\n<p><em>Photo credit: Alex Whitehead/SWPix</em></p>\n<h4>Socially Distance</h4>\n<p>Lastly, be sensible – wear a mask and socially distance when required. Doing that, wherever you are in the world, will help to ensure people stay safe and healthy, which is the most important thing.</p>\n<p>And ultimately, that will ensure that this marvellous Monument takes place in its rearranged date - October 2 for the women’s race and October 3 for the men. That’s right, a whole Roubaix weekend. It will be worth the wait.</p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7ea9703699d19953e06df2ea35822777176fae9eaf7aa3c9d8f59f33ca92b069","category":"Cycling"}