{"title":"Exploring the potential of transitioning Malawians from corn to quinoa‐based thick porridge (nsima): insights from sensory and emotions profiles","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13775?af=R","date":1722231306000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Considering the nutritional value and adaptability of quinoa, integrating it into African diets could enhance food and nutrition security, contingent on the acceptability of quinoa-based foods. This study therefore determined consumer acceptability of six stiff porridge (nsima) samples, their sensory profiles, and their emotion profiles. The samples comprised controls made from whole corn flour, dehulled corn flour, and soaked, dehulled corn flour and from 1:1 blends of quinoa and each corn flour type.</p>\n<h2>RESULTS</h2>\n<p>Despite quinoa being unfamiliar, none of the stiff porridge samples prepared using 1:1 blend of quinoa and corn flour was disliked (liking score of ≤4 on a 9-point hedonic scale). Sensory properties and emotions both had significant (<i>P</i> &lt; 0.05) effects on consumer acceptability. When samples were perceived to be bitter, sticky, and thick, there was an overall mean reduction in liking of 2.3, 1.0, and 0.3, respectively. With regard to emotions, the highest positive mean impact of 1.6 was associated with feeling satisfied followed by being happy and nostalgic (1.4). The sensory and emotion profiles of nsima prepared using whole corn flour were like those of quinoa-based nsima samples. However, profiles of nsima samples from dehulled corn, and soaked dehulled corn flour, respectively, were considered ideal.</p>\n<h2>CONCLUSION</h2>\n<p>Quinoa-based nsima can be adopted easily by the current consumers of whole corn flour nsima in Malawi and possibly in other African countries with similar dietary inclinations. However, there is a need to find effective and feasible methods of removing saponin from quinoa to maximize acceptability of the resulting quinoa-based nsima. © 2024 Society of Chemical Industry.</p>","author":"Aggrey Pemba Gama, \nMoses Maliro, \nLimbikani Matumba","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"7eadc511a80ab84f100c7bac0a1b42c2215b5a0b4c92bbf83f8da791cf509d47","category":"Environment"}