{"title":"Nylons with Applications in Energy Generators, 3D Printing and Biomedicine","link":"https://www.preprints.org/manuscript/202404.1274/v1","date":1713519652000,"content":"Linear polyamides, known as nylons, are a class of synthetic polymers with a wide range of applications due to their outstanding properties, such as chemical and thermal resistance or mechanical strength. These polymers have been used in various fields: from common and domestic applications, such as socks and fishing nets, to industrial gears or water purification membranes. By their durability, flexibility and wear resistance nylons have been started to be used in addictive manufacturing technology as a good material choice to get sophisticated devices with precise and complex geometric shapes. Furthermore, the emergence of triboelectric nanogenerators and the development of biomaterials have highlighted the versatility and utility of these materials. In order to enhance the triboelectric performance and the range of applications, nylons show a potential use as tribo-positive materials. Because of the easy control of their shape they can be subsequently integrated into nanogenerators. The use of nylons has also extended into the field of biomaterials, where their biocompatibility, mechanical strength and versatility have paved the way for groundbreaking advances in medical devices as dental implants, catheters and non-absorbable surgical sutures. By means 3D bioprinting nylons have been used to develop scaffolds, joint implants and drug carriers with tailored properties for various biomedical applications. The present paper aims to collect these recently specific applications of nylons by reviewing the literature produced in the last decades, with a special focus on the newer technologies in the field of energy harvesting and biomedicine.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ebc3ac12384dde23f8aab047e8afa9c1729b8d920cc0e6add002c95f93fb26c","category":"Interdisciplinary"}