{"title":"IBM compensates for errors, gets usable results out of quantum processor","link":"https://arstechnica.com/?p=1947845","date":1686770228000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-2-800x450.jpeg\" alt=\"Image of a processor chip split into layers and expanded.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-2.jpeg\">Enlarge</a> <span>/</span> IBM's Eagle processor has reached Rev3, which means lower noise qubits. (credit: <a href=\"https://research.ibm.com/blog/eagle-quantum-processor-performance\">IBM</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Today's quantum processors are error-prone. While the probabilities are small—less than 1 percent in many cases—each operation we perform on each qubit, including basic things like reading its state, has a significant error rate. If we try an operation that needs a lot of qubits, or a lot of operations on a smaller number of qubits, then errors become inevitable.</p>\n<p>Long term, the plan is to solve that using <a href=\"https://arstechnica.com/science/2023/02/google-shows-current-generation-qubits-good-enough-for-error-correction/\">error-corrected qubits</a>. But these will require multiple high-quality qubits for every bit of information, meaning we'll need thousands of qubits that are better than anything we can currently make. Given that we probably won't reach that point until the next decade at the earliest, it raises the question of whether quantum computers can do anything interesting in the meantime.</p>\n<p>In a publication in today's Nature, IBM researchers make a strong case for the answer to that being yes. Using a technique termed \"error mitigation,\" they managed to overcome the problems with today's qubits and produce an accurate result despite the noise in the system. And they did so in a way that clearly outperformed similar calculations on classical computers.</p></div><p><a href=\"https://arstechnica.com/?p=1947845#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1947845&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7ec7f9b3e3aa56fad90b749b8ae4bcb55a69bcaddef5a837f318e1783f81c3c7","category":"Tech"}