{"title":"iPhone 13 Pro review: An obvious update, but not a minor one","link":"https://www.macworld.com/article/450981/iphone-13-pro-review.html","date":1632739500000,"content":"<div>\n<section><div></div></section><div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Blazing fast speed</li><li>ProMotion on iPhone, finally!</li><li>A huge leap in battery life</li></ul></div><div><h3>Cons</h3><ul><li>No always-on display</li><li>No USB-C</li><li>Selfie camera is behind the times</li></ul></div></div></div><h3>Our Verdict</h3><p>The iPhone 13 Pro is absurdly fast, has a killer camera system, the display is fantastic, and the battery life is longer than ever. We have a few nits to pick, but Apple has made it easy to love its latest “Pro” iPhone.</p>\n</div><h3>Price When Reviewed</h3><p>$999 (base model)</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/themes/idg-base-theme/dist/static/img/apple-logo.svg\" /></div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$999</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-iphone/iphone-13-pro&amp;subid1=1-1-450981-2-357731-9934\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Early in the 2021 iPhone rumor lifecycle, it was reported that Apple might call this year’s offering the iPhone 12s. Previous “S” model iPhones —such as the iPhone 6s or iPhone Xs—would generally keep the same design and features of the previous year’s model, with a faster processor, better camera, and a single standout new feature.</p>\n\n\n\n<p>Though Apple didn’t go with iPhone 12s name, it may have been a fitting monicker, at least where the Pro models are concerned. The iPhone 13 Pro is essentially the iPhone 12 Pro with a faster processor, better camera, and one big standout feature (ProMotion).</p>\n\n\n\n<p>But to treat it so reductively is to do it a disservice. The scale of improvements here are noteworthy, and the gap between Pro and non-Pro models is significant. This is essentially the iPhone 12 Pro with ProMotion, a better camera system, faster performance, and better battery life. That’s not a surprising or particularly innovative set of improvements, but it still adds up to one hell of a nice iPhone.</p>\n\n\n\n<h2>Refined design</h2>\n\n\n\n<p>While the iPhone 13 Pro looks a lot like the iPhone 12 Pro at a glance, and indeed is a sort of fraternal twin, there are differences. Some are subtle, others jump right out at you.</p>\n\n\n\n<p>The iPhone 13 Pro and Pro Max are nearly the exact same physical dimensions as the iPhone 12 Pro models they replace. These are heavy phones, just as their predecessors were; a natural side-effect of the stainless steel frame.</p>\n\n\n\n<p>Not much has changed when it comes to durability, not that we’re complaining. The iPhone 13 Pro still carries an IP68 water and dust resistance rating, and is rated for up to 30 minutes at a depth of six meters. It’s got the same Ceramic Shield front glass, too.</p>\n\n\n\n<p>The silver, graphite, and gold colors from last year return, but Pacific Blue has been replaced with Sierra Blue, a much lighter shade that looks nice enough, though I prefer last year’s darker hue.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-pro-camera-compare.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Sierra Blue is a lot brighter than Pacific Blue, and just look at that huge camera bump!</figcaption></figure><p>IDG / Jason Cross</p></div>\n\n\n\n<p>While USB-C is creeping its way through all of Apple’s other products—it’s now the only port on MacBooks, the M1 iMac, iPad Pros, the iPad Air, and iPad mini—the company still <a href=\"https://www.macworld.com/article/538706/no-apple-isnt-dumping-the-iphones-lightning-port.html\">refuses to move the iPhone line to this more universal plug</a>. If you have a bunch of Apple gear, you have Lightning <em>and</em> USB-C charging cables. And for no good reason, really. Come on, Apple. It’s time.</p>\n\n\n\n<p>Speaking of charging, there’s not much new there. You still get a USB-C to Lightning cable in the box but no power adapter or headphones. Charging performance is unchanged: you get up to 50 percent charge in 30 minutes with a 20W USB-C adapter.</p>\n\n\n\n<p>Storage options still start at 128GB, with options for 256GB, 512GB, and now a new 1TB option. That’s an obscene amount of storage for a phone and really only worthwhile if you think you’re going to shoot a <em>lot</em> of video (especially in ProRes format).</p>\n\n\n\n<p>The design changes you will notice right away are the smaller notch and much bigger camera module. The rear camera area is dramatically larger and sticks out further, to the point where you might not actually be able to put your phone on <em>some</em> stands or car mounts without a case that makes the camera bump sit flush. Note that most of Apple’s first-party cases do not!</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-pro-notch-1.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Sure the notch is smaller on the iPhone 13 Pro (right), but without changing the status bar, what’s the point?</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>The notch on the front where the speaker and TrueDepth sensors reside is now 20 percent narrower, which is nice, but the extra screen space is going entirely to waste. You don’t get any additional icons or information in the status bar. Surely Apple <em>must</em> know that everyone wants the battery percentage back, right?</p>\n\n\n\n<p>This year, the iPhone 13 Pro and Pro Max have the exact same camera system and software features, so you don’t have to buy the bigger one to get the better camera. This is the right approach, and we hope Apple continues it in the future.</p>\n\n\n\n<h2>ProMotion finally comes to iPhone</h2>\n\n\n\n<p>The first thing you’ll notice when you pick up an iPhone 13 Pro is just how <em>smooth</em> everything feels. Swipes, scrolls, interface animations…Apple was always good at this stuff, but the responsiveness and smoothness of the iPhone 13 Pro is on another level.</p>\n\n\n\n<p>That’s thanks to a new OLED display that is more power efficient and includes ProMotion technology similar to that found on the iPad Pro. Rather than always refreshing at 60Hz, the display can go as low as 10Hz and as high as 120Hz.</p>\n\n\n\n<p>There are no settings for this; the phone continually adjusts the display refresh based on the content on screen. Play back a 24fps movie and the display will lock to 24Hz. Read static text and it’ll drop to 10Hz. Start scrolling and swiping around and it’ll ramp up to 120Hz.</p>\n\n\n\n<p>Many apps that use standard iOS frameworks for scrolling and full-screen transitions will automatically take advantage of this, looking and feeling smoother as a result. Apps like games will require an update to take advantage of ProMotion, and there are currently some limitations there that don’t exist for iPad developers and will hopefully be lifted in future software updates.</p>\n\n\n\n<p>The upshot of all this is that the display is smoother and faster when it matters most and more power efficient the rest of the time. This has an overall positive impact on battery life, which we’ll get to later.</p>\n\n\n\n<p>The display is brighter, too: it goes up to 1,000 nits in standard use, up from 800 on the iPhone 12 Pro (the max is still 1,200 nits for HDR content). We’ve had some very bright and hot days here in Sacramento lately and you can clearly see the difference out in direct sunlight. In other circumstances, the screen looks just like the excellent iPhone 12 Pro display.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-brightness-compare.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>In bright sunlight, the brighter display of the iPhone 13 Pro (right) makes it easier to read.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>Enthusiasts have been begging for ProMotion on the iPhone ever since it landed on the iPad Pro four years ago. It’s just as good as we’ve always expected, and a clear differentiator between the Pro and standard iPhone 13. Now it just needs to come to the MacBook Pro and iMac!</p>\n\n\n\n<h2>The fastest smartphone money can buy</h2>\n\n\n\n<p>The A14 found in last year’s iPhone 12 is faster than any processor found today in any Android smartphone. No Qualcomm Snapdragon or Samsung Exynos can come close to <em>last year’s</em> best chip from Apple.</p>\n\n\n\n<p>And now the A15 is faster. In some ways, <em>much</em> faster.</p>\n\n\n\n<p>Like the A14, the A15 is made with a 5nm manufacturing process from TSMC, and still sports two high-performance cores and four high-efficiency cores. Nonetheless, in our benchmark tests we found the A15 delivers about 8-10 percent faster single-core CPU performance, and 15-20 percent better multi-core CPU performance.</p>\n\n\n\n<div><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com/667f5cc6-579d-41cb-b378-381e0dafd355&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iPhone 13 Pro Geekbench 5</a><br /><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Infogram</a></div>\n\n\n\n\n<p>The GPU is where things get really interesting. In the iPhone 13 and iPhone 13 mini, the A15 still has a four-core GPU. In the iPhone 13 Pro and Pro Max, however, it’s got a <em>fifth</em> core. That 25 percent increase in GPU cores makes it around 20-30 percent faster than the iPhone 13, and 40-50 percent faster than the iPhone 12 when it comes to 3D graphics and GPU compute tasks.</p>\n\n\n\n<div><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com/8f37f6fb-ac0e-4f2a-bc83-783dc9fba0a0&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iPhone 13 Pro 3DMark Wild Life</a><br /><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Infogram</a></div>\n\n\n\n\n<p>Put another way: The A15 with a four-core GPU cores delivers performance around 10-15 percent higher than the four-core GPU in the A14, and the A15 with a fifth core is 20-30 percent faster than that. It really separates the iPhone 13 from the iPhone 13 Pro.</p>\n\n\n\n<p>Apple has made other improvements, too. There are power efficiency tweaks across the board, including in stuff like wireless radios. The image signal processor is upgraded, as is the video encoder and decoder (we hope it supports AV1). The Neural Engine has 16 cores, just like that in the A14, but it can do almost 16 trillion operations per second, up from 11 trillion.</p>\n\n\n\n<p>Will you even notice all this speed? For most of the things you use your iPhone for, no. When last year’s processor is faster than the competition and this-year’s processor is even faster, what do you even <em>do</em> with that? Most people use their phones for things like web browsing, email, texting, and apps that essentially scroll lists of images and text (Twitter, Instagram, Facebook). A ProMotion display helps with all that, but a faster processor doesn’t necessarily make much difference.</p>\n\n\n\n<p>It will probably be a few years before the applications and iOS features that really push the A15 are commonplace. All this performance is as much about longevity as it is about making your life better today.</p>\n\n\n\n<h2>Crazy-good battery life</h2>\n\n\n\n<p>The case for more smartphone performance can sometimes be hard to make. Millions of people use phones that are two or three years old and think they’re plenty fast for everything they do. If they need a new phone, they’re more concerned with it being affordable than it being a lot faster.</p>\n\n\n\n<p>But ask anyone, anywhere, with any smartphone, if they want longer battery life, and answer is yes. Yes, of course yes, <em>always yes</em>.</p>\n\n\n\n<p>Consider, then, that the iPhone 13 Pro gives you both. It’s fast enough to embarrass every other smartphone, and it lasts <em>way</em> longer than previous iPhones.</p>\n\n\n\n<p>To start with, Apple simply put higher-capacity batteries in the entire iPhone 13 line. While the company doesn’t disclose specifics, regulatory filings show that the iPhone 13 Pro has a battery with about 11-percent more capacity than the iPhone 12 Pro, and the iPhone 13 Pro Max’s battery holds around 18-percent more charge.</p>\n\n\n\n<p>The non-Pro iPhone 13 models have larger batteries as well, but they don’t have the more efficient LPTO OLED display nor ProMotion, which is a battery saver. Just as running the display at 120Hz eats through your battery faster, running it <em>below</em> 60Hz will conserve it.</p>\n\n\n\n<p>The results are phenomenal. We run our battery test with the display set to a constant 200 nits while looping the Geekbench 4 battery rundown test, which puts significant strain on the CPU and GPU. The iPhone 13 Pro lasted 9 hours 15 minutes, an impressive 35 percent longer than the iPhone 12 Pro. It’s even longer than the iPhone 12 Pro Max (8 hours 41 minutes)!</p>\n\n\n\n<div><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com/d4328b52-f94b-4cca-bd50-34a9bee08946&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iPhone 13 Pro battery</a><br /><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://infogram.com&amp;xcust=1-1-450981-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Infogram</a></div>\n\n\n\n\n<p>My regular daily use has me just as impressed and the benchmarks. At the point where my iPhone 12 Pro would hit 20 percent and flash the low battery warning, the iPhone 13 Pro often shows 40 percent or more remaining. It’s extremely difficult to do an accurate comparison of real-world use, but I estimate that I’m getting about two hours more screen-on time.</p>\n\n\n\n<p>If you’re coming from an older iPhone, you’re going to be <em>shocked</em> at how long the battery lasts. The iPhone 13 Pro is a big step up from the iPhone 12, but Apple has been steadily marching forward with battery life for years. The iPhone 13 Pro lasts about 50 percent longer than the iPhone 11, and twice as long as the iPhone Xs introduced just three years ago.</p>\n\n\n\n<h2>A significantly better camera</h2>\n\n\n\n<p>The iPhone 13 Pro has an improved camera system, because of course it does. Every new iPhone does. The iPhone 13 Pro brings significant improvements to both camera hardware and software processing.</p>\n\n\n\n<p>On the hardware side, there are all new sensors. You’ll notice the <em>huge</em> camera bump on the back, far larger than that on the iPhone 12 Pro. That’s your first clue that things have changed a lot.</p>\n\n\n\n<p>The telephoto camera has been increased from 2x to 3x, or an equivalent focal length of 77mm. That means the aperture narrows from f/2.0 to f/2.8 and you lose a bit of low light performance, but it’s a great change overall. It means better portraits with a nicer natural bokeh, rather than the fake bokeh of Portrait Mode on the iPhone 13. It gets you closer to distant subjects more naturally, without grainy digital zoom. And that slightly worse low light performance is partially negated by the fact that you can now shoot Night Mode shots with the telephoto camera.</p>\n\n\n\n<p>The “sweet spot” for professional portrait photography is generally in the 85-105mm focal length range, so this new 77mm 3x telephoto lens gets us much closer to that flattering perspective.</p>\n\n\n\n<figure><div><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone12tele.jpeg?quality=50&amp;strip=all\" /><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone13tele.jpeg?quality=50&amp;strip=all\" /></div><figcaption>The iPhone 13’s 3x telephoto (right) gets you a lot closer, and produces more natural portraits.</figcaption></figure><p>The standard wide camera, where most people do most of their shooting, now has a much larger sensor. The resolution is still 12 megapixels, but the pixels are bigger at 1.9 microns and the aperture is a wider f/1.5. Apple says it captures 2.2x more light, and while I can’t attest to that, I’ve noticed it does a better job with detail and color in low light, and seems to sometimes take Night Mode shots more quickly.</p>\n\n\n\n<p>The Ultra-Wide camera has a wider f/1.8 aperture and performs better in low light, but the real trick is how well it focuses up close for macro shots. Move any other iPhone closer than about 4 inches from your subject and it becomes a blurry mess, but the iPhone 13 Pro takes macro shots with ease. The minimum focal distance for the Ultra-Wide camera is only two centimeters, so you can push the camera right up close to that flower, bug, jewelry, or miniature.</p>\n\n\n\n<figure><div><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone12-macro.jpeg?quality=50&amp;strip=all\" /><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone13macro.jpeg?quality=50&amp;strip=all\" /></div><figcaption>The minimum focus distance of the iPhone 12 Pro (left) doesn’t come close to the iPhone 13 Pro (right).</figcaption></figure><p>In Photo mode, the camera automatically shits to Ultra-Wide when you get up close, while tying to maintain relative framing. Macro shots work in video too, even slo-mo, but you have to switch to the Ultra-Wide manually.</p>\n\n\n\n<p>Macro shots aren’t a specific mode, just a natural capability of the Ultra-Wide camera, so there’s nothing to set or enable (though Apple says it will add an option to manually switch it out it in a future iOS 15 update). Just push your iPhone way up close and get detailed shots like never before. This is one of those things that tons of people will make use of, all the time. It was a big limitation of smartphones in general, and it requires no special knowledge or settings to use. It’s also only on the iPhone 13 Pro models—the ultra-wide camera on the regular iPhone 13 doesn’t have the super-tight focal distance.</p>\n\n\n\n<p>For a few years now, the “Pro” model iPhones have been the only place to get a telephoto camera and the main differentiator. But with the tighter 77mm zoom, the larger Wide sensor, and the Ultra-Wide’s wider aperture and macro capability, the camera system on the iPhone 13 Pro even further separates it from the iPhone 13.</p>\n\n\n\n<p>Once again, the Pro models come with LiDAR and the non-Pro models don’t. This helps AR apps perform better and provides quicker and more accurate autofocus in poor lighting conditions, plus enabled Portrait Mode and Night Mode at the same time. It’s disappointing that Apple still hasn’t done anything really impressive or groundbreaking with LiDAR yet.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-selfie.jpeg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The selfie camera is perfectly fine, but it hasn’t really changed since the iPhone 11. </figcaption></figure><p>IDG</p></div>\n\n\n\n<p>The front camera has <em>not</em> changed. It’s the same 12MP, f/2.2 selfie camera you’ll find on the iPhone 12. You get the better image processing, can use Photographic Styles, and can shoot in Cinematic mode, but the hardware hasn’t changed at all.</p>\n\n\n\n<h2>New photo and video tricks</h2>\n\n\n\n<p>Photographic Styles? Cinematic mode? Yes, the improved image processor in the A15 enables better image processing (Apple calls it Smart HDR 4) but the iPhone 13 has picked up a couple new software tricks as well.</p>\n\n\n\n<p>Tap the little down arrow in the Camera app to show adjustment controls, and you’ll find a new one: Photographic Styles. Swipe to change the style between Standard, Rich Contrast, Vibrant, Warm, and Cool styles. You can further customize the warmth and tone within each style.</p>\n\n\n\n<p>Apple is careful to note that this isn’t simply a filter. Instead of a constant change applied evenly to an entire image, the style is part of the complex computational photography steps that produce your final image from multiple exposures. It’s applied differently to different parts of the scene, so a more vibrant style might make the sky more blue, but it won’t create an unnatural cartoon skin tone.</p>\n\n\n\n<p>Just choose one you like, tweak it you suit you, and it will be applied to all your images even after you close and reopen the Camera app. I think this is a feature everyone can appreciate. If you find the iPhone’s camera produces cold and sterile whites, you can warm them up. If you like the punchier colors of Samsung’s cameras, you can imitate that. You can create a “default” camera experience that suits you, with results that are more natural than a standard filter.</p>\n\n\n\n<p>Cinematic mode is maybe less useful for your average iPhone user. It’s a whole new video mode that shoots at 1080p and 30 frames per second in Dolby Vision HDR, and requires a decent amount of light to work (you’ll get a warning if you try to shoot where it’s too dark). In this mode, the iPhone 13 will use AI to identify the subject in your video in order to automatically perform “focus pulling.”</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/iphone-13-pro-in-hand-back.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>You don’t have to inspect the iPhone 13 Pro to see how much bigger the camera array is.</p></figcaption></figure><p>IDG / Jason Cross</p></div>\n\n\n\n<p>That’s a cinematic term for changing the focus throughout a shot to keep a subject in focus, or two switch focus between the foreground and background. It’s such a common technique in film and TV that you probably don’t even really recognize it’s happening. Cinematic mode does this automatically, and works surprisingly well, and the metadata for the focal distance is saved with the video so you can go back in later to adjust focus targets as you edit.</p>\n\n\n\n<p>Currently, Cinematic mode videos have to be edited on an iPhone, but support is coming to iMovie and Final Cut Pro later this year. And if you AirDrop the video or send it in an iMessage or whatever, your focus options will be baked into a standard video file format.</p>\n\n\n\n<p>It’s a fun mode to play around with, but the lack of support in third-party video editing software and the limited resolution and frame rate make it more of a toy than a serious tool. It’s going to be a big hit for TikTok stars and others who create smartphone-centric video designed for social media, but your average user is probably better off shooting regular video in 4K for now.</p>\n\n\n\n<p>Both Photographic Styles and Cinematic mode are also found in the regular iPhone 13, but the iPhone 13 Pro does get one exclusive new video feature: the ability to shoot directly in the ProRes video format, after a software update later this year. ProRes is what they call an “intermediate format” meant for video editing, intended to preserve the best quality through the edit pipeline at the expense of huge file sizes. It’s not meant as a way to actually consume or distribute video, so if you’re not a video editor who already works in ProRes you shouldn’t concern yourself with it. ProRes will be limited to 4K at 30fps, except on the 128GB iPhone 13 Pro where it will be limited to 1080p.</p>\n\n\n\n<p>Shooting photos in the ProRAW format is still limited to the iPhone 13 Pro and Pro Max, just as it was limited to the iPhone 12 Pro models.</p>\n\n\n\n<h2>Wireless is more or less the same</h2>\n\n\n\n<p>If you live in the U.S., you’ll not notice a significant change in wireless features or performance over the iPhone 12. The iPhone 13 line now supports additional 5G bands that are mostly of concern to those in other countries, and Apple says its wireless hardware is more power efficient.</p>\n\n\n\n<p>But here in the U.S. you should get similar 5G support (sub-6 GHz and mmWave), Wi-Fi 6 throughput (not Wi-Fi 6E as was previously rumored), Bluetooth 5, Ultra Wideband, and NFC with reader mode.</p>\n\n\n\n<h2>What does “Pro” even mean anymore?</h2>\n\n\n\n<p>I can’t really tell what Apple means by “Pro” these days. The Mac Pro, iMac Pro, Pro Display XDR, and MacBook Pro seem aimed at actual professionals—those who use the device for the work they do and have specific performance and feature requirements. The AirPods Pro, on the other hand, are just the better AirPods. I don’t think even Apple would claim they deliver the the fidelity needed for professional audio work.</p>\n\n\n\n<p>The iPhone “Pro” models lie somewhere in-between. A 1TB storage option is definitely a Pro feature, as is the ability to shoot ProRAW photos and ProRes video. Most consumers shouldn’t care about that stuff. On the other hand, features like the ProMotion display would be appreciated by everyone, especially since it improves battery life. Pros aren’t the only ones who want a telephoto camera, and they <em>definitely</em> aren’t the only ones who want to take macro photos.</p>\n\n\n\n<p>Whatever meaning of “Pro” you ascribe to this particular Apple product, it’s unsurprisingly the best iPhone yet and one of the best smartphones money can buy. We have nits to pick: It’s time for the selfie camera to get an upgrade, Apple needs to embrace USB-C on iPhone, we still want an always-on display mode, and that enormous camera bump might cause minor issues with a few stands and mounts. But a product doesn’t have to be flawless to be the best, and that’s exactly what this is.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7ec92972d21ff98ecbdb4ca01b7ba28febc138160e7912a95a4b313279a71e41","category":"Apple"}