{"title":"Effects of water, energy, and food security on household well-being","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307017","date":1720706400000,"content":"<p>by Foster Awindolla Asaki, Eric Fosu Oteng-Abayie, Franklin Bedakiyiba Baajike</p>\r\n\r\nWater, energy, and food insecurity are significant challenges that affect both economies and households, particularly in developing countries. These resources have an effect on households wellbeing, businesses, and all sectors of the economy, making them critical to ensuring household well-being, which is frequently measured by quintile welfare. As a result, there has been a significant increase in interest in securitizing these resources in order to mitigate their negative effects on household’s wellbeing This study provides an empirical investigation of the determinants of water, energy, and food (WEF) security and the effect of water, energy, and food security on household well-being in Ghana. This study provides an empirical investigation of the determinants of water, energy, and food (WEF) security and the effect of water, energy, and food security on household well-being in Ghana. The study used a sample of 2,735 households from the Ghana Living Standard Survey (GLSS) Wave 7. We applied an instrumental variable probit, complementary log-log and ordered Probit estimation techniques for analysis. Empirical analysis reveals several important findings. Firstly, factors such as age, credit access, household location, employment status, and livestock ownership positively contribute to household water security, while remittances, water supply management, water bills, and water quantity have negative impacts. Secondly, age, marital status, household size, remittances, and livestock ownership significantly influence household energy security. Thirdly, marital status, household income, credit access, and household size are crucial determinants of household food security, with residence and region of household location exerting negative effects. Additionally, while water and energy security have a relatively lower impact on household well-being, food security emerges as a key driver in promoting household wellbeing. The study recommends that policymakers and stakeholders design and implement robust programs and interventions to sustain households’ water, energy, and food supply.","author":"Foster Awindolla Asaki","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7ecd187de00d5559ffe644e1225fe412457830fbc60c80d8ddd51fd9151e7e6c","category":"Interdisciplinary"}