{"title":"Future MacBook Could Feature Removable Key That Works as a Mouse","link":"https://www.macrumors.com/2021/08/19/macbook-could-feature-removable-key/","date":1629387168000,"content":"Apple is researching a MacBook keyboard that features a removable key to be used as a precision mouse, according to a newly published patent application.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/removable-key-patent-1.jpg\" />\r\n<br />\r\nThe patent application, first spotted by <a href=\"https://www.patentlyapple.com/patently-apple/2021/08/apple-invents-a-deployable-key-mouse-for-a-compact-macbook-keyboard-design.html\"><em>Patently Apple</em></a>, is titled \"<a href=\"https://appft.uspto.gov/netacgi/nph-Parser?Sect1=PTO2&amp;Sect2=HITOFF&amp;u=%2Fnetahtml%2FPTO%2Fsearch-adv.html&amp;r=31&amp;f=G&amp;l=50&amp;d=PG01&amp;p=1&amp;S1=(%22Apple+Inc%22.AANM.)&amp;OS=AANM/%22Apple+Inc%22&amp;RS=AANM/%22Apple+Inc%22\">Deployable Key Mouse</a>\" and was filed with the U.S. Patent and Trademark Office.\r\n<br />\r\n\r\n<br />\r\nThe filing envisages a standard-looking MacBook scissor-system keyboard that features a hidden removable key. This key would contain a position sensor to be used as a pointing device. Apple describes the system as providing a \"comfortable, portable, and precise pointer input for a computer input system.\"\r\n<br />\r\n\r\n<br />\r\nThe filing explains that some precise tasks, such as graphic design, computer-assisted design and modeling, and editing large and complex documents, are better suited to a handheld mouse than a trackpad. Apple acknowledged that carrying a separate mouse with the computer can be a burden and may be \"redundant when the computer already has built-in pointing devices.\"\r\n<br />\r\n\r\n<br />\r\nThe removable key is a viable solution to this issue, according to Apple. In some embodiments, the key would be able to work as normal on the keyboard when it is not deployed and feature a small battery.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/removable-key-patent-2.jpg\" />\r\n<br />\r\nApple outlined various mechanical systems to facilitate the removable key, including sliding a single or set of multiple keys out of the housing vertically, as well as sliding a key out from the side of the machine horizontally. The patent's illustrations showed the deployable key located toward the edge of the keyboard so that it would not be a key that sees frequent use.\r\n<br />\r\n\r\n<br />\r\nPatent filings cannot be taken as evidence of Apple's immediate plans, but they do indicate areas of interest for the company and what it is considering developing behind the scenes. While the prospect of a removable key may seem like an outlandish potential MacBook feature, it may be less obtrusive than other unusual features such as the Touch Bar and could appeal to certain pro-users who require maximum portability but could still benefit from occasional precise input.<div>Tag: <a href=\"https://www.macrumors.com/guide/patent/\">patent</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/19/macbook-could-feature-removable-key/\">Future MacBook Could Feature Removable Key That Works as a Mouse</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/future-macbook-could-feature-removable-key-that-works-as-a-mouse.2308044/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6Wwj33g-ICs:jMfodCbyL1E:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6Wwj33g-ICs:jMfodCbyL1E:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/6Wwj33g-ICs\" />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7ecd186dd74fbe38904f78ffed658e1a3a4f786aede39ba19a41b7c0335cffb9","category":"Apple"}