{"title":"Bloomberg อ้างเอกสารของ Juniper ระบุแฮกเกอร์จีนรู้ช่องโหว่การเข้ารหัส Dual EC ที่ NSA ผลักดันให้ใช้งาน","link":"https://www.blognone.com/node/124563","date":1630599408000,"content":"<div><div><div><p>ในปี 2015 ทาง Juniper ได้รายงานช่องโหว่ของ ScreenOS ที่ใช้เชื่อมต่อ VPN ระหว่างองค์กรจำนวนมาก โดยช่องโหว่ที่เปิดเผยออกมามีทั้ง<a href=\"https://www.blognone.com/node/76042\">รหัสผ่านแบบฮาร์ดโค้ด</a> และ<a href=\"https://www.blognone.com/node/76092\">ช่องโหว่ของกระบวนการเข้ารหัส Dual EC</a> วันนี้ทาง Bloomberg ก็ออกมาระบุว่ากระบวนการเข้ารหัสนี้มีช่องโหว่จริง และกลุ่มแฮกเกอร์ APT 5 ที่เกี่ยวข้องกับรัฐบาลจีนก็ใช้ช่องโหว่นี้เป็นเวลานาน</p>\n<p>Dual EC เป็นระบบการสร้างค่าสุ่มเทียม<a href=\"https://www.blognone.com/node/48503\">ที่เสนอโดย NSA</a> และพยายามบีบให้ NIST ใส่ไว้เป็นมาตรฐานการเข้ารหัส โดยหากมีคนที่รู้กุญแจลับของค่าคงที่ที่ใช้งานใน Dual EC ก็จะถอดรหัสการเชื่อมต่อได้ทั้งหมด หลังจาก NSA ผลักดันกระบวนการเข้ารหัสจนเป็นมาตรฐานสำเร็จแล้ว กระทรวงกลาโหมสหรัฐฯ ก็บีบให้ผู้ผลิตต้องอิมพลีเมนตร์การเข้ารหัสนี้ในอุปกรณ์ของตัวเองไม่เช่นนั้นจะขายสินค้าให้รัฐบาลสหรัฐฯ ไม่ได้</p>\n<p>Bloomberg อ้างเอกสารการสอบสวนภายในของ Juniper ระบุว่ากลุ่ม APT 5 ขโมยกระบวนการถอดรหัสออกไปจาก NSA ได้ตั้งแต่ปี 2012 จนสามารถถอดรหัสการเชื่อมต่อ VPN ที่วิ่งผ่าน NetScreen ของ Juniper ได้ในที่สุด และในปี 2014 ก็ใช้ช่องโหว่นี้เจาะเข้าไปยัง Juniper เพื่อเติมรหัสผ่านแบบฮาร์ดโค้ดทำให้สามารถแฮกองค์กรอื่นๆ ได้ง่ายขึ้น จนกระทั่งมีนักวิจัยมาพบช่องโหว่นี้ภายหลัง</p>\n<p>หากเรื่องนี้เป็นจริงก็นับเป็นบทเรียนราคาแพงของ NSA ที่พยายามสร้างช่องโหว่ในสินค้าความปลอดภัยเพื่อเปิดทางให้ตนเองเข้าไปสอดส่องข้อมูลได้ แต่กลับเป็นการเปิดช่องโหว่ให้หน่วยงานชาติอื่นๆ เช่นกัน แม้จนทุกวันนี้ NSA ยังไม่เคยยอมรับว่า Dual EC เป็นกระบวนการสร้างค่าสุ่มที่วางช่องโหว่เอาไว้ <a href=\"https://www.blognone.com/node/69861\">แต่ NIST ก็ถอดกระบวนการนี้ออกจากมาตรฐานความปลอดภัยหลัง Snowden เปิดเผยเอกสารออกมา</a></p>\n<p>กระทรวงการต่างประเทศจีนปฎิเสธความเกี่ยวข้องกับการแฮก Juniper ครั้งนี้ระบุว่ารัฐบาลจีนไม่เห็นด้วยกับกล่าวหาจีนโดยไม่มีหลักฐาน และที่ผ่านมารัฐบาลสหรัฐฯ นั้นแฮกระบบและแอบดักฟังข้อมูลเป็นวงกว้างเสมอมา</p>\n<p>ที่มา - <a href=\"https://finance.yahoo.com/news/juniper-breach-mystery-starts-clear-130016591.htmlhttps://finance.yahoo.com/news/juniper-breach-mystery-starts-clear-130016591.html\">Yahoo! News (Bloomberg)</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/575b3eb8d11277ad59f38566b887caf5.jpg\" /></p>\n<p>โลโก้ล้อเลียนโลโก้ NSA <a href=\"https://www.flickr.com/photos/electronicfrontierfoundation/40091396832\">โดย EFF</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/nsa\">NSA</a></div><div><a href=\"/topics/juniper\">Juniper</a></div><div><a href=\"/topics/china\">China</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7ed8f3b59017b5c9ee63412c28fd0cecf404db3f0506813580d8805810bd5464","category":"Thai"}