{"title":"Simulation of the Necessary Macro TFP Growth and its Feasible Dual Circulation Source Pathways to Achieve China Economic Vision Goal: A Dynamic CGE Study","link":"https://www.preprints.org/manuscript/202408.0456/v2","date":1723770452000,"content":"An ambitious per capita GDP target has been envisioned by the Chinese government since 2020 to project its sustainable economic growth rate by 2035. Can China fully achieve its goal? This is a question worth investigating. By inserting relevant TABLO modules of the final goods trade, the intermediate goods trade, and factor-strengthening technology spillovers, along with technology absorption thresholds effects of the global value chain, this study builds a global dynamic recursive computational general equilibrium (CGE ) model on basis of GTAP-RD. This approach allows considering the 'dual circulation' system strongly advocated and pointed out as the sole way to realize China’s technological (total factor productivity (TFP)) progress by the Chinese government, which integrates both domestic internal and international external circulations (trade and foreign direct investment (FDI)). We simulate China's technological progress under eight scenarios, and use the latest GTAP Version 11 production and trade data (released in April 2023) for 141 countries and regions and results are aggregated into 10 countries groups with 9 activity sectors and 10 commodities. Main conclusions are as follows: (1) If China maintains its trade opening policy, the 2035 vision goal can be achieved, with external circulation being more important than internal circulation for technological spillovers. (2) The economic growth impacts of external and internal circulation operate relatively independently. However, FDI provides a relatively larger synergistic effect for all forms of external trade circulation than to the internal one. Regarding factor-strengthening effects, spillovers are more favorable to 'capital' than to labor factors. (3) We find that the Regional Comprehensive Economic Partnership Agreement is the most important strategic partner for China. (4) It appears that FDI is not an effective way to lift the productive services sector's total factor productivity (TFP), and more realistic for China is to open up the productive services market more widely, as its efficiency is a pivotal reflection of China's independent innovation capability. (5) China–US decoupling has an enormous global impact. In all the Scenarios we consider, the United States is always the country that loses the most, and Europe would be the group of countries that benefits when there is a large increase in TFP in the US.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ee55ad14d50b00aaf6b98e1086e1ece7a5afaef826151ec94a57a83e742cf7f","category":"Interdisciplinary"}