{"title":"Netflix Gains Six Million Subscribers After Password Sharing Crackdown","link":"https://www.macrumors.com/2023/07/19/netflix-gains-six-million-subscribers-q2-2023/","date":1689806688000,"content":"Netflix earlier this year began <a href=\"https://www.macrumors.com/2023/05/24/netflix-starts-password-sharing-crackdown/\">cracking down on password sharing</a> in the United States and other countries, and the effort has been successful, the company said today. Netflix gained 5.9 million new global subscribers in the second quarter of 2023, including more than one million in the U.S. and Canada, according to its most recent earnings report [<a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q2/FINAL-Q2-23-Shareholder-Letter.pdf\">PDF</a>].\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/Netflix-Smaller-2.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nBased on these results, Netflix will now roll out paid sharing to \"almost all\" remaining countries where the new policies have not yet been enacted. Netflix eliminated multi-household password sharing in the United States in May, a move that immediately <a href=\"https://www.macrumors.com/2023/06/09/netflix-password-crackdown-subscriber-increase/\">caused signups to surge</a>.\r<br />\n\r<br />\nAccording to Netflix, revenue is up in every region where paid sharing was introduced, and sign-ups have exceeded cancelations. The company saw revenue growth of 2.7 percent year over year. Going forward, Netflix expects revenue growth to accelerate further as it begins to see the full benefits of paid sharing and additional adoption of its ad-supported plan.\r<br />\n\r<br />\nFor years, Netflix allowed subscribers to share their accounts with people outside of their direct household, but that is no longer allowed. All people who access a Netflix account must live in the same location, with Netflix restricting access based on IP and other location data. Netflix provided tools to allow those sharing accounts to sign up for their own accounts.\r<br />\n\r<br />\nNetflix claimed that more than 100 million households were sharing accounts, impacting its ability to \"invest in and improve Netflix\" for paying members.<div>Tag: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/19/netflix-gains-six-million-subscribers-q2-2023/\">Netflix Gains Six Million Subscribers After Password Sharing Crackdown</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/netflix-gains-six-million-subscribers-after-password-sharing-crackdown.2396365/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7eeea2312174ddf5eaaf3c172f0cceb50579b103c8e6c4805c77c5e6f4423105","category":"Apple"}