{"title":"Gustatory-Visual Interaction in Human Brain Cortex: fNIRS Study","link":"https://www.preprints.org/manuscript/202407.0878/v1","date":1720684850000,"content":"Background: many studies, on for example taste-visual dissonance, have shown that the influence of the visual cortex on taste sensation is enormous. The aim of the presented work is to investigate, using fNIRS, whether a taste stimulus, in this case the taste of bitter, also causes stimulation of the visual cortex in fNIR study. Methods: 51 participants (204 examinations, 9 996 records) were examined with fNIRS, which collects signals from whole left hemisphere. Differences between the maximum and minimum changes in oxyHb concentrations (ΔoxyHb) for the areas of the brain cortex considered responsible for recording visual and gustatory signals were analyzed. Protocol I, II, III and IV – activation with distillate water, coffee with lower concentration, reference (no stimulation) and coffee with higher concentration respectively, were used. Results: We recorded high signals for teste activation on channels covered gustatory cortex, which confirms the correctness of the choice of research method. What seems important, and somewhat surprising, is the fact that we also received high signals for the channels 45-49, which cover the visual cortex. The statistical analysis does not show any statistical differences between the protocols I, II and IV (different taste activation – water, coffee A and coffee B) for specific channels. As a results of the analysis of the correlation between the subjective bitterness assessment solutions, and the signal ΔoxyHb height, it was observed that statically important correlation, although weak, occurs only for 14 and gustatory channels, only for coffee with a higher concentration. Additionally we recorded the only statistically significant difference between women and men for protocol I (water), where the ΔoxyHb signal was twice as high for women. Conclusions: In conclusion, we can clearly state that the senses of sight and taste work closely together. Moreover, this cooperation is not one-sided - not only the visual activation affects the perception of taste, but interestingly, the taste stimulus can generate a hemodynamic response - activity in the visual cortex.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7ef06858e84abb9b111edf8d44266a1b8c8905fe7e05dd4ff35bc089449b6895","category":"Interdisciplinary"}