{"title":"How renal toxins respond to renal function deterioration and oral toxic adsorbent in pH‐controlled releasing capsule","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24248?af=R","date":1712214000000,"content":"<h2>Abstract</h2>\n<p>The number of patients with chronic kidney disease (CKD) is increasing. Oral toxin adsorbents may provide some value. Several uremic toxins, including indoxyl sulfate (IS), p-cresol (PCS), acrolein, per- and poly-fluoroalkyl substances (PFAS), and inflammation markers (interleukin 6 [IL-6] and tumor necrosis factor [TNF]-alpha) have been shown to be related to CKD progression. A total of 81 patients taking oral activated charcoal toxin adsorbents (AC-134), which were embedded in capsules that dissolved in the terminal ileum, three times a day for 1 month, were recruited. The renal function, hemoglobulin (Hb), inflammation markers, three PFAS (PFOA, PFOS, and PFNA), and acrolein were quantified. Compared with the baseline, an improved glomerular filtration rate (GFR) and significantly lower acrolein were noted. Furthermore, the CKD stage 4 and 5 group had significantly higher concentrations of IS, PCS, IL-6, and TNF but lower levels of Hb and PFAS compared with the CKD Stage 3 group at baseline and after the intervention. Hb was increased only in the CKD Stage 3 group after the trial (<i>p</i> = .032). Acrolein did not differ between the different CKD stage groups. Patients with improved GFR (responders) (about 77%) and nonresponders had similar baseline GFR. Responders had higher acrolein and PFOA levels throughout the study and a more significant reduction in acrolein, indicating a better digestion function. Responders had higher acrolein and PFOA levels throughout the study and a more significant reduction in acrolein, while PFOA increased in responders. Both the higher PFOA and lower acrolein may be related to improved eGFR (and possibly to improvements in proteinuria, which we did not measure. Proteinuria is associated with PFAS loss in the urine), AC-134 showed the potential to improve the GFR and decrease acrolein, which might better indicate renal function change. Future studies are needed with longer follow-ups.</p>","author":"Wen‐Sheng Liu, \nShih‐Shin Liang, \nMei‐Mei Cheng, \nMing‐Tsan Wu, \nSzu‐Yuan Li, \nTien‐Tien Cheng, \nTsung‐Yun Liu, \nChing‐Yao Tsai, \nYen‐Ting Lai, \nChien‐Hung Lin, \nHsiang‐Tsui Wang, \nHan‐Hsing Tsou","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7ef9a6d12b42b289ec7b696af3d2cf6caad64671a004e0d86c292e31c91cf57e","category":"Environment"}