{"title":"Targeting POLD1 to suppress the proliferation and migration of breast cancer MDA-MB-231 cell lines by downregulation of SIRT1","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae111/7716406?rss=1","date":1721260800000,"content":"<span><div>Abstract</div><div>Background</div>The resistant and aggressive nature of triple-negative breast cancer (TNBC) renders it mostly incurable even following extensive multimodal treatment. Therefore, more studies are required to understand the underlying molecular mechanisms of its pathogenesis. SIRT1 is a class III histone deacetylase NAD + -dependent enzyme that is interlinked in tumor progression, apoptosis, metastasis, and other mechanisms of tumorigenesis, while DNA polymerase delta 1 (POLD1) functions as a gene coding for p125, which plays an important role in genome stability and DNA replication.<div>Objective</div>We aimed to investigate the downstream signaling pathway of EX-527, a potent and selective SIRT1 inhibitor, in MDA-MB-231 breast cancer cell lines, and the crosstalk between SIRT1 and POLD1, which is essential for the activities of polymerase δ.<div>Methods</div>The antiproliferative and apoptotic effects of EX-527 on MDA-MB-231 cells were assessed by MTT and annexin V/PI double staining assays. Migration and invasion activity of MDA-MB-231 cells were assessed by wound-healing scratch and transwell assays. Protein expressions were examined using Western Blot analysis.<div>Results</div>MDA-MB-231 cells treatment with IC50 values of 45.3 μM EX-527 significantly suppressed cell proliferation and induced apoptosis by down-regulating SIRT1. Also, it significantly repressed migration and invasion of MDA-MB-231 cells as evaluated by wound healing and transwell invasion assays. Western blot results showed that decreased expression of SIRT1 is positively correlated with expression of p53 along with down-regulating POLD1.<div>Conclusion</div>SIRT1 could have an oncogenic role in breast cancer development and progression via activating POLD1. These conclusions present new insights into the underlying mechanisms of TNBC.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"7efb0ff31993b8ae9592934850561dcd9d51fef5f3a23e2e36b3994f39027d93","category":"Environment"}