{"title":"Evaluating the validity and reliability of the Tswana adaptation of the MOS-HIV tool for health-related quality of life among HIV Sub-populations in Botswana: A study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311904","date":1728655200000,"content":"<p>by Mooketsi Molefi, Olanrewaju Oladimeji</p>\r\n\r\nThe lack of culturally and contextually appropriate adaptations of health-related quality of life (HRQoL) tools hinders HIV patient outcomes. This study aims to assess the validity and reliability of a Tswana version of the Medical Outcome Survey-HIV (MOS-HIV) tool among diverse HIV sub-populations in Botswana. In terms of the methodology the study will comprise of several steps. Firstly, forward and back-translation of the original U.S. English MOS-HIV tool into Setswana, followed by the review of the translated tool. Phase 1 will evaluate content, construct validity, and reliability of the newly developed tool among HIV outpatients at Gaborone Infectious Diseases Clinics (IDCC). A Cronbach’s alpha coefficient &gt;0.7 across the 35 items and 11 dimensions of the MOS-HIV tool will indicate internal consistency reliability. Phase 2 will employ the use of logistic regression models to identify predictors of poor HRQoL among randomly selected IDCC sites, both in urban and rural centers. Phase 3 will investigate predictors of poor HRQoL among inpatients receiving treatment for HIV-associated cryptococcal meningitis (CM) using longitudinal data analysis methods. Ethical approval has been obtained from the University of Botswana, Walter Sisulu University, Human Research and Development Unit, Ministry of Health, and Princess Marina Hospital. Prospective participants will provide written informed consent, with proxy consent explored when feasible. Voluntary participation and confidentiality will be ensured during data collection and analysis. Data will be securely stored under lock-and-key. Dissemination of study findings will adhere to strict privacy protocols, avoiding the sharing of personal identifiers.","author":"Mooketsi Molefi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7efde6de64923a8b18914df6b5257a698608dc60a9b14b4170c4005d2fa44bdb","category":"Interdisciplinary"}