{"title":"Vision Pro is already making its AI competition look silly","link":"https://www.macworld.com/article/2202281/vision-pro-humane-ai-pin-price-specs-functionality.html","date":1705401000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It is the curse of the era we live in that the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://hu.ma.ne&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">Humane Ai</a> pin and the <a href=\"https://www.macworld.com/article/557878/apple-vision-pro-release-date-headset-specs-price.html\">Vision Pro</a> can be mentioned in the same breath as “upcoming products.”</p>\n\n\n\n<p>This isn’t to say the Vision Pro is a sure-fire winner. People who have tried it seem to think it’s great but it’s also very expensive and stares at you with eyes that, if they were a salad dressing, would be Uncanny Hidden Valley Ranch.</p>\n\n\n\n<p>Does that joke make sense? No, it does not. What does salad dressing have to do with an AR headset? Nothing. It’s just that sometimes something gets stuck in the Macalope’s head and he has to get it out.</p>\n\n\n\n<p>Speaking of which, if you’re thinking of starting a podcast about the Vision Pro and you expect your audience will skew slightly older, here’s a free idea for a name: <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/puwoUKhZQbg?si=014eRyI0QBuek4Qe&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">“Isn’t That Spatial?”</a> You’re welcome.</p>\n\n\n\n<p>Okay, the Macalope thinks that’s all the stuff he needed to get out of his brain. We can move on with the rest of the column.</p>\n\n\n\n<p>Look, it’s nice to be enthusiastic about things. It’s more bearable than relentless pessimism. Or so the Macalope heard. But you also have to be realistic and realistically speaking, the Humane pin is three Captchas in an overcoat trying to get into a bar that’s humans only. It’s all propellor hat, no lift. It’s an android unfamiliar with our Earth objects asking “Is this a product?” It’s three other references the Macalope didn’t bother to think up to indicate that while AI is at least someday going to be a ubiquitous interaction method everyone will use, the Humane pin is not going to last long. And this should have been obvious from the start.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2023/6/30/23779654/humane-ai-pin-name-launch-date&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">“Humane’s first gadget is named the ‘Humane Ai Pin,’ and it’s coming this year”</a></p>\n\n\n\n<div><div>\n<p>The Verge’s David Pierce could tell.</p>\n\n\n\n<blockquote>\n<p>We came out of that demo with far more questions than answers because something about the demo just seemed off.</p>\n</blockquote>\n\n\n\n<p>Yet, he still couldn’t help himself.</p>\n</div></div>\n\n\n\n<blockquote>\n<blockquote>\n<p>Still, I’m unabashedly intrigued by the Ai Pin.</p>\n</blockquote>\n</blockquote>\n\n\n\n<p>That was last year. If you’re thinking to yourself, “Gosh, I must have missed seeing them on the streets.”, you have not. Preorders started in November and it’s expected to ship in March. Humane’s only slightly less vague November demo basically posed the question “What if AI was a thing that you wore… for $699… and required a $24-per-month subscription?”</p>\n\n\n\n<p>Intriguing.</p>\n\n\n\n<p>The Macalope just checked and GPT-4 is $16.66 (he sees what they did there) a month and is available on smartphones and even smartwatches, which are something that you can wear! But what if you wore this other thing that costs more and does less?</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Macalope\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all 1500w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /></figure><p>IDG</p></div>\n\n\n\n<p>(This raises the idea of comparing the pie-in-the-sky reaction to the pre-launch of the Humane pin to the flopapalooza reaction to the Apple Watch before it came out. But let’s stick to comparing it to the Vision Pro since we’re on the cusp of seeing both in action.)</p>\n\n\n\n<p>The Vision Pro costs more than its competitors, too, but it does way more. People who eat AR and VR for breakfast are probably still hungry by lunchtime because they’re eating literally nothing, but they know a thing about the industry and they all seem pretty blown away by the Vision Pro.</p>\n\n\n\n<p>The Humane pin will probably go down in price over time (if it survives) as will the Vision Pro. But, again, everything back-end thing the Humane pin does you can access now on devices you have. And while everyone keeps asking <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://techcrunch.com/2023/11/09/humanes-ai-pin/&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">what’s going to come after screens</a> as a primary interface, no one currently wants anything else. Meanwhile, the Vision Pro’s main benefits are in the user experience, rather than a back end it doesn’t even own. It remains to be seen if Apple’s spatial computing concept will take off but where the iPhone was conceptually a Mac in your pocket, the Vision Pro is a Mac… everywhere. That’s also intriguing. And while Apple’s presentations are clearly staged for maximum effect, its demos with journalists are <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.inverse.com/tech/apple-vision-pro-photos-app-spatial-video-hands-on&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">very real</a>.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daringfireball.net/linked/2024/01/09/humane-layoffs&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">As John Gruber points out</a>, more troubling for Humane than <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2024/1/9/24032274/humane-layoffs-ai-pin&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">its recent small layoff</a> is the fact that one of its most notable and largest investors, Sam Altman, is reportedly working on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2023-12-26/apple-iphone-design-head-tang-tan-to-work-with-jony-ive-sam-altman-on-ai-tech&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">his own AI hardware effort with Jony Ive</a>. That’s some real “Daddy’s just going out for cigarettes.” energy.</p>\n\n\n\n<p>There’s no way that the Vision Pro is going to sell in huge numbers at $3,499 (and it looks like <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2024/01/11/kuo-vision-pro-sellout-likely/&amp;xcust=1-1-2202281-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple doesn’t think so</a>, either). But it’s very likely Apple will build on whatever modest success it has. Humane, on the other hand, seems likely to be acquired to have whatever useful bits in it shoved into existing products and the pin will cease to be.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7f0007746049b0f68ec7398ce71fadf0e86e7dea0740493f2327a311211e6cfd","category":"Apple"}