{"title":"Vittoria Corsa Pro tire review: A classic, modernized","link":"https://www.cyclingtips.com/2023/05/vittoria-corsa-pro-tire-review/","date":1683326790000,"content":"<figure><img src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-label-2.jpg?width=1200\" alt=\"Vittoria Corsa Pro tire review: A classic, modernized\" /></figure><p><span>The <a href=\"https://www.cyclingtips.com/tag/vittoria\" target=\"_blank\">Vittoria</a> Corsa name is synonymous with being a top-end road tire, but these days they feel a bit more like the alternative option. Corsa tires – even with the updated Graphene compound – developed small cuts easily. Want tubeless Corsa tires? They weren’t cheap either, which made replacing them require a bit of consideration.</span></p>\n<p><span>The latest update to the Corsa lineup is the new Vittoria Corsa Pro, which the brand says offers increased speed and comfort, better wet and cornering grip, and durability. The tire itself has been around the peloton for the past six months or so, with a small Vittoria logo stamp on the sidewall and nothing else to indicate that something was afoot for the storied tire manufacturer.</span></p>\n<p><span>So, what are the tires like? We put a pair of Corsa Pro tires on our bike to find out just how good they are and how they compare to the competition.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-box-back.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-review-box-back\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-box-back.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-box-back.jpg?width=190 190w\" /><figcaption>The Corsa Pro packaging is awfully descriptive. More of that information can be found by scanning the QR code found on every new Corsa Pro tire. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<h2><span>How much can a cotton tire really be innovated?</span></h2>\n<p><span>Vittoria is quick to note just how much success racers have found on the Vittoria cotton tires, claiming 19 Tour de France wins, 18 Giro d’Italia, 10 Vuelta a Espana, as well as victories elsewhere. Though Vittoria did not specify which of these wins came on tubulars versus clinchers and later tubeless tires, it is clear that Vittoria has a strong pedigree for making quality-performing tires with cotton casing. </span></p>\n<p><span>But the characteristic tan sidewalls that tend to come with cotton casings don’t seem to change all that much. And in the case of comparing the outgoing Corsa and the new Corsa Pro, none of it looks all that different. But changes there are, and they’re all for the better.</span></p>\n<p>Vittoria is quick to say that the new Corsa Pro has floated around pro teams like Jumbo-Visma, Education First-Easy Post, Team DSM, and others since October 2022. Since then, Vittoria claims the Corsa Pro was the tire for 22 stage wins and 12 one-day races at World Tour level since the start of the season. Impressive stuff for such a short period of time.</p>\n<p><span>Here are the numbers. According to Vittoria, the new Corsa Pro TLR is 12 percent faster, has 18 percent better puncture resistance, and a is helpful 4 percent lighter than the previous Corsa TLR. Nothing to sneeze at, true or not. </span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-breakdown.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-breakdown\" width=\"1475\" height=\"887\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-breakdown.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-breakdown.jpg?width=190 190w\" /><figcaption>A breakdown of how the Corsa Pro is constructed. Unlike most current road bike tires, the Corsa Pro has a distinct cotton casing and rubber tread.</figcaption></figure></figure>\n<p><span>Previous versions of the Corsa were very obviously two layers: rubber and casing, and after a few thousand miles (or sometimes less), one could not only feel the difference between the casing and tire, but they could pull it apart if they were especially motivated. </span></p>\n<p><span>Vittoria says their engineers have incorporated a “more sustainable electrical vulcanization,” which allows them to create what looks and feels like a seamless transition from the cotton casing to the rubber compound. The casing – still 320 TPI as before – is said to offer increased suppleness thanks to the new way they’re bonding the casing and rubber. Better malleability to the terrain should mean smoother, and smoother is faster according to Vittoria.</span></p>\n<p><span>The casing needs to be supple, but it has to be strong as well to hold on to the rim, be it hooked or hookless. To do so they’ve included a Zylon bead and an accompanying bead shield that feels far sturdier and more stable than anything I’ve seen from Vittoria’s road and gravel lineup. In the hand, the bead almost feels like a square edge rather than the traditional round beads found on most other tubeless road tires. It is strong and stiff, and Vittoria’s key to making the casing tubeless-compatible in every size.</span></p>\n<h2><span>The Corsa Pro goes all in on tubeless</span></h2>\n<p><span>That’s right, every non-tubular Vittoria Corsa Pro is designed for tubeless use, with a caveat. 24 mm and 26 mm Corsa Pro tires can only be used on hooked bead rims, while 28 mm, 30 mm, and 32 mm widths can be used with both hooked and hookless rims. Tube devotees can still use them with the TLR tires if needed, though they’re likely to miss out on the added performance benefits of tubeless tires.</span></p>\n<p><span>Not sure what tire can be used and where? On the hot patch (where things like the name, tire width, and tire pressure range are placed onto the tire’s casing) of the Corsa Pro, Vittoria have included a small QR code. Scan the code, and riders can access resources like recommended air pressures, recommended tubes if you’re using them, and other tutorials.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-tread-2.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-review-tread-2\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-tread-2.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-tread-2.jpg?width=190 190w\" /><figcaption>The familiar Corsa tread pattern remains with the new Corsa Pro. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p><span>Vittoria has also updated the Corsa Pro rubber. It features a silica-infused compound down the center with a graphene-infused-one on the shoulders. There’s even a handy wear indicator molded directly into the tread. The tread itself remains essentially the same, with wide-set parallel lines in the middle and tighter-set lines as they go out to the shoulders.</span></p>\n<p><span>Between the casing and rubber is a puncture belt that the brand says is responsible for much of the tire’s improved puncture resistance.  </span></p>\n<p><span>There are in essence three versions of the new Corsa Pro. The Vittoria Corsa Pro comes in one tubeless-ready version, though there is a tubular Corsa Pro available too. Folks looking for a bit more grip, longevity, and perhaps some cobbles-ready performance should take a look at the Vittoria Corsa Pro Control. It uses the same TLR casing as the Corsa Pro, though the rubber tread itself is a bit thicker and uses a fishbone texture for greater grip.</span></p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-sizes-and-weights.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-review-sizes-and-weights\" width=\"1500\" height=\"710\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-sizes-and-weights.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-sizes-and-weights.jpg?width=190 190w\" /><figcaption>A 28 mm Corsa Pro in tubeless guise has a weight within about 15 grams of other tubeless-ready tires from Continental, Pirelli, Schwalbe, Goodyear, and others. (Image: Vittoria)</figcaption></figure></figure>\n<p><span>As mentioned above, sizes below 24 mm are only tubeless-compatible hooked rim beads but sizes 28 mm and up work on both hooked and hookless rims. And while the Corsa Pro goes up to 32 mm, the new Corsa Pro Control goes all the way up to a 34 mm tires.</span></p>\n<p><span>Vittoria sent us the Corsa Pro in 28 mm width and the single black and cotton sidewall variation. Claimed weight is 295 grams; our pair of test tires weighed an average of 276 grams each. Further, the initial measurement of the Corsa Pro on a 23 mm internal width rim was 28.5 mm; after about 150 miles of riding, its width increased to 29 mm.</span></p>\n<h2><span>Riding the Vittoria Corsa</span></h2>\n<p><span>I’ll just get it out of the way: I have historically been a fan of Vittoria’s cotton casing tires. The Open CX of the early 2010s was an expensive race-day splurge for me as a young high schooler. I couldn’t afford carbon wheels much less a second set of wheels, but before a race (or any event I wanted to feel good riding in) I would swap from my durable but slow Serfas Seca wire bead tires to the Vittorias. It was like turning on the jets on my bike. The tires punctured easily and wore out quickly, but they were easy to buy locally and made my bike feel just a little more special. </span></p>\n<p><span>I’ve since used later generations of the Corsa tire, and while they became more durable with time, the competition has caught up to make fully-vulcanized road tires without cotton casings that test faster than the Corsa. It’s hard to argue against raw numbers, and other tires have typically won out. </span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-on-wheel-tread.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-review-on-wheel-tread\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-on-wheel-tread.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-on-wheel-tread.jpg?width=190 190w\" /><figcaption>The Corsa Pro after about 150 miles. Not much color change to the cotton casing, though I would expect that to change to a deeper patina of sorts with extended exposure to UV, wear, grime, and the like. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<p><span>The Corsa Pro has a fantastically smooth ride feel. Inflated to the same pressure as other tires, the Corsa Pro seems smoother. Roads that normally chatter underneath you as you ride become like the low din of that speakeasy that charges too much for cocktails; you’re aware that there are things going on there, but none of the conversations are loud enough for you to eavesdrop on.</span></p>\n<p><span>The tires feel pliable and compliant, perhaps elastic in feel, and you feel that in how it grips through corners. The aforementioned smooth ride quality is confidence-inspiring, which makes turning in just a bit easier. I can’t comment on wet grip as it has been relatively dry in my part of Texas, but the previous generation gripped nicely and there is no indication from my experiences that this would be otherwise. And while I have had enough time to figure out how tires ride, I haven’t had enough time to comment on how resistant the new Corsa Pro is cuts and punctures. Any claimed improvement is a good one, however.</span></p>\n<p><span>Does the Corsa feel faster than other tires on the market? Not necessarily, but certainly not discernably slower either. It just feels different, honestly; smooth, confidence-inspiring, and ever-capable.</span></p>\n<p><span>To note, the tubeless setup was fairly simple. The tires set up locked into the rim bead of each tire with a floor pump, though it required a touch of guidance in partially setting the tire bead onto the rim to make it happen. Once inflated, the tires seemed fairly airtight without sealant, but with sealant, they held air easily.</span></p>\n<figure><img loading=\"lazy\" src=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-small-logo.jpg?width=730\" alt=\"Vittoria-Corsa-Pro-tire-review-small-logo\" width=\"1500\" height=\"1000\" srcset=\"https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-small-logo.jpg?width=650 650w, https://cdn.cyclingtips.com/wp-content/uploads/2023/05/Vittoria-Corsa-Pro-tire-review-small-logo.jpg?width=190 190w\" /><figcaption>The Corsa Pro required an air compressor to seat onto the <a href=\"https://www.cyclingtips.com/2023/05/fulcrum-speed-42-review/\" target=\"_blank\">Fulcrum Speed 42 wheels</a> I recently reviewed. (Image: Alvin Holbrook/CyclingTips)</figcaption></figure>\n<h2><span>Conclusion</span></h2>\n<p><span>Would the high school version of myself choose these tires as their secret weapon of choice on race day? Hard to say. The <a href=\"https://www.cyclingtips.com/2021/10/continental-grand-prix-5000-s-tr-tubeless-road-clincher-officially-announced/\" target=\"_blank\">Continental Grand Prix 5000 S TR</a> generally tests as one of the fastest road tires available today, so 16-year-old me would probably choose that to squeeze out every watt I could. </span></p>\n<p><span>I will complain about one thing here: price. Tubeless technology – particularly on the high end– has surely bumped up the average transaction price for a pair of road bike tires. Paying effectively $200 for a set of tires is a hard pill to swallow, regardless of how good the tires are. I suspect that would be what prevents teenage me from choosing these tires over other options that are still expensive but would allow enough money to buy a new chain or handlebar tape.</span></p>\n<p><span>Today though? There’s something to the smoothness, pliability, and </span><i><span>suppleness</span></i><span> of the Corsa Pro that makes me think this is one of my absolute favorite road tires out there. Good thing I’m not a teenager anymore.</span></p>\n<p><span>Price: $100 / €95 / £90 ( Vittoria Corsa Pro tube/TLR as tested)</span></p>\n<p><a href=\"https://www.vittoria.com/us/en/\" target=\"_blank\"><span>Vittoria.com</span></a></p>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"7f06bd0b987b01af2c0ed00a116fbc5f163abca16e7836a84aa10ac17d8143c1","category":"Cycling"}