{"title":"Rapha’s Documentary on Lael’s FKT in Alaska","link":"https://theradavist.com/2021/09/raphas-documentary-on-laels-fkt-in-alaska/?utm_source=rss&utm_medium=rss&utm_campaign=raphas-documentary-on-laels-fkt-in-alaska","date":1632770253000,"content":"<p>Earlier this year, <a href=\"https://theradavist.com/tag/lael-wilcox/\" target=\"_blank\">Lael</a> departed on an FKT on the Alaska Pipeline route. Rapha was there, documenting her efforts:</p>\n<p>“<em></em></p>\n<blockquote><p>Four feet wide and carried five above the ground by a seemingly endless series of stanchions, the Alaska Pipeline is, for most of its 800-mile route, the only mark humanity has made on the pristine wilderness of this last frontier. The only mark, that is, except for the road that accompanies the pipeline on its long journey south from the Artic outpost of Prudhoe Bay to Valdez. </p>\n<p>For born and bred Alaskan Lael Wilcox, this lonely road has always held a special interest. In fact, she’s ridden most of it before. But this time she’s back with a new challenge to set a Fastest Known Time, or FKT, for the route and bring a new source of energy to the road. By pushing herself, she hopes to encourage other riders, wherever they live and however long they’ve been riding, to do the same. </p>\n<p>But this is a record attempt not a race, so Lael’s number one adjective is to have fun. All you have to do is show up with what you have, ride with all your heart and see how it goes. Oh, and you need to eat like it’s your job! Created by an all-female crew, tune into this latest episode of Rapha Gone Racing to find out how Lael got on in the Alaskan wilderness and whether the rumours that she is quicker than crude oil are actually true.</p></blockquote>\n<p>”</p>\n<p>Check out this wonderful documentary here and see Lael’s gear breakdown in our Related Archives below!</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"7f0f33c7a4df49e16bafd166186166695cae6267384a757142dfc8349301a1f5","category":"Cycling"}