{"title":"Apple Says Some iPhone 12 Hardware Issues Will No Longer Require Replacing the Entire Device","link":"https://www.macrumors.com/2021/02/16/iphone-12-same-unit-repairs/","date":1613511101000,"content":"Apple today informed Apple Authorized Service Providers that it will be introducing a new same-unit repair method for iPhone 12 mini and iPhone 12 models exhibiting certain issues that would typically require a whole-unit replacement. \r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/10/iphone-12-blue-aluminum.jpg\" alt=\"\" width=\"1440\" height=\"810\" class=\"aligncenter size-full wp-image-766208\" />\r\n<br/>\r\nIn an internal memo, obtained by MacRumors, Apple said technicians will be able to offer same-unit repairs starting February 23 for iPhone 12 mini and iPhone 12 models that are unable to be powered on or are experiencing issues with the logic board, Face ID system, or the enclosure of the device, such as cracked rear glass.\r\n<br/>\r\n\r\n<br/>\r\nApple Authorized Service Providers (and likely Genius Bars) will have a new \"iPhone Rear System\" part available to them that consists of the rear enclosure of an iPhone model with all components except the display and rear camera, including the battery, logic board, wireless charging coil, Taptic Engine, Face ID system, and so forth.\r\n<br/>\r\n\r\n<br/>\r\nIf a customer has an iPhone 12 mini with cracked rear glass, for example, technicians will be able to replace the entire rear portion of the device, with the new enclosure affixed to the original display and rear camera. For this reason, the customer's display and rear camera must be free of damage or functional failures in order for their device to qualify for this same-unit repair method, according to Apple.\r\n<br/>\r\n\r\n<br/>\r\nThe new repair method will be available in all countries and regions where the iPhone 12 mini and iPhone 12 are sold, according to Apple. iPhone 12 Pro and iPhone 12 Pro Max models do not appear to be eligible at this time.\r\n<br/>\r\n\r\n<br/>\r\nIn its memo, Apple said this move supports the company's ongoing commitment to reducing the carbon footprint of every product it sells.<div class=\"linkback\">Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a></div><div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/aasp/\">Apple Authorized Service Providers</a></div><div class=\"linkback\">Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-12\">iPhone 12 (Neutral)</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/16/iphone-12-same-unit-repairs/\">Apple Says Some iPhone 12 Hardware Issues Will No Longer Require Replacing the Entire Device</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-says-some-iphone-12-hardware-issues-will-no-longer-require-replacing-the-entire-device.2284962/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cPdUj-bjb5o:DbEaelWGpoI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=cPdUj-bjb5o:DbEaelWGpoI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/cPdUj-bjb5o\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7f13acfcb8e77de44530d272b27903cef323240ea79cb68b0b8201aaaebb24c9","category":"Apple"}