{"title":"The adjuvant effect of oil-based gastric lavage on the outcome of acute Aluminum phosphide poisoning: a systematic review and meta-analysis","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae029/7623476?rss=1","date":1709683200000,"content":"<span><div>Abstract</div><div>Introduction</div>Aluminum Phosphide (AlP) poisoning constituted the most common cause of poisoning death in some low- and middle-income countries (LMICs). This study aimed to evaluate the safety and efficacy of oil-based gastric lavage (GL) compared with standard therapy for the treatment of AlP poisoning. Materials and methods. This systematic review complied with “Preferred Reporting Items for Systematic Reviews and Meta-Analyses” (PRISMA) Protocols. A comprehensive search was carried out, identifying randomized controlled trials (RCTs), including anyone presenting within 6 h of exposure to AlP, and the administration of GL with oils, including liquid paraffin or coconut oil.<div>Results</div>We identified 7 RCTs. The evidence from 4 RCTs indicates that GL with paraffin oil is an effective treatment for acute AlP poisoning, decreasing the mortality rate (RR = 0.62; 95% CI = 0.48 to 0.81; participants = 226; I <sup>2</sup> = 10%; <span>low-quality evidence</span>). We estimate the Number Needed to Treat of 4. Likewise, this intervention reduces the need for intubation and mechanical ventilation (RR = 0.62; 95% CI = 0.40 to 0.79; I<sup>2</sup> = 0%; <span>low-quality evidence</span>). Regarding GL with coconut oil, the evidence from 4 RCTs, indicates a slight reduction in mortality (RR = 0.82; 95% CI = 0.69 to 0.98; participants = 112; I<sup>2</sup> = 0%; <span>very low-quality evidence</span>).<div>Conclusions</div>Limited evidence suggests that GL with paraffin oil is effective in reducing the mortality rate. Likewise, limited evidence showed in favor of paraffin oil concerning the need for intubation and mechanical ventilation. Very limited evidence suggests that GL with coconut oil could reduce mortality. Both interventions would have a benign safety profile.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"7f17fd9752254648cda7a795255e1f9a8ef0cc46ac463e24fe323f5615423acb","category":"Environment"}