{"title":"New App Highlights Over 300 Custom-Designed 3D Landmarks in Apple Maps","link":"https://www.macrumors.com/2023/03/15/apple-maps-3d-landmarks-app/","date":1678909201000,"content":"Since the release of iOS 15 in 2021, Apple Maps has been rolling out a more detailed map with <a href=\"https://www.macrumors.com/2021/11/11/apple-maps-3d-washington-dc/\">custom-designed landmarks</a> in major cities around the world. The new \"Detailed City Experience\" is now available in Chicago, London, Los Angeles, New York, Paris, San Francisco, Sydney, Toronto, and several other cities, with more to come.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/Landmarks-App.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nMontréal-based developers <a href=\"https://twitter.com/andre8aev\">André Baev</a> and <a href=\"https://twitter.com/simongardinier\">Simon Gardinier</a> recently released a new <a href=\"https://landmarks.8aev.com/\">Landmarks app</a> with a collection of over 300 of these 3D landmarks, ranging from the Royal Opera House in London to the Golden Gate Bridge in San Francisco. The app is <a href=\"https://apps.apple.com/us/app/landmarks-famous-sights-in-3d/id6446065798\">available on the App Store</a> for the iPhone, iPad, Mac, and Apple TV, and requires a device with an A12 chip or M1 chip and newer to properly display the 3D landmarks in full color and detail. \r<br />\n\r<br />\nEach landmark has an immersive animated landscape that you can interact with, and there is a toggle for viewing them in Light or Dark mode. The landmarks are organized by city and the app will be regularly updated with new models as they become available. The app is free to use and has no ads, but there is an optional gyroscope feature that can be unlocked for as little as $0.29 for users who wish to support the developers.\r<br />\n\r<br />\nApple periodically updates a list of locations where the Detailed City Experience is available on its <a href=\"https://www.apple.com/ios/feature-availability/#maps-3d-city-experience\">iOS feature availability page</a>.\r<br />\n\r<br />\nBaev also released a similar <a href=\"https://apps.apple.com/us/app/preflight-airport-navigator/id1669067268\">Preflights</a> app that provides 3D map views of major airports, complete with essential information.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-maps/\">Apple Maps</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/15/apple-maps-3d-landmarks-app/\">New App Highlights Over 300 Custom-Designed 3D Landmarks in Apple Maps</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/new-app-highlights-over-300-custom-designed-3d-landmarks-in-apple-maps.2383806/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7f28af1db5fc3ba930cdea7abba3c602a944c2e950a52fa5ba4d1d1d2c51bbaf","category":"Apple"}