{"title":"Impact of Ultra-Low Emission Technology of Thermal Power Plants on Air Quality in China","link":"http://link.springer.com/10.1007/s41810-024-00237-5","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>China is confronted with a severe air pollution challenge, wherein thermal power generation plays a significant role. In recent years, substantial efforts have been made in ultra-low emission retrofitting of coal-fired power plants, however, quantitative study regarding its subsequent impact on air quality is limited. In this study, we estimated the emission reduction of thermal power plants from the perspective of online monitoring system during 2014 ∼ 2016, and investigated the accompanying impacts on air quality in typical regions of China by using a regional chemical model WRF-Chem. The results indicate that the ultra-low emission retrofitting of thermal power plants, which was initiated in 2014, has achieved significant progress, with nearly 80% of planned tasks completed by 2016. As a result, emissions of SO<sub>2</sub>, NO<sub>x</sub> and PM<sub>2.5</sub> from thermal power plants notably decreased by 67.5%∼72.8% nationwide between 2014 and 2016. WRF-Chem simulations demonstrate that the ultra-low emission retrofitting effectively reduces air pollutant concentrations. Specifically, the monthly mean concentrations of SO<sub>2</sub>, NO<sub>2</sub> and PM<sub>2.5</sub> in typical regions have decreased by 0.6 ∼ 1.7, 2.2 ∼ 3.7 and 2.6 ∼ 5.0 µg m<sup>− 3</sup>, respectively, representing an improvement of 3.1%∼10.4%, particularly notable in winter. Regional variations in installed thermal power capacity and completion of the ultra-low emission retrofitting have led to differential improvements in air quality, with the Yangtze River Delta region exhibiting the most significant reduction in air pollution concentrations, surpassing the Beijing-Tianjin-Hebei and Pearl River Delta regions by up to 2.2 µg m<sup>− 3</sup>. This study serves as a valuable reference for the ultra-low emission retrofitting of thermal power industry and provides essential data support for future air quality management strategies.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"7f2dd8c8032a57f8a554103573583aaa8b977cbff8fb3bb426609cd10b0f68ba","category":"Environment"}