{"title":"Atmospheric nitrogen deposition is related to plant biodiversity loss at multiple spatial scales","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17445?af=R","date":1724223600000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/477b00ff-4b3d-4073-9a82-bfd5db761ae9/gcb17445-toc-0001-m.png\" alt=\"Atmospheric nitrogen deposition is related to plant biodiversity loss at multiple spatial scales\" />\n<p>Previous studies have shown that atmospheric nitrogen deposition is negatively related to plant diversity at local scales. The current study shows that reductions of plant diversity with atmospheric nitrogen deposition also happen at the scale of landscapes and regions. This is mostly due to the disappearance of nitrogen-sensitive species across multiple sites. It is well-established that high levels of atmospheric nitrogen deposition can reduce plant diversity at local scales. Here, with a study on acid grasslands carried out across 9 different European countries, we found that these negative effects of atmospheric nitrogen deposition at local scales (a) also exacerbate at much larger spatial scales (b). Larger-scale biodiversity losses were mostly driven by the loss of the same set of plant species across different sites (c), rather than by species replacements.</p>\n<br />\n<h2>Abstract</h2>\n<p>Due to various human activities, including intensive agriculture, traffic, and the burning of fossil fuels, in many parts of the world, current levels of reactive nitrogen emissions strongly exceed pre-industrial levels. Previous studies have shown that the atmospheric deposition of these excess nitrogen compounds onto semi-natural terrestrial environments has negative consequences for plant diversity. However, these previous studies mostly investigated biodiversity loss at local spatial scales, that is, at the scales of plots of typically a few square meters. Whether increased atmospheric nitrogen deposition also affects plant diversity at larger spatial scales remains unknown. Here, using grassland plant community data collected in 765 plots, across 153 different sites and 9 countries in northwestern Europe, we investigate whether relationships between atmospheric nitrogen deposition and plant biodiversity are scale-dependent. We found that high levels of atmospheric nitrogen deposition were associated with low levels of plant species richness at the plot scale but also at the scale of sites and regions. The presence of 39% of plant species was negatively associated with increasing levels of nitrogen deposition at large (site) scales, while only 1.5% of the species became more common with increasing nitrogen deposition, indicating that large-scale biodiversity changes were mostly driven by “loser” species, while “winner” species profiting from high N deposition were rare. Some of the “loser” species whose site presence was negatively associated with atmospheric nitrogen deposition are listed as “threatened” in at least some EU member states, suggesting that nitrogen deposition may be a key contributor to their threat status. Hence, reductions in reactive nitrogen emissions will likely benefit plant diversity not only at local but also at larger spatial scales.</p>\n<p>Door verschillende menselijke activiteiten, waaronder intensieve landbouw, verkeer en het verbranden van fossiele brandstoffen, overschrijden de huidige niveaus van reactieve stikstofemissies in veel delen van de wereld sterk de niveaus van vóór de industriële revolutie. Eerdere studies hebben aangetoond dat de atmosferische depositie van deze stikstofverbindingen in terrestrische natuurgebieden negatieve gevolgen heeft voor de plantendiversiteit. Deze eerdere studies onderzochten echter voornamelijk het verlies aan biodiversiteit op lokale ruimtelijke schalen, d.w.z. op schalen van plots van meestal enkele vierkante meters. Of verhoogde atmosferische stikstofdepositie ook de plantendiversiteit op grotere ruimtelijke schalen beïnvloedt, was tot dusver onbekend. Hier onderzoeken we, met behulp van vegetatie-data verzameld in 765 plots verspreid over 153 verschillende locaties en 9 landen in Noordwest-Europa, of de relaties tussen atmosferische stikstofdepositie en plantendiversiteit schaal-afhankelijk zijn. We vonden dat hoge niveaus van atmosferische stikstofdepositie geassocieerd waren met een lage soortenrijkdom van planten op zowel de schaal van plots, percelen en regio's. De aanwezigheid van 39% van de plantensoorten was negatief geassocieerd met hoge niveaus van stikstofdepositie op grote (perceels-)schalen, terwijl slechts 1,5% van de soorten vaker voorkwam bij toenemende stikstofdepositie. Dit geeft aan dat veranderingen in biodiversiteit op grote schaal voornamelijk werden gedreven door ‘verliezer’-soorten, terwijl er weinig ‘winnaar’-soorten zijn die profiteerden van hoge stikstofdepositie. Enkele van de ‘verliezer’-soorten waarvan de aanwezigheid op percelen negatief geassocieerd was met atmosferische stikstofdepositie, staan als ‘bedreigd’ vermeld in ten minste enkele EU-lidstaten, wat suggereert dat stikstofdepositie een belangrijke bijdrage kan leveren aan hun bedreigingsstatus. Verminderingen in reactieve stikstofemissies zullen daarom waarschijnlijk de plantendiversiteit niet alleen op lokale, maar ook op grotere ruimtelijke schalen ten goede komen.</p>","author":"Fons van der Plas, \nYann Hautier, \nTobias Ceulemans, \nDidier Alard, \nRoland Bobbink, \nMartin Diekmann, \nNancy B. Dise, \nEdu Dorland, \nCecilia Dupré, \nDavid Gowing, \nCarly Stevens","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"7f34f6e262ee7fbb5fb3349ed4a5a7613801acf7312cf9d743866f58c1b32657","category":"Environment"}