{"title":"Xbox เพิ่มฟีเจอร์ Voice Reporting อัดเสียงสนทนาในเกมแล้วแจ้งปัญหา Toxic ของผู้เล่น","link":"https://www.blognone.com/node/134812","date":1689229181000,"content":"<div><div><div><p>ไมโครซอฟท์เพิ่มฟีเจอร์ใหม่ Voice Reporting ให้คอนโซล Xbox สามารถรายงานการสนทนา \"สิ่งที่ไม่เหมาะสม\" ของผู้เล่นรายอื่นระหว่างเล่นเกมร่วมกัน เพื่อให้แก้ปัญหา toxic ของเกมเมอร์ เช่น การกลั่นแกล้ง ด่าทอ เหยียด ได้ง่ายขึ้น</p>\n<p>หลังจากโลกเกมมิ่งมีฟีเจอร์สนทนาด้วยเสียง ทำให้ปัญหา toxic ของเกมเมอร์เพิ่มขึ้นตามมา เพราะการคุยด้วยเสียงทำให้ด่ากันง่ายขึ้น แถมตรวจจับได้ยากกว่าเดิมด้วย ปัญหานี้ทำให้บริษัทเกมออนไลน์หลายๆ ราย เช่น <a href=\"https://www.blognone.com/node/122462\">Riot Games</a> หรือ <a href=\"https://www.blognone.com/node/124395\">Unity</a> ต้องพยายามพัฒนาระบบหรือเทคโนโลยีเพื่อมาช่วยตรวจจับเสียงสนทนาที่สร้างความเกลียดชัง ดูหมิ่น ให้แม่นยำขึ้นกว่าเดิม</p>\n<p>ฟีเจอร์นี้ของ Xbox (รองรับทั้ง Xbox One และ Xbox Series X|S) จะบันทึกเสียงสนทนาในเกม 60 วินาทีล่าสุดเอาไว้ให้เป็นเวลานาน 24 ชั่วโมง เพื่อให้ผู้บันทึกสามารถไตร่ตรองและแจ้งปัญหาไปยังทีมแอดมินในภายหลังได้ หากทีมแอดมินเห็นว่าคลิปเสียงดังกล่าวทำผิดกฎของชุมชน ก็จะมีมาตรการลงโทษเจ้าของเสียงต่อไป</p>\n<p>คลิปเสียงที่บันทึกจะไม่สามารถดัดแปลงแก้ไข ดาวน์โหลดออกมา หรือแชร์ให้คนอื่นได้เลย (เพื่อป้องกันการกลั่นแกล้ง) และจะถูกลบอัตโนมัติเมื่อเวลาผ่านไปแล้ว 24 ชั่วโมง เพื่อรักษาความเป็นส่วนตัวของเกมเมอร์ ฟีเจอร์นี้เริ่มใช้งานแล้วกับกลุ่ม Xbox Insider ในประเทศที่พูดภาษาอังกฤษเป็นหลัก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/48442e25d31db460fad31fea70c3b387.jpg\" /></p>\n<p>ที่มา - <a href=\"https://news.xbox.com/en-us/2023/07/12/xbox-voice-reporting-feature/\">Xbox</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/hate-speech\">Hate Speech</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"7f36c79a5c9bb6044584700cedcd1e2ababab0e21089a183dfdefe40ed164709","category":"Thai"}