{"title":"Early arrival of spring‐spawning Atlantic herring Clupea harengus at their spawning ground in the Kiel Fjord, western Baltic, relates to increasing winter seawater temperature","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15811?af=R","date":1718081638000,"content":"<h2>Abstract</h2>\n<p>The disturbance of marine organism phenology due to climate change and the subsequent effects on recruitment success are still poorly understood, especially in migratory fish species, such as the Atlantic herring (<i>Clupea harengus</i>; Clupeidae). Here we used the commercial catch data from a local fisher over a 50-year period (1971–2020) to estimate western Baltic spring-spawning (WBSS) herring mean arrival time Q<sub>50</sub> (i.e., the week when 50% of the total fish catches had been made) at their spawning ground within the Kiel Fjord, southwest Baltic Sea, and the duration of the spawning season for each year. The relationship between the seawater temperature in the Kiel Bight and other environmental parameters (such as water salinity, North Atlantic and Atlantic multidecadal oscillations) and Q<sub>50</sub> was evaluated using a general linear model to test the hypothesis that fish arrived earlier after warm than cold winters. We also estimated the accumulated thermal time to Q<sub>50</sub> during gonadal development to estimate the effects of seawater temperature on the variations of Q<sub>50</sub>. The results of this study revealed a dramatic decrease in herring catches within the Kiel Fjord since the mid-1990s, as documented for the whole southwestern Baltic Sea. Warmer winter seawater temperature was the only factor related to an earlier arrival (1 week for one January seawater temperature degree increase) of herring at their spawning ground. The relationship was found for the first time on week 52 of the year prior to spawning and was the strongest (50% of the variability explained) from the fourth week of January (8 weeks before the mean Q<sub>50</sub> among the studied years). A thermal constant to Q<sub>50</sub> (~316°C day) was found when temperatures were integrated from the 49th week of the year prior to spawning. These results indicate that seawater temperature enhanced the speed of gonadal maturation during the latest phases of gametogenesis, leading to an early fish arrival under warm conditions. The duration of the spawning season was elongated during warmer years, therefore potentially mitigating the effects of trophic mismatch when fish spawn early. The results of this study highlight the altering effects of climate change on the spawning activity of a migratory fish species in the Baltic Sea where fast global changes presage that in other coastal areas worldwide.</p>","author":"Nicolas C. Ory, \nJoachim P. Gröger, \nAndreas Lehmann, \nFelix Mittermayer, \nAnna B. Neuheimer, \nCatriona Clemmesen","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"7f38ca063709811fe23887b315dede5751313963bc8b951b91b31d2e34e6cccd","category":"Environment"}