{"title":"PRDX2 regulates stemness contributing to cisplatin resistance and metastasis in bladder cancer","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24153?af=R","date":1713250800000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Cisplatin (CDDP)-based chemotherapy has emerged as the primary treatment for muscle-invasive bladder cancer and metastatic bladder cancer. Nevertheless, a significant proportion of patients experience rapidly developed chemoresistance, leading to treatment ineffectiveness. Existing evidence suggests that chemoresistance is governed by various factors, including tumor stem cells, epithelial mesenchymal transition, and reactive oxygen species (ROS). However, limited research has been conducted on the role of PRDX2, a crucial ROS scavenger, in the modulation of chemoresistance in bladder cancer.</p>\n<h2>Methods</h2>\n<p>Cisplatin-resistant cell lines were established using the concentration gradient overlay method, and differentially expressed genes in resistant cells were screened through RNA sequencing. The expression of PRDX2 in cells and tissues was assessed using RT-qPCR, Western Blot, and immunohistochemistry. The expression of PRDX2 in bladder cancer and adjacent tissues was evaluated using a bladder cancer tissue microarray. Furthermore, the impact of PRDX2 knockdown on tumor formation and metastasis was investigated in vivo by applying subcutaneous tumor xenografts tail vein metastasis assays.</p>\n<h2>Results</h2>\n<p>We demonstrated that PRDX2 is significantly upregulated in bladder tumors and cisplatin-resistant bladder tumor cell lines. Overexpression of PRDX2 can promote tumor proliferation, migration, and invasion both in vitro and in vivo. We have found that knockdown of PRDX2 expression can effectively reverse cell resistance to cisplatin. Mechanistically, our findings suggest that PRDX2 is involved in regulating tumor stemness and epithelial-mesenchymal transition (EMT). Knockdown of PRDX2 affects the PI3K-AKT and mTOR signaling pathways, thereby influencing tumor stemness and EMT, ultimately impacting the chemotherapy resistance of the tumor.</p>\n<h2>Conclusions</h2>\n<p>This study provides a new insight into the regulation of chemotherapy resistance in bladder cancer by PRDX2. Targeting PRDX2 can serve as a potent therapeutic target for chemotherapy resistance.</p>","author":"Peng Li, \nWeihua Wang, \nBaowei Zhu, \nYangui Wang, \nJixia Li, \nChenghong Wang, \nChenyu Wang, \nQin Li","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"7f389be0596777dfed52ddeeb8870eff9a6570765adc9cdca780cfbf88968fd1","category":"Environment"}