{"title":"Customer Relationship Management (CRM) Systems and their Impact on SMEs Performance: A Systematic Review","link":"https://www.preprints.org/manuscript/202410.1538/v1","date":1729504396000,"content":"The integration of Customer Relationship Management (CRM) systems within Small and Medium Enterprises (SMEs) is increasingly recognized for its potential to enhance business performance. While CRM adoption is on the rise, the specific impacts on operational efficiency, customer satisfaction, and financial outcomes in SMEs require further investigation. This systematic review evaluates the impact of CRM systems on SME performance, with a focus on operational improvements, sales growth, and customer retention. The study aims to identify key determinants of successful CRM implementation and assess the long-term effects on SMEs' competitive advantage. The review encompasses studies published between 2014 and 2024, sourced from Google Scholar, Web of Science, and SCOPUS. A total of 46 studies were included after screening 18,306 records. The mixed-methods approach involves quantitative analysis of survey data from SME owners and managers, along with qualitative synthesis of case studies. Metrics evaluated include customer acquisition, retention rates, revenue growth, and organizational efficiency. The analysis indicates that CRM adoption leads to a 25-40% improvement in customer retention and a 15-30% increase in sales across SMEs. Operational efficiency gains range from 20-35%, primarily driven by process automation and enhanced data management capabilities. Successful CRM implementation is strongly linked to managerial support, system customization, and user training. However, barriers such as limited financial resources and technical expertise hinder the full realization of CRM benefits. CRM systems significantly contribute to SME growth by optimizing customer relationships and enabling data-driven decision-making. The review underscores the importance of strategic CRM implementation tailored to the specific needs of SMEs to maximize its impact. Future research should focus on overcoming adoption barriers and refining CRM strategies for sustained performance improvements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7f3be380b5a36e8615f83b7e143826f6e8888415b6ea8cd96689d8c56d4b8f68","category":"Interdisciplinary"}