{"title":"Antihypertensive utilization patterns among pregnant persons with pre-existing hypertension in the US: A population-based study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306547","date":1720015200000,"content":"<p>by Yanning Wang, Nicole E. Smolinski, Celeste Ewig, Thuy Nhu Thai, Tony S. Wen, Almut G. Winterstein</p>\r\nBackground <p>Hypertension among persons with childbearing potential is on the rise. Maintaining proper blood pressure during pregnancy is vital to prevent maternal and neonatal complications. Yet, limited evidence on the risk-benefit of various antihypertensives presents challenges for informed decision-making during this critical period. This study aimed to examine the utilization patterns of different classes of antihypertensives among persons with pre-existing hypertension before, during, and after pregnancy.</p> Methods <p>We used MarketScan® Commercial Database 2011−2020 to analyze antihypertensive utilization among pregnant persons aged 12 to 55 identified via a validated algorithm. Pre-existing hypertension was defined as ≥1 inpatient or ≥2 outpatient encounters for hypertension within the 180 days preceding the LMP. Antihypertensive utilization was described during target periods: 0–3 months (0-3M) before pregnancy, 1st/2nd/3rd trimester (T1/2/3), 0-3M, and 4-6M after pregnancy.</p> Results <p>We identified 1,950,292 pregnancies, of which 20,576 (12,978 live and 7,598 non-live) had pre-existing hypertension. Both groups had similar antihypertensive use (80.1% and 81.0%, respectively) during the 6 months before pregnancy (baseline). For live-birth pregnancies, 13.9% of baseline users discontinued treatment during pregnancy, while 28.9% of non-users initiated antihypertensives during pregnancy, and 17.2% started postpartum. Before pregnancy, the predominant antihypertensives included thiazide diuretics (21.9%), combined α- and β-blockers (18.4%), and dihydropyridines (16.2%). During pregnancy, thiazide diuretics, cardioselective β-blockers, and ACE inhibitors declined (T3: 3.0%, 4.2%, and 0.8%). Dihydropyridine use was steady during pregnancy, but preference shifted from amlodipine to nifedipine in T3 (2.2.% vs.10.8%). Central α2‐agonists increased during pregnancy (up to 15.2% in T3) compared to both pre- (9.8%) and post-pregnancy (5.7%). ARBs mirrored ACE inhibitors, with less than 1% utilization in later trimesters. Combination agents dropped from 10.8% pre-pregnancy to 0.8% in T3, then rebounded to 7.3% post-pregnancy.</p> Conclusion <p>Research is warranted to evaluate the choice of antihypertensives and optimal timing to switch to safer alternatives, considering maternal and fetal outcomes.</p>","author":"Yanning Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7f3d419b6a561faabae8d000f38cdd5e88139870a18ed575ff6ee5c9e0997aef","category":"Interdisciplinary"}