{"title":"224 Yield and nutritive values of a polycrop and annual cereal monoculture used in winter swath grazing","link":"https://academic.oup.com/jas/article/102/Supplement_3/187/7757197?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This 3-yr study evaluated a comparative biomass yield and nutritive values of 2 forage systems: 1) a cereal monoculture (CDC-SO1 oats) and 2) a polycrops (PC) consisting of oat, brassicas (turnip and rape) and forage pea (4010) harvested at the hard dough (HD) stage for winter swath grazing purpose. A 12-ha field was divided into six, 2-ha paddocks, where each paddock was randomly assigned to 1 of 2 replicated (n = 3) forage systems. Forages were seeded in June and sampled for biomass yield and nutritive value at the soft dough (SD) and HD stages of oats. The seeding rate of oat monoculture (OM) was 157 kg/ha, while the PC was 45 kg/ha (oat), 11 kg/ha (forage pea) and 6 kg/ha (brassica). Forage samples were collected from a 0.6 m<sup>2</sup> area at 24 pre-selected GPS points (4 per paddock), weighed and then oven-dried to a constant weight to determine DM yield. Data were analyzed using the PROC MIXED procedure of SAS and included treatment effects and treatments × stage interactions. Year was treated as a random effect due to climatic variations across years. For OM, there was a significant difference (<span>P</span> = 0.03) in biomass yield between SD (7,762.7 ± 1,217.9 kg/ha) and HD (8,902.8 ± 1,217.9 kg/ha) stages, while PC biomass yield did not differ (<span>P</span> = 0.94) between SD (5,922.4 ± 1,217.9 kg/ha) and HD (6,163.1±1,217.9 kg/ha) stages. The biomass yields between the two forage systems were different (<span>P</span> &lt; 0.05) at the SD and HD stages. Crude protein (CP) concentration did not differ (<span>P</span> &gt; 0.05) between the OM and PC at SD (10.4 vs 10.3%) and HD (8.9 vs 9.6%) stages. At the SD stage, significant differences (<span>P</span> &lt; 0.05) between OM and the PC were observed for neutral detergent fiber (NDF, 50.9 vs 44.1%), calcium (0.2 vs 0.5%), phosphorus (0.2 vs 0.3%), and RFV-relative feed value (120.3 vs 142.2). Similarly, the starch (20.9 vs 16.5%), calcium (0.2 vs 0.5%), and phosphorus (0.2 vs 0.3%) values for OM and PC, respectively, also differed (<span>P</span> &lt; 0.05) at the HD stage. Differences (<span>P</span> &lt; 0.05) were observed between the SD and HD stages of OM for acid detergent fiber (ADF, 30.1 vs 27.0%), total digestible nutrient (TDN, 65.4 vs 67.9%), and starch (14.9 vs 20.9%) content, respectively. Study results suggest that swathing OM at the HD stage would be beneficial in terms of greater biomass yield without compromising quality, while PC can be harvested at either SD or HD stages based on the annual cereal component. Also, the lack of significant difference in the RFV, CP and TDN values between the PC and OM at the HD stage suggests that PC could be a viable alternative forage system for winter swath grazing.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7f3f919a45233d575127776bce8f9837b1fbd4cfbb8630867f3423f9e0edc59c","category":"Environment"}