{"title":"Effects of Soil Microorganisms on Carbon Sequestration under Different Mixed Modification Modes of Pinus massoniana","link":"https://www.preprints.org/manuscript/202405.0674/v1","date":1715330455000,"content":"In forests, the microbial populations living in the soil can directly affect the carbon decomposed by the surface plants, and promote carbon storage and stability. In this study, 3 plots of 25.82 m×25.82 m were set up in 5 stand types, respectively. Soil samples were collected from 0~20 cm, 20~40 cm and 40~60 cm layers. Soil microbial composition, organic carbon component, pH, water content, bulk density, nitrogen, phosphorus, potassium and other physicochemical indexes and correlations were determined, and the correlations between soil carbon components and soil microbial functional modules in different mixed modes were analyzed. The results showed that: (1) The SOC of the same soil layer varied significantly, which also showed significant differences on the composition of soil bacteria and fungal microbial communities. Moreover, the bacterial community was more sensitive to the vegetation change environment, and the fungal community structure was more resistant to the influence of soil environment changes. (2) Fun_mod 1,6 and Bac_mod 7 were the microbial functional modules that played a decisive role in the process of soil carbon pool change, and the diversity and composition of bacterial community had more positive effects on soil organic carbon than that of fungal community. (3) Linear fitting and RDA results showed that POC in soil had the strongest correlation with SOC content, indicating that soil microorganisms affected the storage and stability of soil carbon mainly by regulating the conversion of surface plants (carbon sources) into POC. The soil environment of different mixed modes has different effects on soil carbon accumulation. Soil microorganisms affect soil carbon storage and stability mainly by regulating the conversion of surface plants (carbon sources) into POC forms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7f4012d2e7371e0fbb3278afbbf5ede6974b094d3d11c0ad6e335f3785b226ee","category":"Interdisciplinary"}