{"title":"Identification and counting of fish targets using adaptive resolution imaging sonar","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15349?af=R","date":1709090576000,"content":"<h2>Abstract</h2>\n<p>Fish are a critical component of marine biology; therefore, the accurate identification and counting of fish are essential for the objective monitoring and assessment of marine biological resources. High-frequency adaptive resolution imaging sonar (ARIS) is widely used for underwater object detection and imaging, and it quickly obtains close-up video of free-swimming fish in high-turbidity water environments. Nonetheless, processing the massive data output using imaging sonars remains a major challenge. Here, the authors developed an automatic image-processing programme that fuses K-nearest neighbour background subtraction with DeepSort target tracking to automatically track and count fish. The automatic programme was evaluated using four test data sets with different target sizes and observation ranges and differently deployed sonars. According to the results, the approach successfully counted free-swimming fish targets with an accuracy index of 73% and a completeness index of 70%. Under appropriate conditions, this approach could replace time-consuming semi-automatic approaches and improve the efficiency of imaging sonar data processing, while providing technical support for future real-time data processing.</p>\n<h2>摘要</h2>\n<p>鱼类作为海洋生物的关键组成部分，其鱼类目标的准确识别与计数对海洋生物资源的客观监测和评估至关重要。高频自适应分辨率成像声呐广泛地应用于水下目标成像和检测，在高浑浊水环境中能迅速获得自由游动鱼类的近距离视频。然而，大量成像声呐数据处理输出仍是一个主要挑战。本文优化了K-近邻背景差分与DeepSort目标追踪算法实现了鱼类目标的自动追踪与计数。该程序采用不同目标尺寸、观测场景和声呐部署的三个数据集进行评估。结果表明，该方法成功地对自由游动的鱼类目标进行了计数，准确率为73%，完整性指数为70%。在适当的条件下，该方法可以代替耗时的成像声呐数据半自动处理方法，提高成像声呐数据处理效率，同时为未来的实时声呐数据处理提供技术支持。</p>","author":"Wei Shen, \nZhanfei Peng, \nJin Zhang","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"7f43453304fba77cf3a12f41815ce9341680bfe271dc0587cc08bfbe5d2f4ae7","category":"Environment"}