{"title":"Relative impacts of Varroa destructor (Mesostigmata:Varroidae) infestation and pesticide exposure on honey bee colony health and survival in a high-intensity corn and soybean producing region in northern Iowa","link":"https://academic.oup.com/jinsectscience/article/doi/10.1093/jisesa/ieae054/7683874?rss=1","date":1716854400000,"content":"<span><div>Abstract</div>The negative effects of <span>Varroa</span> and pesticides on colony health and survival are among the most important concerns to beekeepers. To compare the relative contribution of <span>Varroa</span>, pesticides, and interactions between them on honey bee colony performance and survival, a 2-year longitudinal study was performed in corn and soybean growing areas of Iowa. <span>Varroa</span> infestation and pesticide content in stored pollen were measured from 3 apiaries across a gradient of corn and soybean production areas and compared to measurements of colony health and survival. Colonies were not treated for <span>Varroa</span> the first year, but were treated the second year, leading to reduced <span>Varroa</span> infestation that was associated with larger honey bee populations, increased honey production, and higher colony survival. Pesticide detections were highest in areas with high-intensity corn and soybean production treated with conventional methods. Pesticide detections were positively associated with honey bee population size in May 2015 in the intermediate conventional (IC) and intermediate organic (IO) apiaries. <span>Varroa</span> populations across all apiaries in October 2015 were negatively correlated with miticide and chlorpyrifos detections. Miticide detections across all apiaries and neonicotinoid detections in the IC apiary in May 2015 were higher in colonies that survived. In July 2015, colony survival was positively associated with total pesticide detections in all apiaries and chlorpyrifos exposure in the IC and high conventional (HC) apiaries. This research suggests that <span>Varroa</span> are a major cause of reduced colony performance and increased colony losses, and honey bees are resilient upon low to moderate pesticide detections.</span>","author":"","siteTitle":"Journal of Insect Science Current Issue","siteHash":"138510f205cdefe00e375766040cc54e40d9554d03e26ae63e2eb3fff292ac04","entryHash":"7f433b4bf2a8c65745eebabbff8662db50d4b406db4b5cdde27f1f1113104196","category":"Environment"}