{"title":"Astropad Slate iPad App Lets You Control Your Mac With Apple Pencil","link":"https://www.macrumors.com/2023/10/12/astropad-slate-ipad-app/","date":1697153793000,"content":"Astropad today announced a new <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> app called <a href=\"https://astropad.com/slate/\">Astropad Slate</a>, which can be used to control the Mac with an <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>. Astropad Slate is available as a public beta, and because it's still in testing, it is free for everyone.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/astropad-slate-ipad.jpg\" alt width=\"1999\" height=\"1124\" />\r<br />\nThere are several Mac functions that can be performed with the ‌Apple Pencil‌. It works as a cursor for controlling the desktop mouse, with a tap on the screen serving as a click. Handwriting done on the ‌iPad‌ will be translated into typed text on the Mac. Astropad Slate supports the ‌Apple Pencil‌ hover gestures on newer iPads, and there is a simulated hover option on older iPads, plus you can use two-finger touch gestures for actions like scrolling and zoom.\r<br />\n\r<br />\n<div></div>\r<br />\nYou can also use the ‌iPad‌ as a pen tablet with Mac apps that support drawing, sketching, and other creative work. The Astropad Slate app basically turns the ‌iPad‌ into a no-screen drawing tablet so you can focus on your work on the Mac. A Mac and an ‌iPad‌ can be connected using Wi-Fi, Peer-to-Peer networking, or an appropriate USB cable. Requirements include iPadOS 15 or later and macOS 11 or later.\r<br />\n\r<br />\nThe Astropad Slate app can be accessed by signing up for the beta <a href=\"https://astropad.com/slate/\">on the Astropad website</a>. \r<br />\n<br />This article, \"<a href=\"https://www.macrumors.com/2023/10/12/astropad-slate-ipad-app/\">Astropad Slate iPad App Lets You Control Your Mac With Apple Pencil</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/astropad-slate-ipad-app-lets-you-control-your-mac-with-apple-pencil.2407381/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7f46ca4a10fafd80ed037d2d9c234a1b7962ead994343bc98e16bfa898461fdd","category":"Apple"}