{"title":"Hyundai’s 2022 Tucson Hybrid is a charming and efficient crossover","link":"https://arstechnica.com/?p=1775917","date":1624536825000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/2022-Hyundai-Tucson-hybrid-1-980x735.jpg\" /></div>\n        <p>\n          Hyundai describes the styling of the 2022 Tucson Hybrid as \"Parametric Dynamics.\"                       [credit:\n                        Jonathan Gitlin                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>I'm not sure what they feed the engineers at the Hyundai HQ cafeteria in Seoul, but whatever it is, it's working. The Korean automaker has been on a hot streak the past few years; it has upped its game across the board, whether that's in design, build quality, or efficiency. The 2022 Tucson Hybrid crossover is yet another data point to support that claim. The vehicle offers sharp looks, an interesting interior, and 38 mpg (6.2 L/100km), starting at just $29,050.</p>\n<p>The Tucson first appeared at the dawn of the crossover era in 2004. For this generation, Hyundai has lengthened the wheelbase of Tucsons destined for the North American market to 108.5 inches (2,756 mm). Overall length is still a manageable 182.3 inches (4,630 mm), with a width of 73.4 inches (1,864 mm) and a height of 65.6 inches (1,666 mm). As ever, a car's styling is subjective, but in this case, I think design director SangYup Lee's team did a decent job. They're calling the faceted style \"Parametric Dynamics.\" The daytime running lights are incorporated into the sides of the Hyundai grille, and the distinctive taillights remind me somewhat of the Ford Mustang Mach-E.</p>\n<h2>38 mpg</h2>\n<p>Normal Tucsons are powered by a 2.5 L engine, and there's a plug-in hybrid Tucson due later this year. Today, we're only concerned with the not-plug-in Hybrid, which uses a 1.6 L turbocharged four-cylinder gasoline direct-injection engine. On its own, the engine is almost as powerful as the bigger engine and is more torquey, providing 180 hp (134kW) and 195 lb-ft (264 Nm). But since it's a hybrid, it also gets the benefit of a 59 hp (44.2 kW), 195 lb-ft (264 Nm) electric motor that's fed from a 1.5 kWh lithium-ion polymer battery. As ever, it's not quite as simple as just adding the total outputs of the electric motor and internal combustion engine together (since they won't both make peak power at the same time), but total output is 226 hp (169 kW) and 258 lb-ft (350 Nm).</p></div><p><a href=\"https://arstechnica.com/?p=1775917#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775917&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7f49dc2b4e9b5cb38867c04b43b93e7dd2f66f185b78f790a9afae922725ec67","category":"Tech"}