{"title":"Farmers’ Willingness to Participate in a Carbon Sequestration Program – A Discrete Choice Experiment","link":"http://link.springer.com/10.1007/s00267-024-01963-9","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <p>Farmers can counteract global warming by drawing carbon dioxide from the air into agricultural soils by building up humus. Humus programs were developed to motivate farmers for even more humus formation (= carbon sequestration) through an additional financial incentive. These programs are still at an early stage of development, which is why the number of participating farmers and research work is still low. This study is the first to analyze the willingness of German farmers to participate in hypothetical humus programs. The results of a discrete choice experiment show that a (higher) threshold for the payout of the premium, regional (rather than field-specific) reference values, and the risk of repayment clearly discourage farmers from participating. Program providers must more than double the premium (set at around 240 € per hectare and 0.1% humus increase) to maintain farmers’ willingness to participate despite a payout threshold. Regional reference values and an additional premium/repayment system would lead to an increase in the premium of around 20 € per hectare in order to keep the willingness to participate at the same level. The motivation to build up humus, the desire to maximize subsidies, and a higher livestock density have a positive influence on farmers’ decision to participate. Farm size and risk attitude have an impact on farmers’ preferences for program design. The study is relevant for policymakers and non-governmental organizations concerned with carbon management, as our findings highlight pathways for efficient, targeted designs of humus programs and carbon sequestration policies.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"7f5c5449d728a4214a352369cef2d568eec00ace49217861660fef6e4275f361","category":"Environment"}