{"title":"Does losing reduce the tendency to engage with rivals to reach mates? An experimental test","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae037/7664138?rss=1","date":1714694400000,"content":"<span><div>Abstract</div>Male–male contests for access to females or breeding resources are critical in determining male reproductive success. Larger males and those with more effective weaponry are more likely to win fights. However, even after controlling for such predictors of fighting ability, studies have reported a winner–loser effect: previous winners are more likely to win subsequent contests, while losers often suffer repeated defeats. While the effect of winning–losing is well-documented for the outcome of future fights, its effect on other behaviors (e.g. mating) remains poorly investigated. Here, we test whether a winning versus losing experience influenced subsequent behaviors of male mosquitofish (<span>Gambusia holbrooki</span>) toward rivals and potential mates. We housed focal males with either a smaller or larger opponent for 24 h to manipulate their fighting experience to become winners or losers, respectively. The focal males then underwent tests that required them to enter and swim through a narrow corridor to reach females, bypassing a cylinder that contained either a larger rival male (competitive scenario), a juvenile or was empty (non-competitive scenarios). The tests were repeated after 1 wk. Winners were more likely to leave the start area and to reach the females, but only when a larger rival was presented, indicating higher levels of risk-taking behavior in aggressive interactions. This winner–loser effect persisted for at least 1 wk. We suggest that male mosquitofish adjust their assessment of their own and/or their rival’s fighting ability following contests in ways whose detection by researchers depends on the social context.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"7f684855fde6468d1cd62bada48ace546bf855cf851a679f58150bb3a19d548c","category":"Environment"}