{"title":"Apple Tries to Explain to U.K. Legislators That You Can’t Add Back Doors to Secure Protocols","link":"https://www.bbc.com/news/technology-66256081","date":1689902315000,"content":"\n<p>Zoe Kleinman, reporting for BBC News:</p>\n\n<blockquote>\n  <p>Apple says it will remove services such as FaceTime and iMessage\nfrom the UK rather than weaken security if new proposals are made\nlaw and acted upon.</p>\n\n<p>The government is seeking to update the Investigatory Powers Act\n(IPA) 2016. It wants messaging services to clear security features\nwith the Home Office before releasing them to customers. The act\nlets the Home Office demand security features are disabled,\nwithout telling the public. Under the update, this would have to\nbe immediate. [...]</p>\n\n<p>WhatsApp and Signal are among the platforms to have opposed a\nclause in the Online Safety Bill allowing the communications\nregulator to require companies to install technology to scan for\nchild-abuse material in encrypted messaging apps and other\nservices. They will not comply with it, they say, with Signal\nthreatening to “walk” from the UK.</p>\n</blockquote>\n\n<p>The BBC headline here is fair: “Apple Slams UK Surveillance-Bill Proposals”. Techmeme’s rewrite of the headline is not: “Apple Threatens to Remove Services Like FaceTime and iMessage From the UK Rather Than Weaken Their Security Under a Proposed Investigatory Powers Act Amendment”. Usually this works the other way around — Techmeme typically rewrites headlines to add clarity and omit clickbait-yness. But Apple (and Signal, and WhatsApp) aren’t making threats here. They’re patiently explaining that E2EE messaging platforms <em>cannot</em> comply with what the U.K. wants to demand. It’d be like trying to comply with a law that declares 1 + 1 = 3.</p>\n\n<p>The U.K. legislators pushing this erroneously believe that it must be possible for these messaging platforms to add “good guys only” back doors. That if they pass this law, the result will be that the nerds who work at these companies will be forced to figure out a way to comply. What will actually happen is that these companies will be forced to pull the services from U.K., because they can’t comply, unless they scrap their current end-to-end encryption and replace it — worldwide — with something insecure, which they aren’t going to do.</p>\n\n<p>The UK, of course, is no longer part of the EU, but the unintended consequences are similar: <em>the intention</em> of the EU’s Digital Markets Act (well, one intention among many) is to force big social networks to collect data in ways that are more respectful of users’ privacy. The actual result is that Threads launched everywhere else in the world <em>but</em> the EU. The <em>intention</em> of the UK’s proposed update to the IPA is force messaging platforms to make profound technical changes that would allow law enforcement to snoop on messages; the result, if it goes into effect, will be to force those messaging platforms out of the UK.</p>\n\n<p>And while it’s Apple and iMessage/FaceTime that are getting the headlines today, <a href=\"https://www.messengerpeople.com/whatsapp-user-base-uk/\">it’s WhatsApp that’s the big player in the UK</a>, with 75 percent of adult Britons using it monthly. It’s hard to overstate how much outrage these legislators are poised to bring upon themselves if they effectively ban WhatsApp. (The legislators themselves surely all depend upon it.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/07/20/apple-uk-e2ee\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"7f695a588932762232e87a046557f26428fdf1aaed2b7ee179b5b608866a1957","category":"Tech"}