{"title":"Can we drill for hydrogen? New find suggests additional geological source.","link":"https://arstechnica.com/?p=2005627","date":1708712191000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-5-800x600.jpeg\" alt=\"Image of apartment buildings with mine tailings behind them, and green hills behind those.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-5.jpeg\">Enlarge</a> <span>/</span> Mining operations start right at the edge of Bulqizë, Albania. (credit: <a href=\"http://creativecommons.org/licenses/by-sa/3.0/\">Wikimedia Commons</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>“The search for geologic hydrogen today is where the search for oil was back in the 19th century—we’re just starting to understand how this works,” said Frédéric-Victor Donzé, a geologist at Université Grenoble Alpes. Donzé is part of a team of geoscientists studying a site at Bulqizë in Albania where miners at one of the world’s largest chromite mines may have accidentally drilled into a hydrogen reservoir.</p>\n<p>The question Donzé and his team want to tackle is whether hydrogen has a parallel geological system with huge subsurface reservoirs that could be extracted the way we extract oil. “Bulqizë is a reference case. For the first time, we have real data. We have a proof,” Donzé said.</p>\n<h2>Greenish energy source</h2>\n<p>Water is the only byproduct of burning hydrogen, which makes it a potential go-to green energy source. The problem is that the vast majority of the 96 million tons of hydrogen we make each year comes from processing methane, and that does release greenhouse gases. Lots of them. “There are green ways to produce hydrogen, but the cost of processing methane is lower. This is why we are looking for alternatives,” Donzé said.</p></div><p><a href=\"https://arstechnica.com/?p=2005627#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2005627&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7f6ca566c0bbc87c45253e98388b19f970d80cbbe2d9b9f5b04d09f3717a4b7f","category":"Tech"}