{"title":"Misaligned or misheard? Physical activity and healthy eating messaging to ethnic minority communities during the COVID-19 pandemic: A qualitative study and scoping review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003345","date":1727964000000,"content":"<p>by Olatundun Gafari, Sandra Agyapong-Badu, Nisreen A. Alwan, Mark A. Tully, Suzanne McDonough, Maria Stokes, Mary Barker</p>\r\n\r\nThis mixed-methods study identified physical activity (PA) and healthy eating messages produced during the COVID-19 pandemic and explored how they were received by UK ethnic minority communities. A scoping review of research and grey literature identified categories of PA and healthy eating messaging targeted at ethnic minorities. Individual and group interviews were conducted, audio-recorded, transcribed and analysed using inductive thematic analysis. There was active community engagement in all study phases to ensure relevance and co-production of findings. Interviews were held with 41 study participants aged 18–86 years (20 men) residing in England and Wales using digital conferencing and in person. The scoping review identified 24 records containing messages grouped into three categories: 1) PA messages; 2) healthy eating messages; 3) risk messages. Five themes described participants’ views of these messages: 1) lack of awareness of messaging; 2) responses to PA messaging; 3) responses to healthy eating messaging; 4) perceptions of risk messaging and 5) perceptions of conflict in messages. The review revealed that physical activity and healthy eating messaging specifically targeting ethnic minority communities is limited. This limited messaging was almost entirely missed by these communities. When received, the messaging was not interpreted as intended, perceived to be conflicting and risk messaging was perceived as blaming. More work with ethnic minority communities needs to be done to co-produce meaningful and appropriate PA and healthy eating messaging in a timely manner.","author":"Olatundun Gafari","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"7f6fbce1559dbfdaada8435f765b7ecb542d230cc3c5fdf7ac9e3956ec4de1b5","category":"Environment"}