{"title":"Use of malaria rapid diagnostic test and anti-malarial drug prescription practices among primary healthcare workers in Ebonyi state, Nigeria: An analytical cross-sectional study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304600","date":1717509600000,"content":"<p>by Ugwu I. Omale, Benedict N. Azuogu, Adaoha P. Agu, Edmund N. Ossai</p>\r\nBackground <p>The recommendation of universal diagnostic testing before malaria treatment aimed to address the problem of over-treatment with artemisinin-based combination therapy and the heightened risk of selection pressure and drug resistance and the use of malaria rapid diagnostic test (MRDT) was a key strategy, particularly among primary healthcare (PHC) workers whose access to and use of other forms of diagnostic testing were virtually absent. However, the use of MRDT can only remedy over-treatment when health workers respond appropriately to negative MRDT results by not prescribing anti-malarial drugs. This study assessed the use of MRDT and anti-malarial drug prescription practices, and the predictors, among PHC workers in Ebonyi state, Nigeria.</p> Methods <p>We conducted an analytical cross-sectional questionnaire survey, among consenting PHC workers involved in the diagnosis and treatment of malaria, from January 15, 2020 to February 5, 2020. Data was collected via structured self-administered questionnaire and analysed using descriptive statistics and bivariate and multivariate generalized estimating equations.</p> Results <p>Of the 490 participants surveyed: 81.4% usually/routinely used MRDT for malaria diagnosis and 18.6% usually used only clinical symptoms; 78.0% used MRDT for malaria diagnosis for all/most of their patients suspected of having malaria in the preceding month while 22.0% used MRDT for none/few/some; 74.9% had good anti-malarial drug prescription practice; and 68.0% reported appropriate response to negative MRDT results (never/rarely prescribed anti-malarial drugs for the patients) while 32.0% reported inappropriate response (sometimes/often/always prescribed anti-malarial drugs). The identified predictor(s): of the use of MRDT was working in health facilities supported by the United States’ President’s Malaria Initiative (PMI-supported health facilities); of good anti-malarial drug prescription practice were having good opinion about MRDT, having good knowledge about malaria diagnosis and MRDT, being a health attendant, working in PMI-supported health facilities, and increase in age; and of appropriate response to negative MRDT results was having good opinion about MRDT.</p> Conclusions <p>The evidence indicate the need for, and highlight factors to be considered by, further policy actions and interventions for optimal use of MRDT and anti-malarial drug prescription practices among the PHC workers in Ebonyi state, Nigeria, and similar settings.</p>","author":"Ugwu I. Omale","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7f7d69989504e2617de6a032f230da302c882a2197dd8d728aa641e9549649af","category":"Interdisciplinary"}