{"title":"Not all maps are equal: Evaluating approaches for mapping vessel collision risk to large baleen whales","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14794?af=R","date":1729137670000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/cbd41b55-224a-436d-a692-4ddd1997fc2d/jpe14794-toc-0001-m.png\" alt=\"Not all maps are equal: Evaluating approaches for mapping vessel collision risk to large baleen whales\" />\n<p>The approach used to map risk (here, vessel collision to whales), affected the location, and total area, identified as ‘high risk’. The variation in outputs, depending on approach used, underscores the importance of methodological transparency, informed data selection and careful interpretation when predicting collision risk. We provide practical recommendations for enhancing transparency when predicting risk, and discuss choice of approach suitable for different situations or management applications. It is critical that managers and policy makers are aware of the implications of applying different approaches when interpreting risk evaluation outputs.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nA growing and increasingly globalised human population, requiring the movement of goods and commodities, is placing increasing demands on the maritime industry, resulting in a concurrent increase in global shipping activities. This has consequences for the marine environment, particularly for species vulnerable to the impacts of vessel traffic. For example, vessel collisions can result in sub-lethal or fatal injuries for marine mammals, whilst vessel noise can cause acoustic masking that effectively reduces an animal's listening space, potentially impacting their communication, navigation and foraging capacity.\n\nWhile a number of parallel approaches to mapping collision risk to large whales have arisen, these methods vary in their focus, usually on either co-occurrence, collision probability, or probability of mortality. However, little attention has been given to the implications of methodological choice and data selection on subsequent risk predictions.\n\nTo assess differences between these approaches, we used a standardised input dataset comprised of telemetry-point data from tagged bowhead whales, and satellite-based Automated Identification System (AIS) data of spatial vessel movements covering the Davis-Baffin Arctic Marine Area. We applied this data to eight different, previously published analyses for deriving areas of vessel risk.\n\nWe found that the choice of risk mapping approach affected the location, and total area, identified as ‘high risk’, and that more computationally complex approaches did not necessarily equate to different predictions. There was considerable variation in the total area of ‘high risk’ predicted within each map (range = 20–42,246 km<sup>2</sup>).\n\n<i>Synthesis and Applications</i>. The results underscore the importance of methodological transparency, informed data selection and careful interpretation when predicting collision risk. We provide practical recommendations for enhancing transparency when predicting risk, and discuss choice of approach suitable for different situations or management applications. It is critical that managers and policy makers are aware of the implications of applying different approaches when interpreting risk evaluation outputs.\n</p>","author":"E. L. Hague, \nW. D. Halliday, \nJ. Dawson, \nS. H. Ferguson, \nM. P. Heide‐Jørgensen, \nN. Serra Sogas, \nK. Gormley, \nB. G. Young, \nL. H. McWhinnie","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"7f8c2ac1eff0df6421ee3528d138cf5402dd6727df90991c3961eeeebd0516fa","category":"Environment"}