{"title":"Improved Production Process Map and Safety of Millet‐Based Fermented Beverage","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400166?af=R","date":1729491571000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b0254d3b-9dfe-4b47-b59a-caecb49d026f/appl202400166-gra-0001-m.png\" alt=\"Improved Production Process Map and Safety of Millet-Based Fermented Beverage\" /><p>An improved production process map has been developed from existing industrial practices, previous findings and personal experiences of the authors to enhance the safety and consumer acceptance of <i>Brukina</i> beverages. By adopting this food safety practice, the market and economic value of the <i>Brukina</i> industry will be enhanced significantly.\n\n</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>The present study aimed to develop a standardized process map to produce a microbiologically safe and consumer-acceptable <i>Brukina</i> beverage. Field interactions and observations were employed for the baseline data, while an improved production process was developed and utilized to produce a <i>Brukina</i> beverage. The microbial safety of the new approach was assessed by determining the total coliform, yeast and mold, as well as <i>Staphylococcus aureus</i>. A consumer preference test was conducted to validate the contribution of the improved and hygienic steps to the overall acceptability. The existing production processes for manufacturing <i>Brukina</i> beverage did not embrace Good Manufacturing Practices (GMPs) and as such, the resultant beverage was contaminated with coliforms and <i>S. aureus</i>. Moreover, the sensory characteristics including taste, mouthfeel, viscosity and overall acceptability, were negatively affected. The inclusion of food safety management practices and efficient production steps has a greater tendency of producing microbiologically safe and market-acceptable fermented millet-based beverages while safeguarding consumers’ health and satisfaction.</p>","author":"Eric Owusu Mensah, \nEmmanuel Boakye Asare","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"7f8ecdc28414a168f187fb6d7ee9a1b1181f5813c3f6fcddd21bdc839ef2bb12","category":"Environment"}