{"title":"Apple TV Won't Support Hi-Res Lossless at Launch, AirPods Max Wired Playback 'Will Not Be Completely Lossless'","link":"https://www.macrumors.com/2021/05/22/apple-tv-airpods-max-lossless-audio-details/","date":1621691629000,"content":"Apple today shared a new <a href=\"https://support.apple.com/en-us/HT212183\">support document</a> confirming that the <a href=\"https://www.macrumors.com/2021/05/22/homepod-apple-music-lossless-future-update/\">HomePod and HomePod mini will gain lossless audio support for Apple Music in a future software update</a>, and the document also reveals some other tidbits.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airpods-max-lifestyle.jpg\" />\r\n<br />\r\nFirst, the document indicates that the Apple TV 4K \"currently doesn't support Hi-Res Lossless,\" with only the standard Lossless tier ranging from 16-bit at 44.1 kHz to 24-bit at 48 kHz to be available on the Apple TV 4K at launch. Apple's use of the word \"currently\" leaves the door open to a future software update with Hi-Res Lossless support for the device, but Apple has not confirmed this at this time.\r\n<br />\r\n\r\n<br />\r\nSecond, the document says that Apple Music \"will not be completely lossless\" during wired playback with the AirPods Max:<blockquote>The Lightning to 3.5 mm Audio Cable was designed to allow AirPods Max to connect to analog sources for listening to movies and music. AirPods Max can be connected to devices playing Lossless and Hi-Res Lossless recordings with exceptional audio quality. However, given the analog to digital conversion in the cable, the playback will not be completely lossless.</blockquote>Lossless audio refers to a form of compression that preserves all of the original data, which can result in an improved listening experience, although to what extent is debated. Apple's support document acknowledges that the difference between Apple Music's standard audio and lossless audio will be \"virtually indistinguishable.\" \r\n<br />\r\n\r\n<br />\r\nLossless audio <a href=\"https://www.macrumors.com/2021/05/17/apple-music-spatial-audio-announced/\">will be available in June</a> for all Apple Music subscribers at no additional cost on devices running iOS 14.6, iPadOS 14.6, macOS 11.4, and tvOS 14.6 or later, according to Apple. Apple Music will have 20 million tracks available with lossless audio at launch, and Apple said 75 million tracks will be supported by the end of the year.\r\n<br />\r\n\r\n<br />\r\nApple Music will also be gaining support for Spatial Audio in June. Based on Dolby Atmos, this feature will provide an immersive three-dimensional audio experience that will make music sound like it is coming from all around you. Thousands of Apple Music tracks will support Spatial Audio at launch, with more added regularly.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a>, <a href=\"https://www.macrumors.com/roundup/tvos-14/\">tvOS 14</a>, <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_TV\">Apple TV (Buy Now)</a>, <a href=\"https://buyersguide.macrumors.com/#AirPods-Max\">AirPods Max (Buy Now)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/apple-tv-and-home-theater.100\">Apple TV and Home Theater</a>, <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/22/apple-tv-airpods-max-lossless-audio-details/\">Apple TV Won't Support Hi-Res Lossless at Launch, AirPods Max Wired Playback 'Will Not Be Completely Lossless'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-tv-wont-support-hi-res-lossless-at-launch-airpods-max-wired-playback-will-not-be-completely-lossless.2297227/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wWjiqKW0P28:U2QOn5uopsI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=wWjiqKW0P28:U2QOn5uopsI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/wWjiqKW0P28\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"7f9ab137c75b9bea62bde2592834eb434a86b573a913ed5f916ed153ed28e0b6","category":"Apple"}