{"title":"These are the 9 worst states to buy an electric car in","link":"https://arstechnica.com/?p=1775256","date":1624374486000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-671540056-800x332.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-671540056.jpg\">Enlarge</a> <span>/</span> America is a land of contrasts. (credit: stellalevi/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>William Gibson's quote about the future being here, just not very evenly distributed, is a cliché at this point. But I was reminded of it this morning when I saw <a href=\"https://consumerchoicecenter.org/wp-content/uploads/2021/06/US-Electric-Vehicle-Accessibilty-Index.pdf\">a new report on electric vehicle accessibility</a>. Compiled by the Consumer Choice Center (CCC), the report scores all 50 states based on how hard they make it to buy an EV, whether that's banning direct-to-consumer sales or requiring extra registration fees or <a href=\"https://arstechnica.com/cars/2020/01/to-replace-gas-taxes-oregon-and-utah-ask-evs-to-pay-for-road-use/\">road charges</a>. Unsurprisingly, the United States is a bit of a patchwork in this regard. But it's not quite as simple as red states making it hard and blue states making it easy to buy an EV.</p>\n<h2>The top 10</h2>\n<p>Ten states score top marks with the CCC: Alaska, Arizona, Delaware, Florida, Maine, Massachusetts, Missouri, New Hampshire, Rhode Island, and Vermont. All these states will allow direct sales of cars to individuals, and none will make you pay more to register your new EV than you'd pay for a new car with an internal combustion engine (ICE). (The District of Columbia would also go in this group if DC-based CCC had included it.)</p>\n<p>California is conspicuous by its absence in that top 10. The state is the leading market for EVs within the US, with <a href=\"https://quotewizard.com/news/posts/top-states-for-electric-vehicle-infrastructure\">the highest adoption rate</a> and the most public chargers. <a href=\"https://evadoption.com/ev-market-share/ev-market-share-state/\">Nearly half of all US-registered EVs</a> are on its roads. But California also has an escalating EV license fee that's currently $100 but is now linked to the consumer price index.</p></div><p><a href=\"https://arstechnica.com/?p=1775256#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775256&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7f9abb7a1bb798b5fce621a93355fb70260056296410eb58f22d58906034ad29","category":"Tech"}