{"title":"Development of an application programming interface to automate downloading and processing of precision livestock data","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae092/7689433?rss=1","date":1717718400000,"content":"<span><div>Abstract</div>Advancements in technology have ushered in a new era of sensor-based measurement and management of livestock production systems. These sensor-based technologies have the ability to automatically monitor feeding, growth, and enteric emissions for individual animals across confined and extensive production systems. One challenge with sensor-based technologies is the large amount of data generated, which can be difficult to access, process, visualize, and monitor information in real time to ensure equipment is working properly and animals are utilizing it correctly. A solution to this problem is the development of application programming interfaces (<strong>APIs</strong>) to automate downloading, visualizing, and summarizing datasets generated from precision livestock technology (<strong>PLT</strong>). For this methods paper, we develop three APIs and accompanying processes for rapid data acquisition, visualization, systems tracking, and summary statistics for three technologies (SmartScale, SmartFeed, and GreenFeed) manufactured by C-Lock Inc (Rapid City, SD). Program R markdown documents and example datasets are provided to facilitate greater adoption of these techniques and to further advance PLT. The methodology presented successfully downloaded data from the cloud and generated a series of visualizations to conduct systems checks, animal usage rates, and calculate summary statistics. These tools will be essential for further adoption of precision technology. There is huge potential to further leverage APIs to incorporate a wide range of datasets such as weather data, animal locations, and sensor data to facilitate decision-making on time scales relevant to researchers and livestock managers.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"7f9d244da8c23391063e097010e7e20466b826fa72541e22b6880eb575b179af","category":"Environment"}