{"title":"Protein‐Sparing Effect of α‐Lipoic Acid in Diets with Different Protein/Carbohydrate Ratios for the Oriental River Prawn, Macrobrachium nipponense","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/5614359?af=R","date":1682319600000,"content":"<p>Carbohydrates are commonly used in aquaculture feed because they are the cheapest energy source. Promoting carbohydrate catabolism for energy production can increase the dietary protein utilization efficiency (i.e., a protein-sparing effect). Alpha-lipoic acid (<i>α</i>-LA) is a cofactor of some rate-limiting key enzymes (pyruvate dehydrogenase complex and <i>α</i>-ketoglutarate dehydrogenase) in carbohydrate metabolism. To determine whether <i>α</i>-LA could promote carbohydrate catabolism to have a protein-sparing effect, we investigated the growth, activities of key enzymes involved in carbohydrate metabolism, transcript levels of genes encoding enzymes involved in energy metabolism, and the hepatopancreas structure of <i>Macrobrachium nipponense</i> fed with diets containing different protein/carbohydrate ratios (P/C) with and without <i>α</i>-LA. Six experimental diets for <i>M. nipponense</i> were formulated with casein and fish meal as the protein sources, fish oil and soybean oil as the lipid sources, and corn starch as the carbohydrate source. The six diets consisted of three different P/Cs (P41/C18, P37/C24, and P33/C30) without or with <i>α</i>-LA (at 1300 mg/kg). Each diet had six replicates and was fed to prawns (initial weight 0.110 ± 0.010 g) twice daily to apparent satiation. Dietary supplementation with <i>α</i>-LA significantly increased the survival rate of prawns, regardless of the P/C ratio. In the low-P/C group (P33/C30), the weight gain did not vary between those that consumed <i>α</i>-LA and those that did not. The P/C ratio and <i>α</i>-LA significantly affected the activities of key enzymes involved in glycolysis and the citric acid cycle. In the P41/C18 group, the hexokinase (HK) and pyruvate dehydrogenase (PDH) activities were significantly higher in prawns that consumed <i>α</i>-LA than in those that did not. In both the P37/C24 and P33/C30 groups, the pyruvate kinase (PK) activity was significantly higher in prawns that consumed <i>α</i>-LA than in those that did not. Significant interactions between P/C and <i>α</i>-LA were found for the transcript levels of genes encoding adenine ribonucleotide-dependent protein kinase subunits (AMPK <i>α</i>and AMPK <i>β</i>), HK, glucose-6-phosphate dehydrogenase (G6PDH), acetyl-CoA carboxylase (ACC), and fatty acid binding protein 10 (FABP 10), all of which are involved in energy metabolism. In the low-P/C group, <i>α</i>-LA increased the transcript levels of genes encoding AMPK <i>α</i>, AMPK <i>β</i>, HK, phosphoenolpyruvate carboxykinase (PEPCK), G6PDH, and MDH, decreased the transcript level of the gene encoding ACC, and did not affect the transcript levels of genes encoding FABP10 and palmitoyl transferase 1 (CPT1). The P/C ratio and <i>α</i>-LA did not affect the overall morphology of the hepatopancreas, but at a low P/C, dietary supplementation of <i>α</i>-LA increased the number of hepatopancreatic B cells. In conclusion, supplementation with <i>α</i>-LA at 1300 mg/kg in a low-P/C diet of <i>M. nipponense</i> increased its carbohydrate utilization efficiency, energy metabolism, and the number of hepatopancreas B cells, thereby having a protein-sparing effect.</p>","author":"Shanshan Li, \nJunbao Wang, \nYunfeng Xiong, \nJinxian Zheng, \nDongsheng Zhou, \nJianhua Zhao, \nZhili Ding, \nCarlos Rosas Vázquez","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"7fa0a8eee6c24a9868001490121925be589bb5bcea8d95a4e1d957dce93466b2","category":"Environment"}