{"title":"ChatGPT can give you advice on buying a new Mac–the wrong advice","link":"https://www.macworld.com/article/1792091/chatgpt-ai-chatbot-buying-mac-macbook-advice.html","date":1684840500000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>As an editor who’s been covering Apple for a long time, I’m often asked by family, friends, and acquaintances about which Mac to buy. I have knowledge and insight that people can tap into conveniently through a conversation, saving someone from hours of research, a task that can be daunting, intimidating, and confusing.</p>\n\n\n\n<p>When using Google or another search engine, results appear as a list of websites, and then it’s up to you to find the information you need. That could take a lot of time, maybe even several hours. But generative artificial intelligence (AI) tools such as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://openai.com/blog/chatgpt&amp;xcust=1-1-1792091-1-0-0&amp;sref=https://www.macworld.com/feed\">ChatGPT</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://bard.google.com&amp;xcust=1-1-1792091-1-0-0&amp;sref=https://www.macworld.com/feed\">Google Bard</a> can possibly cut that time down to a few minutes, akin to the conversations I have.</p>\n\n\n\n<p>However, the buzz about how <a href=\"https://www.pcworld.com/article/1424575/chatgpt-is-the-future-of-ai-chatbots.html\">empowering</a> generative AI tools can be was accompanied by reports and incidents of inaccuracies and perpetuated falsehoods. And now that ChatGPT is going to be used a lot more thanks to its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://openai.com/blog/introducing-the-chatgpt-app-for-ios&amp;xcust=1-1-1792091-1-0-0&amp;sref=https://www.macworld.com/feed\">official iPhone app</a>, I wanted to see how well it can do with one of the most common questions: Which Mac should I buy? Will it draw from its extensive knowledge to provide helpful insight and information? Will it know the differences between the lines and processors? And most importantly, will it be accurate?</p>\n\n\n\n<h2>Did generative AI help make a buying decision?</h2>\n\n\n\n<p>At the moment, ChatGPT can’t be relied upon to make a specific recommendation because of its dataset. It also has the propensity to get things wrong yet present misinformation as facts. That wasn’t unexpected–ChatGPT is upfront about its limitations and literally has a “Limitations” section on its site.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"ChatGPT MacGPT\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-04.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>ChatGPT has a long way to go to provide the user with proper buying advice.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>The user can take the initiative and extrapolate or correct ChatGPT’s recommendations, but that requires knowledge not just of Apple’s current Mac lineup, but Apple’s product cycles and release schedules, which kind of defeats the purpose. That’s information that die-hards, tech enthusiasts, and tech professionals devour regularly, but not everyone else.</p>\n\n\n\n<p>To get the most out of generative AI, you need to provide as many specifics as you can think of for your question. Asking, “Which Mac should I buy?” creates a broad answer. Making a query that includes your habits, work situation, budget, environment, and more allows the AI to give you a better answer. But even if you do that, I’ve found that you can still get recommendations that are inappropriate.</p>\n\n\n\n<p>That basically sums up the ability at this point in time of generative AI as a shopping tool. If you’re interested, what follows is a sample of my experience using ChatGPT to help me decide on a Mac to purchase. I researched based on my own personal use case and compared the answers to my knowledge of the Mac lineup. I noted when I used ChatGPT in each section of this article to account for any AI engine updates that may have been implemented since the stated date. ChatGPT also offers the ability to “Regenerate response,”–which is essentially a new answer to my question. The times I did regenerate a response, the answer was the same but worded differently.</p>\n\n\n\n<h2>Opening question: Which Mac should I buy?</h2>\n\n\n\n<p>I started with a basic question that I am often asked: Which Mac should I buy? Here’s ChatGPT’s response.</p>\n\n\n\n<blockquote><p>The answer to this question depends on your needs, preferences, and budget. Here are some factors to consider when choosing a Mac:</p><p>1. Purpose: What do you plan to use the Mac for? If you need a computer for basic tasks like web browsing, email, and word processing, you may not need the most powerful or expensive model. If you plan to do more demanding tasks like video editing, programming, or gaming, you may want to look at higher-end models.</p><p>2. Size: Macs come in a range of sizes, from the compact MacBook Air to the larger iMac and Mac Pro. Consider where you’ll be using your Mac and how much screen space you need.</p><p>3. Portability: If you plan to use your Mac on the go, a laptop like the MacBook Air or MacBook Pro may be a better choice than a desktop model like the iMac or Mac Pro.</p><p>4. Budget: Macs can be expensive, so consider how much you’re willing to spend. The MacBook Air is the most affordable option, while the iMac and Mac Pro are the most expensive.</p><p>Here are some general recommendations based on different needs and budgets:</p><p>• For basic tasks like web browsing, email, and word processing, the MacBook Air or MacBook Pro with the M1 chip are excellent choices.</p><p>• For more demanding tasks like video editing or gaming, consider the MacBook Pro with a dedicated graphics card or the iMac with a larger screen and more powerful components.</p><p>• If you need a desktop computer for professional use, consider the Mac Pro, which offers the highest level of performance and customization options.</p><p>Ultimately, the best Mac for you will depend on your specific needs, preferences, and budget. It may be helpful to do some research and read reviews to help you make a decision.</p><cite>–ChatGPT; March 31, 2023</cite></blockquote>\n\n\n\n<p>ChatGPT doesn’t really “interact” with its follow-up queries, but it often does provide complete or nearly complete answers that guide the user. For example, when someone asks me what Mac to get, the first response I have is a follow-up question, usually, what kind of work do you do? ChatGPT basically does that in statement form to help the shopper make the proper decision. There’s also nothing to stop you from asking a follow-up question.</p>\n\n\n\n<p>ChatGPT had a satisfactory response to an overarching question. As for its recommendations, they’re mostly OK in a general sense, but I would not recommend a Mac Pro to anyone. And while the iMac does have a larger screen than the MacBook Pro, it doesn’t have “more powerful components.” And conspicuously missing from ChatGPT’s laptop recommendations is any mention of a new MacBook—instead, it recommends older M1 models. ChatGPT notes that it has “limited knowledge of world and events after 2021” which could explain why the M2 MacBook Air (released in June 2022) or <a href=\"https://www.macworld.com/article/622515/mac-studio-m1-max-review.html\">Mac Studio</a> (released in March 2022) aren’t mentioned.</p>\n\n\n\n<p>Also missing from the ChatGPT answer is the Mac mini. The <a href=\"https://www.macworld.com/article/234842/m1-mac-mini-review-the-mac-with-the-best-ever-bang-for-your-buck.html\">M1 Mac mini</a> was released in 2020 and discontinued in 2022 with the release of the <a href=\"https://www.macworld.com/article/347466/mac-mini-design-processsor-price-release.html\">M2 update</a> (along with the release of an <a href=\"https://www.macworld.com/article/1480091/mac-mini-m2-pro-review.html\">M2 Pro Mac mini</a>), so ChatGPT should at least recommend one of the models. It’s a pretty huge omission as it’s Apple’s most affordable Mac and the one I’m often asked about because people already have a display, keyboard, and mouse, as well as other peripherals that they want to keep using.</p>\n\n\n\n<p>I posed it the same question to Google Bard and the first line of the response was, “There are a few things to consider when choosing a Mac for students.” (Note: I didn’t say I was a student.) Bard’s answer proceeded to cover the criteria for selecting a Mac (budget, use case, storage needs), and then suggested the MacBook Air, MacBook Pro, Mac mini, and iMac, with general reasoning for each model. But because Bard decided to suggest Macs “for your student life” even though I never said I am a student, I was instantly turned off.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"ChatGPT Which Mac\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-01.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>ChatGPT provided good insight into a broad question, but its recommendations are dated.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Question 2: Adding more details</h2>\n\n\n\n<p>I don’t think anyone expects a specific Mac recommendation with a question as vague as “What Mac should I buy?” To get a specific answer, details must be provided. That’s what I did next. Here’s what I asked:</p>\n\n\n\n<p>What Mac should I buy? Here’s what I do with it:</p>\n\n\n\n<ul><li>Use iMovie to edit short videos</li><li>Use Audacity to edit podcasts</li><li>Use Pixelmator Pro for photo editing</li><li>Watch videos on Apple TV+, Netflix, Hulu, and other services</li></ul>\n\n\n\n<p>I decided to provide a list of the most strenuous tasks that I do regularly. The one task I actually perform the most is writing in apps such as Pages, Microsoft Word, etcetera, but that doesn’t require a lot of processing power so I didn’t include it. But if you’re doing similar research with ChatGPT and writing (or web browsing, or email, or spreadsheets, or whatever) is the most taxing thing you do on a Mac, put it on your list.</p>\n\n\n\n<p>Here is what ChatGPT recommends:</p>\n\n\n\n<blockquote><p>For your use case, I would recommend a MacBook Pro. Specifically, the 13-inch MacBook Pro with an M1 chip would be a great fit for you.</p><p>The M1 chip is Apple’s latest processor, which provides excellent performance for video editing, photo editing, and audio editing. It’s also energy-efficient, which means longer battery life.</p><p>The MacBook Pro has a Retina display, which will provide you with a great viewing experience when watching videos on Apple TV+, Netflix, Hulu, and other services.</p><p>Additionally, the MacBook Pro has a Thunderbolt 3 port, which will allow you to connect external storage devices, displays, and other peripherals.</p><p>Overall, the 13-inch MacBook Pro with an M1 chip should be more than sufficient for your needs and provide excellent performance, a great display, and long battery life.</p><cite>–ChatGPT; April 12, 2023</cite></blockquote>\n\n\n\n<p>My creative tasks are consumer-level, not professional and a 13-inch M1 MacBook Pro is a good recommendation. However, ChatGPT’s “Limited knowledge of world and events after 2021” comes into play here. As you probably know, the M1 is not “Apple’s latest processor” and the M1 MacBook Pro was replaced by the <a href=\"https://www.macworld.com/article/791082/13-inch-macbook-pro-m2-review.html\">M2 model</a> in June 2022, so ChatGPT is not aware of it or the other M2 Macs.</p>\n\n\n\n<p>I still think the M1 13-inch MacBook Pro is a good recommendation–it’s about 20 percent slower overall than the M2 model, but it can be found at <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1792091-1-0-0&amp;u=https://www.apple.com/shop/refurbished/mac/13-inch-macbook-pro\">Apple’s Refurbished and Clearance Store</a> with prices that are lower than a new M2 13-inch MacBook Pro, and it can be found at other retailers for even cheaper. (My query did not mention my budget.) But ChatGPT, because of its data limitation, doesn’t know about the M2.</p>\n\n\n\n<h2>Question 3: </h2>\n\n\n\n<p>There’s one major feature about the 13-inch MacBook Pro (M1 or M2) that makes me hesitant to recommend it wholeheartedly: its display, specifically, its bezels, which are oversized compared to those on the 14-and 16-inch MacBook Pro and the M2 MacBook Air.</p>\n\n\n\n<p>So, I asked the same question above, but I added one more condition: I want a screen big enough to handle video, photo, and audio editing, as well as handle multiple app windows. This is what ChatGPT recommended:</p>\n\n\n\n<blockquote><p>Based on the tasks you described, I would recommend getting a MacBook Pro, which is a powerful and versatile option for video, photo, and audio editing. Specifically, I would suggest getting the 16-inch MacBook Pro with the M1 Max chip, which is the latest and most powerful processor available in Apple laptops as of my knowledge cutoff in September 2021.</p><p>The 16-inch MacBook Pro has a large enough screen size to handle video and photo editing comfortably, and the M1 Max chip is capable of handling demanding tasks such as video rendering and exporting, as well as running multiple apps at the same time. Additionally, the MacBook Pro comes with a high-quality Retina display that has a resolution of 3072 x 1920, which will make watching videos on streaming services such as Apple TV+, Netflix, and Hulu a great experience.</p><p>Overall, the MacBook Pro should be able to handle all of your editing needs and provide a great viewing experience for your streaming content.</p><cite>–ChatGPT; April 12, 2023</cite></blockquote>\n\n\n\n<p>The model ChatGPT recommends–an M1 Max 16-inch MacBook Pro–is another recommendation for a Mac that’s discontinued. Let’s give it some leeway and adjust that recommendation to what’s currently available, an M2 Max version, or take that recommendation and get a refurbished model. In either case, that’s a very expensive laptop geared toward professionals with very specific needs. While the processing power will definitely handle video, photo, and audio editing, it shouldn’t default to Apple’s most expensive model.</p>\n\n\n\n<p>Once again, ChatGPT comes up short with desktop Macs. They’re not mentioned at all. The response to my initial vague query showed that ChatGPT is aware of the iMac, and it should be covered here since the <a href=\"https://www.macworld.com/article/344032/apple-24-inch-imac-m1-specs-display-storage-ports-ram-ethernet-colors-keyboard-price.html\">M1 iMac</a> was released in March 2021. I’ll give it another pass on the Mac Studio, which was released in June 2022, after ChatGPT’s knowledge.</p>\n\n\n\n<p>If I add budgetary considerations and my use case (on a desk at home) to my query, maybe I’d get a different answer, one that would include a desktop Mac. So I asked the same question, but added, “I want to spend under $2,000 and I will use the computer on a desk at home,” and ChatGPT recommended the M1 MacBook Air. That’s not what I would recommend and the opposite end of the spectrum to the M1 Max MacBook Pro.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"ChatGPT Which Mac\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?quality=50&amp;strip=all 2100w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=2048%2C1152&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/chatgpt-which-mac-02.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>The more details you provide to ChatGPT, the better the answer from its limited dataset.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>You’re better off asking a friend—or Macworld</h2>\n\n\n\n<p>I can keep going with this experiment (and I did), but the results were basically the same. ChatGPT can’t be trusted as a source for buying advice and at best is a supplemental tool. I disagreed with most of its suggestions–but it might be able to help someone who knows very little about Apple’s product lineup. If you want to give ChatGPT a try to help you pick a Mac, here are a few tips.</p>\n\n\n\n<p><strong>Make a list.</strong> Before using ChatGPT, make a list of what you do on your Mac, and include it in your ChatGPT query. The more detailed your query, the more specific ChatGPT can get with its recommendation.</p>\n\n\n\n<p><strong>Provide a budget.</strong> Again, the more detailed your query, the more specific ChatGPT can get. That includes telling it how much money you want to spend.</p>\n\n\n\n<p><strong>Tell it your use case.</strong> If you know you want a MacBook because you’re on location a lot, or a desktop Mac because you want more processing power, say so.</p>\n\n\n\n<p><strong>Know its limitations.</strong> Always be aware that ChatGPT has a knowledge limitation. Right now, it knowledge after 2021 is limited, so new Mac models will not be included in its recommendations. Depending on how often its knowledge base is updated, there could be a point in time when its recommendations are outdated and not useful. But there also could come a time when its knowledge base is in line with the day and date, making its recommendations more appropriate.</p>\n\n\n\n<p><strong>It can be wrong.</strong> ChatGPT says it up front: “May occasionally generate incorrect information.” The problem with this is if the person using ChatGPT isn’t familiar with the products, specifications, etcetera, then that person needs to do more work to fact-check ChatGPT.</p>\n\n\n\n<p><strong>Keep asking questions.</strong> Ask anything that comes to mind and will help you. Unlike a human (like me), ChatGPT doesn’t get tired, needs to be somewhere else, or has other things to do.</p>\n\n\n\n<p><strong>Ask a friend or Google.</strong> Don’t rely on ChatGPT as a sole source to make purchasing decisions. It gets a lot of things wrong right now and it may not even provide new insight. You’ll be much better off asking a friend who knows Macs or Googling and clicking on the first Macworld link you see.</p>\n\nInternet, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7fa796b85ab157882341adfb4fc41373929c9985a6c088b0ea7bcb1a377dd6d8","category":"Apple"}