{"title":"Perfluorooctanoic acid triggers premature ovarian insufficiency by impairing NAD+ synthesis and mitochondrial function in adult zebrafish","link":"https://academic.oup.com/toxsci/article/201/1/118/7687070?rss=1","date":1717372800000,"content":"<span><div>Abstract</div>High-dose perfluorooctanoic acid (PFOA) impairs oocyte maturation and offspring quality. However, the physiological concentrations of PFOA in follicular fluids of patients with premature ovarian insufficiency (POI) were detected at lower levels, thus the relationship between physiological PFOA and reproductive disorders remains elusive. Here, we investigated whether physiological PFOA exposure affects gonad function in adult zebrafish. Physiological PFOA exposure resulted in POI-like phenotypes in adult females, which exhibited decreased spawning frequency, reduced number of ovulated eggs, abnormal gonadal index, and aberrant embryonic mortality. Meanwhile, oocytes from PFOA-exposed zebrafish showed mitochondrial disintegration and diminished mitochondrial membrane potential. Unlike the high-dose treated oocytes exhibiting high reactive oxygen species (ROS) levels and excessive apoptosis, physiological PFOA reduced the ROS levels and did not trigger apoptosis. Interestingly, physiological PFOA exposure would not affect testis function, indicating specific toxicity in females. Mechanistically, PFOA suppressed the NAD<sup>+</sup> biosynthesis and impaired mitochondrial function in oocytes, thus disrupting oocyte maturation and ovarian fertility. Nicotinamide mononucleotide (NMN), a precursor for NAD<sup>+</sup> biosynthesis, alleviated the PFOA-induced toxic effects in oocytes and improved the oocyte maturation and fertility upon PFOA exposure. Our findings discover new insights into PFOA-induced reproductive toxicity and provide NMN as a potential drug for POI therapy.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"7fa812e043e2a555876d53332d3211e5169285389268b6e127bcf4db7d74a968","category":"Environment"}