{"title":"Robot obstacle avoidance optimization by A* and DWA fusion algorithm","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302026","date":1714399200000,"content":"<p>by Peiying Li, Lingjuan Hao, Yanjie Zhao, Jianmin Lu</p>\r\n\r\nThe current robot path planning methods only use global or local methods, which is difficult to meet the real-time and integrity requirements, and can not avoid dynamic obstacles. Based on this, this study will use the improved A-star global planning algorithm to design a hybrid robot obstacle avoidance path planning algorithm that integrates sliding window local planning methods to solve related problems. Specifically, A-star is optimized by evaluation function, sub node selection mode and path smoothness, and fuzzy control is introduced to optimize the sliding window algorithm. The study conducted algorithm validation on the TurtleBot3 mobile robot, with data sourced from experimental data from a certain college. The results showed that hybrid algorithm enabled the planned path to effectively navigate around dynamic obstacles and reach the target point accurately. When compared with traditional methods, path length reduced by 9.6%, path planning time decreased by 29% with an approximate 26.7% increase in the average speed of the robot. Compared with the traditional methods, the research algorithm has greatly improved in avoiding dynamic obstacles, path planning efficiency, model adaptability and so on, which has important value for relevant research. It can be seen that the algorithm proposed in the study has performance advantages, demonstrating the effectiveness and advantages of robot path planning, and can provide reference for robot obstacle avoidance optimization. Research can complete tasks for robots in practical environments, which has certain reference value for the research of robots in path planning and the development of path obstacle avoidance planning.","author":"Peiying Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"7fa8c0233599ee7e40a86d32c4663eb53584e11d3fa3c27159d0a45bea3d6d03","category":"Interdisciplinary"}