{"title":"Tour de France 2023 stage 14 preview - the first Alpine stage","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-14-preview","date":1689353803000,"content":"\n      <p><b>Distance: </b>151.8km<br /><b>Start location: </b>Annemasse<br /><b>Finish location: </b>Morzine<br /><b>Start time: </b>13:05 CEST<br /><b>Finish time (approx): </b>17:18 CEST</p>\n<p>Morzine has, since the 1970s, become one of the most frequently visited towns by the<a href=\"https://www.rouleur.cc/pages/tour-de-france\"> Tour de France</a>, and will this year host a stage for the 22nd time. That’s not because of any particular historical or cultural significance it lays claim to; it’s a small market town near the Swiss border that attracts visitors mostly for winter sports like skiing. No, like many familiar destinations of the Tour, it’s become such a staple due to its proximity to the Alps — in particular the mighty Col de Joux Plane summit, which will be the climactic mountain of a brutal stage 14.</p>\n<div></div>\n<p>Of all the <em>hors catégorie</em> climbs to be tackled in this year’s Tour, the Col de Joux Plane is the most unrelentingly steep. Some last longer than its 11.6km, and others have more fluctuating gradients, but none compare to its sustained steep gradients, which barely deviates from between 7 and 10%. It's a psychologically challenging climb, too, progressed via wide bends rather than hairpins that makes the climb appear less hard than it really is, and with few panoramic views for the riders to appreciate how far they’ve climbed. </p>\n<p>This will be the 13th time the Tour has climbed the Joux Plane since debuting in 1978, and pure climbers have always enjoyed it, with Richard Virenque and Marco Pantani among those to have been first to its summit. The last time in 2016 saw Ion Izagirre catch Vincenzo Nibali before flying down the descent to Morzine in wet conditions to take the stage victory. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tappa14.jpg?v=1688383188\" alt /></p>\n<p><i>Stage 14 profile sourced via ASO</i></p>\n<p>In stark contrast to yesterday’s visit to the Jura Mountains, which featured just the one climb, this stage in the Chablais region of the Alps has a total of four mountains ranked either <em>hors</em> or one category, more than any other stage in the Tour. That will make it a potentially definitive day in the king of the mountains classification, with multiple points on offer for any candidate able to get into the break and potentially seize control of the polka-dot jersey. </p>\n<p>The Col de Joux Plane is certainly the most difficult of all the mountains on the menu, but the other three are all very challenging in their own right, and therefore sure to have an impact. The Col de Cou and Col du Feu are tackled in quick succession inside the first 53km, leaving little time for the riders to bed themselves in or have a rest in between. Then, after a longer valley road, comes the Col de la Ramaz which, at 13.9km, is the longest of the day, and climbs at a far-from-easy 7.1%. Together these summits amount to over 4,000 metres elevation gain, making this stage one of the hardest of the so far, and arguably (it's a tough choice with stage 17) the whole Tour’s queen stage.</p>\n<h3><strong>Contenders</strong></h3>\n<p><span>With a summit finish looming on stage 15, just before the second rest day, today’s stage will be an ideal opportunity for a breakaway of skilled climbers to go clear, given the extensive amount of climbing they have to tackle. </span><span></span></p>\n<p><b>Matteo Jorgenson</b><span> (Movistar) redeemed himself on stage 12 following a bitter disappointment on stage nine, but has still not yet been able to crack a stage win. He launched an early attack 40km from the finish but was caught on the lower slopes of the Puy de Dôme, missing out on a podium spot. The American climber will want to continue his trajectory up the podium and hopefully earn himself a top spot. </span></p>\n<p><span>The man he lost out to on stage 12, <strong>Ion Izagirre</strong> (Cofidis), will no doubt fancy another day in the break here, particularly with fond memories of winning over Joux Plane in 2016. His brother <strong>Gorka Izagirre</strong> (Movistar) has not featured too heavily in the race so far, but can go well in the high mountains. We'll no doubt see his team-mate <strong>Ruben Guerreiro</strong> in the break too, given his interest in the king of the mountains points so far in this race</span></p>\n<p><span>The current owner of the polka-dot jersey, </span><b>Neilson Powless </b><span>(EF Education-EasyPost) will be looking to get up the road. There are valuable points at stake to bolster his lead in the king of the mountains classification and prevent anyone taking the jersey from him. </span><span>Tadej Poagčar (UAE Team Emirates) follows closely, just 15 points behind, with Michał Kwiatkowski (Ineos Grenadiers) and </span><b>Tobias Halland Johannessen </b><span>(Uno-X Pro Cycling Team), both trailing by 16 points. With an <em>hors catégorie</em> and four other categorised climbs on this stage, there is a chance for a significant change in the KoM standings. </span></p>\n<p><span>AG2R Citroën Team may opt to give </span><b>Ben O’Connor </b><span>the freedom to go for the stage. As he is no longer in contention for the GC battle, the team will likely shift their tactics towards pursuing stage wins, and O’Connor has the potential to leave his mark on the race by securing another stage win in the Alps, having done so in 2021. </span></p>\n<p><b>Omar Fraile </b>or <strong>Dani Martínez</strong> of<b> </b><span>Ineos Grenadiers will suit the demanding terrain characterised by its challenging climbs. With a victory on stage 13, the British team’s riders may have a newfound confidence, and Fraile might strive for a win, aiming for back-to-back triumphs for the team. </span><span>Another rider who will be keen to get in the break will be</span><b> Giulio Ciccone </b><span>(Lidl-Trek) if he has recovered from his crash on Thursday. He came close to a stage win on stage five, but has been relatively quiet since. His teammate <strong>Matthias Skjelmose</strong> (Lidl-Trek) has been in an attacking mood this Tour, and the Danish champion is a strong contender over this parcours.</span></p>\n<p><b>Harold Tejada and Alexey Lutsenko </b><span>(both Astana Qazaqstan) are strong climbers who will be keen to get in the break and have a chance at stage victory, having both seemingly ridden into much better form compared to the beginning of the Tour. </span><b>Dylan Teuns</b><span> (Israel-Premier Tech) is another candidate who can climb well out of the breakaway, but his teammate <strong>Michael Woods</strong> could certainly thrive on a stage like this, particularly after his victory on Puy de Dôme.</span></p>\n<p><span>Frenchman </span><b>Thibaut Pinot</b><span> (Groupama-FDJ) is determined to secure a stage win and expressed confidence in his chances on this stage after taking a slightly easier day on the Grand Colombier. He has the climbing abilities, he just needs to remain composed and take a level-headed approach to succeed – something that hasn't been his forte.</span></p>\n<p><span>Others to consider include <strong>Esteban Chaves</strong> and <strong>James Shaw</strong> (EF Education-EasyPost), <strong>Jack Haig</strong> (Bahrain-Victorious), <strong>Julian Alaphilippe</strong> (Soudal-Quick-Step), <strong>Warren Barguil</strong> (Arkéa-Samsic), and <strong>Pierre Latour</strong> (TotalEnergies).</span></p>\n<h3>Prediction </h3>\n<p>We think Matthias Skjelmose will secure his maiden Tour de France stage win in Morzine.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"7fa971d60289a4da9590333a96ba54fd9f1875e4664a39cd1e24f2e6bcbbbc4e","category":"Cycling"}