{"title":"Drag Force on Submerged Flexible Vegetation in an Open‐Channel Flow","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036879?af=R","date":1729233649000,"content":"<h2>Abstract</h2>\n<p>The movement of submerged flexible vegetation leads to an increase in resistance to the stream flow. In this study, a formula that can directly calculate the drag force on a highly flexible submerged vegetation, called <i>Ceratophyllum</i>, by using the vegetation swaying characteristics and the flow field information in a steady-uniform open-channel flow is derived. The drag force on submerged flexible vegetation is characterized by the time-averaged flow velocity, turbulence intensity, and the additional force arising from the vegetation swaying. Based on the results of the numerical models in the previous studies (Wang et al., 2022a, 2022b, <a target=\"_blank\" href=\"https://doi.org/10.1017/jfm.2022.598\">https://doi.org/10.1017/jfm.2022.598</a>, <a target=\"_blank\" href=\"https://doi.org/10.1017/jfm.2022.899\">https://doi.org/10.1017/jfm.2022.899</a>), the drag coefficient is determined. It is revealed that the drag coefficient is influenced by a combination of factors, including the flow conditions, and the distribution and movement characteristics of vegetation. The drag coefficient decreases with an increase in velocity and is approximately linearly related to the cubic power of the bulk flow velocity. In the case of an inter-plant spacing of 0.5 times the initial plant height, the drag coefficient ranges from 10.72 to 2.11, as the Reynolds number varies from 20,000 to 50,000. Besides, the vegetation distribution density and the relative submergence influence the drag coefficient. In this context, the drag coefficient decreases linearly with an increase in the inter-plant spacing. For the Reynolds number equaling 50,000, the drag coefficient ranges from 2.11 to 2.02, when the inter-plant spacing varies from 0.5 to 2 times the plant height, and from 2.47 to 1.79, when the flow depth varies from 1.5 to 3 times the plant height.</p>","author":"Jianyu Wang, \nGuojian He, \nLei Huang, \nSubhasish Dey, \nHongwei Fang","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"7fa9c36bec681426762a4bc3217080f5cc0f4ae237a735fca1bd039466bf9dcc","category":"Environment"}