{"title":"PSVI-24 Gene expression profiles of granulosa and peripheral white blood cells from fertile and sub-fertile beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_3/566/7757807?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Beef heifer fertility issues contribute to a major economic loss in the cow-calf production industry. Therefore, identifying beef heifers with superior genetic potential for improved fertility would increase profitability. This study aimed to identify differences in the transcriptome profiles from granulosa and peripheral white blood cells (pWBCs) of beef heifers with varying reproductive potential. For this, Angus-Simmental crossbred heifers were subjected to an estrus synchronization and fixed-time artificial insemination (AI) protocol (7-D CO-Synch + CIDR) followed by exposure for 60-d to a fertile bull. Depending on the presence or absence of conceptus 120 d post-AI, heifers were classified as fertile (pregnant by AI) or sub-fertile (non-pregnant by AI or bull-breeding). Pregnancies were terminated, and all animals in both groups (fertile, n = 8; and sub-fertile, n = 5) were cycling when the blood and ovaries were collected from each heifer. Total RNA was extracted from the pWBCs and granulosa cells and subjected to library preparation and sequencing on the Nova-Seq platform. The read counts were obtained after data quality control using FastQC v0.11.9 and MultiQC v1.12 and alignment to the Ensemble’s ARS UCD1.2 <span>Bos taurus</span> genome reference using STAR aligner v2.7.5. The filtered data were subjected to differential expression analysis using DESeq2. We identified 1,061 and 72 significantly differentially expressed genes (DEGs) with <span>P</span>-values ≤ 0.05 and absolute (log2 fold change) ≥ 0.5 from pWBC and granulosa, respectively. Notably, 12 targets including 9 protein coding genes (PLCL1, DNER, GNAS, CDH3, PER1, ITGA2B, CXCL12, ENSBTAG00000048613, ENSBTAG00000051519), bta-mir-2887-1, 5-8S-rRNA and U5 were found as DEGs in both the tissues. Based on a differential co-expression analysis using PCIT, we identified GNAS and DNER as hub genes in pWBC and the granulosa cells of the sub-fertile heifer group. The 12 shared genes were over-represented for pathways such as NF kappa B and chemokine signaling, regulation of actin cytoskeleton, and platelet activation. Some of the identified genes have been previously associated with fertility, while others are novel. A detailed understanding of the underlying biological mechanisms of the top genes and a follow-up study with a larger sample size at different time points could validate the candidates identified in this study for their role as potential therapeutic targets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7faaeb8a616241bb021cfa0ad87d8e7b47a9dc4f7eca315616f859def2911bd6","category":"Environment"}