{"title":"Vibrio pathogens and their toxins in aquaculture: A comprehensive review","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12926?af=R","date":1716640064000,"content":"<h2>Abstract</h2>\n<p>Aquaculture is an indispensable food source for the growing world population. In the last decades, its intensification has increased the incidence of viral and bacterial infections, emphasizing the need for novel disease management strategies. <i>Vibrionaceae</i> bacteria are widespread in aquatic environments, affecting various host species, including economically important fish, shrimp and bivalves. Also, human consumption of undercooked aquatic food contaminated with <i>Vibrionaceae</i> and/or their toxins poses a threat to human health, leading to conditions such as gastroenteritis, wound infection and sepsis. In addition, small fish and shrimp, in open aquaculture systems, can be eaten by birds that can then carry and spread this pathogen to livestock and humans. Many <i>Vibrionaceae</i> produce toxins, some detrimental or even lethal to the hosts, others affecting surrounding bacteria. This review provides a comprehensive overview of <i>Vibrio</i> toxins affecting aquatic (in)vertebrate, summarizing findings on molecular structures, mechanisms of action and regulation and secretion processes involved. Important toxin classes for microbe–host interactions, such as haemolytic, proteolytic and MARTX toxins, are discussed, along with other toxins like PirAB produced by the AHPND-causing <i>Vibrio parahaemolyticus</i>. The review also emphasizes the importance of microbe–microbe interactions, particularly the production of bacteriocins by <i>Vibrio</i> species (Vibriocins) and antibacterial effectors produced by the Type 6 Secretion System (T6SS). While whole genome sequencing has identified putative virulence factors that are toxins, many toxins remain partially characterized or uncharacterized. Elucidating their regulation, secretion and molecular characteristics can provide valuable information and lead to novel solutions for managing <i>Vibrio</i> pathogens in aquaculture.</p>","author":"Marieke Vandeputte, \nMd. Abul Kashem, \nPeter Bossier, \nDaisy Vanrompay","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"7fadcec66d6c0eb3f6e92424b53ed792d0c7bfdbfda5ce5778a77e8dcc3ecc93","category":"Environment"}