{"title":"Unravelling arthropod movement in natural landscapes: Small‐scale effects of body size and weather conditions","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14161?af=R","date":1722581432000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/6aaba50e-8491-4c11-b8e2-897ebe8906e1/jane14161-toc-0001-m.png\" alt=\"Unravelling arthropod movement in natural landscapes: Small-scale effects of body size and weather conditions\" />\n<p>This is the first study to investigate the effects of body size and weather conditions across many arthropod species at habitat boundaries. The results underscore that connectivity is not random and arthropod movement between patches is an active decision. These insights can be valuable in the context of climate change.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nArthropod movement has been noticeably understudied compared to vertebrates. A crucial knowledge gap pertains to the factors influencing arthropod movement at habitat boundaries, which has direct implications for population dynamics and gene flow. While larger arthropod species generally achieve greater dispersal distances and large-scale movements are affected by weather conditions, the applicability of these relationships at a local scale remains uncertain. Existing studies on this subject are not only scarce but often limited to a few species or laboratory conditions.\n\nTo address this knowledge gap, we conducted a field study in two nature reserves in Belgium, focusing on both flying and cursorial (non-flying) arthropods. Over 200 different arthropod species were captured and released within a circular setup placed in a resource-poor environment, allowing quantification of movement speed and direction. By analysing the relationship between these movement variables and morphological (body size) as well as environmental factors (temperature and wind), we aimed to gain insights into the mechanisms driving arthropod movement at natural habitat boundaries.\n\nFor flying species, movement speed was positively correlated with both body size and tailwind speed. In contrast, movement speed of cursorial individuals was solely positively related with temperature. Notably, movement direction was biased towards the vegetated areas where the arthropods were originally caught, suggesting an internal drive to move towards suitable habitat. This tendency was particularly strong in larger flying individuals and under tailwind conditions. Furthermore, both flying and cursorial taxa were hindered from moving towards the habitat by strong upwind.\n\nIn conclusion, movement speed and direction at patch boundaries are dependent on body size and prevailing weather conditions, and reflect an active decision-making process.\n</p>","author":"Garben Logghe, \nCharlotte Taelman, \nFlorian Van Hecke, \nFemke Batsleer, \nDirk Maes, \nDries Bonte","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"7fbfc01d6c2f7200c8591193bcc62978fcadcb5e5ccdb18c2372668aed0ff2f6","category":"Environment"}