{"title":"Biochemical Characterization of Rice Xylan Biosynthetic Enzymes in Determining Xylan Chain Elongation and Substitutions","link":"https://academic.oup.com/pcp/article/65/6/1065/7631741?rss=1","date":1710806400000,"content":"<span><div>Abstract</div>Grass xylan consists of a linear chain of β-1,4-linked xylosyl residues that often form domains substituted only with either arabinofuranose (Ara<span>f</span>) or glucuronic acid (GlcA)/methylglucuronic acid (MeGlcA) residues, and it lacks the unique reducing end tetrasaccharide sequence found in dicot xylan. The mechanism of how grass xylan backbone elongation is initiated and how its distinctive substitution pattern is determined remains elusive. Here, we performed biochemical characterization of rice xylan biosynthetic enzymes, including xylan synthases, glucuronyltransferases and methyltransferases. Activity assays of rice xylan synthases demonstrated that they required short xylooligomers as acceptors for their activities. While rice xylan glucuronyltransferases effectively glucuronidated unsubstituted xylohexaose acceptors, they transferred little GlcA residues onto (Ara<span>f</span>)-substituted xylohexaoses and rice xylan 3-<span>O</span>-arabinosyltransferase could not arabinosylate GlcA-substituted xylohexaoses, indicating that their intrinsic biochemical properties may contribute to the distinctive substitution patterns of rice xylan. In addition, we found that rice xylan methyltransferase exhibited a low substrate binding affinity, which may explain the partial GlcA methylation in rice xylan. Furthermore, immunolocalization of xylan in xylem cells of both rice and <span>Arabidopsis</span> showed that it was deposited together with cellulose in secondary walls without forming xylan-rich nanodomains. Together, our findings provide new insights into the biochemical mechanisms underlying xylan backbone elongation and substitutions in grass species.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"7fd17c429b4028f95e822d38e032d5621a26bd60b1f53423baf35fb711f5e457","category":"Environment"}