{"title":"EVs have 79% more reliability problems than gas cars, says Consumer Reports","link":"https://arstechnica.com/?p=1987118","date":1701281599000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-90924308-800x532.jpg\" alt=\"An auto mechanic repairs something under the dash of an EV\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/GettyImages-90924308-scaled.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Widely accepted wisdom has it that electric vehicles are easier to maintain than those with internal combustion powertrains. It seems intuitive—EVs have many fewer moving parts than cars that have to detonate small quantities of hydrocarbon fuel thousands of times a minute. But the data don't really bear out the idea. In fact, according to data collected by Consumer Reports, EVs are significantly less reliable than conventionally powered cars.</p>\n<p>CR is known for buying cars for its own test fleet, but for its annual auto reliability survey, the organization cast a wider net. Specifically, it gathered data from 330,000 owners of vehicles from model year 2000 onwards, and it uses that survey data to <a href=\"https://www.consumerreports.org/cars/car-reliability-owner-satisfaction/who-makes-the-most-reliable-cars-a7824554938/#:~:text=We%20study%2020%20trouble%20areas,for%20every%20major%20mainstream%20model.\">generate reliability scores for each vehicle and model year</a>.</p>\n<p>The results are a little inconvenient for the EV evangelist. EVs had 79 percent more reliability problems than a gasoline- or diesel-powered vehicle, on average. Plug-in hybrids fared even worse; these had 146 percent more issues on average than the conventional alternative. But simpler not-plug-in hybrids bucked this trend, with 26 percent fewer reliability problems than conventionally powered vehicles.</p></div><p><a href=\"https://arstechnica.com/?p=1987118#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987118&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"7fd435821b0b34811d2bf313bd282687684cd0c6810c43ef3a81ff85c5bcc38c","category":"Tech"}