{"title":"M1 Pro and M1 Max MacBook Pro: New everything, inside and out","link":"https://www.macworld.com/article/346129/2021-macbook-pro-14-inch-16-inch-mini-led-m1x-touch-bar-price-release.html","date":1634585460000,"content":"<div>\n<section><div></div></section><p>At long last, Apple finally revealed the new 14- and 16- inch MacBook Pro laptops At its <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/apple-events/event-stream/&amp;subid1=1-1-346129-1-0-0\">“Unleashed” event</a>. You can <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-mac/macbook-pro&amp;subid1=1-1-346129-1-0-0\">order the new MacBook Pro laptops</a> starting today but you probably won’t be able to get one for a while. The new laptop features a new redesign with smaller bezels, a new display, new ports, new Apple silicon, and more. Here are the key details on the MacBook Pro.</p>\n\n\n\n<h2>2021 MacBook Pro: Processor, RAM, graphics</h2>\n\n\n\n<p>The M1 Pro and M1 Max are the newest Apple System on a Chip (SoC), following the M1 that was released last year. Here are what’s available for each model:</p>\n\n\n\n<h3>14-inch MacBook Pro</h3>\n\n\n\n<ul><li><strong>M1 Pro:</strong> 8-core CPU with six performance cores and two efficiency cores or 10-core CPU with eight performance cores and two efficiency cores; 14- or 16-core GPU; 16-core Neural Engine; 200Gbps memory bandwidth</li><li><strong>M1 Max:</strong> 10-core CPU with eight performance cores and two efficiency cores; 16- or 32-core GPU; 16-core Neural Engine; 400Gbps memory bandwidth</li><li><strong>16GB </strong>unified memory, configurable to <strong>32GB</strong> (M1 Pro) or <strong>64GB</strong> (M1 Max)</li></ul><h3>16-inch MacBook Pro</h3>\n\n\n\n<ul><li><strong>M1 Pro:</strong> 10-core CPU with eight performance cores and two efficiency cores; 16-core GPU; 16-core Neural Engine; 200Gbps memory bandwidth</li><li><strong>M1 Max:</strong> 10-core CPU with eight performance cores and two efficiency cores; 32-core GPU; 16-core Neural Engine; 400Gbps memory bandwidth</li><li><strong>16GB</strong> unified memory, configurable to <strong>32GB</strong> (M1 Pro) or <strong>64GB</strong> (M1 Max)</li></ul><h2>2021 MacBook Pro: Display</h2>\n\n\n\n<p>The 14-inch and 16-inch MacBook Pros are the first Apple laptops to use mini-LED screens, which Apple calls Liquid Retina XDR. Used in the 12.9-inch iPad Pro, mini-LED is a backlighting technology that has several more LEDs than what is currently implemented. This results in better control of the backlight, better image contrast, and greater dynamic range.</p>\n\n\n\n<p>These laptop displays are also the first to support a 120Hz refresh rate using ProMotion technology, which was previously only seen in Apple’s iPhones and the iPad Pro.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/16-inch-macbook-pro.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The displays on the MacBook Pro have a 120Hz referesh rate. And yes, that is a notch for the FaceTime camera.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Apple’s specs for the display include a 1,000,000:1 contrast ratio, 1,000 nits of full‑screen brightness and 1,600 nits of peak brightness. The 14-inch model has a native resolution of 3024-by-1964 at 254 pixels per inch, while the 16-inch version has a native resolution of 3456‑by‑2234 at 254 pixels per inch. The displays also support the P3 color gamut and True Tone.</p>\n\n\n\n<h2>2021 MacBook Pro: Design and colors</h2>\n\n\n\n<p>The new 14- and 16-inch MacBook Pros feature a new aluminum case design that makes the laptop smaller than previous models. The 14-inch MacBook Pro is 0.61 inches tall and weighs 3.5 pounds, while the 16-inch model is 0.66 inches tall and 4.7 pounds. Here are the complete dimensions:</p>\n\n\n\n<ul><li><strong>14-inch MacBook Pro:</strong> 12.31 x 8.71 x 0.61 inches; 3.5 pounds</li><li><strong>16-inch MacBook Pro:</strong> 14.01 x 9.77 x 0.66 inches; 4.7 pounds</li></ul><p>The bezel (the border around the display) has been greatly reduced, so much so that the MacBook Pro logo is no longer at the bottom on the screen—it’s on the bottom on the laptop. The top of the display has a notch for the FaceTime camera, just like the iPhone. Apple has made the notch the same depth as the menu bar so it won’t intrude on your workspace.</p>\n\n\n\n<p>Apple offers the MacBook Pro in two colors, Silver and Space Gray. </p>\n\n\n\n<h2>2021 MacBook Pro: Ports and power adapter</h2>\n\n\n\n<p>The MacBook Pro comes with three Thunderbolt/USB 4 ports. Apple also includes an SDXC card slot, an HDMI 2.0 port, and a headphone jack that has support for high-impedance headphones.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/macbook-pro-2021-ports.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>From left to right: SDXC Card slot, Thunderbolt/USB 4, HDMI 2.0.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The power adapter connects to a new MagSafe connector on the laptop. It’s similar to the old MagSafe adapter in MacBooks pre-USB-C. However, the wattage of the adapter depends on the model you buy:</p>\n\n\n\n<ul><li>8-core 14-inch MacBook Pro: 67 watts</li><li>10-core 14-inch MacBook Pro: 96 watts</li><li>All 16-inch MacBook Pro configurations: 140 watts</li></ul><p>You can opt to buy a higher wattage adapter for $20. The new MacBook Pros both support faster charging with the 140-watt adapter for the first time, charging up to 50 percent in just 30 minutes.</p>\n\n\n\n<h2>2021 MacBook Pro: Battery life</h2>\n\n\n\n<p>Battery life is dramatically improved, according to Apple’s tests:</p>\n\n\n\n<p><strong>14-inch MacBook Pro</strong></p>\n\n\n\n<ul><li>Up to 17 hours Apple TV app movie playback</li><li>Up to 11 hours wireless web</li><li>70-watt-hour lithium-polymer battery</li></ul><p><strong>16-inch MacBook Pro</strong></p>\n\n\n\n<ul><li>Up to 21 hours Apple TV app movie playback</li><li>Up to 14 hours wireless web</li><li>100-watt-hour lithium-polymer battery</li></ul><h2>2021 MacBook Pro: Front camera</h2>\n\n\n\n<p>That notch on the top of the display houses a new 1080p FaceTime HD camera. Apple has finally replaced the 720p FaceTime camera, and the new camera should result in better image quality. This FaceTime camera is similar to the one found in the 24-inch M1 iMac but isn’t ultra-wide and doesn’t support Center Stage like the iPad.</p>\n\n\n\n<h2>2021 MacBook Pro: Audio</h2>\n\n\n\n<p>Apple has upped its game when it comes to audio playback and recording. The new MacBook Pro has a six-speaker system, with four tweeters and two woofers. The woofers are force-cancelling, and Apple claims that they deliver 80 percent more bass than previously.</p>\n\n\n\n<p>The speakers also have support for spatial audio when playing music or video with Dolby Atmos. And if you are using the laptop with the new third-gen AirPods, AirPods Pro, or AirPods Max, there is spatial audio with dynamic head tracking.</p>\n\n\n\n<p>Apple calls the built-in three-mic array “studio quality: and they have a high signal-to-noise ratio and directional beamforming. The headphone jack also has support for high-impedance headphones.</p>\n\n\n\n<h2>MacBook Pro: No more Touch Bar</h2>\n\n\n\n<p>Apple introduced the Touch Bar in 2016 to replace the function keys with “a brilliant, Retina-quality Multi-Touch display,” but it has been a divisive feature, to say the least—those who dislike it are quite expressive about it, while people who like it don’t really say much (at least it seems that way). Apple seems to have been persuaded by the users who don’t like the Touch Bar, because it’s gone in the new M1 Pro MacBook Pro, replaced by Function keys. These Function keys aren’t half-height keys—they’re full sized. There is a Touch ID button on the upper right of the keyboard, just like on the previous MacBook Pro models but it has a circular ring like on the iMac keyboard.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/10/16-inch-macbook-pro-keyboard-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Say buh-bye to the Touch Bar.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>2021 MacBook Pro: Prices and release</h2>\n\n\n\n<p>Ordering for the M1 Pro MacBook Pro is now available. Shipments start arriving next week, but because of supply chain issues, some ship dates have already started slipping into late November and December.</p>\n\n\n\n<p>Apple offers two standard configurations of the 14-inch MacBook Pro:</p>\n\n\n\n<ul><li>$1,999: M1 Pro 8-core CPU, 14-core GPU, 16GB of RAM, 512GB SSD</li><li>$2,499: M1 Pro 10-core CPU, 16-core GPU, 16GB of RAM, 1TB SSD</li></ul><p>Apple offers three standard configurations of the 16-inch MacBook Pro:</p>\n\n\n\n<ul><li>$2,499: M1 Pro 10-core CPU, 16-core GPU, 16GB of RAM, 512GB SSD</li><li>$2,699: M1 Pro 10-core CPU, 16-core GPU, 16GB of RAM, 1TB SSD</li><li>$3,499: M1 Max 10-core CPU, 32-core GPU, 32GB of RAM, 1TB SSD</li></ul><p>Apple also still sells the 13-inch M1 MacBook Pro, which starts at $1,299.</p>\n</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"7fd80f362f038f1a1624b30c7bb5d31242a79fd71c1dc379402e97bc038d7907","category":"Apple"}