{"title":"Mapping stream and floodplain geomorphometry with the Floodplain and Channel Evaluation Tool","link":"https://onlinelibrary.wiley.com/doi/10.1111/1752-1688.13163?af=R","date":1693472422000,"content":"<h2>Abstract</h2>\n<p>Broad-scale mapping of stream channel and floodplain geomorphic metrics is critical to improve the understanding of geomorphic change, biogeochemical processes, riverine habitat quality, and opportunities for management intervention. The Floodplain and Channel Evaluation Tool (FACET) was developed to provide an open-source tool for automated processing of digital elevation models (DEMs) to generate regional-scale estimates of bank height, channel width, floodplain width, and a suite of other fluvial geomorphic dimensions that can be summarized at the stream reach- or catchment-scale. FACET was tested on 3-m DEMs covering the Delaware River watershed and 85% of the Chesapeake Bay watershed in the United States (U.S.) and on 1-m DEMs for a subset of the study area. Accuracy was assessed from data collected at 67 field sites in the study area. FACET successfully measured geomorphometry for over 270,000 stream reaches (88% of streams attempted) in the study area. Factors that reduced the ability of FACET to accurately estimate geomorphic metrics included errors in DEM hydro-conditioning, gradually sloping banks, incised stream channels, and the use of fixed input parameters to define buffer lengths. Even with these limitations, FACET was able to map regional patterns in stream and floodplain geomorphometry providing a robust dataset that can enhance modeling and management efforts throughout the mid-Atlantic region, U.S.</p>","author":"Kristina G. Hopkins, \nLabeeb Ahmed, \nPeter R. Claggett, \nSamuel Lamont, \nMarina J. Metes, \nGregory B. Noe","siteTitle":"Wiley: JAWRA Journal of the American Water Resources Association: Table of Contents","siteHash":"b7070794a350c180e68e2251d6fc4f4ad5be669c5d24d82d3d55b25b0dce7a23","entryHash":"7fe5a683f7729fad6eddce0f4a53e75cf5add3f222bf20e92c1fa72d8fd6b04f","category":"Environment"}