{"title":"The Regenerate Study: A Non-randomised Feasibility Study of an Intervention to Reduce Anticholinergic Burden in Older Patients","link":"https://www.preprints.org/manuscript/202409.1171/v1","date":1726542328000,"content":"Abstract: Background: Anticholinergic burden (ACB) from medications has been associated with adverse outcomes in older people. Aim: To conduct a non-randomised feasibility study of an intervention to Reduce anticholinerGic burdEN in oldER pATiEnts (REGENERATE) to inform a subsequent definitive trial. Methods: The development and evaluation of an ACB reduction intervention was guided by the Medical Research Council framework. Findings from preliminary studies, two systematic reviews and two qualitative studies informed the design of a mixed-method feasibility study. The study was conducted in one UK  primary care site. The clinical pharmacist identified and invited potentially eligible patients, reviewed their medications and made recommendations to reduce the ACB as needed. Patients completed surveys at baseline, and 6- and 12- weeks post intervention. A purposive sample of patients and healthcare professionals was interviewed. Results:   There was an 16/20 response; 14/16 attended the pharmacist led consultation and completed the baseline questionnaire and 13/14 completed both follow-up questionnaire. The sustainability of deprescribing was confirmed.  The results suggest the potential of the intervention to reduce side effects from medications and improve quality of life (EQ-5D-5L). The interviews showed patients were happy with the study processes, and the medication changes, and were satisfied with the pharmacist’s consultation.\nConclusions: This feasibility study demonstrated that a deprescribing/reducing ACB intervention in older people is feasible in a primary care setting and may benefit patients. Well-designed RCTs and cost-effectiveness studies should be undertaken to confirm the benefits of ACB deprescribing in primary care settings.\nTrial registration: ClinicalTrials.gov no. NCT04660838","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7fe9e2617d56a9c465f72af17c06bf830833113fdb18e609d2db0a2bfb0d8bce","category":"Interdisciplinary"}