{"title":"Changes in Population Densities and Species Richness of Pollinators in the Carpathian Basin during the Last 50 Years (Hymenoptera, Diptera, Lepidoptera)","link":"https://www.preprints.org/manuscript/202404.1721/v1","date":1714111773000,"content":"Temporal changes of population densities and species richness of three main pollinator groups: moths and butterflies (Lepidoptera), bees, wasps and sawflies (Hymenoptera) and hoverflies, horse-flies, tachninids and bee flies (Diptera) were investigated in the Carpathian Basin. Maintaining pollinator divesrity is a crucial factor for preserving our biodiversity and ecosystems, furthermore several pollinator species has strong economic role in maintaning crop and fruit cultures. Our conclusions are based on our three or four decades of faunistic surveys in various regions of the Carpathian Basin. Analysing and comparing our data with the historical data of the last 50 years, we concluded, densities of some pollinators were declined during the past decade and the half (Symphyta, hoverflies), although populations  of several species of Mediterranean-origin were grown (Aculeata) and even new species were migrated from the warmer regions. In numerous cases, this decrease was dramatic: more than 90% decrease of certain butterfly species were detected. On the other hand, the composition of pollinator fauna significantly changed due to the disappearance of some montaneous or mesophyle species. The main reason of decrease of pollinator communities is partly the climatic change and partly anthropogenic factors. Our conclusion: in our region, the pollinator crisis is present, but moderate; however, there is clear sign of the gradual transition of our pollinator fauna towards the Mediterranean type.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"7fead4bf7ea9d2c4ca937cdaf3ca0575da1c9c631b1a5b3741a0fb3d8800c10d","category":"Interdisciplinary"}