{"title":"90 Interconnecting feed efficiency with molecular mechanisms of muscle growth in beef steers","link":"https://academic.oup.com/jas/article/102/Supplement_1/17/7617978?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>Feed efficiency is an important factor for improving the sustainability and economic value of beef production. Although feed efficiency is moderately heritable, it is a complex trait affected by numerous factors such as diet, the rumen microbiome, and energy metabolism. Recent work has examined the molecular control of cattle divergent in feed efficiency; however, limited work has focused on the transcriptomic regulation of variation in feed efficiency, specifically, the genes contributing to muscle growth and the variation in feed efficiency in beef production. The hypothesis of this study was that cattle with greater feed efficiency will have increased expression of genes that promote muscle growth and energy metabolism. A total of 100 Angus steers weighing approximately 400 kg were enrolled in 70 d feed efficiency trials to determine residual feed intake (RFI) using the Vytelle GrowSafe 8000 individual feed intake monitoring system. At mid-test, 500-mg of muscle tissue was collected from the wing of the ileum between the axis and transverse processes of the lumbar vertebrae and was punched with a biopsy probe tool. The collected biopsy samples were flash frozen in liquid nitrogen for storage until processing. RNA was extracted and 3’ RNA sequencing was conducted on the Novaseq 6000 to determine the differential skeletal muscle transcriptomes of steers differing in RFI. Differential expression analysis was performed with the DESeq2 R package. To determine connections between the differentially expressed genes identified via transcriptional profiling and RFI, gene expression results were examined for correlations. To visualize the correlation matrices, the Corrplot package in R (version 3.4) was utilized. Varying numbers of differentially expressed gene transcripts were detected between steers divergent in RFI (P &lt; 0.05), and were identified with significant correlations to RFI (P &lt; 0.05). Specifically, the genes identified were related to muscle growth and energy metabolism. These results further define the molecular control of muscle growth with regard to RFI, and the opportunity to improve feed efficiency and muscle growth while meeting the needs for food production and sustainability for the growing population.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"7ff087f8c5bf60981bc4c95f9bd530b29509e4a9154352b55be1382aace9c854","category":"Environment"}