{"title":"Effect of tracheotomy timing on patients receiving mechanical ventilation: A meta-analysis of randomized controlled trials","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307267","date":1721743200000,"content":"<p>by Rongrong Han, Xiang Gao, Yongtao Gao, Jihong Zhang, Xiaoyan Ma, Haibo Wang, Zhixin Ji</p>\r\nPurpose <p>We assessed the effects of tracheostomy timing (early vs. late) on outcomes among adult patients receiving mechanical ventilation.</p> Methods <p>PubMed, Embase, Web of Science and Cochrane Library were searched to identify relevant RCTs of tracheotomy timing on patients receiving mechanical ventilation. Two reviewers independently screened the literature, extracted data. Outcomes in patients with early tracheostomy and late tracheostomy groups were compared and analyzed. Meta-analysis was performed using Stata14.0 and RevMan 5.4 software. This study is registered with PROSPERO (CRD42022360319).</p> Results <p>Twenty-one RCTs were included in this Meta-analysis. The Meta-analysis indicated that early tracheotomy could significantly shorten the duration of mechanical ventilation (MD: -2.77; 95% CI -5.10~ -0.44; <i>P</i> = 0.02) and the length of ICU stay (MD: -6.36; 95% CI -9.84~ -2.88; <i>P</i> = 0.0003), but it did not significantly alter the all-cause mortality (RR 0.86; 95% CI 0.73~1.00; <i>P</i> = 0.06), the incidence of pneumonia (RR 0.86; 95% CI 0.74~1.01; <i>P</i> = 0.06), and length of hospital stay (MD: -3.24; 95% CI -7.99~ 1.52; <i>P</i> = 0.18).</p> Conclusion <p>In patients requiring mechanical ventilation, the tracheostomy performed at an earlier stage may shorten the duration of mechanical ventilation and the length of ICU stay but cannot significantly decrease the all-cause mortality and incidence of pneumonia.</p>","author":"Rongrong Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"80214c9bd59855aa74d5a40eff9cab5ca000fc0b347313de2083c11d873be13b","category":"Interdisciplinary"}