{"title":"Sustainability implications and relevance of using omics sciences to investigate cheeses with protected designation of origin","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13403?af=R","date":1709815939000,"content":"<p>Cheese, a fundamental component of the human diet and a cornerstone of the global food economy, has a significance beyond its role as a commodity, playing a crucial part in the cultural identity of various communities. The intricate natural aging process known as maturation involves a series of reactions that induce changes in the cheese's physical, biochemical, microbiological, and particularly sensory characteristics, making it a complex aspect of cheese production. Recently, the adoption of omics sciences (e.g., metagenomics, metabolomics, proteomics) has emerged as a new trend in studies related to protected designation of origin (PDO) cheese. This mini-summary aims to outline the relationship between omics studies in these food matrices and all the sustainability facets of the production chain in general, and to discuss and recognize that the importance of these studies goes beyond comprehending the cheese biome and extends to fostering and ensuring the sustainability of the production chain. In this context, numerous studies in recent years have linked the identification of intrinsic characteristics of PDO cheeses through omics sciences to crucial sustainability themes such as territoriality, biodiversity, and the preservation of product authenticity. The trajectory suggests that, increasingly, multidisciplinary studies spanning various omics sciences will not only contribute to the characterization of these products but will also address sustainability aspects directly related to the production chain (e.g., authenticity, microbial biodiversity, functionality). This expansion underscores the multidisciplinary nature of these studies, broadening their social impact beyond the academic realm. Consequently, these pivotal studies play a crucial role in advancing discussions on PDO products and sustainability. © 2024 Society of Chemical Industry.</p>","author":"Bruno Domingues Galli","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"802726b4f7bf3b03d9074f79346c1e458dc9f67d4de1036036329f5f48aaa940","category":"Environment"}