{"title":"Impacts of gentamycin toxicity: nephroprotective role of guarana through different signaling pathways","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae167/7808471?rss=1","date":1727913600000,"content":"<span><div>Abstract</div>Gentamicin is a widely used aminoglycosidic antibiotic since its discovery. Like any other medication gentamicin causes unwanted side effects such as hepatotoxicity and nephrotoxicity. This study aims to examine the antioxidant effect of the guarana seed extract in protecting renal tissue. Forty male mice were divided into four groups (group one was control with free access to food and water, group two was treated orally with 300 mg/kg of guarana seed extract daily, group three was injected intraperitoneally with 100 mg/kg of gentamicin daily and the fourth group was co-treated with both 300 mg/kg of guarana seed extract orally and injected intraperitoneally with 100 mg/kg of gentamicin daily) for two weeks. Serum levels of urea, creatinine, AST, ALT, IL-1β and IL-6 have significantly elevated in the gentamicin treated group and those changes were not found in the guarana co-treated group. In gentamicin treated mice, a significant reduction was observed in two antioxidants SOD and GPX accompanied by downregulation of Ho-1 and Nrf2 while, that did not happen in the guarana seed extract co-treated group. Histopathology and immunohistochemistry slides show that the guarana seed extract prevents degenerative and necrotic events in tubular epithelial tissues caused by gentamicin toxicity. In conclusion, current data suggest that gentamicin can damage renal tissues when given at 100 mg/kg/day, however, the guarana seed extract may be capable of preventing that event when cotreated with the gentamicin as a supplement.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"802b538842d09ea85aa1fafd6a265fdbfcedc83fb13a093f0bb71de727c3ad4c","category":"Environment"}