{"title":"Is Apple's iOS 17 Live Voicemail Feature Too Confusing?","link":"https://www.macrumors.com/2023/07/14/ios-17-live-voicemail-confusing/","date":1689365624000,"content":"Apple in <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a> is introducing a new Live Voicemail feature that is designed to provide you with a transcript of the message that's being left as the person is speaking, so you can choose to pick up the phone if it's important.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Live-Voicemail-iOS-17.jpg\" alt width=\"1306\" height=\"793\" />\r<br />\nLive Voicemail is functional in both the developer and public betas, and the way the feature is set up has some <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users wondering if it's too confusing.\r<br />\n\r<br />\nWith the Live Voicemail feature enabled, the default voicemail message that was used in <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a> has changed. Unless you have a custom-created voicemail message, the default ‌iOS 17‌ voicemail recording asks callers to provide a reason why they're calling after the tone sounds, and are informed that \"the person you're calling may pick up.\" Note that if you had a custom message in ‌iOS 16‌, there will be no change, so this impacts people who are using the default voicemail greeting feature.\r<br />\n\r<br />\nThe \"may pick up\" wording seems to be confusing some people who are calling ‌iPhone‌ owners that have ‌iOS 17‌ installed. Two separate Reddit threads <a href=\"https://www.reddit.com/r/iOSBeta/comments/14wvsxc/ios_17_db3_live_voicemail_awkwardness/\">feature complaints</a> from <a href=\"https://www.reddit.com/r/iOSBeta/comments/1455t6f/ios_17_db_1_live_voicemail_prompt_seems_to/\">Reddit users</a> who have received calls from people who have not understood Apple's messaging. From Reddit:<blockquote>I just received a voicemail where someone explained their call and then sat in silence for 2 full minutes because they expected me to pick up. They then sent me a message about my phone not working. It seems like the current greeting when people reach live voicemail confuses them, especially since often they'll get that because I just didn't have my phone with me.</blockquote>Multiple other Reddit users have had the same problem, receiving confused texts from people or odd voicemail messages that feature dead air. We here at <em>MacRumors</em> have also experienced this same issue. On two occasions, incoming callers heard the message, stated their name, and then waited for the phone to be picked up rather than leaving a voicemail.\r<br />\n\r<br />\nIt is not yet clear if Apple has plans to make any changes to the default Live Voicemail messaging ahead of when ‌iOS 17‌ launches this fall. There is an option to customize a voicemail by going to Phone &gt; Voicemail &gt; Greeting &gt; Custom, which can provide a solution as you can record your own message. \r<br />\n\r<br />\nIf you have the ‌iOS 17‌ beta and are running into trouble with Live Voicemail and don't want to create a custom voicemail message, the feature can be disabled by opening up the Settings app, going to the Phone section, tapping on the Live Voicemail option, and toggling it off.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/14/ios-17-live-voicemail-confusing/\">Is Apple's iOS 17 Live Voicemail Feature Too Confusing?</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/is-apples-ios-17-live-voicemail-feature-too-confusing.2395931/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"802ce426ea19c2b39bdd3cca142bb99c7f9d8d86755950057e4c159e8ca4a047","category":"Apple"}