{"title":"Isotopic signature of N2O produced during sulfur‐ and thiosulfate‐driven chemoautotrophic denitrification in freshwaters","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12692?af=R","date":1728207528000,"content":"<h2>Abstract</h2>\n<p>Chemoautotrophic denitrification plays an important role in nitrogen removal and the formation of a greenhouse gas (N<sub>2</sub>O) in aquatic environments. Natural stable isotopes support the tracing of nitrogen sources and the identification of biogeochemical processes in field research. However, the isotopic characteristics of N<sub>2</sub>O produced during chemoautotrophic denitrification have not been investigated so far. In this study, we analyzed isotopic signatures of nitrate and N<sub>2</sub>O in sulfur- and thiosulfate-dependent denitrifying enrichments obtained from freshwater lakes. Chemoautotrophic denitrification exhibited a nitrate isotope pattern similar to heterotrophic denitrification: the <sup>18</sup>ε/<sup>15</sup>ε-nitrate followed a ratio close to 1. However, chemoautotrophic denitrification produced N<sub>2</sub>O with lower δ<sup>15</sup>N, δ<sup>18</sup>O, and higher site preference (SP = δ<sup>15</sup>N<sup>α</sup>-δ<sup>15</sup>N<sup>β</sup>) values, compared to heterotrophic denitrification. The SP value, approximately 5.1‰, was characteristic in detecting chemoautotrophic denitrification driven by different sulfur forms. δ<sup>18</sup>O varied with specific electron donors, around 20‰ and 40‰ during sulfur- and thiosulfate-dependent denitrification, respectively. The unique N<sub>2</sub>O isotope characteristics were likely regulated by nitric oxide reductases of Burkholderiaceae populations during sulfur-dependent denitrification and <i>Sulfurovum</i> during thiosulfate-dependent denitrification. These findings improve our understanding of N<sub>2</sub>O production processes and have important implications for predicting N<sub>2</sub>O emissions at a greater spatial and temporal resolution.</p>","author":"Shengjie Li, \nShuo Wang, \nYunmeng Pang, \nGuodong Ji","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"80372d754c8d961ba86e5ff0f596585acd3fec86ad5d9dda9ddd8ecb2a9c3ffb","category":"Environment"}