{"title":"Spiders eating snakes, oh my! Here are the photographs to prove it","link":"https://arstechnica.com/?p=1777922","date":1625586603000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/spider1-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/spider1.jpg\">Enlarge</a> <span>/</span> A brown widow spider feeding on a Brahminy blindsnake in a garden house in Zaachila, Oaxaca, Mexico. (credit: Matias Martinez)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>What's a spider with a discriminating palate to do when it gets tired of chowing down on its usual insect-heavy fare? A few nibbles of fresh snake might do the trick. Yes, some species of spider do indeed occasionally feast on snakes, according to <a href=\"https://bioone.org/journals/the-journal-of-arachnology/volume-49/issue-1/JoA-S-20-050/Spiders-Arachnida-Araneae-feeding-on-snakes-Reptilia-Squamata/10.1636/JoA-S-20-050.full\">a recent paper</a> published in the American Journal of Arachnology. And that paper is chock-full of pictures to prove it.</p>\n<p>Scientists had previously believed that spiders consumed live insects or other arthropods almost exclusively, but more recent research has shown their diets are more diverse. According to co-authors Martin Nyffeler (an arachnologist at the University of Basel) and J. Whitfield Gibbons (a herpetologist at the University of Georgia), various spider species have been found to feed on earthworms, velvet worms, bristle worms, slugs, snails, shrimp, crayfish, freshwater crabs, bats, mice, voles, rats, shrews, frogs, fish, newts, and salamanders, among other prey. There have also been multiple observed instances of spiders overpowering and feeding on snakes—usually baby or juvenile snakes.</p>\n<p>Nyffeler and Gibbons decided to conduct the first synthesis of the various documented cases, poring through published reports, Google pictures, Google books, social media sites, scientific  journals, and relevant academic dissertations and theses. The team ultimately found 319 individual reports of spiders preying on snakes, most of them naturally occurring incidents, although about seven percent were laboratory feeding trials or staged field experiments. Nearly 80 percent of those reports included photos or videos documenting the gruesome acts for posterity.</p></div><p><a href=\"https://arstechnica.com/?p=1777922#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777922&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"80373db1980a5d6086423b6cdc32623bab4d7d75c43e19aa53acdea30ff18caa","category":"Tech"}