{"title":"Colchicine&mdash;The Divine Medicine against COVID-19","link":"https://www.preprints.org/manuscript/202406.0822/v1","date":1718178417000,"content":"Colchicine has a number of effects that suggest it may be useful in the treatment of COVID-19. Myeloid cells are a major source of dysregulated inflammation in COVID-19. The hyperactivation of the NLRP3 inflammasome and the subsequent cytokine storm take place precisely inside them and can lead to multiorgan damage and death. NLRP3 inflammasome inhibition has been assessed at micromolar colchicine concentrations which cannot be achieved in serum. However, colchicine has remarkable ability to accumulate intensively in leukocytes, where the cytokine storm is generated.\nOver 50 observational studies and randomized clinical trials, small randomized non-controlled trials and retrospective cohort studies were initiated to test its healing effect in vivo, leading to conflicting, rather disappointing results. WHO gives ”Strong recommendation against” the use of colchicine for COVID-19 treatment. This is because low doses of colchicine are always used, where the concentrations required to inhibit the NLRP3 inflammasome in leukocytes cannot be reached.\nConsidering this, from March 2020 we started the administration of higher doses of colchicine. Our assumption was that safe increase in colchicine doses to reach micromolar concentrations in leukocytes will result in NLRP3 inflammasome/cytokine storm inhibition.\nWe demonstrated that in 785 inpatients treated with increasing doses of colchicine, mortality fell between 2 and 7 times. Our data, including also a large number of COVID-19 outpatients, showed that nearly 100% of the patients treated with this therapeutic regimen escaped hospitalization. In addition, post-covid symptoms in those treated with colchicine were significantly less. As a large number of viruses can overactivate the NLRP3 inflammasome (like seasonal influenza), we are convinced that higher colchicine doses would be useful in these cases as well.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"805ec6d6f8c63c1d7f9cce00e98e409cd482ead13d8cf1eeaf8837da2b2a0dc2","category":"Interdisciplinary"}