{"title":"Factors influencing healthcare workers’ and health system preparedness for the COVID-19 pandemic: A qualitative study in Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003356","date":1722348000000,"content":"<p>by Osamuedeme J. Odiase, Akua O. Gyamerah, Fabian Achana, Monica Getahun, Clara Yang, Sunita Bohara, Raymond Aborigo, Jerry John Nutor, Hawa Malechi, Benedicta Arhinful, John Koku Awoonor-Williams, Patience A. Afulani</p>\r\n\r\nAdequate preparedness of health systems, particularly healthcare workers (HCWs), to respond to COVID-19 is critical for the effective control of the virus, especially in low- and middle-income countries where health systems are overburdened. We examined Ghanaian HCWs’ perceived preparedness to respond to the pandemic and the factors that shaped their preparedness and that of the health system. Semi-structured in-depth interviews were conducted with n = 26 HCWs responsible for the clinical management of COVID-19 patients and three administrators responsible for developing and implementing COVID-19 policies at the facility level. Interviews were conducted over the phone in English, transcribed, and analyzed using a thematic analysis approach. Generally, HCWs felt inadequately prepared to contain the spread of COVID-19 due to resource shortages and inadequate training. HCWs, similarly, perceived the health system to be unprepared due to insufficient clinical infrastructure and logistical challenges. The few who felt prepared identified readiness in managing high consequence infectious disease cases and pre-existing protocols as enablers of HCW preparedness. The health system and HCWs were unprepared to manage the COVID-19 pandemic due to inadequate training, logistical challenges, and weak clinical infrastructure. Interventions are urgently needed to improve the health system’s preparedness for future pandemics.","author":"Osamuedeme J. Odiase","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"805f92371cb231cf64adacf2186653e8c7c93b857f2fc0d039344be2e30cd164","category":"Environment"}