{"title":"Role of Internal Control on Organizational Performance in Local Commercial Banks in Burao &ndash;Somaliland","link":"https://www.preprints.org/manuscript/202408.0506/v1","date":1723020580000,"content":"Commercial banks are financial institutions that accept public deposits and provide loans for consumption and investment to generate profit. The term \"bank\" originates from the Italian word \"banco,\" meaning \"desk\" or \"bench,\" which was used by Florentine bankers during the Renaissance for conducting transactions. Banking activities, however, date back to ancient times. The primary objective of this study is to examine the impact of internal control components on the organizational performance of local commercial banks in Burao, Somaliland. A descriptive research design was employed, utilizing primary data collected from these banks to assess the role of internal controls on organizational performance.The findings indicate a strong influence of internal control systems on organizational performance, revealing a significantly positive relationship between the two. Effective internal control systems contribute to the administration, completeness, and accuracy of records, and provide a safeguard against fraud and collusion, particularly among those in positions of authority or trust. For optimal performance, internal control systems must be robust and well-implemented. It is recommended that local commercial banks conduct regular internal audits of their accounting systems to mitigate risk and enhance internal control measures. Strengthening internal control systems tailored to the organization's operations and ensuring strict authorization protocols for access to bank assets are essential for improving organizational performance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"805fdb5cc167ef7150842359e087836c1b163c9e922a00ecd38f1144efb5ea86","category":"Interdisciplinary"}