{"title":"For the first time, ULA’s Vulcan rocket is fully stacked at Cape Canaveral","link":"https://arstechnica.com/?p=1992227","date":1703114392000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/53411134640_bac69f0726_k-800x600.jpg\" alt=\"United Launch Alliance's first Vulcan rocket stands 202 feet (61.6 meters) tall with the addition of its payload fairing.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/53411134640_bac69f0726_k.jpg\">Enlarge</a> <span>/</span> United Launch Alliance's first Vulcan rocket stands 202 feet (61.6 meters) tall with the addition of its payload fairing. (credit: <a href=\"https://www.flickr.com/photos/ulalaunch/53411134640/\">United Launch Alliance</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>United Launch Alliance's first Vulcan rocket has been fully assembled at Cape Canaveral, Florida, in preparation for its inaugural flight next month.</p>\n<p>Technicians hoisted the Vulcan rocket's payload fairing, containing a commercial lunar lander from Astrobotic, on top of the launch vehicle Wednesday morning at ULA's Vertical Integration Facility. This milestone followed the early morning transfer of the payload fairing from a nearby facility where Astrobotic's lunar lander was fueled for its flight to the Moon.</p>\n<p>ULA's new rocket has rolled between its vertical hangar and the launch pad at Cape Canaveral Space Force Station several times for countdown rehearsals and fueling tests. But ULA only needed the Vulcan rocket's first stage and upper stage to complete those tests. The addition of the payload shroud Wednesday marked the first time ULA has fully stacked a Vulcan rocket, standing some 202 feet (61.6 meters) tall, still surrounded by scaffolding and work platforms inside its assembly building.</p></div><p><a href=\"https://arstechnica.com/?p=1992227#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992227&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"805fb95106d609497e52e4303fd15d4264d541a32b606f073e1a2cdc417c5f46","category":"Tech"}