{"title":"What the physics of crowds can tell us about the tragic deaths at Astroworld","link":"https://arstechnica.com/?p=1811035","date":1636419873000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/crowd3-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/crowd3.jpg\">Enlarge</a> <span>/</span> A street sign showing the cancellation of the AstroWorld Festival at NRG Park on November 6, 2021 in Houston, Texas. Eight people died and 25 people were hospitalized after a crowd surge during the performance of rapper and musician Travis Scott. (credit: <a href=\"https://www.gettyimages.com/\">Alex Bierens de Haan/Getty Images)</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The <a href=\"https://en.wikipedia.org/wiki/Astroworld_Festival\">Astroworld</a> music festival in Houston, Texas, kicked off last Friday, but <a href=\"https://en.wikipedia.org/wiki/Astroworld_Festival_crowd_crush\">tragedy struck</a> when Grammy-nominated rapper <a href=\"https://en.wikipedia.org/wiki/Travis_Scott\">Travis Scott</a>—who launched the festival in 2018—took to the stage around 9 pm. The enthusiastic crowd surged toward the stage and packed the mosh pit so tightly that people couldn't breathe and began to pass out. There was no space to move, and in the end, at least eight people were killed, and another 25 were hospitalized.</p>\n<p>Concert promoter Live Nation issued a statement saying it was \"heartbroken for those lost and impacted at Astroworld,\" and the company pledged its full cooperation with local authorities who are investigating. As for Houston-native Scott, he <a href=\"https://deadline.com/2021/11/travis-scott-astroworld-festival-statement-instagram-1234869565/\">pronounced himself</a> \"just devastated\" in a video posted to his Instagram account last Saturday night and said he had not realized how severe the situation had become from his vantage point onstage. The rapper seems equally reluctant to take the stage in the immediate aftermath of the tragedy: Scott has reportedly canceled a planned set at the hiphop \"Day N Vegas\" festival, with <a href=\"https://www.vulture.com/2021/11/travis-scott-cancels-day-n-vegas-astroworld.html\">sources telling Vulture</a> the rapper is \"too distraught to play.\"</p>\n<p>There is still a <a href=\"https://www.washingtonpost.com/nation/2021/11/06/astroworld-travis-scott-deaths-houston/\">great deal we don't know</a> about the conditions at Astroworld and what actually happened that night, pending the results of an official investigation. But deadly crowd surges are a far too common occurrence all over the world. For instance, back in 1979, 11 people were trampled to death during a Who concert in Cincinnati. In 2000, nine people were trampled to death at a Pearl Jam concert during Denmark's Roskilde Festival. And in <a href=\"https://www.timesofisrael.com/dozens-said-hurt-as-stand-collapses-at-mass-lag-bomer-gathering-in-mount-meron/\">April of this year</a> in Meron, Israel, 45 people died in a crush at the Lag B'Omer religious festival, with 150 more injured.</p></div><p><a href=\"https://arstechnica.com/?p=1811035#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811035&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"80634740dc6b17d739036309107050b6933edbc5ea5c2ef6cd9ec18fbd7ec09d","category":"Tech"}