{"title":"The next-gen Apple Watch ‘100%’ won’t work with existing bands","link":"https://www.macworld.com/article/2177637/the-next-gen-apple-watch-100-wont-work-with-existing-bands.html","date":1703160900000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After another year of <a href=\"https://www.macworld.com/article/2114964/apple-watch-series-9-review.html\">extremely small Apple Watch upgrades</a>, all eyes are on next year’s 10th anniversary for the first major redesign. And a new rumor adds more evidence that one is coming.</p>\n\n\n\n<p>According to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/kosutamisan/status/1737412779307671870&amp;xcust=1-1-2177637-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Kosutami on X</a> (formerly Twitter), the next generation of the Apple Watch has “completely redesigned” band connectors. They say the reports that old bands won’t work with the new model are “100% accurate.” Mark Gurman of Bloomberg <a href=\"https://www.macworld.com/article/2030272/apple-watch-x-anniversary-thinnner-case-magnetic-bands-blood-pressure.html\">previously reported</a> that the 2024 Apple Watch will have a new magnetic band connector and a thinner design that would be incompatible with older bands.</p>\n\n\n\n<p>Apple has supported bands going back to the original Apple Watch—41mm watches work with 40mm and 38mm bands, and 45mm watches can use 42mm, 44mm, and 49mm bands—so changing them now would be understandable, though still a big deal. Apple will presumably sell many of the existing bands in the new format and also still sell older bands for at least a year or two.</p>\n\n\n\n<p>Kosutami says Apple is changing the bands because “the current connectors take a lot of space,” which seems to indicate that a redesign is on the way as well. In his recent 2024 preview, Gurman claimed Apple is “planning at least one model with a new look” after previously detailing upcoming changes to the Series X. So it certainly seems like 2024 will finally bring a truly new Apple Watch.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"806417884d4dbe28d6592659264455ff2a98255e706c081844bba578324bddd7","category":"Apple"}