{"title":"1960s-style aero testing with an old-school Mustang restomod","link":"https://arstechnica.com/?p=1978858","date":1698332358000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/OVC-Mustangs-Willow-Springs-Aero-Testing-2-800x533.jpg\" alt=\"A white Ford Mustang GT350 restomod with blue stripes, with the mountains of Willow Springs in the background\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/OVC-Mustangs-Willow-Springs-Aero-Testing-2-scaled.jpg\">Enlarge</a> <span>/</span> OVC's Shelby Mustang recreations are accurate enough to be granted official papers to compete in historic racing. (credit: Michael Teo Van Runkle)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>To Shelby Mustang fans, the Original Venice Crew (OVC) is the stuff of legends. This was the actual team that designed and built the original GT350s, Cobras, Daytona Coupes, and GT40s that introduced Carroll Shelby's name to the masses. Today, OVC builds modern Mustang recreations so accurate that one was approved for last year's Le Mans Classic, which celebrated 100 years of the world's most famous endurance race.</p>\n<p>But OVC also offers updated versions of those classics, bringing to life ideas that bounced around the shop back in the day but that Shelby never built in series production. Want a 1965 GT350 with independent rear suspension? OVC can do that, after dialing in a design that Ford originally believed would be too expensive as a replacement for the first-gen Mustang's solid rear axle.</p>\n<p>These projects don't quite fit under the \"restomod\" umbrella, instead falling more along the lines of the ideas that OVC founder and boss Jim Marietta remembers from his days back at <a href=\"https://www.motortrend.com/news/1703-then-and-now-shelby-american/\">1042 Princeton Drive</a>. Think fender flares cut by hand rather than being machined or updated fiberglass front fascias to provide additional airflow.</p></div><p><a href=\"https://arstechnica.com/?p=1978858#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1978858&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"806aea321e31e882eaf5449615c9e06ad67741d3b5711b6831d3b0bca3889d3a","category":"Tech"}