{"title":"Samsung makes the Galaxy Z Fold 5 and Z Flip 5 official","link":"https://arstechnica.com/?p=1956437","date":1690382943000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/UNPK_B5Q5-PR_dl1-980x693.jpg\" alt /></div>\n          <p>\n            Samsung's new foldables, the Z Fold 5 and Z Flip 5.                           [credit:\n                              Samsung                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Samsung's newest foldable phones are the <a href=\"https://howl.me/cke5ZjvM9AN\" target=\"_blank\">Galaxy Z Fold 5</a> and <a href=\"https://howl.me/cke5YTDHVeZ\" target=\"_blank\">Galaxy Z Flip 5</a>. The two devices were made official at a South Korean show early this morning.</p>\n<p>First is the Z Fold 5, which is phone-sized when closed and opens up to be a bigger device. The changes here are mostly just a spec bump and a new \"double rail Flex Hinge\" system. The new hinge design brings the phone more in line with most other foldables. When closed, the support plates under the display crease swing out of the way, allowing the bent-over display to sit more loosely in a teardrop shape rather than crushing it into a hard crease. This means the phone can fold flat instead of having a gap when closed. Most executions of this style of hinge still have a divot or trench in the middle of the screen, but it's easier on the display.</p>\n<p>The Fold was a pioneer as the first foldable phone, but it now seems to be spending this release catching up to the competition. Besides adopting the competition's hinge design, Samsung still has some work to do on the thinness front. Foldables are giant devices in your pocket, and thinness really matters when you're potentially talking about double the weight and thickness of a normal phone. The fold-flat hinge and some work slimming down the phone puts the Z Fold 5 at 13.4 mm thick when folded up. With a 4400 mAh battery, that's just not very impressive. In the US, the <a href=\"https://arstechnica.com/google/2023/07/pixel-fold-review-the-first-foldable-that-actually-feels-like-a-tablet/\">Pixel Fold</a> manages to be 12.1 mm thick with a 5000 mAh battery. In China, the <a href=\"https://arstechnica.com/gadgets/2023/07/the-honor-magic-v2-is-the-thinnest-foldable-smartphone-ever/\">Honor Magic V2</a> is somehow 9.9 mm thick when folded, with a 5000 mAh battery.</p></div><p><a href=\"https://arstechnica.com/?p=1956437#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956437&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8073ccbe9685a55f2decdc2eba349937e86afaa438b92fdc6c650b523402ddbc","category":"Tech"}