{"title":"Mouse Exploratory Behaviour in the Open Field with and without NAT-1 EEG Device: Effects of MK801 and Scopolamine","link":"https://www.preprints.org/manuscript/202405.1017/v1","date":1715839692000,"content":"One aspect of reproducibility in preclinical research that is frequently overlooked is the physical condition in which physiological, pharmacological, or behavioural recordings are conducted. In this study, the physical conditions of mice were altered through the attachments of wireless electrophysiological recording devices (Neural Activity Tracker-1, NAT-1). NAT-1 devices are miniaturised multichannel devices with on-board memory for direct high-resolution recording of brain activity for &gt;48 hrs. Such devices may limit the mobility of animals and affect their behavioural performance due to the added weight (total weight of approximately 3.4 g). Mice were additionally treated with saline (control), N-methyl-D-aspartate (NMDA) receptor antagonist MK801 (0.85 mg/kg), or the muscarinic acetylcholine receptor blocker scopolamine (0.65 mg/kg) to allow exploration of the effect of NAT-1 attachments in pharmacologically treated mice. We found only minimal differences in behavioural outcomes with NAT-1 attachments in standard parameters of locomotor activity widely reported for the open field test between drug-treatments. Hypoactivity was globally observed as a consistent outcome in MK801-treated subjects and hyperactivity in scopolamine groups regardless of NAT-1 attachments. These data collectively confirm the reproducibility for combined behavioural, pharmacological and physiological endpoints even in the presence of lightweight wireless data loggers. The NAT-1 therefore constitutes a pertinent tool for investigating brain activity in e.g. drug discovery, models of neuropsychiatric and/or neurodegenerative diseases with minimal effects on pharmacological and behavioural outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"80756c5ed4de6b7029f183a749f6f64e39138b807c385c242a597e9483255b4e","category":"Interdisciplinary"}