{"title":"PSXIII-7 Effects of whole corn on gain and subsequent feedlot and carcass traits of Brahman steers stocked on Tifton 85 bermudagrass","link":"https://academic.oup.com/jas/article/102/Supplement_3/612/7757748?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Supplementation (SUP) of stocker calves is used to enhance gain and/or adjust for stocking rates (SR). Our objective was to determine the influence of whole corn on performance of steers stocked on Tifton 85 bermudagrass [<span>Cynodon dactylon</span> (<span>L</span>.) <span>Pers</span>. X <span>Cynodon nlemfuensis Vanderyst</span>] (T85) that has documented forage crude protein ranging from 18.5% in June to 13.5% in September. For a 3-yr period, Brahman (<span>Bos indicus</span>) steers, 15 mo old and 275 kg body weight (BW), were stocked on T85 and received daily whole corn at 0 (PAS), 0.3% BW (SUP3), or 0.6% BW (SUP6). A fourth treatment included SUP6 at an increased stocking rate (SUP6SR). The 3-yr average SR of 275 kg steers was 11 steersּ ha<sup>-1</sup> on PAS, SUP3, and SUP6, and 15 steersּ ha<sup>-1</sup> on SUP6SR. Average daily gain (ADG) was similar for SUP steers at 0.98 kgּ d<sup>-1</sup> (SUP6), 0.92 kgּ d<sup>-1</sup> (SUP3), and 0.92 kgּ d<sup>-1</sup> (SUP6SR), but greater (<span>P</span> = 0.002) than PAS steers at 0.84 kgּ d<sup>-1</sup>. Steer gainּ ha<sup>-1</sup> was greatest (<span>P</span> = 0.001) for SUP6SR at 1230 kgּ ha<sup>-1</sup>. Gain ha<sup>-1</sup> was similar for SUP6 and SUP3 at 1,010 kgּ ha<sup>-1</sup> and 941 kgּ ha<sup>-1</sup>, respectively, and similar for SUP3 and PAS (860 kg<sup>-1</sup>). Body weights off pasture tended to be greater (<span>P</span> = 0.083) for all SUP steers at 370 kg than PAS steers at 354 kg. Body condition score off pasture was similar for all SUP steers at 5.7 and different (<span>P</span> = 0.001) from PAS steers at 5.2. At termination of stocking, steers were shipped 700 km to a commercial feedlot in South Texas. Each year, steers were fed in the same pen until a visual assessment of about 1.25 cm backfat was attained. Days on feed were similar for all steers at 190 d. Feedlot ADG was similar for steers on SUP3 (1.36 kgּ d<sup>-1</sup>), PAS (1.34 kgּ d<sup>-1</sup>), and SUP6SR (1.29 kgּ d<sup>-1</sup>), but greater (<span>P</span> = 0.045) than steers on SUP6 (1.24 kg d<sup>-1</sup>). These feedlot ADG exhibited some compensatory gain effects from pasture treatments. Off feedlot weights were similar at 620 kg. Steers were transported 60 km to an abattoir for harvest and carcass trait evaluations. There were no differences across treatments for steer hot carcass weight, 367 kg; 12<sup>th</sup> rib fat thickness, 1.13 cm; marbling score, 395; calculated yield grade, 3.10; longissimus dorsi area, 85.02 cm<sup>2</sup>; or internal fat (kidney-pelvic-heart), 1.92%. With SUP:extra gain at 12.5:1 for SUP3 and 13.8:1 for SUP6, supplementation of whole corn for Brahman steers stocked on T85 was not as efficient as previous T85 x SUP experiments with DDGS, but may offer management options for specific cattle classes and ownership-stocking strategies.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"807752a8bfa836180521efd4e2786595f2e858005080f3a5c01bc41f4fbdc138","category":"Environment"}