{"title":"Improving student engagement with a flipped classroom instruction model in Ethiopian higher education institutions: The case of Mattu University","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307382","date":1727877600000,"content":"<p>by Mekonnen Haile Faro, Tariku Sime Gutu, Adula Bekele Hunde</p>\r\n\r\nCurrently, the flipped classroom instruction model has received greater attention for its multifaceted advantages in improving student learning by boosting learning environments. To this end, a flipped classroom model was employed in the current study with the purpose of increasing student engagement across all three dimensions—behavioral, emotional, and cognitive. To look at the improvement observed as a result of this model, this study used a mixed-methods design, mainly a convergent parallel design. In the present study, fifty-five students from two distinct academic departments participated. In addition, the instructors of the courses that were chosen to be taught using a flipped classroom model were also participants in this study. The study employed focus groups, interviews, self-report surveys, and classroom observation strategies to gather the necessary data. The quantitative data were analyzed using descriptive aggregate means and paired sampling t-tests, while the qualitative data were analyzed using a thematic data analysis approach. The findings revealed that a flipped classroom greatly improved each of the three dimensions of student engagement. Moreover, the findings showed that the instruction model improved student engagement by creating learning environments where students could participate actively in class activities, interact more effectively with teachers and other students as well as with learning resources, and acquire the necessary knowledge from the courses. Future research may employ a large sample size with a sufficient time frame to make the findings more applicable to different educational institutions.","author":"Mekonnen Haile Faro","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"807d17505bd33c9c3e92b23772f3e1ec9a9645220d6b85532df432eeee1ad39d","category":"Interdisciplinary"}