{"title":"Rocket Report: Signs of life from Blue Origin; SpaceX preps next Starship","link":"https://arstechnica.com/?p=1991267","date":1702641637000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/aeonr-hotfire1-800x448.jpg\" alt=\"Relativity Space's Aeon R engine fires up on a test stand in Mississippi.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/aeonr-hotfire1.jpg\">Enlarge</a> <span>/</span> Relativity Space's Aeon R engine fires up on a test stand in Mississippi. (credit: <a href=\"https://www.youtube.com/watch?v=dDXc4YeiIoc\">Relativity Space</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.23 of the Rocket Report! In last week's report, my colleague Eric Berger mentioned what a year 2023 has been for rocket debuts. Several new launch vehicles flew for the first time this year, including SpaceX's Starship and Japan's H3. In this week's report, we have some news on some major rocket debuts planned for 2024, namely United Launch Alliance's Vulcan (now set for January) and Blue Origin's long-awaited New Glenn.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><b>Lost tanks will delay final Vega launch. </b>Remember last week's report that Avio, the Italian rocket-maker, lost track of propellant tanks needed for the final launch of Europe's Vega rocket? Well, it looks like Avio and the European Space Agency have a plan to remedy the situation, but it's risky and will delay the Vega launch by several months, <a href=\"https://spacenews.com/final-vega-launch-delayed-because-of-upper-stage-tank-problem/\">Space News reports</a>. “Avio has confirmed to ESA that there is an issue with tanks for the last Vega flight,” said Toni Tolker-Nielsen, ESA director of space transportation, without addressing the earlier report that the tanks for Vega's upper stage were found in a landfill, crushed and unusable.</p></div><p><a href=\"https://arstechnica.com/?p=1991267#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991267&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"807e24037130f32384a6e0d909e4b25dc310e94e7bb67c6dd4ead2d8a7f3f7cf","category":"Tech"}