{"title":"A novel mean shape based post-processing method for enhancing deep learning lower-limb muscle segmentation accuracy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308664","date":1728050400000,"content":"<p>by Zhicheng Lin, Enrico Dall’Ara, Lingzhong Guo</p>\r\n\r\nThis study aims at improving the lower-limb muscle segmentation accuracy of deep learning approaches based on Magnetic Resonance Imaging (MRI) scans, crucial for the diagnostic and therapeutic processes in musculoskeletal diseases. In general, segmentation methods such as U-Net deep learning neural networks can achieve good Dice Similarity Coefficient (DSC) values, e.g. around 0.83 to 0.91 on various cohorts. Some generic post-processing strategies have been studied to incorporate connectivity constraints into the resulting masks for the purpose of further improving the segmentation accuracy. In this paper, a novel mean shape (MS) based post-processing method is proposed, utilizing Statistical Shape Modelling (SSM) to fine-tune the segmentation output, taking into consideration the muscle anatomical shape. The methodology was compared to existing post-processing techniques and a commercial semi-automatic tool on MRI scans from two cohorts of post-menopausal women (10 Training, 8 Testing, voxel size 1.0x1.0x1.0 mm<sup>3</sup>). The MS based method obtained a mean DSC of 0.83 across the different analysed muscles and the best performance for the Hausdorff Distance (HD, 20.6 mm) and the Average Symmetric Surface Distance (ASSD, 2.1 mm). These findings highlight the feasibility and potential of using anatomical mean shape in post-processing of human lower-limb muscle segmentation task and indicate that the proposed method can be popularized to other biological organ segmentation mission.","author":"Zhicheng Lin","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8081c8f03d312fc8bfaad95be81cce5fd9ddfb641f08ddd1b962ffb7cd7e1f80","category":"Interdisciplinary"}