{"title":"Can digital financial inclusion converge the regional agricultural carbon emissions intensity gap?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307328","date":1721138400000,"content":"<p>by Lingzhi Tan, Nuolan Tian, Xiaxuan Li, Huan Chen</p>\r\n\r\nTo explore whether digital finance can reduce agricultural carbon emissions, promote regional convergence, and foster inclusivity in rural revitalization and shared prosperity, this paper uses the provincial-level index of digital financial inclusion to analyze the impact of digital financial inclusion on the intensity of agricultural carbon emissions and the Degum Gini coefficient (D-Gini coefficient) of regional carbon emission intensity in 30 sample provinces from 2010 to 2020. It examines the mechanism of the impact of digital financial inclusion on both variables to understand the underlying factors better. The main conclusions are as follows: (1) Digital financial inclusion significantly reduces the intensity of agricultural carbon emissions and narrows the gap in carbon emission intensity between regions. (2) The unconditional quantile regression coefficients show that the negative coefficients of the digital financial inclusion index and the three-dimensional indices decrease with increasing quantiles. However, the significant effects vary significantly at different quantiles. (3) Technological progress and the government’s ability to allocate financial resources play a significant mediating role, and the income gap between urban and rural areas can be further narrowed, as well as the carbon emission intensity gap between provinces. The empirical results are robust and proven by replacing the econometric analysis method, changing the core variables, and other methods.","author":"Lingzhi Tan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"80897842a38fb7cda9496236057d67658b33ef93daeae5dd485b92b0f1aab785","category":"Interdisciplinary"}