{"title":"The polymorphic top-shell puzzle: iterative taxonomy of Calliostoma Swainson, 1840 (Gastropoda: Calliostomatidae), in the Mediterranean Sea","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae026/7731343?rss=1","date":1723420800000,"content":"<span><div>ABSTRACT</div><span>Calliostoma</span> Swainson, 1840, as currently conceived, is the most species-rich genus of the order Trochida, with over 350 recognized species worldwide. The shell variability in these vetigastropods is extremely high, resulting in conflicting taxonomic attributions at both the genus and species levels. In the Mediterranean Sea, the remarkable morphological diversity of the <span>Calliostoma</span> top shells has led to the description of dozens of different taxa, of which nine are currently accepted. This taxonomic framework was tested using an iterative taxonomic approach. Species delimitation (using assemble species by automatic partitioning, clade monophyly and Kimura-2-parameter distances) and phylogenetic analyses (maximum likelihood and Bayesian inference) were carried out on 247 specimens from the Mediterranean and neighbouring Atlantic, including eight Mediterranean species and the Azorean <span>C. lividum</span>, spanning a large part of the morphological diversity and geographic distribution of the genus in the area. The molecular dataset comprised one nuclear marker, internal transcribed spacer 2 (ITS 2), and two mitochondrial markers (cytochrome <span>c</span> oxidase subunit 1 and 16S ribosomal RNA). Results indicate that the number of species is overestimated, as only <span>C. conulus, C. granulatum, C. zizyphinum</span> and <span>C. laugieri</span> are supported by molecular data among the assessed species. It is suggested that the morphological characters commonly used to diagnose species are variable within a single taxon, as three nominal taxa, allegedly endemic to the Mediterranean Sea, are here shown to be a single genetic species (<span>C. laugieri</span>). An ITS 2 2D folding structure is also reported as potentially distinctive for calliostomatids, compared to known Vetigastropoda. Our study indicates that to address the taxonomy of calliostomatid top shells, an integrative approach including molecular data is highly advisable to support species delimitation and especially new species description.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"8095238953f0867cd255f8bcf7cc5b39482f1423fa0de36890f789f0c98fae23","category":"Environment"}