{"title":"Developmental Programming of the Fetal Immune System by Maternal Western-style Diet: Mechanisms and Implications for Disease Pathways in the Offspring","link":"https://www.preprints.org/manuscript/202404.1361/v1","date":1713783955000,"content":"Maternal obesity and over/undernutrition can have a long-lasting impact on offspring health during critical periods in the first 1000 days of life. Children born to mothers with obesity have reduced immune responses to stimuli which increase susceptibility to infections. Recently, maternal western-style diets (WSD), high in fat and simple sugars, have been associated with skewing neonatal immune cell development, and recent evidence suggests that dysregulation of innate immunity in early life has long-term consequences on metabolic diseases and behavioral disorders in later life. Several factors contribute to abnormal innate immune tolerance or trained immunity, including changes in gut microbiota, metabolites, and epigenetic modifications. Critical knowledge gaps remain regarding the mechanisms whereby these factors impact fetal and postnatal immune cell development, especially in precursor stem cells in bone marrow and fetal liver. Components of the maternal microbiota that are transferred from mothers consuming a WSD to their offspring are understudied and identifying cause and effect on neonatal innate and adaptive immune development needs to be refined. Tools including single-cell RNA-sequencing, epigenetic analysis, and spatial location of specific immune cells in liver and bone marrow are critical for understanding immune system programming. Considering the vital role of immune function plays in offspring health, it will be important to understand how maternal diets can control developmental programming of innate and adaptive immunity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"80a4db3d23608a049e16fca75f74502b41fc163dc921dd228f879633b7812fcd","category":"Interdisciplinary"}