{"title":"Volkswagen is now leasing bikes in Germany: is this just the beginning?","link":"https://cyclingtips.com/2021/02/volkswagon-is-now-leasing-bikes-in-germany-is-this-just-the-beginning/","date":1614122400000,"content":"<p>Last week we pondered whether cycling could benefit <a href=\"https://cyclingtips.com/2021/02/in-the-fight-against-climate-change-should-bikes-be-more-like-cars/\" target=\"_blank\" rel=\"noreferrer noopener\">from adopting a car sales model</a>. One of the pillars of car sales discussed was leasing and financing.</p>\n\n\n\n<p>Shortly after publishing this article, I asked in an Instagram poll if riders would consider leasing their next bike. A resounding 67% said no. But that doesn&#8217;t seem to have worried Volkswagen, which has just launched bicycle leasing and financing in Germany.</p>\n\n\n\n<p>Volkswagen Financial Services, VW&#8217;s financial services division, will offer bike and e-bike leasing options to companies and their employees. At the same time, VW will offer bike financing options for private individuals.</p>\n\n\n\n<p>VWFS, which also provides financial services for Audi and Skoda, will offer private financing for bikes ranging from €500 to €10,000 which can even include helmets, and some accessories. More than 600 bike shops across Germany will offer the service and, interestingly, it is free for retailers to provide.</p>\n\n\n\n<p>The leasing option for German-based companies is said to be advantageous to both employer and employee. The employer can provide a &#8220;cost-neutral&#8221;, easy-to-set-up incentive for employees. Employee can avail themselves of a tax benefit by paying for the bike directly from their gross salary, have a choice of bikes for both commuting and private use, with servicing costs included. An employee can even lease two bikes at once.</p>\n\n\n\n<p>A link on the <a href=\"https://www.vwfs.de/geschaeftskunden/leasing-finanzierung/e-bike-leasing.html\" target=\"_blank\" rel=\"noreferrer noopener\">VWFS bike leasing page</a> states &#8220;Volkswagen Financial Services AG will in future be cooperating with the mobility service provider Bike Mobility Services GmbH&#8221;. This is interesting because <a href=\"http://support.mobility-services.bike/en/\" target=\"_blank\" rel=\"noreferrer noopener\">Bike Mobility Services GMBH</a> is a subsidiary of Derby Cycle Holding, Germany&#8217;s largest bicycle producer by sales. </p>\n\n\n\n<p><a href=\"https://www.derby-cycle.com/en.html\" target=\"_blank\" rel=\"noreferrer noopener\">Derby Cycle Holding</a> sells nearly half a million bikes per annum in Germany, including over 100,000 e-bikes from brands including Focus and Raleigh. </p>\n\n\n\n<p>But that is not the full story. Derby Cycle Holding is owned by the <a href=\"https://pon.com/en/about-pon/\" target=\"_blank\" rel=\"noreferrer noopener\">PON Group</a>, one of the largest companies in the Netherlands with a turnover of €7.5 billion and 12,000 employees. The global group has &#8220;several hundred&#8221; sites dotted across 27 countries. The company&#8217;s website explains its activities as &#8220;involved in mobility products, services, and solutions globally. We also offer hundreds of industry solutions&#8221;. </p>\n\n\n\n<p>PON claims to be the <a href=\"https://pon.com/en/activities/automotive/\" target=\"_blank\" rel=\"noreferrer noopener\">number-one car importer in the Netherlands</a> with marques such as VW, Audi, Skoda, Porsche, and Bentley helping them to a 20% market share. PON also has a large bike operation claiming to be &#8220;<a href=\"https://pon.bike/\" target=\"_blank\" rel=\"noreferrer noopener\">one of the top five players in the global bicycle industry</a>&#8221; which seems to add up given that PON owns brands such as Cervelo and BBB, along with those brands already under the Derby Cycle Holding umbrella. </p>\n\n\n\n<p>With such large players in the global automobile and cycling industry involved, one gets a sense the new VWFS offering in Germany is a pilot run of sorts. Will we see similar services rolled out around the globe? </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/volkswagon-is-now-leasing-bikes-in-germany-is-this-just-the-beginning/\">Volkswagen is now leasing bikes in Germany: is this just the beginning?</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"80b774acb7552f9491cd22147042d4ed012d1b733504cdef3b007ca25b5e9119","category":"Cycling"}