{"title":"Apple Watch Series 9 Rumored to Have New Pink Color Option","link":"https://www.macrumors.com/2023/08/01/apple-watch-series-9-pink-color/","date":1690901951000,"content":"The upcoming Apple Watch Series 9 will feature the same design as the Series 8, with 41mm and 45mm case sizes, but <a href=\"https://twitter.com/VNchocoTaco/status/1686388125575327745\">a new pink color</a> will be available for the aluminum model, according to info shared today by a previously-accurate leaker known as ShrimpApplePro.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-Watch-Faces-watchOS-10-Feature-Iridescent.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nPink will be a fifth color option for the aluminum Series 9 alongside the existing Midnight, Starlight, Silver, and (PRODUCT)RED finishes, the leaker said. Apple already offers a pink finish for a few other devices, such as the latest iPad Air, iPad mini, iPad, and iMac, and the iPhone 15 and iPhone 15 Plus are also <a href=\"https://www.macrumors.com/2023/02/23/iphone-15-color-options/\">rumored to be available in pink</a>.\r<br />\n\r<br />\nFor Apple Watch Series 9 models with a stainless steel case, color options are said to remain Gold, Silver, and Graphite.\r<br />\n\r<br />\nThe leaker expects Apple Watch Series 9 models to be equipped with a new chip, which <em>Bloomberg</em>'s Mark Gurman previously said will be <a href=\"https://www.macrumors.com/2023/05/08/apple-watch-series-9-updated-chip/\">based on the A15 Bionic chip</a> first used in the iPhone 13 models for improved performance.\r<br />\n\r<br />\nApple is expected to unveil the Apple Watch Series 9 in September alongside the iPhone 15 lineup and a second-generation Apple Watch Ultra. Series 9 models will ship in a smaller box compared to Series 8 models, the leaker added, as Apple continues to reduce the environmental footprint of its product packaging.<div>Tags: <a href=\"https://www.macrumors.com/guide/shrimpapplepro/\">ShrimpApplePro</a>, <a href=\"https://www.macrumors.com/guide/apple-watch-series-9/\">Apple Watch Series 9</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/01/apple-watch-series-9-pink-color/\">Apple Watch Series 9 Rumored to Have New Pink Color Option</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-watch-series-9-rumored-to-have-new-pink-color-option.2397451/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"80bae46df0b6fa03627d7e468f5a2e53c71c1984acf1c07ab152a2a2bd0e40d7","category":"Apple"}