{"title":"What a lovely day: Furiosa: A Mad Max Saga trailer is so shiny and chrome","link":"https://arstechnica.com/?p=1987749","date":1701450326000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Anya Taylor-Joy plays a younger version of <em>Fury Road</em>'s fierce Imperator in <em>Furiosa: A Mad Max Saga</em>. </p></div>\n<p>Among the undisputed highlights of 2015's post-apocalyptic masterpiece <a href=\"https://en.wikipedia.org/wiki/Mad_Max:_Fury_Road\"><em>Mad Max: Fury Road</em></a> was Charlize Theron's steely, vengeful <a href=\"https://en.wikipedia.org/wiki/Imperator_Furiosa\">Imperator Furiosa</a>, a war captain who turned against the brutal ruler of the Wasteland to free his enslaved \"wives.\" We now have our first look at the younger version of our beloved Imperator with the official trailer for <a href=\"https://en.wikipedia.org/wiki/Furiosa:_A_Mad_Max_Saga\"><em>Furiosa: A Mad Max Saga</em></a>—a spinoff prequel film starring Anya Taylor-Joy that traces the origin of this iconic character. It's everything we could want in a <em>Mad Max</em> trailer, and we are so very ready to witness this movie when it hits theaters next spring.</p>\n<p><strong>(Spoilers for <em>Mad Max: Fury Road</em> below.)</strong></p>\n<p>We met Furiosa early on in <em>Fury Road</em>, working logistics for <a href=\"https://en.wikipedia.org/wiki/Immortan_Joe\">Immortan Joe</a> (the late Hugh Keays-Byrne), who charged her with ferrying oil from Gas Town to his Citadel with the help of a small crew of War Boys and one of the war rigs—basically tractor trailer trucks souped up with armor and novel weaponry. Furiosa stole the war rig instead, taking Joe's five wives with her. She teamed up with Max to fight off Joe's army as they made their way to the Green Place, where Furiosa grew up. When they finally encountered the Vuvalini of Many Mothers, Furiosa learned that the Green Place was now an uninhabitable swamp. They ultimately returned to the Citadel and overthrew Immortan Joe, and our last image of her was a triumphant Furiosa on a lift rising into the citadel.</p></div><p><a href=\"https://arstechnica.com/?p=1987749#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1987749&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"80bbf5821b0369a64e2a6d86e8f836e087688e9873632b6e9e4820bf96f3e02f","category":"Tech"}