{"title":"PSIV-15 Effect of transient fetal bovine viral diarrhea virus infection on postnatal growth, estimated dry matter digestibility, glucose concentrations, and carcass characteristics","link":"https://academic.oup.com/jas/article/102/Supplement_3/463/7757543?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Fetal infection of bovine viral diarrhea virus (BVDV) before d 125 to 150 of gestation results in the birth of immunotolerant, persistently infected (PI) calves. Infection of BVDV during late gestation results in transient fetal infections (TI). Unvaccinated, yearling Hereford heifers (n = 25), seronegative for antibodies to BVDV1 and BVDV2, were bred by artificial insemination with X chromosome-bearing sperm from an Angus sire to examine the impact of TI on postnatal growth, estimated dry matter digestibility, blood glucose concentrations, and carcass characteristics. On d 175 of pregnancy, heifers were intranasally inoculated with either DMEM + 2% horse serum (sham control) to generate control calves or 4.0 log TCID50 noncytopathic type2 BVDV to generate TI calves. All sham-inoculated control dams remained seronegative, and all BVDV-inoculated dams seroconverted by d 14 post-inoculation. Sham-inoculated control dams (n = 12) and BVDV-inoculated dams (n = 12) gave birth to live calves. All control offspring were seronegative, and all TI offspring were seropositive for antibodies to type 2 BVDV at birth. All offspring were raised on pasture until weaning. At weaning, all calves were transported to our feedlot research facility, housed in one group feedlot pen, and transitioned to a high-energy concentrate-based diet until reaching an approximate BW of 600 kg. Upon arrival at the feedlot, all animals received a standard heifer growth implant, a modified live viral vaccine containing IBR-BRSV-PI3 and were dewormed. Heifer BW and jugular blood samples were collected every 28 d. On d 84 of the feeding period, titanium dioxide was added to the diet of 12, age-paired, individually fed, heifers (3 control and 3 TI heifers; approximately 1 yr of age) for 28 d and used to estimate dry matter digestibility. After approximately 280 d on feed heifers were transported to a USDA-inspected abattoir and harvested. The TI heifers had lighter birth weights (<span>P</span> &lt; 0.03) and final BW (<span>P</span> &lt; 0.04) when compared with control heifers. Average daily gain was greater (<span>P</span> &lt; 0.01) in control compared with TI heifers. Blood glucose concentrations were similar between control and TI heifers at all sampling time points. Dry matter intake of individually fed heifers was similar across treatments. TI heifers had a 2.2% lesser (<span>P</span> &lt; 0.05) dry matter digestibility and lighter (<span>P</span> &lt; 0.01) hot carcass weights compared with controls. These data suggest that TI fetal BVDV infection negatively impacts growth throughout the feeding period, possibly by impacting gastrointestinal tract function. This research was supported by USDA-NIFA Grant # 2019-67015-29866.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"80c145825e52d0080ee17640e60be0ff38f858f7a5af5b0e85e372dab01266fe","category":"Environment"}