{"title":"Report Details Turmoil Behind Apple's AI Efforts, 'Siri X,' and Headset Voice Controls","link":"https://www.macrumors.com/2023/04/27/report-details-turmoil-behind-siri-and-apple-ai/","date":1682601797000,"content":"<a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> and Apple's use of AI has been severely held back by caution and organizational dysfunction, according to over three dozen former Apple employees who spoke to <em>The Information</em>'s Wayne Ma.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/hey-siri-banner-apple.jpg\" alt width=\"1200\" height=\"630\" />\r<br />\nThe extensive <a href=\"https://www.theinformation.com/articles/apples-siri-chief-struggles-as-new-ai-era-begins\">paywalled report</a> explains why former Apple employees who worked in the company's AI and machine learning groups believe that a lack of ambition and organizational dysfunction have hindered ‌Siri‌ and the company's AI technologies. Apple's virtual assistant is apparently \"widely derided\" inside the company for its lack of functionality and minimal improvement over time.\r<br />\n\r<br />\nBy 2018, the team working on ‌Siri‌ had apparently \"devolved into a mess, driven by petty turf battles between senior leaders and heated arguments over the direction of the assistant.\" ‌Siri‌'s leadership did not want to invest in building tools to analyse ‌Siri‌'s usage and engineers lacked the ability to obtain basic details such as how many people were using the virtual assistant and how often they were doing so. The data that was obtained about ‌Siri‌ coming from the data science and engineering team was simply not being used, with some former employees calling it \"a waste of time and money.\"\r<br />\n\r<br />\nMany Apple employees purportedly left the company because it was too slow to make decisions or too conservative in its approach to new AI technologies, including the large-language models that underpin chatbots like ChatGPT. Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> personally attempted to persuade engineers who helped Apple modernize its search technology to stay at the company, before they left to work on large-language models at Google. \r<br />\n\r<br />\nApple executives are said to have dismissed proposals give ‌Siri‌ the ability to conduct extended back-and-forth conversations, claiming that the feature would be difficult to control and gimmicky. Apple's uncompromising stance on privacy has also created challenges for enhancing ‌Siri‌, with the company pushing for more of the virtual assistant's functions to be performed on-device.\r<br />\n\r<br />\nCook and other senior executives requested changes to ‌Siri‌ to prevent embarassing responses and the company prefers ‌Siri‌'s responses to be pre-written by a team of around 20 writers, rather than AI-generated. There were also specific decisions to exclude information such as <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> prices from ‌Siri‌ to push users directly to Apple's website instead.\r<br />\n\r<br />\n‌Siri‌ engineers working on the feature that uses material from the web to answer questions clashed with the design team over how accurate the responses had to be in 2019. The design team demanded a near-perfect accuracy rate before the feature could be released.\r<br />\n\r<br />\nEngineers claim to have spent months persuading ‌Siri‌ designers that not every one of its answers needed human verification, a limitation that made it impossible to scale up ‌Siri‌ to answer the huge number of questions asked by users. Similarly, Apple's design team repeatedly rejected the feature that enabled users to report a concern or issue with the content of a ‌Siri‌ answer, preventing machine-learning engineers from understanding mistakes, because it wanted ‌Siri‌ to appear \"all-knowing.\"\r<br />\n\r<br />\nIn 2019, the ‌Siri‌ team explored a project to rewrite the virtual assistant from scratch, codenamed \"Blackbird.\" The effort sought to create a lightweight version of ‌Siri‌ that would delegate the creation of functions to app developers and would run on iPhones instead of the cloud to improve performance and privacy. Demos of Blackbird apparently prompted excitement among Apple employees owing to its utility and responsiveness.\r<br />\n\r<br />\nBlackbird competed with the work of two senior leaders on the ‌Siri‌ team who were responsible for helping ‌Siri‌ understand and respond to queries. These individuals pushed for their own project, codenamed \"‌Siri‌ X,\" for the 10th anniversary of the virtual assistant. The project simply aimed to move ‌Siri‌'s processing on-device for privacy reasons, without the lightweight, modular functionality of Blackbird.\r<br />\n\r<br />\nHundreds of employees working on Blackbird were assigned to ‌Siri‌ X, which killed the ambitious project to make ‌Siri‌ more capable. ‌Siri‌ X was mostly completed in 2021 and now many of the voice assistant's functions are processed locally.\r<br />\n\r<br />\nMost recently, the group working on Apple's mixed reality headset were reportedly disappointed by the demonstrations provided by the ‌Siri‌ team on how the virtual assistant could control the headset. At one point in the device's development, the headset team considered building an alternative method for controlling the device using voice commands because ‌Siri‌ was deemed to be unsatisfactory.<div>Tags: <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a>, <a href=\"https://www.macrumors.com/guide/theinformation-com/\">The Information</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/27/report-details-turmoil-behind-siri-and-apple-ai/\">Report Details Turmoil Behind Apple's AI Efforts, 'Siri X,' and Headset Voice Controls</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/report-details-turmoil-behind-apples-ai-efforts-siri-x-and-headset-voice-controls.2387977/\">Discuss this article</a> in our forums<br /><br />","author":"Hartley Charlton","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"80caf5c4c36b53ffd6e6295dcbcdc5767e50ef5cc18f30e3891f337f6517a58a","category":"Apple"}