{"title":"Is sexual size dimorphism in walleye, Sander vitreus, a driver of seasonal movements in Lake Erie?","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15960?af=R","date":1729323518000,"content":"<h2>Abstract</h2>\n<p>Walleye (<i>Sander vitreus</i>) are a sexually dimorphic species in which females are larger than males in adulthood. Walleye can also exhibit sex- and population-based differences in migration behavior. In Lake Erie, we used acoustic telemetry to test the prediction that female walleye exhibit larger broad-scale movements than males during the summer and autumn. This prediction was based on the hypothesis that greater foraging in females would be needed to satisfy their higher energy requirements. We quantified movements of males and females from distinct spawning populations from Lake Erie's west and east basins using a lake-wide grid of acoustic receivers in 2017 and 2018. We found no differences between male and female home range sizes, core range sizes, or distances travelled in either population. Fish length-at-tagging was unrelated to the size of a fish's home range or to its distance travelled, contrary to previous predictions about body size as a driver of migration distance in the Lake Erie population. We found that west basin walleye occupied large and indiscrete portions of the lake, but the core range of females extended into the central basin, whereas males were concentrated in the west basin. Walleye originating from the east basin confined their movements primarily to the east basin and showed stronger home range overlap among members of their population than did walleye from the west basin population. Within either population, walleye had more home range overlap with members of the same sex, which likely reflects differences in the migratory tendencies of males and females.</p>","author":"Christian J. Bihun, \nMatthew D. Faust, \nRichard T. Kraus, \nThomas M. MacDougall, \nJason M. Robinson, \nChristopher S. Vandergoot, \nGraham D. Raby","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"80cc5e9f859b08d662a433336de3823b3199c548e3e019726a1f03f33a4592be","category":"Environment"}