{"title":"Generalisable Overview of Study Risk for Lead Investigators Needing Guidance (GOSLING): A data governance risk tool","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309308","date":1724162400000,"content":"<p>by Anmol Arora, Adam Loveday, Sarah Burge, Amy Gosling, Ari Ercole, Sarah Pountain, Helen Street, Stephanie Kabare, Raj Jena</p>\r\nIntroduction <p>Digitisation of patient records, coupled with a moral imperative to use routinely collected data for research, necessitate effective data governance that both facilitates evidence-based research and minimises associated risks. The Generalisable Overview of Study Risk for Lead Investigators Needing Guidance (GOSLING) provides the first quantitative risk-measure for assessing the data-related risks of clinical research projects.</p> Methods <p>GOSLING employs a self-assessment designed to standardise risk assessment, considering various domains, including data type, security measures, and public co-production. The tool categorises projects into low, medium, and high-risk tiers based on a scoring system developed with the input of patient and public members. It was validated using both real and synthesised project proposals to ensure its effectiveness at triaging the risk of requests for health data.</p> Results <p>The tool effectively distinguished between fifteen low, medium, and high-risk projects in testing, aligning with subjective expert assessments. An interactive interface and an open-access policy for the tool encourage researchers to self-evaluate and mitigate risks prior to submission for data governance review. Initial testing demonstrated its potential to streamline the review process by identifying projects that may require less scrutiny or those that pose significant risks.</p> Discussion <p>GOSLING represents the first quantitative approach to measuring study risk, answering calls for standardised risk assessments in using health data for research. Its implementation could contribute to advancing ethical data use, enhancing research transparency, and promoting public trust. Future work will focus on expanding its applicability and exploring its impact on research efficiency and data governance practices.</p>","author":"Anmol Arora","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"80ce5d27873e6e4a13b9cf44ce701dea5cc9f8185668d0ace31e8452e7e6620b","category":"Interdisciplinary"}