{"title":"139 Impact of supplementing rumen-protected methionine during the periconceptional period in the post-weaning period in female calves","link":"https://academic.oup.com/jas/article/102/Supplement_1/69/7618008?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>This study aimed to identify the impact of supplementing rumen-protected methionine (RPM) during the periconceptional period on beef cows in their progeny. Evidence suggests that changes in maternal nutrition in the periconceptional period have effects during the postnatal growth phase in cattle. We hypothesized that feeding RPM during the periconceptional period would program bovine gestation to enhance progeny growth. A total of 114 beef cows were fed a roughage-based diet and randomized to receive corn gluten supplemented with 15 g of RPM (Smartamine M, Adisseo) or not (CON) from d -7 to +7 relative to artificial insemination (AI) with female sex-sorted semen. Pregnancy diagnoses were conducted using transrectal ultrasonography 30 and 60 d after AI. Female calves (n = 34) remained with their dams until weaning. A month after weaning, calves were weighed every 14 d during an 8-mo period, and wither height (WH), body length (BL), and heart girth (HG) were measured. Dry matter intake (DMI), average daily gain (ADG), and residual feed intake (RFI) were measured during a 56-d performance test. At the end of the performance test, the 12<sup>th</sup> rib back fat (BF), ribeye area (REA), intramuscular fat (IMF), and rump fat (RF) were determined via ultrasound. A treatment-by-day interaction tendency (P = 0.10) was observed in HG, having larger HG in the RPM treatment from d 336-adj of age (CON = 154.52 ± 1.46 cm; RPM = 158.36 ± 1.34 cm). During the performance test, animals in the RPM treatment were heavier (CON = 437.25 ± 2.46 kg; RPM = 442.79 ± 2.34 kg; P = 0.01) at the end of the test. However, no treatment difference (P &gt; 0.05) was observed in DMI (CON = 12.06 ± 0.19 kg/d; RPM = 12.14 ± 0.18 kg/d), ADG (CON = 1.50 ± 0.03 kg; RPM = 1.55 ± 0.03 kg) and RFI (CON = -0.12 ± 0.15; RPM = 0.11 ± 0.14). No treatment difference (P &gt; 0.05) was observed in BF, REA, and IMF. However, RF was greater in the control treatment (CON = 1.16 ± 0.07 cm; RPM = 0.91 ± 0.06 cm), and a tendency of having a thicker BF in control was observed (Table 1). In conclusion, supplementing RPM enhanced final body weight during the performance test; furthermore, a treatment-by-day interaction tendency was observed in HG. On the contrary, CON progeny had more RF and a tendency to have a thicker BF.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"80d215e9de0fa4d45497fd83952b301873b1af5ea0227e477a4f4465811d3a6d","category":"Environment"}