{"title":"Zingiber officinale Uncovered: Integrating Experimental and Computational Approaches to Antibacterial and Phytochemical Profiling","link":"https://www.preprints.org/manuscript/202409.1729/v1","date":1727073578000,"content":"Zingiber officinale rhizome is widely cultivated in the central region of Sudan (Gezira) and data on the biological properties of this variety grown in the Sudan climate is scarce. The study aims to comprehensively analyze the antibacterial, antioxidant, phytochemical, and GC-MS properties of Zingiber officinale (Ginger rhizome) to explore its potential applications. The in vitro antibacterial assessment of the aqueous extract of the Sudanese ginger revealed moderate activity against Staphylococcus aureus, Salmonella typhi, Pseudomonas aeruginosa, Escherichia coli , and Klebsiella pneumonia, as resulted from the disc-diffusion which ranged between 12.87±0.11 mm to 14.5±0.12 mm at 30 µg/disc. The minimum inhibition concentration ranged between 6.25 to 25 µg/ml, the MBC were between 25 and 50 µg/ml, and the MBC/MIC exhibited its bactericidal effect against all tested bacteria. The phytochemical screening revealed the presence of various chemical constituents such as saponins, flavonoids, glycosides, alkaloids, steroids, terpenoids, and absence of tannins in the Sudanese ginger rhizome. Furthermore, the GC-MS study of ginger rhizome identified 22 chemical compounds with retention times ranging from 7.564 to 17.023 minutes. The identification of 22 chemical compounds through GC-MS analysis further underscores the prospect of harnessing ginger rhizome for the development of novel medications. The computational analyses showed that ginger compounds bind the 1JIJ and 2QZW with high binding affinities, which reach –9.5 kcal/mol. Ginger compounds also established promising molecular interactions with some key residues, that satisfactorily explain the in vitro results and support the pharmacokinetic and experimental findings. This study lays the groundwork for future research and pharmaceutical exploration aimed at harnessing the beneficial properties of ginger rhizome for medicinal and therapeutic purposes, particularly its antimicrobial potential.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"80d66c9ddd2a97db9d29816b712bd6ee299c005d8ab0068274f4c1ba86295637","category":"Interdisciplinary"}