{"title":"Perception and coping mechanisms of patients with diabetes mellitus during the COVID-19 pandemic in Ibadan, Nigeria","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309451","date":1724767200000,"content":"<p>by Olajumoke Ololade Tunji-Adepoju, Obasanjo Afolabi Bolarinwa, Richard Gyan Aboagye, Williams O. Balogun</p>\r\nBackground <p>The 2019 coronavirus disease (COVID-19) ushered in a period of fear and uncertainty, resulting in structural instability across the globe. Vulnerable individuals, such as patients with diabetes mellitus, are predispose to have adverse effects and complications of COVID-19 when infected. We explored the perception of diabetes mellitus patients during the COVID-19 pandemic and their coping mechanisms at the University College Hospital, Ibadan.</p> Methods <p>We employed an exploratory qualitative study design to explore diabetes mellitus patients’ perceptions and coping mechanisms during the COVID-19 pandemic. A purposive sampling technique was used to recruit 32 participants (2 health professionals and 30 diabetes mellitus patients). In-depth interviews were used to collect the data from the participants. All the recorded audio data were transcribed verbatim and exported to NVivo software for thematic data analyses.</p> Results <p>Most diabetes mellitus patients were not fearful of the pandemic but were optimistic that it would not affect their health. Mechanisms such as the usage of herbal medicines and adherence to COVID-19 precautionary measures were noticed among patients. The study also revealed that the hospital’s coping mechanism during the COVID-19 pandemic include prolonged appointments, limiting the number of patients attended per clinic day, and the provision of telehealth service. Patients in our study utilised negative coping mechanisms such as reduced drug dosages, subscriptions to cheaper drug brands, and reliance on religious institutions rather than a clinic for health instructions.</p> Conclusions <p>The study has shown that diabetes mellitus patients were not fearful of the COVID-19 pandemic. The utilisation of telehealth, encouragement of daily monitoring of sugar levels, provision of avenues for a medication review, and adherence to the safety protocols were coping mechanisms employed by the health system and diabetes mellitus patients. We recommend that the government and other healthcare stakeholders reinforce the resilience of diabetes mellitus patients by alleviating their health burdens during the pandemic. This could be done by subsidizing the prices of drugs, tests, and consultation fees for patients with diabetes mellitus. Also, more efforts should be made to elevate the health system through the reduction in waiting and appointment times in the diabetes clinic and employing more health personnel in the clinic.</p>","author":"Olajumoke Ololade Tunji-Adepoju","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"80d8df47d9af94c676906f24b950aa245e33bd1025ddfb286a3df8aa740d1e5a","category":"Interdisciplinary"}