{"title":"Van der Poel breezes to win in UAE Tour: Daily News Digest","link":"https://cyclingtips.com/2021/02/van-der-poel-breezes-to-win-in-uae-tour-daily-news-digest/","date":1613951773000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>After a delayed start to this year’s WorldTour calendar, the first top-tier race of the 2021 season is finally underway in the UAE, with Mathieu van der Poel coming out on top on a windy day that buried many GC hopes in the desert. </p>\n\n\n\n<p>Half a world away, the snappily-titled Tour des Alpes et Maritimes et du Var served up three days of scintillating racing&nbsp;–&nbsp;and the first COVID-scare of the season.&nbsp;</p>\n\n\n\n<p>All that and more in today’s Daily News Digest.</p>\n\n\n\n<p><em>Iain Treloar, Senior Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>UAE Tour is underway</h3>\n\n\n\n<p>The opening stage of the first WorldTour race of the season got underway on Sunday in the UAE, with strong winds splintering the peloton into a series of echelons and shelling the ambitions of many GC riders.</p>\n\n\n\n<p>It was Mathieu van der Poel (Alpecin-Fenix) who proved the strongest on the day, winning the sprint after a tough day’s racing and moving into the race lead.&nbsp;</p>\n\n\n\n<p>On a completely flat parcours, it was the wind and the exposed roads that would be the deciding factor. A group of 26 riders formed off the front, with several echelons chasing behind. Caught out were GC hopefuls including Sepp Kuss (Jumbo-Visma), Emanuel Buchmann (Bora-Hansgrohe), Sergio Higuita (EF Education-Nippo), Alejandro Valverde (Movistar), the Bahrain-Windswept duo of Wout Poels and Vincenzo Nibali, and Ineos Grenadiers’ Ivan Sosa and Dani Martinez.&nbsp;</p>\n\n\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">Ouch. 🤯<a href=\"https://t.co/MKAu12qwrG\">pic.twitter.com/MKAu12qwrG</a></p>— CyclingTips (@cyclingtips) <a href=\"https://twitter.com/cyclingtips/status/1363579313010790400?ref_src=twsrc%5Etfw\">February 21, 2021</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n<p>In that front group of 26 riders it was Mathieu van der Poel that took today’s win, but it’s João Almeida (Deceuninck-QuickStep), Tadej Pogačar (UAE Team Emirates) and Adam Yates (Ineos Grenadiers) who look like the most likely beneficiaries of the day’s drama. They hold a commanding position over their other GC rivals, after the chasing echelons eventually sat up and coagulated into one dejected group, crossing the line more than eight minutes down.&nbsp;</p>\n\n\n\n<h3>Woods wins second stage of Tour des Alpes et Maritimes et du Var</h3>\n\n\n\n<p>The Tour des Alpes et Maritimes et du Var – the artist formerly known as the Tour de Haut Var&nbsp;– had plenty of drama packed into its three stages.</p>\n\n\n\n<p>After Trek-Segafredo’s <a href=\"https://cyclingtips.com/2021/02/mollema-gets-a-win-in-france-daily-news/\">Bauke Mollema won the opening stage</a>, it was Michael Woods (Israel Start-Up Nation) that took the lead on Saturday’s stage two.&nbsp;</p>\n\n\n\n<p>On the short, steep climb of the Mur de Fayence, Woods led from the front from around 500 m to go, sustaining a brutal pace that opened a gap to Mollema and Jhonatan Narvaez (Ineos Grenadiers). Woods rounded the final hairpin with daylight, punched up to the line and finished two seconds ahead of Mollema.&nbsp;&nbsp;</p>\n\n\n\n<blockquote class=\"twitter-tweet\"><p lang=\"en\" dir=\"ltr\">When in doubt lead from the front. 📈<a href=\"https://t.co/ABcwqOK3u7\">pic.twitter.com/ABcwqOK3u7</a></p>— CyclingTips (@cyclingtips) <a href=\"https://twitter.com/cyclingtips/status/1363169505669570566?ref_src=twsrc%5Etfw\">February 20, 2021</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n<h3><strong>Brambilla seals the deal for Trek-Segafredo</strong></h3>\n\n\n\n<p>The final stage of the Tour des Alpes [etcetera] was the hardest, taking in three Alpine summits including the Col de la Madone. A strong breakaway group slipped away early in the stage, with riders such as Gianluca Brambilla (Trek-Segafredo), Tao Geoghegan Hart (Ineos Grenadiers), Simon Clarke (Assos Qhubeka) and Rudy Molard (Groupama-FDJ) all within striking distance of Woods’ overall lead. </p>\n\n\n\n<p>Groupama-FDJ pushed the pace of the breakaway, eventually whittling it down to 11 riders, while Woods and his Israel Start-Up Nation squad led the chase from the peloton. Towards the top of the Col de la Madone, Brambilla and Valentin Madouas (Groupama-FDJ) got clear of a further diminished breakaway, cresting the climb and bombing the descent to the finish. Behind, Woods went it alone in pursuit.</p>\n\n\n\n<p>Brambilla made his move at 11.3 km remaining, dropping Madouas and holding on to claim the stage win by 13 seconds ahead of Tao Geoghegan-Hart and Ben O’Connor (AG2R Citroën). That was enough for Brambilla to snatch the GC from Woods as well, who, despite a spirited chase, was left isolated in the finale due to mechanicals among his teammates. Ultimately, Woods yielded the leader’s jersey by a mere two seconds, with Brambilla capping an impressive outing for Trek-Segafredo.</p>\n\n\n\n<h3><strong>St. Michel-Auber 93 departs race after COVID-19 positive</strong></h3>\n\n\n\n<p>That wasn’t the only drama at the Tour des Alpes et Maritimes et Var&nbsp;–&nbsp;just prior to the stage beginning on Sunday, the St. Michel-Auber 93 team received notification that a team member had tested positive for COVID-19.&nbsp;</p>\n\n\n\n<p>The French continental team pulled out of the race a few minutes before the start, and is yet to announce whether the positive case was affecting a rider or a team staff member.&nbsp;</p>\n\n\n\n<p>The test was to determine the team&#8217;s attendance at Saturday&#8217;s Faun-Ardeche Classic race, and is part of the UCI’s COVID protocols which require a negative result six days out from a race start, and again three days out.</p>\n\n\n\n<h3><strong>Rigoberto Uran leaves UAE Tour before it begins</strong></h3>\n\n\n\n<p>EF Education-Nippo’s Colombian star, Rigoberto Uran, departed the UAE before the first stage of the race even began, dashing to Miami to be by his wife’s side for the imminent birth of the couple’s daughter. </p>\n\n\n\n<p>Uran <a href=\"https://www.instagram.com/p/CLjvO35Hqag/\">noted on Instagram</a> that after a long journey, he made it back in time. Congrats Rigo and Michelle, and welcome to the world Carlota!</p>\n\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>The flightless bird that inspired my off-the-couch 120 km gran fondo</h3>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/02/the-flightless-bird-that-inspired-my-off-the-couch-120-km-gran-fondo/\">Richard Abraham reflects on his first ride back</a> after 18 months off the bike, where he rediscovered a piece of himself he hadn’t known was missing.</p>\n\n\n\n<h3>The intersection of pro cycling and basic human rights</h3>\n\n\n\n<p>Two years ago, <a href=\"https://cyclingtips.com/2019/02/the-weekly-spin-the-intersection-of-pro-cycling-and-basic-human-rights/\">Neal Rogers wrote this about the UAE Tour</a>. It’s every bit as relevant today. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/van-der-poel-breezes-to-win-in-uae-tour-daily-news-digest/\">Van der Poel breezes to win in UAE Tour: Daily News Digest</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"80e7cc2bfd87a05673f91d7d4a07fc953a258a9e317f7a4905682541e7fa7f4d","category":"Cycling"}