{"title":"From the Pro’s Closet Museum: Norm Alvis’ 1992 Team Motorola MXL Eddy Merckx with Dura Ace 7400 – john watson","link":"https://theradavist.com/2021/05/from-the-pros-closet-norm-alvis-1992-team-motorola-mxl-eddy-merckx-with-dura-ace-7400/?utm_source=rss&utm_medium=rss&utm_campaign=from-the-pros-closet-norm-alvis-1992-team-motorola-mxl-eddy-merckx-with-dura-ace-7400","date":1621857603000,"content":"<p>Longtime readers of this website will recall our weekly “Merckx Mondays” posts that began back in 2008. Well, let me just get this out of the way and say don’t get your hopes up for its return, but I am very excited to share this Eddy Merckx with you, on a Monday, as a part of a little sub-category of vintage bikes we’ll be doing at the Radavist over the next few months.</p>\n<p>Last week, I traveled to Boulder to see <a href=\"https://www.theproscloset.com/\" target=\"_blank\">the Pro’s Closet</a>‘s new facilities and their forthcoming bicycle museum. After years of being stored in boxes, over three hundred bikes are being unpacked, built, and displayed at their new facility just outside of Boulder. I spent two days there learning all about their operations and browsing their extensive bicycle collection, while sneaking off to document a few I thought the readers of the Radavist would enjoy, so let’s jump right in…<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-31.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Back in February of 2010, <a href=\"https://theradavist.com/2010/02/merckx-mondays-29/\" target=\"_blank\">I picked up a very special Team 7-Eleven bike</a>, which, as it turned out, belonged to Eddy Merckx racer Norm Alvis. I tracked down his email to ask a few questions about the bike and was politely reminded that not all ex-professional racers want to talk about their old bikes or their old careers. I thanked him and went on my way. No harm done.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-39.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>When I was walking through the future museum at the Pro’s Closet, drooling over the expansive history, the gems of framebuilders I admire, the innovation, and the reoccurring themes we’re seeing in the cycling industry today (you’re in for a treat), I stumbled across this pristine Eddy Merckx, owned by none other than Norm Alvis. It had been over eleven years since I owned that bike and suddenly, I was filled with all kinds of emotions. I’m not crying, you’re crying…</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-5.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>From 1992, this bike was acquired in its current state with a mix of 7400 and 74002, 8-speed Dura-Ace, a Cinelli Grammo stem, Concor Lite saddle, and Norm’s old 7-Eleven wheels. This bike was most likely used both in races and as a training machine as many of these pros were often handed a few complete bikes.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-10.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-11.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Built from Columbus’ legendary MXL tubing, these bi-oval tubes marked a sea change in steel racing frames. Thanks to the unique profile and butting designs, you could have a stiff racing bike, able to withstand the rigors of sprints and European mountain descents all with the liveliness and durability of steel. This predated the later aluminum frames used in Eddy Merckx’s UCI racing teams.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-25.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-18.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Eddy Merckx took Columbus MAX and made a proprietary tubeset, lugs, bottom bracket shell, and a custom fork crown, labeling this concoction “MXL.” These frames were made by hand in Belgium and hold a very special place in my heart. Much later in my life, I came across a similar team bike and it later inspired both my <a href=\"https://theradavist.com/2012/04/beautiful-bicycle-my-icarus-columbus-max-track-bike/\" target=\"_blank\">Icarus track</a> and <a href=\"https://theradavist.com/2012/03/beautiful-bicycle-my-bishop-road-bike/\" target=\"_blank\">my Bishop road bike</a>. The ones that got away!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/Norm-Alvis-Team-Motorola-MXL-Eddy-Merckx-with-Dura-Ace-7400-3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While the rest of the bikes I shot from the Pro’s Closet’s collection are all mountain bikes, I’ll never stop swooning over these MXL Eddy Merckx frames and if I do, please someone pinch me!</p>\n<p><em>Thanks to <a href=\"https://www.theproscloset.com/\" target=\"_blank\">the Pro’s Closet</a> for letting me poke around their museum and ask so many questions about their day-to-day operations. If you’re looking for some eye candy, hop on over to <a href=\"https://www.theproscloset.com/pages/museum\" target=\"_blank\">their museum website</a>, and if you’re looking for a lightly-used bike (like this <a href=\"https://www.theproscloset.com/products/bombtrack-hook-adv-drop-bar-mountain-bike-2019-small-3\" target=\"_blank\">Bombtrack HOOK Adv</a>) that’s in stock and shipping today, heavily discounted from its original MSRP, <a href=\"https://www.theproscloset.com/collections/bikes\" target=\"_blank\">be sure to check out their current inventory</a>.</em></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"80ebf354335cc6f896e801c0897b4caf20556b85d555c212d05aa071faf5221b","category":"Cycling"}