{"title":"Jaybird Vista 2 Earbuds In-Depth Review For Sports","link":"https://www.dcrainmaker.com/2021/06/jaybird-vista-2-earbuds-in-depth-review-for-sports.html","date":1623169426000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review_thumb.jpg\" /></a></p>\n<p>Today Jaybird announced their new Vista 2 earbuds, which add a host of new features, including many aimed at the endurance sports crowd.  From increased waterproofing and even military-spec resistance levels, to Surround Sense noise pass-through, better wind cancellation, rapid charging and more. In theory, these new features would make it more appealing to athletes, including their sponsored cycling teams like L39ION, who they added today (and is also sponsored by Zwift for indoor training).</p>\n<p>In practice though?</p>\n<p>I had to turn them all off. So to spoil some of this review, I found that the new SurroundSense &amp; enhanced Active Noise Cancellation (ANC) features were essentially useless in both cycling and running. Though, they were great for indoor workouts such as Zwift or Peloton, or at the gym. But don’t worry, I’ll dive into the details down below. Which isn’t to say these buds are bad, there’s many other features that make them more appealing than their competitors for sport usage. Instead, to simplify, don’t let those two headliner features be the main reason if you’re the sporty type who moves at a running or above pace/speed.</p>\n<p>Note that for this review I’m using a media loaner from Jaybird. Once this review is done, I’ll get it boxed back up and sent back to them.  If you found this review useful, you can use the links at the bottom, or consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s get into it.</p>\n<h3>What’s New:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review-Unboxing.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review-Unboxing_thumb.jpg\" /></a></p>\n<p>I’m always kinda amazed how a product (of any type) from the outside can more or less look the same, but be vastly different inside, both hardware-wise but also software-wise. I suppose by now I should be used to this, but it’s really not till I sit down to write one of these ‘What’s New’ sections that all the little (and big) features that change between each iteration of a product bubble to the surface. And of course, there are invariably plenty more developer/engineer level changes that happen too.</p>\n<p>In any event, here’s what’s new on the Jaybird Vista 2, <a href=\"https://www.dcrainmaker.com/2019/07/jaybird-vista-earbuds-hands-on-an-airpods-powerbeats-pro-competitor-for-sports.html\">compared to the original Vista from two years ago</a>.</p>\n<p>– Added SurroundSense: Pass-through of outside noise (so you can hear people/cars/etc around you)<br />– Added in-ear detection: It’ll auto-pause music<br />– Increased Active Noise Cancellation: To remove outside noises like city noises or on an airplane<br />– Added Find my Case: The case actually has GPS in it, but that only works when in range of Bluetooth<br />– Retains existing Find my earbuds feature (for finding the buds, if in range of them)<br />– Added Case Wireless Charging: This works with any Qi wireless charging pad<br />– Added ‘WindDefense’ fabric over mics: This increases call mic clarity in windy conditions<br />– Increased buds to IP68 Water &amp; Dust Resistance (from IPX7 prior)<br />– Increased case to IP54 water resistance (so splash/rain/etc…)<br />– Completed MIL-STD-810G testing<br />– Redesigned ear tips a bit from previous, includes four sets in box<br />– Retains existing USB-C charging port for case<br />– Buds Battery claim is 8 hours for regular mode, or 6 hours with noise cancellation modes (from 6 hours regular mode on Vista 1)<br />– Case battery claim is 24 hours in total (from 16 hours on Vista 1)<br />– Can use earbuds independently as before</p>\n<p>Note that the price is $199USD, or essentially in the same ballpark as what we see the Apple PowerBeats Pro priced at these days, or what we often see Apple’s AirPods Pro priced at too.</p>\n<h3>The Basics:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-2-Basics.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-2-Basics_thumb.jpg\" /></a></p>\n<p>I’m not going to focus too much on non-sports usage, since for the most part, you’re here for sports usage. But, a few quick basics to get out of the way. First up, we’ve got the case. I like it, it’s small, tidy, and still packs in 24 hours of battery life potential (to charge the buds).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Pods-Out.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Pods-Out_thumb.jpg\" /></a></p>\n<p>The case can be wirelessly charged using any Qi wireless charger. So here it is <a href=\"https://www.amazon.com/CHOETECH-Certified-Ultra-Slim-Compatible-Qi-Enabled/dp/B00C40OG22?dchild=1&amp;keywords=choetech+wireless+charger&amp;qid=1623168265&amp;sr=8-11&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=4d4903b01b99d4cad6a103dfa76230fa&amp;language=en_US&amp;ref_=as_li_ss_tl\">on my $10 charger from many years ago</a>, charging the day away:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Wireless-Charger.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Wireless-Charger_thumb.jpg\" /></a></p>\n<p>The case also charges via USB-C, and can top-off your buds up to an hours worth of playing time in 5 minutes (the same as the Vista 1).</p>\n<p>Inside there’s a simple pairing button to pair up new devices. You can pair it to multiple devices. For example, I have it paired to my iPhone, my Windows computer, and my Garmin watch all concurrently. It won’t play audio concurrently to all of them, but you don’t have to re-pair it each time. All that’s pretty normal.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/P1022554.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/P1022554_thumb.jpg\" /></a></p>\n<p>I will say that it seems a bit finicky on handing off the connection to my iPhone, usually requiring me to go and manually press the ‘Connect’ option in the Bluetooth control panel on my phone before it’ll see it. I don’t have this problem on the Garmin watch or my computer. So I’m not sure if this is a Vista 2 problem or an iPhone problem.</p>\n<p>Once paired up, you’ll want to grab the Jaybird app. The reason being that’s how you change all the settings. You can use it without ever touching the Jaybird app (I did so for a few days initially), but if you want to change sound profiles and do other customization, you’ll need that. The app is free, and easy to install:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0018-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0018_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0016-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0016_thumb-1.png\" /></a></p>\n<p>Within the settings, one of the new features is the “Find my Case” option. This is in addition to the “Find my Buds” option. Both though depend on your phone being within Bluetooth range to locate the case or buds. So if you lost these on a trail, you’re mostly outta luck, though it will tell you the last known location of the bud. Thus, if you had the phone and app with you, it’ll record the location of the lost bud at the moment it lost it, and then even allow you to launch a maps app to see the location. It appears to check/record the location every 20 seconds, which means at walking/running speeds it’ll plot a location frequently enough to find it with Bluetooth pretty easily if you go back.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00134.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00134_thumb.png\" /></a><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00130-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00130_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00132-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00132_thumb-1.png\" /></a></p>\n<p>Interestingly, the case however only seems to record the location when the case itself is opened.</p>\n<p>Now unfortunately, there’s no Apple Find My integration here. I know Android users don’t care about that, but for iOS users I was really hoping we’d see Find My UWB integration like on <a href=\"https://www.amazon.com/Belkin-SoundForm-Freedom-Bluetooth-Earphones-Certified/dp/B095XL1L32?dchild=1&amp;keywords=Belkin%E2%80%99s+SOUNDFORM+Freedom+True&amp;qid=1623169011&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=6a84ac01eef73b1e10395d121b01996c&amp;language=en_US&amp;ref_=as_li_ss_tl\">Belkin’s Soundform Freedom True new earphones</a>. That’d be amazeballs here. And I think realistically, going forward, it’s gotta be standard in this category for anyone that’s not a phone maker (e.g. Samsung with their buds). It’s a massive selling point for iOS users, who realistically make up the majority of this particular market (and we all know Apple will undoubtedly launch Find My via UWB baked into the next iteration of AirPod Pro or PowerBeats Pro).</p>\n<p>When it comes to fit, the package comes with four sets of tips, for different ear sizes. You can easily remove them to figure out which ones fit best for you. Pretty standard stuff.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review-Tips.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Review-Tips_thumb.jpg\" /></a></p>\n<p>Meanwhile, also in the app is the ability to create your own EQ presets.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00124-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00124_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00126-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00126_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00128-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00128_thumb-1.png\" /></a></p>\n<p>Further, there’s boatloads of downloadable presets from top athletes to specific music genre ones. Or again, you can create your own.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-2-EQ-Presets.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-2-EQ-Presets_thumb.jpg\" /></a></p>\n<p>Finally, note that on the outside of the buds you’ll see a new fabric-looking section. That’s what Jaybird calls their ‘WindDefense’ fabric, which aims to act like a dead-cat on a microphone, and reduce wind noises before they get to the mics. Both earbuds have mics in them, as each side can be used independently in a singular mode, as some people prefer only using one bud at a time for awareness reasons.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-Fabric-CloseUp.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista-Fabric-CloseUp_thumb.jpg\" /></a></p>\n<p>Now, we’ll get into the wind reduction in the next section, so let’s dive in.</p>\n<h3>Sport Usage:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image0015.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image0015_thumb.jpg\" /></a></p>\n<p>Jaybird’s claim to fame here is “earth proof” ear buds, and marketing-wise it’s pretty genius. They’ve got a slew of different certifications. For the waterproofing and dust side, they’ve gone with IP68, making it dust resistant as well as water resistant for 1 hour at 3 meters (better than IPX7, which is 30 minutes at 1 meter). These won’t work in the pool from a sound standpoint (since digital audio signals can’t transit water more than a centimeter or two), but if you jump in the pool for a second they won’t die. Same goes for lounging around the pool.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-A-Bit-Wet.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-A-Bit-Wet_thumb.jpg\" /></a></p>\n<p>They’ve also completed testing against MIL-STD-810G, which is a US military standard for how you can test devices in certain environmental conditions. Jaybird says they aren’t aligning to any military here, but simply noting that their product exceeds ruggedness standards that are well defined in this spec.</p>\n<p>You can read the <a href=\"https://www.atec.army.mil/publications/mil-std-810g/mil-std-810g.pdf\">very long spec document here</a>, if you’re into that thing (it covers a massive number of areas, such as freezing, thawing, acceleration, immersion, sand, dust, salt fog, fungus, humidity, impacts, ballistic shock, and more).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/image-23.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/image_thumb-23.png\" /></a></p>\n<p>These sorts of certifications are often used in marketing (as, is exactly the case here). But at the same time, passing even the bulk of these types of certifications requirements means enough engineering to not kill the device through any given test. And more importantly, these tend to have surprisingly similar overlap to sports, especially endurance sports.</p>\n<p>While ballistics are not typically part of most iron-distance events, many of the other aspects of the list above are a normal part of endurance sports training and racing. Which again, is probably why Jaybird units are known to last a while.</p>\n<p>In any case, for my workouts I used both my phone (cycling) and Garmin FR945 (LTE) for testing. For running I used my watch, and for cycling I used my phone.  When it comes to pairing up to a Garmin watch for example, you’ll simply kick the buds into pairing mode by holding the button on the case, and then searching for it on the watch:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Garmin-Forerunner945-Pairing.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Garmin-Forerunner945-Pairing_thumb.jpg\" /></a></p>\n<p>All Garmin watches with music support work the same way in this manner, and this then lets me listen to music without a phone nearby. So in my case, that was primarily Spotify:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Garmin-FR945-Jaybird-Vista-2-Spotify.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Garmin-FR945-Jaybird-Vista-2-Spotify_thumb.jpg\" /></a></p>\n<p>Once paired up to a watch, there’s no additional configuration that you can do, aside from basic controls (start/stop/volume). However, if you predefine the sound management options to be one of your earbud tap options, then you can access that mid workout – allowing you to iterate through the three main sound management modes. Which, is as good a time as any to discuss them.</p>\n<p>The Vista 2 have two core new features:</p>\n<p><strong>Increased Active Noise Cancellation (called ANC for short):</strong> This is more or less standard noise cancellation that removes background/outside noises. So that lawnmower, the planes flying overhead right now, some voices, etc… It does this by using the microphones on the buds to figure things out, and removes those sounds in software, leaving you only the sound of your music. Note: They previously had noise cancellation, but they re-arranged the hardware here.</p>\n<p><strong>SurroundSense:</strong> This is sound pass-through, in effect, the opposite of ANC. The key difference here though is that it’s amplifying that sound, so you can ear the bus or bike dinging behind you, the person yelling ‘on your left’, and so on. This mode is meant to make it so you can hear everything around you while still listening to music. Just like with ANC, it uses the mics to amplify that sound.</p>\n<p>In addition to those two new modes, you have what is the previous mode, which is simply ‘Off’. In that mode you’ll hear your music, but there’s no noise cancellation or pass-through. In other words, it’s just like before.</p>\n<p>So, let’s start with SurroundSense. This is the mode that allows pass-through of sound (in other words, the mode you should use while training outdoors). It has two main options within it: Ambient noise level, and wind filtering level, you can adjust these as you see fit:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00110-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00110_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00114-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00114_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00122-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00122_thumb-1.png\" /></a></p>\n<p>I found that the ambient noise pass-through was good. At times, scary good. Like, the mics were picking up conversations from half a city away. Perhaps occasionally a bit overambitious, but hey, nobody is sneaking up on you with this enabled.</p>\n<p>However, the wind filtering here simply didn’t work. While there was slight differences between the three levels, it was simply degrees of suck. With even the slightest breeze, or anything above walking speed, the wind noise was heavily amplified. Like, there was no wind outside, but there was a hurricane in my ears. You can adjust the position of your head (totally sideways), and in some cases that gets rid of it. But I can’t easily run or ride my way across the city looking to my left or right the entire time.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image001-3.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image001_thumb-3.jpg\" /></a></p>\n<p>But the problem here is essentially that the amount of wind hitting the mic and the way it hits the mic varies, and as such, their algorithm doesn’t seem to be able to handle that super well. <a href=\"https://www.youtube.com/watch?v=TCXQ3glJaCQ\">DesFit has noted the same in his review as well</a>.</p>\n<p>Meanwhile, if you switch to ANC (Active Noise Cancelling), then you lose all configuration options for hurricane levels, but simply keep the hurricane. Again, this is the mode that cancels out all outside noise. That’s great if you’re on an airplane (or, live below a flight path like me), or, if you’re at the gym and want to ignore the world. But the thing is, it’s still using the mics to cancel out that noise. Thus as soon as you start moving, the wind comes back into your head.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00118-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00118_thumb-1.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00116-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00116_thumb-1.png\" /></a></p>\n<p>And by ‘moving’, I mean anything at running or riding pace. While I’ve been trying many different modes over the last week, I spent half my bike commute this morning trying every possible option for ANC &amp; SurroundSense to see if any were viable, and simply put – none were.</p>\n<p>Thus ultimately, I just turned it off. That gave me crystal clear sound (minus my footsteps when running), but it also gave me back battery life. The other two modes chop off about 2 hours of battery life (from 8 hours to 6 hours) when enabled, whereas turning it off means no slice in battery life.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Sound-management-Off.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-Vista2-Sound-management-Off_thumb.jpg\" /></a></p>\n<p>As is usually the case, I’ve had ZERO dropouts on any of my workouts with the Garmin FR945 LTE. This is pretty similar with most recent Garmin watches (compared to the first few models of watches where they added music connectivity). These days, most headphone companies that focus on sports, and most watch companies that do music, have figured out how to work together happily. And in this case, it was indeed happily.</p>\n<p>I also haven’t killed the headphones either. Granted, it’s still early days, but hey – I’ve got a well earned reputation for killing things quickly. And the warmer weather has brought plenty of sweat for me lately.</p>\n<p>One last thing to mention is that you can customize what the buttons do, as well as what taps do. Jaybird added an accelerometer to both buds, so they can now ‘feel’ when you tap them (but don’t press the button). And then from that you can customize what each function does. Even more, you can customize it differently for each earbud (left vs right). The ‘Sound Management’ option iterates through the ANC/SurroundSense/Off options.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image001-2.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image001_thumb-2.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/06/clip_image00120-1.png\"><img src=\"https://media.dcrainmaker.com/images/2021/06/clip_image00120_thumb-1.png\" /></a></p>\n<p>Additionally, you can turn ‘Auto-Pause’ off or on in the menus, as well as change the language of the voice in your head. So things like connection notifications can be in English (US or UK), Spanish, French, German, Japanese, Korean, or Mandarin. And you can turn off those voices entirely, and simply use tones instead.</p>\n<p>Finally, as for audio quality – I’m not an audiophile, and I won’t claim to be. I’m a sport guy. And by and large, when I’m toughing it through an interval workout or riding a bike, having astounding audio quality isn’t really high on my list. Instead, I’m looking for reliability of connection to sport-specific scenarios, device durability, whether or not the buds/device falls out, how it handles things like wind, or other noises on the route.</p>\n<p>Thus, undoubtedly, there will be audio quality tests from audio-focused sites on the interwebs. I’m not one of those, though frankly, I might as well be here. Because if you’re looking at using these buds for anything above walking speed, with either ANC or SurroundSense, then audio quality won’t matter, because all you’ll hear is wind. And if history is any indication, most audio-focused sites won’t ever leave their desk…despite being a sport product.</p>\n<h3>Wrap-Up:</h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-vista-2-connected.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/06/Jaybird-vista-2-connected_thumb.jpg\" /></a></p>\n<p>The Jaybird Vista 2’s have a number of pretty solid upgrades that make them worthwhile for consideration if you’re looking for sport-focused buds, from a company known for making sport buds that aren’t easily killed. They’ve got both the certification specs to back it, but also plenty of folks have years of experience with past products living longer than the average bear.</p>\n<p>And all that’s great. But the challenge I have is that the two key new features (SurroundSense and Active Noise Cancelation) simply don’t work for cycling, or even running. I don’t want a hurricane of wind noise in my head when I’m running on a windless day. It’s as simple as that. Now, when I turn those features off (and thus, turn it into a Vista 1), then it’s great. That’s how I used it on my run today, and all was well. No hurricane in my head and reasonably good audio quality, as well as good fit.</p>\n<p>Plus, I do appreciate the battery times, small size of the case (so much better than my Beats PowerBeat Pro), and the fact that the buds correctly settle in the case properly when I close it (again, something my Beats PowerBeat Pro doesn’t always do). If they can adjust, via firmware updates, the algorithm for wind reduction (I tried all the settings/options), then I’m totally game here.</p>\n<p>Now of course, if you’re in a gym, or other activity where wind isn’t an issue – then go forth!</p>\n<p>With that, thanks for reading!</p>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Jaybird Vista 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Jaybird-985-000928-Vista-2-Black/dp/B08B3G74MY?dchild=1&amp;keywords=Jaybird+Vista+2&amp;qid=1623156175&amp;refresh=1&amp;sr=8-2-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE3QUxRRTMyTldGR1QmZW5jcnlwdGVkSWQ9QTA1MDg3NTJQSFdUTUxLVEYwWDImZW5jcnlwdGVkQWRJZD1BMDcwMjA5MkswUTRUNlU4OFlRSyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=08dcbae4030d0b4a12932bd18122108b&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/06/JaybirdVista2-720x457.jpg\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2019/07/jaybird-vista-earbuds-hands-on-an-airpods-powerbeats-pro-competitor-for-sports.html\" target=\"_blank\">Jaybird Vista 2</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Jaybird-985-000928-Vista-2-Black/dp/B08B3G74MY?dchild=1&amp;keywords=Jaybird+Vista+2&amp;qid=1623156175&amp;refresh=1&amp;sr=8-2-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE3QUxRRTMyTldGR1QmZW5jcnlwdGVkSWQ9QTA1MDg3NTJQSFdUTUxLVEYwWDImZW5jcnlwdGVkQWRJZD1BMDcwMjA5MkswUTRUNlU4OFlRSyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=08dcbae4030d0b4a12932bd18122108b&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$200</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Jaybird Vista 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you use <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=b5770911-39dc-46ac-ba0f-b49dbb30c5c7&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.backcountry.com%2F\">Backcountry.com</a> or <a href=\"https://www.avantlink.com/click.php?tt=cl&amp;merchant_id=92594cfb-2b30-40ba-ab76-f9c20ed4612c&amp;website_id=7128e6e8-6ace-426f-80ef-177cd2ef6051&amp;url=https%3A%2F%2Fwww.competitivecyclist.com%2F\">Competitive Cyclist</a> with coupon code <b>DCRAINMAKER</b>, first time users save 15% on applicable products!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Jaybird-985-000928-Vista-2-Black/dp/B08B3G74MY?dchild=1&amp;keywords=Jaybird+Vista+2&amp;qid=1623156175&amp;refresh=1&amp;sr=8-2-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE3QUxRRTMyTldGR1QmZW5jcnlwdGVkSWQ9QTA1MDg3NTJQSFdUTUxLVEYwWDImZW5jcnlwdGVkQWRJZD1BMDcwMjA5MkswUTRUNlU4OFlRSyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=08dcbae4030d0b4a12932bd18122108b&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img src=\"https://media.dcrainmaker.com/images/2021/06/JaybirdVista2-720x457.jpg\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2019/07/jaybird-vista-earbuds-hands-on-an-airpods-powerbeats-pro-competitor-for-sports.html\" target=\"_blank\">Jaybird Vista 2</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Jaybird-985-000928-Vista-2-Black/dp/B08B3G74MY?dchild=1&amp;keywords=Jaybird+Vista+2&amp;qid=1623156175&amp;refresh=1&amp;sr=8-2-spons&amp;psc=1&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUE3QUxRRTMyTldGR1QmZW5jcnlwdGVkSWQ9QTA1MDg3NTJQSFdUTUxLVEYwWDImZW5jcnlwdGVkQWRJZD1BMDcwMjA5MkswUTRUNlU4OFlRSyZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=08dcbae4030d0b4a12932bd18122108b&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span></span><span>Amazon</span><span>Buy Now</span> <span>$200</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"80eb81087fd5dc1f5f688d14a257a9b1404549f4de00b7cc10537886bce6d3e1","category":"Cycling"}