{"title":"‘Allez Opi-Omi’ spectator fined","link":"https://cyclingtips.com/2021/12/allez-opi-omi-spectator-fined/","date":1639075319000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/Screen-Shot-2021-06-27-at-12.12.35-am-650x362.jpg\" /></div><h2>'Allez Opi-Omi' spectator fined</h2><p>\n</p><p>The sign-holding fan who <a href=\"https://cyclingtips.com/2021/06/fan-causes-a-huge-crash-on-stage-1-of-the-tour-de-france/\" target=\"_blank\">caused a massive crash</a> at the 2021 Tour de France has been fined by a French court, but will avoid any prison time.</p>\n\n\n\n<p>As <a href=\"https://www.ouest-france.fr/bretagne/brest-29200/tour-de-france-opi-omi-la-spectatrice-a-la-pancarte-condamnee-a-une-amende-e2087dd0-58e9-11ec-adfc-3597a34faeca\" target=\"_blank\">Ouest-France</a> reports, the 31-year-old Frenchwoman was ordered to pay a fine of €1,200, €500 in damages to the French National Union of Professional Cyclists, and a further symbolic €1.</p>\n\n\n\n<p>The incident that led to Thursday’s fines occurred on the opening stage of the Tour de France, which ran from Brest to Landerneau, on June 26. Standing on the edge of the road as the race approached, the fan was holding a cardboard sign that read “Allez Opi-Omi” that protruded into the road (“Opi” and “Omi” are German terms of endearment for grandparents). Tony Martin collided with the sign, hitting the deck and causing a huge pileup behind.</p>\n\n\n\n<p>Numerous riders went down in the crash, with Jasha Sütterlin and Marc Soler both abandoning the race as a result.</p>\n\n\n\n<p>The spectator, whose identity has been withheld, was later found and spent nearly two days in police custody. She apologized for causing the crash and reportedly said, “I know I did something stupid.”</p>\n\n\n\n<p>Prosecutors requested a suspended prison sentence, but Thursday’s decision means that the fan will face only monetary penalties instead.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/allez-opi-omi-spectator-fined/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"80ef248d043bfacf2da596b2288bab3e4eef9a3388673906eae3c57d071c27a5","category":"Cycling"}