{"title":"Investigation of the Origin of Elevated Amounts of Iron and Manganese in a Dam Reservoir","link":"https://www.preprints.org/manuscript/202410.1393/v1","date":1729169078000,"content":"In the outskirts of the Pinios dam reservoir (Ilia Regional Unit, Greece) a freshwater refinery serves the water supply needs of the surrounding Municipalities, in which high concentrations of Fe and Mn, before treatment, have been observed. The main purpose of this research is to investigate the mechanism of increased iron (Fe) and manganese (Mn) levels in the reservoir of the Pinios dam, which impacts its freshwater refinery's operation. A comprehensive hydrochemical and sedimentological analysis was conducted over a hydrological year, focusing on the spatial and temporal distribution of Fe and Mn in both water and sediment samples across the established research monitoring stations. Sediment samples from the reservoir's bottom revealed predominantly fine-grained material, rich in total organic carbon, with elevated Mn and Fe oxide levels. Significant seasonal variations in Fe and Mn levels were also discovered, with higher Mn levels observed in the anoxic bottom waters of the reservoir during the dry season, attributed to the reduced conditions favoring Mn oxide dissolution over Fe. Conversely, during the wet season, a homogenization of metal concentrations throughout the water column was observed due to increased oxygenation and freshwater inflow. These outcomes were confirmed by the hydrochemical analysis, indicating that the redox conditions, pH, temperature, as well as the presence of organic matter significantly influence the mobility and bioavailability of these metals in the reservoir. The findings of this study clarify that the high concentration of Fe and Mn can be linked to the mineral composition of the upstream Neogene and flysch formations in the study area. As these formations are affected by geological weathering, they tend to enrich the streams, through soil erosion and runoff processes, in metals like Fe and Mn, which are eventually transported into the dam reservoir. This study highlights the critical role of geological, sedimentological and hydrological factors in shaping the hydrochemistry of dam reservoirs, providing essential insights for water resource management and environmental conservation strategies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"80f0133d79d819ad4d469eb2ea6f3bfc4c62f8d49ae7d3c57ba01b6478783a12","category":"Interdisciplinary"}