{"title":"Tencent Cloud ประกาศความสำเร็จพัฒนาชิปใช้เอง ทั้งชิปปัญญาประดิษฐ, เข้ารหัสวิดีโอ, เน็ตเวิร์ค","link":"https://www.blognone.com/node/125723","date":1636353503000,"content":"<div><div><div><p>Tecent Cloud แถลงในงานสัมมนาเทคโนโลยีของตัวเองระบุถึงความก้าวหน้าในการพัฒนาชิปของตัวเองได้ 3 ตัวแล้ว แม้จะไม่มีข้อมูลสถาปัตยกรรมภายในหรือรายละเอียดการทำงานอื่นๆ ชิปทั้ง 3 ตัวได้แก่</p>\n<ul>\n<li>Zixiao: ชิปปัญญาประดิษฐ์ สำหรับการประมวลภาพ, วิดีโอ, ภาษาธรรมชาติ, ไปจนถึงการค้นหาข้อมูล ทาง Tencent ระบุเพียงว่าชิปตัวนี้ผลิตด้วยเทคโนโลยีแพ็กเกจแบบ 2.5D เชื่อมต่อหน่วยความจำเข้ากับคอร์แบบ HBM2e</li>\n<li>Canghai: ชิปเข้ารหัสวิดีโอ สามารถเข้ารหัสวิดีโอที่ 1080P 60 เฟรมต่อวินาทีได้แบบเรียลไทม์ พร้อมกับระบุว่าประสิทธิภาพการบีบอัดดีกว่าชิปอื่นในอุตสาหกรรม 30%</li>\n<li>Xuanling: ชิปเน็ตเวิร์คแบบ SmartNIC จัดการทั้งระบบ Virtualization, สตอเรจ, และ I/O บนเครื่อง รูปแบบเดียวกับชิปของผู้ให้บริการคลาวด์อื่นๆ ที่มักพัฒนาชิป SmartNIC เพื่อให้บริการเครื่องแบบ bare metal โดยไม่ต้องมีตัวจัดการบนซีพียูหลักอีก</li>\n</ul>\n<p>ประกาศครั้งนี้ไม่ระบุชัดเจนว่าชิปเหล่านี้ใช้งานในบริการใดแล้วบ้าง แต่การที่ผู้ให้บริการคลาวด์จีนอย่าง Tencent Cloud หันมาพัฒนาชิปเองก็น่าจะเป็นการลงทุนเพื่อป้องกันเหตุหากเกิดปัญหาทางการเมือง เช่นที่หัวเว่ยมีปัญหากับรัฐบาลสหรัฐฯ จนต้อง<a href=\"https://www.blognone.com/node/119381\">หันมาลงทุนสร้างโรงงานผลิตชิปด้วยตัวเอง</a></p>\n<p>ที่มา - <a href=\"https://www.theregister.com/2021/11/08/tencent_homebrew_silicon/\">The Register</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f54d900736b483d7056d8339de1d7565.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tencent\">Tencent</a></div><div><a href=\"/topics/cloud-computing\">Cloud Computing</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"80f3c1aa2582017dd9387ab88b4ed5fbfa773087c9a183bc097957ea52ec76a9","category":"Thai"}