{"title":"Interannual Variability of Marine Nitrogen Fixation in the Western Tropical Atlantic","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023GB007997?af=R","date":1715343560000,"content":"<h2>Abstract</h2>\n<p>N<sub>2</sub> fixation is a central process of the marine nitrogen cycle, yet little is known about how this process varies from year-to-year. Here, we investigate this variability in the Western Tropical Atlantic (WTA), a region where N<sub>2</sub> fixation is prevalent, fueled, in part, by the nutrient input from the Amazon River. We use hindcast simulations from 1983 through 2019 with the Regional Oceanic Modeling System (ROMS) coupled to the Biogeochemical Elemental Cycling (BEC) model expanded to include Diatom-Diazotroph Assemblages (DDAs). Throughout the WTA, we find a substantial level of interannual variability of N<sub>2</sub> fixation, altering it by up to 33%, and locally by up to nearly 60%. Part of this interannual variability is driven by variations in the Amazon River discharge, which during high discharge events leads to reduced rates in the upper parts of the plume and strongly enhanced rates in the downstream part. This dipole pattern is a consequence of the riverine inputs of phosphorus and the competition with non-diazotrophs for this limiting resource. Another part of the N<sub>2</sub> fixation variability is driven by the Atlantic Meridional Mode (AMM), and the El Niño-Southern Oscillation (ENSO). These processes alter N<sub>2</sub> fixation primarily through the supply of the limiting nutrients phosphorus and iron by vertical mixing, while the role of top-down control through grazing is relatively limited in our model. The high, and so far not well recognized interannual N<sub>2</sub> fixation variability can lead to erroneous extrapolation of field measurements and inaccuracies in the marine nitrogen budget, if unaccounted for.</p>","author":"Jana Härri, \nDomitille Louchard, \nNicolas Gruber","siteTitle":"Wiley: Global Biogeochemical Cycles: Table of Contents","siteHash":"a2d4e750daa5e386ca7dda0c54cc50454a723cbd123b964bfed1d56a4712b632","entryHash":"80f304b8090ba490d5fa3e31eba28b725c65cccb0cef6e18579ae4b861ce21d7","category":"Environment"}