{"title":"5 Zero Trust Security Takeaways From HashiConf Europe","link":"https://www.hashicorp.com/blog/5-zero-trust-security-takeaways-from-hashiconf-europe","date":1624550400000,"content":"<p>As companies worldwide make the shift to the cloud, <a href=\"https://www.hashicorp.com/blog/hashiconf-europe-2021-recap-and-videos\">HashiConf Europe 2021</a> showcased several companies, including Roblox and Starbucks, that have embraced a new paradigm to meet the security challenges of dynamic infrastructure: <a href=\"https://www.hashicorp.com/resources/introduction-to-zero-trust-security\">Zero trust security</a>. With an <a href=\"https://www.msspalert.com/cybersecurity-research/mcafee-report-global-cybercrime-losses-exceed-1-trillion/\">estimated $6 trillion in security-related losses</a> in 2021, how are leading companies avoiding the risk of breach as they scale operations and push digital transformations? The message from HashiConf was clear: Trust nothing. Authenticate and authorize everything.</p>\n<p>Here are five key takeaways from HashiConf Europe about zero trust security:</p>\n<h2><a href=\"#1-there-are-4-pillars-of-zero-trust\">»</a><a></a>1. There are 4 Pillars of Zero Trust</h2>\n<p>In the <a href=\"https://www.hashicorp.com/resources/security-keynote-more-secure-world-with-zero-trust-hashicorp-vault-boundary-consul\">Security Keynote</a>, leaders from HashiCorp’s Product and Engineering teams explained how today’s modern security workload requires an identity-driven security and networking approach. From machine authentication and authorization to human-to-machine access, speakers detailed the fundamentals of identity brokering and the key requirements needed to authenticate and access different clouds, systems, and endpoints using trusted identities.</p>\n<p>A critical component to scaling zero trust security is to centrally store and protect secrets. Traditionally, companies often relied on a legacy, static perimeter-based security model (i.e., IP-based). In growing hybrid environments, the IP-based approach is brittle and leads to <a href=\"https://www.hashicorp.com/resources/what-is-secret-sprawl-why-is-it-harmful\">secrets sprawl</a> that leaves companies vulnerable to a breach (both from outside and within the network).</p>\n<p>With identity-based security (e.g., only <em>these</em> web servers can talk to <em>these</em> databases) companies can centralize secrets and access controls, and provide a consistent and scalable zero trust approach that aligns to the dynamic nature of cloud infrastructures. The result? Improved scalability that drastically reduces the risk of a breach. <a href=\"https://www.hashicorp.com/resources/security-keynote-more-secure-world-with-zero-trust-hashicorp-vault-boundary-consul\">Watch the session</a> to learn more about how HashiCorp is helping the world’s largest companies boost their security posture.</p>\n<h2><a href=\"#2-vault-scales-and-automates-secrets-and-identity-across-100-000-edge-devices\">»</a><a></a>2. Vault Scales and Automates Secrets and Identity Across 100,000+ Edge Devices</h2>\n<p>For Starbucks, 24/7 global retail requires <a href=\"https://www.hashicorp.com/resources/starbucks-secrets-at-the-retail-edge-with-hashicorp-vault\">a new methodology for securing cloud-based edge computing</a>: embracing identity-based security models instead of legacy perimeter-based methodologies. For Starbucks, meeting reliability needs across more than 100,000 edge devices (from refrigerator monitors to point-of-sale machines) in 16,000 stores in North America alone, the key priorities were to automate, secure, and ensure resilience across the infrastructure.</p>\n<p>The solution relies on a <a href=\"https://www.hashicorp.com/resources/terraform-at-starbucks-infrastructure-as-code-for-software-engineers\">large-scale platform redesign leveraging HashiCorp Terraform</a> on Kubernetes. The key to reliability and security is due in large part to HashiCorp Vault, which provides a centralized secrets management platform to support identifying and authorizing hundreds of thousands of edge devices.</p>\n<p>Andrew McCormick, lead systems engineer at Starbucks, said that the key benefits in this model are scalability and automation in the security model. Human involvement to bootstrap unique identities to so many unique edge devices would completely overload their workers. With Vault, Starbucks is able to establish patterns for security policies and automate authentication loads critical for improving productivity for developers around other mission-critical initiatives. <a href=\"https://www.hashicorp.com/resources/starbucks-secrets-at-the-retail-edge-with-hashicorp-vault\">Watch the session</a> to learn more about how Starbucks takes advantage of an identity-based security framework.</p>\n<h2><a href=\"#3-boundary-provides-an-elegant-answer-to-the-secure-access-management-challenge\">»</a><a></a>3. Boundary Provides an Elegant Answer to the Secure Access Management Challenge</h2>\n<p>Roblox is a 200-million-player gaming platform with a rapidly growing number of global vendors and users. The company is looking at new approaches to authenticating and authorizing user identities, so it’s looking at <a href=\"https://www.hashicorp.com/resources/secure-access-management-with-boundary-and-the-hashicorp-stack\">zero trust security with HashiCorp Boundary</a>.</p>\n<p>One of Roblox’s challenges is giving users across different countries access to private infrastructure. This includes their control planes for HashiCorp Nomad and Consul, Vault secrets, and various caches and databases, such as Redis. They need multiple access levels, depending on who is accessing what.</p>\n<p>Today they primarily use VPNs, but they are difficult to automate, so they’re very excited about the possibilities Boundary will bring to improve those workflows and help manage the access lifecycle for ephemeral resources with secure, just-in-time access.</p>\n<p><a href=\"https://www.hashicorp.com/resources/secure-access-management-with-boundary-and-the-hashicorp-stack\">Watch the session</a> to hear more from Roblox’s Charles Zaffery and HashiCorp’s Pete Pacent and see their demo on how Boundary authenticates to an external OpenID Connect (OIDC) provider, automates target discovery with Consul and Terraform, and granularly controls session routing with worker filters.</p>\n<h2><a href=\"#4-you-can-implement-zero-trust-without-increasing-development-friction\">»</a><a></a>4. You Can Implement Zero Trust Without Increasing Development Friction</h2>\n<p>Ready to embrace the zero trust mindset but worried about developer productivity and satisfaction? HashiCorp’s senior developer advocate, Rob Barnes, breaks down <a href=\"https://www.hashicorp.com/resources/the-zero-trust-mindset\">how service mesh, identity-based access management, and secrets management help to implement zero trust without increasing development friction</a>.</p>\n<p>This session provides a great real-world overview of how to put zero trust into action (the example environment in this session uses a VPC on Amazon Web Services with two subnets, one public and one private), and how to architect zero trust for two critical user groups that need access to dev environments: product teams and developers. Rob’s real-life examples concretely show how to put the four pillars of a zero trust approach into practice. <a href=\"https://www.hashicorp.com/resources/the-zero-trust-mindset\">Watch the session</a> to see more practical examples of the zero trust mindset.</p>\n<h2><a href=\"#5-vault-helps-the-icrc-protect-its-digital-humanitarian-platform\">»</a><a></a>5. Vault Helps the ICRC Protect Its Digital Humanitarian Platform</h2>\n<p>The <a href=\"https://www.hashicorp.com/resources/protecting-privacy-for-refugees-with-vault-at-the-red-cross\">International Committee of the Red Cross (ICRC) leverages Vault </a>in a sophisticated technical architecture built to protect the digital wellbeing of the world’s most vulnerable populations in conflict areas. In an increasingly digital world, the ICRC is positioned as a trusted manager of sensitive information and documentation in conflict and violence-related situations.</p>\n<p>With so many potential global digital threats (e.g., actors in cyber attacks, secret agencies, or governments), the organization’s complex technical architecture requires the highest order of capabilities to authenticate and authorize all network traffic and support a separation of duties at an extremely granular level. The ICRC turned to Vault to help with secrets management and promote granular role-based access control for its digital humanitarian platform. <a href=\"https://www.hashicorp.com/resources/protecting-privacy-for-refugees-with-vault-at-the-red-cross\">Watch the session</a> to learn more about how the ICRC protects its microservices architecture with centralized secrets management.</p>\n<h2><a href=\"#more-resources-on-zero-trust\">»</a><a></a>More Resources on Zero Trust</h2>\n<p>Looking for more resources on zero trust security? Watch Armon Dadgar, co-founder and CTO of HashiCorp, explain the key ingredients in his <a href=\"https://www.hashicorp.com/resources/introduction-to-zero-trust-security\">zero trust whiteboard session</a>. You can also visit our <a href=\"https://www.hashicorp.com/solutions/zero-trust-security\">zero trust security solutions page</a>, and view our <a href=\"https://www.hashicorp.com/resources/why-should-we-use-identity-based-security-as-we-ado\">FAQ on identity-based security</a>.</p>","author":"Megan LaFlamme","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"80ffb672a0a1f6e0f6d32df2c85414cbd84a3f2a15708813ceb4e392aa82caf8","category":"Tech"}