{"title":"Heparan Sulfate 3-O-Sulfotransferase 3B1 (HS3ST3B1) Is Associated with Invasive and Mesenchymal-Like Phenotype in Breast Cancer Cells and Promotes Chemo-Resistance through Activation of PDGF-R&beta; Pathway","link":"https://www.preprints.org/manuscript/202403.1669/v1","date":1711532766000,"content":"Alteration in heparan sulfate (HS) biosynthesis has been described to impact a range of pivotal processes involved in cancer progression. HS 3-O-sulfotransferase 3B1 (HS3ST3B1) catalyzes the reaction of 3-O-sulfation within HS chains. Over the past few years, a growing number of studies has reported a tumor-promoting effect of this HS-modifying enzyme in various cancers. Consistent with these studies, we previously reported that HS3ST3B1 overexpression increased survival and resistance to apoptosis in MDA-MB-231 breast cancer (BrCa) cells. In the present study, we further investigated the biological and clinical significance of HS3ST3B1 expression in BrCa. Interrogation of public databases revealed that high expression levels of HS3STB1 are associated with invasive and mesenchymal-like phenotype in BrCa cells and predict poor clinical outcome in BrCA patients with chemotherapy. In vitro, HS3ST3B1 overexpression increased the invasive properties of MDA-MB-231 cells and enhanced chemo-resistance to conventional anticancer drugs. Mechanistically, we found that the advantage given by HS3ST3B1 was linked to the expression and activation of PDGF-Rβ. Silencing the expression of this receptor reversed the effects driven by HS3ST3B1 overexpression. Altogether, our results suggest that HS3ST3B1 may play an important role in the progression of aggressive BrCa and offer a potentially druggable target for therapeutic application.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"81010517b6972fcd7f42ec60ec85fede42f7658e4bb3f8b8ea7cab75af791354","category":"Interdisciplinary"}