{"title":"Real-world aero testing: which hand positions are fastest?","link":"https://cyclingtips.com/2021/05/real-world-aero-testing-which-hand-positions-are-fastest/","date":1620137445000,"content":"<p>Hand positions, narrow handlebars, and extremely long reach handlebars have caused quite a stir of late. With the UCI moving to ban the “invisible aero bars” on safety grounds, riders have been forced to refocus the front end of their road bikes. But which hand position is actually fastest? </p>\n\n\n\n<p>Rumour has it Tom Boonen was first convinced to run with narrower handlebars for the aero gains benefits they offer as far back as 2012, and clearly given that he achieved his second Flanders/Roubaix double that year, it didn’t hurt. Adam Hansen was one of the first big names to move to 38cm narrow handlebars and Remco Evenepoel has had his levers turned in since before turning pro. Dan Bigham’s <a href=\"https://cyclingtips.com/2021/04/new-uci-regs-challenge-accepted-dan-bighams-27-cm-road-handlebars/\" target=\"_blank\">27cm wide bars</a> and Jan Willem Van Schip’s combination of extremely narrow bars and turned-in levers, and later his partnership with Speeco to design the <a href=\"https://cyclingtips.com/2021/04/new-uci-regs-challenge-accepted-dan-bighams-27-cm-road-handlebars/\" target=\"_blank\">Aero Breakaway Bar</a>, really caused a stir. </p>\n\n\n\n<p>But how much aero advantage is really available at the front end of a modern race bike? With more bikes now featuring fully internal cable routing and aero profiled bars, are the gains at the front end purely marginal? Or can a change in hand position trumnp all the fancy engineering? </p>\n\n\n\n<h2>Real world testing</h2>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-1-1340x754.jpg\" /><figcaption>Relaxed hoods position</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-3-1340x754.jpg\" /><figcaption>Drops position</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-2-1340x754.jpg\" /><figcaption>Aero hoods position</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-5-1340x754.jpg\" /><figcaption>Lever hooks position</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-4-1340x754.jpg\" /><figcaption>Invisible aero bars / Puppy paws position</figcaption></figure></li></ul><figcaption>Six positions were tested in total</figcaption></figure>\n\n\n\n<p>Aerocoach is a UK based aerodynamic consultancy group and online retailer headed up by Dr Xavier Disley. With the introduction of the new UCI regulations, Aerocoach set about evaluating the aerodynamic drag of a number of hand positions, including the recently banned puppy paws/invisible aero bars. </p>\n\n\n\n<p>The test rider’s aerodynamic drag was measured in CdA(m²). CdA is the combination of the rider’s drag coefficient, the Cd part of CdA, and frontal area in m². Aerocoach investigated how the hand positions tested alter a rider’s CdA.</p>\n\n\n\n<p>The team at Aerocoach performed the tests using an outdoor velodrome, measuring speed, power, wind and air density. The single test rider was wearing a standard jersey and bibs throughout the test with an aero road helmet and rode a Giant Propel bike. Aerocoach is well accustomed to this process as it forms the basis for its outdoor aero testing session offered as part of its aero consultancy services. </p>\n\n\n\n<p>In total, Aerocoach tested six hand positions:</p>\n\n\n\n<ul><li>Relaxed arms on hoods (baseline) </li><li>In the drops</li><li>Aero hoods, hands on the hoods with arms horizontal to the ground</li><li>Forearm riding/invisible aero bars banned position</li><li>Lever hooks as used by Alex Richardson of Alpecin-Fenix, also banned</li><li>Aero hoods bent inwards” as popularised by Remco Evenepoel. </li></ul>\n\n\n\n<h2>Results: The fastest hand positions</h2>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/hand-position-testing-results-1340x754.jpg\" /><figcaption>The results show the adapted positions are all closely matched but provide a significant improvement over the traditional hoods and drops positions.</figcaption></figure>\n\n\n\n<p>Unsurprisingly, the relaxed hoods position was found to be the slowest of all the positions resulting in a CdA(m²) of .277. In terms of aero drag, next up on the results sheet is the traditional drops position, which came in with a CdA of .265 for Aerocoach’s test rider and resulted in just a 14watt saving when compared to the relaxed hoods position at 45kph.</p>\n\n\n\n<p>The results for the remaining four test positions may come as a surprise. Despite the varying degrees of difficulty to engage and maintain the aero hoods position with horizontal arms, angled hoods, and the two banned forearm and lever hooks positions all resulted in almost identical CdAs and wattage saving values. Three of the four positions tested within 1.6watts of each other.</p>\n\n\n\n<p>The outlier was the banned invisible aero bar position, which did prove to be the fastest, but only marginally, with a 39.6watt saving at 45kph and a CdA for the Aerocoach test rider of .243. The hoods angled inwards position was next fastest with a 37w drag reduction and a CdA of .245, followed by the “lever hooks” position with a 35.5w saving and .246 CdA (m²). </p>\n\n\n\n<p>Testing marginally slowest of the four non-standard positions was the horizontal arms position. However, given its relative ease of engagement, UCI-legal footing, and normal lever position, the 35watt saving this position offers means it is perhaps the true winner here. That’s not to even mention the increased safety this more standard position offers when compared to the forearms or the lever hooks positions.  </p>\n\n\n\n<p>In simpler terms, the aero savings achieved by simply moving from a relaxed hood position to the horizontal arms position at 45kph would result in a 1.65kph speed increase at the same wattage, which results in a two minute time saving over the course of a 40km TT. </p>\n\n\n\n<p>One thing Aerocoach did not test was the effect of moving to narrower handlebars. As mentioned a number of times in this article, a rider’s aerodynamic drag is measured in CdA(m²). The hand positions tested varied in how they altered the test rider’s CdA, the measure of drag coefficient (how slippery a rider is) and the size of their frontal area. The small CdA reduction by the changing from the relaxed hoods to the drops position was most likely as a result of lowering the rider’s frontal area but with little impact on the Cd. Whereas the gains made by changing from relaxed hoods to the horizontal arms position on the hoods will have created a further reduction in the riders frontal area coupled with an improvement in the riders Cd by shifting the cylindrical-shaped forearms to a horizontal position out of the wind. </p>\n\n\n\n<p>So a rider’s aero drag, or CdA, can be affected by reducing either side of the drag coefficient and frontal area equation. </p>\n\n\n\n<p>Therein could lie the benefit of extremely narrow handlebars. With optimised positions, the narrower handlebar could provide a further reduction of both rider and bike frontal areas. Rider beware though, such extreme positions are notoriously difficult to maintain, and if the result is flared elbows or rounded shoulders all the aero gains could be lost. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-10-1340x754.jpg\" /><figcaption>In the drops</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-12-1340x754.jpg\" /><figcaption>Horizontal arms</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-13-1340x754.jpg\" /><figcaption>The famous puppy paws</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/04/Aerocoach-hand-position-testing-16-1340x754.jpg\" /><figcaption>Lever hooks… Just why? </figcaption></figure></li></ul><figcaption>The positions in action</figcaption></figure>\n\n\n\n<h2>Takeaways </h2>\n\n\n\n<p>We spoke to Dr Xavier Disley and asked if the testing had thrown up any takeaway tips for us to use on the road without having to go testing ourselves. Dr Disley explained the most important aspect of any position is sustainability and safety. “It’s all very well holding some crazy position for ten seconds and then your triceps give out and you have to sit bolt upright”, he said. </p>\n\n\n\n<blockquote><p>“Theoretically the fastest position based on our testing is the puppy paw position, but, can you handle your bike, is it going to tear your core to bits, are your arms going to slip and cause you to crash, are people around you going to give you more room and hence less draft? If the answer is yes to any of these then don’t do it”. Dr Xavier Disley – Aerocoach</p><cite>If you answer yes to any of the above, please consider alternative options</cite></blockquote>\n\n\n\n<p>Disley was also keen to point out that not all reductions in the frontal area result in lower a CdA. Quite often riders can over-focus on reducing their frontal area to the neglect of the Cd side of the equation. “Reducing A does not always decrease CdA, but generally on a road bike if you can more tight and tucked that is going to reduce your frontal area and generally your CdA. What you don’t want to do is always focus on frontal area as that might put you in a weird position that increases Cd.” </p>\n\n\n\n<p>Disley used the aero helmet example. “A big aero helmet with a nice tail and wonderful shape will have a higher frontal area than small road helmet with a thousand holes in it, but the aero helmet is going to be faster because it has a higher A but a lower Cd, which combine to give you a lower CdA.” </p>\n\n\n\n<p>Dr Disley pointed out the aero hoods position is not quite as aero as the puppy paws position but it offers the same horizontal arms position which reduces frontal area and also helps achieve a flatter torso. Disley went on to explain: “Really, on a road bike, getting your torso flatter is the thing to aim for”. This is a  good rule of thumb for road riders. “So whatever maintainable and sustainable position that allows you to achieve that flatter torso position is the thing to do,” Disley said. </p>\n\n\n\n<p>Disley did have two caveats. First was safety, and he pointed out that when he says “sustainable and maintainable” he includes safety under these headings. After all, a position is not maintainable if it causes you to crash. Secondly, Disley pointed out while a flatter forearm, reduced frontal area and flatter torso will always help, other factors such as aero fitting clothing, aero rims and frames, and aero helmets all play a role also. </p>\n\n\n\n<p>I asked Dr Disley what additional change they would make to decrease drag and the answer was resounding “width”. But with a caveat: “We have done a lot of testing on this… the narrower you go with bars the more you have to increase reach to keep the same torso angle. If you go really narrow then you decrease the reach and your torso angle comes up, and often riders elbows flare out. So with very narrow bars, you have to use longer stems, which is an issue on the track where the UCI regs restrict the distance the bars can be in front of the hub”. Disley explained that if the same reach, the same or narrower elbow width and the same or lower torso angle can be achieved then narrower bars will be faster. </p>\n\n\n\n<p>“Is it a big difference? Massively so,” Disley said of narrower handlebars. “We find getting everything in line with the shoulders and legs is quite good, but that can lead to a very very narrow bar. We did some testing on narrow bars and they are very very quick, provided the elbows don’t flare out”.</p>\n\n\n\n<p>Disley was keen to point out that riders should use this testing like extra “strings to your bow”. In a time trial, riders are fixed in position, while on the road numerous factors influence what position should be used. Riders should assess the race or group setting and then use the data from this testing to choose the fastest “sustainable and maintainable” position. So a rider mid-pack on a descent should use a very different position than a rider solo on a flat straight road. </p>\n\n\n\n<p>For more information visit <a href=\"https://www.aero-coach.co.uk/uci-road-bike-position-aerodynamics\" target=\"_blank\">Aero-coach.co.uk</a></p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/real-world-aero-testing-which-hand-positions-are-fastest/\">Real-world aero testing: which hand positions are fastest?</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"810870cc28280c58867589b6d007fe57a5156de30d6a754439f0cdceef0bb2f9","category":"Cycling"}