{"title":"Spatio-Temporal Analysis and Impact of Land Use Land Cover in Eco-Environmental Quality Based on Remote Sensing Ecological Index (RSEI): A Case Study of Rupandehi District, Nepal","link":"https://www.preprints.org/manuscript/202407.0572/v1","date":1720422295000,"content":"The evaluation of Eco-Environmental Quality (EEQ) is important to maintain the quality of ecology and is crucial for the protection of the environment and promote sustainable development. In the past 30 years, Rupandehi district has gone into rapid urbanization and population growth due to the migration of people causing drastic changes in Land use. This study takes Rupandehi district as a study area and analyses the land use change dynamics and its impact on the ecological environment from 1993 to 2023. The study utilizes the cloud computing capability of Google Earth Engine (GEE) to extract multiple indices using Landsat remote sensing data. We also applied the Thresholding approach to various spectral indices to extract land use information in GEE. The Remote Sensing Ecological Indices (RSEI) was constructed using Principal Component Analysis (PCA) to monitor the ecological quality and the effect of Land Use Land Cover (LULC) change on the quality of ecology was analysed. The result shows that the overall ecological quality of the Rupandehi district is good ranging from 0.59 in 1993 to 0.67 in 2023 with a significant impact of land use change. The eco-environmental quality of the study area is deteriorating because of a sharp increase in built-up areas and deforestation as well as the loss of agricultural land. Meanwhile, the spatial and temporal distribution of land use change collides with the change in the ecological quality of the study area. This study provides an accurate and rapid assessment of ecological quality and monitors the impact of land use change on it providing a scientific basis for researchers, government, and others to preserve the ecology and promote sustainable and eco-friendly development.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8109a262c17857f108ff83245a85a79670119334d6df43cd5dee19bc1e6156ff","category":"Interdisciplinary"}