{"title":"Silvicultural regime shapes understory functional structure in European forests","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14740?af=R","date":1725336075000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/82d8a3f8-bda1-4f52-b2bb-71cbe3480451/jpe14740-toc-0001-m.png\" alt=\"Silvicultural regime shapes understory functional structure in European forests\" />\n<p>Different silvicultural regimes influence different facets of understory functional features. While unmanaged forests can be used as a reference to design silvicultural practices in compliance with biodiversity conservation targets, different silvicultural options should be balanced at landscape scale to sustain the multiple forest functions that human societies are increasingly demanding.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nManaging forests to sustain their diversity and functioning is a major challenge in a changing world. Despite the key role of understory vegetation in driving forest biodiversity, regeneration and functioning, few studies address the functional dimensions of understory vegetation response to silvicultural management.\n\nWe assessed the influence of the silvicultural regimes on the functional diversity and redundancy of European forest understory. We gathered vascular plant abundance data from more than 2000 plots in European forests, each associated with one out of the five most widespread silvicultural regimes. We used generalized linear mixed models to assess the effect of different silvicultural regimes on understory functional diversity (Rao's quadratic entropy) and functional redundancy, while accounting for climate and soil conditions, and explored the reciprocal relationship between three diversity components (functional diversity, redundancy and dominance) across silvicultural regimes through a ternary diversity diagram.\n\nIntensive silvicultural regimes are associated with a decrease in functional diversity and an increase in functional redundancy, compared with unmanaged conditions. This means that although intensive management may buffer communities' functions against species or functional losses, it also limits the range of understory response to environmental changes.\n\n<i>Policy implications</i>. Different silvicultural regimes influence different facets of understory functional features. While unmanaged forests can be used as a reference to design silvicultural practices in compliance with biodiversity conservation targets, different silvicultural options should be balanced at landscape scale to sustain the multiple forest functions that human societies are increasingly demanding.\n</p>","author":"Francesco Chianucci, \nFrancesca Napoleone, \nCarlo Ricotta, \nCarlotta Ferrara, \nLina Fusaro, \nLorenzo Balducci, \nGiovanni Trentanovi, \nOwen Bradley, \nBence Kovacs, \nMarco Mina, \nBruno E. L. Cerabolini, \nKris Vandekerkhove, \nPallieter De Smedt, \nLuc Lens, \nLionel Hertzog, \nKris Verheyen, \nJeňýk Hofmeister, \nJan Hošek, \nRadim Matula, \nInken Doerfler, \nJörg Müller, \nWolfgang W. Weisser, \nJan Helback, \nPeter Schall, \nMarkus Fischer, \nJacob Heilmann‐Clausen, \nRasmus Riis‐Hansen, \nIrina Goldberg, \nErik Aude, \nSebastian Kepfer‐Rojas, \nInger Kappel Schmidt, \nTorben Riis Nielsen, \nAnders Mårell, \nYann Dumas, \nPhilippe Janssen, \nYoan Paillet, \nFrederic Archaux, \nFotios Xystrakis, \nFlóra Tinya, \nPéter Ódor, \nRéka Aszalós, \nJános Bölöni, \nAndrea Cutini, \nSimonetta Bagella, \nTommaso Sitzia, \nGediminas Brazaitis, \nVitas Marozas, \nMariana Ujházyová, \nKarol Ujházy, \nFrantišek Máliš, \nBjörn Nordén, \nSabina Burrascano","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"811c55fc5d197807968e21523e36f6d2de861b3db6672853a57f2e77263527c3","category":"Environment"}