{"title":"Enantiomer-specific analysis of amphetamine in urine, oral fluid and blood","link":"https://academic.oup.com/jat/article/48/5/254/7665184?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Illegal amphetamine is usually composed of a racemic mixture of the two enantiomers (<span>S</span>)- and (<span>R</span>)-amphetamine. However, when amphetamine is used in medical treatment, the more potent (<span>S</span>)-amphetamine enantiomer is used. Enantiomer-specific analysis of (<span>S</span>)- and (<span>R</span>)-amphetamine is therefore used to separate legal medical use from illegal recreational use. The aim of the present study was to describe our experience with enantiomer-specific analysis of amphetamine in urine and oral fluid, as well as blood, and examine whether the distribution of the two enantiomers seems to be the same in different matrices. We investigated 1,722 urine samples and 1,977 oral fluid samples from prison inmates, and 652 blood samples from suspected drugged drivers, where prescription of amphetamine was reported. Analyses were performed using ultra high performance liquid chromatography–tandem mass spectrometry (UHPLC–MS-MS). The enantiomer separation was achieved by using a chiral column, and results from the method validation are reported. Samples containing &lt;60% (<span>S</span>)-amphetamine were interpreted as representing illegal use of amphetamine. The distribution of the two enantiomers was compared between different matrices. In urine and oral fluid, the mean amount of (<span>S</span>)-amphetamine was 45.2 and 43.7%, respectively, while in blood, the mean amount of (<span>S</span>)-amphetamine was 45.8%. There was no statistically significant difference in the amount of (<span>S</span>)-amphetamine between urine and oral fluid samples and between urine and blood samples, but the difference was significant in blood compared to oral fluid samples (<span>P</span> &lt; 0.001). Comparison of urine and oral fluid between similar populations indicated that enantiomers of amphetamine can be interpreted in the same way, although marginally higher amounts of (<span>R</span>)-amphetamine may occur in oral fluid. Oral fluid, having several advantages, especially during collection, could be a preferred matrix in testing for illegal amphetamine intake in users of medical amphetamine.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"81200bedcdfe99ee39f6dd0cbf2c6f413300c256c6dc2b1dbfb2d0835c8d2b7b","category":"Environment"}