{"title":"Effect of soil depth on the structure of bacterial composition in the active layer at five geologically distinct sites on James Ross and Vega Islands in Antarctica","link":"http://link.springer.com/10.1007/s00300-024-03230-3","date":1709856000000,"content":"<h3>Abstract</h3>\n                  <p>Microbial communities in the active layer play a crucial role in the biogeochemical cycles of Antarctic pristine ecosystems. Here, 16S rRNA gene sequencing was used to investigate bacterial communities in active layer of five different geological sites related to the compositional variation of the geological bedrock, including Neogene volcanic or Cretaceous rocks and or marine sediments areas of distinct elevation. Local variations in the thickness of the active layer (50–80 cm) were observed on the Ulu Peninsula, James Ross Island, and the southwest coast of Vega Island, Antarctica during sampling in 2019. High bacterial diversity was detected in all sampling sites. Significant site effects on bacterial composition with increased <em>Chloroflexota</em> and decreased <em>Flavobacteriaceae</em> were only observed between the highest elevation Johnson Mesa 2 plateau and coastal areas. The overall effect of the depth was reflected by the increased of e.g., <em>Cyanobacteria</em>, <em>Propionibacterium</em>, <em>Staphylococcus</em> in the upper surface and <em>Chloroflexota</em>, <em>Acidobacteriota</em>, <em>Actinomycetota</em> at depths below 30 cm. The huge number of unassigned bacteria indicated a potential source of new bacterial species and their ecological role in this extreme environment. For the first time, we showed that the effect of depth on bacterial composition was more significant than the effect of geological bedrock from these previously unexplored regions.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"81204b820d741a10af72a77dbad3fee47d857a48a5666adadb94d9d26f33f0c8","category":"Environment"}