{"title":"Key needs, quality performance indicators and outcomes for patients with atrial fibrillation and multimorbidity: The AFFIRMO study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310106","date":1725976800000,"content":"<p>by Donato Giuseppe Leo, Caterina Trevisan, Adele Ravelli, Trudie C. A. Lobban, Deirdre A. Lane, on behalf of the AFFIRMO Study investigators </p>\r\nBackground <p>Patients with atrial fibrillation (AF) often have concomitant long-term conditions that negatively impact their quality of life and the clinical management they receive. The AFFIRMO study aimed to identify the needs, quality performance indicators (QPIs), and outcomes relevant to patients, caregivers and healthcare professionals (HCPs) to improve the care of patients with AF.</p> Methods <p>An on-line survey to collect the key needs, QPIs, and outcomes relevant to patients with AF, their caregivers and HCPs, was distributed between May 2022 and January 2023 in five countries (UK, Italy, Denmark, Romania and Spain). Results from the on-line survey were discussed in a three-round Delphi process with international representatives of patients with AF, caregivers, and HCPs to determine the key needs, QPIs and outcomes for the management of patients with AF and multimorbidity.</p> Results <p>659 patients (47.2% males, mean (SD) age 70.9 (10.2) years), 201 caregivers (26.9% males, mean (SD) age: 58.3 (SD 15.2) years), and 445 HCPs (57.8% males, mean (SD) age 47.4 (10.6) years) participated in the survey. An initial list of 27 needs, 9 QPIs, and 17 outcomes were identified. Eight patients, two caregivers, and 11 HCPs participated in the Delphi process. Nineteen (70%) needs, 8 (89%) QPIs, and 13 (76%) outcomes reached “consensus in”, and were included in the final list.</p> Conclusions <p>The final key needs, QPIs and outcomes obtained from the Delphi process will inform the AFFIRMO clinical trial, which aims to test the iABC app which incorporates an empowerment toolbox for patients and their caregivers, providing information to improve patient engagement and empowerment to help improve the clinical and self-management of patients with AF in the context of multimorbidity.</p>","author":"Donato Giuseppe Leo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8128ffa2c7460a81e918e1e83fead87f6d6ed479145287420a2e9b27661150a1","category":"Interdisciplinary"}