{"title":"Have a 13-Inch MacBook Pro? Here's Why You Should Upgrade to the New M3 14-Inch Model","link":"https://www.macrumors.com/2023/11/01/m3-macbook-pro-comparison/","date":1698865611000,"content":"Apple this week discontinued the 13-inch <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> MacBook Pro, replacing it with a 14-inch model that's equipped with a next-generation M3 chip. The 14-inch model is more expensive, but it comes with a number of benefits that make it worth the upgrade for anyone with a 13-inch machine. \r<br />\n\r<br />\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r<br />\nThe 14-inch MacBook Pro has a larger display than the 13-inch model for more screen real estate, and it features much more modern-looking thin bezels. There's also a notch that houses the front-facing camera, a necessity for those slimmed down bezels. It is a mini-LED Liquid Retina XDR display, which is an upgrade over the LCD of the prior-generation 13-inch model. \r<br />\n\r<br />\nAlong with support for 120Hz ProMotion refresh rates, the 14-inch MacBook Pro's display is brighter and has better color and HDR support. SDR brightness is 600 nits, while XDR brightness is 1000 nits sustained and 1600 nits peak.\r<br />\n\r<br />\nIn terms of performance, you're going to see a boost in CPU and GPU speeds, but it will be most noticeable if you're coming from an Apple <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> chip or an even earlier Intel chip. The M3 has an 8-core CPU and 10-core GPU much like the ‌M2‌, but the GPU supports hardware-accelerated ray tracing so gameplay will be improved.\r<br />\n\r<br />\nBattery life has seen a boost, so the 14-inch MacBook Pro now lasts for up to 22 hours, up two hours from the 20 hour battery life of the ‌M2‌ 13-inch MacBook Pro. If you were a fan of the Touch Bar, be warned that the 14-inch MacBook Pro does not have one. With the discontinuation of the 13-inch MacBook Pro, Apple has officially nixed the Touch Bar. \r<br />\n\r<br />\nIn terms of size, the 14-inch MacBook Pro is a little wider, a little longer, and just a bit heavier than the 13-inch model. It weighs 3.4 pounds while the 13-inch model weighed 3 pounds. There are more ports with the M3 MacBook Pro, so in addition to two Thunderbolt ports, you'll also get an HDMI port, an SD card slot, and a <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> charging port. \r<br />\n\r<br />\nOther improvements include a better 1080p <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> HD camera, a six-speaker sound system, Wi-Fi 6E support, and Bluetooth 5.3. \r<br />\n\r<br />\nThe only real downside with the 14-inch MacBook Pro is the price. It starts at $1,599, making it $300 more expensive than the $1,299 starting price of the ‌M2‌ 13-inch MacBook Pro. If you can afford it, what you get for the extra $300 is worth it, but if that makes it too pricey, you'll need to look at the lower-cost <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>. \r<br />\n\r<br />\nFor those with an ‌M2‌ 13-inch MacBook Pro, it's probably not worth upgrading to the 14-inch model right now despite the benefits, but if you're coming from an ‌M1‌ 13-inch MacBook Pro or an Intel machine, it's going to be a much more notable upgrade that will feel closer to night and day.\r<br />\n\r<br />\nAre you upgrading to the 14-inch M3 MacBook Pro? Let us know why or why not in the comments below. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 14 &amp; 16\" </a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/01/m3-macbook-pro-comparison/\">Have a 13-Inch MacBook Pro? Here's Why You Should Upgrade to the New M3 14-Inch Model</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/have-a-13-inch-macbook-pro-heres-why-you-should-upgrade-to-the-new-m3-14-inch-model.2409547/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"812af170864943cd9a672da0fb006cf7a1d9f926fbc28aec0a9f9c853422fc5e","category":"Apple"}