{"title":"Aerial eDNA contributes vital information for fungal biodiversity assessment","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14691?af=R","date":1716811431000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/189c8b99-c8d3-4c95-bdaa-a0035b9f867d/jpe14691-toc-0001-m.png\" alt=\"Aerial eDNA contributes vital information for fungal biodiversity assessment\" />\n<p>Neither eDNA approaches nor visual surveys were able to detect full diversity of local fungi and all species of specific conservation value. However, there was clear merit in combined use of these methods, particularly in pairing aerial eDNA with visual observation-based surveys on selected taxon groups. This approach can be especially valuable in fungal groups with challenging taxonomy, partly inaccessible microhabitats or overall high diversity (such as lichens).</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nFungal diversity drives key processes in terrestrial ecosystems, but remains challenging to measure in the field and to monitor over time. In particular, we lack methods capable of describing both the regional biotas and fungal related conservation values, such as habitats for rare and threatened fungi. Environmental DNA (eDNA) could serve this purpose, once its validity to capture fungal assemblage properties is established.\n\nUsing three approaches (full-season eDNA sampling from air, snapshot visual surveys, and eDNA sampling from dead wood), we present the first comparative assessment of fungal diversity at forest stand scale. The focus was on two well-known fungal groups (lichens and wood inhabiting basidiomycetes) in old hemiboreal forests.\n\nAerial eDNA revealed regional-scale cryptic diversity not detected in visual surveys, particularly among lichens and including species of conservation concern. However, at the local population scale, both aerial eDNA and eDNA sampled from dead wood often missed visually detected species. In particular, eDNA sampled from dead wood performed only as a supplementary source of species data. The methods differed in detecting the spatial covariance of wood fungal and lichen diversity, with the combined (most complete) dataset indicating the strongest congruence.\n\n<i>Synthesis and applications</i>. Neither eDNA approaches nor visual surveys were able to detect full diversity of local fungi and all species of specific conservation value. However, there is clear merit in combined use of these methods, particularly in pairing aerial eDNA with visual observation-based surveys on selected taxon groups. This approach can be especially valuable in fungal groups that have challenging taxonomy, inhabit partly inaccessible microhabitats, or have overall high diversity (such as lichens).\n</p>","author":"Kadri Runnel, \nPiret Lõhmus, \nKati Küngas, \nLiis Marmor‐Ohtla, \nAnneli Palo, \nGeili Pütsepp, \nHeidi Tamm, \nIndrek Tammekänd, \nAsko Lõhmus","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"812dd01df4d28afa99beb380f376e1bb2b592f0fc835d8fdd44f25ab041ce142","category":"Environment"}