{"title":"Women's Road Race World Championships Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-womens-road-race-world-championships","date":1629906380000,"content":"\n      <p>The centenary edition of the men's road World Championships is one month away. For the women, however, the first road race World Championships was in 1958, meaning there's another 37 years to wait before the centenary of that event.</p>\n<div></div>\n<p>This year’s road World Championships will be held in some of the most hallowed of cycling territories, the Flanders region of Belgium. However, despite the fact that the race will take place in the same region which hosts some of the sport’s most iconic events, the World Championships course will in fact bypass most of the legendary climbs that feature in them. Despite the course profile looking like a bread knife, none of the climbs are recognisable by name, but that doesn’t mean they’re not going to zap the legs.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/women-elite-road-race_2_1024x1024.png?v=1629901827\" /></div>\n<p>The World Championships usually comprises a series of circuits and this year is no different. The peloton will line up in Antwerp and after a relatively flat 56km will reach the first of two circuits around Leuven. The smaller ‘local’ circuit is 15.5 km long and features four short, sharp climbs; the longest of which is 975m. After one and a half laps of the ‘Local’ circuit the peloton will then enter the 50km ‘Flandrien Circuit’ which is where the climbs get real. The Flandrien circuit features six climbs in quick succession all of which reach maximum gradients above 10%. Anyone who forgets their climbing legs will be grateful that they will only be completing one lap of this circuit before heading back for another 2.5 laps of the Local Leuven loop.</p>\n<p>The run in to the finish is on a slight incline that will lend itself to an uphill sprint if Annemiek van Vleuten or Anna van der Breggen haven’t made a break for it by then and a select group comes to the line together.</p>\n<p>The race closest to this year’s course – and which featured some of the climbs in it – is Brabantse Pijl and as a result that race attracted a line up which belied it’s 1.1 stature earlier this year.  Two of the climbs in that race, Mokesstraat and a climb through Overijse feature in the World Championships race. </p>\n<p>At 157.7km the Worlds course is, as usual, one of the longest races that the women’s peloton will tackle all season however with around half the climbing of last year’s race in Imola, at 1,047m, the type of rider and size of the group left at the finish is likely to differ significantly.</p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/women-elite-road-race_3_1024x1024.png?v=1629901872\" /></div>\n<p>After Anna Kiesenhofer ran away with the race in Tokyo from a breakaway -- which at one stage took over eleven minutes on the peloton -- the bigger nations will likely be extra vigilant when it comes to letting moves go off the front. Those who complained that a lack of race radio and subsequent miscommunications gave Kiesenhofer her chance had better start practising reading from blackboards now as the World Championships are also raced without radio communication. The nature of the course doesn’t lend itself as much to the same style of racing as in Tokyo but if the favourites start looking at each other then it wouldn’t be beyond belief for someone to sneak off. </p>\n<h4><strong>Contenders </strong></h4>\n<p>With one month until the race the full startlist is not yet available, however barring anything untoward we can be fairly certain that the peloton’s top riders will be making an appearance at the race.</p>\n<p>Every World Championships preview for countless years now has pondered whether the Dutch squad’s stacked team will in fact hamper their chances as too many riders will be looking for individual results. Until Tokyo, that question was always answered with an orange-clad rider crossing the line with her arms in the air. After the way they raced the Olympic road race the Dutch revealed themselves to be fallible human beings after all which – although it is a mistake they are unlikely to make twice – may give some confidence to riders from smaller nations looking to chance their arm.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW8_1604_1024x1024.jpg?v=1629904481\" /><em>Image: Alex Whitehead/SWpix.com</em></p>\n<p>Nevertheless, there are still multiple Dutch women amongst the favourites to win on this course. Defending double world champion Anna van der Breggen can never be discounted and although it would be a fitting way for such a classy rider to round off her career, it would be a shame for the rainbow jersey to be absent from the peloton for a season. After a slow start to the year by her usual standards, Annemiek van Vleuten looks to be in fighting shape since Tokyo.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326940886-_2_1024x1024.jpg?v=1629904374\" /><em>Image: Getty</em></p>\n<p>The Flandrien course looks made for Marianne Vos – or her physiological doppelgänger Demi Vollering. On the right day, both are more than capable of getting over the succession of climbs on the two circuits and finishing off with a blazing turn of speed, especially on a slight incline.</p>\n<p>Germany’s double national champion Lisa Brennauer has had a stellar season so far that has seen the 33-year-old rarely place outside of the top-10, including two 6th place finishes in both the Olympic road race and time-trial. Brennauer has a strong sprint and is more than capable of making it over the climbs on this course. Tellingly for this race, however, Brennauer stood in second place on the podium at this year’s Tour of Flanders – could she go one better on a Flandrien worlds course?</p>\n<p>Lotte Kopecky suffered a crash in the Omnium at the Tokyo Olympic Games which saw her taken to hospital in tears at having to exit the event she was targeting. If she is fully recovered and back on form by next month she will certainly be one to watch in this race as she packs a fast finish, especially on a punchy course such as this one. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1334276895_6242ec70-1554-4dad-b7c8-b23d7472987f_1024x1024.jpg?v=1629903702\" /><em>Image: Getty</em></p>\n<p>Before the Ladies Tour of Norway, sprinter Chloe Hosking hadn't raced since March due to catching Covid-19. Now, she will lead Australia's team, the line-up for which has already been confirmed. Hosking will be joined by Tiffany Cromwell, Amanda Spratt, Sarah Roy, Lauretta Hanson, Brodie Chapman, and Jess Allen in Flanders, and if she can make it over the rolling course, the 30-year-old has already proven herself to be back on winning form after taking the final stage of Norway his month. </p>\n<p>Team USA also have a solid shot at the title with Brabantse Pijl winner Ruth Winder who beat Demi Vollering to the win by a hair’s breadth thanks to a well-executed bike throw. Winder has announced that she will be retiring at the end of the season and, as with van der Breggen, she will be hoping to end on a high.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW8_2161_1024x1024.jpg?v=1629904281\" /><em>Image: Alex Whitehead/SWpix.com</em></p>\n<p>Team GB’s Lizzie Deignan is a regular feature on podiums and in top-10s in the classics and as a punchy rider with a fast finish who has proven herself capable of winning a world title, she will go into the race as a favourite.  </p>\n\n<p>Elisa Longo Borghini would usually be Italy's favourite for a result, however, unless she can go long, the Trek-Segafredo rider doesn’t have the fast finish to win from a group containing the likes of Vollering, Deignan, Vos, Kopecky, or Winder. Longo Borghini's compatriots Elisa Balsamo, Marta Cavalli, or Chiara Consonni could definitely contest such a finish though.</p>\n<p>It all points towards a fascinating race with a worthy winner – probably from the Netherlands. </p>\n<p><em>Cover photo: Alex Whitehead/SWpix.com</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"812fc6a9448b61c9accab8bd02aae481a243c5b313b054dde6ea03685bc2856f","category":"Cycling"}