{"title":"Through the big top: An exploratory study of circus-based artistic knowledge translation in rural healthcare services, Québec, Canada","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302022","date":1713448800000,"content":"<p>by Julie Théberge, Mélanie Ann Smithman, Catherine Turgeon-Pelchat, Fatoumata Korika Tounkara, Véronique Richard, Patrice Aubertin, Patrick Léonard, Hassane Alami, Diane Singhroy, Richard Fleet</p>\r\nBackground <p>The conventional methods and strategies used for knowledge translation (KT) in academic research often fall short in effectively reaching stakeholders, such as citizens, practitioners, and decision makers, especially concerning complex healthcare issues. In response, a growing number of scholars have been embracing arts-based knowledge translation (ABKT) to target a more diverse audience with varying backgrounds and expectations. Despite the increased interest, utilization, and literature on arts-based knowledge translation over the past three decades, no studies have directly compared traditional knowledge translation with arts-based knowledge translation methods. Thus, our study aimed to evaluate and compare the impact of an arts-based knowledge translation intervention–a circus show–with two traditional knowledge translation interventions (webinar and research report) in terms of awareness, accessibility, engagement, advocacy/policy influence, and enjoyment.</p> Methods <p>To conduct this exploratory convergent mixed method study, we randomly assigned 162 participants to one of the three interventions. All three knowledge translation methods were used to translate the same research project: \"Rural Emergency 360: Mobilization of decision-makers, healthcare professionals, patients, and citizens to improve healthcare and services in Quebec’s rural emergency departments (UR360).\"</p> Results <p>The findings revealed that the circus show outperformed the webinar and research report in terms of accessibility and enjoyment, while being equally effective in raising awareness, increasing engagement, and influencing advocacy/policy. Each intervention strategy demonstrates its unique array of strengths and weaknesses, with the circus show catering to a diverse audience, while the webinar and research report target more informed participants. These outcomes underscore the innovative and inclusive attributes of Arts-Based Knowledge translation, showcasing its capacity to facilitate researchers’ engagement with a wider array of stakeholders across diverse contexts.</p> Conclusion <p>As a relevant first step and a complementary asset, arts-based knowledge translation holds immense potential in increasing awareness and mobilization around crucial health issues.</p>","author":"Julie Théberge","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"813b3ae43dab6f91e08e626a169d03a29aaa93ac82b50904bc57269798751c2e","category":"Interdisciplinary"}