{"title":"DOJ repatriates looted “Dream of Gilgamesh” tablet, other artifacts to Iraq","link":"https://arstechnica.com/?p=1784448","date":1628014567000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/gilgamesh1-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/gilgamesh1.jpg\">Enlarge</a> <span>/</span> A rare cuneiform tablet engraved with a portion of the ancient Mesopotamian epic of Gilgamesh will be returned to Iraq, per the US Department of Justice, along with 17,000 other looted artifacts. (credit:  US Immigration and Customs Enforcement)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>During the unrest in Iraq in April 2003, opportunistic looters stole some 15,000 priceless cultural artifacts from the National Museum of Iraq, taking advantage of the evacuation of museum staff until US forces were able to restore order. These artifacts have been showing up on the antiquities market ever since, often accompanied by forged or questionable claims of provenance. Thousands of them were purchased by billionaire Steve Green, founder of the Hobby Lobby craft chain store, on behalf of the <a href=\"https://en.wikipedia.org/wiki/Museum_of_the_Bible\">Museum of the Bible</a> in Washington, DC. Those artifacts included the so-called \"Dream of Gilgamesh\" tablet, a rare cuneiform text dating back to ancient Mesopotamia.</p>\n<p>US customs agents <a href=\"https://www.justice.gov/usao-edny/press-release/file/1277316/download\">seized the tablet</a> in 2019, and last week, a US District Court in New York <a href=\"https://www.justice.gov/opa/pr/rare-cuneiform-tablet-bearing-portion-epic-gilgamesh-forfeited-united-states\">ordered Hobby Lobby</a> to forfeit the tablet so it could be returned to Iraq. An additional 17,000 looted artifacts are also being repatriated to Iraq, the result of a months-long effort between Iraqi authorities and the US. <a href=\"https://news.artnet.com/art-world/government-forfeiture-hobby-lobby-gilgamesh-tablet-1993303\">According to</a> Iraqi Cultural Minister Hassan Nazim, \"This is the largest return of antiquities to Iraq.\" Archaeological looting in Iraq has been going on for at least a century, with estimated revenues from the sale of stolen artifacts amounting to between $10 and $20 million annually.</p>\n<p>“This forfeiture represents an important milestone on the path to returning this rare and ancient masterpiece of world literature to its country of origin,” <a href=\"https://www.justice.gov/opa/pr/rare-cuneiform-tablet-bearing-portion-epic-gilgamesh-forfeited-united-states\">said Jacquelyn M. Kasulis</a>, acting US attorney for the Eastern District of New York. “This office is committed to combating the black-market sale of cultural property and the smuggling of looted artifacts.”</p></div><p><a href=\"https://arstechnica.com/?p=1784448#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1784448&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"813d84dff699e45ad98b835efadf504edfb9e9e07a4bd51a041c29f603eed373","category":"Tech"}