{"title":"Quantitative Assessment and Analysis of Fish Behavior in Closed Systems Using Information Entropy","link":"https://www.preprints.org/manuscript/202405.1230/v1","date":1716201455000,"content":"This study introduces a method for quantitatively assessing the complexity and predictability of fish behavior in closed systems through the application of information entropy, offering a novel lens to understand how fish adapt to environmental changes. Utilizing simulations rooted in a random walk model for fish movement, we delve into entropy fluctuations under varying environmental conditions, including responses to feeding and external stimuli. Our findings underscore the utility of information entropy in capturing the intricacies of fish behavior, particularly highlighting the synchrony in collective actions and adaptations to environmental shifts. This research not only broadens our comprehension of fish behavior but also paves the way for its application in fields like aquaculture and resource management. Through our analysis, we discovered that smaller grid sizes in simulations capture detailed local fluctuations, while larger grids elucidate general trends, pinpointing a 2.5m grid as optimal for our study. Moreover, changes in swimming speeds and behavioral adaptations during feeding were quantitatively analyzed, with results illustrating significant behavior modifications. Additionally, employing a Gaussian Mixture Model helped to clarify the nuanced changes in fish behavior in response to altered light conditions, demonstrating the layered complexity of fish responses to environmental stimuli. This investigation confirms the efficacy of information entropy as a robust metric for evaluating fish shoal behavior, offering a fresh methodology for ecological and environmental studies, with promising implications for sustainable management practices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"81432a8a76fab2476a43dd9c8423cea1336c5f371467e63a5fba7efe713d5d75","category":"Interdisciplinary"}