{"title":"Mark Cavendish's transcendent wins","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mark-cavendishs-transcendent-win","date":1625587350000,"content":"\n      <p>After Mark Cavendish won stage 4 of the 2021 Tour de France last Tuesday, he signed a plaque in Fougères, the finishing town. With a white marker pen, he scribbled out the number of stage wins next to his name, and replaced it with the number 31, signifying the addition to his tally that many of us thought would never come. He then signed his name, and next to it wrote: “always believe”.</p>\n<div></div>\n<p>Since then, the Manxman has increased his tally to 33. The three stage wins he's had in the Tour so far this year have truly transcended the sport. In a year where fans the world over are limping awkwardly back into normal life from a global pandemic, there’s something that truly captures the zeitgeist around Cavendish's trio of wins.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1327299405-IG_02f90db2-6dfa-4f56-983b-4515312b787a_1024x1024.jpg?v=1625587208\" /></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Tour de France 2021 Guide</a></strong></em></p>\n<p>When Cavendish stopped winning stages of the Tour de France, it took some adjustment to a world where he wasn’t always the rider stretching out ahead of the peloton on every bunch sprint. Cav’s success became the norm: if he won, we expected it, if he didn’t, then there was a story. His wins in both Fougères, Châteauroux and Valence are beginning to hark back to those days.</p>\n<p>He’s winning with such convincing margins, so much more speed than his competitors, and of course, back in his signature green skinsuit. It feels like we are watching a vintage Mark Cavendish, his sprinting looking almost identical to when he won in his HTC Highroad team colours all those years ago. These sprints have certainly been the fairytale ending we all hoped for.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-81903708_835cab7a-7101-467c-b694-100ae1c89bed_1024x1024.jpg?v=1625163074\" /></p>\n<p><em>A young Mark Cavendish taking his first Tour de France stage win in </em><em><span>Châteauroux</span> 2008, where he won on stage 6 this year. Photo: Pascal Pavani/AFP via Getty </em></p>\n<p>Screenwriters would have struggled to write a more apt and emotional comeback than the one we’re seeing unfold at the Tour. Cavendish’s very first win, as a fresh-faced 23-year-old riding for Team Columbia, was in Châteauroux, where he won his 32nd stage last week. He’s won before in Fougères too, and years later he still shows the same gusto and enthusiasm on the very same sprint finish. The only difference is that this time, Mark Cavendish has felt what it’s like to not be able to win. He’s been there, at the back of the peloton, struggling to hold the wheel in front, he’s been at home watching on the TV, not making his team’s selection. While it looks like this is the gutsy sprinter of old, there’s something different about Cav and the public’s reaction to him.</p>\n<p>Perhaps this is most simply put into perspective when looking at the posts on social media by other riders, notably Chris Froome. In June of 2019, the British rider was in intensive care with multiple fractures after hitting a wall on a training ride. At this point, he was targeting another Tour de France victory. It’s taking Froome some time to come back to his best, he’s been subject to naysayers doubting his form, arguing that he’ll never return to the days of dominating mountain stages in the yellow jersey.</p>\n<p>After Cavendish took his win in Fougères, Froome sent a tweet: “So awesome seeing Mark Cavendish prove the doubters wrong today.” Like Froome, Mark Cavendish was constantly told he was past his best, to the point of being mocked in the media for not being able to contest finishes or complete mountain stages. Today he has, once again, proven the critics wrong, brushing off years of negativity with a series stunning sprints, yet in his tearful post-race interviews seems more human than ever before. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1233752260-IG_b847f875-5287-4846-9485-90b580758230_1024x1024.jpg?v=1625163187\" /></p>\n<p><em>Photo: Guillaume Horcajuelo/AFP via Getty Images</em></p>\n<p>His 30 stage wins came in such quick succession that it became easy to take them for granted. Number 31, number 32 and number 33, those no one believed he would get, are the sweetest of them all, for riders and fans alike. Cavendish’s wins have highlighted how much we need sport and the Tour de France, and how much it can mean to people.</p>\n<p>If a few months ago we speculated that Cavendish could take a record-breaking 35th stage win on the Champs-Élysées, clad in the green jersey, it would have seemed ludicrous. Today, we can dare to dream of that moment – one that could truly stand out in the history of the sport. I'm sure Cav believes he can do it, and we believe it too.</p>\n\n<p><strong><a href=\"https://www.rouleur.cc/pages/subscribe\"><em>If you've enjoyed Rouleur's Tour content, please consider subscribing</em></a></strong></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"81572362ac5124ece0838277b3d499aa263659a0f6b28af3984b684d766f1d72","category":"Cycling"}