{"title":"Streamflow responses to forest and climate change in the boreal Da Hinggan Mountains, Northeastern China","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2615?af=R","date":1703836717000,"content":"<h2>Abstract</h2>\n<p>Boreal forests cover vast stretches of land across all continents and represent a principal source area of clean water in the northern hemisphere. Increasingly, studies are conducted on the impact of changes in boreal forest cover on water yield; however, much remains unknown concerning the effects of forest structure changes on stream discharge over the course of multi-decadal forest harvest cycles. In this study, we analysed long-term hydrometeorological and forest dynamics data spanning from 1990 to 2016 from a typical boreal forest watershed in the Da Hinggan Mountains in northern China. Our objective was to quantify how changes in forest age and tree species composition affect mean annual streamflow and flow regimes in the context of a changing climate. To distinguish the effects of forest and climate changes on annual streamflow from one another, we employed a combination of a sensitivity-based method and a temporal trend analysis. Further, we evaluated the impact of forest changes on flow regimes using four indicators: magnitude, duration, frequency, and variability. The results indicated that mean annual streamflow increased by 55.8 mm, with forest changes contributing +61.4 mm compared to −5.6 mm due to climate change (negative effect). This increase occurred when approximately 20% of mature coniferous forests transitioned to mid-age broad-leaved forests, accompanied by a 10% increase in total stock volume during the later period. Finally, the effect of changes in forest structure on flow regime were not significant. Our results underscore that variations in forest structure affect streamflow differently depending on stand age and species proportions. Therefore, dynamic forest structure management can benefit not only carbon sequestration but also water supply capacity in boreal forested watersheds.</p>","author":"Zhengxiang Yu, \nDennis W. Hallema, \nTijiu Cai","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"8158245803cba502a34053d6065646a1a9f7cb82f857d16cf5190b0cfd86d6de","category":"Environment"}