{"title":"Video exposure through virtual reality can improve older people’s ability to manage postural instability caused by distortive visual environments","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306834","date":1724248800000,"content":"<p>by Jenny Älmqvist Nae, Anastasia Nyström, Francesca Luccini, Måns Magnusson, Eva Ekvall Hansson</p>\r\n\r\nIn older adults, age-related degenerative processes and disorders often degrade some sensory systems more than others, which can make postural control disproportionally dependent on one kind of sensory information. The study aims were to investigate 1) the postural stability when healthy older adults were repeatedly exposed to a video in an immersive virtual reality (VR) environment, and 2) the relationship between stability during VR video exposure and self-reported physical activity, balance confidence, and nausea during VR. Twenty-seven older adults (18 females, mean age 71.3 years (SD 4.4)) watched a 120-second VR video 5 times with 10 minutes between sessions, while standing on a force platform recording their stability. The first VR video session produced a marked stability challenge, reflected by significantly increased use of anteroposterior and lateral total (p&lt;0.001) and high frequency (p&lt;0.001) energy compared with the control test quiet stance eyes open. However, repeated VR video sessions produced a multidimensional decrease in used total (p&lt;0.001), low (p = 0.002), and high frequency energy (p&lt;0.001). Participants used more energy in anteroposterior compared with lateral direction across sessions within all spectral ranges (p&lt;0.001). Participants with higher physical activity level used less low frequency energy in anteroposterior direction during VR video session 1 (p = 0.033). No association was seen between balance confidence or nausea during VR and energy used during VR video sessions 1 and 5. Healthy older adults adapt fast to distortive visual environments, and thus, CNS can utilize the information provided by a few repeated VR video sessions into suitable movement strategies that have a simultaneous multidimensionally positive effect. VR may introduce numerous opportunities to customize novel rehabilitation approaches to address when the visual system causes and/or suffers from issues. However, a common problem for the older adult was that about 33% of the participants became nauseated by the VR video stimuli.","author":"Jenny Älmqvist Nae","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8163c37a7269f10c8be3a82402272914ef298131ffa26717909a978469798caf","category":"Interdisciplinary"}