{"title":"Assessing the impact of temperature, pH, light and chemical oxidation on fucoxanthin colour changes, antioxidant activity and the resulting metabolites","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13807?af=R","date":1724416172000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The present study evaluated the effects of temperature, pH, light and chemical oxidation on fucoxanthin changes in terms of colour, antioxidant activity and metabolomic profile. Additionally, the correlation between antioxidant activity and identified metabolites was analysed.</p>\n<h2>RESULTS</h2>\n<p>It was found that colour change was significantly reduced at elevated heat (100 °C, *∆<i>E</i> = 0.81 ± 0.05), reduced pH (pH 3, *∆<i>E</i> = 0.59 ± 0.04) and length of light exposure (*∆<i>E</i> = 3.16 ± 0.04). Antioxidant activity decreased under all treatments. Among the temperatures tested, fucoxanthin exhibited the highest activity at 60 °C, ranging from 0.92 to 3.04 mg Trolox equivalents (TE) g<sup>−1</sup>. Significant activity reductions (<i>P</i> &lt; 0.05) were observed as a result of pH changes in the 2,2-diphenyl-1-picrylhydrazyl and <i>β</i>-carotene bleaching assays. Exposure to light 2: warm white lamp for 120 h significantly reduced antioxidant activity (0.01 to 1.70 mg TE g<sup>−1</sup>). Chemical oxidation also led to reduced activity, ranging from 0.18 to 0.29 mg TE g<sup>−1</sup>. Multivariate data analysis revealed distinct profiles for temperature, pH, light and chemical oxidation treatments. Liquid chromatography-tandem mass spectrometry (LC-MS/MS)-based metabolomics analysis identified 10 metabolites, and significant correlations (<i>P</i> &lt; 0.05) indicate that these metabolites contributed to the samples' antioxidant activities.</p>\n<h2>CONCLUSION</h2>\n<p>In conclusion, fucoxanthin tolerates well at 60 °C, within pH range 3–9, and within 8 h of light exposure, as indicated by its consistent antioxidant activity and minimal colour change. Each treatment resulted in distinct metabolite concentrations, as shown by LC-MS/MS-based metabolomics analysis. Further research into these metabolites could advance the understanding of their roles and aid in optimising processing conditions to favour beneficial metabolites. © 2024 The Author(s). <i>Journal of the Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Zuhaili Yusof, \nVuanghao Lim, \nNicholas Mun Hoe Khong, \nWee Sim Choo, \nSu Chern Foo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8166a3974c88964b632cf37f32dedde2c191e2e299df96ae99362fd5959a989e","category":"Environment"}