{"title":"Exclusive | New Shimano Dura-Ace spotted at the Baloise Belgium Tour","link":"https://www.bikeradar.com/features/shimano-dura-ace-r9200/","date":1623534312000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Shimano-Dura-Ace-9200-groupset-9e38ffd.jpg?quality=90&amp;resize=620,413\" />                                            <p>BikeRadar can exclusively show the first pictures of what we believe to be Shimano’s new 12-speed Dura-Ace groupset.</p>\n<p>Fitted to at least two Team DSM bikes at the Baloise Belgium Tour, key changes include a move to 12-speed and a new shifter profile. The overall aesthetic is similar to the current-generation groupset, though the crankset is more angular, the front derailleur is smaller and the rear derailleur is more slender.</p>\n<p>One key question remains unanswered, however – both the front and rear derailleur have a wire feeding into the frame, so it’s impossible to know whether the groupset is semi-wireless or fully-wired, as with Dura-Ace 9100.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Team DSM (formerly Team Sunweb) has a long-standing relationship with Shimano.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>Team DSM, which was Team Sunweb prior to the 2021 season, has a long-standing relationship with Shimano, so it’s not surprising to see the new groupset make its first official public debut on the team’s bikes.</p>\n<p>Before we get into the detail, here’s a summary of what we can see in the photos, shot exclusively for BikeRadar:</p>\n<ul><li>Dura-Ace has gone 12-speed</li>\n<li>The shifters have a new and possibly more aero profile, as well as a textured grip</li>\n<li>The crankset is more angular and features a dual-sided power meter</li>\n<li>Shimano may adopt the XTR MT900 rotors for the road (and we haven’t seen a rim brake version yet)</li>\n<li>We don’t know whether the groupset is wired or semi-wireless</li>\n</ul><h2>What’s new with Shimano Dura-Ace 9200?</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/05_Shimano_Dura-Ace_9200_groupset_BikeRadar-c49b7f6.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The paddles on the shifters appear to be larger than the outgoing groupset.</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/01_Shimano_Dura-Ace_9200_groupset_BikeRadar-7e8e960.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Everything above the pivot is now hidden behind a shroud on the new shifters.</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/13_Shimano_Dura-Ace_9200_groupset_BikeRadar-5e13ddd.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The shifters have larger padles, which are also textured with a ribbed grip. </span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/16_Shimano_Dura-Ace_9200_groupset_BikeRadar-0afb6de.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The hoods are also taller than 9150.</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/15_Shimano_Dura-Ace_9200_groupset_BikeRadar-0c5b0bb.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The brake levers appear offset from the bar.</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe appearance of the new groupset – which will almost certainly be called Dura-Ace R9200 – in the wild suggests its release is imminent.\n<p>The shifters are notably different to current Dura-Ace. Where previously the whole front of each lever was on show, everything above the pivot is now hidden behind a shroud, perhaps in search of aero gains.</p>\n<p>The shape of the lever blades is similar to before, but they look slightly offset from the bar rather than simply flared outwards.</p>\n<p>The hoods have also adopted raised textured grips. This design isn’t dissimilar to that seen on Shimano’s GRX gravel groupsets, though it is less pronounced here.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Dura-Ace logos have been obscured across the bike.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>DSM’s mechanics have tried to scratch the Dura-Ace logo from the outside face of the hoods, but the overall outline is still clear, confirming this is almost certainly a Dura-Ace product. Logos elsewhere on the bike have been obscured with tape.</p>\n<p>The shift paddles – which appear to be larger than the current generation – now have a lined and possibly rubberised grip instead of dimples to provide grip.</p>\n<h2>Will Dura-Ace 9200 use any Pioneer power meter technology?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The outside face of the crankset is much flatter than 9100.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>The shaping of the crank is quite different to Dura-Ace 9100. Shimano has stuck with a four-arm design, but the crank arm and spider are more angular than before, with raised sections above and below the Dura-Ace logo (well, where the Dura-Ace logo should be) and a bevel to the edges of the arms.</p>\n<p>The chainrings on this bike are not as neatly integrated as the previous-generation groupset, leading some on the BikeRadar team to speculate these may not be a production version.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> We think the new chainrings could possible be pre-production samples.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>In fact, the pictured chainrings have more than a passing resemblance to <a href=\"https://www.awin1.com/cread.php?id=489797&amp;clickref=bikeradar-0&amp;awinmid=1857&amp;p=https%3A%2F%2Fwww.wiggle.co.uk%2Fta-x110-outer-chainring-for-shimano-ultegra-6800\" target=\"_blank\">third-party chainrings from the likes of TA Specialities</a>. We can’t say for certain, however.</p>\n<p>The crankset is also equipped with a dual-sided power meter. Given <a href=\"https://www.bikeradar.com/news/pioneer-transfers-ip-to-shimano/\">Shimano’s acquisition of Pioneer in 2020</a>, it will be interesting to see what (if any) tech has been adopted by the brand.</p>\n<h2>A smaller front derailleur and a re-designed rear derailleur</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/02_Shimano_Dura-Ace_9200_groupset_BikeRadar-74470db.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The rear derailleur is very similar to Dura-Ace 9100, but is slimmer and more angular overall.</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/10_Shimano_Dura-Ace_9200_groupset_BikeRadar-48a9c23.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The front derailleur is smaller than the outgoing model. Could this improve tyre clearance?</span>\n    </figcaption><span>\n                    <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe direct-mount rear derailleur is similar in style to the 9150 Di2 rear derailleur, though is a touch more slender and angular. The front derailleur looks like it might be slightly smaller than before.\n<p>The cage of the rear derailleur appears to be considerably longer than the current generation, suggesting a medium cage (GS in Shimano nomenclature) version may be on the cards.</p>\n<p>This would be a first for modern-era Dura-Ace – only a short cage version, which can accommodate a cassette with a maximum cassette cog of 30t is currently available. Will Shimano now offer larger cassettes at a Dura-Ace level?</p>\n<h2>12-speed confirmed</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Dura-Ace is moving to 12-speed.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>Following both SRAM and Campagnolo, the groupset has gone 12-speed. We cannot tell the tooth count of the cassette from the photos, nor can we confirm if the bike is using a new chain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> It’s not possible to tell whether Dura-Ace shares a chain with Shimano’s 12-speed mountain bike groupsets.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>However, it’s not unfeasible to think there will be at least some cross-compatibility between 12-speed Shimano road and mountain bike groupsets (chains are shared across all current road, gravel and mountain bike 11-speed groupsets).</p>\n<h2>Will there be a rim brake version of Shimano Dura-Ace 9200?</h2>\n<p>The bike is fitted with a pair of Shimano XTR MT900 mountain bike rotors.</p>\n<p>It’s been widely publicised that pro teams have been using these for some time now. Many had speculated this was to reduce weight compared to the Dura-Ace RT900 rotors but their appearance here could mean Shimano is officially adopting these on the road too.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The groupset was fitted to Joris Nieuwenhuis’s Scott Addict RC.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>On that note, so far we have only seen a disc brake version of the groupset.</p>\n<p>Unless Team Ineos-Grenadiers – the only <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour team</a> still using rim brakes as standard – is seen using the groupset ahead of its eventual official release on the also unreleased <a href=\"https://www.bikeradar.com/news/pinarello-dogma-f14/\">Pinarello Dogma F14</a>, we won’t be able to confirm what the new Dura-Ace might look like with rim brakes.</p>\n<p>The bike is fitted with a pair of unbranded mid-depth carbon tubular wheels. These are almost certainly the same wheels as ridden by a number of teams during the 2020 <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a>.</p>\n<p>It’s interesting to note these wheels were being used with Dura-Ace 9100, which has an 11-tooth minimum cog. Given Shimano’s wheels do not typically feature swappable freehubs, it’s possible the brand will not adopt a 10t cog with the new groupset.</p>\n<h2>Will Shimano Dura-Ace 9200 be wireless? We simply don’t know</h2>\n<p>As discussed in the original speculation article below, one of the big questions was whether Shimano was planning to go wireless or, as a recent patent suggests, perhaps semi-wireless with its new flagship groupset.</p>\n<p>Shimano’s patents appeared to point to the latter option and, based on the presence of a wire connected to the front and rear derailleurs, that’s more likely based on what we can see here.</p>\n<p>It’s possible the levers are not physically connected to the rest of the system, with Shimano’s patent suggesting the use of a wireless receiver in the seat tube allowing the levers to communicate with the derailleur, but we simply can’t tell from these images.</p>\n<h2>Blink and you’ll miss it</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The overall look of the groupset is similar to Dura-Ace 9100, but there are some subtle changes.</span></figcaption><span> <i>Dion Kerckhoffs / Cor Vos / Immediate Media</i></span></div>\n<p>If you were hoping for a radical new aesthetic for R9200, it looks like you’re going to be disappointed. The colour scheme doesn’t appear to deviate from the black/grey tones of R9100 series Dura-Ace, with a very similar shiny finish.</p>\n<p>We had wondered if Shimano might throw in some silver more in the vein of Dura-Ace 9000, but we’re certainly not seeing that here.</p>\n<p>As mentioned, the derailleurs have slimmed down significantly and the crankset is more angular overall, with a flatter outward face and sharper edges than 9100.</p>\n<p>For the sake of completeness, the pedals fitted to the bike are the existing PD-9100 option.</p>\n<p>Read on for all of our previous speculation about the groupset and let us know what you think about the new groupset in the comments below.</p>\n<hr /><p>Will the new Shimano Dura-Ace groupset be semi-wireless? New patents appear to show a semi-wireless design, with the shifters wirelessly communicating to the derailleurs, which are wired to one another.</p>\n<p>A series of drawings published with the most recent patent, spotted by road.cc and published only today (Thursday 13 May), show a coin cell battery in the shifter hood, to individually power each shifter. SRAM’s eTap wireless groupset also uses replaceable coin cell batteries to power the shifters.</p>\n<p>Where Shimano’s design appears to differ to the completely wireless eTap system, however, is in how the derailleurs are powered.</p>\n<p>A separate patent published in March describes a “wireless communicator” on the rear derailleur, allowing it to ‘talk’ to the shifters. The derailleurs are then wired to a battery via a junction box. (SRAM’s eTap derailleurs are powered by their own, removable batteries).</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> The new patent shows a shifter powered by a coin cell battery.</span></figcaption><span> <i>United States Patent and Trademark Office</i></span></div></dt>\n</dl></div>\n<p>Numerous patents published this year also appear to confirm that the new flagship groupset will be 12-speed, gaining an extra sprocket on the current 11-speed Shimano road groupsets. Both SRAM and Campagnolo have moved to 12-speed and it’s logical that Shimano would follow suit.</p>\n<p>We’re expecting the new Dura-Ace to launch this year – Shimano’s product life cycle and the pace of recent patents would appear to confirm that’s the case.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Another patent shows how the derailleurs are wired to a battery.</span></figcaption><span> <i>United States Patent and Trademark Office</i></span></div></dt>\n</dl></div>\n<p>With any new Shimano groupset a hotly-anticipated affair, let alone a new flagship groupset, the rumour mill has been in full swing and you can follow previously developments below.</p>\n<p>We’ve also published our wish list for the new Dura-Ace – again, read on for that – and have speculated that Shimano might move to a semi-wireless design.</p>\n<p>Will that prove to be the case upon launch? Well, we’ll have to wait and see. In the meantime, we’ll be keeping our eyes peeled for the new Dura-Ace in the flesh.</p>\n<p>Older updates continue below.</p>\n<hr /><p>Update 2 February 2021: A new Dura-Ace R9200 groupset has yet to put in a verified appearance, but rumours continue to fly and there have been further clues to what the next generation of Shimano’s flagship <a href=\"https://www.bikeradar.com/advice/buyers-guides/road-bike-groupsets-everything-you-need-to-know/\">road groupset</a> might look like.</p>\n<p>Shimano has filed a flurry of patents in the past year that could relate to new Dura-Ace, including ones that feature wireless components and 12-speed cassettes.</p>\n<p>Perhaps the most significant development (one picked up by our friends at <a href=\"https://cyclingtips.com/2021/02/shimano-gets-wireless-certification-is-dura-ace-r9200-near/\" target=\"_blank\">CyclingTips</a>) is that Shimano has had both a rear derailleur and a “shifting module” tested under FCC (Federal Communications Commission – the US body that certifies wireless devices) regulations, but not a front derailleur.</p>\n<p>CT’s Dave Rome (formerly of BikeRadar) points to the possibility that this means Dura-Ace R9200 will be ‘semi-wireless’, something we’ve previously speculated in our Dura-Ace wish list.</p>\n<p>As noted in our extended speculation below, it’s possible Shimano may make certain components wireless (e.g. the rear derailleur), while retaining a physical connection between others.</p>\n<p>This might be a way of simplifying wiring arrangements or achieving a compromise between convenience and battery life – <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/fsa-k-force-we-groupset-review/\">FSA attempted similar with its K-Force WE groupset</a>.</p>\n<p>Shimano Di2 has always had <a href=\"https://www.bikeradar.com/reviews/components/groupsets/sram-force-etap-axs-vs-shimano-ultegra-di2/\">far longer battery life than SRAM’s wireless AXS groupsets</a> thanks to its large central battery, and Shimano might not want to force riders into more frequent charging.</p>\n<p>It’s also possible that a semi-wireless arrangement could circumvent patents held by rival brands, although that’s speculation – we’re not patent lawyers.</p>\n<p>An alternative explanation for the latest news is that everything will be wireless, but the testing has yet to be carried out or the reports just aren’t yet finished for the other components.</p>\n<p>The one feature that seems like a dead cert is a move to 12-speed. Shimano has gone to 12 cogs all the way down to <a href=\"https://www.bikeradar.com/news/shimano-deore-m6100-12-speed/\">Deore-level (equivalent to Tiagra)</a> on its <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">mountain bike groupsets</a> and it would be baffling if road didn’t follow suit.</p>\n<p>If that happens, it will likely bring with it a shake-up of the gearing options on offer, since the 12-speed <a href=\"https://www.bikeradar.com/features/shimano-decided-to-create-a-freehub-standard/\">Micro Spline freehub</a> permits the use of a 10t cog at the high end.</p>\n<p>This could have major implications for the whole of Shimano’s drop-bar groupset range.</p>\n<p>The dust has barely settled since the launch of the brand’s <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-grx-review/\">gravel-specific GRX components</a>, but a move to 12-speed on the pure road side would steamroller existing compatibility between the road and gravel ranges.</p>\n<p>Older updates continue below.</p>\n<hr /><p>Update 9 October 2020: This week the internet is aflutter after Deceuninck–Quick-Step rider Remco Evenepoel posted a video to Instagram detailing a post-injury training ride that might give a glimpse of a new and potentially wireless Shimano Dura-Ace groupset fitted to his <a href=\"https://www.bikeradar.com/news/2021-specialized-tarmac/\">Specialized Tarmac SL7</a> team bike.</p>\n<p>Here’s the video:</p>\n<blockquote><div> <a href=\"https://www.instagram.com/tv/CF4SOlKH3GO/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/tv/CF4SOlKH3GO/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Remco Evenepoel (@remco.ev)</a></p></div></blockquote><p>And here’s one of the images that have set tongues wagging:</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> The front derailleur looks oddly chunky here.</span></figcaption><span> <i>Remco Evenepoel / Instagram</i></span></div></dt>\n</dl></div>\n<p>There is something odd looking about the shape of both the front and rear derailleurs, with the front looking slightly chunkier than I’d expect. Nevertheless, I’m not convinced this is the new groupset.</p>\n<p>I think the lighting is playing tricks and making familiar components look different.</p>\n<p>If you zoom right in on the rear derailleur it looks like the previous-generation R9150 cable is actually there, it’s just almost invisible against the cassette.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> If you examine the pixels closely, it does look like there’s a cable there.</span></figcaption><span> <i>Remco Evenepoel / Instagram</i></span></div>\n<p>But maybe I’m wrong? Is this the first sighting of Dura-Ace R9200? Is it wireless? Watch this space.</p>\n<section><div>\n        <ul><li><a href=\"https://www.bikeradar.com/news/shimano-grx/\">Shimano GRX is here: gravel-specific and 1x components for Ultegra, 105 and Tiagra</a></li>\n<li><a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\">Shimano Dura-Ace R9100 review</a></li>\n<li><a href=\"https://www.bikeradar.com/reviews/components/groupsets/sram-force-etap-axs-vs-shimano-ultegra-di2/\">SRAM Force eTap AXS vs. Shimano Ultegra Di2</a></li>\n</ul><p>\n\n    </p></div>\n    </section><hr /><p><em>Original article continues below.</em></p>\n<h2>Shimano Dura-Ace R9200 – our predications</h2>\n<p>Shimano is fairly consistent with its product lifecycles and, following its usual pattern, it seems highly probable that we’ll see the launch of a new 12-speed Dura-Ace groupset in the near future, most likely called Dura-Ace R9200.</p>\n<p>The current <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\">11-speed Dura-Ace R9100</a> is a wonderfully refined groupset in all its permutations (disc, rim, electronic, mechanical…) and you could be forgiven for thinking that major improvements are unlikely.</p>\n<p>Nevertheless, we’re excited to see what Shimano comes up with next. Will Shimano go 12-speed on the road? Will the new Dura-Ace Di2 be partially or completely wireless? What mad new tech might be introduced?</p>\n<p>We first published this piece in September 2019 and as of 9 October 2020, Dura-Ace R9200 has failed to put in an official appearance, suggesting my original prediction that Shimano would launch the groupset in 2020 is likely incorrect.</p>\n<p>Of course, nothing about 2020 has been normal. The pro racing calendar is all over the place, with <a href=\"https://www.bikeradar.com/advice/how-to-watch-2020-giro-ditalia/\">the Giro d’Italia</a> currently being staged and the Vuelta a Espana set to overlap with its final week.</p>\n<p>In an ideal world we’d be ogling newly launched bikes and trying to spot the next generation of Dura-Ace lurking on the roof of a team car right now, but we’re still hopeful that we might catch a glimpse of something new from Shimano this year, even if it doesn’t launch officially until 2021.</p>\n<p>As is traditional, Shimano is tight-lipped on the subject, so here are our updated predictions and my personal wish list of features, based on years of reporting on Shimano components and my assessment of the current road bike market.</p>\n<h2>1. Dura-Ace R9200 will be 12-speed</h2>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano debuted its 12-speed Micro Spline freehub with the launch of XTR M9100.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div></dt>\n</dl></div>\n<p>Given that Shimano has already gone 12-speed with its <a href=\"https://www.bikeradar.com/news/hands-on-with-shimano-xtr-12-speed/\">XTR M9100 mountain bike groupset</a> and both <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">SRAM</a> and <a href=\"https://www.bikeradar.com/news/campagnolo-12-speed-record-and-super-record-groupsets-launch/\">Campagnolo</a> have already added a twelfth cog to their road offerings, it seems all but certain that the next generation of Dura-Ace will follow suit.</p>\n<p>That has major implications for the groupset as a whole because it would mean finally abandoning the Hyperglide freehub, presumably in favour of <a href=\"https://www.bikeradar.com/features/why-shimano-decided-to-create-a-new-freehub-standard/\">the Micro Spline design, which launched with XTR M9100 in 2018</a>.</p>\n<p>This allows for the use of a 10t small cog on the cassette and has since been adopted for the <a href=\"https://www.bikeradar.com/advice/buyers-guides/mountain-bike-groupsets-everything-you-need-to-know/\">second- and third- and fourth-tier mountain bike drivetrains, XT, SLX and Deore</a>.</p>\n<p>A move to 12-speed is good news if you’re looking for closer spaced gears or more range, but it will, of course, mean no backwards compatibility for most wheels.</p>\n<p>Of course, you never know, <a href=\"https://www.bikeradar.com/news/shimano-14-speed-has-been-hiding-in-plain-sight-since-99/\">Shimano might just jump straight to 14-speed</a>.</p>\n<h2>2. Dura-Ace R9200 will still be available in mechanical, Di2, hydraulic and rim brake versions</h2>\n<p>SRAM seems to have all but abandoned mechanical shifting at the high end and its rim brakes feel like a bit of a poor second cousin too – the RED and <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-force-etap-axs-review/\">Force AXS</a> groupsets are electronic only, and there’s still no <a href=\"https://www.bikeradar.com/features/why-direct-mount-brakes-are-awesome/\">groupset-matching direct-mount brake option</a>.</p>\n<p>I can’t see Shimano taking a similar approach. Dura-Ace is a flagship for the brand with a long and storied history, and it’s always been a showcase for the very best mechanical shifting the company’s engineers can offer.</p>\n<p>Similarly, while the disc brake takeover continues, a significant proportion of pro and amateur riders continue to use rim brakes, and Shimano won’t want to alienate them completely.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Their days may be numbered, but I’m not convinced Shimano is ready to drop rim brakes just yet.</span></figcaption><span> <i>Matthew Allen / Immediate Media</i></span></div></dt>\n</dl></div>\n<p>As long as mechanical road groupsets continue to form the core of Shimano’s road range with <a href=\"https://www.bikeradar.com/news/shimano-105-r7000-groupset-everything-you-need-to-know/\">everyman groupsets such as 105</a>, and bike manufacturers continue to produce rim brake versions of their top-end bikes, I think mechanical shifting and rim brakes are here to stay as options at the top level.</p>\n<p>Saying that, the number of flagship models that are disc-only is ever-increasing, such as <a href=\"https://www.bikeradar.com/news/2021-trek-emonda/\">the new 2021 Trek Emonda</a>.</p>\n<p>It’s possible that one or more of the groupset permutations might be dropped. Dura-Ace R9100 is available in four versions: R9100 mechanical/rim brake, R9120 mechanical/disc brake, R9150 Di2/rim brake, R9170 Di2/disc brake.</p>\n<p>It’s conceivable that R9200 might do without, say, the R9220 mechanical/disc brake option, but Shimano generally likes to cover all bases, so I’m doubtful about that.</p>\n<h2>3. Dura-Ace R9200 will not be fully wireless</h2>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> There’s no denying that SRAM’s wireless eTap groupsets make for wonderfully clean builds.</span></figcaption><span> <i>SRAM</i></span></div></dt>\n</dl></div>\n<p>We know that <a href=\"https://www.bikeradar.com/news/shimano-di2-wireless-hydraulic-shifter-patented/\">Shimano has filed patents for wireless components in recent memory</a>, but I don’t think the next generation of Dura-Ace Di2 will actually be wireless, or at least not fully.</p>\n<p>Going wireless would mean fundamentally changing the way Di2 works and up-ending the existing E-Tube ecosystem, <a href=\"https://www.bikeradar.com/news/more-12-speed-kit-from-shimano-but-its-not-a-groupset/\">which integrates with the STEPS ebike system</a>.</p>\n<p>Current Di2 (no pun, etc.) runs off a single, large battery, with components connected at junction boxes – typically one at the stem and one inside the frame.</p>\n<p>Wireless would necessitate separate batteries and the adoption of a new communication protocol.</p>\n<p>Of course, there is precedent for starting with a clean slate; when Shimano launched its second Di2 groupset in the form of Ultegra 6770, the original Dura-Ace 7970 Di2 was completely orphaned, with no backwards compatibility at all.</p>\n<p>Perhaps a more likely scenario for R9250/R9270 is a semi-wireless design where the derailleurs are physically connected to a main battery and a receiver, and the shifters communicate with them wirelessly. <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/fsa-k-force-we-groupset-review/\" target=\"_blank\">FSA’s K-Force WE groupset uses this arrangement. </a></p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> A typical Di2 setup looks something like this — could it be streamlined?</span></figcaption><span> <i>Shimano</i></span></div></dt>\n</dl></div>\n<p>In any case, some streamlining of current wiring arrangements would certainly make sense. In existing Di2 setups, a bike might have two junction boxes and a bar-end charging point.</p>\n<p>One or more of these could be eliminated with some thoughtful engineering.</p>\n<h2>4. Dura-Ace R9200 will be a premium product aimed at road racers first</h2>\n<p>While lower-tier groupsets have always offered features aimed specifically at amateurs, Dura-Ace has historically been kept slightly apart, with the focus always on racers.</p>\n<p>In recent years, for example, long cage (GS) Ultegra rear derailleurs have been designed to work with cassettes up to 34t, while Dura-Ace has never supported a big cog larger than 30t.</p>\n<p>In a similar vein, Shimano held off adding disc brakes to Dura-Ace initially, at a time when pros were riding rim brakes exclusively, <a href=\"https://www.bikeradar.com/news/shimano-br-r785-road-hydraulic-disc-brakes-first-look/\">instead offering them as non-series components nominally at Ultegra level</a>.</p>\n<p>It wasn’t until the debut of Dura-Ace R9100 that discs became part of the flagship race groupset.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> When Shimano launched its GRX gravel components, it chose not to offer them at Dura-Ace level.</span></figcaption><span> <i>Shimano</i></span></div></dt>\n</dl></div>\n<p>Most recently, <a href=\"https://www.bikeradar.com/news/shimano-grx/\">Shimano dived into 1× for road and gravel with the launch of its GRX components</a>, which top-out at the RX800 Ultegra-equivalent level.</p>\n<h2>5. Dura-Ace R9200 cranks will be alloy and 2× only</h2>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano has dabbled with carbon cranks before, but I’m predicting that the next generation of Dura-Ace will stick with alloy.</span></figcaption><span> <i>Shimano</i></span></div></dt>\n</dl></div>\n<p>Shimano has dabbled with carbon cranksets in the past and actually launched <a href=\"https://www.bikeradar.com/news/shimano-launches-carbon-dura-ace-crankset/\">a carbon version of its Dura-Ace 7800 cranks way back in 2007</a>, but, since then, the brand has focused exclusively on aluminium cranks, producing ever-more refined versions of its Hollowtech II design.</p>\n<p>It seems likely that this trend will continue for R9200 cranks, although we did get a glimpse of an alternative future with <a href=\"https://www.bikeradar.com/news/shimano-patent-radically-reimagines-the-crankset/\">a striking new crank design teased in a patent filed by Shimano</a>.</p>\n<p>What seems more likely is a shake-up of available ratios as we’ve seen with <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/sram-12-speed-red-etap-axs-hrd-review/\">SRAM’s 12-speed AXS groupsets</a>.</p>\n<p>If Shimano adopts a 10t cog, it would only be logical to combine that with smaller chainrings, perhaps along similar lines to the 50/37t, 48/35t and 46/33t of SRAM’s X-Range cranks.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano patented this radical crank design.</span></figcaption><span> <i>Shimano / Google Patents</i></span></div></dt>\n</dl></div>\n<p>It’s conceivable that Shimano might move to direct-mount chainrings for 12-speed as it did with the latest XTR groupset, but I don’t think that’s going to happen.</p>\n<p>Direct-mount offers an elegant way to support both 1× and 2× drivetrains on the same crank platform as well as a range of chainring – because bolt circle diameter (BCD) isn’t an issue – but I doubt the next generation of Dura-Ace will offer a 1× option at all.</p>\n<p>Pro cyclists have shown little enthusiasm for 1× on the road (see also: the team Aqua Blue Sport debacle and the subsequent launch of <a href=\"https://www.bikeradar.com/features/3t-strada-due-first-look/\">the 3T Strada Due</a>), so to offer 1× would not be in keeping with the racing-first ethos of Dura-Ace.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> It would be fair to say that 1× on pure road bikes has some way to go.</span></figcaption><span> <i>Matthew Loveridge / Immediate Media</i></span></div></dt>\n</dl></div>\n<p>Also, Shimano’s GRX range of gravel components has 1× options, so adding the option to the brand’s pure road offering would be a muddling of its current approach.</p>\n<p>A curious side effect of Dura-Ace going 12-speed and sticking to 2× would be that the brand would then be offering 1×11 and 2×12, but not 1×12. No doubt 12-speed GRX components would be released in good time, though.</p>\n<p>A further consideration is crank spindle diameter; where other manufacturers have focused on 30mm designs, Shimano has stuck doggedly to 24mm, which eases backwards compatibility concerns.</p>\n<p>I don’t see this changing, Shimano has proven it can make ultra-stiff cranks with 24mm spindles, and moving away from them would have far-reaching implications for bottom bracket design that would put Dura-Ace entirely at odds with the rest of Shimano’s range.</p>\n<h2>6. Dura-Ace R9200 will brake even better, but you may not notice</h2>\n<p>The current generation of Shimano hydraulic levers offer a greater range of adjustment compared to the first wave of road disc components and the braking on offer is very, very good.</p>\n<p>Realistically, any improvements on this front are going to be incremental ones, but it’s possible that the range of adjustment could be further increased or even made tool-free, although the latter seems unlikely.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> Shimano borrowed Servo Wave from its mountain bike levers for the Di2 version of GRX.</span></figcaption><span> <i>Kevin Fickling / Shimano</i></span></div></dt>\n</dl></div>\n<p>The <a href=\"https://www.bikeradar.com/news/shimano-grx/\">GRX Di2 levers</a> use Shimano’s Servo Wave design for better braking off-road. Servo Wave makes the relationship between lever and pad travel non-linear, improving modulation in the latter part of the stroke.</p>\n<p>It’s debatable whether this specific approach would offer a benefit on the road, but I could imagine Shimano looking to improve braking control if not outright power.</p>\n<h2>7. Shimano will do something different</h2>\n<p>Shimano won’t want to be seen to be playing catch up with SRAM and Campagnolo. There’s a strong incentive for the brand to strike out in an entirely new direction to differentiate itself from the competition.</p>\n<p>It seems likely that it might do this on the tech and integration front. Shimano has filed some interesting patents in recent years including, for example, <a href=\"https://patents.google.com/patent/US20190185092A1/en\" target=\"_blank\">one that appears to describe a system of service indicators for bikes</a>, which displays information to the rider in much the same way that a modern car tells its owner when to perform key maintenance, such as changing engine oil or replacing brake pads.</p>\n<p>A system like this is more likely to appear on more utility-oriented bikes (and ebikes) than the race machines for which Dura-Ace is intended, but it’s interesting all the same.</p>\n<p>A greater level of integration seems inevitable for Dura-Ace Di2. R9100 debuted Synchro Shifting, user-assignable buttons on the shifters and Garmin integration, and <a href=\"https://bike.shimano.com/en-EU/product/component/duraace-r9150-di2/EW-WU111.html\" target=\"_blank\">Shimano now offers a Bluetooth antenna</a> for direct communication with your phone.</p>\n<p>Expect some further evolution of this everything-connected approach, perhaps with more sophisticated power meter integration and better connectivity to third-party devices.</p>\n<h2>My Dura-Ace 2021 wishlist</h2>\n<p>Above all, I’d like Shimano to be daring with the next generation of its flagship road groupset. This is the company that came up with <a href=\"https://www.bikeradar.com/news/screw-di2-i-want-shimano-airlines/\">pneumatic shifting</a> and <a href=\"https://www.bikeradar.com/features/a-love-letter-to-the-shimano-spd-sandal/\">SPD sandals</a> for crying out loud!</p>\n<p><a href=\"https://www.bikeradar.com/features/shimano-electronic-gears-could-soon-charge-themselves/\">How about a self-charging Di2 groupset?</a> One (very) minor criticism I have of current Di2 is that the battery life is so good that <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-roubaix-expert-long-term-review/\">it’s all too easy to forget to charge it</a>.</p>\n<p>While I don’t think it’s going to happen, I would love it if the brand were to go fully wireless with Dura-Ace R9200.</p>\n<p>Building a bike with SRAM eTap is such a delight, with no gear cables (or wires) to route through the frame, and no separate battery to install.</p>\n<p>eTap makes for wonderfully clean builds, the likes of which simply aren’t possible with current Shimano groupsets.</p>\n<div>\n<dl><dt>\n<p></p><div>\n    <img /></div><div><figcaption><span><i></i> I sincerely believe that Dura-Ace 9000 is one of the most striking groupsets ever made.</span></figcaption><span> <i>BikeRadar</i></span></div></dt>\n</dl></div>\n<p>On the aesthetic front, I think Shimano could afford to be bolder. I happen to think Dura-Ace 9000 was one of the best-looking groupsets ever made, with its angular lines and sharp two-tone accents. When it launched, it looked like nothing else on the market.</p>\n<p>Dura-Ace R9100, on the other hand, was much more conservative in its design. It’s still a handsome set of components, but the mostly-black colour scheme (there’s a bit of subtle fading) just isn’t as radical and eye-catching.</p>\n<p>I want Shimano to come up with something both beautiful and new for the next generation.</p>\n<p>What are you hoping for from the next generation of Dura-Ace? Let us know your thoughts in the comments.</p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"816c92880d3cac1faf289bc7ce45cd7bd3504d4a9263ec87d21565afecf39317","category":"Cycling"}