{"title":"Roubaix is made for Ellen van Dijk, but first she had to learn to love cobbles","link":"https://cyclingtips.com/2021/10/roubaix-is-made-for-ellen-van-dijk-but-first-she-had-to-learn-to-love-cobbles/","date":1633081608000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Trek-Segafredo-Paris-Roubaix-recon-Domane-60-650x366.jpg\" /></div><h2>Roubaix is made for Ellen van Dijk, but first she had to learn to love cobbles</h2><p>\n</p><p>With Ellen van Dijk as one of the top favourites to win the first-ever women’s Paris-Roubaix, her Trek-Segafredo team are going into the race having thoroughly prepared. The riders have completed multiple recons of the course and will be riding the best equipment available to them after testing out multiple options over the cobbles. </p>\n\n\n\n<p>She may be a favourite, but it wasn’t love at first sight for Van Dijk when the testing parcours. “The first time I did a recon, I almost started crying,” she says. “I crashed also in this recon, and I just did not have a lot of fun I have to say. Everybody was telling me ‘this race will really suit you and it’s so nice and it’s so much fun’ I just really didn’t like it. I just didn’t have a good day I crashed and I just wanted to quit and I quit it actually in the recon and I almost never quit in a training.” </p>\n\n\n\n<p>“I didn’t like it so much, but the more you do it, the more you get familiar with it, and it’s just super, super rough. But the faster you go, the faster it passes so that’s got to be the tactic.” </p>\n\n\n\n<p>Riding fast is a tactic that the 34-year-old is unlikely to struggle with given her recent form, taking the European road race title followed by the rainbow jersey in the World Championship time trial. With that, however, comes great expectations: “Yeah for sure there’s pressure but at the same time I feel like my season is already so good with these two titles I recently got,” she says. “So I’m going to give it my all and I know I’m in good shape but if it doesn’t come out the result we want then that’s it, what else can we do? So I do not feel too stressed yet. I will be nervous for sure. But I think everybody will be.”  </p>\n\n\n\n<p>Others might see her as a favourite, but the Dutchwoman doesn’t see herself as the sole leader of the team, and acknowledges the possibility for plans to change: “We have a strong block of riders here so it won’t be just about me and I think that’s that’s better for everyone,” she says. “I think it’s great to be here with such a strong team and to have different options because also anybody can have a puncture or a crash or whatever. So we will go into it a bit open.” </p>\n\n\n\n<p>Lizzie Deignan, however, believes in her teammate. “We haven’t had our team meeting yet so I don’t know what our team plan is. But we have a super strong team. I think Ellen has shown that she’s in incredible form winning the World title like she did and this is kind of a race that would be perfectly designed for her so I expect her to be probably the team leader and then us to slot in around that,” she said. “Everyone else finds the cobbles very difficult, but Ellen is flying over them at the moment.”</p>\n\n\n\n<p>One of Van Dijk’s strengths is her raw power, which is invaluable in a race like Roubaix, particularly if the wind plays a role, which Deignan predicts it might. “I think it will come into play because it’s not just a bit of wind, it’s really strong so if anybody does have the potential idea of going solo [then] maybe they’ll push that back further towards the back of the race because it’s going to be so windy, and it will also mean that the job of the workers in the beginning of the race will be even more vital to protect their leaders from the wind.” </p>\n\n\n\n<p>One weather condition that Van Dijk is not so happy to confront, however, is rain: “I would prefer dry but we can’t really choose so we do it with whatever is there,” she said. “I didn’t really ride it in the real rain. A little bit of rain we had in one recon. I think there will be more chaos in the rain, for sure, and more chances of bad luck, maybe but that’s for everyone. So yeah, we just have to go with what’s coming.”</p>\n\n\n\n<p>Deignan is unphased by the potential for a wet Roubaix, but she conceded that “most of the riders will probably prefer it dry and maybe that’s more sensible for the first edition.”</p>\n\n\n\n<p>Despite the fact that the women will not race over certain sectors that the men’s edition covers, she is happy with the course. “It’s more important that we finish on the velodrome [and] that we have the opportunity to do this race. I think it’s also important that races like this are sustainable and that they grow at the rate they should.” </p>\n\n\n\n<p>“This peloton hasn’t raced over cobbles like this before,” Deignan said. “There’s still a lot of room for improvement and experience for a lot of teams in this race. We’re lucky we have the men’s Trek-Segafredo team and we have the best equipment that we can have but not every team is in that situation so I think it’s actually important that we’re given the opportunity to race but yeah, potentially it can grow and we can include those sections in the future.” </p>\n\n\n\n<p>As for Van Dijk’s thoughts on the course since that fateful first recon: “Since then we did another four times…and every time it got better and better so now I’m okay with it now. We’re friends, I’m friends with the cobbles.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/roubaix-is-made-for-ellen-van-dijk-but-first-she-had-to-learn-to-love-cobbles/\">Read More</a>","author":"Amy Jones","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"81779fa636e1c08aa0003736577152968edb7128528ee1d9084fb7a24a90688c","category":"Cycling"}