{"title":"Fast.ly broke the Internet for an hour this morning","link":"https://arstechnica.com/?p=1771582","date":1623190006000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1322484485-800x532.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/GettyImages-1322484485.jpg\">Enlarge</a> <span>/</span> The United Kingdom government's official website was one of those affected by this morning's outage. The cryptic \"Guru Mediation\" message shown is an untrapped, unskinned error returned from the Varnish cache server powering the Fastly CDN. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/in-this-photo-illustration-a-screen-displays-a-holding-page-news-photo/1322484485\">Leon Neal via Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>For roughly an hour this morning—6 am to 7 am EDT, give or take a few minutes—enormous swathes of the Internet were down or interestingly broken. Sites taken down included CNN, The Guardian, The New York Times, PayPal, and Spotify, among many more—including The Verge, which resorted to reporting via Google Docs during the duration of the outage.</p>\n<div><blockquote><p>Vast chunks of the internet are offline, including The Verge. Until we’re back, we’re reporting to you live out of Google Docs. Here’s what we know so far about the outage: <a href=\"https://t.co/4b1p2qhYif\">https://t.co/4b1p2qhYif</a></p>— The Verge (@verge) <a href=\"https://twitter.com/verge/status/1402210406328942592?ref_src=twsrc%5Etfw\">June 8, 2021</a></blockquote></div>\n<p>The underlying problem was an outage at <a href=\"http://fast.ly\">Fastly</a>, one of the world's largest Content Delivery Network providers—the entire service went down due to a misconfiguration that it had deployed to all of its Points Of Presence (POPs) globally. As a result, sites using Fastly for content delivery came up with various errors dependent on the local site configuration. Some sites delivered relatively uninformative plain HTTP 503 (Service Unavailable) pages, while others returned errors such as \"Fastly error: unknown domain.\"</p>\n<p>The \"unknown domain\" error gives us some tantalizing hints to the nature of the problem, which is more than Fastly's own status updates have so far. This tells us that Fastly's network was up and its Varnish cache servers were answering requests, but its cache configuration—the Varnish Control Language files that point the cache server to the back-end servers supplying the original content—was almost certainly either missing or garbled.</p></div><p><a href=\"https://arstechnica.com/?p=1771582#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1771582&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"817beb48b31e860a6e3d35ee2f9fc3d2a69d075a2034279d0aed74b0610778a5","category":"Tech"}