{"title":"Ex‐post evaluation of fishery management policies on wild fisheries production in northern Cabo Verde: An example of mackerel scad (Decapterus macarellus, Carangidae)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15861?af=R","date":1722396514000,"content":"<h2>Abstract</h2>\n<p>Government policies for marine fisheries have been implemented in Cabo Verde since its independence in 1975, with the aim to prevent overexploitation of wild fish species and promote sustainable fishing practices. Nonetheless, only minor amendments have been made to the legal harvesting size, considering biological sciences. This study, therefore, adopted a transdisciplinary approach to assess the political, ecological, and social dimensions of current fishery policy interventions applicable to the commercially valuable pelagic species <i>Decapterus macarellus</i> (mackerel scad). An ex-post analysis of relevant fishery management policies targeting <i>D. macarellus</i> was conducted. This was supplemented by strengths, weaknesses, opportunities, and threats (SWOT) analysis conducted by key fisheries stakeholders. Stocks assessment was conducted on catch data before (2003–2007) and after (2017–2021) the policy interventions. This was followed by a survey of 175 fishery sector actors to understand their perception of the policies, compliance challenges, and recommendations for reforms. Results showed that although the mackerel scad landing size comparably increased, landing catches were on the decline. Most fisheries stakeholders are aware of the policies implemented and acknowledge their favorable developmental outcomes. However, certain gaps exist in the national marine fisheries policies. For example, there is an absence of follow-up research on implemented fishing policies and a lack of monitoring data on the ecology and distribution of the mackerel scad, which hinders our understanding of the exact causes of the reported continual decrease in catches. There is, therefore, a need for regular monitoring of the environmental health of coastal and marine habitats to inform prioritization and/or reformulation of policy intervention measures to achieve intended conservation outcomes.</p>","author":"Katelene da Cruz Delgado, \nIsimemen Osemwegie, \nAnibal Delgado Medina, \nAlciany Nascimento da Luz, \nZaneta Kubik, \nEssetchi Paul Kouamelan","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"817c2b7730bacb71fcc2947400cae6310bb3056abaeb242aa81e314afff74f62","category":"Environment"}