{"title":"Resisting to Exist &amp; the Subtle Invisible Protest:  6 Solution Focused Tactics about Challenging Behaviour","link":"https://www.preprints.org/manuscript/202405.0578/v1","date":1715243827000,"content":"According to Young Minds [1] ‘everyone gets angry sometimes’. Their website offers a number of de-escalating strategies, including staying calm, managing responses and setting limits to help young people who most deem resistive. Yet, Young Minds are not alone because such logical advice is ubiquitous in the literature about challenging behaviour despite the fact that in our experience when faced with high states of arousal, most young people tend to act first and deal with the consequences later. It’s not that they are stupid or non-caring, but they are human capable of great feats as well as stupidity. The same is true for any claims that solution focused (SF) conversations can put right the several decades of psychological theory suggesting resistance requires logic and better cognition. By giving the correct thinking skills, young people will walk away from risk, avoid physical confrontation, handle challenging situations like logical thinkers, and generally discount that the process of growing up is part of the challenge. It is with this in mind that over recent years in our current SF practice (with staff group supervision) we have examined the concept of ‘resistance’ and how it can be put to use as a process of collaboration. To do this, we have revisited SF theory that preoccupied many of its pioneers during the 1980’s and 1990’s and attempted to make it useful for the early 2020’s for professionals having conversations with young people, who, in traditional models, are labelled challenging. We want to introduce key differences of solution focused practice and how Anita started to formulate a 6D-SF model (details, dynamics, dimensions, dispositions, dislocations, descriptions) for contemplating how groups of professionals relate to each other and are triggered by challenging behaviour. We do not claim to have proof, logic or exactness on our side, but we’re happy to suggest how our resistance mirrors what many of the staff teams feel and describe when working through their work.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"817ff2be54df2df6dd1f4acedc200b7cc18726aca83a05fbda1c38b4cff0a829","category":"Interdisciplinary"}