{"title":"Enhanced Chaotic Pseudorandom Number Generation Using Multiple Bernoulli Maps with FPGA Optimizations","link":"https://www.preprints.org/manuscript/202409.2051/v1","date":1727337581000,"content":"Chaos theory is widely used in the design of Pseudorandom Number Generators (PRNG), which produce number sequences with statistically uniform distributions and random appearance. However, certain methods for implementing chaotic maps can lead to dynamic degradation of the generated number sequences. To solve such problem, we develop a method for generating pseudo-random number sequences based on multiple one-dimensional chaotic maps. In particular, we introduce a Bernoulli chaotic map that utilizes function transformations and constraints on its control parameter, covering complementary regions of the phase space. This approach enables the generation of chaotic number sequences with a wide coverage of phase space, increasing uncertainty in the number sequence generation process. Moreover, by incorporating a scaling factor and a sinusoidal function, we develop a robust chaotic map, referred to as the Sine-Multiple Modified Bernoulli Chaotic Map (SM-MBCM), which ensures a high level of randomness, validated through statistical mechanics analysis tools. Using the SM-MBCM, we propose a Chaotic PRNG (CPRNG) and evaluate its quality through correlation coefficient analysis, key sensitivity tests, statistical and entropy analysis, key space evaluation, linear complexity analysis, and performance tests. Furthermore, we present an FPGA-based implementation scheme that leverages equivalent MBCM variants to optimize the electronic implementation process. Finally, we compare the proposed system with existing designs in terms of throughput and key space.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8197a827d0a6d86454c1645d8011a2416f72c0755e2fbdede6e3888b91b6a8d6","category":"Interdisciplinary"}