{"title":"China’s carbon pollution now surpasses all developed countries combined","link":"https://arstechnica.com/?p=1763109","date":1620319520000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/04/GettyImages-159911352-800x514.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/04/GettyImages-159911352.jpg\">Enlarge</a> (credit: <a href=\"http://www.gettyimages.com/license/159911352\">Getty | AFP</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Carbon pollution from China's bustling, coal-intensive economy last year outstripped the carbon pollution of the US, the EU, and other developed nations combined, making up a whopping 27 percent of all greenhouse gas emissions worldwide.</p>\n<p>As China’s economy has grown in the last 30 years, so too have its emissions. While pollution from developed countries has largely been flat since 1990, it has more than tripled in China. The country’s soaring emissions and stable population mean that its per capita emissions have grown quickly, too. At 10.1 tons per person, emissions are just below the 10.5 ton average of the 37-nation Organization for Economic Cooperation and Development, or OECD.</p>\n<p>The US still leads the world in per capita emissions, at 17.6 tons per person, according to Rhodium Group's numbers, though President Joe Biden has pledged that the US will <a href=\"https://arstechnica.com/tech-policy/2021/04/biden-says-us-will-halve-carbon-emissions-by-2030/\">halve emissions by 2030</a>. The other developed countries in the report include all 27 current EU member states: the UK, Australia, Canada, Chile, Iceland, Israel, Japan, Korea, Mexico, New Zealand, Norway, Switzerland, and Turkey.</p></div><p><a href=\"https://arstechnica.com/?p=1763109#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763109&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"81999a471f4f8523ee013aa0433d04dd6f662968d496f3feec2067f1ee079a7c","category":"Tech"}