{"title":"Cloudflare เริ่มเช็คว่าเป็นคนหรือบ็อตแบบไร้ CAPTCHA ตรวจสอบด้วย USB Key แทน","link":"https://www.blognone.com/node/122682","date":1620996754000,"content":"<div><div><div><p>ในฐานะบริษัทจัดการทราฟฟิกอินเทอร์เน็ตรายใหญ่ Cloudflare ย่อมเจอปัญหาบ็อตในปริมาณมหาศาล ที่ผ่านมาโซลูชันการแยกมนุษย์จริงๆ ออกจากบ็อตคือ <a href=\"https://en.wikipedia.org/wiki/CAPTCHA\">CAPTCHA</a> แต่ก็ต้องแลกมาด้วยความน่ารำคาญของมนุษย์ที่ต้องมายืนยันว่าตัวเองเป็นมนุษย์อยู่บ่อยๆ</p>\n<p>เมื่อปีที่แล้ว Cloudflare <a href=\"https://www.blognone.com/node/115758\">เพิ่งประกาศย้ายจาก reCAPTCHA ของกูเกิลมาเป็น hCAPTCHA ด้วยเหตุผลเรื่องเงิน</a> ล่าสุดบริษัทออกมาประกาศนโยบายว่า พยายามจะไปไกลกว่านั้นด้วยการยกเลิก CAPTCHA อย่างถาวร เพราะมองว่าน่าเบื่อ ยุ่งยาก สิ้นเปลือง</p>\n<p>โซลูชันใหม่ที่ Cloudflare เสนอมาเป็นอย่างแรกคือ ให้ยืนยันตัวตนด้วยคีย์ USB (เช่น Yubikey) แทน กระบวนการทำงานคือผู้ใช้ต้องยืนยันความเป็นเจ้าของคีย์อันนั้นก่อน ผ่านเว็บไซต์ที่เรียกว่า Cryptographic Attestation of Personhood (ในที่นี้คือ cloudflarechallenge.com) จากนั้น Cloudflare จะสร้างคีย์ดิจิทัลขึ้นมาเก็บไว้ในระบบ เพื่อจำว่าเจ้าของคีย์นี้เป็นมนุษย์จริง</p>\n<p>หลังจากนั้นเมื่อผู้ใช้เข้าเว็บไซต์ที่รองรับมาตรฐาน  Web Authentication (WebAuthn) Attestation ของ W3C (ซึ่งเบราว์เซอร์รองรับเกือบหมดแล้ว) จะสามารถส่งคำขอมายัง Cloudflare เพื่อยืนยันว่าเจ้าของคีย์เป็นมนุษย์จริงๆ</p>\n<p>ตอนนี้ระบบของ Cloudflare ยังรองรับคีย์ USB เพียงบางรุ่นเท่านั้น บริษัทบอกว่าจะค่อยๆ ขยายไปยังอุปกรณ์อื่นต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/44d122e03c13c70b298903a08e527de0.png\" /></p>\n<p>ที่มา - <a href=\"https://blog.cloudflare.com/introducing-cryptographic-attestation-of-personhood/\">Cloudflare Blog</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cloudflare\">Cloudflare</a></div><div><a href=\"/topics/authentication\">Authentication</a></div><div><a href=\"/topics/captcha\">CAPTCHA</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"81a0f874b69bc97d778f823fce724cfca2492558d49e65ec432e272452783c2c","category":"Thai"}