{"title":"Considering Uncertainty of Historical Ice Jam Flood Records in a Bayesian Frequency Analysis for the Peace‐Athabasca Delta","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2022WR034377?af=R","date":1708934400000,"content":"<h2>Abstract</h2>\n<p>The Peace-Athabasca Delta in Alberta, Canada has numerous perched basins that are primarily recharged after large ice jams cause floods (an ecological benefit). Previous studies have estimated that such large floods are likely to decrease in frequency under various climate projections. However, there is a sizable uncertainty range in these predicted flood probabilities, in part due to the short 60-year systematic record that contained few large ice jam floods. An additional 50 years of historical data are available from various sources, with expert-interpreted flood categories; however, these categorizations are uncertain in magnitude and occurrence. We developed a Bayesian framework that considers magnitude and occurrence uncertainties within a logistic regression model that predicts the annual probability of a large flood. The Bayesian regression estimates the joint distribution of parameters describing the effects of climatic factors and parameters that describe the probability that historical flood magnitudes were recorded as large (or not) when a truly large (or not) flood occurred. We compare four models for hindcasting and projecting large ice jam flood probabilities in future climates. The models consider: (a) historical data uncertainty, (b) no historical data uncertainty, (c) only the systematic record, and (d) the systematic record with a different model. Neglecting historical data uncertainty provides inaccurate estimates, while using only the systematic record provides wider prediction intervals than considering the full record with uncertain historical data. Thus, we demonstrate that including uncertain historical information can effectively extend the record length and make flood frequency analyses more accurate and precise.</p>","author":"Jared D. Smith, \nJonathan R. Lamontagne, \nMartin Jasek","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"81b8a2f9411f9971330611790baa4f1013682e5898ddd4650310f38e7256f321","category":"Environment"}