{"title":"Downstream Nutrient Concentrations Depend on Watershed Inputs More Than Reservoir Releases in a Highly Engineered Watershed","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035590?af=R","date":1710764025000,"content":"<h2>Abstract</h2>\n<p>In this study, we characterized the impact of regulatory water releases relative to watershed inputs on the quality of receiving waters to identify if and how managed releases could be scheduled to mitigate nutrient export and downstream water quality impairment. We specifically investigated freshwater flow partitioning to the Caloosahatchee River and Estuary (CRE) from a large managed lake, Lake Okeechobee, and the CRE's upstream watershed, the C-43 basin, in southwest Florida (USA). A water balance was developed to identify dominant freshwater inflow sources (i.e., Lake Okeechobee vs. watershed inputs) over time. From the water balance, analyses of historical trends were performed to detect changes in freshwater inflow contributions to the CRE. Further, seasonal and annual concentration variations and long-term concentration-discharge (C-Q) relationships were analyzed to better understand biogeochemical and hydrological processes in the system in relation to freshwater source. Since 1966, we found the duration and magnitude of flows from the C-43 basin were higher than those from Lake Okeechobee releases. However, recent increases in the annual water volume and proportion of inflow coming from Lake Okeechobee to the CRE were observed. The C-Q analysis revealed that nitrate and ammonium concentrations in the CRE were responsive to changes in discharge, while total phosphorus and orthophosphate concentrations were chemostatic. While modifications to the Lake Okeechobee operation schedule could potentially mitigate downstream inorganic nitrogen loading, this potential is limited by complex, seasonal C-Q relationships and confounding effects from surrounding watersheds.</p>","author":"L. R. Montefiore, \nD. Kaplan, \nE. J. Phlips, \nE. C. Milbrandt, \nM. E. Arias, \nE. Morrison, \nN. G. Nelson","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"81c39c562c512f71820da093b436c20f41d1d4b780a0989c255a76c49ef99a60","category":"Environment"}