{"title":"Increasing biochar diversity promotes the impacts of plant diversity on remediating cadmium in soil","link":"https://academic.oup.com/jpe/article/doi/10.1093/jpe/rtae068/7729504?rss=1","date":1723075200000,"content":"<span><div>Abstract</div>Biochar is a promising material for soil remediation. However, most studies testing the roles of biochar in soil remediation have considered the use of single types of biochar, and the role of biochar diversity, as well as its interaction with species diversity of plant communities, has rarely been considered. We hypothesize that biochar diversity can influence the impacts of plant diversity on soil remediation. We grew grassland communities consisting of three or six plant species in cadmium (Cd)-contaminated soil mixed with one, two or four types of biochar, with no grassland community and no biochar addition as the controls. Without plant communities or with communities consisting of three species, total Cd was significantly lower in the soil mixed with four types of biochar than in the soil without biochar or mixed with one or two types of biochar. With communities consisting of six species, total Cd decreased with the increasing number of biochar types. Without biochar addition, soil total Cd was not influenced by species richness, but with biochar addition, it was lower in the presence of communities with six species than in the absence of plant communities irrespective of how many types of biochar were added. Also, soil total Cd was lower in the presence of communities with six than with three plant species when two or four types of biochar were added. Our study indicates that increasing biochar diversity can promote the impact of plant diversity on remediating soil contaminated by heavy metals such as Cd.</span>","author":"","siteTitle":"Journal of Plant Ecology Current Issue","siteHash":"532f26bf1ba0f166bd6491390ce5cd237faca477af455cac49d2509f7b38d556","entryHash":"81ce37af6db6fe40c4565d8f3fa84dcb3323b9781a49a9546605f864cfbb5eec","category":"Environment"}