{"title":"Variation of air pollutants during COVID-19 lockdown phases in the mega-city of Lahore (Pakistan); Insights into meteorological parameters and atmospheric chemistry","link":"http://link.springer.com/10.1007/s11600-023-01208-z","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>The Coronavirus Disease 2019 (COVID-19) broke out in 2019 and spread rapidly to the whole world. Lockdown policies were adopted by Pakistan to control the rapid dispersion of COVID-19. These lockdown measures restricted economic and human activities immensely to lower number of the COVID-19 cases and associated illnesses. Additionally, air pollution and meteorological conditions also play a crucial role in the spread of COVID-19 in Pakistan. Therefore, this study mainly focuses on the changes in concentrations of selected air pollutants (coarse particulate matter (PM<sub>10</sub>), fine particulate matter (PM<sub>2.5</sub>), sulphur dioxide (SO<sub>2</sub>) and Ozone (O<sub>3</sub>)) along with meteorological parameters (relative humidity, temperature, and wind speed) during March 1 to April 25 from 2018 to 2020. The present study acquired available air pollutants data from Environmental Protection Department, meteorological parameters from the wunderground, vertical profiles and backward trajectories from National Oceanic and Atmospheric Administration (NOAA) portal. Ground-based observations showed a decline in the mean concentrations of PM<sub>2.5</sub> and PM<sub>10</sub> by 51.3 and 65.7% and an increase in concentrations of O<sub>3</sub> and SO<sub>2</sub> by 82.6 and 21.1%, respectively in 2020 compared to those measured in the year 2019. During phase 4 (lockdown) of 2020, PM<sub>10</sub> and PM<sub>2.5</sub> decreased by 88.0 and 82.9% compared to 2019 and 2018, respectively. Moreover, the SO<sub>2</sub> concentrations were reduced by 59.1% in phase 3 of 2020 compared to those measured in 2019. In phase 4, O<sub>3</sub> concentrations decreased by 29.4% in 2020 compared to 2018 but no reduction was observed in O<sub>3</sub> compared to 2019. The findings indicate a decline in concentrations of air pollutants during the lockdown due to the restrictions on human, transportation, commercial and industrial activities. These results would be important for policymakers to develop some air pollutant control action plans to mitigate air pollution problems in Pakistan.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"81cfa03966f897609289a76c81fefcabb31de17bf513fc04d8fac3326f4b08d1","category":"Environment"}