{"title":"Assessing Misophonia in Young Adults: Prevalence and Psychometric Validation of the MisoQuest Questionnaire","link":"https://www.preprints.org/manuscript/202407.0955/v1","date":1720690443000,"content":"Misophonia, characterized by strong emotional reactions to specific sounds, poses significant challenges, particularly in academic settings. This study investigates the prevalence and psychometric properties of the MisoQuest, a tool designed to assess misophonia, in a sample of 549 high school and university students (Mean age = 23.2 years, SD = 9.3). The sample included 285 females, 260 males, and four individuals who did not disclose their gender. Using a predefined cutoff score of 61 on the MisoQuest, 4.5% of the participants were identified as positive for misophonia. Psychometric evaluation of the MisoQuest involved both exploratory factor analysis (EFA) and confirmatory factor analysis (CFA). EFA results indicated a dominant single-factor structure, with the first factor explaining the majority of the variance. The scree plot further supported this unidimensional model. CFA confirmed the single-factor structure, with most items showing factor loadings between 0.36 and 0.58. Despite some non-significant factor loadings, the model indicated a substantial relationship between the items and the underlying factor. The high internal consistency of the MisoQuest was demonstrated by a Cronbach’s alpha coefficient of 0.93. These findings are consistent with previous studies on misophonia prevalence and support the use of the MisoQuest as a reliable assessment tool. Given the observed prevalence and the significant impact of misophonia on students’ academic and social lives, early identification and targeted support are essential. This study contributes to the understanding of misophonia in young adults and underscores the need for further research and tailored interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"81cf786a44fef0a856a789d96d64d084fd6a2d1a1513addbae75f5eae55603ff","category":"Interdisciplinary"}