{"title":"297 Digestibility, blood parameters, and skin barrier function of dogs fed hydrolyzed salmon proteins","link":"https://academic.oup.com/jas/article/102/Supplement_3/109/7757031?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Conventional pet food diets include meat meals as the primary source of protein. However, hydrolysate proteins have been used due to their improved digestibility and decreased allergic response. Novel sources of salmon protein hydrolysate have been developed, but limited information demonstrating the nutritional value of these proteins is available. Therefore, the objectives of this study were to evaluate apparent total tract digestibility (ATTD), blood parameters, and skin barrier function of adult dogs fed two novel sources of salmon hydrolysate protein. This study was approved by the Institutional Animal Care and Use Committee of the University of Illinois. The novel protein sources included one salmon protein hydrolysate concentrate (SPHC) and one salmon protein hydrolysate isolate (SPHI). Three diets were formulated to meet adult dog nutrient requirements. The first diet contained chicken meal (control), but the second and third diets contained one of the novel ingredients as the main source of protein. Thirty dogs were assigned to the experimental diets in a complete randomized design, with 10 dogs per treatment. The experimental period lasted 90 d after a 15-d adaptation period to the control diet. Fecal samples were collected during the last 5 d of the study and were used to calculate ATTD. Blood and skin parameters were collected on d 0, 45, and 90. Blood was analyzed for serum chemistry and complete blood count for 42 metabolites, and skin was examined for barrier function by evaluating hydration, sebum, and transepidermal water loss on the right and left pinas, upper back, and inguinal locations. The statistical model to assess ATTD included treatment as fixed effect and dog as random effect, while for blood and skin parameters, dog was the random effect, and day was included as a repeated measure to determine the effect of treatment by day. Results demonstrated that ATTD of dry and organic matter was greater (<span>P</span> &lt; 0.05) in SPHI than in the control diet, and ATTD of crude protein and gross energy were greater (<span>P</span> &lt; 0.05) in both salmon hydrolysates compared with the control diet. Creatinine was greater (<span>P</span> &lt; 0.05) in SPHI, alanine aminotransferase was greater (<span>P</span> &lt; 0.05) in SPHC, and cholesterol was less (<span>P</span> &lt; 0.05) in SPHC on d 45 and 90 compared with baseline measurements. Skin hydration in the inguinal location was greater (<span>P</span> &lt; 0.05) in SPHC than in control and SPHI diets. In conclusion, diets containing salmon hydrolysate were more digestible when compared with control diet. Blood parameters were within the normal range for healthy adult dogs, although reduced cholesterol was observed in the SPHC diet over time, which can be beneficial for dogs suffering from hypercholesteremia. In addition, skin barrier function was improved in the inguinal location for the SPHC diet.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"81d75d7f21efd912f50816900feaa34cb009c51be8c2c3638688b1fad53aaf74","category":"Environment"}