{"title":"Save Mac storage space by cleaning out abandoned log files","link":"https://www.macworld.com/article/342559/save-mac-storage-space-by-cleaning-out-abandoned-log-files.html","date":1617967680000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>Whenever I have a mystery to uncover about lost storage space, I fire up <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daisydiskapp.com&amp;xcust=1-1-342559-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">DaisyDisk</a>, a disk-usage visualization app. While the $9.99 price tag may seem steep for its purpose of plotting out what is occupying your drives&rsquo; storage, I find it invaluable in tracking down the giant sucking sound of lost space. It&rsquo;s also a lot cheaper than buying a larger drive. (There&rsquo;s also a free trial that lets you test out many features.)</p>\n\n\n\n<p>Recently, my MacBook Air&rsquo;s 512GB of storage was running low. With just 50GB left, I start to get nervous about running out of space when the system needs to write temporary files to disk or I need to transfer large files. DaisyDisk revealed the culprit: an ocean of abandoned log files.</p>\n\n\n\n<p>Log files are critical troubleshooting tools, but little else. When you contact technical support, you&rsquo;re often asked to find and send a log file, or enable a feature in software to dump extra debugging information to a log that you can send the next time a problem occurs. I know many a bug that was squashed because tech support could check my logs and figure out the description I gave them of what occurred.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1500\" height=\"1104\" src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/daisydisk-log-files.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"DaisyDisk Mac\" class=\"wp-image-100061117\" srcset=\"https://www.macworld.com/wp-content/uploads/2021/04/daisydisk-log-files.jpg 1500w, https://www.macworld.com/wp-content/uploads/2021/04/daisydisk-log-files.jpg?resize=300,221 300w, https://www.macworld.com/wp-content/uploads/2021/04/daisydisk-log-files.jpg?resize=768,565 768w, https://www.macworld.com/wp-content/uploads/2021/04/daisydisk-log-files.jpg?resize=1024,754 1024w\" sizes=\"(max-width: 1500px) 100vw, 1500px\"><figcaption><p>DaisyDisk showed that I had over 5GB of useless Stamps.com log files on my Mac.</p></figcaption></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>But a lot of software is terrible at log purging. These apps or processes write log files and then abandon them willy-nilly. One thousand 1MB files adds up. My laptop is the end migration of many, many years of previous laptops, and there were nearly 25GB of log files, none of them useful in any way to my current needs. Stamps.com left a 5GB footprint of miscellany behind, and Adobe scattered years of multi-megabyte files that serve no discernable purpose.</p>\n\n\n\n<p>You can find most of your log files in your home directory at <code>~/Library/Logs</code>. In the Finder, choose <em>Go &gt; Go To Folder</em> and paste that path in. You can then sort by size to see the biggest culprit, and sort by date to find ancient log files no longer needed. If a log files hasn&rsquo;t been touched by software in a few days or longer, you can typically just delete it. If it&rsquo;s an enormous file and has a recent date stamp, I suggest making sure the associated app isn&rsquo;t running and then you can delete the log file.</p>\n\n\n\n<h2 id=\"ask-mac-911\">Ask Mac 911</h2>\n\n\n\n<p>We&rsquo;ve compiled a list of the questions we get asked most frequently along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we&rsquo;re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a> including screen captures as appropriate, and whether you want your full name used. Not every question will be answered, we don&rsquo;t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div></body></html>","author":"Glenn Fleishman","siteTitle":"Save Mac storage space by cleaning out abandoned log files","siteHash":"7a9a8da0e8e6a43803aa866c0197fa8e79a4667986e16f7141ac638ad86c3a05","entryHash":"81ddea92b8cca3cb4499aeb16be7ccf3cdc4dac165c56b8eb10e8a9fa83aaabb","category":"Apple"}