{"title":"A protocol to isolate, identify, and verify glucose- or carbohydrate-binding receptors","link":"https://academic.oup.com/biomethods/article/doi/10.1093/biomethods/bpae045/7696318?rss=1","date":1718755200000,"content":"<span><div>Abstract</div>Sensing, transport, and utilization of glucose is pivotal to the maintenance of energy homeostasis in animals. Although transporters involved in mobilizing glucose across different cellular compartments are fairly well known, the receptors that bind glucose to mediate its effects independently of glucose metabolism remain largely unrecognized. Establishing precise and reproducible methods to identify glucose receptors in the brain or other peripheral organs will pave the way for comprehending the role of glucose signaling pathways in maintaining, regulating, and reprogramming cellular metabolic needs. Identification of such potential glucose receptors will also likely lead to development of effective therapeutics for treatment of diabetes and related metabolic disorders. Commercially available biotin or radiolabeled glucose conjugates have low molecular weight; therefore, they do not provide enough sensitivity and density to isolate glucose receptors. Here, we describe a protocol to isolate, identify, and verify glucose-binding receptor/s using high molecular weight glucose (or other carbohydrate) conjugates. We have produced 30 kDa glucose– (or other carbohydrate–) biotin–polyacrylamide (PAA) conjugates with mole fractions of 80:5:15% respectively. These conjugates are used with biotin-streptavidin biochemistry, In-cell ELISA, and surface plasmon resonance (SPR) methods to isolate, identify, and verify glucose- or carbohydrate-binding receptors. We first demonstrate how streptavidin-coated magnetic beads are employed to immobilize glucose–biotin–PAA conjugates. Then, these beads are used to enrich and isolate glucose-binding proteins from tissue homogenates or from single-cell suspensions. The enriched or isolated proteins are subjected to mass spectrometry/proteomics to reveal the identity of top candidate proteins as potential glucose receptors. We then describe how the In-cell ELISA method is used to verify the interaction of glucose with its potential receptor through stable expression of the receptor <span>in-vitro</span>. We further demonstrate how a highly sensitive SPR method can be used to measure the binding kinetics of glucose with its receptor. In summary, we describe a protocol to isolate, identify, and verify glucose- or carbohydrate-binding receptors using magnetic beads, In-cell ELISA, and SPR. This protocol will form the future basis of studying glucose or carbohydrate receptor signaling pathways in health and in disease.</span>","author":"","siteTitle":"Biology Methods and Protocols Current Issue","siteHash":"69c994dba77628d461517adf354c299799d03c68fbf0494d0a5619d40a95f351","entryHash":"81de7477a94de1150d42deb999e0402d20adb82f1e9876fa91b2eeba30afc1a5","category":"Environment"}