{"title":"Hydrological Responses to Climate Change and Land-Use Dynamics in Central Asia's Semi-arid Regions: An SWAT Model Analysis of the Tuul River Basin","link":"http://link.springer.com/10.1007/s41748-023-00367-9","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Central Asia's semi-arid regions, vital for sustaining vast populations and diverse ecosystems, are under heightened environmental stress. Among these regions, the Tuul River Basin, home to over half of Mongolia's population, characterizes the challenges posed by contemporary environmental shifts. This basin, a hub in Mongolia's socio-economic landscape, is grappling with rapid climate change, surging population growth, urban expansion, and evolving land-use and cover patterns. Recognizing the crucial role of water resources in driving development in such regions, diligent monitoring, and sustainable strategies for water resource management are essential. However, comprehensive studies based on extensive application of hydrological modeling systems of probable Land-Use/Land-Cover Change (LULCC) and climate change (CC) impacts in this basin's hydrological regimes are still well unexplored. In this context, we assessed the individual and combined effects of projected LULCC and CC on hydrological regimes in the upper part of the Tuul River basin. Projected temperature and precipitation from ensemble outputs of ten different Global Climate Models (GCMs) under three Representative Concentration Pathways (RCP2.6, RCP4.5, and RCP8.5) in three different periods (near future, medium future, and far future) were forced in calibrated Soil and Water Assessment Tool (SWAT) model to investigate the individual and combined effects of LULCC and CC on hydrological regimes in the upper part of Tuul river basin. Under different RCP2.6, RCP4.5, and RCP8.5 scenarios, temperature increases varied between 1.0 and 1.5 °C in the near future, 1.3 and 3.1 °C in the medium future, and 1.2 and 5.6 °C in the far future, whereas precipitation changes varied between 2.8 and 12.1% in the near future, 6.2 and 30.7% in the medium future, and 4.9 and 52.4% in the far future. Simulated results of the SWAT model based on 19 scenarios showed a significant impact of projected LULCC and CC on hydrological components in the upper part of the Tuul River basin compared to the baseline scenario that includes (a) only CC and combined LULCC and CC scenarios revealed that an increasing tendency in evapotranspiration, whereas a decreasing tendency in soil water content, surface runoff, lateral flow, groundwater flow, and water yield under RCP2.6, RCP4.5, and RCP8.5 in three different periods, (b) only LULCC scenario showed that an increasing tendency in surface runoff, groundwater flow, and water yield, while a decreasing tendency in evapotranspiration, soil water content, and lateral flow under RCP2.6, RCP4.5, and RCP8.5 in three different periods. These increasing and decreasing tendencies of each hydrological components aligned well with RCP8.5 &gt; RCP4.5 &gt; RCP2.6 emission scenarios, consistent with the increases in projected temperature and precipitation in three different periods. This study's findings call for an urgency in adaptive water resource management in the Tuul River Basin. The study shows that by understanding possible water patterns under different LULCC and CC scenarios, policymakers can develop effective and efficient strategies for protecting water resources and supporting sustainable growth in the region.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"81e1e80eab3b869e707278eb467d359c95c125de5096cac18dd7ff1e5ed01313","category":"Environment"}