{"title":"Has the century-old mystery of Antarctica’s “Blood Falls” finally been solved?","link":"https://arstechnica.com/?p=1952810","date":1689181629000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/bloodfalls1-800x530.jpg\" alt=\"Blood Falls seeps from the end of the Taylor Glacier into Lake Bonney\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/bloodfalls1.jpg\">Enlarge</a> <span>/</span> Blood Falls seeps from the end of the Taylor Glacier into Lake Bonney. Scientists believe a buried saltwater reservoir is partly responsible for the discoloration, which is a form of reduced iron. (credit: NSF/Peter Rejcek/Public domain)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In 1911, an Australian geologist named Thomas Griffith Taylor was exploring a valley in Antarctica when he stumbled upon a strange waterfall. The meltwater flowing from beneath the glacier that now bears Taylor's name turns a deep red upon coming into contact with the air, earning the site the moniker \"Blood Falls.\" Various hypotheses have been proposed over the last century to explain the strange phenomenon. A team of scientists now thinks they've finally found the answer: tiny nanospheres rich in iron, silica, calcium, aluminum, and sodium, among other elements.</p>\n<p>But why has solving this mystery taken more than a century? It seems the nanospheres are amorphous materials, meaning they lack a crystalline structure and hence eluded prior analytical methods looking for minerals because they are not, technically, minerals, according to a <a href=\"https://www.frontiersin.org/articles/10.3389/fspas.2022.843174/full\">recent paper</a> published in the journal Frontiers in Astronomy and Space Science. That might seem like an odd choice of journal for this study, but the Blood Falls at Taylor Glacier is a so-called \"analogue\" site for astrobiologists and planetary scientists keen to learn more about how life might evolve and thrive in similar inhospitable environments elsewhere in the universe.</p>\n<p>\"With the advent of the Mars Rover missions, there was an interest in trying to analyze the solids that came out of the waters of Blood Falls as if it was a Martian landing site,\" <a href=\"https://hub.jhu.edu/2023/06/26/blood-falls-mystery/\">said co-author Ken Livi</a> of Johns Hopkins University. \"What would happen if a Mars Rover landed in Antarctica? Would it be able to determine what was causing the Blood Falls to be red? It's a fascinating question and one that several researchers were considering.\"</p></div><p><a href=\"https://arstechnica.com/?p=1952810#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1952810&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"81e2045d6a3a520a7f7149f9a611466fdc4df8910ba630900430b5729536544f","category":"Tech"}