{"title":"iFixit tears down a McDonald’s ice cream machine, demands DMCA exemption for it","link":"https://arstechnica.com/?p=1964112","date":1693339703000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Screenshot-2023-08-29-at-2.59.49-PM-800x403.png\" alt=\"iFixit staff taking apart Taylor ice cream machine\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/Screenshot-2023-08-29-at-2.59.49-PM.png\">Enlarge</a> <span>/</span> The McDonald's ice cream machine is a relatively simple machine. It has a compressor, a motor, churning and agitating elements, and a series of circuit boards that keep service contracts flowing. (credit: iFixit / YouTube)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>McDonald’s soft-serve ice cream machines are regularly broken, and it’s not just your perception. When repair vendor and advocate iFixit was filming a video about the topic, it checked <a href=\"https://mcbroken.com/\">tracking map McBroken</a> and found that 34 percent of the machines in the state of New York were reported inoperable. As I write this, the nationwide number of broken machines is just above 14 percent.</p>\n<p>To improve the nation’s semi-frozen milk fat infrastructure, iFixit has done two things. One, as <a href=\"https://www.404media.co/activists-petition-government-for-right-to-hack-mcdonalds-mcflurry-machines-to-repair-them/\">first reported by 404 Media</a>, is to join with interest group Public Knowledge to petition the Copyright Office for an exemption allowing people to fix commercial equipment, such as McDonald’s ice cream machines and other industrial kitchen equipment, without fear of reprisal under <a href=\"https://www.copyright.gov/1201/2018/\">Section 1201 of the DMCA</a>.</p>\n<p>The other is to obtain one of the Taylor ice cream machines used by McDonald’s franchises, tear it down, and marvel at how it could be so unreliable.</p></div><p><a href=\"https://arstechnica.com/?p=1964112#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964112&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"81e9daec329bac69cce56757b1aa23bf8a8ae1b0246f65ddc8de9788660a0e65","category":"Tech"}