{"title":"Apple Shares Deadlines for Ordering Holiday Gifts","link":"https://www.macrumors.com/2023/11/16/apple-holiday-shipping-deadlines-2023/","date":1700150839000,"content":"Alongside its <a href=\"https://www.macrumors.com/2023/11/16/apple-black-friday-shopping-event-gift-cards/\">Black Friday bonus gift card announcement</a>, Apple has also released its <a href=\"https://www.apple.com/shop/gifts/holiday-shipping\">holiday shipping guide</a> in the United States and other countries that outlines deadlines for customers looking to order gifts online for arrival by December 24.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/apple-holiday-deadlines-2023.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nUnlike in some recent years, Apple appears to have ample stock of all of its main products as we head into the holiday season, with Apple currently saying that most products can be ordered up until December 21 while still receiving delivery in time for Christmas.\r<br />\n\r<br />\nFor items that can be engraved through Apple, two additional days are generally required, meaning orders must be placed by December 19. The lone exception to that is <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, which must be ordered by December 12 if you wish to have them engraved. Finally, physical gift cards must be ordered by December 19.\r<br />\n\r<br />\nWhile these deadlines are for shipments of orders placed through Apple's online store, the company says customers may still be able to get orders in time after the deadline if items are in stock and customers choose Apple Pickup or 2-hour delivery from a local <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a>.\r<br />\n\r<br />\nDeadlines in other countries vary somewhat, such as a flat December 21 deadline for all products (including engraved ones) in <a href=\"https://www.apple.com/de/shop/gifts/holiday-shipping\">Germany</a> and a flat December 22 deadline in the <a href=\"https://www.apple.com/uk/shop/gifts/holiday-shipping\">United Kingdom</a>.\r<br />\n\r<br />\nApple may update the deadlines on these pages in the coming weeks as it assesses product availability, so it pays to keep an eye on it and ensure you order in plenty of time to receive your items in time for the holidays.\r<br />\n\r<br />\nApple's <a href=\"https://www.macrumors.com/2023/11/03/apple-2023-holiday-return-policy/\">extended return policy</a> is also now in effect, allowing items purchased in most countries between November 3 and December 25 to be returned through January 8, 2024. Select countries have a longer window with items purchased between November 4 and January 6 able to be returned through January 20, 2024.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-store/\">Apple Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/16/apple-holiday-shipping-deadlines-2023/\">Apple Shares Deadlines for Ordering Holiday Gifts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-shares-deadlines-for-ordering-holiday-gifts.2411158/\">Discuss this article</a> in our forums<br /><br />","author":"Eric Slivka","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"81ea2b04cec5aea9eb318e5bfecdfe95ffcfde008041766fb5746020c0d7f467","category":"Apple"}