{"title":"PSVI-14 Effects of poor maternal nutrition during gestation on first generation offspring oxidative status in skeletal muscle","link":"https://academic.oup.com/jas/article/102/Supplement_3/530/7757555?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Poor maternal nutrition (restricted- and over-nutrition) during gestation negatively impacts offspring pre- and post-natal growth. Previous work has identified decreased muscle mass and increased adiposity, leading to poor quantity and quality of animal protein products. Alterations in oxidative status, such as the imbalance of antioxidant activity and the production of free radicals, can result in oxidative stress damaging lipid membranes, proteins, and DNA. Changes in oxidative status may contribute to the poor growth outcomes observed in offspring from poorly nourished dams. Therefore, the objective of this research was to determine the effects of poor maternal nutrition during gestation on the oxidative status in offspring skeletal muscle in sheep. We hypothesized that offspring of restricted- and over-fed ewes would have decreased antioxidant activity and increased products of oxidative stress in skeletal muscle. To test this hypothesis, multiparous Dorset ewes (n = 46) pregnant with twins were fed 100% (CON), 60% (RES), or 140% (OVER) of total nutrient requirements (NRC) from d 30 of gestation until parturition. Following parturition, ewes were fed a control diet throughout lactation. At d 282 of age semitendinosus (STN) samples were collected from rams at necropsy, and at d 284 of age muscle biopsies from STN were collected from ewes. Data were analyzed in SAS using PROC MIXED with fixed effects of maternal diet and offspring sex. Data were considered significant at <span>P</span> ≤ 0.05. The activity of the endogenous antioxidant superoxide dismutase (SOD) was decreased by 45% and 33% in RES and OVER offspring, respectively, compared with CON (<span>P</span> ≤ 0.01). Offspring sex did not alter STN SOD activity (<span>P</span> = 0.35). Muscle glutathione peroxidase (GPx) activity was decreased in RES offspring by 20% compared with CON (<span>P</span> ≤ 0.04), but neither differed from OVER offspring (<span>P</span> ≥ 0.24). Ewes had 34% greater GPx activity compared with rams (<span>P</span> &lt; 0.0001). Offspring from RES and OVER ewes had 77% and 87% greater concentrations of malondialdehyde (MDA), a marker of lipid peroxidation, when compared with CON (<span>P</span> &lt; 0.0001). Ewes had 29% greater MDA concentrations compared with rams (<span>P</span> = 0.05). Protein carbonyl (PC), a marker of protein oxidation, concentrations were 36% and 38% greater in RES and OVER offspring, respectively, compared with CON (<span>P</span> ≤ 0.01). The decrease in antioxidant activities and increase in products of protein and lipid oxidation in offspring from poorly nourished dams suggests dysregulation in skeletal muscle oxidative status that may contribute to the negative consequences observed in offspring. Future work should focus on determining the mechanistic role of skeletal muscle oxidative stress in the decreased quantity and quality of animal protein products and identifying potential strategies to mitigate alterations in oxidative status as a result of poor maternal nutrition during gestation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"81ee1d4f923bd2b998ef46db8a5855f109dc64bf02a1a11968b30d0cfcc78574","category":"Environment"}