{"title":"Stage 19 is Bazball","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/stage-19-is-bazball","date":1689969034000,"content":"\n      <p><span>Bazball is the style of play currently favoured by the England cricket team in Test matches, a free-flowing, aggressive, positive, assertive strategy which serves up long-suffering fans with an intoxicating cocktail of fast scoring and high risk. </span></p>\n<div></div>\n<p><span>It’s an elusive term, and Brendon McCullum, the coach after whom the term was named, has disowned it as simplistic. There is more, he insists, to the England team’s strategy than chasing runs and trying to hit sixes. (North American </span><i><span>Rouleur</span></i><span> readers: I do not have time to explain cricket here, just know that two teams score points, known as ‘runs’, and the team with the most runs wins.) However, Bazball is definitely a thing, though it’s more a state of mind than a specific tactic. It involves playing with freedom and without fear, avoiding draws and trying to win, rather than not to lose, which are two different things. The team refuse to let a game stagnate. The England player Stuart Broad summed up one of McCullom’s team talks as: “Let’s rush towards the danger.”</span></p>\n<p><span>Bazball is one-day or T20 cricket, transposed into a five-day Test match. But if you were to imagine the same thing in cycling, perhaps using typical one-day race or even track event strategies in a stage race, you still wouldn’t be anywhere near the anarchic, chaotic free-for-all of stage 19 of the 2023 Tour de France to Poligny, won by Matej Mohorič in a narrow sprint against Kasper Asgreen, just ahead of Ben O’Connor. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00228_1024x1024.jpg?v=1689968972\" alt=\"Tour de France 2023 stage 19\" /></div>\n<p><span><em>Zac Williams / SWPix</em><br /><br />I’ve been watching the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> for 38 years, and I’m struggling to think of another stage that was as dynamic as this one. Every stage I can remember watching settled, at some point, into a pattern, even the incredible Alpe d’Huez stage of the 2011 Tour, which was very short and saw Alberto Contador attacking from the gun; even stage 12 of this year’s race, in which the break took 80km to form. Settling into a pattern is what stages of the Tour do: a combination of peloton groupthink and the instinct to self-preservation that manifests in the desire to ride as efficiently as possible means that groups naturally coalesce. Yes, one group may still be riding extremely hard to chase down another group if circumstances dictate, but the cyclists of the Tour seem to crave the simplicity of a pattern. Maybe it makes the physical pain easier to deal with if there are fewer other variables to deal with.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/gino-gives-us-that-extra-bit-of-motivation-matej-mohoric-continues-bahrain-victorious-tour-of-emotions\"><strong><em>Read more: 'Gino gives us that extra bit of motivation': Matej Mohorič continues Bahrain-Victorious' Tour of emotions</em></strong></a></p>\n<p><span>However, stage 19 did not ever settle into a pattern. It unfolded with a fin-de-siècle desperation that would have looked liberating, had it not been born of the knowledge that with only a big mountain stage and the Champs-Élysés to go, this would be the last chance for many teams to leave a significant mark on the race. Everybody knew the break would go, so everybody tried to go in the break. And so it was that after 50km, the break still had not gone.</span></p>\n<p><span>At 120km to go, Julian Alaphilippe attacked and was immediately followed by Victor Campenaerts, Tiesj Benoot, Jack Haig, Mads Pedersen, Nils Politt and Matteo Trentin. This strong septet immediately started working well together and only Georg Zimmerman and Warren Barguil, in a desperate sprint for their wheels, managed to latch on to them.</span></p>\n<p><span>Within 10km, the nine riders at the front had a minute’s lead. They represented nine different teams, were all very good riders, and seemed to be happy to make good their escape and deal with the fact that Mads Pedersen was far and away the best sprinter, later. That should have been that. It looked like the pattern was set: group of nine to fight out the stage, big lead, peloton comes in 10 minutes down.</span></p>\n<p><span>However, the race didn’t settle. EF-EasyPost, Israel-Premier Tech and Uno-X put riders at the front of the peloton and started to chase in what initially looked like a futile effort. It took a long time for them to make an impression, but the lead stabilised at a minute for 30km, then started drifting down after Politt broke his chain and fell out of the front group. The fact that the break wasn’t going was affecting politics in the peloton – while EF, Israel and Uno-X chased, Jasper Philipsen, so disappointed at not having won yesterday in a stage that suited him, was lurking in the bunch and it suited him very well for the break to be kept in check. So much so that at the intermediate sprint at 75km to go, only 30 seconds behind the break. Philipsen and several other riders continued their effort through the sprint and pulled a big group clear of the peloton. It took another 10km but they caught the leading riders, Alaphilippe et al, with 65,5km to go, making a group of 36 at the front.</span></p>\n<p><span>But this group, in turn, didn’t settle and Campenaerts attacked just 200m later with Simon Clarke, while even in the peloton, Intermarché started an abortive chase. The leading pair built a lead of almost a minute over the next 30km, but then Clarke cramped and had to slow, while Kasper Asgreen, Ben O’Connor and Matej Mohorič attacked out of the group and closed Campenaerts down. There were only 30km to go, and the stage was into its endgame without ever having really developed out of its opening. The politics were fascinating: Philipsen, Pedersen and Dylan Groenewegen, three of the best sprinters in the Tour, had put themselves into the chasing group behind the leading trio, but were comparatively isolated and the others may have been reluctant to tow them up. In the end, the group split into two, but while Philipsen made the first of these, even with team-mate Mathieu van der Poel also there, they were unable to catch Mohorič, O’Connor and Asgreen. </span></p>\n<p><span>Stage 19 was Bazball cycling. It was unsafe, liberating and exhilarating to watch. The cyclists of the 2023 Tour de France, shattered by almost three weeks of intense racing, refused to let the stage stagnate and rushed towards the danger.<br /><br /><em>Cover image: Pauline Ballet / ASO</em><br /></span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"81f06fee830470a98538f28837bc554a6e37d7d5c68f6506741bbfc1cd4b830a","category":"Cycling"}