{"title":"Conduction velocity, G-ratio, and extracellular water as microstructural characteristics of autism spectrum disorder","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301964","date":1713362400000,"content":"<p>by Benjamin T. Newman, Zachary Jacokes, Siva Venkadesh, Sara J. Webb, Natalia M. Kleinhans, James C. McPartland, T. Jason Druzgal, Kevin A. Pelphrey, John Darrell Van Horn, For the GENDAAR Research Consortium </p>\r\n\r\nThe neuronal differences contributing to the etiology of autism spectrum disorder (ASD) are still not well defined. Previous studies have suggested that myelin and axons are disrupted during development in ASD. By combining structural and diffusion MRI techniques, myelin and axons can be assessed using extracellular water, aggregate g-ratio, and a new approach to calculating axonal conduction velocity termed aggregate conduction velocity, which is related to the capacity of the axon to carry information. In this study, several innovative cellular microstructural methods, as measured from magnetic resonance imaging (MRI), are combined to characterize differences between ASD and typically developing adolescent participants in a large cohort. We first examine the relationship between each metric, including microstructural measurements of axonal and intracellular diffusion and the T1w/T2w ratio. We then demonstrate the sensitivity of these metrics by characterizing differences between ASD and neurotypical participants, finding widespread increases in extracellular water in the cortex and decreases in aggregate g-ratio and aggregate conduction velocity throughout the cortex, subcortex, and white matter skeleton. We finally provide evidence that these microstructural differences are associated with higher scores on the Social Communication Questionnaire (SCQ) a commonly used diagnostic tool to assess ASD. This study is the first to reveal that ASD involves MRI-measurable <i>in vivo</i> differences of myelin and axonal development with implications for neuronal and behavioral function. We also introduce a novel formulation for calculating aggregate conduction velocity, that is highly sensitive to these changes. We conclude that ASD may be characterized by otherwise intact structural connectivity but that functional connectivity may be attenuated by network properties affecting neural transmission speed. This effect may explain the putative reliance on local connectivity in contrast to more distal connectivity observed in ASD.","author":"Benjamin T. Newman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"81f584850996f0054c0c9de98e12072d629a331f5072d2eac8fec661d9004cf3","category":"Interdisciplinary"}