{"title":"A weekend in hell: experience all of Paris-Roubaix 2023 with GCN+","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-weekend-in-hell-experience-all-of-paris-roubaix-2023-with-gcn","date":1680770894000,"content":"\n      \n<p><span><em>This is a promotional feature with<span> </span><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\">GCN+</a></em></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GCN_-Logos_RED__GCN-Plus-Black_100-thin_100x100.jpg?v=1657272884\" /></span></p>\n<p><span>There are very few races where it’s advisable to watch every single kilometre, right from the flag drop.</span></p>\n<p><span>But <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> is one of those few. The Queen of the Classics. The Hell of the North. Whatever you want to call it, this might be a Saturday or Sunday in Hell to the women and men riding, but to cycling fans across the world it’s the best weekend of the year.</span></p>\n<p><span>How can anyone not love Roubaix? The five-star cobbles that are more like boulders; the cacophony of noise inside the condensed Arenberg Forest; the ding-ding-ding of the finish lap bell in the velodrome; and the cobbled trophy and the shower photos afterwards. </span> </p>\n<p><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Spring-Endemic-970x250.jpg?v=1677259760\" alt /></span></a></p>\n<p><span>It’s been adored since the first men’s race in 1896, and the spectacle has only been enhanced since the inaugural women’s race in 2021, itself a watershed moment for the sport. </span></p>\n<p><span>It’s impossible to forget the poignant, resonating words of the first female winner Lizzie Deignan: “I raced today with the power of generations of women who were denied the opportunity to battle for this Monument, and with my daughter in my heart who I hope will never face the same barriers they had to.”</span></p>\n<p><span>Deignan will not be racing the 2023 edition of Paris-Roubaix Femmes avec Zwift (she is still coming back after giving birth to her second child, Shea) but her Trek-Segafredo team are going hunting for their third win in as many editions, and you can watch it live, exclusively and ad-free on GCN+. Italian Elisa Longo Borghini, the victor in 2022, will lead the American team, and she will rightly be declared one of the favourites. Check out the full startlist, route and parcours on the GCN+ app to see who’s in contention.</span></p>\n<p><span>Stopping the might of SD Worx – the dominant force by quite some way this spring - will be the task bestowed on all of the women’s peloton, but they can take heart from the fact that throughout the century-plus history of the men’s race, shock winners are far more common than in other races.</span></p>\n<p><span>Take, for example, Mathew Hayman’s remarkable triumph in 2016, or Johan Vansummeren’s against-the-odds win in 2011 with a flattening tyre. You could even throw occasional GCN+ pundit and father of Elynor and Zoe, Magnus Bäckstedt, into the mix, the Swede winning in 2004.</span></p>\n<p><span>You see, that’s the thing with Roubaix: you just have no idea who will prevail. The 260km of road and 29 cobbled sectors tires out every single one of the men; 145km and 17 sections of </span><i><span>pavé</span></i><span> does the same for the women. Come the end, it’s often not the fastest, the most talented or the most powerful who wins, but the one who still has a smidgen of energy left. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/cy22-pr-js-01-0050.jpg?v=1680616370\" alt /></span></p>\n<p><span>Roubaix destroys the body. It also requires team mechanics to work harder than any other day of the year. The amount of on-the-fly adjustments and replacements that are required is impossible to count, despite the industry pouring in so much effort, energy and money into creating Roubaix-proof frames, wheels and tyres. GCN+‘s pause, rewind, skip forward and resume function comes into use quite often when watching Roubaix, viewers keen to see that slip, that fall or that mechanical just once more.</span></p>\n<p><span>Occasionally, as in 2021’s delayed race, the weather makes the racing on the cobbles and through narrow farm roads even more treacherous - and epic. Search GCN+’s archives of races and watch not only Deignan’s historic win in 2021, but also Sonny Colbrelli in the men’s race. The images of mud-splattered and soaked-through cyclists became instant icons. </span></p>\n<p><span>While there, catch-up on the rest of the cobbled Classics that have preceded the grand finale. </span><span>Can Jumbo-Visma reassert their stranglehold on the 2023 men's spring season after missing out to Tadej Pogačar in Flanders last week?</span> Will Soudal - Quick-Step, in the shadows for two years, come to the fore and grab a first win here since an ageing Philippe Gilbert did in 2019?</p>\n<p><span>All those questions, and many more, will be mused over this coming weekend. The women’s race will be available to watch on GCN+ on Saturday and the men’s on Sunday, but if you cannot dedicate two full afternoons on the sofa, fear not, for you can watch the races on any smart device through the GCN+ app.</span></p>\n<p><span>Guiding us through the drama and chaos will be the best commentators in the business, and co-commentators and pundits who will impart their knowledge and expertise. After each race, the World of Cycling show will discuss the biggest talking points (there will be many) and relive the best moments (there will also be many). </span></p>\n<p><span>Every year a new chapter stacked full with extraordinary stories is added to the Paris-Roubaix annals. For less than the cost of one Roubaix-specific tyre, you can get an annual subscription to GCN+ and watch the spectacle - as well as a year’s worth of cycling - unfold from wherever you want.</span></p>\n<p><span>The Queen of the Classics is finally upon us.</span></p>\n\n<p><span><em><span>You can catch all of Paris-Roubaix Femmes avec Zwift and Paris-Roubaix and the other upcoming Classics by <strong><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\">subscribing to GCN+ here.</a> </strong>(Territory Restrictions May Apply).</span></em><span> </span></span></p>\n<p> </p>\n<p><a href=\"https://welcome.globalcyclingnetwork.com/spring?utm_medium=endemic&amp;utm_source=rouleur&amp;utm_campaign=spring\" target=\"_blank\"><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Spring-Endemic-970x250.jpg?v=1677259760\" alt /></span></a></p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"81fea05d1d0cf07556f7f9ac56e86398ac232b590eaaeb99d3759dfdfcc30694","category":"Cycling"}