{"title":"Flood Management on GIS-Based Multicriteria Evaluation in Developing Countries : A Systematic Literature Review","link":"https://www.preprints.org/manuscript/202405.1163/v1","date":1715928796000,"content":"The objective of this study is to investigate the correlation between the advancement of flood research and the utilization of Geographic Information Systems (GIS) and multi-criteria evaluation techniques, both from a theoretical and practical standpoint. Additionally, this research seeks to identify potential ways to address the aforementioned relationship. The present study employs a thorough literature review methodology. In accordance with the PRISMA (Preferred Reporting Items for Systematic Reviews and Meta-Analyses) methodology, a total of 28 papers were identified and included in the analysis, as they fulfilled the predetermined criteria. The findings of the study indicate that current research pertaining to the utilization of Geographic Information Systems (GIS) and multicriteria evaluation in flood control mostly centers around five key areas, namely natural factors, technical considerations, institutional factors, socio-economic factors, and financial factors. However, the aforementioned studies have identified specific areas of focus, including natural factors pertaining to climate, technical factors related to infrastructure, institutional factors concerning flood management strategies, socio-economic factors associated with demographics, and financial factors pertaining to financial obligations. However, there is a limited amount of existing research that specifically addresses flood management in developing nations. Therefore, it is anticipated that this study can serve as a valuable resource for future research endeavors, particularly in informing decision-making processes pertaining to the establishment of priorities in flood control plans. The primary subject of this study pertains to flood management occurrences within developing nations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"81ff5f3172cb7c5bda4787baf22aea39903db2168687447104416ff2bb93d242","category":"Interdisciplinary"}