{"title":"Demystifying Heavy Metals and Physicochemical Characteristics of Groundwater in a Volcano-Tectonic Region of Middle Awash, Ethiopia, for Multipurpose Use","link":"https://www.preprints.org/manuscript/202405.0472/v1","date":1715157285000,"content":"This study investigates the concentrations of physicochemical and heavy metal contaminants in the groundwater of the Middle Awash Basin, Ethiopia, to inform targeted water management strategies. A total of 32 groundwater samples were collected from 16 stations via piezometers and boreholes at the end of both the dry (June 2021) and wet (October 2021) seasons. Utilizing Inductively Coupled Plasma Mass Spectrometry (ICP-MS), Atomic Absorption Spectroscopy (AAS), and in situ metering, 22 physicochemical and 24 heavy metal parameters were analyzed. The data revealed significant levels of contamination; notably, sample GW11 had extraordinarily high concentrations of total dissolved solids (10,826 mg/L), strontium (908 µg/L), molybdenum (802.4 µg/L), zinc (6060 µg/L), and electrical conductivity (15,645 µS/cm), while GW12 exhibited elevated levels of aluminum (2615 µg/L), zinc (4446 µg/L), and arsenic (117.2 µg/L). Contaminants such as arsenic, vanadium, gallium, lithium, rubidium, chromium, manganese, copper, and zinc were found enriched in groundwater near Lake Beseka, influenced by agricultural runoff from sugarcane plantations and agro-industry activities. Over half of the groundwater sources were unsuitable for drinking, posing significant health risks to local communities that rely heavily on these sources due to limited access to clean surface water. The findings emphasize the urgent need for comprehensive groundwater management and remediation plans in the Middle Awash region to ensure safe and sustainable water use, particularly addressing the variation in contamination levels influenced by Lake Beseka. These measures are critical to protect public health and support local development in the face of ongoing environmental and anthropogenic pressures.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"820371b409c37f0ce64e17afb599bedf1d826036c7ddcb07201537c58a87408d","category":"Interdisciplinary"}