{"title":"How to block spam calls on your iPhone","link":"https://www.macworld.com/article/232957/how-to-block-spam-calls-on-your-iphone.html","date":1625783105000,"content":"\n<div>\n<section><div></div></section><p>Spam calls have gotten <em>way</em> out of hand. It used to be that you could simply ignore anything with a caller ID of “unknown caller” or a distant or toll-free area code. Today, thanks to automated systems that spoof phone numbers, scammers and spammers can call you from numbers that look like they’re from right in your neighborhood. Many people now get several spam calls every day, half of them about their car’s extended warranty.</p>\n\n\n\n<p>Fortunately, your iPhone has a couple features that can help combat this nuisance, and they’re really easy to use.</p>\n\n\n\n<h2>Silence Unknown Callers</h2>\n\n\n\n<p>First, open Settings. Then tap on <em>Phone</em>. </p>\n\n\n\n<p>Scroll down and tap on <em>Silence Unknown Callers</em>. On the next page you’ll see a description of the feature and a toggle to turn it on.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/iphone-silence-callers.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>With this feature enabled, your iPhone will use “Siri intelligence” to determine whether a call is from a known number or not. If a phone number is found in your Contacts, Messages, Mail, or recent outgoing calls, it comes through as usual.</p>\n\n\n\n<p>If it’s <em>not</em> found there, whether it’s a real phone number or an unlisted number, it will go straight to voice mail without ever even ringing (even silently). In that sense, the setting is not <em>quite</em> properly named…calls are more than merely “silenced.”</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/iphone-call-spam-voicemail.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Send those spam calls straight to voicemail without ever ringing!</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>You may find that, while this cuts way down on unwanted calls, you miss some calls you were expecting. You may get in touch with a repair person on the web, only to find later that they tried to call you and your phone didn’t ring, for example. If you don’t want to send these sorts of calls straight to voicemail, disabling the feature is as easy as flipping the switch back off again.</p>\n\n\n\n<h2>Spam-filtering apps</h2>\n\n\n\n<p>You can do more than just silently send a call to voicemail. With a phone spam filtering app, you can make effectively eliminate most of the spam calls you receive, even if they’re from unique spoofed numbers. You’ll have to download an app from the App Store: popular options include <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/robo-shield-spam-call-blocker/id1454299300&amp;xcust=1-1-232957-0-0-0&amp;sref=https://www.macworld.com/feed\">Robo Shield</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/robo-shield-spam-call-blocker/id1454299300&amp;xcust=1-1-232957-0-0-0&amp;sref=https://www.macworld.com/feed\">Truecaller</a>, and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/robokiller-block-spam-calls/id1022831885&amp;xcust=1-1-232957-0-0-0&amp;sref=https://www.macworld.com/feed\">Robokiller</a>. These apps tend to have subscription fees, but it might be worth a few bucks a month to save your sanity.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/iphone-call-filtering.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>Apple</p></div>\n\n\n\n<p>After installing such an app, open <em>Settings</em> and tap on <em>Phone</em>. You’ll see a new option: <em>Call Blocking &amp; Identification</em>. Tap that, and then enable your call filtering application. Note that the app itself may have several setup steps as well, but it will walk you through them when you install it.</p>\n\n\n\n<h2>Block a number</h2>\n\n\n\n<p>Sometimes you just want to completely stop a number from coming in altogether, and there’s a way to do that too. Just tap the <em>“I” info</em> button next to the number and scroll down to <em>Block this Caller</em>. Then tap <em>Block Contact</em> on the next screen. If you decide you want to unblock any numbers you’ve blocked, head over to Settings, then <em>Phone</em>, and <em>Blocked Contacts</em>. Inside you’ll see all of the numbers you’ve blocked. Tap <em>Edit</em> in the top right corner and you’ll be able to remove any number that’s by pressing the red <em>(-) minus</em> button and then <em>Unblock</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/iphone-block-caller.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>IDG</p></div>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"82115629dd905b303a37989c1d4a6c5ac9d991cdd3e792bde81f90821e2ee11b","category":"Apple"}