{"title":"Apple is chasing a new financial partner to keep Apple Card running smoothly","link":"https://www.macworld.com/article/2161325/apple-card-replace-goldman-sachs.html","date":1701700031000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last week we covered the news that Goldman Sachs, Apple’s financial partner for the Apple Card and Apple Card Savings services, badly wants to be <a href=\"https://www.macworld.com/article/2156996/apple-card-goldman-sachs-breaking-up.html\">released from its contract</a>. The arrangement has reportedly cost the bank billions of dollars in losses, and it now wants to get out of the consumer market altogether. Which leaves Apple with a problem.</p>\n\n\n\n<p>On the one hand, Goldman Sachs is locked into its contract for another five years, and Apple could choose to hold the firm to those terms if it wants. But it would prefer to find a more enthusiastic replacement, not least because the service has had its share of problems in terms of engineering and customer service. And it’s understood that Cupertino has therefore offered terms to release Goldman Sachs from its obligations early. (Although not <em>that</em> early; it will take more than a year to wrap things up.)</p>\n\n\n\n<p>In other words, Apple is currently in the market for a new financial services partner… and as Bloomberg pundit Mark Gurman explains in the latest installment of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-12-03/apple-to-drop-goldman-sachs-for-apple-card-chase-bank-is-ideal-replacement-lppjbe7z&amp;xcust=1-1-2161325-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, the prospect may counterintuitively be more appealing to the financial services community now than it was when the Goldman Sachs deal was originally inked. Yes, the role’s incumbent has discovered that being linked to Apple Card involves burning a lot of cash. But the service is also established now, with a large user base and masses of publicity, much of it good. When Apple was headhunting its launch partner, the downsides would have been known (albeit perhaps underestimated) but the project’s chances of success were not. That’s less of an issue now.</p>\n\n\n\n<p>This means some of the banks that passed back in 2019 may now be interested, and one of these has widely been touted as a favorite to replace Goldman Sachs: American Express. Aside from being involved in negotiations four years ago, the firm has been approached more recently; as we wrote last week, “The WSJ says… American Express was approached last year by Goldman about taking over the business. AMEX was apparently concerned about a number of details, and it’s not known if those talks continued or not.” That could yet flower into something more substantial.</p>\n\n\n\n<p>But Gurman, in his outline of the situation, names another firm as his pick: Chase. This is because Chase is already closely tied to Apple in a number of areas, including working on Cupertino’s Ultimate Rewards program, acting as a key early partner for Apple Pay, and “storing” some of Apple’s cash on hand. As Gurman points out, Chase also has the advantage of being connected to MasterCard, which means Apple Card wouldn’t need to switch to a different platform. (American Express uses its own platform.)</p>\n\n\n\n<p>There’s still plenty of time for this saga to unfold, but for now, the Apple Card service will continue to run as before.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8212564a8f68456c764338c9e5859d84591bf9f13328efb7f6ab766532012188","category":"Apple"}