{"title":"With Pre-Orders Open in Less Than 24 Hours, There's Still a Lot We Don't Know About the Apple Watch Series 7","link":"https://www.macrumors.com/2021/10/07/what-we-dont-know-apple-watch-series-7/","date":1633619974000,"content":"Pre-orders for the new <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a> open in less than 24 hours. Despite that, Apple has still not shared basic information that customers would logically need ahead of pre-ordering any product, including information as fundamental as pricing.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/Apple_watch-series7_lineup-01_09142021.jpg\" />\r\n<br />\r\nThe ‌Apple Watch Series 7‌ has been shrouded in a cloud of mystery ever since its announcement at Apple's event last month. At its announcement, Apple didn't provide any dates for availability for the new watch, simply stating it will be available \"later this fall\" before announcing Friday, October 8 for pre-orders and Friday, October 15 for availability.\r\n<br />\r\n\r\n<br />\r\n<h3>Lineup Pricing</h3>\r\n<br />\r\nEven after Apple shared Series 7 availability dates, the company continues to withhold basic pricing information from the public about the watch. Apple says the Series 7 starts at $399, which includes the lowest possible configuration of the watch; a 41mm aluminum case with only GPS, no cellular connectivity, and a fluoroelastomer sport band. \r\n<br />\r\n\r\n<br />\r\nNo other information, including for Series 7 configurations with cellular functionality, larger case size, or different finishes such as stainless steel, has been made available by Apple. The Series 7 features larger displays and larger case sizes as a result, so it's not clear if beyond the starting price which it shares with the Series 6, Apple has increased the cost of the Series 7. \r\n<br />\r\n\r\n<br />\r\n<h3>Apple Watch Studio</h3>\r\n<br />\r\nEven three days after Series 7 pre-order and availability dates were made public, Apple has not yet updated its Apple Watch Studio, a section on its online store that allows customers to choose different combination options to find their perfect Apple Watch. The Apple Watch Studio lists the Apple Watch Series 6, the Apple Watch Series 3, and the <a href=\"https://www.macrumors.com/roundup/apple-watch-se/\">Apple Watch SE</a>, with no Series 7. An update to the Apple Watch Studio would provide customers with information on pricing for their preferred case, size, and band configuration.\r\n<br />\r\n\r\n<br />\r\nApple didn't respond to our request for comment on whether the Apple Watch Studio will be updated with the Series 7 before pre-orders go live, leaving us to believe it will only go live once pre-orders start tomorrow.\r\n<br />\r\n\r\n<br />\r\n<h3>Technical Specifications</h3>\r\n<br />\r\nBeyond flashy marketing material on its website, Apple has not provided technical specifications for the Series 7. A document intended for retail employee use obtained by <em>MacRumors</em> earlier last month offered us the only known list of technical specifications for the Series 7, including revealing that while it uses an \"S7\" branded chip, it retains the same CPU as last year's Series 6. \r\n<br />\r\n\r\n<br />\r\nSome customers enjoy looking at the specific technical specifications before they purchase a product, and those customers are sadly out of luck for the ‌Apple Watch Series 7‌ at the time.\r\n<br />\r\n\r\n<br />\r\n<h3>Compared to Other Apple Watches</h3>\r\n<br />\r\nAs is logical, Apple lets customers compare older models of its products, such as iPhones, <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and Macs, against each other, providing a bird-eye view of the technical differences between different generation products. That, however, can't be said for the Series 7; as for the compare page for the Apple Watch, the Series 7 is not listed.\r\n<br />\r\n\r\n<br />\r\n<h3>Trade-in Values</h3>\r\n<br />\r\nMany customers get the latest Apple Watch by trading in their older Apple Watch for a certain amount of value and then paying whatever is leftover. Customers of the Series 6 looking to trade-in their watch for the new Series 7, are, unfortunately, out of luck, as Apple has not provided a trade-in value for the Series 6, nor has it updated the trade-in value of older models.\r\n<br />\r\n\r\n<br />\r\n<h3>Conclusion</h3>\r\n<br />\r\nThe lack of information ultimately leaves customers entirely in the dark about how much their preferred ‌Apple Watch Series 7‌ configuration will cost and its technical specifications, hours ahead of when Apple hopes customers log on to order its latest and greatest Apple Watch. Pre-orders for the Series 7 open tomorrow at 5:00 a.m. PDT and a full list of when pre-orders go live in different time zones can be found <a href=\"https://www.macrumors.com/2021/10/07/when-to-pre-order-apple-watch-series-7-time-zones/\">here</a>. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/apple-watch-series-7/\">Apple Watch Series 7</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/07/what-we-dont-know-apple-watch-series-7/\">With Pre-Orders Open in Less Than 24 Hours, There's Still a Lot We Don't Know About the Apple Watch Series 7</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/with-pre-orders-open-in-less-than-24-hours-theres-still-a-lot-we-dont-know-about-the-apple-watch-series-7.2315840/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nQWXhHBhMdY:g0z9JnlKctw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nQWXhHBhMdY:g0z9JnlKctw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/nQWXhHBhMdY\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8214abdc55091451a9101e3ee92877fbe37169e0fac73b5cd76f94b0d7f9fd46","category":"Apple"}