{"title":"Integrating Lidar Canopy Height Models with Satellite-Assisted Inventory Methods: A Comparison of Inventory Estimates","link":"https://academic.oup.com/forestscience/article/70/1/2/7450335?rss=1","date":1700784000000,"content":"<span><div>Abstract</div>Forest management inventories are essential tools for planning, sustainability assessment, and carbon accounting. The operational difficulties and cost to obtain field measurements for large landscapes is often prohibitive. Remote sensing offers an alternative to field-based sampling but has often been used in an area-based approach. The most recent remote sensing techniques can produce a census-level tree list, but these data are monetarily and computationally expensive. This research examines two remote sensing approaches compared with field-based methods to build forest management inventories for the same forest land base in north central Idaho, USA. Estimates of volume, density, and height were compared by stand and at the total ownership level. Incorporating lidar data reduced overall error and bias when compared with using satellite data alone. The low-pulse density of the lidar data used in this analysis resulted in underprediction of density for high-density stands. Species predictions proved challenging, with accuracies of 66% at the stand level and 54% at the individual tree level. Further research to refine species predictions in complex environments is encouraged.<strong>Study Implications</strong>: Forest management inventory estimates derived from satellite and lidar data are compared with estimates derived from field-based sampling. When satellite and lidar data are combined, the error is reduced and total forest volume estimates are comparable with those obtained from a field-based sample. Further research on improving species predictions for areas with multiple tree species and complex topography is needed. These methods are best suited for forest managers who desire to continue using their existing inventory software, need a complete inventory in 1–2 years, and want to avoid the large cost for a more intensive, census-level lidar inventory.</span>","author":"","siteTitle":"Forest Science Current Issue","siteHash":"05e2fee9ae6a27cd288c89ae75adf607539d339849a171c4fab1eaa2f11b4162","entryHash":"821ae905654bc5ccbeb84dda73453e2dd2b4dcd526317b3c9c47228e5e17a866","category":"Environment"}