{"title":"Apple Shares Heartwarming 'Fuzzy Feelings' Holiday Ad","link":"https://www.macrumors.com/2023/11/21/apple-fuzzy-feelings-holiday-ad/","date":1700587130000,"content":"Apple today shared its annual holiday-themed ad, which is titled \"Fuzzy Feelings.\" This year, the mini film focuses on an animator who is working on a holiday-themed video in the spare moments she has off from her office job.\r<br />\n\r<br />\n<div></div>\r<br />\nThe stop motion video stars her curmudgeonly boss, who is shown chastising her for being late, giving her last minute work, and generally being miserable. She finds an outlet in depicting him in uncomfortable situations, such as being shocked by Christmas lights or covered by snow while standing out on the street.\r<br />\n\r<br />\nAfter her seemingly horrible boss hands out handmade holiday gifts, she sees another side of him, and changes her animation to something much more positive.<blockquote>Creativity has the power to change the way we see each other, and the world. Sometimes, seeing things through a new lens can make all the difference. You make the holidays.</blockquote>Apple shares a unique holiday ad each year, and these ads often win awards. Apple accompanied the video with a behind-the-scenes look at how it was filmed.\r<br />\n\r<br />\n<div></div>\r<br />\nAccording to Apple, it was created using an <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> Max and then edited on the <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-ads/\">Apple Ads</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/21/apple-fuzzy-feelings-holiday-ad/\">Apple Shares Heartwarming 'Fuzzy Feelings' Holiday Ad</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-shares-heartwarming-fuzzy-feelings-holiday-ad.2411625/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"821ce70459b995e1e01d4fc955b97f37fc0cd00bdd6f53bca74356ae3c4295fc","category":"Apple"}