{"title":"The Role of Endogenous Beta-Endorphin in Food Intake and Glucose Homeostasis in Male and Female Mice Fed a High-Fat Diet","link":"https://www.preprints.org/manuscript/202404.0519/v1","date":1712566490000,"content":"The rates of obesity and obesity-related diseases continue to increase worldwide, classifying obesity as a global epidemic. Endogenous opioids have been implicated in influencing feeding behavior; however, the role of each opioid peptide is still only partially characterized. Therefore, we assessed the role of the proopiomelanocortin (POMC)-derived peptide beta-endorphin (β-END) in long-term high-fat diet (HFD) feeding and glucose homeostasis and assessed if sex-related differences exist in these processes. Male and female mice lacking the ability to produce β-END and their respective controls were subjected to a 12-week HFD consumption to determine the role of the opioid peptide in food intake and glucose homeostasis. Body weight and food intake were measured weekly for twelve weeks. At weeks 6 and 12, plasma glucose levels were measured using an oral glucose tolerance test. Here, we report that male β-END deficient mice gained more weight and consumed more calories than their wildtype controls; however, this difference was not observed in the female mice. Regardless of genotype, female mice consumed more calories per body weight when compared to male mice despite their smaller body weights. Moreover, our findings suggest differences in glucose homeostasis between the wildtype and knockout mice and that these were only observed at week six but not at week 12. Overall, our study suggests that endogenous β-END may play a role in controlling body weight, feeding behavior, and glucose homeostasis and that sex-related differences may exist in this regard.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"82293a77dcf8bb42d2a9a9c808fe0ac788f595e8edb6b798e25b7e1b50da4b74","category":"Interdisciplinary"}