{"title":"Racial and Ethnic Disparities in the Presentation and Outcome of Patients with Thoracic Aortic Aneurysms","link":"https://www.preprints.org/manuscript/202407.0416/v2","date":1721377015000,"content":"Thoracic aortic aneurysms (TAAs) pose critical health risks, often asymptomatic until a rupture or dissection occurs. Guidelines recommend surgical repair based on specific aortic diameters and risk factors, emphasizing the importance of early detection and intervention. Despite established clinical risk factors for early detection in TAAs, the influence of racial and ethnic disparities on TAAs remains underexplored. This study aims to provide a comprehensive summary of existing research on racial and ethnic disparities in the presentation and outcomes of TAAs. Methods: This literature review was conducted using a systematic search strategy, in order to explore racial and ethnic differences in the presentation and surgical outcomes of patients with TAAs. Results: The findings demonstrated that black patients were younger at presentation and had a higher incidence of ruptured TAAs than non-black patients. Furthermore, compared to non-black patients, black patients had higher rates of cardiac arrhythmia and COPD, as well as comorbidities such as diabetes, hypertension, and renal insufficiency. For black patients undergoing open surgery, the surgical results showed improved 5-year survival rates after repair but higher perioperative mortality rates. All-cause or in-hospital mortality did not significantly differ between the racial groups, according to four studies. Discussion: This review highlights significant racial and ethnic disparities in TAA presentation and outcomes, underscoring the need for personalized risk stratification models. Standardized racial and ethnic definitions are essential for consistent and reliable research. Future studies should focus on refining risk assessment models to enhance diagnostic and therapeutic strategies, ultimately improving patient outcomes across diverse populations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"82380b24a60aabb6b0bfb244f9e4d6cde1b213db66c69b098ddbbec885d6e99d","category":"Interdisciplinary"}