{"title":"Coccolithophore assemblage composition during the Greenland Interstadial–Stadial 20 transition and their response to the Youngest Toba Tuff (YTT) supereruption ∼74,000 years ago in the northeastern Arabian Sea","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310041","date":1727272800000,"content":"<p>by Jose Dominick Guballa, Jörg Bollmann, Katherine Schmidt, Andreas Lückge</p>\r\n\r\nHere we present a new 850-year long coccolithophore record from core SO130-289KL in the northeastern Arabian Sea that spans the Greenland Interstadial 20–Greenland Stadial 20 transition including the timing of the ∼74 ka Youngest Toba Tuff (YTT) supereruption. During the warm interstadial, the coccolithophore assemblage is characterized by <i>Gephyrocapsa oceanica</i> (41%) and <i>Florisphaera profunda</i> (30%) while the succeeding cold stadial is distinguished by the abundance of small placolith species (<i>Emiliania huxleyi</i> + <i>G</i>. <i>ericsonii</i>) (52%). However, the oldest samples of the study interval seem to show a stadial-like coccolithophore assemblage. Spectral analysis revealed an interdecadal cycle imprinted in the coccolithophore record during the interstadial that was also independently reported in other terrestrial and marine proxies. Immediately after the YTT eruption, small placoliths increased by 42% from 5% right below the YTT layer to 47% ∼1 mm above the YTT layer, while <i>G</i>. <i>oceanica</i> and <i>Helicosphaera carteri</i> increased and <i>F</i>. <i>profunda</i> decreased within the ∼1.15 cm layer representing about 8–19 years. Subsequently, the coccolithophore assemblage returned to a composition similar to the warm interstadial period before abruptly changing to a stadial composition characterized by the abundance of small placoliths about 100–130 years after the YTT eruption. Therefore, the YTT eruption had a significant impact on the overall coccolithophore assemblage but appears to have not caused the climate transition from interstadial to stadial conditions, supporting proxy and modeling data. However, the overall mechanism driving the observed changes and cyclicities remains unknown but might be related to rapid atmospheric teleconnections of North Atlantic climate variability to the low latitudes.","author":"Jose Dominick Guballa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"823aa868b0d7d19807040b6212a40623fb86dba5f2a7985f25472b3f3101be25","category":"Interdisciplinary"}