{"title":"Permian-Triassic Palynological and Paleobotanical Record from the Karoo-Equivalent Strata in the Tanga Basin, Coastal Tanzania","link":"http://link.springer.com/10.1134/S0869593824030055","date":1717200000000,"content":"<span>\n                      <h3>Abstract</h3>\n                      <p>The palynological composition of the Karoo-equivalent strata in the Tanga Basin, coastal Tanzania, is presented. Two boreholes (Kakindu-1 and Vunde-1) through the basin were palynostratigraphically studied. According to the findings, gymnosperm pollen and a few fern spores dominate the palynological assemblages. The absence of marine palynomorphs in the studied strata of the Tanga Basin attests to deposition in terrestrial environments, which is consistent with the common geologic reconstruction of the Karoo Supergroup across Africa. Two palynological intervals, the <em>Klausipollenites schaubergeri</em> and <em>Jugasporites vellicoites</em>, are recognized in the Kakindu-1 borehole; and two others, the <em>Klausipollenites schaubergeri</em>–<em>Scheuringipollenites circularis</em> and <em>Alisporites minutosaccus</em>–<em>Faunipollenites gopadensis</em> intervals, are identified in the Vunde-1 borehole. The present palynological data suggest the Permian to Triassic age for the Karoo strata in the Tanga Basin. The composition of the reported assemblage implies a single phytogeographic province across the Gondwana Supercontinent during the Permian to Triassic. Based on depositional ages determined herein, the Karoo strata in the Tanga Basin are correlated with second–fourth depositional sequences in the inland Karoo type-section of the Ruhuhu Basin of Tanzania, as well as to Ecca and Beaufort groups of the original Karoo type-section in South Africa.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"823ec5612b3a0084af56269021b1de8277f5da91a79b0b0ea31f9cafa9c98d37","category":"Environment"}