{"title":"Apple might (but probably won’t) make a cheap MacBook to take on Chromebooks","link":"https://www.macworld.com/article/2055457/apple-chromebook-cheap-macbook-education-rumor.html","date":1693932017000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple once had a strong presence in the education market (remember the <a href=\"https://www.macworld.com/article/153873/emac-2.html\">eMac</a>?). But with institutions and school districts working with tight budgets, cheap PCs and Chromebooks took over. Apple quietly lessened its efforts in education, but a report says the company may be looking to get back in.</p>\n\n\n\n<p>Citing “industry sources,” <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.digitimes.com/news/a20230904PD216/apple-low-cost-macbook-education-market-chromebook-k-12.html&amp;xcust=1-1-2055457-1-0-0&amp;sref=https://www.macworld.com/feed\">DigiTimes</a> reports that Apple is working on a “low-cost MacBook series to compete with Chromebook models in the education sector.” DigiTimes, which has a less-than-stellar track record for rumors—says this new laptop would be separate from the current MacBook Air and Pro lineups. with a “different material” for the shell and lower-cost components to match low-end Chromebook pricing.</p>\n\n\n\n<p>DigiTimes also reports that suppliers “Quanta Computer and Hon Hai Precision Industry (Foxconn) show no signs of related activity,” which could mean that production won’t start until next year. Or it could mean that the whole thing is false.</p>\n\n\n\n<h2>It could be feasible</h2>\n\n\n\n<p>There’s one good reason why this report could be feasible: cheap Chromebooks, such as the ones sold to education, break down. Every so often, a report is published about how institutions find that their Chromebook investment isn’t worth it. For example, ABC News reported just this past weekend on the durability of Chromebooks, citing one shop in New York that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.yahoo.com/gma/googles-chromebooks-thrive-us-classrooms-090152576.html&amp;xcust=1-1-2055457-1-0-0&amp;sref=https://www.macworld.com/feed\">repairs 5,000 Chromebooks monthly</a> for the 150 schools it services. In May, The Verge reported about the US Public Interest Research Group Education Fund findings that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2023/4/21/23691840/us-pirg-education-fund-report-investigation-chromebook-churn&amp;xcust=1-1-2055457-1-0-0&amp;sref=https://www.macworld.com/feed\">Chromebooks break after three years</a>.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/ASUS-Chromebook-Vibe-CX55-Flip_02.png?w=1200\" alt=\"ASUS Chromebook Vibe CX55 Flip\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/08/ASUS-Chromebook-Vibe-CX55-Flip_02.png?quality=50&amp;strip=all 1300w, https://b2c-contenthub.com/wp-content/uploads/2023/08/ASUS-Chromebook-Vibe-CX55-Flip_02.png?resize=300%2C185&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/08/ASUS-Chromebook-Vibe-CX55-Flip_02.png?resize=768%2C473&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/08/ASUS-Chromebook-Vibe-CX55-Flip_02.png?resize=1200%2C738&amp;quality=50&amp;strip=all 1200w\" width=\"1200\" height=\"738\" /><figcaption><p>Decent Chromebooks, like the ASUS Chromebook Vibe CX55 Flip, generally start at around $600, much lower than any MacBook Apple sells.</p></figcaption></figure><p>Foundry mit Material von Asus </p></div>\n\n\n\n<p>So the education market seems to be ripe for the picking. Schools need cheap devices that can last more than three years. And Apple is renowned for making quality products that last. On top of that, Macs have a reputation for being easy to administer and support by IT–which, at many public schools, is not a full-time staffed position. Add to that an inexpensive model that schools can afford and you’ve got a winner.</p>\n\n\n\n<p>There’s an obvious business benefit for Apple. Considering how Mac sales have stalled over the past couple of quarters a renewed education effort would no doubt boost those sales numbers.</p>\n\n\n\n<h2>But it’s not going to happen</h2>\n\n\n\n<p>Apple already has a device for the education market: the iPad. The company has made pledges to education programs with the iPad with a starting price of $299 and lower, and it regularly promotes the iPad as a tool for primary education. The iPad offers much of what students are looking for—good software support, a touch screen, powerful apps, and a low $329 entry price.</p>\n\n\n\n<p>But it’s not a MacBook, you might say. True, and some extremely cheap Chromebooks can sell for even less than the entry-level iPad. Apple has never made a laptop that cheap and is likely unable to start now. Even if Apple could make a laptop that sold for $500, that price may not be low enough to entice buyers in the numbers that Apple would need for it to be successful.</p>\n\n\n\n<p>Apple’s most affordable laptop is currently the M1 MacBook Air, at $999, and is often found for $750 on Amazon and other third-party retailers. And it will certainly last much longer than the three years a Chromebook does. So maybe Apple cuts the price of its older Airs like it does with the iPhone, but </p>\n\n\n\n<p>Apple does what it can to help ease the burden of cost, but educational buyers have the challenge of justifying the short-term cost for the long-term investment. It’s unlikely that Apple is ever going to play that game.</p>\n\nMacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8249989e0f184da16972a94dfa9ed02c462ad5aea564d93f8b691c43e8237be0","category":"Apple"}