{"title":"Troponin T1 silencing inhibits paclitaxel resistance and the development of breast cancer via suppressing rat sarcoma virus/rapidly accelerated fibrosarcoma 1 pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24084?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<h2>Objective</h2>\n<p>We aimed to determine the role of Troponin T1 (TNNT1) in paclitaxel (PTX) resistance and tumor progression in breast cancer (BC).</p>\n<h2>Methods</h2>\n<p>Differentially expressed genes were obtained from the GSE4298 and GSE90564 datasets. Hub genes were isolated from protein–protein interaction networks and further validated by real-time quantitative polymerase chain reaction. The effect of TNNT1 on PTX resistance was determined using cell counting kit-8, 5-ethynyl-2′-deoxyuridine, wound healing, transwell, flow cytometry assays, and subcutaneous xenografted tumor model. Western blotting was used to detect proteins associated with PTX resistance, apoptosis, migration, invasion, and other key pathways. Hematoxylin–eosin and immunohistochemical staining were used to evaluate the role of TNNT1 in tumors.</p>\n<h2>Results</h2>\n<p>After comprehensive bioinformatic analysis, we identified CCND1, IGF1, SFN, INHBA, TNNT1, and TNFSF11 as hub genes for PTX resistance in BC. TNNT1 plays a key role in BC and is upregulated in PTX-resistant BC cells. TNNT1 silencing inhibited PTX resistance, proliferation, migration, and invasion while promoting apoptosis of PTX-resistant BC cells. Tumor xenograft experiments revealed that TNNT1 silencing suppresses PTX resistance and tumor development in vivo. In addition, TNNT1 silencing inhibited the expression of proteins in the rat sarcoma virus (RAS)/rapidly accelerated fibrosarcoma1 (RAF1) pathway in vivo. Treatment with a RAS/RAF1 pathway activator reversed the inhibitory effect of TNNT1 silencing on proliferation, migration, and invasion while promoting apoptosis of PTX resistance BC cells.</p>\n<h2>Conclusion</h2>\n<p>Silencing of TNNT1 suppresses PTX resistance and BC progression by inhibiting the RAS/RAF1 pathway, which is a promising biomarker and therapeutic target for drug resistance in BC.</p>","author":"Tong Zhu, \nPeng Zhou, \nLu Yang, \nXuan Fang, \nXiangcheng Zhi","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"824c8f94b92836b4bb6ab89addd10c804aa0bc5e685258fda840ce1d718f411d","category":"Environment"}