{"title":"Latest Dune trailer gives us our best look yet at Denis Villeneuve’s epic film","link":"https://arstechnica.com/?p=1782258","date":1626983949000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/dune7-980x621.jpg\" /></div>\n        <p>\n          A vision of a mysterious woman on a desert planet.                      [credit:\n                        <a href=\"https://www.warnerbros.com/\">YouTube/Warner Bros.</a>\n                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>It seems like we've been waiting forever for the much-anticipated release of filmmaker Denis Villeneuve's adaptation of Frank Herbert's epic science fiction novel <a href=\"https://en.wikipedia.org/wiki/Dune_(2021_film)\"><em>Dune</em></a>. The movie was originally slated for a November 2020 release before moving to December, but the winter surge of COVID-19 ultimately crushed those hopes. It was rescheduled to October 1, 2021, then bumped yet again to October 22. That date still holds (fingers crossed!), and Warner Bros. just released a new three-minute trailer showcasing tons of new footage from the film.</p>\n<p>As we've reported previously (<a href=\"https://arstechnica.com/gaming/2020/04/needs-more-zendaya-we-have-our-first-look-at-the-new-dune-film/\">here</a> and <a href=\"https://arstechnica.com/gaming/2020/09/destiny-awaits-timothee-chalamet-is-the-chosen-one-in-first-dune-trailer/\">here</a>), Herbert's <a href=\"https://arstechnica.com/gaming/2019/02/aquaman-khal-drogo-actor-may-play-duncan-idaho-in-new-dune-film/\"><em>Dune</em> is set in the distant future</a> and follows the fortunes of various noble houses in what amounts to a feudal interstellar society. Much of the action takes place on the planet Arrakis, where the economy is driven largely by a rare, life-extending drug called melange (\"the spice\"). Melange also conveys a kind of prescience and makes faster-than-light travel practical. There's betrayal, a prophecy concerning a messianic figure, giant sandworms, and battle upon battle, as protagonist Paul Atreides (a duke's son) contends with rival House Harkonnen and strives to defeat the forces of Shaddam IV, Emperor of the Known Universe. </p>\n<p>When Dune was first published, The Chicago Tribune <a href=\"https://www.amazon.com/dp/0441013597/?tag=arstech20-20\">called it</a> \"one of the monuments of modern science fiction.\" Astronomers have <a href=\"https://planetarynames.wr.usgs.gov/SearchResults?target=TITAN&amp;featureType=Labyrinthus,%20labyrinthi\">used the names</a> of fictional planets in <em>Dune</em> to identify various topographical features on Saturn's moon Titan. Herbert wrote five sequels, and the franchise also includes <a href=\"https://arstechnica.com/gaming/2017/05/dune-spice-and-sandworms-power-one-of-the-great-lost-board-games/\">board games</a>, computer games, and numerous prequels and sequels written by his son Brian Herbert with the help of Kevin J. Anderson.</p></div><p><a href=\"https://arstechnica.com/?p=1782258#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782258&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"824ddd578ba5763488db84896f61301cd06684e5f25aeb4aa21c5cdfc8dd0d20","category":"Tech"}