{"title":"What we know about Turkey oak (Quercus cerris L.) — from evolutionary history to species ecology","link":"https://academic.oup.com/forestry/article/97/4/497/7710647?rss=1","date":1720656000000,"content":"<span><div>Abstract</div>Turkey oak (<span>Quercus cerris</span> L.) is a deciduous tree species of the genus <span>Quercus</span> section <span>Cerris</span> (Fagaceae), widely distributed in Europe and Asia Minor. Throughout its vast distribution range, the species carries high phenotypic and genetic variability. Due to its high drought tolerance, Turkey oak may have great potential to be a key tree species in Central and Western Europe under climate change conditions. However, more detailed information on its phylogeny, phylogeography, phenotypic, and genetic variability is still needed for a more careful and reliable assessment of the species’ adaptation potential. To this end, based on 41 reviewed articles, we collected detailed information to support the evaluation of Turkey oak’s adaptation potential under climate change. In the reviewed articles, we observed a significantly lower number of genetic studies of the members of the section <span>Cerris</span> (especially the Euro-Mediterranean species) relative to the subgenus <span>Quercus</span>. We also identified research gaps with respect to the functional and population genetics of the species that should be addressed in the future. Nevertheless, the different evolutionary background and adaptation strategies of Turkey oak as compared to Central European white oaks, as well as its high phenotypic and genetic variability, may indeed represent a great potential for this species to support the climate adaptation of forestry in Central and Western Europe.</span>","author":"","siteTitle":"Forestry: An International Journal of Forest Research Current Issue","siteHash":"674daa49a10aca976a546578a4b89e6a296c5e7ca75e6f3ff66a7154daf5b0cb","entryHash":"825f2412c1e12a4819e9a690f445f7169a1c505b57465897f933fab78abab150","category":"Environment"}