{"title":"How to find a lost or stolen iPhone with Find My and other methods","link":"https://www.macworld.com/article/671675/how-to-use-find-my-iphone-to-find-lost-or-stolen-iphone-or-ipad.html","date":1681307217000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>You’ve probably arrived at this article because you’ve lost your iPhone, or even worse, think it might have been stolen. The good news is that Apple has software that can make it easy to track down a lost iPhone, and if it has been stolen you can use that software to wipe the iPhone and lock it down so that your data is protected.</p>\n\n\n\n<p>In this tutorial we will talk you through how to use Find My app to discover the location of your iPhone or iPad. (In fact you can also use the same software to locate your <a href=\"https://www.macworld.com/article/672861/how-to-find-a-lost-apple-watch.html\">Apple Watch</a>, <a href=\"https://www.macworld.com/article/672425/how-to-find-lost-airpods-with-find-my-airpods.html\">AirPods</a> or <a href=\"https://www.macworld.com/article/670921/how-to-find-a-stolen-mac-and-protect-data-from-thieves.html\">Mac</a>.)</p>\n\n\n\n<p>We also explain how you can still track the location of your iPhone even if the battery has died or it is no longer connecting to the internet. </p>\n\n\n\n<p>Finally, for situations when your iPhone has been stolen and cannot be recovered, we explain how to lock the iPhone, wipe your data and make sure that services like Apple Pay can’t be used.</p>\n\n\n\n<h3>What not to do</h3>\n\n\n\n<p>What you should never do is attempt to retrieve your iPhone if you think it has fallen into the wrong hands. There have been cases of  people attempting to recover stolen iPhones using Find My iPhone and being hurt, or worse. There was even a case of a man <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bbc.co.uk/news/uk-scotland-glasgow-west-29015072&amp;xcust=1-1-671675-1-0-0&amp;sref=https://www.macworld.com/feed\">tracking down and killing the person</a> who stole his son’s iPhone. (He claimed he lashed out in self defence after being stabbed by the mugger, pleaded guilty to culpable homicide, and was jailed for six years.)</p>\n\n\n\n<p>However, you might be able to use the information provided by Find My to help the police with their enquiries. There is a section below that explains how to do this.</p>\n\n\n\n<h2>How to find a lost iPhone (even if it is offline or turned off)</h2>\n\n\n\n<p>There are two places you might have left your iPhone. At home, or somewhere else. </p>\n\n\n\n<p>My daughter’s first piece of advice, when I told her I was writing this article, is that if you have lost something tidy up because then you’ll find it. But there’s a quicker way: if you think you have just misplaced your iPhone at home, in the office, or at any venue where you are currently residing, you can ‘ping’ your iPhone to get it to play a sound so you can locate it. You can use your Apple Watch or a HomePod to ping it, if you have either of those devices. You might be thinking you could equally call your iPhone from another device – which is true, but assumes that you have the audio on and that you don’t have multiple other devices that will start ringing when your iPhone is called! </p>\n\n\n\n<p>If your iPhone isn’t near enough to respond to your ping, or you don’t own one of the above, then you will need to enlist the Find My app to help you track it down. The great news is that you can track an iPhone even if it is turned off or offline using Find My. The iPhone’s last known location can be pinpointed by other Bluetooth devices that have been nearby without it needing to be on a cellular or Wi-Fi network. </p>\n\n\n\n<p>We will start by explaining how to do both of these tricks. </p>\n\n\n\n<h2>How to Ping your iPhone</h2>\n\n\n\n<p>The simplest method to find an iPhone, if you’ve got a paired Apple Watch or a HomePod, is to tell those devices to ping the iPhone for you.</p>\n\n\n\n<h3>How to use an Apple Watch to find your iPhone</h3>\n\n\n\n<ol><li>On your Apple Watch, swipe up from the bottom of the screen to bring up the Control Centre. </li><li>On the lefthand side you’ll see an icon of an iPhone with curved lines emanating from it: this is the ping button. Tap it.</li><li>At this point the iPhone which is paired with this Apple Watch, assuming it’s reachable, will ‘ding’ so you can hear where it is. </li><li>Keep pinging the phone until you find it.</li></ol>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3612189/how_to_find_iphone_apple_watch_ping_312.jpg\" alt=\"How to find a lost iPhone: Ping from an Apple Watch\" loading=\"lazy\" /></figure></div>\n\n\n\n<h3>How to use a HomePod to find your iPhone</h3>\n\n\n\n<p>You can also ping your iPhone from your HomePod. </p>\n\n\n\n<ol><li>Say to your HomePod: “Hey Siri where’s my iPhone?” </li><li>If the iPhone is close enough, Siri will hopefully say, “I found [name’s] iPhone near by, should I make it play a sound?”</li><li>Say yes and listen out for your iPhone. </li></ol>\n\n\n\n<p>It is possible that you will need to turn on Personal Requests for this to work, in which case follow the steps below. You’ll need a device with the Home app on it, so an iPad if you have one. The service also requires iCloud Keychain to be set up on the device you are using. </p>\n\n\n\n<ol><li>Open the Home app on your device. </li><li>Open the Home app. </li><li>Tap on the Home icon.</li><li>Tap on your name. </li><li>Turn on Personal Requests for the appropriate device(s).</li></ol>\n\n\n\n<h2>How to find your iPhone with the Find My app</h2>\n\n\n\n<p>Find My is a free service provided by Apple. It is easy to set up, and quite possibly the most valuable app on your iPhone (since iOS 13 the app has been called Find My, but was previously called Find My iPhone). The Find My service also works for your iPad, Apple Watch, AirPods and Mac, so you can keep track of all your Apple devices. It can even keep track of your family’s devices if you are all linked via a Family Sharing account – this means if you lose your iPhone you can easily locate it via your partner’s device if they are linked via Family Sharing. Here’s <a href=\"https://www.macworld.com/article/233718/how-to-set-up-family-sharing-on-your-iphone-ipad-or-mac.html\">how to set up Family Sharing</a>.</p>\n\n\n\n<p>Assuming you’ve already set up Find My, your iPhone will be able to broadcast its location to you. So you can use another Apple device – for example a friend’s iPhone. If you don’t have access to another Apple device such as a Mac or iPad, you can even access the Find My service via a browser on a PC – just go to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.icloud.com&amp;xcust=1-1-671675-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">iCloud.com</a> and log in with your Apple ID and password.</p>\n\n\n\n<p>Whether you’ve left your iPhone in the back of a cab, think you might have left it in the office, or, worst-case scenario, it’s been lifted from your pocket, you should be able to use Find My to track it down – as long as you set up Find My in the first place. Chances are you will have set it up when you first started using your iPhone, so it’s worth checking whether you can use the service. We have a guide to <a href=\"#setup\">setting up</a> Find My iPhone at the end of the article.</p>\n\n\n\n<p>Assuming you have Find My set up, here’s how to use the app to locate your iPhone…</p>\n\n\n\n<div>\n<div><div><div>At a glance </div></div><ul><li><span>Time to complete: </span><span>  5 minutes</span></li><li>Tools required: One of the following: iPad, an iPhone, a Mac, or any non-Apple device via iCloud.com</li><li>Materials required: Find My app, or access to iCloud.com</li><li>Cost: Free</li></ul></div>\n\n\n\n<div>\n<div><span>1.</span>\n<h3>Open Find My app</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/find-my-app-icon_thumb.jpg?quality=50&amp;strip=all\" alt=\"Find My icon\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If you’re using an iOS device or a Mac, locate the Find My app. </p>\n\n\n\n<p>On an iPhone drag down from the middle of the screen and type ‘Find’ in the search box – you should see Find My appear in the suggestions section (same icon as above).</p>\n\n\n\n<p>On a Mac press Command + Space bar and start typing ‘Find’ to locate the Find My app. </p>\n\n\n\n<p>If you are using a non-Apple device, such as a PC or an Android phone, go to iCloud.com and log into your account there. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>2.</span>\n<h3>Log into Find My</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Find-My-Log-in.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Find My Log in\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>Open the Find My app on your Apple device, or click on the Find My icon on iCloud.com. You will need to enter your Apple ID and Password if this isn’t your device – this will be the login you use whenever you buy anything from the App Store or when logging on to any other Apple services. You will have set up an Apple ID when you got your first Apple device. (Memory lapse? Here’s <a href=\"https://www.macworld.com/article/671530/how-to-reset-apple-id-if-you-forgot-the-password.html\">how to reset a forgotten Apple ID</a>.)</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>3.</span>\n<h3>Locate the lost device</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Find-My-iPhone-on-Mac.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Find My iPhone on Mac\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If you are using an iPhone or iPad you will see a list of Devices, these are all the devices linked to your account, including iPhones, iPads, Apple Watches, AirPods and Macs. Below that list you will see the devices owned by family members if you have Family Sharing set up. </p>\n\n\n\n<p>On a Mac click on the Devices tab and scroll through them until you find the one you are looking for. As with the iPhone interface you’ll see your devices and any linked via Family Sharing. This appears alongside a map showing the location of your nearby devices (see image above).</p>\n\n\n\n<p>If you are using iCloud then click on All Devices at the top of the window to see all your devices. </p>\n\n\n\n<p>Click or tap on the device you are trying to locate. You may see a spinning icon indicating that the device is being located, wait while Find My tracks it down.</p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>4.</span>\n<h3>Play a sound on your iPhone</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Play-Sound-in-Find-My.jpg?quality=50&amp;strip=all\" alt=\"Play sound in Find My\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If having located your iPhone in the Find My app you notice that it isn’t far away from where you are – close enough for you to hear it if it makes a sound – then you can use the Find My app to play a sound on it. </p>\n\n\n\n<p>On an iPhone or iPad just tap on Play Sound. </p>\n\n\n\n<p>If you are using iCloud click on Play Sound. On a Mac using Find My you need to click on the grey information box attached to the location of the device on the map before you can access the options including Play Sound. </p>\n\n\n\n<p>This is a good option if your device is at home, in your car, at a friend’s house, or somewhere else where someone you know can locate it, but what if it’s not in a location where you have someone who can recover the device for you? In that case move on the the next step. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>5.</span>\n<h3>Mark your iPhone as Lost</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Lost-Mode-iPhone.jpg?quality=50&amp;strip=all\" alt=\"What happens when mark iPhone as lost\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If your iPhone is not nearby, or perhaps its location keeps changing (perhaps you left it on a bus or train) the best option is to mark is as lost. To do this follow these steps depending on the device you are using to access it. </p>\n\n\n\n<p>On an iPhone, iPad or Mac tap on Activate under Mark As Lost. If you are using iCloud to access Find My click on Lost Mode. </p>\n\n\n\n<p>You will see an explanation of what will happen next including that you will be notified when the device is found, that the device will have Activation Lock implemented (so if won’t be possible to unlock it without your Apple ID being used), and any payment cards that you use via Apple Pay will be suspended. </p>\n\n\n\n<p>You can also choose to Leave a Message – which means a number and message will be displayed on the iPhone. We’ll discuss that step next.  </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>6.</span>\n<h3>Enter a phone number and message</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Enter-phone-number.jpg?quality=50&amp;strip=all\" alt=\"Enter phone number for lost iphone\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>After choosing Mark As Lost you will then get option to provide contact information for the person who finds your lost device, which should help them return it to you. You will need to enter a phone number that can be used to contact you on. You’ll also get the option to enter a message, so that your iPhone will display a message to the person who finds it. Apple suggests the words: “This iPhone has been lost. Please call me”. </p>\n\n\n\n<p>Once you have entered the information click/tap on Activate. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>7.</span>\n<h3>Get your iPhone to notify you when found</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Lost-iPhone-notification.jpg?quality=50&amp;strip=all&amp;w=1081\" alt=\"Turn Lost iPhone notifications on\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If your iPhone can’t be located by Find My you will also see the option to Notify When Found as well as Erase This Device. Choose Notify When Found if you still have a glimmer of hope that you will get your iPhone (or iPad) back. </p>\n\n\n\n<p>In order to be notified you may need to make some tweaks to Notifications in System Preferences or Settings, depending on the device you are using. The next time the iPhone connects to Wi-Fi or a cellular network, or another Apple detects it via Bluetooth, you will receive a notification and details of its location. </p>\n</div>\n</div>\n</div>\n\n\n\n<div><span>8.</span>\n<h3>Erase the iPhone</h3>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Erase-iPhone-Find-My.jpg?quality=50&amp;strip=all\" alt=\"Erase iPhone with Find My\" loading=\"lazy\" /></figure><p> </p></div>\n\n\n\n<div>\n<div>\n<p>If getting your iPhone back looks completely hopeless then you should erase the device. Click or tap on the Erase This Device option and then on Continue. If you do recover the iPhone you will be able to recover it from the backup (that you hopefully already have in iCloud). </p>\n\n\n\n<p>The iPhone data won’t actually be erased until the iPhone connects to WiFi or a cellular network, </p>\n\n\n\n<p>As with the leave a message option above, if you go through the steps to erase the iPhone you’ll also have the option to add a message that will be shown on the iPhone if someone recovers it. Since there’s no option here to add your phone number or contact details here you could add them yourself, but be careful about sharing too much information with the people who may have stolen your iPhone! </p>\n\n\n\n<p>Tap or click on Erase and then enter your Apple ID password and click/tap on Erase. </p>\n\n\n\n<p>If you have second thoughts you can click on Cancel Erase, you’ll need to enter your password again. </p>\n</div>\n</div>\n</div>\n</div>\n</div>\n\n\n\n<h2>How to find a family member’s, or friend’s, iPhone</h2>\n\n\n\n<p>If you have set up Family Sharing you will be able to locate a family member’s device using Find My as per the steps above. </p>\n\n\n\n<p>You will need your family member’s Apple ID and password when you go through the steps to lock or erase their device.</p>\n\n\n\n<p>If you aren’t using Family Sharing your family member or friend can use the Find My app on your device. </p>\n\n\n\n<p>If you are using an iPhone or iPad: </p>\n\n\n\n<ol><li>Open Find My. </li><li>Tap on the Me icon. A Me tab will open at the bottom of the screen, you may need to tap and drag up on it to make it expand. Drag up to reveal this section. </li><li>At the bottom you will find Help a Friend. Tap on Help a Friend and your iPhone will start to open iCloud.com.</li><li>You will have the choice of signing in as yourself, or as someone else. In this case it’s your friend who needs to sign in, so tap in Use a different Apple ID. </li><li>Your friend now needs to log in with their Apple ID and password to access their own Find My app. </li></ol>\n\n\n\n<p>On a Mac, PC, or any other device, ask your friend to log into their Apple ID via iCloud.com.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Help-a-Friend-Find-My-iPhone.jpg?quality=50&amp;strip=all&amp;w=1032\" alt=\"Help a Friend  in Find My app \" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/07/Help-a-Friend-Find-My-iPhone.jpg?quality=50&amp;strip=all 1170w, https://b2c-contenthub.com/wp-content/uploads/2022/07/Help-a-Friend-Find-My-iPhone.jpg?resize=258%2C300&amp;quality=50&amp;strip=all 258w, https://b2c-contenthub.com/wp-content/uploads/2022/07/Help-a-Friend-Find-My-iPhone.jpg?resize=768%2C893&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/07/Help-a-Friend-Find-My-iPhone.jpg?resize=1032%2C1200&amp;quality=50&amp;strip=all 1032w\" width=\"1032\" height=\"1200\" /></figure><p> </p></div>\n\n\n\n<h2>How to find iPhone by phone number or using an app </h2>\n\n\n\n<p>If Find My isn’t turned on retrieving your iPhone will be a lot harder. If you have lost your iPhone and you didn’t set up Find My you may be hoping that finding your iPhone by phone number will be possible. Alternatively you may be hoping that an app would enable you to trace an iPhone–if apps and services can tailor information to our location, can we also access this location information?</p>\n\n\n\n<p>If it was possible to easily track an iPhone with just it’s phone number this would obviously be a big security and privacy threat. However, there are apps offering to help you locate an iPhone using a phone number, but we found that these didn’t work all that well, and tend to rely on someone clicking on a link received via text messages.</p>\n\n\n\n<p>We tried a couple out, with limited success: </p>\n\n\n\n<h3>Phone Tracker App GPS Locator</h3>\n\n\n\n<p>Requires a subscription to use – it’s $9.99/£8.99 a month. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/gb/app/phone-tracker-app-gps-locator/id1629901348&amp;xcust=1-1-671675-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Get it here</a>.<br />We were able to send a link to a phone number which when opened asked for permission to use the current location. We clicked Allow and it found the location. However, the other person did need to click on the link and approve the use of their location. </p>\n\n\n\n<h3>Number Tracker Pro</h3>\n\n\n\n<p>The app is free, but you will need to buy credits to send a message. It costs one credit per message and you have to buy 5 or more for $4.99/£4.99. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/id1494498108&amp;xcust=1-1-671675-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Get it here</a>.<br />You can use the app to send a message to the phone number (you can choose from various locations including U.S. and U.K). We sent the text to ourselves to text is and it took over five minutes for the text to arrive and when it did there was only a link in the message, which we clicked on. The link opened a webpage that was identified as not secure and had no text on it.<br />Our assumption is that once the link is activated information will be available in the History tab, however, we have yet to receive any information about the location of the iPhone.<br />It seems that even if this did work it would rely on someone clicking the link, so it wouldn’t necessarily help you locate a lost or stolen iPhone.</p>\n\n\n\n<p>Another reason why people want to locate an iPhone is to confirm the location of a family member. This is possible with the addition of various apps, or simply by sharing your location in the Messages app. We tried out the popular Life 360 app.</p>\n\n\n\n<h3>Life 360</h3>\n\n\n\n<p>The app can be downloaded for free, but there are various subscriptions starting at $4,17/£3.99 a month. There is a seven day free trial though. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/app/id384830320&amp;xcust=1-1-671675-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Get it here</a>.<br />This is an app that lots of families use to keep tabs on loved ones. It is more like Find My Friends than Find My iPhone. It allows you to set up favorite locations and create groups of people you want to track. There are additional features like Crash Detection and there are Parental Controls. Users do have to give permission to be tracked though, so if you haven’t already set it up this won’t work in the case of a lost iPhone. It also lacks the ability to wipe and lock down your iPhone that Find My offers. </p>\n\n\n\n<h2>How to protect a lost iPhone</h2>\n\n\n\n<p>If you haven’t set up Find My you can still take some actions to protect your data:</p>\n\n\n\n<ol><li>Text your iPhone in the hope that a kind person finds it and sees the message including how to contact you.</li><li>Change your password associated with your Apple ID. (Here’s \n<a href=\"https://www.macworld.com/article/670659/how-to-reset-apple-id.html\">how to change your Apple ID and password</a>.)</li><li>Change the passwords for your email, FaceBook, Twitter and any other services you use.</li><li>Let your mobile network provider know that your phone is lost or stolen so they can disable the account.</li><li>If you have Apple Pay set up call your bank and ask if your card can be suspended. (While Apple Pay can’t be accessed without your fingerprint or Passcode, it’s probably better to be safe than sorry).</li><li>Report the lost or stolen iPhone to the Police (see below).</li></ol>\n\n\n\n<h2>Reporting a stolen iPhone</h2>\n\n\n\n<p>If you want to make a claim on the insurance for your stolen iPhone you will need a Police Crime Number, so you will have to report the iPhone as stolen.</p>\n\n\n\n<p>When you report a lost or stolen iPhone to the police you may need to give them the serial number of your iPhone. You obviously don’t have the device itself to check, but you may still be able to find it. </p>\n\n\n\n<h3>How to find the serial number </h3>\n\n\n\n<p>If you have Find My set up you can get the serial numbers for all the devices you own.</p>\n\n\n\n<ol><li>Open iCloud on your device (on an iPhone or iPad go to Settings and tap on your Apple ID at the top of the screen.</li><li>On a Mac open System Preferences and click on Apple ID. </li><li>Find the device in question and tap on it. You’ll see information including the serial number.</li><li>You’ll also see the Apple Pay cards you have set up for that device – you can tap on Remove Items to remove them from that device. </li></ol>\n\n\n\n<h3>How the police can use Find My</h3>\n\n\n\n<p>Unfortunately, even if they can see that your iPhone is located somewhere on a particular street or housing estate the police are unlikely to go in search of it, because as good as Find My iPhone is, it’s not so good that they can be confident about turning up at the right address. The police can only enter an address if they have reason to believe the stolen property is definitely there.</p>\n\n\n\n<p>It is feasible that the data you have obtained via Find My iPhone could be useful in their enquiries, though, so you should share it with the police.</p>\n\n\n\n<p>As we said before, do not attempt to recover the iPhone yourself, even if the police are not prepared to go to the address Find My iPhone is suggesting the iPhone is located at.</p>\n\n\n\n<h2>How to set up Find My</h2>\n\n\n\n<p>It’s easy to say in hindsight, but prevention is the best cure. If you were lucky enough to get your iPhone back despite not having Find My turned on, make sure you set up Find My so that next time the process of locating it, and if necessary wiping it, is a lot easier.</p>\n\n\n\n<p>If you haven’t already set up Find My iPhone this is how to do it:</p>\n\n\n\n<ol><li>On your iPhone tap Settings.</li><li>Click on your name at the top of the list to enter your iCloud log in details.</li><li>Scroll down and tap on Find My.</li><li>Tap on Find My iPhone.</li><li>On the next screen make sure the slider beside Find My iPhone is green. Also enable Find My Network and Send Last Location.</li></ol>\n\n\n\n<h2>How to protect your iPhone</h2>\n\n\n\n<p>And here’s a few tips to avoid future theft of your iPhone, and ensure that if the worst does happen your data can’t be jeopardised.</p>\n\n\n\n<ul><li>Set a screen lock with a pin longer than four digits.</li><li><a href=\"https://www.macworld.com/article/671444/how-to-back-up-an-iphone-or-ipad.html\">Back up your iPhone</a> so you don’t lose things like photos.</li><li>Use Find My.</li><li>Don’t make yourself a target. Don’t get your iPhone out in public, or at least not when you are walking down a dark road in the dead of night – apart from anything it may mean you are less engaged with your surroundings (especially if you have headphones on).</li><li>Most thefts are opportune thefts due to you leaving your iPhone behind so make sure that you keep all your belongings with you.</li></ul>\n\n\n\n<p>If you’re worried about other Apple devices going missing, be sure to also take a look at our guide on<a href=\"https://www.macworld.com/article/670921/how-to-find-a-stolen-mac-and-protect-data-from-thieves.html\"> how to find a stolen Mac and protect your data from thieves</a>. </p>\n\n\n\n<div></div>\n\n\nApple, iOS, iPhone, Security</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8262135a2d60349f1b81ac33d030b40dbb5511c0248ab11dd065081ea1c3b5a7","category":"Apple"}