{"title":"Learning competence of the temperate facultative cleaner wrasse Thalassoma pavo (Labridae)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15915?af=R","date":1724829255000,"content":"<h2>Abstract</h2>\n<p>Cleaner fishes remove parasites from other fishes called “clients,” thereby contributing to a healthier ecosystem. Although the behavior and learning abilities of dedicated and tropical cleaner fishes have been broadly studied, a limited number of studies investigated the behavior of facultative and temperate cleaner fishes and, to the best of our knowledge, none focused on their cognitive abilities. Here, we tested the learning abilities of a species of temperate facultative cleaner, the ornate wrasse <i>Thalassoma pavo</i> in laboratory conditions, based on two problems. These two problems, or tasks, are relevant in two different contexts: the first one, deemed as mutualistically relevant, the cue-based discrimination task, and the second one, the spatial-based discrimination task, which is relevant in a non-cleaning context, when fish navigate through their environment to find food and return to their territories. We found that <i>T. pavo</i> individuals were able to solve these two tasks but excelled at the spatial task rather than with the cue discrimination. The same individuals were also challenged to learn the reverse protocol of these tasks and were again most successful in learning the reverse spatial discrimination problem, but not the cue. Contrary to the dedicated cleaner wrasse <i>Labroides dimidiatus</i>, this temperate facultative cleaner wrasse is slower to learn mutualistic relevant problems but competent in solving spatially derived problems. This may be due to the specific demands of their socio-ecological environment, with facultative cleaners having a greater component of non-mutualistic skills (spatial component), which prepares them to search for alternative food sources if necessary (e.g., feeding on the substrate) or even to expand territories more easily and less prepared to deal with mutualistic exchanges compared to dedicated cleaners that specialize to become increasingly socially competent.</p>","author":"Pauline Narvaez, \nMiguel Furtado, \nMarta C. Soares","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"826594ad1d0c227fb33ab27d3073d2936e1a5afa8ec43e8eb956fbe6e2cc3089","category":"Environment"}