{"title":"2021 Concours de Machine: Jolie Rouge Cycles – Goat Rider – Julien Fritsch","link":"https://theradavist.com/2021/11/2021-concours-de-machine-jolie-rouge-cycles-goat-rider/?utm_source=rss&utm_medium=rss&utm_campaign=2021-concours-de-machine-jolie-rouge-cycles-goat-rider","date":1637067619000,"content":"<p><em>Today we’ve got another bike that was displayed at the French <em>constructeur</em> event, Concours de Machine. Built by <a href=\"http://jolierougecycles.fr/\" target=\"_blank\">Jolie Rouge Cycles</a>, this all-mountain steel full suspension is outrigged with bags, racks, and more. As someone who owns a steel full suspension, it’s amazing to see the ante upped in this manner but that’s just the half of the weirdness that’s about to unfold for you so read on below for the builder of this bike, Julien Fritsch’s words and photos!</em><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/53.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/241068805_1021930395234840_5423152718498970312_n.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Concours de Machine:</b></p>\n<p>We all know that there are many kinds of off-road adventure bikes out there. It’s such a rich and diverse practice, although with many compromises. Each year the Concours de Machine gives builders a Specifications Sheet, deciding what they will build for the event and if I interpreted it correctly, we would just need to make a bike to enjoy the mountain with friends. So that let me do a gravity bike with enough load capacity to stay some days high in the mountain.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/DSCF4539.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>The Monster Goat:</b></p>\n<p>We never know how far love can go! I made this bike for the “Concours de Machine 2021” but first for my two growing baby lovely goats. You can’t imagine how fast the two girls are on the steep single tracks! The daily 30 min after-work goat ride is a pure moment of freedom!  My first wish was to make a bike fast enough to follow the two teenagers. I have to say that two goats get the steep mountains in the blood, hard to deal with. I have no choice, I have to make a fast bike!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/8.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>The Bike:</b></p>\n<p>100% of the frame, rack, and stem are home-cooked with a special love for tube bending and parts machining works. Starting from scratch, we make the bike that fits your needs. My wish was about “small wheel size” 27.5, small front and rear travel 140mm.</p>\n<p>Rear suspension turns around the machined T47 bottom bracket with 4 big bearings. Quite a simple system that gives easy maintenance, great lateral rigidity, no kickback chain effect, and is single-speed friendly!</p>\n<p>The bike is made with Columbus Zona set tubes with internal lugs reinforcements. All around the weldings, inner tubes are welded to increase the overall tubing thickness. All frame accessories are made with 304 stainless steel.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Front Rack:</b></p>\n<p>Its plug-and-play front rack is made to measure to get the possibility to ride without reducing off-road capabilities.</p>\n<p>The rack weight goes to a special front axis made from 7075 aluminum.</p>\n<p>The aim is to take off the front rake when you arrive at your base camp. That gives you the chance to enjoy a little bit more the gravity bike sensation during the steep riding days around the camp. All the stuff inside the front bag is used for the bivouac and can stay on the base camp.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>-Left bag: mattress<br />\n-Right bag: warn nightclothes<br />\n-Up bag: tarp and 0°C sleeping bag</p>\n<p>The <a href=\"https://www.stootsconcept.fr/\" target=\"_blank\">Stoots</a> front light/battery is fixed on the rack.</p>\n<p>Making a handcrafted bike is the opportunity to give creativity to those around us. I love sharing with my customer the possibility to optimize bike-packing bikes. Especially when the ideas are easy to incorporate into the project.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/4.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Instead of putting the mud inside the bag, or a dangle mug onto the bags, why not use the mug to hold the bag? In this case, the stainless steel mug gets two braising fixations that are plugged into the front rack. The bag goes in and is fixed by two straps. Cheap and easy solution. Why not…?</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/12.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Bags:</b></p>\n<p>After some bike and mountain bike trips together, Rodolphe, creator of @helmutequipment, and I decided to go on handcrafted works. He makes the bags, I make the bikes… All the bags are made to measure by my friend, in this case with white Dyneema fabric.</p>\n<p>We wish that bikepackers help us to enjoy the capacity to create bikes and bags that fit our needs.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/11.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/9.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/7.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><b>Paint:</b></p>\n<p>The paint job is a good way for framebuilder to deeply finish the work. That gives us unlimited possibilities. All the challenges are welcomed! I have to say that it is quite an enjoyable task.</p>\n<p>From this bike, I learned how difficult it is to choose your own bike paint. I now understand my customers about choosing the final touch of their projects! You can go through political messages, drawing stories, or just make shiny paint with great color effects.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/6.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This bike has some <em>Kaboul</em> kites, fires, flames… First, the paint was quite difficult to watch. That was too bloody… I spray some flakes above the bloody to bring some hope.</p>\n<p>(Even shiny paints are made to be damaged)</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/1.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Concours de machine is a very quality time to share the passion of handcrafted bikes. Behind each bike of the event, there are riders, framebuilders, painters, bag designers, adventurers. It’s a great family born to enjoy times on the bike and around fire camp!</p>\n<p><em>Longue vie aux Concours de Machines!</em></p>\n<p>The post <a href=\"https://theradavist.com/2021/11/2021-concours-de-machine-jolie-rouge-cycles-goat-rider/\">2021 Concours de Machine: Jolie Rouge Cycles – Goat Rider</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"827480838ad5870fc5969809a663a8d350b3baa1be40f999536071d0cb63494f","category":"Cycling"}