{"title":"Social networks of reintroduced Przewalski’s horses in the Great Gobi B Strictly Protected Area (Mongolia)","link":"https://academic.oup.com/cz/article/70/2/182/7087053?rss=1","date":1679875200000,"content":"<span><div>Abstract</div>Analyzing social networks is a powerful tool for understanding the ecology of social species. While most studies focus on the role of each group member, few compare groups with different characteristics. The current population of Przewalski’s horses <span>Equus ferus przewalskii</span> at the Great Gobi B Strictly Protected Area (Mongolia) includes groups of wild-born and captive-bred individuals with different experiences with the area (acclimatizing, long-term reintroduced, and wild-born), therefore serving as an ideal natural behavioral lab. We filmed 11 groups for 141.5 hours in summer 2018 (July), late spring 2019 (May, June), and autumn 2019 (September, October). Affiliative and agonistic interactions were recorded, and social networks were created. We tested the influence of origin, experience, season, sex, age, relative time belonging to the group, relatedness, and dominance rank on different network indices at the individual and group levels. We found that groups with greater experience in the area are generally better connected than members of the newly formed groups. However, these strong networks were created by wild-born individuals with very low interaction rates. On the contrary, inexperienced groups composed of captive-bred individuals displayed many interactions but created weak social networks. The results show a trend of behavioral transition from acclimatizing through long-term reintroduced to wild-born groups, supporting that the newly formed groups of released Przewalski’s horses need time to display the typical social behavior patterns of wild-born individuals. Long-term monitoring of released Przewalski’s horses is recommended to promote the success of this reintroduction program.</span>","author":"","siteTitle":"Current Zoology Current Issue","siteHash":"e7197aa0e79464a44186f16a81d9758c42b85acdd06820e73429ff264fcd9f66","entryHash":"8275e1be7642a27c0dc1ef5ef728e77b07b53ce79421155037ac8b9e9bd7e64f","category":"Environment"}