{"title":"Soluble Fluorinated Cardo Copolyimide as an Effective Additive to Photopolymerizable Compositions Based on Di(meth)acrylates: Application for Highly Thermostable Primary Protective Coating of Silica Optical Fiber","link":"https://www.preprints.org/manuscript/202404.1206/v1","date":1713419468000,"content":"The development of photocurable compositions is in high demand for the manufacture of func-tional materials for electronics, optics, medicine, energy, etc. The properties of the final pho-to-cured material are primarily determined by the initial mixture, which needs to be tuned for each application. In this study we propose to use simple systems based on di(meth)acrylate, polyimide and photoinitiator for the preparation of new photo-curable compositions. It was es-tablished that a fluorinated cardo copolymide (FCPI) based on 2,2-bis-(3,4-dicarboxydiphenyl)hexafluoropropane dianhydride, 9,9-bis-(4-aminophenyl)fluorene and 2,2-bis-(4-aminophenyl)hexafluoropropane (1.00:0.75:0.25 mol) has excellent solubility in di(met)acrylates. This made it possible to prepare solutions of FCPI in such monomers, to study the effect of FCPI on the kinetics of their photopolymerization in situ and the properties of the resulting polymers. According to the obtained data, the solutions of FCPI (23 wt.%) in 1,4-butanediol diacrylate (BDDA) and FCPI (15 wt.%) in tetraethylene glycol diacrylate were tested for the formation of the primary protective coatings of the silica optical fibers. It was found that the new coating of poly(BDDA–FCPI23%) can withstand prolonged annealing at 200°C (72 h), which is comparable or superior to the known most thermally stable photo-curable coatings. The proposed approach can be applied to obtain other functional materials.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"827719034a57fd00a6b9e897f8142b9333804256d1f3f3781208267f8ab76bf7","category":"Interdisciplinary"}