{"title":"Getting the Christmas Tree Home via Bike: 2021 Edition","link":"https://www.dcrainmaker.com/2021/12/getting-christmas-by-bike-home-edition.html","date":1639410449000,"content":"<p>As has been the tradition for nearly a decade of living in Europe, we’ve been bringing home the Christmas tree by bike. Seriously, all the <a href=\"https://www.dcrainmaker.com/2012/12/paris-blog-getting-our-christmas-tree-home-by-bicycle.html\">way since 2012 in Paris</a> using the basket of a Velib (when we apparently looked 16 years old). Now, in recent years since moving to Amsterdam, we’ve upgraded to a cargo bike for the operation, and the kids are squished inside as well. Each year I document the situation, probably more for my own purposes than anything else. In fact, last year we even did a <a href=\"https://www.youtube.com/watch?v=qGOr_YIFImc\">video of the whole thing</a>.</p>\n<p>But this weekend we kept things simple. First up, was loading up the bike with kiddos. The dog was not included on this trip, cause frankly, three kids and a Christmas tree in a bike has already reached circus act status. Adding a dog is just asking for someone to try and open the emergency exit door mid-flight, resulting in some festive bike-lane disaster.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5632.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5632_thumb.jpg\" /></a></p>\n<p>From there we pedaled to the flower shop where we’ve bought our tree every year since living in Amsterdam. This has mostly ended up being a case of them simply having better and slightly taller trees than many other places nearby us. My simple rule on Christmas trees is that it needs to be at least as tall as me. I don’t need it crazy high, but I shouldn’t be looking down on my tree, Charlie Brown style.</p>\n<p>Beyond that basic criteria, the selection process didn’t take long. Essentially, it just has to pass my “Is it acceptably pretty on roughly 2/3rds of the tree?” test. I’m not looking for the supermodel of trees. It gets shoved in a corner, so if a third or so of it is ugly…shrug, only the wall will see it (unless the Littlest Peanut decides to play hide and seek, in which case her opinion of the tree’s backside is probably the least of my immediate issues).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5639.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5639_thumb.jpg\" /></a></p>\n<p>Most Christmas tree places in Amsterdam fall into two basic categories:</p>\n<p>A) Flower shops<br />\nB) Grocery stores</p>\n<p>There’s the odd tree shop that somehow pops up out of nowhere, but the vast majority are simply flower shops that sell trees for four weeks, starting mid-late November. Unlike American Christmas tree shops, once these flower shops run out of trees, it’s over. We’ve virtually never seen replenishments. The point being, while I contemplated trees, the littles wandered around looking at flowers.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5644.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5644_thumb.jpg\" /></a></p>\n<p>After selecting our tree, the man stuck it in the magical tree condom machine, which puts the netting around it, and makes the tree more viable for transport. Sure, if it was up to me, I’d have all the fun in the world with a fully opened tree standing vertical in the cargo bike. And honestly, the Dutch probably still wouldn’t even give it a second glance.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5654.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5654_thumb.jpg\" /></a></p>\n<p>During this time we were there 2-3 other people picked up trees via cargo bike.  In fact, the guy noted to me he does deliveries of trees, and will easily fit two trees into an Urban Arrow at a time. He kerplopped our tree into the bike.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5655.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5655_thumb.jpg\" /></a></p>\n<p>Notably, because of the way the raised seat works, there’s actually no need for bungee cords. I brought some, but the tree just stays perfectly wedged in there. Even more so after we add a child or three atop it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5659.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5659_thumb.jpg\" /></a></p>\n<p>Once payment was completed, we loaded up the three kiddos. The Oldest Peanut decided to sit in the bike itself, lounge-style on the seat with her feet atop the tree limbs. She could have put her feet next to it on the ground, but this was more fun. The Middle Peanut stood on the main bar/beam the entire time. That’s her thing, she loves it. And the Littlest Nut is on the back seat strapped in. I sit on that saddle in between the back two kids. I have no idea what the middle child is shouting about in this picture. I can only presume the steeple in the distance has wronged her or something.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_5662.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_5662_thumb.jpg\" /></a></p>\n<p>A moment later, we’re off into the ebb and flow of Amsterdam bike lane traffic. Given the Urban Arrow is an electric bike, there’s really no problem with weight or such. In the grand scheme of silly things I’ve loaded on this bike, this is nothing. Like…it doesn’t even rank on the Top 10 list of <em>‘DCR’s Poor Cargo Bike Life Choices’.</em></p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_2948.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_2948_thumb.jpg\" /></a></p>\n<p>About the only thing to be aware of is simply seeing over the front of the tree, but that’s not too hard either. Also, when you stop at a light, it can be a bit tricky with the treetop sticking that far out, to push the signal button and not get clipped. But hey, ya figure these things out – it’s part of the fun.</p>\n<p>Far more tricky is simply keeping the Littlest Peanut from throwing her Santa hat and reindeer ears overboard at sporadic intervals. I should have repurposed some of those bungee cords for that.</p>\n<p>Our trek wasn’t too long, roughly 4KM back home (about 2.5 miles). We stopped a few times to take photos. This section of bike path under the highway has lights, which were set for red and green Christmas colors. Though there was a middle white light too, so it ended up not looking quite as cool as some years.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/IMG_2960.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/IMG_2960_thumb.jpg\" /></a></p>\n<p>Of course, as alluded to – cycling with a Christmas tree (cargo bike or not) is pretty much the norm here. Most people cycling with a smaller tree will use a regular bike, whereas most people going with a bigger tree will use a cargo bike. However, if you lack a cargo bike for a bigger tree (and don’t want to deal with renting one or delivery), people will simply place the tree laying down atop the front handlebars and seat, and then walk alongside it.</p>\n<p>In any event, another tree was successfully transported home by bike!</p>\n<p>If you want to watch the full video of last years’ shenanigans, then just hit up the play button below. Aside from using half a dozen GoPro’s, I promise it has virtually no tech in it whatsoever.</p>\n<p></p>\n<p>In case you missed some of the previous years, here ya go:</p>\n<p><a href=\"https://www.dcrainmaker.com/2016/12/cycling-home-with-the-christmas-tree.html\"><img src=\"https://media.dcrainmaker.com/images/2017/12/Velib2016.jpg\" /></a> <a href=\"https://www.dcrainmaker.com/2018/12/getting-the-christmas-tree-home-via-bike-2018-edition.html\"><img src=\"https://media.dcrainmaker.com/images/2019/12/ChristmasTree2018.jpg\" /></a> <a href=\"https://www.dcrainmaker.com/2019/12/getting-the-christmas-tree-home-via-bike-2019-edition.html\"><img src=\"https://media.dcrainmaker.com/images/2020/12/ChristmasTree2019.jpg\" /></a> <a href=\"https://www.dcrainmaker.com/2020/12/getting-the-christmas-tree-home-via-bike-2020-edition.html\"><img src=\"https://media.dcrainmaker.com/images/2021/12/ChristmasTreeBikeCrop.jpg\" /></a></p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"8279a3a7fa4cd5bfa2ccc363c0c8eb2a3956903054571f54dbfa288a745ddb71","category":"Cycling"}