{"title":"Parental Mental Health, Gender, and Lifestyle Effects on Post-Pandemic Child and Adolescent Psychosocial Problems: A Cross-Sectional Survey in Northern Italy","link":"https://www.preprints.org/manuscript/202405.1743/v1","date":1716808296000,"content":"Background: The exacerbation of psychosocial problems among children and adolescents during the coronavirus disease 2019 (COVID-19) pandemic necessitates an assessment of the long-term mental health impact of pandemic interventions. Focusing on both pandemic-related factors and demographic variables, such as gender and daily habits, an analysis was conducted to under-stand how these elements continue to affect young populations in the post-pandemic era. Methods: In April 2023, a comprehensive online survey was administered to families in South Tyrol, Italy, with children aged 7–19 years, to ensure age and gender representation. The survey included par-ent ratings and adolescent (11–19 years) self-reports using standardized instruments to measure the symptoms of mental health problems (Strengths and Difficulties Questionnaire, SDQ), anxiety (Screen for Child Anxiety Related Emotional Disorders, SCARED), and depression (Patient Health Questionnaire-2, PHQ-2). Statistical analyses included descriptive statistics, chi-square tests, and unadjusted odds ratios (ORs). Results: Of the 4,525 valid responses, 1,831 were self-reported by adolescents. Notable gender differences in mental health outcomes were identified, along with significant demographic predictors, such as age, single parenthood, parental mental health problems, and immigrant background. Negative effects were associated with reduced family climate and increased screen time, whereas physical activity showed beneficial effects. Proxy reports overestimated adolescents' mental health problems, whereas self-report tended to underestimate them. Conclusions: Persistent mental health problems and gender disparities high-light the need for a public health approach. This should include accessible support services, resili-ence building, targeted support for vulnerable families and gender-specific interventions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"827c85fd38aef79f4affa4d4c5871ff2e6c541d0d6303d603b24e5e5ea1a81ab","category":"Interdisciplinary"}