{"title":"Response of a patchy intertidal mudflat‐marsh transition zone to a typhoon","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12707?af=R","date":1728206723000,"content":"<h2>Abstract</h2>\n<p>While tidal marshes are valued for their ability to reduce the impact of storm waves on shores, there is still more limited understanding of how storm waves impact the integrity of tidal marshes, particularly in mudflat-marsh transition zones with patchy vegetation cover. This study aims to investigate changes in hydrodynamics, sediment bed elevation, and patchy vegetation cover along the sea-to-land elevation gradient in response to super typhoon IN-FA, making landfall in 2021 in a mudflat-marsh transition zone of the Yangtze Estuary (China). Utilizing in-situ measurements and drone surveys, our results show: (1) A landward decrease in storm-induced wave energy, flow velocities, turbulence, and erosion across a 200-m mudflat-marsh transition zone; (2) Elevation-dependent spatial reconfiguration of marsh vegetation patches in response to the storm; (3) Different marsh response below and above an elevation threshold where a shift between marsh gain and marsh loss occurred. The observed landward decrease in storm-induced marsh loss is attributed to a trade-off between reduced disturbances due to landward increasing friction from the sediment bed and vegetation, and the landward increasing capacity of the vegetation to cope with disturbances. Our findings provide new insights relevant to the response of marsh systems to storms, and highlight the importance of the gradual and adequately wide sea-to-land gradient in delivering marsh resistance to extreme events.</p>","author":"Liming Xue, \nBenwei Shi, \nKen Schoutens, \nTianyou Li, \nJianxiong Sun, \nYuxi Ma, \nYang Hu, \nZhenqiao Liu, \nDawei Wang, \nFei Xing, \nXiuzhen Li, \nStijn Temmerman","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"82879c14a83b6cdcf63d61ee7f58748f032a261505a4ece9b260dceee097e40e","category":"Environment"}