{"title":"The best wireless chargers for iPhone","link":"https://www.macworld.com/article/230820/the-best-wireless-chargers-for-your-iphone.html","date":1623844800000,"content":"\n<div>\n<section><div></div></section><p>Over the last few years wireless charging has gone from novelty concept to a conventional function of any modern iPhone. We won’t pretend that wireless charging is always an ideal substitute for plugging in, but it’s a very hassle-free way to keep your phone topped off throughout the day. Freed from the bother of plugging and unplugging, a wireless charger on your desk is as good a place as any to set your phone, knowing the battery is being steadily replenished, and ready for your next outing. A wireless charger by your bed makes it easy to grab and go in the morning, or just to “check one thing” without fussing with the lightning cable.</p>\n\n\n\n<p>We’ve tested a big heap of wireless chargers, and these are some of our favorites.</p>\n\n\n\n<p><em><strong><strong>Update 06/16/21:</strong></strong> Added reviews of the Moshi Sette Q dual charging pad and the RapidX Modula5 modular system.</em></p>\n\n\n\n<h2>MagSafe, the next generation</h2>\n\n\n\n<p>Apple officially gave up on its ambition to bring the <a href=\"https://www.macworld.com/article/3385086/apple-airpower-canceled.html\">AirPower wireless charger</a> to market back in 2019. Instead, the company has moved ahead with a far more useful and intriguing idea: MagSafe. It debuted on the iPhone 12 (every model) but we expect it to continue to be available on future iPhones.</p>\n\n\n\n<p>MagSafe combines a ring of magnets for secure attachment, an single-coil NFC to identify accessories, and a magnetometer to know when an item is attached, all around a more powerful Qi-based wireless charging coil (up to 15 watts, up from 7.5 watts in other iPhones). Note that a lot of devices are being billed as “MagSafe compatible,” but that doesn’t mean they support the faster charging or NFC—they merely have a ring of magnets in them. <a href=\"https://www.macworld.com/article/3609891/buyer-beware-magsafe-compatible-is-not-the-same-as-made-for-magsafe.html\">MagSafe compatible</a> is <em>not</em> necessarily real MagSafe.</p>\n\n\n\n<p>iPhones with MagSafe still work with regular Qi wireless chargers, they are just limited to the same 7.5-watt charging rate as earlier iPhones with them. And MagSafe is used for more than just charging—the magnetic attachment feature will make it possible to snap on all sorts of accessories.</p>\n\n\n\n<p>Since MagSafe accessories are not all just for charging, and require an iPhone 12, we’ll round those up in an article separate from this one.</p>\n\n\n\n<p><a href=\"https://www.macworld.com/article/3585789/iphone-12-magsafe-wireless-charging-cases-accessories.html\">Read more about MagSafe in our guide</a>.</p>\n\n\n\n<h2>The best wireless chargers</h2>\n\n\n\n<p>Wireless chargers tend to come in three variants: stands, pads, and multi-device chargers. A pad is great for your bed-side table or lying inconspicuously on your desk, but there are times when a stand makes more sense. In particular, they’re useful for iPhones with Face ID, as a good stand with a steep angle will point your phone at your face enough for Face ID to work. This makes it a lot easier to unlock your phone to quickly check something without taking it off the charger.</p>\n\n\n\n<p>Stands are great for reading your phone while it charges, but sometimes you want it to lie flat. It’s less conspicuous on your desk or bedside table, and easier to just plop it down in any direction. Wireless charging pads tend to be a little less expensive than stands, too.</p>\n\n\n\n<p>Now that AirPods have an optional wireless charging case and the Apple Watch is so popular, we’ve also seen an explosion of 2-in-1 and 3-in-1 chargers meant to charge several Apple devices at once.</p>\n\n\n\n<p>These are our picks for the best pad, stand, and multi-device charger, but there are a great many such products out there; you may find a different device at a different price better suits your priorities.</p>\n\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tLogitech Powered 3-in-1 Dock\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2020/03/logitech-3-in-1-100835243-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B08F4M67H8?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$99.99 at Amazon</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.logitech.com/en-us/products/chargers/powered-wireless-charging-3-in-1-dock.html?crid=1894&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$129.99 at Logitech</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section></section></article>Most iPhone users don’t really need a 3-in-1 wireless charging dock. It’s only of use if you have an iPhone, Apple Watch, and AirPods with the wireless charging case, and you really want to charge them all in the same place.<br /><br />If you want something clean and simple to put on your bedside table or desk to charge all that stuff at once, Logitech’s Powered 3-in-1 dock is a quality solution, though at $129, it’s going to cost you.<br /><br />The dock is a little on the large side, but with clean lines and a nice matte finish that keep it from being an eyesore. It also includes its own Apple Watch charger, while many similar docks require you to insert your own.<br /><br />The steep angle of the phone stand makes it easy to use your phone while it charges, and is well-placed to ensure Face ID works without requiring you to pick up your phone. The wide flat area to the left of the stand can charge any Qi-compatible device, including other phones or AirPods (with wireless charging case).<br /><br />I had no trouble charging my phone with a thick case on it, either on the stand or the pad area, and you don’t have to be too precise with the placement. The charging lights are tiny and dim, so as not to be distracting next to your bed at night.<br /><br />The charging cable is a proprietary DC barrel connector, which is more annoying than USB-C or micro-USB, but not uncommon on these multi-device chargers. The cable is at least thin and flexible, with a nice matte finish, and a built-in cable management tie.<br /><br />Logitech basically gets everything right about a dock that combines an iPhone charging stand, Apple Watch charger, and charging pad for AirPods (or other devices). The only real gripe I have is the price. If you see it listed for less than $100, it’s a good buy. Otherwise, there are other options that might not be quite as nice, but are a lot easier on the wallet.<br /><br /><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tMoshi Otto Q\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://m.media-amazon.com/images/I/4188kI+5jcL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B07GYD68MW?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$39.95 at Amazon</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.moshi.com/en/product/otto-q-wireless-charging-pad/nordic-gray/&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$39.95 at Moshi</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section></section></article>Moshi’s Otto Q is meant to look like furniture. Moshi says it’s “Inspired by Danish furniture” and the name is meant to invoke its purpose: an ottoman for your phone with Qi wireless charging. That might be a bit of a stretch, but the subdued grey fabric and slim profile does look good on almost any end table or nightstand.<br /><br />The charger uses a USB-C connection (yay!) and Moshi supplies a USB-A to USB-C cable (yay!) that is about a foot shorter than it really should be (boo!). The price—around $40—is reasonable but as there is no power adapter included, you’ll have to either use one of the many USB-A power adapter you probably have lying around or add the price of buying a new one.<br /><br />With the right adapter (one with 9V output like most Quick Charge adapters), the pad supports fast 7.5W charging for iPhones and 10W charging for supported Android phones. In fact, Moshi says it has been tested to be the fastest wireless charger by the German magazine Mac&amp;I. I don’t know about that (we don’t test charging speed of all wireless chargers), but it definitely charged up my iPhone 11 Pro quickly and reliably, even with a relatively thick case on it.<br />This is a great wireless charger, it just needs to cost a little less given that it doesn’t come with a power adapter and the included cable is shorter than I’d like.\t\t\t\t\t<p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tBelkin Boost Charge Wireless Charging Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/31UAEtIOkxL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.belkin.com/us/p/P-WIB001/&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$24.99 at Belkin</a> | <a href=\"https://www.amazon.com/dp/B07Q18RNVP?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$34.97 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><p><span> </span></p></section></article>Belkin’s Boost Up wireless charging stand always worked well, but we weren’t really fans of its high price and proprietary AC adaptor. Also, it was sort of ugly.<br /><br />With the new Boost Charge wireless charging stand, Belkin has made a couple of welcome tweaks. Instead of a proprietary power adapter that ends in a barrel plug, it uses a standard USB power adapter with micro-USB cable. That’s a great shift—there’s no real need for devices like this to give us yet another cable and plug we can’t use with any of our other gear.<br /><br />Unfortunately, the design is nearly identical. A couple of small LED charging indicator lights are gone, and the finish is matte instead of glossy, but that weird retro-future circular pod design is the same as it ever was. It’s comfortable and easy, but it doesn’t exactly look good on your desk.<br /><br />The stand supports 7.5W charging on iPhones, and for Android phones up to 10W, so you get the fastest charging available. I had no trouble getting a solid charging connection with a relatively thick case on my iPhone XS Max, too.<br /><br />The price is a lot more reasonable this time around. Where the previous model retailed for an extravagant $70, the new one tops out at $50. That’s still more than we’d like to pay for a basic plastic wireless charger, but it’s a lot more reasonable.\t\t\t\t\t<p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t</div>\n\n\t\t\n\n\n<h2>Other wireless chargers tested</h2>\n\n\n\n<p>While these other chargers weren’t our favorites, they may suit your own needs. There are only so many different ways you can wrap a copper coil in a hunk of plastic, so it’s safe to say that your own personal sense of style and pricing sensitivity might a different charger the right choice for you.</p>\n\n\n\n\t\t<div>\n\t\t\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tNomad Base Station Pro\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2020/09/base-station-pro-product-100859573-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://nomadgoods.com/products/base-station-pro&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$229.95 at Nomad</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section> At $230, the Base Station Pro costs several times more than most wireless charging pads. The included 30W USB-C power adapter and braided cable are certainly nice touches, and the hefty aluminum frame and leather pad have excellent build quality. But neither of those are reason enough to pay such a steep price.</section></article><br /><article><section><span>Rather, the price is meant to be justified by the 18 overlapping coils and custom power delivery hardware and software that allow you to charge three devices at a time, no matter where on the pad you place them.</span></section></article><br /><article><section>That’s handy and convenient, but you still can’t charge your Apple Watch on the pad. And no matter how fancy the design or materials, it’s hard to recommend paying $230 for the mild convenience of placing your device anywhere on the charger. Not when a decent charging stand effectively solves that issue as well. </section></article><p></p>\n\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/234636/nomad-base-station-pro-review.html\" target=\"_blank\">Nomad Base Station Pro review</a>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tModula5 wireless charging system\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/rapidx-modula5-duo.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0917FKMDM?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$63.17 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>u003cpu003eEach of the u0022podsu0022 of this system can charge either a phone/AirPods or an Apple Watch. Just buy as many pods as you need and snap them together on the left or right edge, then plug a single USB-C power cable into any one of them. Mix and match in whatever order you wish, up to 7 devices (with a maximum of 5 phones). You’ll need a fairly beefy USB-C power adaptor if you want to charge three or more iPhones at once, but you only need u003cemu003eoneu003c/emu003eu2014one plug, one cable. u003c/pu003e</p>\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>u003cpu003eThe premium price and somewhat utilitarian design are not worth it for individuals or couples with just a few devices, but families dealing with severe cable clutter are going to be very happy with this. The best value is the bundle with two phone pods and a 30W USB-C power adapter for about $80.u003c/pu003e</p>\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\tRead our full \n\t\t\t\t\t<a href=\"https://www.macworld.com/article/348725/rapidx-modula5-review-a-smart-modular-system-for-reducing-charger-clutter.html\" target=\"_blank\">Modula5 wireless charging system review</a>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tSette Q wireless charging pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/moshi-sette-q.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.moshi.com/en/product/sette-q-dual-wireless-charging-pad-with-adapter/nordic-gray/&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$99.95 at Moshi</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>u003cpu003eMoshi’s Sette Q is a generously big, high-speed, dual-charging pad. It’s available on its own for $90, but it’s only $10 more to get it with a 30W USB-C power adapter that has nice cable management cutouts, so the choice there is obvious. It’s bigger than it appears in a photo; large enough to easily put two u0022Plus Maxu0022 size iPhones next to each other without jostling for perfect placement. And it’s got the nice grey fabric design of the reset of Moshi’s u0022Qu0022 product line, including the matching USB-C cable.u003c/pu003e</p>\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>u003cpu003eThe pads support the Qi extended power profile (EPP) up to 15 watts, which is well in excess of what most phones are capable of. iPhones max out at 7.5 watts, and even Android phones with higher-rate wireless charging usually top out oat 10-12W. The bundled power adapter will charge two iPhones at 7.5W just fine, but if you want to charge two phone at 15W you need to use a 45W power adapter that supplies at least 15V at 3A. u003c/pu003e</p>\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<p>u003cpu003eThere’s a USB-A port along the front edge that seems all but dedicated charging an Apple Watch, as that’s one of the last remaining popular USB-A charging devices. Moshi even sells a little compact folding Apple Watch charger for $50 called u003ca href=u0022https://www.moshi.com/en/product/flekto-compact-folding-apple-watch-charger/silver?ref=category:46u0022u003eFlektou003c/au003e that is made to fit right in. That’s a bit pricey and it’s hard to recommend, but if you have need to charge two iPhones at the same time and want a nice big, reliable, attractive charging pad, the Settle Q (with power adapter) is not a bad choice.u003c/pu003e</p>\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tMoshi Lounge Q\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2020/06/moshi-lounge-q-100850486-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B08BHYPQ8Q?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$69.95 at Amazon</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.moshi.com/en/product/lounge-q-wireless-charging-stand/nordic-gray/&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$69.95 at Moshi</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section> Like the Otto Q charging pad, the Lounge Q stand is “Inspired by Danish furniture.” They’re quite obviously parts of the same line, with dark brushed metal accents and muted grey fabric. It’s industrial, but not cold and harsh-looking. I like the design a lot, and think it would look good on most desks or bedside tables.</section></article><br /><article><section><span>Like the Otto Q, the Lounge Q uses a proprietary coil design that Moshi says delivers the fastest wireless charging performance out there. With the right USB-C power adapter (not included) it can wirelessly charge up to 15W, but the iPhone wireless standard tops out at 7.5W.</span></section></article><br /><article><section>I don’t know if it’s the fastest you can buy—frankly all wireless charging is slow compared to plugging in. It does deliver a solid charge with multiple iPhones I tested, including those with a pretty substantial case on them. The pad slides up and down on the metal stand, so you can better place the coils to suit your phone. Move it up for a big phone, down for a smaller one, or all the way to the bottom if you want to turn your phone to landscape orientation to watch video while you charge.</section></article><br /><article><section>The included USB-C charging cable can’t be detached from the charger, which is kind of annoying, but it’s a nice matching grey color and a reasonable four-foot length, though I would prefer it be a little longer.</section></article><br /><article><section>You’ll need to supply your own USB-C power adapter, though. That’s not necessarily a bad thing, especially if you have a lot of them lying around, but it brings us to the Loungue Q’s biggest drawback: it’s price. $60 is a lot to spend on a wireless charger that doesn’t include a power adapter, despite the excellent design and build quality.</section></article><br /><article><section>This is a good buy if you can find it on sale. But with so many perfectly good wireless chargers out there, and not enough difference in performance between them, it’s not worth paying a premium for this one.<p> </p> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tLogitech Powered Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2020/04/powered-pad-black-product-image-1-100837362-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B086Q2SVHV?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$39.99 at Amazon</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.logitech.com/en-us/product/powered-wireless-charging-pad.950-000010.html?crid=1894#buy-powered-wireless-charging-pad&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$39.99 at Logitech</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section>Logitech’s Powered Pad is a perfectly suitable no-frills wireless charging pad. At $40 it’s not exactly a bargain, but it’s not overpriced, either.</section></article><br /><article><section><span>It’s a simple slab that wirelessly charges your iPhone or Android phone (up to 7.5W on iPhones, or 10W on compatible Android phones). I like that there are four matte colors—white, black, blue sage, and lilac—which might help match your decor if you plan to have this is a more open location like your living room.</span>I had no trouble charging my AirPods or iPhone with this, even when I put a relatively thick case on my phone. Your placement doesn’t have to be very precise, though the pad is perhaps smaller than you’d imagine.</section></article><br /><article><section>The Powered Pad comes with its own power adapter, which attaches to the pad via a barrel connector. That’s understandable on multi-device chargers that need more current, but on a simple single-device pad I prefer some sort of USB plug that could be used for other devices as well.</section></article><br /><article><section>The $40 asking price is a little on the steep side for a wireless charging pad, especially when the included power adapter can’t be used for your other devices. But this is a quality product that’s easy to recommend if you can find it on sale.<p><span> </span></p></section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tMophie Dual Wireless Charging Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2019/10/mophie-dual-wiress-pad-100814648-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/HN7Y2ZM/A/mophie-dual-wireless-charging-pad&amp;subid1=1-1-230820-0-0-0\" target=\"_blank\">US$69.95 at Apple</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section> The closest we may get to the long-lost AirPower experience may be something like Mophie’s 3-in-1 wireless charging pad, which has a spot for your phone, AirPods, and Apple Watch. That charger, and many others like it, are not quite the “place anything anywhere” experience that AirPower was going for, but it’s the next best thing.</section></article><br /><article><section>With Mophie’s Dual Wireless Charging Pad, the company obviously took the base of its 3-in-1 pad and put it in a different shell to make a charging pad that can charge two phones, or a phone and AirPods, at once. It’s available exclusively from Mophie and Apple, but the company makes a slighly more squarish-shaped version with a soft felt top surface that you can buy on Amazon for the same price. Beyond those cosmetic differences, it seems functionally identical.</section></article><br /><article><section>For its intended purpose, it works well enough. Place two phones (or AirPods with the wireless charging case) on either side and they charge reliably. It supports Apple’s 7.5W charging rate and I successfully charged phones with average-sized cases on them.</section></article><br /><article><section>There are two annoyances, however. First, as with many other Mophie products, the pad is powered by a rather large wall wart and a proprietary barrel connector. Either microUSB or USB-C would be preferred. Second, there are two distinct charging spots, clearly marked with a thin silver line, and you have to be quite particular about placing your devices right on them. Put them in the middle, and they won’t charge.</section></article><br /><article><section>When charging a single phone, I found myself often re-adjusting my placement in order to get the phone to start charging. That’s not what you want in any wireless charging pad; you want to drop it down and get a reliable charge. When charging two devices, one’s natural tendency to place them apart makes it easier to be “casually accurate.” You may think this is fine, because you’ll have your AirPods on one side all the time, but there’s no little divot for their placement like there is on Mophie’s 3-in-1 charger, and I found myself sometimes knocking them out of alignment by accident.</section></article><br /><article><section>The dual-charging pad has an extra USB-A port in the back. If I had to guess, I’d say this is the circuit for the Apple Watch charging pad in the 3-in-1, re-routed to a USB-A plug. This lets you plug in another cable, such as your Apple Watch charger, when necessary.</section></article><br /><article><section>If you have a side table, kitchen counter, or some other area where multiple people often place their phones to charge at the same time, this is a good solution. It’s a single, elegant, attractive pad that easily charges two phones at once with a port for another when needed. I think most wireless charging pads sit on desks or bedside tables where they are used by a single individual, and this is not the best solution for that.</section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAnker PowerWave 7.5 Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/31sP%2BlDKqTL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B083BTZY8Q?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$22.99 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article>Anker’s new PowerWave products greatly improve quality over its older wireless chargers, but they bump up the price to match.</article><br /><article>The new stand looks good, as long as you’re okay with the white color. A small blue charge indicator on the front is subtle enough to use on your bedside table. The angle is steep enough to make it suitable for unlocking your iPhone X with Face ID while your phone is resting on your desk.</article><br /><article>Anker includes a Quick Charge 3.0 compatible power adapter and a matching white microUSB cable, but the cable is way too short. Anker’s spec sheet says it’s three feet long, already a little on the short side, and we measured it at 34 inches. The charger supports 7.5W charging on Apple devices and the 10W fast charge mode on the latest Samsung flagship phones.</article><br /><article>The power coils inside cover the entire back of the stand, so we had no trouble charging our iPhones in either portrait or landscape orientation. A little cooling fan blows air out a vent in the rear to keep the charge coils cool, which keeps the charge rate from slowing down. If it’s especially quiet and you put your ear up next to it, you can hear the gentle whirring sound.</article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAircore 2-in-1 Wireless Charging Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/aircore-2-in-1.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.aukey.com/collections/wireless-charger/products/aircore-2-in-1-wireless-charging-stand&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$26.99 at Aukey</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\tAukey’s Aircore 2-in-1 stand is well-priced at around $30, though you’ll have to supply your own Quick Charge 3.0 compatible power adapter (it comes with a USB-A to USB-C cable).<br /><br />Available in black or white, it’s not the most attractive wireless charging stand, but it gets the job done. It easily charges an iPhone at up to 7.5 watts in either landscape or portrait orientation, and reliably charged my iPhone 12 even with a fairly thick case on it.<br /><br />On the back of the stand is an area for charing AirPods or AirPods Pro, which is a little more finicky about placement (but then, that’s typical of AirPods wireless charging).<br /><br />The downside to this stand is its light weight and small rubber feet. It tipped and slid around pretty easily when plunking my phone down or grabbing it in a hurry. While this does a good job of charging, I’d recommend a stand with a bit more heft to it.\t\t\t\t\t</p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tSamsung Fast Charge Wireless Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/41PpnYcQA-L.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B01BMDQ9U8?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$45.22 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><span>Like its flat charging pad cousin, Samsung’s fast-charging wireless stand isn’t much of a looker. The round shape is all wrong for a stand, as it sticks out awkwardly to the sides when you put your rectangular phone on it. Still, at least it loses the clear plastic coating in favor of a uniform glossy black finish.</span></article><br /><article><span>This stand is a good deal at around $40. It supports fast charging—both the iPhone 7.5-watt limit and faster speeds for Samsung’s phones—and it comes with a micro USB adapter powerful enough to enable it. There’s even a little fan inside that keeps the charging coils cool.</span></article><br /><article><span>Don’t worry, you can’t hear it unless you really strain in a very quiet room.The angle is appropriate for activating Face ID, and the stand resists tipping well enough that a little gentle phone use won’t cause it to wobble.</span> </article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tPrismo Wireless Charging Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/rapidx-prismo.jpeg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B08XN2K9YQ?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$24.99 at Amazon</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.rapidx.io/products/prismo&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$29.99 at RapidX</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\tMost wireless charging pads go out of their way to be unobtrusive, especially since they’re commonly used on nightstands and dressers. RapidX’s Prismo charger goes the other way.<br /><br />Its main distinguishing feature is a ring of RGB LED lights around the base. A small button on the bottom toggles it between nine different modes, including five solid colors and various pulsing and rotating variants. Though it’s not in the instructions, a long-press of the button will thankfully turn the light off.<br /><br />Ironically, this RGB LED ring never has anything to do with actually charging your phone. Instead, there’s a separate pinhole charging light on the top of the pad, which is quite dim.<br /><br />The pad is large and works well, with a good non-slip grip surface. And the $30 price isn’t bad, though you’ll need to supply your own QC 2.0 or 3.0 power adapter.\t\t\t\t\t</p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAirUnleashed\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2019/09/air_unleashed-100810334-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://airunleashed.com/&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$99.00 at AirUnleashed</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>Some multi-device chargers are trying to mimic AirPower with a wink and a nod. AirUnleashed </span><em>owns</em><span> it’s AirPower knock-off status. The site proudly proclaims, “By taking the technical design of the AirPower, and radically simplifying it, we managed to make a wireless charging mat that can deliver what Apple originally promised.”</span> </section></article><br /><article><section><span>The simple white pill-shaped design and soft-touch finish sure look like AirPower. The box looks like something from Apple, too; clean white with a simple product photo on top and the product name in Helvetica along the side.</span> </section></article><br /><article><section><span>But it’s not </span><em>quite</em><span> AirPower. There are design compromises, to start. An annoying seam around the edge where the felt-like bottom material meets the sleek top material. It has a permanantly-attached charging cable that ends in a USB-A plug, for which you have to supply your own power adapter. It only works with adapters that have an output current of at least 2A at 5V, so you can’t use the adpater that came with your iPhone. The company will happily sell you a Qualcomm Quick Charge 3.0 compatible 18W adapter for $19, or you can use an iPad adapter.</span> </section></article><br /><article><section><span>There are feature compromises, too. AirPower promised to let you place any Apple device that can be wirelessly charged at any place. AirUnleashed deliberately simplifies the design by requiring specific placement—phone on the left, watch in a little divot just right of center, and AirPods on the right.</span> </section></article><br /><article><section><span>It works, in that it charged my iPhone XS Max, Apple Watch series 4, and second-generation AirPods just fine. But if I have to put my watch in a specific spot, I’d rather have a vertical stand, because laying it flat doesn’t work well with loop-style bands like the Sport Loop or Milanese Loop. And if the power cable is going to be USB, making it permenantly attached seems like a mistake.</span> </section></article><br /><article><section><span>This is a reasonable cut-rate facsimile of AirPower, and the $99 price isn’t terrible, but if you aren’t going to have charge-anything-anywhere capability, there are better multi-device chargers that don’t require you to supply your own power adapter.</span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAnker PowerPort Wireless 5 Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/31-asE05T3L.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0753Z4PGC?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$21.99 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section></section></article>Anker’s PowerPort Wireless 5 stand is a decent choice for iPhone X users who want something with the right angle for Face ID, but a number of small annoyances keep it from being a clear winner.<br /><br />First, there’s charging speed. Anker employs two charging coils for excellent coverage, and as a result the stand works great whether your iPhone is in portrait or landscape orientation. But it’s limited to 5-watt speed, not the 7.5 watts supported by iPhones. And of course, that’s a bit slow for Android phones, too.<br /><br />Second, the base is just a little bit too short. The result is that, when you try to use your phone while it’s on the stand, your tapping will constantly cause it to tip back a little. If the base extended back even a half inch more, this would probably be avoided.<br /><br />And finally, while the price tag looks pretty good (typically around $27 online), that’s without a micro USB adapter. It’s still not overpriced, but it’s not the bargain it seems at first.\t\t\t\t\t<p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAnker PowerWave 7.5 Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/314BN5PRKeL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><span>Anker’s new PowerWave products greatly improve quality over its older wireless chargers, but they bump up the price to match.</span></article><br /><article><span>The new pad is a rather plain large off-white circle. If that aesthetic goes with your desk or bedside table, that’s great, but we can’t help but wish for a black version. There’s a small blue circle charge indicator on top—we’re not a fan of the location, but the glow is dim enough not to be distracting in a dark room. The charging “sweet spot” is large enough that you don’t have to be too precise about how you place your phone down on the pad.</span></article><br /><article><span>Anker includes a Quick Charge 3.0 compatible power adapter and a matching white microUSB cable, but the cable is way too short. Anker’s spec sheet says it’s three feet long (we would hope for five or six), and we measured it at 34 inches. The pad supports 7.5W charging on Apple devices and the 10W fast charge mode on the latest Samsung flagship phones.</span></article><br /><article><span>Anker’s PowerWave products feature cooling fans to keep the charge coils from getting too hot, which can degrade charging speed. If you listen closely in a quiet room, you can hear the little fan inside whirring away.</span></article><br /><article><span>For the price, we would hope for a longer microUSB cable and sturdier construction. The PowerWave 7.5 pad feels a little lightweight and plastic-y, more than the PowerWave Stand, and it’s too easy to accidentally slide around your desk as a result. Anker needs to give it a little more heft to help keep it in place.</span><section></section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tSamsung Wireless Charging Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/31mKAuDAywL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B00UCZGS6S?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$24.99 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>If you’re not opposed to the big Samsung logo staring up at you from your desk, you could do a lot worse than this inexpensive pad. For less than $30 you get a solid, no-slip pad with a generous size—it’s easy to drop your phone on and start a wireless charging connection without needing to be too fussy about placement.</span></section></article><br /><article><section><span>Best of all, Samsung throws in a 2A micro USB power adapter, so you don’t need to repurpose one of your own or buy a new one. While this is not a “fast charging” wireless pad, it wasn’t really much slower than the fastest chargers we tested; at least, not when charging iPhones. Some Android phones can handle faster wireless charging speeds.</span> </section></article><br /><article><section>T<span>his is one of the uglier charging pads we’ve used, but it’s inexpensive, solid, and works well.</span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tAircore 3-in-1 Wireless Charging Stand\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/aircore-3-in-1.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.aukey.com/collections/wireless-charger/products/3-in-1-wireless-charging-station-stand&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$24.64 at Aukey</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\tThe Aircore 3-in-1 is a lot like the AirCore 2-in-1, only made for those who need to charge their Apple Watch as well. It’s well priced under $30, but it’s hard to recommend unless you can live with a bit of wobble and a light that never turns off.<br /><br />The phone charging stand is like that on the 2-in-1, well-suited to iPhones with thick cases and capable of charging in portrait or landscape orientation. Next to it you’ll find a spot to charge AirPods and a stand for your Apple Watch. As with many such stands, you’ll have to supply your own Apple Watch charging puck, routing the cable through the base.<br /><br />You’ll also need to supply your own power adapter, as the stand only comes with a USB-A to USB-C cable.<br /><br />While the charging itself works fine, the stand would tip back precariously every time I plunked my phone down on it. This wobbling wasn’t enough to dislodge AirPods or an Apple Watch, but it’s pretty sloppy-feeling. I’m also not in love with the way the LED lights shine blue continuously (or green if a device is charging). They’re not too bright, but I wouldn’t want it on my bedside table.<br /></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tMophie Wireless Charge Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/314BvgSPGIL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B075M4ZH17?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$18.87 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>One of the very few wireless charging pads </span><a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/HL812ZM/A/mophie-wireless-charging-base&amp;subid1=1-1-230820-0-0-0\">sold at Apple Stores ($59.95)</a><span>, Mophie’s wireless charging base is a quality piece of gear. But I still don’t like it all that much.</span> </section></article><br /><article><section><span>It’s a good size, heavy, with a nice rubberized outer coating that prevents slipping. It’s easy to drop your iPhone on it and get a good charging connection without thinking about it. And it supports 7.5W charging, too.</span> </section></article><br /><article><section><span>But it has two big strikes against it. First, it’s sixty bucks. You can get good quality wireless charging pads, with adapter, for half that price. Second, the AC adapter connects to a little round DC barrel connector, while most other wireless charging pads use micro USB. Using USB would be far more flexible and convenient—you could plug into dozens of different products, like your laptop, and micro USB cables are everywhere. We have a drawers full of them.</span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tBelkin BOOST UP Wireless Charging Pad\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images-na.ssl-images-amazon.com/images/I/31uj78dWJPL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B075M59ZB7?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$34.90 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>Belkin’s Boost Up shares a lot in common with Mophie’s Wireless Charging Base. Both started off at as Apple Store exclusive. Both are large, with a rubberized non-slip bottom (the Mophie has non-slip coating all over). Both support 7.5W charging on your iPhone, too.</span> </section></article><br /><article><section><span>But the Boost Up shares the Mophie’s downsides, too. It costs about $60, nearly double the price of many other wireless chargers. And it includes an AC power adapter that connects to the charger via DC barrel connector rather than micro USB. Again, USB would be far more convenient.</span> </section></article><br /><article><section><span>The main difference between the Belkin and the Mophie, then, is your own personal sense of aesthetics. Do you like the matte black rubberized circle of the Mophie base, or do you like the glossy white Belkin, with its reversed slope giving it a sort of “floating” look? It’s really up to you, but we wouldn’t recommend either, based purely on the price and lack of USB connection.</span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tLetscom W01 3-in-1 Wireless Charger\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://m.media-amazon.com/images/I/41O64+vXhcL.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B08B66CVCZ?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$23.99 at Amazon</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>Letscom’s 3-in-1 charger will charge your iPhone, AirPods, and Apple Watch all for the bargain-basement price of about $27 (and it’s often on sale for even less). Too good to be true? Not when you take a closer look!</span> </section></article><br /><article><section><span>First, while this does come with a fairly short USB-to-USB-C cable, it does </span><em>not</em><span> come with a power adapter. And to get proper charge, you need to plug it into a power adapter that supports the Quick Charge 2.0 or 3.0 standard—you can’t use a basic 5V/1A USB adapter. So you can add that to the cost.</span> </section></article><br /><article><section><span>It also doesn’t come with an Apple Watch charger. There’s a special cutout for you to slot in your Apple-made Watch charger, coil up the loose cable, and plug it in to the internal USB-A port.</span> </section></article><br /><article><section>O<span>nce you get that sorted, the charging pad does work well enough. The charging “sweet spot” for the phone and AirPods spots is a little on the small side, but once you set your gear down in the right place, it will charge fine.</span></section></article><br /><article><section><span>This thing is also </span><em>incredibly</em><span> cheaply made. It’s lightweight, cheap plastic all the way, with obvious plastic seams and a chintzy plastic door for the Apple Watch compartment.</span></section></article><br /><article><section><span>But it is </span><em>really</em><span> inexpensive (if you don’t count the costs of the power adapter and Apple Watch charger you need to supply) and it </span><em>does</em><span> work. If you want a 3-in-1 charger on the cheap, here you go.</span><span></span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t\t<div></div>\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>\n\t\t\t\t\t\t\tQimini Pocket Wireless Charger\t\t\t\t\t\t</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://images.idgesg.net/images/article/2018/01/qimini-pocket-02-100747934-orig.jpg?quality=50&amp;strip=all\" /></div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t</div>\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.myqimini.com/order.php&amp;xcust=1-1-230820-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$59.95 at Qimini</a>\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<p>\n\t\t\t\t\t\t</p><article><section><span>We’re not entirely sure who this product is for, exactly. It’s a wireless charging pad with an integrated USB cable that tucks away inside. That’s sort of neat and makes it a little more portable, but you still need something to plug the USB plug into. If you’re on the go, you can plug it into your laptop or something like that, but do you really need a </span><em>wireless</em><span> charger for that?</span> </section></article><br /><article><section><span>The Qimini site proclaims it to be, “The world’s thinnest wireless charger plate to date,” but the Anker Powerport Wireless 10 is definitely thinner. It sells for $59.95, without a power adapter, which easily twice what it’s worth. Oh, and it maxes out at 5W output, so it’s one of the slower wireless chargers out there.</span> </section></article><br /><article><section><span>The Qimini Pocket works, and it’s not a bad design, but it’s slow, expensive, and frankly a bit too large to fit in many pockets. We like the idea of an integrated USB cable, but that’s about all we like about this.</span> </section></article><p></p>\n\t\t\t\t\t\t\t\t</div>\n\t\t\t<div></div>\t\t</div>\n\n\t\t\n\n\n<p>Are you interested in a charger you don’t see listed here? That’s not surprising—while we try to cover the most popular brands, there are literally hundreds of wireless chargers on the market. We can still help make sure you get a product you’re happy with, though. The next page contains some helpful general advice to consider when deciding which wireless charger to buy.</p>\n\n\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"828846db210cfc0f340dc2ed1671dbf74037b41bddad9b1575ce956e73843287","category":"Apple"}