{"title":"Numeric social-media posts engage people with climate science","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae250/7701642?rss=1","date":1719619200000,"content":"<span><div>Abstract</div>Innumeracy (lack of math skills) among nonscientists often leads climate scientists and others to avoid communicating numbers due to concerns that the public will not understand them and may disengage. However, people often report preferring to receive numbers; providing them also can improve decisions. Here, we demonstrated that the presence vs. absence of at least one Arabic integer in climate-related social-media posts increased sharing up to 31.7% but, counter to hypothesis, decreased liking of messages 5.2% in two preregistered observational studies (climate scientists on Twitter, <span>N</span>  <span>&gt;</span> 8 million Tweets; climate subreddit, <span>N</span>  <span>&gt;</span> 17,000 posts and comments). We speculated that the decreased liking was due, not to reduced engagement, but to more negative feelings towards climate-related content described with numeric precision. A preregistered within-participant experiment (<span>N</span> = 212) then varied whether climate consequences were described using Arabic integers (e.g. “90%”) or another format (e.g. verbal terms, “almost all”). The presence of Arabic integers about consequences led to more sharing, wanting to find out more, and greater trust and perceptions of an expert messenger; perceived trust and expertise appeared to mediate effects on sharing and wanting to find out more. Arabic integers about consequences again led to more negative feelings about the Tweets as if numbers clarified the dismaying magnitude of climate threats. Our results indicate that harnessing the power of numbers could increase public trust and concern regarding this defining issue of our time. Communicators, however, should also consider counteracting associated negative feelings—that could halt action—by providing feasible solutions to increase people's self-efficacy.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"82b8a3576f7ae06179d45f97269ff6a6ae5b8a20fb88359d80e4d906ca5d1f3a","category":"Interdisciplinary"}