{"title":"Apple Signs New Deal With Arm to License Chip Designs Beyond 2040","link":"https://www.macrumors.com/2023/09/06/apple-inks-new-deal-arm-chip-designer/","date":1693986546000,"content":"Apple has signed a new deal with British chip design company Arm to license its chip technology that extends beyond 2040, reports <em><a href=\"https://www.reuters.com/technology/apple-inks-new-long-term-deal-with-arm-chip-technology-filing-2023-09-05/\">Reuters</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/02/arm-logo-blue-bg.jpg\" alt width=\"1600\" height=\"900\" />\r<br />\nNews of the deal emerged in documents filed on Tuesday for Arm's initial public offering, which the company has priced at $52 billion. \r<br />\n\r<br />\n\"We have entered into a new long-term agreement with Apple that extends beyond 2040, continuing our longstanding relationship of collaboration with Apple and Apple's access to the Arm architecture,\" said Arm in the IPO document.\r<br />\n\r<br />\nArm's hardware underpins all of Apple's custom silicon processors such as the A15 in the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> and the <a href=\"https://www.macrumors.com/guide/m2/\">M2</a> in the MacBook Pro, since Apple licenses the Arm instruction set. \r<br />\n\r<br />\nThe document reveals that companies including Apple, AMD, Google, Intel, Nvidia, Samsung, and TSMC, have \"indicated an interest\" in buying \"up to an aggregate\" of $735 million in Arm shares. TSMC, the world's largest contract chipmaker, has said it will decide this week whether to invest in the chip designer. By holding Arm's shares, chipmakers will hope to have sway over Arm's management.\r<br />\n\r<br />\nJapan-based SoftBank has been preparing for an IPO since its plan to sell Arm to Nvidia became <a href=\"https://www.macrumors.com/2021/12/02/ftc-lawsuit-block-nvidia-arm-acquisition/\">subject to regulatory scrutiny</a>. California-based Nvidia in January 2022 <a href=\"https://www.macrumors.com/2022/02/08/nvidia-abandons-arm-acquistion/\">abandoned</a> the purchase when it became clear that the deal would be blocked by the FTC.\r<br />\n\r<br />\nThe relationship between Apple and Arm is one of the longest in the chip business – Apple was one of the first companies to partner with the firm when it was founded in 1990, prior to the release of Apple's Newton handheld computer, which used an Arm-based chip.\r<br />\n<ul><li><a href=\"https://www.macrumors.com/2023/01/14/apples-biggest-hardware-flops/\">Apple's Biggest Hardware Flops of All Time</a></li></ul>\r<br />\nThe Newton was a <a href=\"https://www.macrumors.com/2023/01/14/apples-biggest-hardware-flops/\">flop</a>, but Arm wasn't. It went on to develop integrated circuit design data that is generally considered to be the \"blueprint\" for semiconductors. Arm licenses its chip designs to over 500 companies, and its architecture is used in 95 percent of the world's smartphones.<div>Tag: <a href=\"https://www.macrumors.com/guide/arm/\">Arm</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/09/06/apple-inks-new-deal-arm-chip-designer/\">Apple Signs New Deal With Arm to License Chip Designs Beyond 2040</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-signs-new-deal-with-arm-to-license-chip-designs-beyond-2040.2400573/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"82bdc1cc4e3112329ff803146b0d8b802598d9bff2723e0bdd18e0f2619a9cc3","category":"Apple"}