{"title":"Progress and future of China's aquatic ecological environment protection","link":"https://onlinelibrary.wiley.com/doi/10.1002/rvr2.87?af=R","date":1719375066000,"content":"<h2>Abstract</h2>\n<p>Safeguarding water resources, aquatic habitats, and ecosystems is paramount for the well-being of the populace, the future of the nation, and the sustainable development of China. With the relentless progression of ecological and environmental protection and the establishment of an ecological civilization, China's aquatic ecological environment protection has undergone five decades of exploration. The water environment protection paradigm has gradually transitioned from emphasizing pollutant emission concentration control and total pollutant emission control to prioritizing water environment quality improvement. Particularly in the past decade, regions nationwide have conducted proactive explorations and practices in source control, emission abatement, and quality enhancement. This paper systematically reviews the achievements in China's water environmental quality improvement and the characteristics of water environment management at various stages over the past half-century. Considering the deployment of “three waters” coordination (water resources, water environment, and water ecology), green development, pollution, carbon reduction, and so forth, this paper analyzes the challenges confronted by China's aquatic ecological environment protection. Finally, future directions are prospected from six aspects: green development, climate change response, water resource allocation optimization, collaborative governance of multiple pollutants, aquatic ecological protection strengthening, and intelligent management improvement.</p>","author":"Jinnan Wang, \nMin Xu, \nGuoshuai Zhang, \nTao Zhang, \nDong Wang, \nHongkuan Zang, \nXiaoshu Hou","siteTitle":"Wiley: River: Table of Contents","siteHash":"0b74d58d2572beb2996093d38ec1aeffad4d7646e8152f056f56cbe7cdd98b36","entryHash":"82befb0fb9d7f628e4b16ec37671b6c4a0b3b7138530dc64bc06c79f38cc117a","category":"Environment"}