{"title":"The secret to a successful wine pairing? Fats have an affinity for tannins","link":"https://arstechnica.com/?p=1748648","date":1616496302000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/pairing1-800x533.jpg\" alt=\"Manchego cheese slices and pieces in a cutting board shot on dark rustic wooden table, with glass of red wine.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/pairing1.jpg\" class=\"enlarge-link\" data-height=\"800\" data-width=\"1200\">Enlarge</a> <span class=\"sep\">/</span> The traditional cheese and charcuterie board is generally considered an excellent pairing for a classic bold red wine. A new study finds that the secret is an interaction between the tannins in wine and lipids in the cheeses and meats. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.gettyimages.com/\">cafotodigital/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Wine aficionados know that a well-paired wine enhances the flavors of whatever foods one consumes, while a poorly paired wine does the opposite. And some foods can, in turn, influence the flavors in a wine. Is there any better accompaniment to one's favorite cheeses and/or cured meats than a good bottle of Bordeaux or a California Cabernet? A team of French scientists specifically explored the role of interactions between the <a href=\"https://en.wikipedia.org/wiki/Tannin\">tannins</a> in wine and fatty molecules known as <a href=\"https://en.wikipedia.org/wiki/Lipid\">lipids</a> in foods to better understand what is happening at the molecular level with such complementary pairings, according to <a href=\"https://pubs.acs.org/doi/full/10.1021/acs.jafc.0c06589\">a recent paper</a> published in the Journal of Agricultural and Food Chemistry.</p>\n<p>Of course, taste in wine is highly subjective to the individual; we all have different combinations of <a href=\"https://en.wikipedia.org/wiki/Taste_receptor\">taste receptors</a> that influence <a href=\"https://blogs.scientificamerican.com/cocktail-party-physics/tasters-choice-why-i-hate-raw-tomatoes-and-you-dont/\">how we perceive flavors</a>. But some characteristics are quantifiable: bitterness, sweetness, sourness, and the body (or weight) of a wine. That's the basis for the art and <a href=\"https://www.scienceofcooking.com/food-and-wine/science-of-food-and-wine-pairing.html\">science of wine pairings</a> in most fine-dining restaurants. The tannins in wine are polyphenolic compounds responsible for much of the bitterness and astringency in a given wine; they're derived from the skins and stems of the grapes, or as a result of aging in oak barrels. Tannins pair well with proteins and fats, which offset their astringency and bitterness. That's why wines with a heavier tannic component (such as Cabernet Sauvignon or Barolo) go so well with cheeses and charcuterie.</p>\n<p>The degree of residual sugar—how much sugar remains after fermentation—determines the sweetness of a wine. Very dry wines have almost no residual sugar, while very sweet dessert-type wines, such as Sauternes or tokays, have high residual sugars. Sweeter wines pair well with spicy cuisines, for instance, because the sugar contrasts with the heat of the food. Acidity is a measure of how sour a given wine is, and there are three primary acids in wines. Malic acid confers a kind of green apple flavor; lactic acid confers a milky component; and tartaric acid will give wine additional bitter flavors. Wines that are more acidic pair with fatty, oily, rich, or salty foods because the acids will offset those qualities on the palate.</p></div><p><a href=\"https://arstechnica.com/?p=1748648#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1748648&comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"82c066a8f1c817d4fa9ab5160ad6e00fc621b6d0f301fd1d19bbfe3509c4e19d","category":"Tech"}