{"title":"Google sends anti-regulation propaganda to small businesses using Google Maps","link":"https://arstechnica.com/?p=1811468","date":1636484580000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Google-Monopoly.jpg\">Enlarge</a> <span>/</span> Let's see, you landed on my \"Google Ads\" space, and with three houses... that will be $1,400.  (credit: Ron Amadeo / Hasbro)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Google is quietly enlisting the help of small businesses to protect the nearly $2 trillion company from antitrust regulations. In response to congressional bills like the \"<a href=\"https://arstechnica.com/tech-policy/2021/06/house-committee-oks-big-tech-breakups-and-massive-fines-in-antimonopoly-push/\">Ending Platform Monopolies Act,</a>\" which would ban platform owners from favoring their own services over the competition, Google is telling small business owners that these bills would hurt their ability to find customers online and that they should contact their congressperson about the issue.</p>\n<p>We've seen Google do political action before, usually in the form of headline-grabbing <a href=\"https://www.blog.google/around-the-globe/google-europe/android-has-created-more-choice-not-less/\">blog posts</a> from CEO Sundar Pichai defending the latest product-bundling scheme. The strategy here seems new, though; rather than writing a public blog post, Google is quietly targeting users who have registered business listings on Google Maps. These users report receiving <a href=\"https://twitter.com/MattNavarra/status/1455904634850140160\">unsolicited emails</a> and an \"<a href=\"https://www.nearmedia.co/does-the-gmb-rebranding-mean-more-or-less-than-google-say/\">action item</a>\" in the Google Business Profile UI that both link to Google's new anti-antitrust site.</p>\n<p>Both the email and Google Business action item beg for a click, saying, \"New laws may impact businesses. Proposed legislation could make it harder to find your business online.\" Both items link to <a href=\"https://about.google/stayinformed/policy-that-could-impact-your-business/\">this site</a>, which is full of scary language imploring users to \"stay up-to-date on proposed legislation that could impact your business.\" The site recommends concerned users sign up for Google's new political action mailing list, with the sign-up form saying, \"By clicking this button, I consent that Google can contact me about legislative and regulatory issues, events, and advocacy opportunities related to my business.\"</p></div><p><a href=\"https://arstechnica.com/?p=1811468#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811468&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"82c1aba5399f3873e5f665aab0967c9b9e0ab1447bfd8cd23e7e258dfb75fc65","category":"Tech"}