{"title":"Forecasting Patient Early Readmission from Irish Hospital Discharge Records Using Conventional Machine Learning Models","link":"https://www.preprints.org/manuscript/202410.1476/v1","date":1729248404000,"content":"Predicting patient readmission is an important task for healthcare risk management, as it can help prevent adverse events, reduce costs, and improve patient outcomes. In this paper, we compare various conventional machine learning models on a multimodal dataset of electronic discharge records from an Irish acute hospital. We \\khoi{evaluate the effectiveness of several widely-used Machine Learning models} that leverage patient demographics, historical hospitalization records, and clinical diagnoses codes, to forecast future clinical risks. \\khoi{Our work focuses on addressing two key challenges in the medical fields: data imbalance and the variety of data types in order to boost the performance of Machine Learning algorithms. Through extensive benchmarking and the application of a variety of feature engineering techniques, we successfully improved the Area Under the Curve (AUROC) score from 0.628 to 0.7 across our models on the test dataset}. Furthermore, we also employ \\khoiz{Shapley Additive Explanations (SHAP)} value visualization to\\reviewertwo{v  In the abstract line 6 SHAP is mentioned in initials should be written in details: SHAP (SHapley Additive exPlanations).} interpret the model predictions and identify both the key data features and disease codes associated to readmission risks, identifying a specific set of diagnoses codes that are significant predictors of readmission within 30 days. Our study demonstrates how we effectively utilize the routinely collected hospital data to forecast patient readmission through the use of conventional machine learning while applying explainable AI techniques to explore the correlation between data features and patient readmission rate.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"82c40f2b2094eb9334138317fc16087d0613c203b1ce94ad37e49115ca2c367c","category":"Interdisciplinary"}