{"title":"The gambler: Rui Costa's tactics make no friends, but deliver victory","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-gambler-rui-costas-tactics-makes-no-friends-but-delivers-victory","date":1694372584000,"content":"\n      <p>The tension between having to work together as a group in order to ensure their collective survival, while simultaneously plotting a way to ultimately defeat them, is one of the most fascinating aspects of professional cycling, especially on days like today’s <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> stage 15 which has been designed to be contested by canny breakaway specialists. It’s a dynamic of comradeship and betrayal that makes the sport so humanly relatable, and has similarly fuelled countless dramas in fictional storytelling. Take the Humphrey Bogart western The Treasure of Sierra Madre, in which a band of down-and-out prospectors travel to the remote Mexican mountains and work together in order to discover gold, only to descend into conflict and paranoia upon finding it as each one greedily hungers after the fortune. However well a group of temporary allies work together in order to secure their first goal, they’re inevitably going to fall out eventually.</p>\n<div></div>\n<p>The tension within a breakaway is especially pronounced, too, as there is no way for them to diplomatically share the prize between each other — there can be one winner and one winner alone. Therefore it’s often the craftiest and most cunning rider, rather than the one with the strongest legs, who takes the spoils.</p>\n<p>And there isn’t a rider craftier or more cunning in the peloton than Rui Costa, who won stage 15 with a vintage display of breakaway gamesmanship. Over the many years of his long and decorated career, the Portuguese rider has become notorious in the peloton, and not all for good reasons. Numerous pros and ex-pros have spoken how much they disliked riding with him, due to his tendency of not taking turns or helping out in breakaways. He’s seen as someone who looks out for himself, and cynically won’t abide by some of the unwritten rules of the peloton that maintain good relations between opponents.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-16-preview\"><strong><em>Read more: Vuelta a España 2023 stage 16 preview: an explosive finish</em></strong></a></p>\n<p>But another thing Rui Costa has a reputation for is winning a lot, particularly from breakaway situations. His heyday was way back during the early years of the last decade, and he won three Tour de France stages in the years between 2011-2013. His first came in 2011 at a stage finishing atop Super-Besse, when he rode away from the rest of a small breakaway group. He then won twice in 2013 each in similarly hilly terrain, the first time from a big 26-man group in Gap, then three days later when he caught and passed Pierre Rolland to triumph at La Grand Bornand. That same year, he even won the World Championships road race with a similarly smart and well-timed ride, denying his star-studded breakaway companions Vincenzo Nibali, Alejandro Valverde, and Joaquim Rodríguez the title.</p>\n<p>It had however been a long time since the 36-year-old last enjoyed success at such a high level. The last decade has seen him gradually become a declining force, a rider we see up in the business end of races less and less, and for whom the wins were drying up. Only this year, following his move to the Intermarché–Circus–Wanty team, has he suddenly started looking like his old self, starting the season a rejuvenated rider by winning the Trofeo Calvia classics on his first race riding for the team followed by the overall classification at Volta a la Comunitat Valenciana. He was quieter at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, where he featured in a few breakways without making an impression, but proved today that his comeback was not just temporary with his biggest win for years, and one of the biggest of his old career.</p>\n<p>The performance to win stage 15 was vintage Rui Costa, and exemplified what makes him a master of the dark arts of winning from a breakaway. He picked just the right moment to jump out of the day’s breakaway, reacting with Santiago Buitrago to an attack by Jimmy Janssens, who made the move ahead of an intermediate sprint and just prior to the final climb of the day, Puerto de Zuarrarrate. While Janssens had the points classification on his mind (he was taking the points on behalf of his Alpecin-Deceuninck teammate and green jersey leader Kaden Groves), Rui Costa was already plotting how to win the stage, and sensed that getting a headstart over the rest of the break would be to his advantage. Yet he was also conscious of using up too much energy, especially while riding with a clearly superior climber in Buitrago, and so refused to take a turn.</p>\n<p>It was a difficult balance to strike for Costa, who had to assess whether he could afford not to work with Buitrago to build a big enough buffer over the chasers (among them dangerman Remco Evenepoel), and hope that Buitrago would not sit up at his refusal to help. Thankfully for him, the Colombian did indeed keep working despite being understandably frustrated by the lack of help, while behind Evenepoel began to fall away and the rest of the chase floundered (Is it giving too much credit to Rui Costa to suggest he also deduced Evenepoel was not on his best day, and was therefore less worried about helping Buitrago ensure a big safety net between themselves and he?).</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230910VUE02003-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1694372260\" alt=\"Rui Costa, Vuelta a España\" /></p>\n<p>There was one rider who did still manage to put his hat in the ring for the stage honours — Lennard Kämna. The Bora-Hansgrohe rider attacked the chasing group and joined the leading duo just before the summit, and was similarly incensed as Buitrago by their companion’s stubborn refusal to share the workload. This seemed to fluster the German, who betrayed his eagerness to rid himself of them by putting in several attacks — and it might just have been this very frustration that led to his undoing. Kämna did manage to get a small gap on the descent, only to then dramatically overdo a corner, and come to an abrupt halt. While Rui Costa remained calm and approached coolly, Kämna seemed to lose his head, and paid the price for it.</p>\n<p>That said, Kämna somehow managed to remount quickly and, fuelled by adrenaline, charged back to the duo and joined them on the finishing straight. He was no doubt aided by Rui Costa’s antics, who once again declined to help Buitrago, and this time Buitrago refused to play ball, therefore allowing an opening for Kämna to rejoin them.</p>\n<p>It was arguably Rui Costa’s biggest gamble yet, doubling the number of riders he had to defeat in the sprint finish to take the stage. Yet it was a gamble that paid off handsomely, as the veteran proved to be the freshest in the finishing sprint and claimed the stage victory.</p>\n<p>As an approach to winning the stage, it was the polar opposite of Evenepoel’s victory yesterday. Evenepoel was generous to a fault in the way he takes the burden of pace-setting in a group, and seems to care nothing for preserving energy, even appearing happier riding in the wind than in someone’s slipstream. The miserly Rui Costa, by contrast, appears to think of little else other than how he can avoid burning matches, and reaped the rewards by defeating riders who surely had better legs than him. Evenepoel himself looked the strongest of all the riders earlier in stage 15, but appeared to pay for the many efforts he made making attack after attack. It won him a lot of friends, support and fans among those admiring his courage and eagerness to entertain; but it was the anti-Remco Rui Costa who won no friends in the peloton for his approach who won the stage.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"82caf5c0d782873ff7428ca35eaa88a9035711bd629562827ec08493c3abf26d","category":"Cycling"}