{"title":"Getting “forever chemicals” out of drinking water is expensive","link":"https://arstechnica.com/?p=1995880","date":1705337462000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/water-treatment-800x600.jpg\" alt=\"aerial view of water treatment plant\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/water-treatment.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/aerial-top-view-large-circle-water-treatment-plant-royalty-free-image/1447666164\">Wachirawit Jenlohakit via Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Situated in a former sand and gravel pit just a few hundred feet from the Kennebec River in central Maine, the Riverside Station pumps half a million gallons of fresh groundwater every day. The well station processes water from two of five wells on either side of the river operated by the Greater Augusta Utility District, or GAUD, which supplies drinking water to nearly 6,000 local households. Most of them reside in Maine’s state capital, Augusta, just a few miles to the south. Ordinarily, GAUD prides itself on the quality of its water supply. \"You could drink it out of the ground and be perfectly safe,\" said Brian Tarbuck, GAUD's general manager.</p>\n<p>But in March 2021, environmental sampling of Riverside well water revealed trace levels of per- and polyfluoroalkyl substances (PFAS), or \"forever chemicals,\" as they're better known. The levels at Riverside didn't exceed Maine's drinking water standard of 20 parts per trillion (ppt), which was a relief, Tarbuck said. Still, he and his colleagues at the utility were wary. PFAS have been linked to a variety of health problems, and Maine lawmakers at the time were debating an even stricter limit for the chemicals. Tarbuck knew a lower standard was coming someday. The only question was when.</p>\n<p>As it turns out, a tougher standard is expected early this year. That's when the US Environmental Protection Agency is set to finalize an <a href=\"https://www.federalregister.gov/documents/2023/03/29/2023-05471/pfas-national-primary-drinking-water-regulation-rulemaking\">enforceable cap</a> on PFAS in drinking water that will require GAUD and thousands of other utilities around the country to update their treatment methods. The standard, which in regulatory terms is called a maximum contaminant level, or MCL, limits permissible amounts of the two most studied and ubiquitous PFAS compounds—PFOA and PFOS—to just 4 ppt in drinking water each. Roughly equivalent to a single drop in five Olympic-size swimming pools, this is the lowest concentration that current analytical instruments can reliably detect \"within specific limits of precision and accuracy during routine laboratory operating conditions,\" according to the EPA. Four other PFAS—PFHxS, PFNA, PFBS, and HFPO-DA (otherwise known as GenX Chemicals)—will be regulated by combining their acceptable levels into a single value. Utilities will have three to five years to bring their systems into compliance.</p></div><p><a href=\"https://arstechnica.com/?p=1995880#p3\">Read 43 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1995880&amp;comments=1\">Comments</a></p>","author":"Undark Magazine","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"82d6637752052117e110c469abb4000d77b1ab5ce31a06b7bd44a722f6b34075","category":"Tech"}