{"title":"CDC defends its abrupt reversal on masks after backlash from experts","link":"https://arstechnica.com/?p=1765479","date":1621272127000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231790696-800x533.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/GettyImages-1231790696.jpeg\">Enlarge</a> <span>/</span> Rochelle Walensky, director of the US Centers for Disease Control and Prevention (CDC), adjusts her protective mask during a Senate Health, Education, Labor, and Pensions Committee hearing in Washington, DC.  (credit: <a href=\"https://www.gettyimages.com/sign-in?ReturnUrl=%2Fdetail%2Fnews-photo%2Frochelle-walensky-director-of-the-u-s-centers-for-disease-news-photo%2F1231790696%3Fadppopup%3Dtrue\">Getty | Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Criticism and confusion have erupted following the Centers for Disease Control and Prevention’s abrupt recommendation last Thursday that fully vaccinated people can immediately shed masks in most settings. The agency is yet again on the defensive over its mask guidance.</p>\n<p>Mask usage has been one of the most contentious issues throughout the pandemic—and that seems unlikely to change any time soon. Just last Tuesday, CDC Director Rochelle Walensky faced <a href=\"https://www.help.senate.gov/hearings/an-update-from-federal-officials-on-efforts-to-combat-covid-19\">a grilling from Senate Republicans</a>, who suggested that the agency was being too slow and too conservative in its health guidance, particularly on the issue of outdoor mask use.</p>\n<p>At the time, the agency recommended that <a href=\"https://arstechnica.com/science/2021/04/to-entice-vaccine-hesitant-biden-touts-maskless-activities-for-vaccinated/\">fully vaccinated people should continue to wear masks</a> in many uncrowded indoor settings as well as in crowded outdoor settings. “We will continue to recommend this until widespread vaccination is achieved,” Walensky said in an April 27 briefing. On that day, around 29 percent of the US population was fully vaccinated.</p></div><p><a href=\"https://arstechnica.com/?p=1765479#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765479&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"82d694bd605f65bf042eeeef819f471ab970c74ad9159be38eccbe1c8a118dc0","category":"Tech"}