{"title":"Plastic litter is a part of the carbon cycle in an urban river: Microplastic and macroplastic accumulate with organic matter in floating debris rafts","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11116?af=R","date":1725255879000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c4bde4dd-3e73-4d98-ab40-9860134499e1/wer11116-toc-0001-m.png\" alt=\"Plastic litter is a part of the carbon cycle in an urban river: Microplastic and macroplastic accumulate with organic matter in floating debris rafts\" />\n<p>Microplastic and macroplastic litter was found at higher densities with floating organic matter rafts in an urban river. Converting measurements of plastic litter to units of mass of carbon in plastic is needed for direct comparisons to organic matter and to understand plastic litter as part of the carbon cycle.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Watershed models of plastic export from rivers to oceans have large uncertainties, and improvements require direct measurements of riverine macroplastic (&gt;5 mm) and microplastic (&lt;5 mm). Also, plastic represents allochthonous carbon inputs to rivers but is rarely measured as carbon mass. We quantified plastic and organic matter within floating debris rafts and open water in an urban river. Macroplastics only occurred in debris rafts. Microplastics had higher concentrations in debris rafts relative to open water. Across sites, organic matter was positively correlated with microplastics and macroplastics. Last, carbon in plastic was 40% of the carbon mass in coarse particulate organic matter in debris rafts. Floating plastic litter accumulates with particulate organic matter in debris rafts. Plastic is an overlooked and ecological meaningful component of carbon standing stocks in urban rivers. Results will inform improved carbon budget calculation in rivers and watershed models of plastic export.</p>\n<h2>Practitioner Points</h2>\n<p>\nPlastic particles floating on the surface of an urban river accumulate in debris rafts compared to open water in terms of count and mass.\nAbundance and composition of plastic particles in debris rafts were distinct from those in open water areas.\nPlastic litter as units of carbon mass was in the same order of magnitude as carbon mass in course particulate organic matter.\nPlastic litter moves in similar ways to naturally occurring organic particles and should be measured as a part of the riverine carbon cycle.\n</p>","author":"Timothy J. Hoellein, \nBailey A. Schwenk, \nElizabeth M. Kazmierczak, \nFritz Petersen","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"82dbf72acfe0790a27a0082e8e7eed3cba38f0ff3855b2ae8a8791f0cbd4fcab","category":"Environment"}