{"title":"บริษัทบรอดแบนด์ในเกาหลีใต้ ฟ้อง Netflix ให้ช่วยจ่ายเงินต้นทุนบริการ เนื่องจากทราฟิกเพิ่มสูงขึ้นมาก","link":"https://www.blognone.com/node/125050","date":1633104696000,"content":"<div><div><div><p>SK Broadband ผู้บริการอินเทอร์เน็ตบรอดแบนด์ในเกาหลีใต้ ได้ฟ้องร้อง Netflix เพื่อให้บริษัทช่วยจ่ายเงินต้นทุนทราฟิกอินเทอร์เน็ต และต้นทุนการดูแลรักษาที่เพิ่มสูงขึ้นมาก เนื่องจากมีการใช้งานอินเทอร์เน็ตสำหรับดู Netflix มากขึ้น โดยศาลกรุงโซลให้ความเห็นที่รับการฟ้องร้องนี้ ว่ามีเหตุผลพอที่ Netflix ควรจ่ายเงินให้บริษัทบรอดแบนด์</p>\n<p>ข้อมูลจาก SK Broadband ระบุว่าซีรี่ส์ที่ได้รับความนิยมสูงขึ้นมาก รวมถึงเรื่องล่าสุดอย่าง Squid Game เป็นปัจจัยให้การชม Netflix ในประเทศเพิ่มสูงมาก จนตอนนี้เป็นแพลตฟอร์มที่ใช้ปริมาณทราฟิกสูงเป็นอันดับ 2 ในเกาหลีใต้ รองจาก YouTube เท่านั้น และมีเพียงสองบริการนี้ที่ยังไม่จ่ายเงินให้กับผู้ให้บริการบรอดแบนด์ ขณะที่บริษัทอื่นอย่าง Amazon, Apple และ Facebook มีการจ่ายเงินให้ ปัจจุบันทราฟิกข้อมูลของ Netflix ที่ต้องรองรับคือ 1.2 ล้านล้านบิตต่อวินาที เพิ่มขึ้นมา 24 เท่า จากเดือนพฤษภาคม ปี 2018</p>\n<p>ด้าน Netflix ชี้แจงว่าบริษัทกำลังตรวจสอบข้อเรียกร้องของทาง SK Broadband ขณะเดียวกันก็กำลังทำงานร่วมกันด้วยเพื่อให้แน่ใจว่าลูกค้า SK Broadband จะไม่ได้รับผลกระทบใด ๆ</p>\n<p>ที่มา: <a href=\"https://www.channelnewsasia.com/business/south-korean-broadband-firm-sues-netflix-after-traffic-surge-squid-game-2215036\">Channel News Asia</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/42b0c4eceb52cf38bee72761a5abf422.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/south-korea\">South Korea</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/net-neutrality\">Net Neutrality</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"82e55645f8541aba0f59ff4d5fc491e24b0ddfa3f548480a239bdaf848483a0d","category":"Thai"}