{"title":"Backdoored developer tool that stole credentials escaped notice for 3 months","link":"https://arstechnica.com/?p=1757515","date":1618603644000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/software-development-800x653.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/software-development.jpeg\">Enlarge</a> (credit: Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A publicly available software development tool contained malicious code that stole the authentication credentials that apps need to access sensitive resources, in the latest revelation of a supply chain attack that has the potential to backdoor the networks of countless organizations.</p>\n<p>The Codecov Bash Uploader contained the backdoor from late January to the beginning of April, developers of the tool <a href=\"https://about.codecov.io/security-update/\">said on Thursday</a>. The backdoor caused developer computers to send secret authentication tokens and other sensitive data to a remote site controlled by the hackers. The uploader works with development platforms including <a href=\"https://medium.com/swlh/what-is-github-action-and-how-do-they-help-c8b254118fa5\">Github Actions</a>, <a href=\"https://circleci.com/\">CircleCI</a>, and <a href=\"https://blog.bitrise.io/how-to-create-and-share-your-own-bitrise-step\">Bitrise Step</a>, all of which support having such secret authentication tokens in the development environment.</p>\n<h2>A pile of AWS and other cloud credentials</h2>\n<p>The Codecov bash uploader performs what is known as code coverage for large-scale software development projects. It allows developers to send coverage reports that, among other things, determine how much of a codebase has been tested by internal test scripts. Some development projects integrate Codecov and similar third-party services into their platforms, where there is free access to sensitive credentials that can be used to steal or modify source code.</p></div><p><a href=\"https://arstechnica.com/?p=1757515#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757515&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"82e75cb6dcbf0612faf60c0e9a6b2118eb9753880e9ece622a28e5fc4a64487d","category":"Tech"}