{"title":"Preventive and treatment efficiency of dendrosomal nano-curcumin against ISO-induced cardiac fibrosis in mouse model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311817","date":1728568800000,"content":"<p>by Behnaz Beikzadeh, Mona Khani, Yasamin Zarinehzadeh, Elham Abedini Bakhshmand, Majid Sadeghizadeh, Shahram Rabbani, Bahram M. Soltani</p>\r\n\r\nCardiac fibrosis (c-fibrosis) is a critical factor in cardiovascular diseases, leading to impaired cardiac function and heart failure. This study aims to optimize the isoproterenol (ISO)-induced c-fibrosis model and evaluate the therapeutic efficacy of dendrosomal nano-curcumin (DNC) in both in-vitro and in-vivo conditions. Also, we were looking for the differentially expressed genes following the c-fibrosis induction. At the in-vitro condition, primary cardiac fibroblasts were exclusively cultured on collagen-coated or polystyrene plates and, were treated with ISO for fibrosis induction and post-treated or co-treated with DNC. RT-qPCR and flow cytometry analysis indicated that DNC treatment attenuated the fibrotic effect of ISO treatment in these cells. At the in-vivo condition, our findings demonstrated that ISO treatment effectively induces cardiac (and pulmonary) fibrosis, characterized by pro-fibrotic and pro-inflammatory gene expression and IHC (α-SMA, COL1A1, and TGFβ). Interestingly, fibrosis symptoms were reduced following the pretreatment, co-treatment, or post-treatment of DNC with ISO. Additionally, the intensive RNAseq analysis suggested the COMP gene is differentially expressed following the c-fibrosis and our RT-qPCR analysis suggested it as a novel potential marker. Overall, our results promise the application of DNC as a potential preventive or therapy agent before and after heart challenges that lead to c-fibrosis.","author":"Behnaz Beikzadeh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"82ed7228db16cf9b74dee96dea9d79622de12d49e150e28ae48ffd76f4eabfc3","category":"Interdisciplinary"}