{"title":"The value of using COVID-19 antibody tests as a potential approach to prioritize vaccination delivery","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311881","date":1729087200000,"content":"<p>by Nasr Alrabadi, Haneen Obeidat, Razan Haddad, Noor Alyassin, Karem H. Alzoubi, Omar Obeidat, Saif M. Shteiwi, Daher Al-rabadi, Ibrahim Al-faouri</p>\r\nBackground <p>The highly contagious novel COVID-19 virus has demonstrated a great challenge for healthcare workers (HCWs) worldwide. One of these challenges is the availability of vaccines in some countries or societies, especially in the early stages of the pandemic.</p> Objectives <p>This study aims to determine the level of natural immunity against COVID-19 infection among HCWs exposed to COVID-19 at the early stages of the pandemic and build a model to determine the groups that can benefit more from the scarce vaccination resources.</p> Methods <p>This study took place between January and March 2021, after the first waves of the COVID-19 pandemic, before spreading the variants of concern, such as the UK variant (Alpha B.1.1.7), and before starting the vaccine campaigns. This cross-sectional study collected serum samples from 251 vulnerable HCWs. The samples were tested for IgG antibodies against COVID-19 using commercial kits. The demographics and clinical characteristics of the participants were recorded using face-to-face interviews.</p> Results <p>COVID-19 IgG antibodies were detected in more than 40% of HCWs before vaccination. Those HCWs should have less priority than those without COVID-19 IgG. The seroprevalence of COVID-19 was higher in male HCWs and among nurses. There was no association between the participants’ immunity and smoking status or different blood groups. Most HCWs reported being infected with the virus during the first wave, mainly at the end of 2020. A limited number of HCWs reported infections between January 2021 and March 2021. All HCWs eventually received the COVID-19 vaccine, ignoring being previously infected.</p> Conclusion <p>The reported results emphasize the value of using immunity tests to prioritize the groups that may benefit the most from the limited vaccines, especially in developing countries with scarce resources where those with COVID-19 IgG antibodies should have less priority for the COVID-19 vaccine. The present results indicate that up to 40% of the delivered vaccines to HCWs who had COVID-19 antibodies could be prioritized more wisely in future pandemics.</p>","author":"Nasr Alrabadi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"82ee80911989f198f20000972c67f84baa1f725cd28cf11036c8090ba5e56570","category":"Interdisciplinary"}