{"title":"Into Mitigating Making-Do Practices using the Last Planner System and BIM: A System Dynamic Analysis","link":"https://www.preprints.org/manuscript/202405.1403/v1","date":1716292184000,"content":"Effective waste elimination is critical for the success of construction projects. Although several studies have focused on various aspects of construction waste, limited efforts have investigated the dynamic effect of Making-Do (MD) practices on productivity, rework, defects, and materials wastage. From a lean construction perspective, this study aims to address MD waste using the Last Planner System (LPS) and BIM. First, the casual structure that can cause MD in construction projects was expressed in a casual loop diagram (CLD), and thematic analysis uncovered the strategies of LPS-BIM to eliminate MD identified by reviewing the literature. Secondly, twenty-five strategies from the LPS and BIM strategies to address MD using Structural Equation Modeling (SEM) were assessed. Subsequently, a system dynamics model (SDM) for investigating LPS-BIM strategies on MD decisions in a construction project was formulated based on the underlying causal loop diagrams and the mathematical relations among the variables. Finally, the model was applied to three projects, and simulations for four LPS-BIM scenarios were carried out. The findings show that dynamic interactions among diverse production planning and control factors are critical in evaluating MD impacts on a construction project. The results demonstrate that the LPS-BIM approach resulted in an average 43.8% reduction in the tasks performed with MD, 45.3% of constraints, 66.5% of construction waste, increasing 13.7% completion rate, and 29.3% cost reduction, demonstrating that LPS-BIM as a more efficient solution for MD mitigation and construction planning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"82f5ac2a8bb4509a20929cf12575d428f35467b1086560c56d432cc2a40d4518","category":"Interdisciplinary"}