{"title":"Some 16-inch MacBook Pro Owners Report MagSafe 3 Charging Issues When Mac Is Closed","link":"https://www.macrumors.com/2021/11/30/16-inch-macbook-pro-charging-magsafe-3/","date":1638269656000,"content":"Some 16-inch MacBook Pro owners appear to have identified a shared issue suggesting the <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> 3 connector sometimes fails to deliver the expected charge when their Mac is turned off and the lid is closed.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/16-inch-magsafe-3.jpg\" />\r\n<br />\r\nAs outlined on <a href=\"https://www.reddit.com/r/apple/comments/r455s3/2021_macbook_does_not_charge_when_its_completely/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">Reddit</a>, some models of the 16-inch MacBook Pro and their respective 140w ‌MagSafe‌ 3 charger are exhibiting a malfunction where when the MacBook Pro is turned off, the ‌MagSafe‌ light flashes amber and fails to charge the Mac. Some customers have contacted Apple Support to find a solution, with varying degrees of success. One user, in particular, said after a lengthy back and forth, Apple Support concluded that they would be sending a replacement laptop.\r\n<br />\r\n<blockquote>So it's not just me then! I have the EXACT same issue. Went to the genius bar and they tested with a cable and charger that they have and it still had the same problem. They said they would order a new 140 watt charger for me to see it would fix it but said most likely it's a firmware issue but didn't really provide any evidence for such a thing. I went home and the next day I get a call from Apple. Someone was calling me to follow up and they asked me a bunch of questions and provided instructions to run a special diagnostics program. After I did all that they said they want to take my MacBook and its charger back and that they would give me a completely brand new MacBook as soon as they get one. I'm still waiting for that but that's where I'm currently at.</blockquote>A <a href=\"https://streamable.com/3lk0ec\">video shared on Reddit</a> shows that when the MacBook Pro is closed, the light on the ‌MagSafe‌ charger repeatedly flashes amber and is accompanied by the typical macOS charging sound effect. A consistent orange light means the MacBook is being charged, while green shows it's fully charged.\r\n<br />\r\n\r\n<br />\r\n‌MagSafe‌ flashing amber is an intended indication that something is not functioning as normal, and Apple Support provides steps to customers to try and return ‌MagSafe‌ to normal if an amber light is shown. This case, however, is an anomaly given it only takes place when the MacBook Pro is turned off with the lid closed. If a MacBook Pro is connected to ‌MagSafe‌ while turned on and is then turned off, ‌MagSafe‌ 3 continues to charge the Mac as expected. The issue only occurs for some users when attempting to plug in the ‌MagSafe‌ connector when the Mac is already turned off.\r\n<br />\r\n\r\n<br />\r\nNot all 16-inch MacBook Pro owners face the problem, and <em>MacRumors</em> has been unable to reproduce the bug ourselves. Regardless, there are enough users facing the problem that Apple may address it in the near future.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">14 &amp; 16\" MacBook Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">14\" &amp; 16\" MacBook Pro (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/30/16-inch-macbook-pro-charging-magsafe-3/\">Some 16-inch MacBook Pro Owners Report MagSafe 3 Charging Issues When Mac Is Closed</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/some-16-inch-macbook-pro-owners-report-magsafe-3-charging-issues-when-mac-is-closed.2325592/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JUg7KHBzzHI:QLalsuifGl4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=JUg7KHBzzHI:QLalsuifGl4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"831bb808acb9d2f883eec4fe8b0d1537a61bfe726a4e38a9e9c982a51035b52b","category":"Apple"}