{"title":"Apple will soon be able to update your iPhone while it’s still in the box","link":"https://www.macworld.com/article/2107557/iphone-ios-update-in-the-box-retail-stores.html","date":1697527104000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-max-specs-release-price.html\">iPhone 15</a> launched, millions of buyers had to update to iOS 17.0.2 before they could even start setting up their new handsets. It was an important update that brought important bug fixes and security updates—but it was also a pain for all of those people who just wanted to start using their shiny new device.</p>\n\n\n\n<p>That pain may soon become a thing of the past. According to a report by Mark Gurman in his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-10-15/apple-october-2023-executive-promotions-new-vps-of-retail-software-operations-lnrh4t94&amp;xcust=1-1-2107557-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">latest Power On newsletter</a>, Apple has developed a unique system that lets workers update the software of new devices prior to sale: “The company has developed a proprietary pad-like device that the store can place boxes of iPhones on top of. That system can then wirelessly turn on the iPhone, update its software and then power it back down–all without the phone’s packaging ever being opened.”</p>\n\n\n\n<p>The new system, which Gurman says will be rolled out by the end of the year, will ensure that new devices are updated with the latest features and fixes before they reach consumers. Assuming the rollout is successful, it’s likely that Apple will bring the system to Macs, iPads, and other devices as well.</p>\n\n\n\n<p>Apple will presumably use the system to update all iPhones, not just the newest models. Gurman doesn’t say if it requires any specific hardware feature, so it’s likely Apple can use it with the iPhone 13, 14, and SE as well. </p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"831e1e6a093ac65059457a16ecd869049503695317c3f9e64d4aa02ffa213a72","category":"Apple"}