{"title":"Progress and challenges in achieving tuberculosis elimination in India by 2025: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301060","date":1711548000000,"content":"<p>by Abhishek Padhi, Ashwini Agarwal, Mayuri Bhise, Anil Chaudhary, Krupal Joshi, C. D. S. Katoch</p>\r\nBackground <p>Tuberculosis (TB) continues to pose a significant public health challenge in India, which is home to one of the highest TB burdens worldwide. This systematic review and meta-analysis will aim to synthesize the anticipated progress and potential challenges in achieving TB elimination in India by 2025.</p> Methods <p>A comprehensive search will be conducted across multiple databases, including PubMed, Scopus, and Web of Science, to identify relevant studies. The eligibility criteria will encompass individuals diagnosed with TB in India, interventions targeting TB treatment, prevention, or control, and various comparator groups. Outcomes of interest will include incidence reduction, mortality rate, treatment success rate, barriers to TB care, and more. Both quantitative and qualitative data will be synthesized, and the risk of bias will be assessed using established tools.</p> Outcomes <p>The review is expected to provide a holistic understanding of the TB landscape in India, highlighting the effective interventions and potential challenges in the journey towards TB elimination.</p> Conclusions <p>While it is anticipated that significant progress will be made in the fight against TB in India, challenges are likely to persist. This review will offer a comprehensive roadmap for researchers, policymakers, and healthcare professionals, emphasizing the importance of continued efforts, innovative strategies, and a multi-pronged approach in achieving the goal of TB elimination in India by 2025.</p>","author":"Abhishek Padhi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"832e45bbe964b4b8a751c07527585c8683b4a869dcccf53c43014b1a2f2cd93c","category":"Interdisciplinary"}