{"title":"Phytoplankton Diversity Across a Coastal Urbanization and Eutrophication Gradient: The Sepetiba Bay—Ilha Grande Bay Continuum in Rio de Janeiro","link":"https://onlinelibrary.wiley.com/doi/10.1111/maec.12838?af=R","date":1729748054000,"content":"<h2>ABSTRACT</h2>\n<p>Densely populated coastal zones are significantly impacted by anthropogenic pressures, particularly urbanized semi-enclosed bays with long residence times of waters and nutrients. Eutrophication is a primary issue resulting from human settlement in coastal zone, as it drastically modifies the structure of biological communities, particularly the phytoplankton. The aim of this study is to assess whether eutrophication functions as an environmental filter on the phytoplankton community along an 80 km gradient of eutrophication in two contrasting bays, Sepetiba and Ilha Grande. By categorizing phytoplankton species based on characteristic traits and comparing them with in situ environmental data, we assess the distribution of phytoplankton functional groups. Sampling was conducted in November 2021 and April 2022 from the semienclosed, mesohaline, and shallow Sepetiba Bay to the more open and marine oligotrophic Ilha Grande Bay. During the two sampling campaigns, functional groups including strict autotrophs (diatoms and filamentous cyanobacteria) and both constitutive and non-constitutive mixotrophs (dinoflagellates) were represented by different abundance of species along this gradient. Classical diversity indices and Beta-Turnover analyses indicate significant community differences between the bays, with species replacement driving differentiation rather than species loss between the sampled points. However, with increased eutrophication in Sepetiba Bay, a decrease in the dispersion of functional traits was observed, suggesting that eutrophication acts as an environmental filter promoting trait convergence and the selection of specialist organisms.</p>","author":"F. A. V. Miranda, \nG. A. O. Moser, \nD. T. Lima, \nW. T. V. Machado, \nN. Brandini, \nA. M. Fernandes, \nL. V. M. Costa, \nM. F. Amaral, \nG. B. Oliveira, \nG. Y. Abril","siteTitle":"Wiley: Marine Ecology: Table of Contents","siteHash":"9aeeb02fb4d0869ca2d9b47a9c219a8693576fd84433bf6b8b40db990539dbf7","entryHash":"832fc6b79e3392577119119e8e59831de05e0b019e2a0f6634530ff4b6a1e5c4","category":"Environment"}