{"title":"Ciprofloxacin Concentrations in Food Could Select for Quinolone Resistance in Enterobacteriaceae: An In Vivo Study in Galleria mellonella","link":"https://www.preprints.org/manuscript/202409.2010/v1","date":1727258195000,"content":"Background The use of antimicrobials to treat food animals leaves antimicrobial residues in foodstuffs. The World Health Organization (WHO) defines the acceptable daily intakes (ADIs) of these residues as the dose of these antimicrobials that is safe for an average human to consume on a daily basis. We hypothesized that the low dose of ciprofloxacin classified as safe by the WHO could select for ciprofloxacin resistant strains of Klebsiella pneumoniae in a Galleria mellonella model. Objectives We aimed to evaluate if the consumption of peri-ADI doses of ciprofloxacin could select for ciprofloxacin-resistant (Ser464Phe, GyrB, ciprofloxacin MIC of 4 µg/mL) compared to -susceptible (isogenic, ciprofloxacin MIC of 0,047 µg/mL) strains of K. pneumoniae in a Galleria mellonella model. Methods A model of K. pneumoniae infection in G. mellonella larvae was used for the experiment. The larvae were inoculated with K. pneumoniae followed by 10x ADI, 1x ADI, 1/10th ADI, 1/100th ADI, 1/1000th ADI doses of ciprofloxacin. Isolation of K. pneumoniae colonies was then performed on selective agar plates with and without ciprofloxacin (1 µg/mL) plates. The proportion of colonies with ciprofloxacin resistance was then calculated for each group at 24 and 48 hours. Results A significant increase was seen in the proportion of resistance for the 1x ADI and 1/10th ADI concentration on day 2 compared to the positive control. Conclusion We found that at 48 hours, there was an enrichment of K. pneumoniae colonies with ciprofloxacin resistance in the larvae receiving 1x ADI and 1/10th ADI concentrations of ciprofloxacin.  These results suggest that the ciprofloxacin MSCselect for K. pneumoniae in this model is 1/10th of the acceptable daily concentration (ADI) dose of ciprofloxacin, which is equivalent to 0.239 ng/µl.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"83320cedd2c16504d3051b9168082af31dc82ccb2ab1f2ecc1548907d9163612","category":"Interdisciplinary"}