{"title":"ESG and Financial Performance of China Firms: The Mediating Role of Export Share and Moderating Role of Carbon Intensity","link":"https://www.preprints.org/manuscript/202405.0170/v1","date":1714715033000,"content":"In recent years, ESG (environmental, social, governance) has emerged as a critical investment concept. Its goal is to create value for both shareholders and society, encouraging companies to optimize social value. However, the exploration and research into \"the proportion of firms ex-porting and the pathways through which the environmental, social, and governance activities of carbon-intensive firms influence firms' financial performance\" remains largely unexplored. This study establishes a research framework within this context, utilizing listed Chinese manufactur-ing companies as the research subjects. Employing a fixed-time, fixed-industry, two-way fixed-effects model methodology, it delves into the relationship between ESG ratings, the pro-portion of firms' exports, and firms' financial performance through panel regression modeling. This study emphasizes the moderating role of carbon-intensive firms in the relationship. Find-ings indicate that both enterprise export proportions and carbon-intensive firms significantly affect the correlation between corporate ESG activities and financial performance. This has im-plications for investors, company management, policymakers, and regulators. Based on these findings, we propose policy recommendations at corporate and governmental levels to enhance ESG significance, strengthen corporate governance, and promote continuous ESG advancement. The study provides micro-level evidence of the interaction among ESG ratings, export ratios, carbon-intensive enterprises, and corporate performance, empowering investors to make in-formed decisions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8332b514a6f33ce04b636b9e3e59aa0f1b1a79ab175cbe9f9aa7497eb9fe30d8","category":"Interdisciplinary"}