{"title":"Bilenky Cycle Works Makes a Bike for Boris Johnson, Gifted by Joe Biden","link":"https://theradavist.com/2021/06/bilenky-cycle-works-makes-a-bike-for-boris-johnson-gifted-by-joe-biden/?utm_source=rss&utm_medium=rss&utm_campaign=bilenky-cycle-works-makes-a-bike-for-boris-johnson-gifted-by-joe-biden","date":1623679197000,"content":"<p><img src=\"https://media.theradavist.com/uploads/2021/06/Screen-Shot-2021-06-14-at-7.57.39-AM.png?fit=1024,9999&amp;quality=75\" /></p>\n<p>You might have seen this blip come across your radar over the weekend but if you haven’t check out this wild story:</p>\n<blockquote><p>“When the  Biden administration needed a bike, they came to Bilenky Cycle Works… On May 23, 2021, Stephen Bilenky  received a cryptic email from the US Department of State Office of Diplomatic Gifts, requesting a custom USA-made bicycle for an unnamed foreign dignitary to be delivered by June 5. “Is this a scam?” Stephen wondered. Despite his misgivings, he replied to the email and agreed to a Zoom meeting the next day. In that meeting, he was assured that this request was legit. A color scheme of red, white and blue (to match the flags of both countries) and the fact that the foreign leader was 5’8” tall were hints. Only after Bilenky agreed to take on the project was it revealed that the gift was for bicycling enthusiast and UK Prime Minister Boris Johnson. Putting everything else aside and working 14 hour days, Stephen and his team created a masterpiece in under 2 weeks. When your country calls, you answer!  The final product was delivered to Washington, DC in time for the President’s trip overseas. “</p></blockquote>\n<p>Read the full story at <a href=\"https://www.bilenky.com/us-uk-friendship-bike\" target=\"_blank\">Bilenky</a>!</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"8342627ca34ae2da518cfa16f04027bed758a5ff85726e4d675b752331110514","category":"Cycling"}