{"title":"<i>Neural EGFL like 1</i> as a novel gene for Trabecular Bone Score in older adults: The Bushehr Elderly Health (BEH) program","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309401","date":1725976800000,"content":"<p>by Mohammad Bidkhori, Mahdi Akbarzadeh, Noushin Fahimfar, Mina Jahangiri, Sahar Seddiq, Bagher Larijani, Iraj Nabipour, Mahsa Mohammad Amoli, Nekoo Panahi, Abbas Dehghan, Kourosh Holakouie-Naieni, Afshin Ostovar</p>\r\n\r\n<i>Neural EGFL like 1 (NELL-1</i>), is a secreted glycoprotein and stimulates osteogenic cell differentiation and bone mineralization. This study aimed to explore the relationship between <i>NELL-1</i> and Trabecular Bone Score (TBS) as a novel tool for the evaluation of osteoporosis in an elderly population-based cohort study in Iran. A single-locus analysis was performed on TBS using data from 2,071 participants in the Bushehr Elderly Health (BEH) Program. The study investigated 376 independent single nucleotide polymorphisms (SNPs) within the <i>NELL-1</i> on chromosome 11p15.1. The association between SNPs and the mean TBS L1 to L4 was analyzed through an additive model. Significant variants in the additive model (P<sub>FDR</sub>&lt;0.05) were further examined within dominant, recessive, over-dominant, and co-dominant models. Multiple linear regression was employed to assess the relationship between the genetic risk score (GRS) derived from significant SNPs and TBS. Three SNPs within the <i>NELL-1</i> showed a statistically significant association with TBS after adjusting for age and sex. The associations for rs1901945 (β = 0.013, P<sub>FDR</sub> = 0.0007), rs1584851 (β = -0.011, P<sub>FDR</sub> = 0.0003), and rs58028601 (β = 0.011, P<sub>FDR</sub> = 0.0003) were significant in the additive model. Additionally, significant results were observed for rs1901945 and rs58028601 in the dominant model (P&lt;0.05). The GRS showed a statistically significant relationship with TBS, considering adjustments for age, sex, Body Mass Index, type 2 diabetes, and smoking (β = 0.077, P = 1.7×10<sup>−5</sup>). This study highlights the association of <i>NELL-1</i> with TBS, underscoring its potential as a candidate for further research and personalized medicine concerning the impact of this gene on bone quality.","author":"Mohammad Bidkhori","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"83458e60f585307e50758cfdcc309a8bac24ea8c06c9ba58d2adffeffab3d332","category":"Interdisciplinary"}