{"title":"BikeRadar Meets podcast | We chat to Lachlan Morton, more than 3,000km into the Alt Tour","link":"https://www.bikeradar.com/news/lachlan-morton-podcast/","date":1625766636000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/Lachlan-Morton-riding-the-Alt-Tour-6413e52.jpg?quality=90&amp;resize=620,413\" />                                            <p>\n</p><p>We’re in the middle of the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> and are bringing you a bonanza of podcasts throughout July, including our <a href=\"https://www.bikeradar.com/news/tour-de-france-podcast/\">Tour de France podcast series</a> plus a few of our regular episodes to break up Tour fever.</p>\n<p>This, however, is an episode that we hadn’t planned for – and that’s a chat with EF Education-Nippo rider Lachlan Morton, midway through his 5,510km Alt Tour.</p>\n<p>You can listen using the podcast player above or on YouTube below – we discuss the challenge so far, scaling the Alps and Mont Ventoux, his bikepacking setup and how he’s riding on a diet of cider, prosciutto and melon.</p>\n\n<hr /><p>If you’re not familiar, Morton has thrown himself into EF’s ‘alternative calendar’ over the past few years, not only competing on the road as a pro, but also trying his hand at bikepacking, gravel and mountain bike events like GBDuro, the Leadville 100, Badlands and <a href=\"https://www.bikeradar.com/features/pro-bike/unbound-2021-bikes/\">Unbound</a>.</p>\n<p>Morton isn’t riding the Tour de France, but he is, to put it mildly, very busy. Instead, <a href=\"https://www.bikeradar.com/news/lachlan-morton-alt-tour/\">he’s riding the Alt Tour</a>, an event devised by him, his team and his sponsors, whereby the Australian is riding the Tour de France ahead of the race, with the aim of beating the peloton to Paris.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Lachlan Morton’s 5,510km Alt Tour has captured the public’s imagination through July.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>Morton started his ride on the same day the Tour left Brittany, but not only is he riding the full route, he’s also riding every transfer in between, including the final 700km transfer to Paris. That’s an extra 2,400km of riding on top of the 3,414km already served up by the Tour route.</p>\n<p>It’s 23 days straight, regularly spending more than 12 hours and 300km a day in the saddle, unsupported. No peloton, no team cars, no mechanics, with all his gear on his bike, sourcing food and camping as he goes.</p>\n<p>In many ways, it’s an ode to the early days of the Tour, when stages could be as long as 500km and riders would regularly stop at cafes to fuel up, or have to seek mechanical assistance on the road.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Morton has conquered the Alps and Mont Ventoux. Next up: the Pyrenees.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>For this episode of BikeRadar Meets, the series where we chat to the leading product designers, engineers and riders in cycling, we caught up with Morton at the end of day ten, in a small town in the south of France.</p>\n<p>At that point, he had covered the first 12 stages of the race – more than 3,000km, including transfers – to give himself an 850km advantage over the peloton. <em>(Update: at the time of writing on 8 July, Morton has now covered 3,895km)</em></p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Morton is riding the Alt Tour unsupported.</span></figcaption><span> <i>Rapha</i></span></div>\n<p>The Alps and a double ascent of Mont Ventoux have passed, but the Pyrenees are looming large in the distance, with fatigue undoubtedly building.</p>\n<p>Morton is riding in support of World Bicycle Relief. If you are able to donate, you can do so via the <a href=\"https://alttour.ef.com/\" target=\"_blank\">Alt Tour website</a>. More than £200,000 has been pledged so far, which in turn will see more than 1,700 bikes donated to those who need them most.</p>\n<hr /><p>For more episodes, head to our <a href=\"https://www.bikeradar.com/bikeradar-podcast/\">BikeRadar Podcast</a> archive page and browse through the entire back catalogue.</p>\n<p>Otherwise, to make sure you don’t miss a future episode, click the buttons below to <strong>subscribe via <a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\">Apple</a> or <a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\">Spotify</a></strong>.</p>\n<p><a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\"><div>\n    <img /></div></a></p>\n<p><a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\"><div>\n    <img /></div></a></p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8346f388bef1e24f6b798918cd7b2d624bfb0ac455d538a8aaa667425723dcbb","category":"Cycling"}