{"title":"Extraction Replication of Inert Particles in Additively Manufactured 800H Builds","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.255/7719994?rss=1","date":1721779200000,"content":"<span>Metal additive manufacturing (AM) technologies have now gained widespread acceptance as flexible approaches to produce high value-added components from many different metals and alloys. However, the microstructural development in such AM builds can be very different from conventionally processed components of the same alloy. These differences can arise from the characteristics of the alloy feedstock, the details of the AM technology used, and the specific process parameters required to build high-quality AM parts [<a href=\"#ozae044.255-B1\">1</a>]. While transmission electron microscopy (TEM) has been an essential tool for the analysis of AM microstructures, certain features can be difficult to study using standard specimens. For example, many builds contain fine particles of metal borides, carbides, nitrides, and oxides. These “inert” particles can form as precipitates, dispersoids or inclusions. When the particles are substantially smaller than the TEM specimen thickness, analysis of such features can be challenging due to interference from the surrounding metallic matrix phases. In the ferrous metals community, inert particles were traditionally prepared for analysis by extraction replication [<a href=\"#ozae044.255-B2\">2</a>], but this approach has seen little attention since the development of focused ion beam (FIB) instruments. More recently, extraction replicas have seen renewed attention for certain alloys with very complex and/or fine distributions of inert particles [<a href=\"#ozae044.255-B3\">3</a>, <a href=\"#ozae044.255-B4\">4</a>]. We have found extraction replication to be particularly useful for AM builds, and here we illustrate the advantages using data obtained from laser powder bed fusion (LPBF) builds of Alloy 800H.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"834655b1119e37212f4e59bfe69577c033329ba34755362db0cd98bc778cfa0f","category":"Environment"}