{"title":"How migration shapes modern contraceptive use among urban young women: Evidence from six African countries","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307141","date":1721743200000,"content":"<p>by Jessie Pinchoff, Isabel Pike, Karen Austrian, Kathryn Grace, Caroline Kabiru</p>\r\nBackground <p>Internal migration is an important part of the transition to adulthood for many young people in sub-Saharan Africa. This study examines how migration, in relation to marriage and parenthood, impacts modern contraceptive use and health facility visits amongst young urban women.</p> Methods <p>We draw on Performance Monitoring for Action (PMA) surveys conducted in Burkina Faso, Côte d’Ivoire, Democratic Republic of Congo, Kenya, Nigeria, and Uganda (2019–2022). Our analysis is unique in being able to adjust for whether women wanted to get pregnant soon. Our sample includes women ages 15–24 years currently residing in urban areas (n = 6,225). We conducted logistic regression models clustered by village level identifier to explore the sequence of life events and the timing of migration in relation to current modern contraceptive use and recent health facility visit, a proxy for engagement with formal health services.</p> Results <p>The timing of migration matters more than the sequence of these life events. Young urban women who experienced both migration and a birth, regardless of the order, had increased contraceptive use and recent health facility visit, compared to women who had only experienced one event or neither. Young women who migrated in the past year had 24% lower odds of using a modern method (Odds Ratio = 0.76; 95% confidence interval 0.63, 0.91), adjusting for demographic factors and adjusting for fertility preference (Wanting to get pregnant soon). Having had a birth was highly significant for health facility visit and among women who had had a birth, those who migrated in the last year had lower odds of a recent visit (OR = 0.68, 95% CI 0.41, 0.89). Results suggest an initially disruptive effect of migration.</p> Discussion <p>Our results suggest young women who recently migrated to urban areas may need additional support in accessing contraception and formal health services for themselves or their children.</p>","author":"Jessie Pinchoff","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"834b2e99ec5eacca985aee8a38811c7a18dd060d14adcbd3e8c210ac72392a02","category":"Interdisciplinary"}