{"title":"Balancing the uncertain and unpredictable nature of possible zoonotic disease transmission with the value placed on animals: Findings from a qualitative study in Guinea","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001174","date":1711634400000,"content":"<p>by Tilly A. Gurman, Kendela Diallo, Elizabeth Larson, Kathryn Sugg, Natalie Tibbels</p>\r\n\r\nZoonoses, or diseases that pass between animals and humans, represent a major threat to global health and global economies. In Guinea, zoonotic diseases (e.g. rabies, Lassa fever) have been at the forefront due to recent outbreaks and government priorities. Much like many other diseases, zoonotic disease prevention demands a thorough and culturally nuanced understanding of the factors that influence preventive behaviors. To gain this knowledge and enhance risk communication for priority zoonotic diseases, this qualitative study conducted focus group discussions, in-depth interviews, and observations in three Guinean prefectures. Study participants included individuals who interact with animals or influence human-animal interactions, (e.g., veterinarians, local leaders, human health providers, butchers, hunters, general population). A total of 229 individuals participated in the study. Data analysis, which combined deductive and inductive coding, found that although individuals generally had basic knowledge about zoonotic diseases, a gap existed between knowledge and practice. In exploring possible reasons behind this gap, several key themes arose, the two most novel being the focus of this paper. First, participants described living in an uncertain world where they lack control over the behaviors of others. Many participants described uncertainty over the vaccine status of stray dogs or even those of their neighbors, making them feel powerless over rabies. Second, animals serve as a main source of livelihood (income, investment, or savings) for individuals. The value placed on livestock may, in turn, drive and impede prevention behaviors such as vaccinating animals or avoiding the sale of unsafe meat. Given that the Guinean government’s list of priority zoonotic diseases continues to evolve, the need to discover ways to effectively promote multiple related prevention behaviors remains pertinent. The insights from this study can inform existing and future programs for the prevention, control, and surveillance of zoonotic disease in Guinea and other similar countries.","author":"Tilly A. Gurman","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"835b32b1397ec5902991533c613a94a0c7bf9c5f725e8e81f4a8c309abecf67c","category":"Environment"}