{"title":"Van der Poel: ‘Alaphilippe is the strongest’","link":"https://cyclingtips.com/2021/06/van-der-poel-alaphilippe-is-the-strongest/","date":1624733615000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00033256-023-650x433.jpg\" /></div><h2>Van der Poel: ‘Alaphilippe is the strongest’</h2><p>\n</p><p>Mathieu van der Poel is one of the favourites to take a stage in the opening weekend of the 2021 Tour de France, despite it being not only his first Tour, but his first ever Grand Tour appearance. Though the Alpecin-Fenix leader did feature on the final climb, he couldn’t follow stage winner Julian Alaphilippe and ultimately finished 20th in the chase group.</p>\n\n\n\n<p>“Everyone has seen that Alaphilippe has been the strongest, without any doubt,” Van der Poel said after the stage. “I gave everything I could today but I had nothing more in the legs. Tomorrow we’ll have another opportunity. It’ll consist of beating Alaphilippe but considering what we saw, he’s the absolute favourite. It’s been a pleasure to wear this so special jersey today.”</p>\n\n\n\n<p>Alpecin-Fenix wore a special edition jersey for Thursday’s team presentation, paying tribute to Raymond Poulidor, legend of French cycling and Van der Poel’s grandfather. With special permission from the UCI, the team also wore the jersey on the first stage of the Tour, but they will revert to the navy blue on Sunday’s stage 2.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CQgol_chR7S/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div> View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CQgol_chR7S/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by MVDP (@mathieuvanderpoel)</a></p></div></blockquote> \n\n\n\n<p>By all accounts it’s been a good start for Van der Poel, who counts himself lucky that he missed the day’s crashes. His favourite status remains intact despite his inexperience.</p>\n\n\n\n<p>“I have been the favourite almost all of my career, but that goes for Alaphilippe and Van Aert too,” Van der Poel told AD Sportwereld. “This is my first Tour de France and I don’t have the top feeling like I did in the Tour de Suisse, but I hope I will get there this week.”</p>\n\n\n\n<p>Though he’s experiencing the Tour for the first time, Van der Poel has raced and won some of the most prestigious one-day races on the calendar, so he is no stranger to spectacle. In fact, he is so far not particularly impressed by the so-called grandeur of the Tour de France that everyone talks about.</p>\n\n\n\n<p>“It might seem like this because the audience is only just back, but Flanders has an audience too and it’s very hectic, and it’s everywhere. The only difference [here] is the teams of the GC riders all come to the front and push there as well. But it’s the same as if we go to the Kwaremont.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/van-der-poel-alaphilippe-is-the-strongest/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"835de5a7374e8e348ef27e5864f129d117351b5dd414cdda459d918c7c957417","category":"Cycling"}