{"title":"Are the 2024 Cyclo-cross World Championships a foregone conclusion, or can Van Empel and Van der Poel be beaten?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/are-the-2024-cyclo-cross-world-championships-a-foregone-conclusion-or-can-van-empel-and-van-der-poel-be-beaten","date":1706786914000,"content":"\n      <p><span>While the European road season is just slowly awakening from a winter of slumber, races on the mud of the cyclo-cross field have been coming thick and fast over the past few months, steadily building up to the pinnacle of the season – the Cyclo-cross World Championships, this weekend. The most recent round of the World Cup in Hoogerheide was the final warm up act ahead of the fight for rainbow jerseys coming up in Tabor, and there’s plenty of cyclo-cross stars who will be dreaming of the top step of the podium.</span></p>\n<div></div>\n<div></div>\n<p><span>There are two key riders on the startline of both the elite men’s and women’s races who have a very good chance of ensuring that their competitor’s dreams of becoming a world champion remain, well, as dreams rather than reality. It’s hard to look past five-time cyclo-cross world champion Mathieu van der Poel in the men’s event. The Dutch rider has had an almost perfect ‘cross campaign so far this year, winning every single race he’s started apart from one World Cup round in Benidorm. When MVDP attacks, his competition is usually left with only his tyre tracks in the mud to follow – no one can ride up ramps, finesse corners or bunnyhop hurdles quite like him. </span></p>\n<p><span>The same can be said for Fem van Empel in the women’s event. With her technical abilities and raw strength, the Dutch rider has won all but two races of her cyclo-cross season – in many cases by a sizeable margin. The course in Tabor is known to be challenging and technical with very little margin for error, but this hasn’t been a problem for Van Empel or Van der Poel in the past. Van Empel took victory at the Tabor World Cup in 2022 while Van der Poel won when the European Championships were held on the course back in 2017.</span></p>\n<p><span>So, is all hope lost for the rivals of these super talents? Should we just hand them the rainbow jerseys now, before the races have even been won? Or does anyone else have a chance of ripping up the script in Tabor this weekend? This is still bike racing after all, and anything can happen.</span></p>\n<h3>Women’s race</h3>\n<p><span>Those who have been following the women’s cyclo-cross season will have noticed a steady change in the dynamic of the races since the start of winter. While it still may have been Fem van Empel who eventually won in Hoogerheide last weekend, the way in which she did it was markedly different to earlier in the season, when we saw the current world champion beat her competitors with much more ease. At Hoogerheide, on the other hand, Van Empel was pushed all the way to the finish line by both Blanka Vas (Hungary) and Lucinda Brand (Netherlands), two riders who will be hoping to do the same in Tabor this weekend.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_7434_1024x1024.jpg?v=1706724431\" />Although she’s had a slower start to her cyclo-cross campaign this winter, Vas is showing a return to form at exactly the right time and she’s a rider known to be able to peak for key championship events. Brand also has the experience and knowledge to ride a clever race in Tabor – she suffered a setback when she crashed and broke her nose in Zonhoven a few weeks ago but looked to have returned to form last weekend. Brand has won the World Championships before and been on the podium in the last two editions, so she’s no stranger to the pressure of having the rainbow bands to fight for.</span></p>\n<p><span>Another former world champion who will be on the start line in Tabor is the Dutch rider Ceylin Alvarado. Her consistency so far this cyclo-cross season has been impressive, leading her to victory in the World Cup series overall. However, she suffered from back pain in Hoogerheide last weekend leading to her worst result of the season as she finished in 15th place. If Alvarado can find her best legs in Tabor, she is a serious contender for the win, but it’s going to take some serious recovery throughout the days leading up to the World Championships for her to be fighting fit again in a few days.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_7826_1024x1024.jpg?v=1706724609\" /></span></p>\n<p><span>Alvarado’s teammate, Puck Pieterse, is another rider who must be considered when looking ahead to the World Championships. The 21-year-old is one of the few riders who has got the better of Van Empel so far this season – Pieterse won both the Hulst and Gavere World Cup rounds ahead of the world champion, something that will give her plenty of confidence heading into Tabor. Pieterse was struggling with illness in Hoogerheide and was far from her usual best, however, so it remains to be seen if she has recovered in time to challenge Van Empel for rainbows.</span></p>\n<p><span>The elite women’s race at the Cyclo-cross World Championships is certainly not in the bag for Van Empel. With Vas looking dangerously good at Hoogerheide and Brand also showing how hungry she is for a result, alongside Alvarado and Pieterse returning to form after illness and injury, it has the potential to be a tightly fought battle for victory. Popcorn at the ready, sports fans.</span></p>\n<h3>Men’s race</h3>\n<p><span>Admittedly, it’s a little harder to imagine that the men’s race in Tabor will be as closely fought as the women’s when considering the dominance of Mathieu van der Poel so far this season. Up until the Benidorm World Cup, the Dutch rider was on a ten-race winning streak, with Benidorm proving to be just a small blip as he returned to take victory in the X2O Trophy and at the Hoogerheide World Cup in the weeks that followed. While Van der Poel was unable to ride away from his rivals at Hoogerheide, this was largely down to the nature of the course there and he never seemed to be under any pressure throughout the race. Without Wout van Aert or Tom Pidcock at the Worlds, Van der Poel’s chances of victory are even higher.</span></p>\n<p><span> <span>Not that he needs any extra help, but Van der Poel will only be stronger this weekend with the support of his Dutch teammates who will be able to assist him as much as is possible in cyclo-cross by marking the attacks of others and not helping to close gaps when he inevitably makes his moves. These teammates include the likes of Joris Nieuwenhuis (who finished second to Van der Poel at Hoogerheide) and Pim Ronhaar (who finished in third place.) Both of these riders will be able to challenge for victory in their own right if Van der Poel has a surprisingly off day, but this seems unlikely following his form last weekend. Lars van der Haar is another Dutch rider who will be one to watch in Tabor, though he has struggled to consistently fight for podiums this season.</span></span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_6412_1024x1024.jpg?v=1706724657\" />As is usual with the Cyclo-cross World Championships, the men’s race is likely to be a battle between the Dutch and the Belgian nations. Even without Van Aert on the start line, Belgium has plenty of talent in its ranks with Eli Iserbyt a stand out name in the country’s line-up. Iserbyt has finished in third place at the World Championships for the last two years and has had some promising results this season, including victory at the Belgian Cyclo-cross Championships a few weeks ago. European champion Michael Vanthourenhout is another rider who could perform well in Tabor, though his poor showing at Hoogerheide last weekend puts a question mark over the 30-year-old.</span></p>\n<p><span>One rider who confirmed his form in Hoogerheide, however, was the young Thibau Nys, who was one of the few riders able to follow Van der Poel’s stinging attacks on the course. An untimely crash in the closing laps ruined the Belgian rider’s chances of getting a result and he ultimately finished in fourth place, but he proved that he is one of the closest riders to Van der Poel when the Dutch rider makes his trademark moves. It will still be a big ask for Nys to challenge Van der Poel for victory in Tabor, however, especially considering his lack of experience at elite World Championships.</span></p>\n<p><span>Cameron Mason of Great Britain also deserves a mention when it comes to the riders who could be in contention for a podium finish in Tabor, but the reality is that it looks like it’s going to be tricky for anyone to get the better of Van der Poel this weekend. Of course, anything can happen on race day, but recent history tells us that the Dutch super-talent is simply a cut above the rest on the cyclo-cross field at the moment.</span></p>\n<h3>Other events</h3>\n<p><span>The World Championships also gives us a chance to look at the future stars of cyclo-cross in both the under-23 and junior races. Who will be the next Van Empels and Van der Poels? These races offer a window into the next generation of bunnyhopping hot shots.</span></p>\n<p><span>In the under-23 women’s event, Zoe Backstedt starts as one of the hot favourites –she’s been holding her own against the elite and appears to be especially motivated following the recent announcement of her new Red Bull sponsorship. Dutch riders Leonie Bentveld and Lauren Molengraaf will also be hoping to make their mark on the race in Tabor, as will the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/double-the-talent-the-multidisciplinary-holmgren-twins-on-winning-world-titles-and-joining-lidl-tre\">Canadian sister duo of Isabella and Ava Holmgren</a>. Marie Schreiber of Luxembourg has also been proving her talent among the elite women this season and she could be one of Backstedt’s closest challengers, while Fleur Moors of Belgium will also be hoping for a strong result.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1121_1024x1024.jpg?v=1706724840\" />On the men’s side in the under-23 category, there will also be a hotly contested battle for rainbows. Tibor del Grosso of the Netherlands took victory in the most recent under-23 World Cup round in Hoogerheide, but Jente Michels of Belgium will be wanting to ensure Del Grosso doesn’t do the same in Tabor. Aaron Dockx is another Belgian rider to watch, as is Benidorm World Cup winner Emil Verstrynge. It’s not all about the Dutch and Belgians, though. French duo Remi Lelandais and Leo Bisiaux have ridden strongly in the World Cups this year and will hope to do the same at the World Championships. </span></p>\n<p><span>The youngest categories at the World Championships will be the junior men’s and women’s races. Great Britain’s Cat Ferguson starts as one of the key favourites in the junior women’s event, alongside Viktoria Chladonová of Slovenia and Celia Gery of France. In the junior men’s race, Aubin Sparfel of France is a key contender, though he was beaten by Stefano Viezzi of Italy in Hoogerheide last weekend. Jules Simon of France and Keije Solen of the Netherlands are also two riders to watch in the junior men’s. </span></p>\n<p><span>The spread of talent across such a range of countries in the younger categories is an encouraging look at the future of cyclo-cross and certainly hints at less domination from the Netherlands and Belgium in the years to come.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"835d0b7365abf629e79d072fe70044a1fdbc8f099772572d6a09859e3583265c","category":"Cycling"}