{"title":"Dermatological Neoplastic Diseases Complicating Treatment with Monoclonal Antibody for Multiple Sclerosis","link":"https://www.preprints.org/manuscript/202407.1711/v1","date":1721641659000,"content":"Background: over the past 20 years, the treatment scenario of multiple sclerosis (MS) has radically changed and an ever-increasing number of disease-modifying treatments has emerged. Among high efficacy treatment agents, monoclonal antibodies (mAbs) have become a mainstay in the MS patient’s treatment due to their targeted mechanism, high efficacy and favorable risk profile. The latter varies from drug to drug and a skin cancer warning has emerged with sphingosine 1-phosphate receptors inhibitors. Several cases of skin malignancy in people with MS (pwMS) undergoing therapy with mAbs have also been described, but dermatological follow-up is not currently indicated. Objectives:  the aim of this review is to investigate cases of cutaneous ma-lignancy during mAbs therapy and to explore possible pathophysiological mechanisms to evaluate the potential need for regular dermatological follow-up in pwMS treated with mAbs. Methods: literature search for original articles and review in PubMed. No date restrictions. Results: 1019 results were retrieved. Duplicates were removed using Endnote and manually. Only peer-reviewed studies published in English were considered for inclusion. At the end of these screening procedures, 54 studies published between 2001 and 2023 that met the objectives of this review were selected and reported. Conclusions: the available data do not show a clear link be-tween monoclonal antibody (mAb) treatment in pwMS and the risk of skin cancer. At present, these treatments remain contraindicated for people with cancer. Dermatological screening is ad-visable before starting mAb treatment in pwMS, and subsequent follow-up should be individual-ised according to each patient's risk profile.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"835f4f02017603cb324bd0b5bb5676f6c6a97e8878ccc53b14363873c899a119","category":"Interdisciplinary"}