{"title":"PSXI-16 Increased copper concentrations in liver and duodenum tissues in Rambouillet-crossbred sheep receiving copper supplementation","link":"https://academic.oup.com/jas/article/102/Supplement_3/763/7757580?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Rambouillet-crossbred wethers (n = 8; approximately 7 mo of age) were stratified by body weight (BW) into 4 BW blocks to examine the impact of copper (Cu) supplementation on plasma, bile, liver, duodenum, jejunum, and ileum tissue Cu concentrations. On d 0 of the experiment, liver biopsies and plasma samples were collected from each animal and analyzed for Cu concentrations. Animals were housed in individual pens and received a total mixed ration (dry matter basis: 30.0% cracked corn, 33.3% grass hay, 33.3% alfalfa hay, 3.4% soybean meal) once daily in amounts to allow ad libitum access to feed over a 24 h period. Wethers were paired by BW and assigned to 1 of two treatments (n = 4 wethers/treatment). Treatments consisted of 1) no supplemental Cu (control), and 2) +Cu: 12 mg of supplemental Cu/kg DM from CuSO<sub>4</sub>∙5H<sub>2</sub>O. Ground corn was used as a carrier for each treatment and fed in a separate feed container daily. On d 28 of the experiment, all wethers were transported to an USDA inspected abattoir and harvested. Following harvest, blood, bile, liver, duodenum, jejunum, and ileum samples were collected. Digestive tract samples were thoroughly washed with phosphate-buffered saline to remove all feed particles. Blood samples were collected in heparinized trace mineral free vacutainer tubes and centrifuged at 2,000 x g for 15 min at room temperature. Plasma, bile, and gastrointestinal tissue samples were stored in acid-washed storage vials at -20 ºC until analyzed for Cu concentrations. Data were analyzed as a randomized block design using the MIXED procedure in SAS with individual animal as the experimental unit. Liver (<span>P</span> &lt; 0.05) and duodenum (<span>P</span> &lt; 0.04) Cu concentrations were greater and ileum Cu concentrations were less (<span>P</span> &lt; 0.04) in sheep receiving supplemental Cu compared with controls. Plasma, bile, and jejunum Cu concentrations were similar across treatments. These data suggest that Cu absorption takes place primarily in the duodenum and accumulates in the liver in sheep fed a diet containing 18 mg Cu/kg dry matter. Although total bile production was not measured in this experiment, the accumulation of Cu in the liver in +Cu sheep coupled with no treatment effect on bile Cu concentrations suggests an inability of sheep to excrete excess Cu from the liver via bile. Future research examining the impact of Cu supplementation on the molecular mechanisms associated with Cu absorption from each segment of the small intestine and storage and excretion mechanisms in the liver is warranted.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8361d7bcf8f79139c1ed4a36bd7f904552449e314d10921d15ab2a1e57f93c25","category":"Environment"}