{"title":"Melatonin alleviates ischemic stroke by inhibiting ferroptosis through the CYP1B1/ACSL4 pathway","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24136?af=R","date":1713250800000,"content":"<h2>Abstract</h2>\n<p>This study utilized middle cerebral artery occlusion (MCAO) mouse models and HT-22 cell oxygen and glucose deprivation/reoxygenation (OGD/R) models to investigate the therapeutic effects of melatonin on ischemic brain injury. In the experiments, MCAO mice were treated with 5 and 10 mg/kg doses of melatonin, and H-T22 cells underwent OGD/R treatment and were administered different concentrations of melatonin. The results showed that melatonin significantly reduced ischemic brain area, neural damage, cerebral edema, and neuronal apoptosis in MCAO mice. In the HT-22 cell model, melatonin also improved cell proliferation ability, reduced apoptosis, and ROS production. Further mechanistic studies found that melatonin exerts protective effects by inhibiting ferroptosis, an iron-dependent form of regulated cell death, through regulation of the ACSL4/CYP1B1 pathway. In MCAO mice, melatonin decreased lipid peroxidation, ROS production, and ACSL4 protein expression. Overexpression of CYP1B1 increased ACSL4 ubiquitination and degradation, thereby increasing cell tolerance to ferroptosis, reducing ACSL4 protein levels, and decreasing ROS production. CYP1B1 knockdown obtained opposite results. The CYP1B1 metabolite 20-HETE induces expression of the E3 ubiquitin ligase FBXO10 by activating PKC signaling, which promotes ACSL4 degradation. In the OGD/R cell model, inhibition of CYP1B1 expression reversed the therapeutic effects of melatonin. In summary, this study demonstrates that melatonin protects the brain from ischemic injury by inhibiting ferroptosis through regulation of the ACSL4/CYP1B1 pathway, providing evidence for new therapeutic targets for ischemic brain injury.</p>","author":"Yu Sun, \nHaiyan Jin, \nJia He, \nJinyu Lai, \nHao Lin, \nXiangyu Liu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"8364295d39a80bff43814c76d0cb619a7557eb07a1179f1a76f55a978abc7022","category":"Environment"}