{"title":"Elevated levels of antibiotic resistance genes as a factor of human‐caused global environmental change","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17419?af=R","date":1721296864000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/95159d79-2fbc-4070-8610-0d2b450f2204/gcb17419-toc-0001-m.png\" alt=\"Elevated levels of antibiotic resistance genes as a factor of human-caused global environmental change\" />\n<p>Human-caused global environmental change is a complex phenomenon, consisting of many factors. We here propose to add another key factor, namely increased levels of antibiotic resistance genes in the environment. It is a biological factor, but we argue it should be the genes themselves, rather than the organisms carrying them, that should be regarded as a new factor of global change.</p>\n<br />\n<h2>Abstract</h2>\n<p>Antibiotic resistance genes (ARGs) have moved into focus as a critically important response variable in global change biology, given the increasing environmental and human health threat posed by these genes. However, we propose that elevated levels of ARGs should also be considered a factor of global change, not just a response. We provide evidence that elevated levels of ARGs are a global change factor, since this phenomenon is linked to human activity, occurs globally, and affects biota. We explain why ARGs could be considered the global change factor, rather than the organisms containing them; and we highlight the difference between ARGs and the presence of antibiotics, which are not necessarily linked since elevated levels of ARGs are caused by multiple factors. Importantly, shifting the perspective to elevated levels of ARGs as a factor of global change opens new avenues of research, where ARGs can be the experimental treatment. This includes asking questions about how elevated ARG levels interact with other global change factors, or how ARGs influence ecosystem processes, biodiversity or trophic relationships. Global change biology stands to profit from this new framing in terms of capturing more completely the real extent of human impacts on this planet.</p>","author":"Matthias C. Rillig, \nChangchao Li, \nÁlvaro Rodríguez del Río, \nYong‐Guan Zhu, \nLing Jin","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"837a70aa7247d2326c124737b6f8f0a08c00b13f3237e3a7ab28462cec7a20b9","category":"Environment"}