{"title":"Integrated Analysis of Serum and Tissue microRNA Transcriptome for Biomarker Discovery in Gastric Cancer","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24430?af=R","date":1728907212000,"content":"<h2>ABSTRACT</h2>\n<p>Gastric cancer (GC) poses a significant global health challenge, demanding a detailed exploration of its molecular landscape. Studies suggest that exposure to environmental pollutants can lead to changes in microRNA (miRNA) expression patterns, which may contribute to the development and progression of GC. MiRNAs have emerged as crucial regulators implicated in GC pathogenesis. The largest GC serum miRNA dataset to date, comprising 1417 non-cancer controls and 1417 GC samples was used. We conducted a comprehensive analysis of miRNA expression profiles. Differential expression analysis, co-expression network construction, and machine learning models were employed to identify key serum miRNAs and their association with clinical parameters. Weighted Gene Co-expression Network Analysis (WGCNA) and immune infiltration analysis were used to validate the importance of the key miRNA. A total of 1766 differentially expressed miRNAs were identified, with miR-1290, miR-1246, and miR-451a among the top up-regulated, and miR-6875-5p, miR-6784-5p, miR-1228-5p, and miR-6765-5p among the top down-regulated. WGCNA revealed that modules M1 and M5 were significantly associated with GC subtypes and disease status. MiRNA-target gene network analysis identified prognostically significant genes TP53, EMCN, CBX8, and ALDH1A3. Machine learning models LASSO, SVM, randomforest, and XGBOOST demonstrated the diagnostic potential of miRNA profiles. Tissue and serum miR-187 emerged as an independent prognostic factor, influencing patient survival across clinical parameters. Gene expression and immune cell infiltration were different in tissues stratified by miR-187 expression. In summary, the integration of differential gene expression, co-expression analysis, and immune cell profiling provided insights into the molecular intricacies of GC progression.</p>","author":"Xinfeng Wang, \nZhuoran Li, \nChengyan Zhang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"8384232ca35e01d8906a1cff4855ab87b9ee037f93ebee4f10e49b212b19e386","category":"Environment"}