{"title":"Five Paths of China Economy","link":"https://markpeak.net/five-paths-of-china-economy/","date":1698023010000,"content":"<p>Photo: <a href=\"https://www.pexels.com/photo/people-walking-on-great-wall-of-china-5088768/\">Markus Winkler / Pexels</a></p>\n<p>ถัดจากเรื่อง <a href=\"https://markpeak.net/china-debt-overhang/\">China Debt Overhang</a> ก็มีโอกาสได้อ่านบทความคล้ายๆ กันที่เขียนโดย Michael Pettis ผู้เชี่ยวชาญเรื่องเศรษฐกิจจีน เขียนลงในเว็บ Carnegie Endowment for International Peace เมื่อเดือนเมษายน 2022 ว่าด้วย 5 ทางเลือกที่เศรษฐกิจจีนสามารถเลือกเดินไปได้ <a href=\"https://carnegieendowment.org/chinafinancialmarkets/87007\">The Only Five Paths China’s Economy Can Follow</a></p>\n<p>Pettis วิเคราะห์ปัญหาหนี้ของจีนว่า การเติบโตของเศรษฐกิจสามารถแบ่งได้เป็น 2 ส่วนคือ</p>\n<ul>\n<li><strong>genuine growth</strong> การเติบโตแบบออร์แกนิก มาจากการบริโภค ส่งออก และการลงทุนของภาคธุรกิจ (ซึ่งมีขึ้นเพื่อตอบโจทย์การบริโภคและการส่งออก) เป็นการเติบโตที่ยั่งยืนกว่า</li>\n<li><strong>inflated growth</strong> การลงทุนในโครงสร้างพื้นฐานและอสังหาริมทรัพย์ ไม่ยั่งยืน แต่มีขึ้นเพื่อเร่งตัวเลข GDP ตามเป้าหมายทางการเมืองของรัฐบาลกลาง</li>\n</ul>\n<p>ตัวเลขเศรษฐกิจจีนในแต่ละช่วงอาจมีวิธีเติบโตที่ต่างกัน เช่น ในปี 2020 ช่วง COVID แทบไม่มีการบริโภคเลย ทำให้ genuine growth ติดลบด้วยซ้ำ และที่เหลือคือ inflated growth ทั้งหมด</p>\n<p>แต่ในปี 2021 สถานการณ์กลับกัน เพราะตลาดส่งออกเติบโตแรง การบริโภคกลับมาเพิ่มอีกครั้ง การลงทุนภาคธุรกิจสูง ในอีกทาง รัฐบาลกลางก็บีบการลงทุนโครงสร้างพื้นฐานและภาคอสังหาฯ ผลทำให้อัตราส่วน debt-to-GDP ของจีนไม่เพิ่มอีก</p>\n<p>Pettis บอกว่าการลงทุนในอสังหาฯ และโครงสร้างพื้นฐาน ไม่ได้เป็นปัญหาเสมอไป หากลงทุนแล้วได้ผลประโยชน์เศรษฐกิจทางตรงและทางอ้อมกลับมาคุ้มค่าเม็ดเงินที่ลงทุนไป (GDP เพิ่มด้วย ทำให้ debt-to-GDP ไม่เพิ่มตาม) ซึ่งจีนเคยทำสำเร็จมาแล้วในช่วงทศวรรษ 1970-2000s ที่ลงทุนเยอะ เศรษฐกิจเติบโตเยอะตามไปด้วย</p>\n<p>แต่ตอนนี้ จีนมาถึงจุดที่ลงทุนในอสังหาฯ และโครงสร้างพื้นฐาน แล้วไม่มีประโยชน์คุ้มค่าอีกแล้ว เพิ่มหนี้ซะเปล่าๆ และสุดท้ายต้องตั้งหนี้สูญ (amortized) อยู่ดี</p>\n<p>ดังนั้นถึงเวลาที่จีนต้องหาโมเดลการเติบโตแบบใหม่ (new growth model) ที่มีคุณภาพมากกว่าเดิม เน้นฝั่งอุปสงค์ (demand-side) แทนการเติบโตด้วยฝั่งอุปทาน (supply-side) และเกลี่ยเรื่องความเหลื่อมล้ำของรายได้ (income redistribution) ให้มากขึ้น</p>\n<p>สภาพเศรษฐกิจจีนเป็น high savings, high investment growth model คือมีเงินฝากในประเทศมาก และนำไปใช้ลงทุนมาก ซึ่งทางออกของประเทศลักษณะนี้มีด้วยกัน 5 วิถีทาง</p>\n<ol>\n<li>ไม่ทำอะไร สะสมหนี้ให้ใหญ่ขึ้นไปเรื่อยๆ</li>\n<li>ลดการเติบโตด้วยการลงทุนที่ไม่เกิดผลิตภาพ (nonproductive investment) ด้วยการหันไปลงทุนในเทคโนโลยีใหม่แทน</li>\n<li>ลดการเติบโตด้วยการลงทุนที่ไม่เกิดผลิตภาพ (nonproductive investment) แล้วไปเพิ่มการบริโภคแทน</li>\n<li>ลดการเติบโตด้วยการลงทุนที่ไม่เกิดผลิตภาพ (nonproductive investment) แล้วเติบโตจากดุลการค้าระหว่างประเทศ (trade surplus)</li>\n<li>ลดการเติบโตด้วยการลงทุนที่ไม่เกิดผลิตภาพ (nonproductive investment) แล้วไม่ทำอะไรเลย ซึ่งอัตราการเติบโตของเศรษฐกิจจะลดลงมาก</li>\n</ol>\n<p>Pettis บอกว่าเส้นทางแรกนั้นสบาย ไม่ต้องเปลี่ยนแปลงอะไรมาก แต่ก็มีปัญหาตามมาเยอะ ซึ่งจะซ้ำรอยสหรัฐช่วงทศวรรษ 1920s (Great Depression) หรือญี่ปุ่นยุค 1970s-80s ที่กลายเป็นทศวรรษที่สาบสูญ สิ่งที่เป็นสัญญาณอันดีคือนักการเมืองในปักกิ่งยืนยันหนักแน่นว่าจะไม่ไปในแนวทางนี้</p>\n<p>ส่วนอีก 4 เส้นทางที่เหลือ จะต้องเจอกับความยากในเชิงระบบ (systemic difficulties) ที่แตกต่างกันไป จนทำให้ประเทศที่เจอสถานการณ์แบบเดียวกันจะเลือกทางสุดท้าย คือ ยอมให้อัตราการเติบโตลดลง</p>\n<ul>\n<li><strong>ทางเลือกที่สอง เปลี่ยนมาลงทุนในเทคโนโลยีที่เกิดผลิตภาพ</strong> มีความยากตรงที่\n<ul>\n<li>เซกเตอร์เทคโนโลยีมีสัดส่วนแค่ราว 10% ของ GDP จีนเท่านั้น ในขณะที่โครงสร้างพื้นฐานมีราว 30% และอสังหาริมทรัพย์มีราว 30% มันแทนกันทั้งหมดได้ยากมาก</li>\n<li>ไม่รู้จะลงทุนอะไรดี บริษัทเทคโนโลยีที่ดีพอมีจำนวนไม่เยอะพอ ไม่สามารถแทนการลงทุนแบบเก่าได้หมดเช่นกัน</li>\n<li>โครงสร้างเชิงสถาบันของจีน โดยเฉพาะทางการเมือง ออกแบบมาเพื่อการลงทุนแบบดั้งเดิม (โครงสร้าง+อสังหา) การเปลี่ยนแปลงสถาบันเหล่านี้เป็นเรื่องยากมากในทางปฏิบัติ</li>\n</ul>\n</li>\n<li><strong>ทางเลือกที่สาม เปลี่ยนมาเร่งการบริโภค</strong> การบริโภคภาคครัวเรือนจีนมีสัดส่วนราว 40% ของ GDP ซึ่งน้อยกว่าค่าเฉลี่ยประเทศอื่นที่มีราว 60% การขยับตัวเลขนี้ให้เพิ่มขึ้นจึงไม่ง่ายนัก\n<ul>\n<li>คนชั้นกลางจีนมีรายได้ไม่มากนัก (เทียบกับขนาดเศรษฐกิจ) มีข้อจำกัดในการบริโภค แม้รัฐบาลจีนประกาศนโยบาย common prosperity เกลี่ยรายได้ไปสู่คนชั้นกลาง-ล่างมากขึ้น ก็ช่วยได้ไม่เยอะเท่าไร</li>\n<li>สัดส่วนของการลงทุนภาคธุรกิจจีน (business sector) ไม่ต่างอะไรจากประเทศอื่น ขยับได้ยากอยู่ดี</li>\n<li>ทางออกเดียวที่ทำได้คือ การลงทุนภาครัฐจีน โดยเฉพาะรัฐบาลท้องถิ่น ต้องย้ายไปสู่ภาคครัวเรือน ซึ่งจีนพยายามทำมาตั้งแต่ปี 2007 แล้วแต่ยังไม่ประสบความสำเร็จมากนัก เพราะติดข้อจำกัดทางการเมืองด้วย</li>\n</ul>\n</li>\n<li><strong>ทางเลือกที่สี่ ชดเชยด้วยดุลการค้าที่เพิ่มขึ้น</strong> (rising trade surplus) จีนมีดุลการค้าอยู่ราว 4-5% ของ GDP ซึ่งถือว่าใหญ่มากแล้ว (เกือบ 1% ของ GPD ประเทศอื่นๆ ในโลกรวมกัน)\n<ul>\n<li>จีนต้องเพิ่ม trade surplus ให้ได้ปีละ 3 percentage point ทุกปี เพื่อทดแทนการลงทุนที่ไม่เกิดผลิตภาพในประเทศ</li>\n<li>ประเทศขนาดเล็กอาจทำได้ แต่ trade surplus จีนก็ขนาดใหญ่มากอยู่แล้ว การเพิ่มตัวเลขตรงนี้ไม่ง่าย แถมจะมีปัญหาการเมืองระหว่างประเทศด้วย เพราะเติบโตจากการเสียดุลการค้าของประเทศอื่น</li>\n</ul>\n</li>\n</ul>\n<p>Pettis บอกว่าหากจีนเดินบน 3 เส้นทางข้างต้นไม่ไหว ก็ต้องเลือกทางสุดท้ายคือยอมให้ GDP growth ลดลง ซึ่งเขาคำนวณคร่าวๆ คิดว่าจะเหลือปีละ 2-3% เป็นอย่างมาก ประเด็นคือเรื่องระยะเวลามี 2 แนวทาง</p>\n<ul>\n<li>GDP growth ลดฮวบ = เรียกว่าวิกฤตเศรษฐกิจ (financial crisis)</li>\n<li>GDP growth ลดช้าๆ = เรียกว่าทศวรรษที่สาบสูญ (lost decades)</li>\n</ul>\n<p>Pettis บอกว่าวิธีแรก ยอมให้เกิดวิกฤตเศรษฐกิจนั้นจะมีต้นทุนรวมน้อยกว่า แต่ต้นทุนระยะสั้นเยอะกว่า และจะเกิดผลกระทบทางสังคม-การเมืองอย่างมาก (ซึ่งรัฐบาลจีนจะไม่ยอมให้เกิดขึ้น) และคาดว่าจีนจะเข้าสู่โหมดเติบโตช้าอันยาวนาน (very long period of low growth) แบบญี่ปุ่นมากกว่า</p>The post <a href=\"https://markpeak.net/five-paths-of-china-economy/\">Five Paths of China Economy</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"838a129bf5d3f51ad2127af9fb78cf22ae83928bc5c53d56fafec8491009b268","category":"Thai"}