{"title":"22 Feeding the early gestating gilt during heat stress: Implications towards fetal viability, growth, and development","link":"https://academic.oup.com/jas/article/102/Supplement_2/64/7665079?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Gestational heat stress (GHS) directly impacts litter development and viability and has long term negative postnatal effects on offspring. However, current data on the interactions between GHS, maternal feed energy partitioning, and fetal development measures in pigs are limited. Therefore, the study objective was to gain a greater understanding of how early GHS influences fetal development and viability and whether maternal feed energy partitioning has a role. Gestating gilts (n = 23) were exposed to thermoneutral (TN; n = 11; 18.5 ± 1.2°C) or heat stress (HS; n = 12; cyclic 26 to 38°C) conditions beginning on d 6.0 ± 0.9 of gestation to 33.0 ± 1.7. The HS treatments resulted in greater (<span>P</span> &lt; 0.05) respiration rates and body temperature and HS gilts grew faster (<span>P</span> &lt; 0.05; 0.5 ± 0.1 kg/d) than TN gilts (0.3 ± 0.1 kg/d) as previously reported. Pregnant gilts were individually housed and limit-fed a standard gestating gilt diet (1.82 kg/d; 4.39 Mcal NE intake/d). On gestation d 33 ± 1.7, gilts were harvested and reproductive tract weight, corpus luteum (CL) counts, and fetal weights and counts were recorded. Additionally, fetal images were taken with a digital camera to assess fetal length, width, crown rump length (CRL), and viability using Image J. Fetuses were considered nonviable if CRL was more than 2 standard deviations less than the mean litter CRL or had irregular anatomical traits. All data were analyzed using PROC GLIMMIX with either pregnant gilt as the experimental unit for litter-based measures or individual fetus as the experimental unit for fetal based measures. Gilt NE intake efficiency [average daily gain (ADG); NE intake) was greater for HS (<span>P</span> = 0.04; 0.11 ± 0.01) when compared with TN gilts (0.07 ± 0.01). No fetal ADG (<span>P</span> = 0.26; 0.12 ± 0.04 g/d) or fetal ADG; gilt NE intake differences (<span>P</span> = 0.26; 0.03 ± 0.01) were detected between treatments. Total fetuses per CL were decreased for HS gilts (<span>P</span> = 0.01; 0.72 ± 0.03 fetuses) when compared with TN gilts (0.85 ± 0.04 fetuses). Viable fetuses per CL were reduced for HS gilts (<span>P</span> = 0.05; 0.69 ± 0.01 fetuses) when compared with TN gilts (0.80 ± 0.04 fetuses). The difference between total CL count and total fetuses per gilt tended to be increased for HS (<span>P</span> = 0.08; 6 ± 1 fetus) versus TN gilts (4 ± 1 fetus). No other fetal differences were observed (<span>P</span> &gt; 0.10). In conclusion, early GHS improved gilt growth performance and NE efficiency, but resulted in decreased fertilization rates and reduced fetal viability and had no impact on fetal growth and development.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"838db7ed54c62339f16fccfd1941fb9c9097f4df080c36468ded32983a61aa14","category":"Environment"}