{"title":"IMO2020 Regulations Accelerate Global Warming by up to 3 Years in UKESM1","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF005011?af=R","date":1723627709000,"content":"<h2>Abstract</h2>\n<p>The International Maritime Organization (IMO) introduced new regulations on the sulfur content of shipping emissions in 2020 (IMO2020). Estimates of the climatic impact of this global reduction in anthropogenic sulfate aerosols vary widely. Here, we contribute to narrowing this uncertainty with two sets of climate model simulations using UKESM1. Using fixed sea-surface temperature atmosphere-only simulations, we estimate an IMO2020 global effective radiative forcing of 0.139 ± 0.019 Wm<sup>−2</sup> and show that most of this forcing is due to aerosol-induced changes to cloud properties. Using coupled ocean-atmosphere simulations, we note significant changes in cloud top droplet number concentration and size across regions with high shipping traffic density, and—in the North Atlantic and North Pacific—these microphysical changes translate to a decrease in cloud albedo. We show that IMO2020 increases global annual surface temperature on average by 0.046 ± 0.010°C across 2020–2029; approximately 2–3 years of global warming. Furthermore, our model simulations show that IMO2020 helps to explain the exceptional warming in 2023, but other factors are needed to fully account for it. The year 2023 also had an exceptionally large decrease in reflected shortwave radiation at the top-of-atmosphere. Our results show that IMO2020 made that more likely, yet the observations are within the variability of simulations without the reduction in shipping emissions. To better understand the climatic impacts of IMO2020, a model intercomparison project would be valuable whilst the community waits for a more complete observational record.</p>","author":"G. Jordan, \nM. Henry","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"838eccb8446821d5f6fbcd485381e2d654881649623a58194b5f66875c146bbc","category":"Environment"}