{"title":"The state of the bats in North America","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15225?af=R","date":1729049400000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/2bf10df5-8472-469d-a260-321e7e9a924a/nyas15225-gra-0001-m.png\" alt=\"The state of the bats in North America\" />\n<p>We conducted an international expert elicitation to assess 153 bat species in North America. We identified 102 experts from Canada, the United States, and Mexico who could evaluate species status, threats, and population trends. We analyzed their assessments to establish each species’ current conservation status, rank the expected future impact of each threat, and describe recent population trends. Our results can inform management decisions and conservation priorities to strengthen North American bat conservation.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The world's rich diversity of bats supports healthy ecosystems and important ecosystem services. Maintaining healthy biological systems requires prompt identification of threats to biodiversity and immediate action to protect species, which for wide-ranging bat species that span geopolitical boundaries warrants international coordination. Anthropogenic forces drive the threats to bats throughout North America and the world. We conducted an international expert elicitation to assess the status of 153 bat species in Canada, the United States, and Mexico. We used expert assessment to determine the conservation status, highest impact threats, and recent population trends for these species. We found that 53% of North American bat species have moderate to very high risk of extinction in the next 15 years. The highest impact threats varied with species and country, and four IUCN threat categories had the greatest overall impacts: Climate Change, Problematic Species (including disease), Agriculture, and Energy Production. Experts estimated that 90% of species assessed had decreasing population trends over the past 15 years, demonstrating the need for conservation action. Although the state of North American bats is concerning, we identify threats that can be addressed through internationally collaborative, proactive, and protective actions to support the recovery and resilience of North American bat species.</p>","author":"Amanda M. Adams, \nLuis A. Trujillo, \nC. J. Campbell, \nKarin L. Akre, \nJoaquin Arroyo‐Cabrales, \nLeanne Burns, \nJeremy T. H. Coleman, \nRita D. Dixon, \nCharles M. Francis, \nMelquisedec Gamba‐Rios, \nVona Kuczynska, \nAngie McIntire, \nRodrigo A. Medellín, \nKatrina M. Morris, \nJorge Ortega, \nJonathan D. Reichard, \nBrian Reichert, \nJordi L. Segers, \nMichael D. Whitby, \nWinifred F. Frick","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"83904db1d656a32901c91c60f39451ef3c030ac124102bd98b4275e35508c669","category":"Environment"}