{"title":"Mechanical and thermal thresholds before and after application of a conditioning stimulus in healthy Göttingen Minipigs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309604","date":1724940000000,"content":"<p>by Mariafrancesca Petrucci, Claudia Spadavecchia, Robert Rieben, Daniela Casoni</p>\r\n\r\nMinipigs are widely used in biomedical research for translational studies. However, information about pain elicited by experimental procedures is lacking. Non-invasive methods as quantitative sensory testing and conditioned pain modulation are particularly attractive. Our overarching aim was to explore and refine these methods for assessing post-operative pain in minipigs after myocardial infarction. As first step, we aimed at defining mechanical and thermal thresholds in healthy adults Göttingen Minipigs, evaluating their reliability, and testing their modifications after the application of a conditioning stimulus. Thresholds were assessed at different body sites before and after a painful conditioning stimulus (CS) (cuffed tourniquet) and sham CS (uncuffed tourniquet) in eleven animals. Thresholds’ reliability was assessed using interclass correlation coefficient (ICC). The effect of the CS was assessed calculating absolute change, percentage change of the thresholds and standard error of measurement. Baseline mechanical thresholds (Newton) were: left hindlimb 81 [73; 81]; left forearm 81 [72.1; 81]; right forearm 81 [76; 81]; left chest 80.5 [68; 81]; right chest 81 [76.5; 81]; left neck 81 [70.3; 81]; right neck 74.8 [62.3; 80.5]. Reliability of mechanical thresholds was good at right chest (ICC = 0.835) and moderate at left chest (ICC = 0.591), left hindlimb (ICC = 0.606) and left neck (ICC = 0.518). Thermal thresholds showed poor reliability in all the tested sites. A modulatory effect was present at right chest, but it was seen when both a painful CS and a sham CS was applied. Minipigs tendentially showed a pro-nociceptive profile (i.e. conditioning pain facilitation). The measured thresholds are a reference for future trials in this species. Mechanical thresholds showed to be more reliable and, therefore, more useful, than thermal ones. The pain facilitation might be explained by the phenomenon of stress induced hyperalgesia, but this finding needs to be further investigated with a stricter paradigm.","author":"Mariafrancesca Petrucci","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8392ee1baeb800abcb87e7e1ac02b59603bad4b9b7405a69dce4fff8b17fa34b","category":"Interdisciplinary"}