{"title":"AWS Clean Rooms ML helps customers and partners apply ML models without sharing raw data (preview)","link":"https://aws.amazon.com/blogs/aws/aws-clean-rooms-ml-helps-customers-and-partners-apply-ml-models-without-sharing-raw-data-preview/","date":1701279820000,"content":"<p>Today, we’re introducing <a href=\"https://aws.amazon.com/clean-rooms/ml\">AWS Clean Rooms ML</a> (preview), a new capability of <a href=\"https://aws.amazon.com/clean-rooms/\">AWS Clean Rooms</a> that helps you and your partners apply machine learning (ML) models on your collective data without copying or sharing raw data with each other. With this new capability, you can generate predictive insights using ML models while continuing to protect your sensitive data.</p> \n<p>During this preview, AWS Clean Rooms ML introduces its ﬁrst model specialized to help companies create lookalike segments for marketing use cases. With AWS Clean Rooms ML lookalike, you can train your own custom model, and you can invite partners to bring a small sample of their records to collaborate and generate an expanded set of similar records while protecting everyone’s underlying data.</p> \n<p>In the coming months, AWS Clean Rooms ML will release a healthcare model. This will be the first of many models that AWS Clean Rooms ML will support next year.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-0.png\" width=\"1920\" height=\"996\" /></p> \n<p>AWS Clean Rooms ML helps you to unlock various opportunities for you to generate insights. For example:</p> \n<ul> \n <li>Airlines can take signals about loyal customers, collaborate with online booking services, and offer promotions to users with similar characteristics.</li> \n <li>Auto lenders and car insurers can identify prospective auto insurance customers who share characteristics with a set of existing lease owners.</li> \n <li>Brands and publishers can model lookalike segments of in-market customers and deliver highly relevant advertising experiences.</li> \n <li>Research institutions and hospital networks can find candidates similar to existing clinical trial participants to accelerate clinical studies (coming soon).</li> \n</ul> \n<p>AWS Clean Rooms ML lookalike modeling helps you apply an AWS managed, ready-to-use model that is trained in each collaboration to generate lookalike datasets in a few clicks, saving months of development work to build, train, tune, and deploy your own model.</p> \n<p><span><strong>How to use AWS Clean Rooms ML to generate predictive insights<br /> </strong></span>Today I will show you how to use lookalike modeling in AWS Clean Rooms ML and assume you have already set up a data collaboration with your partner. If you want to learn how to do that, check out the <a href=\"https://aws.amazon.com/blogs/aws/aws-clean-rooms-now-generally-available/\">AWS Clean Rooms Now Generally Available — Collaborate with Your Partners without Sharing Raw Data</a> post.</p> \n<p>With your collective data in the AWS Clean Rooms collaboration, you can work with your partners to apply ML lookalike modeling to generate a lookalike segment. It works by taking a small sample of representative records from your data, creating a machine learning (ML) model, then applying the particular model to identify an expanded set of similar records from your business partner’s data.</p> \n<p>The following screenshot shows the overall workflow for using AWS Clean Rooms ML.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-1.png\" width=\"1418\" height=\"448\" /></p> \n<p>By using AWS Clean Rooms ML, you don’t need to build complex and time-consuming ML models on your own. AWS Clean Rooms ML trains a custom, private ML model, which saves months of your time while still protecting your data.</p> \n<p><strong>Eliminating the need to share data<br /> </strong>As ML models are natively built within the service, AWS Clean Rooms ML helps you protect your dataset and customer’s information because you don’t need to share your data to build your ML model.</p> \n<p>You can specify the training dataset using the <a href=\"https://docs.aws.amazon.com/glue/latest/dg/catalog-and-crawler.html\">AWS Glue Data Catalog</a> table, which contains user-item interactions.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/2023-cleanrooms-ml-d-3.jpg\" width=\"1129\" height=\"866\" /></p> \n<p>Under <strong>Additional columns to train</strong>, you can define numerical and categorical data. This is useful if you need to add more features to your dataset, such as the number of seconds spent watching a video, the topic of an article, or the product category of an e-commerce item.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/2023-cleanrooms-ml-d-4.jpg\" width=\"1122\" height=\"854\" /></p> \n<p><strong>Applying custom-trained AWS-built models</strong><br /> Once you have defined your training dataset, you can now create a lookalike model. A lookalike model is a machine learning model used to find similar profiles in your partner’s dataset without either party having to share their underlying data with each other.</p> \n<p>When creating a lookalike model, you need to specify the training dataset. From a single training dataset, you can create many lookalike models. You also have the flexibility to define the date window in your training dataset using <strong>Relative range</strong> or <strong>Absolute range</strong>. This is useful when you have data that is constantly updated within AWS Glue, such as articles read by users.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-5-1.png\" width=\"1124\" height=\"977\" /></p> \n<p><strong>Easy-to-tune ML models</strong><br /> After you create a lookalike model, you need to configure it to use in AWS Clean Rooms collaboration. AWS Clean Rooms ML provides flexible controls that enable you and your partners to tune the results of the applied ML model to garner predictive insights.</p> \n<p>On the <strong>Configure lookalike model</strong> page, you can choose which <strong>Lookalike model</strong> you want to use and define the <strong>Minimum matching seed size</strong> you need. This seed size deﬁnes the minimum number of profiles in your seed data that overlap with profiles in the training data.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/2023-cleanrooms-ml-d-6.jpg\" width=\"1122\" height=\"958\" /></p> \n<p>You also have the flexibility to choose whether the partner in your collaboration receives metrics in <strong>Metrics to share with other members</strong>.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/09/2023-cleanrooms-ml-d-7.jpg\" width=\"1114\" height=\"943\" /></p> \n<p>With your lookalike models properly configured, you can now make the ML models available for your partners by associating the configured lookalike model with a collaboration.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-7.png\" width=\"1569\" height=\"909\" /></p> \n<p><strong>Creating lookalike segments</strong><br /> Once the lookalike models have been associated, your partners can now start generating insights by selecting <strong>Create lookalike segment</strong> and choosing the associated lookalike model for your collaboration.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-8.png\" width=\"1133\" height=\"995\" /></p> \n<p>Here on the <strong>Create lookalike segment</strong> page, your partners need to provide the <strong>Seed profiles</strong>. Examples of seed profiles include your top customers or all customers who purchased a specific product. The resulting lookalike segment will contain profiles from the training data that are most similar to the profiles from the seed.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-11.png\" width=\"1049\" height=\"906\" /></p> \n<p>Lastly, your partner will get the <strong>Relevance metrics</strong> as the result of the lookalike segment using the ML models. At this stage, you can use the <strong>Score</strong> to make a decision.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-9.png\" width=\"1500\" height=\"874\" /></p> \n<p><strong>Export data and use programmatic API<br /> </strong>You also have the option to export the lookalike segment data. Once it’s exported, the data is available in JSON format and you can process this output by integrating with AWS Clean Rooms API and your applications.</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/11/24/2023-cleanrooms-ml-rev-10.png\" width=\"1060\" height=\"841\" /></p> \n<p><span><strong>Join the preview</strong></span><br /> AWS Clean Rooms ML is now in preview and available via AWS Clean Rooms in US East (Ohio, N. Virginia), US West (Oregon), Asia Pacific (Seoul, Singapore, Sydney, Tokyo), and Europe (Frankfurt, Ireland, London). Support for additional models is in the works.</p> \n<p>Learn how to apply machine learning with your partners without sharing underlying data on the <a href=\"https://aws.amazon.com/clean-rooms/ml\">AWS Clean Rooms ML</a> page.</p> \n<p>Happy collaborating!<br /> — <a href=\"https://www.linkedin.com/in/donnieprakoso\">Donnie</a></p>","author":"Donnie Prakoso","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"8394793f6517940982b1128bf21d3d49edfbbca4091271c669bd1c8240c059b9","category":"Tech"}