{"title":"Landscape and habitat characteristics jointly drive the urban distribution of a nuisance species","link":"http://link.springer.com/10.1007/s11252-024-01594-2","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Identifying environmental variables that affect the distribution of pest and/or nuisance species promotes effective management strategies by improving urban planning and the targeted application of direct interventions like population control. Australian white ibis <em>Threskiornis moluccus</em> are considered a nuisance species throughout Australia, having increased significantly in abundance in coastal urban landscapes following declines in their native inland habitats over the past three decades. Few management interventions thus far have successfully reduced conflicts between ibis and humans, necessitating a better understanding of conditions driving ibis distribution and abundance. We surveyed 26 ibis colonies throughout the Moreton Bay region in central eastern Australia and quantified the effects of a range of spatial (e.g. connectivity with waste management facilities, urban land and wetlands) and habitat (e.g. nesting tree species, density and size) variables on ibis and nest abundance. Ibis and their nests were most abundant at sites within 10 km of waste management facilities, and &lt; 60 m from residential or industrial estates. Ibis were also more abundant at sites with tree canopy height &lt; 10 m and lower tree species richness. Nests were most abundant on water bound islands with tree density &gt; 0.5 trees/m<sup>2</sup>. Urbanisation had contrasting effects, with nest numbers increasing with higher connectivity (i.e. closer proximity) to urban land, while ibis numbers decreased (relative to waste management facilities). Multifaceted approaches are required for controlling ibis populations, including restricting access to anthropogenic food resources, managing the condition of remnant habitats, and considering population control at sites with high connectivity to foraging grounds.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"8399638ae7b3f5b65300e0b728d1d5678981462a5137b21f86f9cba69d7a1f3d","category":"Environment"}