{"title":"Our Winter ’21 Drop Is Live!","link":"https://theradavist.com/2021/12/our-winter-21-drop-is-live/","date":1638371453000,"content":"<p><img src=\"https://media.theradavist.com/uploads/2021/12/RadavistWinter21.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With supply chain shortages, backlogged production, and having to find a new screen printer who could actually get shirts for us, I thought this day would never come but we’re here, finally! Our Winter drop is live <a href=\"https://theradavist.com/shop/\" target=\"_blank\">in our webshop</a> via <a href=\"https://www.theproscloset.com/collections/radavist\" target=\"_blank\">The Radavist shop at The Pro’s Closet</a>. We’ve got collaboration artist bottles with <a href=\"https://www.instagram.com/shaun_marcus/?hl=en\" target=\"_blank\">Shaun Marcus</a> from <a href=\"https://www.bicyclecoffee.org/\" target=\"_blank\">Silver Stallion</a>, a Radasnake design from <a href=\"https://www.collettemarie.art/\" target=\"_blank\">Collette Marie</a> that’s been over a year in the works, colored stem caps, a re-up of our <a href=\"https://www.instagram.com/klctvefusion/\" target=\"_blank\">Bobby Dixon</a>-designed DUNE-inspired top caps, new sock designs by Cari Carmean, and as always, our <a href=\"https://workbyland.com/\" target=\"_blank\">LAND</a>-designed logos on classic t-shirts.</p>\n<p>I also thought it would be nice to include some of TPC’s Certified Pre-Owned bikes and new products in the webshop as well. You can sort the goods by “<a href=\"https://theradavist.com/shop/?_product_category=merch\" target=\"_blank\">Merch</a>“, “<a href=\"https://theradavist.com/shop/?_product_category=bikes-on-tpc\" target=\"_blank\">Bikes</a>“, and “<a href=\"https://theradavist.com/shop/?_product_category=gear-on-tpc\" target=\"_blank\">Gear</a>“. I’ll personally be updating this list weekly, so check back for a curated look at fine steel and titanium bikes that TPC gets in stock. Like that <a href=\"https://theradavist.com/product/rivendell-roadeo-custom-road-bike-x-large/\" target=\"_blank\">Rivendell Roadeo for $2224.99</a>…</p>\n<p><em>Now that the good news is out of the way, it’s time for some bad news. We’ve tried to get international shipping handled but since The Pro’s Closet is now shipping all of our merch, they will only ship to the US and Canada. We’re trying to figure out a solution to this problem but right now, your best bet is to use an <a href=\"https://packagehopper.myus.com/\" target=\"_blank\">international forwarding company</a>… I’m really sorry to be the bearer of this news and I’m hoping we can work this out sooner than later. Another note is our head-banging experience trying to integrate Shopify in our WordPress website. It sucks. They don’t want to play with each other, so apologies for the multiple windows you’ll have to open in order to pick out your goods! The last bit of good news is TPC ships with FedEx so you’ll be receiving your goods MUCH FASTER from here on out!</em></p>\n<p>Thanks for your patience in this transition period! If you’re a web developer who has successfully mated WordPress and Shopify, I’m all ears!</p>\n<p>Thanks for your support!</p>\n<p>-John</p>\n<p>The post <a href=\"https://theradavist.com/2021/12/our-winter-21-drop-is-live/\">Our Winter ’21 Drop Is Live!</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"83adfd7c49706ea94e73521bf2aeb77fcff702805844891c009168076e3417e3","category":"Cycling"}