{"title":"Tannic acid alleviates ETEC K88‐induced intestinal damage through regulating the p62‐keap1‐Nrf2 and TLR4‐NF‐κB‐NLRP3 pathway in IPEC‐J2 cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13343?af=R","date":1718348660000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Tannic acid (TA), a naturally occurring polyphenol, has shown diverse potential in preventing intestinal damage in piglet diarrhea induced by <i>Enterotoxigenic Escherichia coli</i> (ETEC) K88. However, the protective effect of TA on ETEC k88 infection-induced post-weaning diarrhea and its potential mechanism has not been well elucidated. Therefore, an animal trial was carried out to investigate the effects of dietary supplementation with TA on the intestinal diarrhea of weaned piglets challenged with ETEC K88. In addition, porcine intestinal epithelial cells were used as an in vitro model to explore the mechanism through which TA alleviates intestinal oxidative damage and inflammation.</p>\n<h2>RESULTS</h2>\n<p>The results indicated that TA supplementation (2 and 4 g kg<sup>−1</sup>) reduced diarrhea rate, enzyme activity (diamine oxidase [DAO] and Malondialdehyde [MAD]) and serum inflammatory cytokines concentration (<i>TNF-α</i> and <i>IL-1β</i>) (<i>P</i> &lt; 0.05) compared to the Infection group (IG), group <i>in vivo</i>. <i>In vitro</i>, TA treatment effectively alleviated ETEC-induced cytotoxicity, increased the expression of <i>ZO-1</i>, <i>occludin</i> and <i>claudin-1</i> at both mRNA and protein levels. Moreover, TA pre-treatment increased the activity of antioxidant enzymes (such as T-SOD) and decreased serum cytokine levels (<i>TNF-α</i> and <i>IL-1β</i>). Furthermore, TA increased cellular antioxidant capacity by activating the <i>Nrf2</i> signaling pathway and decreased inflammatory response by down-regulating the expression of <i>TLR4</i>, <i>MyD88</i>, <i>NF-kB</i> and <i>NLRP3</i>.</p>\n<h2>CONCLUSION</h2>\n<p>The present study showed that TA reduced the diarrhea rate of weaned piglets by restoring the intestinal mucosal mechanical barrier function, alleviating oxidative stress and inflammation. The underlying mechanism was achieved by modulating the <i>p62-keap1-Nrf2</i> and <i>TLR4-NF-κB-NLRP3</i> pathway. © 2024 Society of Chemical Industry.</p>","author":"Wenhui Liu, \nKangkang Guo","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"83b80f99818441ea81fb21f3518781bc23bf42cf43cc012da7d3572fac6d777f","category":"Environment"}