{"title":"Rocket Report: SpaceX tests FAA again in Texas, India pushes Vikas engine","link":"https://arstechnica.com/?p=1780794","date":1626433208000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/UNITY-2_6.00_37_55_04.Still001-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/UNITY-2_6.00_37_55_04.Still001.jpg\">Enlarge</a> <span>/</span> VSS <em>Unity</em> burns its rocket motor on July 11, 2021. (credit: <a href=\"https://www.virgingalactic.com/\">Virgin Galactic</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 4.07 of the Rocket Report! Looking back to Virgin Galactic's flight and ahead to Blue Origin, we're continuing to experience a very special moment in human spaceflight history this week, with final preparations underway for Jeff Bezos and the first crew flight of New Shepard. I'll be on hand, in West Texas, to report on all the action for Ars.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Richard Branson finally does it</strong>. A new era opened this past weekend when Sir Richard flew alongside Virgin Galactic employees Beth Moses, Sirisha Bandla, and Colin Bennett above 80 km, NASA's definition of space. In doing so, the spacecraft's pilots and crew opened a future that is both full of promise and uncertainty. Spaceflight has changed forever. In a feature, <a href=\"https://arstechnica.com/science/2021/07/heres-why-richard-bransons-flight-matters-and-yes-it-really-matters/\" target=\"_blank\">Ars explores</a> the history of private spaceflight and digs into its future.</p></div><p><a href=\"https://arstechnica.com/?p=1780794#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780794&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"83bfbc15e844d231a3d1e7a32e42c4b1817dec690e2854b857877b03516fe61b","category":"Tech"}