{"title":"Scutellaria barbata D.Don extract regulates Ezrin-mediated triple negative breast cancer progress via suppressing the RhoA /ROCK1 signaling","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae033/7632979?rss=1","date":1710979200000,"content":"<span><div>Abstract</div><div>Background</div>Triple-negative breast cancer (TNBC) lacks effective therapeutic targets. Scutellaria barbata D.Don (SB) has been revealed to have anti-breast cancer (BC) effect, but the effect of SB extract in TNBC is still unclear. Herein, this research delves into the underlying mechanism.<div>Methods</div>SB was extracted by solvent extraction, and the main components were identified using an Agilent 6,520 HPLC-Chip/Q-TOF (Chip/Q-TOF) MS system. In vitro cell experiments were conducted. The effects of SB extract alone, SB extract plus EGF, GSK alone, GSK plus Ezrin overexpression, or SB extract plus Ezrin overexpression on cell viability, invasion, migration, and apoptosis were examined by cell function experiments. The apoptosis- and RhoA/ROCK1 pathway-related protein levels were analyzed by western blot assay.<div>Results</div>Mass spectrometry analysis exhibited that SB extract mainly contains long-chain fatty acids and ursolic acid. SB extract mitigated TNBC cell biological phenotypes, apoptosis- and RhoA/ROCK1 pathway-related marker expressions, which were reversed by EGF. The further results found that GSK obviously weakens TNBC cell biological behaviors, apoptosis- and RhoA/ROCK1 signaling-related protein levels, while oe-Ezrin treatment reverses the effect of GSK on TNBC cells. Moreover, SB extract regulated Ezrin-mediated function of TNBC cells by impeding the RhoA/ROCK1 pathway.<div>Conclusion</div>Our findings demonstrated that SB extract regulated Ezrin-mediated proliferation, migration, invasion, and apoptosis of TNBC cells via suppressing the RhoA /ROCK1 signaling. Our results offer the experimental foundation for further investigation of the anti-cancer role of SB in TNBC cells.<div>Highlights</div><ul><li>SB extract inhibits the biological phenotypes of TNBC cells.</li><li>SB extract inhibits the biological behaviors of TNBC cells through the RhoA/ROCK1 pathway.</li><li>SB extract modulates Ezrin-mediated TNBC cell proliferation, migration, invasion, and apoptosis via restraining the RhoA/ROCK1 signaling.</li></ul></span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"83c294f58203d33408f6ba981062107a716055dcb4636f2fda985368d31dc187","category":"Environment"}