{"title":"Transcriptome analysis of the common moss Bryum pseudotriquetrum grown under Antarctic field condition","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae043/7731208?rss=1","date":1723248000000,"content":"<span><div>Abstract</div>Mosses are distributed all over the world including Antarctica. Although Antarctic mosses show active growth in a short summer season under harsh environments such as low temperature, drought and high levels of UV radiation, survival mechanisms for such multiple environmental stresses of Antarctic mosses have not yet been clarified. In the present study, transcriptome analyses were performed using one of the common mosses <span>Bryum pseudotriquetrum</span> grown under an Antarctic field and artificial cultivation conditions. Totally 88 205 contigs were generated by <span>de novo</span> assembly, among which 1377 and 435 genes were significantly up and downregulated, respectively, under Antarctic field conditions compared with artificial cultivation conditions at 15°C. Among the upregulated genes, a number of lipid metabolism-related and oil body formation-related genes were identified. Expression levels of these genes were increased by artificial environmental stress treatments such as low temperature, salt and osmic stress treatments. Consistent with these results, <span>B</span>. <span>pseudotriquetrum</span> grown under Antarctic field conditions contained large amounts of fatty acids, especially α-linolenic acid, linolenic acid and arachidonic acid. In addition, proportion of unsaturated fatty acids, which enhance membrane fluidity, to the total fatty acids was also higher in <span>B</span>. <span>pseudotriquetrum</span> grown under Antarctic field conditions. Since lipid accumulation and unsaturation of fatty acids are generally important factors for the acquisition of various environmental stress tolerance in plants, these intracellular physiological and metabolic changes may be responsible for the survival of <span>B</span>. <span>pseudotriquetrum</span> under Antarctic harsh environments.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"83c8ffa229d99799cbe938e02fd704142b30d919c0e38ff2879405b0a460768e","category":"Environment"}