{"title":"Women's time trial world championships preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/womens-time-trial-world-championships-preview","date":1631113009000,"content":"\n      <p><span>On Monday the 20th September the road cycling time trial World Championships will take place in the Flanders region of Belgium. In the past few weeks, many of the riders who took time off from racing after the Tokyo Olympic Games have started to return to competition,</span><span> </span>giving us a good idea of who is on form going into the World Championships. </p>\n<div></div>\n<p><span>The Olympic Games time trial was raced on a markedly different course to the one the World Championships will take place on, however the results are still likely to give a good indication of who will feature strongly in Flanders. The results of the two individual time trials in stage races since the Olympics give a good indication of who is set to medal in Flanders; with Marlen Reusser taking the win at Simac Ladies Tour, and Annemiek van Vleuten claiming victory in the Ceratizit Challenge by La Vuelta. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-womens-road-race-world-championships\"><strong><em>Related: Women's World Championship Road Race Preview</em></strong></a></p>\n<h3><strong>The route</strong></h3>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screenshot_2021-09-08_at_12.12.07_1024x1024.png?v=1631099566\" /></div>\n<p><span>The 30.3km time trial starts along the coast in Knokke-Heist before heading inland towards the finish in Bruges. With just 54m of vertical gain throughout this is a course for the pure time trial specialist and is likely to be a fast one. The course may be relatively flat and straightforward, however the open, coastal setting could see wind play a significant role in how the time trial is raced. </span></p>\n<h3><strong>Contenders </strong></h3>\n<h4><strong>Annemiek van Vleuten</strong></h4>\n<p><span>The Olympic time trial champion will go into this race as the undisputed favourite to claim the title. After going into the 2020 World Championships in Imola with a broken wrist from a crash on stage 7 of the Giro Rosa and thus missing the time trial, van Vleuten will be looking to reclaim the title she last held in 2018. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_6487_1024x1024.jpg?v=1631109740\" /></span></p>\n<p><em><span>Image: </span>Alex Broadway/SWpix</em></p>\n<p><span>The 38-year-old shows no signs at all of slowing down and has been galvanised still by her Olympic performances. In the races she has lined up for since Tokyo, van Vleuten has dominated with the same vigour of previous seasons and that appeared to be missing earlier this year. Her victory in the hilly 7km time trial at the Ceratizit challenge by La Vuelta almost says less about her current time trial form than the solo breakaway she pulled off on the next stage </span><span><span>— winning by a margin of almost three minutes. </span></span></p>\n<p><span><span>Van Vleuten may have preferred a climb or two on the World Championships course, but in her current form she is favourite no matter the parcours. </span></span></p>\n<h4><strong>Marlen Reusser </strong></h4>\n<p><span>After taking an impressive silver in Imola at last year’s World Championships, Reusser backed that result up with a silver medal at the Tokyo Olympic Games behind van Vleuten and ahead of current World Champion, Anna van der Breggen. </span></p>\n<p><span>The 29-year-old Swiss rider </span><span>—</span> who will be racing the time trial on her 30th birthday <span>—</span> picked up a dominant win in the time trial stage of the recent Simac Ladies Tour, finishing 18 seconds ahead of Ellen van Dijk. At the same race, Reusser finished 2nd overall behind Chantal van den Broek-Blaak after wearing the leader’s jersey for two stages showing herself to be on strong form post-Tokyo.  <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_8362_1024x1024.jpg?v=1631109835\" /></p>\n<p><em>Image: Simon Wilkinson/SWPix</em></p>\n<p>Reusser would have been forgiven for having a quieter race at the Ceratizit Challenge by La Vuelta, starting just two days after Simac Ladies Tour. However, on the first stage the Ale BTC Ljubljana rider put herself in the breakaway and then attacked her companions, time trialing her way to the line to take the win by a margin of 22 seconds. </p>\n<h4><strong>Anna van der Breggen </strong></h4>\n<p><span>Many would have interpreted that the defending champion would be hoping to end her career on a high with at least one world title to her name </span><span>— and </span>rounding off years of owning the rainbow jersey <span>— </span>however her recent form and choices are pointing to a quiet world championships for Anna van der Breggen. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1049-_1_1024x1024.jpg?v=1631109920\" /></p>\n\n<p><em>Image: Alex Whitehead/SWpix</em></p>\n<p>Neither the road race or the time trial courses particularly suit the Dutch rider, and after discounting herself from the European Championships citing problems with her post-Olympic form she appears to be winding down her career. The former Olympic Champion would be well within her rights to do so, having achieved more-or-less everything she could have in her incredible career, however she can never be discounted as a potential winner in any race she deigns to start. </p>\n<h4><strong>Ellen van Dijk</strong></h4>\n<p><span>The flat and windy course could be tailor made for Ellen van Dijk. The powerful Dutchwoman thrives on courses like this one and, should the wind become a factor then van Dijk’s stature and power will stand in her favour. </span></p>\n<p><span>Van Dijk's post-Tokyo form is looking promising. She took second place in both the 2km prologue and the flat, 17km ITT at the Simac Ladies Tour eventually taking third overall. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_0797_1024x1024.jpg?v=1631110033\" /><em>Image: </em></span><em>Alex Whitehead/SWpix </em></p>\n<h4><strong>Lisa Brennauer </strong></h4>\n<p><span>German national time trial champion and former World ITT champion, Lisa Brennauer is a favourite to at least podium in this race. If the 33-year-old can carry off and then better her form from Tokyo</span><span><span>— </span>where she was part of the gold-medal winning and record breaking team pursuit squad and placed 6th in both the road race and the time trial </span><span>—</span> then this course, which suits her strengths, could see her reclaim the title she has held before.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_3315_1024x1024.jpg?v=1631110100\" /></p>\n\n<p><em>Image: Alex Whitehead/SWpix</em></p>\n<h3><strong>Outside bets</strong></h3>\n<h4><strong>Lisa Klein</strong></h4>\n<p><span>Brennauer’s compatriot, Lisa Klein was also part of the Tokyo team pursuit squad and has shown some impressive time trialling form on the road this season. Klein took both the prologue and the ITT at the Baloise Ladies Tour in July and placed fourth in the ITT in the Simac Ladies Tour. The right form on the day could see Klein on the podium at the World Championships on this course. </span></p>\n<h4><strong>Anna Kiesenhofer</strong></h4>\n<p><span>If there is one thing the women’s peloton have learned this season, it’s that you cannot discount Anna Kiesenhofer. The Olympic champion might not be able to pull off the same move in a road race as she did in Tokyo, however if the time trial specialist is carrying the same form into the World Championships she may be able to sneak onto the podium. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-kiesenhofer-the-mathematician-who-won-the-numbers-game\">Related: Anna Kiesenhofer – The mathematician who beat the odds</a></strong></em></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1330531567_11b2f327-4557-440f-aec5-2fa94c4d750c_1024x1024.jpg?v=1631110281\" /><em>Image: Getty</em></span></p>\n<h3><strong>Notable absentees </strong></h3>\n<p><span>2019 winner Chloe Dygert is still suffering from the effects of the horrific crash she endured while defending her title in Imola and has announced that she will be ending her season early. Dygert sought to win for the US national team at the Tokyo Olympic Games but could only manage seventh place. </span></p>\n<p><span>Australian Grace Brown could also have made her mark on this race but unfortunately the 29-year-old has been forced to end her season due to a shoulder injury that required surgery.</span></p>\n<p><em><span>Cover image: </span>Alex Whitehead/SWpix</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"83cb989a7bcda1e3acad151e8628bd7057ca472acdb20ae6c518bc05c12a8d57","category":"Cycling"}