{"title":"PSXIII-28 Effects of replacing dry-rolled flint corn with reconstituted corn grain silage in supplements for beef cattle finished on pasture provided on different days after mixing","link":"https://academic.oup.com/jas/article/102/Supplement_3/796/7757923?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The study was carried out to assess how replacing dry-rolled flint corn (DRC) with reconstituted corn grain silage (RCGS) in a supplement, exposed in aerobic conditions for different periods before delivery to cattle (fresh, 3 d, or 6 d), affects the performance of Nelore bulls intensively finished on pasture with high supplementation. Nellore bulls [n = 864; body weight (BW) = 408 ± 35 kg; 22 mo old) were used in a randomized block design and distributed into 12 paddocks (10 ha, n = 6; 8 ha, n = 6; 8 bulls/ha). The treatments consisted of control (CON; DRC supplement); T0 (70% of DRC replaced with RCGS and provided after mixing); T3 (70% DRC replaced with RCGS and provided 3 d after mixing); and T6 (70% of DRC replaced with RCGS and provided 6 d after mixing). The control supplement was composed of 67.3% DRC, 11.0% cottonseed whole, 17.4% cottonseed cake, and 4.30% mineral premix. The RCGS was inoculated using <span>Lactobacillus hilgardii</span> (CNCM I-4785) + <span>Lactobacillus buchneri</span> (NCIMB 40788), both at 1.5x10<sup>5</sup> cfu/g, and opened after 60 d of storage in silos bag (61% DM). Bulls were fed ad libitum for 102 d. Intake was measured daily. Performance data was calculated considering supplement intake (DMI<sub>sup</sub>) and initial carcass dressing was considered 50%. All data were analyzed as orthogonal contrasts using SAS: C1: CON vs T0; L: linear effect of exposure time; Q: quadratic effect of exposure time. Orthogonal contrasts were analyzed considering <span>P</span> &lt; 0.05 as significant effect and <span>P</span> ≤ 0.10 as tendency. Bulls consuming RCGS supplements tended to exhibit a linear response in DMI<sub>sup</sub> (% BW) over the day of supplement air exposure. No effect was detected in the other assessments for L and Q contrasts (<span>P</span> ≥ 0.11). Bulls consuming fresh RCGS supplement tended to have heavier final BW (<span>P</span> = 0.06) and to consume 5% less supplement (<span>P</span> = 0.09; Table 1). The average daily gain (ADG) was 3.9% greater for T0 animals in comparison with CON (<span>P</span> = 0.03). Supplement intake as % BW was 5.4% less (<span>P</span> &lt; 0.01), and feed efficiency was 10.5% better for cattle consuming fresh supplement in comparison with CON (<span>P</span> &lt; 0.01). Hot carcass weight tended to be greater for T0 bulls compared with CON bulls (<span>P</span> = 0.09) and carcass ADG presented the same behavior (<span>P</span> = 0.09). Carcass feed to gain (F:G) was 7.17% better for T0 bulls compared with CON bulls (<span>P</span> &lt; 0.01). Fecal starch and feces pH presented better results for T0 in comparison with CON (<span>P</span> &lt; 0.01). Nellore cattle consuming fresh RCGS supplement had better ADG, carcass characteristics, and feed efficiency than cattle consuming DRC supplement. Cattle consuming air-exposed RCGS supplements performed similarly to cattle consuming fresh RCGS supplement.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"83cefc79542ecc31084699d789be0fed1de6b4dfd4c4fe75a8434fbf4e392c04","category":"Environment"}