{"title":"Dual Inhibition of Phosphodiesterase 3 and 4 Enzymes by Ensifentrine Protects against MRSA-Induced Lung Endothelial and Epithelial Dysfunction","link":"https://www.preprints.org/manuscript/202409.0853/v1","date":1726044060000,"content":"Acute Respiratory Distress Syndrome (ARDS) is a severe lung condition with a high mortality rate for which there are no effective therapeutics. The failure of the alveolar-capillary barrier, composed of lung endothelial (EC) and alveolar epithelial (AEC) cells, is a critical factor leading to excessive inflammation and edema characteristics of acute lung injury (ALI). Phosphodiesterases (PDE) are enzymes well-recognized for their roles in regulating endothelial permeability and inflammation. Although PDE inhibitors are used as therapeutics for inflammatory diseases like COPD (chronic obstructive pulmonary disease), their efficacy in treating ARDS has not yet been established. In this study, we investigate the effects of ensifentrine, an FDA-approved novel dual PDE 3/4 inhibitor, on lung endothelial and epithelial dysfunction caused by methicillin-resistant S. aureus (MRSA), a pathogen involved in bacterial ARDS. Human primary lung endothelial cells and alveolar epithelial cell lines (A549 and immortalized AEC) were treated with heat-killed MRSA, and their responses were assessed in the presence or absence of ensifentrine. Ensifentrine given either pre- or post exposure attenuated MRSA-induced increased lung endothelial permeability. VE-cadherin junctions, which serve to stabilize the EC barrier, were disrupted by MRSA; however, ensifentrine effectively prevented this disruption. Pre-treatment with ensifentrine protected against MRSA-induced EC pro-inflammatory signaling by inhibiting the expression of VCAM-1, ICAM-1, and by reducing the IL-6 release. In AEC, MRSA caused upregulation of ICAM-1, activation of NF-kB and production of IL-8, all of which were inhibited by ensifentrine. These results indicate that dual inhibition of phosphodiesterases 3 and 4 by ensifentrine is barrier protective and attenuates MRSA-induced inflammation in both lung endothelial and epithelial cells. The PDE3/4 inhibitor ensifentrine may represent a promising novel strategy for the treatment of ALI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"83d677eec6a238780629457ed406afdab41feb4362b4ac1cd655d92fea81c686","category":"Interdisciplinary"}