{"title":"Dialectical Behavior Therapy as an intervention for Treatment Resistant Depression in adults: A protocol for systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303967","date":1716386400000,"content":"<p>by Larissa Junkes, Bruno R. Gherman, Jose Carlos Appolinario, Antonio E. Nardi</p>\r\nBackground <p>Major Depressive Disorder is a long-term, recurring, and very common illness that is associated with a significant decline in functional ability. The gold-standard method of treating depression is pharmacotherapy, which involves the use of antidepressant medications either alone or in various combinations. However, approximately 30% of Major Depressive Disorder patients suffer from Treatment Resistant Depression, a more severe condition that has a profound impact on patients’ lives. Our study aims to conduct the first comprehensive review and meta-analysis to assess the effectiveness and safety of adding Dialectical Behavior Therapy to antidepressant medications compared to groups using pharmacotherapy alone as an intervention for adults with Treatment Resistant Depression.</p> Materials and methods <p>We will search for publications in the following databases: Cochrane Central Register of Controlled Trials, MEDLINE, Embase, Lilacs, Web of Science, and PsycINFO. We will manually review the reference lists of the included studies to identify potentially relevant studies. There will be no restrictions on the language or publication date. Quality assessment of the included studies will be performed independently according to the Cochrane Risk of Bias instrument. To assess the certainty of the findings’ body of evidence, we will use the Grading of Recommendations Assessment, Development and Evaluation (GRADE) methodology. This study aims to determine the effectiveness and safety of Dialectical Behavior Therapy as an intervention for Treatment Resistant Depression in adults.</p> Ethics and dissemination <p>Ethical approval was not required as individual patient data was not obtained. Our intention is to publish the systematic review in a medical journal that offers open access upon completion of the process.</p> Trial registration <p>PROSPERO registration number CRD42023406301. Registered on March 24, 2023.</p>","author":"Larissa Junkes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"83d65daa80023a359d5c9fab0e7497875361d174051de82d9999fa41f59b9315","category":"Interdisciplinary"}