{"title":"Handling heatwaves: balancing thermoregulation, foraging and bumblebee colony success","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae006/7603547?rss=1","date":1707350400000,"content":"<span><div>Abstract</div>Climate changes pose risks for bumblebee populations, which have declined relative to the growing frequency and severity of warmer temperature extremes. Bumblebees might mitigate the effects of such extreme weather through colonial behaviours. In particular, fanning behaviour to dissipate heat is an important mechanism that could reduce exposure of thermally sensitive offspring to detrimental nest temperatures (T<sub>n</sub>). The allocation of workers towards fanning over prolonged periods could impact foraging activity that is essential for colony-sustaining resource gathering. Colony maintenance and growth could suffer as a result of nutritional and high ambient temperature (T<sub>a</sub>) thermal stress. It remains uncertain whether a compromise occurs between thermoregulation and foraging under chronic, sublethal heat events and how colony success is impacted as a result. This study held colonies of <span>Bombus impatiens</span> at constant high T<sub>a</sub> (25°C, 30°C or 35°C) for 2 weeks while quantifying the percentage of foragers, fanning incidence, nest temperature (T<sub>n</sub>) and other metrics of colony success such as the percentage of adult emergence and offspring production. We found that foraging and adult emergence were not significantly affected by T<sub>a</sub>, but that thermoregulation was unsuccessful at maintaining T<sub>n</sub> despite increased fanning at 35°C. Furthermore, 35°C resulted in workers abandoning the colony and fewer offspring being produced. Our findings imply that heatwave events that exceed 30°C can negatively impact colony success through failed thermoregulation and reduced workforce production.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"83dce1b9906c3628b885afde1afe446d8b07be9a03026ce92a09af48e5880d10","category":"Environment"}