{"title":"A Qualitative Investigation of Parent Perceptions of Home Exercises for Congenital Muscular Torticollis","link":"https://www.preprints.org/manuscript/202405.0922/v1","date":1715675700000,"content":"The purpose of this qualitative study was to describe parent perceptions of the home exercise pro-gram (HEP) for their infant with congenital muscular torticollis (CMT), and how these perceptions evolved over a physical therapy (PT) plan of care. Twelve participants were recruited from a pediatric PT clinic, and nine completed interviews at three time points. Qualitative description and an iterative approach for thematic analysis of 27 interviews yielded three themes that corresponded to the research questions. The participants’ responses were categorized into three main themes: 1) parents’ perceptions of three key exercises within the HEP; 2) internal and external sources of stress; and 3) sources of empowerment and disempowerment. Regarding the HEP, parents articulated common sentiments for three frequently prescribed exercises for the management of CMT: 1) Tummy time was the fast favorite, 2) ipsilateral cervical rotation was perceived as stressful, and 3) contralateral cervical lateral flexion felt uncomfortable. Additionally, participants disclosed internal and external sources of stress (guilt, uncertainty, and the demands of returning to work) and sources of disempowerment (inconsistent messaging from providers, feeling overwhelmed) and empowerment (being able to see the bigger picture and clear communication and education about the diagnosis) with respect to managing their infant’s CMT. These themes provide insight into the evolution of parent perceptions over a PT plan of care for CMT. Participants’ insights suggest a need for consistent messaging regarding the diagnosis and evidence-based management of CMT, addressing parent stress, and modifying how exercises are taught. This study contributes updated research on parents’ experience with physical therapy and the HEP for their infant’s CMT.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"83e332d3bdf6d86363a84824a963f8bdc8b0d21e37fae969e30cb6800d31794d","category":"Interdisciplinary"}