{"title":"Effects of past mating behavior versus past ejaculation on male mate choice and male attractiveness","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae002/7564687?rss=1","date":1705449600000,"content":"<span><div>Abstract</div>Past reproductive effort allows males to assess their ability to acquire mates, but it also consumes resources that can reduce their future competitive ability. Few studies have examined how a male’s reproductive history affects his subsequent mate choice, and, to date, no study has determined the relative contribution of past mating behavior and past ejaculate production because these two forms of investment are naturally highly correlated. Here, we disentangled the relative effects of past mating behavior and past ejaculate production in mosquitofish (<span>Gambusia holbrooki</span>) by experimentally preventing some males from ejaculating when trying to mate. We assessed the effect of mating behavior on mate choice by comparing males that had previously been with or without access to females and male rivals for 8 and 16 weeks and assessed the effect of ejaculation on mate choice by comparing males that either could or could not ejaculate when they had access to females for 16 weeks. Reproductive treatment did not affect male attractiveness, but it did affect male mate choice. Somewhat surprisingly, in five of the six treatment-by-age at testing combinations, males preferred a female in the vicinity of a male rival over a solitary female. This preference was marginally stronger for males that had previously engaged in mating behavior but were unaffected by past ejaculate production. We discuss the potential benefits to males of associating with another male when seeking mates. This is the first study to quantify the relative influence of pre- and post-copulatory reproductive investment on male mate choice.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"8417119bdfda5c0cb89e32b114e23a21897cf3b0af1bea98f6b5b9039c0d2355","category":"Environment"}