{"title":"Quantification of cooling effects on basic tissue measurements and exposed cross-sectional brain area of cadaver heads from Holstein cows &gt; 30 mo of age","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae042/7630393?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>Penetrating captive bolt (PCB) is the primary method of preslaughter stunning for cattle and is also used for on-farm euthanasia. The objective of this study was to quantify the impact of cooling on the soft tissue thickness, cranial thickness, total tissue thickness, and cross-sectional brain area of cadaver heads collected from mature (&gt; 30 mo of age) dairy cows following the application of a PCB stun in a frontal placement. Hide-on cadaver heads were obtained from culled dairy cows (<span>N</span> = 37) stunned in a frontal location using a handheld PCB device (Jarvis Model PAS—Type C 0.25R Caliber Captive Bolt, Long Bolt) at a commercial slaughter establishment. Following transport to the University of Wisconsin—River Falls, heads were split at midline along the bolt path by a bandsaw and then underwent FRESH, CHILL24, CHILL48, and CHILL72 refrigeration treatments. The FRESH treatment involved images collected immediately after splitting each head, the CHILL24 treatment involved images collected after 24 h of refrigeration, the CHIL48 treatment involved images collected after 48 h of refrigeration, and the CHILL72 treatment involved images collected after 72 h of refrigeration. Measurements of soft tissue thickness, cranial thickness, total tissue thickness, and cross-sectional brain area were recorded for each refrigeration treatment. Soft tissue thickness did not differ caudal to (<span>P</span> = 0.3751) or rostral to (<span>P</span> = 0.2555) the bolt path. Cranial thickness did not differ caudal to (<span>P</span> = 0.9281) or rostral to (<span>P</span> = 0.9051) the bolt path. Total tissue thickness did not differ caudal to (<span>P</span> = 0.9225; FRESH: 24.77 mm, CHILL24: 23.93 mm, CHILL48: 24.27 mm, CHILL72: 42.30, SE: 0.86) or rostral to (<span>P</span> = 0.8931; FRESH: 24.09 mm, CHILL24: 23.99, CHILL48: 24.26, CHILL72: 24.43 mm, SE: 0.79 mm) the bolt path. Cross-sectional brain area was not different (<span>P</span> = 0.0971) between refrigeration treatments (FRESH: 9,829.65 ± 163.87 mm<sup>2</sup>, CHILL24: 10,012.00 ± 163.87 mm<sup>2</sup>, CHILL48: 9,672.43 ± 163.87 mm<sup>2</sup>, CHILL72: 10,235.00 ± 166.34 mm<sup>2</sup>). This study demonstrated that FRESH tissue parameters can be determined from cattle cadaver heads refrigerated for 24, 48, or 72 h.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"8423bdb10e7c7a8de5255ea88944010ae30542618d981bd8ddfecc517f32f036","category":"Environment"}