{"title":"Preview: The Belgian classics begin with Brugge-De Panne","link":"https://cyclingtips.com/2021/03/preview-the-belgian-classics-begin-with-brugge-de-panne/","date":1616545206000,"content":"<p>The excitement of <a href=\"https://cyclingtips.com/2021/03/elisa-longo-borghini-wins-trofeo-alfredo-binda/\" target=\"_blank\" rel=\"noreferrer noopener\">Trofeo Alfredo Binda</a> has hardly subsided and yet it&#8217;s time for the third race on the Women&#8217;s WorldTour calendar. Originally dubbed the Driedaagse Brugge-De Panne, this one-day Belgain race first took place in 2018. The inaugural edition came down to a large bunch sprint won by Jolien d&#8217;Hoore.</p>\n\n\n\n<p>Last year&#8217;s edition, <a href=\"https://cyclingtips.com/2020/10/wiebes-takes-first-worldtour-victory-for-team-sunweb-at-de-panne/\" target=\"_blank\" rel=\"noreferrer noopener\">AG Driedaagse Brugge-De Panne</a>, was won by Lorena Wiebes after Jolien d&#8217;Hoore was relegated for deviating from her sprint. What made the 2020 race particularly exciting was the weather, which is often the case in Belgium. Crosswinds, and some strong riding from the two biggest Dutch teams Sunweb and Boels-Dolmans, broke the peloton apart, especially in the final half of the race. In the end, it was a group of 17 that came to the line together. </p>\n\n\n\n<p>This year the race will be another wild Women&#8217;s WorldTour event. The races have been consistently exciting to watch, regardless of who shows up, what the weather is, and where the course goes. Perhaps because it&#8217;s still an Olympic year, perhaps because of the COVID-19 panic, or perhaps it&#8217;s just because the women have always raced their bikes like there is no tomorrow and now we actually get to watch it. </p>\n\n\n\n<h2>The course</h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"750\" height=\"530\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames.jpg\" alt=\"\" class=\"wp-image-506021\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames.jpg 750w, https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames-650x459.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames-190x134.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames-400x284.jpg 400w, https://cyclingtips.com/wp-content/uploads/2021/03/kaart-dames-16x11.jpg 16w\" sizes=\"(max-width: 750px) 100vw, 750px\" /></figure>\n\n\n\n<p>The women will race 158.8 km from Brugge to De Panne with two 45.1 km laps of a final circuit. A profile is not necessary because it&#8217;s pancake flat, save the odd highway crossing or speedbump. </p>\n\n\n\n<p>Once entering the circuits the race will head towards the coast before crossing the finish line and turning south. After a straight run along the French border the race takes a left turn north before following the same roads along the coast and to the finish. </p>\n\n\n\n<p>The changes in direction in the finishing circuits will mean multiple changes in wind direction, which could see the race split before the final kilometres. </p>\n\n\n\n<h2>The weather</h2>\n\n\n\n<p>Since it&#8217;s Belgian racing, the weather gets its own section in this preview, although it looks as though rain and crosswinds may not play a role in the 2021 edition. There is less than a 20% chance of rain at the start and finish. </p>\n\n\n\n<p>As for the wind, there is a section just after the finish line that heads south and is well known for being impacted by winds. The forecast is calling for crosswinds of roughly 22 km/h (14 mph) from the coast, numbers that will not strike fear (or excitement, depending on the rider) into the hearts of those racing. Still, those winds are not insignificant. </p>\n\n\n\n<p>The peloton might be able to stay together until the finishing circuits, but there is a high likelihood of splits once the riders take on the circuits around De Panne. </p>\n\n\n\n<h2>The contenders </h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"855\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-1340x855.jpg\" alt=\"\" class=\"wp-image-506024\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-1340x855.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-650x415.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-190x121.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-1080x689.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084-16x10.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032953-084.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Jolien D’Hoore pictured during the recent Healthy Ageing Tour.</figcaption></figure>\n\n\n\n<h3>Jolien d&#8217;Hoore (SD Worx)</h3>\n\n\n\n<p>Nearly a two-time winner of this event, Jolien d&#8217;Hoore will be one to watch for any kind of sprint finish. As noted, the former Belgian champion won the sprint in 2020 but was relegated for line deviation and she also won the first ever edition of the race.</p>\n\n\n\n<p>D&#8217;Hoore has already won a race in 2021, the first stage of the Healthy Ageing Tour. She was also second at the GP Oetingen a few days later. </p>\n\n\n\n<p>SD Worx has one other card to play in this type of finish: Amy Pieters. Pieters also has a win under her belt in 2021: Danilith Nokere Noerse. Actually, with eight race starts in 2021 Pieters has yet to finish outside the top 10, with a second place in the time trial at the Healthy Ageing Tour and second at Omloop van de Westhoek to her teammate Christine Majerus. </p>\n\n\n\n<p>When it comes to splitting the peloton in the crosswinds SD Worx has the roster to do it. Majerus, possibly the most versatile domestique in the peloton, will take to the start alongside Lonneke Uneken. Uneken won the final stage of the Healthy Ageing Tour with a spectacular solo move, indicating that the young Dutch rider has the legs to put pressure on other teams with strong sprinters. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-1340x893.jpg\" alt=\"\" class=\"wp-image-506025\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-1934.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Belgian National Champion Lotte Kopecky winning the bunch sprint for fourth at Nokere Koerse.</figcaption></figure>\n\n\n\n<h3>Lotte Kopecky (Liv Racing)</h3>\n\n\n\n<p>One of the most impressive riders of 2021 so far, Lotte Kopecky will be looking to take her first WorldTour victory of the year in De Panne. The Belgian champion already won Le Samyn des Dames in early March and won the bunch sprint at Danilith Nokere Koerse behind a break of three. </p>\n\n\n\n<p>On top of her results, Kopecky looked to be one of the strongest riders on the road at Omloop Het Nieuwsblad and Strade Bianche. In Italy, she was in a breakaway or two and only slipped back in the results due to an untimely mechanical. </p>\n\n\n\n<p>Kopecky&#8217;s team has ridden well together this season but will need to be attentive to any moves SD Worx makes in the windy sectors. That said, Kopecky has the experience to surf the wheels and find her own way to the finish if she needs to. </p>\n\n\n\n<p>Kopecky also finished third at both the 2019 and 2020 editions of this race, for a bit of bonus knowledge. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"894\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-1340x894.jpg\" alt=\"\" class=\"wp-image-506030\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-1340x894.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-650x434.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-1080x721.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032929-018.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /></figure>\n\n\n\n<h3>Lorena Wiebes (Team DSM)</h3>\n\n\n\n<p>Defending champion Lorena Wiebes is ready to fight for her first win of 2021. She was very close to taking it in the opening stage of the Healthy Ageing Tour but had a nasty high-speed crash a few hundred metres from the line. </p>\n\n\n\n<p>Wiebes was fifth at the Danilith Nokere Koerse last week but other than that has not had the results the young Dutchwoman is capable of. Wiebes is an incredibly strong sprinter and talented at positioning in the crosswinds. This race looks promising for her.</p>\n\n\n\n<p>Alongside Wiebes, Team DSM is starting Leah Kirchmann, who was recently named to Canada&#8217;s Olympic team for Tokyo. Kirchmann is another strong sprinter and could either help lead Wiebes to victory or try and find a little glory herself. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"893\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-1340x893.jpg\" alt=\"\" class=\"wp-image-506028\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-1340x893.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-650x433.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-190x127.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-1080x720.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/RhodePhoto_NokereKoerse_2021-0853.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>British champion Alice Barnes during Nokere Koerse.</figcaption></figure>\n\n\n\n<h3>Alice Barnes (Canyon-SRAM)</h3>\n\n\n\n<p>British champion Alice Barnes has had a promising start to the 2021 season. Although she hasn&#8217;t won a race yet this year she was very close in the opening stage of the Healthy Ageing Tour, coming in second to Jolien d&#8217;Hoore. Barnes holds both the road and time trial national titles for Great Britain. She&#8217;s a strong sprinter, but can also produce steady power, something that will come in handy if wind is involved. </p>\n\n\n\n<p>In 2020 Barnes made the winning split at AG Driedaagse Brugge-De Panne and finished sixth in the sprint. This year she is showing better form, especially at the Healthy Ageing Tour where she finished seventh in the stage 2 ITT, on stage 3, and in the final general classification. </p>\n\n\n\n<p>Barnes will line up with one of the best captains on the road and a Belgian classics connoisseur, Alexis Ryan. She also has Lisa Klein on her side, who just notched third at Danilith Nokere Koerse and was very strong on the final day of the Healthy Ageing Tour. Klein spent most of the wet and chaotic day in between the breakaway and the peloton and ended up finishing fifth at the top of the Vam-berg. </p>\n\n\n\n<p>Elise Chabbey and <a href=\"https://cyclingtips.com/2020/11/her-race-was-cancelled-at-the-last-minute-so-she-rode-1000-km-home/\" target=\"_blank\" rel=\"noreferrer noopener\">Hannah Ludwig</a> will also be important players for Barnes if the race goes sideways. Both are strong and would be able to navigate Barnes into prime position to take home a victory. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"943\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-1340x943.jpg\" alt=\"\" class=\"wp-image-506031\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-1340x943.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-650x457.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-190x134.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-1080x760.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090-16x11.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032970-090.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Emma Cecilie Norsgaard before the start of Nokere Koerse.</figcaption></figure>\n\n\n\n<h3>Emma Cecilie Norsgaard (Movistar)</h3>\n\n\n\n<p>There are a great many people who would be thrilled to see <a href=\"https://cyclingtips.com/2021/03/the-worldtour-siblings-two-different-riders-one-shared-love-of-cycling/\" target=\"_blank\" rel=\"noreferrer noopener\">Emma Cecilie Norsgaard</a> take her first WorldTour win. The Danish national champion finished second at Omloop Het Nieuwsblad and Le Samyn des Dames. She won the youth classification at the Healthy Ageing Tour with a fantastic time trial and second place on the final day. Norsgaard has been consistently consistent; always there. It&#8217;s time she got to throw her arms in the air. </p>\n\n\n\n<p>The only thing that might stand in the way of Norsgaard winning is the potential for crosswinds. In the races so far she has lacked teammates around her at critical moments. The isolation has forced Norsgaard to expend energy where she should be saving it. But if she can nestle in and sail through the crosswinds behind other riders, she might have a chance to use her formidable sprint. </p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" width=\"1340\" height=\"997\" src=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-1340x997.jpg\" alt=\"\" class=\"wp-image-506036\" srcset=\"https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-1340x997.jpg 1340w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-650x484.jpg 650w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-190x141.jpg 190w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-1080x804.jpg 1080w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066-16x12.jpg 16w, https://cyclingtips.com/wp-content/uploads/2021/03/CORVOS_00032962-066.jpg 1920w\" sizes=\"(max-width: 1340px) 100vw, 1340px\" /><figcaption>Elisa Balsamo winning GP Oetingen.</figcaption></figure>\n\n\n\n<h3><strong>Elisa Balsamo</strong> (Valcar-Travel &amp; Service)</h3>\n\n\n\n<p>Elisa Balsamo has been hovering around the top tier of riders since she won the women&#8217;s junior road race at the Doha World Championships in 2016. Balsamo has a long list of victories, from a stage of the Amgen Tour of California in 2019, to GP Oetingen just recently. </p>\n\n\n\n<p>Last year Balsamo didn&#8217;t quite have the legs to win AG Driedaagse Brugge-De Panne but she did make it into the lead group after the crosswinds. This year she has good form. She won the bunch sprint for seventh at Trofeo Alfredo Binda over the weekend, so she can&#8217;t be counted out, especially if the crosswinds don&#8217;t play a huge role in the make-up of the race. </p>\n\n\n\n<h2>The coverage </h2>\n\n\n\n<p>GCN+ will have live coverage from 15:00 CET available in all Race Pass territories. There will also be live footage on Eurosport in Europe. </p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/preview-the-belgian-classics-begin-with-brugge-de-panne/\">Preview: The Belgian classics begin with Brugge-De Panne</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8424953cfbb3d7ffedbeded766a2a541a54d4a2226d295ead398c5e2b91f38e0","category":"Cycling"}