{"title":"Peter Sagan, sidekicks, Specialized and Sportful sign with Team TotalEnergies","link":"https://www.cyclist.co.uk/news/9958/peter-sagan-sidekicks-specialized-and-sportful-sign-with-team-totalenergies","date":1628009137000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>3 Aug 2021</span></div>    </div></div><p>\nSlovakian superstar Sagan will join the French ProTeam on a two-year contract from 2022 alongside his leadout and bike supplier</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/05/giro2021-stage10-21_0.jpg?itok=qaMTFOle\" />  </div>\n<div>\n      <p> After much speculation, <a href=\"/tags/peter-sagan\" target=\"_self\">Peter Sagan</a> has signed a two-year contract with Team TotalEnergies from next season.</p>\n<p>The Slovakian, who has been struggling to compete among the world's best sprinters, will leave <a href=\"/tags/bora-hansgrohe\" target=\"_blank\">Bora-Hansgrohe</a> after five years and step down from the WorldTour to join the French ProTeam, who have also been struggling to find wins.</p>\n<p>It seems even the outfit's social media team can't believe they've bagged Sagan, who undoubtedly still has big rides in his legs, as their now deleted video announcement boasted of his three green jerseys, despite the fact he's won seven.</p>\n<p>The move will see Sagan ride for TotalEnergies for the 2022 and 2023 seasons and he brings with him trusty sidekicks Maciej Bodnar and Daniel Oss from Bora. It is not yet confirmed whether Juraj Sagan will follow his brother.</p>\n<p>Such is his stature, Sagan's signature also brings the French team a new bike supplier in <a href=\"/specialized\" target=\"_self\">Specialized</a> and kit manufacturer in Sportful, as both carry on their partnerships with the former World Champion.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/buying-guides/4798/the-best-books-about-cycling\">The best books about cycling</a></div>      <div><a href=\"/news/2104/vuelta-a-espana-route-race-reports-tv-guide-and-all-you-need-to-know\">Vuelta a Espana 2021: Route, start list, live TV guide and all we know so far</a></div>      <div><a href=\"/reviews/9281/the-road-book-2020-review\">The Road Book 2020 Review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 116: on sale now!</a></div>    </div></div><p>\nTeam TotalEnergies manager Jean-René Bernaudeau said, 'Recruiting Peter is obviously an incredible source of pride. He is undoubtedly the most popular cyclist in the world, he is an exceptional talent, he makes us change dimension.</p>\n<p>'This recruitment is above all a marker of sporting ambition. Peter is a huge competitor, everyone knows that, and above all he will bring us victories: we are counting on him for that.</p>\n<p>'The arrival of such a champion, a bicycle supplier like Specialized and a clothing partner like Sportful, these are accelerators for our sporting project, it is a new attraction for the talents of tomorrow.'</p>\n<p>The news comes just hours after Bora completed the overhaul their sprint roster, replacing the big contract of Sagan and drama of Pascal Ackermann with <a href=\"/news/9954/bora-hansgrohe-sign-sam-bennett-and-new-sprint-train\" target=\"_blank\">Sam Bennett and a new sprint train</a>.</p>\n<p>For more information on Sagan's signing visit <a href=\"https://teamtotalenergies.com/peter-sagan-rejoint-lequipe-totalenergies/\" target=\"_blank\">teamtotalenergies.com</a> </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8426237db028378ab956ca8539b647aa04099667e69fb6ee55ece77586165489","category":"Cycling"}