{"title":"Web Design Done Well: Excellent Editorial","link":"https://smashingmagazine.com/2021/09/web-design-done-well-excellent-editorial/","date":1631268000000,"content":"<p>A lot of web design talk concerns itself with what goes on <em>around</em> content. Page speed, design systems, search engine optimization, frameworks, accessibility — the list goes on and on. This gives us at <em>Smashing Magazine</em> plenty to write about, which is great, though it’s worth reminding ourselves what it’s all in service of. </p>\n<p>In this third edition of our <em>Web Design Done Well</em> series, we’re honing in on the beating heart of many websites: content. More specifically, editorial content. The Web has given storytellers an incredible selection of tools to work with, and as an occasional semi-competent journalist myself, I love a good scoop.</p>\n<p>What follows are examples of web technologies being woven in with editorial content to take it to the next level. We’ll then close with broader tips on thinking creatively about digital content. Even now, overwhelmed by the content production line, the good stuff still shines through.</p>\n<div>\n    <h4>Part Of: Web Design Done Well</h4>\n    <ul>\n    <li><a href=\"https://www.smashingmagazine.com/2021/04/web-design-done-well-part1/\">Part 1: The Ordinary Made Extraordinary</a></li>\n    <li><a href=\"https://www.smashingmagazine.com/2021/06/web-design-done-well-audio/\">Part 2: Making Use Of Audio</a></li>\n    <li><strong>Part 3: Excellent Editorial</strong></li>\n    <li>Also, <a href=\"/the-smashing-newsletter/\">subscribe to our newsletter</a> to not miss the next ones.</li>\n</ul>\n</div>\n\nReuters Lean Into Swiping\n<p>In <a href=\"https://graphics.reuters.com/GLOBAL-RACE/USA/nmopajawjva/index.html#food-insecurity\">this piece about systemic racism in the US</a>, Reuters shapes the content around swiping, breaking the story up into bite-sized chunks. Reading feels far more purposeful than it would have through a traditional scrolling approach. It’s like turning the pages of a book. On mobile, you literally flick to the next section. It makes for snappy, immediate reporting — and that’s to say nothing of the excellent data visualization on show. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e22bd61a-3ae2-44da-a9d9-47f315c28601/5-web-design-done-well-excellent-editorial.png\" /></p>\n<p>We live in a mobile-first world. There is no point in being precious about this. Yes, magazine spreads have a certain class about them. Yes, a desktop view gives you a bigger canvas to work with. The reality is most people will be viewing what you publish on a mobile phone, so lean into it. For a similar approach, these ‘tap stories’ by <a href=\"https://www.nytimes.com/interactive/2021/05/28/business/memorial-day-travel-airlines.html\"><em>The New York Times</em></a> and <a href=\"https://www.inputmag.com/design/watch-this-youtuber-make-howls-moving-castle-out-of-actual-garbage\"><em>Input</em></a> are also excellent. For those interested in further reading on mobile-centric editorial, <a href=\"https://garciamedia.com/blog/the-story-from-mobile-to-print/\"><em>The Story</em></a> by legendary newspaper designer Mario Garcia is heartily recommended.  </p>\nThe New York Times Shows Rather Than Tells\n<p>For all the awful things the COVID-19 pandemic has caused, it has at least led to some breathtakingly good reporting. <a href=\"https://www.nytimes.com/interactive/2020/10/30/science/wear-mask-covid-particles-ul.html\">This interactive <em>New York Times</em> piece</a> explains how face masks work by taking readers to particle level. You can see how fibers catch particles, and why different masks have different levels of effectiveness. Any fool can make complicated topics hard to understand, but making them easy to understand? That’s an art form all of its own.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6e4d0679-2ebf-4e4a-b797-4cb5c4727e8e/3-web-design-done-well-excellent-editorial.png\" /></p>\n<p>There are a lot of elements at play here. Graphics, color, animation — there’s even an augmented reality experience if that floats your boat. What could so easily have been a dry, stuffy subject is brought to life. And most importantly of all, it’s vital information. Stuff like this is why <a href=\"https://gianordoli.com/\">Gabriel Gianordoli</a> was <a href=\"https://www.snd.org/bodd/2021/03/04/2020-worlds-best-designer/\">voted World’s Best Designer</a> at the 2020 Society for News Design awards. Smashing. </p>\nThe Washington Post Visualises Exponential Spread\n<p>The pandemic has also forced data visualization to the front pages of publications all over the world. <a href=\"https://www.washingtonpost.com/graphics/2020/world/corona-simulator/\">This article on exponential spreading</a> from March 2020 (remember that?) does an incredible job of visualizing how and why certain viruses become real big problems real quick. From full-blown simulations to <a href=\"https://twitter.com/harry_stevens/status/1277472216574238721?lang=bg\">little inline sparkline graphs</a>, this is editorial that takes full advantage of its digital setting.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/10c24f14-f7fc-4f2b-bbf2-aaeda20b8602/7-web-design-done-well-excellent-editorial.png\" /></p>\n<p>What I especially like about this one is that it never feels gratuitous. Every visual improves the story, to the point where you almost feel sorry for anyone having to explain the same concepts with words alone. It being available in more than a dozen languages at the click of a button is another wonderful touch — a reminder that the Web is in fact borderless. I can only imagine how many people around the world this article has helped. </p>\nThe Marshall Project Mixes Media\n<p>Here The Marshall Project presents hard-hitting journalism about the US criminal justice system with the elegance and bittersweet beauty of a children’s storybook. In “<a href=\"https://www.themarshallproject.org/2020/02/27/welcome-to-the-zo\">The Zo</a>”, creative writing, striking illustration, mesmerizing narration, and an important story combine. This is multimedia editorial in full flow.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c5c74535-aab3-4def-8745-cca91dc856ed/2-web-design-done-well-excellent-editorial.png\" /></p>\n<p>They say that songs can take several forms. The same is true of editorial content online. What you see above was inspired by <a href=\"https://www.themarshallproject.org/documents/6788675-The-Zo-Disorientation-and-Retaliatory\">a 96-page academic paper</a>. That it could find a new audience as an animated series online, then be <a href=\"https://theemmys.tv/news/42nd-nominations/\">nominated for not one but two Emmys</a>, is testament to the transformative powers of the internet.</p>\nSBS’s Interactive Graphic Novel Is No Novelty\n<p>Speaking of the transformative powers of the internet, how about an interactive story. We’re all familiar with film adaptations, radio play adaptations, miniseries adaptations, and so on. Why not web page adaptations? That’s just what Australian broadcaster SBS set out to do with <a href=\"https://www.sbs.com.au/theboat/\"><em>The Boat</em></a>, an interactive retelling of a short story in Nam Le’s book of the same name.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/230e0c1a-8a40-4691-8b3d-97b4524d5b07/6-web-design-done-well-excellent-editorial.png\" /></p>\n<p>The page’s opening sequence pulls you right in, its words tilting and tumbling with the waves as you read, with the sounds of thunder and rain filling your senses to the brim. As the story settles, <a href=\"http://www.matthuynh.com/\">Matt Huynh</a>’s illustrations drift by like memories. It’s a remarkably vivid experience, beautiful in its own right as well as <a href=\"https://www.sbs.com.au/learn/resources/a-refugee-story-the-boat\">a savvy way to bring literature to younger generations</a>.   </p>\nThe Pudding Monkeys Around\n<p>I wish I’d come across this in time for <a href=\"https://www.smashingmagazine.com/2021/06/web-design-done-well-audio/\">the sound edition of this inspiring sites series</a>. No matter, it’s here now. In a truly superb showcase of digital editorial, The Pudding doesn’t so much explain the Infinite Monkey Theorem as live it through music. Don’t know what the Monkey Theorem is? Well, what are you waiting for, <a href=\"https://pudding.cool/2020/04/infinite/\">the page will do an infinitely better job of explaining than I could</a>. I’ll wait. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9ea21264-341b-4075-8f24-fda7fa5c9ae8/4-web-design-done-well-excellent-editorial.png\" /></p>\n<p>By using interactive four-note examples, the article involves the reader while also making the concept simple to understand. As a final, delightful touch, the page is itself a live, ongoing experiment, randomly working its way through increasingly complex tunes. You can expect it to get “Seven Nation Army” right in about 19 years. One wonders whether a monkey typing at a keyboard for long enough could create the perfect JavaScript framework. Hope springs eternal. </p>\nA List Apart: A Class Apart\n<p>For all the talk of data visualization, music, augmented reality, and other snazzy tools, there’s a lot to be said for getting the fundamental right. Pages don’t have to be the web equivalent of the Vegas Strip to be eye-catching. <a href=\"https://alistapart.com/article/async-design-critique-giving-feedback/\"><em>A list Apart</em></a> shows that better than most. Its approach to content will always hold a place in my heart. Title, illustration, copy, blue hyperlinks. Beautiful.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/26f22cb9-4e2f-4c6d-ae0e-6ca699dca6e1/1-web-design-done-well-excellent-editorial.png\" /></p>\n<p>What I now realize was an unsettlingly long time ago, I wrote about <a href=\"https://www.smashingmagazine.com/2020/01/split-personality-brutalist-web-development/\">the two branches of ‘brutalist’ web design</a>. The gist of what I said was that one approach is loud and brash, the other resolutely functional. <em>A List Apart</em> shows the beauty of the latter done right. The multimedia toolkit is a wonderful asset to have, but even now there are times when only words will do. </p>\nThinking Creatively About Content\n<p>For better or worse, the web is absolutely awash with content. A lot of it is great, a lot of it is not. A lot of the talk around it has the cold, calculating cadence you’d sooner expect from industrialists talking about assembly lines. The examples shared above hopefully speak to the value of resisting the urge to churn things out, but let’s be real: most websites don’t have the resources of, say, <em>The Washington Post</em>. </p>\n<p>However, there are ways to think creatively about content at all levels, from personal blogs to global publications. Here are a few of them:</p>\n<ul>\n<li><strong>Question your default approach.</strong><br />We are creatures of habit, including in how we tell our stories. Take the time early on to step back and ask, How could I do this differently? Maybe a photo essay would be more prudent than an article. Maybe a heat map is better than a table. Specialization is important of course, but don’t let it blind you to other, often complementary ways of doing things. </li>\n<li><strong>Use free resources.</strong><br />One of the great gifts of the internet is how much amazing free stuff there is. Like, actually free, on purpose. From photography to graphic design to data visualization tools to audio editing software, the resources you need to transform your content are just a click away. Our <a href=\"https://www.smashingmagazine.com/category/freebies/\">freebies</a> tag is a good place to start.</li>\n<li><strong>Give content multiple forms.</strong><br />As The Marshall Project showed especially well with “The Zo”, stories can find new audiences when they take different shapes. Wrote an article? Great, why not record an audio version? Produced a data-driven report? Pretty cool, though is it as cool as it might be if you started plugging those numbers into D3? Only one way to find out.</li>\n<li><strong>Experiment.</strong><br />The examples here are the cream of the crop, but it’s worth mentioning there is a tremendous amount to be gained from trying new ideas and embracing the occasional failure that brings. Iteration is key to the creative process. If you try something and it doesn’t work, fine, no matter. It’s the only way to get to what <em>does</em> work. </li>\n</ul>\n<p>There is no one-size-fits-all approach to content, but respecting the story is essential. Web technologies are supplemental, not the main event. Don’t let them be the tail that wags the dog. The best results come when the story is in harmony with how it’s told. That’s the kind of content that sticks with people for years. </p>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"84286988b148bf046acf4d895c21455b4c9dd3d0508d89b586222fad888781c4","category":"Tech"}