{"title":"Anna Henderson: from her first pro win to Paris Roubaix","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-henderson-from-her-first-pro-win-to-paris-roubaix","date":1631808845000,"content":"\n      <p><span>Anna Henderson and I were supposed to speak following her first pro win at Tour de Belle Isle en Terre - Kreiz Breizh Elites Dames at the end of July. As it transpired, her busy racing schedule means that when we eventually talk over the phone it is mid-September. Since winning in France, Henderson has gone on to achieve even greater feats, including a top-10 in GP de Plouay, and her first Women’s WorldTour podium at the Ceratizit Challenge by La Vuelta. </span></p>\n<div></div>\n<p><span>“It was more of a relief, actually because it had been building up so much this season and I've been pretty consistent the whole way through the season and really helped the team,” she says of her victory. “It made it even more special to get my first pro win in a race that was such a good team performance. It was quite special,” she adds.</span></p>\n<p><span>It’s a win that had been a while in the making. This season alone, Henderson has achieved a series of impressive results. As well as her Plouay and Ceratizit Challenge results, the 22-year-old has gathered some strong performances in both one-day and stage races as well as visibly putting in the work for her team.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/worldtour-womens-calendar-2021-the-rouleur-racing-guide\">Related: Women's WorldTour Calendar 2021</a></em></strong></p>\n<p><span>Off the back of her Kreiz Breizh win, Henderson signed for a further three seasons with Jumbo Visma. With her performances this year, she must have had offers from other teams, so what made her stay? “From what I can see, they have so much confidence in me and when you know the team has confidence in you that makes you believe in yourself,” she says. “As the Brits say: what ain't broke don't fix it. So I'll just keep going with what I've got now, which is pretty great.”</span></p>\n<p><span>Being teammates with Marianne Vos is an obvious pull, but Henderson hasn’t rubbed shoulders with the so-called GOAT as much as she would have liked: “We've had quite a different race programme but the few races that I have done with her, it's been really great because she's such a cool, calm, collected head,” she says. “You really learn a lot from her being so experienced. It's been really good and I hope that we can race more with each other next year.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1338418427_1024x1024.jpg?v=1631803793\" /><em><span>Henderson at Ceratizit Challenge by La Vuelta (Image: Stuart Franklin/Getty)</span></em></span></p>\n<p><span>Having Vos on side could mean that other riders on Jumbo Visma are not afforded their own chances, however other members of the squad have recently proven that they are more than just one headline rider. Last month, Riejanne Markus won stage two of the Ladies Tour of Norway and Henderson maintains that she herself has had “a crazy amount of chances this year, I've really been able to try being in a leadership role.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related: \"Together we can change the culture of the sport\" Iris Slappendel interview</a></em></strong></p>\n<p><span>Henderson credits the female staff at Jumbo Visma including manager and former rider Esra Tromp for the team environment. “Having female staff, I think, just makes that little percentage of difference where you just feel so much more, I don't know how to put it, I guess you feel more comfortable around them,” she says. “It's just women bringing women up. Esra is doing such a good job this year, and hopefully, she'll do an even better job in the next few years. I really like having her as a team manager, and I look forward to having her as a team manager for the next three years.”</span></p>\n<h4><strong>“Sport isn’t forever”</strong></h4>\n<p><span>When she isn’t studying the ways of Marianne Vos, Henderson is working towards her undergraduate degree in Sport and Exercise Science at the University of Birmingham. She spent her first two years as a full-time student — including last year whilst also racing full-time with Team Sunweb.“[I] realised that full time bike riding and [being a] full time student is not going to go well, especially your final year at uni,” she says. Henderson now studies part time and is hoping to graduate in 2022.</span></p>\n<p><span>She is pragmatic about the need for skills outside of the sport: “I think it is really important because being quite realistic, you have to know [that] sport isn't forever,” she says. “It's quite nice to have something and [there are] moments I really enjoy it and you can think about something else other than bike riding.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1309603529_1024x1024.jpg?v=1631803947\" /><em><span>Gent-Wevelgem 2021 (Image: Luc Claessen/Stringer)</span></em></span></p>\n<p><span>Henderson says that both her team and her university have been supportive of her dual pursuits: “I've had pretty rocky moments this year, and it's been hard. But Jumbo-Visma and University of Birmingham have supported me on both sides, and people around me have supported me,” she says. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/anna-kiesenhofer-the-mathematician-who-won-the-numbers-game\">Related: Anna Kiesenhofer – the mathematician who beat the odds</a></em></strong></p>\n<p><span>Like most, she is in awe of the likes of Olympic champion Anna Kiesenhofer who manage to balance athletic and academic excellence in the form of PhDs, or the likes of Elise Chabbey and Marlen Reusser who are both doctors: “these girls are pretty cool, to be honest, they can do everything,” says Henderson. However personally, she is looking forward to ticking her BSc off the list: “I'll be very glad when I graduate next year.”</span></p>\n<p><span>She may be looking forward to finishing her academic career, but Henderson is clearly someone who isn’t afraid to think deeply about the world. She is vocal about her choice to live a vegan lifestyle and the benefits it has had on her cycling career.</span></p>\n<p><span>“I used to be one of the biggest meat eaters out there,” she says. “I used to be like, 'I'll never be vegan, I love meat. But I think what happens is that we all dissociate from what meat is and what animals are. I made that connection and then I couldn't eat meat anymore or any animal products.”</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/rouleur-performance/race-and-ride-stronger-on-a-plant-based-diet\">Related: Why a plant-based diet is no barrier to cycling performance</a></em></strong></p>\n<p><span>For those who might think her dietary and lifestyle change spells the end of her cycling success, Henderson says: “I feel no difference, I feel better. I'm faster, I'm a bit leaner and I love it.” The team, she says, are “really good with it. It's super easy, actually. I think riders are scared that it will be really hard, but in my opinion, I've been totally fine and it's been a really good experience.”</span></p>\n<p><span>Her only regret is that there are not more riders in the pro peloton who follow the same lifestyle: “All round for me it’s been such a huge positive change in my life. And I hope that riders will make the change soon.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_2047_1024x1024.jpg?v=1631804066\" /></span></p>\n<p><em><span>Image: Alex Whitehead/SWpix</span></em></p>\n<p><span>Back on the road, the next race on Henderson’s programme is the World Championships in Flanders where she will race both the road race and mixed team time trial. She was part of the bronze-medal-winning squad for the latter event when it last took place in Yorkshire in 2019 and this will be the fourth elite road world championship of her career. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/preview-womens-road-race-world-championships\">Related: Women's World Championships Road Race Preview</a></em></strong></p>\n<p><span>The following weekend, she will take part in the inaugural women’s Paris Roubaix on the 2nd October: “I'm excited in a way that the inaugural women's Paris Roubaix is really cool but also I'm not excited to die on the cobbles,” she says of the history-making first edition. “Mixed feelings, but in general pretty excited,” she adds. </span></p>\n<p><span>We both ponder whether Roubaix is a race that might suit the former ski jumper but conclude that riders being sorted according to specialism is rare in women’s cycling. So-called ‘pure’ sprinters or climbers are uncommon and, for Henderson, finding out what kind of racing suits her is an ongoing process. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-femmes-2021-preview\">Related: Paris Roubaix Femmes Preview</a></em></strong></p>\n<p><span>“You have Marianne, Annemiek [van Vleuten], Anna [van der Breggen], they all can win everything and anything and I think it's really impressive,” she says. “We can all aim to do that but right now I'm really looking towards the Classics races and the kind of punchier climbs — I think that's where my skillset lies and I'm still obviously finding that out.” </span></p>\n<p><span>“I think next year my focus will be in the punchier races and the really hard ones. Flanders is the dream, but yeah, we can all dream.”</span></p>\n<p><span>If her trajectory continues in the same direction, Henderson’s dream could well become a reality one day. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"84294570e46f0255dd07614abdea3a5c9748e8bf1519e6f392f7bae2eb9b69da","category":"Cycling"}