{"title":"Temperature-dependent FTIRS study of manganese oxide spinel obtained by Solution Combustion Synthesis (SCS) for Supercapacitor applications","link":"https://www.preprints.org/manuscript/202409.1870/v1","date":1727167390000,"content":"Solution combustion synthesis (SCS) is often utilized to prepare crystalline nanoparticles of transition metal oxides, in particular Mn oxides. The structure and composition of the final product depend on the conditions of the synthesis, in particular on the composition of metal precursors, its molar ratio to the fuel component, and the mode of heating. In the present work the study of chemical phenomena which may occur in the during SCS process has been studied for the conventional nitrate-glycine synthesis of Mn oxide, as well as for nitrate-citrate-glycine and nitrate-citrate-urea synthesis. In the case of nitrate-glycine synthesis, formation of a weak complex of Mn(II) and glycine provides the conditions of instantaneous SCS reaction upon heating, resulting in slight sintering of final oxide nanoparticles. However, partial hydrolysis of Mn precursor during slow solvent evaporation results in formation of mixture of oxides, namely MnO and Mn3O4. Formation of MnO is completely suppressed in the presence of ammonium citrate in the initial mixture, and pure Mn3O4 phase is obtained. SCS reaction in this case is slower, resulting in stronger sintering of the nanoparticles. The study of electrochemical properties of synthesized oxides demonstrated that the SCS with nitrate-citrate-urea mixture provides the highest charge capacitance in 1M NaOH: 130 F/g at 2 A/g. Impedance characterization of materials allowed to propose a tentative mechanism of degradation of electrode materials during the galvanostatic cycling.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8430b5acda4e319d7afe1edb9dbe9fbfe3063cfe2306bc8a895114f4f6189b6b","category":"Interdisciplinary"}