{"title":"Mediterranean Marine Mammals: Possible Future Trends and Threats Due to Mercury Contamination and Interaction with Other Environmental Stressors","link":"https://www.preprints.org/manuscript/202407.1642/v1","date":1721620826000,"content":"Despite decreasing anthropogenic mercury (Hg) emissions in Europe and the banning and restriction of many persistent organic pollutants (POPs) under the Stockholm Convention, Mediterranean marine mammals still have one of the highest body burdens of persistent pollutants in the world. Moreover, the Mediterranean basin is one of the most sensitive to climate change, with likely changes in the biogeochemical cycle and bioavailability of Hg, primary productivity, and the length and composition of pelagic food webs. The availability of food resources for marine mammals is also affected by widespread overfishing and the increasing number of alien species colonizing the basin. After reporting the most recent findings on the biogeochemical cycle of Hg in the Mediterranean Sea and the physico-chemical and bio-ecological factors determining its exceptional bioaccumulation in odontocetes, this review discusses possible future changes in the bioavailability of the metal. Recent ocean-atmosphere-land models predict that in mid-latitude seas, water warming (which in the Mediterranean is 20% faster than the global average) is likely to decrease the solubility of Hg and favor the escape of the metal to the atmosphere. However, the basin has been affected for thousands of years by natural and anthropogenic inputs of metals, and climate change with sea level rise (3.6 ± 0.3 mm year-1 in the last two decades) and the frequency of extreme weather events will likely remobilize large amount of legacy Hg from soils, riverine and coastal sediments. Moreover, possible changes in pelagic food webs and food availability could determine dietary shifts and lower growth rates in Mediterranean cetaceans, increasing their Hg body burden. Although adult marine mammals have evolved the ability to detoxify monomethylmercury (MMHg) and store the metal in the liver and other organs as insoluble Hg-Se crystals, in Mediterranean populations more exposed to the metal, this process can deplete the biological pool of Se, increasing their susceptibility to infectious diseases and autoimmune disorders. Mediterranean mammals are also among the most exposed in the world to legacy POPs, micro- and nanoplastics and contaminants of emerging interest. Concomitant exposure to these synthetic chemicals may pose a much more serious threat than the Se depletion. Unfortunately, as shown by literature data summarized in this review, the most exposed populations are those living in the NW basin, the main feeding and reproductive area for most Mediterranean cetaceans, declared a sanctuary for their protection since the 2002. Thus, while emphasizing the adoption of all available approaches to mitigate anthropogenic pressure with fishing and maritime traffic, it is recommended to direct future research efforts towards the assessment of possible biological effects, at individual and population level, of chronic and simultaneous exposure to Hg, legacy POPs, contaminants of emerging interest and microplastics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"843982cd055dd420326a06647fac122db91f5fc63cbc177e69ea2b26332aa3ce","category":"Interdisciplinary"}