{"title":"Zwift Bans Another Pro, This Time With History of Data Tampering","link":"https://www.dcrainmaker.com/2021/02/zwift-cheating-pro-another-tampering.html","date":1614055188000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/Zwiftracing.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"Zwiftracing\" src=\"https://media.dcrainmaker.com/images/2021/02/Zwiftracing_thumb.jpg\" alt=\"Zwiftracing\" width=\"720\" height=\"400\" border=\"0\" /></a></p>\n<p>Today Zwift has <a href=\"https://www.zwift.com/p/zwift-cycling-esports-rules\">non-announced its latest sanction</a>, against Philipp Diegner of Canyon Esports, for falsifying data as part of their Zwift Racing League pro race series. This would make for the fifth individual in the last 6 months, but most notably – the first male to be caught under the more robust anti-cheating system geared at pro athletes. All four other <a href=\"https://www.dcrainmaker.com/2020/11/zwift-bans-two-pro-racers-for-altering-data-an-explainer-of-sorts.html\">cases have involved women</a>, including two just last month. The only other previous male to receive a racing suspension from <a href=\"https://www.dcrainmaker.com/2019/10/british-cycling-strips-zwift-championship-winner-for-cheating.html\">Zwift was Cam Jeffers a few years ago</a>, though in an era well before the more advanced and heavily enforced means of capturing cheaters today – and in his case for entirely different reasons.</p>\n<p>Ultimately though, the athlete in question had 11 pro race results nullified across two seasons, and received a 6-month suspension of racing on Zwift until July 24th, 2021. This is the first time Zwift has retroactively gone through and looked at past event data for transgressions, and then retroactively nullified those results. As such, Zwift is showing a bit of their hand here in the forward direction of what they plan to do in this arena.</p>\n<h3><span style=\"font-weight: bold;\">The Case:</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-82.png\"><img style=\"margin: 0px; border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-82.png\" alt=\"image\" width=\"720\" height=\"399\" border=\"0\" /></a></p>\n<p>The rider&#8217;s troubles initially stemmed from a race on January 25th, 2021, specifically the pro-focused <a href=\"https://www.youtube.com/watch?v=X51CayWTx5g\">Zwift Racing League (Season 2), Men’s Race #3</a>. In that race, the rider finished in 39th position, essentially last place. However, like every other individual that’s been ‘charged’ with a crime, it wasn’t the race itself that got the rider in trouble, but rather, the coverup.</p>\n<p>For those that are unfamiliar, pro level races in Zwift require what’s known as dual recording. That means that you need to have Zwift paired to your smart trainer and let that file record like normal. But you *also* need to have your regular bike computer/watch record from your power meter. You thus must indeed own a power meter and a watch/bike computer, which of course, at this level isn’t really an issue. But, what is an issue is if you accidentally pair to the wrong source (such as pairing to your trainer), or, if the battery dies, or you forget to press start, or you delete it, or…any other common day to day issues. If you dual-record enough, eventually things go wrong (seriously, almost nobody out there dual/triple/septuple-records more data than I do…and eventually human or mechanical error happens).</p>\n<p>Ostensibly the purpose of this second recording of a second source power device is to ‘prove’ the accuracy of the first device. Or at least, provide a reasonable backstop for the data. If one device says your sprint was 1,300w, and the other says it was 800w, then that demonstrates concern for accuracy – or, perhaps something more sinister. But the true purpose of this secondary recording is it makes falsifying the data immensely more difficult (real-time or post-race). That’s because not only does someone have to falsify one source with one understood signature, but then has to falsify another source with another signature. And then has to ensure the way those two signatures shadow each other during the race actually matches. For example, most crank-based power meters respond far faster than most trainers on sprints, the rate of change is different. But not just sprints, but every little surge in a race – of which there could be a hundred surges of varying intensities, both the ups and the downs.  Anyway, we’ll talk about that more another time.</p>\n<p>The point here is more simplistic. Every single case to date has revolved around something going wrong with that secondary source recording, and then the athlete trying to tweak that second file to make it appear like a secondary power meter. In most cases, it was simply paired to the trainer instead, or, not started at all.</p>\n<p>And in this case, Zwift found that the secondary data source was precisely 2% higher than the original power value from the trainer:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-83.png\"><img style=\"display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-83.png\" alt=\"image\" width=\"722\" height=\"173\" border=\"0\" /></a></p>\n<p>Of course, when someone says “Oh, my power reads 2% higher than my trainer”, we’d all respond with “Sure, that makes perfect sense – it’s higher up in the power meter chain, and thus due to drivetrain losses will be a higher value”. Except what we’re really saying is “Yeah, <strong>*about*</strong> 2% higher”. In reality, the exact amount will vary from second to second. One second it’ll be 1.5% higher, the next 3% higher, and then if you sprint it might be a second or two ahead, and then be 20% higher for one comparative second, before the next second being back to 1.8% higher as the update/recording/sensor rates all vary slightly from second to second.</p>\n<p>Thus, when you blanket 2% increase the values in a file, it’s like using white-out on printed paper text, then using a Sharpie to re-write a few words, followed by trying to pass it off as unchanged. It’s that blindingly obvious.</p>\n<p>But the funny thing about computer data is that it basically lasts forever. And over the course of the last 12 months, Zwift has significantly increased their processes for how they catch this sort of thing. Thus, in the report they noted:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-84.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-84.png\" alt=\"image\" width=\"722\" height=\"87\" border=\"0\" /></a></p>\n<p>About now you’re asking: What the heck is the Three-Sisters calibration test?</p>\n<p>In short, it’s a calibration test that pro riders have to do in order to validate their performances. You can read about the entire thing here in the <a href=\"https://www.zwift.com/p/zwift-cycling-esports-rules\">Zwift Ruleset</a>, page 11-12. Or I guess, I could just paste a snippet of it below. Basically, you’re riding a specific Zwift route (called <a href=\"https://zwiftinsider.com/route/three-sisters/\">The Three Sisters</a>), which includes three climbs – a short/medium/long one, followed by a sprint. However, you’re riding those specific four sections of the course at maximum all-out intensity. And you’re doing this with the dual-recording system outlined above…oh, and you’re recording a video the entire time of yourself.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-85.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-85.png\" alt=\"image\" width=\"722\" height=\"667\" border=\"0\" /></a></p>\n<p>The goal of this is to basically create a baseline of your human performance. But more cleverly, it’s creating a baseline of your equipment, and establishing a signature of that. And proving that you rode it. And sure enough, the rider actually falsified the data in that original baseline test:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-86.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-86.png\" alt=\"image\" width=\"748\" height=\"89\" border=\"0\" /></a></p>\n<p>So in total, 5 races plus the calibration test were falsified. It’s unclear why he selected to fabricate the secondary power source on those five races, but not on the other 6 that he competed in. Nonetheless, all of the racer&#8217;s results for both seasons were disqualified, specifically the following races:</p>\n<p><strong>Season 1</strong>: 8 (Results: 64th, 2nd, 72nd, 27th, 14th, 30th, 71st, 81st)<br />\n<strong>Season 2:</strong> 3 (Results: 81st, 89th, 39th)</p>\n<p>These are already reflected within the race results on Zwift’s site.</p>\n<p>Upon being presented the information, the athlete initially denied the data tampering, but then changed their mind and admitted wrongdoing:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-87.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-87.png\" alt=\"image\" width=\"722\" height=\"301\" border=\"0\" /></a></p>\n<p>As a result, the athlete has been banned from Zwift races until July 24th. The athlete still can utilize Zwift for non-racing, as well as race outside of Zwift – as this ban is not in connection with the UCI as the UCI is not overseeing this event.</p>\n<p>Additionally, as was <a href=\"https://canyonzcc.com/blog/disciplinary-update\">apparently announced 14 days ago</a> and nobody noticed on Canyon Esports&#8217; team press site, the team has terminated their relationship with the athlete:</p>\n<blockquote><p>&#8220;As of 9 am 8th February 2021, rider Philipp Diegner will no longer be part of the Canyon Esports team. This decision has been made during an investigation by ZADA following Race No. 3 of ZRL Premier League. Evidence was brought to light that was previously unknown to Canyon Esports and it&#8217;s management staff. As per the team&#8217;s internal protocols, a decision was made to terminate the rider&#8217;s contract and part ways. Philipp had previously been suspended from race duties while the team and ZADA&#8217;s investigation was ongoing. At the time of publishing this notice, ZADA and Zwift have made no further announcement other than the disqualification from Race 3.</p>\n<p>&nbsp;</p>\n<p>Canyon Esports had been investigating in good faith whether the reported irregularities had occurred involuntarily during the exporting process. However, before we could conclude that investigation we were presented with additional evidence which undermined the necessity to continue. Following further conversations with the rider and ZADA, the team was left with a hard but simple decision to end the relationship.&#8221;</p></blockquote>\n<p>Rhys Howell, the Team Manager also added in the statement:</p>\n<blockquote><p>&#8220;We are an incredibly close-knit team, so losing a rider is like losing a limb. Personally, I can only describe my feelings as heartbroken. However, I did not hesitate for one second to make the necessary decision to terminate our agreement with the rider in question. Our team is more than any single rider alone and we believe firmly in transparency and a clean sport. There can be no deviations from that belief. Our sport relies on trust and a team like ours is founded upon it. We will now look at how we can avoid such situations in the future and I have reiterated to all our senior and development riders that they can and should always come to me first if they are struggling. I hope this episode will be but a lone footnote in the exciting story of our team.&#8221;</p></blockquote>\n<p>At this time, the Canyon Esports team doesn&#8217;t show a replacement for their 6th rider, having removed the image and name from their roster page.</p>\n<p>As an interesting side note, the rider posted considerable dual-recording analysis sets <a href=\"https://www.zwiftpower.com/profile.php?z=26829\">of data to ZwiftPower here</a>. What’s notable about this is that these dual-recording sets all showed a Wahoo KICKR 18 on them, which is far more easily ‘tweaked’ to create an incorrect (inflated) power value than a newer KICKR V5/2020, as the newer unit automatically and continuously recalibrates back to known factory calibration values within a minute or two of you trying to do a re-calibration. And while we don’t know if the athlete did tweak the calibration value on the KICKR 18, we do know the output values on their baseline Zwift tests were tweaked, but I don’t know why you’d do that except to hide other values.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-111.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-111.png\" alt=\"image\" width=\"722\" height=\"399\" border=\"0\" /></a></p>\n<p>In fact, even more fascinatingly, it appears the athlete actually posted the data sets in question there, and you can see quite clearly that the 2% increase in wattage between these two labeled ‘Infocrank’ data sets – which appear identical.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-112.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-112.png\" alt=\"image\" width=\"722\" height=\"379\" border=\"0\" /></a></p>\n<p>In any case, this does continue though to bring up the never-ending question on when on earth Zwift will simply bake dual-recording into the game itself. After all, they’re already recording quite a bit of this in log files. And the same goes for simply warning athletes when they’re using an incorrect power source (per specific race rules), such as using a power meter instead of a trainer – or if they’re missing their heart rate strap. All of these cases would never have happened if so.</p>\n<p>Again – there’s zero reason why any athlete, pro or amateur weeknight mom or dad racer, should have to deal with uploading multiple files manually to ZwiftPower or elsewhere.</p>\n<p>Having asked Zwift this repeatedly in the past, they’ve said it was a development priority type thing. And given this only impacted a small number of pros, it wasn’t high on the list. Which, I fundamentally disagree with. After all, Zwift is spending millions of dollars each month on pro-level racing (inclusive of production costs, staff costs, etc…) – why can’t they spend a few more dev hours to record the secondary power meter source? This isn’t hard. It’s not remotely hard, and it’d benefit far more than just the pros. It’d benefit all the non-pros that also use ZwiftPower to upload dual-recording files to prove their data state.</p>\n<p>And it’d benefit all those who want to see the bar for cheating in Zwift considerably raised.</p>\n<h3><span style=\"font-weight: bold;\">Going Forward:</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/Zwift2.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"Zwift2\" src=\"https://media.dcrainmaker.com/images/2021/02/Zwift2_thumb.jpg\" alt=\"Zwift2\" width=\"720\" height=\"400\" border=\"0\" /></a></p>\n<p>Now, as interesting as it may be to out people that cheat – my interest here actually lies elsewhere: The technological aspects of it. Specifically, the technological aspects of catching cheaters, and the vast complexities required there (both trying to cheat, and then catching the cheaters). In fact, it’s an area I’m going to talk a bit about in some upcoming post or two, covering both what Zwift is doing, and how that might translate beyond that in a UCI world.</p>\n<p>Part of this stemmed from a <a href=\"https://twitter.com/dcrainmakerblog/status/1356555426091958272\">recent Twitter observation</a> I made a few weeks back, that all of the people Zwift had caught via this newer system were female. I noted that statically that was an exceedingly slim likelihood. The resultant of that tweet was swiftly a lot of e-mails from Zwift, but more notably a conversation with their team of data scientists that actually look at these cases, and the processes that they go through that ultimately culminate in sanctions like today&#8217;s.</p>\n<p>However, at the other end, I’ve also talked with some of those representing athletes that have been accused of cheating by Zwift. And whether or not they’re innocent or guilty, I think there are some elements of the picture that Zwift portrays that are fuzzy at best, and conflicting at worst. Aspects that don’t seem to align as clearly with well established protocols of the UCI or others for what rights an athlete has in this process if they’re being ‘charged’ with a crime. Because ultimately, like today, that athlete’s name (and thus career) is being impacted. As is their ability to monetize that career.</p>\n<p>So within that, we’ll dive into why there are 160+ case numbers yet only 5 ‘convictions’, as well as how Zwift separates what’s ‘willful’ cheating from ‘bad sensor data’, both in the data analysis side but also the human accusation follow-up side. And then, to the extent that’s viable, I’m going to show just how difficult it is to get away with cheating here at this level – especially using the methods that all five of these individuals have used…which frankly, are the least smart ways to go about cheating on Zwift. The goal is not to show all the things Zwift does to capture cheaters, but rather, to examine whether their methods are both enough, and fair (procedurally and technically) to those being accused.</p>\n<p>And finally – why is it that all of us who Zwift with any frequency know there are cheaters everywhere, but none of them are being caught? Either willfully or just due to bad trainers/data. When and how will Zwift start to address more than just the official pro series events? Yup, I’ll cover that too.</p>\n<p>Until then, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"843c1e8cd6d81fab3d9be53b951f9719594ae420bf293566af2837385b4b0a24","category":"Cycling"}