{"title":"Tour de France: It's a Mads world","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-its-a-mads-world","date":1688840810000,"content":"\n      \n<p>It was last December, during <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/you-have-to-beat-me-before-anyone-else-mads-pedersen-interview\">an interview with <em><span>Rouleur</span></em></a>, that Mads Pedersen, swinging in his chair and oozing confidence, declared that “you have to beat me before anyone else”, stating that “I truly believe I am just below them [Mathieu van der Poel and Wout van Aert].”</p>\n<div></div>\n<p>It was a statement that was typical of the Dane, who went on to add that “the ego of a cyclist, especially me, is super high.” When he uttered those words, he had just finished his most successful season, taking wins at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España,</a> and winning the green jersey in the latter. But still, the wider public perception was that while Pedersen was indeed worthy of the world championship rainbow bands on his sleeve that he earned as a young and unknown 23-year-old in 2019, he wasn’t quite in the highest category of riders. </p>\n<p><span>Surely that has changed now. The Lidl-Trek man, in his 27th year, has kicked on even more this season, winning a stage at the Giro d’Italia to complete the Grand Tour set in just nine months, and then picking up his second win in the Tour on stage eight on Saturday. </span></p>\n<p><span>In Limoges, on another hot and humid day as the Tour traversed east across the central belt of France, Pedersen fended off a late challenge from the race’s fastest man, Jasper Philipsen, to win the uphill sprint and make it a stage win in each of his last four Grand Tours. He has unquestionably confirmed his place alongside Van der Poel and Van Aert in the upper echelon of riders.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg08_pedersen-philipsen01_tdf_2023_1024x1024.jpg?v=1688840555\" alt /></span><em>Image: James Startt</em></p>\n<p><span>When asked by </span><em><span>Rouleur</span></em><span> in the aftermath of his victory where he rates himself in comparison to the duo now, he started by saying that “I would still say that these guys are the superstars of cycling, they’re super good and winning almost everything,” but then pointed out that “today I showed it’s possible to beat them in a fair sprint.” He added: “It’s not impossible.” Not for Pedersen it isn’t.</span></p>\n\n<p>His progression has been steady and consistent. During the spring, he was repeatedly impressive – third at the Tour of Flanders, fourth at Paris-Roubaix, and sixth at Milan-Sanremo, results to go alongside two fifths in other Classics and a stage win at Paris-Nice. At the Giro, his win in Napoli on a pan-flat run-in was representative of his ever-improving speed against the bonafide sprinters, and though he had to leave the race due to illness (he was in the hunt for the race’s points classification), he has returned to racing with aplomb and a second world title in Glasgow in a month's time isn't out of the question.</p>\n<div>It’s testament to his capabilities that he triumphed on stage eight despite the race not going to plan. At the start of the day in Libourne, Lidl-Trek told<span> </span><em><span>Rouleur</span></em><span> that they were hoping for a large breakaway that included Pedersen to stay away – “between 25 and 30” was the direct quote – but when only three went up the road, it was inevitable that the finish would be contested by the riders that remained. </span>\n</div>\n<div><span> </span></div>\n<p><span>On the punchy final 25km - just after news had filtered through of Mark Cavendish's abandonment -  Pedersen was attentive at the front, not missing any counter-attacks and responding to all accelerations in pace. He was determined not to be foiled, and at no point in the sprint to the line, as he wrestled his back furiously from side-to-side, was he ever overtaken.</span><span> As his Lidl-Trek team like to spin from time to time, it’s a Mads world, and we’re all just living in it.</span></p>\n<p><em>Cover image: Alex Whitehead/SWpix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"843e201d81767c0f461b0d544bda93cc4dc3ffac9567cd99da74346aa174e437","category":"Cycling"}