{"title":"\"I want a lot, I want to win every race, I think\" – Question Time with Demi Vollering","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/question-time-with-demi-vollering","date":1625137811000,"content":"\n      <p>Demi Vollering has had the most impressive start to her season of any rider in the women's peloton. She joined SD Worx in 2021 from development team Parkhotel Valkenburg and is thriving in her new surroundings.</p>\n<p>Her versatility sets her apart from her rivals: she's able to keep up on hard climbs but also pack a punch at the finish, as she showed when she took victory at both <span>Liège-Bastogne-Liège and La Course. The unity between Vollering and her teammate, world champion Anna van der Breggen, has made the duo a force to be reckoned with so far during the biggest races of the year.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/debrief-the-last-ever-la-course\">Related: the last ever La Course: debrief</a></em></strong></p>\n<p><span>Although her impressive string of results has catapulted her to the top of the Women's WorldTour, her meteoric rise means the 24-year-old is still relatively unknown among fans. As she rested in between the Ardennes Classics, we spoke to Demi on campervans, teamwork and making the dream work.</span></p>\n<div></div>\n<p><b>Which races suit you best?</b></p>\n<p><span>I really like the Ardennes races because they come in quick succession. I like to keep the focus in between races and I think my body can recover quite fast. </span></p>\n<p><b>Do you prefer racing or training?</b></p>\n<p><span>If I needed to choose, I’d say training. I like </span><span>it</span><span> a lot, especially when I'm in a new area or when I'm in Switzerland, where my boyfriend lives. I really, really like to train there. </span></p>\n<p><b>Who is your sporting hero?</b></p>\n<p>I don’t really have a hero but I think Mathieu van der Poel is a really cool guy. He always races with his heart and it's really, really good to see. </p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/5-years-on-what-impact-has-the-introduction-of-the-women-s-world-tour-had\">Related: 5 years on: is the Women's WorldTour working?</a></em></strong></p>\n<p><b>What does cycling bring to your life?</b></p>\n<p><span>I really like to be outside in nature, in the mountains. I've loved it since I was a little child, I always wanted to ride a bike. In the beginning, it was a bit hard for my mother to drive me everywhere in the country. I also have two little sisters and one little brother, so that was not so handy. When I was 16, my mother said, okay, you can do it but you need to go with a team because I cannot go every weekend with you. </span><span>From then</span><span>, I started </span><span>road racing</span><span> for real.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SDWORX-FLECHE-RACE-EDIT-82_1024x1024.jpg?v=1625133159\" /></p>\n<p><b>So you have always wanted to be a cyclist?</b></p>\n<p><span>When I was really little there was a question in a book: what do you want to be when you grow up? I wrote: I want to be a professional cyclist. I didn’t know I'd done that until I found the book and I read it again. I really laughed because I've always had the dream but then I went to school, I did my studies and then I started working, so </span><span>it</span><span> went away a little bit. When I was older and met my boyfriend, cycling was going better and better so I quit my job and it moved really fast. I realised again that</span><span> I really wanted to be a cyclist. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-return-of-the-run-up-a-look-inside-la-course\">Related – the return of The Run Up: a look inside La Course</a></em></strong></p>\n<p><b>Are there any other sports you would like to try?</b></p>\n<p><span>Motocross. It looks really fun and maybe a bit easier than cycling.</span></p>\n<p><b>If you could have any superpower, what would it be?</b></p>\n<p><span>Definitely not flying, I'm really afraid of heights. Maybe I’d want to speak every language really, really well, then you can listen to what the other riders are saying to each other in the peloton.</span></p>\n<p><b>What's your go-to dessert?</b></p>\n<p><span>I really love lemon meringue, I don't have it often because not all restaurants have it </span><span>–</span><span> that's probably a good thing!</span></p>\n<p><b>If you could only eat one thing for the rest of your life, what would it be?</b></p>\n<p><span>Yoghurt with fruit, that's something I can always look forward to. It's a bit weird, maybe.</span><br /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SDWORX-FLECHE-RACE-EDIT-103_1024x1024.jpg?v=1625133055\" /></p>\n<p><b>Do you think you race better in the cold or the heat?</b></p>\n<p><span>I always say when it's cold, you can wear more clothes but when it's warm, you can't do much. </span></p>\n<p><b>Have you planned for life after your cycling career?</b></p>\n<p><span>If I stop cycling, then I'd like to do trail running. I really like to run and trail runners are mostly a little bit older.</span></p>\n<p><b>Is there anything you'd like to change about your sport?</b></p>\n<p><span>Maybe that we wouldn’t start races so early, because that’s not super nice. Also, mostly only the last hour is broadcast, so I would like </span><span>to see our races</span><span> shown for longer on TV. Especially women's cycling, because our races are already short so there's always a lot happening.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance\">Related: the growth of Women's WorldTeam salaries: a delicate balance</a></em></strong></p>\n<p><b>What’s one piece of advice you live by?</b></p>\n<p><span>My dad always told us if you really believe in it, then you can do it, so I always say if you can dream it, you can do it.</span></p>\n<p><b>If you had all the money in the world, what would you buy?</b></p>\n<p><span>We bought a Mercedes Sprinter van and we are now converting it to a camper. We don't have much time, so we want to let somebody do it for us, but it's really expensive. </span><br /><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SDWORX-FLECHE-RACE-EDIT-43_1024x1024.jpg?v=1625133094\" /></p>\n<p><b>When has been your proudest moment?</b></p>\n<p><span>When I first won the</span><i><span> dikke bandenrace</span></i><span> [aged ten]. My family was there and I saw my father standing somewhere in between the people and he was so proud. It got me, it makes me emotional now when I think back.</span></p>\n<p><b>What are your ambitions for 2021?</b></p>\n<p><span>I really want to learn a lot whilst I still can with Anna [van der Breggen] and Chantal [van den Broek-Blaak] on the team. When they are on the team, you can still make mistakes and because they're so strong, they can always set it right. I would like to go to the Olympics, of course. I'd really like to be a champion: Dutch, European or World. I want a lot, I want to win every race</span><span>,</span><span> I think.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-donne-preview-a-new-leaf\">Related: Giro d'Italia Donne Preview</a></em></strong></p>\n<p><b>How would you define success?</b></p>\n<p><span>Winning a lot of races. But I only want to win a lot of races if I have people with me who are really proud of me, like my team-mates. It's only good if you have a lot of people who you can celebrate it with, so you're not the only one who is winning, but you really do it together. I think that makes you successful, winning as a person as a well as a cyclist.</span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"844135180267fe11beb1480d88d17f88dbdd75bb1b2199ed179b0fe3fb7fc812","category":"Cycling"}