{"title":"Preview: What you need to know about the Olympic time trials","link":"https://cyclingtips.com/2021/07/preview-what-you-need-to-know-about-the-olympic-time-trials/","date":1627357362000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00031548-053-650x433.jpeg\" /></div><h2>Preview: What you need to know about the Olympic time trials</h2><p>\n</p><p>With the road races now complete at the <a href=\"https://cyclingtips.com/tag/2020-tokyo-olympics\" target=\"_blank\">Tokyo Olympics</a>, it’s time to turn our attention to the individual time trials. The women’s and men’s fields will both battle it out for gold this Wednesday, with the women’s event starting at 11:30am Tokyo time, followed by the men at 2pm.</p>\n\n\n\n<p>Here’s what you should know about the women’s and men’s time trials at the Tokyo Olympics.</p>\n\n\n\n<hr />\n\n\n\n<h2>The course</h2>\n\n\n\n<p>The women and men will contest their time trials over the same 22.1 km circuit that starts and finishes on the Fuji International Speedway (where the road races finished). The women will complete one lap of the course and the men will complete two (for a total of 44.2 km). It’s a pretty tough circuit with plenty of lumps and bumps.</p>\n\n\n\n<p>The course tends downhill for the first 4 km, then the next 5 km is mostly uphill, at an average of just under 5%. Then it’s mostly downhill for another 5 km before heading back to the speedway where the riders will climb for another 2 km at around 4.5%. From there it’s rolling to the finish.</p>\n\n\n\n<p>The course isn’t terribly technical throughout, but there are a few tight twists and turns to navigate.</p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/tokyo-2020-women-individual-time-trial.jpg\" /></figure>\n\n\n\n<h2>Women’s contenders</h2>\n\n\n\n<p>Here are the riders you can expect to be vying for the medals on Wednesday morning.</p>\n\n\n\n<p><strong>Anna van der Breggen (Netherlands):</strong> Van der Breggen is in her last season as a pro and she comes to Tokyo in sparkling form. She won the uphill TT at the recent Giro Donne (en route to a fourth overall victory), she won the Dutch TT title in June, oh, and she’s the reigning TT world champion.</p>\n\n\n\n<p>The lumpy course will suit her to a tee. All going to plan, a medal is a near certainty.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00033279-167-1340x894.jpeg\" /><figcaption>Van der Breggen at the recent Giro Donne.</figcaption></figure>\n\n\n\n<p><strong>Chloe Dygert (USA):</strong> Dygert was on her way to a second world title last September when she crashed out in horrible fashion. Her only other TT since recovering from her injuries was at the USA Nationals last month, which she won. She’d probably prefer the course to be a little less hilly, but even still: if she can stay upright, she should take home a medal.</p>\n\n\n\n<p><strong>Annemiek van Vleuten (Netherlands):</strong> Van Vleuten will be keen to make up for the <a href=\"https://cyclingtips.com/2021/07/van-vleuten-mistakes-silver-for-gold-as-confusion-reigns-in-olympic-peloton/\" target=\"_blank\">disappointment of her silver medal</a> in Sunday’s road race, and like the riders above, she has a great shot at a medal. The course suits her and she’s already a two-time TT world champ so she knows what it takes to win the biggest TTs.</p>\n\n\n\n<p><strong>Grace Brown (Australia):</strong> Despite not fancying herself as a climber, Brown was third in the uphill time trial at the Giro Donne which bodes well for Tokyo. She’ll probably struggle to beat the likes of Van der Breggen and Dygert, but a medal is a real possibility.</p>\n\n\n\n<p>Other riders to keep an eye on include last year’s Worlds silver medallist <strong>Marlen Reusser (Switzerland)</strong> and <strong>Juliette Labous (France).</strong> It is also worth mentioning that Olympic road race champion <strong>Anna Kiesenhofer (Austria) </strong>was originally in Tokyo for the time trial, and based on her performance on Sunday, she is also worth keeping an eye on. </p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2020/12/dygert_owen-1340x893.jpg\" /><figcaption>Dygert on her way to winning the 2019 ITT world title.</figcaption></figure>\n\n\n\n<h2>Men’s contenders</h2>\n\n\n\n<p>Here are the medal contenders in the men’s event.</p>\n\n\n\n<p><strong>Wout van Aert (Belgium):</strong> Van Aert comes into the TT with world-beating form having won three stages at the recent Tour de France (including the stage 20 ITT), and having taken silver in the road race on Saturday. Assuming he’s recovered fine from the road race, Van Aert should medal.</p>\n\n\n\n<figure><img src=\"https://cdn-ctstaging.pressidium.com/wp-content/uploads/2021/07/CORVOS_00033318-160.jpg\" /><figcaption>Van Aert on his way to winning the recent stage 20 ITT at the Tour de France.</figcaption></figure>\n\n\n\n<p><strong>Filippo Ganna (Italy):</strong> The reigning world champ is one of the riders to beat, but he arguably comes in with more question marks than we might have expected. The course is perhaps a little hillier than is ideal for him, plus he was a surprising fourth at the Italian TT Nationals in June – well below expectations. Expect Ganna to be right up there on Wednesday though, quite possibly on the top step.</p>\n\n\n\n<p><strong>Rohan Dennis (Australia):</strong> The South Australian skipped Saturday’s road race to focus on the time trial so he’ll be keen to make sure that sacrifice was worth it. A two-time world champ, Dennis won’t be worried by the hilly course, and if he can bring it all together on the day, a medal is his for the taking.</p>\n\n\n\n<p><strong>Remco Evenepoel (Belgium): </strong>Evenepoel was second at Worlds a couple years back, and second behind Van Aert in the Belgium ITT title in June. He looked a little ways off his best in the road race last weekend, but if everything falls into place, he could be among the medals too.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00031350-043-1340x894.jpeg\" /><figcaption>Evenepoel at the 2019 Worlds TT.</figcaption></figure>\n\n\n\n<p><strong>Tom Dumoulin (Netherlands):</strong> Dumoulin won the 2017 title on a hilly course in Bergen, Norway so this lumpy circuit shouldn’t be too much of a concern for him. The bigger question will be where his form’s at.</p>\n\n\n\n<p>Dumoulin spent some time away from the sport recently and while he returned with a win at the Dutch TT Nationals, the Olympics is a different beast entirely. Saturday’s road race didn’t give us much of a sense of how he’s going at the moment, so this could go either way. If he’s at his best, he’ll be right up there. If not, he’ll likely miss out on a medal.</p>\n\n\n\n<p>Others to keep an eye on include <strong>Stefan Küng (Switzerland)</strong>, <strong>Remi Cavagna (France)</strong>, and <strong>Primož Roglič (Slovenia)</strong>.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/preview-what-you-need-to-know-about-the-olympic-time-trials/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"844205d7999ddb9403776a694a62280b4ec2d47a7174505c0a4785cd1062425d","category":"Cycling"}