{"title":"Obesogens in Adolescence. Challenging Aspects and Prevention Strategies.","link":"https://www.preprints.org/manuscript/202404.0380/v1","date":1712292704000,"content":"Childhood obesity has become a global epidemic, with significant increases in prevalence over recent decades. While excessive calorie consumption and physical inactivity are known factors, emerging research highlights the role of Endocrine-Disrupting Chemicals (EDCs), particularly obesogens, in obesity's pathogenesis. This review explores the historical context of the environmental obesogens hypothesis, their sources, mechanism of action, impact on prenatal and postnatal development and epigenetics. Additionally, it discusses the long-term consequences of childhood obesity and proposes prevention strategies that will mitigate the negative health effects. Obesogens were found to disrupt hormonal balance and metabolic processes through various mechanisms such as altering gene expression, hormonal interference, and inflammation. Especially significant, was exposure during critical windows of development which correlates with increased risk of obesity in childhood or adolescence. Long-term effects of childhood obesity include chronic health conditions and psychosocial issues. A comprehensive approach is necessary to address childhood obesity, encompassing genetic, environmental, and lifestyle factors. Prevention strategies should focus on reducing obesogens exposure, promoting healthy lifestyles, and implementing regulatory policies. Future research should investigate obesogens-diet interactions, microbiome impacts, and combined obesogens effects. Long-term human studies are also crucial for validating findings from animal models and allow for inform decision-making to combat the obesity pandemic.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"844579aa4e9ad499457bed8431957713e38e1d00ef1275c0f759edc6d31a89a6","category":"Interdisciplinary"}