{"title":"Olive leaf extract-assisted green synthesis of cd nano complex: A combined experimental and theoretical study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306040","date":1722607200000,"content":"<p>by Mutairah S. Alshammari, Rania H. Taha, Nowarah J. Almutlq, Sabrein H. Mohamed</p>\r\n\r\nResearch in the synthesis of Schiff base ligands and their metal complexes using olive leaf extracts as a green reducing agent is an exciting area of study. In this research, a Schiff base ligand is created by combining 1-hydroxy-2-naphthaldehyde and amino-<i>N</i>-(4,6-dimethylpyrimidin-2-yl)-4-benzenesulfonamide. The synthetic Schiff base is then utilized for the production of a Cd(II) nano complex for the first time with olive leaf extracts serving as the green reducing agent. The extract is obtained by harvesting, drying, and grinding the olive leaves. Various analytical techniques, including <sup>1</sup>H NMR, <sup>13</sup>C NMR spectroscopy, scanning electron microscope (SEM), and conductivity studies, are employed to analyze the Schiff base and its Cd(II) complex. Quantum chemical calculations are also conducted to explore the different conformers of the Cd(II) complex and their stabilities, shedding light on the synthesis pathways of the Schiff base ligand and Cd(II) complex. Extensive DFT-based geometry optimizations and frequency calculations are carried out for 1-hydroxy-2-naphthaldehyde,amino-<i>N</i>-(4,6-dimethylpyrimidin-2-yl)-4-benzenesulfonamide, the Schiff base ligand, and the corresponding Cd(II) complex. Experimental and theoretical analyses confirm the presence of the azomethine (-HC = N-) group in the Schiff base and validate the formation of the Cd(II) complex in a 2:1 metal-to-ligand ratio through physicochemical characterization methods, highlighting the nanoscale structure of the complex. Combining thorough physicochemical investigations with molecular modeling simulations and the sustainable synthesis of metal complexes, valuable insights into their properties and potential applications in catalysis and drug delivery are obtained.","author":"Mutairah S. Alshammari","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8449d946e0edd9709154878c414e93a5c8a2a99b3595ee025e4bc2d77a8540bb","category":"Interdisciplinary"}