{"title":"Numerical investigation on performance of a solar chimney power plant with different absorber configurations","link":"https://aiche.onlinelibrary.wiley.com/doi/10.1002/ep.14389?af=R","date":1710480878000,"content":"<h2>Abstract</h2>\n<p>A solar tower system is a nonpolluting solar thermal power plant that utilizes a combination of a wind turbine and generator to convert thermal energy generated from a solar collector into electrical energy. The study focuses on a system comprising a solar collector that transforms solar energy into thermal energy, a chimney that converts thermal energy into kinetic energy, and a wind turbine that further converts kinetic energy into electrical energy. The system's performance is evaluated through the implementation of a numerical model, which is validated by comparing it with experimental data. Four different types of meshes are tested to determine the most suitable mesh for the system. The discrete ordinate radiation model is used to solve the radiative transfer equation, and the RNG <i>k</i>-𝜀 turbulence model is implemented to calculate turbulence. In a subsequent study, the effect of absorber configuration on the system's performance is investigated. Three different absorber configurations—sinusoidal, square, and triangular—are proposed, and the numerical results showed that the system's performance is affected by the absorber configuration. The velocity in the chimney inlet increases for all proposed configurations compared to the standard configuration, with the triangular configuration showing the highest velocity increase. Additionally, the newly proposed configurations enhance the thermal efficiency of the system, leading to a thermal efficiency of 12.18%, 12.2%, and 13.65% for the sinusoidal, triangular, and square configurations, respectively. Overall, the solar tower system demonstrates its potential as a clean and efficient source of electrical power.</p>","author":"Jihen Mahdhi, \nOns Ghriss, \nYashar Aryanfar, \nAbdallah Bouabidi, \nAli Keçebaş, \nJorge Luis García Alcaraz","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"845d784bc5514efc1bd073723fe73a2808b5e689af97416c924412f7c2ed2ca0","category":"Environment"}