{"title":"Adaptive Hyperactivity and Clinical and Laboratory Biomarker Search: The Case of Old Elders in the Blue Zone of Sardinia","link":"https://www.preprints.org/manuscript/202409.0663/v1","date":1725873952000,"content":"Adaptive hyperactivity, characterized by increased activity levels and novelty-seeking traits without mood disorders, is prevalent among older adults in Sardinia's \"blue zone,\" an area with high longevity. This study aims to evaluate the adaptive nature of hyperac-tivity concerning quality of life, social rhythms, and mood symptoms in individuals from this region, particularly among older adults over 80. Methods: This observational cross-sectional study included adults and older adults over 80 years from Sardinia's blue zone, recruited from the dermatology clinic at the University Hospital of Cagliari. Partici-pants underwent psychiatric interviews and completed the Mood Disorder Questionnaire (MDQ), Patient Health Questionnaire (PHQ-9), SF-12, and Brief Social Rhythm Scale (BSRS). Data were compared with national and regional normative data. Results: Older adults in the blue zone demonstrated higher MDQ positivity (22.58%) compared to na-tional averages (0.87%), without corresponding increases in dysregulated rhythms, de-pressive symptoms, or reduced quality of life. Younger elders (65-79 years) showed in-creased rhythm dysregulation (BSRS score: 20.64±7.02) compared to adults (17.40±6.09, p=0.040), but this trend was not observed in older elders (80+ years). No significant differ-ences were found in CH3SH and (CH3)2S levels between groups. Conclusions: Hyperactiv-ity observed in older adults from Sardinia's blue zone appears adaptive, not linked to so-cial rhythm dysregulation, depressive symptoms, or diminished quality of life, suggesting resilience factors that may contribute to longevity. These findings support the potential classification of such hyperactivity as beneficial rather than pathological, warranting fur-ther research into biomarkers and psychoeducational interventions to prevent the onset of bipolar disorders in predisposed individuals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"84627da8a538bce982d2e4433c970c4a6f03ab8da9763e6b8aac7044ab8c1bf3","category":"Interdisciplinary"}