{"title":"Fat analogue emulsions stabilized by peanut protein microgel particles: microscale and nanoscale structure and stabilization process analysis","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13264?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Biopolymer-based microgels are being regarded increasingly as promising building blocks in food applications. This study aimed to clarify the evolution process of the network for fat analogue emulsions stabilized by peanut protein isolate (PPI) microgel particles. It also investigated the interfacial structure and characteristics of emulsions (50% oil phase, w/w) stabilized by microgels under different pH conditions.</p>\n<h2>RESULTS</h2>\n<p>There was an increasing interfacial adsorption capacity for PPI microgels over time (from 85.26% to the maximum of 89.78% at 24 h of storage) due to the aggregation of microgels around droplets and the development of cross-linking microgel chains between adjacent interfaces. The increased <i>β-</i>sheet content (from 35.51% to 41.12%) of adsorbed microgels indicated unfolding and the enhanced aggregation of microgels, which led to stronger droplet interaction. The network evolution observed with different microscopes clarified the transition to a self-supporting emulsion. The uneven adsorption of large microgel aggregates at the oil–water interface promoted larger and deformed droplets, so more fat-like medium internal phase emulsion stabilized by PPI microgel could be obtained by adjusting the microgel pH to 4.5. The interfacial membranes observed by scanning electron microscopy were thicker and coarser at pH 3.0 and 4.5 than those at pH 7.0 and 9.0. The adsorption of PPI microgel aggregates enhanced the structural strength and improved emulsion stability.</p>\n<h2>CONCLUSION</h2>\n<p>This work could form a basis for further studies relating physical properties to the design of plant protein-based fat analogues. © 2024 Society of Chemical Industry.</p>","author":"Liyang Du, \nShaoyang Li, \nZong Meng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8465871527b987857b09472c50d55d681413eb8ccd9f307d4f2a5b14c23bbdd1","category":"Environment"}