{"title":"PSLBI-24 Optimizing crop byproduct inclusion in beef cattle diets: Utilization of wheat straw to improve operational economics and oilseed screenings as protein supplements","link":"https://academic.oup.com/jas/article/102/Supplement_3/636/7757654?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Inclusion of crop residues and byproducts in beef cattle diets has become a significant practice in beef cattle production as producers are faced with conventional feed shortages, increased prices, and disrupted supply chains. Wheat straw is a widely available crop byproduct in the western Canadian prairies whose inclusion in beef cattle diets has been prevented by its low nutritional content, necessitating supplementation strategies to enhance its nutritional value. The present study explored the effect of incorporating wheat straw in backgrounding cattle diets with canola or flax screening supplementation to improve the nutritional profile of the diet and determine the sustainability of such inclusion through cattle performance measurements. The experiment was a completely randomized design. Steers [n = 300; initial body weight (BW): 297 ± 18 kg] were randomly assigned to 5 treatment diets, each diet having 4 pen replicates (15 steers/pen); control (CTL), low straw canola (LSC), low straw flax (LSF), high straw canola (HSC) and high straw flax (HSF). The CTL diet was a conventional Western Canadian backgrounding diet (60% barley silage:40% dry rolled barley grain-based concentrate). Low straw diets had a 25% wheat straw inclusion and high straw diets had 50% wheat straw inclusion on a dry matter (DM) basis. Respective screenings were included at 12.50% inclusion of diet DM. The steers were fed for a total of 84 d divided into four periods of 21 d. Statistical analyses were performed using the MIXED procedure of SAS 9.4 with diet treatment included as a fixed effect and pen within diet as a random effect. Treatment means were compared using the LSMEANS statement adjusted for the Tukey-Kramer method. Final BW, total BW gain, average daily gain (ADG) and gain:feed were greater (<span>P</span> &lt; 0.001) for the CTL steers (Table 1). Dry matter intake (DMI) was greatest for CTL steers and decreased with increasing straw inclusion in the diet (<span>P</span> &lt; 0.001). The type of screenings (canola or flax) did not affect (<span>P</span> &gt; 0.05) steers final BW, total BW gain, ADG and gain:feed. Increasing the inclusion of wheat straw in backgrounding diets decreased growth performance parameters. The high level of neutral digestible fiber in wheat straw limited DMI and reduced growth performance compared with CTL steers. The addition of screenings to the diet provided protein content to offset the low nutritional value of the wheat straw; however, the different types of screenings did not result in a cattle performance advantage over the other. Although these findings demonstrate the challenges of including low nutritional crop byproducts, further research is needed to analyze the effects different diets have on operational economics, rumen fermentation parameters and greenhouse gas emissions to further outline any advantages or disadvantages.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"84717b95c71b64d3a71bf2f9acc13e3743e84d50dfc96a951e8835a86bb1046e","category":"Environment"}