{"title":"Micro‐polluted water source purification of root channel wetland in Jiaxing, China","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11112?af=R","date":1725778800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8bd8edc2-2ad4-493c-b196-7b05e6207282/wer11112-toc-0001-m.png\" alt=\"Micro-polluted water source purification of root channel wetland in Jiaxing, China\" />\n<p>Root channel wetlands, as a new type of nature-imitating wetland system, provide a paradigm for micro-polluted water source purification. The results showed the effects and influencing factors of the root channel wetlands and analyzed the operation and maintenance management with regard to the promotion of the wetlands.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Root channel wetlands, as a new type of nature-imitating wetland system, provide a paradigm for micro-polluted water source purification; however, there is a knowledge gap on root channel wetlands' pollution removal effects and their main influencing factors after longtime operation. This study collected the turbidity, ammonia nitrogen (NH<sub>3</sub>-N), total nitrogen (TN), total phosphorus (TP), permanganate index (COD<sub>Mn</sub>), dissolved oxygen (DO), and chemical oxygen demand (COD) at the inlet and outlet of Shijiuyang (SJY) wetland and Guanjinggang (GJG) wetland in Jiaxing City, China, from 2019 to 2021. The results showed that root channel wetlands had better water quality improvement effects. The SJY wetland had larger removal rates for DO, COD<sub>Mn</sub>, and turbidity compared with the GJG wetland. In contrast, other water quality indexes have similar removal rates at both wetlands. The influencing factor analysis showed that water purification agent, flow, pH, and water temperature have large influences on the removal rates of pollutants for both wetlands. To address high turbidity and excessive DO, which are the primary pollutants affecting the two wetlands, implementing the diversion river before the pretreatment area and incorporating ecological floating beds in the deep purification area are recommended solutions to mitigate these issues. Compared with conventional general constructed wetlands, root channel wetlands are a more cost-effective and sustainable technology. The research is conducive to improving understanding of root channel wetland purification for micro-polluted water sources and enhancing water supply security capability in the plains water network area of the Yangtze River Delta region.</p>\n<h2>Practitioner Points</h2>\n<p>\nCompared with conventional general constructed wetlands, root channel wetlands are more cost-effective and sustainable technology.\nThe SJY wetland demonstrated better removal rates for DO, CODMn, and turbidity, indicating a higher purification capacity compared to GJG wetland.\nFlow rate and pH are the primary factors influencing the GJG wetland, while the waterpurification agent and water temperature are the main factors affecting water quality in the SJY wetland.\n</p>","author":"Jianfeng Li, \nShengsheng Han, \nZekang He, \nTianzheng Cao, \nShanrui Han, \nTianfei Li, \nJunjie Li, \nJuanhua Jia, \nWenjing Qin, \nYa He","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"84815b92b7c1b458e45d736d9a21619b5aa763c56835585aef4cc77aca4193d5","category":"Environment"}