{"title":"Oral probiotic administration attenuates postexercise inflammation in horses","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae124/7738571?rss=1","date":1723507200000,"content":"<span><div>Abstract</div>Probiotics are commonly incorporated into equine diets to impart health and performance benefits; however, peer-reviewed evidence supporting their efficacy in horses is limited. Interestingly, bacteria from the <span>Bacillus</span> genus are gaining interest for their unique ability to impact metabolic, immune, and inflammatory pathways. The objective of this trial was to evaluate a selection of <span>Bacilli</span> for their role in altering the inflammatory response in horses to exercise. Eighteen horses were utilized in a randomized cross-over trial. Horses were randomly assigned to one of 6 starting treatments including a negative and positive control, and groups that received one of 4 probiotics (<span>Bacillus coagulans</span> GBI-30, 6086, <span>Bacillus subtilis</span>-1, <span>Bacillus subtilis</span>-2, or <span>Bacillus amyloliquefaciens</span>) top dressed to their daily ration at a rate of 8 billion CFU/d mixed into dried whey powder. All horses received a similar base diet of grass hay offered at 2.0% of bodyweight daily along with 4.54 kg of a commercially available textured horse feed. Each 3-wk phase of the trial consisted of a 2-wk dietary acclimation followed by a 1-wk exercise challenge and sample collection. Between phases, horses were offered only their base diet. On the day of exercise, horses were offered their 0700 ration and then subjected to a 2-h standardized exercise test. Blood samples were obtained prior to starting exercise and then again at 0, 2, 4, 6, 8, 24, 48, and 72-h postexercise. Horses in the positive control group were administered 0.23 mg/kg BW flunixin meglumine immediately following the 0-h sampling. Samples were analyzed for serum amyloid A (SAA), interleukin-6 (IL-6), and prostaglandin E<sub>2</sub> (PGE<sub>2</sub>) concentrations. Data were evaluated via ANOVA using the MIXED procedure in SAS 9.4. Exercise-induced inflammation as evidenced by SAA, IL-6, and PGE<sub>2</sub> increases postexercise. Horses consuming <span>B. coagulans</span> GBI-30, 6086 had reduced production of SAA, IL-6, and PGE<sub>2</sub> compared to all other probiotic-fed groups and the negative control (<span>P</span> &lt; 0.001). The positive control successfully ameliorated the postexercise inflammatory response. These data highlight the potential for <span>B. coagulans</span> GBI-30, 6086 to be incorporated into equine rations as a method to support optimal response to exercise or other inflammation-inducing challenges. Additional research is ongoing to elucidate the methodology by which these results occur.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"848f307bdd8962e9ff1ae91b1b6d02c43bae6a413f52d960108f14c9696a00f7","category":"Environment"}