{"title":"Development of cellulose‐based biosorbents from the residue of the peach palm agribusiness and simulation of industrial scale‐up for copper removal from Brazilian spirit","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13811?af=R","date":1723801417000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Cachaça (Brazilian spirit) is an alcoholic beverage of cultural and economic importance in Brazil. Its artisanal production is usually conducted in copper alembics, which results in contamination. The development of effective biosorbents from cheap matrices is an alternative to minimize both solid waste generation and copper levels in cachaça. The present work evaluates the obtention of nanocellulose-based materials from the major residue generated during the processing of palm heart from the Brazilian peach palm, through different processing techniques. Materials were characterized by physicochemical composition and their sorbent capacities for copper removal from aqueous solutions, and a simulation was conducted to evaluate potential application in the adequacy of cachaça to meet Brazilian legislation requirements.</p>\n<h2>RESULTS</h2>\n<p>The different processing methods resulted in different cellulose concentrations, with the highest concentration in the bleached material (B3, 694 g kg<sup>−1</sup> of cellulose), and different specific surface areas (1.02–12.4 m<sup>2</sup> g<sup>−1</sup>). Copper adsorption onto nanocellulose obtained from peach palm external sheath is fast, with a predominance of a chemisorption mechanism. Isotherms were best represented by Langmuir's model, suggesting a monolayer adsorption. Simulations indicate that B3 is a suitable material for the removal of copper from cachaça, and small amounts of biosorbent (733.5 g) are required for the reduction of copper concentrations (10 to 3 mg L<sup>−1</sup>) in 1000 L of cachaça.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrated that the obtention of biosorbents from peach palm solid residues is promising and this nanocellulose-based material can be used for copper removal from contaminated cachaça. © 2024 Society of Chemical Industry.</p>","author":"Matheus Samponi Tucunduva Arantes, \nThalia Marchinhaki Pedro Miranda, \nWashington Luiz Esteves Magalhães, \nCristiane Vieira Helm, \nVítor Renan da Silva","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8492caa39adb39222a24801ffdb2d301013393f4ec826610b2b44061cbbff131","category":"Environment"}