{"title":"505 Utilizing porcine hepatocyte cultures to test the effect of short chain fatty acids on androstenone metabolism","link":"https://academic.oup.com/jas/article/102/Supplement_3/139/7757437?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Boar taint is an off-putting odor found in the meat of entire male pigs due to the accumulation of androstenone and skatole in the fat. Development of boar taint is dependent on the balance between the rate of synthesis and metabolism of these compounds. Prior studies have shown that feed ingredients high in fermentable carbohydrates, including chicory root, sugar beet pulp, and Jerusalem artichoke decreased the synthesis of skatole in the hindgut and altered the metabolism in the liver, resulting in a skatole concentrations comparable with castrated males. However, the mechanism of how these dietary fermentable carbohydrates affect liver metabolism is not well understood. Metabolism of boar taint compounds takes place in a two-phase process, regulated by various enzymes and cytochrome families. Short-chain fatty acids (SCFAs) are produced from the microbial fermentation of fiber and have been shown to have regulatory effects on histone deacetylases and gene expression in humans, providing a potential mechanism in which feed high in dietary fiber reduces boar taint. The purpose of this study was to assess if SCFA directly affect the metabolism of androstenone in liver hepatocytes. Primary hepatocytes were isolated from the liver of 6 [(Yorkshire x Landrace) x Duroc] boars weighing around 90 kg. Cells were treated in triplicate with acetate, butyrate, propionate, and various combinations for 24 h to alter gene expression. Two sets of wells acted as a control, not being treated with SCFAs. The cells were then incubated with androstenone for 3 h, and media was extracted, and metabolite production was analyzed using high-performance liquid chromatography. The effects of treatments were using a one-way ANOVA with a Dunnet’s adjustment for multiple comparisons to a control. Results showed the combined acetate, butyrate, and propionate treatment had the greatest effect on androstenone glucuronide production when compared with the control, resulting in significant increases (<span>P</span> &lt; 0.05) ranging from 82 ± 1.6% to 1 ± 2.4% in individual boars. Other treatments had a similar effect, significantly increasing the production of androstenone glucuronide but to a lesser degree. Butyrate increased production ranging from 40 ± 2.2% to 5±1.5% (<span>P</span> &lt; 0.05), propionate from 38 ± 3.6% to 3 ± 2.6% (<span>P</span> &lt; 0.05), acetate and butyrate from 61±3.9% to 1 ± 2.8% (<span>P</span> &lt; 0.05), acetate and propionate from 70±3.5% to 5±1.7% (<span>P</span> &lt; 0.05), and butyrate and propionate from 82 ± 2.5% to 4 ± 1.1% (<span>P</span> &lt; 0.05) when compared with the control. In conclusion, this trial provided evidence that SCFAs produced by the microbial fermentation of fiber can significantly increase hepatic androstenone metabolism in some animals, with a wide range in these effects among individual boars. Future research will involve assessing the effects of SCFAs on hepatic skatole metabolism.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"849695101ac90f9d2ab4ac7ae311a56b4fd80c2239012e38cd138bfd72c21a80","category":"Environment"}