{"title":"12-week training plan for cyclists | Get fit this summer with our training plan","link":"https://www.bikeradar.com/advice/fitness-and-training/cycling-training-plan/","date":1624186859000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Cyclists-d8f16c2.jpg?quality=45&amp;resize=620,413\" />                                            <p>One of the best ways to keep motivated and stick with your newfound/refound love of riding is to set a goal. And one of the best ways to hit that goal is to follow a training plan.</p>\n<p>As cyclists, we often like to set a target of riding a significant distance. Depending on your fitness, that can be from 30 up to a <a href=\"https://www.bikeradar.com/advice/how-to-ride-100-miles/\">century ride</a> of 100 miles, or more – anything you realistically believe you can achieve in a set time.</p>\n<p>Whether you opt to ride your goal distance on your own or with a group of friends, enter a sportive or take part in a charity challenge, one thing’s for sure – you’ll need to train. It’s a good job then that we have a training schedule especially for you.</p>\n<p>Before we get into the plan itself, here are some training truisms you need to stick to…</p>\n<h2>1. Set your goal</h2>\n<p>First, choose your event. Be realistic: you want to be challenged, not overwhelmed. Think about what you want to achieve on your ride.</p>\n<p>Are you completing, competing or conquering? Again, be reasonable. Set an impossible aim and you’ll soon lose motivation.</p>\n<p>Write your goal down and put it in your wallet, on the fridge door – anywhere you’ll see it often enough to keep you focused.</p>\n<h2>2. Get your long rides in</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Balance short and long rides to work on all areas of your fitness.</span></figcaption><span> <i>SWPix.com</i></span></div>\n<p>We all miss occasional planned rides, but don’t miss the long <a href=\"https://www.bikeradar.com/advice/fitness-and-training/base-training-cycling/\">base training</a> rides at the heart of your schedule – they’re vital.</p>\n<p>Bad weather? Go out anyway; you could get bad weather on event day. Bike’s broken? Fix it (we’ve got lots of <a href=\"https://www.bikeradar.com/advice/workshop/\">bike maintenance</a> guides here on BikeRadar), or take it to your bike shop – and learn how to fix it.</p>\n<p>Long rides are when your body gets used to handling the demands you’ll face on the big day; they help you to draw on your fuel reserves more efficiently, and get your head prepared for long, demanding efforts.</p>\n<h2>3. Develop technique</h2>\n<p>Get used to incorporating technique work into your general rides as well as devoting regular sessions to improving your skills. Find a long, winding hill and time yourself down it over several runs to work on your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-descend-safely-on-a-road-bike/\">descending</a>, looking to get quicker by laying off the brakes, leaning into the corners and learning when to put the power back on.</p>\n<p>Be careful, though – do this with a riding mate and only on quiet roads where you can easily see approaching traffic. And don’t think you can make up for poor climbing just by flying downhill.</p>\n<p>Sheltering from the wind by <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-in-a-group/\">riding in a group</a> saves you masses of power output from your legs and will <a href=\"https://www.bikeradar.com/advice/fitness-and-training/average-speed-cycling/\">improve your average speed</a>, but it doesn’t come easily and there are tactics to learn so practice on group rides. The more comfortable you are safely riding in close formation, the more time you can save.</p>\n<h2>4. Muscle power</h2>\n<p>Lactic acid is produced when your body breaks down carbohydrates for fuel, resulting in lactate in your blood that affects your muscles’ performance.</p>\n<p>All you really need to know is that the point at which lactate starts to accumulate faster than you can disperse it is your lactate threshold (LT), and raising this (or working on your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/what-is-ftp-and-why-it-matters-for-cyclists/\">Functional Threshold Power</a>) will help you ride a faster sportive.</p>\n<p>Working on your power is important too, both for increasing the amount of force you can put into every pedal stroke and for improving your endurance. We recommend regular <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">high-intensity intervals</a> devoted to LT and strength work.</p>\n<h2>5. Have a rest</h2>\n<p>You don’t get fitter when you’re riding, you get fitter when you recover afterwards.</p>\n<p>This is why you need to have at least one day without exercise every week, or more if you over-stretch yourself, plus an easy week each month.</p>\n<h2>6. Drink enough</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Work out how much you sweat to stay on top of your hydration.</span></figcaption><span> <i>Cavan Images / Getty Images</i></span></div>\n<p>You might have read that you should drink 400 to 900ml of fluid an hour to <a href=\"https://www.bikeradar.com/advice/nutrition/how-to-stay-hydrated-on-your-bike/\">stay hydrated while riding</a>, but that’s a myth – it varies according to your personal sweat levels.</p>\n<p>Work out precisely what you need at varying intensities and in different weather conditions by doing this process over several rides:</p>\n<ul><li>Weigh yourself undressed. Let’s assume you weigh 75kg.</li>\n<li>On your return, note the amount you drank and ate during your ride. We’ll say 1,500ml, which weighs 1.5kg, and three gels of 0.06kg each, so you’ve taken 1.68kg on board.</li>\n<li>Before showering, eating or drinking, dry yourself and weigh again. We’ll say it’s now 73.2kg. Subtract the second weight from the first to get your bodyweight change: 75 – 73.2 = 1.8kg.</li>\n<li>Add the weight of the food to this to get your total loss: 1.8 + 1.68 = 3.48kg.</li>\n<li>Estimate any toilet stops because this will mean losses are higher.</li>\n<li>Divide total losses by riding time: 3.48 ÷ 3hrs = 1.16kg lost per hour.</li>\n</ul><p>You won’t get to the end of your training ride or event at the same weight as you started, but you should eat and drink enough to be within 1 to 2kg. Aim to never be more than 2 to 3 per cent down in mass.</p>\n<h2>7. Become fuel-efficient</h2>\n<p>You need to drink to replace the water you sweat and breathe out, but drinks provide fuel too. <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-avoid-bonking-on-a-bike-ride/\">Suffering a ‘bonk’</a> – when your body can’t get the energy it needs – is bad news.</p>\n<p>Use a drink that’s 5 to 7 per cent carbohydrate. This is an isotonic level – it contains the same concentration of dissolved particles as your body fluids, so will be absorbed fast.</p>\n<p>Some people prefer a hypotonic drink – one with a carb level less than 5 per cent. The only way to find out what’s right for you is by experimenting in training.</p>\n<p>Also, choose a drink that contains electrolytes, particularly sodium. This speeds up the delivery of fluid to your body, so it’s especially important on longer rides.</p>\n<p>Finally, it’s key to go for a drink that you enjoy the taste of. That way you’re far more likely to drink enough. Drink plenty before you set off so you start fully hydrated, and continue drinking afterwards – little and often – to aid recovery.</p>\n<p>If you’ve trained for over an hour, make it a carb drink, and don’t wait until you feel thirsty – that’s too late.</p>\n<p>You should consume at least 1g of carbohydrate per kilogram of bodyweight for every hour you’re riding. This can be in the form of carb-electrolyte drinks, gels, bars, solid food, or a mix of these.</p>\n<p>Your needs could differ from the norm, so experiment in training to learn exactly what you can tolerate and what you need with you on the day.</p>\n<p>If riding an event, find out what food and drink will be available and at what points along the route, and see if it suits you. If you can’t stomach the energy drink on offer, for example, take your own (or <a href=\"https://www.bikeradar.com/advice/nutrition/how-to-make-your-own-energy-drinks/\">make your own energy drink</a>). If you get sick of sweet stuff, check there’ll be something savoury, or carry it with you.</p>\n<h2>8. Avoid injury</h2>\n<p>When you step up the amount of riding you do, you’ll put stresses and strains on your body. These <a href=\"https://www.bikeradar.com/advice/fitness-and-training/8-stretches-to-improve-your-flexibility-and-cycling-performance/\">cycling stretches</a> can help improve your flexibility, while <a href=\"https://www.bikeradar.com/advice/fitness-and-training/strength-training-cycling/\">strength training</a> can help prevent injury.</p>\n<p>You might be tempted to ignore niggles in order to stick with the programme. Don’t! Riding through pain is a great way to make minor problems major.</p>\n<p>If you get injured, take it seriously. Take time off or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-training/\">do some cross-training</a>, and if it’s a biomechanical problem have your riding position looked at by an expert. If necessary, visit a health care professional.</p>\n<p>Whatever you do, don’t ignore a potential injury.</p>\n<h2>9. Training zones</h2>\n<p>To maximise the effectiveness of the training plan, you’ll need to establish your training zones based on your maximum heart rate (HR max).</p>\n<p>This will allow you to target areas you want to develop and ensure you don’t overcook it. Our training plan uses zones 1 to 5:</p>\n<ul><li><strong>Zone 1:</strong> (50-59% HRmax) – Easy</li>\n<li><strong>Zone 2:</strong> (60-69%) – Steady</li>\n<li><strong>Zone 3:</strong> (70-79%) – Brisk</li>\n<li><strong>Zone 4:</strong> (80-89%) – Hard</li>\n<li><strong>Zone 5:</strong> (90-100%) – Very hard</li>\n</ul><p>If you want to step your training up a level, you can use a <a href=\"https://www.bikeradar.com/features/best-power-meters-9-tested/\">power meter</a> (or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> with a built-in power meter). We’ve got a separate guide with more information on using <a href=\"https://www.bikeradar.com/advice/fitness-and-training/training-zones/\">training zones</a>.</p>\n<hr /><h2>12-week training plan for cyclists</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Follow our 12-week training plan to prepare for your target ride or event.</span></figcaption><span> <i>SWPix.com</i></span></div>\n<p>Read our advice and follow our plan to be ready to ride anywhere between 40 and 100 miles in just three months, depending on your goal and current fitness.</p>\n<p>If you’ve never used a training plan before then don’t be put off – it is a guide and doesn’t have to be followed to the letter.</p>\n<p>If you can’t ride in the morning as we suggest from time to time, or you can’t hit the hills when we advise it, swap things around – that’s real life.</p>\n<p>And remember, have fun!</p>\n<h3>Weeks 1–3</h3>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿</th><th>Week 1<br />Easy</th><th>Week 2<br />Medium</th><th>Week 3<br />Medium</th></tr></thead><tbody><tr><td>Monday</td><td><b>Prepare</b><br />Check your bike and kit over, making sure everything is ready for you to begin riding tomorrow.</td><td><b>Recovery day</b><br />Ideally, get a massage or at least perform self-massage of your leg muscles, especially your quads.</td><td><b>Rest</b></td>        </tr><tr><td>Tuesday</td><td><b>1hr ride</b><br />In the morning, before breakfast (to encourage the use of stored fat as fuel), at a moderate zone 2 effort, indoors or on moderate terrain.</td><td><b>1hr ride</b><br />In the morning ideally, fasted, at moderate zone 2 effort, indoors or on moderate terrain.</td><td><b>1hr ride</b><br />In the morning ideally, fasted, at top of zone 2 effort, indoors or on moderate terrain.</td>        </tr><tr><td>Wednesday</td><td><b>1hr ride</b><br />Evening ride over moderate terrain, ideally with a few mates or a club so you can practise riding in a group.</td><td><b>1hr 30min ride</b><br />Evening ride, mainly zone 2 but include the longest hills you can find for a total of 30mins controlled hard climbing work.</td><td><b>1hr ride</b><br />Evening ride with hilly terrain, working at a zone 3 pace to stay smooth with controlled breathing. </td>        </tr><tr><td>Thursday</td><td><b>Two short sessions</b><br />If possible, 30-40mins am and pm. Do the morning ride fasted, and the evening ride with 8sec fast efforts every 5mins.</td><td><b>Choice day</b><br />Work on your area of weakness. You could do extra morning fasted work up to 2hrs.</td><td><b>Choice day</b><br />Work on your area of weakness. You could do some extra morning fasted work up to 1hr 30.</td>        </tr><tr><td>Friday</td><td><b>Rest</b></td><td><b>Rest</b></td><td><b>Rest</b></td>        </tr><tr><td>Saturday</td><td><b>Endurance</b><br />30-40% of event distance on a moderate to rolling course. Stay in zone 2 more than 75% of ride time.</td><td><b>Endurance</b><br />40-50% of event distance on a moderate to rolling course. Stay in zone 2 more than 75% of ride time.</td><td><b>Endurance</b><br />50-60% of event distance on a moderate to rolling course. Stay in zone 2 more than 75% of ride time.</td>        </tr><tr><td>Sunday</td><td>Saturday ride if it was missed. Otherwise,  <b>1hr ride</b> concentrating on a higher than normal cadence.</td><td>Saturday ride if it was missed. Otherwise, <b>1hr ride</b> in a bigger gear than normal (cadence of 50-60rpm), pushing effort on inclines for the middle 20mins.</td><td>Saturday ride if it was missed. Otherwise, <b>1hr ride</b> in a bigger than normal gear (50-60rpm), pushing on inclines for middle 20mins.</td>        </tr></tbody></table></div>\n\n<h3>Weeks 4–6</h3>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿</th><th>Week 4<br />Easy</th><th>Week 5<br />Hard</th><th>Week 6<br />Hard</th></tr></thead><tbody><tr><td>Monday</td><td><b>Rest</b><br />Get bike mechanically sorted, kit organised, rides planned and nutrition bought/organised.</td><td><b>1 - 1hr 30mins light spin</b><br />Use rollers/turbo or flat terrain (zone 1), with legs feeling no pressure.</td><td><b>1hr ride</b><br />Morning or evening ride, zone 2, either indoors or on moderate terrain.</td>        </tr><tr><td>Tuesday</td><td><b>45mins</b><br />ride In the morning ideally, fasted, at top of zone 2 effort, indoors or on moderate terrain.</td><td><b>2hr ride</b><br />In the morning ideally fasted at moderate zone 2 effort, indoors or on moderate terrain outdoors.</td><td><b>1hr 30mins ride</b><br />In the morning ideally, fasted at moderate zone 2 effort, indoors or on moderate terrain.</td>        </tr><tr><td>Wednesday</td><td><b>1hr ride</b><br />Work on an area of weakness, such as climbing, descending, cornering or group riding.</td><td><b>1hr 30mins ride</b><br />Evening ride, intervals of 5-8mins (equal work and recovery) in zones 4 and 5, or chain gang; aim for 30-45mins of hard work.</td><td><b>1hr 30mins ride</b><br />Evening ride, zones 3 and 4 on the longest climbs you can find for a total of 30mins hard climbing work.</td>        </tr><tr><td>Thursday</td><td><b>Rest</b></td><td><b>As Tuesday</b><br />Or you can do two shorter sessions – 1hr morning and evening.</td><td><b>Choice day</b><br />Work on an area of weakness; you could do some extra morning fasted work up to 2hrs.</td>        </tr><tr><td>Friday</td><td><b>Rest</b></td><td><b>Recovery day</b><br />Optional 1hr light spin, zone 1, on rollers or flat terrain, legs feeling no pressure.</td><td><b>Recovery day</b><br />Optional 1hr light spin, zone 1, on rollers or flat terrain, legs feeling no pressure.</td>        </tr><tr><td>Saturday</td><td><b>Endurance</b><br /> No more than 25% of event distance on a moderate to rolling course. Stay in zone 2 more than 90% of ride time.</td><td><b>Endurance</b><br />60% of event distance on a hilly course. Stay in zone 2 on flats and high zone 3/zone 4 on hills. Include 2 x 20min climbs if possible.</td><td><b>Endurance</b><br />70% of event distance on a hilly course. Stay in zone 2 on flats and zones 3 and 4 on hills.</td>        </tr><tr><td>Sunday</td><td>Saturday ride if it was missed. Otherwise, <b>1hr light spin</b> with 8sec efforts every 6mins.</td><td>Saturday ride if it was missed. Otherwise, <b>1hr 30mins</b> ride in big gear, pushing on inclines for the middle 40min section.</td><td>Saturday ride if missed. Otherwise, <b>2hr ride</b> with speed practice on descents and 5-6 x 1min zone 5 efforts.</td>        </tr></tbody></table></div>\n\n<h3>Weeks 7–9</h3>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿</th><th>Week 7<br />Hard</th><th>Week 8<br />Easy</th><th>Week 9<br />Medium</th></tr></thead><tbody><tr><td>Monday</td><td><b>Recovery day</b><br />Optional 1hr light spin, zone 1, on rollers/turbo or flat terrain, with legs feeling no pressure.</td><td><b>Rest</b></td><td><b>Rest</b></td>        </tr><tr><td>Tuesday</td><td><b>Light day</b><br />It’s your choice of training but bear in mind what’s coming up in tomorrow’s session.</td><td><b>1hr ride</b><br />In the morning ideally, fasted at high zone 2 effort, indoors or on moderate terrain.</td><td><b>Bonus 45-60min morning ride</b><br />Ride fasted and in high zone 2, either indoors or on moderate terrain.</td>        </tr><tr><td>Wednesday</td><td><b>2hr ride</b><br />Evening ride, intervals of 10mins (equal work and recovery) in zones 4 and 5, or chain gang; aim for 50-70mins of hard work.</td><td><b>1hr ride</b><br />In the morning ideally, fasted zone 2 effort, indoors or on moderate terrain.</td><td><b>1hr ride</b><br />Evening ride with a few mates or a cycle club. Aim for moderate terrain and work on your group riding skills.</td>        </tr><tr><td>Thursday</td><td><b>Choice day</b><br />Work on an area of weakness; you could do some extra morning fasted work up to 2hrs.</td><td><b>Rest</b></td><td><b>Two short sessions</b><br />30-40mins morning and evening. Morning ride fasted, evening ride with 8sec fast efforts every 5mins.</td>        </tr><tr><td>Friday</td><td><b>Rest</b></td><td><b>Rest</b></td><td><b>Rest</b></td>        </tr><tr><td>Saturday</td><td><b>Endurance</b><br />60-75% of event distance on the hilliest course you can find. Stay in zone 2 on flats and do 40-60mins upper zones 3 and 4 work on hills.</td><td><b>Endurance</b><br />40% of event distance on flat terrain, staying in zone 2.</td><td><b>Endurance</b><br />50% of event distance on a hilly course. Stay in zone 2 on flats and zones 3 and 4 on the hills.</td>        </tr><tr><td>Sunday</td><td>Saturday ride if it was missed. Otherwise, <b>2hr ride</b> with speed practice on the descents for the middle 40mins.</td><td>Saturday ride if it was missed. Otherwise, <b>1hr light spin</b> with 8sec efforts every 6mins.</td><td>Saturday ride if it was missed. Otherwise, <b>1hr 20mins</b> ride in a big gear pushing on the inclines for middle 40min section. </td>        </tr></tbody></table></div>\n\n<h3>Weeks 10–12</h3>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>﻿</th><th>Week 10<br /> Medium</th><th>Week 11<br />Taper</th><th>Week 12<br />Taper</th></tr></thead><tbody><tr><td>Monday</td><td><b>Recovery day</b><br />Ideally, get a massage or perform a self-massage. A 30min light spin is optional on rollers or flat terrain.</td><td><b>Rest</b></td><td><b>Rest</b></td>        </tr><tr><td>Tuesday</td><td><b>1hr ride, optional</b><br />In the morning, fasted, at high zone 2 effort, indoors or on moderate terrain.</td><td><b>Two short sessions</b><br />30-40mins am and pm. Do the morning ride fasted and the evening ride with an 8sec fast effort every 5mins.</td><td><b>1hr ride</b><br />With some zones 2 and 3 3-5mins climbs on moderate terrain. Aim for 30mins of hard work.</td>        </tr><tr><td>Wednesday</td><td><b>1hr 30mins ride</b><br />Zones 3 and 4 on the longest climbs you can find for a total of 30mins of controlled, hard climbing work.</td><td><b>1hr ride</b><br />Hilly terrain, climbing at zone 3 pace, staying smooth and relaxed throughout.</td><td><b>1hr ride</b><br />Work on an area of weakness – perhaps climbing, descending or feeding while in the saddle.</td>        </tr><tr><td>Thursday</td><td><b>Choice day</b><br />Work on an area you know is weakest; you could do some extra morning fasted work up to 2hrs.</td><td><b>Rest</b></td><td><b>1hr light spin</b><br />8sec efforts every 6mins to test your legs’ responses, but no more – it’s time to store glycogen.</td>        </tr><tr><td>Friday</td><td><b>Rest</b></td><td><b>Rest</b></td><td><b>Rest</b></td>        </tr><tr><td>Saturday</td><td><b>Endurance</b><br />40% event distance on the hilliest terrain you can find, or ride a sportive. Stay in zone 2 on flats and zones 3 and 4 on hills.</td><td><b>Endurance</b><br />30-40% event distance on a moderate to rolling course. Stay in zone 2 for at least 75% of the time.</td><td><b>Choice or rest</b><br />Some riders like a light spin the day before an event to keep their legs loose, others don’t – it’s your choice.</td>        </tr><tr><td>Sunday</td><td>Saturday ride if missed. Or <b>1hr 30mins</b> ride with descending at speed practice and 5-6 x 1min efforts in zone 5 with a 2-3mins spin recovery in between.</td><td>Saturday ride if you missed it. Otherwise, do a <b>1hr 20mins ride</b>, practising descending at speed for 30mins.</td><td><b>Goal Event</b></td>        </tr></tbody></table></div>\n\n<p> </p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8497888c5ee49912d281fc52f2fba471cdd5edd7de47b674d93c93c143addb82","category":"Cycling"}