{"title":"Demi Vollering isn’t the next best thing, she’s already there","link":"https://cyclingtips.com/2021/06/demi-vollering-isnt-the-next-best-thing-shes-already-there/","date":1624719615000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/06/CORVOS_00033255-070-650x438.jpg\" /></div><h2>Demi Vollering isn't the next best thing, she's already there</h2><p>\n</p><p>Consistency is key, and no one (besides perhaps Anna van der Breggen) has been as consistent as Demi Vollering in 2021. Vollering came out of the gate swinging at Omloop Het Nieuwsblad, proving right away that the young Dutch rider was a game-changer for SD Worx. Vollerings <a href=\"https://cyclingtips.com/2021/06/demi-vollering-wins-la-course-by-le-tour-de-france/\" target=\"_blank\">La Course victory </a>shouldn’t be surprising after the spring she’s had, and with  Van der Breggen guiding her way. </p>\n\n\n\n<p>All it took was five races before Van der Breggen was working for Vollering instead of the other way around. Five races. Let that sink in for a second. Van der Breggen, one of the most decorated cyclists of all time, in the final year of her career and in possession of both the road and time trial world titles, working for a rider with only two years of professional peloton experience. The dynamic speaks volumes. </p>\n\n\n\n<p>It was Vollering’s performance at La Flèche Wallonne that changed everything. Van der Breggen was hesitant to put Vollering on the front, thinking her own legs weren’t quite there for the win. But Vollering ignored her team leader and jumped on the front anyway. </p>\n\n\n\n<p>After the race, Van der Breggen praised Vollering’s split-second decision making and dedication to the team. A few days later Van der Breggen <a href=\"https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=&amp;cad=rja&amp;uact=8&amp;ved=2ahUKEwj579biubXxAhU4AmMBHc1jBHUQFjAAegQIBBAD&amp;url=https%3A%2F%2Fcyclingtips.com%2F2021%2F04%2Fthe-selfless-brilliance-of-anna-van-der-breggen%2F&amp;usg=AOvVaw0yvMr3tEw4bqD-VzmbIq9h\" target=\"_blank\">returned the favour</a>, laying down a 10 km leadout for her young teammate to win Liège-Bastogne-Liège. </p>\n\n\n\n<p>La Course by the Tour de France in a way suited both Van der Breggen and Vollering. To be fair, there is hardly a course in the Women’s WorldTour that doesn’t suit Anna van der Breggen, but with so little experience at the top level Vollering hasn’t claimed any specific box yet. </p>\n\n\n\n<p>With her win at Liège-Bastogne-Liège she proved she can be called a punchy sprinter. Her second-place result at Amstel Gold Race behind Marianne Vos backed that up. But at the Vuelta a Burgos she outclimbed nearly an entire peloton to take <a href=\"https://cyclingtips.com/2021/05/anna-van-der-breggen-wins-vuelta-a-burgos-final-stage-and-overall/\" target=\"_blank\">third on the final stage</a> behind Van der Breggen and Annemiek van Vleuten. </p>\n\n\n\n<p>SD Worx could have easily played either card at La Course on Saturday, and when Van der Breggen followed a move by Cecilie Uttrup Ludwig with 1.5 km to go, a win for the world champion was in sight. Atop the Côte de la Fosse aux Loups the road levelled out, allowing a few distanced riders to claw back to the front. Vollering was back in the game.</p>\n\n\n\n<p>“It was really hard, but in the end, there was still a lot of girls there,” Vollering said. “The steep part, that was the really hard part, but because it was not so steep anymore after it, a lot of girls could come back. Including me. it was hard but I expected it would be a little harder, I think.”</p>\n\n\n\n<p>With Vollering back in the lead group, SD Worx again had two options. Under the Flamme Rouge Van der Breggen’s options of riding away, solo dwindled. The potential of a sprint increased. </p>\n\n\n\n<p>Into the final 300 meters, the sprint would come down to Vos and Vollering once again, but 2020 La Course winner Lizzie Deignan was closing in from behind. </p>\n\n\n\n<p>Just like in Liège-Bastogne-Liège, Van der Breggen hit the front for her teammate Vollering, setting the pace for a fast sprint to the line.</p>\n\n\n\n<p>“Anna van der Breggen did a really great job, and it was good I could finish it off because it’s hard to sprint to Marianne, so it’s nice we could win it,” Vollering said. “I was really looking forward to sprinting against Marianne because in Amstel [Gold Race] I came second to her, and you really want to try it again.”</p>\n\n\n\n<p>Vollering’s consistent results after the win landed her in the WorldTour purple leader’s jersey. A combination of third overall at Vuelta a Burgos and top 10 in all four stages and top ten finishes in five of the Spring one days. </p>\n\n\n\n<p>Not only did Vollering win La Course by the Tour de France, but she also won what might be the last edition of the women’s event. But with bigger goals on the horizon, the potential end to eight years of La Course isn’t a big worry for the young talent. </p>\n\n\n\n<p>“Next year it will be a really cool stage race. A yellow jersey would be nice. A lot of mountain stages would be nice and a team time trial is also really cool to do. It would be cool if it’s a mix of everything.” </p>\n\n\n\n<p>After La Course in 2020, we told you to <a href=\"https://cyclingtips.com/2020/07/its-time-you-started-paying-attention-to-demi-vollering/\" target=\"_blank\">pay attention to Demi Vollering</a>. The advice still stands. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/06/demi-vollering-isnt-the-next-best-thing-shes-already-there/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"84986165b3bdf943232b3826dc9042476ee31c7d471f81147301d7fa99c94f98","category":"Cycling"}