{"title":"Prevalence of hepatitis A virus among migrant workers in Qatar: A national study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306753","date":1720533600000,"content":"<p>by Nadin Younes, Hiam Chemaitelly, Parveen Banu Nizamuddin, Tasneem Al-Hamad, Marah Abdallah, Hadi M. Yassine, Laith J. Abu-Raddad, Gheyath K. Nasrallah</p>\r\nBackground <p>Hepatitis A virus (HAV) is the predominant cause of acute viral hepatitis worldwide; however, data on HAV antibody prevalence (seroprevalence) among migrant populations are limited. This study aimed to investigate HAV seroprevalence among Qatar’s migrant craft and manual workers (CMWs), constituting approximately 60% of the country’s population.</p> Methods <p>HAV antibody testing was conducted on stored serum specimens obtained from CMWs during a nationwide severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) population-based cross-sectional survey between July 26 and September 9, 2020. Associations with HAV infection were investigated through regression analyses.</p> Results <p>Of the 2,607 specimens with HAV antibody test results, 2,393 were positive, and 214 were negative. The estimated HAV seroprevalence among CMWs was 92.0% (95% CI: 90.9–93.1%). HAV seroprevalence was generally high but exhibited some variation, ranging from 70.9% (95% CI: 62.4–78.2%) among Sri Lankans to 99.8% (95% CI: 98.2–99.9%) among Pakistanis. The multivariable regression analysis identified age, nationality, and educational attainment as statistically significant factors associated with HAV infection. Relative to CMWs aged ≤29 years, the adjusted relative risk (ARR) was 1.06 (95% CI: 1.03–1.10) in CMWs aged 30–39 years and reached 1.15 (95% CI: 1.10–1.19) in those aged ≥50 years. In comparison to Indians, the ARR was lower among Sri Lankans, assessed at 0.81 (95% CI: 0.72–0.91), but higher among Nepalese at 1.07 (95% CI: 1.04–1.11), Bangladeshis at 1.10 (95% CI: 1.07–1.13), Pakistanis at 1.12 (95% CI: 1.09–1.15), and Egyptians at 1.15 (95% CI: 1.08–1.23). No evidence for differences was found by geographic location or occupation.</p> Conclusions <p>HAV seroprevalence among Qatar’s CMW population is very high, with over nine out of every ten individuals having been exposed to this infection, likely during childhood.</p>","author":"Nadin Younes","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"849b098cdc7e54b0f1002537531f78e3d58b1431401892165f6198a8546d3608","category":"Interdisciplinary"}