{"title":"Assessment of the toxic influence of locally formulated pesticides on hepatic and renal biomarkers in male Wistar rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae157/7796859?rss=1","date":1727654400000,"content":"<span><div>Abstract</div><div>Background</div>There is growing concern of the potential damage to vital organs after long term exposure to locally formulated pesticides in rural area of Nigeria. This study was designed to assessed the effects of the individual chemical compound and their combination on the kidney and liver of rats’ model.<div>Methodology</div>Fifty-four rats divided into six groups and three sub-groups were exposed to 25, 50 and 75% dose of each of the pesticide’s LD<sub>50</sub> for 4 h at 3 days interval in an inhalation chamber for 28 days. Alanine aminotransferase (ALT), aspartate aminotransferase (AST), alkaline phosphatase (ALP), total bilirubin (TOT_BIL), creatinine and urea assay showed significant increase at the aforementioned doses in comparison to the control group. The red blood cell counts, hematocrit and hemoglobin concentrations were significantly altered in the rats administered varying doses of the pesticides when compared with the control. Similar result was obtained for the differential white blood cell counts. Histopathological examinations of the liver tissue of rats showed infiltrated sinusoids, traces of karypyknosis, vacuolar degeneration and microvesicular steatosis while that of the renal tissue showed glomeruli atrophy leading to widened Bowman’s spaces as well as few shrunken glomeruli and varied level of degenerative tubular changes to tubular necrosis.<div>Conclusion</div>This study established that individual pesticides and their mixture is toxic to the liver and kidney, as evidenced by the elevated markers of renal and liver functions and distortion of the structure of both organs as revealed by their photomicrographs. Therefore, it is a matter of public health significance to regularly monitor pesticide residues in foods and humans in order to assess the food safety risk and population exposure to pesticides.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"84a718e8a00a657c1f15a4c85462c47a46733a2cf7df58f0f62947238580777d","category":"Environment"}