{"title":"PSVI-26 The benefits of probiotics (L. plantarum and L. acidophilus) supplement in growth performance, egg production, gas emission and gut microbiome diversity in Hy-Line brown laying hens","link":"https://academic.oup.com/jas/article/102/Supplement_3/709/7757550?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>During the past few decades, antibiotics have been widely used at subtherapeutic doses to improve growth rates and performance in the poultry industry. However, antibiotics can result in side effects including bacterial resistance; these side effects often have detrimental consequences for human health. Thus, the poultry sector was urged to seek alternative strategies to promote animal performance. One environmentally friendly approach to growth promotion involves the use of probiotics, which have been used in the poultry industry for decades. Therefore, we aimed to investigate the effects of dietary supplementation with <span>Lactobacillus spp.</span> (<span>L. plantarum</span> and <span>L. acidophilus</span>) on growth performance, egg production, gas emission and gut microbiota diversity in laying hens. A total of 192 Hy-Line brown laying hens were randomly divided into four groups and assigned to one of four dietary treatments for 12 wk. The test treatments were basal diet (TRT1), basal + 0.25% antibiotic (TRT2), and basal + 0.1% probiotics (TRT3), and basal + 0.2% probiotics (TRT4). Laying hens fed a diet supplemented with 0.2% probiotics showed increased (<span>P</span> &lt; 0.05) egg production in wk 9, 10, and 12. Moreover, fecal ammonia and hydrogen sulfide emissions were reduced (<span>P</span> &lt; 0.05) in the probiotic groups. Microbiome analysis showed increased (<span>P</span> &lt; 0.05) species richness in the probiotic groups, as indicated by Chao1 and Shannon indices, but a decrease (<span>P</span> &lt; 0.05) in species diversity according to the Simpson index, suggesting a specific microbial community development due to probiotic supplementation. In conclusion, this study provides us with an insight into the potential use Lactobacillus <span>spp.</span> probiotic as a food supplement in the laying hen industry also provides us with a better understanding of the interplay between <span>Lactobacillus spp.</span> and the gut microbiome diversity in laying hens.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"84acc6652c1518531853564465e066e190b7192b0c823b5afc846df379a49a31","category":"Environment"}