{"title":"Analyst Discusses Apple Car's Key to Success, Says Steve Jobs Would Be Proud of Tim Cook's Legacy","link":"https://www.macrumors.com/2021/08/31/katy-huberty-on-apple-car-and-tim-cook/","date":1630417935000,"content":"In the latest episode of the Apollo Effect podcast series, Morgan Stanley analyst Katy Huberty discussed the potential for a so-called \"<a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a>\" to disrupt the auto industry through vertical integration of hardware, software, and services. Huberty also praised Apple CEO Tim Cook, noting that the late Steve Jobs would have been proud.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/tim-cook-apple-car.jpeg\" /><div><em>A fan-made image of Tim Cook announcing an Apple Car <a href=\"https://www.youtube.com/watch?v=SPLpDon_JOM\">via YouTube/qfulm</a></em></div>\r\n<br />\r\n<h3>Apple Car's Vertical Integration</h3>\r\n<br />\r\nWhile some reports over the years have indicated that Apple's automotive ambitions might be limited to software and services, Huberty said Apple is most successful when there is vertical integration, as evidenced by the iPhone. Huberty said Apple would want a hand in the design of the vehicle, in how the software communicates with the hardware, and in choosing the right components and technologies to use.\r\n<br />\r\n\r\n<br />\r\n\"When you think about what will differentiate the car of the future, it's certainly being creative around new supply chains,\" said Huberty. \"It's about vertical integration of different components, hardware design, software, and ultimately, the services that can be delivered in that automobile. It's about consumer trust and credibility, and certainly brand when it comes to a consumer product. And all of those categories are ones where Apple is a leader.\"\r\n<br />\r\n\r\n<br />\r\nHuberty said once Apple manages to \"get the car right,\" the company can then introduce services on top. While she did not provide any examples, one could imagine an \"Apple Car\" having everything from full Apple Music integration <a href=\"https://www.macrumors.com/2019/08/20/porsche-taycan-integrated-apple-music/\">like in the Porsche Taycan</a> to built-in displays for rear passengers to watch Apple TV+ shows or play Apple Arcade games.\r\n<br />\r\n\r\n<br />\r\nIn a December 2020 research note, Apple analyst Ming-Chi Kuo said an \"Apple Car\" is unlikely to hit the market <a href=\"https://www.macrumors.com/2020/12/27/kuo-apple-car-2025-2027-at-earliest/\">until 2025–2027 at the earliest</a>.\r\n<br />\r\n\r\n<br />\r\n<h3>Tim Cook's Legacy</h3>\r\n<br />\r\nLast week marked the <a href=\"https://www.macrumors.com/2021/08/24/tim-cook-ten-years-as-apples-ceo/\">10th anniversary of Cook being named Apple's CEO</a> after Steve Jobs stepped down from the post due to declining health. Huberty reflected on Cook's era in the podcast interview, noting that Jobs would be proud.\r\n<br />\r\n\r\n<br />\r\n\"I really think that Tim Cook has done a pretty phenomenal job allowing for Steve's legacy to carry on, protecting that legacy while building his own very separate legacy,\" said Huberty. \"Steve was very much about design and innovation and getting in the weeds in those two areas. Tim has allowed the culture of the company to continue on that front, but at the same time, he's layered in some of the softer aspects that are harder to measure,\" she added, noting that Cook has successfully scaled operations while placing a greater focus on areas like  employee benefits, charitable giving, and environmental responsibility.\r\n<br />\r\n\r\n<br />\r\n\"I think if Steve was looking down, he would be very proud of the way that Tim has built his own legacy while protecting the culture and the differentiation around design and innovation that Steve started,\" she concluded.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-car/\">Apple Car</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/katy-huberty/\">Katy Huberty</a>, <a href=\"https://www.macrumors.com/guide/morgan-stanley/\">Morgan Stanley</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/31/katy-huberty-on-apple-car-and-tim-cook/\">Analyst Discusses Apple Car's Key to Success, Says Steve Jobs Would Be Proud of Tim Cook's Legacy</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/analyst-discusses-apple-cars-key-to-success-says-steve-jobs-would-be-proud-of-tim-cooks-legacy.2309292/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=w3jQPedOSIM:NBugihSePJI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=w3jQPedOSIM:NBugihSePJI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/w3jQPedOSIM\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"84ace1583e052b8a17e1e5fcce5f1269a818baba40280482a2c561fa6eae065c","category":"Apple"}