{"title":"Polyploid giant cancer cells induced by Docetaxel exhibit a senescence phenotype with the expression of stem cell markers in ovarian cancer cells","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306969","date":1720706400000,"content":"<p>by Song Zhao, Lili Wang, Mingyue Ouyang, Sining Xing, Shuo Liu, Lingyan Sun, Huiying Yu</p>\r\n\r\nDocetaxel (Doc) plays a crucial role in clinical antineoplastic practice. However, it is continuously documented that tumors frequently develop chemoresistance and relapse, which may be related to polyploid giant cancer cells (PGCCs). The aim of this study was investigate the formation mechanism and biological behavior of PGCCs induced by Doc. Ovarian cancer cells were treated with Doc, and then the effect of Doc on cellular viability was evaluated by MTT assay and microscopic imaging analysis. The biological properties of PGCCs were further evaluated by Hoechst 33342 staining, cell cycle and DNA content assay, DNA damage response (DDR) signaling detection, β-galactosidase staining, mitochondrial membrane potential detection, and reverse transcription-quantitative polymerase chain reaction. The results indicated that Doc reduced cellular viability; however, many cells were still alive, and were giant and polyploid. Doc increased the proportion of cells stayed in the G2/M phase and reduced the number of cells. In addition, the expression of γ-H2A.X was constantly increased after Doc treatment. PGCCs showed senescence-associated β-galactosidase activity and an increase in the monomeric form of JC-1. The mRNA level of octamer-binding transcription factor 4 (<i>OCT4)</i> and krüppel-like factor 4 (<i>KLF4)</i> was significantly increased in PGCCs. Taken together, our results suggest that Doc induces G2/M cell cycle arrest, inhibits the proliferation and activates persistent DDR signaling to promote the formation of PGCCs. Importantly, PGCCs exhibit a senescence phenotype and express stem cell markers.","author":"Song Zhao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"84bf90f714d74da61e6a360950c6c1928c6239a202f2c3325c6d208e6f679263","category":"Interdisciplinary"}