{"title":"Multi‐Hazard Interrelationships and Risk Scenarios in Urban Areas: A Case of Nairobi and Istanbul","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF004413?af=R","date":1725381751000,"content":"<h2>Abstract</h2>\n<p>This paper introduces a methodology for characterizing the breadth of natural hazard types, hazard interrelationships, and risk scenarios in Global South urban areas, focusing on Nairobi, Kenya, and Istanbul, Türkiye. Our approach involves (a) a comprehensive characterization of multi-hazards and their interrelationships in an urban setting, (b) collaborative development of relevant multi-hazard scenarios with local disaster risk reduction (DRR) stakeholders, and (c) analysis of the potential for integrating these scenarios into urban DRR efforts. Using a critical review of 135 sources (academic and gray literature, databases, online, and social media), we identify 19 natural hazard types that might influence Nairobi and 23 in Istanbul. We further identified in Nairobi 88 and Istanbul 105 hazard interrelationship pairs (e.g., an earthquake triggering landslides) out of a possible 576 interrelationships. These findings are cataloged in an extensive database, which informs the creation of multi-hazard risk scenario exemplars for each city. These exemplars are refined through stakeholder engagement, involving four workshops (47 participants) and nine semi-structured interviews with local DRR stakeholders. Despite the identified benefits, this engagement reveals a significant gap in integrating multi-hazards into current urban policy and practice. Governance challenges are highlighted as a key barrier, but opportunities for better integration are also identified, including evolving policies and growing awareness among urban actors. Our approach, particularly relevant in data-scarce urban areas of low- and middle-income countries, provides a framework for exploring multi-hazard issues in various urban contexts.</p>","author":"Robert Šakić Trogrlić, \nHarriet E. Thompson, \nEmin Yahya Menteşe, \nEkbal Hussain, \nJoel C. Gill, \nFaith E. Taylor, \nEmmah Mwangi, \nEmine Öner, \nVera G. Bukachi, \nBruce D. Malamud","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"84c760e4489da38840fbb2729068d1eee3e1dfc1cc617444240fbbc2ad80b929","category":"Environment"}