{"title":"Herpes Simplex Virus Type 1 Infection of Human Periodontal Ligament.","link":"https://www.preprints.org/manuscript/202406.1408/v1","date":1718868903000,"content":"The periodontal ligament (PDL) is a complex connective tissue that connects the tooth root to the dental alveolar bone and plays crucial mechanical roles. PDL also exhibits regenerative roles and regulatory functions to maintain per-iodontium integrity and homeostasis. While PDL exposure to oral microbial pathogens is common, virtually nothing is known regarding viral infections of PDL. In particular, human herpes simplex virus type 1 (HSV-1) persistently infects the oral cavity through infections of the oral epithelium, connective tis-sue and neurons. While the oral spread of HSV-1 is generally asymptomatic, this virus has also been implicated in various oral pathologies. In this study, using a primary cell model derived from PDL (PDL-cells), and whole surgical fragments of PDL, we provide evidence supporting the efficient infection of PDL by HSV-1 and the promotions of cytopathic effects. Infection of PDL by HSV-1 was also associated with an acute innate inflammatory response, as il-lustrated by the production of the antiviral interferons and pro-inflammatory cytokines. Furthermore, this inflammatory response to HSV-1 was exacerbated in the presence of bacterial-derived products, such as peptidoglycans. This work therefore highlights the ability of HSV-1 to infect mesenchymal cells from PDL, suggesting that PDL may serve as a viral reservoir for the perio-dontal spread of HSV-1. Moreover, this raises questions about HSV-1 oral pathogenesis, as HSV-1-associated cytopathic and inflammatory effects may contribute to profound alterations of PDL integrity and functioning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"84e1742c809435606f3c21f6a28b3a4a9ad503d64e57e00af9a1b4dbc5a48fd7","category":"Interdisciplinary"}