{"title":"ตอนใหม่ของ Black Jack มังงะในตำนานของ Tezuka Osamu ผู้ล่วงลับ ใช้ AI ช่วยสร้าง","link":"https://www.blognone.com/node/136860","date":1700544036000,"content":"<div><div><div><p>Black Jack หนึ่งในมังงะที่โด่งดังของ Tezuka Osamu นักวาดมังงะในตำนานซึ่งเสียชีวิตไปแล้วเมื่อปี 1989 ได้ออกตอนใหม่ที่ใช้ AI ช่วยสร้างขึ้นมา เพื่อฉลองครบรอบ 50 ปีของมังงะ (เขียนตั้งแต่ 1973 ถึง 1983)</p>\n<p>Makoto Tezuka ลูกชายของศิลปินผู้ล่วงลับและผู้กำกับของ Tezuka Productions Co หนึ่งในผู้จัดงานโปรเจ็กต์นี้ กล่าวว่ารู้สึกยินดีที่มีผลงานสังสรรค์ที่คล้ายกับ Tezuka Osamu ถูกสร้างขึ้น โดย Black Jack ตอนใหม่นี้ใช้ธีมความศักดิ์สิทธิ์ของการมีชีวิต และหยิบยกประเด็นปัญหาที่เกิดจากเทคโนโลยีการแพทย์ขั้นสูงในสังคมสมัยใหม่ มาใช้เป็นองค์ประกอบหลักในการสร้าง</p>\n<p>ตอนใหม่ของ Black Jack มีความยาวทั้งหมด 32 หน้าจะถูกตีพิมพ์ในนิตยสารการ์ตูนรายสัปดาห์ Shukan Shonen Champion วันพุธนี้ เนื้อหาจะเล่าถึงผู้ป่วยหญิงคนหนึ่งที่ได้รับการปลูกถ่ายหัวใจเทียมซึ่งควรจะเป็นหัวใจเทียมที่สมบูรณ์แบบ</p>\n<p><em>ภาพจากสำนักข่าว Kyodo News</em><br />\n<img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/cd522adfe21e67e696af5bb6ef4eb3d8.jpg\" /></p>\n<p>โมเดล AI ที่ใช้ในโปรเจ็กต์นี้ ได้แก่ Advanced GPT-4 ของ ChatGPT และ Stable Diffusion ซึ่งเป็นเครื่องมือสร้างภาพ โดยเรียนรู้จากมังงะ Black Jack ประมาณ 200 ตอน มีข้อมูลรูปภาพใบหน้าของตัวละครในมังงะจำนวน 20,000 หน้า จากนั้นทีมงานก็ป้อนไอเดียโครงเรื่อง และขอให้ AI สร้างเรื่องราวทั้งหมดสำหรับตอนใหม่ของ Black Jack</p>\n<p>ทีมงานกล่าวว่า AI ช่วยเพิ่มความคิดสร้างสรรค์ และข้อความที่สร้างขึ้นได้รับการปรับให้สะท้อนวิสัยทัศน์ของทีมเกี่ยวกับเรื่องราวได้ดีขึ้นในแบบที่ผู้อ่านสามารถเข้าใจได้ง่าย</p>\n<p>ในขณะเดียวกัน Makoto Tezuka กล่าวว่า AI ยังคงอ่อนแอในการนำความรู้สึกของมนุษย์มาใส่ไว้ในเรื่องราว เพราะคนเราความรู้สึกแตกต่างกันไปไม่สามารถบรรลุผลได้ง่าย ๆ ด้วยการวิเคราะห์ข้อมูลที่รวบรวมมา</p>\n<p>Satoshi Kurihara สมาชิกในโปรเจ็กต์และศาสตราจารย์คณะวิทยาศาสตร์และเทคโนโลยีมหาวิทยาลัย Keio กล่าวว่า AI มีศักยภาพในการผลิตงานจำนวนมากซึ่งมันมีคุณภาพใกล้เคียงกับงานที่สร้างโดยนักวาดมังงะ หรือบางทีก็ช่วยยกมาตรฐานให้ดีขึ้นได้</p>\n<p>Satoshi กล่าวเพิ่มว่าปีหน้าเขาต้องการทำงานเกี่ยวกับเทคโนโลยี AI ที่สามารถช่วยสร้างคอนเทนท์ญี่ปุ่นได้มากขึ้น โดยไม่จำกัดแค่การ์ตูนมังงะเท่านั้น ซึ่งมันจะสามารถส่งออกไปยังทั่วโลกได้ด้วย</p>\n<p>ก่อนหน้านี้เมื่อปี 2020 มีโปรเจ็กต์ Paidon มังงะที่ออกแบบโดย AI ที่มีลายเส้นแบบ Osamu Tezuka เผยแพร่ในนิตยสารการ์ตูนรายสัปดาห์ Morning</p>\n<p>ที่มา - <a href=\"https://english.kyodonews.net/news/2023/11/5cea23ce0800-new-tezuka-black-jack-manga-episode-created-using-ai-unveiled.html\">Kyodo News</a> via <a href=\"https://japantoday.com/category/entertainment/new-tezuka-black-jack-manga-episode-created-using-ai-unveiled\">Japan Today</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/manga\">Manga</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"84e22480e4a281d1051b904715b7796beaa61033d56aa5c8bdec9c93b5338df3","category":"Thai"}