{"title":"The efficacy and safety of different Janus kinase inhibitors as monotherapy in rheumatoid arthritis: A Bayesian network meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305621","date":1718978400000,"content":"<p>by Bingjia Qu, Feng Zhao, Ying Song, Junyi Zhao, Yuxin Yao, Yulan Chen, Ruobing Liao, Lingyu Fu</p>\r\nObjective <p>This study aims to evaluate the efficacy and safety of JAK inhibitors in the treatment of patients with RA.</p> Methods <p>The databases CNKI, VIP, Wanfang, CBM, and PubMed, Embase, Cochrane Library and Web of Science were searched to identify relevant randomized controlled trials (RCTs), all from the time of database creation to April 2024. Screening, data extraction, and risk of bias assessment (using Review Manager-5.3 software) were independently performed by at least two authors. The network meta-analysis was conducted using R 4.1.3 software. PROSPERO registration number: CRD42022370444.</p> Results <p>Thirty-three RCTs included 15,961 patients The experimental groups involved six JAK inhibitors (filgotinib, tofacitinib, decernotinib, baricitinib, upadacitinib and peficitinib) and 12 interventions (different doses of the six JAK inhibitors), and the control group involved adalimumab (ADA) and placebo. Compared with placebo, all JAK inhibitors showed a significant increase in efficacy measures (ACR20/50/70). Compared with ADA, only tofacitinib, low-dose decernotinib, and high-dose peficitinib showed a significant increase in ACR20/50/70. Decernotinib ranked first in the SUCRA ranking of ACR20/50/70. In terms of safety indicators, only those differences between low-dose filgotinib and high-dose upadacitinib, low-dose tofacitinib and high-dose upadacitinib were statistically significant. Low-dose filgotinib ranked first in the SUCRA ranking with adverse events as safety indicators. Only the efficacy and safety of tofacitinib ranked higher among different SUCRA rankings.</p> Conclusion <p>Six JAK inhibitors have better efficacy than placebo. The superior efficacy of decernotinib and safety of low-dose filgotinib can be found in the SUCRA. However, there are no significant differences in safety between the different JAK inhibitors. Head-to-head trials, directly comparing one against each other, are required to provide more certain evidence.</p>","author":"Bingjia Qu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"84e4ffff98bcb321e1fcc7afec90977278a5002ff811c39ab7aa088baf9a35c6","category":"Interdisciplinary"}