{"title":"Global Wetland Methane Emissions From 2001 to 2020: Magnitude, Dynamics and Controls","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004794?af=R","date":1725692400000,"content":"<h2>Abstract</h2>\n<p>The large uncertainties in estimating CH<sub>4</sub> emissions from wetland ecosystems, the leading natural source to the atmosphere, substantially hinder the quantification of the global CH<sub>4</sub> budget. This study used the IBIS-CH<sub>4</sub> (Integrated BIosphere Simulator-Methane) model, a process-based model integrating microbial mechanisms associated with CH<sub>4</sub> production and oxidation processes, to simulate global wetland CH<sub>4</sub> emissions from 2001 to 2020. Initially, we employed the IBIS-CH<sub>4</sub> model to evaluate its performance across 26 diverse wetland sites worldwide. The results showed that the magnitude and seasonality of observed CH<sub>4</sub> fluxes over various wetland sites were well reproduced. We then used this model to estimate the annual global wetland CH<sub>4</sub> emissions from 2001 to 2020, averaging 152.67 Tg CH<sub>4</sub> yr<sup>−1</sup>, with a range of 135.72–167.57 Tg CH<sub>4</sub> yr<sup>−1</sup>. The estimated global wetland CH<sub>4</sub> emissions are generally in agreement with the current bottom-up estimates (117–256 Tg CH<sub>4</sub> yr<sup>−1</sup>) and closely overlap with independent top-down estimates (139–183 Tg CH<sub>4</sub> yr<sup>−1</sup>). During 2001–2020, the estimated global wetland CH<sub>4</sub> emissions initially showed an increasing trend, followed by a decline. The peak of CH<sub>4</sub> emissions reached in 2010, coinciding with the peak of wetland area. The majority of global wetland CH<sub>4</sub> emissions were concentrated in tropical regions, which exhibited a clear seasonality and had a peak in July. The impact of meteorological factors on wetland CH<sub>4</sub> emissions was greater than that of leaf area index, indicating the importance of soil hydrothermal conditions on wetland CH<sub>4</sub> emissions.</p>","author":"Han Xiao, \nChaoqing Song, \nShihua Li, \nXiao Lu, \nMinqi Liang, \nXiaosheng Xia, \nWenping Yuan","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"84e51a2b12d219e58f0ac64cb841d92219f88dc578da3a0c40035c35b67b9a70","category":"Environment"}