{"title":"Compartmental Description of the Cosmological Baryonic Matter Cycle. I. Competition of Spontaneous Star Formation, Stellar Feedback and Stellar Evolution","link":"https://www.preprints.org/manuscript/202408.1138/v1","date":1723711362000,"content":"Context: The compartmental description, well-known from the description of infection diseases and epidemics, is applied to describe the temporal evolution of the baryonic matter in interstellar gas and stars. The introduction of gaseous and stellar fractions of the total baryonic matter as the basic dynamical variables is advantageous because it allows to apply the description to a variety of astrophysical systems.  Aims: The competition of spontaneous star formation, stellar feedback and stellar evolution is theoretically investigated to understand the baryonic matter cycle including luminous baryonic matter in main-sequence stars and weakly luminous matter in white dwarfs, neutron stars and black holes (referred to as locked-in matter). Of particular interest is the understanding of the cosmic star formation history and the present-day gas fraction with compartmental models. Methods: For stationary rates of spontaneous star formation, continuous stellar feedback and stellar evolution exact analytical solutions of the time evolution of the fractions of gaseous, luminous stellar and locked-in stellar matter are derived. The accuracy of the analytical solutions is proven by the favorite comparison with the exact numerical solutions of the dynamical equations. Results: The observed cosmological star formation rate and the integrated stellar density as a function of redshift are reasonably well explained by the compartmental model without triggered star formation by the competition of spontaneous star formation and stellar evolution whereas the influence of stellar feedback is less important. The action of stellar evolution provides a significant redshift dependent reduction factor when calculating the integrated stellar density from the star formation rate. Without stellar evolution the observations cannot be reproduced very well. Then the fits to the observation allow us conclusions on the relative importance of spontaneous star formation, stellar evolution and feedback in the early universe after the recombination era until today. The gas, luminous star and locked-in stellar matter fractions indicate that the vast majority of the baryons in the present-day universe resides in the form of locked-in stellar matter in white dwarfs, neutron stars and black holes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"84f124d9be99612ec9873ef400fe9a6eca4dd60c0e569e5893d8adf65c7adbde","category":"Interdisciplinary"}