{"title":"Effectiveness of Individualized Oral Hygiene Education in Preventing Dental Diseases: A Clinical Study","link":"https://www.preprints.org/manuscript/202405.1991/v1","date":1717049632000,"content":"Background Gingivitis can develop without mechanical cleaning within three weeks. The first clinical sign is bleeding on positive probing. The accumulation of dental biofilm generates an inflammatory gingival response. In the past decade, attention has focused mainly on the interproximal areas and the use of customsized interproximal toothbrushes.The aim of the study was to evaluate the effectiveness of individualized oral hygiene education and its role in dental prevention among patients with dental problems. Methods Before treatment, patients were clinically and radiologically examined, full mouth plaque score (FMPS), full mouth bleeding score (FMBS), and bleeding on brushing (BOB) were recorded, and matrix-metalloproteinase-8 (MMP-8) was measured by using a chair-side MMP-8 measuring system. Patients in group A had gingivitis, but no periodontal damage and patients in group B had periodontal damage. Patients in both groups A and B were identified in to four subgroups based on their toothbrushing habits and the oral health education they received. The three months after initial examination, each patient was examined three more times (2, 4 and 12 weeks later). Results It was concluded that subjects in groups A1 and B1 showed significant reduction in BOB, MMP-8, FMBS and FMPS levels after two weeks. Solo Prophylaxis (A1and B1) remained as a well-constructed protocol with hte complete resolution of interdental inflammation after two weeks. Other subgroups achieved significant reductions only after 12 weeks. Conclusions BOB and MMP-8 are valuable complements in preventive dentistry, and are able to detect potential pathological processes in interproximal spaces. The clinical relevance of BOB, in addition to FMBS, FMPS and gingival inflammation can be demonstrated to patients, which may increase compliance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"84f8589d9e426aacb1e4bf32ec55570b65c14340e7ee097c72b656080c19022f","category":"Interdisciplinary"}