{"title":"The genomic signatures of evolutionary stasis","link":"https://academic.oup.com/evolut/article/78/5/821/7615529?rss=1","date":1709510400000,"content":"<span><div>Abstract</div>Evolutionary stasis characterizes lineages that seldom speciate and show little phenotypic change over long stretches of geological time. Although lineages that appear to exhibit evolutionary stasis are often called living fossils, no single mechanism is thought to be responsible for their slow rates of morphological evolution and low species diversity. Some analyses of molecular evolutionary rates in a handful of living fossil lineages have indicated that these clades exhibit slow rates of genomic change. Here, we investigate mechanisms of evolutionary stasis using a dataset of 1,105 exons for 481 vertebrate species. We demonstrate that two ancient clades of ray-finned fishes classically called living fossils, gars and sturgeons, exhibit the lowest rates of molecular substitution in protein-coding genes among all jawed vertebrates. Comparably low rates of evolution are observed at fourfold degenerate sites in gars and sturgeons, implying a mechanism of stasis decoupled from selection that we speculate is linked to a highly effective DNA repair apparatus. We show that two gar species last sharing common ancestry over 100 million years ago produce morphologically intermediate and fertile hybrids in the wild. This makes gars the oldest naturally hybridizing divergence among eukaryotes and supports a theoretical prediction that slow rates of nucleotide substitution across the genome slow the accumulation of genetic incompatibilities, enabling hybridization across deeply divergent lineages and slowing the rate of speciation over geological timescales. Our results help establish molecular stasis as a barrier to speciation and phenotypic innovation and provide a mechanism to explain the low species diversity in living fossil lineages.</span>","author":"","siteTitle":"Evolution Current Issue","siteHash":"a2040112c8b98efe6d76767c53ee42b7ea8ce26086ad99269623cfcce66a3405","entryHash":"84f9205aa30f3a8daf1c8c23274760891dd8aa67b3f5f63ce4d18f63ed37efbb","category":"Environment"}