{"title":"Strava Expands 3rd Party App Developer Program","link":"https://www.dcrainmaker.com/2023/04/strava-expands-3rd-party-app-developer-program.html","date":1682604300000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/04/PartnerHub-ShareImage.jpg\"><img width=\"720\" height=\"450\" title=\"PartnerHub-ShareImage\" alt=\"PartnerHub-ShareImage\" src=\"https://media.dcrainmaker.com/images/2023/04/PartnerHub-ShareImage_thumb.jpg\" /></a></p>\n<p>Strava has <a href=\"https://communityhub.strava.com/t5/strava-insider-journal/introducing-strava-s-updated-developer-program/ba-p/9061\">announced an</a> “updated developer program”, which is the program that some 85,000 developers and apps use to leverage platform via its API (application programming interface). Unquestionably, in the sports world – there’s no online platform that’s had as successful a developer program as Strava. At least in terms of total uptake/connectivity.</p>\n<p>And while there are countless cool apps for Strava these days, there’s also been countless challenges for apps on Strava. Mainly, when apps get successful – they tend to basically get strangled by their own success. They hit API rate limits, lack of any support from Strava, and a host of other growing pains. Sure, if your name is Garmin, Whoop, Oura, or Peloton (and even VeloViewer) – you had a point of contact to help loosen the compression socks. But for everyone else? Frankly, they just gave up.</p>\n<p>So when Strava publishes a post titled “Updated Developer Program”, most (rightfully) assume the worst. Generally speaking, any time any company titles something simply as “Updated” – it means you’re about to lose something (especially for airline frequent flyer programs).</p>\n<p>However, this time around, at least according to Strava, nobody is losing anything. In fact, those smaller apps that were getting strangled will now in theory feel a different kind of love: Dedicated partner account managers, and potentially increased rate limits.</p>\n<p>To begin, here’s <a href=\"https://communityhub.strava.com/t5/strava-insider-journal/introducing-strava-s-updated-developer-program/ba-p/9061\">the letter Strava published</a>, written by Mateo Ortega. He has long been ‘the guy’ when it came to the developer program and partnerships. These days he’s moved up in the world slightly and got fancy headshots and all. Though, I can attest still has just as many watches and bike computers on every ride as I do. Anyways, here’s what he said:</p>\n<blockquote>\n<p>“More than 10 years ago, I joined Strava to help bolster the app’s core functionality, such as mobile GPS recording (still new at the time) and much more. As we grew, my role evolved as we shifted our focus to our external API. A deeper investment in our developer ecosystem enabled us to evolve our services and establish a model where connecting to Strava was indispensable to growth, especially for tracking apps. As a result, today, we have over 85,000+ applications in our connected ecosystem, including partners like Garmin, Oura, Peloton, Zwift, Whoop, VeloViewer, and many more. Over a decade later, I am proud to have collaborated with an incredible team to transform Strava into the unifying platform for all GPS devices, workout and fitness apps, and other tools serving our global community of active people.</p>\n<p>Of course, none of these milestones would have been possible without you – the developers building the amazing apps that connect to our API. Not much has changed since we set on our mission to put Strava at the center of connected fitness, which is why today, I am excited to introduce you to our updated developer program.</p>\n<p>With over 100M athletes in 190 countries worldwide, we know the opportunity to build on Strava’s API is more lucrative than ever. For this reason, we’ve redesigned our program to provide you with the tools, support, and knowledge you’ll need as you build and grow your app. This means you’ll have better communication with developer support and partner managers to help you innovate and ideate on paths to growth here on Strava.</p>\n<p>Overall, this process unlocks more opportunities for app owners to connect the active people on our platform with the motivation that keeps them moving.</p>\n<p>Here’s what you can expect in the coming months as we begin our program updates:</p>\n<ul>\n<li>If you have an app currently connected to our external API, you can expect an email from our team outlining what comes next. We’ll ask app owners to submit a new application for review to help us determine the appropriate level of support to provide based on your needs. You will have 6 months to submit your app for review, and once approved, you’ll be set for the year.\n</li><li>For those interested in building on our API – welcome! Please contact our team at <a>developers@strava.com</a> to begin your application process and get introduced to our API and updated program.\n</li><li>Finally, we’ve updated our homepage. Find us at <a href=\"https://www.strava.com/developers\">strava.com/developers</a> to stay up-to-date with updates, news, and more.</li>\n</ul>\n<p>We’re proud to have over 85,000 of you – developers, organizations, and apps on our API. We know that by optimizing the ways we work together, we can better reward your innovation and growth by connecting your app to the largest community of athletes in the world.”</p>\n</blockquote>\n<p>Now, admittedly, this is all a bit fuzzy. So basically, what’s actually happening is a bit more like those airline frequent flyer programs I mentioned earlier. Each year Strava is going to be looking at apps to see how/if they’ve grown. If an app has grown enough (with growth here basically a function of how many users are using the Strava API via their app), they’ll likely qualify for a dedicated partner account manager. In other words, someone that can look after their issues and get things untangled, alongside dedicated support channels. Dedicated partner account managers are super common in the tech world (and beyond) as a way to ensure that high-profile apps/platforms don’t have a single point of contact in case something comes up.</p>\n<p>In addition, these apps will also have a more streamlined process to get rate limit upgrades. Currently, numerous apps run into Strava API rate limits, and there just hasn’t been a way for most of those apps to contact anyone at Strava (meaningfully) to get a response. Setting aside why how frustrating that’s been for many apps to date, hopefully this will begin to resolve that.</p>\n<p>Ultimately, we’ll have to see how this all goes. I’m optimistic these are steps in the right direction – but at the same time, as I said above, anytime a company uses the words ‘Updated’ in the title of an e-mail/header, it causes concern. However, at the present, Strava says that for apps that don’t meet whatever the threshold is for the new special tier, there won’t be any changes for them – a literal same-same.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"85049ae8598b073ab852e4382060170de70e885779950a29803f0994aa55a3de","category":"Cycling"}