{"title":"PSXIII-4 Evaluation of an in-pasture weighing system to measure body weight change of growing cattle grazing wheat pasture","link":"https://academic.oup.com/jas/article/102/Supplement_3/615/7757809?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>In winter 2023-2024, 65 stocker cattle grazed wheat pasture at the Southern Plains Experimental Range near Fort Supply, Oklahoma. Cattle had access to two in-pasture weighing system (IpWS, SmartScale, C-Lock) units placed at the water trough. Except for occasional standing water following precipitation, the only accessible water source was through the IpWS. Initial squeeze chute body weights (SCBW) were collected following ~16 h fast without feed or water. Full SCBW were collected without overnight fast every 28 d thereafter. Animals place their front feet onto the IpWS platform to drink water (ad libitum) and the front of the animal is weighed with an adjustment factor to convert the value to whole body weight (BW). The objective was to compare the two cattle weighing methods for growing cattle grazing wheat (<span>Triticum aestivum</span>) pasture. There were two cattle types and initial SCBW was 6 beef steers (BS, BW = 249.6 ± 14.4 kg), 6 beef heifers (BH, BW = 252.7 ± 7.3 kg), 26 beef-dairy cross steers (BDS, BW = 129.4.2 ± 18.7 kg), and 27 beef-dairy cross heifers (BDH, BW = 131.0 ± 10.3 kg). We fit a linear model to IpWS weight data as a function of day-of-study, sex, and type with a random animal effect. We estimated BW on the SCW d from the model and compared the IpWS and SCBW values. We used limits-of-agreement analysis to compare methods by date. A positive bias indicates IpWS BW are greater than SCBW and negative bias means IpWS BW &lt; SCBW. In general, IpWS BW overestimated SCBW with biases of 5.2 ± 1.0 kg, 13.4 ± 0.8 kg, 17.2 ± 1.0 kg, and 10.2 ± 1.1 kg on d 0, 28, 56, and 84, respectively. The biases were occasionally affected by cattle type or sex. On d 0, bias was greater for larger beef cattle than for smaller beef-dairy cross cattle (13.7 vs. 3.3 kg, respectively, <span>P</span> = 0.004). On d 56, bias depended on sex with a 22.3 kg bias for steers vs. a 16.2 kg bias for heifers (<span>P</span> = 0.049). On d 28 and 84, biases did not depend on sex or type. Over the 84-d period, BW gain was biased (5.03 ± 1.27 kg). Similarly, average daily BW gain was biased (0.06 ± 0.12 kg/d). The cattle type affected bias for BW gain (beef type = -2.13 kg and beef-dairy cross type = 6.69 kg) and average daily BW gain (beef type = 0.03 and beef-dairy cross type = 0.08 kg/d, <span>P</span> = 0.005). These results indicate that adjustments are likely needed to convert front BW from an IpWS to whole BW and to remove BW bias.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"85058f2b56add8564144494e3b010590e49effb784179b6325df174691b5875f","category":"Environment"}