{"title":"Corporate Sustainability Strategies and Performance of Manufacturing Firms: A Visionary Leadership among Industry Managers in Kano, Nigeria","link":"https://www.preprints.org/manuscript/202406.1453/v1","date":1718889349000,"content":"Manufacturing firms need to streamline their initiatives in line with 17 sustainable development goals (SDGs) 2030 as a means for improving performance. This research adapts SDG’s goals 8 decent job and economic growth’ as a measure of performance, in examine the effect of corporate sustainability strategies on performance of manufacturing firms. Census sampling technique was used in cross sectional survey of 900 multi-industry managers from one hundred and fifty (150) manufacturing firms in Kano, Nigeria. A five Likert scale, well-structured questionnaire was used in collecting data, analysed by Structural Equation Modelling SEM PLS Package. The study shows positive and significant effect of eco-efficiency, and positive and insignificant effect of both legitimation and risk mitigation strategies on performance respectively. The study concluded that the positive and significant effects of eco efficiency initiatives could be due to benefits derived from total quality management system, energy monitoring, and process safety management reflected in sustainability oriented visionary leadership of the managers. The positive and insignificant effects of legitimation initiatives could be as a result of huge spending on sustainability reporting, and corruption. The positive and insignificant effect of risk mitigation could be due to pro-activeness of the firms’ managers in tackling risk through sustainability oriented visionary leadership. The study recommended firms should adopt conservative eco-efficiency initiatives for improving performance and stop adopting extroverted legitimation and introverted risk mitigation strategies as both have no significant effect on performance. Future researchers should use longitudinal research design using financial metrics adopting the same independent variables in other economic sectors.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"850d248ffb8d2db08125cdce0f82e76e4131b67aaaa28a291500fbaf3ab6c43a","category":"Interdisciplinary"}