{"title":"Changing disturbance regimes, material legacies, and stabilizing feedbacks: Dead coral skeletons impair key recovery processes following coral bleaching","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17504?af=R","date":1726477255000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1b32ac65-8c78-479d-b869-ba92612469ff/gcb17504-toc-0001-m.png\" alt=\"Changing disturbance regimes, material legacies, and stabilizing feedbacks: Dead coral skeletons impair key recovery processes following coral bleaching\" />\n<p>Ecological disturbance regimes are changing, and as a result, this is creating different physical environments in which ecosystem recovery now occurs. On coral reefs, marine heat waves that cause coral bleaching are an increasingly common form of disturbance, in addition to tropical storms which were historically the main disturbance type. We found that the structurally complex dead coral skeletons left after marine heat waves (right panel), compared with the relatively structureless landscapes left after tropical storms (left panel), break down important ecological processes that are tied to coral reef resilience and ultimately undermine the replenishment of coral populations.</p>\n<br />\n<h2>Abstract</h2>\n<p>Ecosystem responses to disturbance depend on the nature of the perturbation and the ecological legacies left behind, making it critical to understand how climate-driven changes in disturbance regimes modify resilience properties of ecosystems. For coral reefs, recent increases in severe marine heat waves now co-occur with powerful storms, the historic agent of disturbance. While storms kill coral and remove their skeletons, heat waves bleach and kill corals but leave their skeletons intact. Here, we explored how the material legacy of dead coral skeletons modifies two key ecological processes that underpin coral reef resilience: the ability of herbivores to control macroalgae (spatial competitors of corals), and the replenishment of new coral colonies. Our findings, grounded by a major bleaching event at our long-term study locale, revealed that the presence of structurally complex dead skeletons reduced grazing on turf algae by ~80%. For macroalgae, browsing was reduced by &gt;40% on less preferred (unpalatable) taxa, but only by ~10% on more preferred taxa. This enabled unpalatable macroalgae to reach ~45% cover in 2 years. By contrast, herbivores prevented macroalgae from becoming established on adjacent reefs that lacked skeletons. Manipulation of unpalatable macroalgae revealed that the cover reached after 1 year (~20%) reduced recruitment of corals by 50%. The effect of skeletons on juvenile coral growth was contingent on the timing of settlement relative to the disturbance. If corals settled directly after bleaching (before macroalgae colonized), dead skeletons enhanced colony growth by 34%, but this benefit was lost if corals colonized dead skeletons a year after the disturbance once macroalgae had proliferated. These findings underscore how a material legacy from a changing disturbance regime can alter ecosystem resilience properties by disrupting key trophic and competitive interactions that shape post-disturbance community dynamics.</p>","author":"Kai L. Kopecky, \nSally J. Holbrook, \nEmalia Partlow, \nMadeline Cunningham, \nRussell J. Schmitt","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"850fa8fdae02d868449f5c400b4a9db88d179107a29ca31d8d83a1d7797f08c8","category":"Environment"}