{"title":"HCP expands IAM enterprise capabilities by introducing groups","link":"https://www.hashicorp.com/blog/hcp-expands-iam-enterprise-capabilities-by-introducing-groups","date":1697698800000,"content":"<p>As customers scale their usage of the HashiCorp Cloud Platform (HCP), more complex identity and access management (IAM) problems can emerge. User onboarding, management of role-based access control (RBAC), and auditing are just a few of the areas that need to scale with user-management processes.  </p>\n\n<p>Security best practices emphasize the importance of rigorously adhering to the <a href=\"https://csrc.nist.gov/glossary/term/least_privilege\">principle of least privilege </a>by clearly defining roles based on job function. At HashiCorp, we want to help organizations enforce regular reviews of roles and their associated permissions so they have more control over their users’ access. In pursuit of this objective, we released a feature called <em>HCP groups</em>, which offers organizations a centralized role-management interface within the HCP console.</p>\n\n<p>It’s now easier than ever for organizations to group user identities and assign roles and projects to them. HCP groups bear many similarities to RBAC, where roles represent a set of permissions and responsibilities relevant to a specific job or function within your organization. For example, roles might include \"project admin\", \"project contributor\", \"administrator\", and so on, each with its own set of permissions. This capability can make user management faster and more robust, paving the way for tighter integration with identity-management processes.</p>\n\n<h1>What are HCP groups?</h1>\n\n<p><em>Groups</em> are an identity principle that lets administrators bundle user identities and treat them as a single unit that can receive role assignments and project associations. This enables more efficient and logical user management along with clearer permissions auditing.</p>\n\n<p>Each group can have one or more user members, and a group can then be associated with one or more projects. Groups can also have a different role assignment for different associated projects.</p>\n\n<p>For example, you may have an application engineering group with five members. Using HCP groups, you can give the application engineering group admin role permissions for a development project, contributor role permissions for a QA project, and view-only role permissions for a production project, as shown here: </p>\n<img src=\"https://www.datocms-assets.com/2885/1697744261-hcpgroups.png\" alt=\"HCP\" /><h1>How to get started with HCP groups</h1>\n\n<p>Groups can be managed within the organization's “Access control (IAM)” settings section of the portal. To get started, follow these seven steps:</p>\n\n<ol>\n<li>Log into the HCP portal, navigate to the top of the page and click on your organization.</li>\n<li>Inside of the organization dashboard, you’ll see a menu item called “Access control (IAM)” which you can click to view a list of all users.</li>\n<li>In the menu, click “Groups”. Then click the button “Create group”.</li>\n<li>Add users to the newly created group.</li>\n<li>Navigate back to your project dashboard and click on “Access Control (IAM)” for your project.</li>\n<li>Then click on “Groups” under “Access Control (IAM)” and then click the “Add groups” button. </li>\n<li>Select the group and assign the group role. You can choose between “Project admin”, “Project contributor”, or “Project viewer”. Then click “Add Groups” to apply the role to that group.</li>\n</ol>\n\n<p>When thinking about role permissions, keep in mind that HCP chooses the most elevated role when resolving multiple roles assigned to a user via groups and at the organization level.</p>\n\n<p>You can find more information and step-by-step instructions in the <a href=\"https://developer.hashicorp.com/hcp/docs/hcp/admin/iam/groups\">HCP groups documentation</a>.  </p>\n\n<p>(Note: If you are interested in using identity groupings that already exist in your identity provider for HCP, HashiCorp would like to help with your particular use case. Please use this brief <a href=\"https://hashicorp.sjc1.qualtrics.com/jfe/form/SV_bOElUPCdFXaQOfr\">form</a> to let us know about your interest.) </p>\n\n<h1>Next steps with HCP groups</h1>\n\n<p>HCP groups represents a significant enhancement to HCP’s IAM capabilities. A streamlined approach to role management and user access control through groups helps organizations improve security, efficiency, and compliance with best practices. </p>\n\n<p>For more information and to get started with the HashiCorp Cloud Platform, please visit the <a href=\"https://www.hashicorp.com/cloud\">HCP product page</a> or <a href=\"https://portal.cloud.hashicorp.com/sign-up\">sign up through the HCP portal</a>.</p>\n","author":"Trevor Powell","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"8513ba71a0879abf72ec4d1da4ead709e344ff9e5d96402667e641cabe260460","category":"Tech"}