{"title":"New Jersey approves two 1 Gigawatt+ offshore wind projects","link":"https://arstechnica.com/?p=1777578","date":1625155125000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1232861430-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1232861430.jpg\">Enlarge</a> <span>/</span> New Jersey hopes to be the home of scenes like this, where French workers are building the foundations for offshore wind turbines. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/construction-cranes-and-concrete-gravity-based-foundations-news-photo/1232861430?adppopup=true\">Bloomberg/Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>By the end of the decade, New Jersey's beaches are set to have a view of something other than crashing waves. The state is pushing for aggressive development of offshore wind, having already approved a 1.1 GW wind farm. Yesterday, the state more than doubled its planned projects, reaching agreements that will let two additional 1 GW+ wind farms go into the waters off the southern portion of the state.</p>\n<p>Perhaps as significant in the long run, both projects include an agreement that will see critical components of the wind farm assembled in a New Jersey port that the state is promoting as a hub for future offshore wind developments.</p>\n<h2>A multinational effort</h2>\n<p>The earlier agreement New Jersey put into place was for a project called <a href=\"https://oceanwind.com\">Ocean Wind</a>, a joint project between the state's major utility, PSE&amp;G, and the Danish energy developer Ørsted, a major player in offshore wind. One of the projects approved yesterday is Ocean Wind II, which plans for another 1.1 GW of capacity supplied by using GE's Halide X turbines. These projects will be sited to the east of Cape May, the southernmost part of the state.</p></div><p><a href=\"https://arstechnica.com/?p=1777578#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777578&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"851829550f14c1cd7a8d3b74734f72902be1aa96517afba174ce085b2a6a485c","category":"Tech"}