{"title":"Prolonged CBD Pressure Mediates Higher Expression of flgA in Salmonella typhimurium","link":"https://www.preprints.org/manuscript/202405.1927/v1","date":1716961083000,"content":"Salmonella Typhimurium is a typical Gram-Negative bacterium associated with food-borne illness threatening public health. This pathogen is reported to have caused millions of infections and thousands of hospitalizations yearly in the United States alone. Salmonella Typhimurium has a sophisticated array of virulent factors, including its flagella, which contributes significantly to its pathogenicity. Cannabidiol (CBD), the non-psychoactive component of the cannabis plant, has attracted the interest of many researchers recently because of its antimicrobial properties. With the growing interest in exploring CBD’s antimicrobial properties, we, in this study, have delved into unravelling how prolonged exposure of Salmonella Typhimurium to CBD influences the expression of the flgA gene. We hypothesized that the exposure of Salmonella Typhimurium to CBD may result in flgA upregulation, causing the bacteria to withstand various stresses and potentially enhance its survival rates and pathogenicity. We have employed several assays, such as mRNA expression, motility assays, pH induction assays, nutrient starvation interventions, and biofilm analysis, to explore the influence of CBD on the pathophysiology of Salmonella Typhimurium. Our findings reveal that CBD-resistant strains exhibit enhanced resilience to extreme pH levels and motility and survive poorly under nutrient starvation, with more robust biofilm formation compared to the susceptible strains. The results contribute to the broader comprehension of CBD resistance mechanisms in bacteria. This work provides insight into the potential therapeutic interventions for controlling CBD-resistant bacterial infections. This study also underscores the essence of exploring novel alternative antimicrobial agents to tackle the ever-persistence of bacterial antibiotic resistance.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"85199766725c8d8d5dc73a9cf8c9b119821a6757568ece178ae5987773a2430e","category":"Interdisciplinary"}