{"title":"5 tips for cycling into a headwind","link":"https://www.cyclist.co.uk/tutorials/how-to-cycle-in-headwinds","date":1706029209000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/tutorials/how-to-cycle-in-headwinds\">5 tips for cycling into a headwind</a></p>\n\n<p>Cycling into a hardcore headwind can be like trying haul your bike up a particularly tough <a href=\"https://www.cyclist.co.uk/tutorials/top-10-tips-to-improve-your-climbing\" target=\"_blank\">climb</a>. With your brakes on. Not only will it quickly drain all the fun out of a ride, but also all the energy from your legs. So how do you beat the blustery stuff when you have to ride straight into it?</p>\n\n\n\n<h2>1. <span>Plan ahead</span></h2>\n\n\n\n<p>Check the weather forecast before any ride to give yourself the best possible chance of understanding what you’re heading out into. Perhaps heading out into a headwind on the way out and enjoying a tailwind on the way back is a good idea? It’s also worth investing in a good <a href=\"https://www.cyclist.co.uk/buying-guides/best-cycling-apps-for-iphone-and-android\" target=\"_blank\">smartphone app</a> (the Met Office app is good) which will be able to feed you up-to-date information while you’re on the move. </p>\n\n\n\n<p>Many modern <a href=\"https://www.cyclist.co.uk/buying-guides/best-bike-computers-gps-computers-for-training-navigation-and-data\" target=\"_blank\">cycling computers</a> will give you weather on your handlebars when they’re linked up to a smartphone in your pocket. </p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/how-to-get-stronger-legs-for-cycling\">How to get stronger legs for cycling</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/how-to-ride-in-crosswinds\">How to ride in crosswinds</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/in-depth-how-to-become-more-aero\">In depth: How to become more aero</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/how-to-keep-cycling-through-winter\">Cycling in winter: Top tips for riding outside in the cold months</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/tutorials/improve-cycling-climbing\">10 tips to improve your climbing</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2><span>2. Keep spinning</span></h2>\n\n\n<div>\n<figure><img width=\"1200\" height=\"900\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited.jpg\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited.jpg 1200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited-300x225.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited-970x728.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited-768x576.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited-750x563.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2024/01/aero_vs_lightweight_12-edited-1140x855.jpg 1140w\" /><figcaption></figcaption></figure></div>\n\n\n<p>Most modern road bikes are built to be as aero as possible but that doesn’t mean your machine will do all the work for you in a headwind. When you’re cycling, you should look to spend as much time as possible turning the pedals in as <a href=\"https://www.cyclist.co.uk/in-depth/how-to-pedal-road-bike\" target=\"_blank\">smooth and steady a cadence</a> as you can.</p>\n\n\n\n<p>Elegance is the order of the day – or <i>souplesse</i>, as the French call it – but it’s not just about looking good. It’s about efficiency of energy. Headwinds are similar to climbs in the respect that you’re required to put in greater effort. So it pays to drop down a gear to maintain a smooth, fluid, pedalling style. Yes, this could mean riding a little slower temporarily, but it’s worth remembering that just because you can’t see it, that headwind still presents a significant and ongoing obstacle.  </p>\n\n\n\n<h2><span>3. Use your head</span></h2>\n\n\n\n<p>It sounds corny but staying positive is the key to overcoming any obstacle, whether that be on a bike or off of it, and headwinds are no exception. </p>\n\n\n\n<p>As we said at the top, if you know a headwind is unavoidable on your route somewhere, tackle it early when not only will you be physically more capable of coping with it, but you can also keep yourself going with the thought of a nice tailwind to see you back on the same stretch on the way home. </p>\n\n\n\n<p>As you cycle into that headwind too, remember the words of Winston Churchill: if you’re going through hell, keep going! By which we mean don’t stop and let the enormity of the task overwhelm you, instead break it down into small, achievable victories, whether it’s reaching the next lamppost, that parked car, or the weeping cyclist at the roadside who has found it all too much. Ultimately, though, embrace the challenge. Tests like this are part of what makes cycling worthwhile. It’s not supposed to be easy, remember, it’s supposed to push you beyond both your horizons and your limits. So enjoy!</p>\n\n\n\n<h2>4. What to do in a group</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2017/03/07085105/dhb_group_photo-970x647.jpg\" alt=\"dhb_group_photo\" /><figcaption></figcaption></figure>\n\n\n\n<p>The easiest way to deal with headwinds is teamwork. <a href=\"https://www.cyclist.co.uk/news/peloton-drafting-even-more-efficient-than-we-first-thought-new-study-finds\" target=\"_blank\">Riding in a group</a> will, as long you’re sitting on someone’s wheel rather than leading from the front, save you between 20% and 30% effort and therefore your energy. </p>\n\n\n\n<p>Of course, not taking your turn at the front when group riding is about as heinous a crime as it’s possible to commit as a cyclist, so make a point of doing your fair share of the work. That said, the bigger the group you’re riding in, the less time you’ll have to spend out front exposed to the elements and the longer the break you’ll be able to enjoy while riding in the bunch. </p>\n\n\n\n<p>So do your bit on point, and then take shelter back in the pack, where you’ll need to stay approximately six inches behind the wheel of the rider in front of you to maximise their slipstream. Don’t get any closer than that and do ride slightly to one side of them – left or right – to avoid touching wheels and causing a pile-up. And hey, never overlap wheels if you can avoid it, either. </p>\n\n\n\n<h2>5. <span>What to do when riding alone</span></h2>\n\n\n\n<p>Of course, many of us <a href=\"https://www.cyclist.co.uk/in-depth/why-cycling-solo-is-better-than-group-rides\" target=\"_blank\">ride solo</a>, but that doesn’t mean to say you can’t do something about headwinds. There are a few strategies you can employ when you haven’t got the protection of a group while out on the bike, and most of these revolve around changes you can make to you and your riding style. Bike manufacturers can play with aerodynamic marginal gains all they want, but ultimately by far the biggest surface area presented to wind resistance comes from the rider, not the bike – in fact, it’s 80% rider and 20% bike on average. </p>\n\n\n\n<p>So just as you do when you’re getting down over the bars for a sprint, make sure that your upper body presents the smallest possible target for the headwind to play havoc with. That means not only getting low but tucking your elbows in too, which will help both with <a href=\"https://www.cyclist.co.uk/in-depth/how-to-win-against-the-wind\" target=\"_blank\">aerodynamics</a> and control of the bike. Of course, spending an excessive amount of time down low can leave you with a super-sore back and is another reason to invest in a bespoke bike fit to discover the best position for your seat and bars. </p>\n\n\n\n<p>Reduce the resistance your outfit creates too, by opting to wear the most figure-hugging clothing you feel comfortable in. Jackets and gilets can be good for keeping the rain out but they can also billow out if too big, turning them into sails and your ride into a real drag. If you’re wearing more comfortable-fitting clobber, tuck in any flaps, and do up any zips to ensure you’re as streamlined as possible.</p>\n\n\n\n<p><em>Turned the corner? Find out <a href=\"https://www.cyclist.co.uk/tutorials/how-to-ride-in-crosswinds\" target=\"_blank\">how to cycle in crosswinds</a>.</em></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/tutorials/how-to-cycle-in-headwinds\">5 tips for cycling into a headwind</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"jcunningham","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"851c277b75d7ebe1f4befeb3de44b8cae73947debbf80286c6e8726ea023e167","category":"Cycling"}