{"title":"Quantitative comparison of 2D and 3D monitoring dimensions in fish behavior analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15633?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>To improve the accuracy and efficiency of fish behavior assessment, this paper focuses on quantitatively exploring the variations and relationships between different monitoring dimensions. A systematic comparison was conducted between 3D and 2D behavioral factors using an infrared tracing system, during both day and night. Significant differences in swimming distance were observed among the different monitoring methods, as determined by two-way ANOVA and Tukey's test. A correction was applied to account for the disparities observed in 2D swimming distance, ensuring accurate measurements. These findings present a cost-effective and efficient approach for obtaining precise 3D distance data. Additionally, a kinematic factor called the “number of U-turns” was proposed to provide a more intuitive characterization of directional changes in fish swimming. Significant differences were observed between 2D and 3D data, with higher percentages of false U-turn counts and missing U-turn counts compared to correct counts in the 2D view. These findings suggest that reducing the monitoring dimension may impact the accurate estimation of swimming motion, potentially resulting in inaccurate outcomes. Finally, the statistical analyses of the non-linear properties of fractal dimension revealed significant differences among the various monitoring methods. This conclusion has practical implications for biologists and physicists, enabling them to improve the accuracy of behavioral phenotyping for organisms exhibiting 3D motion.</p>","author":"Kai Lin, \nShiyu Zhang, \nJunjie Hu, \nXingdong Lv, \nHongsong Li","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"851cbe06a47c96463ce0489f531945b028c292d8eeb7753d3caf386484bb0ab6","category":"Environment"}