{"title":"Trophic regulation of soil microbial biomass under nitrogen enrichment: A global meta‐analysis","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14510?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/bd0268f2-6b36-4135-99d2-53556c3d0bdd/fec14510-toc-0001-m.png\" alt=\"Trophic regulation of soil microbial biomass under nitrogen enrichment: A global meta-analysis\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/17/trophic-regulation-of-soil-microbial-biomass-under-nitrogen-enrichment-a-global-meta-analysis/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEutrophication, including nitrogen (N) enrichment, can affect soil microbial communities through changes in trophic interactions. However, a knowledge gap still exists about how plant resources (‘bottom-up effects’) and microbial predators (‘top-down effects’) regulate the impacts of N enrichment on microbial biomass at the global scale.\n\nTo address this knowledge gap, we conducted a global meta-analysis using 2885 paired observations from 217 publications to evaluate the regulatory effects of plant biomass and soil nematodes on soil microbial biomass under N enrichment across terrestrial ecosystems.\n\nWe found that the effects of N enrichment on soil microbial biomass varied strongly across ecosystems. N enrichment decreased the soil microbial biomass of natural grasslands and forests due to soil acidification and the subsequent losses of predatory and microbivorous nematodes stimulating microbial growth. By contrast, N enrichment increased the microbial biomass of managed croplands mainly via increasing plant biomass production. Across diverse ecosystems, the short-term N enrichment (experimental duration ≤5 years) could reduce microbial biomass via decreasing nematode abundance, whereas the long-term N enrichment (experimental duration &gt;5 years) mainly promoted microbial biomass via increasing plant biomass.\n\nThese findings highlight the critical roles of microbial predators and plant input in shaping microbial responses to N enrichment, which are highly dependent on ecosystem type and the period of N enrichment. Earth system models that predict soil microbial biomass and their linkages to soil functioning should consider the variations in plant biomass and soil nematodes under future scenarios of N deposition.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/17/trophic-regulation-of-soil-microbial-biomass-under-nitrogen-enrichment-a-global-meta-analysis/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Wen Xing, \nXinli Chen, \nMadhav P. Thakur, \nPaul Kardol, \nXiaoming Lu, \nYongfei Bai","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"8540b22436e4a82dd78579278e55811f64d48ff7bfdc1c5e8aaa468e4be8f17b","category":"Environment"}