{"title":"Apple already working full-time on sequel to Vision Pro","link":"https://www.macworld.com/article/2098332/apple-working-full-time-sequel-vision-pro.html","date":1696858110000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We’re all still waiting for Apple to launch its much-anticipated <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro</a> mixed-reality headset, with the company cagey on release timings beyond a vague “early next year.” (And that’s just for the U.S.; the rest of the world don’t yet know for sure that we’ll get Vision Pro at all.) But a new report indicates that Apple is already well into development of subsequent entries in the series, having long since finished the hardware for the first model.</p>\n\n\n\n<p>In the latest edition of his <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-10-08/apple-plans-smaller-lighter-vision-headset-meta-works-on-cheaper-quest-3-ar-lnhh1ulx&amp;xcust=1-1-2098332-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On newsletter</a>, Bloomberg reporter Mark Gurman discusses at some length the state of play in Cupertino’s mixed-reality department. “The [first-gen Vision Pro] hardware itself has been ready to go for months,” he surprisingly claims, “letting the Vision Products Group—the team behind the device—move on to next-generation models.”</p>\n\n\n\n<p>We’ve known, of course, that Vision Pro is at least nominally finished, given that journalists were allowed to <a href=\"https://www.macworld.com/article/1944516/apple-vision-pro-hands-on-feaures-design-fit.html\">try it out</a> back in June. But it’s been widely assumed that some form of development carried on following the soft launch, since otherwise why would the company delay the launch until 2024? The idea that the team has washed their hands of the first-gen model is counterintuitive, to say the least, but presumably it’s the rest of the ecosystem that needs work before Apple feels comfortable selling handsets to the public. Perhaps Apple is still corralling third-party app developers, or managing the development of accessories.</p>\n\n\n\n<p>Based on Gurman’s report, in fact, it sounds like Apple is far more interested in subsequent Vision products than in the initial one, which pundits have warned is unlikely to sell in commercially significant numbers. He reiterates that a cheaper version of the handset is viewed as a priority (Vision Pro’s $3,500 price tag is likely to prove a stumbling block for mainstream buyers; a lower-cost Vision or Vision One model has been touted since the summer) but adds that bulk and user-friendliness for glasses wearers are also important considerations. An exclusively AR-focused pair of glasses has been pushed back following setbacks earlier in the cycle, but Gurman thinks Apple will return to that idea at some point in the future.</p>\n\n\n\n<p>It’s understandable, of course, for Apple to be thinking long-term, given the flaws, high price, and intimidating barriers to entry of the first Vision Pro handset. Mixed reality, the company hopes, will eventually replace the iPhone as its premier platform, but that isn’t going to happen overnight. Still, it’s hard to escape the conclusion that looking beyond the first launch will make skeptical buyers even less likely to take the plunge on a product that not even its own maker is taking seriously.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8545f6ab8319d8b857b48bf1d1fb4fc6d7aef90d642c8c6aa61f16ea368d8f9b","category":"Apple"}