{"title":"When enough is enough: Introducing sufficiency corridors to put techno-economism in its place","link":"http://link.springer.com/10.1007/s13280-024-02027-2","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Today's ecological crises are entwined with inequality dynamics, yet prevailing techno-economic approaches in climate research and policy fall short in addressing the ecological crisis as distributional crisis. Recognising the limitations of techno-economism, focused on markets (price adjustments) and technology (efficiency gains), this contribution introduces sufficiency corridors as a concept, research field, and policy approach. Sufficiency corridors represent the space between a floor of meeting needs and a ceiling of ungeneralisable excess, i.e. within the sufficiency corridor everyone has enough (to satisfy needs) while no one has too much (to endanger planetary boundaries and need satisfaction). Establishing such corridors entails a process over time that continuously narrows the gap between floors and ceilings, lifting the former and pushing down the latter by strengthening forms of consumption and production that contribute to need satisfaction while shrinking those that do not. The article discusses the profound implications of this approach for how societal reality is reproduced and/or changed, highlighting the need for decisions that eliminate options between and within sectors and in the realms of consumption and production. After addressing questions of decision-making and the potential to realise corridors, the contribution concludes that the growing scientific consensus to <em>complement</em> techno-economic approaches with sufficiency measures remains inadequate. Instead, the possibility of a transformation by design hinges on embedding techno-economism within and subordinating it to a sufficiency framework.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"854e555a17ce36e08326c9ad87b66ae90663fdf5dbd12c3fdc4ae681e863abe1","category":"Environment"}