{"title":"Stakeholder engagement in participatory research in French marine and freshwater social‐ecological systems: A systematic map protocol","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12304?af=R","date":1706067206000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/768b6b37-e0c8-4f07-b45c-9df1f450f7a5/eso312304-toc-0001-m.png\" alt=\"Stakeholder engagement in participatory research in French marine and freshwater social-ecological systems: A systematic map protocol\" />\n<p>We propose a systematic map of the literature on stakeholder engagement (SkE) in research on aquatic social-ecological systems carried out on French European and overseas territories, in order to draw up the first comprehensive overview of how SkE has developed and changed since 1945. Image credit: Élise Banton.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nStakeholder engagement (SkE) in research is currently experiencing significant growth within the fields of environmental and sustainability sciences. Stakeholder engagement ensures the relevance of research questions to societal expectations and the uptake and salience of the co-produced knowledge and results for their use in the decision-making process.\n\nIn a context of societal challenges regarding biodiversity conservation and the sustainability of marine and freshwater social-ecological systems (SESs), participatory approaches constitute key methods in applied research involving actions and decision-making. There are, however, many gaps in the practical, conceptual and ethical ways stakeholders have been involved in research.\n\nWe propose here a systematic map of the literature on SkE in research on marine and aquatic SESs carried out on French European and overseas territories, in order to draw up the first comprehensive overview of how SkE has developed and changed since 1945.\n\nThis systematic map will identify a representative list of scientific articles on SkE in French marine and freshwater social-ecological research. The literature search will include both academic literature (e.g. peer-reviewed articles, reviews, meta-analyses) and grey literature (e.g. reports, working papers) using the most relevant search engines for the scientific literature published between 1945 and 2023. Retrieved publications will be reviewed for relevance according to a predefined set of eligibility/ineligibility criteria by a group of trained reviewers. The eligibility check will be done in two successive screening steps: (1) title and abstract and (2) full text, each independently performed by two reviewers. All retained literature will be subjected to coding and metadata extraction using the Sysrev platform. No validity assessment will be undertaken. A database of the metadata extracted will be provided, along with a narrative description of the evidence base, and a set of figures and tables summarizing the relevant characteristics of the studies.\n\nThis systematic map will provide a reliable overview of SkE conducted in research projects on French aquatic social-ecological systems to strengthen the science–society relationship and help future research projects implement efficient and sustainable SkE processes in France and elsewhere.\n</p>","author":"Adrien Chevallier, \nHeikel Balti, \nSophie Gourguet, \nClaire Macher, \nYunne‐Jai Shin, \nFabien Moullec","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"8558f0333e3d72cbef664ec3962844434790079c49f8c0c86c13d650567cb58d","category":"Environment"}