{"title":"Apple Reports 4Q 2021 Results: $20.6B Profit on $83.4B Revenue","link":"https://www.macrumors.com/2021/10/28/apple-4q-2021-earnings/","date":1635453552000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2021/10/apple-reports-fourth-quarter-results/\">announced</a> financial results for the fourth fiscal quarter of 2021, which corresponds to the third calendar quarter of the year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/aapl-4q21-line.jpg\" />\r\n<br />\r\nFor the quarter, Apple posted revenue of $83.4 billion and net quarterly profit of $20.6 billion, or $1.24 per diluted share, compared to revenue of $64.7 billion and net quarterly profit of $12.7 billion, or $0.73 per diluted share, in the <a href=\"https://www.macrumors.com/2020/10/29/apple-4q-2020-results/\">year-ago quarter</a>.\r\n<br />\r\n\r\n<br />\r\nApple's revenue figure was a September quarter record and Mac and Services both set all-time records, but Apple's performance was only roughly in line with analyst expectations and was almost certainly held back by component shortages that have led to lengthy shipping estimates for many products.\r\n<br />\r\n\r\n<br />\r\nGross margin for the quarter was 42.2 percent, compared to 38.2 percent in the year-ago quarter. Apple also declared a quarterly dividend payment of $0.22 per share, payable on November 11 to shareholders of record as of November 8.\r\n<br />\r\n\r\n<br />\r\nFor the full fiscal year, Apple shattered company records with $365.8 billion in sales and $94.7 billion in net income, up from $274.5 billion in sales and $57.4 billion in net income for fiscal 2020.<blockquote>“This year we launched our most powerful products ever, from M1-powered Macs to an iPhone 13 lineup that is setting a new standard for performance and empowering our customers to create and connect in new ways,” said Tim Cook, Apple’s CEO. “We are infusing our values into everything we make — moving closer to our 2030 goal of being carbon neutral up and down our supply chain and across the lifecycle of our products, and ever advancing our mission to build a more equitable future.”</blockquote>As has been the case for well over a year now, Apple is once again not issuing guidance for the current quarter ending in December.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/aapl-4q21-pie.jpg\" />\r\n<br />\r\nApple will <a href=\"http://www.apple.com/investor/earnings-call/\">provide live streaming</a> of its fiscal Q4 2021 financial results conference call at 2:00 pm Pacific, and <em>MacRumors</em> will update this story with coverage of the conference call highlights.\r\n<br />\r\n\r\n<br />\r\n<b>Conference call recap follows below...</b>\r\n<br />\r\n\r\n<br />\r\n<b>1:23 pm</b>: Apple's stock closed up about 2.5% in regular trading today ahead of the earnings release, part of a broad rise in the stock market.\r\n<br />\r\n\r\n<br />\r\n<b>1:40 pm</b>: With Apple reporting top-line earnings numbers in line with or slightly below analyst expectations, Apple's stock is down about 4.5% in after-hours trading.\r\n<br />\r\n\r\n<br />\r\n<b>1:43 pm</b>: Even with challenges posed by component shortages affecting numerous industries, Apple's revenue at $83.4 billion was easily a September quarter record, eclipsing the $64.7 billion figure from a year ago. Net income similarly set a September quarter record of $20.6 billion, topping the $14.1 billion figure from 2018.\r\n<br />\r\n\r\n<br />\r\n<b>1:46 pm</b>: With fiscal 2021 sales of $365.8 billion, Apple averaged a billion dollars a day for the year. Apple's net income for fiscal 2021 of $94.7 billion topped the previous record of $59.5 billion from fiscal 2018.\r\n<br />\r\n\r\n<br />\r\n<b>2:00 pm</b>: Apple's earnings call with analysts is about to begin.\r\n<br />\r\n\r\n<br />\r\n<b>2:01 pm</b>: The call is beginning with opening remarks regarding forward-looking statements.\r\n<br />\r\n\r\n<br />\r\n<b>2:02 pm</b>: The effects of the Covid-19 pandemic may affect Apple's earnings and predictions.\r\n<br />\r\n\r\n<br />\r\n<b>2:02 pm</b>: <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> is giving his introductory remarks. A year ago, I was talking about the atmosphere in which we were living. Today, much has changed. While we are still living in unprecedented times, we are encouraged by progress around the world.\r\n<br />\r\n\r\n<br />\r\n<b>2:03 pm</b>: We have aimed to help our customers navigate the world as it is, while empowering them to create the world as it can be.\r\n<br />\r\n\r\n<br />\r\n<b>2:03 pm</b>: It is an honor to know that what we make matters, and to see that reflected in the world and in our performance. 33 percent annual growth this year.\r\n<br />\r\n\r\n<br />\r\n<b>2:03 pm</b>: Apple is reporting another very strong quarter. Demand was very robust. New September quarter record, up 29%.\r\n<br />\r\n\r\n<br />\r\n<b>2:04 pm</b>: In-line with expectations from last call, regardless of supply constraints.\r\n<br />\r\n\r\n<br />\r\n<b>2:04 pm</b>: Set record for Mac, quarterly records for numerous other categories. Services performed better than expected.\r\n<br />\r\n\r\n<br />\r\n<b>2:04 pm</b>: 1/3 of revenue in 2021 came from emerging markets.\r\n<br />\r\n\r\n<br />\r\n<b>2:05 pm</b>: Discussing new products introduced in the past year.\r\n<br />\r\n\r\n<br />\r\n<b>2:07 pm</b>: \"We've never had a more diverse range of services for our customers to choose from.\"\r\n<br />\r\n\r\n<br />\r\n<b>2:08 pm</b>: <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> has already proved itself to fans around the world. Congratulating actors, writers, storytellers and producers, and everyone else who has made the success possible. 11 Emmy's won, including outstanding comedy series for Ted Lasso.\r\n<br />\r\n\r\n<br />\r\n<b>2:08 pm</b>: We couldn't be more proud of our entire lineup of content.\r\n<br />\r\n\r\n<br />\r\n<b>2:08 pm</b>: Major updates to Fitness+ including the addition of meditation and pilates.\r\n<br />\r\n\r\n<br />\r\n<b>2:09 pm</b>: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> won JD Power award for customer satisfaction.\r\n<br />\r\n\r\n<br />\r\n<b>2:10 pm</b>: Opened several new Apple Stores, including in China, Turkey, and a new store in the Bronx. There are Apple Stores in all five boroughs of NYC. All Apple Retail Stores have been open for the last seven weeks.\r\n<br />\r\n\r\n<br />\r\n<b>2:12 pm</b>: Tim earlier said that the company lost $6 billion in revenue to supply chain shortages.\r\n<br />\r\n\r\n<br />\r\n<b>2:13 pm</b>: Apple hopes to remove all plastic from its packaging by 2025.\r\n<br />\r\n\r\n<br />\r\n<b>2:13 pm</b>: Have more than doubled the number of suppliers who have committed to become carbon neutral by 2030.\r\n<br />\r\n\r\n<br />\r\n<b>2:13 pm</b>: We've never viewed our environmental work as a side project.\r\n<br />\r\n\r\n<br />\r\n<b>2:14 pm</b>: We feel quite confident that the new year will be driven by the values that define us and the innovation that drives us.\r\n<br />\r\n\r\n<br />\r\n<b>2:14 pm</b>: Apple CFO Luca Maestri coming on now to discuss the quarter.\r\n<br />\r\n\r\n<br />\r\n<b>2:15 pm</b>: New Q4 records in every geographic segment, with double digit growth in all of them.\r\n<br />\r\n\r\n<br />\r\n<b>2:15 pm</b>: For products, revenue was $65.1 billion, up 30% over a year ago. Better than expected demand for products, despite supply constraints estimated at around $6 billion.\r\n<br />\r\n\r\n<br />\r\n<b>2:15 pm</b>: Grew in each product category.\r\n<br />\r\n\r\n<br />\r\n<b>2:16 pm</b>: Services set record of 18.5 billion, up 26% over a year ago. Records in every geographic segment and category. 42.2% gross margin, down 110 basis points from last quarter due to higher costs and product mix, offset by leverage.\r\n<br />\r\n\r\n<br />\r\n<b>2:16 pm</b>: 34.2 percent product margin, down 170 basis points. Services margin was 70.5 percent, up 70 basis points sequentially.\r\n<br />\r\n\r\n<br />\r\n<b>2:17 pm</b>: <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> Revenue was up 47 percent year over year. September quarter record of $38.9 billion despite supply constraints.\r\n<br />\r\n\r\n<br />\r\n<b>2:17 pm</b>: <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> family continued to perform well, and enthusiastic customer response to <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> family.\r\n<br />\r\n\r\n<br />\r\n<b>2:18 pm</b>: September quarter records in developed and emerging markets. ‌iPhone‌ customer sat at 98%. Active install base of iPhones reached an all-time high.\r\n<br />\r\n\r\n<br />\r\n<b>2:18 pm</b>: $9.2 billion revenue record on Mac, driven by strong demand for <a href=\"https://www.macrumors.com/guide/m1/\">M1</a> <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a>. Last 5 quarters have been best 5 quarter ever for the category. <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> performance also strong.\r\n<br />\r\n\r\n<br />\r\n<b>2:19 pm</b>: High levels of customer satisfaction and first time buyers in ‌iPad‌. Half of customers purchasing Mac and ‌iPad‌ were new to the product. Customer sat was 97% for both Mac and ‌iPad‌.\r\n<br />\r\n\r\n<br />\r\n<b>2:19 pm</b>: Now touting enterprise deployment of Apple products.\r\n<br />\r\n\r\n<br />\r\n<b>2:20 pm</b>: All SNCF train drivers in France get iPads to handle their daily duties. 90% of drivers choose to purchase them for personal use at the end of the corporate device refresh cycle.\r\n<br />\r\n\r\n<br />\r\n<b>2:20 pm</b>: $8.8 billion for Home and Accessories.\r\n<br />\r\n\r\n<br />\r\n<b>2:22 pm</b>: Positive momentum on many fronts. Install base continues to grow. Continue to see increased customer engagement with services. Paid accounts grew double digits and reached a new all-time high across all geographic segments. Paid subscriptions, we have more than 745 million paid subscriptions across all services on our platforms. 5x the number of paid subs as 5 years ago. Adding new services that we think our customers will love.\r\n<br />\r\n\r\n<br />\r\n<b>2:22 pm</b>: Fiscal 2021 was not only a big year for services, but our whole company. Business grew by $91 billion. $366 billion of revenue. Every product category and geographic segment set a new annual revenue record, and was up at least 20% over Fiscal 2020\r\n<br />\r\n\r\n<br />\r\n<b>2:23 pm</b>: $191 billion in cash plus marketable securities, $6.5 billion of new debt issues, $1.3 billion retired of term debt. Total debt of $125 billion. $66 billion in net cash.\r\n<br />\r\n\r\n<br />\r\n<b>2:23 pm</b>: Very strong cash flow, returned $24 billion to shareholders in last quarter.\r\n<br />\r\n\r\n<br />\r\n<b>2:25 pm</b>: Outlook for December quarter... given continued uncertainty, we are not providing revenue guidance but are sharing some directional insights. Assumption that covid-related impacts do not worsen. During September quarter, supply constraints impacted revenue by $6 billion. Estimate supply constraints will be larger during December quarter. We are seeing high demands for products and expect to achieve very solid year over year revenue growth. Expect new revenue record for December quarter. Revenue for each category will grow on year over year basis, except for ‌iPad‌ which will decline due to supply constraints.\r\n<br />\r\n\r\n<br />\r\n<b>2:25 pm</b>: Gross margin will be between 41.5 and 42.5 percent. OpEx between 12.4 and 12.6 billion. Tax rate of around 16 percent. Cash dividend of 22 cents per share of stock.\r\n<br />\r\n\r\n<br />\r\n<b>2:25 pm</b>: Opening the call to questions from analysts.\r\n<br />\r\n\r\n<br />\r\n<b>2:27 pm</b>: Q: Can you talk about supply chain issues you saw and how you saw improvements during the quarter? How should we think about what products you expect to see most impacted going forward?<br />\r\n<br />\r\nA: If you look at Q4, we had about $6 billion in supply constraints. It affected the ‌iPhone‌, the ‌iPad‌, and the Mac. We had two causes to this. One was the chip shortages that you've heard a lot about. The second was Covid-related manufacturing disruptions in Southeast Asia. Manufacturing disruptions have improved materially to where we are currently. This quarter, the primary cause of supply chain related shortages will be the chip shortage. It is affecting most of our products currently. But from a demand point of view, demand is very robust. Part of this is that demand also is very strong. We believe that by the time we finish the quarter, the constraints will be larger than the $6 billion that we experienced in Q4.\r\n<br />\r\n\r\n<br />\r\n<b>2:29 pm</b>: Q: You're starting to sell more things buying on a monthly charge. How should we think about portfolio that's available... how much revenue is under recurring nature? Shifting to more bundled sale or offering from consumer standpoint, pay one price every month and get all your Apple devices and services.<br />\r\n<br />\r\nA: First product that sold on monthly basis was ‌iPhone‌. Began in the US shortly after the subsidy world changed markedly. I would say predominantly the mode of buying an ‌iPhone‌ in the US is on a monthly kind of plan today. For the balance of the products, it's still the most popular buying outright. We are seeing more and more demand for monthly payments. So we want to give the customer what they want. You will see us do more and more things like that that will meet the customer and provide the price that they want, in a way that they want to pay for it. I don't know the percentage of products that are sold that way but it is increasing.\r\n<br />\r\n\r\n<br />\r\n<b>2:32 pm</b>: Q: Supply chain disruption getting bigger in December, how do you account for that it's demand getting stored vs going somewhere else? Do you feel comfortable that this peaks in December and then alleviates?<br />\r\n<br />\r\nA: I feel like we've made great progress on Covid disruptions. That happened across October. We're in a materially better position today. Difficult to predict Covid. Not going to predict where it goes. As of today we're in a materially better position than we were in September and the first several weeks of October. In terms of chip shortage, it's happening on legacy nodes, primarily we buy leading-edge nodes and we're not having issues on leading-edge nodes. On legacy, we are competing with many companies on supply and it's difficult to forecast when those things will balance. Will have to know how the economy will be in 2022 and accuracy of everyone else's demand projects. Don't feel comfortable in making a prediction. It would be subject to too much inaccuracy. I feel comfortable with our operational team and I'm sure they're doing everything they can do to collapse cycle times and improve yields and do everything you can do with fundamental capacity investment to remedy the situation.\r\n<br />\r\n\r\n<br />\r\n<b>2:33 pm</b>: Q: What are the puts and takes on gross margin to predict for smaller variance than typical seasonality?<br />\r\n<br />\r\nA: We do get leverage as holiday season, but we also launch a lot of new products. Launched in every product category. Launch new product, we have higher cost structures at the beginning of the cycle. Obviously from a year over year standpoint, it's a significant expansion because when you look at what we did a year ago in the December quarter, 39.8%, this indicates a significant expansion.\r\n<br />\r\n\r\n<br />\r\n<b>2:35 pm</b>: Q: Given supply chain blurring the picture for ‌iPhone 13‌, what data points can you give us to see if demand is tracking product cycle growing or shrinking? Where did you exit the quarter on channel inventory?<br />\r\n<br />\r\nA: Channel inventory as you would expect, ‌iPhone‌ channel inventory ended below the targeted range and is currently below it. That's that. In terms of the blurring of demand, we look at a number of different data points. Demand across online store, demand in retail, we look through to backorders on carrier channels. We look at channel orders as well. We have a number of different data points that we use to conclude how strong demand is. We feel very very good about where demand is right now. Working feverishly on the supply side of that.\r\n<br />\r\n\r\n<br />\r\n<b>2:37 pm</b>: Q: Surveyed 4,000 consumers in the US and China, most value security and privacy of app store, not paying developers directly. How do you balance regulatory push for more choice vs customer wanting an easier system. How do you measure it?<br />\r\n<br />\r\nA: The main thing that we're focused on in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> is to keep our focus on privacy and security. These are the two major tenets that have produced over the year, a very trusted environment where consumers and developers come together and consumers can trust the developers and the apps are who they say they are. Developers get a huge audience to sell their software to. That sort of number one on our list. Everything else is a distant second. What we're doing is workign to explain the decisions that we've made that are key to keeping the privacy and security there. Not have side loading and alternate ways on the ‌iPhone‌ where we're opening up the ‌iPhone‌ to unreviewed apps and gets by the privacy restrictions that we put on the ‌App Store‌. We're very focused in discussing privacy and security of the ‌App Store‌ with regulators and legislators.\r\n<br />\r\n\r\n<br />\r\n<b>2:40 pm</b>: Q: Big picture theoretical, can you give bigger picture on supply chain philosophically, recalibration needed on supply chain philosophy either from partner perspective or regional perspective? How do you think about infrastructure to handle these disruptions?<br />\r\n<br />\r\nA: I don't see a fundamental error that we've made if that's what you're picking at in terms of creating the environment we're in. Pandemic came along, some people in the industry and some outside the industry thought the pandemic would reduce demand. Pulled orders down, things reset and what happened is demand went up. And up more than straight trend would predict. The industry is working through that now. Making it a little overly simplistic, some things like yields and things are happening as well but those things are manageable in the course of time. what we're doing is working with our partners on making sure they have the supply we need and that our demand statements are accurate. And reducing our lead and cycle times so as soon as possible it's in a product and shipping. Helping fab partners increase their yields. Support CHIPS act and investment there, to put more investment in the ground. We're spending some time advocating for the chips act as well.\r\n<br />\r\n\r\n<br />\r\n<b>2:42 pm</b>: Q: Support from carriers has been important... will this continue to drive demand for iPhones or is it transitory?<br />\r\n<br />\r\nA: 5G has provided a once in a decade kind of upgrade potential and it's a multi-year kind of thing. It's not a one-year and done. I think we're motivated there, the carriers are motivated there, we have mutual interests and the customer benefits hugely from getting a new 5G phone that has 5G and a number of other features in it too. Everybody is aligned on purpose. The model that you paint, I wouldn't call it a global model because there are different variations around the world depending on the country but in general I think that the marriage or partnership between Apple and the carrier channel has never been stronger. It's on very solid footing.\r\n<br />\r\n\r\n<br />\r\n<b>2:43 pm</b>: Q: On new app transparency feature, I'm curious. The feedback you've received from advertisers and users, and how it impacted your own ad business, any feedback on that?<br />\r\n<br />\r\nA: Feedback from customers is overwhelmingly positive. Customers appreciate having the option of being tracked or not. Outpouring of customer satisfaction there on customer side, reason we did this is that if you've followed us for a while, we believe that privacy is a basic human right. Believed that for decades, not just in the last year. Historically rolled out more and more features over time to place the decision of whether to share data and what data to share in the hands of the user where we believe it belongs. Don't think it's Apple's role to decide, or a company's role to decide, but the person who owns the data itself. No other motivation there.\r\n<br />\r\n\r\n<br />\r\n<b>2:45 pm</b>: Q: On mobile gaming and ‌App Store‌, governments limit game time... how does that affect your business?<br />\r\n<br />\r\nA: Governments limiting the time on games? It's very difficult to measure. The policy that you're talking about... there's a policy to restrict kids below a certain age to 1 hour on Fri/Sat/Sun each, it's very difficult to see the impact of it on the ‌App Store‌ at this point.\r\n<br />\r\n\r\n<br />\r\n<b>2:46 pm</b>: Q: Comment about strong demand on products... can you give insight on intent on ‌iPhone 13‌ on upgrades from installed base or switchers, compared to ‌iPhone 12‌? Feedback we're seeing is strong switching activity in China.<br />\r\n<br />\r\nA: It's so early to talk about ‌iPhone 13‌ because it's only been less than 30 days. What I can tell you is that going into the cycle, look at results from last quarter, we grew on upgraders and switchers in double digits. Both were very meaningful for the ‌iPhone‌ results last quarter. There's significant momentum in ‌iPhone‌. Demand that we're seeing is robust, as you can see by delivery times on the online store.\r\n<br />\r\n\r\n<br />\r\n<b>2:47 pm</b>: Q: How are you looking to handle component costs and headwinds in the supply chain?<br />\r\n<br />\r\nA: We've put our current thoughts in the gross margin guidance, 41.5 to 42.5. Seeing a significant increase in freight costs. I would assume that that is pretty consistent across different companies. Clearly seeing some inflation there.\r\n<br />\r\n\r\n<br />\r\n<b>2:51 pm</b>: Q: Services revenue, much better than expected, can you give us details about what drove that? More <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a>? Apple 1, TV or Fitness?<br />\r\n<br />\r\nA: 26% growth rate was better than we expected at the beginning of the quarter. Difficult to single out a specific area. Set records on cloud and across the board, ‌AppleCare‌, music, video, advertising, payments, ‌App Store‌. Strong across the board. Services business, we always think about some fundamental factors that allow us to have good visibility over the sustainability of the business. Install base continues to grow so that's a positive. The number of people actually paying on the platform continues to grow double digits so that increases opportunity. Number of subscriptions that we have on the platform. 745 million paid subs right now, an increase of 160 million versus 12 months ago. Obviously the fact that we continue to launch new services and offerings within the services that we already have, new features, that obviously gives us a lot of momentum going forward. We have a very large services business, and very diversified. Our customers seem to really enjoy the experience that they have on the platform.<br />\r\n<br />\r\nQ: Supply headwinds getting worse, how do we think about worse? Delta from $2 billion from 3 months ago that went to $6 billion... or it just gets higher than $6 billion? <br />\r\n<br />\r\nA: On supply constraints, what we're saying is that the nominal amount of supply constraints will be estimated at more than $6 billion. It's important to know that we're getting a lot more supply in Q1 than Q4, because sequential growth is significant. Solid growth year over year. Amount of supply is growing dramatically, but demand is so robust that we envision having suppply constraints for the quarter.\r\n<br />\r\n\r\n<br />\r\n<b>2:52 pm</b>: Q: Question about your ability to recapture sales that you weren't able to fulfill in Q4/Q1 but in Q2. Some experience in that from last year. You did recapture some of that as you went past the holidays, do you think we should expect similar behavior this year? Will all product categories behave similarly?<br />\r\n<br />\r\nA: I think there are some products that people buy as gifts, if it's not there it's perishable. But we have a lot of products as well that people will wait for and would expect those to be captured in a different time period. It's a combination for this certain quarter, the holiday quarter.\r\n<br />\r\n\r\n<br />\r\n<b>2:53 pm</b>: Q: Could you speak to ‌iPhone‌ mix and one of the things we noted that delivery times for iPhones is a bit long because of constraints. Longer on Pro and Max. Is that supply or demand or both and imagine you have better handle on that this year. <br />\r\n<br />\r\nA: Too early to make comments on mix, constrained environment but mix becomes more obvious once supply and demand are balanced.\r\n<br />\r\n\r\n<br />\r\n<b>2:55 pm</b>: Q: Strategy question... when Apple thinks about strategic areas as a company, software, also one of the largest semiconductor comapnies. Curious about input that goes into owning some piece of technology. Survey people, batteries and screens are very important. What pauses Apple from looking at areas like that?<br />\r\n<br />\r\nA: We look at areas where we believe we can make a substantial difference and have a level of differentiation. We've put a lot of energy into the silicon space because we felt we could design and develop products that we could not if we were just buying what was available in the commercial market. More recently we made that call on the Mac as well and have shifted to our own chips there. Depends if we see a way to do something that's differentiated or not. I wouldn't want to rule anything out, but it's more whether or not we see our way clear to doing something that is materially better. We feel like we've done that in the chip area.\r\n<br />\r\n\r\n<br />\r\n<b>2:57 pm</b>: Q: Look at September quarter, services grew faster than product. Margin was down and same for December. But there's a lot of new product launches... would that not go into OpEx and marketing vs cost?<br />\r\n<br />\r\nA: Certainly that we have launch expenses in marketing and advertising, but reality is that we always make our products better which means adding new technology and features. Moving from one generation of products to another, the cost tends to be higher when you make that transition. Some level of margin compression from the transition to a new product. The December quarter is the holiday season, so the percentage of products business that we have in the holiday quarter is higher than what we have in the September quarter for example. Therefore, the services margins are higher than products, there's a mix between products and services business that plays into the gross margin of the company.\r\n<br />\r\n\r\n<br />\r\n<b>2:58 pm</b>: Q: Question about pricing of new products. ‌iPhone 13‌ at slightly lower price than where 12 was launched in China. Help us think through what you think about when deciding that. Is that an action that you could take more broadly in other regions?<br />\r\n<br />\r\nA: We look at a variety of things including our costs, competition, local conditions and exchange rates, and a number of different things. There's no formula for determining. It's done via a level of judgement looking at a number of different data points. We do that region by region. It's something we've always done and it's not something that's new to this year and this cycle.\r\n<br />\r\n\r\n<br />\r\n<b>3:00 pm</b>: Q: Can you share some metrics on new paid services, how do you measure success?<br />\r\n<br />\r\nA: Lots of things internally that we don't share externally. Looking at subs, ARPU, conversions, churn and all the normal things you look at with a subscription business but we're not going to get into sharing those on an individual services basis. Visibility into the aggregate number of subscriptions which Luca covered earlier with 745 million across both Apple-branded and third-party subscriptions. Aggregated view of it instead of at individual service level. You can bet that we're managing it at the individual service level.\r\n<br />\r\n\r\n<br />\r\n<b>3:00 pm</b>: The call has concluded.\r\n<br />\r\n<div>Tag: <a href=\"https://www.macrumors.com/guide/earnings/\">earnings</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/28/apple-4q-2021-earnings/\">Apple Reports 4Q 2021 Results: $20.6B Profit on $83.4B Revenue</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reports-4q-2021-results-20-6b-profit-on-83-4b-revenue.2320345/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0AEyBP9eX_I:zvhO8l7i2Fc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=0AEyBP9eX_I:zvhO8l7i2Fc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/0AEyBP9eX_I\" />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"855abde1950e8f54638f91d10839508cf14729c354491b2193a1f5fbe86750d1","category":"Apple"}