{"title":"Pew, pew, pew! These plants shoot out their seeds like bullets","link":"https://arstechnica.com/?p=1963218","date":1693238914000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Scientists have measured just how fast members of the witch hazel family can shoot their seeds thanks to spring-loaded fruits. </p></div>\n<p>The flowering shrubs known as <a href=\"https://en.wikipedia.org/wiki/Witch-hazel\">witch hazel</a> are perhaps best known for their use in folk medicine and as a natural topical skin ointment. But the seeds are also of interest to biophysicists and engineers because witch hazel capsules can shoot them out at incredibly fast speeds, thanks to a built-in spring-loaded mechanism. Researchers at Duke University have figured out why—contrary to expectations—the seed launch speeds are roughly the same, even though seeds across species can have substantially different masses. They described their results in a <a href=\"https://royalsocietypublishing.org/doi/10.1098/rsif.2023.0234\">new paper</a> published in the Journal of the Royal Society Interface.</p>\n<p>“People ask me all the time, ‘Why are you looking at seed-shooting plants?’” <a href=\"https://today.duke.edu/2023/08/blink-and-youll-miss-these-plants-shooting-their-seeds\">said co-author Justin Jorge</a>, a graduate student at Duke. “It’s the weirdness of their springs. When we think of springy things, we typically think of rubber bands, coils, or archery bows. But in biology, we have all these weird, complex shapes. Perhaps there are some benefits to these shapes that can be used to improve the design of synthetic springs, such as those used in small jumping robots, but first we need to understand how these biological springs work.”</p>\n<p>According to Jorge and his co-author, advisor Sheila Patek, there are countless examples of biological springs in nature spanning a wide range of size scales and functions, including froghoppers, cannonball fungus, and carnivorous bladderwort plant traps—all of which use those mechanisms to launch projectiles. Trap-jaw ants use spring actuation to launch their mandibles to capture prey, while grasshoppers use their springy legs to kick away predators. Both species, as well as the froghopper, can also use the mechanism to launch their bodies. And flowering plants like the witch hazel use spring actuation to launch seeds out of their fruits.</p></div><p><a href=\"https://arstechnica.com/?p=1963218#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1963218&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"855c8c43e937a5152c747627f11da4fd72969438fcc36345cd16f9a8be210c03","category":"Tech"}