{"title":"The iPhone 15 is looking like a budget iPhone 14 Pro with USB-C","link":"https://www.macworld.com/article/1915806/iphone-15-budget-iphone-14-pro-usb-c.html","date":1684149300000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>While we’ve heard a lot about the iPhone 15 Pro and Pro Max lately—from the <a href=\"https://www.macworld.com/article/1811252/iphone-15-supplier-solid-state-buttons-cancelled.html\">buttons</a> to the <a href=\"https://www.macworld.com/article/1532925/a17-bionic-preview-benchmarks-cpu-gpu-ram.html\">chip</a> and the <a href=\"https://www.macworld.com/article/1487037/iphone-15-pro-max-ultra-design-display-camera-price-rumors.html\">camera</a>—rumors about the regular iPhone 15 have been pretty quiet. There might be a reason for that: everything new about it is already in the iPhone 14 Pro.</p>\n\n\n\n<p>The latest rumor comes from analyst Jeff Pu (<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2023/05/14/iphone-15-and-15-plus-48mp-camera/&amp;xcust=1-1-1915806-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">via MacRumors</a>), who claims the non-Pro iPhones will get a 48MP main camera like that on the iPhone 14 Pro. He says the new module will be slightly improved with a new triple-stacked sensor that can capture more light. According to Pu, this new design could possibly result in production delays for the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 and 15 Plus</a>.</p>\n\n\n\n<p>So that’s yet another <a href=\"https://www.macworld.com/article/1070324/iphone-14-pro-review.html\">iPhone 14 Pro</a> feature that’s making its way to the iPhone 15, joining the <a href=\"https://www.macworld.com/article/1069195/iphone-14-pro-dynamic-island-features-apps.html\">Dynamic Island</a>, <a href=\"https://www.macworld.com/article/1073243/a16-processor-cpu-gpu-lpddr5-memory-performance.html\">A16 processor</a>, and LPDDR5 RAM. That basically makes the iPhone 15 a budget iPhone 14 Pro with many of the same features as the current high-end phone. However, it won’t have higher-end display features (ProMotion, always-on) or the “advanced” camera system with telephoto.</p>\n\n\n\n<p>But if you’ve had your eye on an iPhone 14 Pro but didn’t want to pay such a high price tag, the iPhone 15 could be a great alternative. While it’ll still be missing some higher-end components, some of the best features—namely the Dynamic Island and 48MP camera—will likely be available for a couple of hundred bucks less in a few months. It’s a smart strategy. Instead of simply selling last year’s Pro model for less, Apple can rebrand it as a new phone and make it even more attractive to buyers.</p>\n\n\n\n<p>Apple is also expected to <a href=\"https://www.macworld.com/article/1526636/iphone-15s-usb-c-port-charging-data-lightning-mfi.html\">switch to USB-C</a> for its iPhone models this year after a decade of Lightning support. Additionally, it is rumored to get a refined design, slightly slimmer bezels, and some new colors. It’s also possible that Apple <a href=\"https://www.macworld.com/article/1444061/iphone-14-plus-sales-price-cut-rumors.html\">cuts the price</a> of the iPhone 15 Plus after disappointing sales of the $899 handset.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8565c67dbfcfc00b5f2560701dfb4eaf87b2654823964742210c31660886aeb9","category":"Apple"}