{"title":"The role of chloroplast SRP54 domains and its C-terminal tail region in post- and co-translational protein transport in vivo","link":"https://academic.oup.com/jxb/article/75/18/5734/7710890?rss=1","date":1720656000000,"content":"<span><div>Abstract</div>In the chloroplast, the 54 kDa subunit of the signal recognition particle (cpSRP54) is involved in the post-translational transport of the light-harvesting chlorophyll <span>a</span>/<span>b</span>-binding proteins (LHCPs) and the co-translational transport of plastid-encoded subunits of the photosynthetic complexes to the thylakoid membrane. It forms a high-affinity complex with plastid-specific cpSRP43 for post-translational transport, while a ribosome-associated pool coordinates its co-translational function. CpSRP54 constitutes a conserved multidomain protein, comprising a GTPase (NG) and a methionine-rich (M) domain linked by a flexible region. It is further characterized by a plastid-specific C-terminal tail region containing the cpSRP43-binding motif. To characterize the physiological role of the various regions of cpSRP54 in thylakoid membrane protein transport, we generated Arabidopsis cpSRP54 knockout (<span>ffc1-2</span>) lines producing truncated cpSRP54 variants or a GTPase point mutation variant. Phenotypic characterization of the complementation lines demonstrated that the C-terminal tail region of cpSRP54 plays an important role exclusively in post-translational LHCP transport. Furthermore, we show that the GTPase activity of cpSRP54 plays an essential role in the transport pathways for both nuclear as well as plastid-encoded proteins. In addition, our data revealed that plants expressing cpSRP54 without the C-terminal region exhibit a strongly increased accumulation of a photosystem I assembly intermediate.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"85819c1ee9a61cd17651b19eb984adb16450e215922ab55e06fa2b781d389b62","category":"Environment"}