{"title":"Taxonomic, phylogenetic, and functional diversity of mollusk death assemblages in coral reef and seagrass sediments from two shallow gulfs in Western Cuban Archipelago","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303539","date":1715695200000,"content":"<p>by Rosely Peraza-Escarrá, Maickel Armenteros, Raúl Fernández-Garcés, Adolfo Gracia</p>\r\n\r\nMollusk death assemblages are formed by shell remnants deposited in the surficial mixed layer of the seabed. Diversity patterns in tropical marine habitats still are understudied; therefore, we aimed to investigate the taxonomic, phylogenetic, and functional diversity of mollusk death assemblages at regional and local scales in coral reef sands and seagrass meadows. We collected sediment samples at 11 sites within two shallow gulfs in the Northwestern Caribbean Sea and Southeastern Gulf of Mexico. All the shells were counted and identified to species level and classified into biological traits. We identified 7113 individuals belonging to 393 species (290 gastropods, 94 bivalves, and nine scaphopods). Diversity and assemblage structure showed many similarities between gulfs given their geological and biogeographical commonalities. Reef sands had higher richness than seagrasses likely because of a more favorable balance productivity-disturbance. Reef sands were dominated by epifaunal herbivores likely feeding on microphytobenthos and bysally attached bivalves adapted to intense hydrodynamic regime. In seagrass meadows, suspension feeders dominated in exposed sites and chemosynthetic infaunal bivalves dominated where oxygen replenishment was limited. Time averaging of death assemblages was likely in the order of 100 years, with stronger effects in reef sands compared to seagrass meadows. Our research provides evidence of the high taxonomic, phylogenetic, and functional diversity of mollusk death assemblages in tropical coastal sediments as result of the influence of scale-related processes and habitat type. Our study highlights the convenience of including phylogenetic and functional traits, as well as dead shells, for a more complete assessment of mollusk biodiversity.","author":"Rosely Peraza-Escarrá","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8588fef2dc2a2fe7f77fc93df2433122e0a7825cd0ca2189f9d0ec9bdad4221e","category":"Interdisciplinary"}