{"title":"Smart Operation Control of Power and Heat Demands in Active Distribution Grids Leveraging Energy Flexibility","link":"https://www.preprints.org/manuscript/202405.1208/v1","date":1716180538000,"content":"Demand flexibility plays a crucial role in mitigating the intermittency of renewable power sources. This paper focuses on an active distribution grid that incorporates flexible heat and electric demands, specifically Heat Pumps (HPs) and Electric Vehicles (EVs). Additionally, it addresses Photovoltaic (PV) power generation facilities and electrical batteries to enhance demand flexibility. To exploit demand flexibility from both heat and electric demand, along with the integration of PVs and batteries, Control and Communication Mechanisms (CCMs) are formulated. These CCMs integrate demand flexibility into the distribution grids to get economic benefits for private households and at the same time facilitate voltage control. Concerning EVs, the paper discusses voltage-based droop control, scheduled charging, priority charging, and up-/down-power regulation to optimize the charging and discharging operations. For heat demands, the on-off operation of the HPs integrated with Phase Change Material (PCM) storage is optimized to unlock heat-to-power flexibility. The HP controllers aim to ensure as much self-consumption as possible and provide voltage support for the distribution grid while ensuring the thermal comfort of residents. Finally, the developed CCMs are implemented on a small and representative community of active distribution grid with 8 houses using Power Factory software and DigSILENT Simulation Language (DSL). This scalable size of the active distribution network facilitates to carefully study symbiotic interaction among the flexible load, generation, and different houses thoroughly. The simulation results confirm that the integration of flexible demands into the grid using the designed CCMs results in the grid benefiting from stabilized voltage control, especially during peak demand hours.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"858da4d5ac3e094b1625c2041f062d972f877022559a9f1026b3fa8e5389b8de","category":"Interdisciplinary"}