{"title":"Barometric geolocators can reveal unprecedented details about the migratory ecology of small birds","link":"https://academic.oup.com/auk/article/doi/10.1093/ornithology/ukae010/7613790?rss=1","date":1708732800000,"content":"<span><div>ABSTRACT</div>Knowing the location of migratory birds throughout their annual cycle is fundamental for many questions in ornithology. Technological advances have provided several approaches, with increasing miniaturization allowing deployment on smaller and smaller birds. Here, we examine the strengths and limitations of barometric pressure geolocators (pressure tags), which have recently been shown to be extremely effective in tracking small birds (&lt;25 g). The newly developed geolocation by pressure workflow (<span>GeoPressureR</span>) uses a global weather analysis dataset and hidden Markov movement model to reveal locations more accurately or continuously than can be achieved by other available light-weight devices (e.g., light-level geolocators, automated radio telemetry, and archival GPS tags). Additionally, pressure data can provide altitude information and document generally intractable flight behavior, as well as exact migratory phenologies. This new technology can be applied to important unresolved problems such as altitudinal migration, stopover site use, molt migration, vertical airspace use, and drivers of migratory flight initiation, duration, and direction. We provide an example of a pressure tag on a Swainson’s Warbler (<span>Limnothlypis swainsonii</span>) deployed on its breeding territory in Virginia, USA, revealing the complete story of its migration to and from Cuba, including its refined wintering site, stopover sites, and migration routes, all with precise timing. Studies relying on pressure tags are still subject to biases related to recovery of the devices for data extraction, and application to birds that exhibit extensive aerial movements (e.g., swallows and swifts) remains challenging. Widespread deployment of pressure tags could show unprecedented details of bird migration and other aspects of aerial behavior, which could benefit conservation and greatly enrich our understanding of avian movement ecology.</span>","author":"","siteTitle":"Ornithology Current Issue","siteHash":"4b42e15d9ceec568e037973cb16bc8a0448c103c6eaf3f714117d3650f8eefe7","entryHash":"85979b20887f6980e0b981330c9884fb6c54e0b0080cc3cbea8584c28ab18228","category":"Environment"}