{"title":"Corrosion prevention and control using in situ phase layers formation via application of the complexing‐type inhibitors","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300027?af=R","date":1685532204000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b4ce88e9-b8d2-4c31-bb7a-a5719398a04e/appl202300027-gra-0001-m.png\" alt=\"Corrosion prevention and control using in situ phase layers formation via application of the complexing-type inhibitors\" /><p>The inhibitive mechanism of complexing-type inhibitors is due to the deposition of slightly soluble complex compounds of added inhibitor with the metal cations on the metal surface. High stability and low solubility of such complexes are proposed as the basis of a predictive model for the analytical assessment of the ligand protective efficiency.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>A set of organic ligands of different natures has been investigated as complexing-type corrosion inhibitors for the protection of low carbon steel in an acidic medium. The inhibitive mechanism implying the formation of phase protective layers on the metal surface as a result of the complexation process of added organic ligands with the metal cations is being discussed. The results of the investigation of the influence of pH and temperature conditions on the phase layers formation dynamics have been presented. A range of practical aspects of the application of organic ligands as complexing-type inhibitors for the formation of ultrathin coatings have been discussed. The stability constant of the metal–ligand complex and its solubility have been proposed as the basis of a predictive model for analytical assessment of their potential protective efficiency.</p>","author":"Yu. P. Vyshnevska, \nI. V. Brazhnyk","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"859ca0624c858e7bf1b94fcc01ca271c69f201e1cd8365a571a5d211aa11b687","category":"Environment"}