{"title":"Unvaccinated Pippo Pozzato is on oxygen after contracting COVID-19","link":"https://cyclingtips.com/2021/11/unvaccinated-pippo-pozzato-is-on-oxygen-after-contracting-covid-19/","date":1636194808000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/GettyImages-1235989781-650x433.jpg\" /></div><h2>Unvaccinated Pippo Pozzato is on oxygen after contracting COVID-19</h2><p>\n</p><p>Filippo Pozzato, former professional rider turned race organiser, is in hospital with COVID-19 after putting off getting vaccinated.</p>\n\n\n\n<p>“I thought that with my strong body nothing would happen to me,” Pozzato said from his bed in the San Bortolo hospital, Vicenza. “You hear that COVID is nothing, but it’s not true, I couldn’t stand up. And now I’m attached to oxygen. I don’t have a mask yet, but they’ll put it on if I get worse.”</p>\n\n\n\n<p>The 2006 Milan-San Remo winner retired at the end of 2018 after almost two decades of top-tier racing. Since hanging up his wheels, Pozzato has shifted his focus over to race organisation, introducing four one-day events in and around Italy’s Veneto region this October. </p>\n\n\n\n<p>The former rider opted to put off his vaccination until after his new races had been run.</p>\n\n\n\n<p>“The appointment was for 25 October,” Pozzato said. “Why hadn’t I been vaccinated before? Because I have always felt strong, I have been among people who had COVID and nothing had ever happened to me, and because I was always at full speed with racing, and I had decided to do it later. I was an idiot, and I took a good beating.”</p>\n\n\n\n<p>The Veneto Classic took place on Sunday October 17, and six days later, two days before his first vaccination appointment, Pozzato began to feel unwell.</p>\n\n\n\n<p>“On 23 October I started to feel bad,” he said. “A few lines of fever all day, 37 and a half, then 38 [degrees celsius]. I immediately do a swab, it’s COVID. Then [my temperature] was 39 and a half for almost ten days, I was dead.</p>\n\n\n\n<p>“Three days ago, my fever went away, but my oxygen saturation plummeted. I went down to 87[%], then 86. I had oxygen tanks at home, it went to 83, I couldn’t even stand up and they brought me here. I have severe pneumonia. Some said COVID is bulls***, but when you get it you understand that it is not at all. I’ve always been healthy, I’ve never taken anything, but COVID threw me to the ground.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/unvaccinated-pippo-pozzato-is-on-oxygen-after-contracting-covid-19/\">Read More</a>","author":"Kit Nicholson","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"859e7f7ae624c34b2c54c1df60fde31da5e90b3200bec03ebc0d6d1e837ea81c","category":"Cycling"}