{"title":"An integrated approach to investigate surface and root zone salinity from multispectral and microwave remote sensing techniques","link":"http://link.springer.com/10.1007/s13762-024-05513-y","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>Soil salinity at the crops' root zone is a significant environmental issue as it considerably affects agricultural productivity. This study was carried out to demonstrate the combined potential of microwave and multispectral remote sensing data products in identifying the accumulation of soil salinity both on the surface and in the root zone. The research was performed in the Vellore district, Tamil Nadu. The Landsat-8 imageries were employed to assess the soil salinity and moisture at the surface level in the dry and wet seasons using the Diagonal Soil Salinity Index and Modified Diagonal Soil Moisture Stress Index. Further, the soil moisture for the wet season was retrieved from the dielectric measurements of the Sentinel-1 data using Modified Dubois and Topp’s Model. In the present study, Salinity Accumulation Index was proposed by integrating the resultant products of soil moisture and salinity retrieved from multispectral and microwave models. The results revealed that the lower (0.25–0.5) and higher range (0.5–1) of values of the proposed Salinity Accumulation Index were shown adequate statistical significance with in-situ salinity accumulation at the root zone (<em>R</em><sup>2</sup> = − 0.7) and surface level (<em>R</em><sup>2</sup> = 0.8), respectively. The trend analysis of the Normalized Differential Vegetation Index (2000–2019) with the results of Salinity Accumulation Index has demonstrated that a considerable proportion of the total agricultural area in the north-eastern part of the study region was majorly affected by the root zone salinity, while the southwestern part was detected with surface accumulated salinity.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"85a5196d5658d8747397431de62ff71105b6c34ff9cb53034fc37d279a321114","category":"Environment"}