{"title":"How our longitudinal employment patterns might shape our health as we approach middle adulthood—US NLSY79 cohort","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300245","date":1712152800000,"content":"<p>by Wen-Jui Han</p>\r\n\r\nRecent labor market transformations brought on by digital and technological advances, together with the rise of the service economy since the 1980s, have subjected more workers to precarious conditions, such as irregular work hours and low or unpredictable wages, threatening their economic well-being and health. This study advances our understanding of the critical role employment plays in our health by examining how employment patterns throughout our working lives, based on work schedules, may shape our health at age 50, paying particular attention to the moderating role of social position. The National Longitudinal Survey of Youth-1979 (NLSY79), which has collected 30+ years of longitudinal information, was used to examine how employment patterns starting at ages 22 (n ≈ 7,336) might be associated with sleep hours and quality, physical and mental functions, and the likelihood of reporting poor health and depressive symptoms at age 50. Sequence analysis found five dominant employment patterns between ages 22 and 49: “mostly not working” (10%), “early standard hours before transitioning into mostly variable hours” (12%), “early standard hours before transitioning into volatile schedules” (early ST-volatile, 17%), “mostly standard hours with some variable hours” (35%), and “stable standard hours” (26%). The multiple regression analyses indicate that having the “early ST-volatile” schedule pattern between ages 22 and 49 was consistently, significantly associated with the poorest health, including the fewest hours of sleep per day, the lowest sleep quality, the lowest physical and mental functions, and the highest likelihood of reporting poor health and depressive symptoms at age 50. In addition, social position plays a significant role in these adverse health consequences. For example, whereas non-Hispanic White women reported the most hours of sleep and non-Hispanic Black men reported the fewest, the opposite was true for sleep quality. In addition, non-Hispanic Black men with less than a high school education had the highest likelihood of reporting poor health at age 50 if they engaged in an employment pattern of “early ST-volatile” between ages 22 and 49. In comparison, non-Hispanic White men with a college degree or above education had the lowest likelihood of reporting poor health if they engaged in an employment pattern of stable standard hours. This analysis underscores the critical role of employment patterns in shaping our daily routines, which matter to sleep and physical and mental health as we approach middle adulthood. Notably, the groups with relatively disadvantaged social positions are also likely to be subject to nonstandard work schedules, including non-Hispanic Blacks and people with low education; hence, they were more likely than others to shoulder the harmful links between nonstandard work schedules and sleep and health, worsening their probability of maintaining and nurturing their health as they approach middle adulthood.","author":"Wen-Jui Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"85a77d48dd601221972e7d4cb7e66fc26784225af10d7ddcf3cfa04a14cf82da","category":"Interdisciplinary"}