{"title":"322 Nutrient transport across gastrointestinal tissues using Ussing chambers","link":"https://academic.oup.com/jas/article/102/Supplement_3/133/7757343?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>One of the principal roles of the gut is the absorption of nutrients to meet animal needs. While in vivo measures such as total tract digestibility indicate the totality of the nutrients that disappear, these methods provide no information on the digestion, site, flux, and mechanism of nutrient absorption. Nutrient absorption is a complex set of transport pathways including passive diffusion, facilitated transport, ion exchange, active transport, and secondary active transport that is driven by electrochemical gradients. To tease apart the complexities of nutrient transport at different sites along the gastrointestinal tract, Ussing chambers have been a useful tool. Two ex vivo chambers, filled with oxygenated physiological buffer, and separated by epithelial tissue allow for the detection of nutrient flux, transepithelial currents, and/or membrane permeability. Historically, detection of the nutrient of interest was achieved using radio-labelled or fluorescent tracers. Beyond detecting flux (uptake, efflux, net flux), Ussing chambers can also tease apart the complex network of transport pathways that govern nutrient absorption. Isolating specific transport pathways can be broad spectrum inhibitors, and alterations to the physiological buffers to target transport pathways of interest. Altering the electrical gradient using a voltage clamp for instance, can be used to neutralize, inhibit, or promote, the electrical gradient; such alterations can be especially useful for charged nutrients. Inhibitors, meanwhile, inhibit the activity of entire families of proteins, useful for when the role of specific protein transporters is of interest. Alterations to buffer composition, such as bicarbonate-free buffer solutions or the inclusion and exclusion of compounds with similar size and charge, can isolate transport solely dependent on that solute or provide knowledge on the solutes that may share a common transport mechanism. Together, these modulations allow for a powerful tool to study the presence or absence of nutrient transport and has been crucial in establishing absorption kinetics of ionic nutrients (e.g., Na<sup>+</sup>, Cl<sup>-</sup>), small organic nutrients (e.g., short chain fatty acids, glucose), and macromolecules (e.g., immunoglobulins). Done in conjunction with other techniques, Ussing chambers can offer strong insight to improve our understanding of nutrient absorption and epithelial physiology of the gut. This presentation will discuss the methods key to successful use of Ussing chambers, alongside with their limitations and ways to augment data generated by Ussing chambers.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"85a8b90ea736496e9b1414a501e13f674d4ab95fa7d1ec830e07aa71eb220952","category":"Environment"}