{"title":"Increased crossing of thermal stress thresholds of vegetation under global warming","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17406?af=R","date":1720594800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/69f14443-b2f6-4327-af03-bd480b32a98a/gcb17406-toc-0001-m.png\" alt=\"Increased crossing of thermal stress thresholds of vegetation under global warming\" />\n<p>This study utilizes concurrent temperature records and satellite-based vegetation productivity data to show that vegetation productivity experiences rapid suppression, reaching maximum suppression when confronted with temperature anomalies exceeding 1.45 standard deviations (SDs) and 2.98 SDs above the mean growing-season temperature, respectively. In a future medium emission scenario, temperatures are projected to routinely surpass both of these critical thresholds by approximately the years 2050 and 2070, respectively. Keeping global warming to 1.5°C instead of 2°C above preindustrial levels can create 13% more safe areas for vegetation, protecting them from harmful extreme high temperatures.</p>\n<br />\n<h2>Abstract</h2>\n<p>Temperature extremes exert a significant influence on terrestrial ecosystems, but the precise levels at which these extremes trigger adverse shifts in vegetation productivity have remained elusive. In this study, we have derived two critical thresholds, using standard deviations (SDs) of growing-season temperature and satellite-based vegetation productivity as key indicators. Our findings reveal that, on average, vegetation productivity experiences rapid suppression when confronted with temperature anomalies exceeding 1.45 SD above the mean temperature during 2001–2018. Furthermore, at temperatures exceeding 2.98 SD above the mean, we observe the maximum level of suppression, particularly in response to the most extreme high-temperature events. When Earth System Models are driven by a future medium emission scenario, they project that mean temperatures will routinely surpass both of these critical thresholds by approximately the years 2050 and 2070, respectively. However, it is important to note that the timing of these threshold crossings exhibits spatial variation and will appear much earlier in tropical regions. Our finding highlights that restricting global warming to just 1.5°C can increase safe areas for vegetation growth by 13% compared to allowing warming to reach 2°C above preindustrial levels. This mitigation strategy helps avoid exposure to detrimental extreme temperatures that breach these thresholds. Our study underscores the pivotal role of climate mitigation policies in fostering the sustainable development of terrestrial ecosystems in a warming world.</p>","author":"Xiangyi Li, \nChris Huntingford, \nKai Wang, \nJiangpeng Cui, \nHao Xu, \nFei Kan, \nNazhakaiti Anniwaer, \nHui Yang, \nJosep Peñuelas, \nShilong Piao","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"85aa0571fb44132255e3b0bbce84f359a221800e50f7cd3ecfbba3cface8ee09","category":"Environment"}