{"title":"Apple Highlights How the App Store Prevents Fraud Amid Legal Battle With Epic Games","link":"https://www.macrumors.com/2021/05/11/apple-highlights-app-store-antifraud-efforts/","date":1620752404000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2021/05/app-store-stopped-over-1-5-billion-in-suspect-transactions-in-2020/\">announced</a> that, through a combination of automated technologies and human review processes, the company protected customers from more than $1.5 billion in potentially fraudulent transactions in 2020.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/app-store-blue-banner.jpg\" />\r\n<br />\r\nApple said secure payment technologies like Apple Pay and StoreKit (In-App Purchase) play an essential role in keeping users safe:<blockquote>With online data breaches frustratingly common, these protections are an essential part of keeping users safe. But users may not realize that when their credit card information is breached or stolen from another source, fraudsters may turn to online marketplaces like the App Store to attempt to purchase digital goods and services that can be laundered or used for illicit purposes.\r\n<br />\r\n\r\n<br />\r\nApple focuses relentlessly on this kind of fraud as well. In 2020 alone, the fusion of sophisticated technology and human review prevented more than 3 million stolen cards from being used to purchase stolen goods and services, and banned nearly 1 million accounts from transacting again. In total, Apple protected users from more than $1.5 billion in potentially fraudulent transactions in 2020.</blockquote>Apple shared a variety of additional statistics that aim to emphasize the security and privacy of the App Store, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">amid a high-profile trial with Fortnite creator Epic Games</a>, which has described the App Store as a monopoly and anti-competitive. Apple said thanks to its \"industry-leading antifraud efforts,\" the App Store is \"the safest place to find and download apps,\" citing Nokia's 2020 Threat Intelligence Report.\r\n<br />\r\n\r\n<br />\r\n<h3>Key Statistics</h3><ul><li>In 2020, Apple protected customers from more than $1.5 billion in potentially fraudulent transactions.</li>\r\n<br />\r\n<li>In 2020, nearly 1 million problematic new apps, and an additional nearly 1 million app updates, were rejected or removed from the App Store.</li>\r\n<br />\r\n<li>In 2020, more than 48,000 apps were rejected for containing hidden or undocumented features, and more than 150,000 apps were rejected because they were found to be spam, copycats, or misleading to users.</li>\r\n<br />\r\n<li>In 2020, about 95,000 apps were removed from the App Store for fraudulent violations, predominantly for bait-and-switch maneuvers.</li>\r\n<br />\r\n<li>In 2020, over 215,000 apps were rejected for privacy violations.</li>\r\n<br />\r\n<li>Apple terminated 470,000 developer accounts in 2020 and rejected an additional 205,000 developer enrollments over fraud concerns.</li>\r\n<br />\r\n<li>In the last month, Apple blocked more than 3.2 million instances of apps distributed illicitly through the Apple Developer Enterprise Program.</li></ul>Apple said its goal is always to get new apps onto the App Store, with the company's App Review team assisting more than 180,000 new developers in launching apps in 2020. In some cases, an app might be unfinished or not functioning properly when it's submitted for approval, or it might not yet have a sufficient mechanism for moderating user-generated content. In 2020, nearly one million problematic new apps, and an additional nearly one million app updates, were rejected or removed for a range of reasons like those, according to Apple.\r\n<br />\r\n\r\n<br />\r\nA smaller but significant subset of these rejections were for more egregious violations that could harm users. In 2020, Apple said its App Review team rejected more than 48,000 apps for containing hidden or undocumented features, while more than 150,000 apps were rejected because they were found to be spam, copycats, or misleading to users in ways such as manipulating them into making a purchase.\r\n<br />\r\n\r\n<br />\r\nSome developers perform a \"bait and switch\" by fundamentally changing how the app works after the review process to evade the App Store Review Guidelines, according to Apple. When such apps are discovered, Apple said they are rejected or removed immediately from the App Store, and developers are notified of a 14-day appeals process before their Apple Developer Program accounts are permanently terminated.\r\n<br />\r\n\r\n<br />\r\nIn 2020, about 95,000 apps were removed from the App Store for fraudulent violations, including bait-and-switch maneuvers, according to Apple.\r\n<br />\r\n\r\n<br />\r\nApple said it terminated 470,000 developer accounts in 2020, and rejected an additional 205,000 developer enrollments over fraud concerns. The company also deactivated 244 million customer accounts due to fraudulent and abusive activity.\r\n<br />\r\n\r\n<br />\r\nAs for App Store reviews and ratings, Apple said it relies on a combination of machine learning, artificial intelligence, and human review by expert teams to moderate these ratings and reviews to help ensure accuracy. Since 2020, Apple said it has processed over one billion ratings and over 100 million reviews, and over 250 million ratings and reviews were removed for not meeting moderation standards.\r\n<br />\r\n\r\n<br />\r\nApple said it also recently deployed new moderation tools to verify rating and review account authenticity, to analyze written reviews for signs of fraud, and to ensure that content from deactivated accounts is removed.\r\n<br />\r\n\r\n<br />\r\nDuring its trial against Epic Games, Apple has argued that a single, curated App Store is necessary to protect the security, privacy, reliability, and quality that customers have come to expect from the company. Epic Games, meanwhile, has argued that Apple should allow third-party app stores and direct payment options on the iPhone and iPad.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/11/apple-highlights-app-store-antifraud-efforts/\">Apple Highlights How the App Store Prevents Fraud Amid Legal Battle With Epic Games</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-highlights-how-the-app-store-prevents-fraud-amid-legal-battle-with-epic-games.2295739/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=yAhgwrvL4WA:EGa5G7kFvGM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=yAhgwrvL4WA:EGa5G7kFvGM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/yAhgwrvL4WA\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"85b29e1da9b87aecaef32491303243bd910249c1ef7686e1ac7f7161a21563a2","category":"Apple"}