{"title":"Logging-Based Petrophysical Estimation for Tight Sandy-Mud Reservoirs Employing a Geologically Regularized Learning System","link":"http://link.springer.com/10.1007/s11053-023-10289-y","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Ensuring accurate characterization of petroleum-bearing reservoirs is fundamental for successful exploration of hydrocarbon resources. Petrophysical models have been employed as solvers for quantitative evaluations of porosity, permeability, water saturation, and brittleness index. However, due to the high costs of well drilling, the core data obtained from limited wells are generally insufficient. Thus, most petrophysical models are generally impractical because of their unreliable employing coefficients determined statistically from insufficient core data. From the mathematical perspective, the popular petrophysical models reveal that porosity, permeability, water saturation, and brittleness index exhibit nonlinear fitting relationships with well logs. Thereby, the specific characteristics can be determined using a logging-based fitting. Light gradient boosting machine (LightGBM), a state-of-the-art regression technique, exhibits good performance. However, its performance depends on the support of favorable input and parametric optimization. To address this, continuous restricted Boltzmann machine (CRBM) and Bayesian optimization (Bayes) were integrated in this study, resulting in the proposed CRBM–Bayes–LightGBM framework. CRBM enhanced the input value by extracting significant features, while Bayes carried out the optimal initialization of hyperparameters of LightGBM. To comprehensively evaluate the proposed predictor, four experiments utilizing a dataset obtained from the tight sandstone reservoirs of the Ordos Basin were conducted. For further validation, five well-known regression models, including three-layer neural network, k-nearest neighbors, support vector regression, random forest, and extreme gradient boosting, were employed as competing models. An in-depth and comprehensive analysis of the experimental results yielded five key points: (1) The integration of CRBM and Bayes significantly enhanced the prediction performance of LightGBM; importantly, with the addition of geological regularization to mitigate the negative impact of mudstone during modeling, the fitting precision was further enhanced. (2) Compared to the five competing models, LightGBM-cored predictor yielded smaller fitting errors, establishing it as the best choice for petrophysical characterization. (3) LightGBM-cored predictor exhibited better generalization when trained using a larger dataset. (4) The application of transfer learning addressed the issue of under fitting in petrophysical characterization. (5) The proposed predictor demonstrated more robustness, as missing values in the training dataset do not hinder its feasibility.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"85b231a921c1a86f031fb9d213f6620ae75c8c3c1225c339eda8ec74495dd071","category":"Environment"}