{"title":"Tour de France teams and riders: complete startlist for the 2021 race","link":"https://www.bikeradar.com/news/tour-de-france-startlist/","date":1624554000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/08/20200827TDF0023-A.S.O.-Alex-Broadway-14c1018.jpg?quality=45&amp;resize=620,413\" />                                            <p>With a startlist littered with <a href=\"https://www.bikeradar.com/events/tour-de-france/\" target=\"_blank\">Tour de France</a> icons and some of pro cycling’s best up-and-coming stars, the world’s biggest cycling race will certainly be living up to its billing once again.</p>\n<p>Chris Froome and Vicenzo Nibali share 11 Grand Tour wins between them, while defending champion Tadej Pogacar and fellow Slovenian Primoz Roglic represent some of the new era of potential greats on show.</p>\n<p>Among the sprinters it is a similar story – Mark Cavendish and Andre Greipel have won 70 Grand Tour stages between them, but Caleb Ewan will be looking to add to his tally.</p>\n<p>Peter Sagan, as ever, will be among the <a href=\"https://www.bikeradar.com/features/tour-de-france-jersey-colours/\" target=\"_blank\">green jersey</a> contenders but Ewan will be keen to provide competition and Tour debutant Mathieu van der Poel is a <em>rouleur </em>with a reputation showing no sign of slowing.</p>\n<p>Of the 184 riders on the startlist, 33 will be flying the home flag and there are 27 nationalities represented in total – with ten Brits and one Irishman among them.</p>\n<p>You can find the full list of riders for the 2021 Tour de France below, but first here’s a quick look at the top contenders for this year’s <em>maillot jaune</em>.</p>\n<section><div>\n        <h2>Tour de France 2021 favourites</h2>\n<ul><li><span>Tadej Pogacar (UAE-Team Emirates)</span></li>\n<li><span>Primoz Roglic (Team Jumbo-Visma)</span></li>\n<li><span>Geraint Thomas (INEOS Grenadiers)</span></li>\n<li><span>Richard Carapaz (INEOS Grenadiers)</span></li>\n<li><span>Miguel Angel Lopez (Movistar Team)</span></li>\n<li><span>Richie Porte (INEOS Grenadiers)</span></li>\n<li><span>Julian Alaphilippe (Deceuninck-Quick Step)</span></li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Tour de France 2021 teams and riders</h2>\n<h3>UAE Team Emirates</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tadej Pogačar at the 2020 Tour de France.</span></figcaption><span> <i>Marco Bertorello/Getty Images</i></span></div>\n<p>Tadej Pogacar snatched victory at last year’s Tour de France to announce himself on the world stage in style.</p>\n<p>Aged just 21, the Slovenian claimed the yellow jersey with victory on the penultimate stage and his winning form has showed no sign of slowing since.</p>\n<p>Victories at the UAE Tour, Tirreno-Adriatico, Liege-Bastogne-Liege and the Tour of Slovenia are the mark of a man in superb form.</p>\n<p>He can climb, he can put down the power in the time trial and he is backed by a strong and experienced UAE-Team Emirates line-up.</p>\n<p>Former King of the Mountains Rafal Majka and 2013 world champion Rui Costa are among his domestiques, as is Italian Davide Formolo.</p>\n<p>Marc Hischi, Rafal Majka, Brandon McNulty and Vegard Stake Laengen complete the line-up as they look to earn back-to-back Tour victories.</p>\n<ul><li>Tadej Pogacar (SLO)</li>\n<li>Mikkel Bjerg (DEN)</li>\n<li>Rui Costa (POR)</li>\n<li>Davide Formolo (ITA)</li>\n<li>Marc Hirschi (SUI)</li>\n<li>Rafal Majka (POL)</li>\n<li>Brandon McNulty (USA)</li>\n<li>Vegard Stake Laengen (NOR)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Winner (Tadej Pogacar), Youth classification (Tadej Pogacar), King of the Mountains (Tadej Pogacar), Three stage wins (Tadej Pogacar)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 14</span></p>\n<p>\n\n    </p></div>\n    </section><h3>Team Jumbo-Visma</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Primoz Roglic is out to better countryman Tadej Pogacar (Photo by David Ramos/Getty Images)</span></figcaption><span></span></div>\n<p>Primoz Roglic was cruelly denied victory last year, when he lost the yellow jersey on the penultimate stage, blown away by Tadej Pogacar’s stunning time trial.</p>\n<p>Roglic had led since finishing second on stage nine, and he laid bare his form when he then went on to win Liege-Bastogne-Liege and the Vuelta a Espana before the season was up.</p>\n<p>He could not defend his Liege title this time around, but won three stages of Paris-Nice and claimed overall victory at the Tour of the Basque Country.</p>\n<p>He is not the only Team Jumbo-Visma rider on the hunt for success either – he has a strong team backing him, that includes Steven Kruijswijk and Robert Gesink for the mountains.</p>\n<p>Tony Martin will play a big role as domestique if there is a yellow jersey to defend too, and given Wout van Aert – a double stage winner last season – is among the contenders for stage one victory, that could be from the very first weekend.</p>\n<ul><li>Primoz Roglic (SLO)</li>\n<li>Wout van Aert (BEL)</li>\n<li>Mike Teunissen (NED)</li>\n<li>Robert Gesink (NED)</li>\n<li>Jonas Vindegaard (DEN)</li>\n<li>Tony Martin (GER)</li>\n<li>Sepp Kuss (USA)</li>\n<li>Steven Kruijswijk (NED)</li>\n</ul><div></div>\n<section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Second (Primoz Roglic), Seventh (Tom Dumoulin), Three stage wins (Wout van Aert (2), Primoz Roglic)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 20</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>INEOS Grenadiers</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> 2018 Tour champion Geraint Thomas is one of several yellow jersey contenders for INEOS Grenadiers</span></figcaption><span> <i>Alex Broadway/ASO/SWPix.com</i></span></div>\n<p>Since their first win, as Team Sky, in 2012 the team now known as INEOS Grenadiers have dominated this race with four riders contributing to seven wins in the last nine editions.</p>\n<p>Egan Arley Bernal could not defend his title last year, but victory at the Giro d’Italia has whet the appetite for yet more INEOS success this season.</p>\n<p>They arrive fresh from success at the Tour de Suisse (Richie Porte) and Criterium du Dauphine (Richard Carapaz) and both men join 2018 Tour winner Geraint Thomas in a fiercely-strong line-up.</p>\n<p>Tao Geoghegan Hart is another former Grand Tour winner in their strong list – one of three Brits, with Thomas and Luke Rowe.</p>\n<p>Michal Kwiatkowski, Jonathan Castroviejo and Dylan van Baarle also line-up. It is the sort of line-up that can dominate the peloton if the Grenadiers get a sniff of the yellow jersey.</p>\n<p>The team boasts 27 victories this season in total, and they will be expected to add to that over the next few weeks.</p>\n<ul><li>Richard Carapaz (ECU)</li>\n<li>Jonathan Castroviejo (ESP)</li>\n<li>Tao Geoghegan Hart (GBR)</li>\n<li>Michal Kwiatkowski (POL)</li>\n<li>Richie Porte (AUS)</li>\n<li>Luke Rowe (GBR)</li>\n<li>Geraint Thomas (GBR)</li>\n<li>Dylan van Baarle (NED)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> One stage win (Michal Kwiatkowski), 13<sup>th overall</sup> (Richard Carapaz)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 27</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Astana-Premier Tech</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Omar Fraile is chasing stage wins for Astana-Premier Tech (Photo by David Ramos/Getty Images)</span></figcaption><span></span></div>\n<p>Versatility and freedom to chase stage wins were the key words in Team Performance Manager Dmitriy Fofonov’s revealing of Astana-Premier Tech’s 2021 Tour de France team.</p>\n<p>Newly-crowned Spanish road race champion Omar Fraile, and his compatriot and national time trial champ Ion Izagirre will be among those hunting for stage wins.</p>\n<p>Astana had Miguel Angel Lopez finish sixth last year, but Fraile, Izagirre, Denmark’s Jakob Fuglsang and, stage winner last year, Alexey Lutsenko will all be targeting success day-by-day this time around.</p>\n<p>Lutsenko won the time trial stage of the Criterium du Dauphine ahead of this race and finished second overall to prove his form – he will be one to watch for stage wins, even if the team does shun any wider ambitions as a result.</p>\n<ul><li>Alex Aranburu (ESP)</li>\n<li>Stefan de Bod (RSA)</li>\n<li>Omar Fraile (ESP)</li>\n<li>Jakob Fuglsang (DEN)</li>\n<li>Dmitriy Gruzdev (KAZ)</li>\n<li>Hugo Houle (CAN)</li>\n<li>Ion Izagirre (ESP)</li>\n<li>Alexey Lutzenko (KAZ)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Sixth overall (Miguel Angel Lopez)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> eight</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>COFIDIS, Solutions Credits</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Guillaume Martin has been steadily improving at the Tour de France (Photo by David Ramos/Getty Images)</span></figcaption><span></span></div>\n<p>In the previous two years, Guillaume Martin has finished 12th and 11th at the Tour de France and was crowned King of the Mountains at the Vuelta a Espana.</p>\n<p>The 28-year-old Frenchman will now lead Cofidis again in this year’s race, as they look to end a barren run of 12 years without a Tour stage win.</p>\n<p>The long-standing team will pin their hopes in the mountains on Martin, who will have Spanish climbing pair Ruben Fernandez and Jesus Herrada working for him when the road heads up.</p>\n<p>On the flatter stages, Christophe Laporte remains their contender for stage victories.</p>\n<p>Cofidis are a fixture of the Tour de France, but success has eluded them far too often in recent memory. Martin has a big task on his hands to end that run, but he can at least target a strong GC finish and some valuable prize money as a result too.</p>\n<ul><li>Guillaume Martin (FRA)</li>\n<li>Christophe Laporte (FRA)</li>\n<li>Jesus Herrada (ESP)</li>\n<li>Anthony Perez (FRA)</li>\n<li>Simon Geschke (GER)</li>\n<li>Ruben Fernandez (ESP)</li>\n<li>Pierre-Luc Perichon (FRA)</li>\n<li>Jelle Wallays (BEL)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 11<sup>th</sup> overall (Guillaume Martin)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> six</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Trek-Segafredo</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Bauke Mollema co-leads the Trek-Segafredo team with Vincenzo Nibali (Photo by David Ramos/Getty Images)</span></figcaption><span></span></div>\n<p>The only non-Team Sky rider to win the Tour de France between 2012 and 2020, Vincenzo Nibali joins forces with Bauke Mollema for the second consecutive Grand Tour this season.</p>\n<p>Injury before and during the Giro d’Italia cost the veteran a shot at a sustained challenge, but he and Mollema will be hunting stage wins and taking each day as it comes regarding a GC challenge too.</p>\n<p>Milan-San Remo winner Jasper Stuyven is another rider to look out for as he hunts for stage wins as part of a versatile attack of <em>rouleurs</em> that also features Mads Pedersen and Edward Theuns.</p>\n<p>Strength in depth appears to have been the key criteria for this Trek-Segafredo team, and a balanced team for all terrain also includes Kenny Elissonde for the mountain stages and Latvian Toms Skujins as a man to look out for in the breakaways.</p>\n<p>The first week could well shape their tactics overall, but even at 36 there should be nobody betting against Nibali winding the clock back on at least one day of this race.</p>\n<ul><li>Julien Bernard (FRA)</li>\n<li>Kenny Elissonde (FRA)</li>\n<li>Bauke Mollema (NED)</li>\n<li>Vincenzo Nibali (ITA)</li>\n<li>Mads Pedersen (DEN)</li>\n<li>Toms Skujins (LTV)</li>\n<li>Jasper Stuyven (BEL)</li>\n<li>Edward Theuns (BEL)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Third overall (Richie Porte)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> ten</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Team Qhubeka-ASSOS</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Simon Clarke is a hugely experienced rider for Qhubeka-ASSOS (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>The pre-Tour headlines for Qhubeka-Assos’ Tour de France squad have centred on one man who will not be there – namely Fabio Aru.</p>\n<p>Unspecified physical problems suffered at the Italian national championships means Aru will not be on the Tour startline and Qhubeka-Assos’ ambitions for the race have been shuffled.</p>\n<p>Aru’s overall form meant he was never going to be in overall contention, but the 2015 Vuelta a Espana winner and multiple Grand Tour stage winner’s experience is a loss.</p>\n<p>Instead, Simon Clarke serves as a hugely experienced road captain and the likes of Colombian climber Sergio Henao and Belgian time-trial specialist Victor Campenaerts will be chasing stage success.</p>\n<p>After some incredible years at this race in their early days, Team Qhubeka-ASSOS – in former guises – has had a bit of a lean patch of late.</p>\n<p>They will feature in plenty of breakaways, however, so expect the Qhubeka charity to get plenty of airtime.</p>\n<ul><li>Simon Clarke (AUS)</li>\n<li>Michael Gogl (AUT)</li>\n<li>Victor Campenaerts (BEL)</li>\n<li>Max Walscheid (GER)</li>\n<li>Sean Bennett (USA)</li>\n<li>Nic Dlamini (RSA)</li>\n<li>Sergio Henao (COL)</li>\n<li>Carlos Barbero (ESP)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 73<sup>rd</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> four</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Team BikeExchange</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Simon Yates’ attention turns from the Giro d’Italia to the Tour de France (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>Fresh from his third place at the Giro d’Italia, Simon Yates will switch his focus to stage wins for the 2021 Tour de France having been named in the Team BikeExchange line-up.</p>\n<p>He and Esteban Chaves will be on the hunt for victory in the mountains, as the Brit looks to add to the two Tour stage wins he earned in 2019.</p>\n<p>The 2018 Vuelta a Espana champion and his Colombian team-mate have 13 Grand Tour stage wins between them – though Chaves is still looking to get off the mark at the Tour de France.</p>\n<p>He found some form with tenth place at the Tour de Suisse to add to his collection of top-ten results this season.</p>\n<p>Michael Matthews, a former green jersey winner, is another option for stage wins, meanwhile – leading the team on the flatter stages and certainly capable of mixing it up over the slightly lumpier stuff too.</p>\n<p>It is, all in all, a balanced and experienced line-up and it would be a surprise if they do not return from France without at least a small measure of success to their name.</p>\n<ul><li>Luke Durbridge (AUS)</li>\n<li>Christopher Juul-Jensen (DEN)</li>\n<li>Luka Mezgec (SLO)</li>\n<li>Simon Yates (GB)</li>\n<li>Esteban Chaves (COL)</li>\n<li>Michael Matthews (AUS)</li>\n<li>Amund Grondahl Jansen (NOR)</li>\n<li>Lucas Hamilton (AUS)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> ninth overall (Adam Yates)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> seven</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Bahrain-Victorious</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Jack Haig’s burgeoning career will take a step up as he leads Bahrain-Victorious’ Tour de France GC hopes (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>Bahrain-Victorious have wide-ranging ambitions for the 2021 Tour de France, anchored on ever-improving Australian Jack Haig’s GC ambitions.</p>\n<p>Haig, 27, has finished seventh at Paris-Nice and fifth at the Criterium du Dauphine so far this season and will have Wout Poels among his top domestiques for this race.</p>\n<p>Chris Froome’s former Team Sky lieutenant will also be hunting stage wins according to DS Rolf Aldag who wants Bahrain-Victorious to be, well, victorious every single day at this race.</p>\n<p>British Tour debutant Fred Wright, 22, will be one of those looking to play his part – the youngest member in a squad that otherwise packs a good level of Grand Tour experience.</p>\n<ul><li>Pello Bilbao (ESP)</li>\n<li>Sonny Colbrelli (ITA)</li>\n<li>Jack Haig (AUS)</li>\n<li>Dylan Teuns (BEL)</li>\n<li>Wout Poels (NED)</li>\n<li>Matej Mohoric (SLO)</li>\n<li>Marco Haller (AUT)</li>\n<li>Fred Wright (GBR)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> fourth overall (Mikel Landa)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 16</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Ag2r Citroen Team</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Greg van Avermaet is the most notable rider in the Ag2r Citroen Team squad (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>With Bob Jungels absent through injury, Ag2r Citroen Team still feature an experienced, versatile squad for the 2021 Tour de France.</p>\n<p>Greg van Avermaet is one of the stand-out names – the reigning Olympic road race champion having pulled on the yellow jersey in both 2016 and 2018.</p>\n<p>The first week looks well suited to Van Avermaet again, while Oliver Naesen is another Belgian that could be in content for the French-sponsored team in that week.</p>\n<p>Nans Peters returns after claiming stage success last season, meanwhile.</p>\n<p>Balancing Van Avermaet’s experience, Ag2r Citroen also feature three Tour debutants – Ben O’Connor, Aurelien Paret-Peintre and Dorian Godon.</p>\n<ul><li>Benoit Cosnefroy (FRA)</li>\n<li>Greg van Avermaet (BEL)</li>\n<li>Aurelien Paret-Peintre (FRA)</li>\n<li>Ben O’Connor (AUS)</li>\n<li>Nans Peters (FRA)</li>\n<li>Oliver Naesen (BEL)</li>\n<li>Michael Schar (SUI)</li>\n<li>Dorian Godon (FRA)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Winner (Tadej Pogacar), Youth classification (Tadej Pogacar), King of the Mountains (Tadej Pogacar)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 26<sup>th</sup> overall (Mikael Cherel)</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Movistar Team</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Enric Mas leads a strong Movistar line-up, that has no shortage of strength in depth (Photo by David Ramos/Getty Images)</span></figcaption><span></span></div>\n<p>Movistar are serial winners of the team classification at the Tour de France, but the Spanish team have found individual success has eluded them too often.</p>\n<p>Realistically, the star riders that have passed through the team may feel they could – and perhaps should – have done more in years gone by.</p>\n<p>But they remain contenders year after year, and flying the flag in 2021 will be Enric Mas – fifth last year – Marc Soler and Miguel Angel Lopez.</p>\n<p>Alejandro Valverde lends his considerable experience to the team on the road, and Imanol Erviti and Carlos Verona are among the Spanish climbing stars who will look to crack the peloton in the mountains.</p>\n<p>A podium finish is not beyond the realms of possibility for a team who may prefer their Dark Horse status. One thing is certain, it would be dangerous to write off a team with climbing prowess to match the best of them.</p>\n<ul><li>Alejandro Valverde (ESP)</li>\n<li>Carlos Verona (ESP)</li>\n<li>Enric Mas (ESP)</li>\n<li>Imanol Erviti (ESP)</li>\n<li>Ivan Garcia Cortina (ESP)</li>\n<li>Jorge Arcas (ESP)</li>\n<li>Marc Soler (ESP)</li>\n<li>Miguel Angel Lopez (COL)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Fifth overall (Enric Mas), Team Classification winners</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 11</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>BORA-hansgrohe</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Peter Sagan will be looking to swap the Slovakian champion’s jersey for the maillot vert (Photo by Chris Graythen/Getty Images)</span></figcaption><span></span></div>\n<p>A balanced BORA-hansgrohe team are sure to enjoy plenty of time at the sharp end of stages at this year’s Tour de France.</p>\n<p>Peter Sagan is their big-name star, as the <em>rouleur’s rouleur</em> looks to swap his newly-reclaimed Slovakian national champion’s jersey for yet another Tour de France green jersey.</p>\n<p>He topped the points classification at the Giro d’Italia last month to add to the seven points classification titles he has claimed at the Tour de France too.</p>\n<p>His stage win at the Giro was the 18th Grand Tour stage of his career, but he is not the only BORA-hansgrohe to look out for at the 2021 Tour de France.</p>\n<p>Wilco Kelderman is their top climber, and Emanuel Buchmann finished fourth overall in this race in 2019 to prove his credentials too.</p>\n<p>Kelderman has enjoyed top-ten finishes at the Volta a Catalunya, Tour de Romandie and Criterium du Dauphine to hone his form this season.</p>\n<p>A pdoum finish at last year’s Giro d’Italia was a reminder of what the 30-year-old can do, and the Dutchman will be keen to prove there is more than one string to BORA-hansgrohe’s bow in this race.</p>\n<ul><li>Daniel Oss (ITA)</li>\n<li>Lukas Postlberger (AUT)</li>\n<li>Ide Schelling (NED)</li>\n<li>Wilco Kelderman (NED)</li>\n<li>Peter Sagan (SVK)</li>\n<li>Nils Politt (GER)</li>\n<li>Emanuel Buchmann (GER)</li>\n<li>Patrick Konrad (AUT)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 33<sup>rd</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 13</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Lotto-Soudal</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Caleb Ewan is on the hunt for more sprint stage wins (Photo by Stuart Franklin/Getty Images)</span></figcaption><span></span></div>\n<p>Caleb Ewan leads Lotto-Soudal’s sprinting charge and the team management have left little doubt that he will be the man in charge at this race too.</p>\n<p>The Australian has five stage wins in the last two editions of this race and looks the top contender for the bunch gallops in this race too.</p>\n<p>A top sprinter in his own right, he also boasts a strong lead-out train and the pure focus of his team for this race – if he racks up the stage wins, the green jersey will become a target too.</p>\n<p>Beyond Ewan, Thomas de Gendt and Philippe Gilbert lend considerable experience to this team and will almost certainly be looking for stage wins throughout the three weeks.</p>\n<p>De Gendt is a fixture of the breakaway on the most brutal of days… and there are plenty of those in the offing this year.</p>\n<ul><li>Caleb Ewan (AUS)</li>\n<li>Jasper de Buyst (BEL)</li>\n<li>Tosh van der Sande (BEL)</li>\n<li>Thomas de Gendt (BEL)</li>\n<li>Roger Kluge (GER)</li>\n<li>Philippe Gilbert (BEL)</li>\n<li>Harry Sweeny (AUS)</li>\n<li>Brent van Moer (BEL)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 52<sup>nd</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 11</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Deceuninck-QuickStep</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mark Cavendish has got back to winning ways and is looking for a final Tour de France hurrah (Photo by DAVID STOCKMAN/Belga/AFP via Getty Images)</span></figcaption><span></span></div>\n<p>A late call-up in place of injured Sam Bennett – last year’s green jersey winner – has presented Mark Cavendish with the chance to enjoy what may well prove to be a final hurrah at this race.</p>\n<p>Deceuninck-QuickStep’s decision to resign the Manx Missile has already been repaid by five victories so far this season and the 30-time Tour stage winner may yet have one last trick up his sleeve on the biggest occasion.</p>\n<p>Cavendish has Michael Morkov for support in the sprints, but the team’s focus is split with Julian Alaphilippe the main leader.</p>\n<p>Alaphilippe has won the yellow jersey on 16 occasions in total, and the first two stages could present him with a chance to add to that tally.</p>\n<p>Two long time trials suit him well too, as he looks to improve on his career-best fifth place overall in 2019.</p>\n<p>Alaphilippe will be the team’s focus, but between him and Cavendish there could still be plenty of headlines to write.</p>\n<ul><li>Julian Alaphillipe (FRA)</li>\n<li>Kasper Asgreen (DEN)</li>\n<li>Davide Ballerini (ITA)</li>\n<li>Mattia Cattaneo (ITA)</li>\n<li>Mark Cavendish (GBR)</li>\n<li>Tim DeClercq (BEL)</li>\n<li>Dries Devenyns (BEL)</li>\n<li>Michael Morkov (DEN)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Points classification (Sam Bennett), 36<sup>th</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 32</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>EF Education-Nippo</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rigoberto Uran was back in form at the Tour de Suisse (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>Tour de Suisse runner-up Rigoberto Uran is one of two Colombian climbers in the EF Education-Nippo team for the 2021 Tour de France and he remains a rider that can never be written off.</p>\n<p>Uran was second in this race in 2017, and his time trial success at the Tour de Suisse, that helped him to that second place, was a reminder of how this year’s TDF course could suit him.</p>\n<p>The 34-year-old may soon be passing the baton to younger compatriot Sergio Higuita but his knack of returning to fore just as everyone has dismissed as a contender means that time has not come yet.</p>\n<p>Higuita himself will be a key ally in the mountains and an alternative for stage wins if the team’s attention shifts.</p>\n<p>Elsewhere, a balanced team will support the two Colombians and keep the EF Education-Nippo flag flying on the transition days too.</p>\n<ul><li>Sergio Higuita (COL)</li>\n<li>Rigoberto Uran (COL)</li>\n<li>Magnus Cort (DEN)</li>\n<li>Neilson Powless (USA)</li>\n<li>Stefan Bissegger (SUI)</li>\n<li>Michael Valgren (DEN)</li>\n<li>Ruben Guerreiro (POR)</li>\n<li>Jonas Rutsch (GER)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> Eighth overall (Rigoberto Uran)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> seven</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Groupama-FDJ</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Arnaud Demare is back at the Tour de France and on the hunt for stage success (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>David Gaudu and Arnaud Demare will hope to fly the home flag for French cycling fans as they share the lead on a dual-focussed Groupama-FDJ roster for the 2021 Tour de France.</p>\n<p>Gaudu, 24, leads the team’s GC challenge in the absence of Thibaut Pinot and his success at last season’s Vuelta a Espana – winning two stages – has showed his capabilities.</p>\n<p>Demare, meanwhile, arrives on the back of a strong season and realistically looks Caleb Ewan’s biggest sprinting rival in this race.</p>\n<p>A first Tour start since 2018, having focussed on – and enjoyed success at – the Giro d’Italia in the previous two seasons follows a campaign which has already brought seven victories.</p>\n<p>A full lead-out train boasting the power of Ignatas Konovalovas, Miles Scotson and Stefan Kung and wing-man Jacopo Guarnieri shows where Groupama-FDJ’s primary focus lies.</p>\n<p>Gaudu is an option for the mountains, but Demare and sprint stage wins are the main goal.</p>\n<ul><li>Bruno Armirail (FRA)</li>\n<li>Arnaud Demare (FRA)</li>\n<li>David Gaudu (FRA)</li>\n<li>Jacopo Guarnieri (ITA)</li>\n<li>Ignatas Konovalovas (LTU)</li>\n<li>Stefan Kung (SUI)</li>\n<li>Valentin Madouas (FRA)</li>\n<li>Miles Scotson (AUS)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 24<sup>th</sup> overall (Sebastien Reichenbach)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 19</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Intermarche-Wanty-Gobert Materiaux</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Louis Meintjes is Intermarche-Wanty Gobert’s man for the mountains (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>Back at the Tour de France, Intermarche-Wanty Gobert Materiaux are looking for time in the breakaway but they have options for different terrain in their eight-man squad.</p>\n<p>Louis Meintjes will be their man in the mountains, Jan Bakelants over rolling terrain and the Van Poppels, Danny being led out by Boy, are their sprint contenders.</p>\n<p>The team claimed a stage win at the Giro d’Italia last month, and the motivation is there for Tavo van der Hoorn’s team-mates to follow suit this year.</p>\n<p>The latter’s victory was the team’s first as a WorldTour team, and they certainly have a versatile enough squad to be in the mix consistently in this year’s Tour de France too.</p>\n<ul><li>Jan Bakelants (BEL)</li>\n<li>Jonas Koch (GER)</li>\n<li>Louis Meintjes (RSA)</li>\n<li>Loic Vliegen (BEL)</li>\n<li>Danny van Poppel (NED)</li>\n<li>Boy van Poppel (NED)</li>\n<li>Georg Zimmermann (GER)</li>\n<li>Lorenzo Rota (ITA)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> N/A</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> two</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Israel Start-Up Nation</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Chris Froome, pictured with Omer Goldstein, returns to the Tour de France with Israel-Start Up Nation (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>Israel Start-Up Nation make their second Tour de France appearance and, as with last year’s race, they have the big names but could well have little to show for it.</p>\n<p>Andre Greipel has two wins to his name this season, but his last Tour success was a long time ago – similar to former team-mate and long-standing rival Mark Cavendish.</p>\n<p>Chris Froome, meanwhile, is of course a four-time Tour de France winner but his form this season has showed that those days are behind him.</p>\n<p>Canadian climber Michael Woods and Irish all-rounder Dan Martin could be the better shouts for stage wins and a strong overall finish.</p>\n<p>Martin took a stage at the Giro d’Italia and will be keen for more of the same.</p>\n<p>Elsewhere, Israeli time-trial champion Omer Goldstein will wear the national jersey against the clock and will want to give a good showing.</p>\n<ul><li>Rick Zabel (GER)</li>\n<li>Andre Greipel (GER)</li>\n<li>Chris Froome (GBR)</li>\n<li>Omer Goldstein (ISR)</li>\n<li>Reto Hollenstein (SUI)</li>\n<li>Guillaume Boivin (CAN)</li>\n<li>Dan Martin (IRL)</li>\n<li>Michael Woods (CAN)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 41<sup>st</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> ten</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Team DSM</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Tiesj Benoot rides for Team DSM (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>Team DSM has undergone several name and sponsor changes, and the outfit are no longer the team they once were.</p>\n<p>But where Marcel Kittel and Tom Dumoulin lit up the Tour d France for the team’s previous guides, they should not be written off in 2021 either.</p>\n<p>Powerhouse sprinters and Grand Tour contenders they are not, but there are riders like Tiesj Benoot who know what it takes to get to the sharp end of a race.</p>\n<p>Dutchman Cees Bol took the team’s only win so far this season at Paris-Nice, meanwhile.</p>\n<ul><li>Soren Kragh Andersen (DEN)</li>\n<li>Tiesj Benoot (BEL)</li>\n<li>Cees Bol (NED)</li>\n<li>Mark Donovan (GBR)</li>\n<li>Nils Eekhoff (NED)</li>\n<li>Joris Nieuwenhuis (NED)</li>\n<li>Casper Pedersen (DEN)</li>\n<li>Jasha Sutterlin (GER)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 54<sup>th</sup> overall, one stage win (Marc Hirschi)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> one</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Alpecin-Fenix</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mathieu van der Poel will make his Tour de France debut (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>All eyes are on Tour de France debutant Mathieu van der Poel as he targets the yellow jersey on the first stage of the 2021 race.</p>\n<p>The Dutchman has made a seamless transition from cyclo-cross domination to Classics success on the road and he heads a sprinter-packed Alpecin-Fenix squad for this race.</p>\n<p>Beyond the first stage, Van der Poel could also prove a contender for the green jersey as he looks to best Peter Sagan and make this is a maiden Tour to remember.</p>\n<p>For his team, also at the Tour for the first time, stage wins are clearly the target with a team built to take something from the rolling and flatter stages.</p>\n<ul><li>Petr Vakoc (CZE)</li>\n<li>Kristian Sbaragli (ITA)</li>\n<li>Tim Merlier (BEL)</li>\n<li>Xandro Meurisse (BEL)</li>\n<li>Mathieu van der Poel (NED)</li>\n<li>Silvan Dillier (SUI)</li>\n<li>Jasper Philipsen (BEL)</li>\n<li>Jonas Rickaert (BEL)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> N/A</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> 17</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Team TotalEnergies</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pierre Latour will be a rider to watch in the mountains (Photo by Tim de Waele/Getty Images)</span></figcaption><span></span></div>\n<p>Four of team TotalEnergies’ five wins this season arrived in an eight-day period in May.</p>\n<p>At the 2021 Tour de France, the goal will be breakaways and stage wins where the opportunity present as they look to take advantage of their airtime.</p>\n<p>Edvald Boasson Hagen has prowess on the biggest stage and a huge engine, while Pierre Latour will be one to watch when the mountain heads skywards.</p>\n<p>It is a balanced team, full of opportunists, and when the breakaways are let off the leash in the final week, there could be opportunities.</p>\n<ul><li>Pierre Latour (FRA)</li>\n<li>Anthony Turgis (FRA)</li>\n<li>Victor de la Parte (ESP)</li>\n<li>Cristian Rodriguez (ESP)</li>\n<li>Edvald Boasson Hagen (NOR)</li>\n<li>Julien Simon (FRA)</li>\n<li>Fabien Doubey (FRA)</li>\n<li>Jeremy Cabot (FRA)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 31<sup>st</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> five</span></p>\n<p>\n\n    </p></div>\n    </section><hr /><h3>Team Arkea-Samsic</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Warren Barguil is among the home favourites at the 2021 Tour de France (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>Team Arkea-Samsic are led by three riders who, just a few years ago, seemed to have the world at their cleated feet.</p>\n<p>Warren Barguil and Nairo Quintana have both won the Tour de France’s polka dot jersey and the Colombian has claimed both the Giro d’Italia and Vuelta a Espana.</p>\n<p>Their stars have faded overt time, however, and with a balanced Tour route – and a lot of time trialling – awaiting, stage wins in the mountain look the better bet than a yellow jersey challenge.</p>\n<p>The third of those team leaders is Nacer Bouhanni, a man who looked to set to carry France’s sprinting hopes at one time.</p>\n<p>He too has never lived up to expectations on the biggest stage, however, and it could be British duo Connor Swift and Dan McLay who stand more chance of earning something on the flatter stages.</p>\n<ul><li>Warren Barguil (FRA)</li>\n<li>Nacer Bouhanni (FRA)</li>\n<li>Nairo Quintana (COL)</li>\n<li>Elie Gesbert (FRA)</li>\n<li>Connor Swift (GBR)</li>\n<li>Anthony Delaplace (FRA)</li>\n<li>Dan McLay (GBR)</li>\n<li>Clement Russo (FRA)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 14<sup>th</sup> overall</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> five</span></p>\n<p>\n\n    </p></div>\n    </section><h3>B&amp;B Hotels p/b KTM</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pierre Rolland brings plenty of experience. (Photo by Bas Czerwinski/Getty Images)</span></figcaption><span></span></div>\n<p>With an all-French team – three of whom share the same first name – B&amp;B Hotels p/b KTM arrive at the Tour de France with one prime goal in mind.</p>\n<p>And that goal is to get up the road and earn their sponsors some air time, making each day’s break and contesting for victories with the likes of Pierre Rolland and Bryan Coquard where the opportunity presents itself.</p>\n<p>This season, their only successes have come in the Tour du Rwanda – Rolland earning one of them.</p>\n<p>He will be one to watch in the mountains, and he can never be confidently written off – but realistically the team’s goal is airtime and breakaways and little else is expected.</p>\n<ul><li>Pierre Rolland (FRA)</li>\n<li>Quentin Pacher (FRA)</li>\n<li>Maxime Chevalier (FRA)</li>\n<li>Franck Bonnamour (FRA)</li>\n<li>Cyril Barthe (FRA)</li>\n<li>Cyril Gautier (FRA)</li>\n<li>Cyril Lemoine (FRA)</li>\n<li>Bryan Coquard (FRA)</li>\n</ul><section><div>\n        <p><b><span>Tour de France 2020:</span></b><span> 18<sup>th</sup> overall (Pierre Rolland)</span></p>\n<p><b><span>Pro wins 2021:</span></b><span> four</span></p>\n<p>\n\n    </p></div>\n    </section>","author":"Colin Henrys","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"85b4b38f7b1d1489e926500aad67794bc386df64b88dcfd029d569e869962937","category":"Cycling"}