{"title":"The Impact of Digital Technology Application on Agricultural Low-Carbon Transformation – A Case Study of the Pesticide Reduction Effect of Plant Protection Unmanned Aerial Vehicles (UAVs)","link":"https://www.preprints.org/manuscript/202410.1723/v1","date":1729671556000,"content":"The promotion of pesticide use reduction is an inevitable requirement for advancing green and low-carbon transformation of agriculture. Analyzing the impact and mechanism of agricultural digital technology applications, represented by plant protection unmanned aerial vehicles (UAVs), in reduction of pesticide application intensity by farming households is of great significance for exploring feasible pathways for low-carbon transformation in rice production. Based on the survey data of 455 sample farming households in Jiangxi Province, China, this paper employs the Ordinary Least Squares (OLS) and Propensity Score Matching (PSM) methods to examine the relationship between plant protection UAVs and the intensity of pesticide application. The research results indicate that the use of plant protection UAVs substantially reduces the intensity of pesticide application in rice by 24.9%. Heterogeneous analysis reveals that the inhibitory effect of plant protection UAVs on pesticide application intensity is more pronounced among non-aged farming households, large-scale farming households, and part-time farming households. Therefore, in order to achieve the goal of rlow-carbon transformation in rice production, it is essential to improve agricultural support policies and establish market promotion and application mechanisms to jointly promote the adoption of plant protection UAVs aerial spraying technology and other agricultural digital technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"85bf0fd86f2d43e10c51c30a895a4cc5367d4347951111eb7e03958ba50710e2","category":"Interdisciplinary"}