{"title":"The geometry of conchiferan shell evolution: origins of coiling and bivalved morphologies","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyae031/7808494?rss=1","date":1727913600000,"content":"<span><div>ABSTRACT</div>The unifying theme of conchiferan shell morphology, including near-logarithmic expansion of a coiling cone, has led to the development of numerous descriptive mathematical models. Here, we develop and demonstrate a simple geometric model, based on minimal assumptions of ontogenetic development and mantle activity, that seeks to explain several fundamental features, including the origin of coiling, lateral compression and both pseudobivalved and true bivalved morphologies in the Diasoma. Coiling is hypothesized to have been facilitated by a genetically controlled asymmetry in the rate of mineralization around the growing margin of early Cambrian univalved taxa that adhered to an epibenthic life mode. Coiling would have been advantageous, and still is, for increase of size, internal volume expansion and protection against hydrodynamic and biotic forces. Three hypotheses are tested for the origin of Rostroconchia and Bivalvia. The first is an existing hypothesis of descent from laterally compressed helcionellid taxa. The other two are novel hypotheses, the first involving a bifurcation of the mineralizing asymmetry of the shell field along the anterior–posterior axis of symmetry, and the second proposes a bifurcation of the shell field itself, rendering each bivalve valve homologous with the univalve shell. Both hypotheses generate model shells consistent with rostroconch and bivalve morphologies respectively, and it is suggested that the proliferation of laterally compressed conchiferans in the late Cambrian is at least partially a result of multiple independent, and evolutionarily convergent invasions of organic and algae rich soft sediment environments.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"85bf30a541606781cca380e3f94e15d1d4b0a848a932938650dfc7bc1b5c85cf","category":"Environment"}