{"title":"Can flowers help to disentangle the Vriesea oligantha complex (Bromeliaceae: Tillandsioideae)? Taxonomic implications and contributions to the floral anatomy and biology of Stigmatodon","link":"https://academic.oup.com/botlinnean/article/204/2/152/7239909?rss=1","date":1691539200000,"content":"<span><div>Abstract</div>The <span>Vriesea oligantha</span> complex comprises <span>Vriesea lancifolia</span>, <span>Vriesea oligantha</span>, and <span>Vriesea pseudoligantha</span>, which were recently transferred to <span>Stigmatodon</span>. Such species exhibit strong morphological convergence to live in rocky fields, which makes difficult their identification in the wild or in herbarium specimens. In a previous work, leaf characters helped in the species delimitation and evidenced a new taxon. Considering that morphology, anatomy, and aspects of floral biology can contribute to better define species limits and to indicate potential pollinators, individuals from nine populations of <span>V. oligantha</span> complex were comparatively studied. The typical <span>V. oligantha</span> is mainly distinguished by tubular flowers, with simple petal appendages and diurnal anthesis. The remaining individuals studied from different populations exhibit campanulate corollas, with denticulate petal appendages and nocturnal anthesis, not allowing for the separation of <span>V. lancifolia</span>, <span>V. pseudoligantha</span>, and a fourth taxon. Floral anatomy is less variable than the external morphology, with little contribution to the species delimitation; however, it is helpful in the circumscription of <span>Stigmatodon</span>. The infralocular septal nectaries and the floral features provide evidence that the main pollinators of campanulate and tubular flowers are bats and hummingbirds, respectively. Specific pollinator guilds in combination with fragmented populations may explain the limited gene flow amongst populations.</span>","author":"","siteTitle":"Botanical Journal of the Linnean Society Current Issue","siteHash":"84b5fa2619594e061395c38d918de42c13a5b0cd8ac0441f237084e35d0e4410","entryHash":"85cb5f15ac864bb688d5397e3ea88b5219b286a7714200efb5680db042f5502a","category":"Environment"}