{"title":"First Qi2 chargers look to expand MagSafe-like wireless charging beyond Apple","link":"https://arstechnica.com/?p=1964831","date":1693517005000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/belkin-800x567.jpg\" alt=\"Belkin BoostCharge Convertible Qi2 Wireless Pad to Stands with phones\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/belkin-scaled.jpg\">Enlarge</a> <span>/</span> Belkin's BoostCharge Convertible Qi2 Wireless Pad to Stand. (credit: Belkin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The first wireless charging devices that support the Wireless Power Consortium's (WPC) Qi2 wireless charging standard were detailed today. The chargers and subsequent Qi2 products will feature Apple MagSafe-like technology and promise a secure, more efficient wireless charge with the help of magnets. We don't know which smartphones will support Qi2, but there's hope that with the right compatibility, it will be easier to charge an Android phone with a secure magnetic connection. The new charging standard will also expand the number of chargers that can power Android <em>and </em>iOS devices wirelessly.</p>\n<p>Currently, wireless iPhone charging is limited to 7.5 W unless you have a MagSafe charger, which supports 15 W. The limitation has given shoppers a reason to buy a MagSafe charger over various non-Apple chargers, including those following the Qi standard. It took five years after Android phones started adopting Qi for Apple (with the iPhone 8 series) to get on board. In January 2023, months ahead of Apple's expected <a href=\"https://arstechnica.com/gadgets/2023/08/what-to-expect-from-the-iphone-15-and-more-on-september-12/\">iPhone 15 launch</a>,  WPC announced that Apple \"provided the basis for the new Qi2 standard building on its MagSafe technology.\"</p>\n<p>Along with other WPC members, Apple helped create the standard's Magnet Power Profile. When finalized, the Qi2 standard will have mandates for magnet strength and dimensions to ensure foolproof alignment between transmitters and receivers for a consistent charge and less heat-inducing energy loss. The WPC sees the design as enabling wireless charging of new product categories, including tablets and smartwatches (it's targeting the standard at phones and wireless earbuds to start).</p></div><p><a href=\"https://arstechnica.com/?p=1964831#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1964831&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"85cda1c1bf1ce86574b8bc5cc285e5a45c16f3ee78a53b05a7758c3be87e0a10","category":"Tech"}