{"title":"GitHub เปิดตัว Copilot X เพื่อนคู่โปรแกรมเมอร์พลัง GPT-4 ถามได้ตั้งแต่โค้ดจนคำสั่ง command line","link":"https://www.blognone.com/node/133125","date":1679498875000,"content":"<div><div><div><p>GitHub Copilot นับเป็น<a href=\"https://www.blognone.com/node/123491\">บริการตัวแรกที่ไมโครซอฟท์ร่วมมือกับ OpenAI อย่างจริงจัง</a>ตั้งแต่สมัย GPT-2 ตอนนี้ทาง GitHub ก็เปิดตัว Copilot X บริการรุ่นอัพเกรดเพิ่มมาหลายฟีเจอร์ และบางฟีเจอร์ก็ใช้ GPT-4 ที่เพิ่งเปิดตัวมาแล้ว รายการฟีเจอร์ที่เพิ่มมาได้แก่</p>\n<ul>\n<li>อินเทอร์เฟซแบบ ChatGPT: จากเดิม Copilot จะเติมโค้ดแบบ autocomplete เท่านั้น แต่เวอร์ชั่นใหม่สามารถพูดคุยสอบถาม เช่น ขอ testcase สำหรับโค้ดที่เขียนไปแล้ว หรือให้ช่วยปรับแก้โค้ดให้</li>\n<li>Copilot for Pull Request: อ่านแพตช์ที่นักพัฒนาส่งเข้าไปแล้วเติมคำบรรยายให้โดยอัตโนมัติ รูปแบบนี้คล้ายกับก่อนหน้าที่มี<a href=\"https://www.blognone.com/node/132660\">นักพัฒนาทำแพ็กเกจ aicommit ช่วยคิดคำบรรยาย commit</a></li>\n<li>ระบบถามตอบจากเอกสาร: โครงการใหญ่ๆ เช่น React, Azure Docs, และ MDN จะมีหน้าถามตอบเฉพาะเพื่อให้ปัญญาประดิษฐ์ไปอ่านเอกสารและตอบคำตอบมาให้ ตอนนี้ยังจำกัดเฉพาะบางโครงการและอนาคตจะเปิดให้ใช้กับเอกสารภายในได้ด้วย</li>\n<li>ถามวิธีใช้คำสั่ง command line: ฟีเจอร์เพิ่มเติมของ GitHub CLI สามารถถามวิธีการใช้คำสั่งต่างๆ หรือขอคำสั่งตามที่ต้องการ สามารถสั่งรันได้ทันที</li>\n</ul>\n<p>แม้จะเรียกชื่อรวมว่า <a href=\"https://github.com/features/preview/copilot-x\">GitHub Copilot X</a> แต่ฟีเจอร์ต่างๆ ก็แยกจากกัน ต้องสมัครใช้งาน หรือเข้าคิวรอใช้งานแยกกัน</p>\n<p>ที่มา - <a href=\"https://github.blog/2023-03-22-github-copilot-x-the-ai-powered-developer-experience/\">GitHub</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9ee913160152eb788df1148d5ef832fc.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/github\">GitHub</a></div><div><a href=\"/topics/openai\">OpenAI</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"85d9c21a6f2260c52d0cce7405643f6cb4ff8f1e34df118892bf2857f7ed428a","category":"Thai"}