{"title":"Microstructure Refinement of Bulk Inconel 718 Parts during Fabrication with EB-PBF Using Scanning Strategies: Transition from Bidirectional-Raster to Stochastic Point-Based Melting","link":"https://www.preprints.org/manuscript/202409.2334/v1","date":1727678376000,"content":"Inconel 718 is a widely popular aerospace superalloy known for its high-temperature performance and resistance to oxidation, creep, and corrosion. Traditional manufacturing methods, like casting and powder metallurgy, face challenges with intricate shapes that can result in porosity and uniformity issues. On the other hand, Additive Manufacturing (AM) techniques such as Powder Bed Fusion (PBF) and Direct Energy Deposition (DED) can allow the creation of intricate single-part components to reduce weight and maintain structural integrity. However, AM- parts often exhibit directional solidification, leading to anisotropic properties and potential crack propagation sites. To address this, post-processing treatments like HIP and heat treatment are necessary. This study explores the effects of the raster and stochastic spot melt scanning strategies on the microstructural and mechanical properties of IN718 parts fabricated using Electron Beam Powder Bed Fusion (EB-PBF). The research demonstrates that raster scanning produces columnar grains with higher aspect ratios. In contrast, stochastic spot melt scanning promotes the formation of equiaxed grains, enhancing microstructural refinement and reducing anisotropy. Microhardness values also show variation in strength in build direction, denoting changes in mechanical performance due to scanning strategies. These findings emphasize the critical role of scanning strategies in optimizing the EB-PBF process for improved material properties.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"85e3c49707379ff29056b8938c0102a09de6ae7ed6be9e1d4bf49a785a1a9191","category":"Interdisciplinary"}