{"title":"Conditions for successful nitrogen removal from source-separated urine by partial nitritation/anammox","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000235","date":1716386400000,"content":"<p>by Valentin Faust, Philipp Markus, Sarina Schielke-Jenni, Marijn J. Timmer, Jolien De Paepe, Ramon Ganigué, Siegfried E. Vlaeminck, Kai M. Udert</p>\r\n\r\nPartial nitritation/anammox (PN/A) of source-separated urine is less energy-intensive and potentially cheaper and more environmentally friendly than conventional nitrogen removal from mixed sewage. However, PN/A of undiluted source-separated urine has not yet been established. In this study, the feasibility of PN/A for source-separated urine (total nitrogen ≈ 2 to 3 g-N L<sup>-1</sup>). To evaluate the influence of different factors, one- and two-stage configurations were operated using different influents, i.e. source-separated urine, synthetic urine, and urine with additional divalent cations. While partial nitritation was successfully achieved in both configurations with digester supernatant and urine, anammox activity was lost shortly after switching from digester supernatant to the urine influents. Toxic organic compounds or pharmaceuticals and the high monovalent to divalent cation ratio were suspected as causes of anammox failure, but were ruled out due to the different reactor configurations and influent compositions tested. Other suspected factors such as COD/N ratio, phosphate and sulfate inhibition, nitrogen compound inhibition, metal inhibition, pH and dissolved oxygen were also systematically excluded. Instead, the high salt concentration in urine compared to the digester supernatant most likely caused the reactor to fail due to the disintegration of large flocs, and the resulting challenge of biomass retention. The shortcomings of the floccular sludge system were overcome by using biofilm carriers, resulting in successful PN/A. This hybrid system ran for 140 days with nitrogen removal rates of up to 1000 mg-N L<sup>-1</sup> d<sup>-1</sup> with an average of 410 ± 220 mg-N L<sup>-1</sup> d<sup>-1</sup>, and a nitrogen removal efficiency of 93 ± 3% at 30°C.","author":"Valentin Faust","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"85f8920a5e2e6fcb52a9889c6885677e242716b76e45a6d2e12d160232f0727a","category":"Environment"}