{"title":"The Changing Influence of Precipitation on Soil Moisture Drought With Warming in the Mediterranean and Western North America","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003987?af=R","date":1715594322000,"content":"<h2>Abstract</h2>\n<p>Anthropogenic climate change has already affected drought severity and risk across many regions, and climate models project additional increases in drought risk with future warming. Historically, droughts are typically caused by periods of below-normal precipitation and terminated by average or above-normal precipitation. In many regions, however, soil moisture is projected to decrease primarily through warming-driven increases in evaporative demand, potentially affecting the ability of negative precipitation anomalies to cause drought and positive precipitation anomalies to terminate drought. Here, we use climate model simulations from Phase Six of the Coupled Model Intercomparison Project (CMIP6) to investigate how different levels of warming (1, 2, and 3°C) affect the influence of precipitation on soil moisture drought in the Mediterranean and Western North America regions. We demonstrate that the same monthly precipitation deficits (25th percentile relative to a preindustrial baseline) at a global warming level of 2°C increase the probability of both surface and rootzone soil moisture drought by 29% in the Mediterranean and 32% and 6% in Western North America compared to the preindustrial baseline. Furthermore, the probability of a dry (25th percentile relative to a preindustrial baseline) surface soil moisture month given a high (75th percentile relative to a preindustrial baseline) precipitation month is 6 (Mediterranean) and 3 (Western North America) times more likely in a 2°C world compared to the preindustrial baseline. For these regions, warming will likely increase the risk of soil moisture drought during low precipitation periods while simultaneously reducing the efficacy of high precipitation periods to terminate droughts.</p>","author":"Miriam Nielsen, \nBenjamin I. Cook, \nKate Marvel, \nMingfang Ting, \nJason E. Smerdon","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"85ff22f0997b7a81ea9cec7c412eb981621d0116586852c0ee2cdc50e821fdca","category":"Environment"}