{"title":"Molecular dissection of an intronic enhancer governing cold-induced expression of the vacuolar invertase gene in potato","link":"https://academic.oup.com/plcell/article/36/5/1985/7609602?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>Potato (<span>Solanum tuberosum</span>) is the third most important food crop in the world. Potato tubers must be stored at cold temperatures to minimize sprouting and losses due to disease. However, cold temperatures strongly induce the expression of the potato vacuolar invertase gene (<span>VInv</span>) and cause reducing sugar accumulation. This process, referred to as “cold-induced sweetening,” is a major postharvest problem for the potato industry. We discovered that the cold-induced expression of <span>VInv</span> is controlled by a 200 bp enhancer, <span>VInv</span>In2En, located in its second intron. We identified several DNA motifs in <span>VInv</span>In2En that bind transcription factors involved in the plant cold stress response. Mutation of these DNA motifs abolished <span>VInv</span>In2En function as a transcriptional enhancer. We developed <span>VInv</span>In2En deletion lines in both diploid and tetraploid potato using clustered regularly interspaced short palindromic repeat (CRISPR)/CRISPR-associated nuclease 9 (Cas9)-mediated gene editing. <span>VInv</span> transcription in cold-stored tubers was significantly reduced in the deletion lines. Interestingly, the <span>VInv</span>In2En sequence is highly conserved among distantly related <span>Solanum</span> species, including tomato (<span>Solanum lycopersicum</span>) and other non-tuber-bearing species. We conclude that the <span>VInv</span> gene and the <span>VInv</span>In2En enhancer have adopted distinct roles in the cold stress response in tubers of tuber-bearing <span>Solanum</span> species.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"860ce6786179da5e018bbcc7490c0efe4b0b3f6bcf7bb5594396fc9d2dcca512","category":"Environment"}