{"title":"Apple will reveal the next versions of iOS, macOS at WWDC21, starting June 7","link":"https://arstechnica.com/?p=1753199","date":1617130578000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Apple_wwdc21_newsroom_article_tile_033021-800x450.jpg\" alt=\"A disembodied cartoon head sure is excited.\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/Apple_wwdc21_newsroom_article_tile_033021.jpg\" class=\"enlarge-link\" data-height=\"1102\" data-width=\"1960\">Enlarge</a> <span class=\"sep\">/</span> Apple's splash image for WWDC 2021, which references a meme from last year. (credit: <a rel=\"nofollow\" class=\"caption-link\" href=\"https://www.apple.com/newsroom/2021/03/apples-worldwide-developers-conference-is-back-in-its-all-online-format/\">Apple</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Apple will host its annual Worldwide Developers Conference (WWDC) on schedule this year, with the event kicking off on June 7 and concluding on June 11. Like last year, it will be an online-only affair as the world continues to grapple with the COVID-19 pandemic. All the event's offerings will be free for anyone who has an Apple developer account.</p>\n<p>The company typically uses this event to announce new versions of its various operating systems (macOS, iPadOS, iOS, watchOS, and tvOS) and detail the software's new features and changes. WWDC is sometimes, though not always, used to announce new hardware products, too, and it's often the event Apple uses to explain very major changes in direction, should they be imminent. For example, Apple revealed the details of its custom-made silicon transition at last year's conference.</p>\n<p><a href=\"https://www.apple.com/newsroom/2021/03/apples-worldwide-developers-conference-is-back-in-its-all-online-format/\">Apple's press release</a> notes that the usual components will be there. There will be a keynote to kick things off, followed by \"state of the union\" presentations that drill deeper on each platform. Then, Apple will offer video sessions on specific features—using the Metal graphics API to make augmented reality applications, in one hypothetical example—throughout the week. The conference will also include one-on-one lab appointments \"offering technical guidance\" to developers, Apple says.</p></div><p><a href=\"https://arstechnica.com/?p=1753199#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1753199&comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"861f6972c545f5cb699b6fd5e471ef01985b4fbe9eafc790a87b6deb5cce9cbc","category":"Tech"}