{"title":"Lawsuit Claims Swollen Apple Watch Batteries Can Lead to 'Substantial Personal Injury'","link":"https://www.macrumors.com/2021/12/09/apple-watch-battery-lawsuit/","date":1639075046000,"content":"Every generation of the Apple Watch has a battery swelling defect that can cause operational failures and injuries from broken screens, states a new <a href=\"https://www.scribd.com/document/545842377/Smith-v-Apple-Class-Action-Lawsuit\">class action lawsuit</a> that has been filed against Apple.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2019/04/apple-watch-swollen.jpg\" /><div><em>An Apple Watch with detached display caused by swollen battery, via <a href=\"https://twitter.com/smiller/status/905510572862660609\">Shawn Miller</a>.</em></div>\r\n<br />\r\nAccording to the plaintiffs in the lawsuit, Apple has manufactured the watch in a way that allows the lithium cobalt oxide battery to contact the watch screen, and in situations where the battery swells, it can cause the display to pop up.\r\n<br />\r\n\r\n<br />\r\nIn situations where the display is damaged by the battery, \"razor-sharp edges\" are exposed, which can lead to injury.<blockquote>Despite knowing the battery can suddenly swell, the Complaint alleges that Apple allocated insufficient room inside the Apple Watch for it to freely expand without affecting the screen face and/or failed to incorporate a protective guard to keep it from contacting the screen face.\r\n<br />\r\n\r\n<br />\r\nThe swelling creates considerable upward pressure on the Apple Watch face, allegedly causing detachment, shattering, and/or cracking of the screen through no fault of the wearer. When this happens, it exposes razor-sharp edges and leads to operational failure and/or injuries resulting from unintended bodily contact with the detached, shattered, or cracked screen.</blockquote>The lawsuit describes a situation where a man named Chris Smith had an Apple Watch Series 3 that saw the screen detach due to the battery swelling three years after the device was originally purchased. He was in a golf cart and reached down from the steering wheel to place it in motion, when the detached screen \"severely sliced\" the underside of his forearm, cutting a vein. The lawsuit includes images of a deep cut on Smith's arm along with descriptions of other incidents where an Apple Watch display detached from the body but did not result in injury.\r\n<br />\r\n\r\n<br />\r\nAll Apple Watch models minus the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a> are included in the lawsuit, and it covers Apple Watches of every size and model. The suit claims that the defect poses a \"material and unreasonable safety hazard to consumers, and has caused \"many purchasers\" to suffer from \"lacerations, cuts, abrasions, and/or other injuries.\"\r\n<br />\r\n\r\n<br />\r\nThe lawsuit also suggests that Apple is aware that its Apple Watches were defective before it began selling them, and that the company failed to disclose this defect that could lead to harm to the wearer.\r\n<br />\r\n<blockquote>Apple uniformly failed to disclose that the Watches contained the Defect that would cause them to fail and render them an unreasonable safety hazard resulting in injury to the wearer. This makes the Watches unmerchantable and unfit for the uses Apple advertised, e.g., activity oriented, fitness, athletic use, health, and safety.</blockquote>\r\n<br />\r\nPlaintiffs in the case are seeking general, special, incidental, statutory, punitive, and consequential damages, as well as the costs for replacing their Apple Watches. The suit also asks that Apple \"adequately disclose the defective nature of the Watch\" and that attorneys fees and costs be paid.\r\n<br />\r\n\r\n<br />\r\nIt's worth noting that this is not the first time that Apple has faced a lawsuit over swollen Apple Watch batteries. Back in 2019, a class action lawsuit <a href=\"https://www.macrumors.com/2019/04/02/apple-watch-swollen-battery-lawsuit-new-jersey/\">targeted the company</a> and accused Apple of fraudulent business practices and breach of warranty, with the case using many of the same arguments in the lawsuit that was filed today.\r\n<br />\r\n\r\n<br />\r\nA judge in the case <a href=\"https://www.law360.com/articles/1230826/apple-must-face-warranty-claim-in-watch-defect-suit\">dismissed several claims</a> in that particular lawsuit, ruling that the Apple Watch defect was not caused by faulty batteries or defective internal components. The judge did allow the lawsuit to proceed based on breach of express warranty, but the plaintiff ultimately <a href=\"https://news.bloomberglaw.com/class-action/apple-watch-suit-dismissed-tying-battery-flaw-to-cracked-screen\">dismissed the lawsuit</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/lawsuit/\">lawsuit</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_Watch\">Apple Watch (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-watch.172\">Apple Watch</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/12/09/apple-watch-battery-lawsuit/\">Lawsuit Claims Swollen Apple Watch Batteries Can Lead to 'Substantial Personal Injury'</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/lawsuit-claims-swollen-apple-watch-batteries-can-lead-to-substantial-personal-injury.2326846/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=SVIZWkO9MZc:7q59tiHb-Fk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=SVIZWkO9MZc:7q59tiHb-Fk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"862055cd9321dc8b691c94eac83d2c1e694aa12e57e6ae4df8e76cb04f9bc62d","category":"Apple"}