{"title":"Enhanced amygdala–anterior cingulate white matter structural connectivity in Sahaja Yoga Meditators","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301283","date":1711634400000,"content":"<p>by Oscar Perez-Diaz, Daylín Góngora, José L. González-Mora, Katya Rubia, Alfonso Barrós-Loscertales, Sergio Elías Hernández</p>\r\nObjective <p>To study the white matter connections between anterior cingulate cortex, anterior insula and amygdala as key regions of the frontal-limbic network that have been related to meditation.</p> Design <p>Twenty experienced practitioners of Sahaja Yoga Meditation and twenty nonmeditators matched on age, gender and education level, were scanned using Diffusion Weighted Imaging, using a 3T scanner, and their white matter connectivity was compared using diffusion tensor imaging analyses.</p> Results <p>There were five white matter fiber paths in which meditators showed a larger number of tracts, two of them connecting the same area in both hemispheres: the left and right amygdalae and the left and right anterior insula; and the other three connecting left anterior cingulate with the right anterior insula, the right amygdala and the left amygdala. On the other hand, non-meditators showed larger number of tracts in two paths connecting the left anterior insula with the left amygdala, and the left anterior insula with the left anterior cingulate.</p> Conclusions <p>The study shows that long-term practice of Sahaja Yoga Meditation is associated with larger white matter tracts strengthening interhemispheric connections between limbic regions and connections between cingulo-amygdalar and cingulo-insular brain regions related to top-down attentional and emotional processes as well as between top-down control functions that could potentially be related to the witness state perceived through the state of mental silence promoted with this meditation. On the other hand, reduced connectivity strength in left anterior insula in the meditation group could be associated to reduced emotional processing affecting top-down processes.</p>","author":"Oscar Perez-Diaz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8623e7848ac3d4fce7f92466aafee290c3ff3b898209ffc2dd8d002f473e7df4","category":"Interdisciplinary"}