{"title":"UCI reiterates ban on invisible aero bars","link":"https://cyclingtips.com/2021/02/uci-reiterates-ban-on-invisible-aero-bars/","date":1612818911000,"content":"<p>After announcing a number of updates to its protocols in a wide-ranging statement on Thursday, the UCI provided updated text for its rules and regulations in a memorandum on Monday. As expected following Thursday&#8217;s statement, new UCI rules that will go into effect on April 1 reiterate a prohibition on the so-called &#8220;<a href=\"https://cyclingtips.com/2021/02/the-uci-is-banning-the-super-tuck/\" target=\"_blank\" rel=\"noreferrer noopener\">super tuck</a>,&#8221; but in a less expected development, the UCI&#8217;s updated rules also include language reiterating a prohibition on &#8220;using the forearms as a point of support on the handlebar&#8221; outside of time trials. </p>\n\n\n\n<p>In other words, riders will no longer be allowed to employ what some refer to as &#8220;invisible aero bars,&#8221; the extremely common technique of resting on the forearms on the handlebars of a road bike in a way that emulates the reduced drag of riding with aero bars.</p>\n\n\n\n<p>The language explicitly referring to the tactic is included in a new section focused on the &#8220;Position on the bicycle&#8221; that also includes the &#8220;super tuck&#8221; ban, although the new section points to rules in an already existing section of the UCI code, Article 1.3.008. Titled &#8220;Position,&#8221; that section has existed for years.</p>\n\n\n\n<p>Article 1.3.008 reads, &#8220;The rider shall normally assume a sitting position on the bicycle. This position requires that the only points of support are the following: the feet on the pedals, the hands on the handlebars and the seat on the saddle.&#8221;</p>\n\n\n\n<p>Monday&#8217;s memorandum clarifies that the UCI plans to start enforcing those rules more strictly moving forward from April 1.</p>\n\n\n\n<p>The memorandum also included updates to a number of other areas of the rules. New safety protocols call for &#8220;a zone of at least 300 meters before and 100 meters after&#8221; a race finish to be protected by barriers when possible based on the terrain, with barriers required to &#8220;be weighted down so that they do not move in strong winds or when subject to pressure by spectators or other forces.&#8221;</p>\n\n\n\n<p>Riders who violate the rules on littering will risk time penalties or even disqualification.</p>\n\n\n\n<p>The updated rules also include more defined language prohibiting riders from discarding their trash outside of specified areas, while also providing for the inclusion of &#8220;litter zones of sufficient length situated every 30-40 kilometers throughout the route of the event or stage.&#8221;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/uci-reiterates-ban-on-invisible-aero-bars/\">UCI reiterates ban on invisible aero bars</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"86296baff3aee0517911337fae0e960a3717313c549d4588dc3ecc1646eb1bfc","category":"Cycling"}