{"title":"“I’m not your grandpa”: Experiences of advanced age fathers raising their teenage children in Belgium, an interpretative phenomenological analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309448","date":1724680800000,"content":"<p>by Steven R. Piek, Kato Verghote, Andrea Martani, Guido Pennings, Veerle Provoost</p>\r\n\r\nThis study aims to gain more insight in the lived experience of men who became father at an advanced age (40 years or older). Advanced Parental Age (APA) is becoming an increasingly widespread phenomenon as the average age at which people have children has been increasing for decades now. However, the psychosocial dimension of APA-fatherhood in particular remains a highly understudied topic. This Interpretive Phenomenological Analysis presents findings from a qualitative interview study with seven men who fathered their (now teenage) children in their early 40s to early 50s. Interviews were semi-structured and focused on lived experiences of the participants and their normative stances regarding the topic of parenting at an advanced age. Three themes were identified: The fathers in our sample describe their APA as a result of life events rather than an intentional postponement. Second, they managed how they were perceived as APA-fathers by distancing themselves from ‘too old’ parents. However, these fathers did not perceive fatherhood at a younger age as better than their current APA. Three fathers, who also had an earlier fatherhood experience, provided a rich account of how they made sense of their fatherhood roles in both families. Third, the seven fathers encountered social stigma, leading to various coping strategies. These findings contribute to better understanding the psychosocial dimension of APA-fatherhood.","author":"Steven R. Piek","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"863634f1eedaa13dad40f9dfa73d2ebae2c76570124344db8cacd446308229e2","category":"Interdisciplinary"}