{"title":"A puzzling illness paralyzed US kids every other year—until it didn’t","link":"https://arstechnica.com/?p=2000954","date":1707145589000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/18259-800x800.jpg\" alt=\"This thin section transmission electron microscopic (TEM) image reveals numerous spheroid-shaped Enterovirus-D68 (EV-D68) virions.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/18259.jpg\">Enlarge</a> <span>/</span> This thin section transmission electron microscopic (TEM) image reveals numerous spheroid-shaped Enterovirus-D68 (EV-D68) virions. (credit: <a href=\"https://phil.cdc.gov/Details.aspx?pid=18259\">CDC/ Cynthia S. Goldsmith, Yiting Zhang</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>2022 was the bad year that wasn't—at least for a mysterious paralyzing condition in children.</p>\n<p>In the decade before, hundreds of young, healthy kids in the US abruptly felt their limbs go weak. Debilitating paralysis set in. In recent years, around half of affected children required intensive care. About a quarter needed mechanical ventilation. A few died, and many others appear to have permanent weakness and paralysis.</p>\n<p>Researchers quickly linked the rare polio-esque condition to a virus known for causing respiratory infections, often mild colds: enterovirus D68, or EV-D68 for short. Identified decades ago, it's a relative of polio, one of the over 100 non-polio enteroviruses that float around. But when EV-D68 began surging, so did the mysterious paralyzing condition, called acute flaccid myelitis, or AFM. The menacing pair seemed to come in waves every other year, likely starting with <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2478202\">a cluster of cases in California in 2012</a>. In 2014, there were <a href=\"https://www.cdc.gov/acute-flaccid-myelitis/cases-in-us.html\">120 AFM cases in 34 states</a>. In 2016, 153 cases in 39 states. In 2018, 238 cases in 42 states. By contrast, there were just a few dozen cases or so in each of the years in between, cases that were sporadic or unrelated to EV-D68.</p></div><p><a href=\"https://arstechnica.com/?p=2000954#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2000954&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"863bdd8f7a83f7b8fe3c245b6d71392078014f04dd42b3107c29b42e10cfa8a2","category":"Tech"}