{"title":"Geospatial interpolation and hydro-geochemical characterization of alluvial aquifers in the Thal Desert, Punjab, Pakistan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307025","date":1723644000000,"content":"<p>by Irfan Raza, Perveiz Khalid, Muhammad Irfan Ehsan, Qazi Adnan Ahmad, Shahzada Khurram, Rabia Zainab, Salman Farooq</p>\r\n\r\nThis study seeks to assess the hydrogeochemical characteristics of groundwater in the southern part of Thal Desert of Pakistan. The primary focus lies in identifying potential sources of contamination and evaluating their impact on groundwater and the ecosystem. Groundwater samples were collected from diverse sources including shallow hand pumps, tubewells, and dug wells, with depths ranging from 11 to 28 m. A comprehensive analysis was performed to scrutinize the physical, chemical, and microbial attributes of the samples. Utilizing visual aids like the Piper, Durov, and Gibbs diagrams, as well as Pearson correlation, scatter plots, Schoeller diagrams, and pie charts, the study evaluated the groundwater quality and its suitability for consumption. Results indicate that mineral infiltration from rainfall, domestic waste, and industrial effluents significantly affects groundwater quality, leading to widespread salinity. Weathering processes and ion exchange were identified as key factors contributing to elevate levels of bicarbonates, sodium, magnesium, and chloride ions. Employing the Water Quality Index (WQI) on 40 groundwater samples, findings reveal that 52.5% of samples demonstrated poor to not suitable quality, with 27.5% categorized as poor, 2.5% as very poor, and 22.5% not suitable consumption. Conversely, 47.5% of samples showcased good to excellent quality, with 25% rated as good and 22.5% as excellent. These findings provide valuable insights for hydrogeologists to develop appropriate strategies for water treatment and address any concerns related to groundwater quality.","author":"Irfan Raza","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"863ca9d965fc60369633d501d997757a79cb5c20e59d8f477676b516c0449889","category":"Interdisciplinary"}