{"title":"Yann LeCun and the AI Gold Rush","link":"https://markpeak.net/yann-lecun-and-the-ai-gold-rush/","date":1676346721000,"content":"<p>Yann LeCun เป็นนักวิจัยด้าน AI ชื่อดังของวงการ เขาเป็นคนฝรั่งเศส ที่บุกเบิกเรื่อง computer vision และ convolutional neural networks (CNN) มายาวนาน</p>\n<p>คนที่เริ่มต้นศึกษาเรื่อง AI, machine learning, deep learning ยุคใหม่ อาจเคยต้องฝึกให้โมเดลของเราเทรนภาพ 0-9 ที่เขียนด้วยลายมือ แล้วนำโมเดลไปแยกแยะลายมือในอนาคต ตัวอย่างนี้เทียบได้กับ Hello World ของโลก AI</p>\n<p>ตัวไฟล์ภาพลายมือ 0-9 ที่ใช้เทรนกัน มีชื่อเรียกว่า <a href=\"https://www.tensorflow.org/datasets/catalog/mnist\">MNIST dataset</a> ซึ่งพัฒนาและรวบรวมโดย LeCun คนนี้เอง</p>\n<p>ประวัติการทำงานของ LeCun คือจบปริญญาเอกจากมหาวิทยาลัย Sorbonne ในปารีส แล้วมาทำงานกับ AT&amp;T Bell Labs จนถึงปี 1996 จากนั้นย้ายมาอยู่วงการวิชาการ เป็นอาจารย์ที่ New York University (NYU) และปี 2013 ย้ายไปเป็นหัวหน้านักวิจัยด้าน AI ของ Facebook/Meta จนถึงปัจจุบัน (<a href=\"https://www.linkedin.com/in/yann-lecun/\">ประวัติบน LinkedIn</a>)</p>\n<p>LeCun มีผลงานวิชาการมากมาย <a href=\"https://scholar.google.com/citations?user=WLN3QrAAAAAJ&amp;hl=en\">จำนวน citation ใน Google Scholar</a> คือเกือบ 3 แสนรายการ คำว่า Deep Learning ก็โด่งดังขึ้นมาจาก<a href=\"https://www.nature.com/articles/nature14539\">เปเปอร์ของเขาในปี 2015</a> ถึงแม้เขาไม่ใช่คนคิดคำนี้ขึ้นมาเป็นคนแรก แต่ก็ถือเป็นบุคคลสำคัญของวงการ AI ของโลก โดยเฉพาะสาย Deep Learning</p>\n<p>ทีมผู้เขียนเปเปอร์ฉบับปี 2015 คือ LeCun ร่วม Yoshua Bengio และ Geoffrey Hinton (เป็นอาจารย์ postdoc ของ LeCun) ได้รับรางวัล Turing Award ซึ่งเทียบได้กับรางวัลโนเบลของสาขาวิชาคอมพิวเตอร์ เมื่อปี 2018 (<a href=\"https://en.wikipedia.org/wiki/Turing_Award\">รายชื่อผู้ที่เคยได้รางวัลทั้งหมด</a>)</p>\n<p>ทั้งหมดทั้งปวงที่กล่าวมา เพื่อจะบอกว่า LeCun ถือเป็นหนึ่งใน godfather คนสำคัญของวงการ AI โลก เกียรติประวัติเพียบพร้อมทุกด้าน</p>\n<p>แต่หลังจากโลกเข้าสู่ยุค “ตื่นทอง AI” ในช่วงปลายปี 2022 เป็นต้นมา จากการเปิดตัว ChatGPT ของ OpenAI ทำให้เกิดการแข่งขันในหมู่บริษัทยักษ์ใหญ่ ไม่ว่าจะเป็น Microsoft + OpenAI vs Google หรือแม้แต่ Meta ที่ LeCun ทำงานอยู่ก็ตาม</p>\n<p>LeCun เป็นนักวิจัย-นักวิชาการคนสำคัญ ที่ออกมาวิจารณ์ ชี้แจง ให้ข้อมูลว่าข้อจำกัดของ GPT ในทางเทคนิคมันคืออะไร (เพราะแกรู้จริงเรื่องนี้)</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.blognone.com/node/132371\">\n\t\t\t\t\t<img src=\"https://markpeak.net/wp-content/plugins/content-cards/skins/default/content-cards-placeholder.png\" alt=\"Just a moment...\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.blognone.com/node/132371\">\n\t\t\tJust a moment...\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.blognone.com/node/132371\">\n\t\t\t\t\t</a>\n\t</div>\n\t<div>\n\t\t\t\twww.blognone.com\t</div>\n</div>\n<p>แต่ตามภาษิตโบราณว่าเอาไว้ “น้ำเชี่ยวอย่าไปขวางเรือ” ในยุคที่มหาชนกำลังตื่นเต้นกับ AI กันอย่างบ้าคลั่ง (เราน่าจะอยู่ในระดับที่ใช้คำนี้ได้แล้ว) การออกมาวิจารณ์ของ LeCun ย่อมนำไปสู่สิ่งที่คาดเดากันได้ไม่ยากว่า “ทัวร์ลง”</p>\n<p>อย่างไรก็ตาม ผมคิดว่าความเห็นของ LeCun นั้นเที่ยงตรง เฉียบคม มองเห็นสภาพความเป็นจริง และให้มุมมองเรื่องทางเทคนิคได้เป็นอย่างดี จึงขอแสดงตัวอย่างเป็นทางการในที่นี้ว่า เห็นด้วยกับความเห็นของ LeCun ทุกประการ</p>\n<p>และอยากแนะนำให้ทุกคนที่สนใจเรื่อง AI ในปี 2023 ควรตามอ่านความเห็นของ Lecun ในทวิตเตอร์กันอย่างจริงจัง (แต่พี่ทำงานอยู่ Meta นะ)</p>\n<blockquote>\n<p>My unwavering opinion on current (auto-regressive) LLMs<br />1. They are useful as writing aids.<br />2. They are \"reactive\" &amp; don't plan nor reason.<br />3. They make stuff up or retrieve stuff approximately.<br />4. That can be mitigated but not fixed by human feedback.<br />5. Better systems will come</p>\n<p>— Yann LeCun (@ylecun) <a href=\"https://twitter.com/ylecun/status/1625118108082995203?ref_src=twsrc%5Etfw\">February 13, 2023</a></p></blockquote>\n<p></p>\n<blockquote>\n<p>13. Why do LLMs appear much better at generating code than generating general text?<br />Because, unlike the real world, the universe that a program manipulates (the state of the variables) is limited, discrete, deterministic, and fully observable.<br />The real world is none of that.</p>\n<p>— Yann LeCun (@ylecun) <a href=\"https://twitter.com/ylecun/status/1625127902890151943?ref_src=twsrc%5Etfw\">February 13, 2023</a></p></blockquote>\n<p></p>\n<p>สรุปความเห็นของ LeCun ต่อยุคสมัยแห่ง ChatGPT</p>\n<ul>\n<li>Large Language Model (LLM) ชื่อมันก็บอกว่าเป็น language model คือทำความเข้าใจภาษา</li>\n<li>โมเดล LLM ทั้งหลายจึงเก่งเรื่องภาษา แต่งคำ แต่งเรื่อง คีย์เวิร์ดสำคัญคือ “แต่งเรื่อง” (make stuff up)</li>\n<li>แต่มันไม่เก่งเรื่องการให้เหตุผล (reasoning) ซึ่งอาจมีในโมเดลประเภทอื่นที่ไม่ใช่ LLM</li>\n<li>ดังนั้น มันเป็นโมเดลที่ “ปั้นเรื่อง” เก่งมาก ดูน่าเชื่อถือ แต่อาจไม่เป็นความจริง</li>\n<li>เราควรมอง LLM เป็นตัวช่วยเขียนเรื่อง (writing aid) แต่ไม่ใช่ตัวตอบคำถามที่หวังจะบอกความจริงของจักรวาลได้</li>\n<li>LLM ช่วยเขียนโค้ดโปรแกรมมิ่งได้ดี (e.g. GitHub Copilot) เพราะโปรแกรมมิ่งคือ “ภาษา” ที่มีความเป็นไปได้จำกัดกว่าภาษามนุษย์มาก มีโครงสร้าง กฎระเบียบชัดเจนกว่า</li>\n<li>ในอนาคตเราจะได้เห็นโมเดลอื่นๆ ที่เก่งขึ้นกว่านี้อีกเรื่อยๆ แต่ยังไม่ใช่ตอนนี้</li>\n</ul>\n<p>ทั้งนี้ต้องบอกว่าภาพรวมความเห็น LeCun คือ pro-AI นะครับ เพียงแต่แกวิจารณ์ตัวโมเดล GPT เพียงอย่างเดียวว่าอย่าเพิ่งตื่นเต้นกันไปมาก อย่าเพิ่งอวย OpenAI กันมาก เพราะจริงๆ แล้วมีอย่างอื่นที่น่าตื่นเต้นกว่าในสายงานวิจัยรออยู่เท่านั้นเอง</p>\n<blockquote>\n<p>Good article on LLMs at Forbes.</p>\n<p>The media are starting to agree with my much-criticized statements about LLMs.</p>\n<p>\"LLMs as they exist today will never replace Google Search. Why not? In short, because today’s LLMs make stuff up.\"<a href=\"https://t.co/Cngp2Zyisq\">https://t.co/Cngp2Zyisq</a></p>\n<p>— Yann LeCun (@ylecun) <a href=\"https://twitter.com/ylecun/status/1624898875927527425?ref_src=twsrc%5Etfw\">February 12, 2023</a></p></blockquote>\n<p></p>\n<blockquote>\n<p>Before we reach Human-Level AI (HLAI), we will have to reach Cat-Level &amp; Dog-Level AI.<br />We are nowhere near that.<br />We are still missing something big.<br />LLM's linguistic abilities notwithstanding.<br />A house cat has way more common sense and understanding of the world than any LLM.</p>\n<p>— Yann LeCun (@ylecun) <a href=\"https://twitter.com/ylecun/status/1622300311573651458?ref_src=twsrc%5Etfw\">February 5, 2023</a></p></blockquote>\n<p></p>\n<p>หมายเหตุ: เขียนมาจนจบแล้วเพิ่งเห็นว่า Forbes มีบทความเรื่องเดียวกันเลย</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.forbes.com/sites/cindygordon/2023/01/27/why-yann-lecun-is-an-ai-godfather-and-why-chatgpt3-is-not-revolutionary/?sh=4b52c2de7a64\">\n\t\t\t\t\t<img src=\"https://imageio.forbes.com/specials-images/imageserve/63d46a396541fbda43a89c47/0x0.jpg?format=jpg&amp;width=1200\" alt=\"Why Meta’s Yann LeCun Is An AI GodFather And Why ChatGPT3 Is Not Revolutionary.\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.forbes.com/sites/cindygordon/2023/01/27/why-yann-lecun-is-an-ai-godfather-and-why-chatgpt3-is-not-revolutionary/?sh=4b52c2de7a64\">\n\t\t\tWhy Meta’s Yann LeCun Is An AI GodFather And Why ChatGPT3 Is Not Revolutionary.\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.forbes.com/sites/cindygordon/2023/01/27/why-yann-lecun-is-an-ai-godfather-and-why-chatgpt3-is-not-revolutionary/?sh=4b52c2de7a64\">\n\t\t\t<p>This article summarizes a recent discussion with Yann LeCun discussing why ChatGPT3 is not revolutionary and why AI is not as Smart as a Cat.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://i.forbesimg.com/48X48-F.png\" alt=\"Forbes\" />\t\tForbes\t</div>\n</div>The post <a href=\"https://markpeak.net/yann-lecun-and-the-ai-gold-rush/\">Yann LeCun and the AI Gold Rush</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"f21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"8658cd417ca81e924a5008054181a15911168356abb8a9166add73","category":"Thai"}