{"title":"Arabidopsis CML13 and CML14 Have Essential and Overlapping Roles in Plant Development","link":"https://academic.oup.com/pcp/article/65/2/228/7381625?rss=1","date":1699401600000,"content":"<span><div>Abstract</div>Calmodulin (CaM)-like proteins (CMLs) are the largest family of calcium-binding proteins in plants, yet the functions of most CMLs are unknown. <span>Arabidopsis</span> CML13 and CML14 are closely related paralogs that interact with the isoleucine–glutamine (IQ) domains of myosins, IQ-domain proteins and CaM-binding transcription activators (CAMTAs). Here, we explored the physiological roles of CML13 and CML14 during development by using dexamethasone (Dex)-inducible RNA silencing to suppress either <span>CML13</span> or <span>CML14</span> transcript levels. In the absence of inducible suppression, <span>CML13</span>- and <span>CML14</span>-RNA-interference lines were indistinguishable from wild-type (WT) plants throughout development. In contrast, induction of silencing treatment led to rapid increases in RNA-hairpin production that correlated with a targeted reduction in <span>CML13</span> or <span>CML14</span> transcript levels and a range of developmental and morphological effects. RNA-suppression treatment did not impair the germination of <span>CML13- or 14</span>-RNA-interference lines, but these seedlings were chlorotic, displayed high mortality and failed to achieve seedling establishment. Under Dex treatment, seeds of <span>CML13-</span> and <span>CML14</span>-RNA-interference lines exhibited differential sensitivity to exogenous ABA compared to WT seeds. Induced RNA suppression of mature plants led to reduced silique length, shorter roots and rapid leaf senescence in <span>CML13-</span> and <span>14</span>-RNA-interference plants, which correlated with increased gene expression of the senescence marker <span>Senescence-Associated Gene13</span> (<span>SAG13</span>). Plants induced for RNA suppression at 2 weeks post-germination exhibited a much stronger phenotype than treatment of 3-, 4- or 5-week-old plants. Collectively, our data indicate that both CML13 and CML14 are essential for normal development and function across a broad range of tissues and developmental stages.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"865a8ef70efdd23cdd422c740468c34d0e8d6139c531eda803839c4133658b65","category":"Environment"}