{"title":"Unified Approach to Standards-Based Absolute Quantification of EDX and EEL Spectra of Nanoscale Materials in STEM and STEM-in-SEM","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.322/7720467?rss=1","date":1721779200000,"content":"<span>With global trends toward miniaturization and increased architectural complexity of electronic devices and dozens of new nanoscale materials appearing worldwide every month due to nanotechnology advances in batteries, sensors, quantum materials, and catalysts, it is often necessary to correlate the properties of nanostructures with the desired functionality and performance. Most analytical metrologies currently rely on calibration and/or analytical standard reference materials (SRMs) but only a few standards are available on the nanoscale. Analytical SRMs are of special importance for energy-dispersive X-ray (EDX) analysis of nanomaterials in a scanning transmission electron microscope (STEM). The standards-based <span>ζ</span>-factor quantification method in analytical STEMs offers significant advantages over the Cliff-Lorimer approach [<a href=\"#ozae044.322-B1\">1</a>, <a href=\"#ozae044.322-B2\">2</a>]. Employing pure element or multi-element thin-film standards, <span>ζ</span>-factor quantification makes it possible to simultaneously include an X-ray absorption correction and to measure the mass-thickness The <span>ζ</span>-factor is related to the element mass fraction <span>C</span><sub>x</sub>, mass-thickness <span>ρt</span>, the ratio of the observed element X-ray intensity <span>Ix</span>, and the dose, <span>De = i</span>τ/<span>e</span>, where <span>ρ</span> is the total density, <span>t</span> is the film thickness, <span>i</span> is the probe current, <span>τ</span> is the exposure, and <span>e</span> is the electron charge:</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"865dd1c66f914dafab8dce42a45ed3d8e7ba4c72e0761d1728d700b957f40697","category":"Environment"}