{"title":"Burden of undernutrition among under-five Bengali children and its determinants: Findings from Demographic and Health Surveys of Bangladesh and India","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301808","date":1712325600000,"content":"<p>by Ramendra Nath Kundu, Md. Golam Hossain, Md. Ahshanul Haque, Rashidul Alam Mahumud, Manoranjan Pal, Premananda Bharati</p>\r\nBackground <p>Globally, undernutrition is the leading cause of mortality among under-five children. Bangladesh and India were in the top ten countries in the world for under-five mortality. The aim of the study was to investigate the nutritional status of Bengali under-five children.</p> Methods <p>Data on 25938 under-five children were retrieved from the Bangladesh Demographic and Health Survey 2017–18 (BDHS) and the National Family Health Survey of India 2015–16 (NFHS-4). Stunting, wasting, underweight and thinness were considered to understand the nutritional status of under-five children. Binary logistic regression was used to identify associated factors of undernutrition among children.</p> Results <p>Over one-quarter of Bengali under-five children were found to be suffering from the problem of stunting (31.9%) and underweight (28.1%), while other nutritional indicators raised serious concern and revealed inter-country disparities. In the cases of wasting, underweight and thinness, the mean z-scores and frequency differences between Bangladesh and India were significant. The nutritional status of Bengali under-five children appeared to have improved in Bangladesh compared to India. Child undernutrition had significant relations with maternal undernutrition in both countries. Girls in Bangladesh had slightly better nutritional status than boys. In Bangladesh, lack of formal education among mothers was a leading cause of child undernutrition. Stunting and underweight coexist with low household wealth index in both counties.</p> Conclusions <p>The research revealed that various factors were associated with child undernutrition in Bengalis. It has been proposed that programmes promoting maternal education and nutrition, along with household wealth index be prioritised. The study recommends that the Governments of Bangladesh and India should increase the budget for health of children so as to reach the sustainable development goals.</p>","author":"Ramendra Nath Kundu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"865d8184aa36e6c21bbaf8ba6409ce1d8ffccb4b9d0e51b9f3c406da79addded","category":"Interdisciplinary"}