{"title":"UCI Track Champions League: did it really work?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-track-champions-league-did-it-work","date":1638804208000,"content":"\n      <p><span>When the UCI Track Champions League was announced earlier this year, organisers, founders and sponsors made many promises. They boasted a shorter, more understandable format, an interactive app available for fans to support their favourite riders, big prize pots and nights of unrivalled entertainment.</span></p>\n<div></div>\n<p><span>Senior Vice President at Discovery Sports François <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/will-the-uci-track-champions-league-revolutionise-the-sport\">Ribeiro told Rouleur</a> back in September that the event would be something that has “never been done before in track cycling”, brandishing the sport as one of the best kept secrets that had seriously untapped potential. Ribeiro was absolutely certain that snappy, exciting races and a modern display of lights, technology and broadcasting would catapult a traditional sport into today’s world, attracting a wider audience, both new and old, to the series.</span></p>\n<p><span>The league concluded in London this weekend with a sold-out double header, crowds flocked to the Lee Valley velodrome to see who would take the spoils. The London round ended up as the finale of the series, with the scheduled final round in Tel Aviv being cancelled due to the country’s Covid-19 restrictions. </span></p>\n<p><span>With the winners of each league now decided, and the league over for another year, it’s time to assess if the promise of a revolutionary event was fulfilled. Were fans engaged? Was the presentation of the sport elevated? Does live data really enhance the event experience? We analyse below.</span></p>\n<h4><b>The format</b></h4>\n<p><span>The story of the inception of the UCI Track Champions League began at a Track World Cup some years ago. Ribeiro sat in the grandstands, watching the racing as a spectator with a notepad and pen, making a list of every improvement he believed needed to be made to make the racing more engaging. As a newcomer to track cycling, he only fully understood the concept behind four races: the scratch, the elimination, the sprint and the keirin. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/will-the-uci-track-champions-league-revolutionise-the-sport\">Related: Can the UCI Track Champions League bring velodromes back to life?</a></em></strong></p>\n\n<p><span>He shared this with the UCI, explaining that he believed the Champions League would only lead to change if they distilled the current World Cup format, waving goodbye to complicated Madison and Points races, keeping things fast and simple. The distance of races was also slashed too, with scratch races in the Track Champions league lasting for only 20 laps, much shorter than riders are used to. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WP5_3065_1_1024x1024.jpg?v=1638647565\" /><em>Image: Alex Whitehead/SWpix</em></span></p>\n<p><span>These 5km races certainly kept things exciting throughout the night, with fans having little time to wait until the finale of the race. Watching the crowd roar home Katie Archibald in London, it became clear that this shorter race is ideal for putting on an exhibition. However, the smaller distance can make long-range attacks and lap gains all the more difficult. The chances of taking a lap are slim, with many of the scratch races ending in a bunch gallop for the line. This means the race favours the faster riders: those with a fiery sprint rather than an endurance base.</span></p>\n<p><span>It could be that with this distilled format, track cycling becomes a discipline more suited to sprinters. The transition from road racing on to the track is largely going to be made more difficult as more focus will be needed on the short explosive gallop to the finish line. Can we keep calling these races ‘endurance’ if they are only 5km long? It’s possible that some of the best kierin or sprint riders could win them should it be a steadier race.</span></p>\n<p><span>Though it seemed to please fans, the Tour de France would likely be more interesting to watch if each stage was shortened to 20km, but this would take away the art and history of the race. The short scratches work for an event which is for entertainment purposes, but takes away some of the tactical and physical elements that make scratch races traditionally challenging. Arguably, if it was replicated across all track cycling competitions, this new, shorter format could greatly change the sport and who is competing in it. </span></p>\n<p><span></span><b>The riders</b></p>\n<p><span>Speaking to Ribeiro before the League started, he explained that he understood the importance of incentivising riders to attend each round and race to the best of their abilities. With this in mind, the prize pot for the event exceeded €500,000 overall and there were UCI points on offer for each race, helping riders towards qualifications for other events and catapulting them up the UCI rankings overall.</span></p>\n<p><span>Such healthy rewards paid off: the races have been fast and furious, with riders vying for every point on offer. There has been no jokey showboating in the keirin or sprint races, but instead riders seem to be approaching it with the seriousness they would a major competition. In the endurance races, the speed in the elimination and scratch events has been on par with World Championships, proving that the riders are giving the League their all.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/KB-SW1_0146_1024x1024.jpg?v=1638647244\" /><em>Image: Simon Wilkinson/SWpix</em></span></p>\n<p><span>One drawback of the fast paced nature of the events is the demanding schedule that comes with it – riders have had to travel to each round, sometimes in different continents, in short spaces of time while preparing for the competition. Olympic Gold medallist Ed Clancy has been vocal about how tiring he has found the racing schedule, and various riders were unable to make it to the final round due to illness.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/katie-archibald-on-cut-throat-selection-processes-coping-with-success-and-paris-2024?_kx=\">Related: Katie Archibald on cut-throat selection processes, coping with success and Paris 2024</a></em></strong></p>\n<p><span>In addition, some categories have been largely dominated by individual riders, with some of the biggest names in track cycling not competing. In the women’s endurance category, for example, Olympic Omnium Champion Jennifer Valente did not take part and neither did five-time Olympic Gold medallist Laura Kenny. In the men’s endurance category, none of the riders who finished on the podium in Olympic Omnium were competing in the Track Champions League.</span></p>\n<p><span>It could be that this year’s event simply falls at a difficult time in the Olympic cycle, with many athletes opting to take a break after the extended five-year lead up to Tokyo. While the riders in the event this year have put on a fantastic show, more strength in depth in the field in future years will only elevate the racing further.</span></p>\n<h4><b>The fan experience</b></h4>\n<p><span>It’s fair to say that the fan experience is where the UCI Track Champions League has excelled this year. Both those watching in the velodrome and on GCN/Eurosport at home have had their attention held by the snappy format. Long waits in between races while commissaires calculate points from Madisons are not to be seen, as the racing moves quickly. The TV presentation has been impressive too, with interviews with riders and videos explaining the format interspersed through the evening.</span></p>\n<p><span>Analysis of rider data has been a big part of the UCI Track Champions League package. The partnership with Whoop, a fitness tracker that measures strain, recovery, and sleep, has given never seen before insight into races. Seeing how riders have slept the night before and how much effort they are exerting in the final stages adds an entirely new depth to the event and one that has been much appreciated from fans. “We have only scratched the surface of what we have in mind for live data, we are not even 10% of where we want to be in 2 or 3 years from now,” </span><span>Ribeiro</span> explained in a recent press conference.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WP5_3349_1024x1024.jpg?v=1638647524\" /><em><span>Image: </span>Will Palmer/SWpix</em></p>\n<p><span>Pre-event promotion and the promise of an evening of entertainment for all led to impressive ticket sales for each round of the League. What pleased </span><span>Ribeiro</span> most, however, was that 50% of the crowd in the Majorca round saw track cycling for the first time, raising the profile of the sport in the way Discovery sport had hoped. He also revealed that a mini-series focussing on the events will be released in early 2022. Named “Back on Track” the programme will follow the rivalries and journeys that riders embark on away from the racing, taking inspiration from the Netflix series “Drive to Survive” about Formula One.</p>\n\n<p><span><strong><em><a href=\"https://www.rouleur.cc/blogs/desire-journal/seen-in-the-wild-team-gbs-hope-s-hb-t-track-bike\">Related: Jason Kenny's Olympic Gold HB.T Track Bike</a></em></strong></span></p>\n<p><span>While the UCI Track Champions League and its new format isn’t going to be for all, especially the purists of the sport who value track cycling’s traditions, it is absolutely necessary to keep the sport alive. It’s broadening the audience and making it watchable for more people worldwide. Most importantly, it could finally be the first step for a business model that is commercially viable year-long, for a discipline that was in danger of dying out. </span></p>\n<p>By placing so much focus on the fan experience with engaging racing, interactivity and insight, the UCI Track Champions League has aimed to rip up the script. We'd call it a success so far, and we look forward to an altogether new story unfolding in the world of track cycling.</p>\n<p><em><span>Cover image: </span>Alex Whitehead/SWpix</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"865ee6d9331a5feaf9fa7ac8e4482dd1d0bb27b533e445fe21a8ddc3b7d2ac62","category":"Cycling"}