{"title":"Self‐assembled α‐lactalbumin nanostructures: encapsulation and controlled release of bioactive molecules in gastrointestinal in vitro model","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13784?af=R","date":1722847755000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Implementing encapsulation techniques is pivotal in safeguarding bioactive molecules against environmental conditions for drug delivery systems. Moreover, the food-grade nanocarrier is a delivery system and food ingredient crucial in creating nutraceutical foods. Nano α-lactalbumin has been shown to be a promissory nanocarrier for hydrophobic molecules. Furthermore, the nanoprotein can enhance the tecno-functional properties of food such as foam and emulsion. The present study investigated the nanostructured α-lactalbumin protein (nano α-la) as a delivery and controlled release system for bioactive molecules in a gastric-intestinal <i>in vitro</i> mimic system.</p>\n<h2>RESULTS</h2>\n<p>The nano α-la was synthesized by a low self-assembly technique, changing the solution ionic strength by NaCl and obtaining nano α-la 191.10 ± 21.33 nm and a spherical shape. The nano α-la showed higher encapsulation efficiency and loading capacity for quercetin than riboflavin, a potential carrier for hydrophobic compounds. Thermal analysis of nano α-la resulted in a Δ<i>H</i> of −1480 J g<sup>−1</sup> for denaturation at 57.44 °C. The nanostructure formed by self-assembly modifies the foam volume increment and stability. Also, differences between nano and native proteins in emulsion activity and stability were noticed. The release profile <i>in vitro</i> showed that the nano α-la could not hold the molecules in gastric fluid. The Weibull and Korsmeyer-Peppas model better fits the release profile behavior in the studied fluids.</p>\n<h2>CONCLUSION</h2>\n<p>The present study shows the possibility of nano α-la as an alternative to molecule delivery systems and nutraceutical foods' formulation because of the high capacity to encapsulate hydrophobic molecules and the improvement of techno-functional properties. However, the nanocarrier is not perfectly suitable for the sustainable delivery of molecules in the gastrointestinal fluid, demanding improvements in the nanocarrier. © 2024 Society of Chemical Industry.</p>","author":"Jhonatan Rafael de Oliveira Bianchi, \nDaniela Leite Fabrino, \nCristiane Medina Finzi Quintão, \nJane Selia dos Reis Coimbra, \nIgor José Boggione Santos","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8674d3f73e4682b13ec9a476dd78738e97944a6ad3154757e4df0b7e1b92042e","category":"Environment"}