{"title":"Sinopharm รายงานประสิทธิภาพวัคซีนพร้อมกันสองรุ่น ประสิทธิภาพ 72.8% และ 78.1%","link":"https://www.blognone.com/node/122888","date":1622115509000,"content":"<div><div><div><p>วันนี้ทาง Sinopharm ผู้ผลิตวัคซีน COVID-19 ตีพิมพ์รายงานการทดสอบเฟสสามของวัคซีนสองตัว คือ WIV04 (5 µg/dose) และ HBO2 (4 µg/dose) พร้อมกัน จากการทดสอบประสิทธิภาพในสหรัฐอาหรับเอมิเรตส์</p>\n<p>งานวิจัยมีผู้ร่วมทั้งหมด 40,411 ราย แบ่งเป็นสามกลุ่มเท่าๆ กัน และเริ่มวัดประสิทธิภาพวัคซีนหลังได้รับโดสที่สองไปแล้วสองสัปดาห์ โดยติดตามผลหลังโดสที่ 2 นาน 90 วัน พบว่าผู้ติด COVID-19 แบบมีอาการ อยู่ในกลุ่มผู้ได้วัคซีน WIV04 จำนวน 26 คน อยู่ในกลุ่มผู้ได้วัคซีน HBO2 จำนวน 21 คน และกลุ่มที่ได้ยาหลอกจำนวน 95 คน กลุ่มประชากรของผู้เข้าร่วมทดลองในงานวิจัยนี้ไม่กระจายตัวเท่าประชากรทั่วไปนัก โดยผู้ร่วมทดสอบ 98.4% มีอายุต่ำกว่า 60 ปี และ 84.5% เป็นผู้ชาย</p>\n<p>ผลการทดลองทำให้ได้ค่ากลางประสิทธิภาพของวัคซีน WIV04 คิดเป็น 72.8% ของวัคซีน HBO2 คิดเป็น 78.1%</p>\n<p>วัคซีนของ Sinopharm นั้นได้รับรองจาก WHO ให้ใช้งานในโครงการ COVAX ได้แล้วหนึ่งตัวที่ผลิตโดย Beijing Bio-Institute of Biological Products ไม่แน่ชัดว่า WHO รับรองตัวใดในสองตัวนี้</p>\n<p>ที่มา - <a href=\"https://jamanetwork.com/journals/jama/fullarticle/2780562\">JAMA</a>, <a href=\"https://www.bloomberg.com/news/articles/2021-05-27/china-s-sinopharm-publishes-awaited-covid-vaccine-study-details\">Bloomberg</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/14e5587c50a08cb1cd4430e0bb5fb6c7.jpg\" /></p>\n<p>กราฟแสดงปริมาณคนติด COVID-19 แบบมีอาการในกลุ่มประชากรต่างๆ ภาพบนเป็นข้อมูลเมื่อนับหลังได้รับวัคซีนเข็มที่สองไปแล้วสองสัปดาห์ ภาพล่างนับตั้งแต่ได้รับเข็มแรก</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/covid-19\">COVID-19</a></div><div><a href=\"/topics/china\">China</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"868aaffa513d05c3cd0c437d783395af46553890e150543bab5083a9e8a03825","category":"Thai"}