{"title":"Race Ranger Hands-On: To Be Used At Ironman Florida This Weekend","link":"https://www.dcrainmaker.com/2023/11/race-ranger-hands-on-ironman-florida-weekend.html","date":1698943314000,"content":"<p></p>\n<p>It’s <a href=\"https://www.dcrainmaker.com/2021/11/triathlon-anti-drafting-technology-system-unveiled-by-raceranger.html\">been a few years</a> since I last talked about <a href=\"https://www.raceranger.com/\">Race Ranger,</a> the triathlon-focused tech company that puts sensors on bikes to help athletes and refs more precisely determine and avoid the draft zone (which isn’t legal in most long-course triathlon). The system has been slowly gaining traction in various races over the last two years, primarily in the professional athlete category, where real money and income is on the line. And this weekend, by far the most prominent race to date is going to occur: All pros at Ironman Florida are being equipped with Race Ranger.</p>\n<p>Of course, as noted, this isn’t the first time the platform is being used in the pro field, or on the world scene. Just five weeks ago it was used at the World Triathlon Paratriathlon Champs in Pontevedra, Spain. And it’s also been used in numerous other long-course events, such as the PTO European Open this past spring. It was even used in Ironman New Zealand earlier this year, and Ironman 70.3 Geelong Australia in April. But in terms of visibility and pro scene prestige, Ironman Florida this year is a big one with a packed field. It’s also the first time Ironman Head Referee/Official Jimmy Riccitello will be seeing the system hands-on, or rather, from being on the back of a moto next to it.</p>\n<p>So, with that historical explainer laid out, I figured I’d take a moment to dive into the tech a bit and how it works. Back a month ago I got the chance to try it out in-person, alongside my wife, dropping in and out of the draft zone to precisely show and get an understanding for the system.</p>\n<p>Note that while an eventual end-goal (years) would be for every athlete to have this system in a race, the near-term goal is really focused on the pro scene, where money is on the line (and thus, dinner on a table). But technologically speaking, there’s no limit to the number of competitors in the system, or using it.</p>\n<p><strong>General Overview:</strong></p>\n<p><img title=\"DSC_8319.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8319.jpg\" alt=\"DSC 8319\" width=\"720\" height=\"480\" /></p>\n<p>First a one-paragraph primer on drafting in triathlon. For virtually all long-course triathlon (basically, triathlon that has a bike component 56 miles or longer, such as an Ironman at 112 miles), these races are <strong>not</strong> draft legal. That means that you can only enter the draft zone of another cyclist in front of you for a brief period (usually 15-20 seconds, depending on the exact race specifics). If you fail to complete the pass in that timeframe, then you can receive a penalty if an official catches you. The draft zone will extend backwards usually 10-15 meters behind a cyclist. Again, the exact distance depends on the specific race. And finally, while attempting to complete the pass, if the athlete in front of you blocks your attempt, they can actually be cited instead. Note that once you ‘enter’ the draft zone, the *ONLY* way out is forward. You can’t dip into the zone, and exit again.</p>\n<p>All of this matters because most people are not great at knowing exactly how far 15 meters is, relative to the person in front of them, while flying down the roadway. This can sometimes also extend to officials/refs. Back two months ago at the 2023 Ironman 70.3 World Championships in Finland, one professional athlete posted after the race pleading for the Race Ranger system after she received two draft penalties which she didn’t believe she was in the draft zone for. This is one of the rare scenarios where both pro athletes and race officials alike actually agree upon something: Using tech to make their jobs easier and more clear/fair.</p>\n<p>Got all that? Good, let’s talk the tech details then.</p>\n<p>The Race Ranger system is currently composed of two pods which affix via zip-ties to an athlete’s bike. These pods then communicate in a mesh network with each other, but also with tablets that officials/refs have, which track in real-time the separation between cyclists. Each of these pods is roughly the size of a medium donut, and has lights on it, which indicate various states (more on that in a second):</p>\n<p><img title=\"DSC_8316.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8316-1.jpg\" alt=\"DSC 8316\" width=\"720\" height=\"480\" /></p>\n<p>The stickers on the side are simply added/removed per race, and the system can be installed in mere seconds. I watched as the founder of Race Ranger, James Elvery, installed it quickly on both my bike and my wife’s bike. It took only a few seconds longer than a typical ref safety check of one’s bike that’s done during bike check-in to transition.</p>\n<p><img title=\"DSC_8315.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8315.jpg\" alt=\"DSC 8315\" width=\"720\" height=\"480\" /></p>\n<p>While some have raised concerns about the pod impacting the aerodynamics of a bike, one has to remember this is applied to all bikes equally. Certainly, each bike frame could impact aerodynamically slightly differently with the pod, but that’s true of other race-required components like race number stickers that flutter off the back of the seat post, which this would replace, as it has the race number on it.</p>\n<p>These pods use WiFi, Bluetooth, GPS, and UltraWideBand signals, all blended together at different points, to pinpoint the exact location of a rider in relation to others. I’ll dive into that later.</p>\n<p>Instead, the key thing to know is that the exact distances are configurable. In the scenario I was using it with, the pods had just come from World Triathlon Paratriathlon Champs in Pontevedra, Spain. And thus were set up for three specific warning triggers. First, was a trigger at 15 meters, then 12 meters, then 10 meters to began the draft zone. So, in essence, orange is saying “Yo, wake-up”, blue is telling you that you’re about to hit the draft zone, and red means you’re in the draft zone. Here you can first see the orange:</p>\n<p><img title=\"vlcsnap-2023-11-02-16h46m04s305.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-02-16h46m04s305.jpg\" alt=\"Vlcsnap 2023 11 02 16h46m04s305\" width=\"720\" height=\"480\" /></p>\n<p>Then the blue:</p>\n<p><img title=\"vlcsnap-2023-11-02-16h46m09s753.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-02-16h46m09s753.jpg\" alt=\"Vlcsnap 2023 11 02 16h46m09s753\" width=\"720\" height=\"480\" /></p>\n<p>And finally red:</p>\n<p><img title=\"vlcsnap-2023-11-02-16h46m18s793.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-02-16h46m18s793.jpg\" alt=\"Vlcsnap 2023 11 02 16h46m18s793\" width=\"720\" height=\"480\" /></p>\n<p>As you approach the cyclist in front of you, you’ll be looking at THEIR pod on the back of THEIR bike, not your own pods. This makes sense, as you’d be naturally looking ahead towards those bikes anyway. Here, you can see the coloring on the cyclist in front of me:</p>\n<p><img title=\"vlcsnap-2023-11-02-16h44m54s765.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-02-16h44m54s765.jpg\" alt=\"Vlcsnap 2023 11 02 16h44m54s765\" width=\"720\" height=\"405\" /></p>\n<p>Watching a few passes (and doing a few myself), it’s impressively precise. Pretty much as soon as I get beyond the front wheel of the cyclist in front of me (passing them), it clears. It has similarities in execution from a user experience standpoint to Garmin’s Varia radar, except that you’d never really see the ‘all clear’ function, because it’s on the rear of the bike you just passed.</p>\n<p>In the event that you are passing multiple people, you’ll see red on multiple bikes, and you’ll clear them individually. Note the red light on both bikes here. While this was a GoPro shot, the lights are super easy to see quite far away.</p>\n<p><img title=\"vlcsnap-2023-11-02-16h47m11s183.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-02-16h47m11s183.jpg\" alt=\"Vlcsnap 2023 11 02 16h47m11s183\" width=\"720\" height=\"480\" /></p>\n<p>What’s cool about this is that everyone else can easily see these lights as well – most notably the officials on a moto. Thus, they don’t have to take out their imaginary tape measure, but rather, can simply look at the lights on the cyclist that’s being passed, alongside a timer. However, Race Ranger has gone a step further and has an entire tablet app that will show details on each athlete, including the passing time. Thus an official could see/track exactly how long each pass is taking, and do so either right next to the athlete, or from a distance.</p>\n<p>The company claims a range of about 10KM – which is pretty darn far. Obviously, most refs are going to focus on athletes within likely just 30-50m.</p>\n<p>And that’s a key thing to understand: At this point, no race organizer or governing body is asking for Race Ranger to go into fully autonomous mode and hand out penalties automatically. And honestly, it doesn’t seem like athletes want that either.</p>\n<p>After all, there are numerous edge case scenarios where race organizers sometimes turn a blind eye to drafting, such as sections of steep climbing where the road might narrow, or other congested areas of a low-speed nature. Sure, drafting should always be avoided in all areas of the course, but there’s also generally a common-sense nature from most refs that being 8-meters behind another competitor going 5MPH up a steep climb has no meaningful draft benefit, especially if the course is overly crowded. Note that the system does have a built-in “No Policing” capability that can be defined for sections of the course.</p>\n<p>So for now, the main advantage of the tech is making it clear if you are or aren’t in the draft zone, as well as making it clear to refs if you are indeed in the draft zone. Finally, there is the ability to show that you have a penalty on the front pod of the system, which would indicate that you’d need to serve that at the appropriate penalty tent on the course. The device will also audibly chirp, and then even cooler is that when you get close to the penalty tent, it’s tied to a large reader-board that’ll automatically show your race number, indicating you have a penalty to serve.</p>\n<p>Of course, the ref would have already made that abundantly clear to you anyway, but it’s a secondary mechanism in place.</p>\n<p><strong>The Tech Involved:</strong></p>\n<p><img title=\"Race-Ranger-OnBike.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/Race-Ranger-OnBike.jpg\" alt=\"Race Ranger OnBike\" width=\"720\" height=\"480\" /></p>\n<p>Now, let’s just dig a little bit deeper on the components and how they work together. Essentially each pod has four types of communication components within it:</p>\n<p>A) GPS<br />\nB) Bluetooth<br />\nC) UltraWideBand (UWB)<br />\nD) LoRa</p>\n<p>Each of those components largely complements each other, but is used in different stages. To begin, LoRa is used as the long-range communications mechanism, for those transmissions upwards of 10KM between devices and to refs. Of course, the system is a mesh network, so it’s pretty unlikely you’d have any competitor on a triathlon course more than 10KM away from any other competitor. Nonetheless, the capability is there. Note, there is no cellular connectivity within it (e.g., no SIM cards).</p>\n<p><img title=\"DSC_8314.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8314-1.jpg\" alt=\"DSC 8314\" width=\"720\" height=\"480\" /></p>\n<p>Next, there’s GPS. GPS is the initial and primary location mechanism for general placement of the athlete. Meaning, it’s using GPS to get a rough idea of where the athlete is, but that’s not actually what’s used in the draft zone validation. GPS isn’t quite accurate enough at all times to be used there (such as in forested areas or cities/etc…). Sure, GPS can be within a meter or so, but again, that’s not good enough in this context.</p>\n<p>Thus, GPS is used to identify where an athlete is generally, and the direction of travel (so it’s not triggering on athletes going a different direction). Then, once an athlete gets within about 30 meters of another athlete, Bluetooth distance ranging kicks in, to start narrowing that down. As the athlete gets closer and closer to the athlete they are passing, it transitions to UWB, which is the final technology component that’s ultra precision.</p>\n<p>Race Ranger says the system is within 10cm of precision, once within that 30-meter range. And measurements update at 10-times per second.</p>\n<p>In addition to the outlined communications tech, the unit also is wirelessly charged, has a battery life longer than any Iron-distance competitor would need, and has accelerometers and NFC for potential future use. The device weight is about 85g.</p>\n<p>The company notes that the hardware you see here is really their first gen variant. Future versions they are working on sound like they’ll be considerably smaller.</p>\n<p><strong>Going Forward:</strong></p>\n<p><img title=\"IronmanKonaWC2023.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/IronmanKonaWC2023.jpg\" alt=\"IronmanKonaWC2023\" width=\"719\" height=\"479\" /></p>\n<p>What is probably the most fascinating element of this system is actually some of the historical data being tracked. Both historical to the entirety of the race, but potentially to the athlete long term. In today’s races, the refs have a tablet which shows not just the nearby athletes and current drafting state, but also a metric that lists how much illegal draft time each competitor has (meaning time beyond the allowed passing time for each pass). This is currently prioritized on the refs tablets to allow them to sort by the worst offenders, and their current position/location on the course.</p>\n<p>This means that a ref can now go find and visit those athletes who are potentially in need of some babysitting. Again, this doesn’t mean those athletes are getting automatic penalties. Instead, it’s delivering on the wish that countless triathletes have always asked for when seeing serial drafters: A ref to just hang out with that person, and finally catch them in the act.</p>\n<p>Looking at Ironman Florida this weekend, the 75 pros racing are all being equipped with the system. However, the refs will not be using the tablets on-moto this weekend. Instead, they’ll be watching the same light-system that athletes do, side-by-side with them.</p>\n<p>However, this race will have a new feature: Downloading all of that data. Race Ranger’s James Elvery says “We should be able to give [Ironman] information like which athlete drafted the most, who they drafted off and for how long, how many times each athlete yo-yo’d (entered a draft zone then backed out) etc”.</p>\n<p>He reiterated again that no penalties will be handed out retroactively. Instead, that data could form the basis of a ‘drafting passport’ of sorts, which gives future race refs athletes to perhaps spend more time on. Those are all conversations that’ll be happening with Ironman following this race, likely with input from pro athletes as well.</p>\n<p>But, those are all things that’ll be worked out in the future. Instead, for both the races it’s been used in already, and now this weekend’s race, the immediate benefits for pros is clarity on exactly where the draft zone starts and ends, and how to avoid a penalty. It’ll be fascinating to see how quickly this technology gets adopted, as more big-name race organizers have started dipping their toe into the water.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"868c051ca547682a5909416ab1e99ad430ce45e8c91854dec5e7bd2ef10f6b7b","category":"Cycling"}