{"title":"Beyond resilience: Responses to changing climate and disturbance regimes in temperate forest landscapes across the Northern Hemisphere","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17468?af=R","date":1724137200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/86d70c03-2298-44f9-94a9-ac452afbea1b/gcb17468-toc-0001-m.png\" alt=\"Beyond resilience: Responses to changing climate and disturbance regimes in temperate forest landscapes across the Northern Hemisphere\" />\n<p>Are forests that experienced frequent disturbances in the past better adapted to changing climate and disturbance regimes, or are they prone to lose resilience in the future? We found that landscapes with historically high disturbance activity were more resilient to climate change. However, resilience generally decreased with increasing severity of climate change across three study landscapes on three continents.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change has profound impacts on forest ecosystem dynamics and could lead to the emergence of novel ecosystems via changes in species composition, forest structure, and potentially a complete loss of tree cover. Disturbances fundamentally shape those dynamics: the prevailing disturbance regime of a region determines the inherent variability of a system, and its climate-mediated change could accelerate forest transformation. We used the individual-based forest landscape and disturbance model iLand to investigate the resilience of three protected temperate forest landscapes on three continents—selected to represent a gradient from low to high disturbance activity—to changing climate and disturbance regimes. In scenarios of sustained strong global warming, natural disturbances increased across all landscapes regardless of projected changes in precipitation (up to a sevenfold increase in disturbance rate over the 180-year simulation period). Forests in landscapes with historically high disturbance activity had a higher chance of remaining resilient in the future, retaining their structure and composition within the range of variability inherent to the system. However, the risk of regime shift and forest loss was also highest in these systems, suggesting forests may be vulnerable to abrupt change beyond a threshold of increasing disturbance activity. Resilience generally decreased with increasing severity of climate change. Novelty in tree species composition was more common than novelty in forest structure, especially under dry climate scenarios. Forests close to the upper tree line experienced high novelty in structure across all three study systems. Our results highlight common patterns and processes of forest change, while also underlining the diverse and context-specific responses of temperate forest landscapes to climate change. Understanding past and future disturbance regimes can anticipate the magnitude and direction of forest change. Yet, even across a broad gradient of disturbance activity, we conclude that climate change mitigation is the most effective means of maintaining forest resilience.</p>\n<h2>抄録</h2>\n<p>気候変動は森林生態系に深刻な影響を及ぼし、樹種構成や森林構造の変化、さらには非森林植生への移行を通じて新たな生態系を出現させる可能性がある。自然撹乱はこのような生態系動態を規定しているだけでなく、撹乱体制が生態系の固有の変動を決定し、さらには気候変動に伴う撹乱体制の変化により森林の変化が加速される可能性がある。本研究では、個体ベースの森林景観・撹乱モデルiLandを用いて、3つの大陸にある、撹乱の規模・頻度・強度などの撹乱活動の程度が異なる3つの自然保護地域を対象に、温帯林の気候および撹乱レジームの変化に対する動態とレジリアンスを精査した。ここでのレジリアンスは、各地域における本来の森林構造と種構成に基づくものである。将来的な温暖化が強度に進行するシナリオでは、予測される降水量の変化にかかわらず、3つの全ての対象景観において自然撹乱が激化した(180年間のシミュレーション期間で撹乱率は最大7倍に増加)。歴史的に撹乱活動が活発であった森林景観は、将来もレジリアンスを維持する可能性が高いことが示唆された。しかし、これらのシステムでは森林消失のリスクが最も高く、撹乱活動の増大による急激な変化に対して森林が脆弱である可能性も示された。総じて、森林生態系のレジリアンスは気候変動の厳しさが増すにつれて低下した。森林構造の変化よりも、森林の樹種構成の変化の方が生じやすく、特に乾燥化する気候シナリオで顕著であった。樹木限界に近い森林では、対象とする3つの森林景観すべてにおいて、森林構造の変化が著しかった。これらの結果は、気候変動に対する大陸をまたいだ温帯林の変化パターンと背景プロセスの共通性を明らかにしたと同時に、気候変動に対する温帯林の多様かつ状況特有の応答を示した。過去と未来の自然撹乱レジームを理解することで、森林変化の大きさと方向性を予測することができる。本研究により、撹乱活動が幅広い勾配をもつ場合でも、気候変動緩和が森林のレジリエンスを維持する効果的な手段であることが示唆された。これらの結果は、気候変動に対する大陸をまたいだ温帯林の変化パターンの共通性と背景プロセスの解明に寄与するものである。気候変動緩和が実現することが最も望ましい一方で、将来的な過去と未来の自然撹乱レジームを理解することも必要である。本研究の成果は、将来的な森林変化の予測に大きく寄与するものである。</p>\n<p>Der Klimawandel hat tiefgreifende Auswirkungen auf die Dynamik von Waldökosystemen und könnte durch Veränderungen der Artenzusammensetzung und der Waldstruktur sowie durch einen möglichen vollständigen Verlust der Baumbestände zur Entstehung neuer Ökosysteme führen. Störungen prägen diese Dynamik grundlegend: Das in einer Region vorherrschende Störungsregime bestimmt die inhärente Variabilität eines Systems, und seine klimabedingte Veränderung könnte die Umwandlung des Waldes beschleunigen. Wir haben das Waldlandschafts- und Störungsmodell iLand verwendet, um die Resilienz dreier geschützter Waldlandschaften der gemäßigten Zonen auf drei Kontinenten zu untersuchen, die so ausgewählt wurden, dass sie einen Gradienten von geringer bis hoher Störungsaktivität repräsentieren. In Szenarien mit anhaltend starker globaler Erwärmung nahmen die natürlichen Störungen in allen Landschaften unabhängig von den prognostizierten Niederschlagsveränderungen zu (bis zu einem siebenfachen Anstieg der Störungsrate über den Simulationszeitraum von 180 Jahren). Wälder in Landschaften mit historisch hoher Störungsaktivität hatten eine höhere Chance, auch in Zukunft widerstandsfähig zu bleiben und ihre Struktur und Zusammensetzung innerhalb der systeminhärenten Variabilität beizubehalten. Allerdings war in diesen Systemen auch das Risiko eines Regimewechsels und eines Waldverlusts am höchsten, was darauf hindeutet, dass die Wälder jenseits einer Schwelle zunehmender Störungsaktivität für abrupte Veränderungen anfällig sein könnten. Die Resilienz nahm im Allgemeinen mit zunehmender Schwere des Klimawandels ab. Neuartigkeit in der Baumartenzusammensetzung war häufiger als Neuartigkeit in der Waldstruktur, insbesondere unter trockenen Klimaszenarien. Wälder in der Nähe der oberen Baumgrenze wiesen in allen drei untersuchten Systemen eine hohe Neuartigkeit der Struktur auf. Unsere Ergebnisse heben gemeinsame Muster und Prozesse des Waldwandels hervor, unterstreichen aber auch die vielfältigen und kontextspezifischen Reaktionen gemäßigter Waldlandschaften auf den Klimawandel. Das Verständnis vergangener und zukünftiger Störungsregime kann das Ausmaß und die Richtung des Waldwandels vorhersagen. Wir kommen jedoch zu dem Schluss, dass die Abschwächung des Klimawandels das wirksamste Mittel ist, um die Widerstandsfähigkeit der Wälder zu erhalten, selbst über einen breiten Gradienten von Störungen hinweg.</p>","author":"Christina Dollinger, \nWerner Rammer, \nKureha F. Suzuki, \nKristin H. Braziunas, \nTimon T. Keller, \nYuta Kobayashi, \nJohannes Mohr, \nAkira S. Mori, \nMonica G. Turner, \nRupert Seidl","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"86938e077243c784b232109afa1936de65079670b1f7b6226072aa4037c05e89","category":"Environment"}