{"title":"Weather permitting, SpaceX will attempt to fly Starship prototype today","link":"https://arstechnica.com/?p=1761496","date":1619795837000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/SN11-Mar-30-2021-0233-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/SN11-Mar-30-2021-0233.jpg\">Enlarge</a> <span>/</span> Engine cutoff, with SN11 entering its bellyflop maneuver, on March 30, 2021. (credit: Trevor Mahlmann)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>SpaceX has received permission from the US Federal Aviation Administration to launch its latest Starship prototype, SN15, and it may attempt to do so as early as Friday afternoon from South Texas.</p>\n<p>The primary concern today is weather, as there are intermittent rain showers due to a stationary front draped over the region. However, some of the higher resolution weather forecast models indicate that conditions could clear up later this afternoon. Perhaps rain will not matter all that much, as SpaceX has not specified the weather conditions under which it will launch Starship. <a href=\"https://arstechnica.com/science/2021/03/spacex-loses-another-starship-prototype-as-landing-sequence-fails/\">One month ago</a>, the company launched its previous prototype, SN11, into a thick bank of fog.</p>\n<p>On Thursday, the FAA said it had approved not just the flight of SN15 to an altitude of about 10 km but the next two vehicles as well. \"The FAA has authorized the next three launches of the SpaceX Starship prototype,\" the federal agency said in a statement. \"The agency approved multiple launches because SpaceX is making few changes to the launch vehicle and relied on the FAA’s approved methodology to calculate the risk to the public.</p></div><p><a href=\"https://arstechnica.com/?p=1761496#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761496&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8695726344ac6a4ec833c67d7a3c4c68b6479baf0459ec19872f5e168772d45d","category":"Tech"}