{"title":"Trends of <i>Mycobacterium tuberculosis</i> and rifampicin resistance at the Ho Teaching Hospital in Ghana","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305161","date":1718028000000,"content":"<p>by John Gameli Deku, Enoch Aninagyei, Israel Bedzina, Gameli Nudo, Emmanuel Ativi, Prosper Mensah, Solomon Wireko, Aaron Osei-Tutu, Emmanuel Duker, Innocent Afeke</p>\r\nBackground <p>Tuberculosis remains a major public health threat worldwide, causing significant morbidity and mortality, particularly in low- and middle-income countries. In recent years, efforts to combat tuberculosis have focused on strengthening healthcare systems and increasing access to diagnostics and treatment services. There is scarcity of data on the prevalence of <i>Mycobacterium tuberculosis</i> and rifampicin-resistant tuberculosis in the Volta region of Ghana. Therefore, the aim of this study was to determine the trends of <i>Mycobacterium tuberculosis</i> and rifampicin resistance in a major teaching hospital in Ghana spanning a six-year period.</p> Methodology <p>A retrospective cross-sectional hospital study was conducted at Ho Teaching Hospital, Ho, Ghana. Study data included archived results on tuberculosis testing using GeneXpert from 2016–2021. Archived data on tuberculosis testing were collected and entered using Microsoft Excel 2019. IBM SPSS (v26) was used for a statistical analysis of the prevalence of tuberculosis. P-value &lt;0.05 was considered statistically significant.</p> Results <p>The study included 5128 presumptive tuberculosis cases from 2016 to 2021, of which 552 were positive, revealing an overall prevalence of 10.76%. Males exhibited a significantly higher prevalence of tuberculosis (14.20%) compared to females (7.48%), with a male-to-female ratio of 2:1. The burden of tuberculosis varied significantly between age groups, with those aged 30–45 years and 46–60 years facing twice the risk compared to those under 15 years (p&lt;0.001). Rainy seasons correlated with heightened tuberculosis occurrences (12.12%) compared to dry seasons (8.84%) (p = 0.008). Rifampicin-resistant tuberculosis was prevalent at 3.45%, slightly higher in women, particularly in the 45–59 age group (5.97%). In particular, tuberculosis prevalence exhibited fluctuations, peaking in 2016 (17.1%) and 2020 (11.5%), with a trough in 2019 (4.6%).</p> Conclusion <p>The overall prevalence of laboratory confirmed tuberculosis was 10.76%, and resistance to rifampicin, 3.45%, indicating high infection and possible treatment failure. Considering its infectious nature, this calls for concerted efforts to curb the spread of the infection.</p>","author":"John Gameli Deku","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"86982e94610a3fe009e7f5c616f59ffd94f6e952a1a41428f0d8266b1a1db83b","category":"Interdisciplinary"}