{"title":"Dopamine has no direct causal role in the formation of treatment expectations and placebo analgesia in humans","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002772","date":1727186400000,"content":"<p>by Angelika Kunkel, Livia Asan, Isabel Krüger, Clara Erfurt, Laura Ruhnau, Elif Buse Caliskan, Jana Hackert, Katja Wiech, Katharina Schmidt, Ulrike Bingel</p>\r\n\r\nDopamine-based reward and learning mechanisms have been suggested to contribute to placebo effects. However, the exact role of dopaminergic neurotransmission in their generation and maintenance is still unclear. This study aimed to shed light on the causal role of dopamine in establishing positive treatment expectations, as well as on the magnitude and duration of their effect on pain. To this end, we used an established placebo analgesia paradigm in combination with 2 opposing pharmacological modulations of dopaminergic tone, i.e., the dopamine antagonist sulpiride and the dopamine precursor L-dopa which were both applied in an experimental, double-blind, randomized, placebo-controlled trial with a between-subject design in <i>N</i> = 168 healthy volunteers. The study medication successfully altered dopaminergic tone during the conditioning procedure. Contrary to our hypotheses, the medication did not modulate the formation of positive treatment expectation and placebo analgesia tested 1 day later. Placebo analgesia was no longer detectable on day 8 after conditioning. Using a combined frequentist and Bayesian approach, our data provide strong evidence against a direct dopaminergic influence on the generation and maintenance of placebo effects. Further exploration of the neurochemical mechanisms underlying placebo analgesia remains paramount in the quest to exploit these effects for optimal treatment outcomes.\r\nTrial registration: ClinicalTrials.gov German Clinical Trials Register, ID: DRKS00029366, https://drks.de/search/en/trial/DRKS00029366.","author":"Angelika Kunkel","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"869f5e811eb4bc06fd889614816611769e70136a17497979b6f4feb8212bd017","category":"Environment"}