{"title":"Experimental Study on Ultra-Low Concentration Methane Regenerative Thermal Oxidation","link":"https://www.preprints.org/manuscript/202403.1248/v1","date":1711021425000,"content":"As a major coal country, China faces the issue of significant gas emissions during the coal mining process. This study aims to improve the utilization efficiency of mine gas, reduce greenhouse gas emissions, and promote the low-carbon and green transformation of the coal industry. A 10kW gas regenerative thermal oxidation (RTO) experimental system was constructed. The effects of initial methane concentration, low-temperature flue gas proportion, and operating load on combustion temperature, methane oxidation rate, high-temperature flue gas energy, and system thermal efficiency were studied. The results show that when the combustion temperature is below 600°C, the CH4 combustion reaction cannot proceed effectively, and the system temperature continuously decreases and cannot be maintained stable. The experiment determines the stable operating methane concentration range of RTO. In this experimental system, the lower limit of the initial methane concentration is 0.28%, corresponding to an 86% methane oxidation rate. As the initial methane concentration decreases, the combustion temperature also decreases, and the methane oxidation rate follows suit. The higher the low-temperature flue gas proportion, the higher the combustion temperature, and the system thermal efficiency and output heat decrease with the increase of the low-temperature flue gas proportion. This experiment explores multiple factors affecting regenerative thermal oxidation, providing an basis for ensuring the safe and stable operation of the system and optimization. Improving the thermal insulation and heat exchange performance of the storage body can expand the lower limit of the initial methane concentration, thereby increasing the stability and thermal efficiency of the system.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"86a34c8180be1e6bf94abbd1235814196d8fea80cac4106dec12846cef1def5f","category":"Interdisciplinary"}