{"title":"Factors affecting shared decision‐making concerning menopausal hormone therapy","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15185?af=R","date":1721200125000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ffc93608-6df4-418c-ae11-967a6d326311/nyas15185-gra-0001-m.png\" alt=\"Factors affecting shared decision-making concerning menopausal hormone therapy\" />\n<p>Menopausal hormone therapy (MHT) effectively treats menopause-related symptoms. A personalized approach is recommended by menopause management guidelines. Decision-making in menopause care is complex. Healthcare providers face challenges in providing individualized risk estimates due to data complexity and time constraints. Women must balance benefits and risks, and influences from socio-cultural, economic, education, and personal factors. Media and celebrities also impact perceptions. Understanding these factors enhances shared decision-making, treatment adherence, and satisfaction.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Menopausal hormone therapy (MHT) is an effective treatment for menopause-related symptoms. Menopause management guidelines recommend a personalized approach to menopause care, including MHT use. Decision-making around menopause care is a complex, iterative process influenced by multiple factors framed by perspectives from both women and healthcare providers (HCPs). This narrative review aims to summarize evidence around factors affecting decision-making regarding menopause-related care. For HCPs, the provision of individualized risk estimates is challenging in practice given the number of potential benefits and risks to consider, and the complexity of the data available, especially within time-limited consultations. Women seeking menopause care have the difficult task of making sense of the benefit versus risk profiles to make choices in line with their decisional needs influenced by sociocultural/economic, educational, demographic, and personal characteristics. The press, social media, and influential celebrities also impact the perception of menopause and decision-making around it. Understanding these factors can lead to improved participation in shared decision-making, satisfaction with the decision and decision-making process, adherence to treatment, reduced decisional regret, efficient use of resources, and ultimately long-term satisfaction with care.</p>","author":"Kanyada Koysombat, \nAnnice Mukherjee, \nSandhi Nyunt, \nHugo Pedder, \nYana Vinogradova, \nJo Burgin, \nHarshida Dave, \nAlexander N. Comninos, \nVikram Talaulikar, \nJulia V. Bailey, \nWaljit S. Dhillo, \nAli Abbara","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"86ac05dabcf8a8a47f79994568113af3c48b33a40adc45b1351aaccf2de2e8da","category":"Environment"}