{"title":"“Toxic Bro Culture”: Former Rivian executive speaks out, sues company","link":"https://arstechnica.com/?p=1810588","date":1636117390000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Rivian-1-800x600.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/Rivian-1.jpg\">Enlarge</a> <span>/</span> The friendly look of Rivian's electric truck is at odds with allegations of a toxic bro culture at the startup. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Thursday afternoon, former Rivian VP of Sales and Marketing Laura Schwab <a href=\"https://medium.com/@lauraschwab1/life-outside-the-boys-club-why-i-spoke-up-about-rivians-toxic-bro-culture-and-got-fired-15600b999ae7\">published a blistering account</a> of her experience at electric vehicle-maker Rivian. Schwab moved to the startup in November 2020 after a lengthy career at Jaguar Land Rover and then Aston Martin but says that almost immediately, she began to experience a \"toxic bro culture that marginalizes women and contributes to the company making mistakes.\"</p>\n<p>Rivian has painted an image of itself as a blend of automaker and tech startup, but Schwab says that the actual culture at the company was a \"boys club\" surrounding founder and CEO RJ Scaringe. She writes that she was sidelined and excluded from decision-making, despite being hired specifically because of her experience in automotive marketing. In addition to the account published on Medium, Schwab is also suing the company for gender discrimination.</p>\n<p>Schwab says that her boss, Chief Commercial Officer Jiten Behl, told her \"he would only communicate with me by instant messenger and that would be outside office hours, 'late in the evening.'\" After raising her concerns with another female Rivian executive, Schwab alleges that that woman was also excluded from meetings.</p></div><p><a href=\"https://arstechnica.com/?p=1810588#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1810588&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"86b1aff77dde013bc01f5af55625b6658442d15a8386e4ca0b32468db998f377","category":"Tech"}