{"title":"Understanding Heat‐Associated Adult Platichthys stellatus Mortality: Differential Transcriptome Analysis of Juvenile and Adult Starry Flounder Liver under Heat Stress","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/9980817?af=R","date":1718020160000,"content":"<p>The starry flounder <i>Platichthys stellatus</i>, an economically important benthic fish species widely distributed throughout the North Pacific Ocean, exhibits poor heat tolerance, resulting in frequent adult mass mortality in aquaculture settings. Heat stress disrupts the energy metabolism of <i>P. stellatus</i>, elevating blood glucose and implying its sensitivity to rising water temperatures. In particular, the survival of adult fish in aquaculture settings during the summer season is less than that of larvae or juveniles. This study aimed to understand the heat stress-associated survival of adults by focusing on the molecular pathways of glycolysis/gluconeogenesis using comparative transcriptome analysis. Transcriptomes were obtained by RNA sequencing of <i>P. stellatus</i> livers of adults exposed to 16 and 28°C, together with juveniles at the same conditions. A total of 16,121,503–18,774,222 raw paired-end reads were obtained after trimming. The assembled unigenes (39,489 out of 127,460) were annotated in the nr, Clusters of Orthologous Groups (COG), Kyoto Encyclopedia of Genes and Genomes (KEGG), and Swiss-Prot databases. A total of 6,858 differentially expressed genes were found in juveniles and adults at control (16°C) and high (28°C) water temperatures. Juveniles and adults had 1,856 genes downregulated and 1,548 genes upregulated at the 16°C control water temperature and 1,055 genes downregulated and 1,231 genes upregulated at 28°C, overall involving at least 47 KEGG pathways. When raising the water temperature and comparing the DEGs of juveniles and adults, respectively, we found that both groups showed similar upregulation patterns for the major heat shock protein (<i>HSP</i>) genes under temperature-increasing conditions, indicating a conserved response mechanism. Additionally, both juvenile and adult fish showed similar upregulation of ER stress-related genes, including endoplasmic reticulum chaperone BiP (<i>BiP</i>) and homocysteine-responsive endoplasmic reticulum-resident ubiquitin-like domain member 1 (<i>HERP</i>), suggesting consistent transcriptional changes associated with ER stress under heat stress conditions. However, notable differences were observed in the expression of inflammation and immune response-related genes, and juvenile <i>P. stellatus</i> showed upregulation of immune costimulatory protein B7-H3 (<i>B7H3</i>) and immunoglobulin superfamily member 9 (<i>IGSF9</i>), while adults showed upregulation of high-affinity immunoglobulin epsilon receptor subunit gamma (<i>FCER1G</i>), V-type immunoglobulin domain-containing suppressor of T-cell activation (<i>VSIR</i>), and immunoglobulin superfamily DCC subclass member 3 (<i>IGDCC3</i>). Especially, phosphoglucomutase (<i>PGM</i>), glucose-6-phosphatase catalytic subunit (<i>G6PC</i>), phosphofructokinase (<i>PFK</i>), and bisphosphoglycerate mutase (<i>BPGM</i>), the enzymes involved in the glycolysis/gluconeogenesis pathway, showed significantly higher FPKM in adult <i>P. stellatus</i> than in juveniles. Overall, this study provides valuable insights into the transcriptional responses of <i>P. stellatus</i> to heat stress, which differ with age and may inform the development of strategies to improve the survival and productivity of this economically important fish species in aquaculture.</p>","author":"Hyobin Lee, \nJ. Sook Chung, \nJihye Yoon, \nJung Yeol Park, \nHan Kyu Lim, \nHouguo Xu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"86b485c993be309a52bdabe7e7670d55dbf0bff4b32f3bcf45759644b3f35cf9","category":"Environment"}