{"title":"iOS 17 Rumored to Add New Lock Screen, Apple Music, and App Library Features","link":"https://www.macrumors.com/2023/04/25/ios-17-lock-screen-apple-music-rumors/","date":1682440535000,"content":"iOS 17 will include new features and changes across the Lock Screen, Apple Music, App Library, and Control Center, according to a <a href=\"https://weibo.com/5143897135/MDlHbENjs\">Weibo post</a> this week from the same account that revealed Apple would be <a href=\"https://www.macrumors.com/2023/03/03/iphone-14-new-color-rumor/\">launching the iPhone 14 in Yellow</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/iOS-17-on-Phone-Feature.jpg\" alt width=\"2250\" height=\"1265\" />\r<br />\nThe post lists several potential iOS 17 features:<ul><li>Lock Screen font size options</li>\r<br />\n<li>A button to share custom Lock Screen designs with other iPhone users</li>\r<br />\n<li>Apple Music lyrics can be viewed on the Lock Screen</li>\r<br />\n<li>Apple Music design changes with simplified interface</li>\r<br />\n<li>App Library folders can be manually renamed</li>\r<br />\n<li>Control Center design changes</li>\r<br />\n<li>Flashlight brightness slider can be freely adjusted, like the volume slider</li></ul>It was <a href=\"https://www.macrumors.com/2023/04/05/ios-17-control-center-changes-rumor/\">already rumored that iOS 17 would revamp Control Center</a>, but the rest of the information shared by the account is new. None of the changes would be groundbreaking, but they would still be meaningful improvements. Overall, rumors have suggested iOS 17 will be a modest update focused on stability and performance enhancements.\r<br />\n\r<br />\nWhile the source of this rumor accurately leaked the iPhone 14 would launch in Yellow a few months in advance, they do not have a long-term track record with Apple rumors, so there is no guarantee that this information will prove to be correct.\r<br />\n\r<br />\nOn last week's episode of <em>The MacRumors Show</em> podcast, <em>Bloomberg</em>'s Mark Gurman revealed <a href=\"https://www.macrumors.com/2023/04/21/the-macrumors-show-mark-gurman-talks-wwdc-2023/\">what he expects from iOS 17</a>, including <a href=\"https://www.macrumors.com/2023/04/21/ios-17-wallet-find-my-improvements-macos-14-minor-update/\">improvements to the Find My and Wallet apps</a>. The well-known Apple reporter said the update is unlikely to include \"major new features,\" like the customizable Lock Screen introduced with iOS 16.\r<br />\n\r<br />\nApple is expected to announce iOS 17 during its <a href=\"https://www.macrumors.com/2023/03/29/apple-announces-wwdc-2023/\">WWDC keynote on June 5</a>. The first beta version of the update should be made available to developers moments after the keynote, while a public beta will likely be available in July. As usual, the update should be widely released in September, around the time that new iPhones launch.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/setsuna-digital/\">Setsuna Digital</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/25/ios-17-lock-screen-apple-music-rumors/\">iOS 17 Rumored to Add New Lock Screen, Apple Music, and App Library Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-rumored-to-add-new-lock-screen-apple-music-and-app-library-features.2387768/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"86b833f5a1c3d6bfc3a2848ec1a60449ad5f427196adf55e45c6175351427388","category":"Apple"}