{"title":"Unmasking the coronavirus pandemic impact on students’ academic performance (University of Cape Coast—Ghana)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003409","date":1721138400000,"content":"<p>by Jonathan Kissi, Wisdom Wise Kwabla Pomegbe, Godwin Adzakpah, Nathan Kumasenu Mensah, Joseph Owusu-Marfo, Zenobia Wooduwa Asmah, Gloria Ekua Tawiah, Grace Amoah-Anomah</p>\r\n\r\nThe coronavirus (COVID-19) pandemic has impacted various institutions significantly, including education. Although several studies have explored the transmission of the COVID-19 virus among humans health, few have investigated its impact on tertiary education in Ghana. This study, therefore, aimed to unmask the effects of COVID-19 on the academic performance of tertiary students in Ghana, specifically at the University of Cape Coast (UCC). Stratified and convenience sampling techniques were employed to select respondents from the College of Health and Allied Sciences at UCC for this study. Based on Krejcie and Morgan’s table for determining sample sizes for a large population in a study, a sample size of 531 was studied. Questionnaires were created and distributed to respondents from various departments to solicit their views. COVID-19 has significantly affected the academic performance of students at the University of Cape Coast, Ghana. A strong positive correlation was found between the positive impact of COVID-19 and academic performance (β = 3.385, <i>p</i> &lt; 0.001). The study identified the absence of group discussions, poor internet networks, and other factors hurting students’ academic performance (β = -2.308, <i>p</i> &lt; 0.001). Resources such as libraries, conducive environments in halls and hostels, and other factors also significantly influenced students’ academic performance (β = 2.941, <i>p</i> &lt; 0.005). The study’s findings suggest that virtual learning platforms, adequate learning infrastructures, and internet packages should be available to students to facilitate teaching and learning as the University prepares for future pandemics.","author":"Jonathan Kissi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"86bcb818d41d0db871b18e9d50278f76c19192f897a57a9994a62b36895b1aee","category":"Environment"}