{"title":"390 Investigating the cecal microbiota of commercial layers raised in different production systems","link":"https://academic.oup.com/jas/article/102/Supplement_3/292/7757332?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Poultry production relies on several biosecurity practices aiming to prevent contamination of flocks and food products with potential pathogens; however, these practices can inadvertently hinder colonization of the avian gut with co-evolved commensal bacteria that might promote gut health, immune development, and disease resistance. We have previously demonstrated that broilers reared in intensive systems lack core bacterial species that are highly abundant in the gut of extensively raised broilers and showed that these “missing bacteria” readily colonize and persist in the gut after a single inoculation in early life. In the present study, we investigated the cecal microbiota composition of commercial layers reared in different production systems aiming to identify core bacteria and species that might be missing from layers reared in intensive systems. In addition, we compared cecal microbiota composition of layers at different ages to understand changes in microbiota as laying hens mature. We used 16S rRNA amplicon sequencing to analyze cecal samples obtained from 40-wk-old layers from 7 commercial flocks, including cage (n = 10), enriched cages (n = 5), free-run (n = 15), and organic free-range (n = 15) systems. In addition, we obtained cecal samples from laying hens at the end of production cycle from a provincially inspected abattoir (n = 5). One-way ANOVA, Kruskal-Wallis, DESeq, and PERMANOVA methods were used for statistical analysis. Comparisons between the microbiota of 1-, 3- and 40-wk-old birds indicated that phylogenetic diversity increases as birds age (<span>P</span> = 0.024) and evenness was greater in 5- and 40- wk-old birds (<span>P</span> = 0.024). There were no significant differences in phylogenetic diversity and evenness between 40-wk-old layers reared in different systems (<span>P</span> = 0.14), but observed phylogenetic diversity was greater in layers at the end of the production cycle (<span>P</span> = 0.001). Beta-diversity was significantly different between layers raised at the same farm at different ages (<span>P</span> &lt; 0.001), and clustering was highly influenced by farm, rather than by system. A total of 217 bacterial taxa were shared between all the systems, representing 34.7% of the total number of taxa identified in this project and the abundance of core microbes was similar for birds in the different rearing systems (<span>P</span> = 0.518). We identified bacteria species that were differently abundant between systems, and, surprisingly, we found that some taxa previously shown to be enriched in extensively raised broilers, such as Megamonas, Sutterella, and Prevotella, were enriched in intensively raised layers in comparison to layers raised in organic free-range system (<span>P</span> &lt; 0.005). We concluded that laying hen age significantly affects microbial diversity but has a minimum effect on taxa distribution after 1 wk of age. In contrast to previously observations in broiler chickens, rearing system does not significantly affect microbial diversity, although differences in abundance of specific taxa are observed.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"86c7c8fc4bb865f56326da7d54edb71f194271520977e1886ed81f55fde3c4b7","category":"Environment"}