{"title":"Experimental Investigation of the Influence of Phase Compounds on the Friability of Fe-Si-Mn-Al Complex Alloy","link":"https://www.preprints.org/manuscript/202407.1910/v1","date":1721819666000,"content":"The research presented in the article is devoted to the study of the influence of phase compounds on the friability of the Fe-Si-Mn-Al complex alloy. The urgency of the problem lies in the development of technology for producing a non-scatterable alloy from manganese-containing ores and high-ash coals. The main goal of the work is to determine the range of alloy compositions and the resulting phases that affect the dispersibility of the alloy, which is critically important for its industrial implementation. Research methods include thermodynamic diagram analysis (TDA) using data on the standard enthalpy of formation of intermetallic compounds, as well as experimental tests in an ore-thermal electric furnace with a capacity of 200 kV*A. The results show that Fe-Si-Mn-Al complex alloys form a variety of silicide and aluminide phases, including intermetallic compounds and ternary systems, which is critical for understanding and controlling their physicochemical properties. When smelting a complex alloy, the content of leboite (Fe3Si7) in the Fe-Si-Mn-Al system plays a significant role. The development of smelting technology will be aimed at avoiding the FeSi2-Fe3Si7-F2(FeAl3Si2)-Mn11Si19 tetrahedron area. This approach to controlling the composition of a complex alloy is critical to ensuring its consistent friability properties in industrial applications. Thus, this work represents an important step in understanding the physical properties and stability of Fe-Si-Mn-Al complex alloys, which have potential for widespread use in metallurgical and other industrial applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"86da4f0642595d3cad0c5b21aae2894b72acbf11e8b2b4defa607adb117645cd","category":"Interdisciplinary"}