{"title":"Siri Interface May Move to Dynamic Island on Newer iPhones Running iOS 17","link":"https://www.macrumors.com/2023/04/13/siri-dynamic-island-ios-17/","date":1681390488000,"content":"Apple is considering integrating Siri's on-screen interface into the Dynamic Island on newer iPhones, according to an anonymous source who has been <a href=\"https://twitter.com/analyst941/status/1646403568641929218?s=20\">sharing details</a> about alleged new features coming in iOS 17.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/siri-symbol-iphone.jpg\" alt width=\"850\" height=\"481\" />\r<br />\nCurrently, invoking Siri with a button press or using the \"Hey Siri\" spoken command causes an animated sphere to appear at the bottom of the screen. The sphere remains overlaid on the screen while the virtual assistant listens, and any details relevant to the request are displayed at either the top or bottom of the screen in the form of a card, with background content dimmed.\r<br />\n\r<br />\nMoving the Siri UI to the Dynamic Island would likely allow onscreen content to stay in full view. Originally, the Siri interface would take over the entire screen whenever the user interacted with the virtual assistant, but Apple made this optional in iOS 14 when it adopted the current, more compact interface.\r<br />\n\r<br />\nAccording to the anonymous tipster, Apple \"may or may not go with the Dynamic Island version of Siri\" that it is presently testing, although \"many more\" notifications are coming to the pill-shaped interface. Apple is expected to expand the Dynamic Island to all four iPhone 15 models this year. You can read more about other alleged improvements coming to iOS 17 in our <a href=\"https://www.macrumors.com/2023/04/12/ios-17-rumored-features/\">previous coverage</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/13/siri-dynamic-island-ios-17/\">Siri Interface May Move to Dynamic Island on Newer iPhones Running iOS 17</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/siri-interface-may-move-to-dynamic-island-on-newer-iphones-running-ios-17.2386715/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"86dc46700cbb1722ab66f8c6fb89d8ee40c65bc59aa1a3bff9953fd764141540","category":"Apple"}