{"title":"In vitro transcription-based biosensing of glycolate for prototyping of a complex enzyme cascade","link":"https://academic.oup.com/synbio/article/doi/10.1093/synbio/ysae013/7762360?rss=1","date":1726790400000,"content":"<span><div>Abstract</div><span>In vitro</span> metabolic systems allow the reconstitution of natural and new-to-nature pathways outside of their cellular context and are of increasing interest in bottom-up synthetic biology, cell-free manufacturing, and metabolic engineering. Yet, the analysis of the activity of such <span>in vitro</span> networks is very often restricted by time- and cost-intensive methods. To overcome these limitations, we sought to develop an <span>in vitro</span> transcription (IVT)-based biosensing workflow that is compatible with the complex conditions of <span>in vitro</span> metabolism, such as the crotonyl-CoA/ethylmalonyl-CoA/hydroxybutyryl-CoA (CETCH) cycle, a 27-component <span>in vitro</span> metabolic system that converts CO<sub>2</sub> into glycolate. As proof of concept, we constructed a novel glycolate sensor module that is based on the transcriptional repressor GlcR from <span>Paracoccus denitrificans</span> and established an IVT biosensing workflow that allows us to quantify glycolate from CETCH samples in the micromolar to millimolar range. We investigate the influence of 13 (shared) cofactors between the two <span>in vitro</span> systems to show that Mg<sup>2+</sup>, adenosine triphosphate , and other phosphorylated metabolites are critical for robust signal output. Our optimized IVT biosensor correlates well with liquid chromatography–mass spectrometry–based glycolate quantification of CETCH samples, with one or multiple components varying (linear correlation 0.94–0.98), but notably at ∼10-fold lowered cost and ∼10 times faster turnover time. Our results demonstrate the potential and challenges of IVT-based systems to quantify and prototype the activity of complex reaction cascades and <span>in vitro</span> metabolic networks.</span>","author":"","siteTitle":"Synthetic Biology Current Issue","siteHash":"41b19f195cf64174f01d8c36945485e6398e3496f8a7213d6905a0e36713ba3c","entryHash":"86e8c22569c35f3c4b597852a5bc9c3d8263bddc56ede3b8c07c10a04d1d8503","category":"Environment"}