{"title":"40S Ribosomal protein S6 kinase integrates daylength perception and growth regulation in Arabidopsis thaliana","link":"https://academic.oup.com/plphys/article/195/4/3039/7664287?rss=1","date":1714694400000,"content":"<span><div>Abstract</div>Plant growth occurs via the interconnection of cell growth and proliferation in each organ following specific developmental and environmental cues. Therefore, different photoperiods result in distinct growth patterns due to the integration of light and circadian perception with specific Carbon (C) partitioning strategies. In addition, the TARGET OF RAPAMYCIN (TOR) kinase pathway is an ancestral signaling pathway that integrates nutrient information with translational control and growth regulation. Recent findings in Arabidopsis (<span>Arabidopsis thaliana</span>) have shown a mutual connection between the TOR pathway and the circadian clock. However, the mechanistical network underlying this interaction is mostly unknown. Here, we show that the conserved TOR target, the 40S ribosomal protein S6 kinase (S6K) is under circadian and photoperiod regulation both at the transcriptional and post-translational level. Total S6K (S6K1 and S6K2) and TOR-dependent phosphorylated-S6K protein levels were higher during the light period and decreased at dusk especially under short day conditions. Using chemical and genetic approaches, we found that the diel pattern of S6K accumulation results from 26S proteasome-dependent degradation and is altered in mutants lacking the circadian F-box protein ZEITLUPE (ZTL), further strengthening our hypothesis that S6K could incorporate metabolic signals via TOR, which are also under circadian regulation. Moreover, under short days when C/energy levels are limiting, changes in S6K1 protein levels affected starch, sucrose and glucose accumulation and consequently impacted root and rosette growth responses. In summary, we propose that S6K1 constitutes a missing molecular link where day-length perception, nutrient availability and TOR pathway activity converge to coordinate growth responses with environmental conditions.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"86ef02fbe3913fef243dab57aec2298ad514563ee6afe97d57994278c3b91f7a","category":"Environment"}