{"title":"Prime Day 2023 Powered by AWS – All the Numbers","link":"https://aws.amazon.com/blogs/aws/prime-day-2023-powered-by-aws-all-the-numbers/","date":1690984996000,"content":"<p>As part of my annual tradition to tell you about how AWS makes Prime Day possible, I am happy to be able to share some chart-topping metrics (check out my <a href=\"https://aws.amazon.com/blogs/aws/how-aws-powered-amazons-biggest-day-ever/\">2016</a>, <a href=\"https://aws.amazon.com/blogs/aws/prime-day-2017-powered-by-aws/\">2017</a>, <a href=\"https://aws.amazon.com/blogs/aws/amazon-prime-day-2019-powered-by-aws/\">2019</a>, <a href=\"https://aws.amazon.com/blogs/aws/amazon-prime-day-2020-powered-by-aws/\">2020</a>, <a href=\"https://aws.amazon.com/blogs/aws/prime-day-2021-two-chart-topping-days/\">2021</a>, and <a href=\"https://aws.amazon.com/blogs/aws/amazon-prime-day-2022-aws-for-the-win/\">2022</a> posts for a look back).</p> \n<p>This year I bought all kinds of stuff for my hobbies including a <a href=\"https://www.amazon.com/gp/product/B00068P48O/\">small drill press</a>, <a href=\"https://www.amazon.com/gp/product/B0BGY4NL6W/\">filament</a> for my 3D printer, and <a href=\"https://www.amazon.com/gp/product/B08XZ11FQM/\">irrigation tools</a>. I also bought some very nice <a href=\"https://www.amazon.com/gp/product/1419709364/\">Alphablock books</a> for my grandkids. According to our <a href=\"https://www.aboutamazon.com/news/retail/amazon-prime-day-2023-stats\">official release,</a> the first day of Prime Day was the single largest sales day ever on Amazon and for independent sellers, with more than 375 million items purchased.</p> \n<p><span><strong>Prime Day by the Numbers</strong></span><br /> As always, Prime Day was powered by AWS. Here are some of the most interesting and/or mind-blowing metrics:</p> \n<p><strong>Amazon Elastic Block Store (Amazon EBS)</strong> – The Amazon Prime Day event resulted in an incremental 163 petabytes of EBS storage capacity allocated – generating a peak of 15.35 trillion requests and 764 petabytes of data transfer per day. Compared to the previous year, Amazon increased the peak usage on EBS by only 7% Year-over-Year yet delivered +35% more traffic per day due to efficiency efforts including workload optimization using <a href=\"https://aws.amazon.com/ec2/\">Amazon Elastic Compute Cloud (Amazon EC2)</a> AWS Graviton-based instances. Here’s a visual comparison:</p> \n<p><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/08/01/primeday_2023_ebs_2.png\" alt width=\"900\" height=\"505\" /></p> \n<p><strong>AWS CloudTrail</strong> – AWS CloudTrail processed over 830 billion events in support of Prime Day 2023.</p> \n<p><strong>Amazon DynamoDB</strong> – DynamoDB powers multiple high-traffic Amazon properties and systems including <a href=\"https://alexa.com/\">Alexa</a>, the <a href=\"https://www.amazon.com/\">Amazon.com</a> sites, and all <a href=\"https://www.aboutamazon.com/workplace/facilities\">Amazon fulfillment centers</a>. Over the course of Prime Day, these sources made trillions of calls to the DynamoDB API. DynamoDB maintained high availability while delivering single-digit millisecond responses and peaking at 126 million requests per second.</p> \n<p><strong>Amazon Aurora</strong> – On Prime Day, 5,835 database instances running the PostgreSQL-compatible and MySQL-compatible editions of Amazon Aurora processed 318 billion transactions, stored 2,140 terabytes of data, and transferred 836 terabytes of data.</p> \n<p><strong>Amazon Simple Email Service (SES)</strong> – Amazon SES sent 56% more emails for Amazon.com during Prime Day 2023 vs. 2022, delivering 99.8% of those emails to customers.</p> \n<p><strong>Amazon CloudFront </strong>– Amazon CloudFront handled a peak load of over 500 million HTTP requests per minute, for a total of over 1 trillion HTTP requests during Prime Day.</p> \n<p><strong>Amazon SQS</strong> – During Prime Day, Amazon SQS set a new traffic record by processing 86 million messages per second at peak. This is 22% increase from Prime Day of 2022, where SQS supported 70.5M messages/sec.</p> \n<p><strong>Amazon Elastic Compute Cloud (EC2)</strong> – During Prime Day 2023, Amazon used tens of millions of normalized AWS Graviton-based Amazon EC2 instances, 2.7x more than in 2022, to power over 2,600 services. By using more Graviton-based instances, Amazon was able to get the compute capacity needed while using up to 60% less energy.</p> \n<p><strong>Amazon Pinpoint</strong> – Amazon Pinpoint sent tens of millions of SMS messages to customers during Prime Day 2023 with a delivery success rate of 98.3%.</p> \n<p><span><strong>Prepare to Scale</strong></span><br /> Every year I reiterate the same message: rigorous preparation is key to the success of Prime Day and our other large-scale events. If you are preparing for a similar chart-topping event of your own, I strongly recommend that you take advantage of <a href=\"https://aws.amazon.com/premiumsupport/programs/iem/\">AWS Infrastructure Event Management</a> (IEM). As part of an IEM engagement, my colleagues will provide you with architectural and operational guidance that will help you to execute your event with confidence!</p> \n<p>— <a href=\"https://twitter.com/jeffbarr\">Jeff</a>;</p>","author":"Jeff Barr","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"86f0717580ee3bccff46519c8b3d6ea941226c79b6762915d9be72db19763454","category":"Tech"}