{"title":"Chrome and Panaracer team up for urban cycling shoe range","link":"https://cyclingtips.com/2021/09/chrome-and-panaracer-team-up-for-urban-cycling-shoe-range/","date":1632202029000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/PDPGallery3-SouthsidePro-650x366.jpeg\" /></div><h2>Chrome and Panaracer team up for urban cycling shoe range</h2><p>\n</p><p>Since 1995, Chrome Industries has been making tough gear designed for city streets – originally with messenger bags that grew a cult-following among bike couriers, with a big, solid, beautiful car-seatbelt style buckle. </p>\n\n\n\n<p>Over the years since, Chrome has put out a broadening range of clothing, footwear, bags and accessories that has either been specifically designed for cyclists, or works pretty well for general outdoorsy activities including cycling. </p>\n\n\n\n<p>For at least a decade, that range has included a line-up of casual SPD cycling shoes that didn’t look all clippy-cloppy or hyper-athletic. For a certain demographic, these Converse or Vans-like shoes filled a worthy niche – bike shoes that you could wear to the pub or the casual-wear-friendly office without standing out like a sore thumb. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/PDPGallery3-KurskPRO-1340x754.jpeg\" /></figure>\n\n\n\n<p>A few other brands have since entered that market – <a href=\"https://cyclingtips.com/2021/03/velosamba-shut-up-and-take-my-money-adidas/\">including mainstream ones, like Adidas</a> – but Chrome hasn’t walked away from the niche it helped chisel out. </p>\n\n\n\n<p>Its newest range of shoes, announced this week, appears to carry over a lot of what was good about the company’s earlier models. You want a vibe-heavy promotional video? But of course:</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>The biggest change is the outsole, developed in partnership with Japanese tyre brand Panaracer. From there, though, Chrome’s bike shoe range splits in two directions: the <a href=\"https://www.chromeindustries.com/spd-clipless-bike-shoes/\">Pro series</a>, which features SPD capability, and the <a href=\"https://www.chromeindustries.com/bike-shoes/\">Pedal series</a>, which features bike-friendly features but designed around a platform pedal. </p>\n\n\n\n<p>Both feature that vulcanised rubber outsole, with a nylon shank lurking beneath it. This stiffens up pedalling performance, while not negatively impacting on walkability. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/12_FW-177-NI.jpeg\" /></figure>\n\n\n\n<p>On the SPD version the nylon runs the length of the sole, while the Pedal series models are reinforced under the forefoot to stop the hard edges of a pedal poking through to the foot. There’s reflective detailing on the heels pretty much across the board, and there are also water-resistant models available. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/8_FW-177-NI.jpeg\" /></figure>\n\n\n\n<p>Pricing ranges from US$95–$110 for the Pedal series, depending on model, while the SPD-compatible Pro series are $120-$135. If you prefer leather to nylon, there’s also the non-Panaracer equipped waterproof <a href=\"https://www.chromeindustries.com/product/storm-415-workboot/FW-128.html?dwvar_FW-128_color=BK&amp;cgid=all-bike-shoes\">Storm 415 workboot</a> (US$160) – a shoe that I can personally confirm works great on platform pedals, and is totally bulletproof. </p>\n\n\n\n<p>Granted, Chrome’s gear is still catering for a niche – but with cycling’s current boom, there are presumably buyers out there for bike shoes that function well in the concrete jungle.</p>\n\n\n\n<p>If that sounds like you, head to <a href=\"https://www.chromeindustries.com/all-bike-shoes/\">ChromeIndustries.com</a> to find out more. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/chrome-and-panaracer-team-up-for-urban-cycling-shoe-range/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"86f4af2f1d9c4ba577b23d338a360ba647111cedf6bacefe6447b27a076d2485","category":"Cycling"}