{"title":"IBM creates the world’s first 2 nm chip","link":"https://arstechnica.com/?p=1763407","date":1620387758000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/IBM-slide-980x551.png\" /></div>\n        <p>\n          This slide from IBM's preview announcement gives more detail on the new process design.                      [credit:\n                        IBM                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Thursday, IBM announced a breakthrough in integrated circuit design—the world's first 2 nanometer process. IBM says its new process can produce CPUs capable of either 45 percent higher performance, or 75 percent lower energy use than modern 7 nm designs.</p>\n<p>If you've followed recent processor news, you're likely aware that Intel's current desktop processors are still laboring along at 14 nm, while the company struggles to complete a migration downward to 10 nm—and that its rivals are on much smaller processes, with the smallest production chips being Apple's new M1 processors at 5 nm. What's less clear is exactly what that means in the first place.</p>\n<p>Originally, process size referred to the literal two-dimensional size of a transistor on the wafer itself—but modern 3D chip fabrication processes have made a hash of that. Foundries still refer to a process size in nanometers, but it's a \"2D equivalent metric\" only loosely coupled to reality, and its true meaning varies from one fabricator to the next.</p></div><p><a href=\"https://arstechnica.com/?p=1763407#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763407&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"86f5c91fe4da30787800370529831f4d1a711aea62fede5606e298dad96d5cf8","category":"Tech"}