{"title":"What is the cycling Hour Record?","link":"https://www.cyclist.co.uk/in-depth/10269/cycling-hour-record","date":1637590636000,"content":"<span>\n      <span><a href=\"/authors/joseph-delves\">Joseph Delves</a></span>\n  </span><div>  \n  <div>      <div><span>24 Nov 2021</span></div>    </div></div><p>\nThe competition to see who can ride the furthest in an hour is one of cycling’s most hotly contested </p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/09/joss_lowden_hour_record-1.jpg?itok=6gcMaxSg\" />  </div>\n<div>\n      <p> Ride as fast as you can around a velodrome for one hour. Go further than anyone else has before, and the <a href=\"/tags/hour-record\" target=\"_blank\">Hour record</a> is yours. One of the greatest accomplishments in cycling, it's a world record that has been improved upon by degrees since as far back as 1876. Back then, riders would have used a penny farthing-type bicycle, and many different styles of bike have been allowed over the years.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/8/57/alex_dowsett_hour_record_0.jpg?itok=oUZx8xsM\" />  </div>\n</div>\n<p>However, since 2014 the UCI has stipulated that riders attempt the Hour on a standard track pursuit bicycle. Making all attempts since roughly comparable with each other, this move helped spark a new wave of interest in the hour record.</p>\n<p>That Tour de France winner and multiple Olympic champion <a href=\"/news/245/bradley-wiggins-sets-new-hour-record\" target=\"_blank\">Bradley Wiggins</a> also chose the event to round off his career didn't hurt its profile either.</p>\n<h2>What is the current cycling Hour Record and who holds it?</h2>\n<h3>Overall Hour record</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2019/03/victor_campenaerts_ridley_arena_tt_14_2.jpg?itok=ddxAowAH\" />  </div>\n</div>\n<p><strong><em>Belgian <a href=\"/news/6318/watch-victor-campenaerts-to-be-streamed-live\" target=\"_blank\">Victor Campenaerts</a> holds the current Hour record with a distance of 55.089km, set on 16th April 2019 at the Aguascalientes Velodrome, Mexico.</em></strong></p>\n<p>Despite Hour record attempts being held in a velodrome, more often than not it's an exceptional road time-triallist in the saddle.</p>\n<p>However, attempting the Hour record requires a significant investment in both equipment and training.</p>\n<p>This means riders will need their team's permission to tailor their season towards attempting it, which can be tricky for the most in-demand riders and explains why there are relatively few attempts by big-name pro cyclists.</p>\n<p>Over the years, many road riders and time-trial specialists have held the men’s Hour record, including names like Merckx, Moser, Obree, Indurain, and Boardman.</p>\n<p>Since the UCI's rule changes in 2014, <a href=\"/news/61/jens-voigt-interview-ready-for-retirement\" target=\"_blank\">Jens Voigt</a> was the first rider to improve upon the record with a distance of 51.110km. Since then Matthias Brändle, <a href=\"/news/7128/dennis-calls-world-championships-time-trial-defence-biggest-win-of-career\" target=\"_blank\">Rohan Dennis</a>, <a href=\"/in-depth/1960/alex-dowsett-interview-i-m-going-after-the-hour-record-again\" target=\"_blank\">Alex Dowsett</a>, and <a href=\"/tags/bradley-wiggins\" target=\"_blank\">Bradley Wiggins</a> have each claimed the record before its current holder.</p>\n<p>With so many tour riders also capable of producing excellent hour-long efforts, speculation about the future of the record is again a key point of discussion.</p>\n<p>Recently Dowsett unsuccessfully tried to regain his record, seven years after first holding it. One rider also contemplating an attempt is world time-trial champion <a href=\"/news/7339/filippo-ganna-sets-incredible-new-individual-pursuit-world-record\" target=\"_blank\">Filippo Ganna</a>.</p>\n<h3>Women's Hour record</h3>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/tom_griffiths_joss_lowden_.jpeg?itok=j5b2SroA\" />  </div>\n</div>\n<p><strong><em>The women's Hour record is held by <a href=\"/news/10151/joss-lowden-breaks-hour-record\" target=\"_blank\">Joscelin Lowden</a> with a distance of 48.405km set on 30th September 2021 at the Velodrome Suisse in Grenchen, Switzerland.</em></strong></p>\n<p>Like the men's record, interest in the women's Hour record has peaked and waned over time. Currently, it's enjoying significant attention, in part thanks to British cyclist Joss Lowden's successful attempt to set a new distance earlier this year.</p>\n<p>The last women's Hour record under the old regime was set on 1st October 2003 by Leontien van Moorsel who managed a distance of 46.065km.</p>\n<p>British Paralympian <a href=\"/in-depth/2696/qa-dame-sarah-storey\" target=\"_blank\">Sarah Storey</a> made the first attempt at the unified record (see below). Endeavouring to improve the record on 28th February 2015 at Lee Valley Velo Park in London, she fell just short with a distance of 45.502km.</p>\n<p>A year later, American Molly Shaffer Van Houweling succeeded, riding a distance of 46.273km at the high-altitude Aguascalientes velodrome in Mexico.</p>\n<p>The following year, this effort was pushed further to 46.882km by Australian Bridie O'Donnell, although her claim stood for just over a month before Evelyn Stevens won the title back for the USA.</p>\n<p>Having previously failed on her first attempt in 2017, Italian <a href=\"/news/5316/vittoria-bussi-sets-new-benchmark-for-uci-womens-hour-record\" target=\"_blank\">Vittoria Bussi</a> made an incredible recovery a day after abandoning her initial ride after 40 minutes.</p>\n<p>Her distance of 48.007km set in 2018 stood for three years until <a href=\"/news/10151/joss-lowden-breaks-hour-record\" target=\"_blank\">Joss Lowden’s ride in September 2021</a>.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10194/rapha-headquarters-london\">The good cult: Behind the scenes at Rapha</a></div>      <div><a href=\"/news/10266/rapha-gore-tex-jackets\">Rapha stays dry with three new Gore-Tex jackets including urban dandy option</a></div>      <div><a href=\"/buying-guides/1938/buyers-guide-winter-riding-essentials\">Buyers guide: What to wear cycling in winter</a></div>      <div><a href=\"/buying-guides/4611/buyers-guide-best-waterproof-cycling-jackets\">Buyer's guide: best waterproof cycling jackets</a></div>      <div><a href=\"/buying-guides/4343/best-road-bike\">Best road bikes: the best bikes on the market from under £1,000 to over £10,000</a></div>    </div></div><h2>What are the cycling Hour record rules?</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2020/01/merckx_1972_ofs-2_crop.jpg?itok=nSjezkCl\" />  </div>\n</div>\n<p>The Hour record is the record for the longest distance covered in one hour on a bicycle. Riders attempt the record alone on a velodrome track and from a standing start.</p>\n<p>The fundamental concept of the Hour hasn't changed much since the first recorded attempts. However, the rules have changed over the years, particularly with regard to the style of bikes that can be used.</p>\n<p>During the 90s, interest in the hour record peaked, as did <a href=\"/in-depth/8472/thinking-outside-the-box-what-if-there-were-no-uci-rules\" target=\"_blank\">innovation in bicycle design and rider positioning</a>.</p>\n<p>Driven partly by the rivalry between <a href=\"/in-depth/999/graeme-obree-do-it-because-you-love-it\" target=\"_blank\">Graeme Obree</a> and <a href=\"/chris-boardman/59/chris-boardman-interview\" target=\"_blank\">Chris Boardman</a>, their use of radically stretched or compressed positions and monocoque bikes caused debate over the ability to compare their rides to those of previous athletes.</p>\n<p>After a series of piecemeal bans and rulings regarding the type of equipment allowed, in 1997, the UCI created two categories: the 'UCI Hour Record' and the 'Best Human Effort'.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/05/ofs_boardman_hourrecord_199.jpg?itok=ZGglYHXh\" />  </div>\n</div>\n<p>The first of these restricted competitors to traditional-looking bicycles with wire spokes and banned time-trial helmets, aerodynamic bars, and monocoque frames.</p>\n<p>The second allowed modern equipment. The idea was to create one record that could be compared across all time, and another allowing for advances in technology.</p>\n<p>With the UCI Hour record reverting in 2000 to the distance established by <a href=\"/in-depth/512/from-the-archive-in-conversation-with-eddy-merckx\" target=\"_blank\">Eddy Merckx</a> in 1972, Chris Boardman attempted the UCI record on a traditional bike and improved upon Merckx's distance by just 10 metres.</p>\n<p>However, the presence of two records seemed to suck some of the prestige from both events. In 2014, the UCI unified the two records into a single classification, stipulating riders could use any equipment in line with regulations for track pursuit bikes at the time of their attempt.</p>\n<p>Reigniting interest in the event, 'the Hour record' now refers to this unified classification. Beyond using the correct type of bike, the rider must also be within the UCI's biological passport testing program to be eligible.</p>\n<h2>What bikes are used for the Hour record?</h2>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/alex_dowsett_hour_record_bike_0.jpg?itok=YISMYzEq\" />  </div>\n</div>\n<p>A bike used for the Hour record must meet the regulations for track pursuit events as dictated by the UCI. At their most basic, this will be a track bicycle without brakes and using a fixed wheel drivetrain.</p>\n<p>Even with most riders opting for a high cadence approach, gearing is still often enormous, with Bradley Wiggins opting to use a ratio of 58×14 for his attempt.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/09/joss_howden_tom_griffiths_1.jpeg?itok=5JyJS_pq\" />  </div>\n</div>\n<ul>\n<li>Check out <a href=\"/news/10139/joss-lowden-hour-record-bike\" target=\"_blank\">Joss Lowden's Hour Record Bike</a> </li>\n</ul>\n<p>The rider will use a base bar at the front of the bike when setting off from the standing start. Above this will be a set of aero bars where the rider will spend the rest of their attempt tucked into an aerodynamic position.</p>\n<div>\n<div>    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2019/03/victor_campenaerts_ridley_arena_tt_16_2.jpg?itok=NAQlwqYF\" />  </div>\n</div>\n<ul>\n<li>Check out <a href=\"/news/6207/check-out-victor-campenaertss-hour-record-bike\" target=\"_blank\">Victor Campenaerts' Hour Record Bike</a> </li>\n</ul>\n<p>Both the bike's shape and the rider's position will be tailored to balance the need to produce power and cut cleanly through the air.</p>\n<p>With riders travelling in the straightest line possible, most bikes will use twin disc wheels. While the bikes used are often extraordinarily expensive and highly customised, both frames and components used in an attempt must also be available for sale to the public.</p>\n<p>However, there are often disputes as to how closely this rule is adhered to. Riders will also wear aerodynamic helmets, skinsuits, and overshoes to further minimise air resistance. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/events\">Events</a></div>    </div></div>","author":"jdelves","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8701dee491320480931581ba350861be5879bc54b9535f8c1ef48380d01a8e88","category":"Cycling"}