{"title":"Sea turtle strandings in the temperate Southwest Atlantic: Analysis of drivers and potential causes","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4166?af=R","date":1715336928000,"content":"<h2>Abstract</h2>\n<p>\nMarine megafauna are subject to several threats due to the increasing exploitation of marine ecosystems. Mortality is frequently evidenced by the occurrence of stranded individuals in coastal zones; however, conclusive identification of its drivers and causes is challenging.\nIn this study, we explore the hypothesis that bycatch in trawling is one of the anthropic drivers of sea turtle strandings in the temperate Southwest (SW) Atlantic, where green (<i>Chelonia mydas</i>), loggerhead (<i>Caretta caretta</i>) and leatherback (<i>Dermochelys coriacea</i>) turtles forage seasonally.\nBeach survey data during March, April and May from 2014 to 2018 were used to characterize strandings and relate their spatio-temporal distribution to physical and anthropic variables.\nLoggerhead (47.4%) and leatherback turtles (49.3%) were the most common stranded species, whereas green turtles were recorded only occasionally (3.3%). Based on the size distribution, strandings reflected both juvenile and adult mortality, with variations between species. Generalized linear models showed that sea turtle strandings were influenced by winds and sea surface temperature, while there was no evidence of a relationship with fishing effort. Further studies should assess drowning due to bycatch as a cause of turtle death, since interaction with fisheries is commonly reported in the area and drowned animals may or may not wash ashore.\nThis study raises awareness and assesses, for the first time, the mortality of threatened sea turtle species in a poorly known region of its distribution.\n</p>","author":"Martina Vassallo, \nCecilia K. Álvarez, \nSergio Rodríguez‐Heredia, \nAlan F. Rosenthal, \nDiego A. Albareda, \nMarcela M. Uhart, \nVictoria González Carman, \nDaniela Alemany","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"870912dd86945085549a64ac4db963db02d1c9220023247c4fffd40ec0eeb337","category":"Environment"}