{"title":"Google’s 80-acre megacampus will take over a chunk of San Jose","link":"https://arstechnica.com/?p=1768069","date":1622136562000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/g3-980x650.jpg\" /></div>\n        <p>\n          Google's rendering of \"The Meander,\" which will be \"a central social gathering place with shops and local food.\"  I assume there are office buildings in there somewhere.                  </p>\n        </div>\n      </li>\n      </ul><p>Google has gotten approval to build a \"multi-billion dollar megacampus\" in San Jose, California, just 10 miles away from the <a href=\"https://arstechnica.com/gadgets/2016/07/google-and-linkedin-swap-real-estate-giving-google-space-for-its-new-hq/\">other giant campus</a> the company is building in Mountain View. <a href=\"https://www.cnbc.com/2021/05/25/google-cleared-to-build-multi-billion-dollar-megacampus-in-san-jose.html\">CNBC reports</a> that city officials approved Google's \"Downtown West\" project on Tuesday night.</p>\n<p>Google's <a href=\"https://realestate.withgoogle.com/sanjose/\">sales pitch</a> describes the development as a \"mixed-use urban destination\" built around the Diridon Station transit hub. When the project is completed, Google will own an 80-acre chunk of land that will have 7.3 million square feet of office space, 4,000 housing units, 15 acres of \"parks, plazas, and green space,\" and 500,000 square feet dedicated to \"retail, cultural, arts, education, hotels and more.\" One thousand of the 4,000 houses will be designated as \"affordable\" housing. Google’s San Jose development director, Alexa Aren, described the project as “much less the corporate campus” and more like “a resilient neighborhood.” It sounds like it's essentially going to be a Google Town that employees can live and work in.</p>\n<p>The campus has been in the works for four years. Google came up against opposition from Santa Clara County, which was concerned about building heights, and from NHL team the San Jose Sharks, whose <a href=\"http://www.sapcenter.com/\">SAP Center</a> is about to be engulfed in Google's construction project. The Sharks were concerned about parking, but Google and the team <a href=\"https://www.mercurynews.com/2021/05/25/in-about-face-san-jose-sharks-settle-over-concerns-about-googles-downtown-development/\">worked out a deal</a> just before the campus was approved. Santa Clara was overruled by the city council's unanimous vote. Concern about building heights is pretty much the cause of all the housing problems in Silicon Valley. As the world's biggest tech hub, the area could support giant skyscrapers, but <a href=\"https://www.forbes.com/sites/timothylee/2011/09/19/zoning-laws-are-strangling-silicon-valley/\">local politics</a> prevent them from being built. San Jose is <a href=\"https://en.wikipedia.org/wiki/List_of_tallest_buildings_in_San_Jose,_California\">the most populous city</a> in the US with no buildings of 300 feet (91 m) or higher. The city's tallest building, \"<a href=\"https://www.highrises.com/san-jose/tower-88-condos/\">The 88</a>,\" only has 23 floors.</p></div><p><a href=\"https://arstechnica.com/?p=1768069#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768069&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"870a30eede6ca3227677bb0c5aa0edf6723fac3c19c3b6802427152d9b8aa5d7","category":"Tech"}