{"title":"TrainerRoad Launches TrainNow as Part of Bigger Adaptive Training Overhaul","link":"https://www.dcrainmaker.com/2021/02/trainerroad-adaptive-training-trainnow.html","date":1614278747000,"content":"<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/DSC_3179.jpg\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"DSC_3179\" src=\"https://media.dcrainmaker.com/images/2021/02/DSC_3179_thumb.jpg\" alt=\"DSC_3179\" width=\"720\" height=\"480\" border=\"0\" /></a></p>\n<p>Today TrainerRoad announced sweeping changes to the platform, which they&#8217;ve dubbed <a href=\"https://www.trainerroad.com/blog/introducing-adaptive-training-the-right-workout-every-time/\">Adaptive Training</a>. This means they&#8217;re starting to use machine learning algorithms to change workouts based on your progress towards a given goal. A workout is scored as you complete it, and then the rest of your scheduled workouts change accordingly to adapt accordingly. However, while that was announced today, it won&#8217;t arrive on most peoples desktops for some time.</p>\n<p>What is on your desktop as of today is their new TrainNow feature, which will give you one-off workout recommendations in three training categories, based on your past workout history, along with the option to choose the duration of the workout. TrainNow is using the underpinnings of Adaptive Training machine learning to generate those workout recommendations. So in effect, its your first window into TrainerRoad&#8217;s bigger changes.</p>\n<p>While this might sound basic, the reality is that with far fewer people having a set goal for training or racing in 2020/2021, doing ad-hoc workouts has become more and more common for what are otherwise highly structured athletes. This feature is entirely targeted at those that use TrainerRoad but without a specific TrainerRoad plan, of which, TrainerRoad says there are more users than you might realize (though, it does work if you do have a plan loaded and just prefer to ignore the plan).</p>\n<p>The main point is that many of us want to do a structured workout, but frankly can’t decide which one to choose. Whether it be on TrainerRoad, Zwift, Xert, or others – you’re often presented with hundreds or thousands of choices without any real guidance, or even basic suggestions. In fact, I’d suggest that’s why platforms like Peloton have done so well: They bubble up those suggested workouts to you, removing all the indecision blockers.</p>\n<p>So, let’s jump right into it.</p>\n<h3><span style=\"font-weight: bold;\">How it works:</span></h3>\n<p>To begin, you’ll first update your TrainerRoad app, and then once that’s done, hit ‘Workouts’ on the left side, followed by the ‘TrainNow’ tab at the top:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-88.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-88.png\" alt=\"image\" width=\"722\" height=\"540\" border=\"0\" /></a></p>\n<p>Next, you can choose a specific duration for the workout, from 30 minutes up to 120 minutes. These of course align to the specific durations within the TrainerRoad library.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-89.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-89.png\" alt=\"image\" width=\"722\" height=\"443\" border=\"0\" /></a></p>\n<p>In my case, for today I’ll choose the 45-minute option, and then you’ll notice how below, it changes the workout options to different ones. As with usual, the thin line across the middle of the workout is your FTP level, so you can quickly gauge how much suck this workout will entail. Or, those more scientifically focused can simply look at the TSS &amp; IF scores (Training Stress Score &amp; Intensity Factor) listed next to it.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-90.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-90.png\" alt=\"image\" width=\"722\" height=\"541\" border=\"0\" /></a></p>\n<p>Don’t like the look of the options presented? Not your preferred blue style? Don’t like the name of the workout? No problem, hit the ‘Refresh’ button to wash away those options and get presented with three new ones. It’s like pulling the slot machine arm, appropriate for a company based in Reno, Nevada.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-91.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-91.png\" alt=\"image\" width=\"722\" height=\"409\" border=\"0\" /></a></p>\n<p>Ultimately, I pressed refresh a few more times, until I got ‘Goddard –4’, which looked interesting. Side note, you’ll notice the intensity and TSS scores for all these workouts in each category are almost identical. That’s not on accident. And it’s not something for today’s post either.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-92.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-92.png\" alt=\"image\" width=\"720\" height=\"402\" border=\"0\" /></a></p>\n<p>Once you’ve decided on a workout, you can tap it to open it up. You’ll get a preview with a bit more descriptive detail just like normal:</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-93.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-93.png\" alt=\"image\" width=\"722\" height=\"542\" border=\"0\" /></a></p>\n<p>And then from there you’ll go ahead and pair up any trainer devices and do the workout as normal.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-94.png\"><img style=\"display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-94.png\" alt=\"image\" width=\"720\" height=\"390\" border=\"0\" /></a></p>\n<p>And then simply go onto suffer and do the workout like normal. There’s no difference at this point forward – it’s just as if you do the usual TrainerRoad workouts.</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-95.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-95.png\" alt=\"image\" width=\"720\" height=\"390\" border=\"0\" /></a></p>\n<p>And then afterwards you’ll get the summary information, as well as see the results in the app and online for analysis there (and also as usual synced to other training platforms like TrainingPeaks and Strava):</p>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-96.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-96.png\" alt=\"image\" width=\"722\" height=\"372\" border=\"0\" /></a></p>\n<p>See…easy peasy!</p>\n<h3><span style=\"font-weight: bold;\">Wrap-Up:</span></h3>\n<p><a data-fancybox=\"gallery\" href=\"https://media.dcrainmaker.com/images/2021/02/image-97.png\"><img style=\"border: 0px currentcolor; display: inline; background-image: none;\" title=\"image\" src=\"https://media.dcrainmaker.com/images/2021/02/image_thumb-97.png\" alt=\"image\" width=\"722\" height=\"461\" border=\"0\" /></a></p>\n<p>This is a smart move for TrainerRoad, and one that I’ve long been hoping to see. Like I said earlier, the idea of ad-hoc workouts isn’t much different than what Peloton does, or in fact – even Zwift. For example, on Zwift when I open the companion app I’m presented with all the upcoming group rides that are about to start. When I decide to Zwift, 95% of the time I’m going to pick one of those workouts in the next hour or so, based entirely on that little section.</p>\n<p>However, Zwift doesn’t have that same concept for structured workouts. I mean, sure, if one of those group rides happens to be a group workout – then yes. But there’s currently no recommendations engine within Zwift’s ever-expanding library of structured workouts. And that ignores the fact that it’s a nightmare to find anything in the Windows 95-style nested folder scheme that is the workouts UI. There may be lots of gold down there, but I just give-up and choose either the short or long form of <a href=\"https://whatsonzwift.com/workouts/less-than-an-hour-to-burn/jons-short-mix\">Jon’s Mix</a> half the time – since I could at least find it quickly in the folders.</p>\n<p>But what’s probably more interesting on TrainerRoad’s side is actually the otherwise innocuous text just above the TrainNow workouts, which states: “Allow us to suggest some other options, based on your recent training history.”</p>\n<p>That’s notable, because up until this point, TrainerRoad hasn’t actually taken historical data, except for RAMP/FTP test details, and done anything with it that’s recommendations or forward-moving in nature. So that single line is basically referring to the larger Adaptive Training machine-learning driven changes to the platform. But, that&#8217;s a different thing or two for another day.</p>\n<p>With that – thanks for reading!</p>\n<p><em>[Can’t decide on a trainer app to use? Ask no more, and hit up this <a href=\"https://www.dcrainmaker.com/2020/03/cycling-indoor-trainer-app-guide.html\">massively long and detailed cycling trainer apps guide</a>.]</em></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"870bfad9d8abfb58566f6ca9f960011855c5c6bba5bbd0f96a47d4d78a2a6e54","category":"Cycling"}