{"title":"Evaluation of the Flooding and Drought Analysis Results by Determining the Hydrological Characteristics of the Eflani River Basin (Karabük, Safranbolu)","link":"http://link.springer.com/10.1007/978-3-031-65960-7_6","date":1735689600000,"content":"<h3>Abstract</h3>\n                    <p>In this study, the hydrological characteristics of the Eflani River Basin, which has many tourist areas such as canyons and lakes, were studied. On-site tests using a multi-parameter were conducted, and chemical and isotopic samples were taken at wet and dry periods. The electrical conductivity and pH values ranged between 392 and 456 μS/cm and 7.55 and 7.91, respectively. Due to the Piper diagram, the water has Ca–HCO<sub>3</sub> facies. Oxygen-18-deuterium and tritium isotope results show that the water is of meteoric origin and has modern recharge. The water was compared with the Turkish Water Regulations for Human Consumption and WHO standards for drinking water purposes. The water exceeded the standards for B, Al, As, Se, and Fe. It is thought that the source of these pollutions may be the natural leaching of rocks with rich mineral deposits and the unconscious use of fertilizers and pesticides during agricultural activities. In this study, the drainage areas were determined as 547 km<sup>2</sup>. With the help of precipitation data, the possible flood discharge of Eflani River Basin according to different year return periods was calculated according to DSI Synthetic and Mockus methods and was determined as 258 and 280 m<sup>3</sup>/s, respectively, for Q<sub>100</sub> and CN80. The drought sensitivity was also analyzed using monthly total precipitation data and the average monthly temperature of precipitation monitoring stations (Karabük and Bartın) around the basin. The Standard Precipitation Index (SPI) and the Reconnaissance Drought Index (RDI) were used for this goal, and the highest drought period was recorded in April 2005–2006 as monthly. According to study results, it is determinated that the study area and its surroundings are sensitive to both flood, drought disasters and water pollution sources.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"870ca1ddad5c6a6c334e49d8b885955706f74a1231701f26971617fd3b91cc6e","category":"Environment"}