{"title":"The magnitude of selection on growth varies among years and increases under warming conditions in a subarctic seabird","link":"https://academic.oup.com/evlett/article/8/1/56/7060044?rss=1","date":1677542400000,"content":"<span><div>Abstract</div>Because of ongoing rapid climate change, many ecosystems are becoming both warmer and more variable, and these changes are likely to alter the magnitude and variability of natural selection acting on wild populations. Critically, changes and fluctuations in selection can impact both population demography and evolutionary change. Therefore, predicting the impacts of climate change depends on understanding the magnitude and variation in selection on traits across different life stages and environments. Long-term experiments in wild settings are a great opportunity to determine the impact of environmental conditions on selection. Here we examined variability in the strength of selection on size traits of nestling black-legged kittiwakes (<span>Rissa tridactyla</span>) in a 25-year study including a food supplementation experiment on Middleton Island in the Gulf of Alaska. Using mixed effect models, we examined the annual variability of stage-specific and resource-specific selection gradients across 25 years. We found that (a) larger and heavier hatchlings were the most likely to survive during early ontogeny, (b) non-food supplemented younger nestlings in a brood experienced the strongest selection, and (c) warmer conditions increased the magnitude of selection on nestling mass and affected non-food supplemented and second-hatched nestlings the most. Our results suggested that variable resource dynamics likely caused some of the changes in selection from year to year and that warming conditions increased the strength of selection on subarctic seabird growth. However, our experimental manipulation revealed that local environmental heterogeneity could buffer the selection expected from broader climatic changes. Consequently, understanding the interactive effects of local conditions and general changes in climate seems likely to improve our ability to predict future selection gradients.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"871583a360721e67f3e94a9cc74ab709f5f93f358d6a225b66056b08a00fd85b","category":"Environment"}