{"title":"Implications of climate‐change‐induced stressors and water management for sterlet populations in the Middle and Upper River Danube","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4361?af=R","date":1723692261000,"content":"<h2>Abstract</h2>\n<p>Sturgeons are a group of iconic rheophilic fish whose populations worldwide are currently undergoing significant declines. The study investigates the impact of climate change and anthropogenic activities, particularly the Gabčíkovo barrage system, on the survival and distribution of the sterlet, the last surviving sturgeon species in the Middle and Upper Danube River, specifically in the river part rkm 1708–1920 divided into three river sections: PT1 (Danube river part 1: rkm 1708–Gabčíkovo impoundment), PT2 (Danube river part 2: rkm 1854–1920), and PT3 (Old Danube part 3: rkm 1850–1810). Between years 1996 and 2020, water temperatures in the Danube River (PT1, PT2) rose by over 1°C on average, with the Old Danube (PT3) experiencing an alarming average increase of 3.5°C (df = 2, <i>F</i> = 145.03, <i>p</i> = &lt;2.2e-16). Consequently, suitable sterlet habitat (depth ≥4 m) in the Old Danube (PT3) now covers only 11% of its total area compared with 67% in PT1 and 75% in PT2 (flow rate = 1924.27 m<sup>3</sup> s<sup>−1</sup>) due to altered flow regimes, water levels, and siltation. Sterlets are increasingly caught in an artificial channel below to the Gabčíkovo Hydroelectric Power Plant (80%–90% of annual total catch), suggesting a shift in their distribution patterns. Conversely, there has been a notable decline in sterlet populations in other river sections, including a decrease in a section with moderate ecological status according to Water Frame Directive criteria. In light of these findings, the study proposes several mitigation measures to improve the status of the sterlet population in the area.</p>","author":"Martin Šindler, \nMaroš Kubala, \nDušan Senko, \nMartin Mišík, \nGábor Guti, \nLadislav Pekárik, \nBořek Drozd","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"8717178ec7d19af13043989ab4af34e83d5f0f7a2e6d2a0cf16d2211d6b44e25","category":"Environment"}