{"title":"Association between awareness and knowledge of medication-overuse headache with medication-taking behavior among adults with migraine","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306264","date":1719583200000,"content":"<p>by Stacy C. Bailey, Allison P. Pack, Andrea Zuleta, Wei Huang, Melissa P. Herman, Steven M. Kymes, Damian Fiore, Yvonne Curran</p>\r\n\r\nFrequent use of pain relief medications among patients with migraine can result in disease worsening and medication-overuse headache (MOH), a painful and debilitating condition. We sought to conduct a cross-sectional survey among adult patients diagnosed with migraine to determine: 1) their awareness of MOH, and 2) their knowledge of the condition and its prevention, and 3) the association of these factors with actual use of pain relief medications. We recruited and interviewed 200 English-speaking adults with migraine who had a clinic visit with a neurologist or primary care provider within the past month. Patients were identified via an electronic health record query. Almost 40% of participants had never heard of the term ‘medication-overuse headache.’ In bivariate analyses, participants who were Black or Hispanic and those with limited health literacy were less likely to have heard of MOH. Participants scored an average of 2.1 (range: 0–3) on a MOH knowledge measure; older participants, those with limited health literacy, lower education, and little or no migraine-related disability demonstrated less knowledge. Almost a third (31.5%) of patients reported overusing pain relief medication and were at risk for MOH. Overuse was not significantly associated with MOH awareness, knowledge, or sociodemographic factors, but was related to greater migraine-related disability. Our findings suggest that patient awareness and knowledge of MOH is suboptimal, particularly among older adults, racial and ethnic minority groups, and those with limited health literacy. Interventions are needed to prevent MOH and better inform patients about risks associated with frequent use of pain relief medications.","author":"Stacy C. Bailey","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"872aa406226f420d117105bdf66973b724d1633d9e8910a4af9e208c786084aa","category":"Interdisciplinary"}