{"title":"Locating QTLs Controlling the Yield-Related Traits in Perennial Chinese Rice \"Shendao3#\"","link":"https://www.preprints.org/manuscript/202409.0506/v1","date":1725849888000,"content":"This study aimed to explore the genetic information about the yield traits in perennial Chinese rice \"Shendao3#\" and provide a series of theoretical bases for the innovative utilization of perennial Chinese rice germplasm. The F2 population derived from the cross between perennial Chinese rice \"Shendao3#\" and one annual rice \"XiqingzaoB\" was developed to identify QTLs’ underlying yield-related traits. Fifteen yield traits including plant height, panicle plant-1, and thousand-grain weight were measured for the QTL mapping. The software packages Excel 2010, GraphpadPrism 5.0, and QTLIciMapping 4.10 were used to perform the phenotypic data analysis, construction of molecular map, and QTL mapping, respectively. Results indicated 15 yield-related traits displaying normal distribution and belonging to quantitative trait inheritance. A total of 25 QTLs associated with the yield-related traits and 26 epistatic QTLs were detected on the whole genome except for the 6th and 12th chromosomes. This finding explained phenotypic variance with ranging from 4.21% to 27.30% and 1.15% to 19.30%, respectively. Six pleiotropic QTL (chromosomal regions) underlying two or more yield-related traits were detected on the 1st , 4th, 7th, 8th, and 11th chromosomes, respectively. Among 25 QTLs underlying a single yield-related trait, 11 were primarily identified in the perennial Chinese rice \"Shendao3#\". All QTLs underlying 15 yield-related traits followed the genetic model of additive, dominant, and digenic epistatic of additive by additive, additive by dominant, dominant by additive, and dominant by dominant. This work can serve as a good foundation for yield-related gene mining and its utilization in breeding the perennial Chinese rice \"Shendao3#\".","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"873395caa0dfd3df3935a6ed42bc86a3fafba63622fdebc2fe41a4db13e0007e","category":"Interdisciplinary"}