{"title":"Oceanography of the Eastern Equatorial Pacific Ocean Across the Oligocene‐Miocene Transition","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024PA004892?af=R","date":1720245918000,"content":"<h2>Abstract</h2>\n<p>The functioning of the Pacific Ocean—the world's largest ocean—during a warmer-than-present paleoclimate state remains underexplored. We present planktonic and benthic foraminiferal stable oxygen (δ<sup>18</sup>O) and carbon (δ<sup>13</sup>C) isotope records from Integrated Ocean Drilling Program (IODP) Site U1334 that span the Oligocene-Miocene Transition (OMT) interval, from 24.15 to 21.95 million years ago (Ma). We reconstruct (sub-)surface and deep-water conditions and provide better constraints on the physical and chemical oceanography of the eastern equatorial Pacific Ocean (EEP). Positive trends in planktonic and benthic foraminiferal δ<sup>18</sup>O values, mark a largely uniform imprint of increased land-ice volume/global cooling on surface- and deep-waters. We document a delayed planktonic foraminiferal δ<sup>18</sup>O increase across the OMT as well as an increase in the amplitude variability of planktonic foraminiferal δ<sup>18</sup>O values on eccentricity timescales during the early Miocene. We interpret this as an enhanced glacioeustatic sea-level control on Atlantic-Pacific salinity exchange through the Central American Seaway (CAS) or as the onset of more variable surface currents and oceanic fronts in the EEP. Positive trends in planktonic and benthic foraminiferal δ<sup>13</sup>C values characterize the whole-ocean depletion in <sup>12</sup>C linked to organic carbon burial during the Oligocene-Miocene carbon maximum (CM-OM). However, this depletion is more pronounced in the planktonic foraminiferal δ<sup>13</sup>C record, especially during ∼400 Kyr eccentricity minima, reflecting an increase in nutrient upwelling and the efficacy of the biological carbon pump (BCP) when global temperatures decreased across the OMT and during the early Miocene. Our study highlights the dynamic behavior of the EEP in a warmer-than-present unipolar icehouse state.</p>","author":"Diederik Liebrand, \nBridget S. Wade, \nHelen M. Beddow, \nDavid J. King, \nAlexander D. Harrison, \nHeather J. H. Johnstone, \nAnna Joy Drury, \nHeiko Pälike, \nAppy Sluijs, \nLucas J. Lourens","siteTitle":"Wiley: Paleoceanography and Paleoclimatology: Table of Contents","siteHash":"69a881e15689378344e2f544f17d899603864e0695b4208841b63784555058e2","entryHash":"873510fd46bc78d477940afd0258cc6fb8e3716b1a180cd10eaad758bb516021","category":"Environment"}