{"title":"Audacity 'Spyware' Claims Follow Privacy Policy Changes By New Owner","link":"https://www.macrumors.com/2021/07/05/audacity-spyware-claims-privacy-policy/","date":1625477023000,"content":"<img src=\"https://images.macrumors.com/article-new/2021/07/audacity-200x200.jpg\" />Popular open-source audio editing software <a href=\"https://www.audacityteam.org\">Audacity</a> is facing \"spyware\" allegations from users for recent privacy policy changes that suggest the desktop app is collecting user data and sharing it with third parties, including state regulators where applicable.\r\n<br />\r\n\r\n<br />\r\nTwo months ago, Audacity was <a href=\"https://www.musictech.net/news/industry/audacity-acquired-muse-group-ultimate-guitar-musescore/\">acquired</a> by Muse Group, which owns other audio-related projects including the Ultimate Guitar website and the MuseScore app. According to <em><a href=\"https://fosspost.org/audacity-is-now-a-spyware/\">Fosspost</a></em>, changes to the <a href=\"https://www.audacityteam.org/about/desktop-privacy-notice/\">privacy policy section</a> on the Audacity website indicate that several personal data collection mechanisms have since been added by the parent company.\r\n<br />\r\n\r\n<br />\r\nThe type of data collected now includes the computer's processor, operating system and version, the user's IP address, and any crash reports, fatal error codes and messages generated by their machine. More concerning perhaps is the inclusion of a vague section listing data that must be collected \"for legal enforcement, litigation, and authorities' requests (if any).\"\r\n<br />\r\n\r\n<br />\r\nThe storage of said data is located in servers in the U.S., Russia, and the European Economic Area. For example, IP addresses are stored in an identifiable way for a day before being hashed and then stored in servers for a year, leaving users identifiable via government data requests.\r\n<br />\r\n\r\n<br />\r\nIn addition, the new policy prevents people under the age of 13 from using the software, which is a violation of the GPL license that Audacity uses. \r\n<br />\r\n\r\n<br />\r\nUnderstandably, the policy changes have upset Audacity users, who have taken to <a href=\"https://www.reddit.com/r/linux/comments/od3h8b/audacity_may_collect_data_necessary_for_law/\">Reddit</a> and <a href=\"https://github.com/audacity/audacity/issues/1213\">GitHub</a> to question why an offline desktop app needs to \"phone home\" at all, and there is already discussion about forking Audacity into a separate open-source project that's free from the Muse Group's ownership and questionable data collection practices.<br />This article, \"<a href=\"https://www.macrumors.com/2021/07/05/audacity-spyware-claims-privacy-policy/\">Audacity 'Spyware' Claims Follow Privacy Policy Changes By New Owner</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/audacity-spyware-claims-follow-privacy-policy-changes-by-new-owner.2303275/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mew_vreLE7c:jfbhfHowqyk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=mew_vreLE7c:jfbhfHowqyk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/mew_vreLE7c\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8737030e6e39a2d7c087da0c481486ab9f526e9a31c16d5a5188043e0986cf8c","category":"Apple"}