{"title":"Microsoft sure seems to be thinking about some sort of portable Xbox","link":"https://arstechnica.com/?p=2004092","date":1708107844000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/xclouddemo-800x1067.jpeg\" alt=\"A demo of &quot;Project Xcloud&quot; streaming running on a mobile device, circa 2019.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/xclouddemo-scaled.jpeg\">Enlarge</a> <span>/</span> A demo of \"Project Xcloud\" streaming running on a mobile device, circa 2019. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Yesterday's news that <a href=\"https://arstechnica.com/gaming/2024/02/microsoft-says-its-taking-four-unnamed-xbox-games-to-the-other-consoles/\">four unnamed Microsoft games are coming to \"the other consoles\"</a> was a bit anticlimactic after weeks of <a href=\"https://arstechnica.com/gaming/2024/02/do-xbox-owners-have-a-right-to-expect-console-exclusives/\">now-refuted rumors</a> about games like <em>Starfield</em> and <em>Indiana Jones and the Great Circle</em> going to the PlayStation 5. Yet even as those rumors die, Microsoft seems to be actively feeding new rumors regarding plans for some sort of portable gaming device.</p>\n<p>In <a href=\"https://www.theverge.com/24073666/microsoft-gaming-phil-spencer-interview-ps5-switch-games\">an interview with the Verge</a> accompanying yesterday's \"multi-platform\" business announcement, Microsoft CEO Phil Spencer was asked directly about any handheld hardware plans, including his recent penchant for <a href=\"https://twitter.com/XboxP3/likes\">liking some social media posts discussing handheld game consoles</a>. While Spencer said he had \"nothing to announce,\" he talked up a lot of <em>other</em> handheld gaming hardware when talking about how Xbox could capture more \"player hours.\"</p>\n<blockquote><p>So, okay, what keeps people from playing certain hours? Well there’s some sleep, school, and kind of normal life, but some of it is just access. Do I have access to the games that I want to play right now? Obviously we’re kind of learning from what Nintendo has done over the years with Switch, they’ve been fantastic with that. So when I look at Steam Deck and the ROG and my Legion Go, I’m a big fan of that space.</p></blockquote>\n<p>Spencer went on to say that \"real work\" still needs to be done to get Windows to work better with controller input and on smaller 7- to 8-inch screens. That's the kind of OS work we'd note would be very useful if Microsoft is planning to release a Windows-based gaming portable of its own (we're assuming Microsoft <a href=\"https://arstechnica.com/gaming/2024/01/why-more-pc-gaming-handhelds-should-ditch-windows-for-steamos/\">would not want to ditch Windows in favor of SteamOS</a>). \"That’s a real design point that our platform team is working with Windows to make sure that the experience is even better,\" he said.</p></div><p><a href=\"https://arstechnica.com/?p=2004092#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2004092&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"87370cc8b03767892f2e900aacfdb926b2941f9b3edd32ca0fbcf18d6a2e95f5","category":"Tech"}