{"title":"PSIX-18 Multiomic analysis to identify host and microbiome contributions to digestibility in beef cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/734/7757882?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>This study evaluated beef heifers selected for high (efficient) or low (inefficient) digestible fiber intake (DFI). Initial analysis showed that high DFI animals had reduced methane production versus low-DFI under a high forage diet. Using the same cohort of animals maintained on a further 4 diets of varying forage:concentrate ratios, we employed multi-kingdom amplicon sequencing and metagenome shotgun sequencing of rumen digesta and feces alongside RNA sequencing of rumen epimural samples to evaluate the compositional and functional interplay between different microbial groups, and their relationship with host gene expression in cattle divergent for DFI. Samples were collected from 16 cattle during 2 metabolism trials, comprising 5 diets. Amplicon sequencing analysis was conducted using QIIME2; 16S rRNA and 18S rRNA reads were analyzed using the SILVA database, while LSU (fungal) sequences were analyzed using a custom D1/D2 database. Additional analysis of archaeal 16S rRNA sequences was conducted using the Rumen and Intestinal Methanogens (RIM) database. Metagenome shotgun reads underwent a two-pass classification with Kraken2 using a database of prokaryotic genomes derived from the GTDB taxonomy, with the unclassified output undergoing classification using a custom database containing all NCBI protozoa, fungi, and phage genomes, enriched with selected rumen-specific ciliate and fungal genomes. Downstream analysis of taxonomic data from all microbiome work was conducted in R, and differentially abundant taxa were identified using ANCOM-BC and Aldex2. Functional analysis of metagenome contigs using the CAZY database implemented in dbCAN3 is ongoing. RNA-seq data were analyzed using the ARS-UCD reference genome, with identification of DE genes conducted using DeSeq2. Preliminary results indicate no major effect of DFI ranking on host gene expression, bacterial 16S rRNA, or metagenome compositional profiles. Several bacterial genera were differentially abundant between digestibility groups (<span>P</span> &lt; 0.05), but these were all minor (&lt; 0.01%) members of the microbiome. Fungal and methanogen communities different significantly (<span>P</span> &lt; 0.05) according to DFI group, with efficient (high DFI) containing and more diverse communities under high-grain diet (<span>P</span> &lt; 0.05). The same difference showed a tendency toward significance for the 18S rRNA protozoa data (<span>P</span> &lt; 0.1). These preliminary data indicate that the microbial factors underpinning divergence in efficiency measured by DFI vary according to diet and may be more prominent in the non-bacterial fraction of the microbiome. Ongoing functional analysis of metagenome data as well as integration of multiomic data will provide deeper insight into these relationships and how they contribute to feed digestibility and efficiency in cattle.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8738455a5127c482f2041d30bf4a6e6123c13c74161baa1c3483d3e69135a83b","category":"Environment"}