{"title":"The Role of Statins in the Prevention and Management of Alzheimer&rsquo;s Disease: A Focused Review","link":"https://www.preprints.org/manuscript/202409.2184/v1","date":1727417552000,"content":"Alzheimer’s disease (AD) is a neurodegenerative disease that is characterized as a progressive decline in cognitive functions that primarily affects older adults. Alzheimer’s is pathophysiologically characterized by the accumulation of amyloid-beta (Aβ) plaques, neuroinflammation, accumulation of tau proteins in neurofibrillary tangles (NFTs), and tissue loss. These three main characteristics are hallmarks of neurodegeneration. Statins are a class of medications that lower the cholesterol levels in the blood, and their anti-inflammatory effects have gained attention for their potential impact on influencing AD progression. This literature review explores the relationship between the use of statins and AD, examining the effect of statins on cholesterol metabolism, neuroinflammation, apolipoprotein E (ApoE), and Aβ production. This literature review was conducted using PubMed and Google Scholar to summarize the association between statins and AD. The neurodegenerative properties of Alzheimer’s disease have been imaged and documented in both rodent models and humans. Experiments using transgenic mice and knock-in mice have shown that specific human genes enhance neurodegeneration, and the overactivation of glial cells in the brain causes hallmark neuroinflammation. These rodents all subsequently suffered from neurodegeneration and AD symptoms. Humans showed promise of possible AD biomarkers in the blood and brain through the presence of excess isoprostanes and oxysterols, respectively, providing hope for future research into early detection/treatment. There has been evidence that statins exhibit neuroprotective pleiotropic effects in rodent models, showcasing reductions in cellular adhesion molecules (the main molecule in inflammation), oxidative stress, and inflammatory peptides. ApoE is a cholesterol transport protein in the brain and is critical to forming an effective synapse. Statin use has effectively altered the ApoE4 allele and reduced the Aβ production in the brain. However, the mechanism for which statins slow the progression of neurodegeneration in AD is still unclear and warrants further research before it can be officially called a treatment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"873f38a8e35d1aef50be2a06b79d352cf7dbebb181b0d18d440becb0c0fcc9a0","category":"Interdisciplinary"}