{"title":"How to set the saddle height on your bike","link":"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/","date":1702036800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/02/How-to-assemble-a-bike-21-52b9cd1.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"How to assemble a bike, setting saddle height with tape measure\" title=\"How to assemble a bike\" />                                            <p>Changing your saddle height is the most important adjustment you can make to the fit of your bike.</p>\n<p>In this guide, we’ll explain how to find your correct saddle height on a bicycle, including how to set the fore/aft position of the saddle, as well as tilt.</p>\n<p>While this guide focuses on setting the saddle height for a<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\"> road bike</a>, it applies equally to<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\"> mountain bikes</a>,<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hybrid-bike/\"> hybrids</a> and<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\"> gravel bikes</a>. We have a dedicated guide to<a href=\"https://www.bikeradar.com/features/4-simple-steps-to-set-up-your-mountain-bike/\"> mountain bike setup.</a></p>\n<p>When your saddle is at the right height, and has the correct fore/aft position and tilt, you’ll have a comfortable and efficient ride.</p>\n<p>You risk discomfort or, worse, injury if they’re not. Many of the<a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-fix-5-of-the-most-common-causes-of-bike-pain\"> most common types of pain caused by cycling</a> are linked to incorrect saddle height.</p>\n<h2>How to set saddle height on a bike</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Measuring saddle height from bottom bracket\" title=\"Bikeradar_221123_dc_loc_studio7653\" />\n\n</div><div><figcaption><span><i></i> Saddle height is usually measured to the middle of the bottom bracket.</span></figcaption><span> <i>Dave Caudery / Our Media</i></span></div>\n<p>It’s good practice to document your starting position before doing anything. It will come in handy in the future, especially if you find any changes you have made aren’t working for you – with your old position noted, you can go back to your starting point quickly.</p>\n<p>In addition to saddle height, you’ll also need to consider saddle fore/aft (also known as saddle setback) and saddle tilt.</p>\n<h3>1. How to measure your bike’s saddle height</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Tape measure on top of bike saddle\" title=\"Bikeradar_221123_dc_loc_studio7648\" />\n\n</div><div><figcaption><span><i></i> Measure the length of your saddle to find the middle.</span></figcaption><span> <i>Dave Caudery / Our Media</i></span></div>\n<p>Measure the length of your seat from front to back and find a mid-point. Mark this spot on the saddle.</p>\n<p>Use your tape measure to start at the centre-top of your saddle and measure in a straight line to the centre of your bottom bracket.</p>\n<p>Record to the nearest millimetre (764mm, for example).</p>\n<h3>2. How to measure the saddle fore/aft position</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"tape measure horizontal to bottom bracket\" title=\"Bikeradar_221123_dc_loc_studio7656\" />\n\n</div><div><figcaption><span><i></i> Measure the horizontal distance from the back of the rear wheel to the bottom bracket.</span></figcaption><span> <i>Dave Caudery / Our Media</i></span></div>\n<p>Place your bike against a wall, either in<a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\"> a stationary trainer</a> or with the wheel in. Either way, make sure the bike is vertically perpendicular to the floor and horizontally perpendicular to the wall.</p>\n<p>Measure from the wall to the bottom bracket for measurement one.</p>\n<p>Measure from the wall to the tip of the saddle for measurement two.</p>\n<p>To calculate saddle setback, deduct measurement one from measurement two.</p>\n<h3>3. How to measure saddle tilt</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Look 795 Blade RS seatpost and Selle Italia saddle\" title=\"Look 795 Blade RS seatpost and Selle Italia saddle\" />\n\n</div><div><figcaption><span><i></i> Make sure your bike is level before measuring saddle angle.</span></figcaption><span> <i>Scott Windsor / Our Media </i></span></div>\n<p>Because many saddles have contours, it’s best to measure the overall seat tilt.</p>\n<p>Place a piece of board over the seat and use your smartphone or inclinometer to find the overall seat tilt. Measure to the nearest tenth of a degree.</p>\n<h2>How to get the perfect saddle height on your bike</h2>\n<p>Once you have your three measurements, it’s time to get started.</p>\n<h3>Determining saddle height with the heel method</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"brown shoe on bike pedal\" title=\"Bikeradar_221123_dc_loc_studio7666\" />\n\n</div><div><figcaption><span><i></i> A flat heel on the pedal suggests your saddle height is roughly right.</span></figcaption><span> <i>Dave Caudery / Our Media</i></span></div>\n<p>The ‘heel method’ is a very quick way to establish a baseline height. This process can be done in a doorway, or better yet with the bike on a stationary trainer.</p>\n<p>Hop on the bike and place your heel on the pedal, in the shoes you plan on riding in.</p>\n<p>Pedal forwards or backwards slowly. If the saddle is too high, you’ll not be able to pedal smoothly without having to rock your hips from side-to-side or overreaching.</p>\n<p>Move your saddle down one to two centimetres at a time until this back-and-forth stops.</p>\n<p>Conversely, if you’re pedalling smoothly, try going up a few centimetres at a time until you start reaching for the pedals. Then, edge your saddle back down until you don’t have to stretch at the bottom of the pedal stroke.</p>\n<h3>How to use a smartphone camera to determine your saddle height</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Charlie Allenby riding on a turbo trainer\" title=\"Charlie Allenby riding on a turbo trainer\" />\n\n</div><div><figcaption><span><i></i> Ask someone to record or photograph you pedalling on a turbo trainer.</span></figcaption><span> <i>Charlie Allenby / Our Media</i></span></div>\n<p>You can use a smartphone camera to determine your saddle height by asking someone to film or take photos of your pedal stroke. The goal is to record how much bend is in your knee.</p>\n<p>You can try this method with your bike in a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">turbo trainer</a> or with one hand against the wall for support.</p>\n<p>To start, try putting your foot on the pedal as you would when riding. If this means clipping into clipless pedals, then go for it.</p>\n<p>If you prefer to ride with<a href=\"https://www.bikeradar.com/advice/buyers-guides/flat-or-clipless-pedals-which-is-right-for-you/\"> flat pedals</a>, then put about a third of your foot in front of the pedal axle, and two-thirds behind.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Setting saddle height right\" title=\"Setting saddle height right\" />\n\n</div><div><figcaption><span><i></i> At full extension, your knee should bend by about 25 to 30 degrees.</span></figcaption><span> <i>Wayne Reid / Our Media</i></span></div>\n<p>At full extension (which is more like five o’clock than six o’clock) 30 to 40 degrees of knee bend is the generally accepted range.</p>\n<p>If the images show your knee at an angle of less than 30 degrees, the seat height is likely a bit low. You may be feeling tension at the front of the knee or a large amount of work only from your quads.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Beginner's cycling skills for adults0015\" title=\"Beginner's cycling skills for adults0015\" />\n\n</div><div><figcaption><span><i></i> If you feel excess strain on your quads, the saddle is likely too low.</span></figcaption><span> <i>Wayne Reid / Our Media</i></span></div>\n<p>If the images show your knee at an angle greater than 40 degrees, the saddle is likely too high. You may feel a dull ache in your lower back, if so.</p>\n<p>Keep adjusting the height of your saddle until you’ve found something that feels smooth and balanced.</p>\n<p>Now take your bike out for a few short spins. Bring your hex keys or a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-multi-tool/\">multi-tool</a> with you to make on-the-fly adjustments if required.</p>\n<h3>Using a formula to set saddle height</h3>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Specialized Roubaix SL8 Expert road bike\" title=\"Specialized Roubaix SL8 Expert - 06\" />\n\n</div><div><figcaption><span><i></i> The Hamley method takes account of crank length, but the LeMond formula doesn’t.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>Two formulas are commonly used to find saddle height based on your inseam measurement.</p>\n<p>The LeMond Method multiplies your inseam measurement in millimetres by 0.883. This number is the distance between the top of your saddle and your bike’s<a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\"> bottom bracket</a>. Therefore, it discounts the<a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\"> length of your cranks</a>.</p>\n<p>To use the Hamley Method, multiply your inseam measurement by 1.09. This figure is the distance between the top of your saddle and the pedal axle in the six o’clock position.</p>\n<h2>How to get the perfect saddle tilt on your bike</h2>\n<p>Your saddle should properly support your sit bones (ischial tuberosities).</p>\n<p>While sitting on your saddle, if you don’t feel pressure on the bones at the base of your buttocks, it could be for two reasons:</p>\n<ol>\n<li>Your saddle shape or width doesn’t match your anatomical structure</li>\n<li>The tilt of the saddle doesn’t enable your sit bones to support you</li>\n</ol>\n<p>In the first scenario, you can check for yourself if<a href=\"https://www.bikeradar.com/advice/buyers-guides/how-to-choose-the-best-saddle/\"> your bike seat is right for you</a>.</p>\n<p>If you have the right one, the saddle tilt, which determines where pressure is applied to the pelvis, might be wrong.</p>\n<p>If the front of the seat is too high, it makes it difficult, if not impossible, for the sit bones to provide support.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Nukeproof Neutron saddle on the Vitus Sentier 27 hardtail mountain bike\" title=\"Vitus Sentier 27 hardtail mountain bike 20\" />\n\n</div><div><figcaption><span><i></i> You may slip forwards if the saddle tips down too much.</span></figcaption><span> <i>Ian Linton / Immediate Media</i></span></div>\n<p>Conversely, if the saddle is too low at the front, your sit bones can support you. But you’ll be sliding forward and subsequently applying too much pressure on your hands.</p>\n<p>Use a piece of board and a digital inclinometer (or smartphone level app) to determine saddle tilt. Write it down.</p>\n<p>Make sure your bike is level or, if it’s not, account for the fact. Now try moving things around to see what best supports your behind.</p>\n<p>Most saddles fall into a zero- to six-degree range.</p>\n<h2>How do I know my saddle height is correct?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cervelo ZFS-5 XX SL AXS full suspension mountain bike\" title=\"Cervelo ZFS-5 climbing\" />\n\n</div><div><figcaption><span><i></i> When your saddle height is optimal, you’ll pedal efficiently and comfortably.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>The correct saddle height should result in:</p>\n<ul>\n<li>A level foot where there is no excessive toe down or heel down</li>\n<li>A stable pelvis with no rocking side-to-side. If this is happening, it’s likely your saddle is too high</li>\n<li>A consistent saddle position. If a saddle is at the wrong height, riders will often shift back and forward on the saddle</li>\n<li>A smooth pedal stroke, where there isn’t a feeling of losing contact with the pedal at the bottom of the stroke</li>\n<li>Minimal discomfort, particularly in the knee</li>\n<li>An even load on your muscles</li>\n</ul>\n<p>If you can’t achieve these results by adjusting the height of your saddle, it might be worth considering whether your <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">handlebar is at the right height</a> or if you have the correct <a href=\"https://www.bikeradar.com/features/how-to-install-and-adjust-cycling-cleats/\">cleat position</a>.</p>","author":"Thomas McDaniel","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"874489fc143704d50e07b18ed3f412039a05489b3140f27656465ec4113adca5","category":"Cycling"}