{"title":"Herbal oral care products for the prevention of ventilator-associated pneumonia: A systematic review and network meta-analysis of randomised trials","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304583","date":1717768800000,"content":"<p>by SuWen Li, YanNan Huang, HongYin Xie</p>\r\nBackground <p>The recommendation for Chlorhexidine (CHX) as a traditional oral care solution is decreasing, and herbal oral care products are being considered as a potential alternative. This network meta-analysis aims to determine if herbal oral care products for oral care in mechanically ventilated patients are superior to CHX and provide direction for future research by comparing the effectiveness of herbal oral care products currently available.</p> Materials and methods <p>We searched for English-language published and grey literature sources of randomized clinical trials involving herbal oral care solutions in intensive care unit (ICU) oral care (until September 2023). The primary outcome was the incidence of ventilator-associated pneumonia (VAP); the secondary outcome was the oral microbiota quantity. Data were pooled by pairwise meta-analysis and Bayesian network meta-analysis. The risk of bias was assessed using the Cochrane risk of bias tool, and the certainty of evidence was evaluated using the GRADE framework.</p> Results <p>Our network meta-analysis included 29 studies, and the results showed that Chinese herb (OR: 0.39, 95% CI: 0.2–0.75) and Miswak (OR: 0.27, 95% CI: 0.07–0.91) were more effective in reducing VAP incidence than CHX. In terms of reducing bacterial counts, Chinese herb (OR: 0.3, 95% CI: 0.19–0.48) was superior to CHX, and all herbal oral care products, including Persica<sup>®</sup> (alcoholic extract of S. persica, Achillea millefolium, and Mentha spicata), Matrica<sup>®</sup> (Chamomile extract), and Listerine<sup>®</sup> (main components include Menthol, Thymol, and Eucalyptol), were better than saline in all aspects but without significant differences.</p> Conclusion <p>Based on our network meta-analysis, we have observed that Chinese herbal medicine and Miswak are superior to CHX in reducing the incidence of VAP. However, the safety and feasibility of traditional Chinese herbal medicine require further high-quality research for validation. Simultaneously, Matrica<sup>®</sup> demonstrates a significant reduction in microbial counts but does not exhibit a significant advantage in lowering the incidence of VAP. This observation aligns with the results of clinical double-blind trials. Therefore, we identify Miswak and Matrica<sup>®</sup> as promising herbal oral care products with the potential to replace CHX. It is essential to emphasize that our study provides guidance for future research rather than conclusive determinations.</p> Registration <p>PROSPERO no. CRD42023398022.</p>","author":"SuWen Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8755278fdc7ce7ad207a1f9f7b5f3e5e63ae923c6d974ad8149d9a02ac008049","category":"Interdisciplinary"}