{"title":"Resveratrol and Its Natural Analogs Mitigate Immune Dysregulation and Oxidative Imbalance in the Endometriosis Niche Simulated in a Co-Culture System of Endometriotic Cells and Macrophages","link":"https://www.preprints.org/manuscript/202408.1840/v1","date":1724721485000,"content":"Inflammation and immune cell dysfunction are critical facilitators of endometriosis pathophysiology. The diverse cellular fractions in the endometriotic microenvironment are represented mainly by glands and stroma, which are infiltrated by immune cells, including macrophages. Macrophages are renowned for stimulating lesion growth, vascularization, and innervation and contributing to pain in the disorder. By combining macrophages and endometriotic cells, we determined if resveratrol and its natural analogs can target the immune dysregulation and oxidative imbalance in endometriosis. We studied the effect of analyzed compounds on the expression of key inflammatory and oxidative stress markers, cytokines release, and ROS production by applying q-PCR, ELISA, Cytometric Beads Array, and multiplexed fluorogenic staining and flow cytometry analysis with bioimaging. The results showed that endometriosis-related macrophages treated with resveratrol or its derivatives have impaired expression of pro-inflammatory markers such as IL6, IL8, IL1B, TNF, CCL2, CXCL10, and PTGS2. This study also reported a pronounced antioxidant effect of the compounds by reducing the accumulation of free radicals in macrophages, which correlated with the transcript activation of detoxification enzymes (SOD, GPx). Considering the harmful macrophage action in endometriosis, we described the prospects for potential therapy based on regulating the immune microenvironment and reducing the accumulation of free radicals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"875f08e8dd11f09f1e28b5609948e3a81245ca3625772d586afac6cb5ba4049d","category":"Interdisciplinary"}