{"title":"Kuo: Apple Considering Low-Cost MacBook Launch in 2024","link":"https://www.macrumors.com/2023/10/25/kuo-apple-low-cost-macbook-launch-in-2024/","date":1698229821000,"content":"Last month, a seemingly unlikely rumor out of Asia claimed that Apple could be planning to launch a low-cost MacBook series next year in order to compete with Google's popular and more affordable Chromebook models. On Tuesday, that rumor was revived by respected Apple analyst Ming-Chi Kuo.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/10/apple-logo-backlit-mac.jpg\" width=\"1920\" height=\"1280\" />\r<br />\nA <em>DigiTimes</em> report in <a href=\"https://www.macrumors.com/2023/09/05/apple-low-cost-macbook-rival-chromebook/\">September</a> said Apple could launch a more affordable MacBook line in late 2024 to differentiate it from the company's existing MacBook Air and Pro lines. Kuo now also <a href=\"https://x.com/mingchikuo/status/1716885306933411885?s=20\">believes</a> Apple could be considering such a move to boost ailing MacBook shipments, with a target of 8-10+ million units per year. \r<br />\n\r<br />\nKuo's prediction came in response to Apple's upcoming Mac event that was <a href=\"https://www.macrumors.com/2023/10/24/apple-october-mac-event-2023/\">announced</a> on Tuesday. The analyst suggested Apple's \"Scary Fast\" event on October 30 will <a href=\"https://www.macrumors.com/2023/10/24/kuo-m3-macbook-pro-october-30/\">focus on multiple M3 chips</a>, hinting at the possibility of M3, M3 Pro, and M3 Max variants. If Apple does release M3, M3 Pro, and M3 Max chips at once, they will likely feature in new 13-inch, 14-inch, and 16-inch MacBook Pro models.\r<br />\n\r<br />\nKuo previously predicted that Apple would be unlikely to introduce new MacBook Pro models in 2023 because of \"limited 4Q 23 shipments.\" He now says that if new MacBook Pros do come out in November or December, the tight supply will last until the first quarter of 2024.\r<br />\n\r<br />\nThe analyst said Mac shipments have declined due to the \"limited M2 computing power upgrade,\" which may be the reason why Apple is prepared to launch M3 MacBook Pro models with low production volume. \"Theoretically, the M3 should offer a more significant boost in computing power,\" said Kuo, but if the M3 fails to boost shipments, that may trigger Apple's plan to introduce a \"more affordable MacBook model.\"\r<br />\n\r<br />\nAccording to the original report out of Taiwan, Apple's more affordable MacBooks will adopt some design changes to enable Apple to achieve the low price. While the outer appearance will still use a metal casing to maintain the distinctive Apple Mac aesthetic, it could be made of \"different materials.\" \r<br />\n\r<br />\nIf Apple does unveil a low-cost Mac, it could potentially come in the form of a new 12-inch MacBook. Introduced in March 2015, the original 12-inch MacBook featured a thin and light design that weighed just two pounds, and was Apple's first notebook to feature a fanless design, USB-C port, and butterfly switch keyboard. Unfortunately, due to Apple's use of Intel Core M processors, many felt it was too underpowered to justify its $1,299 price. Apple discontinued the model in 2019.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/07/12-inch-MacBook-side.jpeg\" width=\"1200\" height=\"630\" /><div><em>Apple's discontinued 12-inch MacBook</em></div>\r<br />\nReports about the <a href=\"https://www.macrumors.com/2020/08/31/12-inch-macbook-apple-silicon-this-year/\">possibility of the 12-inch MacBook returning</a> have circulated ever since Apple adopted custom Apple silicon processors across its devices and began offering the M1 ‌MacBook Air‌ with a $999 starting price. \r<br />\n\r<br />\n<em>Bloomberg</em>'s Mark Gurman was <a href=\"https://www.macrumors.com/guide/mark-gurman/\">first</a> to spark serious rumors about Apple reintroducing a 12-inch MacBook model with Apple silicon, saying last year that the device could come at the end of 2023 or in 2024. In January 2023, Gurman said that a 12-inch MacBook was no longer on the company's near-term roadmap, but stopped short of ruling the device out completely, meaning that it being pushed into 2024 or later may still be possible.\r<br />\n\r<br />\nThat was followed in February by another <a href=\"https://www.macrumors.com/2023/02/15/apple-may-still-reintroduce-12-inch-macbook/\">rumor</a> that Apple plans to bring the 12-inch MacBook back into its lineup. According to the report, production activities related to the device were ongoing, and Apple planned to decide whether to move forward with mass production as soon as the second half of this year. Whether this alleged activity relates to claims made by ‌<em>DigiTimes‌</em>, and now Kuo, about a low-cost MacBook remains to be seen.<div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/10/25/kuo-apple-low-cost-macbook-launch-in-2024/\">Kuo: Apple Considering Low-Cost MacBook Launch in 2024</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-considering-low-cost-macbook-launch-in-2024.2408619/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8761a49fbfdf3a94dc2e34199407121f1d0ec440936b4a9b9f99dd314569ab66","category":"Apple"}