{"title":"Factors affecting seeking psychological and psychiatric support for Turkish society","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310982","date":1727272800000,"content":"<p>by Kübranur Çebi Karaaslan, Abdulkerim Karaaslan, Hüriye Subaşı</p>\r\n\r\nThe increase in mental health issues and awareness among individuals, compared to previous times, has contributed to recognizing this as a significant public health issue. The necessity to explore potential factors behind mental health problems has become paramount and served as the primary impetus for the current research endeavor. This study aims to explore if there is a relationship between attitudes toward seeking psychological and psychiatric support. a significant relationship between sociodemographic factors and individuals’ tendency to seek psychological and psychiatric help, and if so, in what direction are these relationships? and a significant relationship between individual and social factors and individuals’ tendency to seek psychological and psychiatric help, and if so, in what direction are these relationships? Microdata from the Turkey Health Survey, conducted by the Turkish Statistical Institute and representative of Turkey, was used as the dataset. Increased the representative power of the data set over the universe by weighting the data set, and the Bivariate Probit Model was used to address the research questions. As a result of the study, various sociodemographic (gender, age, employment status, et al.), individual and social factors (general health status, participation in social activities, alcohol use et al.) may influence individuals’ inclinations toward seeking psychological and psychiatric assistance. The research offers valuable insights for social policymakers and researchers into the behavioral tendencies of individuals seeking professional psychiatric help.","author":"Kübranur Çebi Karaaslan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"876a013668b27755253fb42506be78ea96af15b7ffc6396a13e5cd43ce341e5f","category":"Interdisciplinary"}