{"title":"Comparative Analysis of Sipeimine Content, Metabolome, and Chloroplast Genome in Cultivated and Wild Varieties of Fritillaria taipaiensis","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13548?af=R","date":1713365382000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The wild variety Fritillaria taipaiensis E. B (EB) is known for its superior therapeutic effects, but its limited production cannot meet the demands. As a result, the cultivated variety <i>F. taipaiensis</i> P. Y. Li (PY) has been widely grown. In this study, we conducted a comprehensive analysis comparing EB and PY in terms of external features, Sipeimine content, metabolome, and chloroplast genome to differentiate these two varieties.</p>\n<h2>RESULTS</h2>\n<p>Our research revealed that the petals and pods of EB are green, while those of PY have purple markings. The bulbs of EB contain significantly higher levels of Sipeimine compared to PY. Metabolomic analysis identified 56 differentially expressed metabolites (DMs), with 23 upregulated and 33 downregulated in EB bulbs. Particularly, 3-Hydroxycinnamic acid and Secoxyloganin may serve as distinctive differential metabolites. These DMs were associated with 17 KEGG pathways, including Pyrimidine metabolism, Alanine, Aspartate and Glutamate, and Galactose metabolism. Differences in the length of the chloroplast genome were primarily observed in the LSC region, with the largest variation in the trnH-GUC~psbA region. The placement of the trnH gene and the rps gene in proximity to the LSC/IRb boundary differs between EB and PY.</p>\n<h2>CONCLUSION</h2>\n<p>The results of this study provide valuable insights for the introduction and comprehensive development of wild <i>F. taipaiensis</i> from a scientific perspective.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Yue Xu, \nCun Chen, \nJin Cai, \nLing Lin, \nWei Song, \nKexin Yang, \nYiran Zhao, \nCun Wen, \nJiahong Wei, \nZhibin Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"876bc67daffbc56960c7d9b9d75b2c1a95ca4f37531d019dfad2680ec26884f5","category":"Environment"}