{"title":"Netflix ยกเลิกแพ็คเกจ Basic ในอเมริกาและสหราชอาณาจักร หวังให้มาสมัครแบบมีโฆษณาแทน","link":"https://www.blognone.com/node/134912","date":1689787237000,"content":"<div><div><div><p>เรื่องนี้อาจยังไม่เห็นผลกระทบในประเทศไทย เพราะยังไม่มีแพ็คเกจแบบติดโฆษณา แต่ช่วยให้เห็นภาพว่าบริการสตรีมมิ่งกำลังขยับไปทางไหน</p>\n<p>โดยมีผลตั้งแต่วันนี้ใน Netflix เฉพาะที่อเมริกาและสหราชอาณาจักร สำหรับผู้สมัครใช้งานใหม่หรือกลับมาใช้งานอีกครั้ง ตัวเลือกแพ็คเกจแบบ Basic (พื้นฐาน) ได้ถูกตัดออกไป เหลือเพียง 3 ตัวเลือกคือ Basic with ads, Standard และ Premium โดยลูกค้าที่สมัครแพ็คเกจ Basic อยู่แล้ว จะยังใช้งานแผนเดิมได้ต่อไปจนกว่าจะเปลี่ยนแผนหรือยกเลิกการใช้งาน</p>\n<p>ก่อนหน้านี้ Netflix ทดสอบการ<a href=\"https://www.blognone.com/node/134545\">ยกเลิกแพ็คเกจ Basic ในแคนาดา</a>ไปแล้ว</p>\n<p>ในอเมริกา แพ็คเกจ Basic แบบมีโฆษณาคิดราคาที่ 6.99 ดอลลาร์ต่อเดือน ส่วน Basic อยู่ที่ 9.99 ดอลลาร์ ขณะที่ Standard และ Premium อยู่ที่ 15.49 กับ 19.99 ดอลลาร์ตามลำดับ การตัดตัวเลือก Basic ออกไป จึงมองได้ว่าเป็นการจูงใจให้เลือกจ่ายแบบติดโฆษณา ซึ่งชดเชยด้วยราคาที่ถูกลง หรือไม่อย่างนั้นก็จ่ายมากขึ้นไปเลยเพื่อไม่ให้มีโฆษณาแทรก แนวโน้มการตัดแพ็คเกจเช่นนี้ ก็น่าจะเกิดในทุกประเทศที่มีแพ็คเกจ Basic with ads ได้แก่ ออสเตรเลีย บราซิล ฝรั่งเศส เยอรมนี อิตาลี ญี่ปุ่น เกาหลีใต้ เม็กซิโก และสเปน</p>\n<p>ส่วนประเทศไทยมี 4 แพ็คเกจได้แก่ Mobile ที่ราคาถูกที่สุด สามารถดูได้ผ่านมือถือหรือแท็บเล็ตเท่านั้น เป็นแพ็คเกจที่ Netflix เพิ่มมาในหลายประเทศของเอเชีย ส่วน Basic, Standard, Premium ก็คล้ายกับในประเทศอื่น</p>\n<p>ที่มา: <a href=\"https://variety.com/2023/digital/news/netflix-ends-basic-plan-us-uk-ad-supported-tier-1235673948/\">Variety</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c8493b067a92a1438221aef470c7f9c0.jpg\" /></p>\n<p>รูปแบบแพ็คเกจในอเมริกา ซึ่งตอนนี้ยกเลิกแผน Basic ไปแล้ว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/5b21155740445f88bf9822ca33324c42.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div><div><a href=\"/topics/uk\">UK</a></div><div><a href=\"/topics/usa\">USA</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"876b401e80182f0e6b1d243d596802674621f2d37e81d9ef86102bac36b7d5c0","category":"Thai"}