{"title":"MacRumors Giveaway: Win an iPhone 15 Pro From GRID Studio","link":"https://www.macrumors.com/2024/02/02/macrumors-giveaway-iphone-15-pro-grid-studio/","date":1706904296000,"content":"For this week's giveaway, we've teamed up <a href=\"https://gridstudio.cc/\">with GRID Studio</a> to offer <em>MacRumors</em> readers a chance to win a 256GB <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> from GRID Studio. If you're not familiar with GRID Studio, it is a company <a href=\"https://gridstudio.cc/collections/all\">that makes art</a> out of old, discarded Apple products, saving them from landfills.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Grid-1st-gen.jpg\" width=\"1600\" height=\"900\" />\r<br />\nGRID Studio takes vintage devices and disassembles them, laying out each component in a careful arrangement that is augmented with interesting facts and details about a device. The result is artwork that reflects a part of Apple's history, making GRID's products the perfect gift for an Apple enthusiast.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Grid-1st-gen_02.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe GRID 1, for example, features <a href=\"https://gridstudio.cc/products/iphone-1st-generation\">Apple's first ever iPhone</a>, and it is perhaps the most important device in Apple's history. The $399 GRID 1 has all of the components from the original <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, ranging from the curved aluminum shell to the 2-megapixel rear camera components.\r<br />\n\r<br />\nApple's first ‌iPhone‌ came well before A-series chips, so the GRID 1 includes the main board with the Samsung CPU and PowerVR GPU that Apple used for the device, as well as the 30-pin connector used for charging at the time and the Home Button, which was just a button in the days before <a href=\"https://www.macrumors.com/guide/touch-id/\">Touch ID</a>. Each component is labeled and laid out logically, making for an interesting exploration into Apple's first ‌iPhone‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Grid-1st-gen_01.jpg\" width=\"1600\" height=\"900\" />\r<br />\nGRID even includes a diagram of what the first version of the ‌iPhone‌'s software looked like, with classic apps like Calculator, Text, Phone, Mail, Safari, and YouTube, along with a classic quote from Steve Jobs.\r<br />\n\r<br />\nAs time goes on, the original ‌iPhone‌ is harder to find, so this is one of GRID's rarer pieces. The company says that there are very limited quantities of the GRID 1 left due to the difficulty of sourcing the first-generation ‌iPhone‌. It is worth noting that some of the devices used may have minor scuffs and scratches due to the fact that GRID is using vintage hardware.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/02/Grid-1st-gen_03.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThe GRID 1 measures in at 13x13x1.8 inches, and it has a simple black frame that allows it to fit in anywhere in the home. The GRID 1 and other GRID pieces can be <a href=\"https://gridstudio.cc/products/iphone-1st-generation\">purchased from the GRID Studio website</a>.\r<br />\n\r<br />\nGRID Studio has provided us with a much newer ‌iPhone‌, the ‌iPhone 15 Pro‌, to give away to a <em>MacRumors</em> reader. To enter to win, use the widget below and enter an email address. Email addresses will be used solely for contact purposes to reach the winner(s) and send the prize(s). You can earn additional entries by subscribing to our <a href=\"https://my.leadpages.net/leadbox/145ef7173f72a2%3A104a9fa76b46dc/5754903989321728/\">weekly newsletter</a>, subscribing to our <a href=\"https://www.youtube.com/user/macrumors\">YouTube channel</a>, following us on <a href=\"https://twitter.com/macrumors\">Twitter</a>, following us on <a href=\"https://www.instagram.com/macrumors/\">Instagram</a>, following us on <a href=\"https://www.threads.net/@macrumors\">Threads</a>, or visiting the <em>MacRumors</em> <a href=\"https://www.facebook.com/MacRumors\">Facebook page</a>.\r<br />\n\r<br />\nDue to the complexities of international laws regarding giveaways, only <strong>U.S. residents who are 18 years or older, UK residents who are 18 years or older, and Canadian residents (excluding Quebec) who have reached the age of majority in their province or territory are eligible to enter</strong>. All federal, state, provincial, and/or local taxes, fees, and surcharges are the sole responsibility of the prize winner. To offer feedback or get more information on the giveaway restrictions, please refer to <a href=\"http://forums.macrumors.com/threads/macrumors-giveaways-why-are-they-only-open-to-u-s-residents.1918337/\">our Site Feedback section</a>, as that is where discussion of the rules will be redirected.\r<br />\n\r<br />\n<div><a href=\"https://gleam.io/mxbxs/grid-studio-giveaway\">GRID Studio Giveaway</a>\r<br />\n</div>The contest will run from today (February 2) at 12:00 p.m. Pacific Time through 12:00 p.m. Pacific Time on February 9. The winner will be chosen randomly on or shortly after February 9 and will be contacted by email. The winner will have 48 hours to respond and provide a shipping address before a new winner is chosen.<div>Tag: <a href=\"https://www.macrumors.com/guide/giveaway/\">Giveaway</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/02/macrumors-giveaway-iphone-15-pro-grid-studio/\">MacRumors Giveaway: Win an iPhone 15 Pro From GRID Studio</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/macrumors-giveaway-win-an-iphone-15-pro-from-grid-studio.2418202/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8773276f52a32e713531d5b6fde63ea5349473f1e47f371a798b68c9b8e31bf8","category":"Apple"}