{"title":"A Primer On CSS Container Queries","link":"https://smashingmagazine.com/2021/05/complete-guide-css-container-queries/","date":1620739800000,"content":"<p>At present, container queries can be used in <a href=\"https://www.google.com/chrome/canary/\">Chrome Canary</a> by visiting <code>chrome://flags</code> and searching for and enabling them. A restart will be required.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6d8125e5-ba19-439a-8c2b-cc24b8a8beb4/enable-container-queries.png\" /></p>\n<p><strong>Note</strong>: <em>Please keep in mind that the spec is in progress, and could change at any time. You can <a href=\"https://drafts.csswg.org/css-contain-3/\">review the draft document</a> which will update as the spec is formed.</em></p>\n<h3>What Problem Are CSS Container Queries Solving?</h3>\n<p>Nearly 11 years ago, Ethan Marcotte introduced us to <a href=\"https://alistapart.com/article/responsive-web-design/\">the concept of responsive design</a>. Central to that idea was the availability of CSS media queries which allowed setting various rules depending on the size of the viewport. The iPhone had been introduced three years prior, and we were all trying to figure out how to work within this new world of contending with both mobile screen sizes and desktop screen sizes (which were much smaller on average than today).</p>\n<p>Before and even after <strong>responsive design</strong> was introduced, many companies dealt with the problem of changing layout based on screen size by delivering completely different sites, often under the subdomain of <code>m</code>. Responsive design and media queries opened up many more layout solutions, and many years of creating best practices around responding to viewport sizes. Additionally, frameworks like <a href=\"https://getbootstrap.com/\">Bootstrap</a> rose in popularity largely due to providing developers <strong>responsive grid systems</strong>.</p>\n<p>In more recent years, design systems and component libraries have gained popularity. There is also a desire to build once, deploy anywhere. Meaning a component developed in isolation is intended to work in any number of contexts to make building complex interfaces more efficient and consistent.</p>\n<p>At some point, those components come together to make a web page or application interface. Currently, with only media queries, there is often an extra layer involved to <strong>orchestrate mutations of components</strong> across viewport changes. As mentioned previously, a common solution is to use responsive breakpoint utility classes to impose a grid system, such as frameworks like Bootstrap provide. But those utility classes are a patch solution for the limitations of media queries, and often result in difficulties for nested grid layouts. In those situations, you may have to add many breakpoint utility classes and still not arrive at the most ideal presentation.</p>\n<p>Or, developers may be using certain CSS grid and flex behaviors to approximate container responsiveness. But <a href=\"https://moderncss.dev/container-query-solutions-with-css-grid-and-flexbox/\">flex and CSS grid solutions</a> are restricted to only loosely defining layout adjustments from horizontal to vertical arrangements, and don’t address the need to modify other properties.</p>\n<p><strong>Container queries</strong> move us beyond considering only the viewport, and allow <em>any</em> component or element to respond to a defined container’s width. So while you may still use a responsive grid for overall page layout, a component within that grid can define its own changes in behavior by querying its container. Then, it can adjust its styles depending on whether it’s displayed in a narrow or wide container.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/68fedb19-7f2a-4f59-9cab-e5dce257382d/flex-articles.png\" /></p>\n<p>We also kept <code>main</code> as a container. This means we <em>can</em> add styles for the <code>.article</code> class, but they will be in response to the width of <code>main</code>, not themselves. I am anticipating this ability to have <strong>rules within container queries</strong> responding to multiple layers of containers cause the most confusion for initial implementation and later evaluation and sharing of stylesheets.</p>\n<p>In the near future, updates to browser's DevTools will certainly help in making DOM changes that alter these types of relationships between elements and the containers they may query. Perhaps an emerging best practice will be to <strong>only query one level up</strong> within a given <code>@container</code> block, and to enforce children carrying their container with them to reduce the potential of negative impact here. The trade-off is the possibility of more DOM elements as we saw with our article example, and consequently dirtying semantics.</p>\n<p>In this example, we saw what happened with <em>both</em> nested containers and also the effects of introducing flex or grid layout into a container. What is currently unsettled in the spec is what happens when a container query is <strong>defined but there are no actual container ancestors</strong> for those queried elements. It may be decided to consider containment to be false and drop the rules, or they may fallback to the viewport. You can track <a href=\"https://github.com/w3c/csswg-drafts/issues/6178\">the open issue for fallback containment</a> and even add your opinion to this discussion!</p>\n<h3>Container Element Selector Rules</h3>\n<p>Earlier I mentioned that a container cannot itself be styled within a container query (unless it’s a nested container and responding to its ancestor container’s query). However, a container <em>can</em> be used as part of the CSS selector for its children.</p>\n<p>Why is this important? It allows retaining access to CSS pseudo-classes and selectors that <em>may</em> need to originate on the container, such as <code>:nth-child</code>.</p>\n<p>Given our article example, if we wanted to add a border to every <code>odd</code> article, we can write the following:</p>\n<pre><code>@container (min-width: 60ch) {\n  .container:nth-child(odd) &gt; article {\n    border: 1px solid grey;\n  }\n} \n</code></pre>\n\n<p>If you need to do this, you may want to use less generic container class names to be able to identify in a more readable way which containers are being queried for the rule.</p>\n<h3>Case Study: Upgrading Smashing Magazine’s Article Teasers</h3>\n<p>If you visit an author’s profile here on Smashing (<a href=\"https://www.smashingmagazine.com/author/stephanie-eckles/\">such as mine</a>) and resize your browser, you’ll notice the arrangement of the article teaser elements change depending on the viewport width.</p>\n<p>On the smallest viewports, the avatar and author’s name are stacked above the headline, and the reading time and comment stats are slotted between the headline and article teaser content. On slightly larger viewports, the avatar <strong>floats left</strong> of all the content, causing the headline to also sit closer to the author’s name. Finally, on the largest viewports, the article is allowed to span nearly the full page width and the reading time and comment stats change their position to float to the right of the article content and below the headline. </p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a2c88b2c-ef73-44e3-885c-2c5c322fb781/smashing-articles-original.png\" /></p>\n<p>By combining container queries with an upgrade to using CSS grid template areas, we can update this component to <strong>be responsive to containers</strong> instead of the viewport. We’ll start with the narrow view, which also means that browsers that do not support container queries will use that layout.</p>\n<p>Now for this demo, I’ve brought the minimum necessary existing styles from Smashing, and only made one modification to the existing DOM which was to move the headline into the <code>header</code> component (and make it an h2).</p>\n<p>Here’s a reduced <strong>snippet of the article DOM structure</strong> to show the elements we’re concerned about re-arranging (original class names retained):</p>\n<pre><code>&lt;article class=\"article--post\"&gt;\n  &lt;header&gt;\n    &lt;div class=\"article--post__image\"&gt;&lt;/div&gt;\n    &lt;span class=\"article--post__author-name\"&gt;&lt;/span&gt;\n    &lt;h2 class=\"article--post__title\"&gt;&lt;/h2&gt;\n  &lt;/header&gt;\n  &lt;footer class=\"article--post__stats\"&gt;&lt;/footer&gt;\n  &lt;div class=\"article--post__content\"&gt;&lt;/div&gt;\n&lt;/article&gt;\n</code></pre>\n\n<p>We’ll assume these are direct children of <code>main</code> and define <code>main</code> as our container:</p>\n<pre><code>main {\n  contain: layout inline-size style;\n}\n</code></pre>\n\n<p>In the smallest container, we have the <strong>three sections stacked</strong>: header, stats, and content. Essentially, they are appearing in the default block layout in DOM order. But we’ll go ahead and assign a grid template and each of the relevant elements because the template is key to our adjustments within the container queries.</p>\n<pre><code>.article--post {\n  display: grid;\n  grid-template-areas: \n    \"header\" \n    \"stats\" \n    \"content\";\n  gap: 0.5rem;\n}\n\n.article--post header {\n  grid-area: header;\n}\n\n.article--post__stats {\n  grid-area: stats;\n}\n\n.article--post__content {\n  grid-area: content;\n}\n</code></pre>\n\n<p>Grid is ideal for this job because being able to define named template areas makes it much easier to apply changes to the arrangement. Plus, its actual layout algorithm is more ideal than flexbox for how we want to manage to resize the areas, which may become more clear as we add in the container query updates.</p>\n<p>Before we continue, we also need to create a <strong>grid template</strong> for the <code>header</code> to be able to move around the avatar, author’s name, and headline.</p>\n<p>We’ll add onto the rule for <code>.article`</code>--<code></code>post header`:</p>\n<pre><code>.article--post header {\n  display: grid;\n  grid-template-areas:\n    \"avatar name\"\n    \"headline headline\";\n  grid-auto-columns: auto 1fr;\n  align-items: center;\n  column-gap: 1rem;\n  row-gap: 0.5rem;\n}\n</code></pre>\n\n<p>If you’re less familiar with <code>grid-template-areas</code>, what we’re doing here is ensuring that the top row has one column for the avatar and one for the name. Then, on the second row, we’re planning to have the headline span both of those columns, which we define by using the same name twice.</p>\n<p>Importantly, we also define the <code>grid-auto-columns</code> to <strong>override the default behavior</strong> where each column takes up <code>1fr</code> or an equal part of the shared space. This is because we want the first column to only be as wide as the avatar, and allow the name to occupy the remaining space.</p>\n<p>Now we need to be sure to explicitly place the related elements into those areas:</p>\n<pre><code>.article--post__image {\n  grid-area: avatar;\n}\n\n.article--post__author-name {\n  grid-area: name;\n}\n\n.article--post__title {\n  grid-area: headline;\n  font-size: 1.5rem;\n}\n</code></pre>\n\n<p>We’re also defining a <code>font-size</code> for the title, which we’ll increase as the container width increases.</p>\n<p>Finally, we will use flex to arrange the stats list horizontally, which will be the arrangement until the largest container size:</p>\n<pre><code>.article--post__stats ul {\n  display: flex;\n  gap: 1rem;\n  margin: 0;\n}\n</code></pre>\n\n<p><strong>Note</strong>: <em>Safari recently completed support of  <code>gap</code> for flexbox, meaning it’s supported for all modern browsers now!</em> 🎉</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ab8d74c-1e7a-4401-a2eb-ee99cf49380a/smallest-article-container.png\" /></p>\n<p>We can now move to our first of two container queries to create the midsize view. Let’s take advantage of being able to create font-relative queries, and base it on the container exceeding <code>60ch</code>. In my opinion, making content things relative to line length is a practical way to manage changes across container widths. However, you could certainly use pixels, rems, ems, and possibly more options in the future.</p>\n<p>For this middle size, we need to adjust both the header and overall article grid templates:</p>\n<pre><code>@container (min-width: 60ch) {\n  .article--post header {\n    grid-template-areas:\n      \"avatar name\"\n      \"avatar headline\";\n    align-items: start;\n  }\n\n  .article--post {\n    grid-template-areas: \"header header\" \". stats\" \". content\";\n    grid-auto-columns: 5rem 1fr;\n    column-gap: 1rem;\n  }\n\n  .article--post__title {\n    font-size: 1.75rem;\n  }\n}\n</code></pre>\n\n<p>At this width, we want the avatar to appear <strong>pulled into its own column</strong> to the left of the rest of the content. To achieve this, within the <code>header</code> the grid template assigns it to the first column of both rows, and then shifts the name to row one, column two, and the headline to row two, column two. The avatar also needs to be aligned to the top now, so adjust that with <code>align-items: start</code>.</p>\n<p>Next, we updated the article grid template so that the header takes up <em>both columns</em> in the top row. Following that, we use the <code>.</code> character to assign an unnamed grid area for the first column of the second and third row, preparing for the visual of the avatar appearing in its own column. Then, we adjust the auto columns to make make the first column equivalent to the avatar width to complete the effect.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0af6f86a-9919-4956-bf1a-db66a506160d/midsize-article-container.png\" /></p>\n<p>For the largest container size, we need to move the stats list to appear on the right of the article content, but below the headline. We’ll again use <code>ch</code> units for our “breakpoint”, this time picking <code>100ch</code>.</p>\n<pre><code>@container (min-width: 100ch) {\n  .article--post {\n    grid-template-areas: \"header header header\" \". content stats\";\n    grid-auto-columns: 5rem fit-content(70ch) auto;\n  }\n\n  .article--post__stats ul {\n    flex-direction: column;\n  }\n\n  .article--post__title {\n    max-width: 80ch;\n    font-size: 2rem;\n  }\n\n  .article--post__content {\n    padding-right: 2em;\n  }\n}\n</code></pre>\n\n<p>To meet all of our requirements, we now need to take care of three columns, which makes the first row a triple repeat of <code>header</code>. Then, the second row starts with an unnamed column shared with content and then stats.</p>\n<p>Looking at the real version of this page, we see that the article doesn’t span 100% of the width of Smashing’s layout. To retain this cap, within the <code>grid-auto-columns</code> we’re using the <code>fit-content</code> function, which can be read as: “grow up until intrinsic max-width of the content, but no greater than the provided value”. So, we’re saying the column can <strong>grow but not exceed <code>70ch</code></strong>. This does not prevent it from shrinking, so the column remains responsive to its available space as well.</p>\n<p>Following the <code>content</code> column, we define <code>auto</code> for the stats column width. This means it will be allowed to take the inline space it needs to fit its content.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/5ae7b6c5-2cbd-403e-8339-38b211039302/largest-article-container.png\" /></p>\n<p>Now, you may be thinking that we’ve kind of just done media queries but in a slightly different way. Which — if we pause a moment — is kind of great! It should help container queries feel familiar and make them easier to adjust to and include in your workflow. For our demo, it also currently feels that way because our single article is currently responding to one parent element which itself is only responding to the changing viewport.</p>\n<p>What we’re really done is set the foundation for this article to be dropped in on an article page, or on the home page where the articles are arranged in columns (for the sake of this demo, we’ll ignore the other changes that happen on the home page). As we learned in the intro example, if we want elements to respond to the width of CSS grid tracks or flex items, we need to have them carry their container with them. So let’s add an explicit container element around each article instead of relying on <code>main</code>.</p>\n<pre><code>&lt;div class=\"article--post-container\"&gt;\n    &lt;article class=\"article--post\"&gt;&lt;/article&gt;\n&lt;/div&gt;\n</code></pre>\n\n<p>Then, we’ll assign <code>.article`</code>--<code></code>post-container` as a container:</p>\n<pre><code>.article--post-container {\n  contain: layout inline-size;\n}\n</code></pre>\n\n<p>Now, if we create a flex-based grid layout as we did in the intro example, we’ll place one article by itself above that grid, and two within the flex grid. This results in the following adjustments as the containers change size:</p>\n<p>The video helps demonstrate the changes that are now able to happen completely independently of viewport-based media queries! This is what makes container queries exciting, and why they’ve been sought after by CSS developers for so long.</p>\n<p>Here is the full CodePen of this demo including the flex grid:</p>\n<p>See the Pen <a href=\"https://codepen.io/smashingmag/pen/KKWdRMq\">Container Queries Case Study: Smashing Magazine Article Excerpts</a> by <a href=\"https://codepen.io/5t3ph\">Stephanie Eckles</a>.</p>\n<h3>Opportunities and Cautions for Using Container Queries</h3>\n<p>You can start preparing to use container queries today by including them as a progressive enhancement. By defining styles that work well without container queries, you can <strong>layer up enhancements</strong> that do use them. Then, unsupporting browsers will still receive a workable — if less than ideal — version.</p>\n<p>As we look towards the future of being able to use container queries anywhere, here are some possible opportunities where they will be beneficial, as well as some cautions. All of them share one trait: they are scenarios when it’s likely to be considered desirable that layout and style changes will be independent from the viewport.</p>\n<h4>Responsive Typography</h4>\n<p>You may be familiar with the concept of responsive or fluid typography. Solutions for making typography update across viewport and element widths have seen many advancements, from JavaScript assisting, to CSS solutions using <code>clamp()</code> and viewport units.</p>\n<p>If the spec receives a container unit (which we’ll talk about shortly), we may be able to achieve <em>intrinsic</em> typography. But even with the current spec, we can define <em>responsive</em> typography by changing the <code>font-size</code> value across various sizes of contained elements. In fact, we just did this in the example of the Smashing Magazine articles.</p>\n<p>While this is exciting from a design and layout point of view, it comes with the same caution as existing fluid typography solutions. For accessibility, a user should be able to zoom the layout and increase <code>font-size</code> to 200% of its original size. If you create a solution that drastically shrinks font size in smaller containers — which may be the computed size upon zoom — a user may never be able to achieve increasing the base <code>font-size</code>  by 200%. I’m sure we will see more guidelines and solutions around this as we all get more familiar with container queries!</p>\n<h4>Changing Display Values</h4>\n<p>With container queries, we’ll be able to completely change display properties, such as from grid to flex. Or change their related properties, like update grid templates. This makes way for <strong>smoothly repositioning child elements</strong> based on the current space allowed to the container.</p>\n<p>This is the category you’ll find many of the current demos fall into, as it seems to be one of the things that makes the possibility of container queries so exciting. Whereas responsive grid systems are based on media queries tied to viewport width, you may find yourself adding layers of utility classes to get the result you’re really after. But with container queries, you can <em>exactly</em> specify not only a grid system, but completely change it as the element or component grows and shrinks.</p>\n<p>Possible scenarios include:</p>\n<ul>\n<li>changing a newsletter subscription form from horizontal to stacked layout;</li>\n<li>creating alternating grid template sections;</li>\n<li>changing image aspect ratios and their position versus related content;</li>\n<li>dynamic contact cards that reposition avatars and contact details and can be dropped in a sidebar just as easily as a page-width section</li>\n</ul>\n<p>Here it should be noted that just as in our pre-container query world, for accessibility it's advised to ensure a logical order especially for the sake of tabbing interactive elements like links, buttons, and form elements.</p>\n<h4>Showing, Hiding And Rearranging</h4>\n<p>For more complex components, container queries can step in and <strong>manage variations</strong>. Consider a navigation menu that includes a series of links, and when the container is reduced, some of those links should hide and a dropdown should appear. </p>\n<p>Container queries can be used to watch <em>sections</em> of the navigation bar and change those individual parts independently. Contrast this to trying to handle this with media queries, where you might opt to design and develop against breakpoints with the result of a compromised, less ideal final solution.</p>\n<h4>Develop Once, Deploy Anywhere</h4>\n<p>Okay, this might be a bit aspirational. But for design systems, component libraries, and framework developers, container queries will greatly improve the ability to deliver self-defensive solutions. Components' ability to manage themselves within <em>any</em> given space will <strong>reduce complications</strong> introduced when it comes time to actually add them into a layout.</p>\n<p>At first thought, this seems like the dream, especially if you’ve been involved with design system development as I have. However, the pros and cons may be equal for some components, and you may not always <em>want</em> the dynamic layout or repositioning behavior. I anticipate this will be another area best practices will form to perhaps have components opt-in to using container query behavior per instance, such as through a modifier class. </p>\n<p>For example, consider a card component that assumes that <code>font-size</code> should change. But, in a particular instance, the actual character counts were much longer or much shorter and those rules were suboptimal. An opt-in would likely be easier than trying to override every single container query that was attached.</p>\n<h3>What Might Change in the Spec</h3>\n<p>Currently, even the syntax is subject to change before the spec is fully finalized. In fact, it’s been released as an experiment so that as a community we can provide feedback. Miriam Suzanne has created <a href=\"https://github.com/w3c/csswg-drafts/projects/18\">a GitHub project to track issues</a>, and you may react to those and add comments.</p>\n<p>I already mentioned two key issues yet to be resolved:</p>\n<ul>\n<li><a href=\"https://github.com/w3c/csswg-drafts/issues/6178\">#6178</a>: How does @container resolve when no ancestor containers have been defined?</li>\n<li><a href=\"https://github.com/w3c/csswg-drafts/issues/5989\">#5989</a>: What container features can be queried?</li>\n</ul>\n<p>Of high importance and impact is:</p>\n<ul>\n<li><strong>Should there be a new syntax for establishing queryable containers?</strong> (<a href=\"https://github.com/w3c/csswg-drafts/issues/6174\">#6174</a>)\nThe initial issue from Miriam proposes two options of either a new set of dedicated <code>contain</code> values or an entirely new property perhaps called <code>containment</code>. If any of these changes come through in the prototype phase, the values demonstrated at the start of this article may no longer work. So once again, note that it’s great to experiment, but be aware that things will continue changing!</li>\n</ul>\n<p>Also of interest is the possibility of new container units, tracked in:</p>\n<ul>\n<li>[<strong>\"container width\" and \"container height\" units</strong> (<a href=\"https://github.com/w3c/csswg-drafts/issues/5888\">#5888</a>)<br />This could open up a native CSS solution for intrinsic typography among other things, something like: <code>font-size: clamp(1.5rem, 1rem + 4cw, 3rem)</code> (where <code>cw</code> is a placeholder for a currently undefined unit that might represent container width).</li>\n</ul>\n<h3>Additional Demos And Resources</h3>\n<ul>\n<li>Review <a href=\"https://codepen.io/collection/XQrgJo\">Miriam’s CodePen collection</a> where she is gathering container queries created on that platform</li>\n<li>Ahmad Shadeed created an <a href=\"https://ishadeed.com/article/say-hello-to-css-container-queries/\">overview with practical examples</a></li>\n<li>Andy Bell considered how to incorporate container queries as a <a href=\"https://piccalil.li/blog/container-queries-are-actually-coming/\">progressive enhancement for card components</a></li>\n<li>Stu Robson has created a GitHub repository to collect resources called <a href=\"https://github.com/sturobson/Awesome-Container-Queries\">Awesome-Container-Queries</a></li>\n<li>David A. Herron wrote <a href=\"https://www.oddbird.net/2021/04/05/containerqueries/\">a quick start guide</a> with a demonstration of elements that change at different rates based on container queries</li>\n<li>A page has also been started about <a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/CSS_Container_Queries\">container queries on MDN</a>.</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"877643c02f026ce497fbf1221b8acc83fc4ad766cf30ce14ceee8442d4d5b438","category":"Tech"}