{"title":"Orthosilicic acid inhibits human osteoclast differentiation and bone resorption","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312169","date":1729000800000,"content":"<p>by Catarina Magnusson, Maria Ransjö</p>\r\nContext <p>Silicon (Si), which is present in the diet in the bioavailable form of orthosilicic acid (OSA) and is detected as a dissolution product of certain bone-substitute materials, is suggested to promote bone health, and enhance bone healing, respectively. Silicon has been shown to stimulate osteoblastic cell differentiation and function, although the effect of Si on human osteoclasts is unclear.</p> Aim <p>The present study investigated the direct effects of Si on human osteoclast differentiation, gene expression, and bone resorption.</p> Material &amp; methods <p>Human CD14+ monocytes were isolated from buffy coats and cultured with M-CSF and RANKL in medium without or with Si (50 μg/ml; constituting 75% OSA). The effects of Si on osteoclast differentiation were evaluated by TRAP-staining and the expression levels of <i>CtsK</i>, <i>CalcR</i>, <i>TRAP</i>, and <i>DC-STAMP</i> measured by RT-qPCR. The effect of Si on the expression level of <i>AQP9</i>, which encodes a potential Si transporter, was also analyzed. Bone resorption was determined based on the number of resorption pits formed when the RANKL-stimulated monocytes were cultured on bone slices, and by the levels of type I collagen fragments released into the cell culture medium.</p> Results <p>Silicon significantly inhibited the number of TRAP+ multinucleated cells and the expression of osteoclast related genes but increased the late expression of <i>AQP9</i>. Furthermore, Si significantly inhibited the number of resorption pits and the amount of collagen fragments in the medium when cells were cultured on bone slices.</p> Conclusion <p>Our results demonstrate that OSA inhibits RANKL-stimulated human osteoclast differentiation, gene expression of osteoclast phenotypic markers, and bone resorption.</p>","author":"Catarina Magnusson","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"877c3a568f3374bcd36cfb480a62538bd01fc138c07eed98b1cbba089934ccd0","category":"Interdisciplinary"}