{"title":"If a fish comes out of the river and speaks, we should believe it: South African perspective on fish kills","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4359?af=R","date":1724743738000,"content":"<h2>Abstract</h2>\n<p>In South Africa, fish kill events are increasing in frequency because of multiple stressors associated with managing natural resources. Despite the ecosystem services associated with fish, South Africa's progressive legislation towards environmental protection seems to negate the management of fish kills. In this study, we provide an overview of reports and regulations associated with acute pollution spills resulting in fish kill events in South Africa. In addition, we highlight the implication of these using a fish kill event from 2019 on the Msunduzi River, South Africa, as a case study. The fish kill on the Msunduzi River showed a decline in relative abundance by up to 41%, and its ecological condition was already impaired by poor management. The poor condition of the Msunduzi River has jeopardised the recovery of the fish populations, and intervention is needed to restore the fish population that includes species red-listed as vulnerable by the International Union for the Conservation of Nature. We found that despite the severity of fish kills and the detriment to the fish fauna, including near-threatened species, there is a general apathy, incapacity and lack of knowledge on managing fish kills in South Africa. In addition, although several legislated Acts have good intentions for protecting nature, they do not align and show that a fish kill is an afterthought rather than a need to prevent. Poor management practices have exacerbated this in an already stressed state from excessive use of environmental water. As a way forward, the alignment of the various Acts associated with various ministerial departments in South Africa is needed so that better protection of the environment may occur. Finally, we argue that the African proverb ‘<i>If the fish comes out of the river to tell you that the crocodile has one eye, you should believe it</i>’ is not considered when managing water resources and that with the present ecological state and water resource use there may be no fish to ‘come out of the water’ warning us that our water is unsafe even for human consumption and use.</p>","author":"Matthew J. Burnett, \nGordon C. O'Brien, \nAndrew Blackmore, \nMelissa Wade, \nColleen T. Downs","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"8789d7d715100447d7832e18a47ea5cf7cfda611db88999160b1876fd2da2b9f","category":"Environment"}