{"title":"The complex effects of modern oncogenic environments on the fitness, evolution and conservation of wildlife species","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13763?af=R","date":1722595176000,"content":"<h2>Abstract</h2>\n<p>Growing evidence indicates that human activities are causing cancer rates to rise in both human and wildlife populations. This is due to the inability of ancestral anti-cancer defences to cope with modern environmental risks. The evolutionary mismatch between modern oncogenic risks and evolved cancer defences has far-reaching effects on various biological aspects at different timeframes, demanding a comprehensive study of the biology and evolutionary ecology of the affected species. Firstly, the increased activation of anti-cancer defences leads to excessive energy expenditure, affecting other biological functions and potentially causing health issues like autoimmune diseases. Secondly, tumorigenesis itself can impact important fitness-related parameters such as competitiveness, predator evasion, resistance to parasites, and dispersal capacity. Thirdly, rising cancer risks can influence the species' life-history traits, often favoring early reproduction to offset fitness costs associated with cancer. However, this strategy has its limits, and it may not ensure the sustainability of the species if cancer risks continue to rise. Lastly, some species may evolve additional anti-cancer defences, with uncertain consequences for their biology and future evolutionary path. In summary, we argue that the effects of increased exposure to cancer-causing substances on wildlife are complex, ranging from immediate responses to long-term evolutionary changes. Understanding these processes, especially in the context of conservation biology, is urgently needed.</p>","author":"Antoine M. Dujon, \nBeata Ujvari, \nSophie Tissot, \nJordan Meliani, \nOcéane Rieu, \nNikita Stepanskyy, \nRodrigo Hamede, \nJácint Tokolyi, \nAurora Nedelcu, \nFrédéric Thomas","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"878907ff5bf23735fbb5d59534eedfc9c93a340c1926b3bd76a932d2f6be81eb","category":"Environment"}