{"title":"[WSJ] ใน Facebook ก็มี VIP แยกกลุ่มคนดัง นักการเมืองไว้ต่างหาก ไม่ต้องเข้าระบบคัดกรองเนื้อหา","link":"https://www.blognone.com/node/124765","date":1631696197000,"content":"<div><div><div><p>Facebook มีผู้ใช้งานทั่วโลกกว่า 2 พันล้าน และหนึ่งในงานยากของ Facebook คือการคัดกรองเนื้อหาที่ผิดนโยบายแพลตฟอร์มออกไป The Wall Street Journal เผยรายงานว่าใน Facebook มีโครงการ VIP ชื่อว่า XCheck แยกกลุ่มคนดัง นักการเมืองไว้ ไม่ต้องเข้าระบบคัดกรองเนื้อหา</p>\n<p>XCheck เป็นโครงการที่สร้างขึ้นภายในเพื่อหลีกเลี่ยงการถูกวิจารณ์ในวงกว้าง หากไปแบนเนื้อหาของคนดัง ตัวโปรแกรมใน XCheck จะตรวจจับว่า หากหนึ่งในบัญชี VIP คนไหนโพสต์เนื้อหาที่ผิดกฎแพลตฟอร์ม เรื่องจะถูกส่งต่อไปยังอีกทีมหนึ่ง เพื่อให้พนักงาน Facebook ตรวจสอบต่อได้</p>\n<p>ตัว XCheck ไม่ใช่เรื่องใหม่ สื่ออื่นเคยเปิดเผยเรื่องนี้มาก่อนแล้ว แต่สิ่งที่ Wall Street Journal  ค้นพบคือ เนื้อหาส่วนใหญ่ที่ถูกตั้งค่าสถานะโดยระบบ XCheck จะไม่ได้รับการตรวจสอบในภายหลัง เท่ากับว่า คนดัง นักการเมือง และผู้มีชื่อเสียง สามารถฝ่าฝืนกฎแพลตฟอร์มได้โดยไม่มีผลที่ตามมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e99fb45a4873d9da4828305b4c25d34a.jpg\" /><br />\nภาพเก่า มาร์ค ซักเคอเบิร์ก เข้าพบ โดนัลด์ ทรัมป์ที่ทำเนียบขาว ปี 2019</p>\n<p>ตัวอย่างหนึ่งที่ Wall Street Journal ยกมาคือ Neymar นักฟุตบอลชาวบราซิลผู้โด่งดัง ได้โพสต์ภาพเปลือยของผู้หญิงคนหนึ่งที่กล่าวหาเขาว่าไปล่วงละเมิดทางเพศ โพสต์ดังกล่าวเป็นการละเมิดกฎของ Facebook อย่างแน่นอนเนื่องจากเป็นภาพเปลือย แต่โพสต์ไม่ได้ถูกลบออกในทันที และยังมีคนเข้าไปดูแล้วกว่า 60 ล้านครั้ง ก่อนที่จะถูกลบในที่สุด นอกจากนี้ ระบบการตรวจสอบดังกล่าวได้เปิดเนื้อหาที่ละเมิดกฎให้คนอื่นเข้ามารับชมได้มากกว่า 16,000 พันล้านครั้งก่อนถูกลบ</p>\n<p>Oversight Board หน่วยงานคานอำนาจของ Facebook ออกมาแถลงว่าทาง Oversight Board ได้ย้ำเตือน Facebook หลายครั้งเรื่องขาดความโปร่งใสในมาตรการคัดกรองเนื้อหา โดยเฉพาะเนื้อหาจากบัญชีผู้มีชื่อเสียง</p>\n<p>ด้าน Facebook ระบุว่า โครงการ XCheck เป็นข้อมูลที่ล้าสมัยแล้ว และบริษัทก็พยายามปรับปรุงระบบการคัดกรองเนื้อหาเรื่อยมา และตระหนักดีว่าการบังคับใช้นโยบายของ Facebook นั้นไม่สมบูรณ์แบบ และยังมีสิ่งที่ต้องแลกหรือต้องเลือกระหว่างความเร็วและความแม่นยำ</p>\n<p>ที่มา - <a href=\"https://www.engadget.com/facebook-vip-cross-check-xcheck-181720267.html?src=rss\">Engadget</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/facebook\">Facebook</a></div><div><a href=\"/topics/mark-zuckerberg\">Mark Zuckerberg</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"878fed1a3c3b30e99890a6f77bbeaa37cee7b8c948f5209451e90f81ee9ef0b5","category":"Thai"}