{"title":"PSIV-10 Thyroid hormone does not protect skeletal muscle mitochondrial function from heat stress in pigs","link":"https://academic.oup.com/jas/article/102/Supplement_3/547/7757615?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Environmental heat stress (HS) can impair muscle mitochondrial function which may contribute to negative health outcomes, but little is known about potential treatments to rescue mitochondrial function during HS. To test the hypothesis that thyroid hormone (T3) would protect mitochondrial function during HS, samples were collected from the right ventricle (RV) of 3-mo-old, crossbred gilts under 4 different environmental conditions: thermoneutral (TN; 22°C; n = 8); 1 d HS (HS1; 38°C; n = 7); oral supplementation of 1.33 µgּ kg body weight (BW)<sup>-1</sup>ּ d<sup>-1</sup> Cytomel (liothyronine sodium) during the 1 d HS (HS1TH; n = 8); and 7 d HS (HS7; n = 8). The oxidative portion of the semitendinosus (ST) was also collected from all groups plus a 5<sup>th</sup> group: oral supplementation of Cytomel during 7 d HS (HS7TH, n = 8). Mitochondrial volume density was estimated by citrate synthase (CS) activity, and oxidative phosphorylation (OP) and electron transfer (E) capacities were determined via high resolution respirometry. Data were analyzed using mixed linear models in SAS v9.4 with treatment group as a fixed effect and pig (treatment) as a random effect. Within the RV, the contribution of OP supported by complex I (P<sub>CI</sub>) to maximal E was less in HS1TH gilts compared with all other groups (<span>P</span> ≤ 0.02), and the contribution of E supported by complex II (E<sub>CII</sub>) to maximal E was greater in TN than HS1 or HS7 (<span>P</span> ≤ 0.02) and tended to be greater in TN compared with HS1TH gilts (<span>P</span> = 0.07). Within the ST, integrative (relative to tissue wet weight) P<sub>CI</sub> was greatest in TN gilts (vs. HS7 and HS7TH, <span>P</span> ≤ 0.0002; vs. HS1 and HS1TH, <span>P</span> ≤ 0.06) and least in HS7 and HS7TH (vs. HS1 and HS1TH, <span>P</span> ≤ 0.05). Integrative maximal <span>P</span> (P<sub>CI+II</sub>) was greatest in TN pigs (compared with HS1TH, HS7, and HS7TH, <span>P</span> ≤ 0.05; compared with HS1, <span>P</span> = 0.09). Integrative maximal E (E<sub>CI+II</sub>) was also greatest in TN gilts than all other groups (<span>P</span> ≤ 0.05) while E<sub>CII</sub> was greater in TN pigs compared with HS7 and HS7TH (<span>P</span> ≤ 0.009) and tended to be greater than HS1 and HS1TH (<span>P</span> ≤ 0.09). In ST, intrinsic (relative to CS activity) P<sub>CI</sub> and P<sub>CI+II</sub> were greater in TN compared with HS1, HS1TH, and HS7 pigs (<span>P</span> ≤ 0.03) and P<sub>CI+II</sub> tended to be greater in TN than HS7TH (<span>P</span> ≤ 0.06). Intrinsic E<sub>CI+II</sub> and E<sub>CII</sub> were greater in TN compared with all other treatment groups (<span>P</span> ≤ 0.04). These results suggest that T3 supplementation did not protect mitochondrial function from negative impacts of HS in skeletal muscle but may have modified electron transfer through complex I in cardiac muscle which may have implications on oxidative stress.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"879ba0a81555061cb004aaed433aa1d0d58856bd8389ff6efd22fc2bdcc6923b","category":"Environment"}