{"title":"Resource Availability and Use in Restored, Unmanaged, and Aquaculture Mangrove Ecosystems in Indonesia","link":"https://www.preprints.org/manuscript/202406.0288/v1","date":1717592296000,"content":"Mangrove ecosystems are one of the most productive on our planet but have declined globally by 30-50%. Many species rely on mangrove habitat and thus their conversion to aquaculture farms has led to a noticeable loss in commodities such as wild fish stocks. This study aimed to assess 1) the influence of the presence of aquaculture and 2) restoration projects on the ecosystems ability to provide resources. We collected data on mangrove vegetation (i.e., biomass, richness and abundance), soil nutrients (i.e. organic carbon, aluminium and nitrogen), crab abundance and fishing pressure in six sites. We set up 15 plots in each site and collected data between May and July 2023. Via generalised linear mixed models we found that the abundance and richness of crabs was significantly higher in aquaculture plots than in no aquaculture plots. Aquaculture plots had higher topsoil aluminium, topsoil and subsoil Nitrogen, and had lower topsoil Carbon than non-aquaculture sites. Restored sites had less Nitrogen in the topsoil than unmanaged sites. Biomass did not change between aquaculture, restored and unmanaged plots. We found a negative correlation between crab abundance and richness and mangrove DBH, suggesting that the species of crabs present preferred areas with propagules for feeding (e.g., Grapsidae crabs). The content of nitrogen in the subsoil was positively correlated with mangrove richness, diversity and height, suggesting the importance of nitrogen availability for mangrove growth. The content of aluminium in the subsoil was negatively correlated with the content of organic carbon both in topsoil and subsoil, suggesting the detrimental effect of aluminium on the carbon cycle. Fishing practices were observed in all sites during the data collection period. Even if most of the vegetation parameters were not significantly affected by presence of aquaculture or management for restoration, it is clear that important variables such as aluminium carbon, and nitrogen content in the soil and crab assemblages were highly variable.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"879d7fced0d89601fedc8ef16a83affb8e7b6e236917cb9a1e8ad1e11eaed23d","category":"Interdisciplinary"}