{"title":"Beyond predator richness: How diversified cropping can enhance pest regulation","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14719?af=R","date":1723007870000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7c099201-557a-4750-803a-f323234b83e1/jpe14719-toc-0001-m.png\" alt=\"Beyond predator richness: How diversified cropping can enhance pest regulation\" />\n<p>The article by Heinen et al. is an important contribution to our understanding of how agricultural diversification can enhance pest regulation by examining predator–prey interactions. Crop rotations and organic fertilisation enhance the richness of predatory beetles and provide resource continuity with alterative prey, such as soil fauna and other predators, to maintain their ecological service of pest regulation.</p>\n<br />\n<h2>Abstract</h2>\n<p><b>Research Highlight discussing</b>: Heinen, J.; Dominguez, V.; Aguilera, G.; Malsher, G.; Vesterinen, E.; Roslin, T.; Bommarco, R.; Bartomeus, I. (2024). Diversified cropping strengthens herbivore regulation by providing seasonal resource continuity to predators. <i>Journal of Applied Ecology</i>, <a target=\"_blank\" href=\"https://doi.org/10.1111/1365-2664.14674\">https://doi.org/10.1111/1365-2664.14674</a>. Crop monocultures consist of homogenous agroecosystems highly dependent on pesticides for pest regulation and mineral fertilisation for maintaining plant nutrition, representing the least resilient system. Agricultural diversification practices can increase heterogeneity in agroecosystems, resulting in greater richness of arthropod predators and enhanced ecological services. Among natural enemies of pests, generalist predators are important for pest regulation as they prey on diverse arthropod pests and be present throughout the season. However, since they consume other predators (intraguild predation) and soil fauna, it is uncertain whether enhanced richness of generalist predators translates into improved pest regulation. The study by Heinen et al. examined how diversified crop rotation and organic fertilisation influenced predator–prey interactions throughout the cropping cycle in cereal fields. The predators' diet preference shifted over the growing season, indicating that soil fauna is an important resource for recruitment and maintenance of predators early in the season. Although intraguild predation was considerably high, it decreased across the season in fields with the greatest level of diversification, where predation of pests remained stable. This study demonstrated how diversified cropping is important for providing resource continuity with alternative prey (soil fauna and predators) over crop-growing season, enhancing predator richness and herbivore regulation.</p>\n<h2>Resumo</h2>\n<p>Monoculturas agrícolas consistem em agroecossistemas homogêneos muito dependentes de inseticidas para a regulação de pragas e fertilização mineral para a nutrição das plantas, representando um sistema com a menor resiliência. As práticas de diversificação agrícola podem aumentar a heterogeneidade dos agroecossistemas, resultando em maior riqueza de predadores artrópodes e melhoria dos serviços ecossistêmicos. Entre os inimigos naturais, os predadores generalistas são importantes para a regulação das pragas, pois eles predam diversas pragas artrópodes e estão presentes ao longo da safra. No entanto, como eles consumem outros predadores (predação intraguilda) e a fauna do solo, é incerto como o aumento da riqueza dos predadores generalistas resulta em uma regulação de pragas mais eficiente. O estudo por Heinen et al. examinou como a rotação diversificada de culturas e a fertilização orgânica influenciam as interações predador-presa ao longo do ciclo da cultura em campos de cereais. A preferência alimentar dos predadores mudou ao longo do período de crescimento da cultura, indicando que a fauna do solo é um importante recurso para o recrutamento e manutenção dos predadores no início da safra. Apesar da predação intraguilda ter sido alta, ela foi reduzida ao longo da safra em campos com maior diversificação, enquanto a predação de pragas permaneceu estável. O estudo demonstrou como a diversificação agrícola é importante para fornecer a continuidade de recursos por meio de presas alternativas (fauna de solo e predadores) ao longo da safra, melhorando a riqueza de predadores e a regulação dos herbívoros.</p>","author":"Maria Fernanda G. V. Peñaflor","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"879f428cced74cfb4527cb2ad2c98279d736727cc7bfffc42ddcb4a9020ddbe5","category":"Environment"}