{"title":"Family mentality: How Jesse and Liam Yates learned to enjoy the suffering of cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/he-s-obsessed-with-suffering-jesse-and-liam-yates","date":1702197000000,"content":"\n      <p><span>Sean Yates was one of Britain’s top cyclists during the 1980s and 1990s. He won stages at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> and the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. He even became the third ever Briton to wear the yellow jersey in 1994 when he led the overall GC by one second and wore the </span><i><span>maillot jaune</span></i><span> for one day. He retired in 1996 having ridden 12 Tours with the four teams he raced for over his 15-year career; Peugeot, Fagor, 7-Eleven, and Motorola. </span></p>\n<div></div>\n<div></div>\n<p><span>After his professional career in the peloton, Sean Yates continued his career in cycling but as a team manager and sports director for teams such as Linda McCartney Racing Team and Team Sky. In 2016, he called an end to this, too, marking over 30 years in the cycling scene. </span></p>\n<p><span>“I didn’t really understand the magnitude of who Sean Yates was until I matured,” said Jesse Yates, Sean’s 27-year-old son, who was at </span><i><span>Rouleur Live</span></i><span> at the start of November. “We just knew he rode a bike and he was a pro. It was when we got into the cycling world, we kind of realised the level he was riding.” </span></p>\n<p><span>Jesse stood in front of me, next to his brother Liam Yates, who is slightly older than him, aged 30. They were both speaking at the event, Liam on the main stage with Unbound winner Carolin Schiff, and Jesse on the Other Stage with Sam Andrews, with whom he won Badlands, and fuelling brand, Styrkr. They tease each other over this, the fact one of them is on the main stage and the other isn’t, acting just how you’d expect two brothers to be. </span></p>\n<p><span>They’ve always had this kind of brotherly relationship they said, always competing, pushing each other, and having jokes. Reflecting back on their early years in cycling, </span>Jesse recalled some gruelling hill efforts Liam put him through. “Liam used to take me out riding and we’d literally be five hours into this ride and I’d be absolutely dead, and he’d just keep saying one more hill, one more hill, go really hard. He’d then say we were only about five minutes from home, but then throw in another hill. When I grew up, I realised where these rides were and they were only ever like 10km from home.” </p>\n<p><span>“We were just doing loops,” Liam laughed in response. However, they had both grown accustomed to suffering on their bikes, with their dad sending them out on long bike rides before they had even had breakfast. Jesse joked that Liam was sent on these long training rides before Jesse decided to get into cycling, so then he’d make Jesse do them, too, so he experienced the same pain. Nevertheless, he would still go out training with his brother today despite enduring the gruelling rides when he was younger. That's because now he’d now be able to “torture” Liam on the bike, having been </span>coached by his dad since he started cycling as part of his dad’s company, Sean Yates Coaching.</p>\n<p>“About a year into my cycling, I stepped outside the back door of the house and my dad said to me, ‘Do you want me to make you the next Tour de France winner?’ I said yes, and obviously it has not worked out like that, but I still do as I am told and race both on the road and gravel,\" Jesse said. </p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/RL_23_-_Yates_brothers_-_by_Alessandra_Bucci-5891.jpg?v=1700496724\" />Whereas, for Liam, he started racing when he first got into cycling after getting a job in a bike shop, but wasn’t coached by his dad.  <span>Now Liam’s focus is more on biking-packing, ultra-cycling, and touring, working </span>for a lot of brands creating content, and also runs his own 300km ultra-gravel event called <a href=\"https://www.instagram.com/ssxmysterytour/\" target=\"_blank\">SSX Mystery Tour</a>. “I don’t really like the regiment of having a coach,\" he said, \"and having to follow what I’ve been told to do. With my job now, I am kind of free and I enjoy that aspect of my life, and coaching sort of goes against that. If I wake up and want to do something, then I’ll go and do it.” </span></p>\n<p><span>Even if it was only Jesse who tried to follow in his dad's footsteps of becoming a professional road cyclist, aiming for Grand Tour wins and Monument titles, they both admit that they've garnered some of their dad's traits. </span>Sean got himself the nickname “The Animal” because he was ready to put the work in, whatever the job, and this is something they've both inherited. </p>\n<p>“If someone needed a job done, like riding on the front for five hours in the rain, he’d do it. That mentality is also what he is like in life and I think that has rubbed off on us, like you’ve just got to get on with it, and that has really helped with events like Badlands that I’ve done over the last few years,” Liam said, with Jesse nodding in agreement. “Even if you scratch in an ultra-distance race, you’ve still got to find your own way out of the situation, so having that mentality really helps there, too.” </p>\n<p><span>Both Liam and Jesse have now raced in various ultra-cycling off-road races, such as Badlands or the Traka. When I asked both of them why the appeal of the rough stuff, when they’ve grown up with a dad whose life was dedicated to the road, Jesse was quick to respond. “I used to be very against it. The concept of sleeping during a race seemed a bit ridiculous to me. But then I saw Liam doing all these events and they looked really fun and I thought I’d love to do one of them. So, I did a couple last year and then I have done a few more this year, and I’ve really enjoyed it.” </span></p>\n<p><span>He added in a mocking tone, “I guess I copied my brother because I look up to him and he's super cool…”. Liam stood smirking in response. </span></p>\n<p><span>They’ve both now gone on to take on epic challenges, something they said their dad understands and appreciates how tough they are. And with plenty of suffering on the menu during the long distance rides and races Liam and Jesse take part in, they both think their dad would have loved to take part in these kinds of events when he was younger. “He loved Paris-Roubaix,” said Jesse. “He’s obsessed with suffering and making himself suffer. This would be like <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> for 39 hours.” </span></p>\n<p><span>Now they're both on the gravel scene, and with Jesse winning Badlands pairs this year, I ask whether they’d ever ride a race together? Jesse told me they would like to do the Silk Road Mountain Race together in Kyrgyzstan, adding, “I think it would be crazy and if I was to do it as a pair, I would want to do it with him.” </span></p>\n<p><span>“It would be cool. added Liam. \"You’d have to up your training a bit though if you want to keep up with me.” </span></p>\n<p><span>Jesse rolled his eyes and let out a laugh,  <span>revealing the spirited essence of their brotherly bond. </span></span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"87a37998949f594914b1037e45c7abd1e670bf3a9e381481ff93088946420fc9","category":"Cycling"}