{"title":"Biome โครงการ code formatter สำหรับ JavaScript/TypeScript เขียนด้วยภาษา Rust ทำงานเกือบเท่าโครงการ Prettier แล้ว","link":"https://www.blognone.com/node/136976","date":1701185819000,"content":"<div><div><div><p>โครงการ Biome ชุดเครื่องมือสำหรับพัฒนาเว็บประสิทธิภาพสูงประกาศความสำเร็จในการพัฒนาโครงการให้เกือบเทียบเท่าโครงการ Prettier โครงการ code formatter ยอดนิยมที่มียอดดาวน์โหลดถึงสัปดาห์ละ 29 ล้านครั้ง</p>\n<p>ก่อนหน้านี้ Biome ทำงานต่างกับ Prettier พอสมควร โดยสามารถผ่านชุดทดสอบของ Prettier ได้เพียง 85% เท่านั้น แต่เมื่อต้นเดือนพฤศจิกายนที่ผ่านมาทาง Prettier ก็หาเงินจากสปอนเซอร์ต่างๆ มาตั้งรางวัล 22,550 ดอลลาร์ให้กับโครงการที่สามารถอิมพลีเมนต์ code formatter ที่ผ่านชุดทดสอบของ Prettier ได้เกิน 95% โดยเขียนโค้ดด้วยภาษา Rust และทางโครงการ Biome ก็เพิ่มฟีเจอร์อย่างรวดเร็วจนผ่านชุดทดสอบได้ 96% ได้รับรางวัลไปหลังการประกาศรางวัลเพียงสามสัปดาห์</p>\n<p>ทาง Prettier ระบุว่าโครงการไม่ได้เน้นประสิทธิภาพการทำงานนัก แม้ว่าที่ผ่านมาจะมีประสิทธิภาพระดับยอมรับได้ ที่ผ่านมาหากโค้ดถูกฟอร์แมตด้วยแนวทางของ Prettier ไปแล้วนักพัฒนาก็มักหลีกเลี่ยงไม่เปลี่ยนไปใช้โครงการอื่นอีกเพราะโค้ดจะต่างกันมาก การสนับสนุนให้โครงการอื่นๆ พัฒนาเข้ามาใกล้เคียงกันขึ้นจึงเป็นการสนับสนุนการแข่งขันต่อไป</p>\n<p>โครงกร Biome ที่ผ่านการทดสอบครั้งนี้คือเวอร์ชั่น 1.4.0 หากใช้เวอร์ชั่นนี้เป็นต้นไป โด้ดที่ได้ก็น่าจะไม่ต่างกับ Prettier มากนัก และทาง Biome สัญญาว่าจะปรับปรุงให้การทำงานตรงกันมากขึ้นในอนาคต</p>\n<p>ที่มา - <a href=\"https://prettier.io/blog/2023/11/27/20k-bounty-was-claimed\">Prettier</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2d7c79e1244959492e060a09ff927b32.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/javascript\">JavaScript</a></div><div><a href=\"/topics/typescript\">TypeScript</a></div><div><a href=\"/topics/programming\">Programming</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"87a51bac72f07e190146a73cc9cbe5a991509cd7ecb10cdcde4558c74731a805","category":"Thai"}