{"title":"Evolutionary game and simulation analysis of construction waste recycling from the perspective of stakeholders","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307652","date":1724767200000,"content":"<p>by Yingchen Wang, Yan Liu, Tao Wang, Xiumin Xing, Xiaoxiao Geng</p>\r\n\r\nIn current construction waste resource management processes, the effect of government supervision is unclear, and illegal treatment and low-quality reproduction of recycling and reprocessing enterprises by construction units are common. To improve the degree of resource utilization of construction waste and deeply explore the role of its key influencing factors, a tripartite evolutionary game model of construction waste resource treatment in which the government, construction units, and recycling and reprocessing enterprises are the research objects that considers public participation factors to be established. MATLAB is used to simulate the sensitivity of relevant parameters. The results show that: (1) An increase in government fines can regulate the behavior of enterprises; (2) Low government subsidies are conducive to the development of a tripartite stability strategy; and (3) An increase in the cost difference between the two strategies of the enterprise will weaken its willingness to carry out green operations (and after the cost difference exceeds the threshold, the enterprise will refuse to carry out green operations); (4) The reputation value brought by the public and the additional value added by reputation under the contrast effect have an incentive effect on the enterprise and the government; and (5) The peak value of the inverted U-shaped curve of government strategy choice is affected by the degree of public participation. Therefore, the government should propose rectifications in terms of fines and subsidies, and both companies can use technological innovation to reduce costs. At the same time, it is necessary to raise stakeholders’ awareness of resource utilization and encourage the public to actively participate in supervision. The research conclusions can provide a decision-making reference for improving the utilization of construction waste resources and the efficient treatment of construction waste resources.","author":"Yingchen Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"87a60391141a12c8af74ba77f48c165104fa0d569e51e63debe73dfd71d2d925","category":"Interdisciplinary"}