{"title":"Apple Music to get hi-res lossless streaming for no extra charge in June","link":"https://www.macworld.com/article/346720/apple-music-spatial-audio-dolby-atmos-lossless-high-resolution-streaming.html","date":1621278542000,"content":"\n<div>\n<section><div></div></section><p>After a flurry of leaks, rumors, and <a href=\"https://www.macworld.com/article/346705/apple-music-plus-lossless-high-res-audio-teaser-logo.html\">even a teaser by Apple itself</a>, Apple on Monday announced that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/05/apple-music-announces-spatial-audio-and-lossless-audio/&amp;xcust=1-1-346720-0-0-0&amp;sref=https://www.macworld.com/feed\">Music subscribers will be getting several audio enhancements in June</a> at no additional charge.</p>\n\n\n\n<p>First and foremost, Apple Music’s entire catalog of more than 75 million will be available to stream in Lossless Audio through ALAC (Apple Lossless Audio Codec) to “to preserve every single bit of the original audio file.” Subscribers will be able to select which quality they want to use as well as connection type, since Lossless Audio requires much more bandwidth to stream. The available resolutions are CD quality (16 bit at 44.1 kHz to 24 bit at 48 kHz) and Hi-Resolution Lossless that tops out at 24 bit at 192 kHz.) Apple Music currently offers a setting to stream lower quality when connected to mobile data.</p>\n\n\n\n<p>Additionally, Apple Music is also gaining spatial audio with support for Dolby Atmos for compatible devices. A feature in iOS 14, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2021/05/apple-music-announces-spatial-audio-and-lossless-audio/&amp;xcust=1-1-346720-0-0-0&amp;sref=https://www.macworld.com/feed\">spatial audio is Apple’s version of Dolby Atmos</a> designed for headphones that offers an “immersive audio experience that enables artists to mix music so the sound comes from all around and from above.” It will be available for select tracks from J Balvin, Ariana Grande, Maroon 5, The Weeknd, and others at launch and Apple Music subscribers will receive new tracks “constantly,” according to Apple.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/apple-music-lossless-logos.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>Apple says all AirPods and Beats headphones with an H1 or W1 chip, as well as the built-in speakers in the latest versions of iPhone, iPad, and Mac will default to spatial audio. Previously, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT211775&amp;xcust=1-1-346720-0-0-0&amp;sref=https://www.macworld.com/feed\">only the high-end AirPods Pro and AirPods Max</a> supported spatial audio. However, due to Bluetooth limitations, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.t3.com/news/airpods-max-and-airpods-pro-dont-support-apple-music-lossless-apple-confirms&amp;xcust=1-1-346720-0-0-0&amp;sref=https://www.macworld.com/feed\">AirPods won’t actually be able to stream lossless tracks</a> unless Apple is able to develop some kind of a proprietary codec.</p>\n\n\n\n<p>The new Apple Music audio formats will be available to Apple Music subscribers at no additional cost in June. In response, Amazon announced that its Amazon Music HD tier, which previously cost an extra $5 a month, will now be free. Spotify’s own HiFi service is <a href=\"https://www.techhive.com/article/3608623/spotify-will-roll-out-cd-quality-audio-streams-later-this-year.html\">due to launch later this year</a> but it hasn’t mentioned a new pricing tier.</p>\n\n\n\n<p><strong>Update 3:05pm ET:</strong> <em>Added information about AirPods and lossless streaming.</em></p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"87aa485481e0be5b2d8f4af5825cdca3d5c3fdb2f8a8caaa1a6cdb84af716590","category":"Apple"}