{"title":"4 Hands-on 2: Environmental evaluation of feeding strategies with agent-based modeling and life cycle assessment: From theory to practice. Sponsored by EAAP","link":"https://academic.oup.com/jas/article/102/Supplement_3/69/7757010?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Livestock farming systems (LFS) have detrimental effects on the environment, associated mainly to feed production, enteric methane and emissions from manure. Life Cycle Assessment (LCA) is a standardized internationally recognized methodology to assess the various environmental impacts associated to a product, considering all the processes occurring during its life cycle. Cradle-to-farm-gate LCA is commonly used to assess the environmental impacts of LFS. However, LFS are complex because they are structured by multiple interactions between biological and human-controlled processes, at various organization levels. Their behavior and the extent to which feeding strategies can mitigate this environmental burden is not always easily predictable. Dynamic mechanistic models of LFS can simulate the effects of feeding strategies on both animal performance and the associated excretion of nutrients. These models are useful tools to produce the life cycle inventories needed in life cycle assessment. In the pig-fattening unit, the animal performance with multiphase group feeding depends largely on the variability of growth potential among pigs and the farmer makes decisions that can target either the group of pigs or each individual (e.g., when choosing pigs to deliver to slaughterhouse). Therefore, simulating the growth trajectory of each individual pig and events like deliveries to slaughterhouse makes it possible to estimate the response of the pig population rather than the average pig to feeding strategies. Individual-based models (IBM) are particularly adequate because they make it possible to simulate each individual and to build the response of the population from the aggregation of individuals. Agent-based models are IBM that rely on self-governing agents made of properties, behavioral rules and resources that allow each agent to make decisions upon the occurrence of an event, which can be triggered randomly or not. This hands-on will focus on a specific example that illustrates how and why agent-based models are useful tools to assess the effects of feeding strategies through LCA. To keep it easily tractable, it will focus only on the impacts on climate change and acidification of a pen of fattening pigs according to the feeding strategy applied. In a first step, we will develop a simplified individual-based model of a pig-fattening pen (including pigs and the farmer as agents), which simulates the effects of feeding strategies on animal performance (growth rate, feed conversion ratio, slaughter weight, N excretion). In a second step, we will upgrade this model by introducing a module which makes the calculation of the environmental impacts through LCA. In a third step, we will use the model to simulate the effects of various feeding strategies according to the variability of growth potential among pigs in the pen. For all steps, we will work with Python language using pre-developed Jupyter notebooks.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"87adfe03f9ac1de818110ca7aad78b299f76c2f70430b3f49881e2bd96b67416","category":"Environment"}