{"title":"Variability in the white spot: a new genus and species of Discodorididae (Nudibranchia) from the central and western Pacific Ocean","link":"https://academic.oup.com/mollus/article/doi/10.1093/mollus/eyad027/7603423?rss=1","date":1707350400000,"content":"<span><div>ABSTRACT</div>In this paper, a new genus in the nudibranch family Discodorididae, <span>Avaldesia</span> n. gen., is established for <span>Avaldesia albomacula</span> (Chan &amp; Gosliner, 2007) and <span>Avaldesia tahala</span> (Chan &amp; Gosliner, 2007), originally assigned to the genus <span>Thordisa</span> Bergh, 1877, and a new species, <span>Avaldesia tamatoa</span> n. sp., described here from the central Pacific. To establish species relationships within <span>Avaldesia</span>, as well as the placement of <span>Avaldesia</span> within Discodorididae, we utilized four molecular markers (cytochrome <span>c</span> oxidase subunit I, 16S rRNA, histone H3 and 28S rRNA) in our Bayesian inference and maximum likelihood analyses. Four species delimitation methods were complemented by morphological dissections and scanning electron microscopy. Our results reveal a clear separation between <span>Avaldesia</span> and <span>Thordisa</span> and suggest that <span>Avaldesia</span> is more closely related to the genera <span>Hoplodoris</span> Bergh, 1880 and <span>Asteronotus</span> Ehrenberg, 1831. The most characteristic features of <span>Avaldesia</span> include a radula with increasing denticulation towards the fimbriate outermost laterals and a reproductive system with a lobate vestibular gland, occasional hollow vestibular spine and a penis armed with one or more penial spines. All species of <span>Avaldesia</span> are found in shallow water (5–10 m depth) on rocky reefs, sandy sediments and algal fields with distributions across the Indo-Pacific.</span>","author":"","siteTitle":"Journal of Molluscan Studies Current Issue","siteHash":"50e5bd74f9c9bc6ffdefd16d0eef1528d858cc544080b551025ae62157896b1d","entryHash":"87ad13965a3e67cb84b334a88b8b40f9859f7a314213349dac3397e6bdb4deb0","category":"Environment"}