{"title":"Reservoir Mud Releasing May Suboptimize Fluvial Sand Supply to Coastal Sediment Budget: Modeling the Impact of Shihmen Reservoir Case on Tamsui River Estuary","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036701?af=R","date":1717830000000,"content":"<h2>Abstract</h2>\n<p>Regular release of sediment from reservoir has been increasingly adopted as a strategy for sustainable management. Here, we use a process-based morphodynamic model to simulate the estuarine sediment dynamics impacted by turbidity current venting implemented by the Shihmen Reservoir during three typhoon events in 2008. Upon validation with the post-event bathymetries, the model hindcasts reveal that mud releasing can be effective in mitigating reservoir siltation, yet may be a suboptimal strategy for alleviating coastal sediment deficit. A vast majority of the released muds were delivered through the estuary and exported to offshore by flood advection, wave dispersion, and tidal flushing. The flood-driven sands, sourced mainly from downstream tributaries, were instead the major contributor to coastal sediment budget. However, mud mantling (covering and immobilizing sand deposits by the reservoir-released muds) reduced sand availability and thus sand delivery to the coast. For the present case, 25% of the released muds were deposited along the way, presence of these mud covers reduced sand delivery by 15%, compared to a hypothetical scenario of clear-water flood releases. The relative sand transport deficit is found to increase linearly with the degree of bed mud saturation, 1–<i>D</i>/<i>R</i>, with <i>D</i>/<i>R</i> the ratio of single-event mud deposit to release. Given broad relevance to global reservoirs encountering the problems of siltation and coastal sediment deficit, our findings highlight that sustainable management needs to look beyond just a bulk amount of sediment, but it is critical to consider how different sediment fractions are interacting and impacted by human activities.</p>","author":"Yu‐Ta Hsueh, \nFu‐Chun Wu, \nQinghua Ye, \nSteven Y. J. Lai, \nYinphan Tsang","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"87bc58c4f26622c6cd0e4c691a52f0d0da0c966ceb63b6a1dd796a95b6d4fc9f","category":"Environment"}