{"title":"The impact of COVID-19 on sexual risk behaviour for HIV acquisition in east Zimbabwe: An observational study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003194","date":1721224800000,"content":"<p>by Rebekah Morris, Simon Gregson, Rufurwokuda Maswera, Louisa Moorhouse, Tawanda Dadirai, Phyllis Mandizvidza, Brian Moyo, Owen Mugurungi, Constance Nyamukapa</p>\r\n\r\nThe Covid-19 pandemic and associated restrictions have the potential to alter sexual risk behaviours for HIV acquisition with important implications for HIV prevention programmes in sub-Saharan Africa. To date, no large-scale data have been published to substantiate hypothesised changes in sexual risk behaviours. We used longitudinal survey data to assess the impact of Covid-19 on sexual risk behaviours in east Zimbabwe. Data on sexual behaviours in HIV-negative adults aged 15–54 years were collected in two rounds of a general population open-cohort survey conducted in Manicaland, Zimbabwe shortly before (July 2018 to December 2019; N = 7316) and several months into the Covid-19 epidemic (February to July 2021; N = 6356). Descriptive statistics and logistic regression models of serial cross-sectional and prospective cohort data were used to assess changes in sexual risk behaviours. The proportion of females aged 15–19 years reporting sexual debut declined from 29.7% before Covid-19 to 20.3% during Covid-19 (adjusted odds ratio (AOR) = 0.49, 95% confidence interval (95% CI), 0.38–0.63). Fewer sexually-active females reported multiple sexual partners during Covid-19 (3.35% <i>versus</i> 6.07%; AOR = 0.55, 95% CI, 0.43–0.72). No population-level changes in male behaviour between survey rounds were recorded but the cohort analysis revealed a complex pattern of behaviour change with HIV risk behaviours increasing for some individuals and decreasing for others. Overall HIV risk behaviours remained high in a sub-Saharan African population with a generalised HIV epidemic over a period of Covid-19 lockdowns when movements and social contacts were restricted.","author":"Rebekah Morris","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"87c136e4244881f915e86cb491af2ce7def9110b5e61c5726299707b282fdf40","category":"Environment"}