{"title":"Transformation never ends: เฟสถัดไปของ KBTG ที่การปรับองค์ไม่มีที่สิ้นสุด","link":"https://www.blognone.com/node/138447","date":1709177400000,"content":"<div><div><div><p>“<em>Transformation never ends</em>” การปรับปรุงพัฒนา (ตัวเอง) จะไม่มีวันสิ้นสุด คือคำพูดแรกๆ ของ <strong>คุณกระทิง เรืองโรจน์ พูนผล Group Chairman ของ KASIKORN Business-Technology Group หรือ KBTG</strong> ที่พูดเปิดการแถลง KBTG Vision ล่าสุด ที่มาในธีม The Never-ending Adventure เพื่อสะท้อนการพัฒนาขององค์กรที่จำเป็นต้องดำเนินอยู่ตลอดเวลา แล้วหมุดหมายการพัฒนาแรกจะเดินทางถึงแล้วก็ตาม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/86e861433616db334799e0b7e995804b.png\" /></p>\n<p>คุณกระทิงเล่าว่า การปรับตัว (transformation) ของ KBTG แบบยกเครื่อง ก็คือนับตั้งแต่ที่ตัวเองเข้ามารับงานคือเมื่อปี 2019 หรือที่เรียกว่า OneKBTG Transformation กำหนดเป้าหมายเป็นบริษัทเทคชั้นนำในเอเชียตะวันออกเฉียงใต้ผ่าน 6 เสาหลัก โดยตั้งเป้าในปี 2025 แต่สามารถทำได้จริงตั้งแต่ปี 2023 เร็วกว่ากำหนดถึง 2 ปี</p>\n<p>ความสำเร็จของ KBTG ผ่าน 6 เสาหลักคร่าวๆ ก็มี</p>\n<p><strong>1. เป็นเลิศด้านระบบและปฏิบัติการ (Brilliant Basic &amp; Operation Excellence)</strong></p>\n<p>ระบบไอทีของ KBank มีเสถียรภาพมากที่สุด 4 ปีติดต่อกัน โดยมี service availability ถึง 99.99% แม้จะรองรับธุรกรรมทางการเงินมากถึง 23.9 ล้านล้านบาท คิดเป็น 35% ของธุรกรรมภายในประเทศ จากจำนวนผู้ใช้งาน K PLUS กว่า 21.7 ล้านราย</p>\n<p><strong>2. ยกระดับสถาปัตยกรรมและโครงสร้างพื้นฐานให้ทันสมัย</strong></p>\n<p>KBTG มีการปรับปรุงโครงสร้างพื้นฐานให้มีเสถียรภาพสำหรับให้บริการมากยิ่งขึ้น ระยะเวลา downtime ลดลงถึง 66% ลดอัตราการเกิด incident ความรุนแรงระดับ 1 และ 2 ถึง 60% ระยะเวลาที่ใช้ในการแก้ไขลดลงถึง 33% ขณะที่ในแง่ศูนย์ข้อมูลและไซต์สำรอง (DC &amp; DR) ก็เป็นแบบ active-active แล้วและมีการใช้พลังงานที่มีประสิทธิภาพมากขึ้น ตัวเลข PUE ลดลงจาก 2.0 เป็น 1.5</p>\n<p><strong>3. ปรับวิธีการทำงานให้มีประสิทธิภาพขึ้นด้วย Agile และ Automation</strong></p>\n<p>ปรับวิธีการทำงานแบบ End-to-end ทำให้การส่งมอบโปรเจ็คเพิ่มขึ้น 2.25 เท่า จาก 83 โปรเจคต่อปีใน 2019 มาเป็น 190 โปรเจคในปี 2023 โดยคุณภาพก็เพิ่มขึ้นด้วย จากการไม่มี incident ความรุนแรงระดับ 1 เลย ขณะที่ incident ทั่วไปในภาพรวมลดลง 8%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/c76233e057d4e3cde7da7981be72b13d.jpeg\" /><em>กระทิง เรืองโรจน์ พูนผล Group Chairman ของ KASIKORN Business-Technology Group</em></p>\n<p><strong>4. ขยายองค์กรสู่ระดับภูมิภาค</strong></p>\n<p>4 ปีที่ผ่านมา KBTG ได้ขยายสำนักงานและฐานปฏิบัติการไปใน 4 ประเทศ 5 เมืองใหญ่ได้แก่ กรุงเทพ, โฮจิมินห์และฮานอยที่เวียดนาม, เซินเจิ้น ที่จีน และจาการ์ตา ที่อินโดนีเซีย โดย KBTG Vietnam ยังได้รับรางวัล Best IT Companies 2024 จาก ITviec แพลตฟอร์มสมัครงานชั้นนำของเวียดนามด้วย</p>\n<p><strong>5. สร้างสรรค์นวัตกรรมใหม่ๆ</strong></p>\n<p>นวัตกรรมผู้บริโภคที่เราเห็นได้ชัดและบ่อยที่สุดก็น่าจะเป็น ขุนทอง ที่มีผู้ใช้ 1.7 ล้านคน และ MAKE by KBank ที่มีผู้ใช้ 2.1 ล้านคน และล่าสุดก็มีเหมียวจด แอปจดบันทึกรายจ่ายอัตโนมัติจากสลิปโอนเงินจาก KBTG Labs นอกจากนี้ยังมีธุรกิจใหม่จาก KX อย่าง Kubix และ Coral ขณะที่ภายในองค์กรก็มีการนำ ML, AI และ Data (M.A.D.) มาใช้งาน ไปจนถึงการทำวิจัยร่วมกับหน่วยงานระดับโลกเช่น MIT และการลงทุนในบริษัทสตาร์ทอัพและกองทุน Deep Tech ผ่าน KXVC</p>\n<p><strong>6. พัฒนาขีดความสามารถและการดูแลบุคลากร</strong></p>\n<p>เรื่องบุคลากรก็เป็นสิ่งที่ KBTG ให้ความสำคัญมาตลอด สิ่งที่วัดผลเรื่องนี้ได้ดีที่สุดคืออัตราการลาออกของพนักงาน ลดลงเหลือเพียง 7.5% ในปี 2023 ในขณะที่จำนวนพนักงานก็มากขึ้นเรื่อยๆ จาก 1,100 คน เมื่อ 2019 เป็นราว 2,500 คน ณ ปัจจุบัน</p>\n<h4>Let’s M.A.D. It</h4>\n<p>แม้ 4 ปีที่ผ่านมา KBTG จะประสบความสำเร็จในการ transform และพัฒนาองค์กรในทุกๆ แกนที่ตั้งเป้าหมายเอาไว้แล้ว แถมเร็วกว่าระยะเวลาที่ตั้งเอาไว้ แต่คุณกระทิงก็ยังยืนยันว่า การ transform จะไม่มีวันสิ้นสุด</p>\n<p>ดังนั้นเป้าหมาย 3 ปีถัดไปของ KBTG ยังคงตั้งเป้าที่จะขยายศักยภาพขององค์กรด้วย AI ด้วยแนวคิด Human-first x AI-first Transformation หมายความว่า KBTG ไม่ได้จะนำ AI มาทดแทนการทำงานด้วยคน และไม่มีแผนจะปลดคนออก แต่ต้องการนำ AI มาปรับปรุงกระบวนการทำงานภายในให้มีประสิทธิภาพมากยิ่งขึ้น รวมถึงเสริมประสิทธิภาพในการสร้างสรรค์ผลิตภัณฑ์และบริการเป็นหลัก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6d6c05151819a5a0fe29715144212858.jpg\" /></p>\n<p>ที่ผ่านมา คุณกระทิงบอกว่า การนำ AI มาใช้ช่วยในกระบวนการทำงาน โดยที่เป้าหมายถัดไปคือเพิ่ม productivity ให้ได้ 100,000 mandays ภายใน 3 ปี</p>\n<p>นอกจากการนำ M.A.D. มาใช้ภายในองค์กรแล้ว คุณกระทิงบอกด้วยว่า KBTG คนเดียว ไม่สามารถไปรอดได้ด้วยตัวเองในระยะยาว ดังนั้น AI for all เลยเป็นอีกหนึ่งเป้าหมายของ KBTG ในการสร้างความรู้ความเข้าใจด้าน AI (AI Literacy) ให้กับองค์กรหรือหน่วยงานภายนอก ให้พัฒนาไปพร้อมๆ กัน</p>\n<h3>What’s next for KBTG</h3>\n<p>คุณวรนุช เดชะไกศยะ ตำแหน่ง Executive Chairman ของ KBTG เผยว่า<br />\nการปรับรูปแบบการทำงาน จากเดิมที่เคยเอ้าซอร์สหลายส่วน ให้กลับมาทำเองกันภายใน ช่วยเพิ่มประสิทธิภาพของโปรเจ็คให้ดียิ่งขึ้น ขณะที่การนำเครื่องมือ ไปจนถึง Machine Learning, AI มาช่วยในการทำงาน ก็ช่วยลดต้นทุนด้านไอทีรวมๆ ลงได้ราว 1,000 ล้านบาท</p>\n<p>อย่างไรก็ตาม ระบบธนาคารยังคงมีความท้าทายอยู่อีกมาก โดยเฉพาะโครงสร้างพื้นฐาน ดังนั้นปีนี้บริษัทมีแผนจะลงทุนด้านยุทธศาสตร์ไอทีด้วยงบประมาณ 8,000 - 9,000 ล้านบาท โดยจะยังคงล้อไปกับยุทธศาสตร์ 3+1 ของ KBank คือด้านสินเชื่อ (lending), แพลตฟอร์มความมั่งคั่ง (wealth), ช่องทางการให้บริการ (channel) และรายได้ใหม่ในระยะกลางและยาว (new s-curve) ซึ่งทั้งหมดจะถูกวางอยู่บนโครงสร้างพื้นฐานด้านไอทีที่แข็งแกร่งและปลอดภัย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/a13bcdbf12b8dda5491f9e49d2c28d79.jpeg\" /><em>วรนุช เดชะไกศยะ Executive Chairman ของ KASIKORN Business-Technology Group (KBTG)</em></p>\n<p>เช่นเดียวกับเรื่องของพนักงานที่ KBTG ก็ยังคงให้ความสำคัญเช่นเดิม เพราะปัจจัยภายนอก อย่างการแข่งขันเรื่องผลตอบแทนค่อนข้างสูง</p>\n<p>ซึ่งสิ่งที่จะทำทั้งหมด ต้องส่งมอบคุณค่าให้กับผู้ที่เกี่ยวข้อง (stakeholder) ทั้งหมด ตั้งแต่ลูกค้า, ผู้ถือหุ้น, พนักงาน, หน่วยงานกำกับดูแลและสังคมภายนอก</p>\n<p>ขณะที่ยุทธศาสตร์ถัดไปของ KBTG จะถูกเรียกว่า Guiding Four ได้แก่</p>\n<ul>\n<li><strong>การส่งมอบคุณค่า (delivering value)</strong> ทุกสิ่งที่ KBTG ทำ ต้องตอบโจทย์ทางธุรกิจและสร้างโอกาสทางธุรกิจใหม่ๆ ให้ธนาคาร</li>\n<li><strong>เพิ่มประสิทธิภาพในการทำงาน (enhancing operatiดon &amp; cost efficiency)</strong> เพื่อเพิ่มประสิทธิภาพการทำงานและ productivity ให้คุ้มค่ากับเม็ดเงินที่ลงทุนไปมากที่สุด</li>\n<li><strong>เพิ่มความสามารถด้านเทคโนโลยี (boosting technology capabilities)</strong> ใช้ประโยชน์อย่างเต็มที่จาก Data, AI, Cloud ฯลฯ</li>\n<li><strong>ยกระดับความสามารถของบุคลากร (uplifting people capabilities)</strong> ให้ความสำคัญกับการรักษาคน ไปจนถึงเพิ่มความสามารถและช่องทางบ่มเพาะสู่การเป็นผู้นำ</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/abd206db2597d02854fe0e404f02fe63.jpeg\" /></p>\n<h4>Broadening IT Horizon</h4>\n<p>แนวทางการเติบโตของ KBTG ในระดับภูมิภาคยังคงอยู่ที่เป้าหมายเดิม คือการเป็น IT Hub เป็นองค์กรเทคโนโลยีชั้นนำของภูมิภาค ซึ่งล้อไปกับเป้าหมายของ KBank ที่จะเป็นธนาคารดิจิทัลระดับภูมิภาค AEC+3 โดยตอนนี้ KBTG มีสำนักงานใหญ่อยู่ที่เสิ่นเจิ้น (K-Tech China) และที่<a href=\"https://www.blognone.com/node/134578\">เวียดนาม (KBTG Vietnam)</a> ในเมืองโฮจิมินห์และฮานอย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6f7846d50e65e0bca25f273e61574e49.jpg\" /></p>\n<p>หนึ่งในโอกาสใหม่ๆ ของ KBTG ตอนนี้อยู่ที่อินโดนีเซีย หลังจากที่ KBank เข้าไป<a href=\"https://brandinside.asia/kbank-bank-maspion-indonesia-2023/\">ถือหุ้นใหญ่ของธนาคารแมสเปี้ยน</a> ของอินโดนีเซีย โดยคุณวรนุชบอกว่า ช่วงแรกๆ KBTG จะต้องเข้าไปดูแลและประเมินโครงสร้างหลายๆ อย่างของธนาคารแมสเปี้ยนที่มีอยู่ตอนนี้ก่อน ไม่ว่าจะเรื่องความปลอดภัย, Application Maturity, โครงสร้างพื้นฐาน, Governance, ไปจนถึงวิธีการทำงาน และทรัพยากรเรื่องคน เพื่อให้สอดคล้องกับเป้าหมายทางธุรกิจของ KBank ในอินโดนีเซีย</p>\n<p>แนวทางของ KBTG ในอินโดนีเซียจะยังคงใช้แนวทางเดียวกับที่จีนและเวียดนาม คือเน้นการจ้างคนท้องถิ่นที่มีศักยภาพมาร่วมงาน โดยช่วงแรกจะต้องอาศัยคนไทยเข้าไปช่วยวางพื้นฐานหลายๆ อย่างให้เรียบร้อยก่อน แต่เนื่องจากสำนักงานของธนาคารแมสเปี้ยนอยู่ต่างจังหวัด และอาจจะหาทีมงานยาก ขณะที่ KBTG มีสำนักงานอยู่ที่จาการ์ตา ทำให้รูปแบบการทำงานอาจจะเป็นแบบรีโมทจากจาการ์ตาเป็นหลัก ซึ่งแน่นอนว่าก็จะนำสิ่งที่ทำได้ดีในประเทศไทย, จีนและเวียดนาม ไปปรับใช้กับที่อินโดนีเซียด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/64b4ed770902eb8765e01898108d7b9d.jpg\" /><em>ออฟฟิศที่ KBTG Vietnam นครโฮจิมินห์</em></p>\n<p>ด้าน K-Tech China คุณวรนุชบอกว่ายังคงโฟกัสในการพัฒนาแพลตฟอร์มและเทคโนโลยีต่างๆ โดยเฉพาะเรื่อง blockchain เพื่อตอบโจทย์ทางธุรกิจให้กับ K-Tech China เป็นหลัก โดยปีนี้ KBank มีเปิดสาขาเพิ่มที่กรุงปักกิ่งด้วย ซึ่ง K-Tech China ก็จะต้องเข้ามาซัพพอร์ตเพิ่ม รวมถึงกำลังจะออกผลิตภัณฑ์ใหม่เกี่ยวกับระบบการกู้เงินและแพลตฟอร์มดาต้าด้วย</p>\n<p>ส่วนบทบาทของ KBTG Vietnam นอกจากการซัพพอร์ต KBank Vietnam ที่ตอนนี้ผู้ใช้ K PLUS เติบโตจนมากกว่า 3 ล้านบัญชีแล้ว ยังมี KBank Laos และ Cambodia ด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/adb99ba19f0e979a50d54ff0dae3efc1.png\" /></p>\n<p>การทำงานของทีมเวียดนาม จะร่วมมือกับ KBTG ฝั่งไทย (แตกต่างกับจีน ที่ K-Tech China ซัพพอร์ตได้เฉพาะ KBank ในจีน ด้วยเหตุผลด้านกฎหมายการกำกับดูแล) และเนื่องจากบุคลากรด้านไอทีมีคุณภาพเป็นอันดับต้นๆ ในอาเซียน รวมถึง KBTG Vietnam เองก็ดึงดูดพนักงานให้เข้ามาทำงาน ทำให้บริษัทยังคงเติบโตไปได้ดีและตอนนี้ ก็กำลังมองหาโอกาสใหม่ๆ ในการพัฒนาแอปหรือเทคโนโลยีด้าน FinTech ขึ้นมาเพิ่มเติม เพื่อสร้างธุรกิจหรือเม็ดเงินใหม่ๆ ให้กับบริษัท และเดินหน้าสู่การเป็น Innovation Hub ของภูมิภาคตามเป้าหมายที่วางเอาไว้</p>\n<p>ในภาพใหญ่ระดับภูมิภาค บทบาทของ KBTG จึงจะไม่ใช่แค่ทำหน้าที่สร้างเทคโนโลยีเพื่อตอบโจทย์ทางธุรกิจให้กับ KBank แต่เพียงอย่างเดียว แต่จะต้องหาหาเทคโนโลยีและโอกาส เพื่อมาต่อยอดและสร้างโอกาสทางธุรกิจ ไปจนถึงเม็ดเงินใหม่ๆ ด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/093d943a0f916c64d3e90205b24ca0dc.png\" /></p>\n<p>#KBTGVision #KBTGInnovation #BeyondAI #BeyondBanking #AI #M.A.D. #KBTGTransformation #KBTGRegional #KBTGAIFirst #KBTGHumanFirst #AIFirst #HumanFirst</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"87c8b53d7a64ef492a27c66f7f3159f846c8764e7af43ff510ab49aafed44aca","category":"Thai"}