{"title":"Evaluating energy cost performance in China's thermal power industry: A global cost Malmquist approach","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12383?af=R","date":1703553893000,"content":"<h2>Abstract</h2>\n<p>With the inclusion of carbon neutrality in the Government Work Report for the first time at the two sessions held in March 2021 and the strengthening of environmental regulation as well as the increase of limits on polluting gas emissions, it has become increasingly important for China to effectively save energy and reduce carbon for sustainable growth under the “dual carbon” target. Since thermal power generation is the most important source of carbon emissions in China, the thermal power industry is the key to achieving the goal of carbon peaking and carbon neutrality. Therefore, it is of great theoretical and practical importance to study the performance of thermal power generation from the micro perspective of power plants. This paper provides a new perspective on the environmental efficiency measurement of thermal power plants by introducing the cost factors of inputs into the model and constructing a global cost Malmquist productivity index, which can effectively solve the problem of the infeasibility of linear programming and different measures of productivity change, to obtain the productivity performance of China's thermal power industry from 2013 to 2017. The empirical results indicate that: (1) The significant decrease in price effect (PE) is the main driving factor of this situation. (2) Except for the central region, the production technology, technical efficiency, and allocative efficiency related to thermal power generation have increased in the eastern and western regions. Therefore, improving CM<sup>G</sup> productivity in the central region is more challenging than in the other two regions and improving the PE can significantly improve CM<sup>G</sup> productivity in China's thermal power industry. This study reveals the spatiotemporal characteristics and influencing factors of production efficiency in China's thermal power industry, which can provide targeted policy guidance for managers to improve the sustainable development of power enterprises.</p>","author":"Weiwei Zhuang, \nJiayu Zhang, \nTaisheng Zhang, \nXiang Chen","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"87ca1ef9ce85b843228a00ce51a4ac756626c3c87a39f1a8c252dabd09ec2ce8","category":"Environment"}