{"title":"Remembering Mimi Sheraton, Innovative New York Times Food Critic","link":"https://www.nytimes.com/2023/04/06/dining/mimi-sheraton-dead.html","date":1691607086000,"content":"\n<p>In the course of researching <a href=\"https://daringfireball.net/linked/2023/08/09/sanders-finger-lickin-bad\">that previous item</a>, wherein then-NYT restaurant critic Mimi Sheraton accompanied Colonel Sanders to a Manhattan KFC in 1976, I learned that she died just a few months ago, at age 97. Truly a groundbreaking career:</p>\n\n<blockquote>\n  <p>An adventurer with a passion for offbeat experiences, an eclectic\ntaste for foods and the independence to defy pressures from\nrestaurateurs and advertisers, Ms. Sheraton was the first woman to\nreview restaurants for The Times. She pioneered\nreviewing-in-disguise, dining in wigs and tinted glasses and using\naliases for reservations, mostly in high-end places where people\nwould have otherwise known her from repeat visits and lavished\ntheir attentions on her.</p>\n\n<p>“The longer I reviewed restaurants, the more I became convinced\nthat the unknown customer has a completely different experience\nfrom either a valued patron or a recognized food critic,” she\nwrote in her 2004 memoir, “Eating My Words: An Appetite for Life.”\n“For all practical purposes, they might as well be in different\nrestaurants.”</p>\n</blockquote>\n\n<p>Knowing what I know about the restaurant industry, it’s hard to believe reviews were ever conducted <em>not</em> in disguise. That regular patrons (and recognized critics) get better service and food couldn’t be more obvious, which is the reason <a href=\"https://kottke.org/13/09/on-the-regular\">it’s such a joy to find your favorite spots and become a valued regular at them</a>.</p>\n\n<blockquote>\n  <p>Colleagues and other restaurant critics described her reviews as\ntough but fair and scrupulously researched. The Times required\nthree visits to a restaurant before publishing a review; she\ndined six to eight times before passing judgment. For an article\non deli sandwiches, she collected 104 corned beef and pastrami\nsamples in one day to evaluate the meat and sandwich-building\ntechniques. [...]</p>\n\n<p>Another of her reviews, based on blind tastings by several Times\nstaff members, favored private-label liquors over popular brand\nnames of Scotch, bourbon, rye, vodka and gin. The review ran weeks\nbefore Christmas, the busy liquor-selling season.</p>\n\n<p>“I heard that two million dollars’ worth of advertising had been\ncanceled,” Ms. Sheraton recalled in her memoir. She approached the\nexecutive editor. “I asked Abe Rosenthal if that was true. He\nsaid, ‘That’s none of your business. It was a great story.’”</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/08/09/remembering-mimi-sheraton\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"87cc8439df5a89b5ba79dd90a7e3b6da2e91c63520d9ca7563c79283a93191b3","category":"Tech"}