{"title":"Apple Is Reportedly Working on a Mac Monitor That Becomes a Smart Home Display When Idle","link":"https://www.macrumors.com/2023/07/03/gurman-apple-monitor-smart-home-display/","date":1688384674000,"content":"Apple is working on a new external monitor for Macs that also functions as a kind of smart home display while not in use, according to <em>Bloomberg</em> reporter Mark Gurman.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/03/apple-studio-display-blue.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nWriting in the subscriber version of his <a href=\"https://www.bloomberg.com/news/newsletters/2023-07-02/apple-airpods-plans-hearing-test-body-temperature-cheaper-models-usb-c-ljlfwffu\">latest Power On newsletter</a>, Gurman says that Apple is developing multiple new monitor offerings, some of which are likely to be successors to its Studio Display and Pro Display XDR, and one that could have smart standby features powered by an onboard iOS chip.\r<br />\n\r<br />\nIf Gurman's claim is accurate, it would not be the first time Apple silicon has been used in an external display. Apple already includes a dedicated A13 chip in its existing 27-inch Studio Display, but its functionality is limited to handling camera and speaker features like Center Stage and spatial audio when the display is in use. \r<br />\n\r<br />\nUsing an iOS device chip to power independent smart features when a monitor is idle would be an evolutionary next step, and could possibly rely on an expanded version the new <a href=\"https://www.macrumors.com/2023/06/05/ios-17-standby-mode/\">Standby feature in iOS 17</a>, which turns a charging iPhone in horizontal orientation into a home hub with full-screen widgets. As for when we could see the smart monitor, Gurman says not to expect a release until 2024 \"at the earliest.\"<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/03/gurman-apple-monitor-smart-home-display/\">Apple Is Reportedly Working on a Mac Monitor That Becomes a Smart Home Display When Idle</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-is-reportedly-working-on-a-mac-monitor-that-becomes-a-smart-home-display-when-idle.2394917/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"87d4ef71c11305d58361a6464a18377c0de6af5e1e2555f46993df95cea1f315","category":"Apple"}