{"title":"Interactive Coupling Relaxation of Dipoles and Wagner Charges in the Amorphous State of Polymers Induced by Thermal and Electrical Stimulations: A Dual-Phase Open Dissipative System Perspective.","link":"https://www.preprints.org/manuscript/202410.1268/v1","date":1729074622000,"content":"This paper addresses the author’s current understanding of the physics of interactions in polymers under a voltage field excitation. The effect of a voltage field coupled with temperature to induce space charges and dipolar activity in dielectric materials can be measured by very sensitive electrometers. The resulting characterization methods, Thermally Stimulated Depolarization (TSD) and Thermal-Windowing Deconvolution (TWD), provide a powerful way to study local and cooperative relaxations in the amorphous state of matter that are, arguably, essential to understand the glass transition, molecular motions in the rubbery and molten states and even the processes leading to crystallization. Specifically, the paper describes and tries to explain ‘interactive coupling’ between molecular motions in polymers by their dielectric relaxation characteristics when polymeric samples have been submitted to thermally induced polarization by a voltage field followed by its depolarization at constant heating rate. Interactive coupling results from the modulation of the local interactions by the collective aspect of those interactions, a recursive process pursuant to the dynamics of the interplay between the free volume and the conformation of dual-conformers, two fundamental basic units of the macromolecules introduced by this author in the “Dual-Phase” model of interactions. This model reconsiders the fundamentals of the TSD and TWD results in a different way: the origin of the dipoles formation, induced or permanent dipoles; the origin of the Wagner space charges and of the Tg, transition; the origin of the TLL manifestation; the origin of the Debye elementary relaxations’ compensation or parallelism in a relaxation map; finally,  the Dual-Phase origin of their super-compensations. In other words, this paper is an attempt to link the fundamentals of TSD and TWD activation and deactivation of dipoles that produce a current signal with the statistical parameters of the “Dual-Phase”model of interactions underlying the Grain-Field-Statistics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"87e1aba5e436c4b01bd3ae324065dc565615249d22e699af7bea5af365edc391","category":"Interdisciplinary"}