{"title":"Paramount+ hits 36 million subscribers, will stream sci-fi movie Infinite","link":"https://arstechnica.com/?p=1763196","date":1620330622000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/infiniteset-800x478.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/infiniteset.png\">Enlarge</a> <span>/</span> Actor Mark Wahlberg confers with director Antoine Fuqua on the set of <em>Infinite</em>. (credit: <a href=\"https://www.instagram.com/p/B2kXPY9hqbP/?utm_source=ig_embed\">Mark Wahlberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>On the heels of revealing that it has reached just shy of 36 million subscribers, streaming service Paramount+ has announced that it will stream at least one original movie each week, including the long-delayed Mark Wahlberg and Chiwetel Ejiofor sci-fi film <em>Infinite</em>.</p>\n<p>In March, the streaming service <a href=\"https://arstechnica.com/gadgets/2021/01/paramount-will-replace-cbs-all-access-on-march-4/\">CBS All Access was rebranded as Paramount+</a>, and it got a huge injection of new content directly resulting from the merger between parent company CBS and Viacom. ViacomCBS, the resulting new conglomerate, owns a vast swath of Hollywood brands and studios, including CBS, Showtime, MTV, BET, Comedy Central, Paramount Pictures, and others. The desire to show all of that content under one streaming platform's roof was reportedly a key driver of the merger.</p>\n<p>Given that CBS All Access was one of traditional Hollywood's first forays into a streaming service to compete with previous platforms from tech companies like Netflix and Amazon, the service represented a big shift. Since then, we've been wondering whether the rebranding has propped up the streaming service, which before the merger was best known for its various <a href=\"https://arstechnica.com/tag/star-trek/\"><em>Star Trek</em></a> reboot series.</p></div><p><a href=\"https://arstechnica.com/?p=1763196#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1763196&amp;comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"87e8d3c0cfce33676ed48849baac210d2fab539efc3b756a2080279a81b199df","category":"Tech"}