{"title":"เหตุเกิดจากจีนคุมเข้มวงการไอดอล iQiyi ระงับผลิตรายการค้นหาไอดอล ยกเลิกระบบโหวต","link":"https://www.blognone.com/node/124553","date":1630552425000,"content":"<div><div><div><p>จากประเด็นรัฐบาลจีน<a href=\"https://www.blognone.com/node/124475\">คุมเข้มวงการไอดอล แบนการจัดอันดับชาร์ตความนิยม</a> กระทบรายการเซอร์ไววัลค้นหาไอดอล ล่าสุด iQiyi แพลตฟอร์มสตรีมมิ่งรายใหญ่ของจีนประกาศระงับการถ่ายทำรายการค้นหาไอดอลในช่วง 2-3 ปีข้างหน้า และจะยกเลิกระบบโหวตด้วย</p>\n<p>Yu Gong ซีอีโอของ iQiyi พูดในการประชุมที่จัดขึ้นในธีม \"ไม่มีพื้นที่สำหรับศิลปินที่ผิดจรรยาบรรณ\" จัดโดย China TV Artists Association หรือ สมาคมศิลปินโทรทัศน์จีน โดยเขาระบุว่า นโยบายใหม่เป็นไปเพื่อให้สอดคล้องกับระเบียบข้อบังคับของรัฐบาล</p>\n<p>ที่ผ่านมา iQiyi ผลิตซีรีส์การแข่งขันไอดอลที่ได้รับความนิยมสูงไม่ว่าจะเป็น Idol Producer และ Youth With You ซึ่งแต่ละตอนมีผู้ชมหลายล้านคน สร้างฐานแฟนคลับให้ไอดอลหน้าใหม่ ตามรายงานผลประกอบการของ iQiyi ระบุว่ารายการ Idol Producer มีผู้ชม 2.83 พันล้านครั้ง และจากรายงานจากบริษัทที่ปรึกษา ENdata มูลค่าตลาดไอดอลของประเทศสูงถึง 1 แสนล้านหยวน (15.5 พันล้านดอลลาร์สหรัฐ) ในปี 2020</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e159257037c444cf5feecfe097c29c2f.png\" /><br />\nภาพโปรโมทรายการ Idol Producer จาก <a href=\"https://www.iqiyi.com/kszt/oxlxs.html\">iQiyi</a></p>\n<p>กฎของการแข่งขันไอดอลคือผู้ที่ได้ผลโหวตจากแฟนๆ สูงสุดถึงจะสามารถเข้ารอบไฟนอลเพื่อเดบิวต์ได้ การโหวตยังเป็นส่วนหนึ่งของแผนการตลาดสำหรับ iQiyi และแบรนด์สนับสนุน เช่นเปิดให้โหวตด้วยการแสกนคิวอาร์โค้ดข้างกล่องนมแบรนด์สนับสนุน เกิดปรากฏการณ์แห่ซื้อนมเพื่อโหวตเป็นหลายล้านกล่อง</p>\n<p>แต่ประเด็นที่ทำให้รัฐบาลจีต้องมาคุมเข้มวงการไอดอลมาจากพฤติกรรมไอดอลอย่างเช่น Zheng Shuang โดนข้อหาหลบเลี่ยงภาษี และ Kris Wu โดนข้อหาข่มขืน</p>\n<p>ที่มา - <a href=\"https://kr-asia.com/iqiyi-suspends-production-of-idol-competitions-as-china-cracks-down-on-obsessive-fan-culture\">KrAsia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/iqiyi\">iQiyi</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/streaming\">Streaming</a></div><div><a href=\"/topics/idol\">Idol</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"87eb0eb2a563620bf8da366ff7164388dd6872ad88f69ca50d2ae012d03f8d03","category":"Thai"}