{"title":"Analysis of spatiotemporal variations in b-values before the 6.8-magnitude earthquake in Luding, Sichuan, China, on September 5, 2022","link":"http://link.springer.com/10.1007/s11600-024-01369-5","date":1733011200000,"content":"<h3>Abstract</h3>\n                    <p>Using the earthquake catalog provided by the Sichuan Earthquake Network Center, spatial and temporal <em>b</em>-value variations were calculated for in regional and local scales based on assessing the completeness of the earthquake catalog and declustering. The results show that (1) <em>b</em>-value temporal variations in regional scale ranged from 0.689 to 1.169, with a mean value of 0.928; while, the local-scale temporal variations ranged from 0.694 to 1.223, with a mean value of 0.925. The <em>b</em>-values in the study area were below the mean value before the moderate and large earthquakes occurrence, and all <em>b</em>-values exhibited the anomalous feature of a sudden decrease before the earthquake low peak rise after the earthquake. (2) The seismotectonic characteristic of the area is the higher value of slip rate of the NW section of Xianshui River Fault Zone; therefore, a large amount of stress was accumulated in the Moxi section of the SE section, leading to a <em>M</em> = 6.8 earthquake in Luding. Before the earthquake, the study area has a low <em>b</em>-value area. The <em>b</em>-value decreased within a short period after the earthquake, dividing the area into asperity. This area still has a future risk of moderate to strong earthquakes. (3) The error in the <em>b</em>-values for most of the earthquakes in the regional and local scales regions is between 0.05 and 0.15, and only individual grid points have larger <em>b</em>-value errors (&gt; 0.2), indicating high confidence in the information. In addition, when conducting a <em>b</em>-value study, choosing a suitable study area is important to avoid missing the <em>b</em>-value anomaly area.</p>\n                    <span>\n                      <h3>Graphical abstract</h3>\n                      <p>\n      <span>\n                        <span>\n                          <img src=\"https://static-content.springer.com/image/MediaObjects/11600_2024_1369_Figa_HTML.png\" />\n                        </span>\n                      </span></p>\n                    </span>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"87f0c1bdf29015f7dd4ccf4ede6e35db77d6c1952f011e122606acde22c1ef05","category":"Environment"}