{"title":"Carbon Dots for Future Prospects: Synthesis, Characterizations and Recent Applications: A Review (2019&ndash;2023)","link":"https://www.preprints.org/manuscript/202404.0245/v1","date":1712154563000,"content":"Nanotechnology sparks discussions and concerns about the impacts of new nanomaterials on health and the environment. It holds importance in various domains due to its unique struc-tures. Carbon dots (C-dots) are versatile nanomaterials with applications in bioimaging, sensing, catalysis, polymers, solar cells, and more. They offer desirable characteristics such as stability, cost-effectiveness, biocompatibility, and high photoluminescent quantum yield. C-dots have the potential to replace expensive fluorophores in solar cells. They are catego-rized as carbon quantum dots, graphene quantum dots, and carbonized polymer dots. C-dots have outstanding optical and photoelectric properties with low toxicity. Bottom-up and top-down approaches are used for the synthesis of carbon dots (CDs), with each method im-pacting their physicochemical characteristics. The choice of synthesis method depends on de-sired properties and application requirements. Researchers combine these methods and ex-plore new approaches to enhance synthesis efficiency and tailor CD properties. CDs have di-verse chemical structures with modified oxygen, polymer-based, or amino groups on their surface. Various characterization methods such as HRTEM, XPS, and optical analysis (PL, UV) are used to determine CD structure. Carbon dots (CDs) are cutting-edge fluorescent nano-materials with remarkable qualities such as biocompatibility, low toxicity, environmental friendliness, high water solubility, and photo-stability. They are easily adjustable in terms of their optical properties, making them highly versatile in various fields. CDs find applications in bio-imaging, nanomedicine, drug delivery, solar cells, LEDs, photo-catalysis, elec-tro-catalysis, and other related areas.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"880ce1ddc02b6b70c8fcfe5fe5a9813eb6b5c12fbd2318cc57f03601a73e7a32","category":"Interdisciplinary"}