{"title":"Can Multiscale Thermal Infrared Imaging Help Validate and Monitor Water Stress in Alluvial Forests?","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2710?af=R","date":1725260400000,"content":"<h2>ABSTRACT</h2>\n<p>Alluvial forests are sensitive to drought induced by climate change and exacerbated by altered flow regimes. Our ability to detect and map their sensitivity to drought is crucial to evaluate the effects of climate change and adjust management practices. Therefore, we explore the potential of multiscale thermal infrared imagery (TIR) to diagnose their sensitivity to droughts. In summer 2022, we sampled leaves and phloem on <i>Populus nigra</i> trees from two sites with contrasted hydrological connectivity along the Ain River (France) to investigate the seasonality of water stress and act as ground truth for airborne TIR images. To map forest sensitivity to drought, we used TIR data from four airborne campaigns and Landsat archives over a larger spatial and temporal extent. Field data showed that stress conditions were reached for both sites but were higher in the site with lower groundwater connectivity, which was also the case for individual tree crown temperatures. At the forest plot scale, canopy temperature was linked to forest connectivity for two of four TIR campaigns, with higher values in the more degraded reaches. Landsat data were used to locate the areas of the riparian forest impacted by a historical drought event and monitor their recovery and proved useful to identify trends. TIR data showed promising results to help detect and map tree water stress in riparian environments. However, stress is not detected in all TIR campaigns, demonstrating that one-shot TIR acquisitions alone are not enough to diagnose stress and complementary in-field eco-physiological measurements are necessary.</p>","author":"Julien Godfroy, \nPauline Malherbe, \nFlavie Gerle, \nBaptiste Marteau, \nPierre Lochin, \nSara Puijalon, \nJérôme Lejot, \nAntoine Vernay, \nHervé Piégay","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"880ec0cec959c09df935fd0619b3fb098265bf538643cf9ea362dca99ff74cd0","category":"Environment"}