{"title":"Fossil evidence of photosynthesis gets a billion years older","link":"https://arstechnica.com/?p=1993473","date":1704307328000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Screenshot-2024-01-03-at-12.57.29%E2%80%AFPM-800x524.png\" alt=\"Greyscale image of two pill-shaped objects, each composed of many layers folded over each other.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Screenshot-2024-01-03-at-12.57.29%E2%80%AFPM.png\">Enlarge</a> <span>/</span> At left, one of the fossils, with stacks of thylakoids highlighted using yellow bars; at right, a higher magnification of the end of the cell. (credit: Demoulin, et. al.)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It's not an exaggeration to suggest that the most significant event on Earth was the evolution of photosynthesis. The ability to harvest energy from light freed life from the need to scavenge energy from its environment. With this new capability, life grew in complexity and invaded new environments, ultimately reshaping the Earth.</p>\n<p>For such a pivotal event, we know remarkably little about it. Tracing the presence of oxygen in the atmosphere suggests photosynthesis evolved at least 2.4 billion years ago, although the rise in oxygen levels <a href=\"https://arstechnica.com/science/2023/05/the-complicated-history-of-how-the-earths-atmosphere-became-breathable/\">turns out to be impressively complicated</a>. Tracing the variations of present-day genes places photosynthesis' origin at about 3 billion years ago. That timing is similar to the origin of the photosynthetic cyanobacteria, which both continue to live independently and have been incorporated into plant cells as chloroplasts.</p>\n<p>What we don't have is clear evidence of photosynthetic cells of similar age. A few microfossils with similarities to cyanobacteria have been identified, but it's impossible to determine whether they were making the proteins that power photosynthesis. Now, new fossils described by a team at the University of Liège push unambiguous evidence of photosynthesis back over a billion years to 1.7 billion years ago.</p></div><p><a href=\"https://arstechnica.com/?p=1993473#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993473&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8826cdff6db5eb79e8a92c018b47e8c760e8ca88c3670c3f252644b5dc2f4bcb","category":"Tech"}