{"title":"Strategies to improve delivery of equitable and evidence-informed care for pregnant and birthing people with a substance use disorder in acute care settings: A scoping review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300183","date":1710770400000,"content":"<p>by Carla King, Gregory Laynor, Jennifer McNeely, Adetayo Fawole, Matthew Lee, Mishka Terplan, Sugy Choi</p>\r\n\r\nThis protocol outlines a proposed scoping review to characterize evidence on implementation and quality improvement (QI) strategies that aim to improve equitable, evidence-informed care delivery for pregnant and birthing people with substance use disorder (SUD) in acute care. Untreated SUD during pregnancy is associated with an increased risk of overdose and severe maternal morbidity. Acute care settings are one important place to deliver equitable, evidence-informed clinical care. While clinical practice guidelines for substance use treatment and care of pregnant and birthing people with SUD exist, there are gaps in implementation. Our population of interest is pregnant and birthing people with SUD in an acute care setting. We will include US-based studies that describe or evaluate implementation or QI strategies, including experimental, observational, and descriptive studies published from 2016 to 2023. The proposed scoping review will be conducted in accordance with JBI methodology for scoping reviews and registered at OSF (registration number: BC4VZ). We will search MEDLINE (PubMed), CINAHL Complete (EBSCO), Scopus (Elsevier), and APA PsychInfo (Ovid) for published studies. Conference proceedings and Perinatal Quality Collaborative websites will be searched for grey literature. Two reviewers will independently screen then extract studies that meet inclusion criteria using a data extraction tool. The completion of this scoping review will help illuminate strengths and gaps in research and practice that aim to inform substance use treatment and care in acute care settings for pregnant and birthing people with SUD.","author":"Carla King","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8827a65638e7643949efeac44a054d7471f3a366007de0d3c01289d9f7cc5d6b","category":"Interdisciplinary"}