{"title":"iOS 18: All the Rumors and Known Features So Far","link":"https://www.macrumors.com/2023/11/23/ios-18-rumors/","date":1700751059000,"content":"iOS 18 is still over seven months away from being announced, but there are already a few rumors and expectations for the software update. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-18-Mock-Feature-Baubles.jpg\" width=\"2250\" height=\"1266\" />\r<br />\niOS 18 should be announced at Apple's annual developers conference WWDC next June, and released to all users with a compatible iPhone in September. Below, we recap all of the rumors and information pertaining to the update so far.\r<br />\n\r<br />\n<h2>\"Major New Features\"</h2>\r<br />\nIn his newsletter this month, <em>Bloomberg</em>'s Mark Gurman said <a href=\"https://www.macrumors.com/2023/11/13/apple-says-ios-18-ambitious-compelling/\">iOS 18 could be a \"relatively groundbreaking\" update</a> with \"major new features and designs,\" although he did not share many specific details. Gurman added that Apple's senior management has internally described its upcoming operating systems as \"ambitious and compelling.\"\r<br />\n\r<br />\n<h2>Smarter Siri</h2>\r<br />\nGurman said that <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">iOS 18 will feature generative AI technology</a> that \"should improve how both Siri and the Messages app can field questions and auto-complete sentences.\" He said Apple has explored new generative AI features for other apps across its platforms, including Apple Music, Pages, Keynote, and Xcode.\r<br />\n\r<br />\n<em>The Information</em> reported that Apple plans to <a href=\"https://www.macrumors.com/2023/09/06/ios-18-siri-improvements/\">incorporate large language models into Siri</a> to let users automate complex tasks, a feature that would involve deeper integration with the Shortcuts app. The report said this feature is expected to be released in an iPhone software update coming next year, which could be iOS 18.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iOS-18-Mock-Siri-Feature-Baubles.jpg\" width=\"2250\" height=\"1266\" />\r<br />\nGenerative AI surged in popularity last year when OpenAI released <a href=\"https://www.macrumors.com/2023/11/22/chatgpt-app-voice-chat-free-to-all/\">ChatGPT</a>, a chatbot that can respond to questions and other prompts. Google and Microsoft released similar chatbots earlier this year, as more companies race into the space. The chatbots are trained on large language models, allowing them to respond like a human.\r<br />\n\r<br />\nApple has publicly confirmed its interest in generative AI, and it has mentioned the technology <a href=\"https://www.macrumors.com/2023/06/02/apple-seeking-generative-ai-engineers-for-ar-vr/\">in job listings</a> posted on its website in recent months.\r<br />\n\r<br />\n\"We've been working on generative AI for years and have done a lot of research,\" said Apple CEO Tim Cook, in an <a href=\"https://www.forbes.com/sites/davidphelan/2023/09/29/apples-tim-cook-talks-about-ai-apps-vision-pro-and-iphone-gaming/\">interview with <em>Forbes</em></a> in September. \"And we're going to approach it really thoughtfully and think about it deeply, because we're fully aware of the not-good uses that it can have, and the issues around bias and hallucination and so forth.\"\r<br />\n\r<br />\n<h2>Improved Texting With Android Users</h2>\r<br />\nEarlier this month, Apple announced that it will <a href=\"https://www.macrumors.com/2023/11/16/apple-to-adopt-rcs-messaging-standard/\">finally support the cross-platform messaging standard RCS</a> in the Messages app on the iPhone starting \"later next year,\" so it will likely be an iOS 18 feature based on this timeframe.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/07/General-Apps-Messages.jpg\" width=\"2500\" height=\"1407\" />\r<br />\nRCS support should result in several improvements to the default messaging experience between iPhones and Android devices:<ul>\r<br />\n <li>Higher-resolution photos and videos</li>\r<br />\n <li>Audio messages</li>\r<br />\n <li>Typing indicators</li>\r<br />\n <li>Read receipts</li>\r<br />\n <li>Wi-Fi messaging between iPhones and Android devices</li>\r<br />\n <li>Improved group chats, including the ability for iPhone users to leave a conversation that includes Android users</li>\r<br />\n <li>Improved encryption compared to SMS</li>\r<br />\n</ul>These features are already available for iPhone-to-iPhone conversations with blue bubbles, via iMessage, and many of the features are also available in third-party messaging apps, such as WhatsApp and Telegram. RCS support on the iPhone will extend the features to green bubbles in the built-in Messages app, providing for a much better iPhone/Android messaging experience compared to the current SMS standard.\r<br />\n\r<br />\nRead our <a href=\"https://www.macrumors.com/guide/rcs/\">guide about Apple implementing RCS on the iPhone</a> for additional details.<br />This article, \"<a href=\"https://www.macrumors.com/2023/11/23/ios-18-rumors/\">iOS 18: All the Rumors and Known Features So Far</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-18-all-the-rumors-and-known-features-so-far.2411801/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"882b2e8e168de38cccf42189a65e81fb359f9a1a412fb504ada75efa40748c73","category":"Apple"}