{"title":"57 In vitro degradation kinetics of protein and starch from equine feedstuffs (corn, beet pulp, oat hulls, soybean meal, whey, timothy, and alfalfa hay)","link":"https://academic.oup.com/jas/article/102/Supplement_3/211/7757479?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Meaningful progress can be made in the field of equine nutrition through improved feed characterization and the development of in vitro nutritional models to describe nutrient degradation. The objective of this study was to assess at which time point macronutrient degradation reached plateau when equine feedstuffs were digested using a static two-step enzymatic digest. Prior to addition of any enzymes, 10 g of each ingredient was weighed in triplicate into digestion vessels and hydrated with 50 mL water. To initiate gastric digestion, 60 mL of 0.1M hydrochloric acid-pepsin solution (pH 2) was added to the digestion vessels and incubated for 2 h at 39℃ under constant mixing. The liquid fractions of the digestions were sampled at 0, 5, 10, 20, 30 60, 90 and 120 min. Post-gastric digestion, samples were neutralized with 1 M sodium hydroxide and raised to a pH of 6.8. To initiate small intestinal digestion, 42 mL of a pancreatin-phosphate buffer (pH of 6.8) was added to the digestion vessels and incubated for 18 h at 39℃ under constant mixing. The liquid fractions of the digestions were sampled at 0, 5, 10, 20, 30 60, 90, 120, 150, 180 min and thereafter hourly up until the end of digestion (1,020 min). Liquid samples were analyzed for glucose via GOPOD kit to determine starch degradation and crude protein via combustion (LECO) and o-phthalaldehyde assay to determine protein degradation. A modified Chapmans-Richard (first order kinetics) model was fit to the time point data to determine the immediately soluble fraction, the degradable fraction, the degradation rate (K<sub>d</sub>) of the degradable fraction, and the undegradable fraction (from the plateau point) of each ingredient. The rate and plateau were estimated for each ingredient by nonlinear regression procedures, that included a boundary of ≤ 100% for the plateaus (Table 1). Corn did not reach a plateau for glucose released; as such, the kinetic model could not be fit to the data points. The ingredients with the greatest and least rates of starch degradation were alfalfa hay (5.36 %/min) and oat hulls (0.11 %/min), respectively. The ingredients with the greatest and least rates of protein degradation were oat hulls (0.379 %/min) and whey (0.004 %/min), respectively. These preliminary results will be used to adjust the in vitro protocol used herein, as it is part of a larger project aiming to characterize the degradation of a wider collection of equine feedstuffs, with these degradation parameter profiles being used as inputs to a mechanistic digestion model. This combination of in vitro techniques and modelling will be advantageous in optimizing equine nutrition.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"882c12e5e84e686267dd635bd20a999006e19ee50a0a54f8f301b238b6e830ef","category":"Environment"}