{"title":"Patterns of persistence: Genetic and behavioral population complexity of winter flounder amid population declines","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15890?af=R","date":1723030042000,"content":"<h2>Abstract</h2>\n<p>Winter flounder <i>Pseudopleuronectes americanus</i> (Walbaum 1792) are a coastal flatfish species of economic and cultural importance that have dwindled to &lt;15, % of their historic abundance in the southern New England/Mid-Atlantic region of the United States, with evidence indicating near-extirpation of certain local populations. This species exhibits intricate behaviors in spawning and migration that contribute to population complexity and resilience. These behaviors encompass full or partial philopatry to natal estuaries, the generation of multiple pulses of larval delivery, and partial migration. The patterns of genetic diversity within and among estuaries and cohorts presented here carry important implications in understanding the susceptibility to demographic shocks, even if the full extent of genetic diversity within and among winter flounder stocks on the US East Coast remains unresolved. Our findings reveal connectivity between estuaries in Long Island, New York, suggesting the potential for genetic rescue of depleted subpopulations. Family reconstruction and relatedness analysis indicate that split cohorts and migration contingents are not the result of genetically distinct lineages. We found no evidence for genetic structure separating these groups, and in some instances, we were able to detect closely related individuals that belonged to different migratory contingents or cohorts. Characterizing the spatial and behavioral organization of this species at the population level is crucial for comprehending its potential for recovery, not only in terms of biomass but also in reinstating the complex population structure that supports resilience. The search for generality in winter flounder spawning and migration behavior remains elusive, but perhaps the lack of generalities within this species is what has allowed it to persist in the face of decades of environmental and anthropogenic stressors.</p>","author":"Tara E. Dolan, \nKevin A. Feldheim, \nShannon J. O'Leary, \nCatherine M. Fede, \nAnne E. McElroy, \nMichael G. Frisk","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"883297560d533bae3f60a327736f755546b267d5efaadfa27d9f2f4c7fbc1ad5","category":"Environment"}