{"title":"Green Manure and Microbial Inoculation: An Approach for Biocatalytic Phytoremediation of Tebuthiuron in Agricultural Soil","link":"https://www.preprints.org/manuscript/202409.1124/v1","date":1726297890000,"content":"We investigated the potential of Mucuna pruriens and Canavalia ensiformis as phytoremediation candidates for Tebuthiuron (TBT)-contaminated soils. Crotalaria juncea was the bioindicator specie for tebuthiuron and Lactuca sativa used in ecotoxicological bioassays, both analyses aim to verify the herbicide presence in soil samples as TBT is persistent with environmental and health risks due to its tendency to bioaccumulate. We conducted a 140-day greenhouse experiment associated with bioaugmentation by microbial inoculants - solid or liquid. Both C. ensiformis (CE) and M. pruriens (MP) exhibited distinct growth patterns, with MP demonstrating a faster growth rate than CE, evident from its higher growth apex (α = 84.52) and specific growth rate (k = 0.113). While soil samples with microbial inoculants demonstrated significant biomass increase with tebuthiuron absence, the introduction this herbicide notably hindered phytomass production, particularly in MP + TBT treatments. Liquid inoculant notably contributed to biomass accumulation in MP, whereas microbial bioaugmentation did not substantially enhance phytomass in CE under tebuthiuron presence. Furthermore, C. juncea exhibited initially slow development in the reference treatment but displayed accelerated growth and greater height with liquid inoculant compared to solid inoculant. Despite the presence of tebuthiuron, C. juncea in soil with TBT alone reached a maximum height exceeding 100 cm. However, tebuthiuron significantly reduced biomass accumulation in C. juncea, indicating its high sensitivity to this herbicide. Liquid inoculant facilitated the highest dry biomass accumulation in C. juncea, yet the introduction of tebuthiuron led to a considerable reduction in biomass, underscoring the plant's susceptibility to it. While bioaugmentation showed potential in mitigating herbicide phytotoxicity, its efficacy varied among tested inoculants. In bioassays with L. sativa, bioaugmentation with liquid inoculant resulted in a higher final germination index (GI) compared to solid inoculant and the reference treatment. Conversely, soil samples containing only tebuthiuron demonstrated a higher final GI and growth velocity compared to the reference treatment, implying the natural attenuation of toxicity over time. Additionally, previous cultivation of Mucuna pruriens positively influenced the development of test-organism, resulting in a higher GI and growth rate compared to the reference treatment. These findings provide valuable insights for various stakeholders, including the scientific community, industries, and bioengineers. They offer a strong incentive to develop advanced bioremediation strategies to address persistent pesticide contamination, especially in intensive agroecosystems like sugarcane-producing fields. Implementing our biological solution holds the potential to usher in a cleaner and safer era in agriculture, thereby protecting both society and the environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"883b5c8c67b815ff6307b71510ed3bcf62df1db9b45b2e4bbaaf54bbef27ce86","category":"Interdisciplinary"}