{"title":"What do Threads, Mastodon, and hospital records have in common?","link":"https://arstechnica.com/?p=1996063","date":1705427408000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-108436364-800x563.jpg\" alt=\"A medical technician looks at a scan on a computer monitor.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-108436364.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/doctor-analyses-scan-of-aneurism-royalty-free-image/108436364?phrase=medical+scan\">Reza Estakhrian</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It’s taken a while, but social media platforms now know that people prefer their information kept away from corporate eyes and malevolent algorithms. That’s why the newest generation of social media sites like Threads, Mastodon, and Bluesky boast of being part of the \"fediverse.\" Here, user data is hosted on independent servers rather than one corporate silo. Platforms then use common standards to share information when needed. If one server starts to host too many harmful accounts, other servers can choose to block it.</p>\n<p>They’re not the only ones embracing this approach. Medical researchers think a similar strategy could help them train machine learning to spot disease trends in patients. Putting their AI algorithms on special servers within hospitals for \"federated learning\" could keep privacy standards high while letting researchers unravel new ways to detect and treat diseases.</p>\n<p>“The use of AI is just exploding in all facets of life,” said Ronald M. Summers of the National Institutes of Health Clinical Center in Maryland, who uses the method in his radiology research. “There's a lot of people interested in using federated learning for a variety of different data analysis applications.”</p></div><p><a href=\"https://arstechnica.com/?p=1996063#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1996063&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"883bb1d7906f736004c96c2a104fdffe371206926ee52f69c501f8359dfb80f5","category":"Tech"}