{"title":"Almost-unbeatable AI is now a permanent feature of Gran Turismo 7","link":"https://arstechnica.com/?p=1980325","date":1698854969000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/i1phBkeHOoPlsEE-800x450.jpg\" alt=\"Almost-unbeatable AI is now a permanent feature of Gran Turismo 7\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/i1phBkeHOoPlsEE.jpg\">Enlarge</a> (credit: Sony)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Competent AI opponents are the key to a good single-player racing game. And with this week's update, <em>Gran Turismo 7</em> is getting an AI upgrade as Sony rolls out its Sophy AI agent as a permanent feature of the game. The entertainment company tested the waters earlier this year for a few weeks in a limited test, but when the <em>GT7 Spec II</em> update rolls out to consoles tomorrow morning, Sophy will be able to race 340 of the game's cars on nine of its tracks.</p>\n<p>Ideally, you want the AI in a racing game to be good enough that the race is a challenge, but perhaps not quite so unbeatable that it's a fool's errand to try to win.</p>\n<p>That's been harder than it sounds to get right—the older players among us will remember the AI in earlier installments of <em>GT</em>, which mostly stuck to a preprogrammed line with little concern for where you, the human player, wanted to put your car. Microsoft's long-running <em>Forza</em> franchise <a href=\"https://arstechnica.com/gaming/2020/09/war-stories-how-forza-learned-to-love-neural-nets-to-train-ai-drivers/\">actually has its origin in a neural net experiment</a>, and more recently, its developers used each human player to train an AI agent that would populate their friends' games, albeit with <a href=\"https://arstechnica.com/gaming/2014/02/forza-motorsport-5-revisited-ars-talks-to-turn-10/\">imperfect results</a>.</p></div><p><a href=\"https://arstechnica.com/?p=1980325#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980325&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8851f2a1858cf00d30178dda1c9ae9149a41ae09fb8f0958b4843f9fcacd1f9d","category":"Tech"}