{"title":"A mass balance approach for quantifying the role of natural decay and fate mechanisms on SARS‐CoV‐2 genetic marker removal during water reclamation","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11015?af=R","date":1712732400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3560aa9b-ae30-4656-a6e0-0d927e32ff9c/wer11015-toc-0001-m.png\" alt=\"A mass balance approach for quantifying the role of natural decay and fate mechanisms on SARS-CoV-2 genetic marker removal during water reclamation\" />\n<p>The recent SARS-CoV-2 outbreak yielded substantial data regarding virus fate and prevalence at water reclamation facilities (WRFs), identifying influential factors as natural decay, adsorption, light, pH, salinity, and antagonistic microorganisms. However, no studies have quantified the impact of these factors at WRFs. Utilizing a mass balance approach, we assessed the impact of natural decay and fate mechanisms on viral marker removal during water reclamation, through the use of sludge and wastewater viral marker loading estimates.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The recent SARS-CoV-2 outbreak yielded substantial data regarding virus fate and prevalence at water reclamation facilities (WRFs), identifying influential factors as natural decay, adsorption, light, pH, salinity, and antagonistic microorganisms. However, no studies have quantified the impact of these factors in full scale WRFs. Utilizing a mass balance approach, we assessed the impact of natural decay and other fate mechanisms on genetic marker removal during water reclamation, through the use of sludge and wastewater genetic marker loading estimates. Results indicated negligible removal of genetic markers during P/PT (primary effluent (PE) <i>p</i> value: 0.267; preliminary and primary treatment (P/PT) accumulation <i>p</i> value: 0.904; and thickened primary sludge (TPS) <i>p</i> value: 0.076) indicating no contribution of natural decay and other fate mechanisms toward removal in P/PT. Comparably, adsorption and decomposition was found to be the dominant pathway for genetic marker removal (thickened waste activated sludge (TWAS) log loading 9.75 log<sub>10</sub> GC/day); however, no estimation of log genetic marker accumulation could be carried out due to high detections in TWAS.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe mass balance approach suggested that the contribution of natural decay and other fate mechanisms to virus removal during wastewater treatment are negligible compared with adsorption and decomposition in P/PT (<i>p</i> value: 0.904).\nDuring (P/PT), a higher viral load remained in the (PE) (14.16 log<sub>10</sub> GC/day) compared with TPS (13.83 log<sub>10</sub> GC/day); however, no statistical difference was observed (<i>p</i> value: 0.280) indicting that adsorption/decomposition most probably did not occur.\nIn secondary treatment (ST), viral genetic markers in TWAS were consistently detected (13.41 log<sub>10</sub> GC/day) compared with secondary effluent (SE), indicating that longer HRT and the potential presence of extracellular polymeric substance-containing enriched biomass enabled adsorption/decomposition.\nEstimations of total solids and volatile solids for TPS and TWAS indicated that adsorption affinity was different between solids sampling locations (<i>p</i> value: &lt;0.0001).\n</p>","author":"Madeline R. Carine, \nKrishna R. Pagilla","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"885fd6f41e75687fc342a456b3acd08f0583eb332308a749e039329eef6c6126","category":"Environment"}