{"title":"Spotify Reveals Its Plans for the Post-DMA Era of Sideloading in the E.U.","link":"https://newsroom.spotify.com/2024-01-24/the-dma-means-a-better-spotify-for-artists-creators-and-you/","date":1706137881000,"content":"\n<p>Spotify:</p>\n\n<blockquote>\n  <p>For years, even in our own app, Apple had these rules where we \ncouldn’t tell you about offers, how much something costs, or even \nwhere or how to buy it. We know, pretty nuts. The DMA means that \nwe’ll <em>finally</em> be able to share details about deals, promotions, \nand better-value payment options in the EU. And an easier \nexperience for you means good things for artists, authors, and \ncreators looking to build their audiences of listeners, \nconcert-goers, and audiobook-loving fans. What’s more? All of this \ncan now come without the burden of a mandatory ~30% tax imposed by \nApple, which is prohibited under the DMA. </p>\n</blockquote>\n\n<p>Spotify’s assumptions about how sideloading is going to work on iOS are clearly at odds with <a href=\"https://daringfireball.net/linked/2024/01/24/wsj-apple-sideloading\">the description of Apple’s plans</a> from The Wall Street Journal today. The Journal did not state what percentage commission or fees Apple plans to collect, but it sounds like Spotify thinks they’re going to offer an iOS app through which they won’t pay Apple anything at all for in-app transactions. Their blog post has a series of before-and-after screenshots, and the “after” screenshots show a purchasing flow that doesn’t involve any of the warnings or scaresheets Apple has required for the “reader” app entitlement, Dutch dating apps, or the new External Purchase Links entitlement.</p>\n\n<p>Spotify even plans to run their own app store, with multiple apps. (It seems unclear if the Spotify app store for iOS would host games and apps from other developers, or only a suite of apps from Spotify itself.)</p>\n\n<p>Spotify more or less assumes they’ll be free from all Apple restrictions and commissions, and feel free to lambast Apple’s policies as “pretty nuts” and “ridiculous”:</p>\n\n<blockquote>\n  <p>It should be this easy for every single Spotify customer \n<em>everywhere</em>. But if you live outside certain markets, you will \ncontinue to encounter frustrating roadblocks because of Apple’s \nridiculous rules. </p>\n</blockquote>\n\n<p>We don’t know Apple’s plans yet, but will soon. But it sure sounds like Apple and Spotify have <em>completely</em> different and utterly incompatible interpretations of what the DMA requires. Seems like one side or the other is in for a big surprise.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/24/spotify-dma-plans\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"887e101209ac8b75e54ca5059f3ea891896bf08e300e3dcacdbd0d97fc87d6d7","category":"Tech"}