{"title":"Examining Dark Triad Traits in Formal Leaders and Their Impact on Employee Workplace Stress: A Comparative Study of Family and Non-Family Businesses","link":"https://www.preprints.org/manuscript/202406.1505/v1","date":1718951156000,"content":"This paper aims to explore differences between the perception of dark traits in formal leaders and levels of workplace stress among employees working in family and non-family businesses. Furthermore, we assess if the company nature (family-owned versus non-family-owned) moderates the relationship between the employees' perception of dark triad traits in their formal leaders and their workplace stress levels. The empirical evidence is provided by a sample of 220 Portuguese employees who responded to a questionnaire that included their perceptions of their formal leaders’ dark triad traits and workplace stress measures. All respondents work in small and medium-sized private companies with no management responsibilities and under formal hieratical supervision. The initial ideas that family firms’ employees perceive higher levels of dark triad traits in their formal leaders than non-family firms’ employees and that they also show higher levels of workplace stress than non-family firms’ employees were confirmed. The results also support the notion that higher perceptions of dark triad traits in formal leaders are related with higher levels of workplace stress of employees and that the company nature significantly moderates this relationship. These findings contribute to the research literature by addressing two aspects under-addressed in the comparison between family and non-family firms, while offering insights on the relationship between dark triad traits in formal leaders and workplace stress levels of employees.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"888aa23804800bca60ed6e933ac1372f57f3bcf347ad755c77c1e529af26a838","category":"Interdisciplinary"}