{"title":"Characterization of Stone Waste Sludge and Preliminary Investigation on Green Materials Based on Traditional Lime Putty","link":"https://www.preprints.org/manuscript/202408.0361/v1","date":1722933514000,"content":"Traditional lime-based materials have considerable potential for use as components of green materials for plastering and finishing building surfaces in both new construction and historic heritage conservation. The paper presents the preliminary results of a research activity aimed at developing pre-packaged products based on Traditional Lime Putty (TLP) by partially replacing natural aggregates with Stone Waste Sludge (SWS), with a low rate of recovery from Apricena limestone production district in Apulia. The mineralogical and chemical analysis carried out by means XRD (X-Ray Diffraction), TG-DTA (Thermo Gravimetry-Differential Thermal Analysis) and hydrochloric acid attack test showed that the SWS consisted of 98.4 % CaCO3 by mass. The particle sizes measured by laser diffraction technique are below 22.5 μm for the 92% by mass of the sample. The high fineness of the stone waste was confirmed by the Blaine specific surface method equal to 9273.79 cm2/gr. The behavior of three fresh mixtures for prepacked coarse plaster, fine plaster, and finishing plaster with 12.90%, 17.94%, and 18.90 by mass of SWS, respectively, was evaluated by spreading test and applicability tests on a perforated ceramic slab. The finishing plaster has the highest consistency value of 235 mm, while the fine plaster and the coarse plaster have values of 205 mm and 155 mm, respectively. The coarse plaster is suitable for the use as base plaster (arriccio) or second layer rendering (tonachino) up to a thickness of approximately 1 cm. Both the fine plaster and finishing plasters can be used for the surfaces finishing with the application of layers of a few millimeters thick.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"888e45267f4ecb6b9352d4b110d20ce012a9b4e7a8ff75b55e38b0fc2815c5d2","category":"Interdisciplinary"}