{"title":"Functional Interaction of KATP and BK Channels With Aquaporin-4 in the U87 Glioblastoma Cell","link":"https://www.preprints.org/manuscript/202407.0645/v1","date":1720523425000,"content":"K+ channels do play a role in cell shape changes observed during cell proliferation and apoptosis. Research suggested that the dynamics of aggregation of Aquaporin-4 (AQP4) into AQP4-OAPs isoforms can trigger cell shape changes in malignant glioma cells. Here, we investigated the relationship between AQP4 and some K+ channels in the malignant glioma U87 line. The U87 cells transfected with the human M1-AQP4 and M23-AQP4 isoforms were investigated for morphology, gene expression of KCNJ8, KCNJ11, ABCC8, ABCC9, KCNMA1, and Cyclin genes by RT-PCR, recording the whole-cell K+ ions currents by patch-clamp experiments. AQP4 aggregation into OAPs increases the plasma membrane functional expression of the Kir6.2 and SUR2 subunits of the KATP channels, and of the KCNMA1 of the BK channels in U87 cells leading to a large increase in inward and outward K+ ion currents. These changes were associated with changes in morphology with a decrease in cell volume in the U87 cells and an increase in the ER density. These U87 cells accumulate in the mitotic and G2 cell cycle. The KATP channel blocker zoledronic acid reduced cell proliferation in either M23 AQP4-OAPs and M1 AQP4-tetramers transfected cells leading to early and late apoptosis, respectively. BK channel sustains the efflux of K+ ions associated with the M23 AQP4-OAPs expression in the U87 cells, but it is downregulated in the M1 AQP4-tetramers cells; KATP channels are effective in the M1 AQP4-tetramers and M23 AQP4-OAPs cells. Zoledronic acid can be effective in targeting pathogenic M1 AQP4-tetramers cell phenotype inhibiting KATP channels and inducing early apoptosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88912b71a36a86866d3adc4a83e73b585e880afb0c17e542ccfb18792ad3c5d5","category":"Interdisciplinary"}