{"title":"47 Application of a ‘high’ or ‘low’ energy matrix to a nutrient-reduced diet supplemented with a novel phytase maintained growth performance and conferred production and sustainability benefit","link":"https://academic.oup.com/jas/article/102/Supplement_2/79/7665078?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This study assessed the capacity of a novel consensus bacterial 6-phytase variant (PhyG) to maintain growth performance of weaned pigs when added to a nutrient-reduced mixed cereal diet with two levels of dietary net energy (NE) reduction applied. A total of 360 newly weaned pigs [Greater York × Norsvin Landrace; initial body weight (BW) 8.4 ± 0.78 kg] were assigned to 60 floor-pens and 5 dietary treatments in a randomized complete block design. There were 2 blocks (weaning group), 6 replicate pens per block, and 6 pigs/pen (3 male, 3 female), in total of 12 replications per treatment. Diets were based on wheat, corn, barley, and soybean meal and were offered to pigs in 2 phases in pelleted form (0–14 and 14–35 d post-weaning). Treatments comprised a nutritionally adequate positive control (PC) and 4 negative control (NC) diets supplemented with PhyG. The NC diets were reduced in digestible P, Ca, Na, and digestible amino acids vs. PC, according to the expected contribution of PhyG added at 1,000 phytase units (FTU)/kg (NC1) or 2,000 FTU/kg (NC2), respectively. Each NC1 and NC2 was formulated at two NE reduction levels, designated ‘low’ and ‘high’ (‘low’: -53 to -65 kcal/kg and ‘high’: -73 to -86 kcal/kg, vs. PC at 1,000 and 2,000 FTU/kg PhyG, respectively). Data were analyzed by ANOVA. Means separation was by Tukey’s HSD test. During both phases and overall (0–35 d), average BW, average daily gain (ADG), average daily feed intake (ADFI), and feed conversion ratio (FCR) in all PhyG-supplemented, nutrient- and NE-reduced treatments, were either not different or were improved compared with the PC. Overall ADG, ADFI, and final BW (d 35) were greater in NC2+PhyG 2,000 FTU/kg ‘low’ vs. PC (466 vs. 424 g, 9.9%, 622 vs. 567 g, 9.7%, and 24.7 vs. 23.1 kg, 6.9%, respectively; <span>P</span> &lt; 0.05). Total feed costs (ingredients price, February 2023) and estimated carbon footprint (CFP; FeedPrint, WUR, The Netherland) per kilogram of BW gain (BWG) were reduced in all PhyG-supplemented, nutrient- and NE-reduced treatments vs. PC. Feed costs saving per kg BWG were greater with ‘high’ than ‘low’ NE reduction applied (-0.013 vs. -0.007 €, respectively, vs. PC) with PhyG at 1,000 FTU/kg, and it was greatest in NC2+PhyG 2,000 FTU/kg with ‘low’ NE reduction (-0.036 € vs. PC). Similarly, the CFP was reduced from 2,068 to 1,840 g CO<sub>2</sub> eq/kg BWG (-11 %) by NC2+PhyG 2,000 FTU/kg with ‘low’ NE reduction vs. PC. In conclusion, the application of a full nutrient matrix with ‘high’ or ‘low’ NE reduction combined with supplementation of PhyG maintained growth performance of weaned pigs and reduced the total feed costs and carbon footprint per kg BW gain, lead to production and sustainability benefits.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"88914ff12a2d704d217e81c6b0a7c555eafd5c413e46592a7563de2caf4928c4","category":"Environment"}