{"title":"Background food influences rate of encounter and efficacy of rodenticides in wild house mice","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14673?af=R","date":1719985341000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/d2c32c1e-ca65-49bd-a5af-53a128b3fcee/jpe14673-toc-0001-m.png\" alt=\"Background food influences rate of encounter and efficacy of rodenticides in wild house mice\" />\n<p>Our findings explain why some toxic baiting programs might fail. To achieve successful control, efforts should be directed at reducing the availability of background food to increase the probability of encounter and uptake of toxic baits. It is important to measure and understand the role of background food on toxic baiting programs to explain variable outcomes and inform strategies for successful bait delivery.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBaiting is widely used in wildlife management for various purposes, including lethal control, fertility control, disease and parasite control, and conditioned aversion programs for many invasive vertebrate species. The efficacy of baiting programs relies on the likelihood that target animals will encounter the bait, consume it and receive an appropriate dose of the active ingredient. However, there has been little focus on encounter rate of toxic baits combined with behavioural aversion, which are likely to be significant factors affecting efficacy.\n\nFollowing optimal foraging theory, the likelihood of an animal encountering and consuming a toxic grain bait should increase in proportion to its availability relative to background food quantity if it is neither more or less detectable or palatable. Furthermore, the probability of consuming toxic baits might also be influenced by bait aversion following ingestion of a non-lethal dose of toxin.\n\nUsing a model system of wild house mice (<i>Mus musculus</i> L.) in mouse-proof enclosures in Australia, we manipulated background food, applied zinc phosphide (Zn<sub>3</sub>P<sub>2</sub>) baits and measured mouse mortality. When background food was scarce, mouse mortality was high, whereas an increasing abundance of background food led to reduced mortality. A scenario modelling random encounters and including bait aversion explained 78% of the variation in observed mortality outcomes and achieved a closer fit to the data than modelling random encounters alone. Mortality rates were predicted to be higher with a higher strength bait, which would overcome behavioural aversion.\n\nEnsuring that animals locate and consume a lethal dose of toxic bait is a critical factor for successful bait delivery and efficacy. This is particularly significant in toxic baiting programs, where sublethal doses can make animals feel sick, leading to a negative association with the bait, and the development of aversion.\n\n<i>Synthesis and applications</i>: Our findings explain why some toxic baiting programs might fail. To achieve successful control, efforts should be directed at reducing the availability of background food to increase the probability of encounter and uptake of toxic baits. It is important to measure and understand the role of background food on toxic baiting programs to explain variable outcomes and inform strategies for successful bait delivery.\n</p>","author":"Peter R. Brown, \nSteve Henry, \nLyn A. Hinds, \nFreya Robinson, \nRichard P. Duncan, \nWendy A. Ruscoe","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"8892bba08da196443e7a4d7811717d8a9c843df9a22a9dca7734d3ccb9031c02","category":"Environment"}