{"title":"Instruments on Hubble in safe mode; NASA trying to understand why","link":"https://arstechnica.com/?p=1809563","date":1635867209000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/09/europa01-hsta-1920x1080-160919-800x450.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/09/europa01-hsta-1920x1080-160919.png\">Enlarge</a> <span>/</span> Hubble Space Telescope above Earth, photographed during STS-125, Servicing Mission 4, May 2009. (credit: <a href=\"https://www.nasa.gov/\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Monday, <a href=\"https://www.nasa.gov/feature/goddard/2021/hubble-remains-in-safe-mode-nasa-team-investigating\">NASA announced</a> that the Hubble Space Telescope's science instruments were in an extended shutdown after problems appeared in late October. The issues arose as failed internal communications caused the science instruments to switch into safe mode twice over a two-day period. Everything outside the instruments is behaving normally, so the telescope is not at risk.</p>\n<p>Earlier this year, Hubble spent <a href=\"https://arstechnica.com/science/2021/07/nasa-successfully-switches-the-hubble-to-backup-hardware/\">an extended period in safe mode</a> due to problems with the power supply that feeds the main payload computer. Because the power supply affected a variety of hardware, the issues were difficult to diagnose.</p>\n<p>In this case, the issues appear to be simpler, at least superficially. The instrument package on the Hubble uses an internal synchronization signal to ensure that everything registers at the same time, allowing instruments to respond to commands in the proper order. On October 23, one of these synchronization signals failed to register, causing all the scientific instruments to enter safe mode. A simple reset of the instruments got everything working again.</p></div><p><a href=\"https://arstechnica.com/?p=1809563#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809563&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8893e33f552a2d98d2dc88ee08bfbda4d76aaac7ffa2ab61ea002e7ebeb114e1","category":"Tech"}