{"title":"Implicit Measurement of Sweetness Intensity and Affective Value based on fNIRS","link":"https://www.preprints.org/manuscript/202410.1823/v1","date":1729751587000,"content":"This study explores the effectiveness of functional near-infrared spectroscopy (fNIRS) as an implicit measurement tool for evaluating sweetness intensity and affective value. Thirty-two participants tasted sucrose solutions at concentrations of 0.15M, 0.3M, and 0.6M, while both their neural responses were recorded with a 24-channel fNIRS system and their self-reported assessments of sweetness intensity and affective value were collected. The neural fNIRS data were converted into oxygenated hemoglobin (HbO) and deoxygenated hemoglobin (HbR) concentrations using the modified Beer-Lambert Law, and analyzed through univariate activation analysis and multivariable decoding analysis to identify neural activation patterns associated with sweetness perception. The results showed significant activation in the dorsolateral prefrontal cortex (dlPFC) and orbitofrontal cortex (OFC) in response to varying levels of sweetness intensity and affective value, with channels 8, 10, 12, 13, 14, 15, and 17 consistently activated across all sucrose concentrations. As sweetness concentration increased from 0.15M to 0.6M, the number of significantly activated channels rose from seven to eleven, indicating stronger and more widespread neural responses corresponding to higher sweetness intensity. The multivariable decoding analysis further demonstrated the capability of fNIRS in accurately distinguishing positive affective responses, with up to 72.1% accuracy. The moderate positive correlation between explicit self-reports and implicit fNIRS data regarding sweetness intensity further supports the validity of fNIRS as a reliable tool for assessing taste perception. This study highlights the potential of fNIRS in sensory neuroscience, demonstrating its effectiveness in capturing the neural mechanisms underlying sweet taste perception.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88981649b02e53d3021a8dbbd4e62a162fd8d75fb1611457e6d7403f7c46a73c","category":"Interdisciplinary"}