{"title":"Prevalence of vision impairment, diabetic retinopathy and disability in adults 50+ in the occupied Palestinian territories","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003613","date":1727359200000,"content":"<p>by Nahed Mikki, Ian McCormick, Islay Mactaggart</p>\r\n\r\nThe Rapid Assessment of Avoidable Blindness methodology is a population-based survey of vision impairment among the population 50 and above, with optional modules on diabetes, diabetic retinopathy and disability. The first Rapid Assessment of Avoidable Blindness study in the occupied Palestinian territories (oPt) was conducted in 2008. Prevalence of blindness (50+) was 3.4%. 80% of blindness was avoidable. Between July 2018 and April 2019, we completed a nationally-representative follow up survey in oPt using the Rapid Assessment of Avoidable Blindness methodology including the optional modules. We tested distance visual acuity (presenting and pinhole) using a bespoke mobile data collection application. 4223 Palestinians aged 50 years and above were enumerated, of whom 3847 participated (response rate 91.1%). Prevalence of any vision impairment (presenting vision impairment &lt;6/12 in the better seeing eye), blindness (&lt;3/60), severe vision impairment (&lt;6/60 but ≥3/60), moderate vision impairment (&lt;6/18 but ≥6/60) and mild vision impairment (&lt;6/12 but ≥6/18) were 25.8% (95% confidence interval [CI] 23.8–27.8%), 2.6% (1.9–3.2%), 1.4% (1.0–1.8%), 10.2% (9.1–11.2%) and 11.6% (10.3–12.8%), respectively. Avoidable causes of poor vision accounted for 82.4% of blindness, 83.3% of severe vision impairment, 82.0% of moderate vision impairment and 90.2% of mild vision impairment. Diabetes prevalence (reported or suspected based on random blood glucose ≥200 milligrams/decilitre) was 33.8% (32.1–35.5). Half of diabetes participants had diabetic retinopathy and/or maculopathy. Prevalence of disability (reported functional limitations) was 23.8% (21.0–26.5), and higher in women than men. The prevalence of vision impairment and blindness in oPt compared with 2008 was similar. Prevalence of diabetes, diabetic retinopathy and disability were all high, highlighting key areas for public health prioritization among older adults in oPt.","author":"Nahed Mikki","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"88a08ca4c5661fe8d220d3cb7e9897e4f2122713029429b82a94bb283cce4607","category":"Environment"}