{"title":"Bianchi unveils the Impulso Pro, a classic take on fast gravel","link":"https://cyclingtips.com/2021/08/bianchi-unveils-the-impulso-pro-a-classic-take-on-fast-gravel/","date":1628527118000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-7-650x366.jpg\" /></div><h2>Bianchi unveils the Impulso Pro, a classic take on fast gravel</h2><p>\n</p><p>Following the launch of its first carbon gravel bike, <a target=\"_blank\" href=\"https://cyclingtips.com/2020/12/bianchi-moves-upscale-with-new-carbon-arcadex-gravel-bike/\">the Arcadex</a>, Bianchi has now unveiled a second carbon shredder, the Impulso Pro. It’s a bike Bianchi say will “unlock the pure thrill of moving fast on and off-road…the right choice for gravel fondos, competitive riding and high-velocity adventurers.”</p>\n\n\n\n<p>As good as that sounds, Bianchi fans might be most pleased with the more traditional Impulso Pro frame design. Featuring round-ish tubes, a horizontal top tube, and an oversized bottom bracket all weighing in at a claimed 1,100g, the Impulso Pro is as classic looking as the Arcadex is not. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-7-1340x754.jpg\" /><figcaption>The Impulso Pro is meant to be ridden hard! \n\n</figcaption></figure>\n\n\n\n<p>Bianchi says the new Impulso Pro is a bike “with all the hallmarks of Bianchi’s racing pedigree” and with a geometry that provides a “super-responsive and rigid ride.” The frame design backs up this claim, with no eyelets or mudguard mounts insight, a longer and lower geometry (386mm reach, 554mm stack for size 54cm), and a shorter wheelbase compared to Bianchi’s Arcadex, the new Impulso Pro is built for the gravel racer.  </p>\n\n\n\n<p>Although claiming “big clearance, big possibilities” for the new bike, Bianchi has opted for a somewhat limited tyre clearance on the Impulso Pro with a maximum of just 38mm. Another indication Bianchi is taking aim at the gravel racer rider on fast and hard gravel, rather than the go-anywhere 40mm+ clearance found on many gravel offerings. Though most frames will take a larger tire than officially stated, 38mm seems quite small even for a race-oriented gravel bike. Many gravel races these days are well suited to 40mm or larger tire sizes. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-4-1340x754.jpg\" /><figcaption>The Impulso Pro, a classic take on the modern shredder? </figcaption></figure>\n\n\n\n<p>The Impulso Pro is available in two colours, a two-tone, modern take on Bianchi’s iconic Celeste and a light-and-dark green option for the non-celeste fans out there.</p>\n\n\n\n<p>Bianchi currently has just one build option for the Impulso Pro with a Shimano GRX600 1×11 groupset. However, images of the new bike on Bianchi’s website suggest a 2x build option could follow. Perhaps surprisingly, Bianchi is not currently offering an Impulso Pro build with compatriots Campagnolo’s gravel-specific Ekar groupset. The bike is finished with a tubeless-ready wheelset and finishing kit from Velomann and WTB Riddler comp 37mm tyres.</p>\n\n\n\n<p>The Impulso Pro is available now in six frame sizes in 2cm increments from 48 to 58cm. Bianchi has yet to confirm pricing for the new bike. We will update this article as we get pricing information. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-8-1340x754.jpg\" /><figcaption>Celest Bianchi on gravel roads – a classic look in a modern setup</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-6-1340x754.jpg\" /><figcaption>Bianchi says “big clearance, big possibilities” but at 38mm the Impulso Pro’s tyre clearance is a lot less than even the Arcadex’s relatively limited 42mm clearance. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-5-1340x754.jpg\" /><figcaption>The Impulso Pro fork features a visible carbon layup with the iconic Bianchi eagle logo on both colourways. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-3-1340x754.jpg\" /><figcaption>Biacnhi says “The Impulso Pro rear triangle<br />is stiff, giving you a reactive and agile frame,<br />suitable for both sprinting and cruising.”</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-2-1340x754.jpg\" /><figcaption>The Celeste colorway, is there really any other colour for a Bianchi? </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Bianchi-Impulso-Pro-1-1340x754.jpg\" /><figcaption>There is! Bianchi call it the light-and-dark green. </figcaption></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/08/bianchi-unveils-the-impulso-pro-a-classic-take-on-fast-gravel/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"88a0d56e5afd60e837ef3080c237564eb49a69bf3d9dd2fd3b28ca0e6d1b76aa","category":"Cycling"}