{"title":"เบื้องหลังสตรีมมิ่งที่แทบไม่เคยล่ม รู้จัก Open Connect ระบบ CDN ที่ Netflix สร้างใช้เอง","link":"https://www.blognone.com/node/125942","date":1637557401000,"content":"<div><div><div><p>เว็บไซต์ The Verge มีบทความเล่าถึงระบบ content distribution network (CDN) เบื้องหลังของ Netflix ที่ทำให้การดูวิดีโอสตรีมมิ่งของ Netflix ราบรื่น มีปัญหาน้อยมาก แทบไม่เคยล่มครั้งใหญ่ๆ เลย และสามารถรองรับโหลดหนักๆ อย่างการที่คนทั่วโลกแห่กันมาดู Squid Game พร้อมๆ กันได้สบาย (111 ล้านคนในสัปดาห์แรกๆ ที่เริ่มฉาย)</p>\n<p>ระบบ CDN ของ Netflix ที่ชื่อ Open Connect ไม่ใช่ความลับอะไร เพราะทำมานาน 10 ปีแล้ว (เริ่มทำปี 2012) และ<a href=\"https://openconnect.netflix.com/en/\">มีข้อมูลทางเทคนิคบนเว็บไซต์ Netflix เองค่อนข้างละเอียด</a></p>\n<p>Gina Haspilaire หัวหน้าฝ่าย Open Connect ระบุว่าอินเทอร์เน็ตเมื่อ 10 ปีก่อนยังไม่สามารถรองรับทราฟฟิกขนาดใหญ่ได้ดีนัก และเมื่อธุรกิจหลักของ Netflix คือสตรีมมิ่ง ลูกค้าจะยอมจ่ายเงินหรือไม่ ประสบการณ์การใช้งานย่อมมีส่วนสำคัญ บริษัทจึงไม่มีทางเลือกอื่นนอกจากทำระบบ CDN เองแทนการใช้ระบบของผู้ให้บริการอินเทอร์เน็ตในแต่ละพื้นที่ หรือ CDN ของบริษัทอื่น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f455c48943e18565b3e2e9096e186ce7.jpg\" /></p>\n<p><em>หน้าตาเครื่อง Open Connect Appliances (OCAs) ภาพจาก <a href=\"https://openconnect.netflix.com/en/\">Netflix</a></em></p>\n<p>แนวคิดของ Open Connect นั้นเรียบง่าย เพราะเป็นการนำเซิร์ฟเวอร์ของ Netflix ไปวางไว้ตามศูนย์ข้อมูลต่างๆ ทั่วโลก โดยคัดเลือกไฟล์วิดีโอที่ผู้ใช้ในพื้นที่นั้นๆ น่าจะเลือกรับชมมากที่สุด เพื่อเพิ่มโอกาสที่ผู้ใช้จะสามารถโหลดไฟล์ที่ต้องการได้จากภายในเครือข่าย ISP ที่ตัวเองใช้อยู่ โดยไม่ต้องออกอินเทอร์เน็ตภายนอกเลย</p>\n<p>Netflix ให้บริการเซิร์ฟเวอร์เหล่านี้ฟรี และมีทีมงานร่วมดูแลกับแอดมินของ ISP ด้วย ซึ่ง ISP ก็ได้ประโยชน์เพราะช่วยลดค่าทราฟฟิก ลดโหลดทราฟฟิกที่ต้องออกข้างนอกลงมา จุดต่างของ Open Connect กับ CDN ยี่ห้ออื่นๆ คือมันเป็น CDN ของ Netflix เอง มีเฉพาะทราฟฟิกของ Netflix เท่านั้น</p>\n<p><a href=\"https://openconnect.netflix.com/en/appliances/\">ข้อมูลบนเว็บไซต์ Netflix</a> ระบุว่าเซิร์ฟเวอร์เหล่านี้รัน OpenBSD, ใช้ NGINX เป็นเว็บเซิร์ฟเวอร์, ใช้ BIRD จัดการเส้นทางเครือข่าย และมีซอฟต์แวร์ของ Netflix เองคอยจัดการระบบอีกที ตัวสตอเรจเซิร์ฟเวอร์แบ่งเป็น 2 ระดับคือ ใช้ฮาร์ดดิสก์ความจุ 350TB สำหรับงานทั่วไป และรุ่นสตอเรจแฟลช สำหรับหนังที่ได้รับความนิยมสูงๆ โดย Netflix มีซอฟต์แวร์ที่ช่วยย้ายไฟล์จากสตอเรจทั้งสองแบบไปมาให้อัตโนมัติ</p>\n<p>ในแง่การจัดการไฟล์วิดีโอ เซิร์ฟเวอร์หนึ่งเครื่องมีไฟล์วิดีโอของหนังเรื่องหนึ่ง 3 ไฟล์ แบ่งตามคุณภาพบิตเรต หากเครือข่าย ISP นั้นมีปัญหาทราฟฟิก ระบบจะสลับมาไฟล์ที่บิตเรตต่ำกว่าให้อัตโนมัติ เพื่อให้การเล่นวิดีโอไม่สะดุด ผู้ใช้ไม่ต้องเห็นการบัฟเฟอร์ไฟล์ ส่วนการสำรองไฟล์วิดีโอจะทำในช่วงที่ผู้ใช้งานน้อยๆ เพื่อไม่ให้กระทบบริการอื่น และ Netflix มีข้อมูลการรับชมของผู้ใช้ จึงสามารถพยากรณ์ได้ว่าควรนำไฟล์หนังเรื่องใดมาลง CDN</p>\n<p>สถิติของ Netflix ระบุว่ามีเซิร์ฟเวอร์ Open Connect จำนวน 17,000 เครื่องกระจายอยู่ใน 158 ประเทศ ลงทุนไปแล้วกว่า 1 พันล้านดอลลาร์ และยังจะขยายเพิ่มอีกเรื่อยๆ</p>\n<p>ที่มา - <a href=\"https://www.theverge.com/22787426/netflix-cdn-open-connect\">The Verge</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/cdn\">CDN</a></div><div><a href=\"/topics/server\">Server</a></div><div><a href=\"/topics/video-streaming\">Video Streaming</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"88a341af0c909b4466213917328cf7a2b786912af4f4b7646a878ab0ac8533eb","category":"Thai"}