{"title":"The Effect of Glutathione on Recurrence and Progression in Non-Muscle Invasive Bladder Cancer","link":"https://www.preprints.org/manuscript/202407.1764/v1","date":1721717924000,"content":"Background: Glutathione and its related enzymes constitute one of the most important antioxidant defense mechanisms against oxidative stress and cancer formation in the body. Bladder cancer is the second most common urological malignancy after prostate cancer. Oxidative stress plays a significant role in the development and prognosis of bladder cancer. The aim of this study was to examine the effect of glutathione on the prognosis of non-muscle-invasive bladder cancer. \nMethods: The 98 patients with bladder tumors were those with T1G3 pathology who had undergone intravesical Bacillus Calmette-Guérin therapy, while the 30 controls were healthy individuals with no history of transitional cell carcinoma of the bladder. The 128 participants were divided into four groups: Group 1 comprised 41 patients who did not experience recurrence during follow-up, Group 2 included 28 patients who had recurrent tumors, Group 3 consisted of 29 patients who progressed to muscle-invasive stages, and Group 4 was composed of 30 healthy volunteers. Blood samples were collected from all participants. Glutathione levels were measured, and statistical analysis were performed.\nResults: There was a statistically significant difference in reduced glutathione levels among the groups (p &lt; 0.001), attributed to Group 4 exhibiting higher reduced glutathione levels compared to Groups 1, 2, and 3 (p &lt; 0.001). No significant differences were observed in reduced glutathione levels between Groups 1 and 2, Groups 1 and 3, or Groups 2 and 3 (p &gt; 0.999). Total glutathione levels varied significantly among the groups (p &lt; 0.001), with Group 4 having higher levels than Groups 1, 2, and 3 (p &lt; 0.001). However, there were no significant differences between Groups 1 and 2, Groups 1 and 3, or Groups 2 and 3 in terms of total glutathione levels (p = 0.473, p = 0.747, and p &gt; 0.999, respectively). Regarding oxidized glutathione levels, a significant difference was observed (p &lt; 0.001), with Group 4 showing lower levels than the remaining three groups (p &lt; 0.001). No significant differences were found between Groups 1 and 2, Groups 1 and 3, or Groups 2 and 3 in relation to oxidized glutathione levels (p &gt; 0.999, p = 0.171, and p &gt; 0.999, respectively).\nConclusions: The current study revealed that glutathione is a factor influencing the development of new bladder cancer but did not affect its prognosis. Nevertheless, we recommend that future studies with larger bladder cancer patient cohorts should be conducted to comprehensively determine the effect of glutathione on the prognosis of bladder cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88a7d6c9ea0e8de1fed13d99f02e4618021b8a50898db5671aae82fe62ee2d8b","category":"Interdisciplinary"}