{"title":"Impact of an Eight-Week Intervention Program With Thermomix Cooking, Healthy Breakfast and Sufficient Daily Physical Activity on the Health Status of an Obese Adult: A Descriptive Pilot Study","link":"https://www.preprints.org/manuscript/202408.1651/v1","date":1724322982000,"content":"ObjectivesIn increasingly stressful times, many people are increasingly turning to fast food, neglecting to drink enough fluids and often forgoing regular exercise. The fast tempo of everyday life leaves little room for healthy habits, such as cooking at home, which means that a conscious and balanced diet takes a back seat.MethodsA descriptive pilot study was conducted to investigate the effects of an eight-week intervention program. This program included the daily intake of breakfast, cooking at home, adequate fluid intake and daily physical activity. The aim of the study was to evaluate the effects of these measures on the participants' body weight and general health.Results During the 56-day intervention, there was a steady trend towards weight reduction, and at the end of the intervention phase, a significant weight reduction in the test person could be observed. At the end of the intervention, the participant was still 45 years old, measured a body weight of 73.4 kg, which represents a BMI of 25.1 and is classified as slightly overweight. ConclusionThe results of the pilot study demonstrate clearly that the health mix of regular cooking at home, a daily breakfast, a daily physical activity session and sufficient fluid intake can be an effective booster for weight loss in adults. This combination has not only led to a significant reduction in body weight, but has also shown that simple, everyday measures can have a profound effect on health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88ac0a5e0c186b743e9aa262faedef81cbb3838e405842638f912b36dca85125","category":"Interdisciplinary"}