{"title":"108 Early colostrum uptake by the newborn requires prepartum initiation of lactogenesis in ungulate species - Sponsored by EAAP","link":"https://academic.oup.com/jas/article/102/Supplement_3/277/7757438?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Due to anatomical characteristics of ungulate placenta types, immunoglobulins (IG) cannot be transferred via the placenta from the maternal to the fetal circulation during pregnancy. Therefore, passive immunization of the newborn ungulate immediately after birth is crucial for its survival. Colostrum, the first milk produced contains immunoglobulins (IG) as well as greater concentrations of several nutrients and bioactive components to provide specific immunity for the first weeks of life as well as an activation of the digestive tract and metabolism through colostral hormones, growth factors, vitamins, and special nutrients such as oligosaccharides. The uptake of colostrum by newborn calves, piglets, or foals within the first few hours after birth requires the availability of colostrum in a sufficiently liquid form. The formation of pre-colostrum starts days or even weeks before parturition, which allows concentrations of IG and other factors far beyond the concentrations in maternal blood circulation. Pre-colostrum components are partially secreted into the alveolar lumen and partially stored in the lactocytes of the mammary gland. These secretions are characterized by increased viscosity and density, which are difficult to harvest by the newborn. Through lactogenesis the secretion of milk components such as lactose is initiated, which causes a considerable water influx into the mammary secretion through an osmotic gradient between maternal blood and mammary secretion. The typical high concentrations of gestagens, mostly progesterone, inhibit the initiation of lactogenesis during pregnancy. A declining gestagen activity is the key signal to initiate a lactogenic prolactin increase and hence milk secretion. Mechanisms and timing of gestagen withdrawal differ considerably among mammalian species. Most species initiate both parturition and lactation through luteolysis (cattle, goat, pig, cat, dog, rabbit, mouse rat). In some species the placenta takes over the main portion of gestagen production (human, sheep, horse). In human, IG are transferred to the fetus during pregnancy, and the start of colostrum secretion only several days after parturition is no problem. In sheep and horses, gestagen secretion during late pregnancy is provided by the placenta. Both of these species are ungulates, and a delayed start of lactogenesis would be critical for the survival of the newborn. Therefore, the placental steroid secretion is subject to characteristic changes in both species towards the end of pregnancy to allow a timely availability of colostrum immediately after birth. At the end of pregnancy, the placenta of sheep produces estrogens at the expense of progesterone, and in horses the less potent dihydroprogesterone is produced instead of progesterone. A considerable variation in the resulting colostrum composition is likely due to the existing wide range of the interval between the commencement of lactogenesis and parturition or due to local regulatory effects at the level of individual glands.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"88af373a27f2b49ef2f44216359853e5ea20879c0b2549fa3a57c79f32e4b8ff","category":"Environment"}