{"title":"คดี Epic vs Apple ได้ข้อยุติ หลังศาลสูงสุดสหรัฐปฏิเสธไม่รับฟังฎีกา","link":"https://www.blognone.com/node/137707","date":1705455266000,"content":"<div><div><div><p>ความคืบหน้าของคดีฟ้องร้องระหว่าง Epic Games กับแอปเปิล นับตั้งแต่ <a href=\"https://www.blognone.com/node/133545\">ศาลอุทธรณ์ตัดสินเมื่อเดือนเมษายน 2023</a> ว่าแอปเปิลไม่ได้ผูกขาด แต่ต้องเพิ่มช่องทางจ่ายเงินแบบอื่นด้วย <a href=\"https://www.blognone.com/node/134672\">ทั้งฝั่งของ Epic และแอปเปิล (ที่ไม่พอใจคำตัดสินทั้งคู่) จึงยื่นฎีกาต่อศาลสูงสุด (Supreme Court)</a> เพื่อเดินหน้าคดีต่อ</p>\n<p>อย่างไรก็ตาม ศาลสูงสุดของสหรัฐอเมริกามีคำสั่งแล้วว่าจะไม่รับฎีกา (ภาษากฎหมายเรียก Certiorari Denied) ของทั้งสองฝั่ง ทำให้คดีนี้สิ้นสุดลงตามคำสั่งของศาลอุทธรณ์ แอปเปิลต้องยอมให้นักพัฒนาแอพแสดงปุ่มหรือลิงก์เพื่อชี้ไปยังช่องทางจ่ายเงินอื่นได้ ซึ่งผู้สังเกตการณ์หลายคนมองว่าเป็นชัยชนะของแอปเปิลที่ไม่ได้เสียอะไรมากนักในคดีนี้</p>\n<p>Tim Sweeney ซีอีโอและผู้ก่อตั้ง Epic Games ออกมาแสดงความเห็นว่า นี่เป็นความพ่ายแพ้ของนักพัฒนาแอพทุกคน เพราะไม่สามารถใช้กระบวนการยุติธรรมบังคับให้ iOS มีการแข่งขันเรื่องสโตร์และช่องทางจ่ายเงินให้มากกว่านี้ได้ อย่างไรก็ตาม เขาบอกว่าสงครามนี้ยังไม่จบลง เพราะหน่วยงานกำกับดูแลในประเทศอื่นๆ ทั่วโลกกำลังจับตาเรื่องนี้ และออกกฎหมายเพื่อสร้างการแข่งขันให้มากขึ้น</p>\n<p>ที่มา - <a href=\"https://arstechnica.com/tech-policy/2024/01/supreme-court-denies-epic-v-apple-petitions-opening-up-ios-payment-options/\">Ars Technica</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b3b3756ecc420b6187abf7268c6ef2b0.jpg\" /></p>\n<blockquote><p>Now the District Court’s injunction against Apple’s anti-steering rule is in effect, and developers can include in their apps “buttons, external links, or other calls to action that direct customers to purchasing mechanisms, in addition to IAP”.</p>\n<p>— Tim Sweeney (@TimSweeneyEpic) <a href=\"https://twitter.com/TimSweeneyEpic/status/1747280532746936614?ref_src=twsrc%5Etfw\">January 16, 2024</a></p></blockquote>\n<blockquote><p>The fight goes on. Regulators are taking action and policymakers around the world are passing new laws to end Apple’s illegal and anticompetitive app store practices. The European Union’s Digital Markets Act goes into effect March 7.</p>\n<p>— Tim Sweeney (@TimSweeneyEpic) <a href=\"https://twitter.com/TimSweeneyEpic/status/1747280544801419765?ref_src=twsrc%5Etfw\">January 16, 2024</a></p></blockquote>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"88b2c76903798e3cbb9c54a79859f6c4fcad44150e2197d8e2a0f40acd67b302","category":"Thai"}