{"title":"Apple Vision Pro: What do the top button and Digital Crown do?","link":"https://www.macworld.com/article/2227395/apple-vision-pro-digital-crown.html","date":1707218100000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple Vision Pro introduces a whole new system of navigating, using your hands and eyes to manipulate virtual controls—looking, pinching, pulling, and swiping in the air. But there are also a some <em>physical</em> controls you’ll want to master as well.</p>\n\n\n\n<p>Much like the Apple Watch, there’s a single button (called the “top button”) on the upper left, and a digital crown on the upper right. These two controls have multiple different functions depending on where you are in an experience and how you use them. Here’s everything these physical controls do on Apple Vision Pro.</p>\n\n\n\n<h2>Digital Crown</h2>\n\n\n\n<p><strong>Single press:</strong> Opens the home view.</p>\n\n\n\n<p><strong>Press and hold:</strong> Recenter content in your view. Useful if you move around.</p>\n\n\n\n<p><strong>Rotate the crown:</strong> Adjust how much environment you see, or adjust volume. You can look at the environment icon or volume icon while you turn the crown to pick which one you’re adjusting.</p>\n\n\n\n<p><strong>Double-click:</strong> Removes all content and shows your surroundings. Press once again to return to your content.</p>\n\n\n\n<p><strong>Triple-click:</strong> Use the accessibility shortcut. You can set one up in Settings &gt; Accessibility &gt; Accessibility Shortcut.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-volume.jpg?quality=50&amp;strip=all\" alt=\"Vision Pro volume\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-volume.jpg?quality=50&amp;strip=all 980w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-volume.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-volume.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/02/vision-pro-volume.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"980\" height=\"653\" /><figcaption>As you rotate the Digital Crown, look at either the mountain or speaker icon to adjust immersion or volume.</figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Top button</h2>\n\n\n\n<p><strong>Single press:</strong> Open the Capture app, which lets you take spatial photos and videos from within Vision Pro.</p>\n\n\n\n<p><strong>Press and hold:</strong> Use to power on your Apple Vision Pro if it was completely shut down.</p>\n\n\n\n<h2>Both buttons together</h2>\n\n\n\n<p><strong>Press and release both buttons:</strong> Takes a screenshot of your current view.</p>\n\n\n\n<p><strong>Press and hold both buttons: </strong>Force quit a stuck app. Hold them until you see Force Quit Applications and then select the app you wish to force quit.</p>\n\n\n\n<p><strong>Press and hold both buttons (longer):</strong> Keep holding both buttons after Force Quit Applications appears, and eventually a slider will appear to let you power off your device.</p>\n\n\n\n<p><strong>Press and hold both buttons (longest):</strong> After Force Quit Applications and the sliders appear, keep holding down both buttons and the device will force restart. Pressing and holding both buttons for 15-20 seconds to restart is how you’ll get out of a serious system crash situation.</p>\n\n\n\n<h2>Battery connector</h2>\n\n\n\n<p>The only other connector on Apple Vision Pro is for the power cable. It’s a proprietary port that doubles as an on/off switch since the Vision Pro doesn’t have a power button or an internal battery. The Vision Pro’s power cable, which is permanently attached to the external battery, is inserted into the power connector on the left audio strap. According to Apple’s support page, the power cable should be angled slightly upward so that the dot on the power cable aligns with the white outlined dot on the audio strap. </p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"88bef2f18770b7d053b973e119e5eed5bed9170bae0f3169d4072d4d4bbb361f","category":"Apple"}