{"title":"Site Response Analyses with Different Stiffness Profiles and Input Motion Variability","link":"http://link.springer.com/10.1007/s10706-023-02662-8","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>The choice of stiffness profile can be crucial in a site response analysis. This research aims to study site response predictions at the large-scale seismic test site in Lotung, Taiwan, employing three different approaches to choosing the stiffness profile in nonlinear and equivalent linear analyses. These approaches consider point average, layer average, and deposit average stiffness profiles. One strong and one weak earthquake event recorded at the site are simulated with these three stiffness profile approaches. Moreover, the stiffness profiles are tested under sets of seven modified real input motions (selected from the European Strong-Motion Database) at various seismic intensity levels. The results indicate that the different stiffness profiles have a minimal effect on the nonlinear site response predictions, in particular for input motions having a PGA greater than or equal to 0.05 g. The spectral acceleration values and PGA and shear strain profiles from nonlinear site response analyses change negligibly when using different approaches to derive the stiffness profile. In the equivalent linear site response analysis, the spectral acceleration predictions are strongly influenced by the stiffness profile approach, regardless of the PGA level of the input motions. The stiffness profile has a more significant role in equivalent linear site response analysis than in nonlinear site response analysis. Therefore, the point average stiffness profile should be used in equivalent linear site response analysis.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"88cea7c110335e06d88e8b1de5518cb745db34a5fc6d36cb30228c8cb868b830","category":"Environment"}