{"title":"Epigallocatechin gallate regulates the myeloid-specific transcription factor PU.1 in macrophages","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301904","date":1714053600000,"content":"<p>by Manjula Karpurapu, Kavita Kumari Kakarala, Sangwoon Chung, Yunjuan Nie, Amritendu Koley, Patrick Dougherty, John W. Christman</p>\r\n\r\nOur previous research demonstrated that PU.1 regulates expression of the genes involved in inflammation in macrophages. Selective knockdown of PU.1 in macrophages ameliorated LPS-induced acute lung injury (ALI) in bone marrow chimera mice. Inhibitors that block the transcriptional activity of PU.1 in macrophages have the potential to mitigate the pathophysiology of LPS-induced ALI. However, complete inactivation of PU.1 gene disrupts normal myelopoiesis. Although the green tea polyphenol Epigallocatechin gallate (EGCG) has been shown to regulate inflammatory genes in various cell types, it is not known if EGCG alters the transcriptional activity of PU.1 protein. Using Schrodinger Glide docking, we have identified that EGCG binds with PU.1 protein, altering its DNA-binding and self-dimerization activity. <i>In silico</i> analysis shows that EGCG forms Hydrogen bonds with Glutamic Acid 209, Leucine 250 in DNA binding and Lysine 196, Tryptophan 193, and Leucine 182 in the self-dimerization domain of the PU.1 protein. Experimental validation using mouse bone marrow-derived macrophages (BMDM) confirmed that EGCG inhibits both DNA binding by PU.1 and self-dimerization. Importantly, EGCG had no impact on expression of the total PU.1 protein levels but significantly reduced expression of various inflammatory genes and generation of ROS. In summary, we report that EGCG acts as an inhibitor of the PU.1 transcription factor in macrophages.","author":"Manjula Karpurapu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"88d7fbb244cdfa15a1648dd28f3a43d134e5382bf5047e597d69a5cb9c596395","category":"Interdisciplinary"}