{"title":"Longitudinal Analysis of General Surgery Residency Match from 2020 to 2024","link":"https://www.preprints.org/manuscript/202410.1772/v1","date":1729732561000,"content":"Objective: The general surgery match process has changed with the transition to virtual interviews, the use of signaling, and the loss of the USMLE1 scoring. We undertook this study to describe the current state of the surgery match.Design: Describe changes in applicant behavior and characteristics between 2020-2024 and perform a multivariable analysis to measure applicant characteristics that predict obtaining an interview invite.Setting: Applicant-moderated, public database with voluntarily completed survey.Participants: 1117 applicants to general surgery residencyResults: Over the time period, applications submitted per student increased by 32%, from 78.0±3.8 in 2020 to 103±3.2 for all and 26% excluding international medical students (IMGs). The average number of applications submitted by student type - US allopathic (USMD), osteopathic (DO), and IMG - were 75±1.5, 105±4.3, and 159±6.3, respectively. The number of interview invitations (IIs) for US graduates decreased by 31%, from an average of 17.4±0.83 to 13.3±0.60 (p&lt;0.0001). 33% of US applicants received more than 18 IIs. Controlling for all other factors, IIs per applicant decreased (-3.5; p&lt;0.0001), and predictors of the number of IIs included USMLE1 (0.15±0.4), USMLE2 (0.17±0.4) scores, student type and higher class quartile rank (p=0.004), lack of gap years (4.7±2.2, p=0.03), AOA membership (3.1±1.0 p=0.003) and graduating from a top-tiered medical school (2.1, p=0.05). In 2024, USMLE2 had the same predictive weight as the combination of scores compared to the prior years (p&lt;0.0001). Signaled program’s II yield was 68±2%.Conclusions: Over the last five years, substantially more applications per student were submitted, while fewer IIs were received, potentially resulting in poor optimization of candidates matching to programs. Loss of USMLE1 scores made no direct difference in the number of IIs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88d98356a41f1e5469ff1305c604d6f5fa041cae162129b04050210ca1995d0c","category":"Interdisciplinary"}