{"title":"Apple Computer Check Signed by Steve Jobs Expected to Fetch More Than $25,000 at Auction","link":"https://www.macrumors.com/2023/12/04/steve-jobs-signed-radioshack-check-auction/","date":1701729467000,"content":"Steve Jobs memorabilia and remnants from Apple's early days tend to fetch high prices from collectors, and a check to RadioShack signed by Jobs is no exception. <a href=\"https://www.rrauction.com/auctions/lot-detail/348161106800099-steve-jobs-signed-apple-computer-company-check-to-radioshack-july-23-1976/\">Up for auction</a> this week, the check is expected to fetch more than $25,000.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/steve-jobs-check.jpg\" width=\"2000\" height=\"1062\" />\r<br />\nThe check, which is from Apple Computer Company, was filled out by Jobs on July 23, 1976. It is made out for $4.01 and signed \"Steven Jobs.\" The address on the check is the answering service and mail drop off point that Steve Jobs used while Apple was being run out of his parents' garage.\r<br />\n<blockquote>A fascinating check related to one of the great unsung heroes of the early computer boom: RadioShack. The biggest tech innovations of the 20th century are all, in varying degrees, indebted to the Boston-based electronics store. Steve Wozniak, who spent hours roaming the aisles of RadioShack as a teenager, saved up enough money to purchase their pioneering TRS-80 Micro Computer System, which he used to build his notorious 'blue box,' an illegal device that could make free long-distance phone calls. The 'blue box' cemented the first business partnership between Wozniak and Jobs, a duo that managed to make and sell roughly 200 of the boxes for $150 each. Jobs later told his biographer that if it had not been for Wozniak's blue boxes, 'there wouldn't have been an Apple.' In other words: there wouldn't have been an Apple if it had not been for RadioShack.</blockquote>When the check was written, Steve Jobs and Steve Wozniak were working on the Apple-1 computer. 50 of the machines were manufactured and sold to The Byte Shop in Mountain View, California, and approximately 200 Apple-1 computers were made in all.\r<br />\n\r<br />\nAt the time of writing, there have been 21 bids on the check, and the total is up to $22,444. The auction ends on December 6.<div>Tag: <a href=\"https://www.macrumors.com/guide/steve-jobs/\">Steve Jobs</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/04/steve-jobs-signed-radioshack-check-auction/\">Apple Computer Check Signed by Steve Jobs Expected to Fetch More Than $25,000 at Auction</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-computer-check-signed-by-steve-jobs-expected-to-fetch-more-than-25-000-at-auction.2412812/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"88dbe82d0a97399ec6c7fd9f3f098a489c5b4cc56571fc340e239fddc6dbb7e3","category":"Apple"}