{"title":"Giro d'Italia 2021: Stage 8 Preview - breakaway potential","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-stage-8-preview-surely-not-another-breakaway","date":1621013750000,"content":"\n      <p>Stage 8 of the Giro d'Italia returns us to the mountainous profile that have become an iconic facet of the race over decades, posing some threats to the general classification, and the chance of a breakaway win.</p>\n<p>Despite a gruelling 12% kicker with just under 2km to go, stage 7 was dominated by the sprinters. Fernando Gaviria tried an early move after the leg-sapping effort, but Caleb Ewan hunted him down before accelerating past the Colombian to take his second stage win at this year's Giro d'Italia.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\">Giro d'Italia 2021 Guide</a></strong></em></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/T08_GuardiaSanframondi_alt_1024x1024.jpg?v=1621007689\" /></b></p>\n<p><i><span>Giro d’Italia Stage 8 profile </span></i></p>\n<p><span>The trend of alternating flat and mountainous stages continues where again, the record for the longest climb of the 2021 Giro thus far is broken. The stage starts in Foggia and heads west in the direction of Napoli to one of the southernmost points of Italy the race reaches this year.</span></p>\n<p><span>The first climb of the stage is uncategorised but<span> is strenuous </span>at 3.9km and over 6% in average gradient. This could provide a launchpad for the breakaway to form if it hasn’t already. Despite some more steep ramps following, the first 100km go by without a mountain point on offer.</span></p>\n<p><span>The first <span>substantial effort of the day begins</span></span><span> with 70km remaining in the form of the Bocca della Selva.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/T08_S01_BDSelva_1024x1024.jpg?v=1621007737\" /></span></p>\n<p><i><span>Bocca della Selva profile </span></i></p>\n<p><span>The climb is defined by its length rather than its steepness. Following a steady start where the first 10km average less than 4.5%, the steepest pitch of the climb follows before easing again in the final 4.5km. We can expect Ineos to control the climb to reduce but not decimate peloton.</span></p>\n<p><span>The route descends almost exclusively over the next 40km before the final 10km kick uphill again. The final climb only begins in the final 3km, the prior percentages are shallow enough in places to be described as a false flat. However, the final 3km sees the gradient push to around 8% all the way to the finish in <span>Guardia Sanframondi</span>.</span></p>\n<h4><b>Contenders</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032325-163_cab0d5c7-e298-4e91-8262-2ffd87e3913f_1024x1024.jpg?v=1621012921\" /></p>\n<p><em><span>Alberto Bettiol. Photo credit: LB/RB/CorVos/SWpix.com </span></em></p>\n<p><span>We have already witnessed three breakaway wins in the seven stages thus far at the Giro d’Italia. When we consider that the first stage was a time-trial, the breakaway's strike rate is 50% on road stages. Evaluating the parcours and race situation, there is a very real chance that the breakaway prevails yet again. </span></p>\n<p><span>The </span><i><span>maglia rosa</span></i><span> is still held by talented Hungarian Attila Valter and Groupama-FDJ. Although Valter may now aim </span><span>to finish as high in the GC as possible, he’s still not a top contender for the pink jersey. Groupama-FDJ also don’t have the strength in depth to chase the breakaway all day on mountainous terrain. These factors lean towards a breakaway win.</span></p>\n<p><span>A leading GC team such as the Ineos Grenadiers or Deceuninck Quick-Step may like to take things up on the front. However, with a relatively straightforward </span><span>finish compared to some of the later mountain stages it will be difficult for the likes of Egan Bernal to create meaningful separation to any of his rivals. This could also deter the GC teams from aggressively chasing the breakaway all-day.</span></p>\n<p><span>So, with a dead-heat perhaps the most likely outcome in the GC, let’s examine some of the breakaway candidates.</span></p>\n<div></div>\n<p><span>EF Education-Nippo have a genuine podium shot with Britain’s Hugh Carthy, but also boast an array of great stage hunters. None more so than </span><b>Ruben Guerreiro</b><span> who won a stage from the breakaway and the </span><i><span>maglia azzurra</span></i><span> </span><span>last year</span><span>. Guerreiro packs a punch on short, steep climbs and will be one of the favourites if arriving at the finish with others. He didn’t make the stage 6 breakaway which was won by <span>Gino Mäder</span>, but made a move <span>earlier on</span> which was eventually brought in — it appears he won’t be tied to Hugh Carthy’s hip and is allowed to play his own card. </span><b>Alberto Bettiol</b><span> has fantastic legs based on his stage 4 climb to Sestola and is another superb breakaway option for EF.</span></p>\n<p><span>Trek-Segafredo have been on the offensive at the Giro d'Italia thus far, present in multiple breakaways and their GC-man Giulio Ciccone can’t resist attacking on a practically daily basis.</span><b> Bauke Mollema </b><span>was forced to chase onto the breakaway on stage six which sapped his legs, <span>he’s a stage favourite</span> if he’s given a more comfortable journey to the front of the race. </span><b>Gianluca Brambilla</b><span> and </span><b>Jacopo Mosca</b><span> are two more breakaway candidates for Trek.</span></p>\n<p><span>Intermarché-Wanty-Gobert stole the early headlines when Taco van der Hoorn incredibly won from the breakaway days ago. They have been aggressive following that and although there could be too much climbing for a Taco-double, they have plenty of options here. </span><b>Quinten Hermans</b><span> and </span><strong>Rein Taaramäe</strong><span> may venture up the road together again and this time, the punchy finish could suit Hermans more than his Estonian colleague.</span></p>\n<p><span>The Ineos Grenadiers rarely use the breakaway at Grand Tours but if they do </span><b>Gianni Moscon</b><span> is in electric form and will be difficult to beat on the final hill.</span></p>\n<p><span> Deceuninck Quick-Step have multiple options too and if Remco Evenepoel feels comfortable without a full team of helpers around him, </span><b>Remi Cavagna</b><span> and</span><b> Mikkel Frølich Honoré</b><span> are their best breakaway bets. Cavagna hasn’t been seen in the breakaway yet but he can only resist for so long, whilst Honoré is a talented puncher which helped him win a stage at the Itzulia Basque Country Tour not too long ago.</span></p>\n<p><span>Astana Premier-Tech are another team with bullish GC goals, but may allow the likes of <strong>Luis León Sánchez</strong></span><span> or </span><b>Gorka Izagirre</b><span> their chance.</span></p>\n<p><span>Lotto-Soudal and Cofidis are two teams without GC ambitions so they will also look to have presence in the breakaway. </span><b>Harm Vanhoucke</b><span> is a great climber and </span><b>Thomas De Gendt</b><span> will surely have his eyes on the breakaway sooner or later. For Cofidis, </span><b>Nicolas Edet </b><span>and </span><b>Victor Lafay</b><span> could be their best options.</span></p>\n<h4><b>Prediction</b></h4>\n<p>Even though there is over 3,000 metres of climbing to conquer, we think there could be a stalemate in the final among the GC contenders. That leaves the breakaway with stage victory in their grasp and some key GC teams’ domestiques may be allowed up the road. If he’s in the breakaway, <strong>Mikkel Frølich Honoré </strong>is perfectly suited to the parcours and could win in a variety of ways, though he may be on teammate duties throughout. Instead, we're backing <strong>Alberto Bettiol</strong> to win the first Grand Tour stage of his career. He will be eager to make up for the missed opportunity to fight for the <em>maglia rosa</em> days ago.</p>\n<p><em>Cover image: Stuart Franklin/Getty Images</em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"88ddb78e8199fd6e8e5b25300b7d045c54dc5e2925fdf84d13502f67889976da","category":"Cycling"}