{"title":"Can’t use Continuity Camera? Flip some switches","link":"https://www.macworld.com/article/2097311/cant-use-continuity-camera-flip-some-switches.html","date":1697187600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Continuity Camera lets you turn your iPhone into an external video input device for your Mac. The requirements are brief: iOS 16 or later, any iPhone introduced in 2018 or later (the XR era), and any Mac that can run macOS 13 Ventura or later.</p>\n\n\n\n<p>On your iPhone, make sure that <em>Settings</em> &gt; <em>General</em> &gt; <em>AirPlay &amp; Handoff</em> has Handoff enabled and Continuity Camera enabled. On your Mac, when the iPhone is nearby, you can select your iPhone by name in any app that supports standard video input, like FaceTime or Zoom.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?w=1200\" alt=\"Continuity Camera connection message on iPhone\" width=\"600\" height=\"375\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?resize=300%2C188&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?resize=768%2C480&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?resize=1200%2C750&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/10/mac911-continuity-hero-sized.png?resize=1536%2C960&amp;quality=50&amp;strip=all 1536w\" /><figcaption><p>When Continuity Camera is active, you can Pause or Disconnect it. But you can’t force it to start up.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>However, I and many others have seen glitches since the iOS 17 betas appeared, and they still occur with the release version:</p>\n\n\n\n<ul>\n<li>The iPhone doesn’t appear when it’s not plugged in via USB when it should, as Continuity Camera can be used via Wi-Fi or USB.</li>\n\n\n\n<li>When selected, the Continuity Camera iPhone shows within a macOS app, like FaceTime, as a black screen.</li>\n</ul>\n\n\n\n<p>The solution is to flip switches (how frustrating!).</p>\n\n\n\n<ul>\n<li>If you enabled Standby, the side-resting always-on mode starting in iOS 17, try disabling it or toggling it off and on in <em>Settings</em> &gt; <em>Standby</em>.</li>\n\n\n\n<li>Failing that, try toggling Continuity Camera at the setting above.</li>\n\n\n\n<li>If that doesn’t work, try toggling Handoff at that location.</li>\n</ul>\n\n\n\n<p>I found in working through solutions that only the Handoff toggle worked for me. The failure to work as Continuity Camera persisted through restarting my iPhone until I flipped that Handoff switch off and back on. Others have found that Standby toggling does the trick, while still others disabled and re-enabled Continuity Camera.</p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"88efcc843a2eb04fa8365a2c80b249e5675fe56451b07b5e213f8d4d47a54edb","category":"Apple"}