{"title":"Shotgun metagenomic analysis of saliva microbiome suggests <i>Mogibacterium</i> as a factor associated with chronic bacterial osteomyelitis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302569","date":1715004000000,"content":"<p>by Hiroko Yahara, Souichi Yanamoto, Miho Takahashi, Yuji Hamada, Takuya Asaka, Yoshimasa Kitagawa, Kuniyasu Moridera, Kazuma Noguchi, Yutaka Maruoka, Koji Yahara</p>\r\n\r\nOsteomyelitis of the jaw is a severe inflammatory disorder that affects bones, and it is categorized into two main types: chronic bacterial and nonbacterial osteomyelitis. Although previous studies have investigated the association between these diseases and the oral microbiome, the specific taxa associated with each disease remain unknown. In this study, we conducted shotgun metagenome sequencing (≥10 Gb from ≥66,395,670 reads per sample) of bulk DNA extracted from saliva obtained from patients with chronic bacterial osteomyelitis (N = 5) and chronic nonbacterial osteomyelitis (N = 10). We then compared the taxonomic composition of the metagenome in terms of both taxonomic and sequence abundances with that of healthy controls (N = 5). Taxonomic profiling revealed a statistically significant increase in both the taxonomic and sequence abundance of <i>Mogibacterium</i> in cases of chronic bacterial osteomyelitis; however, such enrichment was not observed in chronic nonbacterial osteomyelitis. We also compared a previously reported core saliva microbiome (59 genera) with our data and found that out of the 74 genera detected in this study, 47 (including <i>Mogibacterium</i>) were not included in the previous meta-analysis. Additionally, we analyzed a core-genome tree of <i>Mogibacterium</i> from chronic bacterial osteomyelitis and healthy control samples along with a reference complete genome and found that <i>Mogibacterium</i> from both groups was indistinguishable at the core-genome and pan-genome levels. Although limited by the small sample size, our study provides novel evidence of a significant increase in <i>Mogibacterium</i> abundance in the chronic bacterial osteomyelitis group. Moreover, our study presents a comparative analysis of the taxonomic and sequence abundances of all genera detected using deep salivary shotgun metagenome data. The distinct enrichment of <i>Mogibacterium</i> suggests its potential as a marker to distinguish between patients with chronic nonbacterial osteomyelitis and chronic bacterial osteomyelitis, particularly at the early stages when differences are unclear.","author":"Hiroko Yahara","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"88f14e487c384f7f0ad4acb66fdb30ece816be1a43dddceb1157f255a9a566da","category":"Interdisciplinary"}