{"title":"Hepatic Steatosis is Generated by the Gut Microbiota-Mitochondria Axis via 2-oleolyl Glycerol and Reverted by Functional Foods","link":"https://www.preprints.org/manuscript/202407.0745/v1","date":1720579950000,"content":"Metabolic dysfunction-associated steatotic liver disease (MASLD) is a serious health problem, and recent evidence indicates that gut microbiota plays a key role in its development. It is known that 2-oleoyl glycerol (2-OG) produced by the gut microbiota is associated with hepatic fibrosis, but it is not known whether this metabolite is involved in the development of hepatic steatosis. The aim of this study was to evaluate how a high-fat sucrose diet (HFS) increases 2-OG production through gut microbiota dysbiosis and to identify whether this metabolite modifies hepatic lipogenesis and mitochondrial activity for the development of hepatic steatosis as well as whether a combination of functional foods can reverse this process. Wistar rats were fed HFS diet for 7 mo. At the end of the study, body composition, biochemical parameters, gut microbiota, protein abundance of lipogenic and antioxidant enzymes, measurement of liver 2-OG, and mitochondrial function were assessed in rats and we studied the effect of HFS with functional foods. In humans with MASLD, we analyzed gut microbiota and serum 2-OG. Consumption of HFS diet in Wistar rats caused oxidative stress, hepatic steatosis and gut microbiota dysbiosis, decreasing α-diversity and increased Blautia producta abundance, which increased 2-OG. This metabolite increased de novo lipogenesis through ChREBP and SREBP-1. 2-OG significantly increased mitochondrial dysfunction. Addition of functional foods to the diet modified the gut microbiota, reducing B. producta and 2-OG levels, leading to a decrease in body weight gain, body fat mass, serum glucose, insulin, cholesterol, triglycerides, fatty liver formation, and increased mitochondrial function. In order to use 2-OG as biomarker, this metabolite was measured in healthy subjects or with MASLD and it was observed that subjects with hepatic steatosis II and III had significantly higher 2-OG than healthy subjects, suggesting that the abundance of this circulating metabolite could be a predictor marker of hepatic steatosis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"88faa6d633a5762429c19aa9cb26abae817cbdcf5173c86b828692484653dd00","category":"Interdisciplinary"}