{"title":"Are physiotherapists and occupational therapists following the guidelines for discharge summary?–An analysis of the content of physiotherapists’ and occupational therapists’ discharge summaries and their adherence to stroke guideline recommendations","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308039","date":1725372000000,"content":"<p>by Liss Marita Solbakken, Antje Sundseth, Birgitta Langhammer, Therese Brovold</p>\r\nPurpose <p>Discharge summaries are important tools for communication between health care levels and can ensure continuity of rehabilitation. This study aims to gain insight into the content of discharge summaries written by hospital physiotherapists and occupational therapists regarding patients with stroke, and their adherence to recommended criteria for discharge summaries.</p> Material and methods <p>31 physiotherapy and multidisciplinary discharge summaries, for stroke patients discharged home from hospital with need of follow-up, were included in the study. We employed qualitative content analysis and descriptive statistics to explore and describe the content.</p> Results <p>The physiotherapists and occupational therapists adhered to the recommended criteria for content in varying degree. The main focus for physiotherapists and occupational therapists were description of ADL, sensorimotor and general cognitive functions, they rarely report tolerance to exercise, and the specific cognitive abilities to follow instruction and learn were often omitted. Less focus was put on patients’ experiences and needs during acute stroke, and description of goals were omitted in the physiotherapy discharge summaries.</p> Conclusion <p>While the physiotherapists and occupational therapists complement each other in their assessment of patients and inform the reader about both sensorimotor and cognitive functions and abilities, they omit some of the specific criteria for rehabilitation. Despite the omissions, the information provided is specific to the patients’ function and needs.</p>","author":"Liss Marita Solbakken","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"88fbedec8bf06fbd083c98b5ad34396b78a00a42c6b4b95afe9908cca0b19bba","category":"Interdisciplinary"}