{"title":"Mechanical rheological model on the assessment of elasticity and viscosity in tissue inflammation: A systematic review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307113","date":1721052000000,"content":"<p>by Jotham Josephat Kimondo, Ramadhan Rashid Said, Jun Wu, Chao Tian, Zhe Wu</p>\r\n\r\nUnderstanding the extent of inflammation is crucial for early disease detection, monitoring disease progression, and evaluating treatment responses. Over the past decade, researchers have demonstrated the need to understand the extent of inflammation through qualitative or quantitative characterization of tissue viscoelasticity using different techniques. In this scientific review, an examination of research on the association between elasticity and Viscosity in diseases, particularly as tissue inflammation progresses, is conducted. A review of utilizing mechanical rheological models to characterize quantitative viscoelastic parameters of normal and inflamed tissues is also undertaken. Based on inclusion and exclusion criteria, we identified 14 full-text studies suitable for review out of 290 articles published from January 2000 to January 2024. We used PRISMA guidelines for the systematic review. In the review, three studies demonstrated the criterion used by the researchers in identifying the best rheological model. Eleven studies showed the clinical application of the rheological model in quantifying the viscoelastic properties of normal and pathological tissue. The review quantified viscoelastic parameters for normal and pathological tissue across various soft tissues. It evaluated the effectiveness of each viscoelastic property in distinguishing between normal and pathological tissue stiffness. Furthermore, the review outlined additional viscoelastic-related parameters for researchers to consider in future stiffness classification studies.","author":"Jotham Josephat Kimondo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8901eb9ce7e8ae365f50cc3ca6b179c32f7b2f538a013d8eb777178dc7c7e516","category":"Interdisciplinary"}