{"title":"Insight into low methoxyl pectin enhancing thermal stability and intestinal delivery efficiency of algal oil nanoemulsions","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13670?af=R","date":1720689535000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Algae oil has garnered widespread acclaim due as a result of its high purity of docosahexaenoic acid (DHA) and excellent safety profile. The present study aimed to develop stable nanoemulsions (NEs) systems containing DHA from algae oil through thermal sterilization by combining modified whey protein concentrate (WPC) with low methoxyl pectin (LMP), as well as to investigate the impact of LMP concentration on the thermal stability and the gastrointestinal delivery efficiency of DHA NEs.</p>\n<h2>RESULTS</h2>\n<p>The addition of LMP enhanced the stability of the emulsion after sterilization, at the same time as improving the protective and sustained release effects of DHA in the gastrointestinal tract. Optimal effect was achieved at a LMP concentration of 1% (10 g kg<sup>−1</sup> sample), the stability of the emulsion after centrifugation increased by 17.21 ± 5.65% compared to the group without LMP, and the loss of DHA after sterilization decreased by only 0.92 ± 0.09%. Furthermore, the addition of 1% LMP resulted in a substantial reduction in the release of fatty acids from the NEs after gastrointestinal digestion simulation, achieving the desired sustained-release effect. However, excessive addition of 2% (20 g kg<sup>−1</sup> sample) LMP negatively impacted all aspects of the NEs system, primarily because of the occurrence of depletion effects.</p>\n<h2>CONCLUSION</h2>\n<p>The construction of the LMP/WPC-NEs system is conducive to the protection of DHA in algae oil and its sustained-release in the gastrointestinal tract. The results of the present study can provide reference guidance for the application of algae oil NEs in the food field. © 2024 Society of Chemical Industry.</p>","author":"Yufeng Chen, \nJipeng Gu, \nYi Sun, \nYicheng Ding, \nXuan Yang, \nSiqi Lan, \nJiayue Ding, \nYuting Ding","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8903940676e7946b25e5514e2704859c6f11d13260f3294243289610abd04296","category":"Environment"}