{"title":"KF‐metaweb: A trophic metaweb of freshwater ecosystems of South Korea","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13845?af=R","date":1717857277000,"content":"<h2>Abstract</h2>\n<h2>Motivation</h2>\n<p>The metaweb is a dictionary of nodes and their potential interactions developed for a particular region, focusing on a particular type of ecosystem. Based on the local biodiversity information at different spatial and temporal scales, the regional metaweb can be easily decomposed into local webs. The generated local webs are useful for understanding spatiotemporal variations in ecological interactions in a particular region. In this study, an attempt was made to develop a trophic metaweb for freshwater ecosystems in South Korea, called the KF-metaweb. The metaweb contains 23,074 interactions between 446 taxa collected from 730 studies. This metaweb can be used to understand the spatiotemporal variability of different local food webs and the effects of the environment on food web properties. Furthermore, this is the first metaweb developed for any Asian ecosystem that contains information about many interactions that are unavailable in any other existing database. In addition, this metaweb study enriches our global understanding of ecological interactions.</p>\n<h2>Main Types of Variables Contained</h2>\n<p>The data contained trophic interactions between resources (prey) and consumers (predators).</p>\n<h2>Spatial Location and Grain</h2>\n<p>The mainland of South Korea and Jeju Island.</p>\n<h2>Time Period and Grain</h2>\n<p>2008–2021.</p>\n<h2>Major Taxa</h2>\n<p>Microalgae (belonging to the phyla Cyanobacteria, Bygra, Cryophyta, Myozoa, Ochrophyta, Charophyta, Chlorophyta, Euglenozoa and Mycetozoa), zooplankton (belonging to the phyla Arthropoda and Rotifera), benthic macroinvertebrates (Platyhelmenthes, Annelida, Arthropoda and Mollusca) and fish.</p>\n<h2>Level of Measurement</h2>\n<p>Minimum taxonomic resolution was at the genus level for fish and benthic macroinvertebrates and order level for zooplankton and microalgae.</p>\n<h2>Software Format</h2>\n<p>Excel (*.xlsx).</p>","author":"Sagar Adhurya, \nDa‐Yeong Lee, \nYoung‐Seuk Park","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"89117827dec1a9cb0e103522a4cbc92fa37542127ee526927cebfda5ad9fae01","category":"Environment"}