{"title":"Wine metabolome and sensory analyses demonstrate the oenological potential of novel grapevine genotypes for sustainable viticulture in warm climates","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13832?af=R","date":1724317532000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Genetic breeding is essential to develop grapevine genotypes adapted to warm climates and resistant to pathogens. Traditionally cultivated <i>Vitis vinifera</i> is susceptible to biotic and abiotic stresses. Winemakers and consumers, however, perceive wines from non-<i>vinifera</i> or hybrid cultivars as inferior. In this study, sensory analyses and comprehensive metabolite profiling by targeted and untargeted approaches were used to investigate the oenological potential of wines from grapes of genotypes developed throughout four breeding cycles to improve climate adaptation, sugar contents and berry color.</p>\n<h2>RESULTS</h2>\n<p>Novel genotypes had higher yields and the wines exhibited increased contents of polyphenols, including anthocyanins. Volatile monoterpenes in the wines decreased throughout breeding cycles in the absence of selective pressure. Polyphenol contents were higher in intermediate wines, with hydroxytyrosol contents reaching up to three times reported values. Mouthfeel attributes astringency, leafy taste, flavor and body, and persistency showed significant correlation with untargeted features. Supervised model-based analyses of the metabolome effectively discriminate wines from distinct genetic origins.</p>\n<h2>CONCLUSION</h2>\n<p>Taken together, the results demonstrate the potential of novel grapevine genotypes to a more sustainable viticulture and quality wine production in warm climates. Comprehensive metabolite profiling of the wines reveals that genotype clustering is dependent on the chemical class and that traits not submitted to selective pressure are also altered by breeding. Supervised multivariate models were effective to predict the genetic origin of the wines based on the metabolic profile, indicating the potential of the technique to identify biomarkers for wines from sustainable genotypes. © 2024 Society of Chemical Industry.</p>","author":"Héctor Alonzo Gómez Gómez, \nGuilherme Francio Niederauer, \nIgor Otavio Minatel, \nElisa Ribeiro Miranda Antunes, \nMara Junqueira Carneiro, \nAlexandra Christine Helena Frankland Sawaya, \nMauro Celso Zanus, \nPatrícia Silva Ritschel, \nVera Quecini, \nGiuseppina Pace Pereira Lima, \nMarcia Ortiz Mayo Marques","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"892062be0f39d33ac310c7e08cd15bf6f61c4dea26fe62bd9005e0b73586be3f","category":"Environment"}