{"title":"Nutcracker Syndrome: First Case Causing Left Renal Intraparenchymal Varicose Veins","link":"https://www.preprints.org/manuscript/202409.0320/v1","date":1725418937000,"content":"Purpose: Our aim in this case is to report a new finding regarding Nutcracker syndrome (NCS), which is a variation of the left renal vein. \nMethods: We present a very rare anatomical variant of the left renal vein(LRV), with a preliminary diagnosis made by ultrasound and NCS as a differential diagnosis with computed tomography (CT) and diagnostic CT angiography.\nResults: The patient in our case was a 30-year-old woman with chronic abdominal and flank pain and increased sensitivity in the flank area. Neither hematuria nor proteinuria was detected in the urinalysis. Contrast-enhanced computed tomography(CT) showed that there were two separate LRVs draining the lower and upper poles. It was observed that the vein draining the lower pole narrowed significantly between superior mesenteric artery and abdominal aorta and then continued to widen. This view showed that we were faced with a typical NCS. What made our case different and unique from typical NCS was that it had renal intraparenchymal varicose veins. Treatment of NCS includes open, laparoscopic and robotic surgical repair and endovascular/extravascular stent placement. Treatment of symptomatic NCS includes open, laparoscopic, and robotic surgical repair and endovascular/extravascular stent placement. Except for the presence of hematuria causing severe anemia, deterioration in kidney functions and serious pain, patients are followed conservatively, and our patient is also followed conservatively.\nConclusion: This case we present is the first case accompanied by renal parenchymal varices in the literature.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"893759174864e8571dfa1dcbe3bc7a88ea2c82d15173df9a32673cffd0b972dd","category":"Interdisciplinary"}