{"title":"Transcriptome and metabolome atlas reveals contributions of sphingosine and chlorogenic acid to cold tolerance in Citrus","link":"https://academic.oup.com/plphys/article/196/1/634/7693636?rss=1","date":1718323200000,"content":"<span><div>Abstract</div><span>Citrus</span> is one of the most important fruit crop genera in the world, but many <span>Citrus</span> species are vulnerable to cold stress. Ichang papeda (<span>Citrus ichangensis</span>), a cold-hardy citrus species, holds great potential for identifying valuable metabolites that are critical for cold tolerance in <span>Citrus</span>. However, the metabolic changes and underlying mechanisms that regulate Ichang papeda cold tolerance remain largely unknown. In this study, we compared the metabolomes and transcriptomes of Ichang papeda and HB pummelo (<span>Citrus grandis</span> “Hirado Buntan”, a cold-sensitive species) to explore the critical metabolites and genes responsible for cold tolerance. Metabolomic analyses led to the identification of common and genotype-specific metabolites, consistent with transcriptomic alterations. Compared to HB pummelo under cold stress, Ichang papeda accumulated more sugars, flavonoids, and unsaturated fatty acids, which are well-characterized metabolites involved in stress responses. Interestingly, sphingosine and chlorogenic acid substantially accumulated only in Ichang papeda. Knockdown of <span>CiSPT</span> (<span>C. ichangensis serine palmitoyltransferase</span>) and <span>CiHCT2</span> (<span>C. ichangensis hydroxycinnamoyl-CoA: shikimate hydroxycinnamoyltransferase2</span>), two genes involved in sphingosine and chlorogenic acid biosynthesis, dramatically decreased endogenous sphingosine and chlorogenic acid levels, respectively. This reduction in sphingosine and chlorogenic acid notably compromised the cold tolerance of Ichang papeda, whereas exogenous application of these metabolites increased plant cold tolerance. Taken together, our findings indicate that greater accumulation of a spectrum of metabolites, particularly sphingosine and chlorogenic acid, promotes cold tolerance in cold-tolerant citrus species. These findings broaden our understanding of plant metabolic alterations in response to cold stress and provide valuable targets that can be manipulated to improve <span>Citrus</span> cold tolerance.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"894baabe62d89420dbcda3d8a06d3ace4c6cc5052fc25c42a0a2840accab24fa","category":"Environment"}