{"title":"The relationship between participation in leisure activities and incidence of falls in residential aged care","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302678","date":1714053600000,"content":"<p>by Guogui Huang, Nasir Wabe, Magdalena Z. Raban, S. Sandun Malpriya Silva, Karla Seaman, Amy D. Nguyen, Isabelle Meulenbroeks, Johanna I. Westbrook</p>\r\nBackground <p>Active engagement in leisure activities has positive effects on individuals’ health outcomes and social functioning; however, there is limited understanding of the link between participation in leisure activities, particularly non-exercise activities, and falls in older adults. This study aimed to determine the relationship between participation in leisure activities and the incidence of falls, and the variation of this relationship by dementia status in residential aged care facilities (RACFs).</p> Methods <p>A retrospective longitudinal cohort study utilising routinely collected data (January 2021-August 2022) from 25 RACFs in Sydney, Australia, was conducted. The cohort included 3,024 older permanent residents (1,493 with dementia and 1,531 without) aged ≥65 and with a stay of ≥1 week. The level of participation in leisure activities was measured using the number of leisure activities per 1,000 resident days and divided into quartiles. Outcome measures were the incidence rate of all falls and injurious falls (i.e., number of falls per 1,000 resident days). We used multilevel negative binary regression to examine the relationship between leisure participation and fall incidence.</p> Results <p>For the whole sample, leisure participation was significantly inversely associated with the incidence rate of all falls and injurious falls. For example, residents in the high leisure participation group were 26% less likely to experience a fall compared to those in the low leisure participation group after controlling for confounders (incidence rate ratio = 0.74, 95% confidence interval = 0.60, 0.91). Such inverse relationship was observed in both exercise and non-exercise activities and was stronger among residents without dementia.</p> Conclusions <p>Leisure participation is associated with a lower rate of falls, a key quality indicator by which RACFs are benchmarked and funded in Australia and many other countries. More recognition and attention are needed for the currently underfunded leisure activities in RACFs in future funding arrangement.</p>","author":"Guogui Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"895b72848a021e4dc50f5da98cdc1cc44fbcef651b46bba7ad56b085d729ff12","category":"Interdisciplinary"}