{"title":"Post-SCOTUS Ruling, Apple Releases Guidelines for ‘External Purchase Links’ in iOS Apps (Spoiler: They Still Demand the Same Commissions)","link":"https://developer.apple.com/support/storekit-external-entitlement-us/","date":1705461740000,"content":"\n<p>Apple Developer News:</p>\n\n<blockquote>\n  <p>In addition to using Apple’s convenient, safe, and secure in-app \npurchase system, apps on the App Store in the United States that \noffer in-app purchases can also use the StoreKit External \nPurchase Link Entitlement (US) to include a link to the \ndeveloper’s website that informs users of other ways to purchase \ndigital goods or services. To use the entitlement, you’ll need to \nsubmit a request, enable the entitlement in Xcode, and use \nrequired StoreKit APIs. Apple will review your app to ensure it \ncomplies with the terms and conditions of the entitlement, as \nwell as the App Store Review Guidelines and the Apple Developer \nProgram License Agreement. [...] </p>\n\n<p>Your app must offer in-app purchases in accordance with the \nDeveloper Program License Agreement and App Store Review \nGuidelines, and may not discourage end-users from making in-app \npurchases. </p>\n</blockquote>\n\n<p>Apple clearly had these updated guidelines ready to go, pending this week’s decision from the U.S. Supreme Court <a href=\"https://daringfireball.net/linked/2024/01/16/scotus-epic-apple\">rejecting the remaining petitions from Apple and Epic</a>.</p>\n\n<p>Scroll down the page, then scroll some more, and you’ll get to the section on “Commission, transaction reports, and payments”:</p>\n\n<blockquote>\n  <p>Apple is charging a commission on digital purchases initiated \nwithin seven days from link out, as described below. This will not \ncapture all transactions that Apple has facilitated through the \nApp Store, but is a reasonable means to account for the \nsubstantial value Apple provides developers, including in \nfacilitating linked transactions. </p>\n\n<p>Apple’s commission will be 27% on proceeds you earn from sales \n(“transactions“) to the user for digital goods or services on your \nwebsite after a link out (i.e., they tap “Continue” on the system \ndisclosure sheet), provided that the sale was initiated within \nseven days and the digital goods or services can be used in an \napp. This includes (a) any applicable taxes and (b) any \nadjustments for refunds, reversals and chargebacks. For \nauto-renewing subscriptions, (i) a sale initiated, including with \na free trial or offer, within seven days after a link out is a \ntransaction; and (ii) each subsequent auto-renewal after the \nsubscription is initiated is also a transaction.] </p>\n\n<p>If you’re a participant in the Small Business Program, or if the \ntransaction is an auto-renewal in the second year or later of an \nauto-renewing subscription, the commission will be 12%. </p>\n\n<p>These commission rates apply to all amounts paid by each user net \nof transaction taxes charged by you. You will be responsible for \nthe collection and remittance of any applicable taxes for sales \nprocessed by a third-party payment provider. </p>\n\n<p>If you adopt this entitlement, you will be required to provide \ntransaction reports within 15 calendar days following the end of \neach calendar month. Even if there were no transactions, you’re \nrequired to provide a report stating that is the case. </p>\n</blockquote>\n\n<p>I’ve said it before, I’ll say it again now, and I’m sure I’ll have to say it again in the future: Apple’s 30/15 percent commissions from App Store purchases and subscriptions are <em>not</em> payment processing fees. They <em>include</em> payment processing fees, but most of those commissions are, in Apple’s view, their way of monetizing their intellectual property. And they see the entire iOS platform as their IP.</p>\n\n<p>So developers who want to process payments on their own websites are still on the hook to pay Apple the same effective commissions, minus only 3 percent for the actual payment processing. And the truth is most of the time credit card processing costs more than 3 percent overall, after chargebacks and fraud are taken into consideration. Do more work and save no money — sounds appealing, no?</p>\n\n<p><strong>See also:</strong> <a href=\"https://www.macrumors.com/2024/01/16/us-app-store-alternative-purchase-option/\">MacRumors has PDF copies</a> of Apple’s “notice of compliance” filing, and App Store VP Matthew Fischer’s declaration of compliance, both submitted to Judge Yvonne Gonzalez Rogers.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/16/apple-guidelines-external-purchase-links\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"8962e30db2e50d1e339ce4c6d444ace7b6084aa95c53c0a8196a0ee7562bf0e5","category":"Tech"}