{"title":"Magnetic Resonance Imaging of Temporomandibular Joint and Aortic Root Score in Fibrillinopathies","link":"https://www.preprints.org/manuscript/202409.0010/v1","date":1725276361000,"content":". Background and Objectives: Fibrillinopathies have different phenotypic expression: Marfan- like skeleton features, MLSF; mitral valve prolapse syndrome, MVPS; MASS phenotype, M= mitral valve prolapse, MVP, A= aortic root dilation, S= skeletal features, and the second S= (cutaneous) striae; Marfan syndrome, MS. These are inherited connective tissue diseases, provoked by a mutation of the encoding gene for a protein(fibrillin 1, FBN1) which has major importance in the formation of elastic fibers.The study had the following main objectives: the correlation between disc displacement, DD( a major sign for temporomandibular joint dysfunction, TMD) on magnetic resonance imaging, MRI, and aortic Z score(a major sign for aortic root dilation) on echocardiography; the predictive value of DD towards aortic Z score. DD had 2 types of severity: DD with reduction(the mild type, DDwR) , and DD without reduction( the severe type, DDwoR). Materials and Methods: The type of fibrillinopathy was precised by clinical exam( systemic score), ophthalmic exam(for ectopia lentis), and echocardiography(aortic Z score, MVP). Medical treatment consisted in betablockers, BB(for patients with tachycardia), or angiotensin II receptor blockers, ARB. Surgical treatment was addressed to aortic root aneurysm, and severe MR. DD benefited by dental conservatory treatment, or surgical restoration.Results: DD- Z score had a powerful correlation in MASS(Rho= 0.787, p&amp;lt; 0.01), and in MS patients(Rho=0.819, p&amp;lt; 0.01). For the entire sample, both DDwR- Z score, and DDwoR- Z score had a moderate correlation(Rho= 0.469, and respectively 0.669). Muchmore, DD was an important predictor for Z score. DDwoR had a double power of prediction for Z score, comparative with DDwR(B coefficient= 1.661 for DDwR, and 3.281 for DDwoR). Conclusions: TMD had a powerful correlation with aortic root dilation, in MASS, and MS patients from the sample. Likewise, TMD was a major predictor for aortic root dilation, in the entire sample. We can utilize in clinical practice, an extracardiac finding, TMD, obtained by a non-invasive technique, MRI, for cardiac severity stratification of fibrillinopathies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8977faa232b99c655958020857d5c5588ac23546b5b04b481b49e916cb59010d","category":"Interdisciplinary"}