{"title":"Why you shouldn’t panic about iOS security flaws","link":"https://www.macworld.com/article/346064/macalope-ios-iphone-update-exploits-security-vulnerabilities.html","date":1620730800000,"content":"\n<div>\n<section><div></div></section><p>It is spring and spring is the time when a young man or woman’s fancy turns to frowning and looking very serious about the poor state of security on Apple platforms.</p>\n\n\n\n<p>Apparently. </p>\n\n\n\n<p>According to Vice, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.vice.com/en/article/v7ee7m/apple-is-having-a-really-bad-time-with-iphone-security-bugs-this-year&amp;xcust=1-2-346064-0-0-0&amp;sref=https://www.macworld.com/feed\">“Apple Is Having a Really Bad Time With iPhone Security Bugs This Year.”</a> (Tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/designheretic&amp;xcust=1-2-346064-0-0-0&amp;sref=https://www.macworld.com/feed\">@designheretic</a>.)</p>\n\n\n\n<p>Have you ever had a <em>good</em> time with iPhone security bugs? They’re real downers at parties.</p>\n\n\n\n<blockquote><p>Since the beginning of 2021, Apple has patched seven bugs that “may have been actively exploited,” according to Motherboards’s count of vulnerabilities mentioned in Apple disclosures.</p></blockquote>\n\n\n\n<p>Now, the fact that seven of them have been “actively exploited” does seem bad. It used to be that pundits would rend their garments and wear out their fainting couches over Apple security bugs and you’d say “Yeah, but were any of them exploited?” and they’d suddenly get really into shuffling their papers. Like so much into it you wondered what was on those papers.</p>\n\n\n\n<p>What <em>were</em> those papers? Why did they have so many of them? We never found out.</p>\n\n\n\n<p>Vice admits:</p>\n\n\n\n<blockquote><p>It’s quite difficult to say whether iOS security is “getting worse,” as that depends on specifics which are very difficult to have full insight into.</p></blockquote>\n\n\n\n<p>Still, most of these exploits are used against high-profile targets and, sadly, dissident groups. If you’re not James Bond and not unlucky enough to be a minority in an authoritarian state (coming soon to a state near you!), you’re probably fine, which Vice gets around to mentioning in the last paragraph.</p>\n\n\n\n<p>Even if the number of iOS bugs being exploited has gotten worse, there’s another advantage to being on an iPhone.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://tech.hindustantimes.com/mobile/news/apple-fixes-security-flaws-in-seven-year-old-iphone-models-with-ios-1253-71620226631744.html&amp;xcust=1-2-346064-0-0-0&amp;sref=https://www.macworld.com/feed\">“Apple fixes security flaws in seven-year-old iPhone models with iOS 12.5.3.”</a> (Another tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/designheretic&amp;xcust=1-2-346064-0-0-0&amp;sref=https://www.macworld.com/feed\">@designheretic</a>.)</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>IDG</p></div>\n\n\n\n<p>That update went to phones that were outside of the official window for support. Now, you can argue that that indicates the severity of the bug and that’s probably true, but Apple could also have told people still using the iPhone 5s to suck rocks and get a dang SE or something already. The Macalope would tell you to go find another mobile platform where you can get security updates seven years later while he waited but he would be waiting until the heat death of the universe so he’s not going to tell you to do that.</p>\n\n\n\n<p>So, on the one hand we have a fair number of iOS security flaws and, worse, they’re getting exploited. Okay. Not great. On the other hand, it’s unlikely you’ll ever be targeted because bad actors pay a lot for these bugs and no one wants your toy poodle pictures, Ned, we can get them off Instagram. Why would we pay a million dollars? It makes no sense. On the third hand of this hideous tri-limbed Xenomorph of an argument, we have the fact that Apple updates phones for far longer than “the other guys”, even when it doesn’t provide updates for phones that are out of warranty.</p>\n\n\n\n<p>Should you be somewhat aware of these issues and should you keep your iPhone updated when new bug fixes come out? Absolutely. Should you turn off Wi-Fi on your phone, pop out the SIM card and stomp it into a million pieces just to be on the safe side? No.</p>\n\n\n\n<p>We talked about this, Ned.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"897a534238a3181a9d292caffd03d0db4b4be206cc1172c083868443f32c9668","category":"Apple"}