{"title":"How the Rapha Foundation is helping to promote cycling for all","link":"https://www.bikeradar.com/advertising-feature/rapha-foundation-2/","date":1639494011000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/12/5M3A3026-96c8c84.jpg?quality=45&amp;resize=620,413\" />                                            <p>Images of home-grown cycling success follow a familiar pattern; a trip to a far-flung Olympic Velodrome to garner golden gongs minted in the ‘medal factory’ in Manchester, courtesy of British Cycling’s elite talent programme.</p>\n<p>We are spoiled by the long-running success story <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-started-at-track-cycling/\" target=\"_blank\">in the velodrome</a>. It’s held up as a visible indication of the popularity of cycling at every level of society. But within this narrative there are other successes that share the same golden outcomes, but from fundamentally different points of origin.</p>\n<p>The berms and tumps of Braintree and Peckham pump tracks exist in stark contrast to the controlled environment of Manchester Velodrome.</p>\n<h2>Working to overcome inequality</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Extending access to grassroots cycling programmes is a key part of Rapha’s strategy.</span></figcaption><span> <i>Simon Wilkinson / SWpix.com</i></span></div>\n<p>For Kye Whyte and Bethany Shriever, supported by an equally skilled team, this is their pathway. This difference becomes a microcosm for disparities in cycling in the UK, and it’s these disparities that Rapha and British Cycling – the governing body of the sport in the UK – are working together to overcome.</p>\n<p>It’s easy to celebrate success passively, superficially, as the outcome – the podium ‘moment’. For many watching <a href=\"https://www.bikeradar.com/events/tokyo-2020/\" target=\"_blank\">Tokyo 2020</a> the embrace by long-standing training partners Whyte and Shriever – immediately following her gold medal – was an intense but momentary flash of emotion.</p>\n<p>However, the paradox is that in celebrating only the moment of the gold medal, we ignore the challenges faced by many in getting to that point in the first place. This can include a lack of funding, ‘closed’ pathways, or at a grassroots level, a fundamental lack of representation – or simply visibility.</p>\n<p>As Marie C Wilson puts it: “You can’t be what you can’t see.” Or, to be more direct, why would you want to do a thing when no one you know and nobody else who looks like you does that thing? It’s a simple question, but one that tends to lead to more questions.</p>\n<h2>Embracing change</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rapha has undergone systemic change and wants to play its part in broadening diversity.</span></figcaption><span> <i>Simon Wilkinson / SWpix</i></span></div>\n<p>For Rapha and for British Cycling, the governing body of the sport in the UK, the questions are compelling: how can the two organisations broaden <a href=\"https://www.bikeradar.com/features/long-reads/diversity-in-cycling/\" target=\"_blank\">diversity in cycling</a>? And how can they make abstract dreams of diversity become a concrete reality?</p>\n<p>Even the most cursory exploration reveals significant flux and a desire for change in both bodies.</p>\n<p>In the wake of the shooting of George Floyd and the ongoing seismic shifts since the summer of Black Lives Matter, Rapha undertook a programme of extensive reflection, soul-searching even. It led to systemic and systematic change within the organisation, as seen in several comprehensive statements of intent published on its website.</p>\n<p>“It is clear that we have not done enough to challenge the traditional image of our sport and that more can be done to ensure our own internal culture represents a true reflection of society,” read one such statement.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Only 5 per cent of British Cycling members come from Black, Asian and minority ethnic communities.</span></figcaption><span> <i>Simon Wilkinson / SWpix</i></span></div>\n<p>It goes on to state an impressive, important aim: “to create a brighter future for cyclists from under-served communities around the world.”</p>\n<p>For Rapha, honesty and reflection are nothing without action. Rapha doesn’t want to provide the impression of change; a simulacrum of equality and diversity and a world of lovely abstract nouns. They want sustained, actual change.</p>\n<p>The statistics are compelling, telling of a clear mismatch between take-up at grass-roots level and progression to elite pathways. For example, there are significant social, racial and cultural differences between those who ride a bike functionally, i.e, the A-to-B commute for people who don’t identify as cyclists, and those who are immersed in sport as cycling for life.</p>\n<h2>A clear disconnect</h2>\n<p>Transport for London’s research states: “Londoners from Black, Asian and minority ethnic communities were not significantly less likely to have cycled over the past 12 months than white Londoners.”</p>\n<p>Ostensibly, it feels like a city success story. After all, nearly 20 per cent of cyclists come from diverse ethnic communities. However, these communities go on to represent just 5 per cent of the British Cycling membership body, which suggests a clear disconnect and a lack of a tipping point into the next stage of cycling.</p>\n<p>There are other inequalities, particularly in terms of gender and social background. Men are twice as likely to ride a bike as women, and while 43 per cent of all cyclists come from a less affluent area, an eye-opening 85 per cent of the BC talent pathway emerges from typically affluent localities.</p>\n<p>Rapha has history in terms of supporting grass-roots cycling. Any glance at cyclo-sport in the UK throws up evidence of a desire to support and work with disparate communities.</p>\n<p>It’s in the revised title of a domestic classic – previously under threat – the Rapha Lincoln GP. It’s in the depth of engagement with the Rapha Women’s 100. It’s evident in the <a href=\"https://www.awin1.com/cread.php?id=489797&amp;clickref=bikeradar-0&amp;awinmid=18515&amp;p=https%3A%2F%2Fwww.rapha.cc%2Fgb%2Fen%2Fstories%2Frapha-foundation\" target=\"_blank\">Rapha Foundation</a>’s involvement with Herne Hill Velodrome, The Cyclists’ Alliance and the Rayner Foundation.</p>\n<p>It’s also in a whole series of global initiatives aimed at supporting groups, projects and organisations that share the brand’s values, of growing and developing the sport in a broad and diverse way.</p>\n<h2>Access for all</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rapha is aware that in order for meaningful change to occur, cycling needs to be accessible to all.</span></figcaption><span> <i>Simon Wilkinson / SWpix.com</i></span></div>\n<p>For Rapha, change is an action, not a sentiment, and typified by funding commitments, in this case an undertaking to dedicate at least 50 per cent of its athlete sponsorship to Black, Asian, minority ethnic, LGBTQ+ and female riders and their teams.</p>\n<p>It’s part of a wider, $1m ring-fenced funding allocation for BAME and female-focused programmes and initiatives. It’s also embedded in a clarion call for wholescale engagement at all levels. According to CEO Simon Mottram, “for the true potential of pedal power to be realised, it must be accessible to all.”</p>\n<p>And right now, it’s evident in how Rapha and British Cycling are working together on a two-year project to establish City Academy Hubs. The aim is to remove the barriers to participation and empower people to champion cycling in their communities.</p>\n<p>This will in turn help establish direct pathways to the top of the sport for those young people who might otherwise be excluded, instead leading them from grassroots to elite success.</p>\n<p>It is localised, insofar as it aims to create what British Cycling head Brian Facer refers to as “a virtuous circle”. According to Isobel Whiteley, one of the coaches, “the city academies project is about empowering the community. Success looks like the community getting involved, with that activity reflecting the areas [where] it takes place.”</p>\n<p>It is forward-looking: young people joining the Academy Hubs today will in turn inspire others to join, becoming role models for the local community, either within the community or through their progression into elite pathways – which is in turn the next phase of the project.</p>\n<p>The first two hubs are based in the London boroughs of Newham and Hackney, precisely because these areas have been identified (via work with TfL) as having significant potential to both enable more cycling and encourage diversity.</p>\n<h2>Breaking down barriers</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Rapha and British Cycling have embarked on a project to establish City Academy hubs.</span></figcaption><span> <i>Alex Whitehead / SWpix.com </i></span></div>\n<p>Tre Whyte, former BMX world champion and alumnus of Peckham BMX with brother Kye, is now a coach. There are clear parallels with Peckham BMX, the early involvement featuring passionate local evangelists bringing kids into the sport, seemingly against the odds, and eventually leading to Olympic success.</p>\n<p>Whyte identifies two clear but not exclusive long-term goals, of a sustained and successful future in the sport, but also the vital and equally life-changing goals of health and opportunity.</p>\n<p>“Our main aim is to take cycling to people. We’re in a position where we are going to break down a lot of barriers, and whether we make community champions or give the children a healthier lifestyle and something to do, that’s what we’re here for.”</p>\n<p>It is a concerted effort to promote cycling across all groups at a community level. The hubs are targeted at removing the barriers to participation through engagement and activism.</p>\n<p>It isn’t about abstract ideas or a wishlist, but doing things, creating systems, mapping the pathways and opening up opportunities in places where they might not have existed previously.</p>\n<p>Each Hub consists of a lead coach within the community, who is best placed to address the needs of those involved and to be a role model within the local area.</p>\n<p>Wider support is given from the Rapha Foundation and British Cycling so they can deliver exciting and engaging sessions in a variety of community spaces, including parks and commons.</p>\n<p>This accessibility in turn raises the profile and visibility of cycling in these areas, leaning back into the community, as Whiteley identifies: “Of course we’d love a rider to go on from one of the city cycling hubs in Newham or Hackney to the GB cycling team pathway in future, but success for us is about cycling being more reflective of society.</p>\n<h2>Bridging the gap</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> It is hoped that Academy Hubs and Talent Centres can feed into the British Cycling development pathway.</span></figcaption><span> <i>Simon Wilkinson / SWpix</i></span></div>\n<p>The second phase involves City Academy Clubs and Talent Centres. These act as a next step towards the British Cycling development pathway. It anchors the existing British Cycling network in the community hubs, bridging the gap between grass-roots and elite participation.</p>\n<p>The hope is that once the first cyclists begin to transfer into elite competition it will be a clear representation of the dreams of those taking their first steps: this could be you. It will shine a light on the work being done in the community, just as Kye Whyte has done for Peckham BMX, enabling young cyclists to be what they can see.</p>\n<p>As Brian Facer sums up: “Ensuring greater diversity is essential to the future of our sport and it is also the right thing to do from a societal perspective”.</p>","author":"Paul Jones","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"897cb6b44c93ed72df3f1550c14359adb961489b4c2ff631cb1ef83db3705f87","category":"Cycling"}