{"title":"Ventum’s next-gen NS1 proves small changes can go a long way","link":"https://www.cyclingtips.com/2023/03/ventums-next-gen-ns1-proves-small-changes-can-go-a-long-way/","date":1679497240000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505016.jpg?width=1200\" alt=\"Ventum’s next-gen NS1 proves small changes can go a long way\" /></figure><p>I don’t envy bike designers.</p>\n<p>Expectations are lofty. Cyclists have been conditioned to expect something incredible every few years or so, something that inspires ennui that their current bike in the garage should be thrown in the garbage, that the only way to feel whole again is to pull out the Amex for that brand new version.</p>\n<p>But what if what already exists is pretty darn good, and what comes next merely needs to build upon that foundation? <a href=\"http://cyclingtips.com/tag/Ventum\" target=\"_blank\">Ventum</a>, it seems, has decided that that was the case for the aerodynamically minded NS1, the lone road bike in its humble three-model stable.<span> </span></p>\n<p>However, that’s not to say that the improvements in the 2023 version aren’t significant.</p>\n<figure>\n<p></p><figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505026-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption>The 2023 Ventum NS1.</figcaption></figure></figure>\n<p><strong>Also read: </strong><a href=\"https://www.cyclingtips.com/2023/03/pinarello-goes-electric-with-their-new-nytro-e-road-gravel-and-allroad/\" target=\"_blank\">Pinarello goes electric with their new Nytro-E Road, Gravel, and Allroad</a></p>\n<p><b>The good</b></p>\n<ul>\n<li>Fast, integrated, on-trend all-road aero bike</li>\n<li>Incredibly smooth ride<span> </span></li>\n<li>Good value</li>\n<li>More versatile than ever with increased tire clearance<span> </span></li>\n</ul>\n<p><b>The less good</b></p>\n<ul>\n<li>The usual set up pains that accompany highly integrated bikes</li>\n</ul>\n<h2>A different bike, but not <i>too</i> different <span> </span></h2>\n<p>For its follow-up, Ventum has created a bike that on the surface looks pretty similar, keeping intact the same integrated, aerodynamic concept launched a few years back. In fact, for a moment I wondered if I had accidentally gotten the previous version when I opened up the box.<span> </span></p>\n<p>Then I looked closer and sure enough the promised updates were there. Enough clearance to make 30 mm tires look like 23 mm? Check. Modern T47 bottom bracket? Check.<span> Redesigned carbon layup? Well, that one’s a bit harder to see with the naked eye.</span></p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505043-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>There’s loads of clearance in the new NS1.</span> (Photo: Will Tracy)</figcaption></figure>\n<p>The tube shapes are subtly altered as well. The headtube is recessed further into the down tube. The seat stays remain dropped as well, but now are more aggressively aero, looking lifted off of a triathlon bike. All the cables remain neatly tucked inside as well, with improved cable routing on the new all-road one-piece cockpit, a component that Ventum says is more compliant than the previous Ventum bar-stem.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505029-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The seat stays look lifted right off of a TT bike. </span> (Photo: Will Tracy)</figcaption></figure>\n<p>If anything, the new-look NS1 can be accused of being aggressively on trend, like a high schooler desperately courting the approval of the cool kids.<span> </span></p>\n<p>But it never actually does feel like that. It <i>is</i> the cool kids.<span> </span></p>\n<p>Riding the NS1 feels like being part of an exclusive club. You’ve heard of the Jeep wave, right? Well it turns out there’s something similar amongst Ventum owners as I discovered first hand.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505022-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The NS1 comes with a new all-road cockpit. </span> (Photo: Will Tracy)</figcaption></figure>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505044-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The cable routing has been reworked.</span> (Photo: Will Tracy)</figcaption></figure>\n<h2>An aero bike minus the lofty aero claims</h2>\n<p>A song and dance has emerged around launching new aero bikes. They must always be x percent faster, with charts and graphs to show for it. Ventum has not gone very big on any such claims.</p>\n<p>The bike <i>looks</i> fast, and certainly <i>feels</i> fast. It has all the details that we’ve been told means a bike is fast.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505023-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>The fork is now integrated into the head tube.</span> (Photo: Will Tracy)</figcaption></figure>\n<p>But while there are improvements that no doubt have resulted in aero improvements, the integrated front end and seatstays mentioned earlier being two, Ventum’s interest for this bike appears to have been focused foremost around improving ride quality and the bike’s capability.</p>\n<p>The first major change: the move to all-road capability with 35 mm tire clearance, boosted from the 30 mm. That gives the bike bonafide capabilities on mixed terrain rides with the right rubber accompanying it. For an event like Belgian Waffle Ride California, where most of the 130 miles are spent on pavement, that means you can pop in high volume slicks that don’t sop up all your watts when pavement pounding, while also letting you have fun on the off-road sections, not merely survive.</p>\n<h2>Geometry</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/Ventum-NS1-Geometry-2023.png?width=730\" alt width=\"1294\" height=\"934\" /><figcaption><span>The 2023 Ventum NS1 geometry.</span></figcaption></figure>\n<p>To cram in the extra clearance, Ventum has had to go back to the drawing board on the geometry. Things are surprisingly similar though. Stack and reach remain unchanged, as does the 410mm chain stay length across the size range. The wheelbase is ever so slightly shorter on a few of the six sizes, by at most 2 mm (a medium frame comes in at 982 mm). The head tube and seat tube angle are unchanged as well, measuring in at 73 degrees each for the medium model.<span> </span></p>\n<p>The biggest geo change is to the fork rake and offset. The rake has shortened from 47 mm down to 45 mm, and the trail is now 58.1 mm in a size medium, increased from 45.9 mm.</p>\n<p>Under the hood, Ventum has gone to work tweaking the carbon layup. No surprise here, the brand says the frame is stiffer when cornering while getting more compliant and more stable.</p>\n<h2>Weight</h2>\n<p>The resulting frame weight from all these changes isn’t anything to write home about at 950 grams for a medium/large size, albeit that’s for a painted frame with all the bolts, so maybe drop a few grams in your mind when comparing it to other frames. That’s not to say 950 grams is heavy either. The uncut fork adds 420 grams to the build total.<span> </span></p>\n<h2>Electronic drivetrain only</h2>\n<p>Another change: the NS1 is now electronic drivetrain only. Or as Ventum told me, it’s “engineered exclusively for electronic drivetrains.” At this point, with 105 and Rival both available in electronic drivetrains, and Force/Ultegra on up not even bothering with the pretense of mechanical shifting anymore, Ventum has alienated approximately no one with this design choice, and is far from alone in making it.</p>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505021-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption><span>You won’t see any mechanical drivetrains on the new NS1; you might have a serious problem on your hands if you do.</span> (Photo: Will Tracy)</figcaption></figure>\n<h2>Pricing and Builds</h2>\n<p>The NS1 isn’t going to be in the same sentence with the word cheap (ok, except this one) but it is certainly cheap-<i>er </i>than expected for the package it delivers.</p>\n<p>Refreshingly, pricing has actually gone down with the latest NS1! The frameset is now $2,999, down from $3,699. And top level builds like Dura-Ace are as much as $1,000 less than before. One of the wheelset upgrade options, the Zipp 303s, is $100 cheaper too.</p>\n<p>That’s an advantage of Ventum over larger brands: the ability to customize, to an extent, the build kit. You have options over groupset, wheels, power meter, and the size of your bar, stem, and cranks.<span> </span></p>\n<table>\n<tbody>\n<tr>\n<td>\n<p>Frameset</p>\n</td>\n<td>\n<p>$2,999.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Rival AXS</p>\n</td>\n<td>\n<p>$4,199.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>105 Di2</p>\n</td>\n<td>\n<p>$4,199.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Force AXS</p>\n</td>\n<td>\n<p>$5,999.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Ultegra Di2</p>\n</td>\n<td>\n<p>$5,999.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Red AXS</p>\n</td>\n<td>\n<p>$7,999.00</p>\n</td>\n</tr>\n<tr>\n<td>\n<p>Dura-Ace Di2</p>\n</td>\n<td>\n<p>$7,999.00</p>\n</td>\n</tr>\n</tbody>\n</table>\n<p>A Dura-Ace Di2 or Red AXS build can be had for $8,000—almost unheard of today. You’ll want to upgrade the wheelset to at least the Zipp 303s for an extra $900, or one of several premium options Ventum offers directly, but even then you’re still under $10,000. That puts it alongside brands like Canyon in value.</p>\n<h2>Specification</h2>\n<figure><img loading=\"lazy\" src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/8505016-1340x893.jpg?width=730\" alt width=\"1340\" height=\"893\" /><figcaption>(Photo: Will Tracy)</figcaption></figure>\n<p>Shimano Ultegra group (11-30T cassette, 50/34T chainrings); Zipp 303s wheelset; IRC Formula Pro Tubeless 30 mm tires; Ventum All Road bar-stem; Fizik Argo saddle</p>\n<p>$6,900 as tested</p>\n<h2>The Ride</h2>\n<p>The 2023 NS1 is smooth as butter. Between the reworked carbon layup and the generous tire clearance, it soaks up road vibrations quite impressively, especially for an aero bike.</p>\n<p>It’s not the most agile descender on technical roads, instead opting for slightly tamer handling for confident descending, especially at speed. I felt comfortable leaning hard into corners, and still got nowhere near the limit.</p>\n<p>When the road flattens out, it has plenty of speed to unleash. Not a watt feels wasted. When the road turns uphill once more, it feels at home there too, not just surviving out of its element.</p>\n<p>Despite its all-road billing, the bike very much has the fit of a more traditional road bike, putting you into an optimal aero position.<span> After spending a lot of time on gravel bikes with more relaxed geometries recently, this required a brief readjustment period.</span></p>\n<p>There are cons too of course.</p>\n<p>Like any highly integrated aero bike, the NS1 will require some extra set up time and patience to dial in. Any adjustment to stem height or the headset especially calls for that plus a dash of yelling at inanimate objects for good measure. Likewise, adjusting the seatpost height is just ever so slightly more difficult thanks to the placement of the seatpost bolt inside the front triangle. These are nitpicky things, but something to pay attention to if you like to work on your own bikes. <span> </span></p>\n<p>Overall, the entire package is well thought out, and comes together for a ride that never feels lacking, all at a price that is far more approachable than the top kit from the big brands out there.</p>\n<p><a href=\"http://ventumracing.com\" target=\"_blank\">ventumracing.com</a></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8981eb65528bd1ef88aacc6ccae209dc52e085386df535cde96507114c2d1417","category":"Cycling"}