{"title":"ALTERED MERISTEM PROGRAM1 sustains cellular differentiation by limiting HD-ZIP III transcription factor gene expression","link":"https://academic.oup.com/plphys/article/196/1/291/7680508?rss=1","date":1716422400000,"content":"<span><div>Abstract</div>Plants show remarkable developmental and regenerative plasticity through the sustained activity of stem cells in meristems. Under certain conditions, pluripotency can even be reestablished in cells that have already entered differentiation. Mutation of the putative carboxypeptidase ALTERED MERISTEM PROGRAM1 (AMP1) in Arabidopsis (<span>Arabidopsis thaliana</span>) causes a set of hypertrophic phenotypes, indicating a defect in the suppression of pluripotency. A role of AMP1 in the miRNA-mediated inhibition of translation has previously been reported; however, how this activity is related to its developmental functions is unclear. Here, we examined the functional interaction between AMP1 and the Class III homeodomain-leucine zipper (HD-ZIP III) transcription factors, which are miRNA-controlled determinants of shoot meristem specification. We found that the HD-ZIP III transcriptional output is enhanced in the <span>amp1</span> mutant and that plant lines with increased HD-ZIP III activity not only developed <span>amp1</span> mutant-like phenotypes but also showed a synergistic genetic interaction with the mutant. Conversely, the reduction of HD-ZIP III function suppressed the shoot hypertrophy defects of the <span>amp1</span> mutant. We further provide evidence that the expression domains of HD-ZIP III family members are expanded in the <span>amp1</span> mutant and that this misexpression occurs at the transcriptional level and does not involve the function of miRNA165/166. Finally, <span>amp1</span> mutant–specific phenotypes cannot be mimicked by a general inhibition of miRNA function in the AMP1 expression domain. These findings lead us to a model in which AMP1 restricts cellular pluripotency upstream of HD-ZIP III proteins, and this control appears to be not directly mediated by the canonical miRNA pathway.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"899733a4cd2e9e53852ba39d35c5bbfa3aac5432c54ca6f1a51ba3ecf8dfdd04","category":"Environment"}