{"title":"Cougar เปิดตัว NxSys Aero เก้าอี้เกมมิ่งติดพัดลมช่วยระบายเหงื่อที่หลังของผู้ใช้","link":"https://www.blognone.com/node/136245","date":1697448676000,"content":"<div><div><div><p>Cougar ผู้ผลิตเก้าอี้เกมมิ่งได้เปิดตัวสินค้าใหม่ในชื่อ <strong>NxSys Aero</strong> เก้าอี้เกมมิ่งรุ่นใหม่ที่มีพัดลม และไฟ RGB ฝังอยู่ในผนักพิงของเก้าอี้ ช่วยระบายความร้อนทั่วร่างกาย โดยเฉพาะการระบายเหงื่อบริเวณหลังของผู้ใช้งานได้</p>\n<p>พัดลมที่ติดตั้งอยู่ในพนักพิงนั้นมีขนาด 200 มม. และไฟ RGB (ที่ไม่รู้จะเอาให้ใครดู) ใช้พลังจากแบตเตอรี่ โดยเก้าอี้มีช่องที่ซ่อนอยู่ด้านหลังเพื่อให้ถอดหรือใส่แบตเตอรี่ลงไปได้ ส่วนการปรับสีไฟ และควบคุมความเร็วของใบพัดจะซ่อนอยู่ตรงด้านหลังทางขวาของพนักพิง นั่นแปลว่าผู้ใช้งานต้องปรับการตั้งค่าก่อนจะนั่งลงไป</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b7bd88572025d7bf08df24216c2bbccc.jpg\" /></p>\n<p>นอกจากพัดลมแล้ว NxSys Aero ยังมีพนักพิงศีรษะแบบแม่เหล็กสำหรับยึดไว้ที่ด้านบนของเก้าอี้เพื่อรองรับศีรษะ และคอ โดยแม่เหล็กช่วยให้ผู้ใช้เคลื่อนย้ายพนักพิงศีรษะไปรอบ ๆ เพื่อค้นหาจุดที่ลงตัวของคอ นอกจากนี้ยังมีหมอนรองเอวที่เป็นเกรดกายภาพบำบัด ที่ติดตั้งไว้ที่พนักพิงเพื่อรองรับหลังส่วนล่างด้วย ทางด้านเบาะนั่งจะเป็นแบบ Bucket Style ที่รองรับขนาดก้นได้กว้างขึ้นหุ้มด้วยหนัง PVC ระบายอากาศที่ให้ความรู้สึกอ่อนนุ่ม</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1843aeace99b979000642deb9bcbd124.png\" /></p>\n<p>NxSys Aero รองรับการปรับองศาได้ตั้งแต่ 90 ถึง 150 องศา, ปรับความสูงของเบาะนั่ง และที่พักแขน, ขันคันโยกแบบหมุนเพื่อให้โยกไปมาภายในช่วงเล็ก ๆ ได้ โดยเก้าอี้มี 2 สีได้แก่ สีดำ-ดำ และ ส้ม-ดำ วางขายในราคา 399 ดอลลาร์ในสหรัฐอเมริกา</p>\n<p>ที่มา - <a href=\"https://www.extremetech.com/gaming/cougar-launches-gaming-chair-that-helps-to-prevent-back-sweat\">Extreme Tech</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/cougar\">Cougar</a></div><div><a href=\"/topics/gaming-gear\">Gaming Gear</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"899a7bf4fb3f5ffa5e13aaae7fc7f7b9594a3b1748438d586253c7c69a2d08e3","category":"Thai"}