{"title":"Yellow mustard gum: pilot‐scale production and characterization","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13374?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Yellow mustard gum (YMG), which is extracted from the mucilaginous part of yellow mustard bran, has been considered an emerging natural hydrocolloid gum but lacks commercial development and production. To promote the commercial utilization of YMG, this study developed a pilot-scale YMG production protocol in an economic and environmentally friendly way to produce a clean-label YMG product. This YMG produced at pilot scale (YMW) was characterized in terms of chemical composition, rheological properties, and interaction with a commercial gum, <i>κ</i>-carrageenan, and was compared with purified YMG through ethanol precipitation (YME).</p>\n<h2>RESULTS</h2>\n<p>The protocol processed up to 100 L of raw material with zero solvent and a minimal number of steps and showed strong quasi-industrial potential. The YMW showed a similar chemical composition as YME. However, the YMW contained a slightly lower amount of carbohydrate and a much larger amount of ash and potassium than the YME. The rheological results concluded that both the YMW and YME solutions exhibited shear-thinning flow behavior and a weak gel, with YME showing higher viscosity and stronger gel structure. Most interestingly, YMW could form unpourable gels when blended with native <i>κ</i>-carrageenan whereas YME barely achieved this despite the equivalent total gum concentration.</p>\n<h2>CONCLUSION</h2>\n<p>This study demonstrated the feasibility of YMG production at a large scale with economic and green procedures and discovered its new functionality for commercial utilization. The gelling ability of YMG could provide it with wider applications as a result of a new potential synergistic combination. All this information should accelerate the process of full commercialization of YMG as a clean-label functional ingredient. © 2024 His Majesty the King in Right of Canada. Journal of The Science of Food and Agriculture © 2024 Society of Chemical Industry. Reproduced with the permission of the Minister of Agriculture and Agri-Food Canada.</p>","author":"Xinya Wang, \nRuoyan Liu, \nH. Douglas Goff, \nSteve W. Cui","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"899bd8d6cbb7ed6f650e220fe5152f46308d42c40e03145413d198135779dcd6","category":"Environment"}