{"title":"The Google Pixel 5a is $449, adds a bigger screen and water resistance","link":"https://arstechnica.com/?p=1787729","date":1629221480000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/26-980x735.jpg\" /></div>\n        <p>\n          The Pixel 5a.                      [credit:\n                        Google                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Google has officially unveiled its next midrange phone, the <a href=\"https://store.google.com/product/pixel_5a_5g\">Pixel 5a</a>. The big news today (and the main selling point of the Pixel A-series) is the price, which is $449, or $100 more than the Pixel 4a. Google's <a href=\"https://blog.google/products/pixel/pixel5a-with-5g-new-google-phone/\">blog post</a> includes a phone comparison sheet showing its lineup as the Pixel 5, Pixel 5a, and Pixel 4a, so hopefully the $349 Pixel 4a is sticking around.</p>\n<p>Part of the reason for the price increase is that the Pixel 5a is a bigger phone, with a 6.34-inch display and 73.7 mm width compared to the Pixel 4a's 5.8-inch display and 69.4 mm width. Another big change is the addition of IP67 dust and water resistance, which means the phone should survive submersion in 3 feet of water (1 meter) for 30 minutes. As with the Pixel 5, the Pixel 5a's body is metal coated in plastic, as opposed to the pure plastic body of the Pixel 4a. We didn't see the appeal of this construction in <a href=\"https://arstechnica.com/gadgets/2020/11/pixel-5-review-google-spends-its-bill-of-materials-budget-unwisely/\">the Pixel 5</a>, but the new phone is presumably stronger now.</p>\n<p>As usual, we're getting a no-frills design that takes care of the basics. On the front, there's a slim-bezel OLED display and a hole-punch camera on the top right, while there are two cameras (main and wide-angle) and a capacitive fingerprint reader on the back. Specs include a Snapdragon 765G (that's a 7 nm chip with two Cortex A76 cores and six Cortex A55 cores), 6GB of RAM, 128GB of storage, and the biggest battery of any Pixel: 4680 mAh. The main camera is 12.2 MP and looks like the same Sony IMX363 sensor that Google has used for the past four years. There's a 16 MP wide-angle and an 8 MP front camera. Oh yeah, and the headphone jack is sticking around for at least one more year.</p></div><p><a href=\"https://arstechnica.com/?p=1787729#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1787729&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"89a5ea9c306c8b607551453c6d37f0266604ce9fff2b44f2c3bd1890a836de9d","category":"Tech"}