{"title":"Introducing the newest Heroes of the year – March 2024","link":"https://aws.amazon.com/blogs/aws/introducing-the-newest-heroes-of-the-year-march-2024/","date":1709751268000,"content":"<p><a href=\"https://aws.amazon.com/developer/community/heroes/\" target=\"_blank\">AWS Heroes</a> are inspirational thought leaders who go above and beyond to knowledge share in a variety of ways. You can find them speaking at local meetups, <a href=\"https://aws.amazon.com/events/community-day\" target=\"_blank\">AWS Community Days</a>, or even at re:Invent. And these technical experts are never done learning—they’re passionate about solving problems and creating content to enable the community to build faster on AWS. We’re excited to announce the first cohort of Heroes in 2024…</p> \n<p>Let’s give a round of applause to our new Heroes!</p> \n<h2>Awedis Keofteian – Beirut, Lebanon</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/awedis-keofteian\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/Awedis-175-X-263.png\" width=\"175\" height=\"263\" /></a> Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/awedis-keofteian\" target=\"_blank\">Awedis Keofteian</a> is a DevOps Engineer at Anghami. He has a strong background in DevOps practices, and he leverages modern technologies to enhance scalability, reliability, and efficiency in Anghami’s cloud-based architecture. His journey began as an AWS Community Builder, and over time, he took the helm as the leader of the AWS User Group in Beirut. Awedis is passionate about nurturing and supporting the growth of AWS communities, and shares his knowledge across DevOps, automation, serverless, and cloud technologies.</p> \n<h2>Daniel Aniszkiewicz – Wrocław, Poland</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/daniel-aniszkiewicz\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/Daniel-Aniszkiewicz-175-X-263.png\" width=\"175\" height=\"263\" /></a> Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/daniel-aniszkiewicz\" target=\"_blank\">Daniel Aniszkiewicz</a> is a Senior Software Engineer at Algoteque International Hub. He co-organizes the Wrocław AWS User Group, and is passionate about contributing to the growth and engagement of the local AWS community. Daniel is also a seasoned speaker and loves to share his knowledge with others, such as presenting at re:Invent, AWS meetups, and AWS Community Days. He is particularly focused on promoting Amazon Verified Permissions and Cedar through workshops, blog posts, IaC templates, and open source projects.</p> \n<h2>Hazel Sáenz – Guatemala</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/hazel-saenz\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/Hazel-175-X-263.png\" width=\"175\" height=\"263\" /></a> Serverless Hero <a href=\"https://aws.amazon.com/developer/community/heroes/hazel-saenz\" target=\"_blank\">Hazel Sáenz</a> is a Software Architect at Cognits. Her primary focus is modernizing on-premises applications to cloud environments using AWS, and predominantly designs high workload architectures in serverless frameworks. Hazel enjoys sharing her knowledge with the community through technical talks at local and international events, participating in AWS Summits, AWS Community Days, and meetups, as well as writing technical articles in both English and Spanish. Additionally, she is the leader of the AWS User Group Guatemala, where she excels at organizing inclusive events and sharing her knowledge with the community.</p> \n<h2>Kenta Goto – Tokyo, Japan</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/kenta-goto\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/kenta_goto-175-X-263.png\" width=\"175\" height=\"263\" /></a> DevTools Hero <a href=\"https://aws.amazon.com/developer/community/heroes/kenta-goto\" target=\"_blank\">Kenta Goto</a> is a Backend Tech Lead and an enthusiastic contributor to AWS CDK. He has been selected as a top contributor and a trusted reviewer in AWS CDK, and serves as a maintainer for the community-driven CDK Construct Library. Kenta is also a conference speaker, having presented at the AWS Dev Day in Japan in 2022 and 2023. Furthermore, he actively contributes to the open source community by developing and publishing his self-made AWS tools and <a href=\"https://aws.amazon.com/cdk/\">AWS CDK</a> Construct libraries, which are used worldwide.</p> \n<h2>Martin Damovsky – Prague, Czech Republic</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/martin-damovsky\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/martin-175-X-263.png\" width=\"175\" height=\"263\" /></a> Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/martin-damovsky\" target=\"_blank\">Martin Damovsky</a> is a Cloud Governance Lead at Ataccama.com, an AWS Partner providing Unified Data Management Solutions. He has been particularly interested in AWS Control Tower Account Factory for Terraform, Cloud Intelligence Dashboard, and security and govern tools, such as <a href=\"https://aws.amazon.com/security-hub/\">AWS Security Hub</a>, <a href=\"https://aws.amazon.com/guardduty/\">Amazon GuardDuty</a>, and <a href=\"https://aws.amazon.com/config/\">AWS Config</a>. Martin is a leader for AWS User Group Prague, and he enjoys sharing his knowledge with the greater AWS community through his blog and speaking at meetups, podcasts, and conferences.</p> \n<h2>Rafał Mituła – Warsaw, Poland</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/rafal-mitula\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/rafal-175-X-263.png\" width=\"175\" height=\"263\" /></a> Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/rafal-mitula\" target=\"_blank\">Rafał Mituła</a> is a Cloud Data Engineer and Architect within the Data &amp; AI division at Chaos Gears. He is actively involved in the AWS community, co-organizing the AWS User Group Warsaw meetups and the AWS Community Day Poland conference. In addition to his technical and organizational roles, Rafał shares his expertise by speaking at conferences and leading workshops aimed at introducing new builders to AWS and data analytics, such as the AWS Data Engineering Immersion Days.</p> \n<h2>Sena Yakut – Izmir, Turkey</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/sena-yakut\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/sena-yakut-175-X-263.png\" width=\"175\" height=\"263\" /></a> Security Hero <a href=\"https://aws.amazon.com/developer/community/heroes/sena-yakut\" target=\"_blank\">Sena Yakut</a> is a Senior Cloud Security Engineer at Lyrebird Studio. She has a master’s degree in cloud security, and builds security requirements for architectural designs, providing threat management and security concepts and services using AWS. Sena shares her knowledge through blog posts across various platforms, and engaging in discussions about cloud security at events, such as AWS Community Day Türkiye, and DevOpsDays Istanbul. As an active blogger and speaker, she enjoys learning new security features on AWS and informing others about them.</p> \n<h2>Tiago Rodrigues – Lisbon, Portugal</h2> \n<p><a href=\"https://aws.amazon.com/developer/community/heroes/tiago-rodrigues\" target=\"_blank\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2024/03/05/tigpt-175-X-263.png\" width=\"175\" height=\"263\" /></a> Community Hero <a href=\"https://aws.amazon.com/developer/community/heroes/tiago-rodrigues\" target=\"_blank\">Tiago Rodrigues</a> is a Senior Cloud Consultant at tecRacer.com, an AWS Premier Partner and AWS Advanced Training Partner. He specializes in migrations from on-premises environments to the cloud, as well as modernizing architectures and implementing serverless solutions. Beyond his role, Tiago is deeply committed to knowledge sharing and actively contributes to the AWS community through engagements, such as the AWS User Group Lisbon, educational workshops, and guest lectures at universities. He is passionate about education and innovation, and developed an open source mobile app, AWSary, which is an AWS dictionary designed to provide solution architect diagram drawings and quick insights into AWS services.</p> \n<h2>Learn More</h2> \n<p>Please visit the <a href=\"https://aws.amazon.com/heroes\" target=\"_blank\">AWS Heroes website</a> if you’d like to learn more about the AWS Heroes program or to connect with a Hero near you.</p> \n<p>— <a href=\"https://twitter.com/taylorjacobsen\" target=\"_blank\">Taylor</a></p>","author":"Taylor Jacobsen","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"89a93782dcbb1824f26890423304d34a50869b230ec2f08e5cc3170290cf4311","category":"Tech"}