{"title":"Cross Comparison of GALDIT Method Application in Three Costal Aquifers in Greece","link":"https://www.preprints.org/manuscript/202408.0764/v1","date":1723449810000,"content":"The intrusion of seawater in coastal aquifers in Greece is a particularly widespread phenomenon. The coastline of Greece has a length of 15,147 km. Once groundwater resources are contaminated, remediation strategies are difficult, costly and time consuming. In this paper three coastal aquifer systems of Peloponnese are studied. Initially the main ions and cations were calculated for the three aquifers. According to the results from hydrochemical analyzes Na+,Mg2+, Ca2+, SO4-2, Cl- have high values and are affected by the intrusion of seawater into the coastal aquifers. It estimates the vulnerability of groundwater to the intrusion of seawater. Using Geographical Information Systems (GIS) software, maps are prepared for the presentation of each parameter of the GALDIT method. The main factors that affect the seawater intrusion are basically presented in the 6 letters of the acronym GALDIT. The analysis of each parameter is as follows: Groundwater occurrence (aquifer type: unconfined, confined, and leaky confined), Aquifer hydraulic conductivity, depth to groundwater Level above the sea, Distance from the shore (inland distance perpendicular from shoreline), Impact of existing status of sea water intrusion in the area and Thickness of the aquifer. The final map that emerged from the study of the three groundwater systems shows the vulnerability of seawater intrusion in Peloponnese. The maps show that the groundwater system of Larissos presents lower vulnerability to the seawater intrusion compared to the other two groundwater systems. This is because the occurrence of flysch in the northern part of the area acts as a barrier to the penetration of seawater.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89aa003d4c33247aaa979d0b476a144dd2288692b927db1aa74e73e653c9a3e0","category":"Interdisciplinary"}