{"title":"Chest X-Ray Findings and Prognostic Factors in Survival Analysis in Peritoneal Dialysis and Hemodialysis Patients: A Retrospective Cohort Study","link":"https://www.preprints.org/manuscript/202407.0507/v1","date":1720165677000,"content":"Background and Objectives: To analyze survival in peritoneal and hemodialysis patients using chest radiography and biochemical parameters, determine dialysis etiologies and common mortality causes, reveal prognostic factors, and contribute to clinical practice. Materials and Methods: This retrospective cohort study was based on the analysis of data from 33 peritoneal dialysis and 37 hemodialysis patients who were followed and treated in our hospital between October 2018 and February 2020. Chest X-ray measurements (cardiothoracic index, pulmonary vascular pedicle width, right pulmonary artery diameter, diaphragmatic height) and biochemical parameters (urea, albumin, creatinine, parathormone, ferritin, hemoglobin, arterial blood gas, potassium) were analyzed to assess their impact on survival. Statistical analyses were performed using the Shapiro-Wilk, Wilcoxon signed rank test, Mann-Whitney U test, McNemar test, Kaplan-Meier survival analysis, Cox regression analysis, Spearman correlation test, Phi test, and ROC analysis. Results: The most common etiologies of dialysis were hypertension, type 2 diabetes mellitus, and urogenital disorders. The most common cause of death in peritoneal dialysis patients was peritonitis (38.5%), while in hemodialysis patients, it was cardiovascular diseases (47.4%). In chest X-ray measurements, pulmonary vascular pedicle width (p=0.003) and pulmonary artery diameter increased significantly (p=0.002) in hemodialysis patients, while pulmonary vascular pedicle width (p=0.028) and diaphragmatic height (p=0.004) increased significantly in peritoneal dialysis patients. No significant difference was found between the two groups in terms of biochemical parameters. Kaplan-Meier survival analysis showed that there was no significant difference in survival between peritoneal dialysis and hemodialysis methods (P&gt;0.05). Significant correlations were found between both radiologic status and clinical status and between intact parathormone levels and pulmonary vascular pedicle width (p=0.016, p=0.024). In Cox regression analysis, age, intact parathormone levels, iPTH/PVPW ratio, and clinical status were found to be factors affecting survival (p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89b89eb0cecd9836b9393347c7b7874dc4282e85c9f77732bf5f662ac7d444c6","category":"Interdisciplinary"}