{"title":"'There's no point dwelling on a s**t season' - Caleb Ewan hungrier than ever to be back on top","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/caleb-ewan-looking-ahead-after-tricky-2023","date":1677236158000,"content":"\n      <p><span>Few riders would lament winning seven races in a season as Caleb Ewan did last year but such is the calibre of the Australian sprinter that he considers his 2022 campaign bad. </span></p>\n<div></div>\n<p><span>The Lotto Dstny spearhead isn’t one to dwell on disappointment, as he has shown already with a win at the Tour Down Under prelude criterium last month, and a photo finish for second to Tim Merlier (Soudal - Quick-Step) on stage one of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uae-tour-everything-you-need-to-know\">UAE Tour</a> this week. </span></p>\n<p><span>Ewan needed a big break and to hit the reset button during the off-season following what was a “pretty stressful” year. His team was focused on points to avoid relegation, which it ultimately didn’t, and he sometimes fell afoul with luck, injury, illness and crashes. </span></p>\n<p><span>“It's not the first time I've had a bad season and I've also seemed to bounce back from it. You have to get back up, keep going and look forward to what's next and focus on your new goals because there is really no point in sitting back and dwelling on a s**t season, or a s**t race or whatever, you just keep going, keep moving forward and hope that it gets better,” Ewan says. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/i-ve-got-a-new-appreciation-of-hurt-meet-luke-plapp-ineos-grenadiers-aussie-champion-on-a-voyage-of-discovery\"><em><strong>Read more: 'I’ve got a new appreciation of hurt' - Meet Luke Plapp, Ineos Grenadiers' Aussie champion on a voyage of discovery</strong></em></a></p>\n<p><span>When asked to reflect on last season there is no time that the 28-year-old acknowledges the victories he did celebrate – stage wins at the Saudi Tour, Tour des Alpes-Maritimes et du Var, <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a>, Tour of Turkey, Deutschland Tour and triumph at GP de Fourmies – until he is prompted. </span></p>\n<p><span>“Yeah, I still won seven races,” he acknowledges. “It wasn't a really s**t season, I've had worse, but it's just not what I wanted to achieve that year. </span></p>\n<p><span>“I didn't really hit any of the markers that I wanted to for the whole year so that was disappointing. Like, I wanted to at least do well in maybe some of the Classics, San Remo or whatever, and then didn't do that, and then obviously for the Grand Tour stuff I wanted to win a couple of stages in maybe the Giro, same with the Tour, didn't do that, then didn't get selected for Worlds.” </span></p>\n<p><span>Ewan doesn’t have many takeaways from last year. He was ill before Milan-San Remo, which was his first major objective. “Bad timing,” he recalls. </span></p>\n<p><span>He then crashed on stage one of the Giro - “bad luck” - but rebounded to place second in another photo finish to Arnaud Démare (Groupama-FDJ) on stage six. “A race like that can go either way,” Ewan says of the result. </span></p>\n<p><span>He withdrew from the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d'Italia</a> after stage 11, slightly earlier than planned, to focus on the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>. “In hindsight I probably went into the Tour a little bit underdone, but still, it was a combination of being a little bit underdone and then there not actually being that many sprints,” he recalls. </span></p>\n<p><span>“In the end, I started feeling much better, and I wasn't the first one dropped every day, which was good in that last week, in the Pyrenees. That tells me maybe I was underdone at the start. </span></p>\n<p><span>“But even, like, little things, I think in Denmark the day Dylan Groenewegen won, if I got through and was able to sprint, I think I also could have won that stage. </span></p>\n<p><span>“All season it was just, like, you know, [if] little things were different or changed, I could have had a good season, or I could have looked back on my season and maybe actually achieved some goals that I set out for.” </span></p>\n<h3><b>Points and politics </b></h3>\n<p><span>In the background was that focus on accruing points, which rested heavy on him, as well as politics. Ewan underwent surgery to remedy a plate in his collarbone the day after the Tour finished. At the same time, he was mindful of the Commonwealth Games, which commenced four days after the Tour finished in Paris. Ewan then was concerned that skipping the elite men’s road race at the Commonwealth Games would potentially jeopardise his selection for the World Championships, which especially being in Australia for only the second time, was an obvious objective. </span></p>\n<p><span>AusCycling (formerly Cycling Australia) gave him the green light to compete at the Commonwealth Games, but his trade team did not. It put Ewan in a difficult position. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-04425.jpg?v=1677169376\" alt /></span></p>\n<p><em><span>Ewan represented Australia at the Tour Down Under this year (Zac Williams/SWpix.com)</span></em></p>\n<p><span>“My team didn't want me to go because they were like, obviously we're still in this points battle, if I crashed in Comm Games with my open wound it's not going to be good,” he recalls. </span></p>\n<p><span>“I had to make a decision and at the end of the day my team is the one that pays my salary, not Cycling Australia, so I had to go with their advice more than the Oz team's advice. </span></p>\n<p><span>“I didn't know what repercussions that would have but I knew that all they [AusCycling] had to say was like, ‘Yeah, you're not going good enough to go to Worlds, you didn't do enough this season.’ And like, how can I argue against that? I didn't have a great season.” </span></p>\n<p><span>Ewan’s non-selection for the elite men’s road race that Remco Evenepoel won ahead of Christophe Laporte and compatriot Michael Matthews was dubbed a snub at the time.</span></p>\n<p><span>“I definitely can tell you that I would have been good for Worlds, but if they didn't want me in the team, I gave them the best excuse not to put me in the team. There wasn't much I could argue against it, even though I definitely thought that I deserved a spot,” he says. </span></p>\n<h3><b>Beating the best, at their best </b></h3>\n<p><span>Ewan doesn’t need everything to go right for him to be victorious, or just on point. He is as equally good in a scrap as he is wide open road to the finish – physically and mentally. He keeps himself in check and rarely if ever appears perturbed. </span></p>\n<p><span>In fact, asked to name his best sprint to date, Ewan recalls stage three of the 2020 Tour, when the odds weren’t in his favour, as his most “impressive to watch”. </span></p>\n<p><span>“It was the one where I came from behind and I went through lots of gaps down the barrier and then got there in the end,” Ewan says enthusiastically. </span></p>\n<p><span>“I remember thinking, going through a gap, like, I think it was [Peter] Sagan, I was like, ‘S**t, if he drifts a little bit more to the right towards the barrier then I'm fucked.’ But I got through.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1269906421.jpg?v=1677166598\" alt /></span></p>\n<p><em><span>Ewan finds the gap on stage three of the 2020 Tour (Getty Images)</span></em></p>\n<p><span>It ties in with what we’ve been talking about: no one’s career trajectory follows a straight, upward line, especially in the frenzied and fast business that is sprinting. </span></p>\n<p><span>“That's what I mean,” Ewan continues. “Sometimes you get through like that, and I think if the same thing happened last year in the Tour, there was that one stage that Groenwegen won, that I got squeezed on the barrier, that's the thing, sometimes it stays open, sometimes it doesn't, and that's sprinting. </span></p>\n<p><span>“I shouldn't have won that stage [at the 2020 Tour] from where I was, but it was luck and skill in part that I just got through multiple gaps to where I needed to be and won.” </span></p>\n<p><span>At the beginning of the 2023 season Ewan hasn’t lost any of his shine or the drive that has made one of the world’s best sprinters and, on the flipside of that, spurs harsh self-assessment. </span></p>\n<p><span>While back in Australia, with his wife and two young kids, for the first time in three years, travelling across three different states and living out of a suitcase for two months, Ewan, as well as family visits and racing, kept tabs on his contemporary rivals. In Argentina at the Vuelta a San Juan the likes of Sam Bennett (Bora-hansgrohe) and Fernando Gaviria (Movistar) were drawing a line under their own travails with stage wins. There was also the prevalent Fabio Jakobsen (Soudal-Quick-Step), plus newcomers including Sam Welsford (Team DSM). Groenewegen (Jayco-Alula) opened the Saudi Tour with a win, adding to the intrigue of what is shaping to be a fiercely competitive season between the sprinters. It feels like for the first time in a while the WorldTour’s marquee fast men are back on their respective A-Games. </span></p>\n<p><span>“It's a bit worrying because there's not one guy that is just winning - it's multiple. But it means everyone is going good, which is exciting,” says Ewan. </span></p>\n<p><span>“It's good fun. I like it when guys are going good. At the end of the day, you want to beat the best going their best. That's what I want.” </span></p>\n<h3><b>Audible direction </b></h3>\n<p><span>In front of, or behind, depending how you look at it, every pure sprinter is a sprint train, and Ewan, as a face of a team with no real general classification ambitions, has been tinkering with his for a while now. </span><span><br /></span><span></span></p>\n<p><span>“The team are always backing me 100% but it's a matter of sometimes we don't get the lead-out right,” he says. </span></p>\n<p><span>Ewan competed for the national squad at the Tour Down Under and Cadel Evans Great Ocean Road Race last month, with Lotto Dstny, now second division, opting not to foot a purported $100,000 bill for the former. </span><span><br /></span><span></span></p>\n<p><span>At the UAE Tour he has linked up with his lead-out for the first time this season and lauded the signing of Jacopo Guarnieri. The 34-year-old effectively replaces Roger Kluge (Rad-Net-Osswald) in the line-up, but Ewan sees him playing a different role to that of the departed German. </span></p>\n<p><span>“He will speak in the lead-out and direct the guys, and that's probably something we were missing,” says Ewan, who often debriefs and gesticulates with teammates in the immediate aftermath of a race. </span></p>\n<p><span>“Roger was a very quiet, introverted guy so he wouldn't speak much, he wouldn't direct the guys as much, and that's kind of what he needed to do. </span></p>\n<p><span>“We definitely have the horsepower, we have such strong guys, but maybe we were lacking a little bit of direction and it can't always just come from me because I have to focus on the sprint, I can't be controlling what they do. </span></p>\n<p><span>“I think it's going to be really beneficial having a guy like Guarnieri, who can direct the guys a bit more and get the train in order.” </span></p>\n<p><span>Order is what Ewan will be looking to restore this year as he again takes aim at the classics and Grand Tours with a balanced perspective but insatiable appetite. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1467889706.jpg?v=1677170205\" alt /></span></p>\n<p><em><span>Ewan went painstakingly close to a first WorldTour win of the year in the UAE (Getty Images)</span></em></p>\n<p><span>In the off-season he had five or six weeks off to refocus. He went on holiday to the Maldives and then to Ireland, where his wife is from. The kids keep him busy. But outside of that there’s no talk of hobbies, it’s all bike racing. Now, he’s ready to go again. </span></p>\n<p><span>“I feel like I'm more motivated every year at the start of the year. I love winning, I want to try and be the best, and that's what motivates me,” he says. </span></p>\n<p><span>“There's no race in particular that motivates me, it’s not like I’m motivated to win Milan-San Remo or something, I just want to win everything, as much as I can. </span><span><br /></span><span>“I’m happy it's like that because I’m nervous of the day that I get back on my bike after an off-season and I’m like, ‘S**t, I don't want to do this anymore.’ </span></p>\n<p><span>“Luckily, I haven't got to that point yet. I still feel hungry to win more. And I hope that, in theory, I should be coming into my best years now, so let's see.” </span></p>\n<p><em><span>Cover pic by Zac Williams/SWpix.com</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"6dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"89c935d62e183e122d5c51e964215875abeee1d94f906d496c2455","category":"Cycling"}