{"title":"Intel’s Alder Lake big.little CPU design, tested: It’s a barn burner","link":"https://arstechnica.com/?p=1810145","date":1636030808000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/hero-800x516.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/hero.jpg\">Enlarge</a> <span>/</span> Our test rig marries the Alder Lake i9-12900K (pictured) or the i5-12600K with 64 GB DDR5 SDRAM, an MSI Carbon motherboard, SK Hynix Gold NVMe SSD, and Apex Gaming 850M PSU. Cooling is provided by a Corsair fluid cooler and triple fan radiator. (credit: Jim Salter)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>After spending several days with Intel's newest consumer CPU designs, we have some surprising news: they're faster than AMD's latest Ryzens on both single-threaded <em>and</em> most multithreaded benchmarks.</p>\n<p>We suspect this will be especially surprising to some, since Intel's newest desktop CPUs feature a hybrid \"<a href=\"https://en.wikipedia.org/wiki/ARM_big.LITTLE\">big.little</a>\" design similar to those found in ARM CPUs. AMD's flagship Ryzen 9 5950x is a traditional 16 core, 32 thread design, with all cores being \"big\" high-performance types with symmetric multithreading (SMT, also known as \"hyperthreading\"). By contrast, the i9-12900K offers 16 cores and only 24 threads—with eight \"performance\" cores featuring SMT and eight lower-performance \"efficiency\" cores with no SMT.</p>\n<p>Although the world largely understands big.little design in mobile CPUs—where the value of having slow but efficient cores for non-latency-sensitive tasks means longer battery life and less waste heat—the value isn't as well-understood in desktop CPUs, where power and thermal budgets aren't such an obvious problem. But there's still good reason for hybrid designs even on the desktop—die space remains sharply limited in CPUs, and you can fit more of the smaller \"efficiency\" cores into a given package size.</p></div><p><a href=\"https://arstechnica.com/?p=1810145#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1810145&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"89cd3da0a3b54636201dbada82fca7bd2cf8b88daf17559f5b68253329b0c281","category":"Tech"}