{"title":"Remote sensing for rangeland conservation monitoring: Impacts of livestock removal after 15 years","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14730?af=R","date":1721718823000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/0f9dd386-2519-4e65-8da1-33c22a09aaa6/jpe14730-toc-0001-m.png\" alt=\"Remote sensing for rangeland conservation monitoring: Impacts of livestock removal after 15 years\" />\n<p>The ability to quantify management-related impacts in land condition using freely available remote sensing data could support improved management by all stakeholders in these regions. The method leverages readily available satellite remote sensing data in a study design that is not dependent on large geospatial and climatic datasets that are not necessarily available in remote regions.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDegradation from overgrazing of global arid rangelands is of significant concern for this widespread terrestrial ecosystem, and the people who rely on its sustainable use. Addressing this degradation requires a better understanding of how livestock removal and conservation management actions affect the rehabilitation of land condition. However, the dominant effect of climate and meteorological variability on arid vegetation makes isolating management-induced change a difficult task.\n\nWe present an analytically simple method for measuring relative land condition by assessing differences in remote-sensing-derived persistent fractional vegetation between adjacent stocked and destocked regions over time. The 22-year observation period focusses on vegetation recovery at a long-established sheep station after the removal of livestock and the introduction of conservation-focussed management. The study region, in the southern Australian arid rangelands, comprises sparsely vegetated chenopod shrublands and acacia woodlands across low-lying plains. Comparison is made to immediately surrounding stocked properties in a spatial design where climate and biogeographic variables remain consistent across the study area.\n\nWe found an unequivocal relative increase in vegetation cover, and reduction of bare ground cover at the destocked property that became evident approximately 8 years after a reduction in grazing pressure. Distinctly higher persistent vegetation cover was maintained, even during periods of drought.\n\nNon-photosynthetic vegetation cover was most indicative of long-term change and increased by 1.1% relative to surrounding areas. Photosynthetic vegetation cover increased by 0.5%, while bare ground cover decreased by 2.1%.\n\nThese cover changes, particularly in the non-photosynthetic vegetation and bare ground components spatially coincide with the fenced boundary of the destocked property.\n\n<i>Synthesis and applications</i>: The ability to quantify management-related impacts in land condition using freely available remote sensing data could support improved management by all stakeholders in these regions. The method leverages readily available satellite remote sensing data in a study design that is not dependent on large geospatial and climatic datasets that are not necessarily available in remote regions.\n</p>","author":"Angus Retallack, \nSami Rifai, \nGraeme Finlayson, \nBertram Ostendorf, \nMegan Lewis","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"89d0d23e7b72201c3f9ef2ab9d0cb81c861907c7de40c83cc7d1037472c5e57c","category":"Environment"}