{"title":"Histopathological Insights and Therapeutic Prospects of MCC950 in Diabetic Cardiac Autonomic Neuropathy in a Type 1 Diabetes Wistar Rat Model","link":"https://www.preprints.org/manuscript/202409.1907/v1","date":1727254851000,"content":"Diabetic cardiac autonomic neuropathy (DCAN) is a severe complication of type 1 diabetes mellitus (T1DM) characterized by autonomic nerve fiber dysfunction in the heart and blood vessels. This study aimed to elucidate the histopathological mechanisms underlying DCAN and evaluate the therapeutic potential of MCC950, an NLRP3 inflammasome inhibitor, in a Wistar rat model. Male Wistar rats were divided into control and T1DM groups, with diabetes induced by streptozotocin (STZ) injection. Following confirmation of DCAN through elevated serum noradrenaline levels, diabetic rats were subdivided into positive control (insulin-treated), treatment (MCC950), and untreated groups. The stellate ganglia, thoracic aorta, and left ventricle were dissected for histological examination using Haematoxylin and Eosin (H&amp;E) and Masson Trichrome staining. STZ-induced hyperglycemia was evident by Week 2 and sustained throughout the study. Serum noradrenaline levels significantly increased by Week 14 in diabetic rats, indicating DCAN onset. Histological analysis revealed atrophy in stellate ganglia, endothelial damage in the thoracic aorta, and myocardial fibrosis in untreated diabetic rats. MCC950 treatment preserved ganglionic structure, mitigated vascular damage, and reduced myocardial fibrosis, demonstrating its potential in attenuating DCAN progression. These findings highlight MCC950 as a promising therapeutic agent for DCAN by targeting inflammation and preserving autonomic and cardiovascular function. Further investigations are warranted to validate MCC950’s efficacy in human trials, with the potential to improve clinical outcomes for T1DM patients at risk of DCAN.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89d1604061d836ff8db079a80476ca4fee5768f688792c915cbd2932e056bfcf","category":"Interdisciplinary"}