{"title":"Optimizing Productivity of Tomato (Solanum lycopersicum L.) through Integrated Nutrient Sources and Inoculation with Arbuscular Mycorrhizal Fungi and Azospirillum spp.","link":"https://www.preprints.org/manuscript/202408.1650/v1","date":1724337269000,"content":"Integrated nutrient management (INM) is an approach that optimizes the benefits derived from various nutrient sources and beneficial soil microorganisms in an integrated manner to increase crop productivity while maintaining soil fertility. An open-field experiment was conducted at Cabuyao, Laguna, Philippines to investigate the effects of combining chemical fertilizers, vermicompost, arbuscular mycorrhizal fungi (AMF), and nitrogen-fixing bacteria (Azospirillum spp.) on the growth, nutrient uptake and yield of tomato. The experiment was arranged in a randomized complete block design replicated four times. The treatments were recommended rate of chemical fertilizer (RRC), combined 50% RRC and 4 t ha-1 vermicompost (INM 1), AMF inoculation with combined nutrient sources (INM 2), and dual inoculation with AMF and Azospirillum in synergy with combined nutrient sources (INM 3). Results revealed that the growth parameters were not significantly affected by the treatments, but the highest data were observed in the treatments under INM. AMF inoculation significantly increased phosphorus, potassium, calcium, and magnesium uptake of tomato while INM 3 recorded the highest nitrogen uptake. Treatments with vermicompost application recorded significantly higher uptake of copper. INM 1, INM 2, and INM 3 gave a significantly higher fruit yield than the RRC with an increase of 7.98%, 13.40%, and 13.65%, respectively. The percentage of mycorrhizal root colonization and number of rhizosphere spores were higher in mycorrhizal plants. Fruit yield and AMF root colonization are positively correlated with uptake of various nutrients. The results imply that these INM strategies can improve growth of tomato, increase fruit yield, reduce the amount of chemical fertilizers applied, and potentially lead to economic, soil health and environmental benefits.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89d11b9b6058dce04ef076e6c38c2c753665eb82fe5d511ca2da3270a7c045b7","category":"Interdisciplinary"}