{"title":"Variability in the phytoplankton response to upwelling across an iron limitation mosaic within the California current system","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12534?af=R","date":1708759193000,"content":"<h2>Abstract</h2>\n<p>Coastal upwelling currents such as the California Current System (CCS) comprise some of the most productive biological systems on the planet. Diatoms dominate these upwelling events in part due to their rapid response to nutrient entrainment. In this region, they may also be limited by the micronutrient iron (Fe), an important trace element primarily involved in photosynthesis and nitrogen assimilation. The mechanisms behind how diatoms physiologically acclimate to the different stages of the upwelling conveyor belt cycle remain largely uncharacterized. Here, we explore their physiological and metatranscriptomic response to the upwelling cycle with respect to the Fe limitation mosaic that exists in the CCS. Subsurface, natural plankton assemblages that would potentially seed surface blooms were examined over wide and narrow shelf regions. The initial biomass and physiological state of the phytoplankton community had a large impact on the overall response to simulated upwelling. Following on-deck incubations under varying Fe physiological states, our results suggest that diatoms quickly dominated the blooms by “frontloading” nitrogen assimilation genes prior to upwelling. However, diatoms subjected to induced Fe limitation exhibited reductions in carbon and nitrogen uptake and decreasing biomass accumulation. Simultaneously, they exhibited a distinct gene expression response which included increased expression of Fe-starvation induced proteins and decreased expression of nitrogen assimilation and photosynthesis genes. These findings may have significant implications for upwelling events in future oceans, where changes in ocean conditions are projected to amplify the gradient of Fe limitation in coastal upwelling regions.</p>","author":"YuanYu Lin, \nOlivia Torano, \nLogan Whitehouse, \nEmily Pierce, \nClaire P. Till, \nMatthew Hurst, \nRobert Freiberger, \nTravis Mellett, \nMaria T. Maldonado, \nJian Guo, \nMariam Sutton, \nDavid Zeitz, \nAdrian Marchetti","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"89d79b5a527c7df92574e27bdced78fb4c08638f6ef4226d3cd5ef5c20b0d0ff","category":"Environment"}