{"title":"Searching for drivers of the patchy distribution of sympatric deposit‐feeding sea cucumbers: A multi‐scale monitoring study","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12649?af=R","date":1722319456000,"content":"<h2>Abstract</h2>\n<p>Three sea cucumber species, <i>Holothuria atra</i>, <i>Holothuria leucospilota</i>, and <i>Stichopus chloronotus</i>, are patchily distributed within the coral reefs of Reunion Island, exhibiting locally high densities (&gt; 1 ind m<sup>−2</sup>). Previous studies stated that these sympatric species have thrived for almost four decades; however, factors involved in their distribution and spatiotemporal dynamics are not well understood yet. The aims of this study are to analyze the fine-scale spatiotemporal dynamics of these sympatric species and identify the key sedimentary factors (substrate composition and cover) involved in their distribution. Sea cucumber populations and sedimentary factors were monitored along back-reef and shore-to-ocean gradients during four consecutive seasons. Meanwhile, feeding behavior was assessed by measuring motility and excretion rates. Each species presents its own dynamic between the beginning and the end of the monitoring: increase of density for <i>H. leucospilota</i>, stability for <i>H. atra</i>, and decrease for <i>S. chloronotus</i>. Distribution of <i>H. atra</i> was closely related to substrate organic features (high organic matter, chlorophyll <i>a</i>, and ∂<sup>13</sup>C), <i>H. leucospilota</i> with the occurrence of seagrass and <i>S. chloronotus</i> with none. Results on feeding behavior showed that <i>S. chloronotus</i> emerges as a specialist while the two others appear to be generalists. Conspecific attraction or recruitment pattern may drive the high-density patchy distribution of both <i>Holothuria</i> species, while the drastic decrease of <i>S. chloronotus</i> could be linked to unstudied factors related to predation or climate change. Water flow regime could also have a significant effect on the patchy distribution of these species, therefore, further studies should pay particular attention to this factor.</p>","author":"Joséphine Pierrat, \nLéa Urbistondoy, \nAlexandre Modi, \nBetsy Viramoutou, \nPatrick Frouin","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"89dc3a5aa4bb363664cd6fde88fa072e3dc3150e5222043c17f58fb81a3c51e6","category":"Environment"}