{"title":"The Comparison and Brewing Value of Saaz Hop Pedigree","link":"https://www.preprints.org/manuscript/202408.0856/v1","date":1723535600000,"content":"The well-known hop variety Saaz, which gives the Pilsner lager beer characteristic hop aroma may be threatened by climate change in the future. Therefore, new Saaz-related hop varieties, Saaz Late, Saaz Brilliant, Saaz Comfort, and Saaz Shine were bred recently. To evaluate whether these varieties are ac-ceptable for traditional lagers, their comparison was carried out. For this purpose, sensorial and chemical analyses of hops and related beer including namely analysis of hop resins and hop oils were performed. Sensory profiles of Saaz varieties are very similar (fine hoppy aroma, floral, herbal) except for Saaz Comfort which has a little higher aroma intensity, and Saaz Shine which has the most noticeable fruity scent with traces of citrusy of all. Also, the chemical profiles are very close, α-humulene, β-pinene, (E)-β-farnesene, β-caryophyllene, and myrcene are the most abundant. As a result of decoction mashing and kettle-hopping technology with bottom fermentation, are very similar lager beers with hoppy, floral, herbal, fruity, and spicy aromas. Typical hop oils are farnesol, linalool, methyl geranate, β-pinene, and limonene. The high concentration of farnesol in beer correlates with the concentration of (E)-β-farnesene and farnesol in hops. New Saaz varieties are well used for the production of the Pilsner type of lager without affecting the traditional sensory aroma of this widespread style. Varieties have a higher yield and concentration of bitter acids and hop oils. Moreover, Saaz Shine and Saaz Comfort have very good re-sistance to drought, which is an important property from a climate change perspective.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89dca4a6326f5e9599664ad3b8a5b269ff89007ae1d050dc4327f906bb449972","category":"Interdisciplinary"}