{"title":"Impact of Poly-L-Lysine Dendrimers on the Stability and Effectiveness of Vitamin C in Dermocosmetic Use","link":"https://www.preprints.org/manuscript/202408.0078/v1","date":1722564293000,"content":"Introduction: \nThis study explores the stabilization and efficacy enhancement of Vitamin C in dermocosmetic formulations through its association with Poly-L-lysine dendrimers. Vitamin C, critical for collagen synthesis and skin hydration, faces challenges due to its instability and low bioavailability. The research aims to evaluate the liposolubility of Vitamin C in the presence of Poly-L-lysine vectors, assess its stability in both aqueous and emulsion media, and determine the moisturizing efficacy of second-generation Poly-L-lysine (diameter: 4.5 nm, PM: 8.6 kDa) and third-generation Poly-L-lysine (diameter: 7 nm, PM: 22 kDa). Methods : Methods included high-performance liquid chromatography (HPLC) for concentration analysis, partition coefficient determination, and stability assessments under various conditions. Hydration potential and kinetics were evaluated on 11 volunteers using a corneometer.  \nResults: The liposolubility of Vitamin C increased by over 300% with Poly-L-lysine, enhancing its stability. Emulsion stability tests confirmed that formulations with Poly-L-lysine maintained their physical and chemical properties under stress conditions. Physiological tests showed significant improvements in skin hydration with the Poly-L-lysine/Vitamin C formulations, achieving 66.2% hydration increase at T3h for third-generation dendrimers. \nConclusion\nIn conclusion, Poly-L-lysine vectors significantly enhance the stability and moisturizing efficacy of Vitamin C in dermocosmetic formulations. These findings suggest that Poly-L-lysine can mitigate Vitamin C's instability and improve its dermocosmetic benefits, offering a promising approach for advanced skincare solutions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89dfd5abfadaeb062e0ec78d78c7b2072e82ee728106363b113bfc57f1d2217f","category":"Interdisciplinary"}