{"title":"Seismic Hazard Resilience in Montenegro: A Comprehensive Qualitative Analysis of Local Preparedness and Response Mechanisms","link":"https://www.preprints.org/manuscript/202405.0893/v1","date":1715667858000,"content":"Understanding and improving seismic resilience in regions prone to earthquakes is crucial for mitigating the effects of natural disasters. This study zeroes in on Montenegro, a region frequently affected by seismic activity, with the goals of critically evaluating current resilience levels, pinpointing key preparedness gaps, and assessing the efficacy of existing response strategies. Employing qualitative methods, the research involved semi-structured interviews with residents from Montenegro's most vulnerable areas, including Nikšić, Podgorica, Bar, Kotor, Cetinje, Budva, Herceg Novi, and Berane. These participants, selected for their firsthand experiences with significant earthquake impacts, contributed to a deeper understanding through discussions that aligned with a broad conceptual framework, exploring everything from the nuances of citi-zen resilience to local government responses and personal preparedness. The study aimed to gather in-depth views on community resilience during earthquakes, evaluate citizens' knowledge and preparedness for such disasters, and examine local governance strategies for enhancing seismic resilience. It revealed varying resilience levels across communities, with some displaying well-structured strategies while others showed notable deficiencies. The findings underscore the urgent need for community-specific preparedness programs and improvements in both structural and educational frameworks to enhance resilience. This research highlights the necessity of a comprehensive approach that includes detailed risk assessments, tailored preparedness training, and stronger public awareness efforts. Additionally, it emphasizes strengthening local governments' capabilities to enact and sustain effective response measures to ensure ongoing community resilience against future seismic challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"89e631f771496118861e35ae805abb0f1debfbceb7b5bf75ac439125901e240d","category":"Interdisciplinary"}