{"title":"Obscure Mobile Design Techniques That Boost UX","link":"https://smashingmagazine.com/2021/03/solutions-mobile-design-boost-user-experience/","date":1615213800000,"content":"<p>It’s no secret that smartphone usage has doubled over the last five years, accounting for an <a href=\"https://www.statista.com/statistics/330695/number-of-smartphone-users-worldwide/\">estimated 3.8 billion users</a> this year. This tells us clearly where people’s attention is and how important mobile web designers are to improving the user experience.</p>\n<p>We’ve seen plenty of web design experiments in recent years adopted by companies of all sizes. These changes include <a href=\"https://webflow.com/blog/web-design-trends-2021\">trends</a> such as the infamous parallax scrolling, non-traditional layouts, and improved accessibility with dark mode. However, many paths are still left to explore, if we’re willing to break out of trends.</p>\n<p>To get those creative juices flowing, let’s look at some <strong>hidden design gems</strong> related to navigation and confirmation dialogs, the waiting experience, and swiping animations. While these solutions are mostly unconventional, the point isn't to highlight them for their own sake. Design solutions have to be built with the <strong>pillars of accessibility and usability</strong>, but they can be refined according to your ultimate goals for user interaction and experience.</p>\n<p>So, let’s bring these elegant off-the-beaten-path design solutions into the spotlight.</p>\n<h3>Rethinking Navigation</h3>\n<p>The change of <a href=\"https://www.smashingmagazine.com/2019/08/bottom-navigation-pattern-mobile-web-pages/\">pinning the navigation menu to the bottom</a> has been a game-changer for handheld devices because it allows for more natural thumb-controlled navigation. But as smartphone screens get more expansive, the <strong>thumb’s reach</strong> gets more restricted. Therefore, we’re long overdue for new mobile design solutions that allow easy access using only the thumb.</p>\n<p>Some creative approaches to this problem combine elegant design and functionality. Let’s look at a couple of examples.</p>\n<h4>Nature Encyclopedia</h4>\n<p><a href=\"https://blog.tubikstudio.com/case-study-nature-encyclopedia-ui-design-for-education/\">Nature Encyclopedia</a> is a great learning resource for youth and adults alike. It features interactive infographics and on-point illustrations, but that’s not the part that captures our curiosity.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/7414df1c-0f3c-4e5d-9660-1ba408f974a5/2-solutions-mobile-design-boost-user-experience.png\" /></p>\n<p>In addition to all of the swiping functionality that we’ve become accustomed to in other mobile apps, there’s a nifty feature that allows you to change the information displayed by <strong>scrolling a wheel</strong>. You can also access previously shown information simply by scrolling the other way.</p>\n<p>While the action wheel was implemented to ease access to information, it could also be used to navigate between screens. This could potentially address the restriction of the thumb’s reach at the left and right edges of the screen, as you would now be able to effortlessly swipe left or right to navigate.</p>\n<h4>V For Wiki</h4>\n<p>You can already access Wikipedia in your phone’s browser. However, <a href=\"https://v-for-wiki.com\">V for Wiki</a> has made it even more accessible by featuring an elegant style of presenting the content. It features a nifty world map that instantly pops up information related to the area you’re browsing from.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c207406d-7f14-46a8-ba2b-fd4232a5f645/v-for-wikipedia-opt.jpg\" /></p>\n<p>While the interactive map makes browsing a lot more entertaining, it’s not the feature that first caught our eye.</p>\n<p>If you look at the navigation, on top of the guide you’ll see <strong>interactive lines to various landmarks</strong>, and you can scroll between the locations horizontally. This is a beautifully designed alternate way to navigate the menu because you can use your thumb effortlessly.</p>\n<p>This approach could serve as inspiration for a <strong>scrolling navigation menu</strong>, in which a customer can bring the far-left or far-right menu items closer by scrolling the wheel.</p>\n<h4>Ada</h4>\n<p><a href=\"http://www.danieldiggle.com/ada.php\">Ada</a> is an application for the startup <em>Ada Health</em>, which aims to revolutionize how we approach going to the doctor with modern solutions, such as AI, video calls, and interactive design. We’ve all gone through the rabbit hole of looking on Google for advice on symptoms, so getting straightforward access to reliable information is a godsend.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1008e869-d847-47b2-b58c-c352e5ee1e5d/4-solutions-mobile-design-boost-user-experience.png\" /></p>\n<p>Apart from the app’s clean look, it’s clear from the start that it’s designed to be used effortlessly with the thumb, because the navigation button is on the bottom right and <strong>opens the menu in a sidebar on the right</strong>. Furthermore, all of the actionable elements are within reach of the thumb, so the user would generally only need to click on the bottom or the right sidebar to get to where they want to go.</p>\n<p>Ada, then, is another example of solid navigation built into the app’s concept from the start. The experience of navigating the app feels natural and accessible.</p>\n<h3>Overhauling Confirmation Dialogs</h3>\n<p>Confirmation dialogs face the same challenges as navigation menus as a result of people <a href=\"https://www.smashingmagazine.com/2020/02/design-mobile-apps-one-hand-usage/\">holding their smartphones with one hand</a>. The options are usually binary, one on the left side and the other on the right. As handheld devices get wider, access to one of the two dialog choices becomes complicated due to the <a href=\"https://www.smashingmagazine.com/2016/09/the-thumb-zone-designing-for-mobile-users/\">limited range of thumb movement</a>.</p>\n<p>Let’s look at some unconventional solutions to hard-to-reach confirmation dialogs.</p>\n<h4>Vice Versa</h4>\n<p><a href=\"https://www.behance.net/gallery/12419409/VICE-VERSA-diagonal-UI-optimized-for-single-hand-IX\">Vice versa</a> is a diagonal UI <strong>pattern for binary options</strong>. It takes into account the thumb’s natural movement and acknowledges the limitations of abnormal movement. On a small screen, you could reach to the opposite side with your thumb, but that creates tension and feels uncomfortable.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0b834591-c103-489f-af60-27016fefbe62/6-solutions-mobile-design-boost-user-experience.png\" /></p>\n<p>The <em>vice versa pattern</em> addresses this problem by <strong>diagonally dividing the screen in two</strong>, allowing binary options to be made using only the thumb. Not only does it make it easier for the thumb to reach both options, but the accuracy issue is solved by giving users a larger area to touch.</p>\n<p>While the concept is intended to make voting mechanisms easily accessible, you could adapt this interactive design to all kinds of binary options.</p>\n<p>One of the obvious downsides of the pattern is that it’s heavily optimized for right-handed usage. The solution to this problem is that a customer can shake the phone, and the orientation will change. Good solution? We don’t know, but definitely an interesting alternative for confirmation dialogs.</p>\n<h4>Omni Swipe</h4>\n<p>Another solution for hard-to-reach confirmation buttons (or navigation, for that matter) is found in <a href=\"https://www.behance.net/gallery/12419409/VICE-VERSA-diagonal-UI-optimized-for-single-hand-IX\">Omni Swipe</a>. While this concept is meant for personalizing a smartphone’s UI, it could also be adapted to standalone applications.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ba9d6d68-0d0e-401a-bf3b-01120d42961e/9-solutions-mobile-design-boost-user-experience.png\" /></p>\n<p>While most navigation buttons open the menu horizontally or vertically, Omni Swipe allows users to <strong>access the controls in the thumb’s range of movement</strong>. This solves the complex challenge of creating a confirmation solution for all screen widths, because, regardless of size, the actionable elements would appear under the user’s thumb.</p>\n<p>Unlike the last concept explored, which allows only binary options, this solution has virtually no limitation to the choices you can add to the menu.</p>\n<h3>Gamifying The Waiting Experience</h3>\n<p>In a study by Statista in 2020, <a href=\"https://www.statista.com/forecasts/997098/online-purchases-by-device-in-the-us\">65% of respondents</a> in the US said they used a smartphone for online shopping in the past 12 months. This indicates that e-commerce UX and mobile design go hand in hand. Furthermore, if we look at modern <a href=\"https://websitesetup.org/best-ecommerce-platform/\">e-commerce platforms</a>, we can see that pretty much all of them highlight mobile-optimized themes. Together, both of these factors paint a clear picture of where the online retail industry is headed.</p>\n<p>However, even the slightest disturbance can cause a cart to be abandoned or create a negative shopping experience. Research into the <a href=\"https://www.paulolyslager.com/psychology-speed-perception/\">psychology of speed perception</a> shows that a person’s mood affects how they perceive time. In a relaxed and happy environment, you’ll sense time flying by. However, if you’re grumpy, in a bad mood, or anxious, time seems almost to stand still.</p>\n<p><strong>Loading screens</strong>, shipping flows, preparation stages, and so on all keep users waiting. Let’s look at examples of how mobile designers have tackled the perception of speed in the online food-ordering and food-delivery industry.</p>\n<h4>Wolt</h4>\n<p>We used to get anxious waiting in line at a canteen. Well, we still do, but nowadays, we can comfortably order food online and have it delivered to us. However, we still need to wait until the courier arrives.</p>\n<p><a href=\"https://wolt.com/en\">Wolt</a> is one of the many apps that enable you to purchase food and have it delivered to your doorstep by a courier. If you didn’t have anything better to do, you’d feel like, instead of waiting in line, you’d be waiting for the courier instead.</p>\n<p>Wolt has numerous nifty features that target this perception of speed. It shows you the progress in stages, notifying you once a step is complete and showing you the courier’s GPS location. There’s also a <strong>clever little game</strong> hidden away that helps you to pass the time more quickly and elevate your mood (if you’re OK with being a little competitive). In this minigame, you tap the screen as many times as you can in five seconds, trying to beat Wolt’s team.</p>\n<p>While a simple feature, it plays straight into human psychology. Even though the gaming element doesn’t take away your feeling of hunger, it helps you to pass the time more quickly.</p>\n<h4>Bolt Food</h4>\n<p>In the previous example, we saw how gamifying waiting times helps users to pass the time more quickly. <a href=\"https://dribbble.com/Fireart-d/projects/1483070-BoltFood\">Bolt Food</a> is another example of a food courier facing the same challenge of waiting times.</p>\n<p>Their approach to showing progress is to <strong>animate the delivery steps</strong>. While not a straightforward game, it still combines a sense of movement with the user’s perception of time. In short, the principle is that if something is moving, then it’s making progress. If the user were to stare at a lifeless screen, their sense of time would slow down, and, with an empty stomach, that would make them more anxious.</p>\n<p>So, if your service relies on multiple steps, instead of taking the order and sending a <a href=\"https://blog.mailtrap.io/confirmation-email-examples/\">confirmation email</a> afterward, engage with the customer by showing progress at all stages.</p>\n<h3>Using Animation For Swiping</h3>\n<p><a href=\"https://thenextweb.com/dd/2015/11/16/why-cards-are-dominating-mobile-design/\">Card screens</a> have long been a favorite of designers. Customers can easily access different parts of an app simply by <strong>swiping and switching cards</strong>. However, instead of just applying the swiping function’s UI aspects, you could <a href=\"https://www.smashingmagazine.com/2017/08/relationship-gamification-modern-persuasion/\">gamify the app</a> to enhance the user experience.</p>\n<p>It’s common for people to <strong>react to movement</strong> and get drawn into animation. Let’s look at a couple of examples that use the gamify principle in action.</p>\n<h4>Bookotel</h4>\n<p><a href=\"https://www.behance.net/gallery/94907491/Restaurant-reservation-app\">Bookotel</a> is an online reservation app for restaurants and cafes. What strikes home with this app’s design is the innovative way they’ve created the <strong>swiping animation</strong> in the intro cards.</p>\n<p>Instead of just switching to the next card, the <strong>whole application seems to move</strong> and transform to the following image, message, and prompt.</p>\n<p>We don’t see this interaction applied to other parts of the application, so we’re left with some guesswork about how it would look on a larger scale. However, you can’t deny that it would draw the user in and get them to play around with the app.</p>\n<p>It’s worth noting that these movements might need to be readjusted if the customer opts-in for <strong>reduced motion</strong> to prevent accessibility issues from creeping in.</p>\n<h4>Teatr Lalka</h4>\n<p><a href=\"https://teatrlalka.pl/en\">Teatr Lalka</a> was one of the first puppet theatres in Poland and is now over 75 years old. However, its website is anything but ancient. Its dominant motif is <strong>interactivity</strong>, which is what you’d hope to see on an entertainment-related website.</p>\n<p>The first animations you see when visiting Teatr Lalka’s website are the puppets. While representing the actual puppets used in the shows, they also serve another purpose: gamification. You can <strong>swipe through animated puppets in a carousels</strong> and interact with them by clicking on them, prompting sound and vibrations from your smartphone. The puppets also react to tilting. It’s a wonderful example of how a mobile website can engage with the user from the very first page.</p>\n<p>You can apply the same techniques to other applications and websites, enhancing the user experience and playfully engaging with visitors.</p>\n<h3>Unconventional Solutions Pave The Way For Future Mobile Design</h3>\n<p>There you have some clever solutions to seemingly simple problems; solutions that hopefully improve the user experience in turn. While <a href=\"https://www.smashingmagazine.com/2020/03/web-design-trend-popular/\">following trends</a> isn’t necessarily bad, veering to the edge of innovation can yield a more rewarding result.</p>\n<p>With user experience becoming an ever more critical part of our digital lives, it pays to see things from a psychological perspective. Don’t be afraid to test cutting-edge solutions that play into people’s habits, psychology, and sense of convenience. It might be worth it.</p>\n<h4>Further Resources</h4>\n<ul>\n<li><a href=\"https://www.interaction-design.org\">Interaction Design Foundation</a></li>\n<li><a href=\"https://dribbble.com\">Dribbble</a> (for inspiration)</li>\n<li>“<a href=\"https://www.thinkwithgoogle.com/marketing-strategies/app-and-mobile/\">App &amp; Mobile</a>”, Think With Google</li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"89ed88d17cea92738fd130ba46dfae469624469d06aafd545c1aa57e1d74cdfd","category":"Tech"}