{"title":"EU suspects Facebook of abusing power with Marketplace, report says","link":"https://arstechnica.com/?p=1767753","date":1622043118000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/10/marketplace-newsroom-800x600.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/10/marketplace-newsroom.png\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The European Commission is on the verge of opening a formal probe of Facebook and its free Marketplace service, according to reports from Reuters and the Financial Times.</p>\n<p>While the scope of the investigation is still being determined, the European Commission, the bloc’s executive arm, has queried Facebook and its competitors on at least three separate occasions. Those questions aimed to determine whether, in pushing Marketplace on its users, Facebook abused its market power. Given that a formal probe seems imminent, it’s likely that EC officials believe there’s a decent chance the company did.</p>\n<p>Facebook’s Marketplace first appeared in 2016, and at the time, it was mostly viewed as a <a href=\"https://arstechnica.com/information-technology/2016/10/facebook-wants-you-to-ditch-craigslist-and-sell-stuff-using-its-app-instead/\">competitor to Craigslist</a>. Conceptually, Marketplace and Craigslist are similar in that both allow people to post free, local classified advertisements. Craigslist has been slow to update its core product—superficially, it still looks like a Web 1.0 product, and it didn’t offer an official app <a href=\"https://www.techspot.com/news/83037-craigslist-has-finally-received-own-mobile-app.html\">until 2019</a>—but Facebook’s Marketplace was mobile-friendly out of the gate and was soon prominently featured both on Facebook's modern website and as a tab in its near-ubiquitous app.</p></div><p><a href=\"https://arstechnica.com/?p=1767753#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767753&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"89f73c0eaaaeb1f268ed002af8c864f5f47217a00546aeb63aeb1239531a633f","category":"Tech"}