{"title":"Characterization and Customization of Individual EDS Detectors to Improve X-ray Microanalysis of Light Elements","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.096/7719518?rss=1","date":1721779200000,"content":"<span>In energy dispersive spectrometry (EDS) detectors, incoming X-rays ionize Si atoms of the semiconductor sensor to produce electron-hole pairs and the electrons then drift towards the anode. The depth at which electron-hole pairs are created inside the sensor depends on the photoelectric absorption of incoming X-rays in Si and scattering of resulting photoelectrons [<a href=\"#ozae044.096-B1\">1</a>, <a href=\"#ozae044.096-B2\">2</a>]. As shown in Figure 1, X-rays with an energy less than 1 keV or slightly above the Si K absorption edge are completely absorbed within the first micrometers, whereas high-energy X-rays are absorbed at greater depth inside the sensor. Absorption near the surface means that electron-hole pairs may get trapped or recombined, resulting in a loss of charge and therefore counts appearing in the spectrum at lower energies than the true energy of the incoming X-rays. This phenomenon is known as incomplete charge collection (ICC). It is observed as a tail on the low energy side of X-ray peaks, an increase in spectral resolution, and a shift of the centroid [<a href=\"#ozae044.096-B1\">1-4</a>]. Figure 2 compares two spectra acquired from detectors with significant and negligible ICC. Especially for light elements, as their only characteristic X-ray lines are below 1 keV, ICC can adversely impact element identification (peaks don’t appear at the right energies and tailing may complicate the detection of minor elements [<a href=\"#ozae044.096-B2\">2</a>, <a href=\"#ozae044.096-B3\">3</a>]), deconvolution (width and shape of peaks don’t match theory [<a href=\"#ozae044.096-B2\">2</a>]) and quantification (counts in tail need to be included in peak profiles to get the correct net intensity [<a href=\"#ozae044.096-B3\">3</a>, <a href=\"#ozae044.096-B5\">5</a>]).</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"89f8fb89b3b566f94785c58c0d55a226c4ad8021163d46d4b07904b1b3297e3c","category":"Environment"}