{"title":"Critical linkages among floodplain hydrology, geomorphology and ecology along a lowland meandering river, Illinois, USA","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2661?af=R","date":1715929200000,"content":"<h2>Abstract</h2>\n<p>The ecology of forested floodplains is intricately linked to river hydrology through the frequency, magnitude, timing and duration of floodplain inundation. Spatial variability in inundation characteristics is influenced by the geomorphic template of a floodplain, both in terms of the topography of floodplain features and connectivity of these features to the main river channel. Spatial variability in inundation, in turn, has the potential to produce spatial variability in forest ecological characteristics. This study examines the influence of floodplain geomorphic features on spatial variability in inundation frequency as well as the relationship between these geomorphic features and the ecological characteristics of a floodplain forest. The frequencies of floods of different magnitudes are determined from flow-duration analysis of over 100 years of discharge data for a lowland meandering river in Illinois, USA. Data on discharge, stage, and topography are then used to calibrate a two-dimensional hydraulic model of flow across the floodplain at different levels of inundation. Integrating the frequency and inundation data yields mapping of average annual inundation frequency for different parts of the floodplain. Significant differences in inundation frequency correspond to three distinct floodplain geomorphic features: secondary channels (frequency = 12%), closed depressions (frequency = 4%) and the floodplain surface (frequency = 3%). Tree density is similar among the three types of geomorphic features, but tree species composition and canopy density differ significantly between secondary channels and the floodplain surface. The results provide insight into linkages among hydrology, geomorphology and tree characteristics of forested floodplains of lowland meandering rivers.</p>","author":"Tanya Shukla, \nChelsy R. Salas, \nRyan C. Pankau, \nBruce L. Rhoads","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"8a0195bff5bce06130a8ac41fa76dba5670d51db9961dd92571e7aa3e62dab92","category":"Environment"}