{"title":"Valve กำหนดเกมต้องเปิดเผยว่าใช้ AI สร้างเนื้อหา แยกระหว่างการสร้างล่วงหน้าและสร้างสด","link":"https://www.blognone.com/node/137588","date":1704879408000,"content":"<div><div><div><p>Valve ประกาศกฎใหม่เกี่ยวกับการจัดการเกมที่ใช้ AI ช่วยสร้างบน Steam ผ่านบล็อกของชุมชนว่าจะตรวจสอบเนื้อหาเกมที่ใช้ AI สร้างของแพลตฟอร์มด้วยการให้ผู้สร้างเกมเปิดเผยข้อมูล AI โดยขอให้นักพัฒนาอธิบายว่าเกมของพวกเขาใช้ AI ทำอะไรบ้าง และจะแยกระหว่างเนื้อหา AI ที่สร้างไว้ล่วงหน้า (Pre-Generated) และเนื้อหา AI ที่สร้างขึ้นแบบสด ๆ (Live-Generated) ซึ่งส่วนหลังจะมีข้อกำจัดเยอะเป็นพิเศษเพื่อป้องกันไม่ให้ AI สร้างเนื้อหาที่ผิดกฎหมายออกมา</p>\n<p>ข้อมูล AI ส่วนใหญ่จะปรากฏบนหน้าเกมของร้านค้า Steam เพื่อให้เกมเมอร์เข้าใจว่าเกมที่พวกเขากำลังจะซื้อใช้ AI ในเกมอย่างไร นอกจากนี้ Valve มีแผนที่จะเปิดตัวระบบใหม่ที่อนุญาตให้เกมเมอร์รายงานเนื้อหาที่ผิดกฎหมายภาย AI ที่สร้างขึ้นได้ด้วย</p>\n<p>Valve กล่าวว่าการเปลี่ยนแปลงครั้งนี้เป็นผลมาจากการที่ Valve ปรับปรุงความเข้าใจเกี่ยวกับภูมิทัศน์และความเสี่ยงของ AI เช่นเดียวกับการพูดคุยกับนักพัฒนาเกมที่ใช้ AI และผู้สร้างเครื่องมือ AI สิ่งนี้จะทำให้ Valve เปิดกว้างขึ้นในการเปิดตัวเกมที่ใช้เทคโนโลยี AI บน Steam ข้อยกเว้นเพียงอย่างเดียวคือเนื้อหาทางเพศสำหรับผู้ใหญ่ที่สร้างขึ้นด้วย Live-Generated จะไม่สามารถเผยแพร่บนแพลตฟอร์มได้ในขณะนี้</p>\n<p>นอกจากนี้ Valve ได้ขอโทษที่ใช้เวลาพอควรทำความเข้าใจ AI ทำให้ผู้พัฒนาเกมบางรายตัดสินใจเลือกใช้เครื่องมือช่วยพัฒนาเกมลำบากขึ้น แต่ Valve ไม่อยากเร่งรีบที่จะนำกฎนี้มาใช้เพราะประเด็น AI เป็นเรื่องที่ซับซ้อน แต่ Valve จะคอยศึกษากฎหมายเกี่ยวกับ AI ต่อไป และจะปรับปรุงกฎอีกครั้งเมื่อจำเป็น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/ae27d3b622373d11724c716e19e30530.jpg\" /></p>\n<p>ที่มา - <a href=\"https://steamcommunity.com/groups/steamworks/announcements/detail/3862463747997849619\">Steam</a> via <a href=\"https://www.ign.com/articles/valve-announces-changes-to-how-its-handling-ai-content-on-steam\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/valve\">Valve</a></div><div><a href=\"/topics/steam\">Steam</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8a0c72cf29f924a50666cc18bc1f63fbc7b7d7af8ecc76e918af6efe6f61076c","category":"Thai"}