{"title":"La Vuelta a España 2021 Stage 15 Preview - Mammoth Mountain Test","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-15-preview-mammoth-mountain-test","date":1630172804000,"content":"\n      <p><span><span>Located west of Madrid, the town of El Barraco hosts a stage finish at the Vuelta a España for the first time</span></span><span>. W<span>e can </span><span>anticipate </span><span>a fiery affair w</span>ith a rest day to follow and four categorised climbs to take place over 198km of racing</span><span>. Odd Christian Eiking continues in the red jersey, but will this be the case come </span><span>the end of the stage?</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-15_1024x1024.png?v=1630165579\" />Stage 15 profile</span></i></p>\n<p><span>With almost 4,000 metres of climbing on the menu, stage 15 has the potential to be a pivotal day in the fight for red. However, t</span><span>he first 60 kilometres mainly consist of flat terrain.</span> A plethora of riders will hope to join the breakaway in this phase of the stage.</p>\n<p><span>T</span><span>he climbing begins at kilometre 70 with the Alto de la Centenera. The first category climb is just over 15km in length and averages 5.5%. With ten KOM points available at the top, Romain Bardet or Damiano Caruso may move to the fore.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E15-Centenera-VE21_600x600.jpg?v=1630165600\" /></div>\n<p><i><span>Alto de la Centenera profile</span></i></p>\n<p><span>A long descent carries the riders directly to the foot of the next climb — the second category Puerto de Pedro Bernardo is 9km in length and averages 4.2%. </span></p>\n<p><span>Following another descent and short valley section, the Puerto de Mijares arrives. The ascent is a whopping 20km long, and</span><span> the riders will have climbed to more than 1,500 metres above sea level at the summit. The gradient remains consistent throughout, averaging 5.4%. </span><span>The peloton could be decimated b<span>y the peak of the mountain.</span></span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E15-Mijares-VE21_600x600.jpg?v=1630165541\" /></div>\n<p><i><span><span>Puerto de Mijares</span></span></i><i><span> profile</span></i></p>\n<p><span>Next, the riders will descend to Burgohondo, where an intermediate sprint waits with 22km left. On paper, the final categorised ascent is the easiest of the four. </span><span>The third category Puerto San Juan de Nava is 8.6km long and averages just 3.8%. This is somewhat misleading, as the first few kilometres are better described as a false flat, whereas the second half is much steeper. Bonus seconds are handed to the first three riders to reach the top, where they’ll be just 5.3km remaining.</span></p>\n<p><span>Any riders that have attacked must</span><span> preserve the energy required for the final 1.5km, where the road flattens following a short descent to <span>El Barraco</span>.</span></p>\n<h4><b>Contenders</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1336336627-min_1024x1024.jpg?v=1630167140\" /><em>Primož Roglič and Enric Mas (Image credit: Tim de Waele/Getty Images)</em></p>\n<p><span>The numerous, high-difficulty mountains scattered throughout the stage provide the perfect platform to attack the race</span><span>. A</span><span> host of riders will fight to join the breakaway, some with their eyes set on stage victory. Others will plan to drop back to their leaders in the peloton late on,</span><span> whilst the sprinters may simply be looking to finish within the time limit. With such a wide range of teams interested, we can expect consecutive breakaway victories in the mountains.</span></p>\n<p><span>Team DSM have perhaps been the most prominent breakaway team at the Vuelta so far.<span> </span></span><b>Michael Storer</b><span><span> </span>has won two stages from the breakaway, whilst<span> </span></span><b>Romain Bardet<span> </span></b>owns the KOM jersey after winning on the <span>Pico Villuercas. With 28 KOM points available, Bardet will be eager to join the breakaway again so he can defend the mountains jersey.</span></p>\n<p><b>Damiano Caruso</b><span><span> </span>has also expressed an interest in being King of the Mountains. After winning on the Alto de Velefique, Caruso has attacked at numerous summits to further increase his points tally. Unlike Bardet, Caruso wasn’t part of the stage 14 breakaway, so he may be a little fresher than the Frenchman. </span><span>In addition to Caruso, Bahrain-Victorious boast numerous riders capable of stage victory </span><span>from the breakaway, namely<span> </span></span><b>Mark Padun, Wout Poels<span> </span></b><span>and<span> </span></span><b>Mikel Landa.</b></p>\n<p><span>Other escape artists to keep an eye on include<span> </span></span><b>Ion Izagirre, </b><strong>Rafał Majka, Juan Pedro Lopez, Andreas Kron, Richard Carapaz </strong>and <strong>Geoffrey Bouchard.</strong></p>\n<p><b>Odd Christian Eiking </b>has defended the red jersey admirably after acquiring race leadership on stage 10. The second-placed Guillaume Martin has piled the pressure on the Norwegian, yet Eiking remains resilient.<span> Carrying </span><span>the red jersey into the second rest day </span><span>would be a supreme result for Eiking and </span>Intermarché - Wanty - Gobert<span>.</span></p>\n<p><span><strong>Primož Roglič </strong>sits third in the GC, yet he is in complete control of the race. With a 34km time-trial to come, Martin and Eiking aren't considered serious GC threats. </span><span>Roglič<strong> </strong>has collected two stage victories and has consistenly been among the strongest on the summit finishes so far. The form of his Jumbo-Visma team-mates were brought into question early on</span><span>, but</span><span> <strong>Sepp Kuss</strong> and <strong>Steven Kruijswijk</strong> have improved as the race has developed.</span></p>\n<p>In a cagey stage 14,<strong><span> </span>Miguel Ángel López </strong>was the only primary GC contender to attack on the <span>Pico Villuercas. </span><span>Alongside <strong>Enric Mas,</strong> who has closely trailed Roglič over the first two weeks, Movistar are Roglič's greatest concern. However, the Spanish outfit are down to six after they lost </span><span><span>Alejandro Valverde and Johan Jacobs, so they must use their resources prudently. Nonetheless, an early attack from López or Mas in an attempt to isolate Roglic could be Movistar's best chance.</span></span></p>\n<p><span><span>Keep an eye out for <strong>Jack Haig </strong>and<strong> Egan Bernal</strong> too, who performed well on stage 14.</span></span></p>\n<p><i><span>Cover image: Unipublic / Charly López</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8a1391407e1c467430a8ac125d8c8ed6d41872804a7796a659c383324c6b372e","category":"Cycling"}