{"title":"First Impressions: iPhone 15 Pro Spatial Videos on Vision Pro","link":"https://www.macrumors.com/2023/11/10/spatial-videos-on-vision-pro-first-impressions/","date":1699644480000,"content":"Starting with iOS 17.2, which is <a href=\"https://www.macrumors.com/2023/11/10/ios-17-2-public-beta-2/\">currently in beta</a> and expected to be released in December, the iPhone 15 Pro and iPhone 15 Pro Max <a href=\"https://www.macrumors.com/2023/11/09/ios-17-2-spatial-video-recording/\">can record spatial video</a> with 3D depth for playback on Apple's upcoming Vision Pro headset. When held in landscape orientation, the iPhone's main and ultra wide cameras combine to record 3D video.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Vision-Pro-Person.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nThe feature can be toggled on in the Settings app under Camera → Formats, and when it is, an extra button to record spatial video appears in the Video section of the Camera app. Spatial videos are recorded in 1080p at 30 fps, and Apple says the iPhone needs to be in landscape orientation and stabilized for the best results. Apple says the toggle will be turned on automatically for future Vision Pro owners.\r<br />\n\r<br />\nWhen played on the iPhone, spatial videos are regular 2D videos without any extra depth effect.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/11/Vision-Pro-Spatial-Video.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nWhile the Vision Pro does not launch until \"early 2024\" in the U.S., Apple invited some members of the press to record their own spatial videos on the iPhone 15 Pro and watch them on the headset this week. Apple is still not allowing the press to share photos or videos of the Vision Pro, so there are only written impressions for now.\r<br />\n\r<br />\n<a href=\"https://techthings.cmail19.com/t/d-e-vhlukdk-irijhkzjj-r/\"><em>The Wall Street Journal</em>'s Joanna Stern</a>, in her <a href=\"https://www.wsj.com/newsletters?sub=486&amp;mod=article_inline\"><em>Tech Things</em> newsletter</a>:<blockquote>At the demo, I recorded a sushi chef holding a piece of sushi. When I watched it back in the Vision Pro, the sushi and the chopsticks really looked 3-D. They were clearly in the foreground, hovering closer to me than the rest of the imagery. Of course the lighting was perfect when recording—we'll have to see how it does in imperfect conditions.\r<br />\n\r<br />\nApple showed me some other spatial videos. In one, a dad was telling his young kids a story in the back of an RV. It was so lifelike and cozy that it almost creeped me out. Why am I spying on this random family? That's obviously the big appeal here: spatial videos create intimacy in ways 2-D photos and videos don't.</blockquote><a href=\"https://www.thestreet.com/deals/apple-vision-pro-spatial-video-first-look-iphone-15-pro\"><em>TheStreet</em>'s Jacob Krol</a>:<blockquote>Likely as Apple intended, capturing Spatial Video is simple and feels just as intuitive as shooting in another one of the modes on the iPhone 15 Pro or iPhone 15 Pro Max. You'll turn the phone into the landscape to unlock the recording mode, indicated by a headset icon, and see a level appear as you're filming.\r<br />\n\r<br />\nHorizon view and level are important, as an ultra-shaky video can be more jarring when playing back on the Vision Pro. In my experience, I captured a professional sushi chef creating a few standard rolls and rice balls, as well as the chef holding up the end product. I gradually approached, placing the roll while it was suspended in the air via chopsticks by about a foot and a half way. The iPhone did an excellent job of switching focus while I was moving around the piece of sushi and capturing the chef in the background. You can also manually click to focus if you'd like.</blockquote><a href=\"https://www.cnet.com/tech/mobile/apple-iphone-spatial-video-arrives-in-beta-and-looks-amazing-on-vision-pro/\"><em>CNET</em>'s Scott Stein</a>:<blockquote>The videos look great and the 3D is compellingly realistic. They're also easy to record, and can save as videos that will play back in 2D in a normal video format. But ultimately this feature is made for a 2024 product that, at $3,500, it's safe to say most people won't buy anytime soon. Still, the experience is impressive.</blockquote>Stein noted that Apple's professional video editing app Final Cut Pro will be updated with spatial video editing support at some point next year.\r<br />\n\r<br />\nSpatial video recording on iPhone 15 Pro models was <a href=\"https://www.macrumors.com/2023/11/09/ios-17-2-spatial-video-recording/\">added in the second beta of iOS 17.2</a> seeded to developers yesterday and to public beta testers today.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>, <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a>, <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15-Pro\">iPhone 15 Pro (Buy Now)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a>, <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/10/spatial-videos-on-vision-pro-first-impressions/\">First Impressions: iPhone 15 Pro Spatial Videos on Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/first-impressions-iphone-15-pro-spatial-videos-on-vision-pro.2410602/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8a153929cdcc9dc19a8cd8901ad639cde0e6faa154a772b52a5bb9e775c19607","category":"Apple"}