{"title":"Dynamic modeling of African elephant populations under changing climate and habitat loss across the Greater Virunga Landscape","link":"https://journals.plos.org/sustainabilitytransformation/article?id=10.1371/journal.pstr.0000094","date":1706709600000,"content":"<p>by Simon Nampindo, Timothy O. Randhir</p>\r\n\r\nElephants in Africa are declining rapidly due to habitat loss and human-wildlife conflicts, with these problems worsening with climate change. Understanding how age classes respond to such events is crucial to designing and implementing mitigation strategies and developing the adaptive capacity of wildlife managers to respond to these challenges adequately. This study builds a dynamic simulation model of the age classes of elephants and their interaction with habitat, water, and climate. The dynamic response of elephant populations to habitat change, water resources, and climate change is assessed. It is observed that climate change affects older elephants more than young ones in terms of survivability and migration. It is also likely that the undetected direct climate change impact on the elephant population is due to changes in habitats, particularly forests and wetlands used for thermal regulation. An improvement in the habitat type and availability of water resources improved the age classes of populations. The results suggest that if the environmental and anthropogenic stressors are not mitigated, Greater Virunga Landscape (GVL) will face a change in population demography for younger elephants and impact overall populations. Such age-class-specific stress could substantially affect African elephants’ long-term population viability and sustainability. Conservation of elephants requires a transboundary management approach to climate change mitigation, cooperation among conservation agencies, and effective partnerships with all relevant stakeholders for conservation.","author":"Simon Nampindo","siteTitle":"PLOS Sustainability and Transformation","siteHash":"5acd099bb614e5ebff1e724af0cad6ab2b3ef1c50ce1616dc0b5d51f3d4a8e96","entryHash":"8a1777695c376a2d4d9a0e91b6c785a2f147b084dba7acde964e105d59b9821a","category":"Environment"}