{"title":"Cost effectiveness of a vascular access education and training program for hospitalized emergency department patients","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310676","date":1727791200000,"content":"<p>by Amit Bahl, Yuying Xing, S. Matthew Gibson, Emily DiLoreto</p>\r\nObjective <p>Education and training in vascular access is a critical component to delivering quality vascular access care. Given that organizations must invest resources to implement and sustain high-quality vascular access programming, we aimed to demonstrate the cost effectiveness of a program (Operation STICK (OSTICK)) in the emergency department (ED).</p> Methods <p>This was an observational cohort study conducted at a tertiary care academic center with 120,000 ED visits. Consecutive hospitalized adults with ultrasound-guided (DIVA) and traditionally-placed (non-DIVA) peripheral intravenous catheters (PIVC) in the ED were included in the analysis. Two groups (OSTICK and non-OSTICK) were compared in the analysis: OSTICK PIVCs were inserted by clinicians with formal, standardized training in peripheral venous access while non-OSTICK PIVCs were inserted by staff with basic departmental training in PIVC care. Cost factors included number of procedures, wait time to establish a PIVC, complications, and training. Effect was complication-free PIVC functionality. Multiple linear regressions were used to estimate incremental cost (ΔC), incremental effect (ΔE), and incremental net benefit (INB) of the OSTICK program.</p> Results <p>From 10/1/2022 thru 3/31/2023, 21,259 PIVCs including 1681 OSTICK and 19,578 non-OSTICK PIVCs were included in the analysis. Average age was 64.8 and 53.7% were female. The estimate of incremental cost (ΔC) for each patient was -$83.175 (95% CI: -$103.953 to -$62.398; p&lt;0.001), indicating that the OSTICK group saves money compared to the non-OSTICK group. The OSTICK group is also more effective at increasing the proportion of catheter dwell time relative to hospital length of stay (ΔE), with an estimate of 0.037 (95% CI: 0.016 to 0.059; p&lt;0.001), compared to those in the non-OSTICK group. The estimated incremental cost-effectiveness ratio (ICER) for the OSTICK group compared with the non-OSTICK group was −$221.964 (95% CI: -$177.400 to -$381.716) per ten percentage points of PIVC dwell time to hospital length of stay increase.</p> Conclusions <p>Strategic investment in vascular access education and training can yield impressive financial returns while simultaneously enhancing vascular access outcomes. It is imperative for organizations to recognize the significant impact of such initiatives and prioritize the implementation of comprehensive programs.</p>","author":"Amit Bahl","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8a1845833ccb838f01fbd6a92e957bca4d342c69fa84ce20fc3109046abd9ea8","category":"Interdisciplinary"}