{"title":"Microsoft releases new, all-in-one Office app for iPads","link":"https://arstechnica.com/?p=1742647","date":1613506324000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/iPad-Office-Home-980x681.png\" alt=\"\"></div>\n        <p>\n          The home screen in the Office app for iPad has two tabs: one for recent files (which also includes notes) and one for files shared with you. It also has an interface for creating new documents in any of the supported apps.                      [credit:\n                        Samuel Axon                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Microsoft yesterday released an all-in-one Office app for iPads, bringing a new approach to Office on mobile previously seen on iOS and Android to iPadOS. The app combines Word, Excel, PowerPoint, and a number of mobile device-specific features, including PDF management tools and a file browser.</p>\n<p>A year ago almost to the day, Microsoft <a href=\"https://arstechnica.com/gadgets/2020/02/microsoft-releases-new-all-in-one-office-app-for-ios-and-android/\">released</a> this update to iPhones and Android phones, and the update has appeared on some Android tablets as well. As an iPhone app, it previously ran on iPads but only in a windowed mode of sorts. This new version has a full-screen tablet interface and supports various iPad multitasking features.</p>\n<p>Users can still download individual Word, Excel, or PowerPoint apps in the iPad's App Store; the standalone apps and this all-in-one option seem likely to coexist at least for a while, as the standalone alternatives haven't gone away on the iPhone.</p></div><p><a href=\"https://arstechnica.com/?p=1742647#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1742647&comments=1\">Comments</a></p>","author":"Samuel Axon","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8a1c4482f432a84aa45952fe131e6b41e7d3df008c1954e4fa3ba8c45c8229cd","category":"Tech"}