{"title":"Hyperspectral Imaging for Phenotyping Plant Drought Stress Using Univariate and Multivariate Modelling Techniques","link":"https://www.preprints.org/manuscript/202407.1362/v1","date":1721200672000,"content":"Due to the adverse effect of prolonged drought stress on plants, accurate detection is essential for water use efficiency and maintaining productivity. Hyperspectral imaging is frequently used for non-invasive plant phenotyping, allowing for the long-term monitoring of crop health due to its sensitivity to subtle changes in leaf constituents. The broad spectrum of hyperspectral data enables the development of multiple vegetation indices (Vis) derived from the different spectral regions to estimate plant biophysical and biochemical traits. However, the known VIs often do not generalize well and perform poorly for multiple plant stresses. This study proposes new VIs combined with machine learning models to identify drought stress in wheat species under different nitrogen (N) levels. A wheat experiment was set up in the glasshouse with four treatments: well-watered high-N (WWHN), well-watered low-N (WWLN), drought-stress high N and drought-stress low-N. In addition to ensuring that plants were watered according to the experiment design, photosynthetic rate (Pn) and stomatal conductance (gs) were taken regularly, serving as the ground truth data for this study. Sensitive spectral features were selected using a custom-designed ensemble modelling technique. New drought VIs are proposed using different combinations of the selected features. Three classification models (support vector machines, random forest and deep neural network) were developed and trained using four sets of data: known VIs, proposed VIs, combined VIs (from the known and proposed VIs) and PCA-transformed features (over the whole spectral data). From the results, the proposed VIs outperformed the known VIs, yielding &amp;gt; 0.94 accuracies for all three models, and the performance improved when they were trained with the combined VIs. The combined VIs were used to train three regression models to predict the stomatal conductances and photosynthetic rates of plants. The random forest regression model performed best, suggesting that it could be used as a stand-alone tool to forecast gs and Pn and track drought stress in wheat.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8a208f96057f34332cb22d753b3418af37cec5396dac811d5b9e9cf944e8c659","category":"Interdisciplinary"}