{"title":"The phytochrome-interacting factor genes PIF1 and PIF4 are functionally diversified due to divergence of promoters and proteins","link":"https://academic.oup.com/plcell/article/36/8/2778/7642924?rss=1","date":1712620800000,"content":"<span><div>Abstract</div>Phytochrome-interacting factors (PIFs) are basic helix–loop–helix transcription factors that regulate light responses downstream of phytochromes. In Arabidopsis (<span>Arabidopsis thaliana</span>), 8 <span>PIF</span>s (<span>PIF1-8</span>) regulate light responses, either redundantly or distinctively. Distinctive roles of <span>PIF</span>s may be attributed to differences in mRNA expression patterns governed by promoters or variations in molecular activities of proteins. However, elements responsible for the functional diversification of <span>PIF</span>s have yet to be determined. Here, we investigated the role of promoters and proteins in the functional diversification of <span>PIF1</span> and <span>PIF4</span> by analyzing transgenic lines expressing promoter-swapped <span>PIF1</span> and <span>PIF4</span>, as well as chimeric PIF1 and PIF4 proteins. For seed germination, <span>PIF1</span> promoter played a major role, conferring dominance to <span>PIF1</span> gene with a minor contribution from PIF1 protein. Conversely, for hypocotyl elongation under red light, PIF4 protein was the major element conferring dominance to <span>PIF4</span> gene with the minor contribution from <span>PIF4</span> promoter. In contrast, both <span>PIF4</span> promoter and PIF4 protein were required for the dominant role of <span>PIF4</span> in promoting hypocotyl elongation at high ambient temperatures. Together, our results support that the functional diversification of <span>PIF1</span> and <span>PIF4</span> genes resulted from contributions of both promoters and proteins, with their relative importance varying depending on specific light responses.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"8a2108928075323980ae38ce0393334af988a92635c57e3d494cca68e833dedd","category":"Environment"}