{"title":"Age, growth, maturity and mortality of the tapetail anchovy Coilia brachygnathus (Engraulidae) in Lake Honghu, China","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15337?af=R","date":1709090576000,"content":"<h2>Abstract</h2>\n<p>The tapertail anchovy <i>Coilia brachygnathus</i>, a commercially important species mainly distributed along the mid-lower Chang-Jiang basin, is by far the most dominant species in Lake Honghu. To figure out its success in this semiclosed lake, some basic biological parameters of this anchovy were analysed based on samples seasonally collected from October 2020 to December 2021. The results demonstrated that the age classes of fished individuals varied from 0.5 to 3.5, with the majority (97.36%) being between 0.5 and 3 years old. The size at 50% maturity of 17.2 cm total length (TL) for females and 19.0 cm TL for males corresponded to 1 and 1.6 years, respectively. <i>Coilia brachygnathus</i> has a short life span, early sexual maturity and a relatively fast growth rate. The flourishing of the fish in the lake is mainly attributed to its short life span, early maturity, fast growth rate, closed fishing, pelagic spawners, the availability of plenty of food and low predation effect on it. Age 3.5 year occurs in an extremely small percentage of the total (&lt;3%), indicating that a large number of larger-sized or older fish died after spawning, which is probably one of the major sources of water pollution if the closed fishing measure is adopted in Lake Honghu. Thus, individuals older than 2 years or more than 20.0 cm TL should be harvested. These findings have important management implications for the fish resources in Lake Honghu and beyond.</p>\n<h2>摘要</h2>\n<p>短颌鲚 (Coilia brachygnathus)是长江中下游的重要经济鱼类，是洪湖目前的优势物种。为弄清该种在此半封闭湖泊中繁盛的原因，本文基于2020 年 10 月至 2021 年 12 月季节性采集的样本，分析了该物种一些基本生物学参数。结果表明，采集样本的年龄为0.5-3.5龄，以0.5-3龄为主体(占总个体数97.36%)。50%个体性成熟时雌、雄性全长分别为 17.2 厘米和 19.0 厘米，对应的年龄分别是1龄和1.6龄。短颌鲚生命周期短，性成熟早，生长速度相对较快。该种种群在洪湖中繁盛的主要原因是:生命周期短、性成熟早、生长速度快、禁捕、产漂浮行卵、食物充足和捕捞压力小。3.5年龄个体占总量的比例极小(&lt;3%)，说明大量体型较大或年龄较大的鱼类产卵后死亡。这可能是洪湖禁捕后水污染的主要来源之一。因此，应该捕捞年龄超过 2 年或全长超过20.0 cm的个体。这些发现对洪湖及其他地区的鱼类资源管理具有重要的意义。</p>","author":"Melaku Abelneh Yimer, \nLiang Cao, \nJiang‐Zhong Shen, \nE Zhang","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"8a2279fe92f56c4c22912b2afd62367acc329415d49dff6c2928c70e78cbfe12","category":"Environment"}