{"title":"CT Effective Dose and Image Quality in Deep Learning Image Reconstruction in Intensive Care Patients","link":"https://www.preprints.org/manuscript/202405.0462/v1","date":1715157289000,"content":"Deep learning image reconstruction (DLIR) algorithms employs convolutional neural networks (CNNs) for CT image reconstruction to produce CT images with a very low noise level, even at low radiation dose. The aim of this study was to assess whether the DLIR algorithm reduces the CT effective dose (ED) and im-proves CT image quality in comparison with filtered back projection (FBP) and iterative reconstruction (IR) algorithms in intensive care unit (ICU) patients. We identified all consecutive patients referred to the ICU of a single hospital who underwent at least two consecutive chest and/or abdominal contrast-enhanced CT scans within a time period of 30 days using DLIR and subsequently FBP or IR algorithm (Advanced Mod-eled Iterative Reconstruction model-based algorithm [ADMIRE], or Adaptive Iterative Dose Reduction 3D [AIDR 3D]) for CT image reconstruction. The radiation ED, noise level, and signal-to-noise ratio (SNR) were compared between the different CT scanners. The non-parametric Wilcoxon test was used for statistical comparison. Statistical significance was set at p &lt; 0.05. A total of 83 patients (mean age, 59 ± 15 years [standard deviation]; 56 men) were included. DLIR vs FBP reduced ED (18.45 ± 13.16 mSv vs 22.06 ± 9.55 mSv, P &lt; 0.05), while DLIR vs FBP and vs ADMIRE and AIDR 3D IR algorithms reduced image noise (8.45 ± 3.24 vs 14.85 ± 2.73 vs 14.77 ± 32.77 and 11.17 ± 32.77\\, P &lt; 0.05) and increased SNR (11.53 ± 9.28 vs 3.99 ± 1.23 vs 5.84 ± 2.74 and 3.58 ± 2.74, P &lt; 0.05). CT scanners employing DLIR reduced radiation ED and im-proved SNR compared to CT scanners using FBP, whereas CT scanners using DLIR improved SNR com-pared to CT scanners using FBP or IR algorithms in ICU patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8a26652eb533589c1745a8c2a080d5a859a8c0ac63d22bcf2a772277c503e149","category":"Interdisciplinary"}