{"title":"Garmin Adds New ‘Adventure Race’ Activity Profile: An Explainer","link":"https://www.dcrainmaker.com/2021/08/garmin-adds-new-adventure-race-activity-profile-an-explainer.html","date":1628460947000,"content":"<p></p>\n<p>While scanning through the list of beta firmware updates that posted this week, I noticed a curious addition – a new ‘Adventure Race’ activity profile designed for races that prohibit GPS navigation during the race. Meaning that some races require competitors to do their own orienteering, old-school style with maps and compass, rather than depend on GPS devices.</p>\n<p>But of course these athletes still want to record their race for posterity sake (because…Strava), but don’t want to <a href=\"http://www.areuroseries.com/rules/\">run afoul of rules that limit</a> navigational assistance. Many of these races/rules do allow GPS devices that can record only, but not do any navigation or even distance tracking. Thus up till now, people have largely had to use less capable and more basic GPS watches that often don’t have the battery life capabilities of Garmin’s higher-end models (if at all).</p>\n<p>For example, an older Forerunner 35 series device that can’t navigate (nor has Connect IQ) would fit the bill for some races, but has a very limited battery life for adventure racing – especially compared to something like the Garmin Enduro which can reach into the hundreds of hours of GPS-on time, depending on how it’s configured.</p>\n<p>In any event, as I said, I was browsing through the mostly boring list of bug fixes when I noticed this one. And figured it was curiosity-inducing enough to mention, even if some portion of the population will think it’s silly (just like some portion of the population thinks <a href=\"https://www.dcrainmaker.com/2021/08/tech-tidbit-wahoo-rival-chirps-happy-birthday-to-you.html\">Wahoo’s watch singing happy birthday</a> to you is silly).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022773.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022773_thumb.jpg\" /></a></p>\n<p>So, the feature is currently posted in public beta for the <a href=\"https://www.dcrainmaker.com/2019/08/garmin-fenix6-pro-solar-series-review.html\">Garmin Fenix 6 Series (all editions)</a>, <a href=\"https://www.dcrainmaker.com/2019/08/garmin-marq-athlete-in-depth-review.html\">MARQ Series</a>, and <a href=\"https://www.dcrainmaker.com/2021/02/garmin-enduro-gps-watch-in-depth-review.html\">Enduro</a>. That’s part of the larger beta firmware update set, so you’re actually getting a pile of other new features that Garmin has been adding to those watches in beta the last few months, but hasn’t yet toggled over to production for these watches (but have on other watches), including:</p>\n<ul>\n<li>Added Adventure Race activity</li>\n<li>Added the ability to rate the perceived effort and feel of a Run, Bike, or Swim activity.</li>\n<li>Added sleep tracking widget with sleep score and insights by Firstbeat Analytics.</li>\n<li>Added metabolic calories into the total calories reported in the calories data field and recorded in the activity file.</li>\n<li>Added setting to enable/disable workout audio prompts</li>\n<li>Updated workout audio prompts for hundredths distance precision.</li>\n<li>Updated Intensity Minutes determinations to align with guidance from CDC.</li>\n<li>Plus a crap load of other things under the ‘improved’ banner that could agreeably be called ‘new’</li>\n</ul>\n<p>Here’s the links to the beta updates, and the full list of all those changes from basically 16.70 (most recent production build) till now:</p>\n<p><a href=\"https://forums.garmin.com/outdoor-recreation/outdoor-recreation/f/fenix-6-series/270536/fenix-6-series---18-77-public-beta\">Garmin Fenix 6 Series</a><br />\n<a href=\"https://www8.garmin.com/support/download_details.jsp?id=15219\">Garmin MARQ Series</a><br />\n<a href=\"https://www8.garmin.com/support/download_details.jsp?id=15605\">Garmin Enduro</a></p>\n<p>So I charged up a Fenix 6 unit to throw the firmware on and see how it works, and threw on the beta firmware:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022755.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022755_thumb.jpg\" /></a></p>\n<p>First up you’ll add the ‘Adventure Race’ activity profile, like you would any other random profile you’ve never used before, by scrolling down forever through the massive list of profiles and selecting it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022756.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022756_thumb.jpg\" /></a></p>\n<p>Once that’s done, you can crack it open. As with other GPS-based profiles, it’s still going to acquire satellites like normal, and show the coloring at the top that GPS signal has been acquired. Same goes with optical HR. And like other profiles it has a few default data pages. In this case it’s one data page showing altitude, time, heart rate, and duration. Then one showing the compass, and finally one showing your start time on a new ‘verification’ page.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022757.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022757_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/08/P1022758.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022758_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/08/P1022764.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022764_thumb.jpg\" /></a></p>\n<p>And while you can still customize data pages/fields, it’s not quite like normal. <strong>You won’t be able to add any distance fields, navigational fields, map fields, or location/GPS coordinate fields. None of those are allowed.</strong> Nor are you allowed any mapping data pages, or any navigational-related features/tools (such as course selection or routing options). Even auto-lap is disabled, so you can’t figure out distance based on that.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022760.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022760_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/08/P1022761.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022761_thumb.jpg\" /></a></p>\n<p>In fact, beyond those data field tweaks/disablements, there’s a slew of tiny ones (of which I probably haven’t found all of). For example, if you access the ‘Quick Access’ menu (long hold upper left button), it’ll disable the ability to quickly show/save Lat/Long, as well as disables music, and phone connectivity. As you hover over each of those options, they’re now greyed out with a line through them, and instead display ‘Adventure Race Active’. Further, all Hot Keys are disabled too (and will say “Hot keys are disabled in this activity”).</p>\n<p>However, the singular (arguably massive) gap is Connect IQ fields are permitted. Given countless CIQ fields show distance data, or even straight-up map/route data (like DWMap), that’s sorta leaving open a huge hole in the entire theory.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022762.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022762_thumb.jpg\" /></a></p>\n<p>Then again, I suppose if someone is going to cheat that way, they’re probably just as easily going to cheat any other way. Cheaters gonna cheat, and that’s unfortunately probably just a fact of life. Still, I’m struggling to see why CIQ needs to be enabled in this scenario, given the severity of the gap it opens, relative to the benefits. Certainly there are some benefits – but this entire profile was designed to allow people to just capture their run GPS track after the fact, not to boil the ocean.</p>\n<p>Beyond that, from a workout standpoint, you’ll start/stop like any other activity and it *records* every bit of data just like any normal run (it simply doesn’t display it to you mid-run).</p>\n<p>Nonetheless, the one last interesting tidbit is that once you end the activity, there’s a new ‘Verification’ tab of sorts in the list of post-workout data metrics:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022766.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022766_thumb.jpg\" /></a></p>\n<p>When you crack that open, it shows you this:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/08/P1022769.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/08/P1022769_thumb.jpg\" /></a></p>\n<p>I presume the idea being to show race officials that data or such. Though, I could see how having some sort of explainer text to show to race officials would also be useful, such as “This event was recorded in Adventure Racing mode, which disallows access to navigational, distance, and mapping related data during the activity”.</p>\n<p>Still, I’m sure someone will find this useful – and in many ways, that’s been Garmin’s strategy for a while – keeping adding features that a small portion of the population finds useful. Ultimately covering virtually every use case and edge case out there.</p>\n<p>Oh, and finally, to preempt what will invariably be the first comment below: When will Garmin announce a Fenix 7? Most definitely 7AM US Eastern time on Tuesday. Sometimes Wednesday or Thursday, but certainly still 7AM US Eastern Time. Never a Monday or Friday though, even at 7AM. Also, probably not this Tuesday. Possibly linked to a trade show (those exist still?) or race, but possibly not. Definitely before they announce a Fenix 8 though – and certainly before a Fenix 10 or Fenix 11.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"8a26278ea5916b052fc7862091fbba19a5bf498cb2ba4c1cad0b0345a0cb4bdb","category":"Cycling"}