{"title":"Dietary Methanolic Extract of Fenugreek Enhanced the Growth, Haematobiochemical, Immune Responses, and Resistance against Aeromonas hydrophila in Nile Tilapia, Oreochromis niloticus","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3055476?af=R","date":1675497600000,"content":"<p>Fenugreek seed (FS) contains abundant functional biomolecules that activate the antioxidative and immunity system of aquatic animals. In this study, the methanolic extract of FS was included in Nile tilapia diets at 0, 0.05, 0.1, 0.15, and 0.2% levels and fed to fish for 90 days. Nile tilapia (10.57 ± 0.14 g) were randomly divided into five triplicate groups to check the growth performance, haematobiochemical profile, immunity, antioxidative response, and tolerance to <i>Aeromonas hydrophila</i> infection. The results revealed that the methanolic extract of FS significantly improved the growth performance while reducing the feed conversion ratio (FCR). Methanolic extract of FS also modulated the haematobiochemical profile. Markedly, the lysozyme and phagocytic activities were activated by the dietary methanolic extract of FS. The superoxide dismutase (SOD) activity was improved, while the malondialdehyde (MDA) level was decreased by the dietary methanolic extract of FS. The SOD was markedly increased in the fish-fed dietary methanolic extract of FS at 0.1, 0.15, and 0.2%, while the MDA decreased in the fish fed 0.15 and 0.2%. The transcription of <i>IL-1β</i>, <i>TNF-α</i>, and <i>TGF-β</i> genes showed upregulated expression by ethanolic extract of FS. Accordingly, Nile tilapia showed high resistance against the <i>A. hydrophila</i> infection. The regression analysis revealed that the inclusion of 0.09% is recommended to improve the specific growth rate and FCR. In conclusion, the study revealed that an ethanolic extract of FS is recommended to enhance the growth performance, immunity, antioxidative response, and tolerance to <i>A. hydrophila</i> in Nile tilapia.</p>","author":"Amany M. Diab, \nBasant T. Al-Khefa, \nMalik M. Khalafallah, \nAbdallah S. Salah, \nFoad A. Farrag, \nMahmoud A. O. Dawood, \nHamed Ghafarifarsani","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"8a28f8d0ff0367e0fba2e90626b9a30dc488dcf9c429d62a80d5f746a76ef8b3","category":"Environment"}