{"title":"ROM site owner made $30,000 a year—now owes Nintendo $2.1M","link":"https://arstechnica.com/?p=1768886","date":1622564070000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/nincoins-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/nincoins.jpg\">Enlarge</a> <span>/</span> Artist's conception of Nintendo's reaction to the summary judgment. </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The now-unemployed owner of a shuttered ROM distribution site has been ordered to pay $2.1 million in damages to Nintendo after trying and failing to defend himself in the case.</p>\n<p>In September 2019, Nintendo filed a lawsuit against Los Angeles resident Matthew Storman over his operation of RomUniverse.com, which <a href=\"https://web.archive.org/web/20190912000424/https://www.romuniverse.com/\">offered prominent downloads</a> of \"Nintendo Switch Scene Roms\" and other copyrighted game files. At the time, Nintendo said that the site had been \"among the most visited and notorious online hubs for pirated Nintendo video games\" for \"over a decade.\"</p>\n<p>Storman has admitted that, in 2019, the site made up the bulk of his $30,000 to $36,000 a year in income. This included direct revenue from the sale of \"premium unlimited accounts\" for $30 per year that provided users with faster downloads and no limits. By the time Storman signed a September 2020 agreement with Nintendo to shut the site down, he said he was deriving $800 a month from the site. According to court documents, Storman's income is now derived primarily from \"unemployment and food stamps.\"</p></div><p><a href=\"https://arstechnica.com/?p=1768886#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1768886&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8a2eb09ab1249cc8b77784fa9e46702e884271be82a69f5bad39a2c1db4b9ed8","category":"Tech"}