{"title":"Effects of head alignment devices on working memory and postural support during computer work","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306966","date":1720706400000,"content":"<p>by Ju-Yeon Jung, Chang-Ki Kang</p>\r\n\r\nThe most common risk factor of computer workers is poor head and neck posture. Therefore, upright seated posture has been recommended repeatedly. However, maintaining an upright seated posture is challenging during computer work and induces various complaints, such as fatigue and discomfort, which can interfere working performance. Therefore, it is necessary to maintain an upright posture without complaints or intentional efforts during long-term computer work. Alignment devices are an appropriate maneuver to support postural control for maintaining head-neck orientation and reduce head weight. This study aimed to demonstrate the effects of workstations combined with alignment device on head-neck alignment, muscle properties, comfort and working memory ability in computer workers. Computer workers (n = 37) participated in a total of three sessions (upright computer (CPT_U), upright support computer (CPT_US), traction computer (CPT_T) workstations). The craniovertebral angle, muscles tone and stiffness, visual analog discomfort scale score, 2-back working memory performance, and electroencephalogram signals were measured. All three workstations had a substantial effect on maintaining head-neck alignment (<i>p</i>&lt; 0.001), but only CPT_US showed significant improvement on psychological comfort (<i>p</i> = 0.04) and working memory performance (<i>p</i> = 0.024), which is consistent with an increase in delta power. CPT_U showed the increased beta 2 activity, discomfort, and false rates compared to CPT_US. CPT_T showed increased alpha and beta 2 activity and decreased delta activity, which are not conductive to working memory performance. In conclusion, CPT_US can effectively induce efficient neural oscillations without causing any discomfort by increasing delta and decreasing beta 2 activity for working memory tasks.","author":"Ju-Yeon Jung","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8a31c9f06ccf2f4db7660499a0b91300e9c0e87977c66f02292062d3263cc7c2","category":"Interdisciplinary"}