{"title":"Anaemia at 36 weeks of pregnancy: Prevalence and determinants among antenatal women attending peri-urban facilities in a developing country, Ghana","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003631","date":1725544800000,"content":"<p>by Silas Adjei-Gyamfi, Abigail Asirifi, Wisdom Peprah, Delphina Aneley Abbey, Kwadzo Wisdom Hamenoo, Mary Sakina Zakaria, Osman Mohammed, Paul Armah Aryee</p>\r\n\r\nAnaemia as a critical health condition greatly upsurges the risk of pregnancy complications leading to preventable maternal mortalities and long-term morbidities. Therefore, identifying anaemia-associated factors is vital for planning relevant interventions in resource-constrained regions in Sahelian Africa. This study aimed to assess the prevalence and determinants of anaemia at 36 weeks of pregnancy among antenatal women in a peri-urban municipality of Ghana. A retrospective cross-sectional study was conducted among antenatal women from five different health facilities in Savelugu Municipality. Using antenatal register as the sampling frame, 422 participants were sampled. Data were collected via antenatal records review and a structured questionnaire. Using STATA, binary logistic regression was performed to identify significantly associated factors of anaemia at 36 weeks of pregnancy, considering a significance level of α = 0.05. Prevalence of anaemia at 36 weeks was 45.3%. Low socioeconomic status (AOR = 1.78; 95%CI:1.10–2.90; p = 0.020), pre-pregnancy body mass index ≥ 25 kg/m<sup>2</sup> (overweight or obesity) (AOR = 1.62; 95%CI:1.01–2.58; p = 0.041), non-intake of sulphadoxine-pyrimethamine drugs (AOR = 2.22; 95%:1.40–3.51; p = 0.001), and malaria infection (AOR = 3.14; 95%CI:1.66–5.93; p&lt;0.001) were associated with increased odds of anaemia at 36 weeks of pregnancy. Anaemia remains a burden in peri-urban Northern Ghana. Given the observed correlates of anaemia, interventions should be focused on strengthening malaria preventive measures, poverty alleviation, and peri-conception nutrition programs to avert adverse pregnancy outcomes.","author":"Silas Adjei-Gyamfi","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"8a375ade7f723139fb726587fb9d7049f5d519c615956effa462e4301a9f9c1c","category":"Environment"}