{"title":"Development and evaluation of RFID-integrated endoscopic clips for laparoscopic surgery marking","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302737","date":1714658400000,"content":"<p>by Hwan Yi Joo, Cho Rong Park, Seokyoung Ahn, Chang In Choi</p>\r\nBackground <p>As advancements in surgical instruments and techniques continue to evolve, minimally invasive surgery has become increasingly preferred as a means of reducing patient pain and recovery time. However, one major challenge in performing minimally invasive surgery for early gastrointestinal cancer is accurately identifying the location of the lesion. This is particularly difficult when the lesion is confined to the lumen of the intestine and cannot be visually confirmed from the outside during surgery. In such cases, surgeons must rely on CT or endoscopic imaging to locate the lesion. However, if the lesion is difficult to identify with these images or if the surgeon has less experience, it can be challenging to determine its precise location. This can result in an excessive resection margin, deviating from the goal of minimally invasive surgery. To address this challenge, researchers have been studying the development of a marker for identifying the lesion using a radio-frequency identification (RFID) system. One proposed method for clinical application of this detection system is to attach an RFID tag to an endoscopic hemostatic clip and fix it to the intended position, providing a stable marker for the inner wall of the organ. This approach has the potential to improve the accuracy and effectiveness of minimally invasive surgery for early gastrointestinal cancer.</p> Methods <p>In the development of a marker for identifying gastrointestinal lesions using a radio-frequency identification (RFID) system, the shape of the clip and suitable materials for attaching the RFID tag were determined through finite element method (FEM) analysis. A prototype of the clip was then fabricated and ex-vivo experiments were conducted using porcine intestine to evaluate the stability of the clip in relation to its position. To further evaluate the performance of the RFID-integrated clip in vivo, the clip was placed in the gastric wall of the stomach of anesthetized porcine using an endoscopic instrument. The clip was then detected using a RFID detector designed for laparoscopic approach. And later, the accuracy of detection was confirmed by incising the lesion.</p> Results <p>The design and fabrication of a clip with varying thicknesses using STS316 and STS304 stainless steel were accomplished using the results of finite element method analysis. The stability of the clip was evaluated through ex-vivo experiments, showing it to be a viable option. In-vivo experiments were performed on anesthetized porcine, in which the RFID-integrated clip was placed in the gastric wall and detected using a custom-made RFID detector. The resection margin, measured at about 30 mm from the detector position, was accomplished with low error. These findings indicate the feasibility and efficacy of using an RFID-integrated clip as a marker in minimally invasive surgery for the identification of gastrointestinal lesions.</p> Conclusions <p>The study evaluated the feasibility of using stainless steel clips for lesion detection in endoscopic surgery using computer-aided engineering analysis and ex-vivo experimentation. Results showed that STS304 was suitable for use while STS316L was not. The ex-vivo experiments revealed that the clip holding force and tissue retention length varied depending on the location of attachment. In-vivo experiments confirmed the accuracy and usefulness of the RFID lesion detection system. However, challenges remain for its use in clinical field, such as ensuring the stability of the clip and the safe attachment of the RFID tag, which requires further research for commercialization.</p>","author":"Hwan Yi Joo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8a4cfa5dd55d83cef90de061ae74530b826fb2e034dc4d13340cd6a29f1f43f3","category":"Interdisciplinary"}