{"title":"ownCloud vulnerability with a maximum 10 severity rating comes under “mass exploitation”","link":"https://arstechnica.com/?p=1986988","date":1701218314000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/exploit-800x534.jpg\" alt=\"Photograph depicts a security scanner extracting virus from a string of binary code. Hand with the word &quot;exploit&quot;\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/01/exploit.jpg\">Enlarge</a> (credit: Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Security researchers are tracking what they say is the “mass exploitation” of a security vulnerability that makes it possible to take full control of servers running ownCloud, a widely used open-source filesharing server app.</p>\n<p>The vulnerability, which carries the maximum severity rating of 10, makes it possible to obtain passwords and cryptographic keys allowing administrative control of a vulnerable server by sending a simple Web request to a static URL, ownCloud officials <a href=\"https://owncloud.com/security-advisories/disclosure-of-sensitive-credentials-and-configuration-in-containerized-deployments/\">warned </a> last week. Within four days of the November 21 disclosure, researchers at security firm Greynoise <a href=\"https://www.greynoise.io/blog/cve-2023-49103-owncloud-critical-vulnerability-quickly-exploited-in-the-wild\">said</a>, they began observing “mass exploitation” in their honeypot servers, which masqueraded as vulnerable ownCloud servers to track attempts to exploit the vulnerability. The number of IP addresses sending the web requests has slowly risen since then. At the time this post went live on Ars, it had reached 13.</p>\n<h2>Spraying the Internet</h2>\n<p>“We're seeing hits to the specific endpoint that exposes sensitive information, which would be considered exploitation,” Glenn Thorpe, senior director of security research &amp; detection engineering at Greynoise, <a href=\"https://infosec.exchange/@ntkramer/111490170969688520\">said in an interview</a> on Mastodon. “At the moment, we've seen 13 IPs that are hitting our unadvertised sensors, which indicates that they are pretty much spraying it across the internet to see what hits.”</p></div><p><a href=\"https://arstechnica.com/?p=1986988#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986988&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8a568982bd6dfc2f66805010da871630e56f1eb5f88ae862574a795cc69b72f1","category":"Tech"}