{"title":"Why champagne has stable “bubble chains” and other carbonated drinks do not","link":"https://arstechnica.com/?p=1934996","date":1682983431000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/champagne1-800x538.jpg\" alt=\"hand pouring champagne from a bottle into two fluted glasses\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/champagne1.jpg\">Enlarge</a> <span>/</span> Researchers investigated the stability of bubble chains in carbonated drinks like champagne and sparkling wine. (credit: Madeline Federle and Colin Sullivan)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Brown University physicist <a href=\"https://engineering.brown.edu/people/roberto-zenit\">Roberto Zenit</a> has a knack for tying his fundamental fluid dynamics research to everyday phenomena, like enjoying a glass of champagne with friends. He noticed one day that the bubbles rising to the surface form stable vertical columns, unlike other carbonated beverages, where the wake of rising bubbles knocks other bubbles sideways so that multiple bubbles rise simultaneously. Zenit found that this is because surfactant molecules coat the champagne bubbles and encourage more swirling, thereby disrupting the wake, according to a <a href=\"https://journals.aps.org/prfluids/accepted/8c072S42L811b00ce1d76ff9b5daf809512b5b942\">new paper</a> published in the journal Physical Review Fluids.</p>\n<p>\"Just observing a glass of a liquid super-saturated with carbon dioxide is like having a laboratory in front of you,\" Zenit told Ars. \"It's a very good example of trying to understand hydrodynamic interactions. When two bubbles are moving one behind the other, they usually become misaligned because they create a disturbance in the liquid around them. We realized this was very different for champagne. If you know anything about bubble dynamics, that's not natural, so of course we were instantly intrigued.\"</p>\n<p>Zenit has previously <a href=\"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0126135\">analyzed the fluid dynamics</a> of modern painting techniques and materials pioneered by such luminaries as muralist <a href=\"https://en.wikipedia.org/wiki/David_Alfaro_Siqueiros\">David Siqueiros</a> and <a href=\"https://en.wikipedia.org/wiki/Jackson_Pollock\">Jackson Pollock,</a> both of whom Zenit considers \"intuitive physicists.\" Siqueiros' famous \"accidental painting\" technique involved pouring layers of paint on a horizontal surface and letting whorls, blobs, and other shapes form over time. The trick is to place a dense fluid on top of a lighter one to create a <a href=\"https://en.wikipedia.org/wiki/Rayleigh%E2%80%93Taylor_instability\">classic instability</a> because the heavier liquid will push through the lighter one. According to Zenit, Pollock's dripping technique relied upon the same instability to produce curly lines and spots on his canvases. </p></div><p><a href=\"https://arstechnica.com/?p=1934996#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934996&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8a66a258a826bca3f6163c526cf8188cbcad41a1a74562b18c5d8a9f29020547","category":"Tech"}