{"title":"91 Awardee Talk: Using respiration calorimetry to estimate energy balance to estimate energy balance and methane emissions","link":"https://academic.oup.com/jas/article/102/Supplement_3/325/7757183?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Understanding relationships between chemical components of the diet and methane production will allow nutritionists to develop formulation strategies to decrease methane emissions. Diets that produce acetate liberate hydrogen that can be used by methanogenic archaea to produce methane. Propionate is a hydrogen sink and diets that lead to increased propionate production decrease acetate and methane production. The objective was to evaluate relationships between methane emissions and dietary chemical components and feed intake using published databases and make diet formulation recommendations that could be used to decrease methane production in finishing beef cattle. A total of 263 treatment mean observations from respiration calorimetry studies with beef cattle and dairy steers and heifers were used to evaluate relationships between methane emissions, dietary chemical components, and feed intake. Among the chemical components evaluated, dietary neutral detergent fiber and starch were strongly related to methane yield. The relationship between dietary ether extract and methane yield was variable and there was no relationship between dietary crude protein concentration and methane yield. Additionally, the ratio of metabolizable energy relative to gross energy intake had a strong relationship to methane yield. Formulation strategies to increase dietary starch and decrease dietary neutral detergent fiber should allow the feedlot industry to decrease enteric methane production.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8a6f09e7ddc028a422963774d3e8a5ff0900e996e43a23094f57ad9d15805fd4","category":"Environment"}