{"title":"282 Effect of dietary supplementation with guanidinoacetic acid, a creatine precursor, in gestating and lactating sows on sow and litter performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/176/7665012?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Guanidinoacetic acid (GAA) is the immediate metabolic precursor of creatine. Sows undergo periods of high energy demand and dietary supplementation of GAA can support the creatine/phosphocreatine energy system. The objective of this study was to evaluate the effect of dietary supplementation of GAA in sows on sow and litter performance. Sows (n = 150; Danbred x Pietrain, parity 1 to 7) were allocated to two dietary treatments (75 sows/treatment), 0.0 or 0.1% GAA in both gestation and lactation phases and balanced by parity and body weight (BW). Gestation diets (2.87 Mcal ME/kg, 2.13 g SID Lys: Mcal ME, 0.21% SID Met, and 0.13% choline) were fed from d 1 to 107 of pregnancy and 4 d post-weaning; and lactation diets (3.14 Mcal ME, 3.18 g SID Lys: Mcal ME, 0.34% SID Met, and 0.14% choline) were fed from d 108 of gestation through the lactation (26 days). Sows were kept in the same treatment during gestation and lactation. After farrowing, litters were standardized to 13 pigs per sow. Dietary supplementation with GAA during the gestation reduced sow feed intake (319.4 vs. 313.6 kg, <span>P</span> = 0.009), and did not affect sow BW at d 108 of gestation (284.2 vs. 282.8 kg, <span>P</span> = 0.889), born alive (15.70 vs. 15.92, <span>P</span> = 0.668), stillborn piglets (1.78 vs. 1.51, <span>P</span> = 0.332), and piglet BW at birth (1.34 vs. 1.32 kg, <span>P</span> = 0.591), for 0.0 and 0.1% GAA respectively. Dietary supplementation with GAA during lactation did not affect sow feed intake (181.1 vs. 181.5 kg, <span>P</span> = 0.999), sow BW at weaning (252.7 vs. 255.3 kg, <span>P</span> = 0.747) and wean-to-estrus interval (5.0 vs. 4.9 d, <span>P</span> = 0.978), and tended to reduce sow backfat loss at weaning (17.0 vs. 17.4 mm, <span>P</span> = 0.090), for 0.0 and 0.1% GAA, respectively. Sows fed GAA in lactation tended to have a greater number of pigs weaned (11.76 vs. 12.10, <span>P</span> = 0.088), and their piglets tended to have a greater average daily gain (ADG; 216.1 vs. 226.0 g/d, <span>P</span> = 0.062), have significantly heavier litters at weaning (81.87 vs. 86.28 kg, <span>P</span> = 0.048) and their litters have a greater BW gain (64.07 vs. 68.60 kg, <span>P</span> = 0.028). In conclusion, dietary supplementation with 0.1% of GAA to gestating and lactating sows improved litter weight at weaning, litter weight gain, and number of pigs weaned and did not affect sow BW and reproductive performance. More studies are needed to evaluate if supplementing GAA in gestation has a carryover effect on the lactation period.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8a6fa296a3504748ff6bf4b79daed5eb48bf569ab7e7f036ea318100b82dab35","category":"Environment"}