{"title":"Protective effect of soluble dietary fiber from Rosa roxburghii Tratt residue on dextran sulfate sodium‐induced ulcerative colitis by regulating serum metabolism and NF‐κB pathway in mice","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13547?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Ulcerative colitis (UC) refers to an idiopathic chronic inflammatory bowel disease that starts with inflammation of the intestinal mucosa. Dietary fiber plays a crucial role in maintaining the normal architecture of the intestinal mucosa. In this study, the protective effect and potential mechanism of soluble dietary fiber from <i>Rosa roxburghii</i> Tratt residue (SDFR) on dextran sulfate sodium (DSS)-induced UC mice were explored.</p>\n<h2>RESULTS</h2>\n<p>The results revealed that SDFR could ameliorate body weight loss and pathological injury, improve the structure and crypt destruction in colon in DSS-induced mice. Moreover, the levels of NO, IL-1<i>β</i>, TNF-<i>α</i>, MPO and protein expression of iNOS and COX-2 were decreased after administration of SDFR. Notably, nontargeted metabolomics analysis indicated that there were significant differences in 51 potential metabolites in serum between the DSS and control groups. SDFR intervention could regulate aberrant alterations of these metabolites and mitigate UC via regulating metabolic pathways, including arachidonic acid and glycerophospholipid metabolism.</p>\n<h2>CONCLUSION</h2>\n<p>This study provides novel evidence that SDFR could be used as a potential modulator to relieve UC. Also, the results provide a theoretical basis for the utilization of byproducts in <i>Rosa roxburghii</i> Tratt fruit processing. © 2024 Society of Chemical Industry.</p>","author":"Lilang Li, \nXiang Zhang, \nLi Wang, \nMing Gao, \nYu Wang, \nZhengrong Zhang, \nXiaosheng Yang, \nJuan Yang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8a723beb5c9388736357478ce735936208e28c329807753ddbda787892542b27","category":"Environment"}