{"title":"Association of spironolactone use with risk of urinary tract cancer in the general population: A matched population-based cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300391","date":1711548000000,"content":"<p>by Liang-Cheng Chen, Hsuan-Ju Yang, Ben-Hui Yu, Moon-Sing Lee, Hon-Yi Lin, Wen-Yen Chiou, Dai-Wei Liu, Feng-Chun Hsu, Chia-Hui Chew, Shih-Kai Hung</p>\r\nPurpose <p>The correlation between spironolactone usage and cancer risk has sparked interest. The objective of this study is to examine the association between spironolactone use and the incidence of urinary tract cancer in the general population.</p> Methods <p>We conducted a matched population-based cohort study. The study population was obtained from the Taiwan National Health Insurance Research Database (TNHIRD) during the period from 2000 to 2016. The multivariate Cox proportional hazard model was performed to examine the impact of spironolactone use on the risk of urinary tract cancer. A total of 8,608 individuals exposed to spironolactone were exact matched by 1:1 ratio with unexposed controls on factors including age, gender, comorbidities, CCI scores and socioeconomic status. The incidences of urinary tract cancer, including prostate, renal and bladder cancer, were estimated in both spironolactone exposed and non-exposed cohorts.</p> Results <p>After adjusting for confounding variables, the multivariate Cox regression analysis showed no significant association between spironolactone exposure and urinary tract cancer incidence, including bladder (adjusted hazard ratio [aHR] = 1.19, 95% confidence interval [CI] = 0.72–1.96, p = 0.50), renal (aHR = 1.75, 95% CI = 0.99–3.07, p = 0.053), and prostate cancer (aHR = 0.67, 95% CI = 0.43–1.04, p = 0.07). When the population was stratified into low (cumulative dose &lt; = 29,300 mg) and high (cumulative dose &gt;29,300 mg) dose of spironolactone, only high dose of spironolactone use was significantly associated with a reduced risk of prostate cancer (aHR = 0.45, 95% CI = 0.23–0.89, p = 0.02), while being associated with an elevated risk of renal cancer (aHR = 2.09, 95% CI = 1.07–4.08, p = 0.03). However, no clear cumulative dose-response relationship was observed in theses associations.</p> Conclusions <p>High cumulative dose of spironolactone may be potentially associated with a decreased incidence of prostate cancer and an increased incidence of renal cancer, while no significant association was observed with bladder cancer incidence. However, given the lack of support from the dose-response pattern, the available evidence is inconclusive to establish a definitive association between spironolactone use and urinary tract cancer.</p>","author":"Liang-Cheng Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8a7240355808141b0641078c68053a86059bb97676efc862cec8e3c3fb161716","category":"Interdisciplinary"}