{"title":"Assessment of Serum ACTH, Melatonin, and Cortisol Levels in Patients with Hormone Imbalance and Multiple Sclerosis","link":"https://www.preprints.org/manuscript/202408.2255/v2","date":1728913301000,"content":"Introduction: Multiple sclerosis (MS) is a long-term inflammatory disease that affects the central nervous system due to an abnormal immune response. Hormonal and enzyme changes in these patients can influence the progression and prognosis of the disease. In this research, the levels of cortisol, adrenocorticotropic hormone (ACTH), melatonin, and lactate dehydrogenase (LDH) in the blood of MS patients were studied.Methods: This study involved 50 MS patients and 50 healthy individuals. The levels of ACTH, melatonin, and cortisol in the blood were measured using specific ELISA kits. The data obtained were then analyzed statistically using SPSS software.Results: The findings revealed a significant increase in the levels of cortisol and LDH in MS patients (P&lt;0.05), while the levels of melatonin and ACTH showed a significant decrease (P&lt;0.05). The elevated cortisol levels may be attributed to chronic stress and inflammation associated with MS. An increase in LDH levels can indicate tissue damage caused by myelin destruction. On the other hand, decreased melatonin levels may lead to sleep disturbances and increased stress in these patients, while decreased ACTH levels may be linked to disruptions in the hypothalamic-pituitary-adrenal (HPA) axis. Conclusion: The hormonal and enzyme changes observed in MS patients illustrate the wide-ranging impact of the disease on various body systems. The increase in cortisol and LDH as well as the decrease in melatonin and ACTH could serve as useful biomarkers for predicting disease progression and managing the condition. These findings align with previous studies and contribute to a deeper understanding of the pathological mechanisms of MS.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8a78e9704d327a6d9c66338836dbdfa096e9ea022847f577abd881ddb9a48bab","category":"Interdisciplinary"}