{"title":"Genetic Sex and Origin Identification Suggests Differential Migration of Male and Female Atlantic Bluefin Tuna (Thunnus thynnus) in the Northeast Atlantic","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70009?af=R","date":1726729200000,"content":"<h2>ABSTRACT</h2>\n<p>Knowledge about sex-specific difference in life-history traits—like growth, mortality, or behavior—is of key importance for management and conservation as these parameters are essential for predictive modeling of population sustainability. We applied a newly developed molecular sex identification method, in combination with a SNP (single nucleotide polymorphism) panel for inferring the population of origin, for more than 300 large Atlantic bluefin tuna (ABFT) collected over several years from newly reclaimed feeding grounds in the Northeast Atlantic. The vast majority (95%) of individuals were genetically assigned to the eastern Atlantic population, which migrates between spawning grounds in the Mediterranean and feeding grounds in the Northeast Atlantic. We found a consistent pattern of a male bias among the eastern Atlantic individuals, with a 4-year mean of 63% males (59%–65%). Males were most prominent within the smallest (&lt; 230 cm) and largest (&gt; 250 cm) length classes, while the sex ratio was close to 1:1 for intermediate sizes (230–250 cm). The results from this new, widely applicable, and noninvasive approach suggests differential occupancy or migration timing of ABFT males and females, which cannot be explained alone by sex-specific differences in growth. Our findings are corroborated by previous traditional studies of sex ratios in dead ABFT from the Atlantic, the Mediterranean, and the Gulf of Mexico. In concert with observed differences in growth and mortality rates between the sexes, these findings should be recognized in order to sustainably manage the resource, maintain productivity, and conserve diversity within the species.</p>","author":"Einar Eg Nielsen, \nKim Birnie‐Gauvin, \nHenrik Baktoft, \nHaritz Arrizabalaga, \nTomas Brodin, \nMassimiliano Cardinale, \nMichele Casini, \nGustav Helström, \nTeunis Jansen, \nAnders Koed, \nPetter Lundberg, \nBrian R. MacKenzie, \nAntonio Medina, \nSøren Post, \nNaiara Rodriguez‐Ezpeleta, \nAndreas Sundelöf, \nJosé Luis Varela, \nKim Aarestrup","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"8a803aebba4a0029729bfa7173d9403455fc2122d9c78cc590dc7de38e52676d","category":"Environment"}