{"title":"Explicit Consideration of Plant Xylem Hydraulic Transport Improves the Simulation of Crop Response to Atmospheric Dryness in the U.S. Corn Belt","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036468?af=R","date":1718970914000,"content":"<h2>Abstract</h2>\n<p>Atmospheric dryness (i.e., high vapor pressure deficit, VPD), together with soil moisture stress, limits plant photosynthesis and threatens ecosystem functioning. Regions where rainfall and soil moisture are relatively sufficient, such as the rainfed part of the U.S. Corn Belt, are especially prone to high VPD stress. With globally projected rising VPD under climate change, it is crucial to understand, simulate, and manage its negative impacts on agricultural ecosystems. However, most existing models simulating crop response to VPD are highly empirical and insufficient in capturing plant response to high VPD, and improved modeling approaches are urgently required. In this study, by leveraging recent advances in plant hydraulic theory, we demonstrate that the VPD constraints in the widely used coupled photosynthesis-stomatal conductance models alone are inadequate to fully capture VPD stress effects. Incorporating plant xylem hydraulic transport significantly improves the simulation of transpiration under high VPD, even when soil moisture is sufficient. Our results indicate that the limited water transport capability from the plant root to the leaf stoma could be a major mechanism of plant response to high VPD stress. We then introduce a Demand-side Hydraulic Limitation Factor (DHLF) that simplifies the xylem and the leaf segments of the plant hydraulic model to only one parameter yet captures the effect of plant hydraulic transport on transpiration response to high VPD with similar accuracy. We expect the improved understanding and modeling of crop response to high VPD to help contribute to better management and adaptation of agricultural systems in a changing climate.</p>","author":"Yi Yang, \nKaiyu Guan, \nBin Peng, \nYanlan Liu, \nMing Pan","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"8a843a2e12f099a1cfc3e110f2398b03476cb504b7f9e3738d238a9ff4fc017a","category":"Environment"}