{"title":"Interrelations of α‐ and β‐amylase activity with starch, sugars, and culinary and nutritional quality attributes in sweetpotato storage roots","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.12832?af=R","date":1715852592000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Little information is available on α- and β-amylase activity and their associations with starch, sugars and other culinary qualities in sweetpotato. The present study aimed to assess sweetpotato storage root α- and β-amylase activity in relation to starch, sugars, β-carotene content and storage root flesh color.</p>\n<h2>RESULTS</h2>\n<p>α- and β-amylase activity (α-AA and β-AA) were assayed from a Tanzania (T) × Beauregard (B) genetic mapping population in their uncured (raw), cured and stored (approximately 11 weeks) forms during 2016 and 2017. Ceralpha and Betamyl methods, with modifications to suit a high-throughput microplate assay format, were used to quantify α-AA and β-AA, respectively. Storage root dry matter, starch, glucose, fructose, sucrose and β-carotene content were predicted using near infrared reflectance spectroscopy. There was little relationship (<i>r</i>\n<sup>2</sup> = 0.02–0.08, <i>P</i> ≤ 0.05 in 2016 and <i>r</i>\n<sup>2</sup> = 0.05–0.11, <i>P</i> ≤ 0.05 in 2017) between α-AA and β-AA. We observed negative linear associations between α-AA and dry matter content and generally no correlations between β-AA and dry matter content. β-AA and sugars were weakly positively correlated. β-AA and β-carotene content were positively correlated (<i>r</i> = 0.3–0.4 in 2016 and 0.3–0.5 in 2017).</p>\n<h2>CONCLUSION</h2>\n<p>Generally, the correlation coefficient for amylase enzyme activity and sugar components of storage roots at harvest increased after curing and during post-harvest storage. The present study is a major step forward in sweetpotato breeding in terms of providing a better understanding of how α- and β-amylase activity are inter-associated with several culinary quality attributes. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Victor A. Amankwaah, \nSharon Williamson, \nBode A. Olukolu, \nVan‐Den Truong, \nEdward Carey, \nReuben Ssali, \nGeorge Craig Yencho","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8a863f7e4a3728ee048c3ce1fde2db3842ee6e56eb88191f025e20a2b8aaf731","category":"Environment"}