{"title":"Clear as day: best daytime running lights in focus","link":"https://www.cyclist.co.uk/in-depth/9825/clear-as-day-best-daytime-running-lights-in-focus","date":1625232265000,"content":"<span>\n      <span><a href=\"/authors/sam-challis\">Sam Challis</a></span>\n  </span><div>  \n  <div>      <div><span>2 Jul 2021</span></div>    </div></div><p>\nDon’t wait till sundown to switch on and be seen</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/07/tech_daytime_running_lights_01.jpg?itok=ndKcjDdl\" />  </div>\n<div>\n      <p> <strong>Knog Blinder X, £39.99 each, <a href=\"http://www.silverfish-uk.com\" target=\"_blank\">silverfish-uk.com</a>, buy the set now from <a href=\"https://www.chainreactioncycles.com/knog-blinder-x-front-and-rear-bike-light-set/rp-prod199569\" target=\"_blank\">Chain Reaction Cycles</a></strong></p>\n<p><strong>Photography</strong>: Rob Milton</p>\n<p>Being more visible is the best way for riders to protect themselves from the dangers of busy roads. Hi-vis clothing has come a long way (reflective materials mean riders can boost their visibility without looking like they work on a building site), but if you really want to grab the attention of oncoming motorists you might want to consider investing in some DRLs – daytime running lights.</p>\n<p>Bontrager, which has offered DRLs for several years, says its Flare RT light is visible from 2km away, and the company’s stats suggest daytime lights can have a big impact on rider safety. Apparently DRLs make a rider 2.4 times more noticeable to other road users and decrease accidents by 33%.</p>\n<p>Mark Swift from light manufacturer Exposure explains why they are such an effective tool to increase safety.</p>\n<p>‘Cars themselves in the UK have had to have DRLs fitted by law since 2011,’ he says. ‘Consequently drivers now look out for vehicles through light, yet it isn’t law for bikes to have them on, and by comparison cyclists are small, soft and vulnerable. For us it is intuitive that cyclists should use them and we have been pushing that message for the last four or five years.’</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/07/tech_daytime_running_lights_02.jpg\" />  </div>\n</div>\n<p><strong>Bontrager Flare RT, £44.99, buy it now from <a href=\"https://www.trekbikes.com/gb/en_GB/equipment/bike-accessories/bike-lights/bike-rear-lights/bontrager-flare-rt-rear-bike-light/p/23999/\" target=\"_blank\">trekbikes.com</a></strong></p>\n<p>While the UK has been slow to catch on, DRLs are already a common sight in places like Australia and the US. The brands Cyclist spoke to had all witnessed a snowball effect in other countries and predict the same thing will happen in the UK over the next few years.</p>\n<p>‘The best way to experience the difference a DRL makes for a cyclist out on the road is to actually see one,’ says Alex Applegate of Bontrager. ‘Seeing is believing and the more people that see how much of a difference a DRL can make, the more people will choose to ride with one always on.’</p>\n<p><a href=\"http://www.dennismags.co.uk/cyclist\"><img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/01/clickable_subs_promo.jpg\" /></a></p>\n<p>‘It’s becoming more accepted that as the lights are so readily available now, we should be using them,’ says Swift. ‘A lot of e-bikes come with them integrated as standard, which encourages other cyclists to think about the benefits they bring.’</p>\n<p>Knog CEO Hugo Davidson even thinks the coronavirus pandemic has played a part: ‘It has encouraged a huge number of consumers to forgo public transport in favour of cycling. With more cyclists on the roads and busier urban centres, all manner of schemes and initiatives – from promoting DRLs to new cycle lanes – have garnered more attention around cycling safety.’</p>\n<h3>Seeing the light</h3>\n<p>What is so effective about DRLs in particular, though? Surely any light set would do?</p>\n<p>‘Performance attributes like light weight, long battery life and robust design are a given with any of our lights,’ says Exposure’s Swift. ‘DRLs add in specific features to make them better suited to the task. They have a different type of light emittance, for one. Humans are very good at phasing out constant or regular messages to our brain, but not as good at ignoring irregular patterns.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/07/tech_daytime_running_lights_03.jpg\" />  </div>\n</div>\n<p><strong>Lezyne Micro Drive Pro 800XL, £60, <a href=\"http://www.upgradebikes.co.uk\" target=\"_blank\">upgradebikes.co.uk</a>, buy it now from <a href=\"https://www.evanscycles.com/brand/lezyne/micro-drive-pro-800xl-front-light-933453\" target=\"_blank\">Evans Cycles</a>, </strong><strong>Leyzne Zecto Drive Max 250, £50, <a href=\"http://www.upgradebikes.co.uk\" target=\"_blank\">upgradebikes.co.uk</a>, buy it now from <a href=\"https://www.probikekit.co.uk/cycling-accessories/lezyne-zecto-max-drive-250-rear-light/11509392.html\" target=\"_blank\">ProBikeKit</a></strong></p>\n<p>As a result of our extensive work with the emergency services, we have devised a particular pulse pattern that as a car driver you can’t ignore. It has a variance in the light intensity as well as the pulse pattern, so cuts through all the other stimuli a car driver is faced with.’</p>\n<p>Applegate says Bontrager’s DRLs are similarly smart: ‘The light our DRLs emit is made up of three parts. A disruptive flash pattern helps separate the light from its surroundings and demand attention. Focussed optics help ensure that all of the light output is used and directed in the best way to be seen by a driver.</p>\n<p>That in turn gives the light the range to be seen from far enough away for a driver to notice the rider and react safely. DRL beam performance is then supported by features like easy-to-use mounts and a compact design.’</p>\n<p>It is worth noting that a front DRL is viewed as just as important as a rear.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/07/tech_daytime_running_lights_04.jpg\" />  </div>\n</div>\n<p><strong>Exposure TraceR Mk1 Daybright, £45, <a href=\"http://www.exposurelights.com\" target=\"_blank\">exposurelights.com</a>, buy it now from <a href=\"https://www.wiggle.co.uk/exposure-tracer-rear-light-with-daybright\" target=\"_blank\">Wiggle</a>,</strong> <strong>Exposure Trace Mk2 Daybright, £45, <a href=\"http://www.exposurelights.com\" target=\"_blank\">exposurelights.com</a>, buy it now from <a href=\"https://www.pureelectric.com/products/exposure-trace-mk2-daybright-front-light\" target=\"_blank\">Pure Electric</a></strong></p>\n<p>‘Having clear rear visibility is obviously crucially important. However, one of the many specifically urban cycling dangers is that of being “doored” by a car door when an occupant is exiting the vehicle. Using a front DLR goes some way to help prevent this particular danger,’ says Davidson.</p>\n<p>‘Make sure the front light is brighter, though,’ says Swift. ‘Red light travels further than white light. It cuts through the normal environment better because in theory we’re always looking into white light. Newer DRLs feature technology to help with this. Exposure uses something called Reakt, a sensor to measure the ambient light then vary the lumen output to keep a safe differential in brightness.’</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/8632/how-to-watch-and-live-stream-the-tour-de-france-2021\">How to watch and live stream the Tour de France 2021</a></div>      <div><a href=\"/in-depth/9838/gallery-bikes-of-the-tour-de-france-2021\">Gallery: Bikes of the Tour de France 2021</a></div>    </div></div><p>\nDespite the new developments in DRLs, and the evidence supporting their usage, there’s little in the way of standards for this type of light.</p>\n<p>‘Knog would welcome industry regulations,’ says Davidson. ‘It would help clarify the claims made by all bike light suppliers and help consumers make informed choices.’</p>\n<p>Until that happens it’s up to cyclists to embrace the light by day as much as they do by night. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/lights\">Lights</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8a8a91fd12e253d223b8a89cb069670b7fd6bd67e767baf6171ae96922c2d721","category":"Cycling"}