{"title":"A ‘wind tunnel for all’? – The €225,000 Aero-Optim could be a gamechanger","link":"https://cyclingtips.com/2021/09/a-wind-tunnel-for-all-the-e225000-aero-optim-could-be-a-gamechanger/","date":1630546944000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-28-650x366.jpg\" /></div><h2>A 'wind tunnel for all'? – The €225,000 Aero-Optim could be a gamechanger</h2><p>\n</p><p>It’s <a href=\"https://cyclingtips.com/2021/09/video-tech-top-trumps-from-eurobike-day-one/\" target=\"_blank\">day one at Eurobike</a> and, as usual, there is a vast array of bikes and tech on show. However, as big as the show is, one thing I didn’t expect to see was a wind tunnel. And yet that’s exactly what Japan Wind Tunnel Manufacturing (JWTM) had on display with its Aero-Optim Cell.</p>\n\n\n\n<p>Wind tunnels are expensive to build or rent, they’re inherently fixed in place, and they require vast amounts of space. But JWTM says its goal is “to develop new types of wind tunnels” and claims the “Aero Optim series wind tunnel, is easy to install, cheap, and compact.”</p>\n\n\n\n<p>The basic unit costs $55,000 and requires a level of expertise to operate and interpret, so that claim of “cheap” is entirely relative. But the Aero-Optim is undoubtedly more compact and portable than a traditional wind tunnel and could offer manufacturers and major teams or federations new levels of wind tunnel access. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-14-1340x754.jpg\" /><figcaption>The Aero-Optim unit is certainly much smaller than a wind tunnel. </figcaption></figure>\n\n\n\n<p>The Aero-Optim is a wind tunnel unit measuring in at 1.5 metres long, 68 cm tall, and 69 cm wide. Within each unit sits a 7.5 kilowatt IPM (interior permanent magnet) motor axial fan, diffuser, flow straightener, and guide vanes. Mounted on a wheeled frame, the unit is easily moved on-site or from location to location. A single Aero-Optim unit has a wind speed range of 1-15 m/s (3.6-54 km/h) with a claimed air movement distribution of +/- 8%. </p>\n\n\n\n<p>The Japanese company claims a single unit is sufficient for testing components and accessories such as helmets, while multiple units stacked side by side and/or on top of each other offers increased wind speeds, flow quality, and flow area for testing bikes and riders. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-4-1340x754.jpg\" /><figcaption>The control panel required for operating the Aero-Optim.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-3-1340x754.jpg\" /><figcaption>Wind speed. Turn it up to 11.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-1-1340x754.jpg\" /></figure></li></ul></figure>\n\n\n\n<p>Only a touchscreen control unit is required in addition to the Aero-Optim wind tunnel unit, but JWTM also has a range of “optimal components”, including an <a href=\"https://en.wikipedia.org/wiki/Anemometer\" target=\"_blank\">anemometer</a> (<a href=\"https://en.wikipedia.org/wiki/Anemometer#Hot-wire_anemometers\" target=\"_blank\">hot wire probes</a> and <a href=\"https://en.wikipedia.org/wiki/Pitot_tube\" target=\"_blank\">pitot tubes</a>), Aero-Optim software, additional units, and a bicycle measuring table. This bicycle measuring table features four weight sensors and allows for bike and rider drag force calculations.</p>\n\n\n\n<p>The dedicated software then collects live data. A 10-second average for static objects – or a 20-second average for riders pedalling – is used to calculate and display results in either newtons or a CdA calculation. </p>\n\n\n\n<p>Rider position assessments require three stacked Aero-Optim units, a controller, an anemometer, a bicycle measuring table, and associated software. All in, such a system comes in at a cool €225,000 (roughly US$270,000 / AU$360,000). At this price, the Aero-Optim certainly isn’t the “wind tunnel for all” JWTM’s tagline suggests, but for manufacturers, a single unit or even the complete system would quickly pay for itself in saved wind tunnel time. </p>\n\n\n\n<h2>Setup</h2>\n\n\n\n<p>The Aero-Optim certainly requires much less space than a traditional wind tunnel and associated building. JWTM recommends a space of 5 m or greater in front of the unit for the tested rider or accessories to sit. The unit then requires 3 m of clear space on either side, and a ceiling height of at least 4 m to ensure unobstructed or channel airflow. Unfortunately, these space requirements rule out my new garage build as a home for an Aero-Optim, but JWTM also claims the portable wind tunnel can be used outdoors, and such space requirements are much more feasible for manufacturers with large warehouses or manufacturing facilities. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-12-1340x754.jpg\" /><figcaption>A single Aero-Optim is used for testing smaller equipment and accessories.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-18-1340x754.jpg\" /><figcaption>Clear out a space, set a helmet in front of the unit, and test to your heart’s content.  </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-35-1340x754.jpg\" /><figcaption>Multiple stacked units provide a solution for testing bikes and rider positions. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-28-1340x754.jpg\" /><figcaption>Dave Everett enjoying some cooling off in the hot EuroBike halls. </figcaption></figure></li></ul></figure>\n\n\n\n<h2>But does it work?</h2>\n\n\n\n<p>This latest version of the Aero-Optim system, the Cell, is in the final stages of development and as such JWTM is very guarded about its testing and accuracy data. The brand did say results from its system trend very closely to wind tunnel testing results. </p>\n\n\n\n<p>While JWTM is understandably confident in its results, some questions remain for me. Not least: how does the system maintain accuracy with the variable conditions and environments of multiple indoor and open outdoor settings?</p>\n\n\n\n<p>This is undoubtedly not a “wind tunnel for all”, but if my accuracy worries are unfounded, it could certainly prove to be a wind tunnel for all manufacturers, or at least a lot of them. That could eventually lead to faster bikes and components for us all. </p>\n\n\n\n<p>More information is available at <a href=\"https://japanfudo.com/en/product/aerooptim-cell.html\" target=\"_blank\">JapanFudo.com</a></p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-5-1340x754.jpg\" /><figcaption>A look down the barrel of a wind tunnel.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-37-1340x754.jpg\" /><figcaption>A view of the rear of the Aero-Optim unit.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-2-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-6-1340x754.jpg\" /></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/Aero-Optim-wind-tunnel-7-1340x754.jpg\" /></figure></li></ul></figure>\n<p></p><a href=\"https://cyclingtips.com/2021/09/a-wind-tunnel-for-all-the-e225000-aero-optim-could-be-a-gamechanger/\">Read More</a>","author":"Ronan Mc Laughlin","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8a8cedbb699d9262afae161d2be61df07e8e43d4f7a31303b7bf35f28c932e09","category":"Cycling"}