{"title":"Synergistic Effect of Influence Factors on Ammonia Volatilization in Fertilizer Solution: A Laboratory Experiment","link":"https://www.preprints.org/manuscript/202410.1486/v1","date":1729254349000,"content":"Ammonia volatilization, which is a main way for nitrogen gaseous loss of farmland, restricts the promotion of the utilization rate of nitrogen fertilizer, and contains some potential environmental risks. To investigate the general pattern of ammonia volatilization under actual paddy field conditions, researchers designed an indoor simulated system to measure the amount of ammonia volatilized within a single time period by controlling the pH and concentration of NH4+ (c(NH4+)) in the solution, the gas-liquid interfacial gas velocity, and the ambient temperature. In this paper, the influence of these factors, the synergistic effect on ammonia volatilization and their quantitative relationship were discussed. Researchers use the resolution of ammonium bicarbonate (SAB) and diammonium phosphate (SDP) for simulation experiments, and the results show that, there are significant linear relationship between amount of ammonia volatilization and c(NH4+). The correlation coefficient is between 0.9214 to 0.9897 and 0.8932 to 0.9904 for SAB and SDP, respectively. The quantitative relationship between temperature, pH and the influence factor (CIF), the initial ammonia volatilization fluxes (IAVF) was analyzed by least-squares method, and the degrees of polynomial were one and two respectively. The regression equations of the SAB and SDP among the amount of ammonia volatilization with the concentration of ammonium nitrogen, the temperature and the pH were gotten by using MATLAB. Considering the effects of temperature and pH on CIF and IAVF under individual conditions, we use binary cubic model to fit the relationship between temperature, pH to CIF and IAVF, the simulation results show that the correlation coefficients between CIF and IAVF for SAB are 0.9980 and 0.9680, however the correlation coefficients are 0.9946 and 0.9708 for SDP, respectively. The quantitative equation takes into account coefficient of determination and degrees of polynomial, and the ammonia volatilization fluxes can be calculated by using these equations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8a8e335184914d88d32eed634712f63b3cfec73c4489134b5951847991df04fc","category":"Interdisciplinary"}