{"title":"Maternal death surveillance and response system reports from 32 low-middle income countries, 2011–2020: What can we learn from the reports?","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002153","date":1709647200000,"content":"<p>by Lillian Whiting-Collins, Florina Serbanescu, Ann-Beth Moller, Susanna Binzen, Jean-Pierre Monet, Jenny A. Cresswell, Michel Brun, on behalf of the World Health Organization’s MDSR Reporting and Monitoring Working Group </p>\r\n\r\nMaternal Death Surveillance and Response (MDSR) systems generate information that may aid efforts to end preventable maternal deaths. Many countries report MDSR data, but comparability over time and across settings has not been studied. We reviewed MDSR reports from low-and-middle income countries (LMICs) to examine core content and identify how surveillance data and data dissemination could be improved to guide recommendations and actions. We conducted deductive content analysis of 56 MDSR reports from 32 LMICs. A codebook was developed assessing how reports captured: 1) MDSR system implementation, 2) monitoring of maternal death notifications and reviews, and 3) response formulation and implementation. Reports published before 2014 focused on maternal death reviews only. In September 2013, the World Health Organization and partners published the global MDSR guidance, which advised that country reports should also include identification, notification and response activities. Of the 56 reports, 33 (59%) described their data as incomplete, meaning that not all maternal deaths were captured. While 45 (80%) reports presented the total number of maternal deaths that had been notified (officially reported), only 16 (29%) calculated notification rates. Deaths were reported at both community and facility levels in 31 (55%) reports, but 25 (45%) reported facility deaths only. The number of maternal deaths reviewed was reported in 33 (59%) reports, and 17 (30%) calculated review completion rates. While 48 (86%) reports provided recommendations for improving MDSR, evidence of actions based on prior recommendations was absent from 40 (71%) of subsequent reports. MDSR reports currently vary in content and in how response efforts are documented. Comprehensive reports could improve accountability and effectiveness of the system by providing feedback to MDSR stakeholders and information for action. A standard reporting template may improve the quality and comparability of MDSR data and their use for preventing future maternal deaths.","author":"Lillian Whiting-Collins","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"8a9320d7b9161cd528e58fc5912312587575019b1df9180c52fffacdf4d2c693","category":"Environment"}