{"title":"Evolution of Complexity of Palliative Care Needs and Patient Profiles according to the PALCOM Scale: Pooled Analysis of the Cohorts for the Development and Validation of the PALCOM Scale in Advanced Cancer Patients","link":"https://www.preprints.org/manuscript/202403.1240/v1","date":1711020216000,"content":"Introduction:  Identifying the complexity of palliative care needs is a key aspect of referral to specialised multidisciplinary early palliative care (EPC) teams. The PALCOM scale is an instrument consisting of five multidimensional assessment domains, developed in 2018 and validated in 2023, to identify the level of complexity in patients with advanced cancer. \nObjectives: The main objective of this study was to determine the degree of instability (likelihood of level change or death), health resource consumption and survival of patients according to the level of palliative complexity assigned at the baseline visit during a 6-month follow-up. \nMethod: An observational, prospective, multicentre study was conducted using pooled data from the development and validation cohort of the PALCOM scale. The main outcome variables were: a) instability ratio (IR), defined as the probability of level change or death; b) emergency department visits; c) days of hospitalisation; d) hospital death; e) survival. All variables were analysed monthly according to the level of complexity assigned at the baseline visit. \nResults: A total of 607 patients with advanced cancer were enrolled. According to the PALCOM scale, 20% of patients were classified as low complexity, 50% as medium and 30% as high complexity. The overall IR was 45% in the low complexity group, 68% in the medium complexity group and 78% in the high complexity group (p","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8a9698074fdeba83332197953c282f120ebef5695e0e2853338a0a17f138b862","category":"Interdisciplinary"}