{"title":"CleanMyMac X review: A solid scrubber with hit-or-miss malware removal","link":"https://www.macworld.com/article/352922/cleanmymac-x-review-macos.html","date":1629370800000,"content":"<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Excellent cleaning tools for Mac storage</li><li>Large toolset</li></ul></div><div><h3>Cons</h3><ul><li>Updater feature missed some app updates</li><li>Malware Removal produced mixed results</li></ul></div></div></div><h3>Our Verdict</h3><p>CleanMyMac X offers some nice surprises with its disk maintenance tools. But for the price, it would be ideal if all of its modules worked equally well.</p>\n</div><h3>Price When Reviewed</h3><p>$34.95 per year subscription ($149.95 one-time purchase)</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>MacPaw</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$35</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://macpaw.com/store/cleanmymac&amp;xcust=1-1-352922-2-352927-13486&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p></p>\n\n\n\n<p>With Mac utilities, a multifaceted approach the offers several base functions can be excellent. There’s also a possibility that the developer overextended themselves trying to be everything to everyone, and the result is that some features aren’t as good as others, making you wonder about the value of the total app. </p>\n\n\n\n<p>CleanMyMac X seems to be in danger of having run into the latter category. The catch-all utility offers an assortment of modules with its core focus centered around identifying and cleaning out gigabytes upon gigabytes of unused system garbage. The modules are Smart Scan, System Junk, Mail Attachments, Trash Bins, Malware Removal, Privacy, Optimization, Maintenance, Uninstaller, Updater, Extensions, Space Lens, Large &amp; Old Files, and Shredder.</p>\n\n\n\n<p>As with previous versions, a handy Menu Bar item provides useful information, such as drive capacities, CPU speeds, system temperature, system load, and network activity readouts. The modules themselves generally live up to their purpose, and it’s handy to be able to do a general search for data that’s consuming large parts of your hard drive as well as drill down and enable or disable specific system-level extensions as needed. CleanMyMac X still runs a handy set of maintenance scripts, such as clearing the DNS cache and repairing file permissions, which help to keep things in order.</p>\n\n\n\n<p>To its credit, CleanMyMac X offers some nice surprises, and I was able to recover more than 30GB of drive space as the program found unused files and disk images galore via my iCloud storage. Other features such as the Disk Lens and Uninstaller offered a clear view as to which folders were consuming the most drive space and a quick means of removing applications. </p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/CleanMyMacX-system-junk.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The System Junk module after locating 7.41 gigabytes of extraneous files.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>The Updater and Malware Removal features</h2>\n\n\n\n<p>Unfortunately, CleanMyMac X has a couple of modules that are the app’s greatest hurdles. While well-intentioned and focused as marketing and selling points, the Updater function seems to only locate a smattering of available application updates, and it’s almost anyone’s guess as to what it will see and what will be glossed over. In my case, the Updater caught major updates such as Microsoft Office components and located a small update to SimCity but missed Zoom updates during its scans as well as the latest Firefox update. That’s disconcerting, as Firefox and Zoom have an extremely large user base.</p>\n\n\n\n<p>The Malware Removal system has gotten better but isn’t where it could be. After infecting my Mac with a fair amount of dubious software (including an infamous keystroke logger disguised as an Adobe Flash Player update), the Malware Removal module was able to diagnose and remove most of my malware but kept the infamous MacKeeper in place, which then had to be torn out by the roots by a copy of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.malwarebytes.com/&amp;xcust=1-1-352922-1-0-0&amp;sref=https://www.macworld.com/feed\">Malwarebytes</a>. It’s instances such as this that make one raise an eyebrow and wonder what else might be missed.</p>\n\n\n\n<p>It’s not a question of whether MacPaw, creators of CleanMyMac X have backed themselves into a corner as much as whether CleanMyMac X can deliver on all it sets out to do. For the most part, the modules work well, the application’s introductions and tutorials are as inviting and informative as ever, and it’s nice to be able to easily dig down into component-level elements of your operating system. Still, the Malware Removal system’s not where it could be and it feels as if the Updater module is only catching updates from the most prominent developers or smaller third-party ones. This has been marketed as a core feature, but there are still applications devoted to finding software updates that handle this function much better than what CleanMyMac X seems to be capable of at present.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/08/CleanMyMacX-Malware-removal.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Malware Removal module locates two pieces of suspicious software.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Bottom line</h2>\n\n\n\n<p>While CleanMyMac X performs most of its functions admirably and provides an excellent means of clearing gigabytes of unused system detritus/gunk off your Mac, it needs to catch up and perform equally well where each of its modules is concerned. Otherwise, the software promises the world, overreaches, and puts itself in a position that almost no one can hope to achieve. </p>\n</div>","author":"Chris Barylick","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8a9cea925106d66579fac6e4f22745bcda75ce373bfeda1944f81bdeeadb5220","category":"Apple"}