{"title":"Effects of nonlinear thermal radiation on the efficiency of building integrated photovoltaic systems with nanofluid cooling","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304685","date":1718892000000,"content":"<p>by Nacer Badi, Ali Hatem Laatar, Anouar Ben Mabrouk, Abdulrhman M. Alsharari, Saleh A. Alghamdi, Hani Albalawi</p>\r\n\r\nThe nonlinear effects of thermal radiation on the free convection flow of certain nanofluids along a heated wall are studied numerically using an original finite-difference method. Nanofluids are used to improve the performance of flat and curved integrated photovoltaic modules. The partial differential equations governing the flow are difficult to solve due to the strong non-linearity of the radiative term. In contrast to previous studies, the problem is solved directly without linearization by Rosseland’s nonlinear approximation. The proposed numerical method is validated with results from the literature. The effects of nonlinearity and various physical parameters such as time, volume fraction and radiation parameter on the velocity, temperature, Nusselt number and skin friction coefficient of the CuO-water nanofluid are analyzed and presented graphically. A comparative study between the solutions given by the linear and non-linear problems reveals that Rosseland’s linear approximation is no longer valid when the effect of thermal radiation is significant. On the other hand, the non-linear model better reflects the physical phenomena involved in the cooling process. Finally, a comparison of the performance of five nanofluids (CuO, Ag, Al<sub>2</sub>O<sub>3</sub>, Cu and TiO<sub>2</sub> in water) shows that the Cu-water nanofluid performs best, with a high heat transfer rate and low shear stresses.","author":"Nacer Badi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8aa6210c68faeb188cc8b8ff583e7e77aa9934262a5fdda13c9905d8c7fa3e31","category":"Interdisciplinary"}