{"title":"Current challenges of microalgae applications: exploiting the potential of non‐conventional microalgae species","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13136?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<p>The intensified attention to health, the growth of an elderly population, the changing lifestyles, and the medical discoveries have increased demand for natural and nutrient-rich foods, shaping the popularity of microalgae products. Microalgae thanks to their metabolic versatility represent a promising solution for a ‘green’ economy, exploiting non-arable land, non-potable water, capturing carbon dioxide (CO<sub>2</sub>) and solar energy. The interest in microalgae is justified by their high content of bioactive molecules, such as amino acids, peptides, proteins, carbohydrates, polysaccharides, polyunsaturated fatty acids (as ω-3 fatty acids), pigments (as β-carotene, astaxanthin, fucoxanthin, phycocyanin, zeaxanthin and lutein), or mineral elements. Such molecules are of interest for human and animal nutrition, cosmetic and biofuel production, for which microalgae are potential renewable sources. Microalgae, also, represent effective biological systems for treating a variety of wastewaters and can be used as a CO<sub>2</sub> mitigation approach, helping to combat greenhouse gases and global warming emergencies. Recently a growing interest has focused on extremophilic microalgae species, which are easier to cultivate axenically and represent good candidates for open pond cultivation. In some cases, the cultivation and/or harvesting systems are still immature, but novel techniques appear as promising solutions to overcome such barriers. This review provides an overview on the actual microalgae cultivation systems and the current state of their biotechnological applications to obtain high value compounds or ingredients. Moreover, potential and future research opportunities for environment, human and animal benefits are pointed out. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Paride Salvatore Occhipinti, \nNunziatina Russo, \nPaola Foti, \nIrene Maria Zingale, \nAlessandra Pino, \nFlora Valeria Romeo, \nCinzia L. Randazzo, \nCinzia Caggia","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8aa8c2177218832227d0068d65a64045e7e28b75a1d0b3fd23e46c3955da1a91","category":"Environment"}