{"title":"Estimating growout production costs of commercial‐scale marine finfish production in southern tier US states","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13075?af=R","date":1722826820000,"content":"<h2>Abstract</h2>\n<p>Increased interest in marine fish farming in the United States has led to a need for fundamental economic information on production of candidate species for commercialization in various production systems. Funding for the project targeted those species with potential for production in southern tier states in the United States. Sufficient technical data were found to develop comprehensive budget analyses to estimate growout production costs for four scales of production for each of 10 species with potential for production in ponds, 13 in recirculating aquaculture systems (RAS), and five in net pens. The choice of species/production system scenarios was based on evidence of successful production on farms or in research. Estimation of production costs with enterprise budgets can provide useful guidance to identify the types of improved efficiencies that have the greatest effect on economic viability even when commercial farm data are not available. Commercial farm data were used where available, but for most species, data were available only from studies conducted under research conditions. Per-kg costs of production were lowest for net pen production, followed by ponds, with production costs in RAS two to five times greater than in ponds or net pens. Ponds and net pens generally exhibited greater efficiency of use of capital assets across species than did RAS that resulted in lower percentages of fixed costs and lower annual costs per kg of fish produced. All five species evaluated for net pen production were estimated to be profitable, including redfish, <i>Sciaenops ocellatus</i> (also known as red drum), striped bass, <i>Morone saxatilis</i>, cobia, <i>Rachycentron canadum</i>, red snapper, <i>Lutjanus campechanus</i>, and seriolids (generic budget for almaco jack, <i>Seriola rivoliana</i>, California yellowtail, <i>Seriola lalandi</i>, and greater amberjack, <i>Seriola dumerili</i>), four in ponds (redfish, hybrid drum, ♀<i>Pogonias cromis</i> × ♂<i>Sciaenops ocellatus</i>, black sea bass, <i>Centropristis striata</i>, and cobia), but none of the RAS scenarios showed profitability at average yields (kg/cubic meter) reported in the literature. Comprehensive data on growout production of marine finfish species in the United States is generally lacking, and there is a strong need for production trials conducted under near-commercial conditions with an endpoint of market-sized fish. Production trials should be conducted in ponds (≥0.1 ha), net pens, and RAS tanks of a size that simulate commercial production conditions. Adequate production trial databases would provide opportunities to develop economic optimization models that would provide useful guidance for prospective producers. Average yields (kg/cubic meter) in RAS will need to be much greater than currently reported in the research literature for RAS production to be economically sustainable. Net pen production appears to be profitable in the United States, but effective permitting procedures are not in place. Providing research support for the US redfish sector that has developed effective production and marketing models could serve as a foundation for developing additional species and offer opportunities for diversification on marine finfish farms.</p>","author":"Carole Ruth Engle, \nNoah C. Boldt, \nJonathan van Senten, \nMichael Schwarz","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"8abdf75c455d8df84d2153346e8b3c2fae51b6c8cb7e1c72d2444498b34d9601","category":"Environment"}