{"title":"Maternal nitric oxide homeostasis impacts female gametophyte development under optimal and stress conditions","link":"https://academic.oup.com/plcell/article/36/6/2201/7611510?rss=1","date":1708387200000,"content":"<span><div>Abstract</div>In adverse environments, the number of fertilizable female gametophytes (FGs) in plants is reduced, leading to increased survival of the remaining offspring. How the maternal plant perceives internal growth cues and external stress conditions to alter FG development remains largely unknown. We report that homeostasis of the stress signaling molecule nitric oxide (NO) plays a key role in controlling FG development under both optimal and stress conditions. NO homeostasis is precisely regulated by <span>S</span>-nitrosoglutathione reductase (GSNOR). Prior to fertilization, GSNOR protein is exclusively accumulated in sporophytic tissues and indirectly controls FG development in Arabidopsis (<span>Arabidopsis thaliana</span>). In GSNOR null mutants, NO species accumulated in the degenerating sporophytic nucellus, and auxin efflux into the developing FG was restricted, which inhibited FG development, resulting in reduced fertility. Importantly, restoring <span>GSNOR</span> expression in maternal, but not gametophytic tissues, or increasing auxin efflux substrate significantly increased the proportion of normal FGs and fertility. Furthermore, <span>GSNOR</span> overexpression or added auxin efflux substrate increased fertility under drought and salt stress. These data indicate that NO homeostasis is critical to normal auxin transport and maternal control of FG development, which in turn determine seed yield. Understanding this aspect of fertility control could contribute to mediating yield loss under adverse conditions.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"8ac0261b6e39518978925317cce475b004d6c6a70e7280a93761f717495a8d5e","category":"Environment"}