{"title":"Transthoracic Cross Clamp Versus Endoaortic Balloon Occlusion in Minimally Invasive Mitral Valve Surgery: A Pooled Study with Subgroup Analyses","link":"https://www.preprints.org/manuscript/202407.2170/v1","date":1721993448000,"content":"Objective: We reviewed the available literature on patients undergoing minimally invasive mitral valve surgery (MIMVS) with either transthoracic clamping (TTC) or endoaortic balloon occlusion (EABO). Methods: Original research studies that evaluated the perioperative outcomes of TTC versus EABO group were identified, from 2000 to 2024. The incidence of all-cause mortality, cerebrovascular accidents (CVA), and aortic dissections were the primary endpoints. The cardiopulmonary bypass (CPB), cross-clamp, and ventilation time, along with the incidence of conversion to sternotomy, re-exploration, new-onset atrial fibrillation (AF), postoperative acute kidney injury (AKI), ICU stay, and LOS were the secondary endpoints. Subgroup analyses were performed regarding EABO cannulation approach (femoral and aortic) and MIMVS approach (video-assisted and robotic-assisted). Sensitivity analyses were performed including risk-adjusted populations and with the leave-one-out method. Results: Sixteen studies were included in the qualitative and quantitative synthesis. After pooling data from 6,335 patients, both groups demonstrated similar outcomes on all primary and secondary endpoints in the non-adjusted and adjusted total cohort analyses. These outcomes were further validated by the leave-one-out sensitivity analysis. In addition, the aortic cannulation EABO was associated with lower cross-clamp time, followed by TTC and femoral cannulation EABO approach. Furthermore, in the video-assisted subgroup analysis, the EABO approach was associated with a higher incidence of CVA, conversion to sternotomy, and longer ICU stay compared to the TTC group. Conclusions: The present meta-analysis indicates that both aortic occlusion techniques are safe and feasible in the context of MIMVS. A future well-designed Randomized-Control Trial should further validate the current outcomes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8acb9aae90b5e80f7f18d25c7997d862c5b96a981272cb3bc209a758e0b8c1c6","category":"Interdisciplinary"}