{"title":"Screening and Engineering Yeast Transporters to Improve Cellobiose Fermentation by Recombinant Saccharomyces cerevisiae","link":"https://www.preprints.org/manuscript/202408.1444/v1","date":1724154436000,"content":"Developing recombinant Saccharomyces cerevisiae strains capable of transporting and fermenting cellobiose directly is a promising strategy for second-generation ethanol production from lignocellulosic biomass. In this study we cloned and expressed in the CEN.PK2-1C strain an intracellular βglucosidase (SpBGL7) from Spathaspora passalidarum, and co-expressed the cellobiose transporter SiHXT2.4 from Scheffersomyces illinoinensis, and two putative transporters from Candida tropicalis (CtCBT1) and Meyerozyma guilliermondii (MgCBT2). While all three transporters allowed cell growth on cellobiose, only the MgCBT2 permease allowed cellobiose fermentation, although cellobiose consumption was stuck (incomplete). The analysis of the βglucosidase and transport activities revealed that the cells stopped to consume cellobiose due to a drop in the transport activity. Since ubiquitinylation of lysine residues at the N- or C-terminal domains of the permease are involved in the endocytosis and degradation of sugar transporters, we constructed truncated versions of the permease lacking lysine residues at the C-terminal domain (MgCBT2ΔC), and at both the C- and N-terminal domain (MgCBT2ΔNΔC), and co-expressed these permeases with the SpBGL7 βglucosidase in an industrial strain. While the strain harboring the MgCBT2ΔC transporter continued to produce stuck cellobiose fermentations as the wild-type MgCBT2 permease, the strain with the MgCBT2ΔNΔC permease was able to consume and ferment all the cellobiose present in the medium. Thus, our results highlight the importance of expressing cellobiose transporters lacking lysine at the N- and C-terminal domains for efficient cellobiose fermentation by recombinant S. cerevisiae.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8ace0b0868a66e4e4b9afb5b12c113ab7566fc8ef70831b22b1978cdd5bb76f5","category":"Interdisciplinary"}