{"title":"World’s largest chip foundry TSMC sets 2050 deadline to go carbon neutral","link":"https://arstechnica.com/?p=1796734","date":1632154875000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1148084446-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1148084446.jpg\">Enlarge</a> <span>/</span> Signage for Taiwan Semiconductor Manufacturing Co. (TSMC) is displayed inside the company's headquarters in Hsinchu, Taiwan. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/signage-for-taiwan-semiconductor-manufacturing-co-is-news-photo/1148084446?adppopup=true\">Ashley Pon/Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The dirty secret of the computing and networking world is that most of its pollution comes not from the electricity used to run the devices, but from the energy and materials used to produce the chips that make it all possible.</p>\n<p>In a typical laptop like a MacBook Air, manufacturing represents 74 percent of the device’s lifetime carbon emissions, including shipping, use, and disposal. Of that, about half is from integrated circuits, according to <a href=\"https://arxiv.org/abs/2011.02839\">a recent study</a> led by researchers at Harvard. Researchers have found similar trends throughout the industry. “Chip manufacturing, as opposed to hardware use and energy consumption, accounts for most of the carbon output attributable to hardware systems,” the study’s authors said.</p>\n<p>That footprint may wane in the coming years, though, as TSMC announced last week that it would flatten its emissions growth by 2025 and reach net-zero carbon by 2050. That’ll be a tall order for a company that produced over 15 million tons of carbon pollution last year across the entire scope of its operations, about the same as the country of Ghana. Though the amount of carbon pollution per wafer produced by TSMC has declined in recent years, surging demand for semiconductors has driven overall emissions up, and years of rising energy use, likely from the introduction of EUV lithography, has slowed progress.</p></div><p><a href=\"https://arstechnica.com/?p=1796734#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1796734&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ad9a1c8a255fc2dbee9b665e35cd4a449cf9193bfc6366441473424833f57fa","category":"Tech"}