{"title":"The 2024 Ford Mustang is the next car to lose AM radio","link":"https://arstechnica.com/?p=1923147","date":1678461312000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/am-radio-800x533.jpg\" alt=\"old car stadio\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/am-radio-scaled.jpg\">Enlarge</a> <span>/</span> Old car radio in a classic car (credit: <a href=\"https://www.gettyimages.com/detail/photo/close-up-of-stereo-royalty-free-image/1187167555\">Lars Johansson/EyeEm via Getty</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><strong>Update, 1:15 pm:</strong> Ford reached out to Ars with its explanation for dropping AM from the next Mustang. \"A majority of U.S. AM stations, as well as a number of countries and automakers globally, are modernizing radio by offering internet streaming through mobile apps, FM, digital and satellite radio options. Ford will continue to offer these alternatives for customers to hear their favorite AM radio music, news and podcasts as we remove amplitude modulation—the definition of AM in this case—from most new and updated models we bring to market,\" wrote a Ford spokesperson.</p>\n<p>In its <a href=\"https://www.markey.senate.gov/imo/media/doc/letters_of_automaker_responses_-_030823pdf.pdf\">December reply to Sen. Markey</a>, Ford also noted that even without an AM receiver, \"with FM, satellite radio, mobile data, and others, vehicles and their drivers have numerous alternative sources to receive [FEMA's Emergency Alert System] alerts.\"</p>\n<p><strong>Original story:</strong> You have to hand it to AM radio—it has outlasted the 8-track, the cassette, and the compact disc as a way to deliver audio content to a car. This first-generation radio broadcast technology dates back to the dawn of the last century before it was superseded by FM, which has better sound fidelity and is less likely to suffer from interference.</p></div><p><a href=\"https://arstechnica.com/?p=1923147#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923147&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"23e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ae53a3e6b3d07acf96c6ca7e486caa17b6baa25912737f9c5c157","category":"Tech"}