{"title":"ผู้บริหาร Xbox ยอมรับ การปิดสตูดิโอ Lionhead ที่สร้าง Fable เป็นความผิดพลาด","link":"https://www.blognone.com/node/126309","date":1639474876000,"content":"<div><div><div><p>ใน<a href=\"https://www.blognone.com/node/126307\">ซีรีส์ Power On เล่าประวัติเครื่องเกม Xbox ของไมโครซอฟท์</a> มีประเด็นที่น่าสนใจคือผู้บริหารทีม Xbox หลายคนยอมรับว่าการปิดสตูดิโอ Lionhead ที่สร้างเกม Black &amp; White และ Fable เมื่อปี 2016 เป็นการตัดสินใจที่ผิดพลาดของบริษัท</p>\n<p>Lionhead Studios เป็นสตูดิโอเกมที่ก่อตั้งเมื่อปี 1997 โดย Peter Molyneux เกมดีไซเนอร์ชื่อดังที่มีผลงานมากมาย ทั้ง Populous, Theme Park, Dungeon Keeper ผลงานของ Lionhead ในยุคแรกๆ คือ Black &amp; White (2001) และ Fable (2004)</p>\n<p>จุดเปลี่ยนของ Lionhead คือไมโครซอฟท์ซื้อกิจการในปี 2006 ซึ่งหลังจากนั้น Lionhead ยังมีผลงานเกมต่อเนื่อง ได้แก่ Fable II (2008), Fable III (2010)</p>\n<p>อย่างไรก็ตาม ช่วงนั้นไมโครซอฟท์หันมาดัน Kinect สุดตัว (โดยเฉพาะ หลังเปิดตัว Xbox One ในปี 2013) และโยกสตูดิโอเกมของตัวเองไปทำเกมให้ Kinect ด้วย (อีกสตูดิโอที่โดนเหมือนกันคือ Rare) ปัญหาคือเกม Fable: The Journey ที่ใช้ Kinect ควบคุมกลับไม่เวิร์คอย่างที่คิด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/8d914918e0c04af6147ba10ae592fac1.jpg\" /></p>\n<p>แกนนำของ Lionhead รวมถึง Molyneux ทยอยลาออกกันในปี 2012 และโครงการเกมสุดท้ายคือ Fable Legends ก็ยังไม่ทันเสร็จเป็นรูปเป็นร่าง ไมโครซอฟท์ตัดสินใจปิดสตูดิโอเมื่อปี 2016 (<a href=\"https://www.blognone.com/node/117641\">Fable ภาคใหม่กำลังจะกลับมาอีกครั้ง โดยสตูดิโออีกแห่งคือ Playground Games</a>)</p>\n<p>Shannon Loftis อดีตหัวหน้าฝ่ายจัดจำหน่ายเกมของไมโครซอฟท์ในตอนนั้น ยอมรับในสารคดี Power On ว่าการจัดการ Lionhead ตอนนั้นเป็นสิ่งที่ทำพลาดไป ผลงานเกม Fable ในช่วงแรกออกมาดี ทำให้ไมโครซอฟท์ตัดสินใจซื้อ Lionhead แต่พอมาถึง Fable: The Journey เกมเปลี่ยนแปลงไปจากซีรีส์ Fable ภาคหลักอย่างมาก</p>\n<p>ส่วน Sarah Bond ซึ่งปัจจุบันยังเป็นผู้บริหารด้านเกมของ Xbox ก็บอกว่าเคยมานั่งคุยกันถึงปัญหาของ Lionhead และเรียนรู้ที่จะไม่ทำผิดพลาดอีก ในขณะที่ Phil Spencer หัวหน้าทีม Xbox ในปัจจุบัน เล่าบทเรียนว่าการซื้อสตูดิโอมา ต้องช่วยให้พวกเขาทำในสิ่งที่ดีอยู่แล้วให้ดีขึ้น ไม่ใช่ให้พวกเขามาทำในสิ่งที่พวกเราต้องการ</p>\n<p>ที่มา - <a href=\"https://www.ign.com/articles/microsoft-xbox-lionhead-studios-mistake?utm_source=facebook\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/fable\">Fable</a></div><div><a href=\"/topics/xbox\">Xbox</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/kinect\">Kinect</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8ae9957f567d7333a02e385cb2e21c82cd495dab4dae3a6e2411e47095ab4ecc","category":"Thai"}