{"title":"Israel Start-Up Nation picks up Giacomo Nizzolo for 2022","link":"https://cyclingtips.com/2021/10/israel-start-up-nation-picks-up-giacomo-nizzolo-for-2022/","date":1634751546000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/10/GettyImages-1339078716-650x433.jpg\" /></div><h2>Israel Start-Up Nation picks up Giacomo Nizzolo for 2022</h2><p>\n</p><p>Following the news that <a href=\"https://cyclingtips.com/2021/10/qhubeka-nexthash-has-not-yet-applied-for-a-worldtour-license-for-2022/\" target=\"_blank\">Qhubeka NextHash has not yet applied to renew their WorldTeam license</a> for the 2022 season Giacomo Nizzolo, one of the team’s top riders, announced he will ride for Israel Start-Up Nation in 2022 on a two-year deal. The former European Champion joined Qhubeka NextHash when it was Team Dimension Data in 2019.</p>\n\n\n\n<p>“To join this team is something really special for me,” said Nizzolo. “From the outside, it looks like a really nice team with a great group of people working very well together to reach its big goals. I’m really proud to become part of this team. I’m super happy and super motivated and I’m sure we will achieve big goals together.”</p>\n\n\n\n<p>Nizzolo had a particularly strong 2020 season with back to back wins at the Italian National Championships and the European Championships. He won a stage of Paris-Nice and the Santos Tour Down Under in the same year. </p>\n\n\n\n<p>“We are happy to strengthen the team with such a strong rider as Giacomo,” said ISN general manager Kjell Carlström. “This is a natural fit for us. We have been working hard on establishing a strong lead-out train over the last couple of years, which really came to the fore during the 2021 season with several good results. Adding Giacomo to the equation gives us even more opportunities in the sprints next year.”</p>\n\n\n\n<p>ISN is down one sprinter after the retirement of André Greipel at the end of the 2021 season. </p>\n\n\n\n<p>Nizzolo is another in the long list of talent leaving Qhubeka NextHash behind. Michael Gogl recently announced his move to Alpecin-Fenix while Victor Campenaerts will return to Lotto Soudal in 2022. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/10/israel-start-up-nation-picks-up-giacomo-nizzolo-for-2022/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8af6bbad7b5a7e3c0850cbcead74ac96c6712df17b051e4918dd65cdaa4011f3","category":"Cycling"}