{"title":"Boundary 0.15 adds new storage policies and desktop/CLI features","link":"https://www.hashicorp.com/blog/boundary-0-15-adds-new-storage-policies-and-desktop-cli-features","date":1707154200000,"content":"<p>We are pleased to announce the release of HashiCorp Boundary 0.15, which adds session recording storage policies (<a href=\"https://www.hashicorp.com/products/boundary/pricing\">HCP Plus/Enterprise</a>) and desktop/CLI client improvements like search and filtering. Boundary is a modern privileged access management (PAM) solution that was designed for and thrives in dynamic environments. Boundary streamlines end user access to infrastructure resources without exposing credentials or internal network topologies. </p>\n\n<p>Recent initiatives were aimed to improve governance and useability. As a result, previous releases included features like SSH session recording and an embedded terminal in the desktop client. We continue this effort in our latest 0.15 release and are excited for users to try it out themselves.</p>\n\n<h2>Session recording storage policies (HCP Plus/Enterprise)</h2>\n\n<p>Introduced in <a href=\"https://www.hashicorp.com/blog/boundary-0-13-introduces-ssh-session-recording-boundary-enterprise-and-more\">Boundary 0.13</a>, SSH session recording helped organizations meet their compliance objectives by recording detailed end user activities and commands. Those SSH session recordings are then stored in the organization’s designated Amazon S3 buckets. </p>\n\n<p>Boundary 0.15 improves storage governance by allowing administrators to set retention and deletion policies for session recordings. This helps ensure that recordings are available and accessible for the desired retention period, ensuring that teams can meet various regulatory requirements. This feature also helps reduce management and storage costs by automatically deleting recordings at the designated time and date. </p>\n<img src=\"https://www.datocms-assets.com/2885/1706646710-2024-01-29_11-49-16.jpg\" alt=\"New\" /><h2>Improvements to the Boundary Desktop/CLI client</h2>\n\n<p>Boundary 0.15 improvements include search and filtering capabilities, session time indicators, and support for ARM64 architectures.</p>\n\n<h3>Search and filtering</h3>\n\n<p><a href=\"https://www.hashicorp.com/blog/announcing-boundary-desktop-embedded-terminal-ldap-support-and-more\">Recent improvements to the Boundary Desktop client</a> have dramatically simplified the end user experience. However, at a large scale, some end users may be authorized to connect to tens or hundreds of target resources. This makes it difficult to locate a specific target in a long list. Similarly, finding a specific session among tens or hundreds of active sessions can also be challenging. </p>\n\n<p>The desktop and CLI client in Boundary 0.15 includes new search and filter capabilities to help users locate their desired targets and sessions. Users simply search for the full or partial names or IDs of the desired target and can further narrow down the results by filtering out the scopes or session states (active, pending, or terminated). Larger result sets are paginated for improved search performance. We expect this subtle addition to noticeably improve the user experience and reduce the time it takes to locate and connect to a target. </p>\n<img src=\"https://www.datocms-assets.com/2885/1706646717-2024-01-29_11-49-02.jpg\" alt=\"The\" /><h3>Session time indicator</h3>\n\n<p>Our goal with Boundary Desktop is to centralize the experience of connecting to any resource on your network, for any type of user. Upon establishing a session, end users often can’t tell how long their sessions will last. That information has now been added in version 1.8 of the Boundary Desktop client. A time-remaining helper now appears at the top of the session, giving users a sense of how long their session will be valid for. This also paves the way for future features, such as approvals and session renewals.</p>\n\n<h3>Support for ARM64 architectures</h3>\n\n<p>Prior to this release, Boundary did not support Darwin ARM64/Apple silicon builds. Version 1.8 of the Boundary Desktop client, adds support for ARM64 architectures. <a href=\"https://developer.hashicorp.com/boundary/tutorials/oss-getting-started/oss-getting-started-desktop-app\">Download the Boundary Desktop client here. </a></p>\n\n<h3>Minor improvements and bug fixes</h3>\n\n<p>We have also made various minor improvements and addressed bugs uncovered since the latest release. Improvements include grant scopes for roles and new commands for the CLI which simplify and reduce the required sub-commands. For more information, please view the <a href=\"https://github.com/hashicorp/boundary/blob/main/CHANGELOG.md\">changelog</a>.</p>\n\n<h2>Get started with Boundary 0.15</h2>\n\n<p>We are excited for users to try the new governance and usability features available in Boundary 0.15. Administrators can deploy a HashiCorp-managed Boundary cluster using the HashiCorp Cloud Platform (HCP) or a self-managed Boundary cluster using Boundary’s Community or Enterprise versions. Check out these resources to get started:</p>\n\n<ul>\n<li>Sign up for a <a href=\"https://www.hashicorp.com/cloud\">free HCP Boundary account</a>.</li>\n<li>For self-managed versions, download <a href=\"https://developer.hashicorp.com/boundary/downloads\">Boundary 0.15</a>.</li>\n<li>Download the free <a href=\"https://developer.hashicorp.com/boundary/tutorials/oss-getting-started/oss-getting-started-desktop-app\">Boundary Desktop client</a>.</li>\n<li>Watch this <a href=\"https://www.youtube.com/watch?v=Q0iU4gIaBQk&amp;pp=ygUSaGFzaGljb3JwIGJvdW5kYXJ5\">Getting Started with HCP Boundary</a> demo video.</li>\n<li>Get up and running quickly with our <a href=\"https://developer.hashicorp.com/boundary/tutorials/hcp-getting-started\">Get Started with HCP Boundary tutorial</a>.</li>\n<li>Read the documentation for <a href=\"https://developer.hashicorp.com/boundary/docs/configuration/session-recording/configure-storage-policy\">storage policies</a> and <a href=\"https://developer.hashicorp.com/boundary/docs/commands/search\">Boundary CLI search functions</a>.</li>\n<li>To request a Boundary Enterprise trial, <a href=\"https://www.hashicorp.com/contact-sales\">contact HashiCorp sales</a>.</li>\n</ul>\n","author":"Van Phan","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"8b09ec58426b3ad505fe4608dd7765bd9dc10bda0f35b1eeb97f327b40df17b5","category":"Tech"}