{"title":"Substantial urbanization‐driven declines of larval and adult moths in a subtropical environment","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17241?af=R","date":1711350000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/a9a5b708-06bd-4d9d-adb1-c2b4e6882c0c/gcb17241-toc-0001-m.png\" alt=\"Substantial urbanization-driven declines of larval and adult moths in a subtropical environment\" />\n<p>The effects of urbanization on biodiversity is less understood in low-latitude regions. We surveyed moths across an entire year in protected forested sites across an urbanization gradient to test how caterpillar and adult life stages of subtropical moths (Lepidoptera) are impacted by urbanization. We found that urban development decreases caterpillar biomass and adult moth abundance, richness and phylogenetic diversity. We also found that smaller macro-moths are less impacted by urban development than larger macro-moths in subtropical environments, perhaps highlighting the tradeoffs of metabolic costs of urban heat favoring smaller moths over the relative benefits of dispersal for larger moths.</p>\n<br />\n<h2>Abstract</h2>\n<p>Recent work has shown the decline of insect abundance, diversity and biomass, with potential implications for ecosystem services. These declines are especially pronounced in regions with high human activity, and urbanization is emerging as a significant contributing factor. However, the scale of these declines and the traits that determine variation in species-specific responses remain less well understood, especially in subtropical and tropical regions, where insect diversity is high and urban footprints are rapidly expanding. Here, we surveyed moths across an entire year in protected forested sites across an urbanization gradient to test how caterpillar and adult life stages of subtropical moths (Lepidoptera) are impacted by urbanization. Specifically, we assess how urban development affects the total biomass of caterpillars, abundance of adult moths and quantify how richness and phylogenetic diversity of macro-moths are impacted by urban development. Additionally, we explore how life-history traits condition species' responses to urban development. At the community level, we find that urban development decreases caterpillar biomass and adult moth abundance. We also find sharp declines of adult macro-moths in response to urban development across the phylogeny, leading to a decrease in species richness and phylogenetic diversity in more urban sites. Finally, our study found that smaller macro-moths are less impacted by urban development than larger macro-moths in subtropical environments, perhaps highlighting the tradeoffs of metabolic costs of urban heat favoring smaller moths over the relative benefits of dispersal for larger moths. In summary, our research underscores the far-reaching consequences of urbanization on moths and provides compelling evidence that urban forests alone may not be sufficient to safeguard biodiversity in cities.</p>","author":"Michael W. Belitz, \nAsia Sawyer, \nLillian K. Hendrick, \nAkito Y. Kawahara, \nRobert P. Guralnick","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"8b0a25daaa52242d0fa44d2a99b61074fc8e02fdaf81c97ee7f7e33a0edb55a7","category":"Environment"}