{"title":"Five things I learned testing the latest aero road bikes","link":"https://www.bikeradar.com/features/aero-bike-test-notes/","date":1626285654000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/07/MG_9264-225ef77.jpg?quality=45&amp;resize=620,413\" />                                            <p>I’ve recently tested four of the latest aero road bikes from Cannondale, Felt, Vitus and Scott – and beyond assessing the performance of each individual bike, it proved a usual exercise in assessing the state of the current aero road market.</p>\n<p>As we noted back at the start of the year when looking at <a href=\"https://www.bikeradar.com/features/road-bike-trends/\">2021 road bike trends</a>, aero and lightweight road bikes have been converging into all-round road racing bikes recently.</p>\n<p>For aero evangelists like myself, though, this approach can sometimes feel like brands are essentially just caving to pressure from <a href=\"https://www.bikeradar.com/features/pro-bike/2021-worldtour-bikes/\">WorldTour</a> professional riders and watering down their fastest bikes to placate the obsessive desire for all-things lightweight.</p>\n<p>Take the <a href=\"https://www.bikeradar.com/news/2021-specialized-tarmac/\">Specialized Tarmac SL7</a>, for example. Specialized killed off its <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-venge-sram-etap-review/\">Venge aero road bike</a> when it released the Tarmac SL7, yet also showed us a graph on which the Venge beats it in terms of aerodynamic performance. It also labelled that axis with… ‘Faster –––&gt;’. Is Specialized saying it intentionally made a slower bike?</p>\n<p>Aero road bikes really came to prominence at the start of the last decade, with bikes such as the <a href=\"https://www.bikeradar.com/news/specialized-mclaren-venge-aero-road-bike-launched/\">original McLaren Venge</a>, which evolved into the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-venge-vias-first-ride-video-review/\">whacky Venge ViAS</a>, as well as the likes of the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cervelo-s5-review/\">Cervélo S5</a> (which followed the Cervélo Soloist, the OG aero bike), the <a href=\"https://www.bikeradar.com/news/ridley-noah-fast-aero-road-bike-launched/\">Ridley Noah Fast with its fork-integrated brakes</a>, and the Trek Madone, which <a href=\"https://www.bikeradar.com/news/new-trek-madone-9-series-gets-radically-aero-for-2016/\">morphed from Trek’s lightweight bike into an aero bike in 2015</a>.</p>\n<p>Those machines took road bike speed to new levels but sometimes came at the cost of comfort and usability, with an increasing amount of proprietary and integrated parts.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Felt-AR-ULTEGRA-DI2-01-9890328.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>I recently tested four of the latest aero bikes, including the Felt AR Ultegra Di2…</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Cannondale-SystemSix-HI-MOD-Red-eTap-AXS-01-fabb338.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>…Cannondale SystemSix Hi-Mod eTap AXS…</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Vitus-ZX-1-EVO-CRS-Ultegra-DI2-01-0907fbd.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>…Vitus ZX-1 EVO CRS Ultegra Di2…</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Scott-Foil-10-01-55eca7d.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>…and Scott Foil 10.</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>Full-blown <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-aero-road-bike/\">aero road bikes</a> may have slightly fallen out of fashion in recent years, but there’s still plenty of development going on, and I recently tested four of that category’s latest and greatest: the Cannondale SystemSix, Felt AR, Vitus ZX-1 and Scott Foil. You can find links to my reviews below.</p>\n<p>Earlier in the year, I also tested the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/merida-reacto-6000-review/\">Merida Reacto 6000</a>, while last year I reviewed the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/canyon-aeroad-cfr-di2-review/\">new Canyon Aeroad CFR</a>.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-systemsix-hi-mod-etap-axs-review/\">Cannondale SystemSix Hi-Mod eTap AXS review</a></li>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/felt-ar-ultegra-di2-review/\">Felt AR Ultegra Di2 review</a></li>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/vitus-zx-1-evo-crs-ultegra-di2-review/\">Vitus ZX-1 EVO CRS Ultegra Di2 review</a></li>\n<li><a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/2021-scott-foil-10-review/\">Scott Foil 10 review</a></li>\n</ul><p>As always with group tests, there are thoughts and findings that don’t fit neatly into any one review. In this instance, there was enough to spin out a whole separate article (and podcast, listen using the player below).</p>\n<p>So, with that in mind, here are five things I noticed when testing the latest aero road bikes.</p>\n\n<h2>1. Aero might seem pointless if you don’t race, but going fast is fun</h2>\n<p>Whether aero is actually worth bothering with remains a point of great contention among road cyclists, and it’s far from a settled debate even within the BikeRadar team. After all, my colleague <a href=\"https://www.bikeradar.com/author/matthewloveridge/\">Matthew Loveridge</a> once wrote an opinion piece titled “<a href=\"https://www.bikeradar.com/features/aero-is-bunk-unless-youre-racing/\">Aero is bunk (unless you’re racing)</a>”.</p>\n<p>And I can see where he was coming from. Back in 2016, when the piece was published, aero bikes did generally come with annoying compromises, but things have generally moved on a lot since then.</p>\n<p><a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">Hydraulic disc brakes</a> have consigned ineffective hidden aero brakes, braking on carbon rims and bikes that are unfathomably difficult to work to the dustbin of bad ideas, for example.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The hidden rim brakes on aero bikes of old may have been fast in the wind tunnel, but they didn’t always slow you down very well.</span></figcaption><span> <i>Colin Levitch / Immediate Media</i></span></div>\n<p>On the other hand, the <a href=\"https://www.bikeradar.com/advice/buyers-guides/buyers-guide-to-road-bike-wheels/\">best aero road bike wheels</a> have progressed to a point where small gusts of wind won’t blow you off the road. And, even most aero bikes now come with clearance for decent sized tyres, with room for at least 28mm tyres as standard.</p>\n<p>One point I’ve never agreed with, though, was Matthew’s assertion that lighter bikes are “always” more fun to ride than heavier ones.</p>\n<p>For me, and I suspect many others too, it’s faster bikes that are more fun.</p>\n<p>What was it about your first bike that really got you excited? Even Sustrans (a charity that aims to make it easier for people to walk and cycle, and has no link to racing) makes the obvious connection: “Children love cycling – it’s fast and fun”.</p>\n<p>The entire point of riding bicycles is to increase the speed at which humans can travel for the same effort.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Going fast is really good fun and aero bikes are all about going fast.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>Aero bikes really lean into this because when it comes to going fast, aerodynamics are what count. If you go all-in on it, the difference actually is tangible too – this was very much the case with the purest aero bikes in this group test, like the Cannondale SystemSix, Felt AR and Vitus ZX-1 Evo CRS.</p>\n<p>If you don’t believe me, I recommend test riding a <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bike</a>.</p>\n<h2>2. If you care about speed, bike weight doesn’t really matter (most of the time)</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Aero vs lightweight – yep, that age-old debate is back.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Sorry <a href=\"https://www.bikeradar.com/features/8-ways-to-make-your-road-bike-lighter/\">weight weenies</a>, but I’m going to flog this dead horse again.</p>\n<p>When it comes to what makes a bike fast or not, bike weight just isn’t that important.</p>\n<p>For a 70kg cyclist, on a flat road, travelling at 30kph, the difference in power required to overcome a difference of 2kg – the difference between a ‘heavy’ 8kg bike and ‘super-light’ UCI-illegal 6kg bike, for example – is less than one watt. Basically, it makes no difference.</p>\n<p>Even on a 10 per cent hill, travelling at a pretty brisk 15kph (a feat that requires our 70kg cyclist to put out around 350 watts), that 2kg will only save you around 9 watts.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> On a flat road, bike weight is essentially meaningless, but the effects on steep climbs aren’t as significant as often assumed either.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>You can use a <a href=\"https://www.gribble.org/cycling/power_v_speed.html\">power vs speed calculator</a> to try the maths out for yourself.</p>\n<p>Nine watts is a decent saving, but it also assumes all else remains equal, which is rarely the case.</p>\n<p>In order to shed that weight, <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-climbing-bikes/\">lightweight bikes</a> almost always compromise on things that tend to make a relatively larger difference to your speed, such as aerodynamics and rolling resistance (tubular wheels and tyres are lighter, but <a href=\"https://www.bicyclerollingresistance.com/road-bike-reviews/compare/continental-competition-2016-vs-continental-grand-prix-4000s-ii-latex-tube-2014-vs-schwalbe-pro-one-tubeless-2016\">they also produce more rolling resistance than equivalent clincher or tubeless setups</a>).</p>\n<p>Even on a mountainous ride (like a recent <a href=\"https://www.bikeradar.com/features/pro-bike/aero-vs-lightweight-mont-ventoux/\">Tour de France stage that included a double ascent of Mont Ventoux</a>), using a lightweight bike might not be a net gain.</p>\n<p>It’s not that weight doesn’t matter at all. If you’re riding up long, steep climbs then improving your <a href=\"https://www.bikeradar.com/advice/fitness-and-training/power-to-weight-ratio/\">power-to-weight ratio</a> will make you faster. It’s just that the importance of the relatively small weight differences between most modern road bikes has been greatly exaggerated.</p>\n<p>So, unless you’re a <a href=\"https://www.bikeradar.com/news/hill-climb-diaries-2020/\">hill climb</a> racer, focusing on bike weight generally means spending a lot of money for little practical gain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Even an all-out aero bike only contributes a relatively small amount of extra weight to the overall rider plus bike system compared to a climbing bike, but the performance benefits can be significant.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>It’s perfectly okay if the weight weenie life is just your jam – I’m not here to tell anyone how to enjoy bikes. Just don’t expect it to make you much faster.</p>\n<p>I know some of you reading this may be thinking “Lightweight bikes feel better, though, and that’s what I care about”, but I’m not convinced by that argument either. In my experience, how a bike feels largely depends on its <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">geometry</a>, how it handles, how <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">good its tyres are</a>, how well it fits you, and so on. Weight is too often a red herring.</p>\n<p>If you want a bike to feel responsive and racy, keep the wheelbase short, pick a head tube angle around 73.5 degrees and don’t put too long a stem on it. Want to kill a snappy carbon race bike? Get yourself some nasty rigid tyres and cheap butyl <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tubes</a>.</p>\n<p>The top-spec Cannondale SystemSix I tested, for example, weighs just under 8kg and looks like a cross between a cargo ship and a transformer. But when you’re riding it, it actually feels very nimble. Don’t judge a book by its cover.</p>\n<h2>3. Deep section wheels are surprisingly easy to live with now</h2>\n<p>As someone who’s relatively lightweight (183cm / 63–64kg), I’m quite susceptible to the wind. <a href=\"https://www.bikeradar.com/advice/skills/technique/how-to-put-the-power-down-like-tom-boonen/\">Tom Boonen</a>, I am not. Think more Romain Bardet (but with a much smaller engine).</p>\n<p>Given this, I was a little concerned that the deep-section wheels each test bike came with (from Syncros, Reynolds and Cannondale) would make the bikes a bit of a handful on gusty days. Fortunately, it simply wasn’t an issue.</p>\n<p>Even with rim depths averaging around 58mm, there weren’t any that made me wish I’d left the aero bike at home when the weather took a turn for the worse.</p>\n<p>A lot of this can be attributed to modern aero wheel designs that use wide, blunt-V or U-shaped rims, and the fact that disc brakes are now the new standard across road bikes.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 60mm deep rims are now fairly easy to live with for day to day riding, even for lightweight riders like myself.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The first of those two points means that handling in windy conditions has been vastly improved. Wide rims, with curved sidewalls and more blunted edges help control the airflow off the tyre better because the yaw angle (the relative angle at which the wind hits you while riding) increases.</p>\n<p>Not only does this make these wheels faster at high yaw angles, it also means that, when crosswinds get particularly severe, the side force you experience on the front wheel (i.e. the wind pushing you off course) is reduced.</p>\n<p>It was a close-run thing because all of the wheelsets impressed, but the 64mm deep Cannondale HollowGram 64 SL KNØT wheels were pretty special. Having the deepest rims on test, this wheelset brings buckets of speed, but it nevertheless felt like a wheelset I could comfortably use in all conditions.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Cannondale’s HollowGram 64 SL KNØT wheelset has understated looks but impressed me hugely.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>Disc brakes are more controversial (because <a href=\"https://www.bikeradar.com/features/opinion/disc-brakes-default-no-one-cares/\">this subject always is</a>), but, in my experience, the difference in wet weather braking performance between hydraulic disc brakes and rim brakes on carbon wheels is night and day.</p>\n<p>I was helpfully reminded of this during a recent mid-week time trial. It was a cold, wet and windy spring evening, and while I didn’t have any issues handling the <a href=\"https://www.bikeradar.com/features/first-look-friday/prime-343-carbon-rear-disc-wheel/\">85mm deep front wheel and solid rear disc</a> I was using, the relatively poor braking performance meant I had to sit up to brake for corners very early. It simply wasn’t confidence-inspiring, and I think I lost a fair amount of time because of it.</p>\n<p>Knowing you have reliable braking regardless of the weather makes a huge difference to your confidence on the bike, and means you can use your fastest wheels day in day out.</p>\n<p>If you’re a <a href=\"https://forum.bikeradar.com/discussion/13109327/this-anti-disc-zealot-wants-to-save-the-rim-brake-%F0%9F%A4%B7%E2%80%8D-%EF%B8%8F\">#savetherimbrake</a> zealot, then <a href=\"https://www.bikeradar.com/reviews/components/wheels/wheel-sets/hed-jet-6-black-review/\">HED’s Jet wheels</a> are a great option. The benefits of braking on an alloy rim far outweigh the small weight penalty.</p>\n<h2>4. Integration can be done well but too often comes with frustrating compromises</h2>\n<p>Given the gist of this article so far, and my penchant for speed and efficiency, you might be surprised to learn that I’m not totally convinced by the current trend for full integration at the front end of aero road bikes.</p>\n<p>Some brands do it well and avoid creating frustrating knock-on effects, but too many don’t. And when it comes to front-end aerodynamics and adjustability, I want it all.</p>\n<p>The front end of an aero road bike should be slickly integrated and aerodynamic, widely adjustable and easy to service. I also want the option of dispensing with the stock cockpit for aftermarket options.</p>\n<p>If that’s too much to ask, I’d much rather have a bike that sacrifices a small amount of aero efficiency for vastly improved adjustability and the ability to use standard parts.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The cockpit on Cannondale’s SystemSix combines clean looks with adjustability and simple servicing.</span></figcaption><span> <i>Felix Smith / Immediate Media</i></span></div>\n<p>The Cannondale SystemSix gets this practically spot on. It has a standard 1 1/8in steerer tube and can be used with or without the semi-integrated handlebar that comes as stock. There really are very few limitations and the cable routing is also extremely simple.</p>\n<p>The Vitus ZX-1 Evo CRS, on the other hand, comes with a one-piece Vision Metron handlebar and stem, with no option to choose a different handlebar width or stem length at the point of purchase. For me, that’s far from ideal – from both a comfort and aerodynamic perspective.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Vitus-ZX-1-EVO-CRS-Ultegra-DI2-02-efa4cea.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Vision’s Metron 5D one-piece cockpit is very aero but lacks adjustability.</span>\n    </figcaption><span>\n                    <i>David Caudery / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Vitus-zx-1-launch-11-908e070.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Cheaper models of the Vitus ZX-1 come with non-integrated handlebars, which, in my opinion, are always worth the small aero penalty.</span>\n    </figcaption><span>\n                    <i>Vitus</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>The problem might be that many brands test their new bikes alone in the wind tunnel without a rider because it makes the data less messy. In those situations, a fully integrated, non-adjustable handlebar is the most slippery option. On an aesthetic level, it looks good, too.</p>\n<p>Looking at the bigger aero picture, though, and understanding that the rider causes the vast majority of the drag in the rider plus bike system (<a href=\"https://link.springer.com/article/10.1007%2Fs12283-017-0234-1\" target=\"_blank\">around 80 per cent, according to recent studies</a>), I’m sceptical as to whether that translates into the real world.</p>\n<p>If you can’t optimise your body position because the stem length or handlebar width are fixed, you’ll almost certainly be slower as a result.</p>\n<h2>5. Aero bike manufacturers should be more progressive with component sizing</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Integrated handlebars look great but being stuck with a 42cm wide handlebar means missing out on some easy aero gains.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p>My last point follows on from the previous one, and if there’s one bit of feedback I’d want to provide to aero road bike manufacturers it would be this: please be more progressive with component sizing.</p>\n<p>While <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">mountain bike geometries</a> and component sizes have seen constant progression in recent years, road bike equivalents have been <a href=\"https://www.renehersecycles.com/handlebars-wide-vs-narrow/\" target=\"_blank\">largely stagnant for decades</a>.</p>\n<p>For example, 42cm is the de facto standard width for road bike handlebars. Why? It just is. As far as I can tell, there doesn’t appear to be much reasoning behind it, other than tradition.</p>\n<p>Most aero bikes have a <a href=\"https://www.bikeradar.com/features/your-top-tube-length-is-irrelevant/\">slightly increased reach and lower stack height</a>, in order to help you get you low and stretched out, but I think many are missing out on low hanging fruit by speccing pointlessly wide handlebars.</p>\n<p>According to <a href=\"https://www.bikeradar.com/author/drxavierdisley/\">Dr Xavier Disley</a> of AeroCoach, narrow handlebars reduce your frontal area, so it’s possible to gain around two watts at 45kph for every 10mm narrower you go. Swapping from a 42cm handlebar to a 36cm handlebar might therefore save you 12 watts when you’re really going for it.</p>\n<p>Given the size 56cm Vitus ZX-1 Evo CRS I tested has a non-adjustable, 42cm handlebar, that’s 12 watts you’re potentially going to have to leave on the table (unless you’re willing to shell out for a different cockpit later down the line).</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> For me, a 36cm handlebar feels perfectly normal.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>Cannondale does at least offer its SystemSix handlebar in a 38cm width, but I’d love them to be bold and go even narrower.</p>\n<p>It’s often said that <a href=\"https://www.bikeradar.com/features/road-bike-handlebars-guide-how-to-choose-the-right-ones/\">road bike handlebar width</a> should match shoulder width. But, as usual with these sorts of things, there doesn’t appear to be much evidence to back it up.</p>\n<p>If it was correct, shouldn’t we all use the same width handlebars across every bike, regardless of application? If my shoulders are 40cm wide, should I be using 40cm handlebars on a mountain bike? I don’t think it adds up.</p>\n<p>For those worried about the effects on handling, my experience with switching from a 42cm to 36cm handlebar is that it doesn’t really make much difference, especially if you’re using a slightly longer stem.</p>\n<p>It feels different for a few minutes, then you get used to it and ride your bike as normal.</p>\n<p>Personally, I find a 36cm handlebar to be both faster and more comfortable than a wider one (I’ve even been testing a handlebar that measures just 25cm between the brake hoods recently). Other people might feel differently, but I haven’t seen any trade-offs in comfort and handling by switching to a narrower handlebar.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> I’ve recently been testing some drop handlebars that measure 33cm on the drops and just 25cm at the brake hoods, and the difference in handling isn’t as marked as you might imagine.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>To give an extreme example, even track sprinters are using handlebars narrower than 30cm these days. I’m not suggesting everyone should attempt to emulate elite riders, and each discipline has its own demands, but that example should help to dispel any myths about bad handling or restricted breathing. Ultimately, it’s about increasing choice.</p>\n<p>So, aero bike manufacturers, why not start small and spec your aero road bikes with handlebars 4 to 6cm narrower across the size range? It’s only a few centimetres off either side, so it shouldn’t feel like a major change for most people, and it might just be an easy way to save some more watts.</p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8b0b13e80ceee31aa3d2483bd359435157aa0a94f8cc7b5098e4ba6dfa2e6459","category":"Cycling"}