{"title":"Unveiling the impact of soil methane sink on atmospheric methane concentrations in 2020","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17381?af=R","date":1719396899000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d22ce18a-f218-404a-b485-0cad4f61842f/gcb17381-toc-0001-m.png\" alt=\"Unveiling the impact of soil methane sink on atmospheric methane concentrations in 2020\" />\n<p>In 2020, despite a decrease in human-induced methane emissions due to COVID-19 measures, atmospheric methane levels surged. Research investigating the soil methane sink using a model found a notable 0.35 ± 0.06 Tg increase globally in 2020 compared to 2019, attributed largely to warmer soil temperatures in northern high latitudes. This highlights the critical role of terrestrial ecosystems in mitigating methane, underscoring the importance of considering soil methane sinks in understanding atmospheric methane dynamics.</p>\n<br />\n<h2>Abstract</h2>\n<p>In 2020, anthropogenic methane (CH<sub>4</sub>) emissions decreased due to COVID-19 containment policies, but there was a substantial increase in the concentration of atmospheric CH<sub>4</sub>. Previous research suggested that this abnormal increase was linked to higher wetland CH<sub>4</sub> emissions and a decrease in the atmospheric CH<sub>4</sub> sink. However, the impact of changes in the soil CH<sub>4</sub> sink remained unknown. To address this, we utilized a process-based model to quantify alterations in the soil CH<sub>4</sub> sink of terrestrial ecosystems between 2019 and 2020. By implementing the model with various datasets, we consistently observed an increase in the global soil CH<sub>4</sub> sink, reaching up to 0.35 ± 0.06 Tg in 2020 compared to 2019. This increase was primarily attributed to warmer soil temperatures in northern high latitudes. Our results emphasize the importance of considering the CH<sub>4</sub> sink in terrestrial ecosystems, as neglecting this component can lead to an underestimation of both emission increases and reductions in atmospheric CH<sub>4</sub> sink capacity. Furthermore, these findings highlight the potential role of increased soil warmth in terrestrial ecosystems in slowing the growth of CH<sub>4</sub> concentrations in the atmosphere.</p>","author":"Xiaoqi Zhou, \nWensheng Xiao, \nLi Cheng, \nSimeon J. Smaill, \nShushi Peng","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"8b0f9853abfc7c6ead64f4bfac761d124d471973f7754190bd356c4a232a1a17","category":"Environment"}