{"title":"Mimas: Frozen Fragment, Ring Relic, or Emerging Ocean World?","link":"https://new.annurev.org/content/journals/10.1146/annurev-earth-031621-061221?TRACK=RSS","date":1685491200000,"content":"<div><p>Mimas, the smallest and innermost of Saturn's mid-sized moons, has a heavily cratered surface devoid of the intricate fracture systems of its neighbor, Enceladus. However, Cassini measurements identified a signature of an ocean under Mimas’ ice shell, although a frozen ice shell over a rocky interior could not be ruled out. The Mimas ocean hypothesis has stimulated inquiry into Mimas’ geologic history and orbital evolution. Here, we summarize the results of these investigations, which (perhaps surprisingly) are consistent with an ocean-bearing Mimas as long as it is geologically young. In that case, a ring origin for Mimas is favored over primordial accretion. An independently developed model for the formation of a gap in Saturn's rings provides a potential mechanism for generating a late-stage ocean within Mimas and may have assisted in the development of Enceladus’ ocean and associated geologic activity. Rather than a battered relic, Mimas may be the youngest ocean moon in the Saturn system, destined to join Enceladus as an active world in the future. The presence of oceans within Saturn's mid-sized moons also has implications for the habitability of Uranus’ moons; the Uranus system was chosen as the highest priority target for the next NASA Flagship-class mission.</p>\n<ul>\n<li><span>▪ \n</span>Models of Mimas’ tides and rotation state support a present-day internal ocean.\n</li>\n<li><span>▪ \n</span>Mimas’ craters, impact basin, and lack of widespread tectonism are compatible with a stable/warming ocean.\n</li>\n<li><span>▪ \n</span>The formation of the Cassini Division within Saturn's rings provides a potential pathway to a present-day ocean within Mimas.\n</li>\n<li><span>▪ \n</span>If Mimas has an ocean today, it is geologically young.\n</li>\n</ul></div>","author":"Alyssa Rose Rhoden","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"8b107488e8441e1530533c6357a17147dad84e40c9e07d34b8e75a0ac293770c","category":"Environment"}