{"title":"Regulation of the transcription factor CdnL promotes adaptation to nutrient stress in Caulobacter","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae154/7643124?rss=1","date":1712707200000,"content":"<span><div>Abstract</div>In response to nutrient deprivation, bacteria activate a conserved stress response pathway called the stringent response (SR). During SR activation in <span>Caulobacter crescentus</span>, SpoT synthesizes the secondary messengers guanosine 5′-diphosphate 3′-diphosphate and guanosine 5′-triphosphate 3′-diphosphate (collectively known as (p)ppGpp), which affect transcription by binding RNA polymerase (RNAP) to down-regulate anabolic genes. (p)ppGpp also impacts the expression of anabolic genes by controlling the levels and activities of their transcriptional regulators. In <span>Caulobacter</span>, a major regulator of anabolic genes is the transcription factor CdnL. If and how CdnL is controlled during the SR and why that might be functionally important are unclear. In this study, we show that CdnL is down-regulated posttranslationally during starvation in a manner dependent on SpoT and the ClpXP protease. Artificial stabilization of CdnL during starvation causes misregulation of ribosomal and metabolic genes. Functionally, we demonstrate that the combined action of SR transcriptional regulators and CdnL clearance allows for rapid adaptation to nutrient repletion. Moreover, cells that are unable to clear CdnL during starvation are outcompeted by wild-type cells when subjected to nutrient fluctuations. We hypothesize that clearance of CdnL during the SR, in conjunction with direct binding of (p)ppGpp and DksA to RNAP, is critical for altering the transcriptome in order to permit cell survival during nutrient stress.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"8b1fb14eaa617dfe69513a86b22e3b9ffa56914d4391ddb863adce54fc3dd2e6","category":"Interdisciplinary"}