{"title":"Influence of flooding variability on the development of an Amazonian peatland","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3587?af=R","date":1707372847000,"content":"<h2>ABSTRACT</h2>\n<p>Peat in the Pastaza–Marañón Foreland Basin (PMFB), northern Peru, forms beneath open wetlands, palm swamps, pole forests and seasonally flooded forests. These vegetation communities may represent different successional stages of peatlands, but the spatiotemporal patterns of peatland development in Amazonia are still poorly understood. We present a new geochemical and palaeoecological record spanning the last c. 4330 years from an open peatland (San Roque, core SAR_T3_03_B). Our results suggest the persistence of predominantly herbaceous vegetation communities at the core site since the start of peat accumulation (c. 3180 cal a <span>bp</span>). Micro-X-ray fluorescence core scanning provides evidence for episodes of fluvially derived minerogenic input and simultaneous increases in flood-tolerant taxa relating to intervals of increased frequency and depth of riverine flooding. The establishment of <i>Mauritia flexuosa</i> palms from around 440 cal a <span>bp</span> coincided with a shift to lower flooding depth and frequency which continues to the present day. This study reveals the role of flooding variability in shaping peatland development and influencing vegetation succession in the PMFB, underlining the need to understand natural environmental variability for the conservation of these ecosystems due to their vital contributions to ecosystem services and carbon storage.</p>","author":"D. Sassoon, \nW. J. Fletcher, \nK. H. Roucoux, \nP. Ryan, \nI. T. Lawson, \nE. N. Honorio Coronado, \nJ. Del Aguila Pasquel, \nT. Bishop, \nC. M. Åkesson, \nA. Hastie","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"8b21c8a179074f7db8a2cf0ba14dbf5b864eb26c6a7c2bdfad8474d3b2ca4454","category":"Environment"}