{"title":"Effect of neutering timing in relation to puberty on health in the female dog–a scoping review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311779","date":1728914400000,"content":"<p>by Rachel Moxon, Gary C. W. England, Richard Payne, Sandra A. Corr, Sarah L. Freeman</p>\r\nBackground <p>Effects of neutering on bitch health have been reported, and are suggested to relate to bitch age at the time of neutering for some diseases. However, variation between published studies in terms of study populations and methodologies makes comparison and consolidation of the evidence difficult.</p> Objective <p>A scoping review was designed to systematically search the available literature to identify and chart the evidence on the effect of neutering timing in relation to puberty on five health outcomes: atopy, developmental orthopaedic disease (DOD), neoplasia, obesity and urogenital disease.</p> Design <p>A protocol was registered, and literature searches were conducted in CAB Abstracts, Medline and Web of Science. Studies were reviewed against inclusion criteria. Data on study and population characteristics and health outcomes were charted for the final included studies.</p> Results <p>A total of 1,145 publications were reviewed across all five searches; 33 were retained for inclusion and charting. Only six of the 33 studies categorised the timing of surgical neutering as prepubertal or post-pubertal; one investigating mammary neoplasia and the other five, urogenital disease, commonly urinary incontinence. No studies were identified that examined the impacts of neutering bitches before or after puberty on atopy, DOD or obesity. One study considered bitches that were pre or post-pubertal at the time of the first treatment with deslorelin acetate for oestrus suppression and 26 examined the effects on health related to age, rather than pubertal status, at neutering.</p> Conclusion <p>This scoping review suggests that robust evidence to support veterinarians, those working with dogs and dog owners when discussing the timing of neutering relative to puberty does not yet exist. The impact of neutering <i>before or after puberty</i> on atopy, DOD, neoplasia, obesity and urogenital disease in female domesticated dogs remains unclear.</p>","author":"Rachel Moxon","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8b2f63631028084dce71ca6fc1fa2e50e13861c05bf7fd8e1dd2e03fe9f5aa91","category":"Interdisciplinary"}