{"title":"Productivity and Elemental/Chlorophyll Composition of Collard Greens in an Aquaponic System at Different Combinations of Media and Black Soldier Fly (Hermetia illucens) Larvae Frass Supplementations","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/3308537?af=R","date":1675411200000,"content":"<p>Black soldier fly (<i>Hermetia illucens</i>) larvae (BSFL) production will likely increase to meet the growing demand for sustainable protein and lipids. A by-product is “frass,” which is a mixture of mostly larval excrement but also chitin. This mineral-richby-product could be a valuable aquaponic supplement, but the information is limited. The aim of this study was twofold to determine if BSFL frass additions could enhance the production, mineral composition, and chlorophyll content of collard greens (<i>Brassica oleracea</i> var. <i>viridis</i>) after 10 weeks as well as the influence of culturing collard greens with or without media. Each aquaponic system contained 20 channel catfish (<i>Ictalurus punctatus</i>; initial mean weight of 128 g) that were fed twice daily to apparent satiation. Results showed that dissolved nitrogen, pH, and dissolved oxygen were unaffected (<i>p</i> &gt; 0.05) by BSFL frass additions. There was a significant media and BSFL frass effect (<i>p</i> &lt; 0.05) on total weight, individual weight, and total height of collard greens where the media/frass treatment led to a ninefold increase in weight compared to the no media/no frass treatment. Moreover, both media and BSFL frass significantly increased (<i>p</i> &lt; 0.05) the total chlorophyll content while extensive chlorosis was observed in the no media/no frass group. Manganese in collard greens was significantly increased (<i>p</i> &lt; 0.05) by BSFL frass. The best combination for collard green growth and preventing any chlorosis was the media/frass treatment, which may be due to an increase in various nutrients that were more accessible by biomineralization in the media.</p>","author":"Nicholas Romano, \nShahidul Islam, \nCarlos Rosas","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"8b2ffd2f5afb6901d4c769fe7d60f198050a95fe7e170ad3aaa49306645b894c","category":"Environment"}