{"title":"Windows 11 hits the Release Preview Insider channel as official release nears","link":"https://arstechnica.com/?p=1798186","date":1632499519000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/win11-rc-800x500.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/win11-rc.png\">Enlarge</a> <span>/</span> The \"official\" Windows 11 update, complete with the UI that regular people will see, is now available in the Release Preview channel for Windows Insiders. (credit: Andrew Cunningham)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Yesterday, Microsoft released <a href=\"https://blogs.windows.com/windows-insider/2021/09/16/announcing-windows-11-insider-preview-build-22000-194/\">a near-final build of Windows 11</a> to Windows Insiders in the Release Preview channel, which (as the name implies) is generally the last stop for a major new Windows version ahead of its release to the general public. The official release date for Windows 11 is October 5, but Microsoft is planning to <a href=\"https://arstechnica.com/gadgets/2021/08/windows-11s-months-long-public-rollout-begins-on-october-5/\">roll it out gradually over the next few months</a> to prevent widespread problems.</p>\n<p>The build number in the Release Preview channel is 22000.194, the same version released to the Beta channel <a href=\"https://blogs.windows.com/windows-insider/2021/09/16/announcing-windows-11-insider-preview-build-22000-194/\">on September 16</a>.</p>\n<p>While Beta- and Dev-channel builds of Windows 11 are simply downloaded and installed like regular Windows Updates, the version in the Release Preview channel gives you the same upgrade message that will be offered to the public when Microsoft offers the Windows 11 upgrade for their PCs. This includes a system notification that users can click through to learn more about Windows 11's new features and a special update message in Windows Update that will give you the opportunity to waive the Windows 11 upgrade and stay on Windows 10 (seen above).</p></div><p><a href=\"https://arstechnica.com/?p=1798186#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1798186&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8b38f460c282cd865c5f84420f469907b58137e5def4325cedf25254c89c466c","category":"Tech"}