{"title":"PSA: Watch Out for Fake ChatGPT Apps and Other Scams in the Mac App Store","link":"https://www.macrumors.com/2023/04/25/chatgpt-scam-apps-mac-app-store/","date":1682460272000,"content":"There have long been complaints from developers and <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> users about apps that offer limited functionality and charge high prices in an effort to scam people out of their money, and the latest trend is a glut of ChatGPT apps that have invaded the ‌App Store‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/05/Mac-App-Store-General-Feature.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\n<a href=\"https://privacyis1st.medium.com/the-dark-side-of-the-mac-app-store-how-scam-apps-and-shady-developers-are-preying-on-users-b28062642e6\">Privacy 1st researcher Alex Kleber</a> over the weekend did a deep dive into the <a href=\"https://www.macrumors.com/guide/mac-app-store/\">Mac App Store</a> after noticing an alarming number of ChatGPT apps from the same handful of developers, and <a href=\"https://privacyis1st.medium.com/the-dark-side-of-the-mac-app-store-how-scam-apps-and-shady-developers-are-preying-on-users-b28062642e6\">he shared his findings on Medium</a>. As Kleber explains, dozens of copycat OpenAI/ChatGPT apps have popped up on the ‌Mac App Store‌, with \"shady\" developers \"flooding\" the ‌Mac App Store‌ with apps that are nearly identical to confuse consumers and shut out other developers.\r<br />\n\r<br />\nSearching for OpenAI or ChatGPT on the ‌Mac App Store‌ brings up a long list of apps that are offer much of the same functionality, and as Kleber discovered, there are some developers who are gaming the ‌Mac App Store‌ with keywords, misleading marketing tactics, fake reviews, stolen OpenAI logos, and multiples of the same app.\r<br />\n<blockquote>It's not uncommon to come across several apps with identical or similar names and logos copies of OpenAI icons and colors, claiming to offer advanced AI-powered chatbots or language models. However, most of these apps are nothing but cheap imitations or outright scams that fail to deliver on their promises. These scams not only deceive users but also tarnish the reputation of legitimate developers and hinder the growth of the app ecosystem on the MacOS platform.</blockquote>\r<br />\nTwo of the app developers, Pixelsbay and ParallelWorld, for example, share the same parent company in Pakistan and the apps have 99 percent of the same code. They have the same interface and the same paywall, and there is no way to exit out of the paywall popup, something that can be confusing for app users not accustomed to exiting out of an app and restarting it.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/chatbot-scam-1.jpg\" alt width=\"1743\" height=\"1001\" />\r<br />\nAll of these ChatGPT apps are charging comparatively high prices by taking advantage of the popularity of chatbots, garnering the developers of the apps a good amount of money.\r<br />\n\r<br />\nOn the web, ChatGPT is free to use. OpenAI offers a \"Plus\" program with faster response speeds and priority access to new features for $20 a month. Microsoft's Bing chatbot, based on OpenAI, is free to use, and Google Bard, Google's version of a chatbot, is also free. Most if not all of the sketchily-named and relatively new \"ChatGPT\" apps in the iOS and macOS App Stores are scammy apps that you should not pay for, and many of them don't even offer the functionality that they promise. Most of these apps have weekly subscription fees, which is a red flag.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/chatbot-scam-2.jpg\" alt width=\"1727\" height=\"1000\" />\r<br />\nThere are some exceptions because legitimate apps have integrated ChatGPT features, but most apps built around ChatGPT are taking advantage of ‌App Store‌ users that don't know better.\r<br />\n\r<br />\nKleber is calling on Apple to take a stricter stance against scam apps like these to prevent users from losing money to unscrupulous developers. His full Medium post has a more in-depth look at which apps to look out for and the lengths the developers are going to in order to trick ‌Mac App Store‌ users.<div>Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/25/chatgpt-scam-apps-mac-app-store/\">PSA: Watch Out for Fake ChatGPT Apps and Other Scams in the Mac App Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/psa-watch-out-for-fake-chatgpt-apps-and-other-scams-in-the-mac-app-store.2387808/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8b385cbdc99d13bd518838d092684475c03352ca53c81afa378a7ec9a70fc9fd","category":"Apple"}