{"title":"New theory re-ignites debate about identity of Leonardo da Vinci’s mother","link":"https://arstechnica.com/?p=1924177","date":1678914866000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/leonardo-800x553.jpg\" alt=\"Presumed self-portrait of Leonardo (c. 1510) at the Royal Library of Turin, Italy\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/leonardo.jpg\">Enlarge</a> <span>/</span> Presumed self-portrait of Leonardo da Vinci (c. 1510) at the Royal Library of Turin, Italy. (credit: Public domain)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Could Leonardo da Vinci's mother, Caterina, have been a slave kidnapped from the mountainous Caucasus region of Central Asia? That's the latest hypothesis re-igniting a long-running debate about the identity of this mysterious woman largely lost to history. Historian <a href=\"https://en.wikipedia.org/wiki/Carlo_Vecce\">Carlo Vecce</a> of the University of Naples <a href=\"https://www.nytimes.com/2023/03/14/world/europe/leonardo-da-vinci-mother-book.html\">told reporters</a> at a Tuesday press conference that he discovered a previously unknown document supporting the claim. He's also written a historical novel about Caterina's life (<a href=\"https://www.amazon.it/dp/B0BXLL4SKF\"><em>Il Sorriso di Caterina</em></a> or <em>Caterina's Smile</em>) based on his research.</p>\n<p>It's well-established that Leonardo <a href=\"https://en.wikipedia.org/wiki/Leonardo_da_Vinci\">was born</a> in 1452, the illegitimate son of a Florentine notary named Ser Piero d’Antonio and a woman named Caterina. Ser Piero went on to marry a woman named Albiera Amadori, followed by three subsequent marriages after her 1464 death. His various unions produced 16 children (11 of whom survived their early years), in addition to Leonardo, who grew up in his father’s household and received a solid education.</p>\n<p>As for Caterina, many historians have identified her as a local peasant girl and eventual wife of a kiln worker named Antonio di Piero del Vacca (nicknamed \"L'Accattabriga\" or \"the quarrelsome one\"). But that's all we know of her. So naturally, over the years, various alternative identifications have been suggested. Perhaps the most controversial, proposed in 2014 by Italian historian Angelo Paratico, is that Caterina had been a Chinese domestic slave imported from Crimea by Venetian traders and sold to a Florentine banker.</p></div><p><a href=\"https://arstechnica.com/?p=1924177#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1924177&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8b3e05bac9ee18006076d696e0f9d493a47351be8ed8173d3593acc9cb5ae639","category":"Tech"}