{"title":"Quantifying LULC changes in Urmia Lake Basin using machine learning techniques, intensity analysis and a combined method of cellular automata (CA) and artificial neural networks (ANN) (CA-ANN)","link":"http://link.springer.com/10.1007/s40808-023-01895-z","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>The land use and land cover (LULC) classification accuracy of six machine learning models were compared in Urmia Lake Basin using Landsat images. The overall accuracy confirms that the random forest (RF) (0.957), regularized random forest (RRF) (0.957), the combined method of genetic algorithm and random forest (GA-RF) (0.959) and the combined method of simulated annealing and random forest (SA-RF) (0.957) perform slightly better than the support vector machine (SVM) (0.946) and conditional inference random forest (CIRF) (0.947) though this difference was negligible. The worst classifier was the CIRF with only 43.8% of the grassland pixels correctly assigned to the respective class whereas the GA-RF, SA-RF and RRF performed significantly better with 60.4% of correct classification. Except for the grassland class, the performance of the GA-RF and the SA-RF for the rest of LULC classes were similar (greater than 90%). The magnitude and extent of LULC change was examined using intensity analysis including the interval, category, and transition levels of change. The maximum intensity was from 2006 to 2013, with an annual change in area of 5% which is attributed to the building of the Shahrchay Dam in 2006. The LULC predicted using the combined method of cellular automata (CA) and artificial neural networks (ANN) model (CA-ANN) indicated the soil and rangeland classes are estimated to experience the largest decrease (-5.48%) and increase (7.21%) by year 2035.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"8b4956cae2a7605bfef0b50ccfd4b7ab07d776fb5d7f11459ad491cf383e6aa5","category":"Environment"}