{"title":"Apple scoops up ex-Google AI leader to help fix Siri","link":"https://www.macworld.com/article/345303/apple-scoops-up-ex-google-ai-leader-to-help-fix-siri.html","date":1620140357000,"content":"\n<div>\n<section><div></div></section><p>If you’ve been looking for some sign that Apple is serious about Siri, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reuters.com/business/media-telecom/google-ai-scientist-bengio-resigns-after-colleagues-firings-bloomberg-2021-04-06/&amp;xcust=1-1-345303-0-0-0&amp;sref=https://www.macworld.com/feed\">a new Reuters report</a> should pique your interest. The publication reports that Apple has hired former Google AI research scientist Samy Bengio after he recently left the company after 14 years.</p>\n\n\n\n<p>Bengio will reportedly lead a new AI research unit with another Google defector, John Giannandrea, who <a href=\"https://www.macworld.com/article/231202/apple-siri-google-ai-hire.html\">took on the role of senior vice president of machine learning and AI strategy at Apple</a> in 2018. Together they will be tasked with shaping Siri into a Google Assistant competitor.</p>\n\n\n\n<p>Bengio left Google last month after two of his colleagues were fired for questioning “paper review and diversity practices.” According to media reports, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bbc.com/news/technology-56135817&amp;xcust=1-1-345303-0-0-0&amp;sref=https://www.macworld.com/feed\">Google fired researcher Margaret Mitchell</a> in February after “alleging she transferred electronic files out of the company” and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bbc.com/news/technology-55187611&amp;xcust=1-1-345303-0-0-0&amp;sref=https://www.macworld.com/feed\">researcher Timnit Gebru</a> after she refused to retract a paper on the risks and biases of large language models. Bengio expressed support for both co-workers before announcing he was leaving Google for “other exciting opportunities.”</p>\n\n\n\n<p>Bengio faces a difficult task in raising Siri’s profile while adhering to Apple’s strict privacy guidelines. Siri has struggled to keep up with Google Assistant and Amazon Alexa in the assistant wars, but this new hire proves that Apple is working to bring Siri up to par with its competitors. </p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8b49ea0b5af9e500e6f5f1ee61fece82d8c0b7614ed782fb796d7b9f23ee745a","category":"Apple"}