{"title":"Sustaining indigenous <i>Maasai Alalili</i> silvo-pastoral conservation systems for improved community livelihood and biodiversity conservation in East African rangelands","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303649","date":1715868000000,"content":"<p>by Elkana Hezron, Issakwisa B. Ngondya, Linus K. Munishi</p>\r\n\r\n<i>Alalili</i> system is one among the fewest remnant African indigenous and local knowledge systems that is traditionally practiced by <i>Maasai</i> pastoral communities to conserve certain portions of rangeland resources such as pastures and water for subsequent grazing during dry seasons. Despite its existence, East African rangelands face diverse threats from tenure security, unsustainable practices, climate, and land-use change that are notably endangering the biodiversity, livelihoods, and ecosystems in the landscape. Like other indigenous conservation systems, the sustainability of <i>Alalili</i> systems is being threatened, as <i>Maasai</i> communities are in transition due to continuous socio-cultural transformations coupled with increased livestock and human populations. We aimed to capture and document the existing occurrence and potential of <i>Alalili</i> systems as a pathway to improve resilience and sustain both biodiversity conservation and community livelihoods in rangeland areas of northern Tanzania. A cross-sectional research design was applied with the adoption of both purposive and stratified random sampling techniques to distinctively characterize the <i>Alalili</i> systems by land use and tenure types. Our results identified the existence of both communal and private <i>Alalili</i> systems. Their sizes varied significantly across types (t = 4.4646, <i>p &lt; 0</i>.<i>001</i>) and land uses (F = 3.806, df = 3, <i>p</i> = <i>0</i>.<i>0123</i>). While many (82%) of these <i>Alalili</i> systems are found in the communal land, our observations show a re-practice of <i>Alalili</i> systems in the private land is considered largely a re-emerging strategy for securing pastures in the face of local and global change. More than half (73%) of <i>Alalili</i> systems were found within game-controlled areas with little representation (about 8%) in non-protected land. Therefore, their sustainability is threatened by anthropogenic and climatic pressures, making their persistence more vulnerable to extinction. We recommend mainstreaming these practices into core pasture production and management areas, facilitating their reinforcement into policy and practices.","author":"Elkana Hezron","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8b4b250b7360bf577090b791b901d0369ee00f725e7e98174227ee71e0c72563","category":"Interdisciplinary"}