{"title":"Antioxidant, anti-inflammatory, and anti-DNA damage effects of carnosic acid against aflatoxin B1-induced hepatic, renal, and cardiac toxicities in rats","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae083/7685884?rss=1","date":1717113600000,"content":"<span><div>Abstract</div><div>Background</div>Aflatoxin B1 (AFB1) food contamination is a global health hazard that has detrimental effects on both human and animal health. The objective of the current study is to assess the protective impact of carnosic acid against AFB1-induced toxicities in the liver, kidneys, and heart.<div>Methods</div>Forty male Wistar Albino rats (weighting 180 ~ 200 g) were allocated into 5 groups (8 rats each); the 1<sup>st</sup> group received saline as served as a control, the 2<sup>nd</sup> group received carnosic acid (CA100) at a dose of 100 mg/kg bw/day by gavage for 14 days, the 3<sup>rd</sup> group received AFB1 at a dose of 2.5 mg/kg bw, orally twice on days 12 and 14, the 4<sup>th</sup> group (AFB1-CA50) received AFB1 as in the 3<sup>rd</sup> group and CA at a dose of 50 mg/kg bw/day, and the 5<sup>th</sup> group (AFB1-CA100) received AFB1 as in the 3<sup>rd</sup> group and CA as in the 2<sup>nd</sup> group.<div>Results</div>CA significantly decreased the liver enzymes (ALT, AST. ALP), renal function products (LDH, BUN, creatinine), and cardiac enzymes (CK and CK-MB) to control levels after the high increment by AFB1 exposure. Moreover, CA significantly decreased the oxidative stress (MDA, NO, 8-OHdG) and increased the antioxidant enzyme activities (CAT, GSH, GSH-Px, and SOD) after severe disruption of oxidant/antioxidant balance by AFB1 exposure. Interestingly, CA significantly decreased the proinflammatory mediators (IL-6, IL-1β, and TNF-α) to the control levels after severe inflammation induced by AFB1 exposure.<div>Conclusions</div>Conclusively, CA had antioxidant, anti-inflammatory, and anti-DNA damage effects against hepatic, renal, and cardiac AFB1-induced toxicities.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"8b4c9f4ac73c226eea2a75836767d0e3673af104026d8c3354cb2d102ccd01fb","category":"Environment"}