{"title":"Sociodemographic Determinants of Malnutrition in Rural and Urban Areas of Abia State, Nigeria: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202410.0642/v1","date":1728469218000,"content":"Malnutrition in children aged 0-5 years is a significant public health concern in many societies, and is influenced by various sociodemographic factors which when understood may improve intervention planning and results. Background. This study aimed to identify the sociodemographic determinants of malnutrition in rural and urban areas of Abia State, Nigeria. Methods. A cross-sectional observational study involving 842 children (aged 6-59 months) and their caregivers was conducted across selected rural and urban areas in Abia State area of Nigeria. Data collected through semi-structured questionnaires focused on sociodemographic information as well as anthropometric measurements such as weight, height, and mid-upper arm circumference (MUAC). The dietary diversity scores (DDS) were also calculated for each child using a questionnaire that recorded the consumption of various food groups over a 7-day period. Chi-Square tests was adopted for categorical variables, while binomial logistic regression was used to identify determinants of malnutrition and weight classification. Results. Marked sociodemographic differences were found between rural and urban caregivers, with urban caregivers being more likely to have higher knowledge of nutrition (p &amp;lt; 0.01) and education (p &amp;lt; 0.01). Malnutrition, indicated by global acute malnutrition (GAM), was significantly higher in rural areas (53.5%) compared to urban areas (46.5%) (χ2 = 5.353, p = 0.021). Logistic regression showed that children of caregivers in rural areas had higher odds of abnormal BMI-for-age (AOR: 1.407, 95% CI: 1.001–1.978, p = 0.049), while children of caregivers in urban areas were less likely to be malnourished (COR: 0.565, 95% CI: 0.347–0.921, p = 0.022). Conclusion. Implementation scientists should focus on enhancing caregiver education, particularly in rural areas, to promote awareness on diets thereby reducing malnutrition.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8b4ff58d3d71f050434039eb8166864b6fd4950006c20d6e7b4fc40bba112689","category":"Interdisciplinary"}