{"title":"Relative contribution of biomedical, demographic, and socioeconomic factors to COVID-19 vaccine receipt in rural India","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305819","date":1719237600000,"content":"<p>by Bethany F. Ferris, Suganthi Balasubramanian, Anuradha Rajamanickam, Saravanan Munisankar, Bindu Dasan, Pradeep A. Menon, P'ng Loke, Subash Babu, Goylette F. Chami</p>\r\nBackground <p>In the first year of roll-out, vaccination for severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) prevented almost 20 million deaths from coronavirus disease 2019 (COVID-19). Yet, little is known about the factors influencing access to vaccination at the individual level within rural poor settings of low-income countries. The aim of this study was to examine determinants of vaccine receipt in rural India.</p> Methods <p>A census of a rural village in Tamil Nadu was undertaken from June 2021 to September 2022. We surveyed 775 participants from 262 households. Household-level data on socioeconomic status (SES), water, sanitation, and hygiene practices, and individual-level demographic information, travel history, and biomedical data, including anthropometry, vital signs, and comorbidities, were collected. Logistic regression models with 5-fold cross-validation were used to identify the biomedical, demographic, and socioeconomic determinants of vaccine receipt and the timing of receipt within the first 30 days of eligibility. Vaccine ineligible participants were excluded leaving 659 eligible participants. There were 650 eligible participants with complete biomedical, demographic, and socioeconomic data.</p> Results <p>There were 68.0% and 34.0% of individuals (N = 650) who had received one and two vaccine doses, respectively. Participants with household ownership of a permanent account number (PAN) or ration card were 2.15 (95% CI:1.32–3.52) or 3.02 (95% CI:1.72–5.29) times more likely to receive at least one vaccine dose compared to households with no ownership of such cards. Participants employed as housewives or self-employed non-agricultural workers were 65% (95% CI:0.19–0.67) or 59% (95% CI:0.22–0.76) less likely to receive at least one vaccine dose compared to salaried workers. Household PAN card ownership, occupation and age were linked to the timing of vaccine receipt. Participants aged ≤18 and 45–60 years were 17.74 (95% CI:5.07–62.03) and 5.51 (95% CI:2.74–11.10) times more likely to receive a vaccine within 30 days of eligibility compared to 19-44-year-olds. Biomedical factors including BMI, vital signs, comorbidities, and COVID-19 specific symptoms were not consistently associated with vaccine receipt or timing of receipt. No support was found that travel history, contact with COVID-19 cases, and hospital admissions influenced vaccine receipt or timing of receipt.</p> Conclusion <p>Factors linked to SES were linked to vaccine receipt, more so than biomedical factors which were targeted by vaccine policies. Future research should explore if government interventions including vaccine mandates, barriers to vaccine access, or peer influence linked to workplace or targeted vaccine promotion campaigns underpin these findings.</p>","author":"Bethany F. Ferris","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8b55b29bf4f69eff9bd6a73dd989994e1d87c5500475c221117fd47bd6f81e5d","category":"Interdisciplinary"}