{"title":"The effectiveness of botulinum toxin for temporomandibular disorders: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300157","date":1710424800000,"content":"<p>by Ravinder S. Saini, Muhammad Ali Abdullah Almoyad, Rayan Ibrahim H. Binduhayyim, Syed Altafuddin Quadri, Vishwanath Gurumurthy, Shashit Shetty Bavabeedu, Mohammed Saheer Kuruniyan, Punnoth Poonkuzhi Naseef, Seyed Ali Mosaddad, Artak Heboyan</p>\r\nObjective <p>The current body of research on utilizing botulinum toxin (BTX) to manage temporomandibular disorders (TMDs) has not yet yielded definitive conclusions. The primary objective of this study was to determine the effectiveness of BTX in pain reduction for TMDs compared to placebo and other treatments. The secondary outcomes evaluated were adverse events, maximum mouth opening, bruxism events, and maximum occlusal force.</p> Materials and methods <p>A literature search was performed on PubMed, Dimension Publication, Scopus, and Google Scholar. The RoB 2 tool was used for quality assessment. The mean differences in pain scores were estimated to measure the effect of BTX on pain reduction. For adverse events, the risk ratio for the incidence of side effects was calculated.</p> Results <p>Two hundred and sixty non-duplicate articles were identified; however, only 14 RCTS were included in this review. The total study population included 395 patients. The overall risk of bias showed a low to moderate quality of evidence. Results from 6 studies were reported only narratively; four studies were used for meta-analysis on pain reduction, and five were used for meta-analysis on adverse events. The control used in the meta-analysis was placebo injections. Results of the meta-analysis for pain reduction were statistically insignificant for the BTX group with mean differences at MD = −1.71 (95% CI, −2.87 to −0.5) at one month, -1.53 (95% CI, −2.80 to −0.27) at three months, and -1.33 (95% CI, −2.74 to 0.77) at six months. This showed that BTX treatment was not significantly better than placebo for a reduction in pain scores at 1, 3, and 6 months. Regarding safety, the placebo group showed a relative risk of 1.34 (95%CI, 0.48–6.78) and 1.17 (95%CI, 0.54–3.88) at 1 and 3 months respectively. However, the risks were not statistically significant. There was also no difference in the effectiveness of BTX compared to placebo and other treatments for maximum mouth opening, bruxism events, and maximum occlusal force.</p> Conclusion <p>BTX was not associated with better outcomes in terms of pain reduction, adverse events, maximum mouth opening, bruxism events, and maximum occlusal force. More high-quality RCTs are needed to better understand this topic.</p>","author":"Ravinder S. Saini","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8b56949d8156316a189cf87ad2d5b8083da6915c3e4cdd12bef4ddfb5fe92759","category":"Interdisciplinary"}