{"title":"Epic Games Files Complaint to Support UK Antitrust Watchdog's Apple Probe","link":"https://www.macrumors.com/2021/03/30/epic-games-complaint-uk-antitrust-apple-probe/","date":1617103170000,"content":"<a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> today <a href=\"https://www.epicgames.com/site/en-US/news/epic-games-files-complaint-to-support-cma-apple-investigation\">said</a> it had filed a complaint to the UK's antitrust watchdog in support of the government department's <a href=\"https://www.macrumors.com/2021/03/04/uk-watchdog-apple-investigation/\">ongoing investigation</a> into Apple's alleged anti-competitive behavior.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/app-store-blue-banner-uk.jpg\" alt=\"\" width=\"1794\" height=\"1009\" class=\"aligncenter size-full wp-image-786887\" />\r\n<br/>\r\nIn September 2020, the United Kingdom Competition and Markets Authority (CMA) launched an initial inquiry into developers' complaints about Apple's <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> and so-called \"anti-competitive\" practices. The CMA is now concluding its initial inquiry to launch an official investigation under Chapter II of the 1998 Competition Act.\r\n<br/>\r\n\r\n<br/>\r\nChapter II relates to a specific company or organization using its domain position within a particular market or industry to limit competition and further enhance its position. In recent months, developers, motivated mainly by &zwnj;Epic Games&zwnj;, have accused Apple of using its dominant position on its platforms and the platform to hinder competition. The CMA says that it has \"reasonable grounds\" to believe that Apple has broken competition law in some form under the Competition Act of 1998.\r\n<br/>\r\n\r\n<br/>\r\nFiled in relation to the official investigation, Epic's latest complaint alleges that Apple's anticompetitive practices and rules governing the distribution of apps and payment processing constitute a \"clear violation of the UK Competition Act of 1998.\"\r\n<br/>\r\n\r\n<br/>\r\nEpic argues that it also illustrates Apple's monopolistic practices, which \"forbid users and developers respectively from acquiring or distributing apps through marketplaces other than Apple's &zwnj;App Store&zwnj;, while simultaneously forcing any in-app purchase to be processed through Apple's own payment system.\"\r\n<br/>\r\n<blockquote>\"By kneecapping the competition and exerting its monopoly power over app distribution and payments, Apple strips UK consumers of the right to choose how and where they get their apps, while locking developers into a single marketplace that lets Apple charge any commission rate they choose,\" said &zwnj;Epic Games&zwnj; founder and CEO Tim Sweeney. \"These harmful practices lead to artificially inflated costs for consumers, and stifle innovation among developers, many of whom are unable to compete in a digital ecosystem that is rigged against them.\"</blockquote>The complaint follows ongoing legal proceedings filed by Epic against Apple in the U.S. and Australia. The games company has also filed an antitrust complaint against Apple in the European Union in support of its ongoing investigation into Apple's &zwnj;App Store&zwnj; conduct.  \r\n<br/>\r\n\r\n<br/>\r\nEpic says that it isn't seeking financial damages, but rather \"regulatory remedies\" that will prevent Apple's \"intentional distortion and manipulation of the market,\" in order to ensure fair access and competition for consumers and developers in the UK and around the world.\r\n<br/>\r\n\r\n<br/>\r\nIn January, ‌Epic <a href=\"https://www.macrumors.com/2021/01/14/epic-games-apple-fortnite-uk-filing/\">submitted a complaint</a> to the United Kingdom's Competition Appeal Tribunal in an effort to get the Fortnite app back on the &zwnj;App Store&zwnj; in the UK. ‌Epic argued that Apple's decision to remove Fortnite was unlawful, and tried to convince the Appeal Tribunal that it was acting on behalf of consumers and developers in the UK impacted by \"Apple and Google's misuse of market power.\"\r\n<br/>\r\n\r\n<br/>\r\nHowever, the judge ruled that ‌Epic's case against Apple Inc. was better decided in the United States, but said that ‌&zwnj;Epic Games&zwnj;‌ <a href=\"http://www.fosspatents.com/2021/02/uk-competition-court-doesnt-doubt.html\">could sue Apple (UK) Limited</a>, a European arm of the company.\r\n<br/>\r\n\r\n<br/>\r\nApple and ‌&zwnj;Epic Games&zwnj;‌ will continue their legal fight in the United States, with the two companies set to face off in court in July 2021.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/antitrust/\">antitrust</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/30/epic-games-complaint-uk-antitrust-apple-probe/\">Epic Games Files Complaint to Support UK Antitrust Watchdog&#039;s Apple Probe</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/epic-games-files-complaint-to-support-uk-antitrust-watchdogs-apple-probe.2290069/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IH98oxPIejo:P7r9qwNR0kw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=IH98oxPIejo:P7r9qwNR0kw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/IH98oxPIejo\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8b56c495e301267ebaf6d996adb962fb147b2dcea9f08648a562f7d8a10125d7","category":"Apple"}