{"title":"Bird‐flower colour on islands supports the bee‐avoidance hypothesis","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14493?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/9e7d7591-8ea2-402c-bb27-4fa75e234970/fec14493-toc-0001-m.png\" alt=\"Bird-flower colour on islands supports the bee-avoidance hypothesis\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/13/evolution-of-flower-colour-on-islands-including-spanish-version/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMany insular plant species inhabiting different archipelagos worldwide present typical ornithophilous floral traits (e.g. copious nectar, red-orange colours), but most of them are visited by insectivorous/granivorous birds and lizards, which act as generalist pollinators. Oceanic islands promote these ecological interactions mainly due to the scarcity of arthropods. Our goal is to understand how these generalist interactions contribute to the shift of floral traits from entomophily (mainland) to ornithophily or saurophily (island), where specialist nectar-feeding birds have not inhabited.\n\nWe used the well-known pollination interactions occurring in the Canary Islands to evaluate two proposed ecological hypotheses, bee-avoidance or bird-attraction, explaining evolutionary transitions of floral traits. Specifically, we studied the flower colour conspicuousness of bird-pollinated Canarian species visited by birds and lizards with their closest relatives from the mainland mainly visited by bees. We analysed the chromatic contrast of flower colours using visual models of bees, birds and lizards and the achromatic contrast in visual models of bees. We also compared reflectance spectra marker points of flowers with available spectral discrimination sensitivities of bees and birds.\n\nUsing a phylogenetically corrected framework of independent plant lineages, our results revealed that bird-pollinated Canarian species showed lower chromatic contrast according to bees and lizard visual models than their mainland relatives, but similar chromatic contrast for bird vision. In addition, reflectance spectra marker points of the Canarian species were displaced to the longest wavelengths, far from the wavelengths of maximum discrimination of bees, but close to birds.\n\nWe conclude that the avoidance of bees would be a primary ecological strategy explaining the evolutionary transitions of flower colours from melittophily to ornithophily. The lower conspicuousness of bird-pollinated Canarian flowers in lizards is perhaps a side effect of the bee-avoidance strategy rather than an independent evolutionary strategy. Together, these findings provide insights into how vertebrate generalist pollinators can also lead to divergence of floral traits in insular habitats, but also in other arthropod-poor habitats.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2023/12/13/evolution-of-flower-colour-on-islands-including-spanish-version/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Cristina Rodríguez‐Sambruno, \nEduardo Narbona, \nJosé Carlos del Valle, \nAlfredo Valido","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"8b608f10aa1e3f237790e365bda8be06493fc418f755d2cd870df92c1c92b7fb","category":"Environment"}