{"title":"Overweight and Obesity Contribute to Inflammation and Reduction in Mean Corpuscular Volume and Mean Corpuscular Hemoglobin in Schoolchildren","link":"https://www.preprints.org/manuscript/202409.1477/v1","date":1726739771000,"content":"Background: The inflammation associated with overweight and obesity seems to alter iron metabolism, but there are few studies evaluating those conditions in children. Thus, we aimed to evaluate leukometric, immunological and hematimetric parameters of overweight and obese schoolchildren. Methods: This is a cross-sectional study, in which 39 children living in Chonim de Cima (Brazil), underwent anthropometric, hematological and immunological assessments. The evaluated parameters were compared between the study group (overweight/obesity, n=15) and the control group (n=24). Unpaired t-test, Mann-Whitney test and linear regression were used for statistical tests and the panoramic profile was used to illustrate differences between groups. Results: The study group had lower mean corpuscular volume (MCV) and mean corpuscular hemoglobin (MCH) and higher TNF levels compared to the control group. Positive correlations were observed between BMI-for-age percentile and total leukocytes (r=0.1493; p=0.0151) or neutrophils (r=0.1395; p=0.0192). Negative correlations between the BMI-for-age percentile and MCV (r=0.1464; p=0.0162) and MCH (r=0.1460; p=0.0164) were found. Furthermore, through the panoramic profile it was noted that the study group had a higher frequency of individuals with high levels of TNF and lower frequencies of individuals with increased hemoglobin and serum iron. Conclusions: Our data suggests that overweight and obesity contribute to a pro-inflammatory context (leukocytes, neutrophils and TNF) and MCV and MCH reduction in schoolchildren.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8b7763740207eb483e502b7162ce26202d2f42141da5c64d9977ffdd27534d7e","category":"Interdisciplinary"}