{"title":"25% of women’s professional peloton receive no salary - Cyclists’ Alliance report highlights issues that remain in women’s cycling","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/25-of-women-s-professional-peloton-receive-no-salary-cyclists-alliance-report-highlights-issues-that-remain-in-women-s-cycling","date":1695310726000,"content":"\n      <p><span>With events like <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> Femmes and the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> being added to the women’s calendar and the increased media coverage of these events, it can be easy to believe that women’s cycling is beginning to achieve parity with men’s. As the Cyclists’ Alliance recent report shows, however, this is still far from the reality of life as a professional female cyclist in 2023.</span></p>\n<div></div>\n<div></div>\n<p><span>The Cyclists’ Alliance is a foundation that provides support to professional female cyclists during and after their careers. From securing fairer pay for female athletes, to resolving disputes with teams and providing emotional and economic support, the organisation is passionate about improving the state of women’s cycling. Each year, the TCA conducts a survey of the women’s professional peloton regarding salaries, working conditions, and team support. The results in 2023, once again, serve as a reminder that there is much more work to be done in terms of professionalism in the sport of cycling.</span></p>\n<p><span>The survey showed that out of 140 female professional cyclists from 31 different countries, 25% of riders still receive no salary or income. It was also discovered that outside the Women’s WorldTour, more than 70% of riders earn less than €10,000 a year. These statistics highlight the growing gap between riders at the top of the sport and those who are outside the WorldTour ranks without a minimum salary stipulation. While the UCI, the sport’s governing body, has implemented various measures to increase the professionalisation of WorldTour teams (the report highlighted that riders within the WWT continue to experience growth due to this), these statistics show that there needs to be investment at the lower levels of the sport, too, especially if it is to grow sustainably.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230723TDFFAZ0085-A.S.O._Thomas_Maheux_1024x1024.jpg?v=1695309576\" />Further highlighting the lack of riders being paid livable wages, the report showed that out of the women surveyed, only 46% rely on cycling as their sole source of income and 78% of respondents outside of the WorldTour also work a second job alongside racing. In addition, nearly half of riders surveyed (47%) have a contract which is only one year long which adds to the problem of job instability and a lack of security for professional female riders. The most common reason that the survey found for riders leaving the sport early was financial reasons. Such inconsistencies between how much riders are earning leads to an unequal playing field and the quality of the races can often suffer because of this.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-the-women-s-worldtour-calendar-is-damaging-the-sport-and-urgently-needs-a-rethink\"><em><strong>Read more: Opinion: The women’s WorldTour calendar is damaging the sport and urgently needs a rethink</strong></em></a></p>\n<p><span>Salaries aside, the report also highlighted the lack of safe and positive environments in teams that are outside of the WorldTour level. Outside of the WorldTour, only 60% of riders believe their team is run in a professional manner. Even within the better-resourced teams, the report pointed out that several riders were not happy with the level of equipment given to them by their teams, for example, they were not provided with weather appropriate clothing or helmets that were the correct size.</span></p>\n<p><span>Another concerning finding was that many contracts, including in the WorldTour, do not appear to comply with the UCI regulations which state riders must have several types of insurance and a pension plan. Less than 40% of the employed WorldTour respondents to the survey confirmed that they had a pension with their team which suggests that their contracts do not comply with regulations. Positively, riders seeking professional assistance when negotiating or signing a contract (41%) has doubled since the TCA’s 2022 survey, proving that it is becoming more common for riders to have contracts looked at by professionals. With this in mind, The Cyclists’ Alliance also pointed out that their most valued service as an organisation is the legal advice that they are able to give athletes. Perhaps one of the most high-profile examples of this in 2023 was when the TCA were advising riders involved in the scandal with Zaaf Cycling Team at the start of the season as riders had allegedly not been paid their salaries for three months. </span></p>\n<p><span>Overall, the top issue that the riders who were surveyed want The Cyclist’s Alliance to address moving forward is that all riders earn a minimum salary. It is widely believed within the women’s peloton that this is the most important step to take to develop the sport – far greater than issues such as adding more women’s races to the calendar, for example. While women’s cycling has undeniably progressed  <span>hugely</span> in recent years, the report shows that often what is seen from a fan perspective on television does not tell the whole story of the sport. Below the WorldTour level especially, there’s still a lot to be improved on.</span></p>\n<p><em><span>The Cyclists' Alliance report can be found in full <a href=\"https://cyclistsalliance.org/2023-annual-rider-survey-full-report/\" target=\"_blank\">here</a></span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8b7ad8f761e257a20c890e2cc45eb73af78a357ecece8792be3478e01aea37d4","category":"Cycling"}