{"title":"Simple mechanochemical synthesis, characterization, optical and thermoelectric properties of a nanostructured silver (I) selenide semiconductor","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300076?af=R","date":1708664439000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c751fb18-a264-4029-8659-7bc5a91973e4/appl202300076-gra-0001-m.png\" alt=\"Simple mechanochemical synthesis, characterization, optical and thermoelectric properties of a nanostructured silver (I) selenide semiconductor\" /><p>This work pointed out the mechanochemical preparation of Ag<sub>2</sub>Se powder semiconductor by milling in a very short reaction time (10 min). The synthesis represented an eco-friendly, relatively low-cost process for the preparation of nanostructured semiconductor at ambient temperature, and makes it a suitable alternative to the existing methods of Ag<sub>2</sub>Se production and could be easily adapted to production dimensions using an industrial vibratory mill.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Silver(I) selenide, Ag<sub>2</sub>Se was very simply and conveniently prepared from Ag and Se powders in a stoichiometric ratio by one-step mechanochemical synthesis after 10 min of milling in a planetary ball mill. The kinetics of this synthesis and the structural, morphological, optical, and thermoelectric properties of the product were studied. The crystal structure, physical properties, and morphology were characterized by X-ray diffraction (XRD), specific surface area measurements, particle size distribution analysis, scanning, and transmission electron microscopy. XRD confirmed the orthorhombic crystal structure of naumannite, Ag<sub>2</sub>Se. The electron microscopy revealed that the nanostructured product consisted of isolated rod-shaped particles and agglomerated nanoparticles of irregular shape which formed clusters with a size &gt;30 μm. Crystallinity was inspected by selected area diffraction. The optical properties were studied using ultraviolet-visible and photoluminescence spectroscopy. The determined band gap energy of 1.15 eV was blue-shifted relative to the bulk Ag<sub>2</sub>Se. For the densification of mechanochemically synthesized powdered Ag<sub>2</sub>Se, the spark plasma sintering method was applied to prepare a suitable sample for thermoelectric characterization. High-temperature thermoelectric properties were evaluated in terms of the potential application of mechanochemically synthesized Ag<sub>2</sub>Se in energy conversion.</p>","author":"Marcela Achimovičová, \nKatarína Gáborová, \nVladimír Girman, \nErika Dutková, \nJaroslav Briančin, \nPetr Levinský, \nViktor Puchý","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"8b849a23b320569da28c58114fec231095efa0619da47903a325ecf2df89de19","category":"Environment"}