{"title":"Designer TALEs enable discovery of cell death-inducer genes","link":"https://academic.oup.com/plphys/article/195/4/2985/7667890?rss=1","date":1715212800000,"content":"<span><div>Abstract</div>Transcription activator-like effectors (TALEs) in plant-pathogenic <span>Xanthomonas</span> bacteria activate expression of plant genes and support infection or cause a resistance response. PthA4<sup>AT</sup> is a TALE with a particularly short DNA-binding domain harboring only 7.5 repeats which triggers cell death in <span>Nicotiana benthamiana</span>; however, the genetic basis for this remains unknown. To identify possible target genes of PthA4<sup>AT</sup> that mediate cell death in <span>N. benthamiana</span>, we exploited the modularity of TALEs to stepwise enhance their specificity and reduce potential target sites. Substitutions of individual repeats suggested that PthA4<sup>AT</sup>-dependent cell death is sequence specific. Stepwise addition of repeats to the C-terminal or N-terminal end of the repeat region narrowed the sequence requirements in promoters of target genes. Transcriptome profiling and <span>in silico</span> target prediction allowed the isolation of two cell death inducer genes, which encode a patatin-like protein and a bifunctional monodehydroascorbate reductase/carbonic anhydrase protein. These two proteins are not linked to known TALE-dependent resistance genes. Our results show that the aberrant expression of different endogenous plant genes can cause a cell death reaction, which supports the hypothesis that TALE-dependent executor resistance genes can originate from various plant processes. Our strategy further demonstrates the use of TALEs to scan genomes for genes triggering cell death and other relevant phenotypes.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"8b888bf6e7b0215b022915bf5f7827b213f1a1f4c02cdf517c74446d6c4c4fce","category":"Environment"}