{"title":"Effects of chopping temperature on the gel quality of silver carp (Hypophthalmichthys molitrix) surimi: insight from gel‐based proteomics","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13654?af=R","date":1718102374000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Morden advanced analytical tools offer valuable information into the understanding of molecular mechanism of traditional food processing. Chopping temperature is well-known to affect the surimi gel quality of silver carp, but the detailed molecular mechanism is not very clear. In this study, a gel-based proteomics was performed on the extracted surimi proteins under different chopping temperatures (0, 5, 10, and 25 °C) along with other physicochemical characterization of surimi proteins and gels.</p>\n<h2>RESULTS</h2>\n<p>With increased chopping temperature, protein extractability (in 3% sodium chloride) generally decreased, while the extracted protein generally exhibited larger surface hydrophobicity, reduced intrinsic fluorescence intensity, lower sulfhydryl content. Sodium dodecyl sulfate-polyacrylamide gel electrophoresis (SDS-PAGE) profile of extracted protein showed a clear difference at 25 °C when compared with the other three temperatures, and more protein fragmentation occurred. Proteomic analysis of selected bands indicated that major myofibrillar proteins react differently with chopping temperatures, especially at 25 °C. The selected bands contained a variety of other proteins or their fragments, including adenosine triphosphate (ATP) synthase, glyceraldehyde-3-phosphate dehydrogenase, glucose-6-phosphate isomerase, heat shock protein, parvalbumin, collagen, and so forth. For the surimi gel, water-holding capacity and gel strength generally decreased with increased chopping temperature.</p>\n<h2>CONCLUSION</h2>\n<p>Our results suggested that chopping at 0–10 °C is acceptable for the production of silver carp surimi in terms of gel strength and water-holding capacity. However, a chopping temperature near 0 °C led to less protein oxidation and denaturation. The inferior gel quality at 25 °C is linked to a decreased concentration of extracted protein and degradation of major myofibrillar protein, the latter is likely crosslinked with sarcoplasmic proteins. © 2024 Society of Chemical Industry.</p>","author":"Yulong Bao, \nDan Yan, \nGuoliang Xu, \nHui Hong, \nRuichang Gao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8b93de2ed1b9c3f8aa1d43618b2e72196b3669e09396337bec6ef78a680e2355","category":"Environment"}