{"title":"The additive value of platelet-rich plasma to topical Minoxidil in the treatment of androgenetic alopecia: A systematic review and meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308986","date":1724853600000,"content":"<p>by Jia Yao, Lu Zhu, Meier Pan, Liling Shen, Yanli Tang, Liping Fan</p>\r\nObjective <p>It still needs to be determined if platelet-rich plasma (PRP) has any added advantage over Minoxidil in treating androgenetic alopecia. We reviewed randomized controlled trials (RCTs) comparing scalp injections of PRP plus Minoxidil vs Minoxidil alone for managing androgenetic alopecia.</p> Methods <p>All RCTs published on Embase, Cochrane Library, and PubMed comparing PRP plus Minoxidil vs. Minoxidil alone were eligible. The literature search was completed on 5 March 2024. The review was registered on PROSPERO (CRD42024509826).</p> Results <p>Of five included RCTs, three had a high risk of bias, while one had some concerns. A systematic review of the studies showed that all trials reported better outcomes with PRP plus Minoxidil than with Minoxidil alone. Meta-analysis showed that hair density at one month (MD: 11.07 95% CI: 1.20, 20.94 I<sup>2</sup> = 0%), three months (MD: 21.81 95% CI: 10.64, 33.00 I<sup>2</sup> = 57%) and 5/6 months (MD: 17.80 95% CI: 7.91, 27.69 I<sup>2</sup> = 80%) of follow-up was significantly better in the PRP plus Minoxidil vs the Minoxidil alone group. Meta-analysis of adverse events showed that the risk of adverse events was comparable in both groups (OR: 0.55 95% CI: 0.22, 1.36 I<sup>2</sup> = 0%). The certainty of evidence on the GRADE assessment was \"low to very low.\"</p> Conclusion <p>Very low-quality evidence shows that the addition of injectable PRP to topical Minoxidil may improve outcomes in patients with androgenetic alopecia. The addition of PRP was found to improve hair density and patient satisfaction significantly. However, the small number of studies with a high risk of bias and heterogeneity in PRP preparation methods are significant limitations of current evidence. Further studies with larger sample sizes and uniform PRP preparation protocols are needed.</p>","author":"Jia Yao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8b9c8108c3def14657c4c5aa1bf55a9e70ed54eda879a92f00841870741195c7","category":"Interdisciplinary"}