{"title":"เก็บตกจากสัมภาษณ์ CEO X: ยืนยันมีอำนาจตัดสินใจ, พบหน้าแรกไอโฟนไม่มีแอป X","link":"https://www.blognone.com/node/136016","date":1696129671000,"content":"<div><div><div><p>ยังมีประเด็นน่าสนใจเพิ่มเติมจาก Linda Yaccarino ซีอีโอ X ที่ให้สัมภาษณ์ในงานสัมมนา Code Conference นอกเหนือจากที่บอกว่า <a href=\"https://www.blognone.com/node/135997\">X จะทำกำไรได้ในปี 2024</a></p>\n<p>Yaccarino ให้ตัวเลขผู้ใช้งานบนแพลตฟอร์ม X เป็นประจำทุกวัน (Daily Active Users - DAUs) หลังจาก Julia Boorstin ผู้สื่อข่าว CNBC ที่เป็นพิธีกรบนเวทีพยายามสอบถาม บอกว่าอยู่ที่ 225 ล้านบัญชี ซึ่งต่อมาหลังจบการสัมภาษณ์ X ให้ข้อมูลใหม่ว่าคือ 245 ล้านบัญชี อย่างไรก็ตามตัวเลขนี้เป็นจำนวนที่ลดลง โดยอ้างอิงจากตัวเลขที่ Elon Musk <a href=\"https://twitter.com/elonmusk/status/1594865247323660290\">เคยเผยแพร่</a>ในเดือนพฤศจิกายน หลังซื้อกิจการมาไม่นาน จำนวนผู้ใช้งานอยู่ที่ 259.4 ล้านบัญชี</p>\n<p>อีกคำถามบนเวทีคือบทบาทของ Yaccarino ที่ X หรือ Twitter เป็นซีอีโอที่มีอำนาจสูงสุดจริงหรือไม่ โดย Boorstin ตั้งข้อสังเกตจาก Twitter ก่อนหน้านั้นผู้ลงโฆษณาถอนตัวจำนวนมาก Yaccarino ที่เคยเป็นหัวหน้าฝ่ายดูแลโฆษณาของ NBCUniversal จึงน่าจะเข้ามาร่วมงาน<a href=\"https://www.blognone.com/node/134604\">เพื่อแก้ปัญหานี้</a>เป็นหลักมากกว่า ขณะที่ทีมพัฒนาผลิตภัณฑ์ (Product) ทั้งหมดยังขึ้นตรงกับ Elon Musk ซึ่ง Yaccarino ยืนยันว่าตนมีอำนาจตัดสินใจ (<a href=\"https://www.blognone.com/node/135224\">เคยตอบเรื่องนี้แล้วครั้งหนึ่ง</a>) แต่ด้วยโครงสร้างองค์กรที่มีลำดับชั้นน้อยเป็น Flat organization การตัดสินใจจึงข้ามไปมาได้เร็ว และปิดท้ายว่ามีใครไม่อยากให้ Elon Musk นั่งข้าง ๆ เพื่อดูแลผลิตภัณฑ์กัน? (ผลคือคนดูในห้องประชุมยกมือหลายคน)</p>\n<p>ประเด็นนี้ถูกจี้มากขึ้นเมื่อ Boorstin ถามเรื่อง Musk เคยให้สัมภาษณ์ว่ามีแผน<a href=\"https://www.blognone.com/node/135804\">เก็บเงินผู้ใช้งานทุกคน</a> ที่หากทำจริง ก็ดูจะขัดแย้งกับประสบการณ์ซีอีโอจากสายธุรกิจโฆษณา โดย Yaccarino ไม่ได้ยอมรับหรือปฏิเสธเรื่องนี้ แต่บอกว่ามีไอเดียต่าง ๆ มากมายทุกสิ่งอย่างเวลาคุยกับ Musk</p>\n<p>สุดท้ายเป็นข้อสังเกตในจังหวะที่ Yaccarino หยิบไอโฟนของตนขึ้นมา โดยหน้าแรกของ Home ไม่พบแอป X แต่กลับมีทั้งแอป Facebook, Instagram, Starbucks แถมยังวาง Settings ใน Dock แถวล่างสุดด้วย ซึ่งประเด็นนี้ก็อาจเป็นคำถามกันไปว่าซีอีโอจำเป็นต้องวางแอปไว้หน้าแรกของโทรศัพท์ตนเองหรือไม่</p>\n<p>ที่มา: <a href=\"https://9to5mac.com/2023/09/28/x-ceo-iphone-home-screen-x-isnt-there/\">9to5Mac</a>, <a href=\"https://sea.mashable.com/tech/27356/everything-you-need-to-know-about-x-ceo-linda-yaccarinos-disastrous-interview\">Mashable</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2ac0e7085389904e653269ebe3b5c13f.jpg\" /></p>\n<p>ดูบทสัมภาษณ์ฉบับเต็ม</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/x-company\">X.com</a></div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/ceo\">CEO</a></div><div><a href=\"/topics/linda-yaccarino\">Linda Yaccarino</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8ba03c5c2a02d825abbb4acba6e2fae1c600ad31531d08340d5aafbda7405822","category":"Thai"}