{"title":"Seed dispersal by frugivores without seed swallowing: Evaluating the contributions of stomatochoric seed dispersers","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14501?af=R","date":1709702006000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/25746724-8f53-4c3c-b316-e80a8016ff60/fec14501-toc-0001-m.png\" alt=\"Seed dispersal by frugivores without seed swallowing: Evaluating the contributions of stomatochoric seed dispersers\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/05/the-overlooked-helpers-animals-that-move-plants-by-carrying-seeds-and-fruits/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe process of seed dispersal that underpins ecosystem maintenance is performed by diverse arrays of fruit-eating animals. However, seed dispersal studies are primarily focused on a subset of these animal communities that disperse seeds by endozoochory. Stomatochory (seed dispersal in which seeds are carried externally and are not swallowed) is rarely considered to be effective, despite an increasing number of taxa-focused studies that indicate otherwise.\n\nWe collated the available information on stomatochory to provide a quantitative overview of the dispersal mechanism, including plant types and fruit traits dispersed, dispersal distances and germination potential for all available taxa. We compared seed sizes dispersed, dispersal distances and germination potential with corresponding data on endozoochory for bats and primates. We also identified the main taxa dispersing seeds by stomatochory and assessed what factors influenced the distances that they carried seeds to.\n\nStomatochoric dispersers can displace large quantities of seeds, including large seeds and those of large fruits, and over short to long distances (&gt;1 km). Compared with similar-sized endozoochoric dispersers, they can disperse larger seeds, but over shorter distances, on average. Similar to endozoochory, seed handling by stomatochory also improves the germination potential of dispersed seeds. Dispersal distances achieved by stomatochory were influenced by body mass, daily path length, seed width, fruit type and seed handling techniques.\n\nFive main taxonomic groups of stomatochoric dispersers were identified: bats, parrots, squirrels, corvids and Old World monkeys (cercopithecines). Parrots perform dispersal services for the largest fruits and over the longest distances. However, given the lack of research on stomatochory, it is likely other taxa are also important stomatochoric dispersers but have not been identified yet.\n\nMore research attention must be directed towards seed dispersal services that are not provided by endozoochory. Many stomatochoric dispersers are common animals within communities and could be playing dominant seed dispersal roles, even without swallowing seeds. Community-wide studies should incorporate all seed dispersal interactions, rather than focusing solely on endozoochory. This will ensure a more robust understanding of community-wide patterns.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/05/the-overlooked-helpers-animals-that-move-plants-by-carrying-seeds-and-fruits/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Kim R. McConkey, \nH. S. Sushma, \nAsmita Sengupta","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"8ba26f1de75ec8108fe7aa07843da12842d6e70960a721023286967fad6d68b8","category":"Environment"}