{"title":"ตลาดคริปโตร่วงเกิน 10% หลังสามสมาคมการเงินจีน ออกแถลงการห้ามให้บริการเกี่ยวกับเงินคริปโต","link":"https://www.blognone.com/node/122751","date":1621406465000,"content":"<div><div><div><p>ตลาดคริปโตร่วงเกิน 10% เช้านี้ หลังสมาคมการเงินอินเทอร์เน็ตแห่งชาติจีน (National Internet Finance Association of China), สมาคมธนาคารจีน (China Banking Association) และสมาคมด้านการชำระเงินและหักบัญชีจีน (Payment and Clearing Association of China) ออกแถลงการณ์ร่วมห้ามสถาบันทางการเงิน เช่น ธนาคาร และบริการชำระเงินออนไลน์ต่างๆ ให้บริการที่เกี่ยวข้องกับเงินคริปโต</p>\n<p>ในแถลงการณ์ระบุว่าการที่สกุลเงินคริปโต พุ่งขึ้นและลงสูง และมีการซื้อขายแบบปั่นราคา (speculative trading) เพิ่มขึ้น อาจเกิดความเสียหายต่อทรัพย์สินของประชาชนและเศรษฐกิจได้</p>\n<p>การแบนนี้ไม่ได้ห้ามบุคคลทั่วไปถือครองเงินคริปโต และนี่ไม่ใช่ครั้งแรกที่จีนออกมาตรการจำกัดการใช้งานคริปโต เพราะ<a href=\"https://www.blognone.com/node/99104\">เมื่อปี 2018 มีการไล่ปิดร้านแลกเปลี่ยนเงินคริปโต</a> สั่งห้ามการทำ ICO (Initial coin offering) ซึ่งส่งผลทางลบกับตลาดเช่นกัน <a href=\"https://www.blognone.com/node/113061\">แต่ก็ไม่ได้ห้ามการขุดเหมืองคริปโต</a> และจีนก็ยังคงเป็นชาติอันดับต้นๆ ที่มีการขุดเหมืองคริปโตมากที่สุดในโลก</p>\n<p>สัปดาห์นี้น่าจะเป็นสัปดาห์ที่หนักหนาของสายเทรดคริปโต อ้างอิงจากราคาเว็บไซต์แลกเปลี่ยนเงินคริปโต <a href=\"https://www.binance.com/en\">Binance</a> ขณะเขียนข่าว BTC ต่ำกว่า 40,000 ดอลลาร์เป็นครั้งแรกในรอบ 4 เดือน ส่วน Ethereum ราคาลดลงแล้วกว่า 10-15% ในรอบ 24 ชั่วโมง หลังก่อนหน้านี้ตลาดได้รับผลกระทบจาก<a href=\"https://www.blognone.com/node/122648\">การหยุดรับเงินบิตคอยน์ของ Tesla</a> และจาก<a href=\"https://www.blognone.com/node/122709\">ทวิตของอีลอน มัสก์</a>อยู่ก่อนแล้ว</p>\n<p>ที่มา - <a href=\"https://www.reuters.com/technology/chinese-financial-payment-bodies-barred-cryptocurrency-business-2021-05-18/\">Reuters</a>, <a href=\"https://www.globaltimes.cn/page/202105/1223840.shtml\">Global Times</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6186a80ff01b48488af0b533bdcc1bf2.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/banking\">Banking</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8ba813267b5d92d1d3f134ac216dff7e63d0d0e9d9db20d5f81962fcb6a0e951","category":"Thai"}