{"title":"กลต. สำรวจตลาดสินทรัพย์ดิจิทัลไทยครึ่งปีแรก มูลค่าซื้อขายรวมราว 808 พันล้านบาท มีบัญชีเทรดรวม 1.17 ล้านบัญชี","link":"https://www.blognone.com/node/123863","date":1627035677000,"content":"<div><div><div><p>เฟซบุ๊กเพจ<a href=\"https://www.facebook.com/sec.or.th/posts/868798520423353\">สำนักงาน กลต.</a> เปิดผลสำรวจภาวะตลาดสินทรัพย์ดิจิทัลไทยรายสัปดาห์ ช่วงครึ่งปีแรกจนถึงวันที่ 19 กรกฎาคม นอกจากเรื่องความผันผวนที่สูงกว่าเมื่อเทียบกับ SET Index แต่มีผลตอบแทนที่สูงกว่า ยังมีประเด็นอื่นๆ ที่น่าสนใจอื่นๆ ดังนี้</p>\n<p>มูลค่าการซื้อขายในตลาดสินทรัพย์ดิจิทัลไทย ช่วงเดือนมกราคมอยู่ที่ 89 พันล้านบาท ก่อนพุ่งเป็น 165 พันล้านในเดือนเมษายน และสูงสุดที่ 218 พันล้านช่วงเดือนพฤษภาคม (คาดว่าเป็นเพราะ[เหตุการณ์การเปลี่ยนแปลงราคาหลายครั้งในรอบเดือน เช่นผลกระทบจาก <a href=\"https://www.blognone.com/node/122648\">Tesla</a> และ<a href=\"https://www.blognone.com/node/122818\">รัฐบาลจีน</a>) ก่อนลดลงมาอยู่ที่ 85 พันล้าน ในเดือนมิถุนายนที่ผ่านมา</p>\n<p>เทียบราคาสินทรัพย์ 5 อันดับแรก บนเว็บ Exchange ไทย 5 เจ้า คือ Bitkub, Zipmex, Satang Pro, Upbit และ Z.com ในวันที่ 19 กรกฎาคม พบมีราคาสูงกว่าราคาอ้างอิงบน <a href=\"https://coinmarketcap.com/\">coinmarketcap.com</a> ทุกเว็บไซต์ ราคาแตกต่างสูงสุดคือ Z.com ที่ราคา Ethereum หนึ่งเหรียญอยู่ที่ 63,000 บาท และใกล้เคียงที่สุดคือ Satang Pro ที่ 60,255 บาท เทียบกับ 59,733 บาท บน coinmarketcap.com</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/26e54969ce78517035da85e93e6f6e43.jpg\" /></p>\n<p>มูลค่าซื้อขายหลักทรัพย์ดิจิทัลในไทยตั้งแต่ต้นปีจนถึง 19 กรกฎาคม อยู่ที่ราว 808 พันล้านบาท เหรียญ Bitcoin ยังมีมูลค่าซื้อขายสูงสุด รองลงมาเป็น Dogecoin และ Ethereum</p>\n<ul>\n<li>Bitcoin มูลค่าการซื้อขาย 131.46 พันล้านบาท คิดเป็น 16.26%</li>\n<li>Dogecoin มูลค่าซื้อขาย 121.87 พันล้านบาท คิดเป็น 15.08%</li>\n<li>Ethereum มูลค่าซื้อขาย 89.71 พันล้านบาท คิดเป็น 11.1%</li>\n<li>Tether 69.7 พันล้านบาท คิดเป็น 8.63%</li>\n<li>XRP 59.52 พันล้านบาท คิดเป็น 7.37%</li>\n<li>Binance Coin (BNB) มูลค่าซื้อขาย 54.64 พันล้านบาท คิดเป็น 6.74%</li>\n<li>Cardano 43.79 พันล้านบาท คิดเป็น 5.42%</li>\n<li>เหรียญอื่นๆ มูลค่าซื้อขาย 237.42 พันล้านบาท คิดเป็น 29.38%</li>\n</ul>\n<p>ปัจจุบันบัญชีซื้อขายสินทรัพย์ดิจิทัลในไทยจนถึงสิ้นเดือนมิถุนายน มีจำนวนทั้งหมด 1,177,937 บัญชี ส่วนใหญ่เป็นบัญชีของบุคคลธรรมดา และมีแนวโน้มเพิ่มขึ้น ส่วนบัญชีบุคคลธรรมดาต่างชาติ มียอดขายบนตลาดสินทรัพย์ดิจิทัลในไทยมากกว่าซื้อทุกเดือน (ขายสุทธิ) ตั้งแต่ 1 มกราคม จนถึง 19 กรกฎาคม</p>\n<p>ที่มา - <a href=\"https://www.facebook.com/sec.or.th/posts/868798520423353\">เพจ สำนักงาน กลต.</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/thai-sec\">Thai SEC</a></div><div><a href=\"/topics/cryptocurrency\">Cryptocurrency</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8bb0b7b94b134b8756493842de140c2c817e9ce70b470f58401b27f50bd1454a","category":"Thai"}