{"title":"Apple’s M1 is a fast CPU—but M1 Macs feel even faster due to QoS","link":"https://arstechnica.com/?p=1765494","date":1621282187000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1229573188-800x573.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1229573188.jpg\">Enlarge</a> <span>/</span> The Apple M1 is a world-class processor—but it <em>feels</em> even faster than its already-great specs imply. Howard Oakley did a deep-dive investigation to find out why. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/in-this-photo-illustration-the-apple-m1-chip-computer-logo-news-photo/1229573188\">SOPA Images via Getty</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Apple's M1 processor is a world-class desktop and laptop processor—but when it comes to general-purpose end-user systems, there's something even better than being fast. We're referring, of course, to <em>feeling</em> fast—which has more to do with a system meeting user expectations predictably and reliably than it does with raw speed.</p>\n<p>Howard Oakley—author of several Mac-native <a href=\"https://eclecticlight.co/dintch/\">utilities</a> such as Cormorant, Spundle, and Stibium—did some digging to find out <a href=\"https://eclecticlight.co/2021/05/17/how-m1-macs-feel-faster-than-intel-models-its-about-qos/\">why</a> his M1 Mac felt faster than Intel Macs did, and he came to the conclusion that the answer is QoS. If you're not familiar with the term, it's short for Quality of Service—and it's all about task scheduling.</p>\n<h2>More throughput doesn’t always mean happier users</h2>\n<p>There's a very common tendency to equate \"performance\" with throughput—roughly speaking, tasks accomplished per unit of time. Although throughput is generally the easiest metric to measure, it doesn't correspond very well with human perception. What humans generally notice isn't throughput, it's latency—not the number of times a task can be accomplished, but the time it takes to complete an individual task.</p></div><p><a href=\"https://arstechnica.com/?p=1765494#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1765494&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8bb64ad7f2facc1f62ad7bd2b86a07846037c73592edbe2d9080855783fc6e08","category":"Tech"}