{"title":"Season 2 of 'For All Mankind' Now Available on Apple TV+","link":"https://www.macrumors.com/2021/02/19/for-all-mankind-season-2-now-available/","date":1613713283000,"content":"The second season of popular <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> series \"For All Mankind\" launched today, with the first episode now available to watch on all devices where the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> app or <a href=\"https://tv.apple.com\">web access</a> is available.\r\n<br/>\r\n\r\n<br/>\r\n<div class=\"center-wrap\"><iframe src=\"https://www.youtube.com/embed/zzmrmjlESjQ\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></div>\r\n<br/>\r\nDeveloped and written by Ronald D. Moore, \"For All Mankind\" is a science fiction series that imagines what the world might have been like if the global space race had never ended and the space program had remained a priority in the United States.\r\n<br/>\r\n\r\n<br/>\r\nSeason two of \"For All Mankind\" picks up in 1983, which is jump of a decade after the first season. It's the height of the cold war, with the U.S. and the USSR fighting over resources available on the moon.<blockquote>Season two of the space drama picks up a decade later in 1983. It's the height of the Cold War and tensions between the United States and the USSR are at their peak. Ronald Reagan is president and the greater ambitions of science and space exploration are at threat of being squandered as the US and Soviets go head-to-head to control sites rich in resources on the moon. The Department of Defense has moved into Mission Control, and the militarization of NASA becomes central to several characters' stories: some fight it, some use it as an opportunity to advance their own interests, and some find themselves at the height of a conflict that may lead to nuclear war.</blockquote>Prior to the launch of the second season of \"For All Mankind,\" Apple released a special \"Time Capsule\" <a href=\"https://www.macrumors.com/2021/02/11/apple-for-all-mankind-ar-link/\">augmented reality app</a> that let users uncover memories from \"For All Mankind\" astronauts Gordo and Tracy Stevens in the decade between season one and season two.<blockquote>Join Danny, teenage son of astronauts Gordo &amp; Tracy Stevens, as he examines interactive keepsakes full of details about life, love, and the world of For All Mankind. Every object tells a story: a simple mixtape unveils how young love first began. A home computer holds the secrets to the teens' changing lives. And items as ordinary as a newspaper and answering machine shed light on impactful events in the lives of Gordo and Tracy Stevens, revealing more about the alternate world of For All Mankind and what's coming in season 2.</blockquote>Apple <a href=\"https://www.macrumors.com/2021/02/15/for-all-mankind-podcast/\">also this week launched</a> \"For All Mankind: The Official Podcast,\" which will discuss the series as season two progresses. Hosted by Krys Marshall, who plays Commander Danielle Poole, the podcast will feature space experts, former astronauts, and \"For All Mankind\" cast and creators.\r\n<br/>\r\n\r\n<br/>\r\n\"For All Mankind\" stars Joel Kinnaman, Michael Dorman, Wrenn Schmidt, Shantel VanSanten, Sarah Jones, and Jodi Balfour.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/apple-tv-shows/\">Apple TV Shows</a>, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV Plus</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/19/for-all-mankind-season-2-now-available/\">Season 2 of &#039;For All Mankind&#039; Now Available on Apple TV+</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/season-2-of-for-all-mankind-now-available-on-apple-tv.2285306/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MweAllighpY:CQtOezFnOaY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MweAllighpY:CQtOezFnOaY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/MweAllighpY\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8bba7dfac8e470250e6842aac8bc25ed57712342a5a4d56c3ee3f3926ca4aa83","category":"Apple"}