{"title":"How to Find Your Apple TV Siri Remote Using Your iPhone","link":"https://www.macrumors.com/how-to/find-apple-siri-remote-with-iphone/","date":1695029215000,"content":"In iOS 17 and tvOS 17, Apple has added a feature that lets Apple TV users locate a misplaced Siri Remote using their iPhone. Keep reading to learn how it's done.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/find-siri-remote-iphone.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nPrior to the launch of the latest ‌Apple TV‌ 4K, there were rumors that Apple would build ‌Find My‌ functionality into the ‌Siri‌ Remote. That didn't happen, but in its latest major software updates, Apple has introduced a new iPhone option that does essentially the same thing. \r<br />\n\r<br />\nIn early September, Apple quietly released new firmware for its second and third-generation Siri Remotes. With the new firmware, tvOS 17, and iOS 17, if a ‌Siri‌ Remote becomes lost, the ‌Apple TV‌ remote control available in the Control Center on an ‌iPhone‌ can be used to locate the missing remote.\r<br />\n\r<br />\nWhen enabled, users will see a Find My-like interface on their iPhone that guides them toward the remote, with an onscreen circle that changes in size to guide movement in the right direction. \r<br />\n\r<br />\nNote that Find My for the ‌Siri‌ Remote is available on the second and third-generation ‌Siri‌ Remotes, and the feature is limited to the ‌Apple TV‌ 4K models released in 2021 and 2022.\r<br />\n\r<br />\nAlso, bear in mind that the updated firmware is necessary, and there is no established method for getting the ‌Siri‌ Remote to update. The ‌Apple TV‌ will need to be up to date, on, and connected to the ‌Siri‌ Remote to initiate, but there is no way to force the new firmware to download.\r<br />\n\r<br />\n<h2>Find Your Siri Remote With Your iPhone</h2>\r<br />\n<ol><li>Bring up the Control Center from your iPhone by swiping down from the upper right corner of the screen (on an ‌iPhone‌ with a Home button, swipe up from the bottom of the screen).</li>\r<br />\n<li>Tap the <strong>Apple TV Remote</strong> button (if it's not there, you can <a href=\"https://www.macrumors.com/how-to/customize-control-center-ios-11/#customize\">manually add it to Control Center</a>).</li>\r<br />\n<li>Tap the chevron next to the name of the connected Siri Remote.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/find-apple-tv-remote-with-iphone1.jpg\" alt=\"control center\" width=\"2738\" height=\"2716\" />\r<br />\n</li><li>Tap the <strong>Find</strong> button next to the misplaced Siri Remote.</li>\r<br />\n<li>Use the onscreen Find My-like interface to locate the remote. The size of the circle increases to guide movement in the correct direction. When your iPhone is right next to the remote, the screen shows a solid white orb.</li>\r<br />\n<li>Tap the <strong>X</strong> button to close the location interface.\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/find-apple-tv-remote-with-iphone2.jpg\" alt=\"remote\" width=\"2738\" height=\"2716\" /></li></ol>In our experience, the proximity accuracy of the feature is equivalent to locating an AirTag with Find My, so it's really helpful for locating your Siri Remote even if it's just hidden between the sofa cushions.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_TV\">Apple TV (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-tv-and-home-theater.100\">Apple TV and Home Theater</a></div><br />This article, \"<a href=\"https://www.macrumors.com/how-to/find-apple-siri-remote-with-iphone/\">How to Find Your Apple TV Siri Remote Using Your iPhone</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/how-to-find-your-apple-tv-siri-remote-using-your-iphone.2402756/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8bc203eec4a7879b5253a6d826a7dd82ae5929d018f530f4c21098df7094b86c","category":"Apple"}