{"title":"Climate Change and Psychiatry: Correlation between Mean Monthly Temperature and Admissions to an Acute Inpatient Unit","link":"https://www.preprints.org/manuscript/202405.0551/v1","date":1715238974000,"content":"Background: Many clinical conditions are affected by meteorological factors and climate changes. Psychiatric disorders are large contributors to the global disease burden, but the literature on the impact of climate changes on mental health is limited. The aim of this study is to investigate the correlation between rising temperatures and admissions for acute exacerbations of psychiatric disorders.\nMethods: Data were collected for summer months of years 2013 to 2022. Mean monthly tempera-tures were obtained from the meteorological station of the Department of Physics of the Universi-ty of Turin. Data on patients admitted to the acute psychiatric unit of San Luigi Gonzaga Univer-sity Hospital (Turin, Italy) were extracted from the hospital registry. Linear regression analyses were used to investigate the correlation between temperature and number of admissions.\nResults: A total of 1600 admissions to our psychiatric ward were recorded. Mean monthly temper-ature and monthly number of admissions were directly correlated (P = 0.0020). The correlation between temperature and admissions was significant for the subgroup of admissions due to Bipo-lar Disorders (BD) (P=0.0011), but not for Schizophrenia (P=0.6070) (SCZ) or Major Depressive Disorder (MDD) (P=0.0588).\nConclusions: These results confirm the impact of meteorological factors on mental disorders, and in particular on the course of BD. This provides new insights into etiopathological mechanisms and can contribute to improved follow up and relapse prevention.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8bc4c77493e1e1cf67559db6e9d0985699f9dfd1ab17dd210ea1977e7a45cf05","category":"Interdisciplinary"}