{"title":"Abortion-related Mental Health Disorders at Midlife: Twenty-year Longitudinal Evidence from the United States","link":"https://www.preprints.org/manuscript/202408.0271/v1","date":1722914337000,"content":"Background and Objectives. To examine trends in the links between induced abortion and subsequent mental health problems for U.S. women approaching completed fertility. \nMaterials and Methods. Panel data on a nationally-representative cohort of 3,842 ever-pregnant women assessed at mean ages of 15, 22, 28 and 37 years from the National Longitudinal Study of Adolescent to Adult Health (Add Health) were examined for pregnancy outcome-related mental health disorders, with extensive adjustment for confounders including sociodemographic dif-ferences, mental health history, and unwanted pregnancies. Outcomes were defined using pub-lished diagnostic criteria or validated index for depression, anxiety disorder, post-traumatic stress disorder (PTSD), and suicide ideation (affective problems); alcohol abuse, drug abuse, opioid abuse, and cannabis abuse (substance abuse problems); and summary counts of affective problems, substance abuse problems and total disorders. Results were adjusted for abortion under-reporting using cross-wave analysis.\nResults. The relative risk of mental health disorder with exposure to induced abortion followed an inverted “V” pattern as women aged to midlife, increasing from Wave III (age 22; IRR 1.41) to Wave IV (age 28; IRR 1.67), then dropping sharply by Wave V (age 37; IRR 1.20). The population at-tributable fraction of mental health disorder due to abortion dropped from 18.1% at Wave IV to 8.0% at Wave V. Unlike previous Waves, at Wave V mental health risk was more strongly reduced by exposure to childbirth (IRR 0.70, 95% CI .63, .78, p &lt; .001). Reduced relative metrics at Wave V were not due to reduced prevalence of mental health disorders for ever-aborting women, which increased from Wave IV to Wave V by 1.7%, but increased much more, by 20.5%, for never-aborting women.\nConclusion. At midlife approaching completed fertility, differential negative psychological out-comes for ever-aborting U.S. women remained elevated but reduced from younger ages.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8bccf631a0936cc8183848e4bee0572789a3be02fdfb6b3a19a79a1c9e727c94","category":"Interdisciplinary"}