{"title":"It’s time to fear the fungi","link":"https://arstechnica.com/?p=1815664","date":1638014147000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/candida-fungus-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/candida-fungus.jpg\">Enlarge</a> <span>/</span> Computer illustration of Candida fungi (yeast). The most common representatives of Candida fungi are <em>C. albicans</em> and <em>C. auris</em> with similar morphology. <em>C. albicans</em> is found on the skin and mucous membranes of the mouth, genitals, respiratory tract, and digestive tract. The most common disease caused by <em>C. albicans</em> is vaginal candidiasis (thrush). <em>C. auris</em> was first identified in 2009. It causes serious multidrug-resistant infections in hospitalized patients and has high mortality rates. (credit: Kateryna Kon | Science Photo Library | Getty)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>There are plenty of things in this world that might keep you up at night. There's <a href=\"https://arstechnica.com/tag/covid-19/\">COVID-19</a>, of course, but if you're anxious like me you could probably rattle off a very long list of additional fears: getting hit by a car, cancer, being poisoned by an ill-advised gas station meal, getting caught in a wildfire, electrocuting yourself plugging your laptop in at a dodgy cafe. But what is likely not high on your list is fungi. Unfortunately, that might be changing.</p>\n<p>In 2009, a patient in Japan developed a new fungal infection on their ear. The highly transmissible <a href=\"https://pubmed.ncbi.nlm.nih.gov/33091071/\"><em>Candida auris</em></a> fungus had been previously unknown to science (and resistant to the drugs available to treat it), but within a few years, cases started emerging in Venezuela, Iran, Russia, and South Africa.</p>\n<p></p></div><p><a href=\"https://arstechnica.com/?p=1815664#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1815664&amp;comments=1\">Comments</a></p>","author":"WIRED","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8bf9f2a01c6270a3298ec608a0f3f221da02695f67118def7b1e3acadd022c0f","category":"Tech"}