{"title":"Apple Announces 'Business Essentials' Service for Small Businesses","link":"https://www.macrumors.com/2021/11/10/apple-business-essentials/","date":1636558401000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2021/11/apple-introduces-apple-business-essentials/\">announced</a> the debut of <a href=\"https://www.apple.com/business/essentials/\">Apple Business Essentials</a>, a new subscription-based service that will offer device management like setup and onboarding, iCloud storage, and optional 24/7 access to Apple Support for small businesses with up to 500 employees.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/apple-business-essentials.jpg\" />\r\n<br />\r\nApple Business Essentials will enable small businesses to easily configure, deploy, and manage Apple products from anywhere, and there will be an Apple Business Essentials app that employees can access to download corporate apps like Webex or Microsoft Word.<blockquote>Within Apple Business Essentials, Collections enable IT personnel to configure settings and apps for individual users, groups, or devices. When employees sign in to their corporate or personally owned device with their work credentials, Collections automatically push settings such as VPN configurations and Wi-Fi passwords. In addition, Collections will install the new Apple Business Essentials app on each employee’s home screen, where they can download corporate apps assigned to them, such as Cisco Webex or Microsoft Word.</blockquote>Apple Business Essentials is available today as a free beta for small businesses in the U.S. with up to 500 employees, and the service will be fully available in spring 2022. Pricing will range from $2.99 per user per month to $12.99 per user per month depending on the number of devices and the amount of iCloud storage each user needs. \r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\nThere will be an option to add AppleCare+ to an Apple Business Essentials plan starting in spring 2022, and this will provide 24/7 access to Apple Support by phone, training for both IT administrators and employees, and up to two device repairs per plan each year. Employees will be able to initiate repairs directly from the Apple Business Essentials app, and an Apple-trained technician can arrive on site in as little as four hours.\r\n<br />\r\n\r\n<br />\r\nSmall businesses can sign up for Apple Business Essentials <a href=\"https://www.apple.com/business/essentials/\">on Apple's website</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2021/11/10/apple-business-essentials/\">Apple Announces 'Business Essentials' Service for Small Businesses</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-business-essentials-service-for-small-businesses.2322752/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ljFWk7YsYi0:szq8VB_F5J0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ljFWk7YsYi0:szq8VB_F5J0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ljFWk7YsYi0\" />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8c024e0b06d7885ec06142c02bd8bc33c7e923550ac0d159143ec819b5375e38","category":"Apple"}