{"title":"Maryland’s first local malaria case in 40 years initially duped doctors","link":"https://arstechnica.com/?p=1975941","date":1697217474000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/612-800x527.png\" alt=\"Under a magnification of 1,125x, this photomicrograph of a blood specimen revealed the presence of intraerythrocytic &lt;em&gt;Plasmodium falciparum&lt;/em&gt; ring-form trophozoites. Note the erythrocyte in the center contained four ring-staged trophozoites and that all rings exhibited a single chromatin dot.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/612.png\">Enlarge</a> <span>/</span> Under a magnification of 1,125x, this photomicrograph of a blood specimen revealed the presence of intraerythrocytic <em>Plasmodium falciparum</em> ring-form trophozoites. Note the erythrocyte in the center contained four ring-staged trophozoites and that all rings exhibited a single chromatin dot. (credit: <a href=\"https://phil.cdc.gov/Details.aspx?pid=612\">CDC</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Catching malaria in the US is extremely rare, but when it happens, the mosquito-borne parasite can masquerade as another parasite that's regularly found in the country, leading to a misdiagnosis that has foiled doctors around the world for years. Such was the case this year in Maryland, when the state saw its first locally acquired malaria case in <a href=\"https://health.maryland.gov/newsroom/Pages/Maryland-Department-of-Health-announces-positive-case-of-locally-acquired-malaria.aspx\">over 40 years</a>, according to <a href=\"https://www.cdc.gov/mmwr/volumes/72/wr/mm7241a3.htm?s_cid=mm7241a3_w\">a report this week</a>.</p>\n<p>The misdiagnosis led the patient to a weeks-long treatment for the wrong infection and held up public health responses to pinpoint and thwart further transmission. To date, the source of the patient's infection remains a mystery.</p>\n<p>As global travel and climate warming expand malaria's range, awareness of the diagnostic pitfall and better testing will be increasingly needed, the report's authors suggest. The report was published Thursday in the Centers for Disease Control and Prevention's Morbidity and Mortality Weekly Report.</p></div><p><a href=\"https://arstechnica.com/?p=1975941#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1975941&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8c0eca217a9a208ebd258ee88efcf80d28a0e4c35e43291de4f2403e28144811","category":"Tech"}