{"title":"Assessing nanobody interaction with SARS-CoV-2 Nsp9","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303839","date":1715954400000,"content":"<p>by Gennaro Esposito, Yamanappa Hunashal, Mathias Percipalle, Federico Fogolari, Tomas Venit, Ainars Leonchiks, Kristin C. Gunsalus, Fabio Piano, Piergiorgio Percipalle</p>\r\n\r\nThe interaction between SARS-CoV-2 non-structural protein Nsp9 and the nanobody 2NSP90 was investigated by NMR spectroscopy using the paramagnetic perturbation methodology PENELOP (Paramagnetic Equilibrium vs Nonequilibrium magnetization Enhancement or LOss Perturbation). The Nsp9 monomer is an essential component of the replication and transcription complex (RTC) that reproduces the viral gRNA for subsequent propagation. Therefore preventing Nsp9 recruitment in RTC would represent an efficient antiviral strategy that could be applied to different coronaviruses, given the Nsp9 relative invariance. The NMR results were consistent with a previous characterization suggesting a 4:4 Nsp9-to-nanobody stoichiometry with the occurrence of two epitope pairs on each of the Nsp9 units that establish the inter-dimer contacts of Nsp9 tetramer. The oligomerization state of Nsp9 was also analyzed by molecular dynamics simulations and both dimers and tetramers resulted plausible. A different distribution of the mapped epitopes on the tetramer surface with respect to the former 4:4 complex could also be possible, as well as different stoichiometries of the Nsp9-nanobody assemblies such as the 2:2 stoichiometry suggested by the recent crystal structure of the Nsp9 complex with 2NSP23 (PDB ID: 8dqu), a nanobody exhibiting essentially the same affinity as 2NSP90. The experimental NMR evidence, however, ruled out the occurrence in liquid state of the relevant Nsp9 conformational change observed in the same crystal structure.","author":"Gennaro Esposito","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8c17f8f7a99505387858ac6496376dc7db850e5ff9faf0c4f81140d0a2ab2ec4","category":"Interdisciplinary"}