{"title":"LG ประกาศทิศทางใหม่ มองตัวเองเป็นบริษัทโซลูชันแทนฮาร์ดแวร์ เตรียมทำธุรกิจ Subscription","link":"https://www.blognone.com/node/134875","date":1689647586000,"content":"<div><div><div><p>William Cho ซีอีโอของ LG ประกาศวิสัยทัศน์ใหม่ของบริษัท จากเดิมที่มองตัวเป็นแบรนด์เครื่องใช้ไฟฟ้าระดับโลก (global home appliance brand) เปลี่ยนมาเป็นบริษัทขาย \"โซลูชัน\" สำหรับชีวิตสมาร์ท (smart life solution company) โดยจะหันมาขยายบริการเชิงแพลตฟอร์ม (platform-based service business model) มากขึ้น</p>\n<p>นิยามคำว่า platform-based service business model ย่อมหนีไม่พ้นบริการ subscription แบบจ่ายเงินเป็นรายเดือนโดยอิงอยู่บนฐานลูกค้าฮาร์ดแวร์ของตัวเอง ตัวอย่างที่บริษัทยกมาคือ การขายฟีเจอร์ของเครื่องอบผ้าที่เหมาะกับสภาพอากาศของบ้านลูกค้า, สมาร์ททีวีที่นำเสนอบริการหรือโฆษณาจากพาร์ทเนอร์</p>\n<p>LG ให้ข้อมูลว่ามีฐานลูกค้าสมาร์ททีวีที่เป็น webOS จำนวน 200 ล้านเครื่องทั่วโลก ซึ่งจะเปลี่ยนธุรกิจขายทีวีมาเป็นผู้ให้บริการสื่อและความบันเทิง (media and entertainment service provider) ตัวอย่างที่ทำไปแล้วคือการทำช่อง LG Channels ของตัวเอง ตอนนี้มีผู้ชมแล้ว 48 ล้านคนใน 29 ประเทศ บริษัทยังเตรียมขยาย webOS ไปยังผู้ผลิตทีวีแบรนด์อื่นๆ และขยายแอพบน webOS ไปยังสินค้าประเภทอื่นด้วย</p>\n<p>LG ยังบอกว่าจะขยายไปยังธุรกิจข้างเคียงอื่นๆ เช่น ระบบชาร์จรถไฟฟ้า EV, ผลิตภัณฑ์ด้านสุขภาพดิจิทัล และขยายธุรกิจฝั่ง B2B ให้มากกว่าเดิมด้วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f2718e5e64955fef55923e26718e2af9.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.lgnewsroom.com/2023/07/lg-ceo-announces-bold-vision-to-transform-lg-into-smart-life-solutions-company/\">LG (1)</a>, <a href=\"https://www.lgnewsroom.com/2023/07/key-elements-of-lgs-bold-vision-to-transform-lg-into-smart-life-solutions-company/\">LG (2)</a> via <a href=\"https://www.extremetech.com/electronics/lg-plans-to-add-subscription-features-to-tvs-and-appliances\">ExtremeTech</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/lg\">LG</a></div><div><a href=\"/topics/home-appliance\">Home Appliance</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8c1bee331a2ac0d20311875fdec08f8103c249b5f5c4eeced9e52c8a7abd3911","category":"Thai"}