{"title":"Apple is doomed because it makes too many Pencils","link":"https://www.macworld.com/article/2114063/apple-pencil-usb-c-1st-2nd-gen-ipad.html","date":1698143400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last week, <a href=\"https://www.macworld.com/article/2108888/apple-pencil-usb-c-features-price-comparison-ipad.html\">Apple introduced a new Pencil</a> and the reaction was what you’d expect if the company showed up drunk at your son’s bar mitzvah.</p>\n\n\n\n<p>First of all, an entire company at your son’s bar mitzvah? You don’t have the food for that. Second, how are they all drunk? Many of them assuredly don’t even drink. This makes as much sense as the current Pencil lineup.</p>\n\n\n\n<p>Looking at <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/newsroom/2023/10/apple-introduces-new-apple-pencil-bringing-more-value-and-choice-to-the-lineup/&amp;xcust=1-1-2114063-1-0-0&amp;sref=https://www.macworld.com/feed\">the current line of Apple Pencils</a>, it’s less “good, better, best” and more like “gurd, blatter, best”. The 2nd-generation Apple Pencil is clearly the best, having all the features of the other two, although it comes at a premium. At first glance, the other two make no sense. One is called the 1st-generation Apple Pencil and the other is the USB-C Apple Pencil. The 1st-generation Pencil has pressure sensitivity but lacks the magnetic attaching and hover feature of the USB-C Pencil. What white nonsense is this?</p>\n\n\n\n<p>Part of the somewhat negative reaction is also certainly due to the fact that Apple did not introduce new iPads as many expected it would do. They say timing is everything, but this is more a case of Timming. And for Apple, Timming is everything.</p>\n\n\n\n<p>(And verily thou shalt know me by the seeing of what I hath done there.)</p>\n\n\n\n<p>Jason Snell rightly called this <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://sixcolors.com/post/2023/10/the-price-of-apples-old-products-strategy/&amp;xcust=1-1-2114063-1-0-0&amp;sref=https://www.macworld.com/feed\">“The price of Apple’s old-products strategy”</a>, pointing out that Tim Cook’s Apple doesn’t mind shipping a slightly off mix of products if it’ll help the company’s margin.</p>\n\n\n\n<p>If Apple had wanted a lineup that made perfect sense, Snell says, it would have shipped the 10th generation iPad with the USB-C Pencil and canceled the 9th generation iPad and 1st generation Pencil. But it didn’t do that. Why? Because it wanted to sell more of those old iPads and Pencils.</p>\n\n\n\n<p>Now, at some point, it <em>will</em> stop shipping the 9th generation iPad and the 1st generation Pencil. That’s when a cheap, magnetic Pencil with hover but without brush sensitivity, a feature more suited to professionals, will be a better fit for the low end than the 1st generation Pencil, which had to be all things to all people.</p>\n\n\n<div><figure><img src=\"https://images.idgesg.net/images/idge/imported/imageapi/2021/12/28/13/macalope-2021-100915055-orig.jpg?quality=50&amp;strip=all&amp;auto=webp&amp;quality=85,70\" alt=\"Macalope\" loading=\"lazy\" /></figure><p>IDG</p></div>\n\n\n\n\n<p>So, is there a problem here? Yes, the lineup is confusing… for now. And so is the iPad lineup itself, for that matter. Is Apple slipping back into the confusion of the <a href=\"https://www.macworld.com/article/227019/the-quiet-slightly-fatuous-tragedy-of-a-dead-vintage-mac.html\">Performa era</a>?</p>\n\n\n\n<p>No.</p>\n\n\n\n<p>First, it’s not exactly like Apple’s hurting. Comparisons to the Performa days are easy. Also fun. Humorous? Sure. Nostalgic? Clearly. If you think about them long enough, will they eventually fill you with a sense of loss over the passage of time, years gone that you’ll never get back? Sadly, it’s possible. Will you start thinking of Gail and that apartment you shared together in Brooklyn in the summer of ’96 and wonder what might have been if you hadn’t moved to the west coast for grad school? Well, okay, maybe, but we’re kind of getting off track. The point is, such comparisons are not accurate.</p>\n\n\n\n<p>(Also Gail has long since moved on. Let it go.)</p>\n\n\n\n<p>Snell notes that Cook keeps products around to hit particular price points. This can make things look weird from time to time, but over time things end up making more sense.</p>\n\n\n\n<p>Another old saw it feels compelling to pull out is “Steve Jobs would never…” After all, one of Jobs’ most famous moves upon returning to Apple was implementing an easy-to-understand product quadrant. But he did so in order to fix a problem. The Performa problem. You might think there’s a problem with Apple’s lineup now, but the company’s continued flume ride on a river of cash would tend to belay that notion.</p>\n\n\n\n<p>Also, smaller comparisons of the iPad lineup, for example, make a lot more sense and are probably more likely what the average purchaser looks at. Pull up <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2114063-1-0-0&amp;u=https://www.apple.com/ipad/compare/?modelList=ipad-air-5th-gen,ipad-10th-gen,ipad-9th-gen\">a comparison</a> of the 9th-generation iPad, 10th-generation iPad, and the 5th-generation iPad Air and you’ll see a relatively easy-to-understand set of price and feature options.</p>\n\n\n\n<p>So, there’s no need to worry that Apple has slipped back into the Performa-tive mistakes it’s made in the past.</p>\n\n\n\n<p>Also, now is probably as good a time as any for the Macalope to tell you that Gail has a novel coming out soon. It’s been very well-received and one of the characters is a selfish love interest who spends most of his time playing Super Nintendo and then moves to the west coast to go to grad school. So, uh, yeah. There’s that.</p>\n\niOS, iPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8c1d85dfdaeaa042e29f49790b0be71e21d90479a6da751c36e1c8202a5a35c3","category":"Apple"}