{"title":"The Diabetes Remission in India (DiRemI) study: Protocol for a prospective matched-control trial","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306394","date":1719583200000,"content":"<p>by Pramod Tripathi, Nidhi Kadam, Diptika Tiwari, Thejas Kathrikolly, Anagha Vyawahare, Baby Sharma, Malhar Ganla, Banshi Saboo</p>\r\nBackground <p>The global rise in diabetes, particularly in India, poses a significant public health challenge, with factors such as limited awareness, financial strain, and cultural considerations hindering its effective management. Although lifestyle changes have shown promising results, their consistent implementation and maintenance continue to pose challenges. Most studies have focused primarily on dietary modifications, overlooking other essential aspects of lifestyle intervention. The DiRemI study aims to address these gaps by evaluating the efficacy of a comprehensive one-year program that combines diet, exercise, psychological support, and medical management to achieve weight loss, diabetes remission, and improved glycemic control among patients with type 2 diabetes (T2D) in India, while also considering the unique needs of the Indian population.</p> Methods <p>The DiRemI study is a prospective, open-label, matched-group trial aimed at assessing the impact of a one-year online integrated intensive lifestyle intervention (ILI) comprising dietary modifications, physical activity, psychological support, and medical management on weight loss and remission in adult T2D patients (aged 30–70 years), with a body mass index (BMI) between 25 and 35 kg/m<sup>2</sup>, and disease duration of &lt;15 years. ILI will be compared with routine medical care (RMC). Participants will be recruited from three clinics: one providing ILI and two others providing RMC. The co-primary outcome will be weight loss and remission at 12 months, with a follow-up at 18 months. The proposed sample size is 360 participants (180 each in intervention and control group).</p> Discussion <p>The DiRemI study represents the first large-scale remission study in India to show the effectiveness of an integrated approach in the remission and management of T2D and its complications. The findings of this study hold the potential to report evidence-based strategies for managing T2D both in India and globally, thus alleviating the substantial burden of diabetes on public health systems.</p> Trial registration <p>Clinical Trials Registry, India (Registered Number: CTRI/2023/06/053885).</p>","author":"Pramod Tripathi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8c258bea691a3f5645d65ff3a58908f35e9bbe311ffc8d776ba0609df455799d","category":"Interdisciplinary"}