{"title":"วิศวกรการบินเสนอจุดตกใหม่ของเที่ยวบิน MH370 จากการคำนวณสัญญาณวิทยุ","link":"https://www.blognone.com/node/126157","date":1638755642000,"content":"<div><div><div><p>Richard Godfrey วิศวกรการบินชาวอังกฤษ สมาชิกของกลุ่ม <a href=\"https://www.mh370search.com/\">MH370 Independent Group</a> กลุ่มอิสระที่ค้นหาจุดตกของเครื่องบิน Malaysian Airlines เที่ยวบิน MH370 ที่สูญหายไปเมื่อปี 2014 ได้เสนอผลการวิเคราะห์หาจุดตกของ MH370 ที่เชื่อว่าแม่นยำกว่าเดิม และสอดคล้องกับหลักฐานบ่งชี้อื่นๆ</p>\n<p>การวิเคราะห์ของ Godfrey ใช้ข้อมูล 4 ชุดประกอบกัน ได้แก่</p>\n<ul>\n<li>ข้อมูลจากดาวเทียม Inmarsat</li>\n<li>ข้อมูลคลื่นวิทยุสัญญาณอ่อน (Weak Signal Propagation Reporter) ที่เป็นข้อมูลสาธารณะจากเว็บไซต์ <a href=\"https://www.wsprnet.org/\">WSPR.net</a></li>\n<li>ข้อมูลการทำงานของเครื่องบินจาก Boeing</li>\n<li>ข้อมูลการเดินทางของเศษซาก (debris) ในมหาสมุทร</li>\n</ul>\n<p>แหล่งข้อมูลสำคัญของ Godfrey คือฐานข้อมูลคลื่นวิทยุ WSPR ที่บันทึกการรับและส่งคลื่นวิทยุในชั้นบรรยากาศทุก 2 นาที เขานำฐานข้อมูลนี้มาพัฒนาเป็นซอฟต์แวร์ชื่อ Global Detection and Tracking of Any Aircraft Anywhere (GDTAAA) เพื่อหาพิกัดของเครื่องบินในแต่ละช่วงเวลาโดยเฉพาะ</p>\n<p>Godfrey บอกว่าตามปกติแล้ว การเทียบสัญญาณกับเครื่องบินเป็นเรื่องยาก เพราะอาจมีเครื่องบินหลายลำที่อยู่ในพื้นที่เดียวกัน มีความเป็นไปได้หลายทาง แต่ในกรณีของ MH370 บินไปตกในบริเวณทางใต้ของมหาสมุทรอินเดีย ซึ่งแทบไม่มีเครื่องบินอยู่เลย จึงเจาะจงเครื่องบินได้ง่ายขึ้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3e5617c9fca1fa4e747193f424ac9064.png\" /></p>\n<p>ภาพแสดงข้อมูลสัญญาณวิทยุจาก WSPR.net ในวันและเวลาที่คาดว่า MH370 ตกลงในทะเล</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/10cd4d7cc8e48684c53cabceed11d73a.png\" /></p>\n<p>จากการคำนวณของ Godfrey ประเมินว่า MH370 ตกอยู่บริเวณพิกัด 33 องศาใต้ 95 องศาตะวันออก ซึ่งสอดคล้องกับพิกัดสุดท้ายจากดาวเทียม Inmarsat และการประเมินแหล่งที่มาของชิ้นส่วนเครื่องบินที่ลอยไปติดชายฝั่งแอฟริกา ว่าอยู่ระหว่างเส้นละติจูดที่ 32-33 องศาใต้</p>\n<p>Godfrey ระบุว่าพื้นที่แถบนี้เป็นจุดที่มีหุบเหวและหน้าผาใต้น้ำอยู่มาก (อยู่ทางใต้ของพื้นที่ที่เรียกว่า <a href=\"https://en.wikipedia.org/wiki/Broken_Ridge\">Broken Ridge</a>) ทำให้การค้นหาทำได้ยาก จากการประเมินคาดว่าความลึกของก้นทะเลคือ 4,000 เมตร</p>\n<p>ในการค้นหาซากเครื่องบินปี 2015 โดยหน่วยงานความปลอดภัยของออสเตรเลีย Australian Transport Safety Bureau (ATSB) ไม่ได้ค้นหาในจุดนี้ แต่เรือค้นหาของออสเตรเลียและจีนในปี 2016 เคยแล่นผ่าน แต่ไม่ได้เจาะจงค้นหาที่บริเวณนี้โดยตรง ส่วนการค้นหาในปี 2018 เฉียดผ่านบริเวณนี้ไป เพราะถือว่าเคยมีเรือผ่านในปี 2016 แล้วแต่ไม่พบ เลยไม่ได้ค้นหาซ้ำ</p>\n<p>ภาพแสดงพื้นที่การค้นหาในอดีต จุดตกใหม่ที่ Godfrey เสนอคือจุดตัดของเส้นประสีดำ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/36faaad208d270e38b057848998510f3.png\" /></p>\n<p>ตัวของ Godfrey นั้นถือเป็น \"ผู้สนใจ\" ค้นหาเครื่องบินในรูปอาสาสมัคร เหตุเพราะเขาเคยเกือบเสียชีวิตจากอุบัติเหตุเครื่องบิน <a href=\"https://en.wikipedia.org/wiki/Air_France_Flight_447\">Air France 447</a> ตกในมหาสมุทรแอตแลนติกปี 2009 แต่รอดมาได้เพราะมีเหตุต้องยกเลิกการเดินทาง เหตุการณ์นี้ทำให้เขากลายมาเป็นผู้สนใจในการค้นหาเครื่องบินที่สูญหายในทะเล</p>\n<p>เว็บไซต์ BBC ชี้ว่าถึงแม้มีพิกัดที่ชัดเจนขึ้น แต่การออกค้นหาจริงๆ จะเกิดขึ้นได้หรือไม่ ขึ้นกับว่าใครออกค่าใช้จ่ายในการสำรวจด้วยหรือไม่ โดย BBC สอบถามไปทาง ATSB และได้รับคำตอบว่า ATSB จะไม่ออกปฏิบัติการค้นหาอีกแล้ว การค้นหาถัดจากนี้ถือเป็นความรับผิดชอบของรัฐบาลมาเลเซียเป็นหลัก นอกจากนี้ยังมีความเป็นไปได้ว่ารัฐบาลจีนจะสนใจช่วยค้นหาด้วย เพราะมีผู้โดยสารชาวจีนมากถึง 122 คนในเครื่องบินลำนี้ (รัฐบาลจีนเคยส่งเรือมาช่วยค้นหาในปี 2016)</p>\n<p>ที่มา - <a href=\"https://www.mh370search.com/2021/11/30/mh370-preliminary-findings/\">MH370 Search</a>, <a href=\"https://www.bbc.com/news/business-59517821\">BBC</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/malaysia-airlines\">Malaysia Airlines</a></div><div><a href=\"/topics/airline\">Airline</a></div><div><a href=\"/topics/aviation\">Aviation</a></div><div><a href=\"/topics/science\">Science</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8c2d25a0815cbae6675286dbd643a8918be357eae0410cb37097e6c78fec4dea","category":"Thai"}