{"title":"How to watch Apple TV+ on a Windows PC","link":"https://www.macworld.com/article/676083/how-to-watch-apple-tv-on-windows.html","date":1678822003000,"content":"<div>\n<section><div></div></section>\n\n\n\n<p>Apple TV+ has plenty of decent shows worth watching, including Ted Lasso, Mythic Quest, The Morning Show, Severance and a number of other new ones on their way. While Apple devices come with a dedicated Apple TV+ app built in, the same isn’t true for Windows users. </p>\n\n\n\n<p>That doesn’t mean you have to miss out. You’ve always been able to enjoy Apple TV+ shows on the web, and now Apple even has a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.microsoft.com/store/detail/apple-tv-preview/9NM4T8B9JQZ1&amp;xcust=1-1-676083-1-0-0&amp;sref=https://www.macworld.com/feed\">TV app for Windows PCs</a>.</p>\n\n\n\n<h2>What is Apple TV+?</h2>\n\n\n\n<p>Launched in November 2019, Apple TV+ is the company’s TV and movie streaming service, which competes with (or complements) Netflix, Amazon Prime Video, Disney+, and other media content providers. The selection of titles is definitely smaller than is offered by its rivals, but Apple has slowly been building up a range of interesting bespoke content, often featuring big-name stars like Jennifer Aniston, Steve Carell, Will Ferrell, Tom Hanks, Paul Rudd, Tom Holland, and others.</p>\n\n\n\n<p>For everything you can watch now, read our <a href=\"https://www.macworld.com/article/673567/everything-you-can-watch-on-apple-tv.html\">guide to the full Apple TV+ catalog</a>.</p>\n\n\n\n<p>Using the service costs £6.99/$6.99 per month, but there’s also the possibility of getting three months for free when you buy an eligible Apple product. These include any new iPhone, iPad, iPad Touch, Apple TV, or Mac.</p>\n\n\n\n<p>There are also various other ways to get a free or reduced subscription to the service, such as when you buy certain products or if you’re a student. We outline the options in <a href=\"https://www.macworld.com/article/673723/all-the-ways-you-can-get-apple-tv-for-free.html\">all the ways you can get Apple TV+ for free</a>.</p>\n\n\n\n<p>If you already subscribe to another Apple service, such as Apple Music, then it could be worth considering changing to Apple One, which offers various bundle combinations of Apple Music, Apple Arcade, Apple News+, Apple Fitness+, and iCloud. To see what each tier costs and has to offer, read: <a href=\"https://www.macworld.com/article/675831/should-i-get-apple-one.html\">should I get Apple One?</a></p>\n\n\n\n<h2>How to watch Apple TV+ on a Windows PC</h2>\n\n\n\n<p>The simplest way to watch Apple TV+ on a Windows PC is to grab the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.microsoft.com/store/detail/apple-tv-preview/9NM4T8B9JQZ1&amp;xcust=1-1-676083-1-0-0&amp;sref=https://www.macworld.com/feed\">TV app from the Windows Store</a>. At the time of this writing it’s a “preview” so expect a few bugs, but Apple will likely have a more solid, non-preview app available in the first half of 2023.</p>\n\n\n\n<p>If you don’t want to use the app, or can’t for some reason, you can always watch on Windows in a web browser. The same holds true for Chromebooks and (we assume) those on Linux distros. Just go to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://tv.apple.com/&amp;xcust=1-1-676083-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">tv.apple.com</a> and you should see the Apple TV+ page with an option to Sign In at the top-right corner.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3800755/how_to_watch_apple_tv_plus_on_windows_pc_sign_up_thumb.jpg\" alt=\"How to watch Apple TV+ on Windows PC: Sign up\" loading=\"lazy\" /></figure></div>\n\n\n\n<p>Click that, enter your Apple ID and password, then you’ll be able to watch all of the content on the platform.</p>\n\n\n\n<p>If you don’t have an active Apple TV+ account, then you can click the <strong>Start your free trial</strong> button on the home screen and sign up. The trial period is 7 days, after which you’ll move to the monthly £6.99/$6.99 subscription.</p>\n\nApple TV</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8c3499a268a9b3f9295a1c9b5991649aa771d760de3f41d9a59966e05eac72c8","category":"Apple"}