{"title":"Aetiology, Clinical Profiles, Laboratory Parameters, Radiological Findings and Clinical Outcomes in Patients Admitted with Acute Encephalitis Syndrome in a Tertiary Care Center During 2023 in Myanmar","link":"https://www.preprints.org/manuscript/202409.1235/v1","date":1726546632000,"content":"Background/Objectives: Diagnosis of encephalitis is a challenging problem due to the heteroge-neity of clinical presentations and the myriad of aetiology. The objective was to determine the ae-tiology, clinical features, laboratory parameters, radiological findings and in-hospital outcome of acute encephalitis syndrome (AES) cases in Myanmar. Methods: A prospective analytic study was conducted at Neuromedical Ward of Yangon General Hospital during March to August 2023. 81 AES cases were enrolled and cerebrospinal fluids (CSF) samples were collected. Qiastat ME Panelwas used to detect viral, bacterial and fungal pathogens. Results: 17 out of 81 (21%) cases were non-encephalitis with alternative definite diagnosis. Among the remaining 64 enceph-alitis cases, the exact infectious and immune aetiologies were identified in 31/64 (48.4%); 26/31 cases (83.9%) were infectious causes and 5/31 patients (16.1%) were immune encephalitis. Among the infection causes, six Herpes Simplex Virus-1, one bacteriologically confirmed and seven probable Mycobacterium tuberculosis, three Haemophilus influenzae, two Streptococcus pneumoniae, one Streptococcus pyogenes, one Varicella-Zoster Virus (Ramsay Hunt Syndrome with menin-goencephalitis), two Cryptococcus neoformans infected patients and rare causes such as Listeria monocytogenes, Burkholdelria cepacia, Sphingomonas paucimobilis and Aspergillus were identified. One case was dual infection with Haemophilus influenzae and Cryptococcus neformans. Abnormal protein levels and CSF pleocytosis were significantly higher among bacterial causes (P","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8c3ae372a65e5bdf28de4ed49722da64dac3049c58cd5b16855423ae4c0c5152","category":"Interdisciplinary"}