{"title":"Opinion: Team DSs should be directing riders, not driving cars","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/opinion-team-dss-should-be-directing-riders-not-driving-cars","date":1620937169000,"content":"\n      <p>A scene from the 2005 documentary Overcoming, shadowing Team CSC’s Tour de France campaign, features one scene where Bjarne Riis, behind the wheel of the team car, takes out Bobby Julich with a wing mirror by driving perilously close to his unfortunate charge while passing bottles out of the window.</p>\n<p>Bjarne, being Bjarne, immediately passes the blame onto the hapless victim of the drive-by clipping. It must be great to be so sure of yourself.</p>\n<div></div>\n<p>This is one of several scenes in the film relatable to the incident involving Deceuninck-Quick Step’s Pieter Serry, bumbling along up the final climb of San Giacomo, minding his own business, when the inattentive driver of a BikeExchange team car rammed him from behind. The occupant of the passenger seat was taking a rain jacket from an organisation car. Who knows what the driver was doing. Serry was understandably fuming.</p>\n<p>A directeur sportif – whilst also driving a motor vehicle, lest we forget – hands out bottles, talks to riders on the radio, answers the phone, eats lunch, chats to other DSs on pacts and tactics, buys stock and shares [you made that last one up – Ed], and a myriad of other tasks while (and this bears repeating), behind the wheel of a car.</p>\n<p>In no other sector of society is this acceptable behaviour and yet, in bike racing, because it has always been this way, it carries on unabated.</p>\n<p>I was reminded of being in Spain years ago with the boss of one team at the wheel of the car, his team time trial squad strung out in line behind the bumper. He was texting while driving, alarming enough in its own right, but it got better. When he decided, totally unannounced, to throw a 180 and retrace the route, it was only by grabbing our photographer’s legs that I stopped him launching out of the car window. As for the riders, screeching and swerving all over the road, what are they going to do? It’s the boss. How we laughed...</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\"><strong><em>Giro d'Italia 2021 Guide</em></strong></a></p>\n<p>These DSs are not superhuman, multi-tasking gods, whatever they may think. They are exactly the same as you and I. Many of them raced bikes very well back in the day, but this does not qualify them to drive a vehicle and perform five other jobs in tandem.</p>\n<p>Get them out of the driving seats. Put their front seat co-pilots in place instead. For all the talk of rider safety when it comes to street furniture, courses and riding positions, this is one area that is long overdue a major overhaul.</p>\n<p>A directeur sportif should be doing exactly that – directing their racers. No more, no less.</p>\n<p><i>﻿N.B. Use of mobile phones in the race convoy whilst driving, including hands-free, was tackled by the UCI guidelines in 2017, including recommending no TV screens in the front seats of team cars. </i></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8c3d69e09ffce53ef2590e03358905192726dd41a25f76e8f867736967343e56","category":"Cycling"}