{"title":"The waiting game: Pogačar continues domination with perfectly poised Flèche Wallonne performance","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-pogacar-wins-fleche-wallonne","date":1681982955000,"content":"\n      \n<p>Yet another Tadej Pogačar victory might have seemed like an inevitability at<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-fleche-wallonne-preview-2023-route-predictions-and-contenders\"> La Flèche Wallonne</a>, and surely nobody was surprised when he launched his sprint towards the top of the Mur de Huy to defeat Mattias Skjelmose (Trek-Segafredo) and Mikel Landa (Bahrain-Victorious) for the win. But this one was far from the foregone conclusion, and possibly the most complicated of his 12 victories this season so far. </p>\n<div></div>\n<p><span>For all his brilliance since turning professional in 2019, Flèche Wallonne is a race that he had never quite figured out. As we know from the last 19 editions of the race, all of which have been decided by a large uphill group sprint, this Classic is all about who can sprint up the Mur de Huy the quickest — and compared to most other disciplines in cycling, punchy sprints up especially steep climbs like this isn’t something Pogačar is necessarily superior at. </span></p>\n<p><span>That’s reflected in his relatively poor career record at Flèche Wallonne. In fact, were we to have discounted form, and consider only past finishes at this particular classic, the UAE Team Emirates rider would not have been among the top favourites for victory.</span></p>\n<p><span>He was 53rd on debut in 2019, which, though he was far from being the Pogačar we all know and fear today, was still the lowest finish of any Classic he attempted that season. By the following year he had enough of a reputation to be counted among the top favourites, and he rode like one, too, gluing himself to the sought-after wheel of Marc Hirschi. But by doing so he pushed himself too deep into the red, and by the line he had faded into ninth.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-01950.jpg?v=1681977754\" alt />Far from learning his lesson, Pogačar suffered a similar fate during his next appearance two years later in 2022. This time he was fourth in line towards the top of the climb, and seemingly well poised to make a bid for victory, but instead suddenly ran out of gas, losing the wheel of the rider in front of him, and being passed by no less than eight riders within just a few hundred metres to finish 12th. Whereas his previous result could arguably be put down to a lack of form, there could be no such explanation this time, having in recent weeks won <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/strade-bianche-everything-you-need-to-know\">Strade Bianche</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a> and made the top five at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/milan-san-remo-2023-everything-you-need-to-know\">Milan-Sanremo</a>. Perhaps this was a race and a climb that he simply wasn’t suited to?</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/years-in-the-making-demi-vollering-reigns-as-queen-of-the-huy-at-fleche-wallonne\"><em><strong>Read more: Demi Vollering reigns as Queen of the Mur at Flèche Wallonne Femmes</strong></em></a></p>\n<p><span>What we’re quickly learning this year is that there doesn’t seem to be any race that Pogačar isn’t suited to, and any doubts that Flèche Wallonne might be an exception were definitively put to bed with his win. As it happens, he made his race-winning acceleration from the wheel of Romain Bardet (DSM) at around the same stretch of road he had cracked at in his previous two attempts. Whatever caused him to blow up at this moment previously evidently did not affect him this time. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-05673.jpg?v=1681977654\" alt /></span>Prior to the race, there was speculation as to how Pogačar would try to win it. If ever there was to be a deviation from the normal formula of Flèche Wallonne being decided by a final climactic sprint up the Mur de Huy, you sense it would be this year given how the spring campaign has unfolded so far. Early attacks have been in vogue: Tom Pidcock (Ineos Grenadiers) made his first attack from 45km out to win Strade Bianche; Mathieu van der Poel’s winning selection of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> was made prior to the Arenberg forest; and Pogačar himself has been responsible for two of the most spectacular long-range victories, making the first of his many attacks at the Tour of Flanders over 50km from the finish, and winning <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\">Amstel Gold</a> with an attack on the Keutenberg, and earlier and less expected climb than the familiar launchpad of the Cauberg. </p>\n<p><span>While it remained unclear when he would make a move, Pogačar did reveal early on what kind of race he wanted when his UAE Team Emirates teammates were put to the front of the race to set a fast tempo. He desired a hard race, one in which his rivals would not be fresh for the finale, and long, hard turns from the likes of Diego Ulissi and Marc Hirschi ensured the team remained on the front for virtually the entire race. When each climb came and went without an attack from him, it also became apparent that his team was setting this tempo to help ensure that no other riders were able to gain much of an advantage from attacking, and that he was backing himself for a Mur de Huy spirit. </span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/gallery-its-a-block-party-on-the-mur-de-huy\"><em><strong>Read more: It's a block party on the Mur de Huy</strong></em></a></p>\n<p><span>The tactic worked. There was some alarm when outside contender Søren Kragh Andersen (Alpecin-Deceuninck) managed to get himself into the day’s eight-rider break, especially as he pressed on until it was just him and Georg Zimmermann (Intermarché-Circus-Wanty) left. But they were kept on a leash by the UAE Team Emirates-led peloton, and the attacks that did come from the peloton never featured riders they were especially worried about. Samuele Battistella (Astana Qazaqstan) went clear on the penultimate ascent of Mur de Huy, and after being joined by Louis Vervaeke (Soudal-Quick-Step), bridged up to Andersen and Zimmerman to form a leading quartet. But the group didn’t have the firepower to truly threaten Pogačar and co in the peloton, and the last survivor of the four, Vervaeke, was brought back on the lower slopes of the Mur de Huy.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-01727.jpg?v=1681977622\" alt /></span>With Pogačar in this kind of form, finishing second behind him feels like a sort of victory, in which sense Matthias Skjelmose deserves special praise for his performance. The 22-year-old Dane impressed at <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/itzulia-basque-country-2023-preview-route-predictions-and-contenders\">Itzulia Basque Country</a> with several high placings, and has shown an all-round ability to perform well on various different kinds of terrain. Based on this result, steep uphill sprints may be the niche he excels most at. </p>\n<p><span>Mikel Landa also continued what has been a very strong spring so far with third-place, and seems to have developed a newfound penchant for one-day races following his podium finish at Il Lombardia. Michael Woods (Israel-Premier Tech) rode assertively on a climb he is so confident on, and, though he had no answer to when Pogačar attacked from beside him, still earned a fourth successive top six finish with fourth-place at the line. And what might have been had Romain Bardet managed to find a gap when he launched a vicious acceleration on the Mur? He was crowded out and had to brake, which may have been why he ran out of steam and faded to ninth after another acceleration once he found some room. </span></p>\n<p>Try as they might, none could get especially close to Pogačar on the Mur de Huy, and will surely struggle to stop him again when they reconvene for <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège–Bastogne–Liège</a> on Sunday. But that race will pose a whole new problem for the Slovenian, in an opponent he has so far not had to come up against all year — defending champion, and world champion, Remo Evenepoel (Soudal-Quick-Step). If anyone can challenge Pogačar’s dominance, you sense it will be him, and their showdown promises to be one of the highlights of the season.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8c3d239355b0c27929487e56cd9a0783011032c9c1b8686671ece5fffcb9317e","category":"Cycling"}