{"title":"Detection of Mismatch Repair Deficiency in Endometrial Cancer: Comparison of IHC, Fragment Length Analysis, and Amplicon Sequencing Based MSI Testing","link":"https://www.preprints.org/manuscript/202410.0560/v1","date":1728387776000,"content":"Mismatch repair (MMR) deficiency can be indicative of Lynch syndrome (LS) and guide treatment with immune checkpoint inhibitors. Colorectal cancers (CRCs) and endometrial cancers (ECs) are routinely screened to identify LS, primarily using immunohistochemistry (IHC) or Microsatellite Instability (MSI) testing, but concordance between methods is variable in ECs. Here, we investigate this variability by using the amplicon sequencing based Newcastle MSI assay (NCL_MSI) to re-analyse 361 ECs from the Ohio OCCPI/OPTEC (n=196) and Manchester PETALS (n=165) trials. NCL_MSI was consistent with Ohio results (94% and 97% concordance with IHC and original MSI assays respectively), and increased concordance in the Manchester cohort from 78% to 86% (MSI) and 84% (IHC). Among discordant Manchester samples, NCL_MSI was significantly associated with MLH1 promoter methylation status (p=0.0028), and had the highest concordance with methylation, 62/69 samples (90%), indicating utility as a screening tool in this tumour type. However, tumours with germline MSH6 defects were only detected efficiently with IHC; 7/8 LS tumours classified as MSS by either MSI assay had isolated MSH6 loss, compared to 4/12 classified as MSI-H by both (p=0.028). Furthermore, reduced MSI signal was observed in tumours with isolated MSH6 loss (p=0.009 Ohio, p=6.2x10-5 Manchester), and in both ECs and CRCs with germline defects although this only reached significance in CRCs (p=0.002). These results provide further evidence that ECs with MSH6 loss in particular, and LS tumours in general, have an attenuated MSI signal, and supports current guidelines specifically recommending IHC for LS detection and immune checkpoint therapy assessment in EC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8c42a939624452980ca3fc08b49ceffe96182f3bc6d018d88eec3e82e9783b64","category":"Interdisciplinary"}