{"title":"Alternative during‐growth chlorination of sputtered CdTe films and their implementation as activating layers in CdS/CdTe solar cells","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300143?af=R","date":1709875171000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/88dc4fae-e42e-43d7-a498-fbdb4c595f78/appl202300143-gra-0001-m.png\" alt=\"Alternative during-growth chlorination of sputtered CdTe films and their implementation as activating layers in CdS/CdTe solar cells\" /><p>Illustration of the cell activation process in which chlorine atoms diffuse from the chlorinated CdTe layer to the adjacent active layers.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Cadmium telluride is an efficient light absorbing material successfully used in solar cell technology. The efficiency of such photovoltaic devices is strongly dependent on post-deposition thermal treatments in the presence of chlorine. The benefits of this process on the absorbing layer include removal of intragrain defects, grain growth enhancement, and grain boundaries passivation. The absorber chlorination is a crucial step for which CdCl<sub>2</sub> is the most common choice. Its use, however, has been overshadowed by the toxicity of Cd- and Cl-containing vapors and residues. In this work, chlorine was incorporated in CdTe films during growth using sputtering targets with different chloride compounds: CdCl<sub>2</sub>, TeCl<sub>4</sub>, BaCl<sub>2</sub>, CaCl<sub>2</sub>, or LiCl. After characterizing these films, CdTe:CdCl<sub>2</sub> and CdTe:TeCl<sub>4</sub> were selected as feasible absorbers for testing their performance in photovoltaic devices. Efficiencies near 7% were obtained in <i>as-grown</i> unoptimized cells in which the absorber consisted of two layers: pristine CdTe and CdTe:CdCl<sub>2</sub> or CdTe:TeCl<sub>4</sub>. The chlorinated layers acted as Cl sources for the adjacent CdTe and CdS, which produced a homogeneous distribution of chlorine throughout the cell. In the during-growth activating-layer (DG-AL) method used here, the chlorine diffusion during growth had a doping effect, passivated grain boundaries and defects, improved the back contact characteristics by reducing the CdTe work function, and lowered the pinhole formation probability by producing a compact chlorinated CdTe layer.</p>","author":"Abraham Israel Calderón‐Martínez, \nOmar Jiménez‐Sandoval, \nFrancisco Rodríguez‐Melgarejo, \nMartín Adelaido Hernández‐Landaverde, \nFrancisco Javier Flores‐Ruiz, \nSergio Joaquín Jiménez‐Sandoval","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"8c56d5417f480a929dc26fd7eba1b396c30ea92d5e4ef3b284ab6af158343d12","category":"Environment"}