{"title":"Rediscovery of the endangered giant pangolin (Smutsia gigantea) in Senegal after 24 years","link":"https://onlinelibrary.wiley.com/doi/10.1111/aje.13279?af=R","date":1715967489000,"content":"<h2>Abstract</h2>\n<p>Pangolins have generated great interest in recent years, largely due to the unprecedented scale of trafficking the species experiences. Detailed knowledge of pangolin distribution in West Africa is lacking, but many local extinctions are suspected. The last documented sighting of a giant pangolin in Senegal was in Niokolo-Koba National Park (NKNP) and dates back to 1999. Following a large camera-trap survey carried out in NKNP in 2023, we present photographic evidence that giant pangolins are still present in the park. Such rediscoveries not only underscore the importance of systematic biodiversity inventories, but also the critical value of West Africa's large protected areas.</p>\n<h2>Résumé</h2>\n<p>Les pangolins ont suscité un grand intérêt ces dernières années, en grande partie du fait de l'ampleur du commerce illégal auquel ils sont confrontés. Bien que nous manquions de connaissances détaillées sur la distribution des pangolins en Afrique de l'Ouest, de nombreuses extinctions locales sont soupçonnées. La dernière observation documentée d'un pangolin géant au Sénégal dans le Parc National du Niokolo-Koba (PNNK) remonte à 1999. A la suite d'une vaste étude par piégeage photographique menée dans le PNNK en 2023, nous présentons une preuve photographique que les pangolins géants sont toujours présents dans le parc. De telles redécouvertes soulignent non seulement l'importance des inventaires systématiques de la biodiversité, mais aussi la valeur critique des grandes aires protégées en Afrique de l'Ouest.</p>","author":"Mouhamadou Mody Ndiaye, \nMarine Drouilly, \nAbdoul Aziz Senghor, \nOusmane Thiaw, \nDaniel J. Ingram, \nMatthew H. Shirley, \nPaolo Strampelli, \nChele Martinez Marti, \nPhilipp Henschel","siteTitle":"Wiley: African Journal of Ecology: Table of Contents","siteHash":"0a8ec0da97c05188d45f40eaa6dd19ed9528e14fad92d29cce59e67ce4030364","entryHash":"8c5836f9b8ca7f2aa7ecce82ec890d3e83f2b7634b62e2caacfdde788d8050c4","category":"Environment"}