{"title":"Miocene Petit-Spot Basanitic Volcanoes on Cretaceous Alba Guyot (Magellan Seamount Trail, Pacific Ocean)","link":"https://www.preprints.org/manuscript/202408.1315/v1","date":1724062495000,"content":"New data obtained from core samples of two boreholes in Alba Guyot in the Magellan Seamount Trail (MST), Western Pacific, including 40Ar/39Ar age of basanite, mineralogy of basanite, tuff, tuffite, mantle-derived inclusions in basanite and tuff (lherzolite xenolith and Ol, Cpx, Opx xenocrysts), and calcareous nannofossils biostratigraphy, have implications for the guyot history. Volcanics in the upper part of the Alba Guyot main edifice and its Oma Vlinder satellite, at sea depths between 3600 and 2200 m, were deposited during the Cretaceous 112 to 86 Ma interval. In the following ~60 myr, the Alba Guyot became partly submerged, and denuded with the formation of a flat summit platform while the respective fragment of the Pacific Plate was moving to the Northern Hemisphere. Volcanic activity in the northeastern part of the guyot summit platform rejuvenated in the Miocene (24–15 Ma) and produced onshore basanitic volcanoes and layers of tuff in subaerial and tuffite in shallow-water near-shore conditions. In Middle-Late Miocene (10–6 Мa), after the guyot had submerged, carbonates containing calcareous nannofossils were deposited on the porous surfaces of tuff and tuffite. Precipitation of the Fe-Mn crust (Unit III) recommenced during the Pliocene-Pleistocene (&lt; 1.8 Mа) when the guyot summit reached favorable sea depths. The location of the MST guyots in the northwestern segment of the Pacific Plate near the Mariana Trench, along with the Miocene age and alkali-basaltic signatures of basanite, provide evidence for petit-spot volcanism on the Alba Guyot. This inference agrees with the geochemistry of Cenozoic petit-spot basaltic rocks from the Pacific and Miocene basanite on the Alba Guyot. The numerous volcanic cones reaching up to 750 m high and 5.1 km in base diameter, which were discovered on the Alba summit platform, provide the first evidence of voluminous Miocene petit-spot basanitic volcanism upon the Cretaceous guyots and seamounts of the Pacific.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8c5bc8cb42f7334be1bbf6010bc7dd08bfbecdf4051188e9bb0ab3f32c1b58fc","category":"Interdisciplinary"}