{"title":"Proximal microclimate: Moving beyond spatiotemporal resolution improves ecological predictions","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13884?af=R","date":1723695049000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>The scale of environmental data is often defined by their extent (spatial area, temporal duration) and resolution (grain size, temporal interval). Although describing climate data scale via these terms is appropriate for most meteorological applications, for ecology and biogeography, climate data of the same spatiotemporal resolution and extent may differ in their relevance to an organism. Here, we propose that climate proximity, or how well climate data represent the actual conditions that an organism is exposed to, is more important for ecological realism than the spatiotemporal resolution of the climate data.</p>\n<h2>Location</h2>\n<p>Temperature comparison in nine countries across four continents; ecological case studies in Alberta (Canada), Sabah (Malaysia) and North Carolina/Tennessee (USA).</p>\n<h2>Time Period</h2>\n<p>1960–2018.</p>\n<h2>Major Taxa Studied</h2>\n<p>Case studies with flies, mosquitoes and salamanders, but concepts relevant to all life on earth.</p>\n<h2>Methods</h2>\n<p>We compare the accuracy of two macroclimate data sources (ERA5 and WorldClim) and a novel microclimate model (<i>microclimf</i>) in predicting soil temperatures. We then use ERA5, WorldClim and <i>microclimf</i> to drive ecological models in three case studies: temporal (fly phenology), spatial (mosquito thermal suitability) and spatiotemporal (salamander range shifts) ecological responses.</p>\n<h2>Results</h2>\n<p>For predicting soil temperatures, <i>microclimf</i> had 24.9% and 16.4% lower absolute bias than ERA5 and WorldClim respectively. Across the case studies, we find that increasing proximity (from macroclimate to microclimate) yields a 247% improvement in performance of ecological models on average, compared to 18% and 9% improvements from increasing spatial resolution 20-fold, and temporal resolution 30-fold respectively.</p>\n<h2>Main Conclusions</h2>\n<p>We propose that increasing climate proximity, even if at the sacrifice of finer climate spatiotemporal resolution, may improve ecological predictions. We emphasize biophysically informed approaches, rather than generic formulations, when quantifying ecoclimatic relationships. Redefining the scale of climate through the lens of the organism itself helps reveal mechanisms underlying how climate shapes ecological systems.</p>","author":"David H. Klinges, \nJ. Alex Baecher, \nJonas J. Lembrechts, \nIlya M. D. Maclean, \nJonathan Lenoir, \nCaroline Greiser, \nMichael Ashcroft, \nLuke J. Evans, \nMichael R. Kearney, \nJuha Aalto, \nIsabel C. Barrio, \nPieter De Frenne, \nJoannès Guillemot, \nKristoffer Hylander, \nTommaso Jucker, \nMartin Kopecký, \nMiska Luoto, \nMartin Macek, \nIvan Nijs, \nJosef Urban, \nLiesbeth van den Brink, \nPieter Vangansbeke, \nJonathan Von Oppen, \nJan Wild, \nJulia Boike, \nRafaella Canessa, \nMarcelo Nosetto, \nAlexey Rubtsov, \nJhonatan Sallo‐Bravo, \nBrett R. Scheffers","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"8c6670e1623658dcab3c84c35782940233aa14fca54989262b12f0441f1a5c23","category":"Environment"}