{"title":"US warns China over state-sponsored hacking, citing mass attacks on Exchange","link":"https://arstechnica.com/?p=1781358","date":1626721365000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-us-china-flags-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/getty-us-china-flags.jpg\">Enlarge</a> (credit: Getty Images | cbarnesphotography)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US government blamed the Chinese government on Monday for attacks on thousands of Microsoft Exchange servers.</p>\n<p>China's Ministry of State Security (MSS) \"has fostered an ecosystem of criminal contract hackers who carry out both state-sponsored activities and cybercrime for their own financial gain,\" US Secretary of State Antony Blinken said in a <a href=\"https://www.state.gov/responding-to-the-prcs-destabilizing-and-irresponsible-behavior-in-cyberspace/\">statement</a> that blamed the MSS for the Microsoft Exchange hacks. The US government and its allies \"formally confirmed that cyber actors affiliated with the MSS exploited vulnerabilities in Microsoft Exchange Server in a massive cyber espionage operation that indiscriminately compromised thousands of computers and networks, mostly belonging to private sector victims,\" Blinken said.</p>\n<p>Blinken's statement was released alongside a <a href=\"https://www.justice.gov/opa/pr/four-chinese-nationals-working-ministry-state-security-charged-global-computer-intrusion\">Justice Department announcement</a> that three MSS officers and one other Chinese national were indicted by a federal grand jury on charges related to a different series of hacks into the \"computer systems of dozens of victim companies, universities, and government entities in the United States and abroad between 2011 and 2018.\" Blinken said that the US \"and countries around the world are holding the People's Republic of China (PRC) accountable for its pattern of irresponsible, disruptive, and destabilizing behavior in cyberspace, which poses a major threat to our economic and national security.\"</p></div><p><a href=\"https://arstechnica.com/?p=1781358#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781358&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8c6a9a0446a255152eb1efbe792426a53aecb5a3968e63a27e8fadf09ed20b31","category":"Tech"}