{"title":"Efficient lung cancer detection using computational intelligence and ensemble learning","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310882","date":1727445600000,"content":"<p>by Richa Jain, Parminder Singh, Mohamed Abdelkader, Wadii Boulila</p>\r\n\r\nLung cancer emerges as a major factor in cancer-related fatalities in the current generation, and it is predicted to continue having a long-term impact. Detecting symptoms early becomes crucial for effective treatment, underscoring innovative therapy’s necessity. Many researchers have conducted extensive work in this area, yet challenges such as high false-positive rates and achieving high accuracy in detection continue to complicate accurate diagnosis. In this research, we aim to develop an ecologically considerate lung cancer therapy prototype model that maximizes resource utilization by leveraging recent advancements in computational intelligence. We also propose an Internet of Medical Things (IoMT)-based, consumer-focused integrated framework to implement the suggested approach, providing patients with appropriate care. Our proposed method employs Logistic Regression, MLP Classifier, Gaussian NB Classifier, and Intelligent Feature Selection using K-Means and Fuzzy Logic to enhance detection procedures in lung cancer dataset. Additionally, ensemble learning is incorporated through a voting classifier. The proposed model’s effectiveness is improved through hyperparameter tuning via grid search. The proposed model’s performance is demonstrated through comparative analysis with existing NB, J48, and SVM approaches, achieving a 98.50% accuracy rate. The efficiency gains from this approach have the potential to save a significant amount of time and cost. This study underscores the potential of computational intelligence and IoMT in developing effective, resource-efficient lung cancer therapies.","author":"Richa Jain","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8c72521ec0d722cc0dccb837012fcc59bc40977ebf0979c45658112ea75c66f8","category":"Interdisciplinary"}