{"title":"Social Media Influencers: Customer Attitudes and Impact on Purchase Behaviour","link":"https://www.preprints.org/manuscript/202405.1131/v1","date":1715953874000,"content":"The aim of this study is to investigate and determine the key factors guiding customer attitudes towards social media influencers, and on that base to explore their effects on purchase intentions towards advertised products or services. A total of 376 fulfilled questionnaires from an online survey were analysed. The main characteristics of digital influencers’ behaviour, affecting consumer perceptions have been systematized and categorized through a combination of both traditional and advanced data analysis methods. Structural Equation Modelling (SEM), machine learning and multi-criteria decision-making (MCDM) methods were selected to uncover the hidden dependencies between variables from the perspective of social media users. The developed models elucidate the underlying relationships that shape the acceptance mechanism of influencers’ messages. The results obtained provide specific recommendations for stakeholders across the social media marketing value chain. Marketers can make informed decisions and optimize influencer marketing strategies to enhance user experience and increase conversion rates. Working collaboratively, marketers and influencers can create impactful and successful marketing campaigns that resonate with the target audience and drive meaningful results. Customers benefit from more tailored and engaging influencer content that aligns with their interests and preferences, fostering a stronger connection with brands and potentially affecting their purchase decisions. As the perception of customer satisfaction is individual and evolving process, stakeholders should organize regular evaluations of influencer marketing data and explore the possibilities to ensure continuous improvement of this e-marketing channel.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8c7bee4c77fe653deca9cbe977663032c5395bb669e7d2374489321bfc4ea9b6","category":"Interdisciplinary"}