{"title":"La Vuelta a España 2021 Stage 5 Preview - Sprint or Echelons?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-5-preview-sprint-or-echelons","date":1629210385000,"content":"\n      <p><span>With just 640 metres of climbing, stage 5 is one of the flattest of the race. The pure sprinters would have had this one earmarked from the beginning, expecting to battle for stage victory in Albacete. However, depending on wind conditions, the riders could be exposed to strong winds, meaning we could see the formation of echelons throughout the stage.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\"><b><i>Vuelta 2021 Guide</i></b></a></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-5_1024x1024.png?v=1629198920\" />Stage 5 profile</span></i></p>\n<p><span>The Vuelta departs from Tarancón and the riders will head in a southeasterly direction towards Albacete. After the breakaway escapes early, the sprinters teams — namely Groupama-FDJ, Alpecin-Fenix and Deceuninck-Quick Step — will be forced to control the gap.</span></p>\n<p><span>An intermediate sprint occurs at kilometre 132, also offering bonus seconds to the first three riders. With over 53km still to go at this sprint point, the breakaway will likely sweep these up.</span></p>\n<p><span>The race passes through Barrax with just over 30km remaining. Afterwards, there is a long, straight road which carries the riders to Albacete. If the wind picks up here, the GC teams must stay </span><span>vigilant</span> so their leaders aren't caught out.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/echelons-putting-it-in-the-gutter\"><em><strong>Related – Echelons: Putting it in the gutter</strong></em></a></p>\n<p><span>With 2.4km remaining, there is a key left-hand turn where there will be a mass rush for position. The next obstacle is a roundabout with 1.5km remaining. Just after passing under the </span><i><span>flamme rouge</span></i><span>, the final right-hand corner arrives. It’s not particularly sharp, but exiting this corner in a good position will be critical. </span>The sprinters must rely on their lead out trains to place them towards the front without spending excess energy. </p>\n<p><span>We must consider the potential for crosswinds throughout the stage. This area of Spain is susceptible to strong gusts, and with long, straight, flat roads defining the stage, the riders will be exposed if the winds arrive. However, the forecast doesn’t suggest any excessive wind throughout the stage, so echelons, if they form, may not be particularly decisive. Nonetheless, all the GC teams will be on red alert to stay in position at all times.</span></p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1334454687-min_1024x1024.jpg?v=1629198943\" />Jasper Philipsen in the green jersey (Image credit: Stuart Franklin/Getty Images)</span></i></p>\n<p><span>After winning stage 2 with an emphatic sprint, </span><b>Jasper Philipsen</b><span> begins stage 5 as one of the favourites. The Belgian rider came so close to victory at the Tour de France, but had to wait for La Vuelta before winning at a Grand Tour in 2021. With the help of Alexander Krieger and Sacha Modolo, Philipsen can expect to be in a primary position in the final kilometre. If he can time his effort perfectly again, he’ll be difficult to beat.</span></p>\n<p><span>After storming to victory in <span>Molina de Aragón, <b>Fabio Jakobsen</b> is winning at the top level of pro cycling once more. The Dutchman </span></span><span> has recovered from his horrendous crash at the Tour of Poland last year to start his first Grand Tour since the 2019 Vuelta a España. He won two sprint stages that year, a</span><span>nd after picking up the third Grand Tour victory of his career, </span><span>he has every chance of adding to that success.</span></p>\n<p><b>Arnaud Démare</b><span> was in electric form throughout the 2020 season, accumulating 14 victories including four at the Giro d’Italia. However, he has been unable to match that form this year, recording eight victories so far but none at WorldTour level. Démare was unable to make an impression on stage 2 — he was poorly <span>positioned</span> in the final kilometre and never made a full effort. He was better placed on stage 4, but lost out to Jakobsen. </span>Can he and Groupama-FDJ turn the tide?</p>\n<p><b>Juan Sebastián Molano</b><span> sprinted to fourth on stage 2 in Burgos to match his best finish at a Grand Tour. Molano launched early, exposing himself to the wind while eventual stage winner Jasper Philipsen could shelter in his slipstream. Nonetheless, Molano has great legs at present, proven by his two stage victories at the Vuelta a Burgos earlier this month. Matteo Trentin was his leadout man on stage 2 — his Classics experience will be pivotal if echelons occur.</span></p>\n<p><b>Piet Allegeart </b><span>and</span><b> Florian Vermeersch</b><span> both sneaked inside the top ten on stage 2, so clearly possess a reasonable kick in a mass sprint finish. They are both capable Classics riders too, so will be confident of dealing with any potential echelons. Other sprinters to keep an eye on include </span><b>Jon Aberasturi, Martin Laas, </b><strong>Alberto Dainese</strong><b> </b>and<b> Alex Aranburu</b><span>.</span></p>\n<p><span><span>Every rider vying for the red jersey must be attentive </span>in case the wind picks up and causes echelons to form. Of the GC riders, </span><b>Egan Bernal</b><span> has proven to be one of the most adept in crosswinds. He tackled them confidently at Paris-Nice in 2019, and was comfortable on stage 7 of the Tour de France last year. The Ineos Grenadiers took control in the crosswinds that day, forcing </span>Tadej Pogačar <span>and Mikel Landa to lose over one minute.</span></p>\n<h4><b>Prediction</b></h4>\n<p><span>After a year of recovery, Fabio Jakobsen is back to winning ways at Grand Tours.</span><span> </span>Deceuninck usually boss the crosswinds, and with Classics specialists Florian Sénéchal and Zdeněk Štybar on his side, he won’t be overly worried about the possibility of echelons. Fabio Jakobsen is our pick to win stage 5 of La Vuelta a España 2021.</p>\n<p><i><span>Cover image: <span>Charly López</span><span> / ASO</span></span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8c86a406dfb031cadc3debcd1307a4dc36549affe55088b46eadc3e839c3c0b2","category":"Cycling"}