{"title":"Clinical challenges of biomechanical performance of narrow-diameter implants in maxillary posterior teeth in aging patients: A finite element analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299816","date":1711375200000,"content":"<p>by Saranyoo Prasitwuttisak, Nattapon Chantarapanich, Komsan Apinyauppatham, Kopchai Poomparnich, Samroeng Inglam</p>\r\n\r\nThis study evaluated the biomechanical performance of narrow-diameter implant (NDI) treatment in atrophic maxillary posterior teeth in aging patients by finite element analysis. The upper left posterior bone segment with first and second premolar teeth missing obtained from a patient’s cone beam computed tomography data was simulated with cortical bone thicknesses of 0.5 and 1.0 mm. Three model groups were analyzed. The Regimen group had NDIs of 3.3 × 10 mm in length with non-splinted crowns. Experimental-1 group had NDIs of 3.0 × 10 mm in length with non-splinted crowns and Experimental-2 group had NDIs of 3.0 × 10 mm in length with splinted crowns. The applied load was 56.9 N in three directions: axial (along the implant axis), oblique at 30° (30° to the bucco-palatal plane compared to the vertical axis of the tooth), and lateral load at 90° (90° in the bucco-palatal plane compared to the vertical axis of the tooth). The results of the von Mises stress on the implant fixture, the elastic strain, and principal value of stress on the crestal marginal bone were analyzed. The axial load direction was comparable in the von Mises stress values in all groups, which indicated it was not necessary to use splinted crowns. The elastic strain values in the axial and oblique directions were within the limits of Frost’s mechanostat theory. The principal value of stress in all groups were under the threshold of the compressive stress and tensile strength of cortical bone. In the oblique and lateral directions, the splinted crown showed better results for both the von Mises stress, elastic strain, and principal value of stress than the non-splinted crown. In conclusion, category 2 NDIs can be used in the upper premolar region of aging patients in the case of insufficient bone for category 3 NDI restorations.","author":"Saranyoo Prasitwuttisak","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8c8c36867819b84471f05715bcd7dbb13562155ad796d9772b1724b7c205dde1","category":"Interdisciplinary"}