{"title":"Matt Levine on SVB: ‘Startup Bank Had a Startup Bank Run’","link":"https://www.bloomberg.com/opinion/articles/2023-03-10/startup-bank-had-a-startup-bank-run","date":1678565705000,"content":"\n<p>Matt Levine, unsurprisingly, wrote a great column on Silicon Valley Bank’s collapse. He predicts the FDIC will succeed in finding a bigger buyer to buy SVB and make all depositors whole — both because SVB should still be worth enough to buy at such a price, and because otherwise, the results could be catastrophic industry-wide:</p>\n\n<blockquote>\n  <p>I would also guess — not investing or banking advice! — that\nthe answer will also turn out to be higher than $188 billion,\nwhich is the total amount of deposits plus FHLB advances. I say\nthis not because I have done a detailed analysis of SVB’s assets\nbut because it seems bad for the FDIC to wind up a big\nhigh-profile bank in a way that causes significant losses for\ndepositors, including uninsured depositors. There was a run on\nSVB in part because there hasn’t been a big bank run in a while,\nand people — venture capitalists, startups — were naturally\nworried that they might lose their deposits if their bank failed.\nThen the bank failed.</p>\n\n<p>If it turns out to be true that they lose their deposits, there\ncould be more bank runs: Lots of businesses keep uninsured\ndeposits at lots of banks, and if the moral of SVB is “your\nuninsured transaction-banking deposits can vanish overnight” then\nthose businesses will do a lot more credit analysis, move their\nmoney out of weaker banks, and put it at, like, JPMorgan. This\ncould be self-fulfillingly bad for a lot of weaker banks. My\nassumption is that the FDIC, the Federal Reserve, and the banks\nwho are looking at buying SVB all really don’t want that. If you\nare a bank looking at buying SVB, and you do a detailed analysis\nof its assets and conclude that they are worth $180 billion, and\nyou come to the FDIC and say “I will take over this bank and pay\nthe uninsured depositors 95 cents on the dollar,” the FDIC is\ngoing to look at you and say “don’t you mean 100 cents on the\ndollar,” and you are going to say “oh right yes of course, silly\nme, 100 cents on the dollar.”</p>\n\n<p>Maybe I’m wrong about that, but if I am it’ll be bad!</p>\n</blockquote>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/11/levine-svb\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"8c8e417350d8889fff72790dd411f17e606afd51bbb4a465b11b844777a18af2","category":"Tech"}