{"title":"Stiletsi & the White Crane: Oregon Timber Trail’s Newest Tier Loop – Gabe Tiller","link":"https://theradavist.com/2021/09/stiletsi-the-white-crane-oregon-timber-trails-newest-tier-loop/?utm_source=rss&utm_medium=rss&utm_campaign=stiletsi-the-white-crane-oregon-timber-trails-newest-tier-loop","date":1631793610000,"content":"<p>In the early 1840s, John C. Fremont undertook several exploration missions for the U.S. government. The Oregon Territory was disputed and claimed by both the United Kingdom and the U.S.A. Just to the south, California was still a part of Mexico. Fremont’s mission was to assess the American West and determine how well it was defended by these other nations. Of course, all this land was already—and still is—Indigenous land.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/Stiletsi-White-Crane-Radavist-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Fremont relied heavily on native guides to help him through the rugged Oregon country in the winter of 1842. While The Dalles was an established European outpost, and a bustling Indigenous city for at least 9,000 years before that, the land to the south was unknown to European American explorers. Stiletsi and the White Crane were two native chiefs that brought Fremont’s expedition through the Dufur Hill Country, Tygh Valley, and what is now the Confederated Tribes of the Warm Springs Reservation.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/Stiletsi-White-Crane-Radavist-23.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><a href=\"https://oregontimbertrail.org/stiletsi-and-the-white-crane-hood-tier-gorge-loop\" target=\"_blank\">Oregon Timber Trail’s Stiletsi and the White Crane</a> bikepacking route loosely follows the Wasco and Wishram trade route that Stiletsi and the White Crane guided Fremont’s expedition along. What was it like to pass through this living landscape on horseback 150 years ago? Or on foot thousands of years in the past?</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/09/Stiletsi-White-Crane-Radavist-32.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Stiletsi &amp; the White Crane links the golden hills and scrub oak savannah of Dufur’s Hill Country to the high elevation larches on Mt. Hood’s southern shoulder. Then you descend into the bustling fruit-laden Hood River Valley, climb to tranquil forested lakes, and finish your journey back to The Dalles along the stunning Columbia River Gorge. It’s a big, ambitious route but one that you won’t soon forget.</p>\n<p></p>\n<p>See more information on the Stiletsi &amp; the White Crane route at the <a href=\"https://oregontimbertrail.org/stiletsi-and-the-white-crane-hood-tier-gorge-loop\" target=\"_blank\">Oregon Timber Trail</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"8c95a4932cf55f0186428b405e35d0e92a4f9c1fe397c74a0b5459ee89c2e07f","category":"Cycling"}