{"title":"Epidermal growth factor receptor (EGFR) and vascular endothelial growth factor A (VEGF-A) expressions in Ethiopian female breast cancer and their association with histopathologic features","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308411","date":1729000800000,"content":"<p>by Sisay Addisu, Abebe Bekele, Daniel Seifu, Mathewos Assefa, Tufa Gemechu, Mark J. Hoenerhoff, Sofia D. Merajver</p>\r\nBackground <p>Epidermal growth factor receptor (EGFR) and vascular endothelial growth factor receptor (VEGF) play important role in breast tumor growth, invasion, metastasis, patient survival and drug resistance. The aim of this study was to evaluate the protein expression status of EGFR and VEGF-A, as well as their association with hormone receptor status and histopathological characteristics in the invasive type of female breast cancer among Ethiopians.</p> Method <p>The primary breast tumor tissues were obtained from 85 Ethiopian invasive breast cancer cases that underwent modified radical mastectomy (MRM) from June 2014 to June 2015. Their FFPE blocks were analyzed for EGFR and VEGF protein expressions using immunohistochemical techniques. The expressions were also correlated with histopathologic features.</p> Result <p>Epidermal growth factor receptor over-expression was observed in 22% of the tumor samples. VEGF-A expression was negative in 13.41%, low in 63.41%, moderate in 20.73%, and high in 2.44%. EGFR expression, but not VEGF-A, showed a significant inverse correlation with both estrogen receptor (ER) (<i>P</i> = 0.01) and progesterone receptor (PR) statuses (<i>P</i> = 0.04). EGFR and VEGF expressions did not show significant association with tumor size, grade, lymph node status or age at diagnosis.</p> Conclusion <p>Epidermal growth factor receptor expression was most likely associated with ER and PR negative tumors. Assessments of multiple molecular markers aid to understand the biological behavior of the disease in Ethiopian population. It might also help to predict which group of patients might get more benefit from the selected treatment strategies and which are not.</p>","author":"Sisay Addisu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8caa165036cf0e7a8532c3a52c878f89a342b76bcf1ad8c76610e69a306627e8","category":"Interdisciplinary"}