{"title":"New offer gives Ubisoft, not Microsoft, control of Activision game-streaming rights","link":"https://arstechnica.com/?p=1962153","date":1692714335000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/ubiplus-800x450.jpeg\" alt=\"Ubisoft could be the new home to Activision's streaming catalog under a new proposal from Microsoft.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/ubiplus.jpeg\">Enlarge</a> <span>/</span> Ubisoft could be the new home to Activision's streaming catalog under a new proposal from Microsoft. (credit: Ubisoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>In a major restructuring of <a href=\"https://arstechnica.com/gaming/2022/01/microsoft-set-to-purchase-activision-blizzard-in-68-7-billion-deal/\">its long-proposed acquisition plans for Activision Blizzard</a>, Microsoft has announced that the cloud-streaming rights for current and future Activision titles will be controlled by Ubisoft rather than Microsoft itself. The move is an effort to ameliorate concerns from UK regulators who <a href=\"https://arstechnica.com/gaming/2023/04/uk-government-blocks-microsofts-proposed-activision-purchase/\">blocked the proposed acquisition in April</a> over potential impacts on competition in the cloud-gaming space.</p>\n<p>The newly proposed deal covers perpetual, worldwide streaming rights for all current Activision games and those released in the next 15 years, according to <a href=\"https://blogs.microsoft.com/on-the-issues/2023/08/21/microsoft-activision-restructure-acquisition/\">an announcement</a> from Microsoft Vice Chair President Brad Smith. Ubisoft will have exclusive control of those streaming rights outside of the European Union, allowing the company to make those games available <a href=\"https://store.ubisoft.com/fr/ubisoftplus\">on its own Ubisoft+ service</a> and to license them out to other cloud-gaming providers (including Microsoft itself). In the EU, Microsoft will pay to license those Activision streaming rights back from Ubisoft to <a href=\"https://arstechnica.com/gaming/2023/05/microsofts-purchase-of-activision-gets-the-ok-from-the-eu/\">satisfy promises made to the European Commission</a> regarding free licensing to competing cloud-gaming providers.</p>\n<p>In a statement provided to Ars Technica, Ubisoft said the deal would allow Activision titles to be offered via Ubisoft+ Multi Access on PC, Xbox, and Amazon Luna, as well as via <a href=\"https://www.ubisoft.com/en-us/help/purchases-and-rewards/article/information-about-ubisoft-classics-on-playstation/000102598\">Ubisoft+ Classics on PlayStation</a>. \"Today’s deal will give players even more opportunities to access and enjoy some of the biggest brands in gaming,\" said Chris Early, Ubisoft SVP of Strategic Partnerships and Business Development, in the statement.</p></div><p><a href=\"https://arstechnica.com/?p=1962153#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1962153&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8cb146bbb01cd5fa79fb848a7f1d9e4edf97b102e8592e72fb224ce5e11b03f3","category":"Tech"}