{"title":"Region of interest determination algorithm of lensless calcium imaging datasets","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308573","date":1726581600000,"content":"<p>by Virgil Christian Garcia Castillo, Latiful Akbar, Ronnakorn Siwadamrongpong, Yasumi Ohta, Mamiko Kawahara, Yoshinori Sunaga, Hironari Takehara, Hiroyuki Tashiro, Kiyotaka Sasagawa, Jun Ohta</p>\r\n\r\nAdvances in fluorescence imaging technology have been crucial to the progress of neuroscience. Whether it was specific expression of indicator proteins, detection of neurotransmitters, or miniaturization of fluorescence microscopes, fluorescence imaging has improved upon electrophysiology, the gold standard for monitoring brain activity, and enabled novel methods to sense activity in the brain. Hence, we developed a lightweight and compact implantable CMOS-based lensless Ca<sup>2+</sup> imaging device for freely moving transgenic G-CaMP mouse experiments. However, without a lens system, determination of regions of interest (ROI) has proven challenging. Localization of fluorescence activity and separation of signal from noise are difficult. In this study, we report an ROI selection method using a series of adaptive binarizations with a gaussian method and morphological image processing. The parameters for each operation such as the kernel size, sigma and footprint size were optimized. We then validated the utility of the algorithm with simulated data and freely moving nociception experiments using the lensless devices. The device was implanted in the dorsal raphe nucleus to observe pain-related brain activity following a formalin test to stimulate pain. We observed significant increases in fluorescence activity after formalin injection compared to the control group when using the ROI determination algorithm.","author":"Virgil Christian Garcia Castillo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8cc699db0e2657374d2b24d9c4a7e58008fa278af37250f536f854e69ee98bb1","category":"Interdisciplinary"}