{"title":"New Specialized Turbo Levo SL II increases power and torque to make climbing less of a chore","link":"https://www.bikeradar.com/news/2023-specialized-turbo-levo-sl-ii/","date":1683216007000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Specialized-Turbo-Levo-SL-II-S-Works-68596e8.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Specialized Turbo Levo SL II S-Works\" title=\"Specialized Turbo Levo SL II S-Works\" />                                            <p>The latest Turbo Levo SL II electric mountain bike from Specialized has undergone some major updates.</p>\n<p>The frame has been redesigned to remove its sidearm, while also offering more geometry adjustability and being incorporated into the S-sizing system.</p>\n<p>In addition, the bike boasts 150mm of <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-much-suspension-travel-do-i-need-on-my-mountain-bike/\">rear-wheel travel</a> and a 160mm-travel fork. It comes equipped with mixed-wheel sizes as standard.</p>\n<p>The Turbo Levo SL II now features a new motor – the Turbo SL 1.2 – which is claimed to deliver 33 per cent more power and 43 per cent more torque compared to the previous SL 1.1 motor.</p>\n<p>This new <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a> is said to have a perceived noise reduction of 34 to 45 per cent.</p>\n<p>The kinematics have also been adjusted to improve overall trail performance, and the new bikes come with updated custom RX shock tunes for the kinematics.</p>\n<p>There are two models being released, the £13,000/$14,000/€14,000 Turbo Levo SL II S-Works, and the £7,000/$8,000/€7,900 Turbo Levo SL II Comp Carbon. We expect further models to be announced at a later date.</p>\n\n<h2>The motor matters</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> At the heart of the Specialized Turbo Levo SL II is the new, more powerful Specialized Turbo SL 1.2 motor with 50Nm torque and 320W assistance.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<p>Like any new <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bike</a> with an updated motor, we all want to know what’s ‘under the hood’. The Turbo SL 1.2 motor dishes out 50Nm torque with a peak power of 320W.</p>\n<p>That’s increased from 35Nm and 240W delivered by the previous Turbo SL 1.1 motor and aligns with other current lightweight electric bike motors such as the TQ HPR 50 and Fazua Ride 60.</p>\n<p>This means the new Turbo Levo SL II will provide more assistance to make climbs feel less of a chore.</p>\n<p>The Turbo Levo SL II uses a non-removable 320Wh battery. You can also add a 180Wh range extender that fits into the bike’s bottle cage for a maximum 480Wh capacity.</p>\n<p>There’s also a new two-piece motor housing with an integrated honeycomb structure to help dissipate noise. The gearbox has been redesigned to reduce noise further. The motor is IP67 rated, meaning it can be submerged in up to one metre of water for 30 minutes.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Specialized Turbo SL 1.2 motor features a new gearbox and honeycomb two-piece casing to keep it quiet.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<p>Specialized claims the motor has a wide optimised cadence range of support, with anywhere between 70 and 100rpm ideal. Specialized has yet to present a motor weight, but a size S4 S-Works Turbo Levo SL weighs 17.67kg, so it can’t be too hefty.</p>\n<p>The drive unit modes include Eco, Trial, Turbo, Walk and Micro Tune. Eco, Trail and Turbo are pre-set power modes that can be adjusted in Specialized’s Misson Control app. Micro Tune is a method that can change the power output in 10 per cent jumps to tailor the power to suit your ride and situation from the remote.</p>\n<h2>Connectivity</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Specialized MasterMind TCU displays power, ride and other metrics on its colour display.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>Specialized’s MasterMind TCU (Turbo Control Unit) is at the heart of rider interaction with the bike. This fits neatly into the top tube and shows the rider various metrics. It’s available on all carbon models.</p>\n<p>It can display modes, battery capacity, speed, time, distance, elevation metrics analysed through a barometer, power output (motor and rider) and estimated range. If you connect via Bluetooth or ANT+, you can see heart rate data too. It will also display functions on other devices.</p>\n<p>The unit can supply more data, including slope angle and average 20-minute battery consumption. In addition, it can work as a security device by locking the motor.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Specialized’s Mission Control app enables you to customise the bike’s power and assistance settings.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<p>If you want to customise your power settings, you can use the Mission Control app to tune the support, peak power output and acceleration response from the motor for each of the Eco, Trail and Turbo modes.</p>\n<p>Updates to the system can be downloaded and installed ‘Over the Air’ via Bluetooth and the Mission Control app. There is no need to connect cables to your bike to install the latest system updates.</p>\n<h2>Rider tuned</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The new frame has lost its asymmetrical side strut. The different frame sizes have been tuned to try to deliver the same ride experience.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>While the Turbo Levo SL II has a motor to aid assistance on the climbs, Specialized says it still believes the bike’s frame and suspension play a key role in how it behaves and feels on the trail.</p>\n<p>This is where Specialized claims to have spent much of its time trying to improve the rider experience.</p>\n<p>The frames use Specialized FACT11 carbon fibre, which employs FEA (Finite Element Analysis) and machine learning to help optimise material usage, carbon layup and shape to refine lateral, torsional and bottom-bracket stiffness.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The new front and rear triangles and links were designed to improve the experience on the trail.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>Specialized says it tuned the whole chassis (front and rear triangles and links) under its Rider-First Engineered process to ensure each of the six frame sizes delivers the same on-trail experience.</p>\n<p>In addition, Specialized removed its sidebar to save weight and meet its stiffness needs as the frames grow longer with the updated geometry.</p>\n<h2>The usual suspects</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The new Specialized Turbo Levo SL II is compatible with SRAM’s new Eagle Transmission.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>The other frame details are what you would expect to see on modern <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail bikes</a>. It uses 12x148mm Boost rear-hub spacing. In addition, there’s space for a bottle cage in the front triangle that can hold your water bottle or the 180W range extender.</p>\n<p>There’s plenty of frame protection around the chainstays and a <a href=\"https://www.bikeradar.com/advice/workshop/sram-udh/\">SRAM Universal Derailleur Hanger</a> interface to fit the latest SRAM Eagle AXS Transmission.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> There’s no headset cable routing on the Turbo Levo SL II. You do get Specialized’s SWAT tool stashed in the steerer though.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>What’s missing from this latest Turbo Levo SL II is internal cable routing through the headset. Some might consider this a blessing, but I expect the next Turbo Levo SL model will feature this.</p>\n<p>There are also no additional bosses for tool and tube storage. However, you do get a Specialized SWAT multi-tool in the steerer tube.</p>\n<h2>Refined bounce</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> This graph shows a comparison between the Specialized Turbo Levo SL and Turbo Levo SL II’s leverage rates.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<p>Specialized has reworked the kinematics and shock tunes for this new frame. The aim was to balance a bike that’s plush enough to keep you calm tackling the chunkiest lines while still having enough playfulness to keep you engaged on flowing terrain.</p>\n<p>Specialized flattened and lowered the Turbo Levo SL II’s leverage curve. As a result, the bike is less progressive at sag, which should help you find traction. However, it’s more progressive in the last 30mm of travel to provide greater support in bottom-out situations.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The shocks on the Turbo Levo SL II get Specialized’s custom RX tune tailored to the bike’s suspension kinematics.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>Compared to the previous Levo SL, the bike’s kinematics rely more on damping support from the shock rather than the spring rate in bottom-out situations. Specialized has also reduced the rebound damping in the shock so it can recover faster and keep the bike higher in its travel with more suspension reserved for bigger hits.</p>\n<p>A slightly more rearward axle path is used to help improve bump absorption by better aligning bump force with wheel-travel direction. This also links to a higher anti-squat to give the bike a more stable pedalling platform.</p>\n<p>The new frame (except size S1) is also compatible with select <a href=\"https://www.bikeradar.com/advice/buyers-guides/coil-vs-air/\">coil shocks</a>. Examples include the Fox DHX, Öhlins TTX Coil, and RockShox Super Deluxe Coil.</p>\n<h2>Size and shape</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Turbo Levo SL II comes available in six sizes, from S1 to S6.</span></figcaption><span> <i>Scott Windor</i></span></div>\n<p>Let’s first talk about the sizes, because there are plenty of geometry details to explore with the Turbo Levo SL II’s adjustability.</p>\n<p>The Turbo Levo SL II was Specialized’s last performance mountain bike to be integrated into its S-Sizing concept. As a result, the new bike is available in six sizes, from the smallest S1 to the largest S6.</p>\n<p>For those who aren’t aware, S-Sizing is designed to enable riders to choose their frame size based on riding style and the terrain they ride most often. Consequently, frames are built with similar standover heights but lengthening front centres.</p>\n<p>If you prefer a shorter, more playful bike, choose a smaller size. On the other hand, if you like a more stable and planted bike, size up. Most riders should have at least two, and maybe three, frame sizes to consider.</p>\n<p>The S1 is unique in the Turbo Levo SL II line-up. While S2 to S6 bikes have 160mm forks and 150mm rear travel, the S1 has a 150mm fork and 144mm rear travel to maximise standover height. It also doesn’t use a piggyback shock like the other sizes.</p>\n<h2>Geometry details</h2>\n<p>The Turbo Levo SL II has received a geometry update, resulting in a <a href=\"https://www.bikeradar.com/features/opinion/spoke-tension-is-long-slack-and-low-geometry-always-better-our-tech-experts-give-us-their-angle/\">longer, slacker and lower</a> design. The new bike has myriad adjustability, just like the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/specialized-stumpjumper-evo-elite-alloy-review/\">Specialized Stumpjumper EVO</a>. First, however, we’ll cover the standard bike settings, which include the low shock yoke setting, 27.5in Horst-link positions and standard headset cups.</p>\n<p>Reach numbers range from 405mm to 425mm, 445mm, 470mm, 495mm and 525mm on the S1 to S6. If we take the S4 to represent the old size large, the reach is 15mm longer at 470mm compared to 455mm.</p>\n<p>The head tube angle is now 64.5 degrees. That’s 1.5 degrees slacker than the old bike. The effective seat tube angle is a not-so-steep 75.8 degrees across all sizes. However, this is 1.2 degrees steeper than the previous bike when compared to the size L.</p>\n<p>The bottom bracket sits 2mm lower with an offset of 29mm below the front wheel. The standover heights between the S2 and S6 sizes increase only by 15mm from 763mm to 778mm. However, the seat tubes jump 80mm in 20mm increments, from 385mm on the S1 to 465mm on the S6.</p>\n<p>The S1 frame has a lower standover height of 727mm, but shares the same 385mm seat tube length as the S2 size.</p>\n<p>The chainstay lengths are a nimble 432mm across all sizes.</p>\n<div>\n                <table><colgroup><col></col><col></col><col></col><col></col><col></col><col></col><col></col></colgroup><thead><tr><th>Specialized Turbo Levo SL II</th><th></th><th></th><th></th><th></th><th></th><th></th></tr></thead><tbody><tr><td>Size</td><td>S1</td><td>S2</td><td>S3</td><td>S4</td><td>S5</td><td>S6</td>        </tr><tr><td><b>Reach</b> (mm)</td><td>405</td><td>425</td><td>445</td><td>470</td><td>495</td><td>525</td>        </tr><tr><td><b>Head angle</b> (degrees)</td><td>64.5</td><td>64.5</td><td>64.5</td><td>64.5</td><td>64.5</td><td>64.5</td>        </tr><tr><td><b>Seat tube angle</b> (degrees)</td><td>75.8</td><td>75.8</td><td>75.8</td><td>75.8</td><td>75.8</td><td>75.8</td>        </tr><tr><td><b>Seat tube</b> (mm)</td><td>385</td><td>385</td><td>405</td><td>425</td><td>445</td><td>465</td>        </tr><tr><td><b>Chainstay</b> (mm)</td><td>433</td><td>432</td><td>432</td><td>432</td><td>432</td><td>432</td>        </tr><tr><td><b>Wheelbase</b> (mm)</td><td>1,158</td><td>1,184</td><td>1,208</td><td>1,238</td><td>1,267</td><td>1,301</td>        </tr><tr><td><b>Bottom bracket offset</b> (mm)</td><td>343</td><td>348</td><td>348</td><td>348</td><td>348</td><td>348</td>        </tr><tr><td><b>Stack</b> (mm)</td><td>609</td><td>617</td><td>626</td><td>635</td><td>645</td><td>654</td>        </tr><tr><td><b>Top tube</b> (mm)</td><td>560</td><td>582</td><td>604</td><td>631</td><td>659</td><td>691</td>        </tr><tr><td><b>Standover </b>(mm)</td><td>727</td><td>763</td><td>766</td><td>767</td><td>773</td><td>778</td>        </tr></tbody></table></div>\n\n<p> </p>\n<h2>Geometry adjustability</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> While the bike is sold with a 27.5in rear wheel, the flip chip in the Horst-link pivot enables you to run a full 29in wheel setup.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>If you’re unsatisfied with those dimensions, the Turbo Levo SL II has a few tricks up its sleeve to tailor the bike to your riding style and needs.</p>\n<p>The bike comes with 1-degree headset cups that you can swap to steepen or slacken the head tube angle.</p>\n<p>There is also a flip chip in the shock yoke. The bike comes as standard in the low setting, but you can switch this to raise the bottom bracket 5mm and steepen the head tube and effective seat tube by approximately 0.5 degrees.</p>\n<p>The Horst (chainstay/seatstay) pivot has a second flip chip. This enables you to run a 29in rear wheel while keeping the geometry standard. However, it increases the chainstay length by 10mm to 443mm.</p>\n<p>All these combinations give 12 geometry charts, but check below for an overview of how these different adjustments work.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The charts show how the changes to the Turbo Levo SL II’s settings change the bike’s geometry.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<h2>Specialized Turbo Levo SL II specs and pricing</h2>\n<p>Initially, Specialized is releasing two models of the Turbo Levo SL II and has shared details for the Turbo Levo SL II S-Works and Turbo Levo SL II Comp Carbon. We expect more models to be released, but these are the details we have so far.</p>\n<p>The good news is prices haven’t increased, and the S-Works model is £700 cheaper than previously.</p>\n<h3>Specialized Turbo Levo SL II Comp Carbon</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Specialized Turbo Levo SL II Comp Carbon.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<ul><li><strong>Frame: </strong>FACT11 Carbon fibre, 144mm-travel (size S1), 150mm-travel (size S2-S6)</li>\n<li><strong>Shock: </strong>Fox Float DPS Performance (size S1), Fox Float X Performance (size S2-S6)</li>\n<li><strong>Fork: </strong>Fox 36 Rhythm, GRIP, 150mm (size S1), 160mm (size S2-S6)</li>\n<li><strong>Motor/battery/display:</strong> Specialized 1.2 SL Custom Rx Trail Tuned 50Mn, 320W/Specialized SL1-320, fully integrated, 320Wh/Specialized MasterMind TCU</li>\n<li><strong>Drivetrain: </strong>SRAM GX Eagle derailleur/shifter/cassette, SRAM NX Eagle chain, SRAM alloy cranks</li>\n<li><strong>Brakes: </strong>SRAM Code RS, 200mm rotors</li>\n<li><strong><strong>Wheels/tyres: </strong></strong>Specialized 29/27.5 rims and alloy hubs, Specialized Butcher GRID TRAIL GRIPTON T9 2Bliss Ready 29×2.3in (front) and Eliminator GRID TRAIL GRIPTON T7 2Bliss Ready 27.5 x 2.3in (rear) tyres</li>\n<li><strong><strong>Bar/stem/grips: </strong></strong>Specialized, 6061 alloy, 780mm/Alloy Trail Stem, 50mm/Specialized Trail Grips</li>\n<li><strong><strong>Seatpost/saddle: </strong></strong>X-Fusion Manic/Specialized Bridge Comp</li>\n<li><strong>Price: </strong>£7,000/$8,000/€7,900</li>\n</ul><p> </p>\n<h3>Specialized Turbo Levo SL II S-Works</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Specialized Turbo Levo SL II S-Works.</span></figcaption><span> <i>Specialized Bikes</i></span></div>\n<div>\n<div>\n<div>\n<div>\n<ul><li><strong>Frame:</strong> FACT11 carbon fibre, 144mm-travel (size S1), 150mm-travel (size S2-S6)</li>\n<li><strong>Shock:</strong> Fox Float DPS Factory (size S1), Fox Float X Factory (size S2-S6)</li>\n<li><strong>Fork:</strong> Fox 36 Factory, 150mm-travel (size S1), 160mm-travel (size S2-S6)</li>\n<li><strong>Motor/battery/display:</strong> Specialized 1.2 SL custom Rx tune 50Nm, 320W/Specialized SL1-320 fully integrated, 320Wh/Specialized MasterMind TCU</li>\n<li><strong>Drivetrain:</strong> SRAM XX Eagle Transmission, SRAM carbon cranks</li>\n<li><strong>Brakes:</strong> SRAM Code Silver Stealth, 200mm rotors</li>\n<li><strong>Wheels/tyres:</strong> Roval Traverse SL Carbon/Specialized Butcher GRIDTRAIL GRIPTON T9 2Bliss Ready 29×2.3in (front) and Eliminator GRIDTRAIL GRIPTON T7 2Bliss ready 27.5×2.3in (rear) tyres</li>\n<li><strong>Bar/stem/grips:</strong> Roval Traverse SL Carbon, 780mm/Deity, 50mm/Deity Knuckleduster</li>\n<li><strong>Seatpost/saddle:</strong> RockShox Reverb AXS/Specialized Bridge Ti</li>\n<li><strong>Price</strong> £13,000/$14,000/€14,000</li>\n</ul></div>\n</div>\n</div>\n</div>\n<h2>Specialized Turbo Levo SL II initial ride impressions</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Luke had a couple of very damp days riding a Specialized Turbo Levo SL II S-Works around north Wales.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>I was invited by Specialized to the UK’s media camp to test the S-Works Turbo Levo SL II in not-so-sunny Wales. Conditions were very wet, with plenty of rain but some sunny spells.</p>\n<p>We clocked up two rides, which I recorded, as did the bike. The first ride totalled 27.8km, with 750m of climbing and 950m of descending. The stats for the second ride were 17.5km, with 740m ascending and descending.</p>\n<p>Using a mix of Eco, Trail, and Turbo modes, I finished the first day with 25 per cent battery remaining and the second day with 37 per cent. I only used the main battery without the range extender.</p>\n<h3>Climbing impressions</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Luke took the Turbo Levo SL II S-Works up some demanding climbs to test its capabilities.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>The first day covered a more trail-oriented ride around the lesser-known trails of Coed y Brenin. The second day took in a more direct winch-and-plummet ride around the natural trails of Dyfi Forest.</p>\n<p>From the first pedal strokes, it’s noticeable how quiet the motor is in Eco and Trail modes. There’s a slight hum in Turbo, but it’s quieter than a standard full-power ebike motor. The new gearbox and casing do the trick.</p>\n<p>The motor has enough power in all modes to take the sting out of climbing. I could pedal up comfortably while chatting away.</p>\n<p>Setting the Turbo mode to 100 per cent assistance and power, the full 50Nm torque and 320W, there’s enough punch in the motor to grind up some savage climbs. I negotiated some steep, technical terrain and I was thoroughly impressed with the performance of the motor. You can rely on it heavily to winch you up some gruelling grades.</p>\n<p>Your pace will be slower than a more powerful <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bike</a>, but it’ll do the job.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Whether singletrack, doubletrack, mellow or steep, the Turbo Levo SL II managed it all quite comfortably.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>While the effective seat tube angle isn’t as steep as most bikes released in the last year, and the chainstays on the mixed-wheel bike are short, it’s still easy to keep the front wheel tracking on steep climbs. I didn’t feel as though the front wheel wanted to loop out.</p>\n<p>That might be due to the middling reach values contributing to a moderate effective top tube length that let me keep weight on the front wheel. I still needed to lean forwards a little, but not more than usual.</p>\n<p>The suspension was supple enough to provide plenty of traction when climbing wet rocky slopes, without sapping energy from the motor or rider. On smoother trails, it’s easy to reach the shock’s climb switch to maximise efficiency.</p>\n<p>Still, I could ride easily with the shock open for climbing and descending, and not worry about excessive pedal bob.</p>\n<h3>Descending impressions</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> When the trails get rough, the Turbo Levo SL II does a good job of isolating you from bumps of all sizes.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>I weighed a size S4 Turbo Levo SL II S-Works at 17.67kg (no pedals). While I tested an S3, the weights will be close. Once on the trails, with gravity helping you out, that weight is mostly unnoticeable, and it’s hard to tell you’re on an ebike.</p>\n<p>Moving the bike around on the trail didn’t take a noticeable amount of extra input, and braking points weren’t remarkably different, which I sometimes notice on ebikes over 20kg.</p>\n<p>The fact that the weight is low in the frame helps keep the bike stable and makes it feel hunkered down to the ground. While it’s only marginal, the extra unsprung mass helps reduce trail buzz and vibrations coming through the suspension. Maybe the Specialized RX shock tune does a respectable job here too.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> On natural terrain, the Turbo Levo SL II delivers plenty of confidence to attack even slippery trails.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>The times I still felt aware I was on an ebike were on moderately flat trails where you’re above the motor cut-out speed but still need to pedal to keep momentum. These sections of the trail seem harder work than keeping and generating speed on my regular non-assisted bikes, even if the weights are within a kilo or two.</p>\n<p>I would like a size S3.5, but I would always size down rather than size up when deciding <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/mountain-bike-sizing-what-size-bike-do-i-need/\">what size bike I need</a>. The handling of the S3 was impressive. I rode one day with the stock headset cups at 64.5 degrees and one day with the -1-degree cups that changed the head tube angle to 64 degrees.</p>\n<p>There wasn’t a massive change in handling feel, and in both settings, the bike’s overall handling was fun and agile. I could weave through awkward sections of trail without hesitation, and positioning the bike on the trail where I wanted was easy.</p>\n<p>The suspension was impressive too, and Specialized has managed to balance a supple beginning stroke with support deeper in the travel, without having a harsh ramp-up.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The ride feel of the Turbo Levo SL II is engaging even on mellower trails.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>Whether through chassis design, suspension tuning or the sprung-to-unsprung weight ratio, but probably a combination of all three, the bike is very composed on the trail. It transfers little feedback to the rider.</p>\n<p>That helped me feel comfortable and confident to push hard from the start and take advantage of the engaging ride character.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Turbo Levo SL II is easy to place on narrow lines, and its weight is pretty much unnoticeable compared to a non-assisted enduro bike on steep trails.</span></figcaption><span> <i>Scott Windsor</i></span></div>\n<p>The Turbo Levo SL II S-Works was impressive over various trails, from mellow trail centre runs to steep and wild tech. As a trail bike goes, this is a great all-rounder.</p>","author":"Luke Marshall","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8ccab73f6c05893c20dd98f2a5bdfb9d59ee7fab551cdb3e305bb3e98c3daf8a","category":"Cycling"}