{"title":"Individual canopy tree species maps for the National Ecological Observatory Network","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002700","date":1721138400000,"content":"<p>by Ben G. Weinstein, Sergio Marconi, Alina Zare, Stephanie A. Bohlman, Aditya Singh, Sarah J. Graves, Lukas Magee, Daniel J. Johnson, Sydne Record, Vanessa E. Rubio, Nathan G. Swenson, Philip Townsend, Thomas T. Veblen, Robert A. Andrus, Ethan P. White</p>\r\n\r\nThe ecology of forest ecosystems depends on the composition of trees. Capturing fine-grained information on individual trees at broad scales provides a unique perspective on forest ecosystems, forest restoration, and responses to disturbance. Individual tree data at wide extents promises to increase the scale of forest analysis, biogeographic research, and ecosystem monitoring without losing details on individual species composition and abundance. Computer vision using deep neural networks can convert raw sensor data into predictions of individual canopy tree species through labeled data collected by field researchers. Using over 40,000 individual tree stems as training data, we create landscape-level species predictions for over 100 million individual trees across 24 sites in the National Ecological Observatory Network (NEON). Using hierarchical multi-temporal models fine-tuned for each geographic area, we produce open-source data available as 1 km<sup>2</sup> shapefiles with individual tree species prediction, as well as crown location, crown area, and height of 81 canopy tree species. Site-specific models had an average performance of 79% accuracy covering an average of 6 species per site, ranging from 3 to 15 species per site. All predictions are openly archived and have been uploaded to Google Earth Engine to benefit the ecology community and overlay with other remote sensing assets. We outline the potential utility and limitations of these data in ecology and computer vision research, as well as strategies for improving predictions using targeted data sampling.","author":"Ben G. Weinstein","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"8cdd7c3bfe2cd7876603cea5d23d24de8f7999e388cbd75dd043c52e69631926","category":"Environment"}