{"title":"‘I love the feeling of going to the limit’: Ricarda Bauernfeind interview","link":"https://www.cyclist.co.uk/in-depth/ricarda-bauernfeind-cyclist","date":1700141161000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/ricarda-bauernfeind-cyclist\">‘I love the feeling of going to the limit’: Ricarda Bauernfeind interview</a></p>\n\n<p><strong>What did you do before cycling?</strong></p>\n\n\n\n<p>I tried almost every sport with friends; I was a very active child. I played soccer, I did ballet and a lot of running. I learned two instruments and started learning to ride a horse. Then my brother Gabriel, who’s five years older, got a road bike and so I also wanted one. My parents weren’t happy about it – they thought it would be too dangerous – but changed their mind.</p>\n\n\n\n<p><strong>You started racing while studying. How did you balance the demands?</strong></p>\n\n\n\n<p>After school, in 2018, I continued racing for a women’s elite team in Germany. We did all these national races and I recognised, ‘OK, I’m not that good anymore,’ so it didn’t make sense to focus purely on cycling. At the end of the year, I went to university to study to be a teacher and focussed on that. I wanted to become a teacher for nutrition and something like housekeeping.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/marlen-reusser\">The trials of time: Marlen Reusser profile</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/2023-tour-de-france-femmes-review\">The 2023 Tour de France Femmes review: SD Worx domination, Annemiek van Vleuten’s farewell, Fenix-Deceuninck’s attacking and start to finish stage coverage please</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-femmes\">Tour de France Femmes 2024 route announced ft. Alpe d’Huez and a mini Monument</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>At the end of 2019 I decided to stop racing and just do cycling for fun. The pandemic came and I carried on, mostly on Zwift, because it was really efficient and I didn’t have that much time to spare. Then I did the German National Championships just for fun and everything started again.</p>\n\n\n\n<p><strong>So what had changed in that time?</strong></p>\n\n\n\n<p>I think I put less pressure on myself. I was always super-nervous before a race, on the sidelines almost crying because I was afraid of disappointing people. But with the distance from the sport, I grew up and learned how to deal with all the nerves. And I still enjoyed the sport because I continued on Zwift and riding outside with my brother. I love the feeling of going to the limit.</p>\n\n\n\n<p><strong>How important was Zwift to your progress?</strong></p>\n\n\n\n<p>Very. I still do it, even in summer. I really love Zwift intervals and training. The longest I’ve ridden on there is five hours. In the winter of 2021-22, I did every session on Zwift.</p>\n\n\n\n<p><strong>How did you join Canyon-SRAM?</strong></p>\n\n\n\n<p>At the European Championships in 2021, team manager Ronny Lauke told me about the Canyon-SRAM Generation team. I thought this would be perfect for me because the focus was more on learning and developing, bringing riders from different countries to Europe. I think joining them was the best decision I’ve ever made because I learned how to race in a bigger peloton, to be brave and try things without putting too much pressure on myself.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"970\" height=\"347\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-970x347.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-300x107.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-768x275.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1536x550.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-750x269.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4-1140x408.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/clickable-subs-promo4.jpg 1818w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p><strong>You moved up to the WorldTour this year. Before your Tour de France Femmes stage victory in Albi this July, was there a result that gave you more confidence?</strong></p>\n\n\n\n<p>Finishing third on a stage at the Vuelta and fifth overall was already a great success. But the Tour de France stage win was something totally different and super-special. I never expected it. On Stage 5, I could already feel that I was a bit tired and I told Kasia [Niewiadoma] that. Then I heard over the race radio, ‘Ricarda, on the next climb, you have to attack.’ And I thought, shit I don’t know how long I can go for. But I tried because if you never try, you never know.</p>\n\n\n\n<p><strong>You gained an advantage of 90 seconds over the peloton and ended up doing a 40km solo breakaway. What were you telling yourself?</strong></p>\n\n\n\n<p>Your mind is always stronger than your body. It’s a quote I love. And in the last kilometre, I was just waiting for the yellow jersey to pass me. That’s why I sprinted for the line. I had no idea how near the peloton was.</p>\n\n\n\n<p><strong>Your parents were following the Tour in a campervan. What did they say?</strong></p>\n\n\n\n<p>Before that stage, I texted my mum saying I was feeling super-tired and could already feel the four stages. She said to not worry, the most important thing is to finish the race healthy. So, of course, they also couldn’t believe it.</p>\n\n\n\n<p><strong>Do they still think cycling is too dangerous?</strong></p>\n\n\n\n<p>Definitely not. But when we watched the race replay back home in Eichstätt, my dad saw the downhill and went, ‘Ooh, you were going pretty fast.’</p>\n\n\n\n<p><strong>You love to attack. How does it work between your instinct and team tactics?</strong></p>\n\n\n\n<p>To be honest, I sometimes doubt myself. It’s more the team that encourages me. If I hear on the radio, ‘Ricarda now, it’s your time,’ then I always trust the coaches. I would never be able to do it on my own. This is something I still have to learn – to trust more in myself.</p>\n\n\n\n<p><strong>Within 18 months, you’ve gone from being a new pro to winning a Tour stage. Has your self-perception caught up with your achievements?</strong></p>\n\n\n\n<p>When I joined the Canyon-Sram Generation team, I had almost no expectations. I just wanted to see the professional environment and whether I liked it. I developed from race to race and learned a lot. If someone had told me this would happen in 18 months, I would say no, maybe in five years or something.</p>\n\n\n\n<p><strong>What’s next?</strong></p>\n\n\n\n<p>It’s a goal to be at the 2024 Olympics in Paris, and just to develop as a rider. I still have to improve a lot of things.</p>\n\n\n\n<p><strong>Finally, where would you like to go on a well-earned holiday this winter? </strong></p>\n\n\n\n<p>I’ll enjoy time with family and friends. My mum and I are planning to go to Hamburg to see a musical. I’ll go to Oktoberfest too [in nearby Munich]. I wear the traditional clothes but I don’t like beer. Maybe I’ll have a gin and tonic.</p>\n\n\n\n<h2>Career highlights</h2>\n\n\n\n<p><strong>Age</strong> 23<br /><strong>Born</strong> Ingolstadt, Germany<br /><strong>Team</strong> Canyon-SRAM</p>\n\n\n\n<p><strong>Notable results<br />2023:<br /></strong>5th, La Vuelta Femenina<br />1st, Stage 5, Tour de France Femmes</p>\n\n\n\n<p><strong>2022</strong>:<br />1st, Road Race and Time-Trial, German Under-23 National Championships<br />2nd, Road Race, German National Championships<br />3rd, Road Race and Time-Trial, Under-23 World Championships</p>\n\n\n\n<p><strong>2021</strong>:<br />3rd, Road Race, German National Championships</p>\n\n\n\n<p><strong>2018</strong>:<br />3rd, Road Race, German Junior National Championships</p>\n\n\n\n<p><strong>• This article originally appeared in issue 146 of <em>Cyclist </em>magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/ricarda-bauernfeind-cyclist\">‘I love the feeling of going to the limit’: Ricarda Bauernfeind interview</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8cee70bd6a3a32048f1f132d43b6132d219a0e289158603a25e90ee1932ca2ef","category":"Cycling"}