{"title":"Adaptation and Response in Drylands (ARID): Community Insights for Scoping a NASA Terrestrial Ecology Field Campaign in Drylands","link":"https://onlinelibrary.wiley.com/doi/10.1029/2024EF004811?af=R","date":1726823736000,"content":"<h2>Abstract</h2>\n<p>Dryland ecosystems cover 40% of our planet's land surface, support billions of people, and are responding rapidly to climate and land use change. These expansive systems also dominate core aspects of Earth's climate, storing and exchanging vast amounts of water, carbon, and energy with the atmosphere. Despite their indispensable ecosystem services and high vulnerability to change, drylands are one of the least understood ecosystem types, partly due to challenges studying their heterogeneous landscapes and misconceptions that drylands are unproductive “wastelands.” Consequently, inadequate understanding of dryland processes has resulted in poor model representation and forecasting capacity, hindering decision making for these at-risk ecosystems. NASA satellite resources are increasingly available at the higher resolutions needed to enhance understanding of drylands' heterogeneous spatiotemporal dynamics. NASA's Terrestrial Ecology Program solicited proposals for scoping a multi-year field campaign, of which Adaptation and Response in Drylands (ARID) was one of two scoping studies selected. A primary goal of the scoping study is to gather input from the scientific and data end-user communities on dryland research gaps and data user needs. Here, we provide an overview of the ARID team's community engagement and how it has guided development of our framework. This includes an ARID kickoff meeting with over 300 participants held in October 2023 at the University of Arizona to gather input from data end-users and scientists. We also summarize insights gained from hundreds of follow-up activities, including from a tribal-engagement focused workshop in New Mexico, conference town halls, intensive roundtables, and international engagements.</p>","author":"Andrew F. Feldman, \nSasha Reed, \nCibele Amaral, \nAlicja Babst‐Kostecka, \nFlurin Babst, \nJoel Biederman, \nCharles Devine, \nZheng Fu, \nJulia K. Green, \nJessica Guo, \nNiall P. Hanan, \nRaymond Kokaly, \nMarcy Litvak, \nNatasha MacBean, \nDavid Moore, \nDennis Ojima, \nBenjamin Poulter, \nRussell L. Scott, \nWilliam K. Smith, \nRobert Swap, \nCompton J. Tucker, \nLixin Wang, \nJennifer Watts, \nKonrad Wessels, \nFangyue Zhang, \nWen Zhang","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"8cf0cda4a44d790c517a457f136ae95006dc833082e8acbd351fedae96543633","category":"Environment"}