{"title":"Apple Considered iPhone 15 With Lightning Port Before Swapping to USB-C","link":"https://www.macrumors.com/2023/04/18/apple-iphone-15-lightning-test/","date":1681860420000,"content":"Early on in the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> development process, Apple created a version that included a Lightning port, according to Apple leaker Unknownz21. In a tweet, Unknownz21 said that Apple tested an ‌iPhone 15‌ with a Lightning port \"very early on\" but that it was \"quickly scrapped\" in favor of the USB-C version.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/iPhone-15-to-Switch-From-Lightning-to-USB-C-in-2023-feature.jpg\" alt width=\"2621\" height=\"1475\" />\r<br />\n‌iPhone 15‌ models equipped with USB-C instead of Lightning were in testing as early as January 2022, and all designs after March 2022 focused on a USB-C port.\r<br />\n\r<br />\nApple's transition to USB-C on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> has been one of the most consistent rumors, and the company is expected to ditch the Lightning port for all four models that are coming this year. Both Pro and standard models alike will charge via USB-C instead of Lightning, a first for the ‌iPhone‌.\r<br />\n\r<br />\n<div><blockquote><p>Some details about USB-C on the iPhone 15:<br /><br />It was in testing as far back as January 2022, and pretty much all designs since March 2022 have had the USB-C port instead of lightning.<br /><br />There was a version with a lightning port very early on, but it was quickly scrapped.</p>— Unknownz21 🌈 (@URedditor) <a href=\"https://twitter.com/URedditor/status/1648326524045541377?ref_src=twsrc%5Etfw\">April 18, 2023</a></blockquote> </div>\r<br />\nUSB-C ports have been included in the Mac lineup since 2015 and the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> line since 2018. All iPads that Apple sells now feature a USB-C port, in fact, so the only iOS devices that still use Lightning are the iPhones. Apple is planning to transition to USB-C for the ‌iPhone‌ because of European regulations that mandate a common charger for electronic devices.\r<br />\n\r<br />\nThe Lightning port is not permitted under these rules, so Apple had the option of introducing USB-C just in Europe and sticking with Lightning everywhere else, or using USB-C worldwide and eliminating Lightning entirely. USB-C across all Apple devices will make charging simpler because iPhones, iPads, and Macs will be able to share the same cable and power adapter.\r<br />\n\r<br />\nApple will eventually need to update the third-generation AirPods, <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> 2, <a href=\"https://www.macrumors.com/roundup/airpods-max/\">AirPods Max</a>, Magic Mouse, Magic Trackpad, Magic Keyboard, and original <a href=\"https://www.macrumors.com/guide/apple-pencil/\">Apple Pencil</a>, all devices that continue to charge with Lightning.\r<br />\n\r<br />\nApple may not need to rely on USB-C charging for too long, as the company has been pushing <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a> wireless charging. iPhones since the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a> have incorporated ‌MagSafe‌, and Apple could be planning to add similar technology to future ‌iPad‌ models. There have been rumors that Apple's eventual goal is to have a portless, all-display ‌iPhone‌, and with ‌MagSafe‌ and the upcoming launch of Qi2, that may be possible at some point. The Qi2 standard will allow for faster MagSafe-like charging speeds and will serve as a more open alternative to ‌MagSafe‌.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/usb-c/\">USB-C</a>, <a href=\"https://www.macrumors.com/guide/unknownz21/\">Unknownz21</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/apple-iphone-15-lightning-test/\">Apple Considered iPhone 15 With Lightning Port Before Swapping to USB-C</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-considered-iphone-15-with-lightning-port-before-swapping-to-usb-c.2387171/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8cf84842b9aa001493792a11319397d2b7c6818572a12ebaef2b14f8017a6479","category":"Apple"}