{"title":"The iPad Pro’s battery life is terrible and Apple isn’t doing anything about it","link":"https://www.macworld.com/article/1808426/ipad-pro-battery-life-standby-m2-processor.html","date":1683222819000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When I bought my first iPad at the Apple Store on Regent Street, when it hadn’t yet been released in my home country of Sweden, it seemed an almost magical device. The screen, which at that point offered neither ProMotion nor even a high resolution, nevertheless felt like a window into a digital world. But best of all was the battery life and especially the amazing standby time, which was superior to just about all the alternatives. </p>\n\n\n\n<p>Today? Not so much. </p>\n\n\n\n<p>What the heck happened? If I pick up my iPad Pro after leaving it unused for a few days, chances are the battery will be somewhere around 30% at best, or zero at worst. After the same amount of time, my MacBook is ready with a more or less fully charged battery. </p>\n\n\n\n<p>Last time I checked, the two devices had the same type of processor, drawn from Apple’s M-series. Their processors are very powerful while being incredibly energy-efficient–yet the latter only seems to apply when it’s in a MacBook. Of course, it’s possible to squeeze a larger battery into that machine’s chassis, but this isn’t enough to explain the disparity: the iPad Pro has gone from best in class to class clown. Not too many years ago the charge lasted for weeks of standby, but that’s dropped to barely one. Battery life in general seems to have deteriorated too: after an hour of use, an alarming amount of charge has been consumed.</p>\n\n\n\n<p>It’s not just me, by the way. Two colleagues have complained of exactly the same phenomenon, and there are plenty of threads online to back us up: just glance at the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://forums.macrumors.com/threads/what-happened-to-the-legendary-standby-time-of-ipad.2376100/&amp;xcust=1-1-1808426-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">MacRumors forum</a> or <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/ipad/comments/lv47eo/what_happened_to_ipads_famous_standby_time/&amp;xcust=1-1-1808426-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Reddit</a>. The iPad Pro specifically seems to be the worst affected by this decline. One M2 Pro owner on the Apple discussions forum complains of <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/thread/254470326&amp;xcust=1-1-1808426-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">“awful battery life”</a> and claims their iPhone 14 Pro Max lasts three times as long. “This whole ordeal makes me regret buying this thing,” they lament. Another M2 Pro owner, this time on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.reddit.com/r/iPadPro/comments/yfsa66/insanely_bad_battery_life_129_m2/&amp;xcust=1-1-1808426-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Reddit</a>, describes “insanely bad battery life” and claims watching YouTube on the tablet for just half an hour drained roughly 20 percent of the battery.</p>\n\n\n\n<p>Apple hasn’t addressed any of these concerns and I fear the rumors of a <a href=\"https://www.macworld.com/article/1805421/ipados-17-ipad-pro-stage-manager-final-cut-logic-macos-2024-rumors.html\">14-inch model with an M3 Pro processor</a> will only make things worse. What good is all that screen and speed if you’re constantly worried about it running out of power?</p>\n\n\n\n<p>Has Apple’s attempt to turn the iPad Pro into a laptop replacement ruined a product whose battery life used to be unbeatable? The question then becomes: Was it worth it? I still haven’t met anyone who uses the iPad exclusively as their primary work machine. When I tried it myself during an Apple event last year, it was an extremely frustrating and limiting experience. It’s not like compromising on battery life has turned the iPad Pro into a wildly successful work machine.</p>\n\n\n\n<p>Apple, it’s time to stop trying to get the tablet replace the laptop and let the iPad be what the iPad should be: A in-between device with a great display and fantastic battery life.</p>\n\n\n\n<p>This article originally appeared on Macworld Sweden. It was translated and edited by David Price.</p>\n\nApple, iPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8cfcf4b381d59580a3640509fa43582944ffadfa96d3231e26bfb71878f857e0","category":"Apple"}