{"title":"Cultivating long-term well-being through transformative undergraduate education","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae372/7758625?rss=1","date":1727136000000,"content":"<span><div>Abstract</div>Despite the growing body of research suggesting certain pedagogical approaches that can support student well-being, higher education has not fully embraced these approaches and typically still does not view well-being as a high priority in comparison with other metrics such as retention or GPA. Here, we contend that universities must play an active role in supporting lifelong well-being in their student populations by expanding their definitions of student success and providing opportunities and programs that support elements related to well-being. We propose a student well-being nexus, which comprises a sense of belonging, agency, purpose, identity, civic engagement, and financial well-being. This article provides a perspective on the importance of each element to well-being and which pedagogical practices have been shown to support various dimensions of well-being in undergraduate education, such as service learning, undergraduate research, and mentoring. In addition, it showcases 6 exceptional initiatives from various universities that aim to support one or more of the student well-being nexus dimensions, which can serve as models for other universities. Finally, several guiding principles are outlined for higher education institutions to support the implementation of student well-being initiatives and transformational learning opportunities. These include assessment of initiatives, embedding initiatives into the curriculum, and avoidance of creating additional financial burdens for students. These efforts can promote well-being on college campuses and beyond graduation.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"8d1051189a98a261403ad2a574ece1e6cd0428b4a79d1814004466b3e67e4b74","category":"Interdisciplinary"}