{"title":"Age-related physiological dysregulation progresses slowly in semi-free-ranging chimpanzees","link":"https://academic.oup.com/emph/article/12/1/129/7695983?rss=1","date":1718755200000,"content":"<span><div>Abstract</div><div>Background and objectives</div>Lifestyle has widespread effects on human health and aging. Prior results from chimpanzees (<span>Pan troglodytes</span>), one of humans’ closest evolutionary relatives, indicate that these lifestyle effects may also be shared with other species, as semi-free-ranging chimpanzees fed a naturalistic diet show healthier values in several specific health biomarkers, compared with their sedentary, captive counterparts. Here, we examined how lifestyle factors associated with different environments affect rates of physiological aging in closely related chimpanzees.<div>Methodology</div>We compared physiological dysregulation, an index of biological aging, in semi-free-ranging chimpanzees in an African sanctuary versus captive chimpanzees in US laboratories. If the rate of aging is accelerated by high-calorie diet and sedentism, we predicted greater age-related dysregulation in the laboratory populations. Conversely, if costs of a wild lifestyle accelerate aging, then semi-free-ranging chimpanzees at the sanctuary, whose environment better approximates the wild, should show greater age-related dysregulation. We further tested whether dysregulation differed based on sex or body system, as in humans.<div>Results</div>We found that semi-free-ranging chimpanzees showed lower overall dysregulation, as well as lower age-related change in dysregulation, than laboratory chimpanzees. Males experienced lower dysregulation than females in both contexts, and the two populations exhibited distinct aging patterns based on body system.<div>Conclusions and implications</div>Our results support the conclusion that naturalistic living conditions result in healthier aging in chimpanzees. These data provide support for the proposal that lifestyle effects on human health and aging are conserved from deeper into our evolutionary history.</span>","author":"","siteTitle":"Evolution, Medicine, and Public Health Current Issue","siteHash":"9e76709ab8b0e2754c4c3535d213495054c6abad330c14a3e364f120a867a7fa","entryHash":"8d1393d0aa4be1c152dd262a94eacbf2266ee2c51ba2826515f1d562126b099a","category":"Environment"}