{"title":"จีนแจงรายละเอียดหยวนดิจิทัล ระบบรวมศูนย์, มี smart contract, เปิดให้ภายนอกสร้างแอป Wallet","link":"https://www.blognone.com/node/123772","date":1626610035000,"content":"<div><div><div><p>ธนาคารกลางจีน (People's Bank of China - PBOC) ออกรายงานถึงความคืบหน้าของหยวนดิจิทัล หรือ e-CNY โครงการเงินดิจิทัล แม้ว่าตัวรายงานจะพูดถึงเงินคริปโตที่ได้รับความนิยมสูงขึ้นแต่รายละเอียดของ e-CNY เองก็ไม่เหมือนเงินคริปโตแต่อย่างใด</p>\n<p>PBOC ให้บริการ e-CNY แบบสองชั้น หน่วยงานที่ได้รับอนุญาต (ซึ่งมักเป็นธนาคาร) สามารถเขียนแอป wallet สำหรับผู้ใช้ทั่วไป บัญชีในระบบ e-CNY นั้นมีหลายระดับขึ้นกับระดับการยืนยันตัวตน ระดับต่ำสุดสามารถใช้งานได้โดยไม่ต้องยืนยันตัวตนใดๆ  (managed anonymity) จะใช้งานได้เฉพาะการจ่ายเงินมูลค่าต่ำๆ ขณะที่มีบัญชีที่ยืนยันตัวตนแล้วจะสามารถโอนเงินมูลค่าสูงขึ้นแต่ก็ป้องกันการขอข้อมูลส่วนตัวโดยไม่จำเป็น</p>\n<p>ความแตกต่างสำคัญของ e-CNY เทียบกับระบบโอนเงินในบัญชีธนาคารมีหลายอย่าง เช่น รายการจ่ายทั้งหมดไม่มีค่าธรรมเนียม และผู้ให้บริการจะถือว่าการชำระสิ้นสุดทันทีที่โอนเงินสำเร็จ (settlement upon payment)</p>\n<p>เนื่องจากระบบค่อนข้างรวมศูนย์ ทาง PBOC ออกแบบระบบศูนย์ข้อมูลที่กระจายตัวหลายแห่ง รองรับเหตุภัยพิบัติระดับเมือง เพื่อให้แน่ใจว่าระบบทำงานได้ต่อเนื่อง</p>\n<p>ฟีเจอร์สำคัญที่ e-CNY รับมาจากแนวคิดของเงินคริปโตคือ smart contract ที่กระเป๋าเงินสามารถจ่ายเงินได้เองเมื่อเงื่อนไขในซอฟต์แวร์ครบถ้วน แต่ในส่วนนี้ไม่มีข้อมูลว่าผู้ใช้ทั่วไปสามารถเขียนโปรแกรมลงไปได้เองหรือไม่ หรือต้องเป็นผู้ให้บริการ wallet เท่านั้น</p>\n<p>นอกจากฟีเจอร์หลักที่ใช้งานผ่านแอป wallet ที่ทดสอบเป็นวงกว้างในจีนแล้ว ทาง PBOC ยังทดสอบฟีเจอร์อื่นๆ อีกจำนวนหนึ่ง เช่น ทดสอบการจ่ายเงินแบบออฟไลน์โดยพัฒนาร่วมกับผู้ผลิตโทรศัพท์มือถือ, ทดสอบฮาร์ดแวร์อื่นเพื่อให้ใช้งาน e-CNY ได้โดยไม่ต้องมีโทรศัพท์ คาดว่าจะใช้งานจริงในโอลิมปิกฤดูหนาว 2022</p>\n<p>ที่มา - <a href=\"http://www.pbc.gov.cn/en/3688110/3688172/4157443/4293696/2021071614584691871.pdf\">PBOC</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6f435b14a55c559acbb09d57d12e5cfe.jpg\" /></p>\n<p>ภาพป้ายรับจ่ายด้วย e-CNY ในร้านค้าในเสิ่นเจิ้นโดย <a href=\"https://commons.wikimedia.org/wiki/File:DCEP_available_In_Shenzhen.jpg\">30000lightyears</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/banking\">Banking</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8d14650a2a16b8d622305bf4f2fe057f067e1fcdc5afc15cdb072cda8c4cbb6c","category":"Thai"}