{"title":"The Tectonic Framework of Parecis Basin. Insights from a Multiphysics Interpretation Workflow","link":"https://www.preprints.org/manuscript/202405.1962/v1","date":1716977439000,"content":"The Parecis Basin is one of the largest intracratonic basins in Brazil. Despite its considerable size, the basin has yet to be extensively explored, with only five wildcat wells drilled for hydrocarbons. So far, no commercial discoveries have been announced. Regional studies have suggested Paleozoic sedimentation, while recent studies indicate a Neoproterozoic fill. However, no tectonic model accurately describes the basin’s development, and no detailed structural map for the entire basin has been published. The present work presents a new detailed structural map of the Parecis Basin based on a four-step interpretation workflow integrating seismic and gravimetric data. The first step includes converting the public 2D seismic lines to the depth domain. The second step is estimating the residual Bouguer anomaly, where the computed residual anomalies should relate to the basin’s tectonic features. The third step comprises the 2D forward modeling of the gravimetric anomalies using the 2D seismic interpretation as a constraint. The final step compiled all the interpreted features into our new structural map. This map reveals the top of the basement, forming a complex framework of horsts and grabens. Normal faults define the main structural style in the basin. Further, we could recognize thick, high-density bodies embedded in the crystalline basement. These bodies consist of Orosian-Calimian (1.8-1.6 Ga) mafic and ultramafic rocks, which may be a potential source for hydrogen exploration in the basin. Subsequent geophysical and geochemical surveys will assess the hydrogen potential in the area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8d2ac3c656d9de215de92be634010f04c739037248f7d07acbf4cb4d1f168107","category":"Interdisciplinary"}