{"title":"Top Stories: New MacBook Pro Models Enter Mass Production, iOS 15 Beta 5, and More","link":"https://www.macrumors.com/2021/08/14/top-stories-macbook-pro-mass-production/","date":1628946000000,"content":"While much of the rumor mill remains focused on the imminent debut of the iPhone 13 lineup in just about a month, many Mac fans have been holding out for the redesigned MacBook Pro models. A new report says they've finally entered mass production, so keep your fingers crossed that they're coming soon.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/Top-Stories-71-Thumbnail.jpg\" />\r\n<br />\r\nOther news this week included rumors about a redesigned MacBook Air coming next year, a fresh round of operating system betas that saw Apple continuing to make tweaks, and additional fallout from Apple's child safety measures announced last week, so read on below for details on all of these stories!\r\n<br />\r\n\r\n<br />\r\n<h2>14-inch and 16-inch MacBook Pros Finally Enter Mass Production</h2>\r\n<br />\r\nAfter months of rumors about redesigned 14-inch and 16-inch MacBook Pro models with Apple silicon, a report this week claimed that the notebooks <a href=\"https://www.macrumors.com/2021/08/09/redesigned-macbook-pros-entering-mass-production/\">have finally entered mass production</a>. We've rounded up <a href=\"https://www.macrumors.com/guide/14-inch-macbook-pro/\">everything to expect from the new MacBook Pro models</a>, which are expected to launch later this year as part of Apple's busy fall season.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/16-inch-macbook-pro-m2-render.jpg\" />\r\n<br />\r\nApple is also expected to launch its <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13 models</a> this fall, followed by a redesigned MacBook Air next year, and we've rounded up the latest rumors about those devices and other top stories below.\r\n<br />\r\n\r\n<br />\r\n<h2>Redesigned MacBook Air With Mini-LED Display and Several Color Options Expected to Launch Next Year</h2>\r\n<br />\r\nFollowing the release of the MacBook Air with an M1 chip in November 2020, rumors suggest Apple is planning another update to the notebook with an even faster Apple silicon chip for release next year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/prosser-macbook-air-colors-stacked-for-feature-bar.jpg\" />\r\n<br />\r\nThe details came from reputable analyst Ming-Chi Kuo, who in a research note this week claimed the <a href=\"https://www.macrumors.com/2021/08/10/kuo-colorful-macbook-air-mid-2022/\">new MacBook Air will feature a mini-LED display and come in several new color options</a> like the new 24-inch iMac.\r\n<br />\r\n\r\n<br />\r\n<h2>iPhone 13 Said to Feature ProRes for Videos, Portrait Mode Video, Smaller Notch, and More</h2>\r\n<br />\r\nWe're likely around a month away from Apple unveiling its next-generation iPhone 13 lineup, and we continue to learn more about potential features.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/iPhone-13-Dummy-Thumbnail-2.jpg\" />\r\n<br />\r\nAccording to <em>Bloomberg</em>'s Mark Gurman, the upcoming iPhones <a href=\"https://www.macrumors.com/2021/08/10/iphone-13-pro-res-video-portait-mode/\">will have new software features like ProRes for videos and Portrait Mode videos</a>, while research firm TrendForce said the devices will have <a href=\"https://www.macrumors.com/2021/08/12/iphone-13-release-date-and-features/\">larger batteries, mmWave 5G support in additional countries, and more</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Fall 2021 Apple Event Rumors: iPhones in September, MacBook Pros in Late October, and More</h2>\r\n<br />\r\nSpeaking of that iPhone 13 introduction, we've put together an overview of <a href=\"https://www.macrumors.com/2021/08/12/2021-fall-apple-event-rumor-roundup/\">what we might be able to expect as far as upcoming Apple media events</a>. We're expecting the iPhone introduction to return to its usual early-mid September timeframe, and we're likely to also see the Apple Watch Series 7 and potentially updated AirPods at this event.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/cook-april-2021-event-hype.jpg\" />\r\n<br />\r\nWe're likely to see at least one other event before the end of the year to introduce the new MacBook Pro models and perhaps a few other products. Based on Apple's usual timing and one rumor, late October seems to be the most likely window for this event.\r\n<br />\r\n\r\n<br />\r\n<h2>Everything New in iOS 15 Beta 5</h2>\r\n<br />\r\nApple seeded the fifth betas of iOS 15 and iPadOS 15 to developers and public testers this week, and as usual, we've <a href=\"https://www.macrumors.com/2021/08/10/everything-new-in-ios-15-beta-5/\">rounded up all of the new features and changes</a>. We have also shared <a href=\"https://www.youtube.com/watch?v=l4PLszsgyQ0\">a video of everything new on our YouTube channel</a>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/iOS-15-beta-5-Thumbnail.jpg\" />\r\n<br />\r\nApple also seeded the <a href=\"https://www.macrumors.com/2021/08/11/apple-seeds-macos-monterey-beta-5/\">fifth beta of macOS Monterey</a> to developers and public beta testers this week, and publicly released a <a href=\"https://www.macrumors.com/2021/08/11/apple-releases-macos-11-5-2/\">minor new version of macOS Big Sur</a> with bug fixes.\r\n<br />\r\n\r\n<br />\r\n<h2>Apple Publishes FAQ to Address Concerns About Planned Child Safety Features</h2>\r\n<br />\r\nLast week, Apple <a href=\"https://www.macrumors.com/2021/08/05/apple-new-child-safety-features/\">previewed new child safety features</a> that it said will be coming to the iPhone, iPad, and Mac with software updates later this year, including the ability for Apple to detect known Child Sexual Abuse Material (CSAM) images stored in iCloud Photos.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/iphone-communication-safety-feature.jpg\" />\r\n<br />\r\nThe planned child safety features have been quite controversial, <a href=\"https://www.macrumors.com/2021/08/13/apple-employees-concerns-over-csam/\">including among Apple's own employees</a>, and in an attempt to address concerns, <a href=\"https://www.macrumors.com/2021/08/09/apple-faq-csam-detection-messages-scanning/\">Apple has published a detailed FAQ with more information</a>. Apple executive <a href=\"https://www.macrumors.com/2021/08/13/federighi-confusion-around-child-safety-details/\">Craig Federighi has also spoken up</a> to address some of the confusion around the issue.\r\n<br />\r\n\r\n<br />\r\n<h3>MacRumors Newsletter</h3>\r\n<br />\r\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r\n<br />\r\n\r\n<br />\r\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/aug-12-2021\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/14/top-stories-macbook-pro-mass-production/\">Top Stories: New MacBook Pro Models Enter Mass Production, iOS 15 Beta 5, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-new-macbook-pro-models-enter-mass-production-ios-15-beta-5-and-more.2307526/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5i09DnuHWYk:yXnSjGtFM00:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=5i09DnuHWYk:yXnSjGtFM00:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/5i09DnuHWYk\" />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8d30577c45d894613daa2e1a9a4f48620efffb577ce91a650043a4dde1e7fe7e","category":"Apple"}