{"title":"Assessing the efficacy of cinnamon compounds against <i>H</i>. <i>pylori</i> through molecular docking, MD Simulations and ADMET analyses","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299378","date":1710165600000,"content":"<p>by Muhammad Farhan Sarwar, Afnan Zahra, Mudassar Fareed Awan, Sajed Ali, Muhammad Shafiq, Khursheed Muzammil</p>\r\n\r\nAntibiotics are the drugs that are used for the management of microbial diseases. However, these conventional synthetic drugs can harmfully affect the human health. Since phytochemicals are extracted from natural sources and, are hence relatively safer for human health, they are the enticing alternatives in this regard. Cinnamon is also one of those plants which is being employed as herbal medication for centuries against certain microbial infections due its significant therapeutic effectiveness. A well-known pathogenic bacterium called <i>H</i>. <i>pylori</i> causes a wide range of illnesses in human body. This pathogen’s pathogenicity is determined by certain virulent proteins. In this study, some of such proteins, which included <i>virB4</i>, <i>virB8</i>, and <i>virB9</i> were selected to evaluate the therapeutic efficiency of cinnamon compounds. These proteins were identified in different isolates of <i>H</i>. <i>pylori</i>. The structural modelling of all these proteins were performed initially in order to proceed them for molecular docking analysis. While, the docking studies illustrated that one of the cinnamon compounds, <i>cinnamyl acetate</i>, showed significant binding interactions with <i>virB4</i> and <i>virB9</i>. However, <i>benzyl benzoate</i> which is another cinnamon compound, docked well with <i>virB8</i>. Afterwards, the MD simulations were incorporated to explore the interaction motions and structural stability of all the docked complexes. In this regard, the resultant maps of Bfactor, eigenvalues and elastic network model, among other factors ensured the structural stabilities of all the respective complexes. After these crucial estimations, <i>benzyl benzoate</i> and <i>cinnamyl acetate</i> underwent the ADMET investigation to assess their pharmacokinetic characteristics. SwissADME and ADMETLab 2.0 server were employed for this investigation. The compiled findings these servers revealed that both, <i>benzyl benzoate</i> and <i>cinnamyl acetate</i>, exhibited a significant level of pharmacokinetic and drug-likeness conformity.","author":"Muhammad Farhan Sarwar","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d328f0292699aebc56c66bc5671de4cfacfa68c77289f6888de9aac7e1d440e","category":"Interdisciplinary"}