{"title":"Validation of field-based running tests to determine maximal aerobic speed in professional rugby league","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306062","date":1721224800000,"content":"<p>by Thomas Bennett, Phil Marshall, Steve Barrett, James J. Malone, Andrew Simpson, James Bray, Calum Christopherson, Tom Nickolay, James Metcalfe, Chris Towlson</p>\r\n\r\nPractitioners place importance on high-speed running (HSR) to monitor training practice and match-play demands, whilst attempting to maximise fitness and minimize the risk of injury occurrence. Practitioners apply various methods to quantify HSR, such as absolute thresholds, percentage of maximum sprint speed and maximal aerobic speed (MAS). A recent survey demonstrates the 5-minute run and 1200m shuttle test (ST) to be implemented among rugby league practitioners to quantify HSR by incorporating MAS. However, it is unclear as to how valid these methods are to accurately quantify MAS. Therefore, the aim of this study was to assess the validity of the 5-minute run and 1200m ST when compared to a gold standard measure for MAS. Twenty 1<sup>st</sup> team professional rugby league players competing in the European Super League participated in this study. Players were required to complete an incremental treadmill test, 5-minute run and 1200m ST over a two-week period in pre-season. MAS, peak heart rate (HR<sub>max</sub>), peak lactate (La<sub>peak</sub>) and rating of perceived exertion (RPE) where collected upon completion of each test. Results demonstrated the 1200m ST to have a higher correlation for MAS than the 5-minute run (1200m ST: r = 0.73, 5-minute run: r = 0.64). However, when assessing validity using the level of agreement between data, the 5-minute run underreported MAS by 0.45 m·s<sup>-1</sup> whereas the 1200m ST underreported MAS by 0.77 m·s<sup>-1</sup>. Ultimately, both field-based tests used in this study underreport MAS when compared to an incremental treadmill test, although the 5-minute run provides a closer agreement and therefore a more valid measurement for MAS than the 1200m ST.","author":"Thomas Bennett","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d33f515274275ac6badc30a2e62e6933782aa77d46ad51853f1901d75f3cb75","category":"Interdisciplinary"}