{"title":"Evaluation of the physicochemical and bacteriological quality of water wells in Khenifra province (Morocco)","link":"http://link.springer.com/10.1007/s40808-023-01902-3","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Groundwater exists beneath the Earth's surface in soil, sand, and rocks. It is a crucial resource for communities and ecosystems, particularly in areas where surface water is limited. In addition, it supports various activities, including drinking and irrigation. The present research aims to evaluate the quality of groundwater used for drinking and irrigation in the Khenifra province (Morocco) using the Water Quality Index (WQI), statistical analysis, and a combination of physicochemical and microbiological methods. From May 2021 to April 2022, we have collected fourteen samples from different wells in the Khenifra province and analyzed their physicochemical and bacteriological parameters. According to the findings, the majority of wells satisfy Moroccan potability requirements. They are categorized as the sole predominant facies that contain calcium sulfates and magnesium chlorides. However, statistical analysis revealed a significant and positive relationship between the proliferation of total coliforms, fecal coliforms, and temperature changes. Therefore, evaluating water quality often involves assessing both physicochemical and bacteriological parameters, which are interdependent. In addition, high concentrations of total coliforms (T.C) (6 to 6.1 × 10<sup>2</sup> CFUs/100 ml), fecal coliforms (F.C) (7 to 6 × 10<sup>2</sup> CFUs/100 ml), and fecal streptococci (F.S) (1 to 3.77 × 10<sup>2</sup> CFUs/100 ml) were found in some well samples, indicating microbial contamination. A high concentration of bacteria in the wells may pose a risk to the general public's health and the environment. A high concentration of microorganisms in the wells can be a potential danger to the environment and public health. On the other hand, all wells have a Water Quality Index that ranges between 57 and 71, indicating good water quality. However, in order to lessen the risk to public consumption, it is imperative to decrease the microbiological contamination of the wells.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"8d33bb103fe5a1fb43dd34901d6e20e3ebbbd6d3cfcca10bc8a9784fb7631792","category":"Environment"}