{"title":"EU เตรียมออกกฎ ผู้ผลิตสมาร์ทโฟนต้องอัพเดตแพตช์-อะไหล่นาน 5 ปี เยอรมนีอาจกำหนด 7 ปี","link":"https://www.blognone.com/node/124605","date":1630911074000,"content":"<div><div><div><p>Heise สื่อเยอรมันรายงานข่าวว่า คณะกรรมการยุโรป (European Commission) กำลังจะออกกฎให้ผู้ผลิตสมาร์ทโฟนต้องซัพพอร์ตสินค้านาน 5 ปี ทั้งในแง่การออกแพตช์ความปลอดภัยและการจัดหาอะไหล่เพื่อซ่อมแซม แต่รัฐบาลเยอรมันอาจไปไกลกว่านั้น โดยขยายระยะเวลานานถึง 7 ปี</p>\n<p>แนวคิดของคณะกรรมการยุโรปเป็นเรื่องสิ่งแวดล้อม ที่มองว่าสมาร์ทโฟนและแท็บเล็ตมีระยะเวลาใช้งานเฉลี่ย 2.5-3.5 ปี สั้นกว่าอุปกรณ์อิเล็กทรอนิกส์ประเภทอื่น จึงร่างกฎที่จะบังคับใช้ในปี 2023 คือ</p>\n<ul>\n<li>การันตีระยะเวลาออกแพตช์ความปลอดภัยอย่างน้อย 5 ปี และอัพเดตความสามารถ OS อย่างน้อย 3 ปี</li>\n<li>แบตเตอรี่ต้องมีความจุเหลืออย่างน้อย 80% หลังจากชาร์จไปแล้ว 500 รอบ และสามารถเปลี่ยนแบตโดยผู้ใช้ได้ หรือถ้าแบตเปลี่ยนไม่ได้ ต้องชาร์จได้อย่างน้อย 1,000 รอบ</li>\n<li>ผู้ผลิตสมาร์ทโฟนต้องจัดหาอะไหล่ของชิ้นส่วนต่างๆ เช่น กล้อง แบตเตอรี่ ไมโครโฟน ฯลฯ​ ให้กับร้านซ่อมอิสระ เป็นเวลาอย่างน้อย 5 ปีหลังวางขาย (ถ้าเป็นแท็บเล็ตต้อง 6 ปี เพราะอายุการใช้งานยาวนานกว่า)</li>\n<li>ราคาอะไหล่ต้องประกาศต่อสาธารณะ และไม่สามารถขึ้นราคาได้ในภายหลัง คู่มือการซ่อมเครื่องต้องหาซื้อได้ในราคาที่เหมาะสม</li>\n<li>สมาร์ทโฟนจะต้องทนทานต่อการตก 1 เมตร 100 ครั้งแล้วยังไม่พัง และต้องกันน้ำกระเด็นใส่</li>\n</ul>\n<p>Heise ยังรายงานว่ารัฐบาลเยอรมันต้องการไปไกลกว่านั้น โดยขยายระยะเวลาอัพเดตแพตช์และจัดหาอะไหล่เป็น 7 ปี</p>\n<p>ข้อเสนอนี้ถูกคัดค้านโดย<a href=\"https://www.digitaleurope.org/corporate/\">สมาคม DigitalEurope</a> ซึ่งมีบริษัทไอทียักษ์ใหญ่ 87 แห่งเป็นสมาชิก (รวมถึงผู้ผลิตมือถือรายใหญ่ของโลกเกือบทุกราย เช่น Apple, Huawei, Samsung, Xiaomi, Oppo) ที่มองว่าควรการันตีอัพเดต OS แค่ 2 ปี และอัพเดตแพตช์ 3 ปี ส่วนเรื่องอะไหล่ควรมีแค่แบตเตอรี่และจอภาพเท่านั้น รวมถึงมองว่าการกำหนดแบตเตอรี่ชาร์จ 1,000 รอบเป็นเรื่องที่ทำได้ยากในทางปฏิบัติ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/77b2d35947a44e905404a8f7fbc0972b.jpg\" /></p>\n<p>ภาพจาก <a href=\"https://www.samsung.com/ae/samsung-experience-store/services-support/repair/\">Samsung</a></p>\n<p>ที่มา - <a href=\"https://www.heise.de/news/EU-plant-Energielabel-und-strenge-Umweltregeln-fuer-Smartphones-und-Tablets-6171979.html\">Heise (1)</a>, <a href=\"https://www.heise.de/news/Bundesregierung-Smartphones-sollen-sieben-Jahre-lang-Updates-erhalten-6179995.html\">Heise (2)</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/europe\">Europe</a></div><div><a href=\"/topics/european-commission\">European Commission</a></div><div><a href=\"/topics/germany\">Germany</a></div><div><a href=\"/topics/smartphone\">Smartphone</a></div><div><a href=\"/topics/right-to-repair\">Right-to-Repair</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8d454b7e95e3102daaabade09266ad970cd27626b946c3d424fb4a6fc18989b8","category":"Thai"}