{"title":"A novel ionic liquid-entrapped MIL-101(Cr) framework with enhanced removal efficiency towards phosphate from aqueous solution","link":"http://link.springer.com/10.1007/s11356-024-33062-x","date":1711929600000,"content":"<h3>Abstract</h3>\n                  <p>Developing adsorbent materials with high adsorptive dephosphorization (ADP) is significant for treating phosphate from aqueous solutions and eutrophic water. Herein, the MIL-101(Cr) framework was entrapped ionic liquid (IL) of 1-butyl-3-methylimidazoliumbromide ionic liquid ([C<sub>4</sub>mem]<sup>+</sup>[Br]<sup>−</sup>) using a ship-in-a-bottle approach to obtain novel adsorbents [C<sub>4</sub>mem]<sup>+</sup>[Br]<sup>−</sup>@MIL-101(Cr) contained varied IL contents, namely C<sub>4</sub>mem@MIL-101. The characterization results revealed that the formed [C<sub>4</sub>mem]<sup>+</sup>[Br]<sup>−</sup> molecules interacted with the MIL-101(Cr) frameworks, enhanced their stability, and offered additional adsorption sites. The batch adsorptions of phosphate showed that the optimized C<sub>4</sub>mem@MIL-101 adsorbent loaded with ~ 7% IL-based N content had the highest phosphate absorbing capacity of ~ 200 mg/g, outperforming the pristine MIL-101(Cr) and other adsorbents. The ADP efficiency was facilitated in the acidic media, where the phosphate ions of H<sub>2</sub>PO<sub>4</sub><sup>−</sup> and HPO<sub>4</sub><sup>2−</sup> captured onto the C<sub>4</sub>mem@MIL-101 via several interactions, including electrostatic attraction, H-bonds, and chemical interactions. In the meantime, the coexisting anions diminished the phosphate adsorption because they competed with the pollutants at adsorption sites. Furthermore, phosphate treatment under the continuous fixed-bed conditions showed that 1 g of the polyvinyl alcohol (PVA)-mixed C<sub>4</sub>mem@MIL-101 pellets purified 25 l of water containing phosphate with a 1 mg/l concentration. The results suggest that the novel [C<sub>4</sub>mem]<sup>+</sup>[Br]<sup>−</sup>@MIL-101(Cr) structure had a high potential for treating phosphate in aqueous solutions.</p>\n                  <span>\n                    <h3>Graphical Abstract</h3>\n                    <p><span>\n                      <span>\n                        <img src=\"https://static-content.springer.com/image/MediaObjects/11356_2024_33062_Figa_HTML.png\" />\n                      </span>\n                    </span></p>\n                  </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"8d4c8e1e72293a3415edf8abf827202e728547a6b0f8413f54a9b888d17f4781","category":"Environment"}