{"title":"รู้จักกับ KKP กลุ่มธุรกิจการเงินเกียรตินาคินภัทร ที่พร้อมเติบโตแบบก้าวกระโดดด้วยเทคโนโลยี","link":"https://www.blognone.com/node/133872","date":1684378847000,"content":"<div><div><div><p>ในช่วง 3-4 ปีมานี้ อุตสาหกรรมการเงินและการลงทุนได้เปลี่ยนแปลงไปจนจำภาพในอดีตแทบไม่ได้ ทั้งการใช้ อี-แบงก์กิ้ง ผ่านสมาร์ทโฟน การจ่ายเงินหรือโอนเงินด้วยการสแกน QR Code ที่ใช้กันง่ายๆ ทั่วไปตั้งแต่พี่วินมอเตอร์ไซค์ แม่ค้าข้าวแกงในตลาด ไปจนถึงร้านหรูๆ จากระบบที่หลายคนเคยคิดว่าต้องใช้เวลานานกว่าจะเข้าถึงคนหมู่มากได้นั้น กลายเป็นระบบที่ทุกคนต้องมี ต้องใช้ และขาดไม่ได้เลยในตอนนี้</p>\n<p>ด้วยเหตุนี้ ทำให้เทคโนโลยีที่เกี่ยวข้องกับการเงินและการลงทุนต่างๆ มีความสำคัญเพิ่มมากขึ้นหลายเท่าตัว ทั้งการสร้างนวัตกรรมใหม่ๆ ที่ช่วยให้ลูกค้าสะดวกสบายมากขึ้น และการดูแลรักษาระบบเหล่านี้ให้มีความเสถียร ลูกค้าใช้งานได้ไม่สะดุด</p>\n<p>จากการเปลี่ยนแปลงที่เกิดขึ้น ทำให้ธุรกิจการเงินและการลงทุนมีการแข่งขันกันอย่างดุเดือด โดยกลุ่มธุรกิจการเงินเกียรตินาคินภัทร หรือ KKP ก็ได้เร่งพัฒนาเทคโนโลยีและสร้างนวัตกรรมใหม่ๆ อย่างต่อเนื่องเช่นกัน โดยล่าสุดได้พัฒนาแอปพลิเคชัน KKP MOBILE ให้กลายเป็น Super App ที่ทำได้ครบจบในแอปเดียวทั้งการเปิดบัญชี โอนเงิน จ่ายบิล ซื้อประกัน ขอสินเชื่อ และลงทุนผ่านฟีเจอร์ EDGE Invest นอกจากนี้ยังได้เปิดตัวแอปพลิเคชัน Dime! ทางเลือกใหม่สำหรับลูกค้าที่ต้องการฝากเงิน หรือลงทุนด้วยเงินเริ่มต้นที่ต่ำที่สุด</p>\n<p>ปัจจุบัน KKP กำลังมุ่งหน้าพัฒนาระบบไอทีและแอปพลิเคชันต่างๆ ของธนาคาร ที่กำลังเติบโตแบบก้าวกระโดด เพื่อมุ่งสู่การเป็นธนาคารดิจิทัลที่มีคุณภาพ พร้อมมองหาชาวไอทีรุ่นใหม่ไฟแรงเข้ามาร่วมงานและเติบโตไปด้วยกัน</p>\n<p>หนึ่งในหัวเรือใหญ่ของ KKP ที่คอยชี้แนะทิศทางการพัฒนาและการเติบโตในสมรภูมิ อี-แบงก์กิ้ง ที่กำลังร้อนระอุ ก็คือ <strong>พี่ฟิลิป เชียง ชอง แทน กรรมการผู้จัดการใหญ่ ธนาคารเกียรตินาคินภัทร (President of Kiatnakin Phatra Bank)</strong>   ซึ่งจะมาเล่าถึงจุดแข็ง และสิ่งที่ดึงดูดให้คนเข้ามาทำงานกับ KKP ให้พวกเราชาว Blognone ฟังกัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b68b4e6d70e8cccc0dbcca57a93b844b.jpg\" /></p>\n<h3>จุดแข็งของ “เกียรตินาคินภัทร” คืออะไร?</h3>\n<p>พี่ฟิลิปเล่าให้เราฟังว่า จุดเด่นของวัฒนธรรมองค์กรของ KKP หลักๆ มี 3 ข้อ คือ</p>\n<ol>\n<li><strong>เป็นองค์กรไทยที่มีวิสัยทัศน์ระดับโลก</strong> เราทำงานอย่างเข้าใจบริบทคนไทยและประเทศ  แต่ให้บริการแบบมาตรฐานโลก ด้วยระบบการทำงานที่เป็นสากล คุยกันด้วยเหตุผล และได้เปรียบองค์กรอื่นในอุตสาหกรรมเดียวกันตรงที่เป็นธนาคารใหม่ที่มีอายุน้อยกว่า มีระเบียบขั้นตอนที่ยุ่งยากน้อยกว่า จึงทำให้มีความคล่องตัวมากกว่า</li>\n<li><strong>เป็นองค์กรใหม่ที่มีโอกาสเติบโตสูง</strong> เพราะยังมีความท้าทายใหม่ๆ มีสิ่งใหม่ๆ ให้ได้ลองทำอยู่เสมอ เป็นช่วงเวลาที่สนุก แต่พี่ฟิลิปก็ย้ำว่าสนุกในที่นี้ไม่ได้แปลว่าจะเข้ามาเจองานง่ายๆ เรายังต้องทุ่มเททำงาน และอาจมีช่วงที่ต้องเหนื่อยบ้าง ซึ่งเหมาะสำหรับคนที่พร้อมจะเติบโตไปด้วยกัน โดยในช่วง 3 ปีที่ผ่านมา KKP ก็สามารถเติบโตได้ถึง 60% แม้ว่าจะต้องเจอกับวิกฤตโรคโควิดระบาดก็ตาม</li>\n<li><strong>มีวัฒนธรรมองค์กรที่ดีและยุติธรรม</strong> การเลื่อนตำแหน่งดูกันที่ผลงาน แข่งกันที่ความสามารถ ไม่เกี่ยวกับใครอยู่นานกว่าใคร โดยพี่ฟิลิปยกตัวอย่างตำแหน่งรองกรรมการบริหาร (Executive Vice President) ที่เฉลี่ยอายุการทำงานกับ KKP อยู่ที่ราวๆ คนละ 8 ปี เท่านั้น รวมทั้งเรื่องสวัสดิการที่เน้นความเท่าเทียม เบิกค่ารักษาพยาบาลได้เท่ากันทุกระดับ ไม่มีใครมีสิทธิพิเศษเหนือกว่าใคร แม้แต่ซีอีโอก็ยังต้องมาจับฉลากจองที่จอดรถเหมือนกับพนักงานทุกคน</li>\n</ol>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6f7b10640aa89dccfe838bb27c1560ac.jpg\" /><em>คุณฟิลิป เชียง ชอง แทน, กรรมการผู้จัดการใหญ่ ธนาคารเกียรตินาคินภัทร</em></p>\n<h3>ทำไมถึงควรทำงานกับ KKP?</h3>\n<p>ในคำถามนี้ พี่ฟิลิปตอบเราได้แบบเต็มปากเต็มคำว่า “ตั้งแต่ทำงานมา ไม่ว่าจะเป็นบริษัทเล็กหรือใหญ่ ไม่ว่าจะเป็นบริษัทในไทยหรือต่างชาติก็ตาม KKP เป็นที่ทำงานที่ทำให้พี่ฟิลิปมีความสุขที่สุด แม้จะทำงานหนักแต่ก็กลับบ้านนอนหลับสบาย ไม่ต้องมากังวลเรื่องการเมืองภายใน หัวหน้างานและผู้บริหารทุกระดับพร้อมที่จะสนับสนุนพนักงาน  คุยกันด้วยเหตุผล ทุกคนอยู่กันด้วยผลงาน ทุกงานที่ทำไม่ได้เกิดจากการถูกสั่งให้ทำ แต่มาจากการที่ทุกคนรู้ว่า สิ่งที่ทำนั้นจะช่วยให้ KKP ดีขึ้นได้อย่างไร”</p>\n<p>พี่ฟิลิปบอกว่า “ถ้าคุณเป็นคนสายไอทีที่ได้เข้ามาร่วมงานกับ KKP คุณจะได้ลงมือทำงานจริง ได้พบกับวัฒนธรรมการทำงานที่สนุกสนานและยุติธรรมแน่นอน ในขณะเดียวกัน เรายังเปิดโอกาสให้คนรุ่นใหม่ได้ลองเข้ามาทำงานกับ KKP และมอบโอกาสให้ทุกคนได้สร้างการเติบโตไปด้วยกัน”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3f7130b77768ed527a1908ac62f27204.jpg\" /></p>\n<h3>KKP อยากได้คนไอทีแบบไหน?</h3>\n<p>พี่ฟิลิปมองว่า คำพูดที่ว่าดิจิทัลคืออนาคตอาจจะเก่าไปแล้ว ตอนนี้ดิจิทัลคือปัจจุบัน และการจะทำดิจิทัลให้เป็นปัจจุบันได้สำเร็จจริงนั้น KKP ต้องการคนรุ่นใหม่ไฟแรงที่เป็น Digital Native ที่มีความคิดแตกต่างและแปลกใหม่เข้ามาร่วมงาน ซึ่งการที่ KKP เป็นธนาคารที่ยังใหม่ ทำให้เราพร้อมมอบโอกาสให้คนรุ่นใหม่ไฟแรงได้ลองเข้ามาทำสิ่งใหม่ๆ นี้ไปด้วยกัน”</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6121e86278a8e99675a9fa510995ba23.jpg\" /></p>\n<p>นอกจากพี่ฟิลิปแล้ว Blognone ยังได้พูดคุยกับพี่หมิง เพ็ญรุ่ง สุวรรณกูฏ รองกรรมการผู้จัดการใหญ่ ประธานสายบริหารทรัพยากรบุคคล (Head of Human Resources Management Group) ที่จะมาเล่าถึงวัฒนธรรมองค์กรของ KKP ที่มีเอกลักษณ์เฉพาะตัวให้เราฟังกัน</p>\n<h3>ทำไม KKP ถึงเป็นที่ทำงานที่มีความสุข?</h3>\n<p>พี่หมิงเล่าว่าใน KKP เน้นให้ทุกคนมีอิทธิบาทต่องาน และมีพรหมวิหารต่อกัน โดยพี่หมิงมองว่าอิทธิบาทต่องานเป็นพื้นฐานแห่งความสำเร็จ หมายความถึงมีความรักและศรัทธาในสิ่งที่ทำ มีความเพียร มุ่งมั่น ไม่ลดละ เอาใจใส่ในทุกรายละเอียดของงาน รู้จังหวะถอยออกมาเพื่อทบทวนและปรับปรุงเพื่อให้งานสำเร็จเป็นเลิศ ในขณะเดียวกันเราก็มีพรหมวิหารต่อกันก็คือการที่ผู้ร่วมงานมีความปรารถนาดีต่อกัน มีความเห็นอกเห็นใจ มีความยินดีกับความสำเร็จของคนอื่น รู้จักวางเฉย มีใจเป็นกลางไม่เอนเอียง ทำให้เรามีความสุข และองค์กรก็มีบรรยากาศการทำงานที่มีความสุข ทำให้ KKP เป็นองค์กรที่น่าอยู่ น่าทำงาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/23e4925d4c0d77de368d030317bc7b17.jpg\" /><em>คุณเพ็ญรุ่ง สุวรรณกูฏ, รองกรรมการผู้จัดการใหญ่ ประธานสายบริหารทรัพยากรบุคคล</em></p>\n<p>นอกจากนี้ KKP ยังให้ความสำคัญกับการสื่อสารเพื่อให้พนักงานเข้าใจหลักองค์กรและสามารถนำหลักองค์กรไปใช้ในการทำงานได้อย่างเป็นธรรมชาติ โดยมีตัวอย่างของพนักงานที่คิดพูดทำตามหลักองค์กรเพื่อให้เกิดความเข้าใจที่ชัดเจน รวมถึงการคัดเลือกคนเก่งและคนดี ซึ่งเป็นคนที่มีทัศนคติและความเชื่อสอดคล้องไปกับหลักองค์กรเข้ามาร่วมงานกัน ตัวอย่างเช่น เป็นคนที่ใจสู้เมื่อเจอเรื่องยาก เมื่อแพ้รีบลุก ไม่สำเร็จไม่เลิก มีความกระหายชัยชนะ ทำเกินดีกว่าขาด และสามารถทำงานร่วมกันผู้อื่นได้ เป็นต้น</p>\n<h3>คำมั่นสัญญาของ KKP</h3>\n<p>เพราะพนักงานคือทรัพย์สินที่มีค่ามากที่สุดขององค์กร KKP จึงมุ่งมั่นตั้งใจอยากให้พนักงานทุกคนที่มาร่วมงานกับเรามีโอกาสคว้า 5 ได้ ซึ่งมีดังนี้</p>\n<ol>\n<li><strong>ได้เรียน</strong> ต้องมีความกระตือรือร้นในการเรียนรู้ตลอดไป หรือเป็น Lifelong Learning</li>\n<li><strong>ได้ทำ</strong> โอกาสได้ลงมือทำ และได้ใช้ทักษะ มาแสดงฝีมืออย่างเต็มศักยภาพ</li>\n<li><strong>ได้ตังค์</strong> ได้ผลตอบแทนที่คุ้มค่ากับงานที่ทำ</li>\n<li><strong>ได้มันส์</strong> มีความสุข ตื่นมาอยากมาทำงาน มีแรงจูงใจที่จะทำงานอย่างเต็มประสิทธิภาพ มีบรรยากาศที่สร้างสรรค์</li>\n<li><strong>ได้ภูมิใจ</strong> ได้รู้ว่าสิ่งที่ทำนั้นนอกจากสร้างประโยชน์ให้กับตัวเอง ลูกค้า องค์กร ผู้ถือหุ้นแล้ว ยังสร้างประโยชน์ให้สังคมอีกด้วย</li>\n</ol>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/22666705490e190baf413deb85b403d5.jpg\" /></p>\n<h3>โอกาสเปิดกว้าง พร้อมรับทุกไอเดียอย่างเท่าเทียม</h3>\n<p>พี่หมิงย้ำว่า KKP เป็นองค์กรที่รับฟังทุกความคิดเห็นด้วยใจที่เปิดกว้าง ถ้ามีไอเดียเด็ดๆ ที่สามารถช่วยแก้ไขปัญหาต่างๆ ที่คาราคาซังได้ก็ไม่ต้องนำเสนอหลายขั้นตอนให้ซับซ้อนยุ่งยาก ขอแค่เป็นไอเดียที่ดีพอ ผ่านการปรึกษากันมาแล้ว เช็กแล้ว ก็สามารถนำไปคุยกับผู้บริหารต่อได้ง่ายๆ</p>\n<p>นอกจากนี้ KKP ยังมีระบบ Internal Transfer ที่พนักงานสามารถขอโอนย้ายไปทำงานในส่วนที่สนใจ หรือรู้สึกว่าอยากพัฒนาทำให้ได้ พร้อมมีระบบสนับสนุนช่วยให้พนักงานก้าวไปในเส้นทางที่ต้องการเติบโตได้อย่างเต็มที่</p>\n<h3>สวัสดิการที่ตอบโจทย์และเท่าเทียม</h3>\n<p>เช่นเดียวกับที่พี่ฟิลิปได้พูดไว้ก่อนหน้านี้ พี่หมิงเองก็เน้นย้ำเรื่องสวัสดิการค่ารักษาพยาบาลของ KKP อีกครั้งว่า ไม่ว่าจะเป็นพนักงานระดับไหน ทุกคนจะได้รับสวัสดิการที่ดีเช่นเดียวกัน นอกจากนี้ ยังให้อิสระในการแต่งกาย เปิดกว้างต่อ LGBTQ มีสวัสดิการให้คู่สมรสที่ไม่ได้จำกัดอยู่แค่คู่สมรสชายหญิงเท่านั้น รวมทั้งมีความยืดหยุ่นในการทำงาน สามารถทำงานจากบ้านได้ (สำหรับบางตำแหน่งที่เหมาะสม) ช่วยลดเวลาเดินทาง ทำให้พนักงานแบ่งเวลาชีวิตได้ดีขึ้น หรือถ้าเข้ามาทำงานที่สำนักงานใหญ่ (อโศก) ก็มีฟิตเนสให้ได้ออกกำลังกาย และมี Co-Working Space ให้พนักงานทำงานร่วมกัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3a0a9bce1da2b8bb9c8620459dfe1670.jpg\" /></p>\n<h3>เสียงจากคนทำงานจริงที่ KKP</h3>\n<p>นอกจากคำตอบของพี่ๆ ผู้บริหารทั้งสองคนแล้ว เสียงสำคัญที่จะขาดไปไม่ได้เลยก็คือ เสียงตอบรับจากเพื่อนพนักงานฝ่ายไอทีที่ทำงานอยู่ที่ KKP ซึ่งน่าจะตอบคำถามได้โดนใจพวกเราดีที่สุดว่า บรรยากาศการทำงานและความเป็นอยู่ที่ KKP จริงๆ แล้วเป็นอย่างไรบ้าง โดย Blognone ได้ไปสัมภาษณ์ชาวไอทีของ KKP มาฝาก</p>\n<p>**เบล อัฐพร ธนชาญโรจน์สกุล Senior Mobile Developer*** ดูแลด้านทีม Delivery ฝ่าย Digital Innovation มีหน้าที่คิดนวัตกรรมใหม่ๆ ให้กับ KKP</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/863e7a4aaa3e61a85fcef66e6b3b13a6.jpg\" /></p>\n<p>เบลเล่าว่า เพราะ KKP เป็นองค์กรที่ไม่ได้มีลำดับขั้นซับซ้อน ทุกคนอยู่ในระนาบเดียวกัน ทำให้ทุกคนในทีมแสดงความคิดเห็นได้เต็มที่ ทุกคนมีสิทธิ์มีเสียงในการทำงานเท่ากัน ได้จับงานที่ทำเต็มที่ แถมเวลาทำงานไม่ว่าจะทีมไหนก็พร้อมจะช่วยเหลือกันโดยเน้นความสำเร็จของงานเป็นสิ่งสำคัญ นอกจากเรื่องวัฒนธรรมการทำงานแล้ว สวัสดิการของ KKP เท่าที่เบลเปรียบเทียบมา ก็เรียกได้ว่าอยู่ในแนวหน้าของธุรกิจธนาคาร ไม่ว่าจะเป็นเงินโบนัส การรักษาพยาบาล วันหยุด วันลา และความยืดหยุ่นในการทำงาน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/73b90897d60461a836ccb0a835e99811.jpg\" /></p>\n<p><strong>ใหม่ พัชรี ตีระวัฒนานนท์ Senior Business Analyst</strong> มีหน้าที่รับความต้องการจากฝั่ง Business ในฝ่ายต่างๆ มาออกแบบโซลูชันร่วมกับทีมไอที และพัฒนาระบบมาตอบสนองธุรกิจใหม่ของ KKP เพื่อช่วยให้ฝ่ายต่างๆ ทำงานได้ง่ายขึ้น ไปจนถึงการซัพพอร์ตผู้ใช้งาน และทีมหลังจากที่โปรดักต์นั้นขึ้นสู่โปรดักชันไปแล้ว</p>\n<p>ใหม่มองว่าสิ่งที่ต่างจากการทำงานที่อื่น คือที่ KKP เปิดกว้างในการแสดงความคิดเห็น ทุกความเห็นจะมีคนรับฟังเสมอ นอกจากนี้ด้วยความที่องค์กรไม่ได้ซับซ้อนหรือมีระยะห่างของแต่ละตำแหน่งมากจนเกินไป ก็ทำให้พนักงานได้เรียนรู้สิ่งใหม่ๆ และได้รับคำแนะนำจากผู้บริหารเก่งๆ อยู่เสมอและยังเปิดกว้างในการเปลี่ยนแปลงเพื่อเติบโต ถ้าอยากย้ายสายหรือลองไปทำหน้าที่อื่นก็สามารถทำได้ ถ้าใครที่กำลังมองหาโอกาสในการเติบโต ไปพร้อมๆ กับได้ผลตอบแทนที่คุ้มค่าจากการทำงานที่เต็มที่ ก็จะไม่ผิดหวังกับ KKP แน่นอน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e6d1965ea22c277755690046dccc7cc9.jpg\" /></p>\n<p>สำหรับคนไอทีที่กำลังมองหางานในธุรกิจธนาคาร แต่ก็ไม่อยากไปทำงานในองค์กรที่มีลำดับขั้นซับซ้อน และอยากทำงานในองค์กรที่มีความทันสมัย เต็มเปี่ยมไปด้วยโอกาส มีพื้นที่ให้สามารถสร้างการเติบโตไปพร้อมๆ กันกับองค์กรได้อีกมาก KKP ก็เป็นอีกหนึ่งกลุ่มธุรกิจฯ ในแวดวงธนาคารและการลงทุนที่นอกจากจะมั่นคงแล้ว ยังสามารถผลักดันหน้าที่การงานของเราให้เติบโตไปข้างหน้าได้ พร้อมกับมีความท้าทายอีกมากมายรอเราอยู่เสมอ</p>\n<p>ใครที่สนใจ สามารถดูรายละเอียดเพิ่มเติมและตำแหน่งที่เปิดรับได้ที่ <a href=\"https://career.kkpfg.com/\">https://career.kkpfg.com/</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kiatnakin-phatra\">Kiatnakin Phatra</a></div><div><a href=\"/topics/blognone-workplace\">Blognone Workplace</a></div></div></div>","author":"workplace","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8d4e60e4cc26482b1d058938adf856c37066bbbc58a30bbf4a14dad3ef02ac92","category":"Thai"}