{"title":"‘If I set myself a target, I’d regret it if I only gave 80%’: Interview with Shirin van Anrooij","link":"https://www.cyclist.co.uk/in-depth/shirin-van-anrooij-cyclist","date":1682417623000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/shirin-van-anrooij-cyclist\">‘If I set myself a target, I’d regret it if I only gave 80%’: Interview with Shirin van Anrooij</a></p>\n\n<p><em>At 21 years old, Shirin van Anrooij is arguably the hottest prospect in women’s cycling, she won the white jersey at last year’s Tour de France Femmes, is the U23 Cyclocross World Champion and recently won her first elite road title, Trofeo Alfredo Binda</em>.</p>\n\n\n\n<p><strong>You’ve had an incredible three or four months where success seems to have bred success…</strong></p>\n\n\n\n<p>I feel like I did as a second-year junior when everything just clicked. You fall into this positive flow and you just want to keep going. I made a big step up in <a href=\"https://www.cyclist.co.uk/tags/trek-segafredo\" target=\"_blank\">Trek-Segafredo’s</a> December training camp, which gave me confidence for the cyclocross season. My winter aim was to secure my first cyclocross UCI World Cup podium, so to win three times and finish third overall was incredible.</p>\n\n\n<div>\n<figure><img width=\"728\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-728x970.jpg\" alt=\"Shirin van Anrooij\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-728x970.jpg 728w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-225x300.jpg 225w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-768x1024.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-1152x1536.jpg 1152w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-750x1000.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2-1140x1520.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-2.jpg 1200w\" /><figcaption>Dan King / Trek-Segafredo</figcaption></figure></div>\n\n\n<p><strong>And that flow has continued into the start of the road season.</strong></p>\n\n\n\n<p>In the winter, so many road cyclists are doing base miles and building endurance, and that’s not always possible because of cyclocross, but it does mean you start the road season strongly because you’ve essentially had a winter of interval training. It also sets you up for a race like Strade [Bianche, where she was ninth in 2022] and its gravel roads.</p>\n\n\n\n<p><strong>You rose to prominence by winning the young rider classification at last year’s Tour de France Femmes. How did you feel about your new-found fame?</strong></p>\n\n\n\n<p>The attention was overwhelming with the fans and all the media but I really enjoyed it. I wasn’t down to race, and it was only around three weeks before that I was brought in. It was into the unknown as I’d never ridden a multi-stage race longer than four days but I felt good until the final day, when I just felt tired. It was also the first time I’d had to get used to such an intense period of fuelling on gels and bars – I felt full but I knew I needed to eat more. It was a big learning experience.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"842\" height=\"297\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg 842w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-750x265.jpg 750w\" /></a><figcaption></figcaption></figure></div>\n\n\n<p><strong>We recently read Team DSM’s nutritionist say there’s a steep nutritional learning curve on the women’s side. Is that your experience?</strong></p>\n\n\n\n<p>Yes, many female riders are scared to eat more because they’re concerned they’ll put on weight. Many of the men will be, ‘Yeah, of course we need to eat because we’re riding so much,’ whereas the women can drive themselves crazy because they think losing weight means you’ll be faster uphill. That’s not the case. Thankfully, we have a great nutritionist who doesn’t focus on the calculations. She doesn’t want us counting calories or weighing food. She just doesn’t want us feeling hungry and ensures we eat enough. Sometimes the female riders can be too hard on themselves. A cake treat is no bad thing.</p>\n\n\n\n<p><strong>How did you first get into cycling?</strong></p>\n\n\n\n<p>My mum used to be a cyclist and so did my sister, so I began cycling early – I had my first road bike at five or six. I enjoyed athletics too and used to compete in triathlon. I enjoyed the riding and running but didn’t love the swimming, so moved on. The junior national cycling coach then called me up and I ended up riding the UCI Junior Nations’ Cup. It wasn’t long before I’d signed to Trek-Segafredo as a stagiaire [in 2020], won the UCI Junior World Cyclocross Championships and earned my neo-pro contract.</p>\n\n\n\n<p>Interestingly, I’ve started running again this winter. I run once a week with my brother. It helps with the cyclocross but I’m hoping to continue it through the summer. I find it relaxing and it’s good for strengthening your bones. Our national team is increasingly focussing on bone density and has us skipping with a rope to drive up the impacts.</p>\n\n\n<div>\n<figure><img width=\"970\" height=\"728\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-970x728.jpg\" alt=\"Shirin van Anrooij\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-970x728.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-300x225.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-768x576.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-750x563.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3-1140x855.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/shirin-van-anrooij-3.jpg 1200w\" /><figcaption>Dan King / Trek-Segafredo</figcaption></figure></div>\n\n\n<p><strong>Annemiek van Vleuten, Marianne Vos, Ellen van Dijk… The Netherlands has a great tradition of producing world-class cyclists. How come?</strong></p>\n\n\n\n<p>It starts from an early age as every kid goes to school by bike. My primary school was 1km away, then at high school it was 8km. We all rode. I’d ride on my heavy bike and then at home I’d swap for my road bike and train with friends. I know that’s different to many countries. I remember talking to Elynor [Bäckstedt, teammate], who would always wear high-visibility clothing, have her lights on and even wear a GoPro in search of being safer. That would never cross my mind as it’s so safe to ride your bike in the Netherlands. There are bike paths everywhere and you’re just not afraid of being hit by a car.</p>\n\n\n\n<p><strong>The UK has seen a huge drop-off in the number of girls engaging in sport. Is that happening in the Netherlands?</strong></p>\n\n\n\n<p>Many of the girls I rode with didn’t continue riding competitively but they continued to commute in their teenage years, which is so important for your mind and body. But I’ve always loved riding my bike. My friends would tell tales of partying and getting drunk, while I’d be telling them stories of how I’d be racing hard in mud for an hour. It also helps that I don’t like alcohol. Yes, you make sacrifices in this sport, like missing out on friends’ birthdays or concerts because you’re travelling, training or racing, but I’ve always been goal-oriented. If I set myself a target, I’d regret it if I only gave 80%.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/emily-chappell-ultracyclist\">‘Professional sport isn’t a healthy atmosphere for a lot of people’: Interview with 2016 Transcontinental Race winner Emily Chappell</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/trek-segafredo-winter-training-camp\">Mixed fortunes: Inside Trek-Segafredo’s winter training camp</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/going-it-alone-ellen-van-dijk-profile\">Going it alone: Ellen van Dijk profile</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p><strong>Were you an academic youngster?</strong></p>\n\n\n\n<p>Yes, and I still am. I’m studying psychology and in the future would love to study sports psychology as a Masters. I started off by studying at Maastricht University but I needed to be there four times a week and it just became too much trying to balance that with my cycling. Now I study online and will complete it over five or six years. When I get home from a ride, I can watch the lecture so it’s pretty easy.</p>\n\n\n\n<p><strong>Finally, how’s the rest of your season panning out?</strong></p>\n\n\n\n<p>After Binda the focus is on the Ardennes Classics. I love races like La Flèche Wallonne as I love those hills [Van Anrooij finished third at Amstel Gold Race and 15th in both La Fléche Wallonne and Liège-Bastogne-Liège]. Mind you, I don’t know why the Dutch riders are so often good at hills as we don’t have many of them. Then the plan is to support Elisa [Longo Borghini] and Amanda [Spratt] at La Vuelta [1st-7th May]. It’s then onto Vuelta a Burgos Feminas [18th-21st May] followed by an altitude camp, which I usually respond positively to, before the time-trial nationals.</p>\n\n\n\n<p>This is an important race as I’ll look to qualify for the time-trial worlds in Glasgow. With Annemiek [van Vleuten] talking of retiring this year, I might also have a chance of racing the 2024 Olympic time-trial for the Netherlands. And I’m racing the Giro d’Italia Donne [30th June-9th July] instead of the Tour. I’ll go there as a protected rider but not yet GC. But ultimately I think that’s where my future lies. As do my coaches.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/shirin-van-anrooij-cyclist\">‘If I set myself a target, I’d regret it if I only gave 80%’: Interview with Shirin van Anrooij</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8d515c9fd03d5e0482449bf14590b4ebabd415466e140d414bb57c24e2cdea03","category":"Cycling"}