{"title":"The cumulative contribution of direct and indirect traumas to the production of PTSD","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307593","date":1723644000000,"content":"<p>by Dan Even, Gregory H. Cohen, Ruochen Wang, Sandro Galea</p>\r\nObjective <p>Posttraumatic Stress Disorder (PTSD) affects millions of people worldwide. While the relationship between direct exposure to traumatic events and PTSD is well-established, the influence of indirect trauma exposure on PTSD remains unclear. It is similarly unclear what role cumulative exposure to direct and indirect traumas play in the risk of PTSD.</p> Methods <p>The study uses data from the Houston Trauma and Recovery Study, conducted on 2020–2021, and involved a random sampling of 1,167 individuals residing in Houston during Hurricane Harvey in 2017. Participants were asked about their experiences related to both Hurricane Harvey and the subsequent COVID-19 pandemic. Exposures were categorized as direct or indirect traumas, in line with the criteria delineated in the fifth edition of the Diagnostic and Statistical Manual of Mental Disorders (DSM-5). Cumulative exposures were also calculated.</p> Results <p>Among participants, 12.6% were experiencing current PTSD. There were significant associations between both direct [OR = 3.18, 95% CI 1.85, 5.46] and indirect [OR = 1.91, 95% CI 1.05, 3.46] traumas related to Harvey, as well as direct [OR = 2.13, 95% CI 1.20, 3.77] and indirect [OR = 1.69, 95% CI 0.93, 3.09] traumas due to COVID and the risk of PTSD in fully adjusted models. Further, significant associations were found between the cumulative exposure to traumas from both Hurricane Harvey and COVID-19 and the risk of PTSD, considering both direct [OR = 2.53, 95% CI 1.36, 4.70] and indirect exposures [OR = 2.79, 95% CI 1.47, 5.28].</p> Conclusions <p>Our study offers support for connections between exposure to both direct and indirect traumas stemming from large-scale disasters and PTSD. Moreover, we show that cumulative exposures to multiple large-scale events increase the risk of PTSD. This highlights the importance of the consideration of a range of exposures as risks for PTSD, particularly in a time of compounding disasters and broad population exposures to these events.</p>","author":"Dan Even","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d5579233a8a9b74e2707ac317d7c582a8908caa7f64a4d318ea1d7a5b0960b9","category":"Interdisciplinary"}