{"title":"Absence of alka(e)nes triggers profound remodeling of glycerolipid and carotenoid composition in cyanobacteria membrane","link":"https://academic.oup.com/plphys/article/196/1/397/7689884?rss=1","date":1717718400000,"content":"<span><div>Abstract</div>Alka(e)nes are produced by many living organisms and exhibit diverse physiological roles, reflecting a high functional versatility. Alka(e)nes serve as waterproof wax in plants, communicating pheromones for insects, and microbial signaling molecules in some bacteria. Although alka(e)nes have been found in cyanobacteria and algal chloroplasts, their importance for photosynthetic membranes has remained elusive. In this study, we investigated the consequences of the absence of alka(e)nes on membrane lipid composition and photosynthesis using the cyanobacterium <span>Synechocystis</span> PCC6803 as a model organism. By following the dynamics of membrane lipids and the photosynthetic performance in strains defected and altered in alka(e)ne biosynthesis, we show that drastic changes in the glycerolipid contents occur in the absence of alka(e)nes, including a decrease in the membrane carotenoid content, a decrease in some digalactosyldiacylglycerol (DGDG) species and a parallel increase in monogalactosyldiacylglycerol (MGDG) species. These changes are associated with a higher susceptibility of photosynthesis and growth to high light in alka(e)ne-deficient strains. All these phenotypes are reversed by expressing an algal photoenzyme producing alka(e)nes from fatty acids. Therefore, alkenes, despite their low abundance, are an essential component of the lipid composition of membranes. The profound remodeling of lipid composition that results from their absence suggests that they play an important role in one or more membrane properties in cyanobacteria. Moreover, the lipid compensatory mechanism observed is not sufficient to restore normal functioning of the photosynthetic membranes, particularly under high-light intensity. We conclude that alka(e)nes play a crucial role in maintaining the lipid homeostasis of thylakoid membranes, thereby contributing to the proper functioning of photosynthesis, particularly under elevated light intensities.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"8d584fc92085f38c4deac7fd781348880dbf43835d76d9fefdc29b3e5966ce99","category":"Environment"}