{"title":"Dishy McFlatface to become “fully mobile,” allowing Starlink use away from home","link":"https://arstechnica.com/?p=1757978","date":1618853757000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/starlink-dish-800x600.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/starlink-dish.jpg\">Enlarge</a> <span>/</span> A Starlink satellite dish in the Idaho panhandle's Coeur d'Alene National Forest. (credit: <a href=\"https://imgur.com/a/XUN7nRV\">Wandering-coder</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>SpaceX CEO Elon Musk expects the Starlink satellite broadband service to be \"fully mobile\" later in 2021, allowing customers to use the satellite dishes away from home.</p>\n<p>\"Yeah, should be fully mobile later this year, so you can move it anywhere or use it on an RV or truck in motion. We need a few more satellite launches to achieve comp[l]ete coverage &amp; some key software upgrades,\" Musk <a href=\"https://twitter.com/elonmusk/status/1382842277719003136\">wrote on Twitter</a> Thursday.</p>\n<p>SpaceX revealed a portion of its mobile plans last month when it <a href=\"https://arstechnica.com/information-technology/2021/03/spacex-plans-starlink-broadband-for-cars-boats-and-planes/\">asked</a> the Federal Communications Commission for permission to deploy a modified version of its user terminal to moving vehicles. But while that application is for a not-yet-released version of the terminal with \"mountings that allow them to be installed on vehicles, vessels, and aircraft,\" Musk's comment about Starlink being \"fully mobile\" later this year was in reference to the standard terminal that has been deployed to beta customers the past few months.</p></div><p><a href=\"https://arstechnica.com/?p=1757978#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1757978&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8d5c1c21b19a94f0d7e66c2b8d3407c373aa6191c9d33ac6dbaeab2c8d5b648a","category":"Tech"}