{"title":"AI เป็นเรื่องของความน่าจะเป็น","link":"https://markpeak.net/ai-is-about-pattern-matching/","date":1688527329000,"content":"<p>Benedict Evans หนึ่งในนักคิดสายไอทีที่ติดตามอยู่ เขียนบล็อกเรื่อง <a href=\"https://www.ben-evans.com/benedictevans/2023/7/2/working-with-ai\">AI and the automation of work</a> กล่าวถึงผลกระทบของ AI ต่อ “ตลาดแรงงาน” ว่าควรเป็นไปในทางใดกันแน่ ระหว่างทำให้คนตกงาน กับเพิ่มจำนวนงานให้มากขึ้น</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.ben-evans.com/benedictevans/2023/7/2/working-with-ai\">\n\t\t\t\t\t<img src=\"http://static1.squarespace.com/static/50363cf324ac8e905e7df861/5055cb1de4b0a751cabaedd5/6492ff3078695b7b2d072912/1688657078075/2880px-Ilia_Efimovich_Repin_%281844-1930%29_-_Volga_Boatmen_%281870-1873%29.jpg?format=1500w\" alt=\"AI and the automation of work — Benedict Evans\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.ben-evans.com/benedictevans/2023/7/2/working-with-ai\">\n\t\t\tAI and the automation of work — Benedict Evans\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.ben-evans.com/benedictevans/2023/7/2/working-with-ai\">\n\t\t\t<p>ChatGPT and generative AI will change how we work, but how different is this to all the other waves of automation of the last 200 years? What does it mean for employment? Disruption? Coal consumption?</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"https://images.squarespace-cdn.com/content/v1/50363cf324ac8e905e7df861/ebdb4645-db93-4967-881d-db698ee59c2c/favicon.ico?format=100w\" alt=\"Benedict Evans\" />\t\tBenedict Evans\t</div>\n</div>\n<p>มุมมองของ Benedict อยู่ฝ่ายหลัง โดยเขาอ้างหลักการที่เรียกว่า <a href=\"https://en.wikipedia.org/wiki/Jevons_paradox\">Jevons Paradox</a> ของนักเศรษฐศาสตร์ชาวอังกฤษ William Jevons ที่ตั้งคำถามถึงเศรษฐกิจอังกฤษยุคศตวรรษที่ 19 ซึ่งภาคอุตสาหกรรมกำลังเติบโตด้วยพลังจากถ่านหิน</p>\n<p>คำถามของ Jevons คืออังกฤษเรามีถ่านหินอยู่มาก แต่ถ้าถ่านหินหมดประเทศแล้วจะเกิดอะไรขึ้น มุมมองของวิศวกรทั่วไปจะบอกว่า ประสิทธิภาพ (efficiency) ของเครื่องจักรไอน้ำจะดีขึ้นเรื่อยๆ จนทำให้เราใช้ถ่านหินน้อยลงเอง แต่ Jevons มองว่า ยิ่งเรามีเครื่องจักรที่มีประสิทธิภาพมากขึ้น ค่าใช้จ่ายจะถูกลง และเราจะใช้ถ่านหินมากขึ้นต่างหาก เพราะเปิดโอกาสให้เกิดสิ่งประดิษฐ์ใหม่ๆ ที่ไม่เคยมีมาก่อนได้</p>\n<p>Benedict ยังยกตัวอย่างเครื่องคำนวณที่ภาคธุรกิจใช้กันในอดีต สมัยก่อนนั้น เสมียนต้องคำนวณทุกอย่างด้วยมือ แต่พอมีเครื่องคำนวณเกิดขึ้น เสมียนหนึ่งคนอาจทำงานแทนเสมียน 10 คนได้ เราย่อมจ้างคนมาเป็นเสมียนน้อยลง แต่สิ่งที่เกิดขึ้นคือ เมื่อการคำนวณถูกลงมาก โลกธุรกิจจึงเพิ่มการคำนวณเข้าไปในทุกๆ เรื่องแทน</p>\n<p>Benedict ชี้ว่ามนุษย์เราหาวิธีอัตโนมัติมาแทนส่วนต่างๆ ของตัวเอง เริ่มจากขา มือ นิ้ว และล่าสุดคือสมอง การมาถึงของ Generative AI หรือ LLM ช่วยให้เราอัตโนมัติงานคิดได้แล้ว</p>\n<blockquote><p>We began with humans as beasts of burden and moved up: we automated legs, then arms, then fingers, and now brains.</p></blockquote>\n<p>บอกตามตรงว่า ผมยังไม่แน่ใจนักว่าเห็นด้วยกับมุมมองนี้ของ Benedict มากน้อยแค่ไหน เพราะในอดีต เราอัตโนมัติงานใช้ “แรง” แล้วยังใช้ความคิดของมนุษย์เป็นผู้ควบคุมมันอยู่ แต่เมื่อมาถึงยุคที่เราอัตโนมัติการ “คิด” ได้ (แม้บางส่วน) คุณประโยชน์ของมนุษย์คืออะไรกัน</p>\n<p>(<a href=\"https://markpeak.net/the-useless-class/\">มุมมองของ Yuval Harari คือไม่มี</a> คนจะอยู่ว่างไม่มีอะไรทำ เป็น Useless Class  ต้องหาอะไรสนุกๆ ให้ทำแก้เบื่อแทน เช่น เล่นเกม)</p>\n<div><img src=\"https://markpeak.net/wp-content/uploads/2023/07/starry-night.jpg\" alt width=\"1024\" height=\"1024\" srcset=\"https://markpeak.net/wp-content/uploads/2023/07/starry-night.jpg 1024w, https://markpeak.net/wp-content/uploads/2023/07/starry-night-300x300.jpg 300w, https://markpeak.net/wp-content/uploads/2023/07/starry-night-150x150.jpg 150w, https://markpeak.net/wp-content/uploads/2023/07/starry-night-768x768.jpg 768w, https://markpeak.net/wp-content/uploads/2023/07/starry-night-700x700.jpg 700w\" /><p>ลองวาดกรุงเทพด้วยสไตล์ภาพแบบ Starry Night ด้วย Dall-E</p></div>\n<p>แต่ครึ่งหลังของบทความ Benedict กลับชี้อีกประเด็นที่น่าสนใจ เขาบอกว่า AI ในปัจจุบัน ณ ปี 2023 ยังไม่สามารถมาแทนมนุษย์ได้ในทันที</p>\n<p>กระบวนการของมนุษย์เมื่อเจอเครื่องมือใหม่ๆ จะเรียนรู้ว่ามันทำอะไรได้ก่อน แต่จะยังไม่เอามันเข้ามาแทน workflow เดิมทั้งหมด (เพราะ workflow เหล่านี้ซับซ้อนและมีความเฉพาะทางสูง) จำเป็นต้องใช้เวลาอีกสักพักใหญ่ๆ ในการปรับตัวเข้าหาเครื่องมือใหม่ๆ แล้วค่อยประดิษฐ์ workflow แบบใหม่ที่เหมาะสำหรับมันขึ้นมาแทน</p>\n<p>กรณีของ Generative AI หรือ LLM นั้น ถึงแม้เราพูดกันว่ามันตอบได้ทุกเรื่อง (it can answer anything) แต่ในความเป็นจริงแล้ว คนต้องเรียนรู้ว่ามันไม่สามารถตอบคำถามแบบเป๊ะๆ ได้เลย ตัว AI จะ “พยายาม” ตอบคำถาม โดยมีโอกาสตอบผิดเสมอ</p>\n<p>ดังนั้นจริงๆ แล้ว เราไม่ได้ต้องหาให้ LLM หาคำตอบที่ถูกต้องเป๊ะๆ ให้เราเหมือนกับการค้นหาข้อมูลใน database แล้ววิ่งเอามาตอบเรา แต่เราต้องการให้มันหา “ความน่าจะเป็น” หรือ “แพทเทิร์น” แบบกว้างๆ ให้ต่างหาก</p>\n<blockquote><p>when you type something into a prompt, you’re not actually asking it to answer a question at all. Rather, you’re asking it “what sort of answers would people be likely to produce to questions that look like this?” You’re asking it to match a pattern.</p></blockquote>\n<p>สิ่งที่เราได้จาก LLM คือ “โครง” ที่ถูกต้อง แม้ “รายละเอียด” อาจผิดพลาดไปบ้าง ก็ไม่ใช่ปัญหานักหากเราเข้าใจว่ากำลังทำอะไรอยู่ และข้อจำกัดของ LLM คืออะไร</p>\n<p>ตัวอย่างคือ Benedict ลองให้ ChatGPT เขียนสรุปประวัติของตัวเขาเอง (โดยใช้ข้อมูลจากอินเทอร์เน็ตที่เทรน ChatGPT) ผลคือชื่อสถาบันการศึกษาผิด ประวัติการทำงานผิด แต่ “ประเภท” (kind) ของสถาบันการศึกษาและการทำงานนั้นถูกต้อง</p>\n<blockquote><p>It is giving 100% correct answers to the question “what kinds of degrees and jobs are people like Benedict likely to have done?” It’s not doing a database lookup: it’s making a pattern.</p></blockquote>\n<p>เขาเปรียบเทียบว่า LLM เหมือนการจ้างนักศึกษาฝึกงานที่อ่านและเข้าใจแพทเทิร์นได้ แต่เราในฐานะเจ้านายต้องตรวจสอบอีกที ตอนนี้เรามีเครื่องจักรที่สามารถ “เขียน” แพทเทิร์นออกมาให้เราได้แล้ว โดยที่เรายังต้องเช็ค ต้องตรวจสอบความถูกต้องอยู่</p>\n<blockquote><p>It is giving 100% correct answers to the question “what kinds of degrees and jobs are people like Benedict likely to have done?” It’s not doing a database lookup: it’s making a pattern.</p></blockquote>\n<p>ส่วนโลกอนาคตที่ฝันกันถึง AGI (Artificial General Intelligence) ที่ทรงปัญญา ตอบคำถามได้ทุกอย่างไม่มีผิดพลาด อันนั้นเป็นอีกประเด็นนึง และเป็นสิ่งที่น่าจะมาทดแทนคนได้อย่างสมบูรณ์ ซึ่งตอนนี้ยังไม่ใช่เวลาที่เรายังต้องมาคิดกัน</p>\n<p><em>ภาพประกอบ: ทดลองเป็น Monet ตัวปลอมด้วย Dall-E</em></p>The post <a href=\"https://markpeak.net/ai-is-about-pattern-matching/\">AI เป็นเรื่องของความน่าจะเป็น</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"8d63527d9e63e983a65876016ec2f16b18081054f311a9e765b15d7675b46512","category":"Thai"}