{"title":"ลองเล่นฟีเจอร์ Magic Eraser ของ Pixel 6 ลบคนออกจากภาพถ่ายได้เนียนแค่ไหน","link":"https://www.blognone.com/node/125857","date":1637053195000,"content":"<div><div><div><p>ฟีเจอร์ที่สร้างเสียงฮือฮาได้พอสมควรจากงานเปิดตัว Google Pixel 6 คือ Magic Eraser หรือก็คือการลบคนที่ไม่ต้องการออกจากภาพถ่ายของเราโดยใช้ AI ของกูเกิล โดยการทำงานทั้งหมดจะประมวลผลในโทรศัพท์ด้วยชิป Tensor ที่กูเกิลพัฒนาเอง ไม่มีการส่งภาพออกไปยังคลาวด์</p>\n<p>ขณะนี้ผู้เขียนใช้ Pixel 6 มาได้ราว 4 วันแล้ว เลยอยากเขียนถึงฟีเจอร์นี้ก่อนสักหน่อยครับ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/59f0b30f9b0a3c405f12dfadbafc96ef.png\" /></p>\n<p>การใช้งาน Magic Eraser ค่อนข้างง่าย โดยเมื่อเราถ่ายภาพใดๆ แล้วโทรศัพท์เดาว่ารูปนี้มีบุคคลที่ไม่เกี่ยวข้องอยู่ก็จะแนะนำขึ้นมาให้เลยว่าต้องการลบคนออกจากภาพหรือไม่ แต่หากโทรศัพท์ไม่แนะนำก็สามารถกดปุ่ม Edit &gt; Tools &gt; Magic Eraser ได้เลย เมื่อกดแล้วมันก็จะสแกนหาภาพบุคคลอีกครั้ง และไฮไลท์สีขาวที่บุคคลนั้นให้เอง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/dd376b93c6a2af21eba73bde9af17ab5.png\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f43df4e8c7cd47e7d6b4a12dd7dcbeb5.png\" /></p>\n<p>เมื่อเราแตะที่ไฮไลท์สีขาว เครื่องก็จะลบบุคคลนั้นออกจากภาพให้ทันที พร้อมใช้ AI เติมฉากหลังที่น่าจะเป็นเข้ามาให้แทน หากฉากหลังไม่ซับซ้อนมากก็จะทำได้ค่อนข้างเนียน จากภาพด้านล่างจะเห็นว่าฉากหลังไม่ซับซ้อนมาก เป็นแค่หญ้าที่พื้นกับแม่น้ำ ก็เติมได้เนียนทีเดียว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/65bec5094d846e8dc98f9fd5ffa58c08.png\" /></p>\n<p>ลองใช้งานกับภาพที่ฉากหลังซับซ้อนขึ้นมาเล็กน้อย เป็นร้านอาหารที่ฉากหลังมีทั้งพื้นถนน, ประตูทางเข้า, ประตูรั้ว และหญ้าประดับ มีบุคคลอยู่ 4 คน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7be4f62d2e92b20a9259d03864702a14.png\" /></p>\n<p>หากดูเผินๆ ก็เหมือนจะเนียน เรียกว่าพอใช้งานได้ในระดับที่ลงโซเชียลหรือส่งให้เพื่อนฝูงดู แต่หากซูมเข้าไปใกล้ๆ จะเห็นว่ารั้วเหล็กสีดำเติมได้ไม่เนียนเท่าไร และลายของซุ้มประตูเกินขอบออกมา แต่บริเวณพื้นถนนทำได้ดี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/7d43eeb8411c6a253dc536d2a613dd09.png\" /></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a2060d6bc165115a90a569e46de8f3c5.png\" /></p>\n<p>สุดท้ายเป็นการลบวัตถุหรือบุคคลออก โดยที่บุคคลมีขนาดใหญ่ และโทรศัพท์ไม่ได้แนะนำให้ลบออก เราจะต้องใช้นิ้วลากเส้นรอบบุคคลหรือวัตถุที่ต้องการลบ จากนั้นโทรศัพท์จะพยายามลบให้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/090250176951ac1f2473528481551006.png\" /></p>\n<p>จะเห็นว่าในเคสนี้ลบขาของบุคคลในภาพไปแล้วพยายามจะเติมรั้วสีขาวเข้ามา แต่ทำได้ไม่ดี ยังมีปื้นๆ สีขาว-ครีมหลงเหลืออยู่ในส่วนที่ควรจะเป็นเสาของรั้ว แต่ราวแนวนอนบนสุดของรั้วทำได้ค่อนข้างดี ต่อราวจากซ้ายไปขวาได้ถูกต้อง โดยที่มีรอยหยักเล็กน้อย นอกจากนี้ส่วนของน้ำด้านหลังก็ทำได้ปานกลาง คือมีการเติมผืนน้ำเข้ามาผสมกับไฮไลท์สีขาว ดูเผินๆ ถือว่าไม่เลวเลย และสุดท้ายตรงต้นไม้ป่าๆ ด้านหลัง จัดว่าทำได้ดีมาก เติมต้นไม้เข้ามาครบและเรียงเป็นแนวเดียวกับต้นอื่นๆ ไม่ทะลุหรือเติมสีผิดแต่อย่างใด</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/be566714786cd14269fd3f365e30ec5d.png\" /></p>\n<p>สำหรับรีวิวฉบับเต็มของ Pixel 6 จะตามมาเร็วๆ นี้ ผู้อ่านท่านใดมีข้อสงสัยอะไรเป็นพิเศษแจ้งในคอมเมนต์ได้ครับ</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel-6\">Google Pixel 6</a></div></div></div>","author":"BlackMiracle","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8d674c0fa4f9d591b8c663644dfd7bf8ce002d49c763567f4c17ee3b5ad973b1","category":"Thai"}