{"title":"Comparison of the deformity reduction device (DRD) mini and the Slocum jig in the precision of torsional correction during distal femoral osteotomies in small to medium breed dogs","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308764","date":1726495200000,"content":"<p>by Stephanie K. Steuri, Cassio Ferrigno, Adrien Hespel, Xiaojuan Zhu</p>\r\n\r\nPrevious studies have compared the use of the Slocum- jig to the deformity reduction device (DRD) jig for the correction of distal femoral deformities of varying degrees in the frontal plane. The objective of the current study is to further investigate the use of the mini DRD jig in comparison to the Slocum jig for correction of varying degrees of torsional deformities of the distal femur. Femoral models (n = 60) were developed based on a CT scan of an approximately 16.5 kg normal canine femur. Models were created with a standard varus deformity of 15 degrees, and external torsional deformities of 15, 20, or 30 degrees. Using center of rotation of angulation (CORA) methodology, corrective osteotomies were planned and performed on each of the 3D printed models based on the group assigned. Modeling clay was applied the proximal femur to mimic visualization of a routine lateral surgical approach, while retaining the ability to palpate surgical landmarks. Post-correction anatomic lateral distal femoral angle (aLDFA) and femoral torsion angle (FTA) were measured and recorded. The mean post-correction FTA of groups using the DRD jig for correction were consistently closer to the ideal value compared to those using the Slocum jig, although these differences were not always statistically significant. Correction of external torsion between the DRD jig and the Slocum jig was significantly different in groups 1 and 2 (P = 0.026 and P = 0.046), but not in group 3. For the correction of varus deformity, no significant difference was found between the two jig types in any group. Results of this study suggest jig selection during distal femoral osteotomy for correction of torsional deformity may result in varying precision of post-correction alignment. Clinical significance of this variance remains unclear, and intra-operative visual assessment of alignment should be implemented to guide corrections.","author":"Stephanie K. Steuri","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d6aeeee7cd8d28ae5cd93b2b8701271c35fa9c1ea1d2bd31fd8045038df0a9a","category":"Interdisciplinary"}