{"title":"Infection-related severe maternal outcomes and case fatality rates in 43 low and middle-income countries across the WHO regions: Results from the Global Maternal Sepsis Study (GLOSS)","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003109","date":1714053600000,"content":"<p>by Adama Baguiya, Mercedes Bonet, Vanessa Brizuela, Cristina Cuesta, Marian Knight, Pisake Lumbiganon, Edgardo Abalos, Séni Kouanda, WHO Global Maternal Sepsis Study Research Group </p>\r\n\r\nThe highest toll of maternal mortality due to infections is reported in low and middle-income countries (LMICs). However, more evidence is needed to understand the differences in infection-related severe maternal outcomes (SMO) and fatality rates across the WHO regions. This study aimed to compare the burden of infection-related SMO and case fatality rates across the WHO regions using the Global Maternal Sepsis Study (GLOSS) data. GLOSS was a hospital-based one-week inception prospective cohort study of pregnant or recently pregnant women admitted with suspected or confirmed infection in 2017. Four hundred and eight (408) hospitals from 43 LMICs in the six WHO regions were considered in this analysis. We used a logistic regression model to compare the odds of infection-related SMOs by region. We then calculated the fatality rate as the proportion of deaths over the total number of SMOs, defined as maternal deaths and near-misses. The proportion of SMO was 19.6% (n = 141) in Africa, compared to 18%(n = 22), 15.9%(n = 50), 14.7%(n = 48), 12.1%(n = 95), and 10.8%(n = 21) in the Western Pacific, European, Eastern Meditteranean, Americas, and South-Eastern Asian regions, respectively. Women in Africa were more likely to experience SMO than those in the Americas (aOR = 2.41, 95%CI: [1.78 to 2.83]), in South-East Asia (aOR = 2.60, 95%CI: [1.57 to 4.32]), and the Eastern Mediterranean region (aOR = 1.58, 95%CI: [1.08 to 2.32]). The case fatality rate was 14.3%[3.05% to 36.34%] (n/N = 3/21) and 11.4%[6.63% to 17.77%] (n/N = 16/141) in the South-East Asia and Africa, respectively. Infection-related SMOs and case fatality rates were highest in Africa and Southeast Asia. Specific attention and actions are needed to prevent infection-related maternal deaths and severe morbidity in these two regions.","author":"Adama Baguiya","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"8d6b69febd3a4326415913fec2ff753a218e44eb4c6274590c038a256de7aa86","category":"Environment"}