{"title":"A single-center retrospective study on the clinical features of thyrotoxic periodic paralysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308076","date":1722520800000,"content":"<p>by Kota Yamada, Akiyo Tanabe, Makiko Hashimoto, Mitsuru Ohsugi, Kohjiro Ueki, Hiroshi Kajio</p>\r\nPurpose <p>Thyrotoxic periodic paralysis (TPP) is characterized by muscle paralysis and significant intracellular potassium movement resulting in hypokalemia. Since TPP is a rare condition, only a few studies have explicated the clinical characteristics of patients with this disease. This study aimed to elucidate the clinical characteristics of patients with TPP by comparing them with those with thyrotoxicosis without paralysis (non-TPP) and sporadic periodic paralysis (SPP).</p> Methods <p>This was a single-center retrospective cohort study. Clinical data of patients with hyperthyroidism (n = 62) or periodic paralysis (n = 92) who were emergently admitted to our hospital was extracted from the electronic medical records and analyzed.</p> Results <p>All patients in the TPP group (15 males and 2 females) had Graves’ disease, with 14 being newly diagnosed. The average serum potassium level on admission was 2.3±0.75 mEq/L. No significant correlation was observed among serum potassium level, amount of potassium required for normalization, and thyroid hormone levels. The TPP group showed significantly younger age, higher male ratio and body mass index (BMI), and lower serum potassium and phosphorus levels than the non-TPP group, which comprised 36 patients with Graves’ disease. No significant differences were observed between the TPP and SPP (n = 11) groups in terms of age, sex, BMI, serum electrolyte levels, potassium requirement for normalization, and recovery time.</p> Main conclusions <p>Considering that most patients with TPP have undiagnosed Graves’ disease, distinguishing TPP from SPP based on clinical information and course alone is difficult in emergency settings. Therefore, for early detection and launch of specific treatment of Graves’ disease, screening for thyroid hormone and anti-thyroid stimulating hormone receptor antibody levels is necessary when treating patients with periodic paralysis.</p>","author":"Kota Yamada","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d711f6ddc81482557a4ff7972407098112b43d0b0db240b5a81efcf2d9fae3c","category":"Interdisciplinary"}