{"title":"Ubisoft ยอมรับ บริษัทยังมีปัญหาเหยียดเพศ เหยียดสีผิว","link":"https://www.blognone.com/node/123665","date":1626073188000,"content":"<div><div><div><p>Ubisoft ประสบปัญหา<a href=\"https://www.blognone.com/node/117186\">พฤติกรรมไม่เหมาะสมในที่ทำงาน</a> จนทำให้<a href=\"https://www.blognone.com/node/117418\">ผู้บริหารหลายรายต้องลาออก</a> ตั้งแต่ช่วงปีที่แล้ว จน Yves Guillemot ต้อง<a href=\"https://twitter.com/Ubisoft/status/1304087578094841856\">ทำวิดีโอขอโทษ</a> และ<a href=\"https://www.blognone.com/node/118811\">ระบุจะแก้ปัญหา</a> การเหยียดเพศ เหยียดสีผิว พฤติกรรมไม่เหมาะสม และเพิ่มความหลากหลายในที่ทำงานให้ดีขึ้น</p>\n<p>ล่าสุด Ubisoft ยอมรับถึงปัญหานี้อีกครั้งใน <a href=\"https://downloads.ctfassets.net/8aefmxkxpxwl/3d835a7MATY05YvlprREg9/cba93c9257e4d26e28e266d3d260fab1/UBI2021_URD_EN_COMPLET_Vmel_160621.pdf\">Universal Registration Document</a> รายงานประจำปี 2021 เกี่ยวกับสภาวะภายใน และงบการเงินของบริษัท ที่เผยแพร่เป็นสาธารณะ</p>\n<p>หัวข้อปัจจัยเสี่ยงเกี่ยวกับพนักงาน (หน้า 32-34) ระบุว่าบริษัทยังมีปัญหาสภาพแวดล้อมในที่ทำงานอยู่ และจัดระดับความเสี่ยงที่บริษัทจะไม่สามารถรักษาพนักงานเดิม และดึงดูดพนักงานใหม่เข้ามาสู่บริษัทได้ อยู่ที่ระดับ “สูง” โดยระบุถึงพฤติกรรมไม่เหมาะสมของพนักงาน ทั้งการล่วงละเมิด เหยียดเพศ เหยียดสีผิว และชี้ถึงเหตุการณ์ช่วงกลางเดือนมิถุนายน ปี 2020 ที่บริษัทถูกเปิดเผยพฤติกรรมเหล่านี้ ว่าอาจเป็นความเสี่ยงในการดึงดูดพนักงานใหม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/aa6a2b78b4eef7323a45fd98501cdbf4.jpg\" /></p>\n<p>เอกสารยังระบุถึงการพยายามแก้ไข เช่น การจัดอบรมเกี่ยวกับพฤติกรรมคุกคามและเหยียดเพศ รวมไปถึงการตั้งตำแหน่งใหม่ VP of Global Diversity and Inclusion เพื่อมาดูแลด้านความหลากหลายและเท่าเทียมในบริษัท แต่ก็ทิ้งท้ายว่ามาตรการเหล่านี้ ไม่การันตีว่าพฤติกรรมที่เป็นความเสี่ยงต่อบริษัทเหล่านี้จะไม่เกิดขึ้นอีก</p>\n<p>แม้แต่<a href=\"https://www.blognone.com/node/123625\">ข่าวล่าสุดของเกม Assassin's Creed Infinity</a> ก็ยังมีประเด็นเรื่องการล่วงละเมิดในที่ทำงาน เพราะทีมงานระดับสูงหลายคนของโปรเจกต์ใหม่นี้ เป็นคนเดียวกับที่เคยมีปัญหาพฤติกรรมไม่เหมาะสม แม้ Ubisoft จะบอกว่าพนักงานเหล่านี้ผ่านการสอบสวนภายในอย่างถูกต้องแล้ว แต่ก็เลี่ยงไม่ได้ที่จะส่งผลต่อความเชื่อมั่นพนักงานคนอื่น คงต้องติดตามว่า Ubisoft จะแก้ไขปัญหานี้ในระยะยาวอย่างไร</p>\n<p>ที่มา - <a href=\"https://downloads.ctfassets.net/8aefmxkxpxwl/3d835a7MATY05YvlprREg9/cba93c9257e4d26e28e266d3d260fab1/UBI2021_URD_EN_COMPLET_Vmel_160621.pdf\">Ubisoft</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ubisoft\">Ubisoft</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8d719c404b1c1793933b80f4a938cbc57f2c81fed684e9d8b6fc0e932fff2ffc","category":"Thai"}