{"title":"‘Super Mario Bros. Movie’ Passes $1 Billion in Global Box Office Revenue","link":"https://variety.com/2023/film/news/super-mario-bros-movie-1-billion-box-office-milestone-1235598832/","date":1683320242000,"content":"\n<p>Rebecca Rubin, reporting for Variety:</p>\n\n<blockquote>\n  <p><em>The Super Mario Bros. Movie</em> is officially the first film of\nthe year to cross the coveted $1 billion milestone at the global\nbox office.</p>\n\n<p>As of Sunday, after 26 days of release, the animated video game\nadaptation, from Universal, Illumination and Nintendo, has grossed\n$490 million in North America and $532 million internationally.\nIt’s only the fifth movie of pandemic times to join the $1 billion\nclub, following <em>Spider-Man: No Way Home</em>, <em>Top Gun: Maverick</em>,\n<em>Jurassic World Dominion</em> and <em>Avatar: The Way of Water</em>.</p>\n</blockquote>\n\n<p>I realize box office numbers like this aren’t inflation-adjusted, but it’s rather incredible — no pun intended — that <em>The Super Mario Bros. Movie</em> has grossed far more than <a href=\"https://www.boxofficemojo.com/brand/bn3530750466/?ref_=bo_bns_table_4\">any movie from Pixar</a> (whose list is topped by <em>The Incredibles 2</em> at $600 million). This is no ding against Pixar, but simply speaks to how valuable and beloved the Nintendo character franchise is worldwide.</p>\n\n<p>What a coup it is for Universal to score <a href=\"https://www.nintendo.com/whatsnew/super-nintendo-world-at-universal-studios-hollywood-is-officially-open-so-lets-a-go/\">this partnership with Nintendo for their theme parks</a>. When comparing Universal’s parks to Disney’s, the gaping hole has always been Disney’s menagerie of beloved characters for kids — Mickey and friends, and an ever-growing list of new characters from new movies (including Pixar’s recent rich library). Universal had jack squat<sup>*</sup> for toddlers and grade schoolers. Now, they have Super Nintendo World, which like Pixar’s stuff appeals just as much to adults as it does toddlers.</p>\n\n<p><small>* In Orlando, Universal’s Islands of Adventure park has <a href=\"https://orlandoinformer.com/universal/islands-of-adventure-seuss-landing/\">Seuss Landing</a>, but as much as I adore Seuss’s books, his characters don’t have anything close to the sort of appeal Disney’s and Nintendo’s do. Part of Seuss’s appeal is that his style is slightly creepy. And Universal has let that whole Seuss Landing get sun-bleached over time — it’s looked disregarded, if not almost abandoned, for years.</small></p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/05/super-mario-bros\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"8d77733ad7ac1135b28170afdafa95ebca4a7ce7b211a6e89d61a3f8fcc3ee2c","category":"Tech"}