{"title":"Toward an equitable transportation electrification plan: Measuring public electric vehicle charging station access disparities in Austin, Texas","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309302","date":1725544800000,"content":"<p>by Junfeng Jiao, Seung Jun Choi, Chris Nguyen</p>\r\n\r\nThe deployment of public electric vehicle charging stations (EVCS) is a critical component of transportation electrification. Recent studies have highlighted growing concerns about disparities in accessibility to public chargers between different demographic groups. This research expands ongoing equity concerns by contextualizing existing transportation equity discourse and analyzing public charger access disparities in Austin, Texas. Using threshold equity toolkits, we investigated public EVCS access disparity across different races and income groups. We conducted a generalized additive model regression to measure and visualize the effects of possible determinants on public EVCS access. The analysis results revealed that a public EVCS access disparity exists in Austin, with most chargers being installed in areas where the majority of the population is Non-Hispanic White. There was a more equal distribution of public EVCSs across income quartiles when compared with race. However, middle- and high-income groups had better access than lower-income communities in terms of distance to the nearest public EVCSs. Our regression analysis found that regional and socio-demographic factors, such as race and income, have a statistically significant impact on public charger access. The regression analysis also revealed that Austin’s current public EVCS deployment seems to favor communities above the poverty level and with higher numbers of registered electric vehicles. Local policymakers should reflect on the findings of this study to develop an equitable transportation electrification plan. Federal environmental justice plans such as the Justice40 initiative can benefit from incorporating more local contexts to better invest in disadvantaged communities.","author":"Junfeng Jiao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8d95a66519d65692b5c6475f8c843b90d1e375390804e4d6c7ad7778c22f4ae1","category":"Interdisciplinary"}