{"title":"TurboTax-maker Intuit offers an AI agent that provides financial tips","link":"https://arstechnica.com/?p=1965752","date":1694038767000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/robot_piggybank-800x450.jpg\" alt=\"Piggy bank on a laptop computer with a robotic hand.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/robot_piggybank.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/illustration/piggy-bank-and-robotic-hand-illustration-royalty-free-illustration/656294261\">Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Wednesday, TurboTax-maker Intuit <a href=\"https://www.intuit.com/blog/innovative-thinking/introducing-intuit-assist/\">launched</a> an AI assistant called \"Intuit Assist\" that can provide AI-generated financial recommendations and assist with decision-making when using the company's software, Reuters <a href=\"https://www.reuters.com/technology/turbotax-parent-intuit-integrates-generative-ai-tool-across-products-2023-09-06/\">reports</a>. Inuit Assist uses a custom large language model platform called <a href=\"https://venturebeat.com/ai/meet-intuit-assist-a-new-ai-assistant-that-can-do-more-than-just-answer-questions/\">GenOS</a>, and it is available now to all TurboTax customers and select users of Intuit's other products, including Credit Karma, QuickBooks, and Mailchimp, with a wider rollout planned in the coming months.</p>\n\n<p>\"Consumers will find it easier than ever to manage and improve their financial lives,\" the company writes on its promotional website. \"They’ll be able to get personalized recommendations throughout the year, with actions they can take to maximize their tax refund and accurately file taxes in record time with TurboTax. And they’ll be given the tools to make smart money decisions throughout their financial journey with Credit Karma.\"</p>\n<p>Intuit also sees Intuit Assist as a way to level the playing field for small and medium-sized businesses, which often lack the resources of larger companies. The AI assistant will reportedly help shorten the time it takes to file taxes and provide faster access to refunds, as well as offer personalized financial advice. Intuit Chief Data Officer Ashok Srivastava told Reuters that the company's AI models \"competed favorably\" against other AI systems in internal accuracy tests.</p></div><p><a href=\"https://arstechnica.com/?p=1965752#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1965752&amp;comments=1\">Comments</a></p>","author":"Benj Edwards","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8d95b3782575ac70b00d6c2f031df22f5fd10c170ba41fd0320a6c4bbad753f0","category":"Tech"}