{"title":"Rapid Growth of Population, GDP, and Built-up Land Exposed to High Seismic Hazard in Large Cities, China","link":"https://www.preprints.org/manuscript/202406.0705/v1","date":1718113205000,"content":"In the context of rapid urbanization, the spatiotemporal patterns of socio-economic exposed to high seismic hazard in large cities lacks quantitative assessment, thus, it is difficult to understand the evolution of earthquake catastrophe risk there. In this paper, exposure change rate, and absolute and relatively exposure indices were proposed to quantitatively study the changes of spatiotemporal exposure to high seismic hazard in urban areas of large cities (i.e., permanent residents in urban areas more than 1 million) in Chinese mainland, using a set of multi-temporal population, GDP, and built-up datasets and a seismic hazard zoning map. The results show that, 64 out of 78 large cities are entirely or partially located in high seismically hazardous zones. Although the urban areas of large cities in high seismically hazardous zones (HSHUAs) cover only 1.73% (167177 km²) of mainland China, their share of population, GDP, and built-up land amounted to 18.14%, 30.24% and 24.55%, respectively, in 2015. Unprecedented urbanization has led to a dramatic exposure growth in HSHUAs between 1990 and 2015. The population, GDP, and built-up land in HSHUAs increased by 110 million people (with an average annual growth rate of 2.37%), 273.71 trillion USD(average annual growth rate of 11.15%), and 10593 km2 (average annual growth rate of 2.02%), respectively. HSHUAs experienced much faster population and GDP growth than the whole country, while relatively slower growth in built-up land. Exposure growth in HSHUAs also was varied for different types of large cities. Megacities had a higher proportion of increased GDP and population in HSHUAs, induced by industry and population agglomeration. Whereas, Type II large cities had a higher proportion of increased built-up land in HSHUAs, driven mainly by urban sprawl. Our analysis indicates that, for large cities under rapid urbanization, it is an urgent need to strengthen resilient urban planning, renewal and construction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8da72efd843da256926e15070e24d3a1797eae218558be98de5beb9491d2845b","category":"Interdisciplinary"}