{"title":"★ Warren Beatty and Warren Beatty as Dick Tracy Debate Warren’s Beatty’s ‘Dick Tracy’","link":"https://daringfireball.net/2023/02/warren_beatty_and_dick_tracy_debate_beattys_dick_tracy","date":1677465240000,"content":"\n<p><a href=\"https://www.tvinsider.com/1081220/dick-tracy-special-tracy-zooms-in-warren-beatty-tcm/\">Dan Clarendon, writing for TV Insider</a>:</p>\n\n<blockquote>\n  <p>If you tuned into TCM on Friday, February 10, you might have been\nsurprised to see Warren Beatty, 85, back in character as Dick\nTracy, a comic-strip character he played in the 1990 film of the\nsame name.</p>\n\n<p>Written and directed by Beatty and Chris Merrill, <em><a href=\"https://youtu.be/QwYcwB_deG8\">Dick Tracy\nSpecial: Tracy Zooms In</a></em> also starred film critics Leonard Maltin\nand Ben Mankiewicz as they “interview famous detective Dick Tracy\nabout his life and career” over video chat, according to TCM’s\nsynopsis.</p>\n\n<p><a href=\"https://www.gamespot.com/articles/a-new-dick-tracy-special-starring-warren-beatty-premieres-tonight/1100-6511425/\">As GameSpot</a> and various other outlets have speculated, it seems\nBeatty produced and starred in the special to hang onto the film\nand TV rights to the Dick Tracy character, as he did in 2008 with\na TCM special in which Maltin interviewed the detective.</p>\n</blockquote>\n\n<p>The thing to note is that <a href=\"https://youtu.be/QwYcwB_deG8\">the special</a> features both Beatty in character as Dick Tracy, and Beatty as himself. And everyone plays it straight, including Maltin and Mankiewicz. It is not cinema, by any stretch, but it is absolutely worth <a href=\"https://youtu.be/QwYcwB_deG8\">watching</a>. It’s not a film but film criticism, and I think Beatty is actually very serious despite the absurd concept. As Tracy, he has good things to say about two very old adaptations, <a href=\"https://letterboxd.com/film/dick-tracy-1945/\">1945’s film starring Morgan Conway</a>, and <a href=\"https://letterboxd.com/film/dick-tracy-1937/\">1937’s starring Ralph Byrd</a>. He’s encouraging viewers to watch those old films.</p>\n\n<p>But far more interesting is everything Beatty has to say about his own 1990 film. <em><a href=\"https://letterboxd.com/film/dick-tracy/\">Dick Tracy</a></em> isn’t much talked about today, but it was a big deal at the time. Beatty was at the peak of his legendary fame and both starred and directed. Co-stars included Madonna — who simply could not have been a bigger celebrity at the time — Al Pacino, Dustin Hoffman, James Caan, Paul Sorvino, Dick Van Dyke, Mandy Patinkin, and Catherine O’Hara. The movie was packed with stars. It wasn’t a mega-hit but it was <a href=\"https://www.boxofficemojo.com/release/rl3209659905/rankings/\">a hit of some sort</a>, and very much a pop cultural sensation when it came out.</p>\n\n<p>Stylistically, it feels like Beatty’s concept was to cross Tim Burton’s 1989 <em>Batman</em> — exaggerated, absurd, gothic, gloomy (and a musical score by Danny Elfman) — with the primary color palette of the Sunday comics. The style wasn’t just over-the-top, it was <em>over-the-top</em> of over-the-top.</p>\n\n<p>But Burton’s <em>Batman</em> remains beloved. Everyone I know was excited as hell to see Michael Keaton in the role again in that Super Bowl commercial for the upcoming <a href=\"https://www.themoviedb.org/movie/298618-the-flash\">The Flash</a>. “Yeah. I’m Batman” had me and my wife jumping out of our seats. <em>Dick Tracy</em>, on the other hand, is, if not forgotten, no longer culturally relevant. A cameo from Beatty as Dick Tracy in a blockbuster movie trailer today would have most people asking “Who’s he?”</p>\n\n<p>In this new special, Beatty clearly regrets the film’s campiness. He knows he swung and missed at a chance for a classic. Both as himself and in character as Tracy again, what Beatty praises about the old 1945 and 1937 versions is their grittiness — that they were, in parts at least, played straight. Beatty, today, seems to yearn for something perhaps akin to Christopher Nolan’s Batman saga. Or perhaps, say, the modern James Bond and Mission Impossible films. Something that doesn’t hold up as “realistic” per se, but that <em>feels</em> real. Cue my oft-cited quote by Stanley Kubrick: “Sometimes the truth of a thing isn’t in the think of it, but in the feel of it.” Nolan’s Batman, Daniel Craig’s Bond, and Tom Cruise’s Mission Impossible — they <em>feel</em> real in some ways despite not <em>thinking</em> real at all.</p>\n\n<p>Something like that but about a detective in a dark mob-dominated city, set in the 1930s or 1940s. I think that could work.<sup><a href=\"#fn1-2023-02-26\">1</a></sup> And I can’t help but wonder if Beatty is genuinely thinking about making such a film. I suppose he certainly couldn’t star in it (he’s a damn good-looking 85 but he’s still 85 — octogenarians can’t star in action movies, <a href=\"https://www.themoviedb.org/movie/335977-indiana-jones-and-the-dial-of-destiny\">right</a>?) but he could direct it. Why else do this — why extend the rights for another 14 years when he’s 85 years old? I’m thinking, or at least hoping, that this very odd “Dick Tracy Special” is no mere stunt simply to squat on the rights; I think it’s a pitch to actually <em>use</em> those rights again.</p>\n\n<p>Or maybe it’s just one hell of an interesting goof.</p>\n\n<div>\n<hr />\n<ol>\n<li>\n<p>Reading <a href=\"https://en.wikipedia.org/wiki/Dick_Tracy_(1990_film)\">Wikipedia’s entry on the film</a>, that seems to have been Walter Hill’s concept — “violent and realistic” — when he was temporarily set to direct a version of the film in the mid-’80s, with Beatty in the leading role. <em><a href=\"https://mzs.press/PRE-ORDER-A-Walter-Hill-Film-Paperback-NEW-JANUARY-17-2023-RELEASE-p507350453\">Walter Fucking Hill</a> directing a violent Dick Tracy movie?</em> Man, that might have been a hell of a film. <a href=\"#fnr1-2023-02-26\">↩︎</a></p>\n</li>\n</ol>\n</div>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"8dad6514ee37f8e133cffe66a96ab89ab37773899d4f087d9c23285696ce908b","category":"Tech"}