{"title":"Long-Term Survival of LVAD Patients &ndash; A TriNetX Database Analysis","link":"https://www.preprints.org/manuscript/202406.1739/v1","date":1719371082000,"content":"Background: Donor shortage limits the utilization of heart transplantation making it available for only a fraction of the patients on the transplant wait list. Continuous flow left ventricular assist devices have therefore risen in importance as a standard of care for end-stage heart failure. Short, mid and long-term survival rates as well as quality of life are now being studied with newer and more sophisticated machines. This study attempts to assess the impact of several commonly associated risk factors on long-term survival of LVAD recipients. Methods The TriNetX dataset comprises de-identified patient information across healthcare organizations. The study assesses the impact of demographics, infections, comorbidities, types of cardiomyopathies, arrhythmias, and end-organ dysfunction on long-term LVAD survival. The Log-rank test was used to assess post-implant survival effects, while Cox regression was used in univariate analysis to obtain Hazard Ratio (HR). Patients with unknown lab results were removed before the univariate analysis and K-M survival curves were generated. Samples with missing values or data errors (e.g., implantation is after recorded death) were excluded. All analyses were conducted using the Python programming language and the lifelines library. This study is IRB-exempt Results This study identified common risk factors that significantly impact survival such as CMV, hepatitis A exposure, atrial fibrillation, paroxysmal ventricular tachycardia, ischemic cardiomyopathy, renal dysfunction, diabetes, COPD, mitral valve disease, and hypertension. Conclusions This is the first report of a detailed long-term survival assessment of several risk factors that impact the LVAD population.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8db46e255dfab117789e3dcc85d9dff337e92d2f407d0629f7b7075bc1c7602b","category":"Interdisciplinary"}