{"title":"Reddit bans r/NoNewNormal and quarantines 54 “COVID-denial subreddits”","link":"https://arstechnica.com/?p=1791572","date":1630598268000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/getty-reddit-icon-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/getty-reddit-icon.jpg\">Enlarge</a> (credit: Getty Images | stockcam)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Reddit yesterday banned r/NoNewNormal, a hub of anti-mask and anti-vaccine posts, after a protest against the platform's refusal to take more aggressive action against COVID misinformation. In a post titled \"<a href=\"https://www.reddit.com/r/redditsecurity/comments/pfyqqn/covid_denialism_and_policy_clarifications/\">COVID denialism and policy clarifications</a>,\" Reddit said it also quarantined \"54 additional COVID-denial subreddits.\" While NoNewNormal was taken off Reddit entirely, quarantining a subreddit <a href=\"https://www.reddit.com/r/help/comments/aayoxb/what_is_a_quarantined_subreddit/\">imposes restrictions</a> that \"prevent its content from being accidentally viewed by those who do not wish to do so.\"</p>\n<p>NoNewNormal was banned not for spreading misinformation but for breaking Reddit's rule against \"brigading,\" which refers to members of one subreddit conducting \"targeted interference\" in other subreddits. Reddit said:</p>\n<blockquote><p>While we want to be a place where people can explore unpopular views, it is never acceptable to interfere with other communities. Claims of \"brigading\" are common and often hard to quantify. However, in this case, we found very clear signals indicating that r/NoNewNormal was the source of around 80 brigades in the last 30 days (largely directed at communities with more mainstream views on COVID or location-based communities that have been discussing COVID restrictions). This behavior continued even after a warning was issued from our team to the Mods. r/NoNewNormal is the only subreddit in our list of high-signal subs where we have identified this behavior and it is one of the largest sources of community interference we surfaced as part of this work (we will be investigating a few other unrelated subreddits as well).</p></blockquote>\n<p>Although not mentioned in Reddit's announcement, a subreddit called CoronavirusConspiracy was also banned yesterday \"due to being unmoderated.\" That community was already <a href=\"https://web.archive.org/web/20200818194848/https://www.reddit.com/r/CoronavirusConspiracy/\">quarantined</a> last year because it \"may contain misinformation or hoax content.\"</p></div><p><a href=\"https://arstechnica.com/?p=1791572#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791572&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8dd1a1844da97ff113db1a9e4373ba6b9d0cf4ac29a1c20282a0950f43a7ba8f","category":"Tech"}