{"title":"PSIII-17 Relationship of toll-like receptor abundance in the boar reproductive tract with dihydrotestosterone prior to attainment of puberty","link":"https://academic.oup.com/jas/article/102/Supplement_3/495/7757539?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Fertile sperm production is crucial to the reproductive efficiency of swine operations; therefore, many factors impair quality semen production including hormonal imbalance and altered immune function. Toll-like receptors (TLRs) are a family of pattern recognition receptors which recognize and protect their host against pathogenic microorganisms through the regulation of inflammatory pathways. Recent data from our lab demonstrated greater expression of TLR2 mRNAs in the testes compared with other reproductive tissues (e.g., epididymis, seminal vesicles, and prostate) of pre-pubertal boars, suggesting TLR2 may aid early-in-life testes function or development. Expression of TLRs in various tissues has been shown to be influenced by hormones in rodents and humans. Dihydrotestosterone (DHT) is a sex steroid hormone and androgen that has a role in sexual development of males. However, little research has related TLRs with hormone concentration, which may help give insight to their physiological significance, particularly in the pre-pubertal male. Therefore, the objective of this project was to characterize relationships between expression of extracellular TLRs (TLR2, TLR4, TLR5 and TLR6) in the reproductive tissues (testes, epididymis, seminal vesicles, and prostate) with DHT concentrations in pre-pubertal boars. Intact reproductive tracts of pre-pubertal crossbred boars (Duroc x Landrace x Yorkshire; n = 4) were harvested at 2 mo of age and tissues were stored at –80°C for RT-qPCR analysis. From each boar, blood was collected postmortem and subsequent plasma samples stored at –20°C. Concentration of DHT in boar plasma was quantified using a competitive ELISA (MyBioSource, San Diego, CA) according to the manufacturer’s instructions. Expression of TLR2, TLR4, TLR5, and TLR6 mRNAs in the pre-pubertal boar tissues were quantified by RT-qPCR. Correlations of DHT concentration and TLR expression were calculated using Pearson Correlation within the PROC CORR function in SAS 9.4. The mean concentration of DHT was 9.32 ng/mL (range of 4.52 to 14.80 ng/mL). In the seminal vesicles, DHT concentration was significantly correlated with expression of both TLR2 (r = 0.95; <span>P</span> = 0.05) and TLR4 (r = 0.96; <span>P</span> = 0.04). In the testes, there was a tendency for a positive correlation between DHT concentration and expression of TLR2 mRNA (r = 0.92; <span>P</span> = 0.08). However, there were no correlations between DHT concentration and expression of any TLRs in the pre-pubertal boar epididymis or prostate (<span>P</span> &gt; 0.10). These results suggest a relationship between androgens and TLR expression, particularly TLR2 and TLR4 mRNAs, in specific reproductive tissues of the pre-pubertal boar. Additional work will investigate TLR expression and androgen concentration in the pubertal boar.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8dd576346e05ae5e4b098ae8310da5befafc7a9c130ec5c1e78b553246d65031","category":"Environment"}