{"title":"Health risk factors, status and service utilisation of adults in primary health care settings in Qatar: The HEALTHSIGHT study protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304160","date":1716991200000,"content":"<p>by Mohamed Ahmed Syed, Mariam Hassan, Shajitha Thekke Veettil, Tamara Marji, Hanan Khudadad, Dana Bilal El Kaissi, Abduljaleel Abdullatif Zainel, Hafiz Ahmed Mohamed, Bindya Mathew, Muslim Abbas Syed, Ahmed Sameer Alnuaimi</p>\r\nBackground <p>The emergence of non-communicable diseases (NCDs) has been well documented in recent literature which constitute a significant global burden of disease. Qatar which has a significantly high prevalence of NCDs with early on set. Epidemiological and health service utilization information plays a central role in facilitating informed decision making and application of the fundamental principles of PHC in planning and delivery of healthcare with aim to prevent and control NCDs. To enable this, the Department of Clinical Research at Primary Health Care Corporation (PHCC), Qatar’s publicly funded and largest primary care provider designed the Health Assessment Linking Trends in Health Status, Risks, and Healthcare Utilization (HEALTHSIGHT) study. This paper describes the HEALTHSIGHT study protocol.</p> Methods <p>The proposed study will use a cross sectional study design involving a random sample of participants enrolled across all 31 PHCC health centers. Individuals aged 18 and above years old registered with PHCC and hold a valid health card and contact information on PHCC’s electronic medical records (EMR) will be eligible for inclusion. A stratified random sample not proportional to size sampling technique will be employed to obtain a representative sample size of the PHCC population (N = 6000). Participants will be scheduled for an appointment at a PHCC health centre where a data collector will obtain informed consent, collect vital sign information and administer a questionnaire. A phlebotomist will collect a blood sample. Health service utilization data will be extracted from PHCC’s EMR.</p> Discussion <p>Epidemiological and health service utilization information is essential to plan and monitor primary care and public health services. The HEALTHSIGHT study, with the help of a randomly selected representative sample from Qatar’s primary healthcare settings, provides a unique opportunity to capture this information. This study design will closely represent a real-world understanding of the health risk, status and utilisation and is likely to provide important data to guide primary care planning and delivery in Qatar. The proposed protocol provides an example of a robust nationwide study that be undertaken in short duration using limited resource which can be undertaken in other similar settings.</p>","author":"Mohamed Ahmed Syed","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8dd5723e618d695612315e246208535aefbb5c03a768829cfe1c1c8b98039926","category":"Interdisciplinary"}