{"title":"Two-Tier Efficient QoE Optimization for Partitioning and Resource Allocation in UAV-Assisted MEC","link":"https://www.preprints.org/manuscript/202406.1107/v1","date":1718604167000,"content":"Unmanned aerial vehicles (UAVs) have increasingly become integral to multi-access edge computing (MEC) due to their flexibility and cost-effectiveness, especially in the B5G and 6G eras. This paper aims to enhance the Quality of Experience (QoE) in large-scale UAV-MEC networks by minimizing the shrinkage ratio through optimal decision-making in computation mode selection for each user device (UD), UAV flight trajectory, bandwidth allocation, and computing resource allocation at edge servers. However, the interdependencies among UAV trajectory, binary task offloading mode, and computing/network resource allocation across numerous IoT nodes pose significant challenges. To address these challenges, we formulate the shrinkage ratio minimization problem as a mixed-integer nonlinear programming (MINLP) problem and propose a two-tier optimization strategy. To reduce the scale of the optimization problem, we first design a low-complexity UAV partition coverage algorithm based on the Welzl method and determine the UAV flight trajectory by solving a Traveling Salesman Problem (TSP). Subsequently, we develop a coordinate descent (CD) based method and an alternating direction method of multipliers (ADMM) based method for network bandwidth and computing resource allocation in the MEC system. The CD-based method is simple to implement and has a low computational complexity, while the ADMM-based method can further enhance the optimization result through joint optimization. Extensive simulations demonstrate that our proposed algorithms perform well in large-scale edge networks and outperform other representative benchmark methods.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8dd614e2039d1b05e0af30a4049a6b3160d2da544da561ef729bbda3ef4d796c","category":"Interdisciplinary"}