{"title":"The Mayor of Nice requests relocation of final stage of Paris-Nice","link":"https://cyclingtips.com/2021/03/the-mayor-of-nice-requests-final-stage-of-paris-nice-be-relocated-to-open-promenade-to-citizens/","date":1615462344000,"content":"<p>In a series of tweets, the Mayor of Nice Christian Estrosi has requested that the final stage of Paris-Nice, set to take place on Sunday, March 14th, be relocated away from the Promenade des Anglais. </p>\n\n\n\n<p>&#8220;This evening, I convened the Scientific Council which has been accompanying me since the start of this crisis in order to take stock of the government&#8217;s decision, announced in the middle of the day, to extend the confinement by a weekend.&#8221; Estrosi wrote on Twitter.  The final tweet of the thread read; &#8220;for more consistency, I also request the cancellation of the arrival of Paris-Nice as scheduled.&#8221;</p>\n\n\n\n<p>At the moment Nice is under strict weekend lockdown, as well as a 6 pm to 6 am curfew. Estrosi said he would like to allow citizens of Nice outside for three hours on the weekends, especially for physical activity. Currently, the time limit for leaving home is one hour. The request also includes opening the promenade to pedestrians and cyclists, which would clash with the finish or Paris-Nice.</p>\n\n\n\n<blockquote class=\"twitter-tweet\"><p lang=\"fr\" dir=\"ltr\">Pour plus de cohérence, je demande également l’annulation de l’arrivée du Paris-Nice telle que programmée. <a href=\"https://twitter.com/hashtag/Nice06?src=hash&amp;ref_src=twsrc%5Etfw\">#Nice06</a></p>— Christian Estrosi (@cestrosi) <a href=\"https://twitter.com/cestrosi/status/1369746901134942212?ref_src=twsrc%5Etfw\">March 10, 2021</a></blockquote> <script async=\"\" src=\"https://platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>\n\n\n\n<p>The final stage of Paris-Nice is set to start along the 2020 Tour de France stage 2 route with the same finish where Julian Alaphillipe won early in the Tour last year. The Paris-Nice organizers already have an alternative finish planned, after they were forced to cancel the last stage in Nice in 2020, prior to the COVID-19 lockdowns across Europe. </p>\n\n\n\n<p>Prudhomme told Het Nieuwsblad, &#8220;we are very hopeful that we will reach the French Riviera this time in Paris-Nice. The [COVID-19] figures in the Alpes Maritimes are moving in the right direction. We remain calm about it. If it turns out differently, we will adapt.&#8221;</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/the-mayor-of-nice-requests-final-stage-of-paris-nice-be-relocated-to-open-promenade-to-citizens/\">The Mayor of Nice requests relocation of final stage of Paris-Nice</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8dd6f1646397d8c2702cc4766af64ce69ca756f6d576387071b5712de18967f9","category":"Cycling"}