{"title":"The Connection between Global Dynamic Managerial Capabilities and Fintech Firm Innovativeness","link":"https://www.preprints.org/manuscript/202406.0328/v1","date":1717655689000,"content":"Managers play an important role in driving the progress and progression of businesses, specifi-cally in the perspective of risky and long-term innovation. While organizational theories have acknowledged the influence of managers on strategic change, there is still a need to expand our interpretation of the global managerial abilities that drive innovation in the emerging fintech based economy. This study aims to address this research gap by leveraging the GDMC theory. It posits that GDMC (i.e., Global dynamic Managerial capabilities), encompassing managerial social capital, human capital, and cognition, directly contributes to the innovativeness of fintech firms. To investigate this relationship, the study utilized survey data obtained from Jordon manufac-turing firms operating in the context of Industry 4.0. Through regression analysis, the data were analyzed to gain insights and draw meaningful conclusions. The findings of the study affirm the significant role played by GDMC in facilitating innovation. Notably, the results deviate from previous research conducted in non-digital industries, suggesting that it is the combined set of global innovation mic capabilities that drives innovativeness in fintech firms. This study provides compelling indication for the crucial role of GDMC in the fintech based economy, challenging previous findings in non-fintech industries regarding the individual impact of managers' human capital, social capital, and cognition on innovation. In addition, this study contributes significantly to the existing literature by conducting a comprehensive examination of the effects of GDMC on innovation in fintech firms. It stands out as the first study to holistically explore this relationship, providing a nuanced understanding of the impact of GDMC. Consequently, the applicability of the GDMC theory is extended to the fintech economy.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8de06e153624d0e5d861e772fadeb76364b4684008de1063ca621d220e263dfd","category":"Interdisciplinary"}