{"title":"Netflix Password Sharing Crackdown to Expand to U.S. in Q2 2023","link":"https://www.macrumors.com/2023/04/18/netflix-password-sharing-crackdown-us-expansion/","date":1681853438000,"content":"Netflix is planning a \"broad rollout\" of the password sharing crackdown that it <a href=\"https://www.macrumors.com/2022/12/21/netflix-password-sharing-crackdown-early-2023/\">began implementing in 2022</a>, the company said today in its Q1 2023 earnings report [<a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q1/Final-Q1-23-Shareholder-Letter.pdf\">PDF</a>].\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/02/Netflix-Smaller-2.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nThe \"paid sharing\" plan that Netflix has been testing in a limited number of countries will expand to additional countries in the second quarter, including the United States. Netflix said that it was \"pleased with the results\" of the <a href=\"https://www.macrumors.com/2023/02/08/netflix-password-sharing-crackdown-canada/\">password sharing restrictions</a> that it implemented in Canada, New Zealand, Spain, and Portugal earlier this year.\r<br />\n\r<br />\nNetflix initially planned to start eliminating password sharing in the United States in the first quarter of the year, but the company said that it had learned from its tests and \"found opportunities to improve the experience for members.\" There is a \"cancel reaction\" expected in each market where paid sharing is implemented, but increased revenue comes later as borrowers activate their own Netflix accounts and existing members add \"extra member\" accounts.\r<br />\n\r<br />\nIn Canada, paid sharing resulted in a larger Netflix membership base and an acceleration in revenue growth, which has given Netflix the confidence to expand it to the United States.\r<br />\n\r<br />\nWhen Netflix brings its paid sharing rules to the United States, multi-household account use will no longer be permitted. Netflix subscribers who share an account with those who do not live with them will need to pay for an additional member. In Canada, Netflix charges $7.99 CAD for an extra member, which is around $6.\r<br />\n\r<br />\nPrices are per person, and up to two additional people can be added to an existing Netflix Standard or Premium plan. The extra price provides each person with a profile, personalized recommendations, login, and password. Alternatively, people who share a Netflix account with someone outside of their household at the current time can initiate a profile transfer process that will allow the person who has free access to the account to make their own separate, paid account.\r<br />\n\r<br />\nNetflix users will need to establish a primary location, and subscribers who are not at this location will not be able to use the service through that account. There are allowances for travel or second homes, with Netflix requiring users to open the Netflix app at the primary location once per month.\r<br />\n\r<br />\nNetflix claims that more than 100 million households are sharing accounts, which is impacting its ability to \"invest in and improve Netflix\" for paying members.<div>Tag: <a href=\"https://www.macrumors.com/guide/netflix/\">Netflix</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/18/netflix-password-sharing-crackdown-us-expansion/\">Netflix Password Sharing Crackdown to Expand to U.S. in Q2 2023</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/netflix-password-sharing-crackdown-to-expand-to-u-s-in-q2-2023.2387163/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8de2b31a3ef18d70ffb8022be45c8d927a922f687f43b778075e4afe8c498540","category":"Apple"}