{"title":"Impact of institutional support and green knowledge transfer on university students’ absorptive capacity and green entrepreneurial behavior: The moderating role of environmental responsibility","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304070","date":1716300000000,"content":"<p>by Yejun Yang</p>\r\nAim/objective <p>Given an escalated interest in fostering environmental protection, scholars have associated green entrepreneurial behavior as a stimulating factor and the cornerstone of green entrepreneurial performance. Nevertheless, the underlying mechanism that nurtures university students’ green entrepreneurial behavior is yet to be explored in the extant literature. Our study proposes the antecedent effects of institutional support and green knowledge transfer to enhance university students’ green entrepreneurial behavior. Moreover, we also expand the boundary conditions of these relationships and suggest the mediating effect of university students’ absorptive capacity and the moderating effect of environmental responsibility.</p> Methodology <p>The study samples university graduates in Chinese universities (<i>N</i> = 434) by adopting a lagged research design spanning over three months. We assessed the proposed model through the multivariate analytical technique.</p> Findings <p>The findings indicate that institutional support and green knowledge transfer significantly elevate university students’ green entrepreneurial behavior. Further, these relationships are intervened considerably through absorptive capacity’s mediating effect and environmental responsibility’s moderating effect.</p> Implications <p>By investigating the crucial roles of institutional support and green knowledge transfer in culminating university students’ green entrepreneurial behavior, our study extends the boundary conditions of these relationships and investigates the hitherto unexplored moderated mediation model.</p>","author":"Yejun Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8df1d90ddb39029a70b2c3072204387dbf37d0009fdd895f1e14bd95f42d7c99","category":"Interdisciplinary"}