{"title":"Cannabis for Tic Control: A Systematic Review and Meta-Analysis of Its Efficacy in Tourette Syndrome Management","link":"https://www.preprints.org/manuscript/202409.1392/v1","date":1726653651000,"content":"Background:Tourette syndrome (TS) is a characterized by motor and vocal tics, often accompanied by obsessive-compulsive disorder (OCD) and attention-deficit/hyperactivity disorder (ADHD). Cannabis-based medicines (CBM) present a promising avenue for future therapeutic intervention owing to their interaction with the endocannabinoid system, potentially mitigating tics and associated symptoms. Unlike conventional treatments such as antipsychotics, CBM exhibits improved tolerability and reduced side effects. While the available evidence is still limited, ongoing research underscores the potential of CBM to enhance the quality of life for patients, establishing it as a pivotal area for future therapeutic advancements in TS. Aim: In our systematic review and meta-analysis, we aim to assess the effectiveness of cannabis-based medicine (CBM) in the treatment of Tourette Syndrome. Methods: We searched in electronic databases (PubMed, Google Scholar, Science Direct, Cochrane Collaboration Database of Randomized Trials) was performed to identify cohort studies and randomized controlled trials (RCTs) up to 18th June 2024. Data extraction focused on baseline characteristics of the included studies and efficacy outcomes, including scores on the Yale Global Tic Severity Scale (YGTSS) and Premonitory Urge for Tics Scale (PUTS). We conducted the meta-analysis using Review Manager version 5.4. software. We compared the measurements before and after CBM intake using mean difference (MD) and 95% confidence interval (CI). Result: In total, 1105 articles were identified for screening, with eight studies included in the systematic review and seven in the meta-analysis. These studies involved 306 adult patients with TS treated with cannabis. YGTSS revealed a significant reduction in total scores (MD = -13.29, 95% CI [-21.67 to -4.91], P = 0.002) and PUTS revealed a significant decrease in scores (MD = -4.09, 95% CI [-7.24 to -0.93], P = 0.01). Conclusion: The research emphasizes the potential of cannabis-based medication in alleviating tics and premonitory urges associated with Tourette syndrome. While the initial results are promising, they are based on limited-scale studies. It is imperative to conduct larger, placebo-controlled trials encompassing diverse demographic groups to substantiate the effectiveness, ensure safety, and optimize dosages for long-term therapeutic advantages.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8e092f947eda6e9f09bb1dfdd787cdbb6c8de57d3711c12d4cd011174f0cb31b","category":"Interdisciplinary"}