{"title":"Effects of the interaction between tank color and type of feed pellets on biological and physiological indicators in red hybrid tilapia (Oreochromis mossambicus × Oreochromis niloticus) juveniles reared in brackish water","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13043?af=R","date":1701214410000,"content":"<h2>Abstract</h2>\n<p>The present work aimed to investigate the impacts of tank color (transparent, light blue, and red), feed pellet types (floating and sinking), and their interaction on the performance and welfare of red hybrid tilapia juveniles with an initial average weight of 19.59 g for a 50 day trial period following a 3 × 2 factorial design. Fish were cultured randomly at a stoking rate of 10 juveniles/100-L tank. Fish were fed 6 days per week at a rate of 4% biomass twice daily. Three replicates were performed for each measurement. A two-way analysis of variance showed that using tanks of different colors (transparent, light blue, and red) has no impact on the growth, feed efficacy, survival rate, and blood composition (except for red blood cells, hematocrit, and triglycerides) of tilapia. Also, pellet types (floating and sinking) showed no significant alterations for the above variables except for glucose and hematocrit levels. Interestingly, the interaction between tank color and pellet type exhibited significant impacts on growth parameters, feed utilization, blood variables, and intestinal enzymes of red hybrid tilapia. Moreover, fish reared in transparent or light blue tanks and fed with floating diets performed the best for all evaluated parameters. Additionally, sinking pellets had better effects when combined with red (dark)-colored tanks.</p>","author":"Ashraf Y. El‐Dakar, \nShymaa M. Shalaby, \nMohammed F. El Basuini, \nMayada N. Atiya, \nAl‐Shaimaa M. Yakop, \nElsayed M. Younis, \nAbdelwahab A. Abdelwarith, \nSimon J. Davies, \nMohamed F. Abdel‐Aziz","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"8e0e03eac41471b5d27dd0d6c06a4d5c14ce2a19c9bbf4364e8b5ae17749e4b6","category":"Environment"}