{"title":"Comparison of lumbar muscle morphology in patients with chronic nonspecific low back pain with and without clinical lumbar segmental instability","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301726","date":1712239200000,"content":"<p>by Faranak Mahmoudi Alami, Mohammad Taghipour, Ghadamali Talebi, Payam Sa’adat, Tahere Seyedhoseinpoor, Hamid Vahidi Rad, Sorayya Khafri</p>\r\nObjectives <p>Evaluation of spinal muscle morphology may be critical because of its impact on segmental stability and control of the lumbar spine in the subset of patients with clinical lumbar segmental instability (LSI). The purpose of this study was to compare lumbar muscle morphology in CNLBP patients with clinical LSI, CNLBP patients without clinical LSI.</p> Methods <p>This case-control study included 30 patients with CNLBP (15 with clinical LSI and 15 without clinical LSI) and 15 subjects without LBP. Axial magnetic resonance images from the L2 to S1 lumbar levels were used to evaluate the morphology of the lumbar muscles.</p> Results <p>A significant increase in the muscle-to-fat infiltration index and a significant decrease in the relative muscle cross-sectional area (rmCSA) of the multifidus muscle at the L3-L4 to L5-S1 levels were observed in both CNLBP groups compared to the control group (p&lt;0.05). The mean erector spinae mean rmCSA was significantly greater in the clinical LSI group compared to the control group (SMD = 0.853, 95% CI = 0.105 to -1.6, P = 0.044) and also compared to the CNLBP without clinical LSI (SMD = 0.894, 95% CI = -1.645 to -0.144, P = 0.030) at the L4-L5 level.</p> Conclusions <p>The atrophic changes of the multifidus muscle, in CNLBP patients with or without clinical LSI was observed. However, hypertrophic changes of the erector spinae muscle at the L4-L5 lumbar level were observed only in the clinical LSI group. Psaos major did not show significant atrophic or hypertrophic changes.</p>","author":"Faranak Mahmoudi Alami","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8e11917faff7f72a71b4da9f91d44b48a9a51c442db8485816174e900a0cdd56","category":"Interdisciplinary"}