{"title":"Apple Vision Pro Receives FCC Approval Ahead of Launch","link":"https://www.macrumors.com/2024/01/16/vision-pro-fcc-approval/","date":1705426432000,"content":"Apple today received FCC approval for the upcoming Vision Pro headset, just days ahead of when pre-orders are set to go live for the device. FCC approval comes a little over two weeks before when the Vision Pro will be in the hands of consumers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/Vision-Pro-Person.jpg\" width=\"1920\" height=\"1080\" />\r<br />\nIt is not unusual for new Apple devices to lack FCC approval until close to their launch date as it can take quite a bit of time for Apple to get products cleared. Apple devices undergo rigorous FCC testing in the United States prior to being able to be sold to the public.\r<br />\n\r<br />\nFor the last several months, Apple has been required to provide a warning message letting consumers know that the Vision Pro did not yet have FCC approval, but the wording will now be able to be removed from the website, advertising, and other places where it is printed.\r<br />\n<blockquote>Apple Vision Pro has not been authorized as required by the rules of the Federal Communications Commission. This device is not, and may not be, offered for sale or lease, or sold or leased, until authorization is obtained.</blockquote>\r<br />\nThe Vision Pro is set to go up for pre-order on Friday, January 19 at 5:00 a.m. Pacific Time. It is priced starting at $3,500.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/16/vision-pro-fcc-approval/\">Apple Vision Pro Receives FCC Approval Ahead of Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-vision-pro-receives-fcc-approval-ahead-of-launch.2416508/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8e1b6172a5c706df055ad049c70c50f9ebf779e73c221e01e354caded9ecd510","category":"Apple"}