{"title":"Source apportionment, source-specific health risks, and control factors of heavy metals in water bodies of a typical karst basin in southwestern China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309142","date":1724421600000,"content":"<p>by Dijin Mu, Jianan Meng, Sangju Wang, Shizhen Xiao, Hao Wang, Xiangxuan Sun, Pan Wu</p>\r\n\r\nStudying the apportionment of source-specific health risks and control factors for heavy metal pollution in karst regions is crucial for prevention and management. A typical karst basin was chosen in this study to investigate the pollution characteristics of heavy metals, source-specific health risks, and control factors. The results indicate that during the rainy season, As, Cd, and Pb, as well as As during the dry season, were the primary elements responsible for water pollution in the watershed. Comparative analyses showed that the absolute principal component-multiple linear regression (APCS-MLR) model better identifies and quantifies the sources of heavy metals in karst basin waters. The analysis of health risks revealed that during the dry season, heavy metals in the basin posed a moderate cancer risk to adults (10<sup>−4</sup> &lt; total cancer risk (TCR) &lt; 10<sup>−3</sup>), whereas during the rainy season, these heavy metals posed a non-cancer risk (total hazard index (THI) &gt; 1) and a moderate to high cancer risk (10<sup>−4</sup> &lt; TCR &lt; 10<sup>−2</sup>). The APCS-MLR model combined with the health risk analysis showed that Industrial waste discharge sources are the main contributors to the health of basin residents (29.39%-52.57%), making dry season As a non-cancer risk for basin residents, as well as rainy season As and Cd a non-cancer risk and a high cancer risk for basin residents. Therefore, reasonable planning for upstream industrial production should be developed, and priority should be given to monitoring and treating As and Cd pollution in water. Analyses also showed that input pathways, dilution effects, and hydrochemical characteristics may influence the spatial and temporal variability of heavy metals in the basin. The results provide essential information and significant reference for prioritising and managing the health risks associated with heavy metal pollution in water bodies in karst areas.","author":"Dijin Mu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8e2b8552dfac87658ea871126e2f3e82e6fe57a1a0326d113de95ff220f4a428","category":"Interdisciplinary"}