{"title":"Hydrothermal Carbonation and Silicification of Harzburgites and Serpentinites in Ophiolites: Geochemical and Petrological Comparison of Listwaenites from Oman and Iran","link":"https://www.preprints.org/manuscript/202406.0977/v1","date":1718350904000,"content":"Listwaenite rocks are widely spread in Fenja area of the Semail ophiolite of Oman and in Islam Abad area of the Neyriz ophiolite of Iran. There are three types of listwaenites found in these regions: silica-, carbonate-, and carbonate-silica (which includes dolomite, calcite, and magnesite. The alteration of host harzburgites started with hydrothermal alteration to serpentinite, followed by carbonation and silicification of serpentinite. Calcite- and magnesite-dolomite- listwaenites are more abundant in the Fenja area of Oman, while dolomite-listwaenites are more abundant in Islam Abad area in Iran. The mineralogy of listwaenites varies in both Iran and Oman; common minerals include quartz, calcite, goethite, magnesite, dolomite, serpentine, hematite, magnetite, Cr-mica, and Cr-spinel The major element chemistry of the different types of listwaenites in both Fenja and Islam Abad area generally comparable, and is largely similar to that of hydrothermally carbonated harzburgites, serpentinite, and listwaenites worldwide, despite spanning extraordinary and highly variable contents in major oxides, such as CaO, SiO2, MgO and LOI. Relict texture and common occurrence of Cr-spinel as well as the high concentrations of Cr, Ni and Co suggest that the protolith of the listwaenites in both regions was serpentinized harzburgites and serpentines. In comparison to the primary mantle and chondrite in spider diagrams, the Neyriz listwaenites have higher trace and REE element abundances than comparable listwaenites in the Fenja region. Harzburgite-normalized patterns of trace elements and REE in serpentinite and listwaenites overlap the average composition of harzburgite. PM-normalized trace element and REE patterns for serpentinized harzburgite and serpentinite show enrichment in Cs, U, Pb and Sr, with no Eu anomaly, comparable to mantle wedge serpentinites. The variable and high abundances of Ca, Mg, Ba, Zr, Sr, Pb, Zn, Mo and W in the carbonate- and silica-carbonate listwaenites, with unique Si enrichment and Mg, Na2O, Zr, Y, Ba, Sr, Rb, Cu, Pb, Sc, Cs, Nb, Mo and W. depletion in silica listwaenites are indicative of large fluctuations in major and trace element mobility. Cr, Ni and Co were immobile during alteration Enrichment in Ca and Si could occur by internal or late outside supply. Ca, Mg and Si are conceivably the foremost mobile major components amid harzburgite and serpentinite carbonation with mobilization confirmed by formation of quartz and Mg-carbonate in silica-carbonate listwaenites and quartz in silica listwaenites. The listwaenites in Islam Abad and Fenja area were formed due to hydrothermal alteration of serpentinite along thrust faults and shear zones which acted as pathway for Ca and/or Si rich fluids. The intensity of deformation in Islamabad listwaenites has been higher than Fenja listwaenites as indicated by higher abundance of trace elements.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8e3a67ca4ea18d0caf3c4056cf9adffb5ed6e2b0a23a9635087b0493d8e4a7fd","category":"Interdisciplinary"}