{"title":"4iiii Adds Apple Find My Feature to Power Meters: Hands-On","link":"https://www.dcrainmaker.com/2023/08/4iiii-adds-apple-find-my-feature-to-power-meters-hands-on.html","date":1691062045000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/08/4iiii-PowerMeter-FindMy-Hands-On.jpg\"><img title=\"4iiii-PowerMeter-FindMy-Hands-On\" src=\"https://media.dcrainmaker.com/images/2023/08/4iiii-PowerMeter-FindMy-Hands-On_thumb.jpg\" alt=\"4iiii-PowerMeter-FindMy-Hands-On\" width=\"720\" height=\"480\" /></a></p>\n<p>4iiii has become the first power meter company to add Apple’s Find My <a href=\"https://4iiii.com/precision-3-plus/\">support to their devices</a>. This capability is called ‘Find My’, but is essentially the 3rd party program Apple has that allows companies to make a variant of an AirTag. This allows you to track these items just like any other AirTag, with the singular exception of not having UWB (Ultra Wide Band) support, which helps when you get really close to the object but still can’t visibly see it. In the case of a power meter/bike, that’s likely less critical.</p>\n<p>In any case, let’s walk through how it all works. A couple of quick notes first:</p>\n<p>A) It requires 4iiii latest Precision 3+ units, which means existing units pods aren’t compatible by default (but wait, see below)<br />\nB) Requires an Apple iPhone, iPad, or iPod to activate</p>\n<p>On the first item, 4iiii can’t offer a simple firmware update for existing users, due to the Apple Find My requirement that each item have a unique serial number etched into it. Thus instead, 4iiii is offering a program that for $29 you can send in your compatible 4iiii power meter and get it upgraded. Given that’s the same price as an AirTag, that seems exceptionally reasonable to me. Kudos to 4iiii there.</p>\n<p>In any case, to get things activated, you’ll take your 4iiii crankset, on the left side (non-drive side), and wake it up. Then, go ahead and remove the battery and insert the battery again three times. That’ll start the pairing process. Pro Tip: You don’t need to take the battery out of the compartment, just simply twist and lift 3mm and insert again, that’ll do the trick.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/4iiii-FindMy-RemoveBattery.jpg\"><img title=\"4iiii-FindMy-RemoveBattery\" src=\"https://media.dcrainmaker.com/images/2023/08/4iiii-FindMy-RemoveBattery_thumb.jpg\" alt=\"4iiii-FindMy-RemoveBattery\" width=\"720\" height=\"480\" /></a></p>\n<p>You can see the etching here:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/DSC_7373.jpg\"><img title=\"DSC_7373\" src=\"https://media.dcrainmaker.com/images/2023/08/DSC_7373_thumb.jpg\" alt=\"DSC_7373\" width=\"713\" height=\"480\" /></a></p>\n<p>Once that’s done, go into your Apple Find My app on your phone/iPad/etc, and search for a new 3rd party item:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1382.png\"><img title=\"IMG_1382\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1382_thumb.png\" alt=\"IMG_1382\" width=\"355\" height=\"383\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1383.png\"><img title=\"IMG_1383\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1383_thumb.png\" alt=\"IMG_1383\" width=\"355\" height=\"383\" /></a></p>\n<p>It’ll find the power meter, and you can give it both a custom name and icon – just like any other AirTag:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1384.png\"><img title=\"IMG_1384\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1384_thumb.png\" alt=\"IMG_1384\" width=\"355\" height=\"383\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1387.png\"><img title=\"IMG_1387\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1387_thumb.png\" alt=\"IMG_1387\" width=\"355\" height=\"383\" /></a></p>\n<p>After that it’ll warn you to only use your powers for good, not evil, and that it’s linked to your phone number in case the police need to get involved for stalking. Obviously, this is a boilerplate Apple message for Find My devices, though, I suspect most people aren’t going to be stashing a crankset in somebody’s jacket pocket for stalking. Nobody wants an unexpected crank in their pocket.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1388.png\"><img title=\"IMG_1388\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1388_thumb.png\" alt=\"IMG_1388\" width=\"355\" height=\"633\" /></a>  <a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1389.png\"><img title=\"IMG_1389\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1389_thumb.png\" alt=\"IMG_1389\" width=\"355\" height=\"620\" /></a></p>\n<p>At that point you’re done. You can see it in your list of devices like any other AirTag, and it’ll show the serial number as well as battery status. Also, remember that with iOS 17, you can now share AirTag’s with family members (including Find My devices).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1392.png\"><img title=\"IMG_1392\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1392_thumb.png\" alt=\"IMG_1392\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1398.png\"><img title=\"IMG_1398\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1398_thumb.png\" alt=\"IMG_1398\" width=\"237\" height=\"510\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/08/IMG_1399.png\"><img title=\"IMG_1399\" src=\"https://media.dcrainmaker.com/images/2023/08/IMG_1399_thumb.png\" alt=\"IMG_1399\" width=\"237\" height=\"510\" /></a></p>\n<p>This is huge, because it finally allows you to share an AirTag with family members for devices. We have AirTags on our cargo bikes, and this allows us to easily see the location of the bike from either my account or my wife’s account. The same is true here. Certainly, my wife can generally just see where I am on a ride by looking at my FindMy location based on my phone, but if for some reason I didn’t bring it, then this can still be seen by her.</p>\n<p>Ultimately, this is super cool. While Apple and others will say it’s not for theft tracking, the reality is that it very much is. Especially in cases like this where most thieves have absolutely no idea that a power meter crankset can have an AirTag. They can use Bluetooth scanners to narrow it down, but may not understand the exact location. Further, as I’ve long said, in fancy-bike theft (like this), you’re typically looking more at the scenario of someone grabbing it from a cafe you’re at, rather than a bike left on the street locked to a pole. Thus, in those cases, they tend to be grab and run, and you often notice immediately – before someone can inspect a bike and remove an AirTag.</p>\n<p>Alternatively, if travelling, this just saves you from having to put an AirTag in a bike case as I usually do. Either way, it’s awesome stuff.</p>\n<p>Oh, and note/remember that 4iiii did try Chipolo tracking years ago, and ultimately there just wasn’t enough critical mass on the network to make it meaningfully work. Obviously, we already know the critical mass is there on Apple’s Find My, that story has been written.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/08/4iii-Power-Meter-Find-MyActivate.jpg\"><img title=\"4iii-Power-Meter-Find-MyActivate\" src=\"https://media.dcrainmaker.com/images/2023/08/4iii-Power-Meter-Find-MyActivate_thumb.jpg\" alt=\"4iii-Power-Meter-Find-MyActivate\" width=\"720\" height=\"480\" /></a></p>\n<p>Finally, note that 4iiii also released an Apple Watch app that allows power meter recording, <a href=\"https://4iiii.com/apps/ride/\">called 4iiii Ride</a>. They’ve actually been working on this since last fall, and I’ve tested it on and off since then. I’m going to dig into the final version here now that it’s released. Obviously, Apple added native power meter recording to their <a href=\"https://www.dcrainmaker.com/2023/07/apple-watch-power-meters-support-everything-wanted.html\">Apple Watch app as part of WatchOS 10</a> (currently in beta, release likely September). It’ll be interesting to see how these two differ once the dust has settled. I suspect that the 4iiii variant will have more features and edge cases, while the Apple native variant will be more mass-market. Either way, it’s cool to see companies taking this watch market segment seriously.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"8e3c57e49e0923870011dc5024b567f03a19a762bb34d7b696e31a49662ac589","category":"Cycling"}