{"title":"Class is permanent: the evergreen Michael Matthews","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/class-is-permanent-the-evergreen-michael-matthews","date":1683578757000,"content":"\n      <p>To win one stage of a Grand Tour requires talent and class; to do it repeatedly over a span of 10 years indicates enduring class, a trait that only the very best possess.</p>\n<div></div>\n<p>On a wet and rather miserable day at the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, Michael Matthews scored his 10th Grand Tour victory of his career - a year after his last, at the Tour de France, and a completely different peloton ago since his first at the 2013 Vuelta a España.</p>\n<p>For so long Matthews has carried the nickname ‘Bling’, and while he does have the flashy car (he even occasionally minds Tadej Pogačar’s supercar), the jewellery (ear studs and necklaces) and no doubt the money thanks to a career at the top, that’s about as far as Matthews goes in fitting the stereotype of a pretentious, rude prima donna. In reality, he’s anything but, and in an illuminating interview a number of years ago, he noted how, to him, the moniker said “more about my attitude, about how happy I am.”</p>\n<p>Winning in Melfi on Monday, his first win at the Giro in eight years, raised an enormous smile on his face. In the months preceding the Giro, the Australian had been training intensely as he seeks to win the points classification; just a few weeks ago he was even training alone in the Italian mountains, with just his coach Brian Stephens for company. After the win, Stephens sent a WhatsApp to Rouleur: “We worked hard for that.”</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/to-lose-the-jersey-or-keep-the-jersey-why-ceding-a-grand-tour-lead-is-not-as-simple-as-it-seems\"><strong><em>Read more: To lose the jersey or keep the jersey? Why ceding a Grand Tour lead is not as simple as it seems</em></strong></a></p>\n\n<div>\n<div>\n<div>\n<p><span>So too did the rest of the Jayco-Alula team, Callum Scotson and Filippo Zana in particular doing a tremendous job of setting the pace on the day’s final two climbs that reduced the sprint field down to just Matthews, Mads Pedersen (Trek-Segafredo) and Kaden Groves (Alpecin-Deceuninck).</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/FF66839.jpg?v=1683573983\" alt /></span></p>\n<p><span>Sport being sport, there’s not always justice and fairness, but it felt </span><em><span>right</span></em><span> that it was Matthews winning, such was the manner in which his team had turned themselves inside out for a man whose illustrious career probably hasn’t been appreciated for quite how good it is. </span></p>\n<p><span>Still just 32, Matthews now has 40 professional wins, and it’s only five years since he won the points jersey at the Tour de France, an immensely popular win.</span></p>\n<p><span>The victories have never flowed for Matthews like they do other sprinters, and that’s because he’s not really a bonafide fastman. He’s something in between a sprinter and a rouleur. He wins on the days when there’s only one prerequisite for victory: suffering.</span></p>\n<p><span>Take a look back at any of his wins - he’s had to fight tooth and nail to raise his hands in triumph. That’s not to belittle a pure sprinter’s win from a leadout, but Matthews wins after cresting hills and mountains, and then charging for the line with whoever’s left. Most of the time the sacrifice isn’t rewarded, but when it is, that cheesy smile showing the polished white teeth appears. Bling might be his name, but it’s enduring class that really defines Matthews.</span></p>\n<div></div>\n</div>\n</div>\n</div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8e414f8c76b05240e394a1e3219c50f87f3bc6163fba2de77bbdfb5e74787a39","category":"Cycling"}