{"title":"Scientists get dung beetles to collect DNA samples for biodiversity studies","link":"https://arstechnica.com/?p=2006077","date":1709655188000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-6.jpeg\" alt=\"Image of forest-covered hillsides and a river winding through the jungle.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/image-6.jpeg\">Enlarge</a> <span>/</span> The Manu area of Peru contains a number of ecological zones. (credit: <a href=\"https://creativecommons.org/licenses/by/2.0/deed.en\">Corey Spruit / Wikimedia Commons</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Peru’s Manu Biosphere Reserve is the <a href=\"https://en.unesco.org/biosphere/lac/manu\">largest rainforest reserve in the world</a> and one of the most biodiverse spots on the planet. Manu is a UNESCO-protected area the size of Connecticut and Delaware combined, covering an area where the Amazon River Basin meets the Andes Mountain Range. This combination forms a series of unique ecosystems, where species unknown to science are discovered every year. The remoteness of the region has helped preserve its biodiversity but adds to the challenges faced by the scientists who are drawn to study it.</p>\n<p>Trapping wildlife for research in the dense jungle is impractical, especially considering the great distances researchers have to travel within Manu, either through the forest or on the waterways. It’s an expensive proposition that inevitably exposes the trapped animals to some amount of risk. Trapping rare and endangered animals is even more difficult and comes with <a href=\"https://www.researchgate.net/publication/263004413_Trapping_small_mammals_for_research_and_management_How_many_die_and_why\">significant risks to the animal</a>.</p>\n<p>Trapping beetles, however, does not pose the same challenges. They’re easy to catch, easy to transport, and, most importantly, carry the DNA of many animals in and on them. Any animal a biologist could hope to study leaves tracks and droppings in the forest, and the beetles make a living by cleaning that stuff up.</p></div><p><a href=\"https://arstechnica.com/?p=2006077#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2006077&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8e53d20ddfbd97aad91de6265a1216653c673aebeb47f2b90755a8b700a991a5","category":"Tech"}