{"title":"Cerne Abbas Giant is a depiction of Hercules","link":"https://arstechnica.com/?p=1994228","date":1704756288000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/cerneTOP-800x534.jpg\" alt=\"Behold, the &quot;Rude Man&quot; chalk giant carved on a hill above the village of Cerne Abbas in Dorset, England.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/cerneTOP.jpg\">Enlarge</a> <span>/</span> Behold, the \"Rude Man\" chalk giant carved on a hill above the village of Cerne Abbas in Dorset, England. (credit: Barry Batchelor/PA Images/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A major attraction of Dorset, England, is the Cerne Abbas Giant, a 180-foot-tall figure of a naked man wielding a large club carved with chalk into a hilltop. A pair of historians offers a strong case that this figure was originally meant to represent Hercules from Greek mythology, perhaps to inspire West Saxon armies, who could have used the site as a muster station. They outlined their arguments in a <a href=\"https://www.journals.uchicago.edu/doi/10.1086/727992\">recent paper</a> published in the journal Speculum. The authors also found a possible early reference to the giant in texts dating back to the mid-11th and early 12th centuries, a period in which the carving may have been reinterpreted as representing <a href=\"https://en.wikipedia.org/wiki/Eadwold_of_Cerne\">Saint Eadwold of Cerne</a>.</p>\n<p>“It’s become clear that the Cerne giant is just the most visible of a whole cluster of early medieval features in the landscape,” said co-author Helen Gittos, an early medieval historian at the University of Oxford, <a href=\"https://www.theguardian.com/culture/2024/jan/01/cerne-abbas-giant-is-hercules-and-was-army-meeting-point-say-historians\">told The Guardian</a>. “I think we’ve found a compelling narrative that fits the giant into the local landscape and history better than ever before, changing him from an isolated mystery to an active participant in the local community and culture.”</p>\n<p>As <a href=\"https://arstechnica.com/science/2021/07/soil-samples-show-that-britains-rude-man-dates-back-to-medieval-period/\">reported previously</a>, the <a href=\"https://en.wikipedia.org/wiki/Cerne_Abbas_Giant\">Cerne Abbas Giant</a>'s generously sized erect phallus has earned it the nickname \"Rude Man,\" which undoubtedly contributes to its popularity as a tourist attraction. Archaeologists have long speculated about exactly when and why the geoglyph was created.</p></div><p><a href=\"https://arstechnica.com/?p=1994228#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1994228&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8e5d089e0d94f32c7dee4f9a770da5ecd9a284dfb82489375ef7f98ddea4d80b","category":"Tech"}