{"title":"Apple Music Spatial Audio Royalties Only Benefit the Biggest Companies, Say Indie Record Labels","link":"https://www.macrumors.com/2024/02/02/apple-music-spatial-audio-royalties-big-companies/","date":1706876206000,"content":"Independent record labels have expressed concerns about Apple's plans to pay more money for songs recorded in Spatial Audio, claiming it will only benefit the biggest companies in the marketplace, reports the <em><a href=\"https://www.ft.com/content/dc5a6ef2-acc6-456f-830a-84baad7c3db0\">Financial Times</a></em>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2021/06/apple-music-spatial-audio-ad.jpeg\" width=\"1280\" height=\"720\" />\r<br />\nLast week, Apple <a href=\"https://www.macrumors.com/2024/01/23/apple-music-more-royalties-spatial-audio/\">announced</a> royalty incentives to encourage music artists and record labels to publish tracks in Spatial Audio. Apple said it will pay up to 10% more in royalties for Spatial Audio, which uses Dolby Atmos technology to replicate an in-person music experience with sound coming from various directions around the listener. \r<br />\n\r<br />\nApple has <a href=\"https://www.macrumors.com/2022/02/16/apple-music-spatial-audio-lossless-interview/\">said</a> that over half of Apple Music subscribers use the feature, and that the bonus is a reward for artists delivering the content, and also compensation to recognize the additional time and effort required to mix in Dolby Atmos.\r<br />\n\r<br />\nHowever, several independent labels told <em>FT</em> that the new incentive will effectively channel cash towards established megastars and away from other musicians who do not have the resources to compete. \r<br />\n<blockquote>\"It's literally going to take the money out of independent labels and their artists, to benefit the biggest companies in the marketplace,\" said a senior executive at a large independent record company.\r<br />\n\r<br />\n\"It's going to benefit the biggest player, Universal, because they're the ones with the resources to invest in that. Whereas the independent sector . . . we've found it hard to justify the expense of creating spatial masters . . . we're not in the business of chucking money just because Apple is saying you should be spending money on this.\"</blockquote>Another independent label told <em>FT</em> that the new deal will badly impact its revenues. \r<br />\n\r<br />\nProducing music in Spatial Audio is not cheap. Executives say it costs an extra $1,000 per song, or roughly $10,000 per album, and going back to remaster older tracks can double the costs. Some record executives have also questioned the artistic value of Spatial Audio, with one executive likening it to \"hanging a digital 3D version of the 'Mona Lisa' and expecting Louvre patrons to prefer it.\" \r<br />\n\r<br />\nIndie labels say they hope to work with Apple to make changes to the new policy. If those negotiations fail, they would explore legal or regulatory options, said people familiar with the matter who spoke to <em>FT</em>.<div>Tags: <a href=\"https://www.macrumors.com/guide/ft-com/\">Financial Times</a>, <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/02/02/apple-music-spatial-audio-royalties-big-companies/\">Apple Music Spatial Audio Royalties Only Benefit the Biggest Companies, Say Indie Record Labels</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-spatial-audio-royalties-only-benefit-the-biggest-companies-say-indie-record-labels.2418141/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8e5e74813d7b5a5d3243d7e2bc6d3de1e2f2584d7baba9583a54fd5273c69cb5","category":"Apple"}