{"title":"Structural basis of the activation of MARTX cysteine protease domain from <i>Vibrio vulnificus</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307512","date":1722607200000,"content":"<p>by Lin Chen, Haider Khan, Lingchen Tan, Xiaojie Li, Gongchun Zhang, Young Jun Im</p>\r\n\r\nThe multifunctional autoprocessing repeat-in-toxin (MARTX) toxin is the primary virulence factor of <i>Vibrio vulnificus</i> displaying cytotoxic and hemolytic properties. The cysteine protease domain (CPD) is responsible for activating the MARTX toxin by cleaving the toxin precursor and releasing the mature toxin fragments. To investigate the structural determinants for inositol hexakisphosphate (InsP<sub>6</sub>)-mediated activation of the CPD, we determined the crystal structures of unprocessed and β-flap truncated MARTX CPDs of <i>Vibrio vulnificus</i> strain MO6-24/O in complex with InsP<sub>6</sub> at 1.3 and 2.2Å resolution, respectively. The CPD displays a conserved domain with a central seven-stranded β-sheet flanked by three α-helices. The scissile bond Leu3587-Ala3588 is bound in the catalytic site of the InsP<sub>6</sub>-loaded form of the Cys3727Ala mutant. InsP<sub>6</sub> interacts with the conserved basic cleft and the β-flap inducing the active conformation of catalytic residues. The β-flap of the post-CPD is flexible in the InsP<sub>6</sub>-unbound state. The structure of the CPD Δβ-flap showed an inactive conformation of the catalytic residues due to the absence of interaction between the active site and the β-flap. This study confirms the InsP<sub>6</sub>-mediated activation of the MARTX CPDs in which InsP<sub>6</sub>-binding induces conformational changes of the catalytic residues and the β-flap that holds the N terminus of the CPD in the active site, facilitating hydrolysis of the scissile bond.","author":"Lin Chen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8e60311d0a159ff3d3821a2f280b5eb02f02fef440fb3f7b440c6d839a5ee192","category":"Interdisciplinary"}