{"title":"iOS 17 Promises to Dramatically Improve iPhone's Autocorrect","link":"https://www.macrumors.com/2023/06/05/ios-17-improved-autocorrect/","date":1686001437000,"content":"Apple today <a href=\"https://www.macrumors.com/2023/06/05/apple-announces-ios-17-with-new-communication-and-sharing-features/\">previewed iOS 17</a> for the iPhone, and one of the key new features coming with the update is improved autocorrect functionality.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/iOS-17-Autocorrect.jpg\" alt width=\"1080\" height=\"638\" />\r<br />\nApple says iOS 17 includes a state-of-the-art language model for word prediction that will greatly improve autocorrection on the iPhone. Any time you type, on-device machine learning will intelligently correct mistakes with greater accuracy than ever before. In addition, you will now receive predictive text recommendations inline as you type, allowing for words or complete sentences to be added by tapping the space bar.\r<br />\n\r<br />\nAutocorrection has an updated design on iOS 17 that briefly underlines an autocorrected word. Tapping on an underlined word reveals the original word that you typed, making it easy to quickly revert the change. The system will also learn your typing habits over time and avoid some corrections, which Apple's software engineering chief Craig Federighi said is designed for \"those moments where you just want to type a ducking word.\"\r<br />\n\r<br />\niOS 17 is available in beta starting today for members of Apple's Developer Program, and will be publicly released later this year. Autocorrection can be enabled or disabled in the Settings app under General → Keyboard → Auto-Correction.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC 2023</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/ios-17-improved-autocorrect/\">iOS 17 Promises to Dramatically Improve iPhone's Autocorrect</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/ios-17-promises-to-dramatically-improve-iphones-autocorrect.2391718/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8e6fb3055e50b4eb7814a8a2cc9dfe843c3ecbc72f9c44306883300f146ef223","category":"Apple"}