{"title":"After defeating Hernando de Soto, the Chickasaw took his stuff and remade it","link":"https://arstechnica.com/?p=1780081","date":1626301991000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/JeffGeorge_AxeHead_CROPPED-800x542.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/JeffGeorge_AxeHead_CROPPED.jpeg\">Enlarge</a> <span>/</span> Florida Museum archaeologist Charles Cobb holds an axe head known as a celt, one of more than 80 metal objects likely from the de Soto expedition. To create this distinct shape, a Chickasaw craftsperson reworked Spanish iron to mimic traditional stone versions. (credit: <a href=\"https://www.floridamuseum.ufl.edu/\">Jeff Gage/Florida Museum of Natural History</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In 1540, Spanish conquistador Hernando de Soto, fresh from ravaging the Inca Empire, marched onto Chickasaw lands in what’s now northern Mississippi with 600 men and hundreds of livestock. By the spring of 1541, de Soto had offended the Chickasaw so badly that they burned his camp and drove the whole Spanish expedition off their lands. Archaeologists recently unearthed evidence that people from nearby Chickasaw communities gathered up the things the fleeing Spaniards left behind and put them to use in some innovative ways.</p>\n<p>It’s a surprisingly cool story to find buried in a paper titled “Nascent Colonialism and Heterogenous Hybridity,” but that’s academia for you.</p>\n<h2>The spoils of war</h2>\n<p>Archaeologists excavating centuries-old Chickasaw sites in an area called Stark Farms unearthed a surprising number of objects made from European metal: a cannonball, a mouth harp, a bridle bit with a golden crest, and more. They also found objects that had been broken up or modified into more traditional Chickasaw tools: bits of copper shaped into beads and pendants, pieces of iron horseshoes broken and sharpened into scraping tools, and barrel bands bent, broken, and ground into sharp cutting tools called celts.</p></div><p><a href=\"https://arstechnica.com/?p=1780081#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780081&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8e7267f41867de3083b6ea98ead332321f1fcfd112d27410333cd0e75eb9e5b6","category":"Tech"}