{"title":"Examining temporal trends in heavy metal levels to analyze sediment pollution dynamics in the Saida urban watershed (N‐W Algeria)","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11084?af=R","date":1723100400000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/74453080-ba13-4599-95a1-5309094e3a1e/wer11084-toc-0001-m.png\" alt=\"Examining temporal trends in heavy metal levels to analyze sediment pollution dynamics in the Saida urban watershed (N-W Algeria)\" />\n<p>This study analyzes urban sediment contamination, establishes toxicity limits, and identifies anthropogenic sources of contamination. It investigates temporal variations in metal concentrations influenced by human activities and assesses ecological risks. It examines the role of organic matter in metal adsorption and investigates how drainage networks affect the dispersion and mobility of contaminants. By highlighting the importance of identifying pollution sources, the study proposes appropriate measures to control urban sediment pollution and contributes to improved environmental management strategies.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The study focuses on current pollution in the Saïda basin, a semi-arid region in north-western Algeria. By analyzing sediments, the study provides interesting results on urban pollution and its environmental impact. The research consists of two main phases, each addressing different aspects of pollution. In the first phase, different pollution indicators are used to analyze heavy metals and organic pollutants in urban drainage sediments. The results are compared with sediment quality guidelines, regulatory thresholds, and local and international references. Most of the metallic contaminants exceed the toxicity levels established by the continental crust and sediment quality guidelines, suggesting an anthropogenic origin. In addition, contamination indices show significant accumulation. In this context, the results highlight the importance of accumulation and transport processes in urban sediments. Hydrological parameters significantly influence heavy metal distribution mechanisms. Remarkable variations between copper (Cu) and lead (Pb) suggest a combined or singular source during transport. Conversely, chromium (Cr), nickel (Ni), and iron (Fe) are mainly derived from natural lithological sources. Cadmium (Cd) is associated with anthropogenic sources related to the agricultural use of phosphate fertilizers, whereas zinc (Zn) is mainly derived from physical corrosion processes. In the second phase, a combined descriptive and multivariate statistical analysis examines the mobility and distribution of heavy metals and their relationships with organic matter (OM) over time. Pronounced temporal variations in Cd, Zn, and Cu concentrations are attributed to human activities. Strong correlations exist between OM and cobalt (Co), Cu and Pb, confirming the ability of OM to adsorb these metals under specific geochemical conditions associated with waste disposal. Conversely, Zn, Cd, Cr, and Ni show weak or negative correlations with OM, suggesting diverse sources, including potential agricultural, industrial, and natural origins. The dendrogram confirms the existence of previously identified contaminant groups, suggesting common sources and potential co-occurrence patterns. This analysis highlights the role of the drainage network as a physico-chemical reactor in the mobilization of contaminants. It underlines the importance of sediment interactions in urban pollution processes. Finally, recommendations are proposed to ensure effective pollution control and remediation.</p>\n<h2>Practitioner Points</h2>\n<p>\nUseful information on pollution and its environmental impact is provided by the analysis of sediments in the urban basin of Saida (NW-Algeria).\nThe results of this study indicate high levels of heavy metals in the sediments, in excess of toxicity limits, and evidence of anthropogenic sources.\nTemporal variations in metal concentrations indicate the influence of human activities.\nThe study has made it possible to identify the sources, to understand the mobility and distribution, and to control the contamination by heavy metals in the urban sediments.\nDrainage system serves as a pathway for dispersing contaminants.\n</p>","author":"Belaid Fatmi, \nAbdelkrim Hazzab, \nAsmaa Rahmani, \nAbdellah Ghenaim","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"8e74487fe37b39e2985b4838e337d711747515b365e6356a7dd9865628476f3e","category":"Environment"}