{"title":"Atopic Dermatitis-Related Problems in Daily Life, Goals of Therapy and Deciding Factors for Systemic Therapy","link":"https://www.preprints.org/manuscript/202410.0449/v1","date":1728286274000,"content":"Atopic dermatitis (AD) impacts various aspects of patients' lives. The most reported factors affecting clinical burden are itching and psychological disturbances (e.g., depression, anxiety or even suicidal thoughts). Also, AD affects school and work-related activities, even career advancement. Thus, AD patient management and decisions regarding advanced/systemic therapy are complex, requiring consideration of multiple disease-related factors: age; disease severity; patient medical history and comorbidities; previous topical therapy use and any adverse reactions; treatment efficacy concerns; patient preferences, expectations and fears; pregnancy planning; ability and willingness to adhere to the treatment regimen; impact on intimate and social relationships and work/school performance; and treatment-related risks and any associated psychological or psychiatric issues. Current guidelines and systematic reviews support the safety and efficacy of systemic therapy (conventional, biologics, JAK inhibitors) for treating AD. When topical therapy and phototherapy are insufficient, conventional systemic therapies (cyclosporine, methotrexate, azathioprine) are used, or advanced treatments can be introduced, like biologics and JAK inhibitors (baricitinib, upadacitinib, and abrocitinib), which have been approved for moderate to severe AD. Additional biologics being evaluated in clinical trials include lebrikizumab, nemolizumab, eblasakimab, and OX40/OX40L. Ultimately, there is great value in a personalized and multidisciplinary approach to AD management, as has been supported by numerous studies and clinical practice over time.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8e7ee670905aca2128cf293fa4c8d337bc48bb9bb83c6d30ad661f1ccd9f8510","category":"Interdisciplinary"}