{"title":"Fiber complex‐stabilized high‐internal‐phase emulsion for allicin encapsulation: microstructure, stability, and thermal‐responsive properties","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13902?af=R","date":1726800609000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Stimuli-responsive emulsions have garnered significant attention for their ability to enhance sensory qualities and control the release of encapsulated nutrient in emulsion-based products. However, the characteristics of synthetic materials of fabricating stimuli-responsive emulsions have been a crucial limitation in the food industry. Regulating the behavior of molecules at the interface could potentially achieve the desired stimuli-responsive behavior, but currently there is limited information available.</p>\n<h2>RESULTS</h2>\n<p>High-internal-phase emulsions (HIPEs) were fabricated for the encapsulation of allicin, stabilized by a complex of 20 g kg<sup>−1</sup> whey protein amyloid fibrils (WPF) and 20 g kg<sup>−1</sup> glycyrrhizin fibers (GA). The intermolecular interactions between WPF and GA in the fiber complexes were predominantly governed by hydrophobic and electrostatic forces. These complexes adsorbed and stacked around the oil droplets, forming a protective interfacial film that enhanced droplet stability. An increased proportion of WPF (WPF = 3:1 or 4:1) surrounding the oil droplets enhanced the accelerated storage stability of HIPEs, with instability indexes approaching 0.2. Additionally, HIPEs displayed a temperature-dependent modulus, with the emulsion stabilized by a WPF ratio of 3:1 showing the highest modulus at 85 °C. The encapsulation efficiency of allicin in HIPEs ranged from 88.69 ± 6.62% to 101 ± 1.37% at 25 °C, and from 31.95 ± 1.92% to 78.69 ± 4.63% after incubation at 85 °C for 8 h. The release profile of allicin from the HIPEs exhibited thermal responsiveness, depending on the interfacial content of GA.</p>\n<h2>CONCLUSION</h2>\n<p>These findings indicated that the thermal-responsive properties of HIPEs can be strategically engineered by manipulating their interfacial characteristics. © 2024 Society of Chemical Industry.</p>","author":"Yuqing Zhu, \nShengfeng Peng, \nSixian Peng, \nXing Chen, \nLiqiang Zou, \nRuihong Liang, \nRoger Ruan, \nLeilei Dai, \nWei Liu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8e815a13bdedcbd5e86f344b0774a23ac8728870b976307d89bfeead4a82ca9b","category":"Environment"}