{"title":"Research on Multi‐Objective Optimization Design of Traditional Soil Dwelling Renovation Based on AHPQFD‐ NSGA‐II: A Case Study of Tuyugou Village in Turpan, Xinjiang","link":"https://www.preprints.org/manuscript/202410.0505/v1","date":1728364166000,"content":"As the socio-economic landscape expands and tourism flourishes, the traditional earthen dwellings of Tuyugou Village, Turpan, Xinjiang, face significant challenges, including low energy efficiency and suboptimal living comfort, necessitating data-driven and scientifically robust renovation strategies. Existing renovation methods, however, often lack empirical support and rely heavily on subjective judgment from architects, thus hindering the effective preservation and transmission of cultural heritage. This research addresses the renovation of these traditional dwellings by employing the AHP method to systematically evaluate user requirements, with input from diverse stakeholders, including homeowners, tourists, experts, and government authorities. The study then applies the QFD method to construct a House of Quality, translating user needs into specific design attributes, followed by a comprehensive quantitative analysis for optimization. A novel multi-objective optimization model (MOP) is introduced, with materials as the central focus, addressing key aspects of engineering, culture, and energy conservation. The NSGA-II algorithm is utilized to generate optimal Pareto solutions. These solutions are further refined using the en-tropy-weighted VIKOR method, enabling objective decision-making that balances cultural preservation with contemporary needs, ultimately enhancing both living standards and tourism appeal. This study offers innovative renovation strategies for traditional dwellings in arid and semi-arid climates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8e871ab568abae151da06f43b39774a8ff35b781036c912ca39801951866707d","category":"Interdisciplinary"}