{"title":"Methodologies Toward Optimization of Y2O3:Eu@SiO2 Nanoparticles as Photosensitizers for X-Ray Activated Photodynamic Therapy (XPDT) of Cancer","link":"https://www.preprints.org/manuscript/202405.1623/v2","date":1721720823000,"content":"Traditional photodynamic therapy (PDT) is often limited in its efficacy by insufficient light penetration, inefficient photosensitizer energy transfer, and inadequate target tissue oxygenation. X-ray activated PDT (XPDT), using nanoparticle (NPs) photosensitizers comprised of europium-doped yttrium oxide cores encased within silica shells (Y2O3:Eu@SiO2), offers the potential of overcoming most of these limitations. Aimed at maximizing the generation of reactive oxygen species (ROS), this study reports methodologies for investigation of the effects of synthesis conditions on the characteristics of Y2O3:Eu@SiO2 NP. Transmission electronic microscope (TEM) revealed that the NP core diameter was linearly, positively correlated with condensation time (R2 = 0.7357, p &lt; 0.05) and linearly, negatively correlated with urea concentration (R2 = 0.958, p &lt; 0.05). The addition of cetyltrimethylammonium bromide (CTAB) during core synthesis demonstrated enhanced particle dispersion. Silica coating via APTES-1 and TEOS-3 conditions resulted in Y2O3:Eu@SiO2 NPs that generated the highest ROS, with 8.7-fold and 8.9-fold increase respectively in relative fluorescence intensity at 8 Gy irradiation compared to a 5.2-fold increase in PBS under the same condition. In vivo evaluation using 18F-fluorothymidine positron emission tomography (18F-FLT PET) of mouse xenografts of a human prototypical cancer (ovarian) revealed a 55% reduction in tumor proliferation of radiation-sensitive CAOV3 tumors treated with Y2O3:Eu@SiO2 NPs compared to a 19% reduction in tumor proliferation of radiation-resistant SKOV3 tumors on the fourth day post-treatment. Taken together, these findings suggest Y2O3:Eu@SiO2 NPs can serve as effective photosensitizers for XPDT and their performance characteristics can be optimized by selecting synthesis conditions and parameters to deliver the desirable therapeutic effects, offering novel approaches to circumventing many of the limitations of conventional PDT in the treatment of cancer.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8e8aa363886e617d1a3e1c357b0928736e670b2cf79281e97a13eded738b595d","category":"Interdisciplinary"}