{"title":"How to fly with your bike | Packing, weight limits and surcharges explained","link":"https://www.bikeradar.com/features/how-to-fly-with-your-bike/","date":1679666400000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/03/RussellBurton_20200206_2DX1834-5252d11-scaled.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"RussellBurton_20200206_2DX1834\" title=\"RussellBurton_20200206_2DX1834\" />                                            <p>There’s always good riding to be had at home, but sometimes you need to get your bike fix somewhere else.</p>\n<p>Often, flying remains the easiest way to get abroad, but figuring out how to transport your bicycle can sometimes feel like a bit of a battle. So we’ve done some research to make it easier for you.</p>\n<p>We’ve also got <a href=\"https://www.bikeradar.com/gear/article/bike-travel-tips-51435/\">15 tips for travelling with your bike</a> from our readers, a separate article with detailed advice on <a href=\"https://www.bikeradar.com/features/routes-and-rides/how-to-pack-your-road-bike-for-a-trip-abroad/\">how to pack your bike</a>, our pick of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-boxes-and-bike-bags/\">best bike boxes and bike bags</a>, as well as our <a href=\"https://www.bikeradar.com/advice/buyers-guides/bicycle-insurance-guide/\">guide to bicycle insurance</a> – just in case things do go wrong on your flight.</p>\n<h2>How to pack your bike for travel</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You’ll need to disassemble your bike.</span></figcaption><span> <i>iStock / Getty Images Plus</i></span></div>\n<p>If you’re flying with your bike, you’re going to have to pack it up. The days of chancing it and showing up at the airport with an unpacked bike are over. Instead, we recommend you take a bit of time to prepare.</p>\n<p>Whether you’re using a basic bike bag or a more elaborate hardshell case, always ensure your pride and joy is stowed securely and safely.</p>\n<p>As a rule, you’ll have to take off your wheels, pedals and bars.</p>\n<p>We’ve put together two detailed guides on how to pack your bike for travel, which should provide you with all the information you need to keep your bike safe in transit.</p>\n<p>Note too that your airline may have additional restrictions on carriage of the battery if you plan to travel with an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bike</a>. Some ban batteries altogether, while others stipulate a maximum capacity, usually 160Wh, that’s a lot smaller than most <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-an-electric-bike/\">electric bike batteries</a>.</p>\n<h3>Do I need to deflate my tyres and shocks?</h3>\n<p>Many airlines, but not all, stipulate that tyres and shocks should be deflated or part-deflated for carriage. Aircraft cabin and hold pressures are lower than that at sea level, around that experienced at 2,500m (8,000ft). This might not cause your tyres to explode, but it’s probably worth letting some air out.</p>\n<p>On the other hand, some air left in your tyres will help to protect your wheel rims, so squidgy, not flat, is probably best.</p>\n<h2>What to pack it in – a bike bag or box?</h2>\n<p>We would advocate a dedicated bike bag or box, but recognise that the cost can be off-putting, especially if you don’t plan on travelling with your bike very often. So, there are some cheaper alternatives you could consider.</p>\n<h3>A cardboard box</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You could just use a cardboard box if you don’t travel frequently.</span></figcaption><span> <i>iStock / Getty Images Plus</i></span></div>\n<p>You could try to get a cardboard bike box from your local bike shop, though it’s unlikely to be a particularly compact option, so it’s worth checking the baggage size restriction with your airline.</p>\n<p>Cardboard is also not the most impact-resistant material (nor durable if it’s sitting outside in the rain), so we’d recommend padding out the box to protect your bike.</p>\n<p>It is worth bearing in mind that some airlines don’t accept anything other than a ‘recognised bike bag’, so you should check beforehand precisely what is meant by this.</p>\n<p>While this option is decidedly cheaper than buying a dedicated bike bag or box, if you are travelling regularly then the prospect of investing in a bike bag can seem more reasonable as a purpose-built solution for transporting your bike. It should protect your bike better as well.</p>\n<h3>A dedicated bike bag or bike box</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A bag designed specifically for transporting bikes could be a good investment.</span></figcaption><span> <i>Aoife Glass / Immediate Media Co</i></span></div>\n<p>There are two options here: a hard or a soft case. The former will usually provide a bit more security and protection, while the latter is generally a little cheaper, lighter and easier to store when not in use.</p>\n<p>You also get hybrids that are designed to combine the best of both worlds. That usually means a soft shell that has an internal frame to add extra rigidity and protection for your bike.</p>\n<p>The main advantage of a dedicated bike bag is it’s designed specifically to hold your bike and as such has padding in all the appropriate locations. Being purpose-built means it will also have compartments, straps and all the necessary measures to hold its contents and accessories securely.</p>\n<p>We have additional reviews of <a href=\"https://www.bikeradar.com/gear/category/accessories/bike-travel-cases/\">bike travel cases</a> on site.</p>\n<p>As always, the sky’s the limit when it comes to protecting your ride – we reported on this <a href=\"https://www.bikeradar.com/road/news/article/50000-fairwheel-bikes-travel-case-38281/\">decadent $50,000 bike case from Fairwheel bikes</a> a while ago, but there are definitely some more reasonable options available.</p>\n<p>We’ve listed some of our favourites for you below:</p>\n<h3>Evoc bike bags</h3>\n<ul><li>\n    </li>\n</ul><p> </p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Evoc Travel Bag is a solid soft-bag option.</span></figcaption><span> <i>Evoc</i></span></div>\n<p>Evoc bike bags have become a go-to in the cycling world. We gave the Travel bag a <a href=\"https://www.bikeradar.com/mtb/gear/category/accessories/luggage/cycling-bags-and-cases/bike-travel-cases/product/evoc-bike-travel-bag-51347/\">4.5-star review</a>. It’s not the cheapest, but provides very good protection and still comes in cheaper than a hard case.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n<h3>Scicon Aerocomfort</h3>\n<ul><li>\n    </li>\n</ul></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Scicon bike bags are popular with the pros.</span></figcaption><span> <i>Scicon</i></span></div>\n<p>The Aerocomfort is a soft-sided bag, but includes an internal bike stand and the design provides space to keep the bars and seatpost in place. There are options for MTBs and triathlon bikes, as well as road bikes. Look out for airlines’ maximum linear dimension limits though.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n<h3>Biknd</h3>\n</div>\n<div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Helium bike bag is easy to load up and features inflatable side panels for added protection.</span></figcaption><span> <i>Biknd</i></span></div>\n<p>Biknd produces soft bags that add additional protection with inflatable side panels. We’ve reviewed the <a href=\"https://www.bikeradar.com/mtb/gear/category/accessories/luggage/cycling-bags-and-cases/bike-travel-cases/product/biknd-jetpack-bike-bag-review-51348/\">JetPack </a>in the past, and while it’s pricey it performed very well.</p>\n</div>\n<div>\n<div>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n</div>\n</div>\n<div>\n<h3>B&amp;W hard case</h3>\n<ul><li>\n    </li>\n</ul></div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The B&amp;W is a budget hard case – it will only fit a road bike though.</span></figcaption><span> <i>B&amp;W</i></span></div>\n<p>If you want the ultimate in protection, a hard case is the way to go.</p>\n<p>Something such as the <a href=\"https://www.bikeradar.com/gear/category/accessories/luggage/cycling-bags-and-cases/bike-travel-cases/product/review-b-w-touring-bike-box-27628/\">B&amp;W Bike Box</a> is a cheaper option that provides good protection. However, it doesn’t appear to fit mountain bikes.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<div>\n<h3>BikeBox Alan</h3>\n<ul><li>\n    </li>\n</ul></div>\n<div>There are numerous other examples out there. One we have particularly liked in the past is the BikeBox Alan, although it’s another box that might fall foul of airlines’ maximum linear dimensions regulations.</div>\n<div>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The BikeBox Alan is a solid, hard case, transport solution.</span></figcaption><span> <i>Bike Box Alan</i></span></div>\n</div>\n<ul><li><a href=\"https://bikeboxalan.com/\" target=\"_blank\">Buy the BikeBox Alan</a></li>\n</ul><h2>Split your bike in two</h2>\n<p>In order to pack bikes smaller, frequent travellers might choose to go with travel bikes that have a frame that can be split in two.</p>\n<p>These usually enable you to then check your bag as normal, rather than as outsize luggage, saving significant costs.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Ritchey Break-Away enables you to split your bike into a more compact package for transport.</span></figcaption><span> <i>Ben Healy / Immediate Media</i></span></div>\n<p>One of the slickest solutions we’ve seen is the Ritchey Break-Away.</p>\n<p>We’ve reviewed the <a href=\"https://www.bikeradar.com/road/gear/category/bikes/road/product/ritchey-break-away-carbon-review-51733/\">Break-Away Carbon</a>, and while it’s quite an investment, it could easily be used as your only bike. There’s no compromise on ride quality, just a tiny bit of added weight due to the fittings that enable the frame to be disassembled.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>S&amp;S couplings</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> S&amp;S couplings enable you to split your frame tubes for portability.</span></figcaption><span> <i>TiCycles</i></span></div>\n<p><a href=\"http://www.sandsmachine.com/\">S&amp;S couplings</a> are a precision-fitted, threaded linkage that can be retrofitted to many (round-tubed) frames.</p>\n<p>The tubes of your bike can then be split for transport but reassembled without any performance impact. In fact, S&amp;S couplings are said to be stronger than the tubes themselves.</p>\n<p>There are a limited number of approved frame builders and you can <a href=\"http://www.sandsmachine.com/fbplist.htm\" target=\"_blank\">check out the list here</a>. S&amp;S makes cases specifically to fit the compact, disassembled frames.</p>\n<h2>Take a folding bike</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You can buy hard or soft cases for many brands of folding bike.</span></figcaption><span> <i>B&amp;W</i></span></div>\n<p>If you just want a bike to get around a city when you arrive, a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-folding-bikes/\">folding bike</a> can be a compact solution that will pack into a case that’s a lot smaller than a standard bike bag.</p>\n<p>Brompton sells a wheeled soft case for its folders, and B&amp;W has a hard-case option with a drag handle. Other folding bike brands also offer soft or hard cases for their bikes, such as Gocycle’s travel case for its <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-folding-bikes/\">electric folding bike</a>.</p>\n<p>You may be able to avoid airlines’ oversized baggage restrictions, but look out for baggage weight limits and, if you’re taking an electric folding bike, restrictions on carrying batteries.</p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>What else to pack</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Remember to pack everything else you will need on your travels as well, but keep an eye on weight and other restrictions.</span></figcaption><span> <i>Ben Delaney / Immediate Media</i></span></div>\n<p>Don’t forget, you’ll need to take all your riding accessories with you too. Make sure you have your essential tools, pump, nutrition, bottles, clothes, helmet and anything else you usually take with you when riding.</p>\n<p>Bear in mind that bike bags tend to add quite a bit of weight on top of the bike itself (and so will your padding if you’re doing a DIY version). Keep an eye on the maximum weight limit for luggage on your flight and make sure you don’t exceed this or pack any restricted items.</p>\n<p>Some airlines stipulate that a bike box can’t be used to transport anything except your bike.</p>\n<p>If your bike goes missing in transit, you can potentially hire a bike while you’re at your destination. However, other items such as <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-cycling-shoes/\">cycling shoes</a> in the right size and your favourite helmet are going to be trickier, so you might want to take those in carry-on luggage.</p>\n<p>There’s usually a maximum packed weight for the bag, that’s often 32kg but may be lower. Airlines may also stipulate maximum ‘linear dimensions’, which is the sum of a box’s length + width + height.</p>\n<h2>Travelling without a bike</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> You might be able to ride something very exotic if you hire when you’re abroad.</span></figcaption><span> <i>Marijn Sourbron / Ridley</i></span></div>\n<p>So far, the focus here has been on travelling with your bike. However, you may want to consider just leaving your bike behind and hiring one at the other end when you arrive.</p>\n<p>There are an increasing number of providers who offer high-quality bike rentals in various destinations, and in some cases this can work out cheaper or easier to organise than transporting bikes yourself, especially when you consider transfers. Often they’re dream bikes and stock is updated annually, so you might get to ride an almost-new top-spec bike – and not have to clean it.</p>\n<h2>Getting your bike on a plane – fees and weight limits explained</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Every airline has its own rules for bicycles.</span></figcaption><span> <i>The Image Bank / Getty</i></span></div>\n<p>The above information is all well and good, but when selecting your flight things start to get complicated. As a rule, we will use a comparison site such as Skyscanner or Tripadvisor to figure out which flights are cheapest, although you might find a better deal on an airline’s website and some airlines are not covered by comparison sites.</p>\n<p>However, hold fire before booking your tickets – figure out how much transporting your bikes will cost because we’ve found that in some cases choosing an initially more ‘premium’ flight can work out cheaper overall.</p>\n<p>Different airlines will treat bikes differently, with some accepting a bike bag as part of your baggage allowance, even though it’s outsized, while others will require you to pay a surcharge on top of your flight cost to be able to carry your bike with you.</p>\n<p>Sometimes, we have found it cheaper to upgrade your class of travel rather than adding additional baggage to your booking. You’ll often have a more generous baggage allowance, so it can be worth looking through the fine print to figure out what will work best.</p>\n<p>One thing we would add is it’s always worth calling ahead to let airlines know you intend to carry your bike. Find out all the information you need in advance because paying for excess weight allowance or excess baggage at the airport is almost always prohibitively expensive. Keep a note of who you talked to and when.</p>\n<p>If you have a transfer flight on a different airline, you should make sure both carriers will accept your bike on board.</p>\n<p>It’s recommended that you <a href=\"https://www.bikeradar.com/advice/buyers-guides/bicycle-insurance-guide/\">insure your bike</a> because airlines won’t cover any damage to your bike. Make sure to check your bike over once it arrives at the other end too so that you can flag up any issues immediately.</p>\n<p>We’ve collated the terms and conditions of the major airlines here, but do please also take the time to double-check them yourself – they do change, usually for the worse.</p>\n<h3>Flying with a bike from the UK and in Europe – rules, costs and weight limits explained</h3>\n<p>Most of these airlines fly internationally and long-haul. However, for the purposes of this article we’ve done a rough grouping according to whether the airlines fly predominantly in Europe, the US or Australia.</p>\n<p><em>Details updated 23 March 2023</em></p>\n<h4>Air France</h4>\n<ul><li>Requires approval from customer service department at least 48 hours before flight</li>\n<li>Bikes are not a part of baggage allowance</li>\n<li>23kg maximum weight</li>\n<li>Bike transport within Europe and to some French DOM-TOMs costs €55</li>\n<li>Price ranges from €40 to 125 depending on five different flight zones</li>\n<li>Max dimensions of 120x90cm</li>\n<li>Max ebike battery 160Wh, must be removed from bike</li>\n<li>Weight limit of 23kg</li>\n</ul><ul><li><strong><a href=\"https://www.airfrance.co.uk/\" target=\"_blank\">For more details visit Air France here</a></strong></li>\n</ul><h4>Aer Lingus</h4>\n<ul><li>A bike will cost €50 per flight or €40 if booked online</li>\n<li>Weight allowance up to 23kg</li>\n<li>Part of standard baggage allowance for flights to/from North America</li>\n<li>For flights to/from North America, bikes can be carried as part of your luggage allowance</li>\n<li>Extra luggage is charged at €75 / $100 each way</li>\n<li>Business class passengers carry sports equipment for free</li>\n<li>Electric bikes: contact customer services</li>\n</ul><ul><li><strong><a href=\"http://aerlingus.com/\" target=\"_blank\">For more details visit Aer Lingus here</a></strong></li>\n</ul><h4>British Airways</h4>\n<ul><li>Bikes allowed as part of your free checked baggage allowance if packed</li>\n<li>Call 72 hours ahead of time to confirm your bike reservation</li>\n<li>Weight allowance up to 23kg</li>\n<li>Permissible dimensions of 190x95x65cm</li>\n<li>No clothing or other personal items to be packed with bike</li>\n<li>Above 32kg, you will have to ship anything as freight</li>\n<li>No electric bikes</li>\n</ul><ul><li><strong><a href=\"http://ba.com/\" target=\"_blank\">For more details visit British Airways here</a></strong></li>\n</ul><h4>EasyJet</h4>\n<ul><li>A bike is counted as large sports equipment</li>\n<li>One piece per booking, no refunds</li>\n<li>Costs £45 per flight pre-booked / £55 at airport with weight allowance up to 32kg</li>\n<li>Must be packed in a bike box</li>\n<li>No items other than your bike may be transported in the bike box</li>\n<li>32kg maximum weight</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"http://easyjet.com/\" target=\"_blank\">For more details visit EasyJet here</a></strong></li>\n</ul><h4>Eurostar</h4>\n<ul><li>Okay, we know this one doesn’t leave the ground</li>\n<li>Email travelservices@eurostar.com to book a space</li>\n<li>Drop off at luggage area before departure</li>\n<li>Only available on certain services from London to Paris</li>\n<li>Folding bikes in a protective bag/case up to 85cm long can be taken on board</li>\n</ul><ul><li><strong><a href=\"https://www.eurostar.com\" target=\"_blank\">For more details visit Eurostar here</a></strong></li>\n</ul><h4>Eurowings</h4>\n<ul><li>Register in advance to reserve space</li>\n<li>32kg max weight</li>\n<li>£43/€50 for short haul flight</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.eurowings.com/en.html\" target=\"_blank\">For more details visit Eurowings here</a></strong></li>\n</ul><h4>Iberia</h4>\n<ul><li>Bike counted as part of luggage allowance for long-haul flights</li>\n<li>A €40 fee applies for short-haul flights if booked in advance, €50 for medium-haul</li>\n<li>Weight allowance up to 32kg</li>\n<li>Permissible dimensions of 131x72x21cm</li>\n<li>Can buy a 131x72x21cm box for €20 at some airports</li>\n<li>No ebikes, no tandems</li>\n</ul><ul><li><strong><a href=\"http://iberia.com/\" target=\"_blank\">For more details visit Iberia here</a></strong></li>\n</ul><h4>Ita Airways</h4>\n<ul><li>€60 per flight in Europe, €100 per flight intercontinental if booked in advance</li>\n<li>Weight allowance up to 23kg</li>\n<li>Not larger than 300cm</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.ita-airways.com/en_gb/\" target=\"_blank\">For more details visit Ita Airways here</a></strong></li>\n</ul><h4>Jet2</h4>\n<ul><li>Must be pre-booked</li>\n<li>Taking a bike starts at £30 / €37</li>\n<li>Weight allowance up to 32kg</li>\n</ul><ul><li><strong><a href=\"http://jet2.com/\" target=\"_blank\">For more details visit Jet2 here</a></strong></li>\n</ul><h4>KLM</h4>\n<ul><li>Requires approval from customer service department at least 48 hours before flight</li>\n<li>Not a part of baggage allowance</li>\n<li>Within Europe €55</li>\n<li>Prices range from €40 to €100 depending on five different flight zones</li>\n<li>Max linear dimensions 300cm, up to 23kg</li>\n<li>Ebike batteries must be removed and be smaller than 160Wh</li>\n</ul><ul><li><strong><a href=\"http://klm.com/\" target=\"_blank\">For more details visit KLM here</a></strong></li>\n</ul><h4>Lufthansa</h4>\n<ul><li>Register bike at least 24 hours before departure</li>\n<li>Bikes counted as part of your baggage allowance (except in Economy Class Light)</li>\n<li>Weight allowance up to 23kg for economy, 32kg for business</li>\n<li>Sum of linear dimensions of 2.8m maximum</li>\n<li>Additional baggage costs from €70 to €250 / $80 to $287</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"http://lufthansa.com/\" target=\"_blank\">For more details visit Luthansa here</a></strong></li>\n</ul><h4>Norwegian Air</h4>\n<ul><li>Adding a bike will cost £30 online / £50 at airport</li>\n<li>Weight allowance up to 23kg</li>\n<li>Max size 250x79x112cm</li>\n<li>Print and take travel receipt to airport</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.norwegian.com/uk/\" target=\"_blank\">For more details visit Norwegian Air here</a></strong></li>\n</ul><h4>Ryanair</h4>\n<ul><li>Fixed £60/€60 fee per flight</li>\n<li>Max weight 30kg</li>\n<li>Must be packed in a bike box or bike bag</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.ryanair.com/gb/en/\" target=\"_blank\">For more details visit Ryanair here</a></strong></li>\n</ul><h4>Swiss Air</h4>\n<ul><li>Space must be reserved in advance</li>\n<li>Bikes are part of your baggage allowance</li>\n<li>Weight allowance up to 32kg</li>\n<li>Must be packed in a box or bag</li>\n<li>Additional fees outside allowance are very expensive</li>\n<li>ebike battery must be removed, max 160Wh capacity</li>\n</ul><ul><li><strong><a href=\"http://swiss.com/\" target=\"_blank\">For more details visit Swiss Air here</a></strong></li>\n</ul><h4>Vueling</h4>\n<ul><li>Considered ‘Special Luggage’ and subject to a minimum €100 fee</li>\n<li>Add to booking online</li>\n<li>Max weight 32kg</li>\n<li>Max linear dimensions 2.7m</li>\n</ul><ul><li><strong><a href=\"https://www.vueling.com/en\" target=\"_blank\">For more details visit Vueling here</a></strong></li>\n</ul><h4>Wizz Air</h4>\n<ul><li>Subject to Sporting Equipment fee of €45 if booked in advance, €65 at airport</li>\n<li>Add to booking online or via call centre</li>\n<li>Can carry an ebike battery up to 160Wh separately in carry-on baggage</li>\n</ul><ul><li><strong><a href=\"http://wizzair.com\" target=\"_blank\">For more details visit Wizz Air here</a></strong></li>\n</ul><h3>Flying to, from or in the US with a bike – rules, costs and weight limits explained</h3>\n<h4>Air Canada</h4>\n<ul><li>Bikes must be registered at least 24 hours in advance</li>\n<li>Specifically requests bikes are packed in purpose-built bike bag</li>\n<li>Bike can be counted as part of your baggage allowance, except on some flights where there’s a $50 (CDN/US) fee</li>\n<li>Weight allowance up to 32kg for bikes, with no overweight charges for bikes below 32kg</li>\n<li>Maximum linear dimensions of 292cm</li>\n<li>No other items in bike box</li>\n</ul><ul><li><strong><a href=\"http://aircanada.com/\" target=\"_blank\">For more details visit Air Canada here</a></strong></li>\n</ul><h4>Alaska Airlines</h4>\n<ul><li>Alaska will waive $100 oversize and overweight baggage fees and charge bikes at standard rate of $30 for first bag, $40 for second bag, $100 for each additional bag</li>\n<li>Weight under 51lb, sum of dimensions less than 115 inches</li>\n<li>No items except bike in box</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.alaskaair.com/\" target=\"_blank\">For more details visit Alaska Airlines here</a></strong></li>\n</ul><h4>American Airlines</h4>\n<ul><li>Bike can be taken as part of checked allowance if in bike box/bag</li>\n<li>Must be under 50lbs / 23kg</li>\n<li>Must be under 126 inches / 3.2m in linear dimensions</li>\n<li>Above this will incur a fee of $150, increasing allowance to 70lbs / 32kg and 126 inches / 3.2m</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.americanairlines.co.uk/\" target=\"_blank\">For more details visit American Airlines here</a></strong></li>\n</ul><h4>Delta</h4>\n<ul><li>Bag can be carried as part of your checked luggage on most flights</li>\n<li>Weight allowance up to 50lb</li>\n<li>Maximum linear dimensions up to 292cm</li>\n<li>Above those limits, bicycle is charged at minimum $150</li>\n<li>Limited release form must be signed unless in a hard case</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.delta.com/\" target=\"_blank\">For more details visit Delta here</a></strong></li>\n</ul><h4>Icelandair</h4>\n<ul><li>Carrying bikes between US and Europe costs £66 / $83 within Europe, £92 / $116 to/from US per flight leg</li>\n<li>Pre-book for 20% discount</li>\n<li>Weight allowance up to 70lbs / 32kg</li>\n<li>Maximum dimensions of 87x22x40in / 221x56x102cm</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.icelandair.com/en-gb/\" target=\"_blank\">For more details visit Icelandair here</a></strong></li>\n</ul><h4>JetBlue</h4>\n<ul><li>Carried as part of checked baggage if under 50lb/62 inches</li>\n<li>$100 / £80 / €90 per leg plus any applicable checked bag fee for larger items</li>\n<li>Must be under 99lbs</li>\n<li>No liability for damage if packed in a soft-sided case</li>\n<li>No other items in bike case</li>\n</ul><ul><li><strong><a href=\"https://www.jetblue.com/\" target=\"_blank\">For more details visit JetBlue here</a></strong></li>\n</ul><h4>Southwest Airlines</h4>\n<ul><li>Bikes can be carried as part of checked allowance for a $75 fee per flight leg</li>\n<li>Must be under 50lbs / 23kg</li>\n<li>Must under 62 inches / 1.57m in linear dimensions</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.southwest.com/\" target=\"_blank\">For more details visit Southwest here</a></strong></li>\n</ul><h4>Spirit Airlines</h4>\n<ul><li>Bikes are charged at $75 each way</li>\n<li>Counts towards part of your checked allowance</li>\n</ul><ul><li><strong><a href=\"https://www.spirit.com/\" target=\"_blank\">For more details visit Spirit here</a></strong></li>\n</ul><h4>United</h4>\n<ul><li>Bike can be carried as part of your luggage allowance</li>\n<li>Weight limit of 23kg</li>\n<li>Maximum of 292cm linear dimensions</li>\n<li>$150 for travel in North America if limits are exceeded</li>\n<li>$200 for travel everywhere else if limits are exceeded</li>\n<li>No ebikes</li>\n</ul><ul><li><strong><a href=\"https://www.united.com/ual/en/gb/\" target=\"_blank\">For more details visit United here</a></strong></li>\n</ul><h4>Virgin Atlantic</h4>\n<ul><li>Bikes allowed as part of your free baggage allowance, unless travelling Economy Light</li>\n<li>Weight allowance up to 23kg</li>\n<li>Pre-booking not required</li>\n<li>Overweight baggage charge from 23kg to 32kg</li>\n<li>Overweight luggage or adding extra bags starts at £65</li>\n</ul><ul><li><strong><a href=\"http://virginatlantic.com/\" target=\"_blank\">For more details visit Virgin here</a></strong></li>\n</ul><h3>Flying to, from or in Asia Pacific – rules, costs and weight limits explained</h3>\n<h4>Air New Zealand</h4>\n<ul><li>Items can be carried as part of your checked allowance</li>\n<li>Must be in a bike box/bag</li>\n<li>Items may weigh up to 23kg</li>\n<li>May not exceed 2m long</li>\n<li>Can pack accessories in box</li>\n</ul><ul><li><strong><a href=\"http://airnewzealand.co.uk/\" target=\"_blank\">For more details visit Air New Zealand here</a></strong></li>\n</ul><h4>Cathay Pacific</h4>\n<ul><li>Contact at least 72 hours in advance to book bike</li>\n<li>Bike must be transported in a hard case or “recognised bicycle box”</li>\n<li>Bike counts as part of checked allowance</li>\n<li>Weight limit of 23kg</li>\n</ul><ul><li><strong><a href=\"http://cathaypacific.com/\" target=\"_blank\">For more details visit Cathay Pacific here</a></strong></li>\n</ul><h4>Emirates</h4>\n<ul><li>Bikes must be booked at least 24 hours in advance</li>\n<li>Can be carried as part of your checked baggage allowance</li>\n<li>Weight limit of 23kg or 32kg depending on the class you are flying in</li>\n<li>Maximum linear dimensions of 300cm</li>\n<li>Additional charges are rather expensive</li>\n</ul><ul><li><strong><a href=\"http://emirates.com/\" target=\"_blank\">For more details visit Emirates here</a></strong></li>\n</ul><h4>Etihad</h4>\n<ul><li>Bikes are exempt from oversize rules</li>\n<li>Weight allowance up to 32kg</li>\n<li>300cm linear dimensions</li>\n</ul><ul><li><strong><a href=\"http://etihad.com/\" target=\"_blank\">For more details visit Etihad here</a></strong></li>\n</ul><h4>Jetstar</h4>\n<ul><li>Bikes can be carried, but must pay oversize fee</li>\n<li>Charged at AU$25 per flight</li>\n<li>Max 32kg weight</li>\n<li>Make sure to purchase enough weight allowance</li>\n</ul><ul><li><strong><a href=\"https://www.jetstar.com/\" target=\"_blank\">For more details visit Jetstar here</a></strong></li>\n</ul><h4>Malaysia Airlines</h4>\n<ul><li>Bikes will usually be accepted as checked baggage, with different allowances by cabin class</li>\n<li>Maximum 158cm linear dimensions</li>\n<li>Maximum 204cm linear dimensions to carry as oversize baggage</li>\n<li>Weight limit of 23kg</li>\n<li>Fees vary depending on airport</li>\n</ul><ul><li><strong><a href=\"http://malaysiaairlines.com/\" target=\"_blank\">For more details visit Malaysia Airlines here</a></strong></li>\n</ul><h4>Qantas</h4>\n<ul><li>Bike can be carried as part of your baggage allowance</li>\n<li>Maximum weight of 32kg</li>\n<li>Dimensions of 140x30x80cm</li>\n</ul><ul><li><strong><a href=\"https://www.qantas.com/gb/en.html\" target=\"_blank\">For more details visit Qantas here</a></strong></li>\n</ul><h4>Qatar</h4>\n<ul><li>Bike will be carried as part of free baggage allowance</li>\n<li>Minimum $200 to add extra items of luggage to your booking</li>\n</ul><ul><li><strong><a href=\"http://qatarairways.com/\" target=\"_blank\">For more details visit Qatar Airways here</a></strong></li>\n</ul><h4>Singapore Airlines</h4>\n<ul><li>Bikes are carried as part of free baggage allowance</li>\n<li>Weight limit of 32kg</li>\n<li>No stated dimension restrictions</li>\n</ul><ul><li><strong><a href=\"http://singaporeair.com/\" target=\"_blank\">For more details visit Singapore Air here</a></strong></li>\n</ul><h4>Virgin Australia</h4>\n<ul><li>Bike accepted as part of checked luggage</li>\n<li>Must be packaged in specific bike case (soft or hard)</li>\n<li>Weight limit of 23kg (32kg in business class)</li>\n<li>Size restriction varies by type of aircraft</li>\n<li>Must be checked in at least one hour prior to departure</li>\n<li>ebike batteries maximum 160Wh</li>\n</ul><ul><li><strong><strong><a href=\"http://virginaustralia.com.au/\" target=\"_blank\">For more details visit Virgin Australia here</a></strong></strong></li>\n</ul><h2>At the other end</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Once you land, the fun can start!</span></figcaption><span> <i>Russel Burton / Our Media</i></span></div>\n<p>Once you land at your destination, be sure to consider how you are going to transport your bike. In all likelihood, you’re not going to be riding away from the airport, so check luggage restrictions on any public transport that you might be taking so you don’t run into any trouble.</p>\n<p>Make sure you know how to get your bike to where you’re wanting to go.</p>\n<p>It may also be worth considering whether you need to fly. There are quite a few options that offer to transport you and your bike more conveniently. For example, in the UK, <a href=\"http://www.bike-express.co.uk/Home\" target=\"_blank\">Bike Express offers transport to mainland Europe</a> at relatively reasonable prices.</p>\n<p>Always make sure you double-check terms and conditions before making your booking, and if in doubt contact the airline you intend to fly with.</p>\n<p>We’ve flown with our bikes countless times and while it can seem a bit of a logistical headache, with a little bit of effort it’s easy enough to get everything sorted out.</p>\n<p> </p>","author":"Benedict Pfender","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8e9f283abfdc5dc0efe6976d397966df1ba49ab9b7aac078d3fa045e48e961bd","category":"Cycling"}