{"title":"Optimal inventorying and monitoring of taxonomic, phylogenetic and functional diversity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307156","date":1722434400000,"content":"<p>by Pedro Cardoso, Miquel A. Arnedo, Nuria Macías-Hernández, William D. Carvalho, José C. Carvalho, Renato Hilário</p>\r\n\r\nComparable data is essential to understand biodiversity patterns. While assemblage or community inventorying requires comprehensive sampling, monitoring focuses on as few components as possible to detect changes. Quantifying species, their evolutionary history, and the way they interact requires studying changes in taxonomic (TD), phylogenetic (PD) and functional diversity (FD). Here we propose a method for the optimization of sampling protocols for inventorying and monitoring assemblages or communities across these three diversity dimensions taking sampling costs into account. We used Iberian spiders and Amazonian bats as two case-studies. The optimal combination of methods for inventorying and monitoring required optimizing the accumulation curve of α-diversity and minimizing the difference between sampled and estimated β-diversity (bias), respectively. For Iberian spiders, the optimal combination for TD, PD and FD allowed sampling at least 50% of estimated diversity with 24 person-hours of fieldwork. The optimal combination of six person-hours allowed reaching a bias below 8% for all dimensions. For Amazonian bats, surveying all the 12 sites with mist-nets and 0 or 1 acoustic recorders was the optimal combination for almost all diversity types, resulting in &gt;89% of the diversity and &lt;10% bias with roughly a third of the cost. Only for phylogenetic α-diversity, the best solution was less clear and involved surveying both with mist nets and acoustic recorders. The widespread use of optimized and standardized sampling protocols and regular repetition in time will radically improve global inventory and monitoring of biodiversity. We strongly advocate for the global adoption of sampling protocols for both inventory and monitoring of taxonomic, phylogenetic and functional diversity.","author":"Pedro Cardoso","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8ea3f62b4d8c75175ab7ceff24245f87632eeb28f81e7d1e0772085a76e1e5d4","category":"Interdisciplinary"}