{"title":"Development and Application of Microsatellite Markers for Genetic Diversity Assessment and Construction of a Core Collection of Myrciaria dubia Germplasm from the Peruvian Amazon","link":"https://www.preprints.org/manuscript/202407.2528/v1","date":1722414165000,"content":"The Amazonian shrub Myrciaria dubia (Kunth) McVaugh, known as \"camu-camu\", produces vitamin C-rich fruits of growing commercial interest. However, sustainable utilization requires assessment and protection of the genetic diversity of the available germplasm. We hypothesized that the ex situ M. dubia germplasm bank assembled from eight river basins across the Peruvian Amazon would harbor substantial genetic diversity and have a genetic population structure. This study aimed to (1) develop new polymorphic microsatellite markers, (2) characterize genetic diversity and validate the hypothesis in the ex situ germplasm, and (3) construct a core subset representing maximum allelic variability. Sixteen polymorphic microsatellite loci were developed using an enrichment approach. The evaluation of 336 genotypes from 43 accessions originating from eight river basins of the germplasm bank corroborated this hypothesis, revealing high gene diversity, with observed heterozygosity ranging from 0.468 to 0.644 and expected heterozygosity from 0.684 to 0.817 at the river basin level. Analysis of molecular variance showed a higher genetic variation within accessions and river basins, at 73% and 86%, respectively, than among accessions and river basins, at 27% and 14 %, respectively. Bayesian clustering detected the presence of ten genetic clusters, with several degrees of admixture among river basins. The Putumayo River basin showed a clear genetic homogeneity. A core collection of 84 genotypes was constructed, thus covering 86.7% of the global allelic diversity. These results have important implications for M. dubia conservation strategies and breeding programs, in demonstrating a need for genetic connectivity between populations but preserving unique genetic resources in isolated basins. These results validate the expected levels of diversity and population subdivision in a crop and stress the need to secure genetically diverse germplasms, underscoring the importance of thorough genetic characterization for ex situ germplasm management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8ea6aee26d8403e47a9f06d008fff71c01532f17a09de2d86cc7a11240b46c68","category":"Interdisciplinary"}