{"title":"Effect of Honeycomb Geometrical Parameters on Equivalent Radiated Power and Frequency Response of Motor Casing and Gearbox Surface of a Powertrain","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400060?af=R","date":1726737617000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c836d8d6-6912-4024-89b7-127992a1bbcf/appl202400060-gra-0001-m.png\" alt=\"Effect of Honeycomb Geometrical Parameters on Equivalent Radiated Power and Frequency Response of Motor Casing and Gearbox Surface of a Powertrain\" /><p>Equivalent radiated power (ERP) was measured at the driven and non-driven ends of a gearbox and motor casing, which were represented by ribs and honeycomb structures. Interestingly, the motor casing's driven end casing produced more noise when ribs were added than the gearbox and non-driven end. However, a 10% reduction in noise was achieved when a honeycomb structure was added in place of the original powertrain type.\n</p>\n<br />\n<h2>ABSTRACT</h2>\n<p>The powertrain, as a central source of noise and vibration, is crucial in determining the overall NVH (noise, vibration and harshness) performance of vehicles, necessitating the optimisation of its structural components for improved durability and passenger comfort. This paper investigates the influence of key geometrical parameters—cell thickness, skin thickness and cell length—on the complex frequency modes of honeycomb and square sandwich structures using the Altair OptiStruct solver 2022 and fast Fourier transform analyser. The driven and non-driven ends of a motor casing and a gearbox, represented by honeycomb structures and ribs, were subjected to an evaluation of equivalent radiated power (ERP). The results show that the square structure performs better at higher skin thickness when resisting severe lateral stresses than the honeycomb while being less stiff at higher cell thickness. Notably, smaller cell length had a substantial impact on the modes of the honeycomb structure, whereas larger cell length had an impact on the square structure. Response surface methodology was used to optimise the modal frequencies of both square and honeycomb panels simultaneously. An ideal cell length of 5.88 mm, skin thickness of 1.303 mm and cell thickness of 0.381 mm were found for the honeycomb construction, yielding a composite desirability of 0.981. On the other hand, with a cell length of 5.045 mm, skin thickness of 1.484 mm and cell thickness of 0.331 mm, the square structure achieved a composite desirability of 0.989. It is interesting to note that the driven end casing of the motor casing made more noise with the addition of ribs than the non-driven end and gearbox. But compared to the original powertrain model, adding a honeycomb structure resulted in a noise reduction of about 10%.</p>","author":"Aditya Ramachandra Hegde, \nP. V. Srihari, \nA. Bharatish, \nM. B. Venkat, \nB. R. Swastik Raj","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"8eb7588e42b34539862f99c635d610eefd501c9a8a33f2df1e6a175aaf55fb20","category":"Environment"}