{"title":"Limited Edition PEARL iZUMi: Contours Gravel Collection","link":"https://bikerumor.com/limited-edition-pearl-izumi-contours-gravel-collection/","date":1683916380000,"content":"<p>New Pearl gear is in, and this time it’s…topographical map contours befitting some gravel riding! Or…fingerprints? Or just line art? The closer you get, the more the “lines” get blurred, so maybe don’t sweat the inspiration too much.</p>\n\n\n\n<p>Bib shorts, gloves, and jerseys are all officially on the menu. Although, we’re not entirely sure where the gloves fit in the conversation since they lack the collection’s namesake contour lines.</p>\n\n\n\n<p>But, the bibs and jerseys are cool enough…</p>\n\n\n\n<h3>PEARL iZUMi Contours</h3>\n\n\n\n<p>The Contours collection gets the familiar $150 PRO Mesh Jersey that PEARL iZUMi rolls out under a wide array of varyingly bright and quirky plumages.</p>\n\n\n\n<p>Then there’s the Expedition PRO Bib Shorts. Man, you’d better really want a fancy pair of bibs covered in colorful impressionist squiggly lines, because these fetch a healthy $265. PI says the bibs are “next level” with their top Levitate PRO Chamois (peace, chafe city) and “luxurious” Italian PRO Transfer fabric. </p>\n\n\n\n<p>The Levitate chamois seeks to spread pressure across the broadest possible surface area through a layering methodology PEARL took from suspension forks. Instead of putting the densest layer closest to the saddle and the softest one near the rider’s bits, PI flipped it upside down. The result, it said in an email, “distributes pressure evenly across a wider area to prevent hot spots, create more support, and prevent the bottom out effect.”</p>\n\n\n\n<p>From testing out another pair of Expedition Pro bibs, BikeRumor knows the “luxurious” Italian fabric gives a snug fit that’s not especially stretchy compared to others in the category. PEARL’s material breakdown is 46% recycled nylon, 38% polyester, 16% elastane. </p>\n\n\n\n<p>The hand protection is PI’s $35 Full-Finger Expedition Glove. The gloves have a gel pad in the palm to help protect from nerve damage, which can occur on prolonged rides, or if your bars or hoods don’t fit your mitts quite right. They’re the only part of the kit actually without the “contour” lines, but will match your yellow squiggles.</p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove.jpg\"><img width=\"800\" height=\"800\" src=\"https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove-800x800.jpg\" alt=\"pearl izumi cycling glove\" srcset=\"https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove-800x800.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove-297x297.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove-120x120.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove-768x768.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/05/Contours_Gel-FF-Glove.jpg 1200w\" /></a></figure>\n\n\n\n<p>The fresh roundup joins a few previous PEARL iZUMi releases <a href=\"https://bikerumor.com/?s=pearl+izumi+grateful+dead\" target=\"_blank\">geared toward coloring life in</a>, which effectively share the same tech, yet with other unique styling.</p>\n\n\n\n<p><em><a href=\"https://www.pearlizumi.com/collections/new-arrivals?utm_source=IMM&amp;utm_medium=GG-Search&amp;utm_term=138923924598&amp;utm_content=pearl%20izumi&amp;utm_campaign=17547405819&amp;utm_a=138923924598\" target=\"_blank\">PearlIzumi.com</a></em></p>\n<p>The post <a href=\"https://bikerumor.com/limited-edition-pearl-izumi-contours-gravel-collection/\">Limited Edition PEARL iZUMi: Contours Gravel Collection</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Staff","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"8eb75e739ab0ab407d260916ca82edcfb70e822bdae3ff68ff4376b4e529301b","category":"Cycling"}