{"title":"Apple’s 1998 Developer Documentation on Window Proxy Icons","link":"http://mirror.informatimago.com/next/developer.apple.com/documentation/macos8/HumanInterfaceToolbox/WindowManager/ProgWMacOS8.5WindowMgr/WindowMgr.5.html","date":1626833198000,"content":"\n<p>Re: <a href=\"https://daringfireball.net/2021/07/document_proxy_icons_macos_11_and_12\">yesterday’s piece</a> about window proxy icons, Zack Katz found this archived version of Apple’s developer docs on the feature for Mac OS 8.5:</p>\n\n<blockquote>\n  <p>An application typically tracks the modification state of a\ndocument. A common reason to do so is to inform the user that they\nhave made changes to the document which they might wish to save\nbefore closing the window.</p>\n\n<p>When your application uses proxy icons, it should inform the\nWindow Manager when a document has unsaved changes. When you do\nso, the Window Manager displays the document’s proxy icon in a\ndisabled state and prevents the user from dragging the proxy icon.\nDisabled proxy icons cannot be dragged because unsaved documents\ncannot be moved or copied in a manner predictable to the user.\nFigure 1-3 shows a proxy icon in a document window with unsaved\nchanges.</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/zackkatz/status/1417452265816924184\">Katz tweeted:</a>:</p>\n\n<blockquote>\n  <p>@gruber I found this Mac OS 8.5 proxy icon documentation a great\nread. It made me nostalgic — imagine being able to see saved\nstate quickly just by seeing the icon and title color!</p>\n\n<p>Things have gotten so low-contrast…</p>\n</blockquote>\n\n<p>Low contrast indeed. What a joyful little feature this was (and could be again). <em>Clarity</em> is the ideal that the Mac user interface used to celebrate but now largely ignores. I crave its return.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/07/20/apple-developer-docs-proxy-icons\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"8ebaf1d62faedaa0985ff24d96e2a7b4c1305a108b1be7102db40018c35485e5","category":"Tech"}