{"title":"Antibacterial and antioxidant activities of plants consumed by western lowland gorilla (<i>Gorilla gorilla gorilla</i>) in Gabon","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306957","date":1726063200000,"content":"<p>by Leresche Even Doneilly Oyaba Yinda, Richard Onanga, Cédric Sima Obiang, Herman Begouabe, Etienne François Akomo-Okoue, Judicaël Obame-Nkoghe, Roland Mitola, Joseph-Privat Ondo, Guy-Roger Ndong Atome, Louis-Clément Obame Engonga, Ibrahim, Joanna M. Setchell, Sylvain Godreuil</p>\r\n\r\nZoopharmacognosy is the study of the self-medication behaviors of non-human animals that use plant, animal or soil items as remedies. Recent studies have shown that some of the plants employed by animals may also be used for the same therapeutic purposes in humans. The aim of this study was to determine the antioxidant and antibacterial activity of <i>Ceiba pentandra</i>, <i>Myrianthus arboreus</i>, <i>Ficus</i> subspecies (ssp.) and <i>Milicia excelsa</i> bark crude extracts (BCE), plants consumed by western lowland gorillas (<i>Gorilla gorilla gorilla</i>) in Moukalaba-Doudou National Park (MDNP) and used in traditional medicine, and then to characterize their phytochemical compounds. DPPH (2,2-Diphenyl-1-Picrylhydrazyl), phosphomolybdenum complex and β-carotene bleaching methods were used to assess antioxidant activity. Antimicrobial susceptibility testing was performed using the diffusion method, while minimum inhibitory concentration (MIC) and minimum bactericidal concentration (MBC) were assessed using the microdilution method. The highest level of total phenolics was found in <i>Myrianthus arboreus</i> aqueous extract [385.83 ± 3.99 mg [gallic acid equivalent (GAE)/g]. Total flavonoid (134.46 ± 3.39) mg quercetin equivalent (QE)/100 g of extract] were highest in <i>Milicia excelsa</i>, tannin [(272.44 ± 3.39) mg tannic acid equivalent (TAE)/100 g of extract] in <i>Myrianthus arboreus</i> and proanthocyanidin [(404.33 ± 3.39) mg apple procyanidins equivalent (APE)/100 g of extract] in <i>Ceiba pentandra</i>. <i>Ficus</i> ssp. (IC<sub>50</sub> 1.34 ±3.36 μg/mL; AAI 18.57 ± 0.203) ethanolic BCE and <i>Milicia excelsa</i> (IC<sub>50</sub> 2.07 ± 3.37 μg/mL; AAI 12.03 ± 0.711) showed the strongest antioxidant activity. <i>Myrianthus arboreus</i> ethanolic BCE (73.25 ± 5.29) and <i>Milicia excelsa</i> aqueous BCE (38.67 ± 0.27) showed the strongest percentage of total antioxidant capacity (TAC). <i>Ceiba pentandra</i> ethanolic BCE (152.06 ± 19.11 mg AAE/g) and <i>Ficus</i> ssp aqueous BCE (124.33 ± 39.05 mg AAE/g) showed strongest relative antioxidant activity (RAA). The plant BCE showed antimicrobial activity against multidrug resistant (MDR) <i>E</i>. <i>coli</i> (DECs) isolates, with MICs varying from 1.56 to 50 mg/mL and inhibition diameters ranging from 7.34 ± 0.57 to 13.67 ± 0.57mm. Several families of compounds were found, including total phenolic compounds, flavonoids, tannins and proanthocyanidins were found in the plant BCEs. The plant BCEs showed antioxidant activities with free radical scavenging and antimicrobial activities against 10 MDR <i>E</i>. <i>coli</i> (DECs) isolates, and could be a promising novel source for new drug discovery.","author":"Leresche Even Doneilly Oyaba Yinda","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8ec0ad5850b0494be3cb69132f41dd791309121a9caca1e7e80333017599121f","category":"Interdisciplinary"}