{"title":"Venus is so very nice, NASA is going there twice","link":"https://arstechnica.com/?p=1769277","date":1622673672000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/imagesvenus20191211venus20191211-16.width-1024-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/imagesvenus20191211venus20191211-16.width-1024.jpg\">Enlarge</a> <span>/</span> NASA has not launched a mission to Venus since 1989. (credit: <a href=\"https://www.nasa.gov/\">NASA/JPL-Caltech</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>NASA announced Wednesday that it will send, not one, but two spacecraft to Venus this decade as part of its efforts to ramp up exploration of the closest planet to Earth.</p>\n<p>The decision was hailed by scientists who study Venus and have felt neglected by a space agency decidedly more interested in Mars. NASA has not sent a robotic spacecraft to Venus since the launch of the Magellan orbiter in 1989. Launched by space shuttle <em>Atlantis</em>, Magellan made a controlled entry into the Venusian atmosphere in 1994 after collecting reams of data that have tantalized scientists ever since.</p>\n<p>\"The Venus community is absolutely elated and excited and wants to just get to work and see this happen,\" said Venus researcher Ellen Stofan, the Smithsonian Under Secretary for Science and Research, in an interview. \"We all are so hungry for data, for moving the science forward. A lot of us worked in this field since Magellan. We've had these really fundamental science questions for so long.\"</p></div><p><a href=\"https://arstechnica.com/?p=1769277#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1769277&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ec35a4c9b848723f1062a06f48f00f737ff302051820ce51ca5b20bec3263e1","category":"Tech"}