{"title":"Effects of work-directed interventions on return-to-work in people on sick-leave for to common mental disorders—a systematic review","link":"http://link.springer.com/10.1007/s00420-024-02068-w","date":1722470400000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Purpose</h3>\n                      <p>To evaluate the body of evidence of the effects of work-directed interventions on return-to-work for people on sick leave due to common mental disorders (i.e., mild to moderate depression, anxiety, adjustment disorders and reactions to severe stress).</p>\n                    </span>\n                    <span>\n                      <h3>Methods</h3>\n                      <p>The systematic review was conducted in accordance with an a priori developed and registered protocol (Prospero CRD42021235586). The certainty of evidence was assessed by two independent reviewers using the Grading of Recommendations, Assessment, Development and Evaluations.</p>\n                    </span>\n                    <span>\n                      <h3>Results</h3>\n                      <p>We reviewed 14,794 records published between 2015 and 2021. Of these, eight RCTs published in eleven articles were included in the analysis. Population: Working age adults (18 to 64 years), on sick leave due to mild to moderate depression, anxiety, adjustment disorders or reactions to severe stress. Intervention: Work-directed interventions. Comparator: No comparator, Standard care, or other measures. Outcome: return to work, number of days on sick leave, income. Overall, the effects of work-focused CBT and work-focused team-based support on RTW resulted in increased or faster return-to-work compared with standard care or no intervention (low certainty of evidence). The effects of Individual Placement and Support showed no difference in RTW compared with standard care (very low certainty of evidence).</p>\n                    </span>\n                    <span>\n                      <h3>Conclusion</h3>\n                      <p>Interventions involving the workplace could increase the probability of RTW. Areas in need of improvement in the included studies, for example methodological issues, are discussed. Further, suggestions are made for improving methodological rigor when conducting large scale trials.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"8ec7c4d51ee83975850e659bf89250504252b6c48f2f75b482dc91e2e099daef","category":"Environment"}