{"title":"Qualcomm announces first-ever mass-market RISC-V Android SoC","link":"https://arstechnica.com/?p=1976490","date":1697564094000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/01/qualcomm-hq-2-stock-image-800x533.jpg\" alt=\"Qualcomm sign\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/01/qualcomm-hq-2-stock-image.jpg\">Enlarge</a> (credit: Qualcomm)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Android ecosystem is hurtling toward a RISC-V future. The puzzle pieces for the up-and-coming CPU architecture started falling into place this past year when Google announced <a href=\"https://arstechnica.com/gadgets/2023/01/google-announces-official-android-support-for-risc-v/\">official RISC-V support</a> in Android and plans to make it a \"tier 1 platform\" on equal footing with Arm. With the OS support underway, what we need now is hardware, and Qualcomm is stepping up to announce the <a href=\"https://www.qualcomm.com/news/releases/2023/10/qualcomm-to-bring-risc-v-based-wearable-platform-to--wear-os-by-\">first-ever mass-market RISC-V Android SoC</a>.</p>\n<p>It doesn't have a name yet, but Qualcomm says it's developing a \"RISC-V Snapdragon Wear\" chip in collaboration with Google. The company says it plans to \"commercialize the RISC-V based wearables solution globally including the US.\" For Google and Qualcomm, this chip represents everyone's first swing at a commercial RISC-V Android project, and as far as we can tell, it's the first announced mass-market RISC-V Android chip <em>ever. </em>Qualcomm says the groundwork it and Google lay out \"will help pave the way for more products within the Android ecosystem to take advantage of custom CPUs that are low power and high performance.\"</p>\n<p>RISC-V represents a big threat to the Arm CPU architecture that currently dominates all mobile devices. RISC-V architecture is open source, which can make it cheaper and more flexible than Arm. If companies want to design their own chips, they can do that without paying a licensing fee to Arm. Since the architecture is open source, it's possible to create a fully open source chip. If you're a chip-design firm, you can make your own proprietary chip designs and license them, making you a competitor to Arm's chip-design business.</p></div><p><a href=\"https://arstechnica.com/?p=1976490#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1976490&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ec72549ddfcbbbe60b384db3cc4c4f293a0825bbb337f87c2cb67d066a8490b","category":"Tech"}