{"title":"Frowning Remco Evenepoel has a reason to smile","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/early-pacesetter-the-racing-finally-does-the-talking","date":1693244855000,"content":"\n      \n<p><span>And, finally, the racing can do the talking at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a>. Well, if we can excuse for a moment that defending champion Remco Evenepoel crashed into soigneurs and photographers immediately after winning stage three, cutting his face open.</span></p>\n<p><span>The weekend of chaos and carnage is in the rearview mirror. The incidents may not be completely gone but they are less frequent, and this star-studded start list, replete with Grand Tour champions and almost all of the biggest GC names in the sport, are the ones now taking centre stage.</span></p>\n<div></div>\n<p><span>On an uphill finish to the ski station of Arinsal, the mountain tops lined with snow following an unseasonable cold blast from the Atlantic, it was Evenepoel who emerged victorious, beating his chest and expressing a cocksure grimace as he crossed the line.</span></p>\n<p><span>In recent days, Evenepoel, the defending champion, let’s not forget, has cut a frustrated, agitated figure. He fumed and raged after the team time trial fiasco and knocked down a reporter’s microphone; he was vexed by yet another anti-doping control on stage two; and described himself as having “had enough of it” after his post-stage crash in Andorra.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-four-preview\"><strong><em>Read more: Vuelta a España 2023 stage four preview - the first opportunity for the sprinters</em></strong></a></p>\n<p><span>But the normally cheery 23-year-old doesn’t have much reason to be too angry now. After three days, he is back in the </span><em><span>maillot rojo</span></em><span> and has a lead of five seconds to Enric Mas – his closest competitor 12 months ago. More importantly, he has 31 seconds over Jonas Vingegaard, while Primož Roglič and Juan Ayuso are almost 40 seconds in arrears.</span></p>\n<p><span><img alt src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20230828VUE02003-UNIPUBLIC___SPRINT_CYCLING_AGENCY.jpg?v=1693244483\" />This is significant. Despite Evenepoel being a recent world champion, despite him being a winner of this very race just a year ago, and despite him having racked up 48 wins in just five years as a professional, there is still the perception in many quarters that he cannot go toe-to-toe with the very best general classification riders in a Grand Tour. Vingegaard and Tadej Pogačar? Too strong for him goes the oft-repeated sentiment.</span></p>\n<p><span>It’s a school of thought that largely takes in the fact that he hasn’t yet ridden the Tour de France - he will make his debut in 2024 - and that he’s barely raced against Pogačar, but it ignores all of his other results, his battles against Roglič, and, above all, his repertoire of talents. Besting Vingegaard on stage three, even if it was just by one second, was yet more evidence to the deep catalogue that he can compete directly with the elite of the elite in a three-week race.</span></p>\n<p><span>He wasn’t the only one we learned a lot about in Andorra. Mas, injured on stage one of the Tour, is clearly fine. His Movistar team have not been playing up his chances when journalists have been asking about him at stage starts, but neither have they talked him down. It is obvious that he has recovered well. </span></p>\n<p><span>His compatriot, Juan Ayuso, is also going strong. The 20-year-old attacked on the finishing slopes and rolled home third. The only GC rider to have focused on this race all year, the Spaniard looks set to be a major protagonist. Geraint Thomas, however, appears in a spot of bother. Nursing a sore knee after a crash on stage two, the Ineos Grenadiers leader finished 47 seconds behind Evenepoel. He looked laboured, sluggish, uncomfortable.</span></p>\n<p><span>As the race now heads back into Spain after a 24-hour excursion in the mountain hideaway of Andorra, it does so with a clearer picture of who’s going well, who isn’t, and what racing narratives will be formed over the coming three weeks. The GC fight will take a break in the next two days, but when it returns on stage six, there are a lot of riders with work to do to overturn the early pacesetter Evenepoel. Maybe now the Belgian will sport a smile.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8ec9822e794adc1b960391186ad58ed1c93bfa682992941307fe931407b9dd3a","category":"Cycling"}