{"title":"What became of 2009’s Left 4 Dead 2 boycott? Here’s the inside story","link":"https://arstechnica.com/?p=1761388","date":1619874003000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/l4d2-head-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/l4d2-head.jpg\">Enlarge</a> <span>/</span> Bill looks over the boycott's corpse to determine if it's still a threat... </p>  </figure><p><em>The following piece, originally published in late 2009, looks back at that year's somewhat quixotic attempted boycott of <em>Left 4 Dead 2</em>—and how that effort eventually fell apart. Flawed as it was, that movement would serve as a precursor to more frequent attempts by organized fan communities trying to bring change in the game industry. The most famous example might be <a href=\"https://arstechnica.com/gaming/2012/03/protests-over-ending-of-mass-effect-3-show-fan-investment-in-story-control/\">the outcry around the conclusion of <em>Mass Effect 3</em></a> in 2012, where the developers actually <a href=\"https://arstechnica.com/gaming/2012/06/extended-cut-provides-much-needed-epilogue-for-mass-effect-3/\">released a downloadable patch</a> changing the conclusion of a franchise-sweeping narrative to placate vocal fans.<br /><br />\n\nThis report and over a dozen more are collected in <a href=\"https://storybundle.com/games\"><em>Save Point</em></a>, a new collection from Ars Technica Senior Gaming Editor Kyle Orland. The book looks back on video games as they were between 2003 to 2011, a sometimes-uncomfortable \"awkward adolescence\" period where the industry did its best to grow up with the young audience that had grown up with games as their entertainment of choice through the '70s, '80s, and '90s. The pieces collected in the book analyze how games were learning from their past and influencing the future, report on some of gaming's growing and myriad sub-communities, and examine how the business of selling and marketing games was evolving alongside the explosive growth of the Internet.<br /><br /><em>Save Point</em> is available exclusively as part of <a href=\"https://storybundle.com/games\">the Spring Getaway Games Bundle</a> through May 13.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>In general, gamers aren't very effective at organizing to effect change in the game industry. Sure, there are hundreds of online petitions demanding everything from a <i>Full House</i> game to a generalized end to game hacking, but the vast majority fail to garner much attention or support. Even well-organized and well-publicized efforts, like those seeking LAN support in <i>StarCraft 2</i> or <a href=\"http://starmen.net/petition/\">further support for the <i>Earthbound</i> games</a> are met with official responses ranging from <a href=\"https://web.archive.org/web/20090901000000*/http://www.starcraft-fans.com/page/Blizzard+Responds+to+No+LAN+Support\">polite refusal</a> to <a href=\"https://web.archive.org/web/20121026092227/http://www.1up.com/news/reggie-metroid-stock-issues-earthbound\">teasing hints</a>, and rarely with real change.</p>\n<p>But this year, many gamers took a different tack to protest what they saw as a betrayal of a publisher's past promises. Mere hours after Valve announced the planned November release of <i>Left 4 Dead 2</i> (<i>L4D2</i>) at June's Electronic Entertainment Expo, a group calling for an <a href=\"http://steamcommunity.com/groups/L4D2boycott\"><i>L4D2</i> boycott</a> popped up on Valve's Steam user community. The group's <a href=\"https://web.archive.org/web/20100809221942/http://steamcommunity.com/groups/L4D2boycott/announcements/detail/90217867362678310\">first public message</a> asked a simple question that would come to define its cause: \"Where's all the content and the updates you promised for [the original <i>Left 4 Dead</i>], Valve?\"</p></div><p><a href=\"https://arstechnica.com/?p=1761388#p3\">Read 58 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1761388&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ed56477972ab8cc5d40da56c8b644df98e3f82ea26e49e2398ab3040ee843ac","category":"Tech"}