{"title":"First Report of Porcine Parvovirus 8 in Europe: Widespread Detection and Genetic Characterization on Commercial Pig Farms in Hungary and Slovakia","link":"https://www.preprints.org/manuscript/202405.2161/v1","date":1717168335000,"content":"Porcine parvovirus 8 (PPV8), a novel virus in the Parvoviridae family, was first identified in 2022 in lung samples of domestic pigs from China. Retrospective analyses showed that it had been circulating in China since 1998, but no other countries had reported its presence so far. A recent study conducted in South America did not detect any PPV8-positive samples in that region. Here we report the detection of PPV8 in Hungarian and Slovakian pig farms and the estimated prevalence of the virus in Hungary. Altogether 2230 serum, 233 oral fluid, and 115 processing fluid samples were systematically collected from 23 Hungarian and 2 Slovakian pig farms between 2020 and 2023. A real-time quantitative PCR method was developed to detect the viral genome. Our results revealed the presence of PPV8 on 65% of the Hungarian farms and on both Slovakian farms included in our study, marking its first detection in Europe. Oral fluid samples showed the highest positivity rates, reaching up to 100% in some herds. The viral genome was successfully detected in serum and processing fluid samples too, but with significantly lower prevalence rates of 4% and 5%, respectively. Genetic analysis of 11 partial VP2 sequences demonstrated high similarity to the original Chinese strain but with unique amino acid mutations, suggesting possible local evolution of the virus. Our study presents the first scientific evidence of PPV8 infection outside of China and offers a comprehensive assessment of its prevalence in the Hungarian pig population. Further research is required to understand its potential impact on swine health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8ee4896b0c6e9a4c58c396aea4ea8d2c48e2eecd7190b59be3c008ee6408a57f","category":"Interdisciplinary"}