{"title":"Chronic Hepatitis B Mouse Model with Persistent Covalently Closed Circular DNA","link":"https://www.preprints.org/manuscript/202410.0611/v1","date":1728392573000,"content":"Hepatitis B virus (HBV) can cause chronic infections, significantly increasing the risk of death from cirrhosis and hepatocellular carcinoma (HCC). A key player in chronic HBV infection is covalently closed circular DNA (cccDNA), a stable episomal form of viral DNA that acts as a persistent reservoir in infected hepatocytes and drives continuous viral replication. Despite the development of several animal models, few adequately replicate cccDNA formation and maintenance, limiting our understanding of its dynamics and the evaluation of potential therapeutic interventions targeting cccDNA. In this study, we aimed to develop a mouse model to investigate cccDNA formation and maintenance. We infected C57BL/6 mice with recombinant adeno-associated virus (rAAV) carrying a 1.3-overlength HBV genome (genotype C) and collected liver tissue at various time points to assess cccDNA levels and viral replication. Our results demonstrated the successful establishment of a chronic hepatitis B mouse model using rAAV-HBV1.3, which supported persistent HBV infection with sustained cccDNA expression in hepatocytes. Serum levels of HBsAg and HBeAg were elevated for up to 12 weeks, while alanine transaminase (ALT) levels remained within the normal range, indicating limited liver damage during this period. We confirmed HBV DNA expression in hepatocytes, and importantly, cccDNA was detected using qPCR after Plasmid-Safe ATP-Dependent DNase treatment, which selectively removes non-cccDNA forms. This established model provides a valuable platform for studying the long-term maintenance of cccDNA in chronic HBV infection and offers an important tool for testing novel therapeutic strategies aimed at targeting cccDNA.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8ee9211afdd10a0f465fb61f38194d69e840330000dfd09aaff2b3341cc325b8","category":"Interdisciplinary"}