{"title":"Analysis and calculation of scour critical velocity of suspended particles in a storm sewer","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11135?af=R","date":1726811410000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/90d03851-e356-421f-932a-9add06b3bd26/wer11135-toc-0001-m.png\" alt=\"Analysis and calculation of scour critical velocity of suspended particles in a storm sewer\" />\n<p>Scour critical velocity of suspended particulate matter in a storm sewer with different pipe materials showed the regularity as the larger the particle size, density or the roughness of the pipe wall, the larger the critical velocity. Calculation models for the scour critical velocity of suspended particles were established. Difference rates between the calculated value and the measured value were within −10.56% to 6.63%, and the two had good consistency.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The suspended particles in storm sewer can be easily washed away and migrated. However, few studies analyzed the scouring state of suspended particles in pipelines, and also, there was a lack of quantitative calculation. This study simulated the scouring process of suspended particles in a storm sewer with different pipe materials, and mathematical models were built for the scour critical velocity. The results showed that with the increase of particle size, density and the roughness of the pipe wall, the scour resistance of suspended particles increased, and the scouring rate decreased; therefore, the corresponding scour critical velocity increased. In accordance with the scouring rates of quartz sand and zeolite at different flow velocities in the storm sewer, the scouring state of the suspended particles could be divided into three types: no scouring, minor scouring, and massive scouring. The scour critical velocity ranges of quartz sand and zeolite with two densities in four kinds of pipes were determined, and mathematical models for the scour critical velocity of suspended particles were established. After verification, the difference rate between the calculated values and measured values was in the range of −10.56% to 6.63%, and the two values had good consistency.</p>\n<h2>Practitioner Points</h2>\n<p>\nScour resistance of suspended particles increases with particle size or density.\nThe smaller the roughness of the pipe wall, the higher the scouring rate.\nHigher flow velocity leads to a higher scouring rate.\nAs scouring rate rises, no scouring, minor or massive scouring occur in sequence.\nDifference between the calculated and measured values is from –10.56% to 6.63%.\n</p>","author":"Haodong Wei, \nYuling Xie, \nChangfeng Zhou, \nYang Tao, \nJingqin Zhou, \nCuiyun Liu","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"8eeaa990227aa17e65e585f739dfca1e43b4db768e65a8576f381519bf84d524","category":"Environment"}