{"title":"Apple is finally ready to admit the Apple Watch is all wrong","link":"https://www.macworld.com/article/1927793/admit-apple-watch-all-wrong.html","date":1685008800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p><a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC 2023</a> is creeping up, and with Apple fans starved of event hype since the iPhone 14 launch well over eight months ago, expectations are high. Of course the Reality Pro headset, if the company has managed to get it finished in time, will be the flagship announcement. But one of Apple’s less heralded products might be the sleeper hit of the show.</p>\n\n\n\n<p>Last month, the respected leaker-analyst Mark Gurman claimed watchOS 10 <a href=\"https://www.macworld.com/article/1788333/watchos-10-apple-watch-updated-interface-enhancements.html\">will be so good</a> that no one will care about the (reportedly rather underwhelming) new Apple Watch hardware coming later in the year. What that means in practice seems to be an updated interface, and while the use of the word “updated” rather than “new” implies something less radical and alarming than iOS 7, for instance, most pundits think it will still be a major rethink of the way we control our smartwatches.</p>\n\n\n\n<p>A few days later, in fact, a <a href=\"https://www.macworld.com/article/1792206/watchos-10-new-interface-ios-style-app-grid-folders.html\">new leak</a> gave us some idea of what watchOS 10 will look like. Most fundamentally, the famous Grid View app layout, a visually baffling honeycomb of unlabelled icons that’s remained the same since 2015 (albeit joined by the alternative List View in 2017), will reportedly be ditched in favor of more iOS-esque uniform rows of larger icons that you scroll through vertically. This seems far more logical and user-friendly, and might even tempt a few of us back from List View, which has many advantages but doesn’t give you any way to put the more frequently used apps closer to the center.</p>\n\n\n\n<p>(I should interject at this point to warn that this second leak came from @analyst941, also known as “anonymous-A-S” and, more recently, “that leaker who got <a href=\"https://www.macworld.com/article/1816449/leaker-analyst941-twitter-busted-apple-sting-operation.html\">busted by an Apple sting</a>.” At this point it’s unclear how much of 941’s flurry of leaks were accurate, and how much was targeted misinformation. But in this case at least, the unfortunate leaker’s sources are corroborated elsewhere. The gist is probably correct.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Series 8 apps\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?quality=50&amp;strip=all 2000w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/09/Apple-Watch-Series-8_review_5.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>Grid View: A usability nightmare.</figcaption></figure><p>Dominik Tomaszewski / Foundry</p></div>\n\n\n\n<h2>Going off the grid</h2>\n\n\n\n<p>Apple’s long-term loyalty to Grid View has been difficult to understand; it’s simply not an efficient use of a small screen and requires both excellent memory of icon artwork (which, rather unhelpfully, can change) and dextrous fingers. Perhaps the company felt that this was a recognizable signature of the Apple Watch, much as the Home button and later the notch and Digital Island have served as visible badges for the iPhone. But this isn’t, as those other examples are, a question of making a virtue of necessity. The Grid View is simply bad design that could easily be improved… and hopefully is about to be.</p>\n\n\n\n<p>The interface refresh may not stop at rearranging the icons, however. If we are to believe @analyst941 (and as I say, that isn’t a given), then Apple is also about to include folders on the Apple Watch’s home screen for the first time. This seems a less logical evolution, but that might be because I haven’t yet seen how watchOS will implement the feature. I’m mentally transplanting the folder system from iOS onto the watch when it actually needs to be rethought if it’s to avoid fiddliness. Apple’s interface design team has dropped a few balls since Jony Ive left, but I’m optimistic that they will find the right way to do folders on the smallest screen.</p>\n\n\n\n<p>The key thing is that you need to be willing to take risks, try things out, and change them if they’re not working. And this is where watchOS’s development has been most disappointing. In the fundamentals, in terms of the home screen and app layout, Apple has generally been unwilling to ring the changes. It’s particularly disappointing in this case because the Apple Watch has seen a lot of change in the way it’s regarded by maker and customers alike since Grid View was created in 2015. Apple accepted that it got other parts of the interface wrong; the side button used to bring up a list of contacts, until the makers realized a dock would be more useful. It shouldn’t have taken this long to realize that Grid View too was a swing and a miss.</p>\n\n\n\n<h2>Can I widget? Yes you can</h2>\n\n\n\n<p>We’ve killed Grid View and we’ve welcomed folders. But there’s one more change (reportedly) coming to the Apple Watch interface this year, and it’s widgets.</p>\n\n\n\n<p>At the end of April, Gurman returned to the subject of watchOS 10 and predicted that it would focus on widgets rather than apps, in an implementation that sits somewhere between the old Glances that the Apple Watch got rid of back in watchOS 3 and the widgets you now get on the iPhone and iPad. (This matches a prediction by @analyst941, by the way.) It will also share some features of the Smart Stack in iOS and iPadOS, a deeply handy feature that cycles the widgets it shows based on the location and time of day and what it thinks will be most useful to you.</p>\n\n\n\n<p>I didn’t really go for Glances back in the day and shed few tears when they disappeared. But plenty of others have sung their praises to me, and I’m prepared to believe they can work in an updated form.</p>\n\n\n\n<p>The key here is to think laterally about the way the Apple Watch works, and the qualities and limitations that make it different to an iPhone or an iPad. It’s always on you, so it’s uniquely convenient to check quickly, but it’s tiny, so it’s uniquely inconvenient for extensive navigation. (I hate faffing around in the Maps app, for example, but when requesting directions to a saved location with a single tap, the user experience sings.) There’s a sweet spot, richer than the complication and simpler than the app, where the Apple Watch can provide deep and relevant information without demanding that you interact with it too much, and the new watchOS widget can occupy that space.</p>\n\n\n\n<p>Of course, we won’t know if the watch widget–or the rest of the interface refresh-works well until the <a href=\"https://www.macworld.com/article/1792869/watchos-10-release-date-new-features.html\">watchOS 10</a> beta gets rolled out next month. Perhaps it will be like iOS 7: initial alarm followed by a slight aesthetic softening and eventual acceptance. Perhaps it will be an instant hit, or an irredeemable failure. But the important thing is that Apple has finally accepted that the Apple Watch’s interface isn’t working properly and needs to change. The first step is recognizing you’ve got a problem. Everything else flows from that.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8eeeaa70d7ac77f01fe0ca3a8cd2aa6b65770942a678b0ffd694d7e5088672e3","category":"Apple"}