{"title":"Molecular Mechanism and Signal Transduction of Resistance to Low-Temperature Stress Induced by Bacillus amyloliquefaciens GL18 in Avena sativa","link":"https://www.preprints.org/manuscript/202408.1888/v1","date":1724765687000,"content":"Bacillus amyloliquefaciens GL18 has been proven to have good resistance ability and can promote the growth of Avena sativa cultivar ‘Qingyan 1’. Herein, Illumina high-throughput transcriptome sequencing technology was used to analyze the differential expression of genes between the interaction group (LB) and the control group (LCK) when ‘Qingyan 1’ roots interacted with GL18 bacterial suspension or sterile water for 12 h under 4 °C low-temperature stress. The gene function annotation information was obtained using Gene Ontology (GO) functional classification and enrichment analysis. Kyoto Encyclopedia of Genes and Genomes (KEGG) pathway enrichment analysis and annotation of differentially expressed genes was used to explore the related signal transduction pathway of ‘Qingyan 1’ response to cold stress induced by Bacillus GL18. The results showed that after ‘Qingyan 1’ seedlings interacted with GL18 bacterial suspension or sterile water for 12 h, comparing the LB with the LCK or CK (the control group at 26 °C), there were 12,061 and 25,489 differentially expressed genes, respectively. Their functions were mainly related to metabolic process, cellular process, catalytic activity, binding, and cellular parts, and they were significantly enriched in plant tissue growth and development, cell wall, organelle membrane synthesis, thiamine and its compounds, biosynthesis, polyamine decomposition, and other metabolic processes. Signal transduction was detected through KEGG pathway enrichment analysis, and corresponding genes, such as AUXI, PP2C, SNRK2, ABF, BRI1, and PIF4, were expressed. The expression of genes directly involved in plant growth was upregulated in the presence of GL18, as shown by real-time quantitative PCR analysis. It was speculated that the normal growth and development of ‘Qingyan 1’ under low-temperature stress promoted by GL18 is a result of the integration of multiple pathways in terms of regulating endogenous hormone metabolism, secondary metabolite synthesis, and photosynthesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8eef3c420c60e847563de62877abd05cde037c7f51ab8a09437830cbd4778157","category":"Interdisciplinary"}