{"title":"Contribution of ultrasound‐assisted protein structural changes in marinated beef to the improved binding ability of spices and flavor enhancement","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13914?af=R","date":1726729200000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Marination is an important part of air-dried beef processing, and traditional methods are inefficient and produce inconsistent results. Ultrasound, as a novel technology, can be combined with traditional marination methods. The study aimed to investigate the improvement of beef flavor by ultrasound-assisted marination. At the same time, the potential relationship between the alteration of meat protein and flavor quality by ultrasound-assisted marinating was further investigated to enable better flavor modulation and research.</p>\n<h2>RESULTS</h2>\n<p>Headspace solid-phase microextraction–gas chromatography–mass spectrometry revealed that the spice flavor of beef was significantly enhanced by 500 W ultrasound-assisted marination. Meanwhile, the experimental results demonstrated that the ultrasound-assisted marination promoted the unfolding of beef myofibrillar protein structure, which increased the number of hydrophobic and hydrogen bonding sites, enhanced the electrostatic effect and improved the functional properties of the protein. Ultrasound-assisted marination significantly enhanced the binding ability of beef myofibrillar proteins to flavor compounds compared with conventional marination. An electronic nose confirmed that this resulted in a significant increase in the flavor of the marinated meat.</p>\n<h2>CONCLUSION</h2>\n<p>Ultrasound-assisted marination effectively enhanced the flavor of marinated meat, which was closely related to the development of protein conformation. The results of this study have important implications for the food industry and the role of protein unfolding processes in flavor modulation. In particular, the findings can be practically applied to improving meat flavor under ultrasound-assisted marination. © 2024 Society of Chemical Industry.</p>","author":"Chukai Li, \nYangying Sun, \nDaodong Pan, \nChangyu Zhou, \nJun He, \nLihui Du","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8efcd7e973372bc42b0d41380c9b2bf25dae06e7ac5272db8e6d39cea8b961b0","category":"Environment"}