{"title":"โอกาสมาแล้ว! ร่วมงานกับเอคเซนเชอร์  บริษัทที่ปรึกษาไอทีที่ให้คุณออกแบบ Career Path ได้ด้วยตัวเอง","link":"https://www.blognone.com/node/125724","date":1636452000000,"content":"<div><div><div><p>พูดถึงเอคเซนเชอร์  หลายคนน่าจะรู้จักกันอยู่แล้วในฐานะบริษัทที่ปรึกษาด้านธุรกิจและเทคโนโลยีชั้นนำระดับโลกรายแรกๆ ในไทย ปัจจุบันมีพนักงานกว่า 1,400 คน ในประเทศไทย และด้วยการเติบโตอย่างรวดเร็วของบริษัทฯ เรายังคงมองหาทีมงานคนรุ่นใหม่ที่มีความสามารถทั้งในด้าน Technology และ Consulting มาเสริมความแข็งแกร่งให้กับเราอีกด้วย</p>\n<p>ความเป็นบริษัทชั้นนำระดับโลก จึงทำให้การทำงานกับ เอคเซนเชอร์  เปิดโอกาสให้พนักงานได้ทำงานในโปรเจกต์ต่างๆ ที่หลากหลาย ท้าทาย และหลายโปรเจกต์ก็เป็นจุดเปลี่ยนของนวัตกรรมใหม่ๆ ในระดับประเทศ ระดับภูมิภาค หรือระดับโลก ซึ่งโอกาสเหล่านี้จะช่วยให้พนักงานได้เรียนรู้ กับผู้เชี่ยวชาญในสาขาต่างๆ จากหลากหลายภูมิภาค สามารถพัฒนาความสามารถและศักยภาพของตนเองอยู่ตลอดเวลา</p>\n<p>และเนื่องจากบริษัทฯ ต้องการส่งเสริมพนักงานทุกคนให้เป็น career owner ของตนเอง ดังนั้นพนักงานจึงสามารถออกแบบความก้าวหน้าในการทำงานของตน (Career Path) เพื่อให้เหมาะสมกับความสามารถ ประสบการณ์และความสนใจส่วนตัว และเพื่อให้บรรลุถึงเป้าหมายในการพัฒนาบุคลากร (people development) ของตัวเองได้ด้วย วัฒนธรรมองค์กรในเอคเซนเชอร์  จึงเป็นวัฒนธรรมที่ให้ความสำคัญในด้าน empowerment และ inclusiveness เพื่อให้พนักงานได้แสดงศักยภาพของตนเองอย่างเต็มที่โดยไม่มีกรอบใดๆ มาจำกัด</p>\n<p>และเมื่อเป็นเช่นนี้แล้ว ค่าตอบแทน รวมถึงสวัสดิการต่างๆ จึงถูกออกแบบมาให้สอดคล้องกับเป้าหมายเหล่านี้ ไม่ว่าจะเป็นการมี Hot Skill Bonus สำหรับผู้ที่มี skill พิเศษที่เป็นที่ต้องการของตลาด หรือ Performance Achievement ที่เป็นการวัดผลงานจากเป้าหมายที่พนักงานเป็นคนกำหนด และตั้งเองให้เหมาะสมกับหน้าที่และความรับผิดชอบของตน  รวมถึง real time feedback จากผู้ร่วมงานในโปรเจกต์เพื่อจะได้นำ feedback ไปปรับปรุงได้ทันที</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a1f6ca0a1d45669e2d10d107adedc940.png\" /></p>\n<h3>เอคเซนเชอร์ที่ไม่ได้มีดีแค่การเป็นที่ปรึกษาด้านไอที</h3>\n<p>เอคเซนเชอร์เป็นบริษัทที่ปรึกษาด้านธุรกิจและเทคโนโลยี เปิดให้บริการในไทยมามากกว่า 40 ปี และเป็นบริษัทแรกๆ ที่ให้บริการให้คำปรึกษาด้านการจัดการและเทคโนโลยี ขณะที่กลุ่มอุตสาหกรรมที่ให้บริการหลักๆ มี 5 อุตสาหกรรม ได้แก่ โทรคมนาคม สื่อ และนวัตกรรมใหม่ การเงินการธนาคารและประกัน โรงพยาบาล และหน่วยงานภาครัฐ ค้าปลีก ท่องเที่ยว และการผลิตสินค้าอุปโภคบริโภค น้ำมัน สาธารณูปโภคและพลังงานต่างๆ ซึ่งทั้งหมดนี้แตกออกได้อีกเป็นมากกว่า 40 อุตสาหกรรมย่อย</p>\n<p>ส่วนบริการของเอคเซนเชอร์  ก็แบ่งเป็น 4 กลุ่มหลักๆ คือ Strategy and Consulting, Interactive, Technology และ Operations มีลูกค้าองค์กรมากกว่า 6,000 รายใน 120 กว่าประเทศทั่วโลก โดยลูกค้ากว่า 75% เป็นบริษัทที่อยู่ในกลุ่ม Fortune 500</p>\n<p>ในกลุ่มบริการด้านเทคโนโลยี เอคเซนเชอร์เป็นพาร์ทเนอร์กับบริษัทไอทีระดับโลกมากมาย อาทิ SAP, Oracle, Microsoft, Google, AWS, Salesforce, IBM และ Adobe เป็นต้น ดังนั้นในแง่การทำงาน นักพัฒนาจะได้โอกาสทำงานกับแพลตฟอร์มใหญ่ๆ ระดับโลกอย่างแน่นอน</p>\n<h3>ตัวอย่างผลงาน เอคเซนเชอร์</h3>\n<p>ตัวอย่างผลงานของเอคเซนเชอร์  ที่สำคัญๆ ได้แก่ <a href=\"https://newsroom.accenture.com/news/accenture-and-digital-ventures-co-develop-and-launch-first-of-its-kind-blockchain-solution-in-thailand.htm\">โครงการความร่วมมือกับ Digital Ventures</a> บริษัทลูกของธนาคารไทยพาณิชย์ (SCB) ในการออกแบบโซลูชันบล็อคเชนสำหรับกระบวนการจัดซื้อจัดจ้างในซัพพลายเชน (procure-to-pay) ให้รวดเร็วและถูกต้องมากขึ้น</p>\n<p>หรือการ<a href=\"https://newsroom.accenture.in/indian/news/accenture-interactive-to-drive-1s-customer-experience-journey-in-thailand.htm\">ออกแบบ Loyalty Program ให้กับ The 1</a> ทั้งในแง่การดีไซน์ การใช้ระบบวิเคราะห์ข้อมูล ไปจนถึงการนำเทคโนโลยีไปให้ The 1 ใช้งานภายในองค์กร เพื่อให้ประสบการณ์การใช้งาน Loyalty Program ของลูกค้า The 1 ออกมาดีที่สุด</p>\n<p>นอกจากนี้เอคเซนเชอร์  ยังมีโปรเจกต์ที่เป็นลักษณะการทำ Corporate Social Responsibility (CSR) เช่น People + Work Connect ที่ร่วมมือกับหอการค้าไทย สร้างแพลตฟอร์มกลางสำหรับผู้ประกอบการที่ได้รับผลกระทบจาก COVID และมีความจำเป็นจะต้องเลย์ออฟหรือพักงานพนักงาน ให้พนักงานที่ได้รับผลกระทบสามารถติดต่อพูดคุยกับบริษัทอื่นที่กำลังต้องการพนักงานได้ เพื่อลดผลกระทบกับตัวพนักงานเองอีกทอดหนึ่ง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e92a0bc58cc0301366643bc0e79d5a7a.jpg\" /></p>\n<p>หรือโปรเจกต์ CAPCOP (CAP Community Outreach Program) ที่นำเอาโปรแกรม Consulting Analyst Program ไปช่วยเหลือโครงการร้อยพลังการศึกษา (Thailand Collaboration of Education) ในการดีไซน์โซลูชันเพื่อจัดเก็บและวิเคราะห์ข้อมูล</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/0019b31aa1283e58ae305e3201afc597.png\" /></p>\n<h3>Life at Accenture ออกแบบ career path ได้ด้วยตัวเอง</h3>\n<p>หนึ่งในความโดดเด่นในการทำงานกับเอคเซนเชอร์  คือการที่พนักงานสามารถออกแบบ Career Path ตามที่ตัวเองต้องการได้เลย ซึ่งพนักงานจะสามารถพูดคุยปรึกษากับ People Lead ของตน ซึ่งทำหน้าที่เสมือน mentor  coach และ counselor ในด้าน Career ให้กับพนักงาน ซึ่ง People Lead จะให้คำปรึกษาในเรื่องการวางแผนการเติบโตทางสายงาน ช่วยดูว่าโปรเจกต์ไหนที่เหมาะสมกับสามารถ ความสนใจ รวมถึงเอื้อต่อการเติบโตและการเรียนรู้ของพนักงาน  นอกจาก People Lead ซึ่งเป็นเสมือนที่ปรึกษาด้านสายงานของพนักงานแล้ว พนักงานยังสามารถพูดคุยได้โดยตรงกับ Service Group Lead ซึ่งหลายๆ ท่านเป็นผู้บริหารระดับสูงใน เอคเซนเชอร์  เพื่อให้ผู้บริหารได้รับทราบถึงความสนใจของพนักงาน และเข้ามามีส่วนช่วยในการเสริมสร้างความสามารถและศักยภาพของพนักงาน</p>\n<p>เอคเซนเชอร์  ใช้ระบบ Performance Achievement โดยที่พนักงานแต่ละคนจะตั้ง priorities ของตนด้วยตนเอง เพื่อให้มั่นใจว่า goal นั้นได้ออกแบบมาสำหรับตนเอง (personalize) ซึ่งจะเหมาะสมกับสายงาน และบทบาทที่ตนได้ทำอยู่จริง ในส่วนของการประเมินผลงาน รวมถึงการ promote นั้น เอคเซนเชอร์จะอิงจากผลลัพธ์ของงาน (outputs) เป็นหลัก โดยไม่ได้คำนึงถึงความอาวุโส หรืออายุงาน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3c70aa5ed6b7f88f7d4c466180b80e57.png\" /></p>\n<p>ด้วยความที่เอคเซนเชอร์ เป็นบริษัทชั้นนำที่มีพนักงานหลายหมื่นคนทั่วโลก วัฒนธรรมองค์กรของเอคเซนเชอร์  จึงให้ความสำคัญกับ empowerment และ inclusiveness เพื่อให้พนักงานทุกคนเคารพความเป็นตัวตนของตัวเองและเพื่อนร่วมงานทุกคน นอกจากนั้น บริษัทฯ ยังให้ความสำคัญกับความคิด ความสามารถและทัศนคติของพนักงานทุกคน เพื่อให้ทุกคนสามารถทำงานร่วมกันกับพนักงานจากทุกประเทศได้ (One Accenture) ซึ่งการทำงานในรูปแบบ Project-based นั้น พนักงานจะได้สลับเปลี่ยนหมุนเวียนไปตามโปรเจกต์ต่างๆ ทำให้พนักงานหนึ่งคน มีโอกาสได้ทำงานและเจอเพื่อนร่วมงานที่หลากหลายแตกต่างกันออกไปและในบางช่วงก็อาจจะมีโอกาสได้เดินทางไปต่างประเทศเพื่อทำงานร่วมกับเพื่อนร่วมงานต่างชาติอีกด้วย</p>\n<p>นอกจากนี้เอคเซนเชอร์ยังให้ความสำคัญกับความหลากหลายและการมีส่วนร่วมของผู้หญิงและเพศทางเลือก อย่างเช่น การจัดกิจกรรม International Women’s Day &amp; Diversity Celebration ด้วย ซึ่งการให้ความสำคัญกับผู้หญิงนี้เองก็สะท้อนออกมาในโครงสร้างองค์กร โดยเอคเซนเชอร์  ประเทศไทย มีสัดส่วนพนักงานหญิงสูงถึง 49.4% ส่วนในระดับบริหารก็แทบไม่แตกต่างกันที่ 48.9%</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/bf00e78dafa3c7ed743013bab6246b7d.jpg\" /></p>\n<p>ในแง่สวัสดิการ เอคเซนเชอร์มีงบและแผนการฝึกอบรมที่ออกแบบให้ตามทักษะ สายงานที่กำลังเป็นที่ต้องการของตลาด รวมถึงมี flexible benefits ในแต่ละปี ซึ่งเป็นการให้เงินอุดหนุนกับพนักงานแต่ละคนเพื่อใช้จ่ายในสิ่งต่างๆ ที่ตอบโจทย์ความสนใจหรือความชอบส่วนตัว รวมถึงการเป็นเจ้าของเอคเซนเชอร์ร่วมกันโดยการให้โอกาสซื้อหุ้น เอคเซนเชอร์ในราคาลด 15% หรือก็คือได้กำไรตั้งแต่วันแรกที่ซื้อหุ้น</p>\n<p>นอกจากนั้น บริษัทฯ ยังมีประกันสุขภาพแบบกลุ่มที่ครอบคลุมทั้งการคุ้มครองชีวิตและสุขภาพของพนักงาน ที่สำคัญคือครอบคลุมคู่สมรสด้วย ไม่ว่าจะเป็นคู่สมรสจดทะเบียนหรือไม่จดทะเบียน ซึ่งรวมถึง life partner ที่เป็นเพศเดียวกัน และในขณะเดียวกัน บริษัทฯ ยังดูแลครอบคลุมทั้งสุขภาพกายและสุขภาพใจ ดังนั้น sick leave policy ของบริษัทได้มีการอนุญาตให้พนักงานสามารถใช้วันลาได้เนื่องการเจ็บป่วยทางกายรวมถึงความเครียดทางใจ นอกจากนั้นแล้ว บริษัทฯ ยังได้จัดให้มีผู้เชี่ยวชาญทางจิตเวช คอยให้คำปรึกษากับพนักงาน รวมถึงสมาชิกในครอบครัว ในกรณีที่เกิดความเครียดหรือมีปัญหาเกี่ยวกับสุขภาพจิตอีกด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a5b6b21805744078faa89743eb994fbc.png\" /></p>\n<h3>เสียงจากพนักงาน</h3>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/f79f4257cadb506dc267e49a84fc02a1.png\" /></p>\n<h4>คุณปิ่น นิธินันท์ สมบูรณ์วิทย์ Managing Director - Technology</h4>\n<p>คุณปิ่นเล่าว่าเข้ามาทำงานกับเอคเซนเชอร์  ตั้งแต่ปี 1999 จบสายบัญชี สถิติมา แต่ได้ทำงานเป็น Analyst ด้าน System Integration และมีการปรับบทบาทเปลี่ยนไปตามโปรเจกต์และเทคโนโลยีในแต่ละช่วง</p>\n<p>สิ่งที่คุณปิ่นประทับใจคือกิจกรรมของพนักงานที่บริษัทมีให้ในช่วง COVID อย่างเช่นกิจกรรม Accenture  Parlor ซึ่งเป็นเหมือนพื้นที่ให้พูดคุยแลกเปลี่ยนระหว่างพนักงาน ซึ่งบางครั้งอาจมีหัวข้อเฉพาะ เช่น การบริหารเวลา เป็นต้น</p>\n<h4>คุณอาร์ม ชวกร วิชชุลดา Full Stack Engineering Manager</h4>\n<p>คุณอาร์มจบด้านวิศวกรรมคอมพิวเตอร์เข้ามาทำงานครั้งแรกเป็น Analyst สาย Proof-of-Concept</p>\n<p>สิ่งที่ประทับใจคือการได้ทำงานกับหลายๆ ทีม แต่ทุกทีมทุกคนมีบุคลิกคล้ายๆ กันคือคอยช่วยเหลือ ให้คำแนะนำ แม้กระทั่งต่างทีมก็ยินดีจะช่วยเหลือหรือให้คำปรึกษาซึ่งกันและกัน</p>\n<p>อีกสิ่งที่ประทับใจคือการมีโอกาสได้อยู่เบื้องหลังนวัตกรรมหลายๆ อย่างในไทย รู้สึกมีส่วนร่วมและได้สร้างผลกระทบในวงกว้าง  เกิดการเปลี่ยนแปลงต่อการดำรงชีวิตของผู้ใช้งานที่เป็น end-user และสร้างผลกระทบเชิงบวกต่อสังคม</p>\n<h4>คุณม่านฟ้า ญาณิน ปาลศรี Business &amp; Integration Architecture Senior Analyst</h4>\n<p>คุณม่านฟ้าจบเศรษฐศาสตร์อินเตอร์มา แต่ได้เข้ามาทำงานที่เอคเซนเชอร์ ตั้งแต่เป็นเด็กฝึกงานเกี่ยวกับระบบ SAP เป็นคนกลางระหว่างลูกค้า ต้องไปเก็บ requirement และกลับมาคุยกับทีม พร้อมวิเคราะห์ว่าโซลูชันใหม่ จะมีการเปลี่ยนแปลงหรือผลกระทบกับระบบเก่าของลูกค้าอย่างไร</p>\n<p>สิ่งที่ประทับใจคือทุกคนในบริษัทพร้อมยินดีให้ความช่วยเหลือตลอด ที่สำคัญคือเพื่อนร่วมงานมีความเป็นมืออาชีพ และเปิดกว้าง ตอนนี้ก็กำลังทำโปรเจกต์ร่วมกับทีมที่ญี่ปุ่นและอินเดีย ซึ่งวันหยุดแต่ละประเทศไม่ตรงกัน ทุกคนในทีมก็พร้อมจะจัดสรรเวลา สลับวันหยุด เพื่อให้งานสามารถเดินต่อไปได้ ซึ่งตอนนี้คุณม่านฟ้าเองก็เรียนปริญญาโท ภาคค่ำ หัวหน้าและคนในทีมก็เข้าใจ ไม่นัดประชุมเกินเวลาส่วนตัว</p>\n<h3>คนที่สนใจสมัคร</h3>\n<p>สำหรับใครที่สนใจอยากร่วมงานกับเอคเซนเชอร์ สามารถเข้าไปดูตำแหน่งที่เปิดรับสมัครได้ที่ <a href=\"https://jobs.blognone.com/search?q=Accenture\">Blognone Jobs</a> หรือ <a href=\"https://www.accenture.com/th-en/careers\">accenture.com/th-en/careers</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/accenture\">Accenture</a></div><div><a href=\"/topics/blognone-workplace\">Blognone Workplace</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"8efe62b0d99541965e61d0918fb917a92e97811b28867a254cab1762a431685e","category":"Thai"}