{"title":"35 Louisiana cattle pregnancy determination clinic aims to improve reproductive efficiency","link":"https://academic.oup.com/jas/article/102/Supplement_1/6/7617937?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>The Cattle Pregnancy Determination Clinic is a 1-d program aimed at teaching multiple methods of pregnancy determination to assist producers in effectively making keep/cull decisions and improving reproductive efficiency of their herd. This program began in 2019 after repeated requests for the inclusion of pregnancy determination techniques as a component of an annual Artificial Insemination School. Development of this program held one significant regulatory challenge. According to the Louisiana Veterinary Practice Act [La. R.S. 37:1511-1558], the use of any manual or mechanical procedure for pregnancy determination is considered to be a medical diagnosis. While producers do not have the right to diagnose the pregnancy status of other producers’ cattle, they can do so on their own cattle. To enforce these regulations, two essential components were integrated into the program: two local large animal veterinarians served as primary instructors, and each participant signs an acknowledgement form stating they understand the regulations within the Louisiana Veterinary Practice Act. Management practices are taught by blending classroom learning and hands-on practice. The classroom portion of the syllabus includes an introduction to female anatomy, explanations of how to determine pregnancy through rectal palpation and blood testing, and a brief overview of herd health and nutritional management. The outdoor portion affords participants the opportunity to rectally palpate open cows and cattle in all stages of pregnancy, collect blood via coccygeal venipuncture, and view ultrasound demonstrations. Ten clinics, two annually, have resulted in 123 participants completing the Cattle Pregnancy Determination Clinic. Space limitations restrict enrollment to 15 participants. At the conclusion of the program, participants were asked to complete an evaluation reviewing their experience, and an average completion rate of 94.25% was seen over the 5-yr period. When asked to rate overall impression of the clinic on a scale of 1 to 10 (1 = poor and 10 = great), 77.6% responded “10,” 21% responded “9,” 1% responded \"8,” and less than 1% responded \"7.” When asked to rate their likelihood of implementing pregnancy determination in their herd (1 = not likely and 10 = very likely), 83% responded “10,” 3.5% responded “9,” 5.5% responded \"8,” and 8% responded \"7.” When asked which portion of the program was most beneficial, a majority of responses were reflective of this selected comment, “The hands-on part only because it tied into the classroom part and made a better understanding.” The only responses on topics of no benefit included one regarding the nutrition portion, and one saying blood collection because they already had that knowledge. Inclusion of a chute-side pregnancy test demonstration and more information on herd health have been requested for future clinics. Participant feedback and continued requests for enrollment illustrate a demand for the continuation of this program.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8f04dec634b7e6368ffd01a57a11742d6102bf6bbbd7b7c6a6b46d82efdd134d","category":"Environment"}