{"title":"A guide to living at a black hole","link":"https://arstechnica.com/?p=1773621","date":1623843033000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/LIGOTOP-800x530-1-800x530.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/LIGOTOP-800x530-1.jpg\">Enlarge</a> <span>/</span> Even with today's real estate boom, a supermassive black hole in the neighborhood has to drive the asking price down a bit, right? (credit: <a href=\"https://arstechnica.com/science/2020/06/astronomers-may-have-spotted-first-light-ever-detected-from-black-hole-merger/\">Caltech/R. Hurt (IPAC) / Redfin / Nathan Mattise</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Black holes flood the Universe. The nearest one is a mere 1,500 lightyears away. A giant one, Sagittarius A*, sits in the center of the Milky Way about 25,000 lightyears away. While your typical space traveler might look for a home around a calm G-type star, some celestial citizens are brave enough to take up refuge around one of these monsters. It’s not an easy life, that’s for sure, but being neighbors with a black hole does mean you’ll almost certainly learn more about the fundamental nature of reality than anybody else.</p>\n<p>Interested? What follows is a guide of what to expect should you make your home around a black hole. <em>Good luck.</em></p>\n<h2>Black hole basics</h2>\n<p>Upon first arriving at a black hole, you will most likely be struck by how utterly, completely…boring it is. The black hole itself is simply a fathomless black orb hanging out somewhere in the distance. Black holes don’t really do anything except sit there and gravitate. In fact, they’re famously easy to miss: Unless they’re actively feeding on material or coincidentally bending/blocking the view to a star in the background, you simply can’t see them. Once you know one is there, though, you can start to have some fun.</p></div><p><a href=\"https://arstechnica.com/?p=1773621#p3\">Read 37 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1773621&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8f15f15604f8c6301fcf74f822425a75fd2f2bbbcab0b7f994bdabee1faceee7","category":"Tech"}