{"title":"Understanding the impact of selective fishery and bycatch on stock dynamics","link":"https://onlinelibrary.wiley.com/doi/10.1111/nrm.12403?af=R","date":1718102815000,"content":"<h2>Abstract</h2>\n<p>Age/size selective fishery, which targets large individuals and retains immature individuals, is practiced worldwide. Yet, selective fishing can result in bycatch of undersized target species, posing a serious problem in stock management. In addition, there is a growing concern that intensive selective removal alters the composition of a population. Therefore, a comprehensive understanding of the effects of selective fishery on stock dynamics is essential for sustainable fishery management. In this study, an age-structured model based on the Schaefer model assumptions was used to investigate the effects of selective fisheries and their bycatch on stock dynamics. Local stability analyses suggest that selective fishery can cause undesirable oscillatory stock dynamics in fishery management. Numerical simulations revealed that maximum sustainable yield-based management with a large age at maturity is more likely to lead to stock oscillations. Notably, bycatch, which is detrimental to the sustainability of the fishery, was found to reduce the oscillatory dynamics. Overall, selective fisheries tend to cause oscillatory stock dynamics in various situations. Selective fishing also tends to reduce the critical fishing effort that causes stock extinction; therefore, a precautionary approach is necessary to mitigate such issues.</p>\n<p><b>Recommendations for Resource Managers</b>\n</p><p>Age/size selective fishing that retains immature individuals is practiced worldwide and often cause unwanted bycatch, thus requiring a solid understanding for successful management.</p>\n<p>Selective fishing can cause fluctuations in stock dynamics that are undesirable for sustainable fisheries. This situation may be more likely to occur when the minimum age for fishing is large. It may also occur in fisheries based on maximum sustainable yield.</p>\n<p>Precautionary management, such as the establishment of marine protected areas, is therefore required.</p><p></p>","author":"Nao Takashina","siteTitle":"Wiley: Natural Resource Modeling: Table of Contents","siteHash":"3719477483f67b16afdbb60e07461dbbb5827188dd5d72806069fb36caa95c59","entryHash":"8f177070595cf3c97ff1ee610b32996b5dc14b99f1ee178b0988625d1d86a019","category":"Environment"}