{"title":"Data Is Power: Addressing the Power Imbalance Around Community Data with the Open-Access Data4HumanRights Curriculum","link":"https://www.preprints.org/manuscript/202404.0526/v1","date":1712562964000,"content":"Data4HumanRights training materials have been developed as open-source and tailored to limited resource settings where community data collectors often live and work. An overview of how the training material was developed together with community data collectors in Nigeria and Kenya is provided. The paper gives insights into the fundamental principles (i.e., inclusiveness, adaptive, limited resources, gender- and incentive-sensitive) and the structure of the open-access training materials. This resulted in 28 modules designed to be delivered in a face-to-face format in less than one day by a local trainer. To maximize adaptivity, the training modules can be mixed and matched (e.g., as individual modules or a learning path of several modules around a specific training need). The individual modules cover a range of methods and tools that are useful to human rights work, for example, documenting evictions, performing rapid needs assessments after acute crises, community profiling, and monitoring community development indicators. The training materials contain instructions for the facilitator(s) of the training and all necessary training materials to conduct the training. To maximize inclusivity, the training covers basic to advanced topics. Most training modules address basic training topics that can be optimally followed with a mobile phone (to avoid using a computer and printing handouts). The training was developed and implemented with local community groups in Nigeria and Kenya. The material is free to use, adapt, and translate into different contexts and languages.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8f1d14443288c4fffd24abc1a0a478502d37cb40a3c369b2b58c39f6706a0b6c","category":"Interdisciplinary"}