{"title":"Integrating vision‐based AI and large language models for real‐time water pollution surveillance","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11092?af=R","date":1723442067000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3d9d7a63-75e1-493f-b0cb-b6c112ebd620/wer11092-toc-0001-m.png\" alt=\"Integrating vision-based AI and large language models for real-time water pollution surveillance\" />\n<p>This study demonstrates the successful integration of cameras, AI, and Raspberry Pi for real-time water pollution monitoring, effectively detecting pollutants and providing detailed contextual information.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Water pollution has become a major concern in recent years, affecting over 2 billion people worldwide, according to UNESCO. This pollution can occur by either naturally, such as algal blooms, or man-made when toxic substances are released into water bodies like lakes, rivers, springs, and oceans. To address this issue and monitor surface-level water pollution in local water bodies, an informative real-time vision-based surveillance system has been developed in conjunction with large language models (LLMs). This system has an integrated camera connected to a Raspberry Pi for processing input frames and is further linked to LLMs for generating contextual information regarding the type, causes, and impact of pollutants on both human health and the environment. This multi-model setup enables local authorities to monitor water pollution and take necessary steps to mitigate it. To train the vision model, seven major types of pollutants found in water bodies like algal bloom, synthetic foams, dead fishes, oil spills, wooden logs, industrial waste run-offs, and trashes were used for achieving accurate detection. ChatGPT API has been integrated with the model to generate contextual information about pollution detected. Thus, the multi-model system can conduct surveillance over water bodies and autonomously alert local authorities to take immediate action, eliminating the need for human intervention.</p>\n<h2>Practitioner Points</h2>\n<p>\nCombines cameras and LLMs with Raspberry Pi for processing and generating pollutant information.\nUses YOLOv5 to detect algal blooms, synthetic foams, dead fish, oil spills, and industrial waste.\nSupports various modules and environments, including drones and mobile apps for broad monitoring.\nEducates on environmental healthand alerts authorities about water pollution.\n</p>","author":"Dinesh Jackson Samuel, \nYusuf Sermet, \nDavid Cwiertny, \nIbrahim Demir","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"8f212c00b8581e8dd8edd0779adb69711229a57d054060588785e2893d2edbe5","category":"Environment"}