{"title":"Wahoo Adds Track Running Mode to RIVAL GPS Watch: Hands-on Test","link":"https://www.dcrainmaker.com/2021/04/wahoo-adds-track-running-mode-to-rival-gps-watch-hands-on-test.html","date":1619038860000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0930.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0930_thumb.jpg\" /></a></p>\n<p>It’s been 5 months since <a href=\"https://www.dcrainmaker.com/2020/11/wahoo-rival-multisport-gps-watch-review.html\">Wahoo released their RIVAL GPS watch</a>, aimed primarily at the triathlete crowd. The watch has seen a few firmware updates along the way, mostly minor tweaks though. Albeit, one of the bigger updates was adding broadcasting of running pace for treadmills, to use with apps like Zwift. Today follows another running focused update – the <a href=\"https://support.wahoofitness.com/hc/en-us/articles/360017569220-ELEMNT-RIVAL-Firmware-Updates\">addition of track mode</a>.</p>\n<p>The feature is relatively similar to what <a href=\"https://www.dcrainmaker.com/2020/09/garmin-forerunner-745-depth-review.html#track-mode\">Garmin</a> and <a href=\"https://www.dcrainmaker.com/2019/11/coros-releases-new-running-track-mode-on-watches-adds-running-power-efficiency-pod.html\">COROS</a> have done with their running track modes, which essentially snap your GPS track to the running track so it looks pretty. From a data standpoint though, it also snaps your distance to the track too. So instead of getting wierd and incorrect track distances for your laps, it’ll snap them to the 100’s. For example, pressing the button at/near the same line on the track each loop will *ALWAYS* get you 400m laps, versus on a non-track mode watch/mode, you might get 394m or 406m or some other random number depending on lots of factors.</p>\n<p>I’ve got a few track workouts under my belt now with the new update, so I figured I’d dive into the basics of how it works (it’s silly easy), and then talk about how it differs from what Garmin and COROS have done. Each company has done things slightly differently, with differing levels of features.</p>\n<h3><span>How it works:</span></h3>\n<p>The first thing you need to do is get your RIVAL updated to the latest firmware version. Make sure your phone is connected to the RIVAL, and a few minutes later you’ll have a firmware version transferred to the RIVAL behind the scenes via Bluetooth and ready to update.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1102.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1102_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1104.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1104_thumb.png\" /></a></p>\n<p>Once that’s done you’ll find yourself a new sport profile: Track Running</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0965.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0965_thumb.jpg\" /></a></p>\n<p>This also means that if you have running data fields that you’ve customized, you’ll want to re-do those customizations in the track running mode too. For example, I use most of the defaults there, but I did go ahead and add in the Stryd power meter to the Wahoo Track Running profile. No biggie, just a reminder to do so (just as you would on Garmin/COROS). And just to be super clear here, Wahoo doesn’t track running power without another unit sending power data to it. Meaning, it’s not like COROS or Polar that has wrist-based power. But rather, more like Suunto or Garmin that can leverage external sensors for it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0966.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0966_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0967.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0967_thumb.jpg\" /></a></p>\n<p>At this juncture you’ve got two options:</p>\n<p>A) Start your run from home/office/ice cream shop, and run to the track in track running mode<br />\nB) Start your run at the track</p>\n<p>Like with Garmin, it doesn’t matter matter which one you do. In both companies cases, it’ll more quickly determine the track is a track if you start on the track. But if you’re doing a full workout it frankly won’t matter past the first few laps on the track.</p>\n<p>At a high level, the way all three companies work (Garmin/COROS/Wahoo) is that they wait for you to complete a loop, and then start looking at the properties of the loop. For example, does it have at least two straight parallels sides? What do the curves look like? And so on. Each time you do a loop of the track, it refines the specifics of the track. All three companies recommend roughly 2 loops as a starting point before things sort themselves out. And most are nice and crispy by about 4 loops in. However, there’s some interesting nuanced differences to how Wahoo &amp; Garmin do the recognition that are worth chatting about later in this post (with pros and cons to each approach).</p>\n<p>So, once on the track, go ahead and pick a corner to hit the lap button. In my case, I tend to start all my workouts in the same corner, because it’s where I hang a small bag on a fence post. As you run, the RIVAL will show you the exact distance on the track (lap or total distance), such as 168m. There’s no ‘smoothed’ distances for the current distance, which makes sense – you want to know exactly how far you’ve gone in that lap (and thus, your paces are also exact).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0916.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0916_thumb.jpg\" /></a></p>\n<p>However, because you hit the lap button at one of the corners, then it’ll ‘snap’ each manual lap to the nearest 100m. Meaning, if you press the lap button exactly one lap later, it’ll show 400m every time. Do it two laps later, and it’ll show 800m – even if it thought you were closer to 792m or 814 meters. Track mode assumes you weren’t doing some new-age workout that does 790’s instead of 800’s, and thus, snaps to 800m. As long as you’re within 25 meters, it’ll snap to that 100m ‘chunk’, else, it’ll show the exact distance.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0922.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0922_thumb.jpg\" /></a></p>\n<p>This is the same as COROS, but not actually the same as Garmin. Garmin will snap to the 10’s (e.g. 790/800/810), but not always 800. I prefer the COROS/Wahoo method here, but the flip-side of the Garmin method is that the <em>pacing is more true</em> if you actually just legitimately forgot to hit lap 10 meters later.</p>\n<p>Meaning, if I ran *PAST* the line and then hit lap, my lap time remains the same. Yet, Wahoo will pull my distance from 810 to 800m, and thus, my pace will be impacted slightly. There’s no exact right answer here of course. I personally prefer the Wahoo/COROS variant because I’m usually +/- 1 second on the lap button, so I know I do want that it reflect 800m, no matter what the watch thinks it is.</p>\n<p>As you run each successive loop, the algorithm improves, and its accuracy will increase. Keep in mind though that at this point, this isn’t even yet about the pretty GPS map, but rather, about the distance. It’s virtually locking your distance/position to the track, and thus, even if you have to go around runners or swing to the outside lane or whatever, it’ll still maintain the track distance (akin to in an actual track – nobody cares if you ran a poor line, you only get graded for running the set distance of the race).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-4.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-4.jpg\" /></a></p>\n<p>Wahoo does though have the ability to depart the track (for example, to go to the bathroom), and it’ll correctly disengage from track mode and then come back in again. In fact, one of the days I was out at the track, one of Wahoo’s engineers were actually running arguably the most drunk track workout ever (Wahoo’s algorithm/data science people are based here in the Netherlands, and often use the same track as I do). Literally swerving his way out and back across the lanes, and then running off to the woods and coming back, doing a loop, then stopping off to the side of the track for a minute, then running again, then running out away and down the street out of sight and coming back again. I can’t even begin to imagine what the others at the track were thinking of him. Notably, he was also the <a href=\"https://www.dcrainmaker.com/2020/11/5-random-things-i-did-this-weekend-109.html#1-back-in-the-cold-water-testing\">same engineer that suckered me into doing openwater swims back in November</a>.</p>\n<p>The point of all that though is to have the algorithm correctly handle it. For example, does it disengage when you go far away, but not when you just step off the side of the track for a sip from your water bottle?</p>\n<p>In any case, in all my sets, Wahoo nailed every single set precisely to the correct distance. You can see some of these in the lap summary screen (one of my favorite screens on a watch):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0919.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0919_thumb.jpg\" /></a></p>\n<p>I did point out that wouldn’t it be cool if this lap summary screen was smart enough to figure out my workout was 800’s, and simply tell me how many 800’s I’d done thus far? If I’m doing 12×800, I sure as hell forget after #7 whether I’m on 7 or 8 or whatever. And trying to do mental math on my warm-up bits makes it tough. Note – my suggestion is open to any company that wants to implement it. Also, it’d be ideal if it was smart enough to not have a big UI mess trying to also count my recovery 200’s, since ideally it’d be smart enough to notice those at a reduced pace and reduced HR.</p>\n<p>Now, Wahoo doesn’t have a map page on their watch, so you won’t see the pretty perfectly conformed map until afterwards on your phone. And in fact, there’s some nuance behind the scenes here that I alluded to earlier. Let’s pretend you go to a track the first time. The RIVAL starts off the first two laps learning the track. It’ll look roughly like this (this is actually my first two laps):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_0969.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_0969_thumb.png\" /></a></p>\n<p>Now in this case, I purposefully saved this workout off to show you this – but the reason is important: If I didn’t save these first two laps, you’d never see this imperfection. That’s because Wahoo retroactively updates the finished GPS track as each successive lap happens – perfecting the shape of the track not just for the next loop in that and every future workout, but also all previous loops in that workout. Here’s what it looks like after a normal workout:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1109.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1109_thumb.png\" /></a></p>\n<p>At first glance you might assume COROS &amp; Garmin do the same thing, but it’s slightly different. Because both of those companies show you the map on the watch in real-time, you can clearly see on those first few loops that it’s imperfect. Which means neither company is retroactively fixing it. They are both continually updating the algorithm after each loop – but not going back and updating previous loops.</p>\n<p>That’s why on a Garmin or COROS watch, I’d recommend doing two or so loops, *SAVING* the workout, and then starting you real workout the first time you go to a new track. The saving part is important, because in the case of Garmin, it won’t save that track to the watch until you hit save. After that point, it’ll actually create a file on the watch with the track properties. Each new track you go to gets you new files. Go back to the same track and it uses that same known track.</p>\n<p>And Wahoo works the same way except that you’ll never see those learning laps, because it’ll correct them on the app before you see it.</p>\n<p>In an case, here’s what my 3rd completed track workout looked like on the RIVAL in track running mode, compared to a FR745 in track running mode (which is probably my 10-15th run with it at this track), compared to a non-track-mode reference GPS. In this case, I started about 1.5mi/2.4km away from the track, and then ran to it. I purposefully stayed on the running/bike path until I got to the ‘proper’ entrance to the track and then hung a left. As a result, you can see both the Garmin FR745 &amp; Wahoo RIVAL did briefly try and snap to the track as I ran past it, but then the Wahoo realized the error of its ways and released the snap briefly before re-acquiring it. The Garmin didn’t release once snapped. A minor issue though when starting off-track.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1412.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1412_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1410.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1410_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/IMG_1411.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/IMG_1411_thumb.png\" /></a></p>\n<p><em>(Left to right: Non-track-mode GPS showing, Wahoo RIVAL Track Mode, Garmin FR745 Track Mode)</em></p>\n<p>As you can see, minus the entry/exit quirk, it’s virtually identical – both to each other, and to the track itself. All in, quite good once on the track.</p>\n<h3><span>How it compares:</span></h3>\n<p>Not all track modes are created equally, and there’s no better way to show this than creating myself an Excel table. The big ticket takeaway though here from a Wahoo perspective is that it doesn’t have lane assignment. Meaning, if you don’t run in Lane #1, it’ll assume you’ve run in Lane #1. Thus, if you’re in Lane 6 or 7, you’ll have run significantly more distance than the RIVAL will tell you you’ve run. Both Garmin and COROS have lane assignments, so it automatically knows to add distance. Wahoo says that’s coming in a future firmware update.</p>\n<p>Additionally, Wahoo only supports 400m tracks. Whereas COROS &amp; Garmin support basically anything that’s a loop with two parallels sides. Practically speaking that’s probably not a big deal for most people, but it’s something to be aware of. And of course – for all these, this is GPS tracks only, not indoor tracks without GPS.</p>\n<p>In any case, here’s your chart:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-26.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-25.png\" /></a></p>\n<p>Obviously, there are more lines to this chart if comparing the watches beyond track mode. Or even, the accuracy within track mode.</p>\n<p>Take below for example. For this I overlaid a COROS Pace 2 track workout along with a Wahoo RIVAL &amp; Garmin FR745 workout, all from the same track. At first glance, things look very close – and let’s be clear, they are. But…if we wanted to get super nit-picky…</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-27.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-26.png\" /></a></p>\n<p><em>(Purple is Wahoo, Red is Garmin, Blue is COROS)</em></p>\n<p>I find that Garmin and Wahoo do a notably better job on my specific track than COROS does, in terms of nailing the exact lane/layout. And then when I get crazy detailed on the plot, it’s a bit of a toss-up between Wahoo and Garmin. Garmin goes inbound slightly more than Wahoo does on one end, but Wahoo cuts inside the edge of the track on one of the straightaways (above, lower side of the track). You wouldn’t notice these unless you zoomed way the eff in:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-28.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-27.png\" /></a></p>\n<p>Got all that? Good.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p> </p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017-1.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017_thumb-1.jpg\" /></a></p>\n<p>Ok, at this point I’ve covered this in way more detail than you wanted. Either way, it’s cool stuff. And it’s been cool to see Wahoo iterate on this over the last while in beta, making tiny algorithm tweaks to improve each successive go at the track, from an algorithm standpoint.</p>\n<p>The company says that the “next firmware update is planned for May and will add several new smart features.” What those smart features are, remain to be seen, but I suspect it’s filling in more of the gaps around the 24×7 type tracking, which up till now has been pretty…well…rudimentary (and that’s being kind).</p>\n<p>Obviously, as I said at launch of the Wahoo RIVAL, Wahoo sees this as a long game. They aren’t overnight going to unseat anyone, and they understand that. But they have to start somewhere, and it’s good to see them adding in track mode – something that a lot of people have found super useful on Garmin and COROS watches since their launches. Atop that, it stays true to Wahoo’s mantra for Rival V1 that it’s focused on the triathlete specifically, rather than a mass market audience.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"8f2dbcafafab9440576101db5d8fe48062b3a076ec72b3469f9e4f3a8eb4e1fc","category":"Cycling"}