{"title":"7-Eleven starts its own EV charging network, 7Charge","link":"https://arstechnica.com/?p=1925186","date":1679321479000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/7Charge_1421875517_5721.png-800x420.jpeg\" alt=\"a 7-Eleven DC fast charger\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/7Charge_1421875517_5721.png.jpeg\">Enlarge</a> <span>/</span> 7Charge is the nation's newest EV charging network, courtesy of 7-Eleven. (credit: 7-Eleven)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>7-Eleven is starting its own charging network. The chain of convenience stores has launched 7Charge, which it says \"delivers a convenient and reliable fast-charging experience at select 7-Eleven stores in the US, and is coming soon to Canada.\" There's already a smartphone app in Apple's and Google's stores, but we don't know how many chargers 7-Eleven plans to deploy or a timeline for when that might happen.</p>\n<p>\"For over 95 years, 7‑Eleven has innovated to meet our customers' needs—delivering convenience where, when and how they want it,\" said Joe DePinto, president and CEO of 7‑Eleven. \"Now, we are innovating once again to meet our customers where they are by expanding our business to provide EV drivers convenience of the future... today.\"</p>\n<p>7-Eleven says its proprietary network will \"offer new levels of convenience and coordination to customers looking for a seamless charging and payment experience.\" That may mean it will include \"plug and charge,\" the ISO 15118 protocol that handles billing after the car handshakes with the charger, but plug and charge is far from universally implemented in new EVs. After playing with the app for a few minutes, it appears you can also pay by scanning a QR code on the charger.</p></div><p><a href=\"https://arstechnica.com/?p=1925186#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1925186&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8f3dc90f0bd8d04c55988d8d82a4864ac0c511604a259579db89a72b7249dbf0","category":"Tech"}