{"title":"tRNA-Derived Fragments as Biomarkers in Bladder Cancer","link":"https://www.preprints.org/manuscript/202404.0041/v1","date":1711962749000,"content":"Bladder cancer (BC) diagnosis is reliant on cystoscopy, an invasive procedure associated with urinary tract infections. This has sparked interest in identifying non-invasive biomarkers in body fluids such as blood and urine. A source of biomarkers in these biofluids are extracellular vesicles (EVs), nanosized vesicles that contain a wide array of molecular cargo, including small non-coding RNA such as microRNA and transfer RNA-derived fragments (tRF). Here we performed small-RNA next-generation sequencing for urine EVs, serum EVs and serum supernatant from 41 patients with non-muscle invasive BC (27 stage Ta, 14 stage T1) and 15 non-cancer patients (NCP) with benign cystoscopy findings. Serum and urine samples were collected before transurethral resection of bladder tumors (TUR-b) and at routine postsurgery check-ups. Expression levels of tRFs in presurgery samples were compared to those at postsurgery check-ups and to NCPs. To strengthen the reliability of our results, samples from 10 patients with stage T1 disease were resequenced. When comparing tRF expression in urine EVs between BC patients with stage T1 disease and NCPs, 14 differentially expressed tRFs (DEtRFs) were identified. In serum supernatant, six DEtRFs were identified among stage T1 patients when comparing presurgery to postsurgery samples, and four DEtRFs were found when comparing presurgery samples to NCPs. By performing a blast search, we found that sequences of DEtRFs aligned with genomic sequences pertaining to processes relevant to cancer development, such as enhancers, regulatory elements and CpG islands. Our findings display a number of tRFs that may hold potential as biomarkers for the diagnosis and recurrence-free survival of BC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8f40b295dd17e372d7f39d4b41c8642c17f143186c8ec1032859460d6bc561fd","category":"Interdisciplinary"}