{"title":"Spectrum of COVID-19 cases in Arkhangelsk, Northwest Russia: Findings from a population-based study linking serosurvey, registry data, and self-reports of symptoms","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311287","date":1728655200000,"content":"<p>by Ekaterina Krieger, Alexander V. Kudryavtsev, Ekaterina Sharashova, Olga Samodova, Anna Kontsevaya, Vitaly A. Postoev</p>\r\nIntroduction <p>The spectrum of COVID-19 manifestations makes it challenging to estimate the exact proportion of people who had the infection in a population, with the proportion of asymptomatic cases likely being underestimated. We aimed to assess and describe the spectrum of COVID-19 cases in a sample of adult population aged 40–74 years in Arkhangelsk, Northwest Russia, a year after the start of the pandemic.</p> Materials and methods <p>A population-based survey conducted between February 24, 2021 and June 30, 2021 with an unvaccinated sample aged 40–74 years (N = 1089) combined a serological survey data, national COVID-19 case registry, and self-reported data on COVID-19 experience and symptoms. Based on the agreement between these sources, we classified the study participants as non-infected and previously infected (asymptomatic, non-hospitalized and hospitalized symptomatic) cases, and compared these groups regarding demographics, lifestyle and health characteristics.</p> Results <p>After a year of the pandemic in Arkhangelsk, 59.7% 95% confidence intervals (CI) (56.7; 62.6) of the surveyed population had had COVID-19. Among those who had been infected, symptomatic cases comprised 47.1% 95% CI (43.2; 51.0), with 8.6% 95% CI (6.6; 11.1) of them having been hospitalized. Of the asymptomatic cases, 96.2% were not captured by the healthcare system. Older age was positively associated, while smoking showed a negative association with symptomatic COVID-19. Individuals older than 65 years, and those with poor self-rated health were more likely to be hospitalized.</p> Conclusion <p>More than half of the infected individuals were not captured by the healthcare-based registry, mainly those with asymptomatic infections. COVID-19 severity was positively associated with older age and poor self-rated health, and inversely associated with smoking. Combining different sources of surveillance data could reduce the number of unidentified asymptomatic cases and enhance surveillance for emerging infections.</p>","author":"Ekaterina Krieger","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8f4674a75d5ea8978e0625a516c9c4e9a6a20d3a1af308475830d6cc78bea6e6","category":"Interdisciplinary"}