{"title":"Wear OS’s most consistant OEM quits: Fossil stops making smartwatches","link":"https://arstechnica.com/?p=1999628","date":1706551930000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/1-2-800x600.jpg\" alt=\"The Fossil Gen 6 smartwatch. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/1-2.jpg\">Enlarge</a> <span>/</span> The Fossil Gen 6 smartwatch.  (credit: Fossil)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Fossil was the only brand keeping Google's Wear OS alive for years, but now the fashion brand is quitting the smartwatch market. Just before the weekend, the company confirmed to <a href=\"https://www.theverge.com/2024/1/26/24052275/fossil-quitting-smartwatches-android-wear-os\">The Verge</a>: \"We have made the strategic decision to exit the smartwatch business.\" The company says existing smartwatches will continue to get software updates \"for the next few years\" while it refocuses on traditional watches and jewelry.</p>\n<p>Wear OS is out of the dark ages now, but for years Fossil was the OS's only lifeline. Back in the days when Qualcomm was strangling the OS with lackluster SoC updates, Fossil was the only company that kept the dream alive. Fossil jumped into the Android Wear/Wear OS market <a href=\"https://www.gsmarena.com/fossil_q_founder_is_an_android_wear_watch_with_classic_looks-blog-15199.php\">in 2015</a> and has been <em>the only</em> steady source of Android smartwatch hardware since then. All the big companies, like Samsung, LG, Sony, Huawei, Motorola, and Asus, made watches for only a year or two and quit.</p>\n<p>In 2021, despite years of loyalty, Google dropped Fossil like <em>a rock</em> when Samsung offered to come back to the Wear OS ecosystem. Google lured Samsung away from its in-house Tizen OS with preferential treatment, including exclusive rights to the new \"Wear OS 3\" release and exclusive apps. That year, 2021, featured head-to-head August Wear OS releases of Samsung's Galaxy Watch 4 and Fossil's Gen 6 smartwatch. Samsung's watch had a faster, Samsung-made SoC, ran Wear OS 3, and cost $250, while <a href=\"https://arstechnica.com/gadgets/2021/08/new-fossil-smartwatches-are-still-stuck-in-the-bad-old-days-of-wear-os/\">Fossil was stuck</a> with Wear OS 2, a slower Qualcomm chip, and a $300 price tag. Fossil would barely be able to compete with Samsung if the playing field were level; but add to that Samsung's exclusive chips and Google's preferential treatment, and Fossil's watches never stood a chance. The Gen 6 will be the company's last smartwatch release.</p></div><p><a href=\"https://arstechnica.com/?p=1999628#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1999628&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8f4706a32dbb6a2d1faaf12f334113ebb33449dd291b427c51952192bf3271de","category":"Tech"}