{"title":"Evolution of volatile compounds of baked dried tofu during catalytic infrared baking process and their correlation with relevant physicochemical properties","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13469?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Energy-saving and low-carbon baking processes, as well as the need to determine the flavor-forming mechanisms of baked dried tofu, are becoming increasingly necessary. The application of emerging catalytic infrared radiation (CIR) technology in baking of dried tofu is considered of high interest due to the low energy consumption and high baking efficiency compared to traditional baking methods. Hence, this study aimed to investigate the evolution of aroma compounds in baked dried tofu during the CIR baking process and reveal relevant relationships between physical qualities, potential flavor precursors and key volatile compounds.</p>\n<h2>RESULTS</h2>\n<p>The results showed that the surface color of dried tofu gradually turned an appetizing golden yellow color during the rapid heating process, caused by the uniform infrared radiation from the radiant emitters. Meanwhile, the moisture of dried tofu experienced minimal reduction and the hardness of dried tofu gradually increased with the formation of crust on the surface. In addition, 49 volatile compounds were identified by headspace solid-phase microextraction–gas chromatography–mass spectrometry and 13 substances – 1-hexanol, 1-octen-3-ol, 1-pentanol, heptanal, nonanal, hexanal, (<i>E</i>,<i>E</i>)-2,4-decadienal, (<i>E</i>,<i>Z</i>)-2,4-decadienal, octanal, (<i>E</i>)-2-octenal, (<i>E</i>)-2-nonenal, 2-heptanone and 2-pentylfuran – were confirmed as key aroma compounds. Moreover, the amino acids aspartic acid, glutamic acid, isoleucine, lysine and arginine, and the fatty acids butyric, caprylic, capric, tridecanoic, stearic, oleic and linolenic were responsible for the unique flavor of CIR-baked dried tofu.</p>\n<h2>CONCLUSION</h2>\n<p>Consequently, the findings can provide a scientific basis for manufacturers to achieve precise quality control and large-scale production of CIR-baked dried tofu products. © 2024 Society of Chemical Industry.</p>","author":"Wenqing Chen, \nHaile Ma, \nQunhui Jiang, \nChen Shen","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8f51a00238d4b875e8ed34bce1e1180eb1ee2c26c4105394aa20c30bf2354814","category":"Environment"}