{"title":"Judge Lets Apple Further Delay Implementing App Store Rule Changes From Ongoing Epic Dispute","link":"https://www.macrumors.com/2023/07/17/app-store-rule-change-epic-games-delayed/","date":1689628147000,"content":"Apple does not yet have to implement changes to its \"anti-steering\" <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> rules that would allow developers to direct customers to purchase options outside the ‌App Store‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/iOS-App-Store-General-Feature-JoeBlue.jpg\" alt width=\"2250\" height=\"1266\" />\r<br />\nAs noted by <em><a href=\"https://www.theverge.com/2023/7/17/23798090/apple-epic-supreme-court-app-store-appeal\">The Verge</a></em>, Apple was today granted a motion that prevents it from having to make ‌App Store‌ changes for 90 days, giving the company time to ask the Supreme Court to hear the case.\r<br />\n\r<br />\nApple and <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a> have been battling in court over Apple's ‌App Store‌ rules <a href=\"https://www.macrumors.com/2020/08/13/apple-removes-fortnite-from-app-store/\">since 2020</a>, and in 2021, the judge overseeing the case largely sided with Apple. She decided that Apple was not violating antitrust law with its ‌App Store‌ rules requiring developers to use the in-app purchase system, but part of the ruling did require Apple to update its \"anti-steering\" rules.\r<br />\n\r<br />\nApple has been ordered to implement ‌App Store‌ changes that will allow developers to use metadata, buttons, links, and other calls to action to direct customers to purchasing mechanisms outside of the ‌App Store‌, paving the way for developers to implement alternate payment methods.\r<br />\n\r<br />\nWhile an appeal was ongoing, Apple did not have to implement those changes, but <a href=\"https://www.macrumors.com/2023/04/24/epic-games-loses-appeal-app-store-battle/\">the appeal took place</a> in April 2023. The Ninth Circuit Court of Appeals upheld the original ruling and again sided with Apple over Epic, but the appeals court also kept the ‌App Store‌ rule change mandate in place.\r<br />\n\r<br />\nApple claims that the ‌App Store‌ changes will \"upset the careful balance between developers and customers provided by the ‌‌‌‌‌App Store‌‌‌‌‌,\" resulting in irreparable harm to Apple and consumers. Apple has also said that it needs time to figure out the \"complex and rapidly evolving legal, technological, and economic issues\" that the update would cause.\r<br />\n\r<br />\nIn April, Apple said that while it supported the court's ruling, it disagreed with the ‌App Store‌ changes and was \"considering further review.\" Apple will now request that the Supreme Court hear the case.\r<br />\n\r<br />\nAt the current time, Apple has 90 days to make a filing with the Supreme Court. If the Supreme Court decides to hear the case, Apple will not need to make ‌App Store‌ changes until the court makes a final ruling. If the Supreme Court does not decide to hear the case, Apple will need to make the changes.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/epic-games/\">Epic Games</a>, <a href=\"https://www.macrumors.com/guide/epic-games-vs-apple/\">Epic Games vs. Apple</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/17/app-store-rule-change-epic-games-delayed/\">Judge Lets Apple Further Delay Implementing App Store Rule Changes From Ongoing Epic Dispute</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/judge-lets-apple-further-delay-implementing-app-store-rule-changes-from-ongoing-epic-dispute.2396175/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"8f5b40118c9305b60d715ef942014d8e90df233afbc2fba92d093f1995e1ad74","category":"Apple"}