{"title":"Vision Pro developer kits will help devs get their apps ready before launch","link":"https://arstechnica.com/?p=1945649","date":1686066924000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/vision-pro-800x481.jpeg\" alt=\"Apple's Vision Pro headset.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/vision-pro.jpeg\">Enlarge</a> <span>/</span> Apple's Vision Pro headset. (credit: Apple)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n\n<p>Apple's pitch for its new Vision Pro headset announced yesterday leaned heavily on third-party apps and content—Apple's app ecosystems are a big competitive advantage for the iPhone and iPad, and the company clearly wants to extend that to its AR headset.</p>\n<p>A <a href=\"https://developer.apple.com/visionos/work-with-apple/\">page on Apple's developer site</a> outlines what Apple will do between now and Vision Pro's launch to help developers get their apps ready. Most notably, the company will offer a Vision Pro developer kit, which will be hardware that will \"provide the ability to quickly build, iterate, and test on Apple Vision Pro so your app or game will be ready to deliver amazing experiences.\" The kits will be available by application only.</p>\n<p>Apple typically only offers these kinds of developer kits at major inflection points for its hardware lineup, where there's a big gap between a product's announcement and release and where the company wants to make sure that developers can get software done ahead of time. Most recently, this happened during the Apple Silicon transition, where developers could pay $500 to grab <a href=\"https://arstechnica.com/gadgets/2020/06/developers-leak-benchmarks-from-the-apple-silicon-mac-transition-kit/\">a prototype Mac mini</a> with the guts of an iPad Pro inside of it.</p></div><p><a href=\"https://arstechnica.com/?p=1945649#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1945649&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8f6662264ca79b2ce3ff0ea8c41ef0526a4983551ad636ca0bb9b941a0e48547","category":"Tech"}