{"title":"Computational prediction of retention times of veterinary antibiotics obtained by means of liquid chromatography‐mass spectrometry","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13499?af=R","date":1711720743000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Veterinary antibiotics are chemical compounds used to kill or inhibit the growth of pathogenic bacteria associated with animal diseases. These molecules can be defined by the retention times (<i>t</i>\n<sub>\n   <i>R</i>\n</sub>) in liquid chromatography-mass spectrometry (LC-MS). One strategy to predict the <i>t</i>\n<sub>\n   <i>R</i>\n</sub> of new veterinary antibiotics is the development of predictive quantitative structure-property relationship (QSPRs), which were used in this study.</p>\n<h2>Results</h2>\n<p>A database of 122 antibiotics was selected in which the <i>t</i>\n<sub>\n   <i>R</i>\n</sub> was measured using a Hypersil Gold column. An optimal three-feature model was developed by integrating the unsupervised variable reduction, replacement method variable subset selection and multiple linear regression. The negligible differences among the coefficient of determination and the root-mean-square error for the training set (<i>R</i>\n<sup>\n   <i>2</i>\n</sup> = 0.902 and <i>RMSEC</i> = 0.871) and test set (<i>Q</i>\n<sup>\n   <i>2</i>\n</sup> = 0.854 and <i>RMSEP</i> = 1.064) indicate a stable and predictive model. In a further step, a deeply explanation of the mechanism of action of each descriptor in predicting the <i>t</i>\n<sub>\n   <i>R</i>\n</sub> is provided, as well as the construction of the theoretical chemical space for accurate predictions of new antibiotics.</p>\n<h2>Conclusion</h2>\n<p>The <i>in silico</i> model developed in this work identified three molecular descriptors associated with aqueous solubility, octanol-water partition coefficient and the presence of negative and lipophilic atom pairs. The QSPR developed here could be implemented by agricultural and food chemists to identify and monitor existing and new antibiotics within the framework of LC-MS. The computational model was developed in accordance with the five principles outlined by the Organization for Economic Co-operation and Development.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Cristian Rojas, \nNicole Sarmiento, \nEmilia Ayora, \nReinaldo Pis Diez","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"8f6f6062928486db553dcf675564f8ec86872f911b912dbeef1948290bd3cbb0","category":"Environment"}