{"title":"The impact of humanitarian emergencies on adolescent boys: Findings from the Rohingya refugee crisis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003278","date":1717509600000,"content":"<p>by Shane Harrison, Richard Dean Chenhall, Karen Block, Sabina Faiz Rashid, Cathy Vaughan</p>\r\n\r\nAdolescent boys (age 9–19) are impacted differently by humanitarian emergencies. However, academic research on adolescent health and child protection has tended to focus on the direct impacts of an emergency rather than indirect impacts that may arise after a crisis. We sought to identify child protection concerns affecting adolescent boys in emergency settings and boys who are more vulnerable to harm through a case study of the humanitarian response to the 2017 Rohingya refugee crisis. We collected data in the Rohingya refugee crisis in Cox’s Bazar, Bangladesh between 2018–2019. This included six months of participant observation, 23 semi-structured interviews and 12 informal ethnographic interviews with humanitarian staff working in the crisis, and 10 focus group discussions with a total of 52 child protection caseworkers from four child protection organisations. Our results showed that adolescent Rohingya boys were exposed to numerous protection concerns, including child labour, drug trafficking, substance abuse, family violence, and neglect. We classified these into three main typologies: community-related violence, income-related violence, and life-stage vulnerabilities. We found that adolescent boys who were unaccompanied or separated from their caregivers, adolescent boys who were members of vulnerable households, and adolescent boys with a disability were at more risk of harm. Our findings indicate that adolescent boys are exposed to an array of impactful child protection concerns in humanitarian emergencies and that this has implications for the delivery of public health and child protection interventions. We believe that humanitarian actors should improve recognition of the complexity of adolescent boys’ lives and their exposure to gender and age-based harm as a critical matter for addressing adolescent health equity.","author":"Shane Harrison","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"8f77ed52c68fcae47047b43e1ae41ff58ba08630a91eff98b16eff48be1aa446","category":"Environment"}