{"title":"Supreme Court kills FTC’s “strongest tool” for getting refunds to scam victims","link":"https://arstechnica.com/?p=1759776","date":1619196503000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-supreme-court-roberts-breyer-kagan-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/getty-supreme-court-roberts-breyer-kagan.jpg\">Enlarge</a> <span>/</span> Supreme Court Justices, from left, Chief Justice John Roberts, Stephen Breyer, and Elena Kagan listen during then-President Trump's State of the Union address to a joint session of Congress at the US Capitol in Washington, DC, on Tuesday, Jan. 30, 2018. (credit: Getty Images | Bloomberg)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>A Supreme Court ruling yesterday killed the Federal Trade Commission's \"strongest tool\" for fighting scam artists and securing refunds for wronged consumers, the FTC's acting chairwoman said.</p>\n<p>\"The Supreme Court ruled in favor of scam artists and dishonest corporations, leaving average Americans to pay for illegal behavior,\" FTC Acting Chairwoman Rebecca Kelly Slaughter said in a <a href=\"https://www.ftc.gov/news-events/press-releases/2021/04/statement-ftc-acting-chairwoman-rebecca-kelly-slaughter-us\">statement</a> after the ruling. \"With this ruling, the Court has deprived the FTC of the strongest tool we had to help consumers when they need it most. We urge Congress to act swiftly to restore and strengthen the powers of the agency so we can make wronged consumers whole.\"</p>\n<p>Though it was criticized by Slaughter and consumer advocates, the <a href=\"https://www.supremecourt.gov/opinions/20pdf/19-508_l6gn.pdf\">Supreme Court's ruling</a> in a case involving deceptive payday lending practices was unanimous. In <em>AMG Capital Management v. Federal Trade Commission</em>, the court ruled that Section 13(b) of the Federal Trade Commission Act \"does not authorize the Commission to seek, or a court to award, equitable monetary relief such as restitution or disgorgement\" for consumers.</p></div><p><a href=\"https://arstechnica.com/?p=1759776#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759776&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8f782b0b586252d838a1e351cd5ec95af6b665a588b3f7cca18502b51331975b","category":"Tech"}