{"title":"Combined Genome-Wide Association Studies (GWAS) and Linkage Mapping Identifies Genomic Regions Associated with Seedling Root System Architecture (RSA) under Different Nitrogen Conditions in Wheat (Triticum aestivum L.)","link":"https://www.preprints.org/manuscript/202407.1579/v1","date":1721371065000,"content":"The nutrient absorption and utilization efficiency in the roots of seedlings are beneficial for increasing crop yield. Creating marker assisted selection for wheat root traits can assist wheat breeders in choosing robust roots to maximize nutrient uptake. Exploring and identifying the effect of different nitrogen applications on RSA is of great significance for breeding nitrogen efficient wheat varieties. In this study, A total of 243 wheat varieties native to the Yellow and Huai Valley regions of China were utilized for genome-wide association studies (GWAS). Furthermore, a recombinant inbred line (RIL) population of 123 lines derived from the cross between Avocet and Chilero was utilized for linkage examination and confirmation of the hereditary loci distinguished by GWAS. Five RSA traits include the relative number of root tips (RNRT); relative total root length (RTRL); relative total root surface area (RTRS); relative total root volume (RTRV) and relative average root diameter (RARD) where evaluated under two N conditions—normal N (NN) supply and low N (LN)—to characterize the NUE of each accession. GWAS and linkage analysis were performed by integrating data from the wheat 660k single nucleotide polymorphism (SNP) chip and diversity arrays technology (DArT) to identify genetic loci associated with RSA. The results showed that based on the ratio of RSA related traits under two N supply conditions, a total of 598 SNP markers, which are significantly associated with RSA related traits, were detected at 160 genetic loci by GWAS. A total of 10 QTL loci related to RSA were dis-covered and identified by linkage mapping. In which, three significant RSA related Quantitative Trait Locus (QTL) were identified, namely qRtrl-3D, qRnrt-3D, and qRtrl-7D. The study has the potential to enhance the effectiveness of selecting root traits in wheat breeding programs, offering valuable insights into the genetic underpinnings of nitro-gen use efficiency (NUE) in wheat. This could lead to the creation of NUE wheat varieties by implementing focused breeding strategies","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"8f8cc34a70e8274ed861d401a0f7843fcf8c67c7f5d65c7ebf85720db7b20cd7","category":"Interdisciplinary"}