{"title":"Study on flow field characteristics of gas-liquid hydrocyclone separation under vibration conditions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307110","date":1720792800000,"content":"<p>by Xiaoguang Zhang, Fan Yu, Yu Jin, Lixin Zhao, Suling Wang, Baorui Xu</p>\r\n\r\nThe complex vibration phenomenon occurs in the downhole environment of the gas-liquid hydrocyclone, which affects the flow field in the hydrocyclone. In order to study the influence of vibration on hydrocyclone separation, the characteristics of the flow field in the downhole gas-liquid hydrocyclone were analyzed and studied under the condition of vibration coupling. Based on Computational Fluid Dynamics (CFD), Computational Solid Mechanics Method (CSM) and fluid-solid coupling method, a fluid-solid coupling mechanical model of a gas-liquid cyclone is established. It is found that under the condition of vibration coupling, the velocity components in the three directions of the hydrocyclone flow field change obviously. The peak values of tangential velocity and axial velocity decrease, and the asymmetry of radial velocity increases. The distribution regularity of vorticity and turbulence intensity in the overflow pipe becomes worse. Among them, the vorticity intensity of the overflow pipe is obviously enhanced, and the higher turbulence intensity near the wall occupies more area distribution range. The gas-liquid separation efficiency of the hydrocyclone will decrease with the increase of the rotational speed of the screw pump, and the degree of reduction can reach more than 10%. However, this effect will decrease with the increase of the rotational speed of the screw pump, so the excitation effect caused by the rotational speed has a maximum limit on the flow field.","author":"Xiaoguang Zhang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8f8dcb7669e4898b9438f1f9d4b9d913a2b51b48d8b62e93d60a0bfbb8ce78a8","category":"Interdisciplinary"}