{"title":"Caravan of dreams: Watching the Tour de France from the roadside","link":"https://www.cyclist.co.uk/in-depth/tour-de-france-caravan","date":1688571443000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-caravan\">Caravan of dreams: Watching the Tour de France from the roadside</a></p>\n\n<p>Watching a stage of the Tour de France in person is emotionally and physically demanding – and that’s before the race has even arrived</p>\n\n\n\n<p>One of my darkest moments as a cyclist came years ago on the slopes of the <a href=\"https://www.cyclist.co.uk/in-depth/classic-tour-de-france-climbs-col-du-tourmalet\" target=\"_blank\">Col du Tourmalet</a>. The struggle that ensued just a few kilometres from the summit was less noble suffering and more undignified scrum. My nemesis was a ten-year-old French boy, whose youth and cunning overwhelmed the supposed wisdom of my middle-age when we found ourselves in pursuit of a cheap plastic keyring that had just been dispensed from the <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\" target=\"_blank\">Tour de France</a> publicity caravan.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/news/tour-de-france-fans-2023\">Basque-ing in the glory: Bilbao’s Tour de France 2023 fans</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-2022-alpe-d-huez\">The fans’ mountain: The 2022 Tour de France on Alpe d’Huez</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>My wife and I had slogged all the way up the mountain on foot from our gîte outside Sainte-Marie-de-Campan (a crack in my top tube putting paid to any thoughts of cycling up). Our strategy for getting the most out of the caravan was simple: pick a stretch of road steep and twisty enough for the cavalcade of vehicles to have to slow down, and remote enough to have not attracted too many spectators.</p>\n\n\n\n<p>The third hairpin above the ski resort of La Mongie seemed to fulfil these criteria – the few others present were sat in deckchairs with ears glued to radios – so we took out the homemade sandwiches and bottle of wine from our backpacks and commenced le pique-nique.</p>\n\n\n\n<p>Disconcertingly, other spectators started to arrive. The demographic of these new arrivals was worrying. They were younger, leaner, fitter-looking: a father and his young son; two teenage pals; young parents with their twitching, boisterous progeny.</p>\n\n\n<div>\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-970x646.jpg\" alt=\"alpe_dhuez_dutch_corner_1\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-768x511.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-1536x1022.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-750x499.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-1140x759.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2018/07/07115508/alpe_dhuez_dutch_corner_1.jpg 2000w\" /><figcaption><em>Geoff Waugh / Cyclist</em></figcaption><figcaption></figcaption></figure></div>\n\n\n<p>The <em>caravan publicitaire</em> dates back to 1930 when Tour director Henri Desgrange banned trade teams and made it a race for national squads. Team sponsors no longer had any incentive to pay for riders’ food and accommodation, so Desgrange invited businesses to pay a fee to be allowed to precede the race and advertise their wares to the millions of fans on the roadside.</p>\n\n\n\n<p>A murmur from below made us look back down the valley. A Volkswagen Beetle with the giant head of a yellow jersey-wearing rider poking from its sunroof was emerging from the concrete strip of La Mongie. Following it was a hallucinogenic cavalcade of inflatable blue Smurfs, galloping fibreglass horses, rabbits riding stationary bikes atop a convoy of Nesquik-branded vans, and a small car almost completely consumed by a massive, bright yellow Crédit Lyonnais lion.</p>\n\n\n\n<p>My wife and I both knew the drill. We’d gone over it during our hike up the mountain. She would stay on this side of the road, while I would cross over and move up several hundred metres. Once the caravan arrived, we knew we wouldn’t be as obvious a target audience as any adjacent cute kids. </p>\n\n\n\n<p>The key was to appear nonchalantly receptive to a free T-shirt or wheel of cheese, but not too needy. No imploring smiles or beckoning hands. We had to make it look as though we would be magnanimous towards our young rivals should a packet of <em>madeleines</em> (highly addictive almond-flavoured sponge cakes) land equidistantly between us.</p>\n\n\n<div>\n<figure><img width=\"842\" height=\"297\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg 842w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-750x265.jpg 750w\" /><figcaption></figcaption></figure></div>\n\n\n<p>I had a sneaking admiration for these kids. They were clear-eyed and focussed. None of them were waving at the distant helicopters or holding signs asking Julian Alaphilippe for his water bottle. Then a Škoda bucket hat flew by my head and all respect for my opponents instantly disappeared.</p>\n\n\n\n<p>I don’t remember the exact details, but my confrontation with ten-year-old Laurent resulted from something solid and shiny landing in the grass behind us. We both sensed this was a cut above the samples of detergent, air fresheners and green foam hands that had previously arced through the sky towards us.</p>\n\n\n\n<p>I was momentarily distracted by my wife jumping up and down with excitement at having procured a Carrefour King of the Mountains baseball cap and packet of Haribo without sustaining any visible signs of injury. And in that split second Laurent had reached the treasure of a Cofidis keyring before me.</p>\n\n\n\n<p>When the caravan had passed, an amiable, informal swap shop began with our neighbours. My bitterness at missing out on the keyring was forgotten after clinking plastic glasses with Laurent’s parents and swapping my spare Etap Hotel buff for a Festina rubber bracelet. </p>\n\n\n\n<p>Now it was just a matter of basking in the sunshine with our booty until the race arrived.</p>\n\n\n\n<p><em>Follow the avalanche of coverage at our <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\" target=\"_blank\">Tour de France hub</a>. </em></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-caravan\">Caravan of dreams: Watching the Tour de France from the roadside</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Martin James","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8f94a89da8bd591016f45590ba594aa9fb154bca7a963ab8a4279e0a087b156f","category":"Cycling"}