{"title":"Catalytic pyrolysis of torrefied biomass with molecular sieve catalysts to produce hydrocarbon rich biocrude","link":"https://onlinelibrary.wiley.com/doi/10.1002/ep.14446?af=R","date":1717945772000,"content":"<h2>Abstract</h2>\n<p>The downstream processing of biocrudes obtained from direct biomass pyrolysis poses significant challenges due to stability issues, necessitating costly upgrading for further coprocessing with refinery feeds. This study examines the impact of torrefaction pretreatment on pyrolysis product distribution and biocrude composition using sawdust (SD) and groundnut shell (GS) feeds. Torrefaction was conducted at varying temperatures (200, 250 and 300°C) for 30 min under different reactor conditions. Increasing the severity of torrefaction resulted in decreased biocrude yields with reduced water content and gas formation, particularly evident with GS. A torrefaction temperature of 250°C and 30 min of pretreatment yielded higher phenolics and hydrocarbons. This increase in phenolics can be attributed to lignin enrichment during torrefaction, which, in the presence of a catalyst, undergoes deoxygenation leading to hydrocarbon formation. The influence of feed particle size, whether in powder or pellet form, on biocrude yield and composition was found to be minimal. Catalytic pyrolysis of SD using molecular sieve catalysts yielded the highest hydrocarbon (42%) and aromatic content (44%) at catalyst to biomass ratios of 1:1 and 2:3. The combination of torrefaction and pyrolysis was shown to enhance the quality of biocrude by increasing its hydrocarbon content, but at the expense of lower liquid yields. Experimental observations were supported by statistical analysis tools such as principal component analysis, which assessed pyrolysis product yields and composition.</p>","author":"Ranjita Singh, \nSivasankar Kakku, \nKhushee Shah, \nXiaolei Zhang, \nAbhishek Sharma, \nNandana Chakinala, \nAnand G. Chakinala","siteTitle":"Wiley: Environmental Progress & Sustainable Energy: Table of Contents","siteHash":"b28fb26331cde729ae73c977769fdcaa6768b42565392c9d219342e8c7b880ff","entryHash":"8f96a73bbfa81a9e663959589faa8a6ab444d12ec06ee028f51090ce3d8a0484","category":"Environment"}