{"title":"Moving beyond the mean: an analysis of faecal corticosterone metabolites shows substantial variability both within and across white-tailed deer populations","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae062/7750654?rss=1","date":1725667200000,"content":"<span><div>Abstract</div>Glucocorticoid (GC) levels have significant impacts on the health and behaviour of wildlife populations and are involved in many essential body functions including circadian rhythm, stress physiology and metabolism. However, studies of GCs in wildlife often focus on estimating mean hormone levels in populations, or a subset of a population, rather than on assessing the entire distribution of hormone levels within populations. Additionally, explorations of population GC data are limited due to the tradeoff between the number of individuals included in studies and the amount of data per individual that can be collected. In this study, we explore patterns of GC level distributions in three white-tailed deer (<span>Odocoileus virginianus</span>) populations using a non-invasive, opportunistic sampling approach. GC levels were assessed by measuring faecal corticosterone metabolite levels (‘fCMs’) from deer faecal samples throughout the year. We found both population and seasonal differences in fCMs but observed similarly shaped fCM distributions in all populations. Specifically, all population fCM cumulative distributions were found to be very heavy-tailed. We developed two toy models of acute corticosterone elevation in an effort to recreate the observed heavy-tailed distributions. We found that, in all three populations, cumulative fCM distributions were better described by an assumption of large, periodic spikes in corticosterone levels every few days, as opposed to an assumption of random spikes in corticosterone levels. The analyses presented in this study demonstrate the potential for exploring population-level patterns of GC levels from random, opportunistically sampled data. When taken together with individual-focused studies of GC levels, such analyses can improve our understanding of how individual hormone production scales up to population-level patterns.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"8f9ff19accbf4b08389da01417de755d2494fd89ecb9de97b91849e4e799a1a5","category":"Environment"}