{"title":"Apple’s case to keep selling the Apple Watch called ‘weak and unconvincing’","link":"https://www.macworld.com/article/2199134/itc-apple-case-weak-unconvincing.html","date":1704982325000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Last month, the International Trade Commission (ITC) required Apple to <a href=\"https://www.macworld.com/article/2174907/apple-watch-ban-sales-december-25-2023-itc-ruling.html\">“pause” sales</a> of the Apple Watch Ultra 2 and Series 9, citing a patent infringement related to those devices’ blood oxygen sensors. This was obviously a hugely damaging setback for the Cupertino company, but it did at least prove to be brief, with an appeals court granting a somewhat surprising temporary <a href=\"https://www.macworld.com/article/2189609/apple-can-sell-apple-watches-again-as-court-temporarily-lifts-ban.html\">stay on the ban</a> a few days later.</p>\n\n\n\n<p>The longer-term prospects of the Ultra 2 and Series 9 remain uncertain. Apple has requested for the ban to be paused through the entire appeals process, but the ITC for one is strongly against this. Its response, filed Wednesday and reported by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2024/01/10/apple-watch-ban-itc-oppose-pause/&amp;xcust=1-1-2199134-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">9to5Mac</a>, calls Apple’s case “weak and unconvincing” and argues that it “fails to demonstrate the two most important factors in granting a stay—the likelihood of success on the merits and irreparable harm.”</p>\n\n\n\n<p>Most crushingly, the ITC claims Apple’s arguments “amount to little more than an indisputably adjudicated infringer requesting permission to continue infringing the asserted patents.”</p>\n\n\n\n<p>The ITC is probably right to assert that Apple is in little danger of having to make layoffs or declare bankruptcy in response to the sales ban, but it’s worth pointing out that Apple is making efforts to amend its behavior. The company told the Court of Appeals that it has redesigned how the blood sensor works; this may be enough to avoid infringing on Masimo’s patents, but US Customs will have the final say.</p>\n\n\n\n<p>9to5Mac points out that other parties have until January 15 to file responses to Apple’s motion. The US appeals court will then decide whether to permit a stay on the sales ban for the entire duration of Apple’s appeal–and if the verdict of the appeals court and US Customs are both unfavorable, the two devices will disappear from stores once again.</p>\n\nApple Watch</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"8fb3cb93884a302aa1732a1550d15f9e29acaecd1d5ace91780cc259ffc4029a","category":"Apple"}