{"title":"10 tips to get your mountain bike ready for spring","link":"https://www.bikeradar.com/advice/workshop/10-tips-to-get-your-mountain-bike-ready-to-hit-the-trails-this-season/","date":1680084000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/Canyon-Neuron-CF-9-SL-19-11242cc.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Cyclist riding the Canyon Neuron CF 9 SL full suspension mountain bike over rough terrain\" title=\"Canyon Neuron CF 9 SL - 19\" />                                            <p>Whether you’ve set your bike aside for winter pastimes or ridden it hard through the muck and mire, now is the perfect time to give your machine a thorough inspection to ensure it’s in tip-top shape for spring.</p>\n<p>First and foremost, it is always good to settle on a system when inspecting your bicycle. You could divide the task by various categories – wheels, frame, suspension, brakes, drivetrain, etc – or you could simply work from front to back. Either method works, so long as you cover all the bases.</p>\n<p>Here are 10 things to check over before hitting the trails this spring.</p>\n<h2>1. Tyres</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Tyres make a big difference to how your bike feels, because they are the only thing separating it from the ground.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>Determine how much tread your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">mountain bike tyres</a> have left and check for knobs that are peeling off as well. Inspect the tyres to make sure there are no small tears or thorns that could become a problem on the trail.</p>\n<p>It’s not uncommon for <a href=\"https://www.bikeradar.com/advice/buyers-guides/mtb-tyre-carcass-construction/\">tyre casings</a> to give out before you’ve worn out the tread. Check for excessive sidewall wear: look for abrasions and threads protruding from the casings.</p>\n<p>If you run your <a href=\"http://www.bikeradar.com/mtb/gear/article/trail-tech-how-to-set-up-tubeless-mountain-bike-tires-36897/\">tyres tubeless</a>, now is a good time to top them up with a fresh scoop or two of your <a href=\"https://www.bikeradar.com/advice/buyers-guides/which-tubeless-sealant-works-the-best/\">favourite sealant</a>.</p>\n<h2>2. Wheels</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Checking the nipples and squeezing the spokes should give you a good idea of the wheel’s condition.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>Spin your wheels to check for any side-to-side wobbles or vertical hops, which could reveal they need servicing.</p>\n<p>This is also a good time to make sure the wheels are spinning freely and that the hubs are neither too loose nor too tight. Give the spokes a quick squeeze to make sure none are loose.</p>\n<p>Take a close look at where the nipples meet the rim. Hairline cracks could quickly turn into a major problem out on the trail, possibly leaving you with a taco-shaped wheel and a long walk home.</p>\n<p>If the wheel is out of shape when you spin it, you’ll need to <a href=\"https://www.bikeradar.com/advice/workshop/workshop-truing-a-pair-of-wheels/\">true it</a>. If you are not comfortable doing that, take the wheel to your favourite shop and let them put it in a jig for you.</p>\n<h2>3. Brakes</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The start of the season is a good time to check your brake pads. If there is less than 1.5mm of material remaining, it’s time for a new pair.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>While checking your wheels, you hopefully heard the sweet sound of silence as the disc brake rotors spun through the brake calipers without interference. If your <a href=\"https://www.bikeradar.com/advice/workshop/how-to-silence-disc-brakes/\">disc brake is making noise</a> then it could be time to <a href=\"http://www.bikeradar.com/gear/article/how-to-align-your-disc-brake-calipers-32591/\">reposition the brake caliper</a>.</p>\n<p>Brake rotors can also become bent, contributing to interference, so pay attention to any side-to-side wobble. This is an easy fix with an adjustable wrench or a rotor alignment tool, a quiet workspace and a gentle tweak of the rotor.</p>\n<p>Check the <a href=\"https://www.bikeradar.com/advice/buyers-guides/disc-brake-pads/\">disc brake pads</a> for excessive wear and<a href=\"http://www.bikeradar.com/gear/article/workshop-how-to-remove-and-replace-disc-brake-pads-25208/\"> replace</a> them if needed. It’s also worth checking they aren’t contaminated, because they will make the braking less efficient.</p>\n<h2><strong>4. Suspension</strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> After inspecting the front and rear shocks, be sure to check your sag is where you want it. Increase or decrease air pressure accordingly.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>Inspect the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\">fork</a> or stanchions for any nicks or scratches. Use a clean rag to wipe off any dirt from the fork seals. Check the seals for cracks or excessive fluid build-up – both are signs that your fork may need to be rebuilt.</p>\n<p>Once everything seems to be in working order, cycle the fork and rear suspension several times before <a href=\"http://www.bikeradar.com/gear/article/how-to-set-up-a-suspension-fork-video-32460/\">checking your sag settings</a> and adjusting your air pressure accordingly.</p>\n<h2><strong>5. Cockpit </strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Make sure you tighten the bolts on the face plate as well as on the steer tube.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>The stem, handlebar and seatpost may be the three most thankless components on a mountain bike. While they need very little in the way of routine adjustments, it is still important to inspect them for signs of damage from time to time.</p>\n<p>Remove your seatpost and re-grease the seat tube, or use carbon paste if the frame is carbon. Remove the handlebar and inspect it for signs of over-clamping; check for deep gouges that could lead to a potential failure down the line.</p>\n<p>When it’s time to <a href=\"http://www.bikeradar.com/gear/article/how-to-adjust-handlebar-height-38622/\">reinstall the handlebar</a>, make sure the stem is straight and the <a href=\"http://www.bikeradar.com/gear/article/workshop-how-to-service-a-headset-22225/\">headset is properly adjusted</a> (there should be no play or binding as the handlebar moves back and forth). Position the brakes and shifters to your liking. Be sure to tighten everything to its proper torque as specified by the component manufacturers.</p>\n\n<h2><strong>6. Shift and brake lines </strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Inspect the cables and housing for signs of damage and replace as needed.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>Check the derailleur housing for signs of wear, paying special attention to where the cables stop on the frame. It’s not uncommon for the wires encased in the plastic derailleur housing to pull through the ferrules at the end of the casing.</p>\n<p>If your cables are frayed, it will be difficult to adjust the rear derailleur and you should consider <a href=\"http://www.bikeradar.com/blog/article/replacing-and-adjusting-a-gear-cable-39888/\">replacing them</a>.</p>\n<p>A similar procedure is used for checking the brake and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a> cables. Follow the brakes from the levers to the calipers checking for signs of wear and scuff marks where the cable has rubbed against the frame. If the <a href=\"http://www.bikeradar.com/gear/article/workshop-how-to-change-a-hydraulic-disc-brake-hose-27758/\">hose looks damaged</a>, replacing it could save you from ruining a ride.</p>\n<h2> <strong>7. Frame</strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Check your frame for signs of damage from crashes, as well as for cable rub – a few strips of protective plastic can prevent needless marking from shift and brake lines.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p>After inspecting the shift and brake lines for wear, it’s a good idea to check the frame.</p>\n<p>Brake and shifter cable housing that is allowed to rub excessively against a frame can and will make its way through steel, carbon and aluminum frames. It’s easy to prevent this with a few small strips of protective tape, adding enough <a href=\"http://www.bikeradar.com/us/mtb/gear/article/trail-tech-always-use-protection-38918/\">protection to your frame</a>.</p>\n<p>Examine the frame for signs of damage from rock strikes and pay particular attention to the down tube and chainstays.</p>\n<p>If you ride a <a href=\"https://www.bikeradar.com/advice/buyers-guides/hardtail-versus-full-suspension-mountain-bike/\">full-suspension bike</a>, be sure to check the suspension pivots and shock bushings for any signs of play and torque to the appropriate spec as recommended by the manufacturer.</p>\n<h2><strong>8. Drivetrain</strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Without a functional drivetrain, you’ll be going nowhere fast.</span></figcaption><span> <i>Nick Clark / Our Media</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\">Drivetrains</a> take a lot of abuse during winter, with grit and water causing extra wear to components, and spring can be a good time to replace them.</p>\n<p>Shifting through the gears, there shouldn’t be any popping or skipping on the rear cassette without you moving the shift levers. If there is, a simple <a href=\"http://www.bikeradar.com/us/mtb/gear/article/how-to-adjust-a-rear-derailleur--36242/\">derailleur adjustment</a> might be all it needs.</p>\n<p>Examine the teeth on the chainrings and cassette cogs for signs of bent or broken teeth. Keep in mind that on most modern components the teeth have varying shapes to aid in moving the chain from one cog to another.</p>\n<p>Inspecting the chain for wear with a chain-checker tool, and <a href=\"http://www.bikeradar.com/road/gear/article/bicycle-chain-wear-explained-46015/\">replacing it when needed</a> can stop drivetrain components from wearing faster than they should.</p>\n<p>Try degreasing your drivetrain to get all the winter gunk off and then <a href=\"https://www.bikeradar.com/advice/buyers-guides/chain-lubes/\">lube your chain</a>.</p>\n<h2><strong>9. Frame fasteners</strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Most bolts on a bike come with a recommended torque.</span></figcaption><span> <i>Gary Walker / Our Media </i></span></div>\n<p>While some of these nuts and bolts would have been covered while looking over your brakes, cockpit, frame and drivetrain, this is still worth its own mention.</p>\n<p>If you plan on doing your own bike maintenance, then a torque wrench can be a good investment.</p>\n<p>Many parts will have the required torque labelled near the bolt, though it can be a good idea to list down any that aren’t displayed. Pay special attention to those bolts you rely on to keep your smile intact, such as on the stem and handlebar.</p>\n<p>We have a buyer’s guide to the <a href=\"http://www.bikeradar.com/road/gear/article/best-torque-wrench-for-bicycle-grouptest-46517/\">best torque wrenches</a>, which explains all the different options.</p>\n<h2><strong>10. Prep your gear</strong></h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Replacing cleats before they fail can save you from an uncomfortable ride home.</span></figcaption><span> <i>Stan Portus / Our Media</i></span></div>\n<p>Last but not least, take a few minutes to go over the gear that connects you to the bike.</p>\n<p>Make sure the buckles on your shoes are in good shape and your <a href=\"https://www.bikeradar.com/advice/skills/how-to-use-clipless-pedals/\">cleats</a> are screwed firmly in place.</p>\n<p>Examine your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-helmets-for-trail-riding/\">helmet</a> for damage, because even a small crack can mean the <a href=\"http://www.bikeradar.com/mtb/gear/article/how-to-inspect-and-care-for-your-helmet-when-should-you-replace-your-helmet-38165/\">helmet needs replacing</a>.</p>\n<p>With spring comes warmer days, and it might be time to consider changing <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-to-wear-mountain-biking/\">what you wear</a>, hanging the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-mtb-trousers/\">waterproof trousers</a> up till next winter and embracing <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-waterproof-mtb-shorts/\">waterproof shorts</a> (we’re being realistic, here – it’s not summer yet).</p>\n<p>If you ride with a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hydration-packs/\">hydration pack</a>, take the time to clean it out and <a href=\"http://www.bikeradar.com/us/mtb/gear/article/trail-tech-what-to-pack-for-long-mountain-bike-rides-37326/\">repack it</a>. Have a bladder in need of cleaning? Never bothered to throw out any of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-energy-bars/\">energy bar</a> wrappers? Have several punctured tubes stuffed in the bottom of your bag? Now is the time to deal with all of this with a spring clean.</p>\n<p>Inspect your tools, too. Make sure your shock pump and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-pump/\">mini pump</a> are both in working order. If you carry a first-aid kit, replace anything you used but didn’t replace last season.</p>","author":"Josh Patterson","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"8fb49f4f78fb4e7f342583f914de363fd408f0cab8afa620c09a61624b9211e0","category":"Cycling"}