{"title":"The behavioural costs of overcrowding for gregarious cave‐dwelling bats","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14072?af=R","date":1711868400000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/1a909cb2-1ae5-4cc7-addb-343b117c4f6d/jane14072-toc-0001-m.png\" alt=\"The behavioural costs of overcrowding for gregarious cave-dwelling bats\" />\n<p>This study investigates the trade-offs of overcrowding on bat social behaviour in the Philippines, the world's largest colony for fruit bats (<i>Rousettus amplexicaudatus</i>) in the Philippines. Significant variations were observed in behavioural activities, particularly increased aggregation correlated to negative social behaviour. While sexual behaviour was associated with positive behaviour, occurred in less crowded areas. Findings support the ‘behavioural sink’ hypothesis, indicating a decline in bat social behaviour due to overcrowding.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBats are known for their gregarious social behaviour, often congregating in caves and underground habitats, where they play a pivotal role in providing various ecosystem services. Studying bat behaviour remains an underexplored aspect of bat ecology and conservation despite its ecological importance.\n\nWe explored the costs and impacts of overcrowding on bat social behaviour. This study examined variations in bat behavioural patterns between two distinct groups, aggregated and non-aggregated male <i>Rousettus amplexicaudatus</i>, within the Monfort Bat Cave Sanctuary on Mindanao Island, Philippines.\n\nWe found significant variations in the incident frequencies of various bat behavioural activities, particularly aggression and movement, between these two groups. The increase in aggregation was closely related to negative social behaviour among bats.\n\nIn contrast, sexual behaviour was significantly related to the positive behaviour of individual bats and was headed in less crowded areas. The disparities in bat behaviour with an apparent decline in bat social behaviour because of overcrowding, with more aggressive behaviours emerging, align with the <i>‘behavioural sink’</i> hypothesis.\n\nOur study underscores the importance of considering habitat quality and resource availability in the management and conservation of bat colonies, as these factors can reduce the occurrence of aggressive and negative social behaviours in colonies with high population density by providing alternative habitats.\n</p>","author":"Jeaneth Magelen V. Respicio, \nKier C. Dela Cruz, \nAlice C. Hughes, \nKrizler C. Tanalgo","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"8fb580987ea694487494640fa664f16e58999718f3f0aa2e7d2579fdee38145a","category":"Environment"}