{"title":"I always forget to ride when I need it the most","link":"https://cyclingtips.com/2021/08/i-always-forget-to-ride-when-i-need-it-the-most/","date":1628228617000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/PXL_20210611_120905443-1-650x433.jpg\" /></div><h2>I always forget to ride when I need it the most</h2><p>\n</p><p>It sneaks up: a little added stress, a snappy remark, a drink too many, a niggle between the shoulders that turns into an ache that never feels like it will go away, and then I’m back there again. Walking circles around the house, watching the time pass, not going anywhere, not doing anything. Purgatory.</p>\n\n\n\n<p>You know in those old-timey movies where there’s a barrel of gunpowder and the fuse? It splutters and fizzes and you can see that little flickering flame is getting closer. It’s going to go off, and it’s going to make a hell of a mess. Either you get that thing outside in a hurry or else it’s going to blow up and there’ll be collateral damage. </p>\n\n\n\n<p>That’s how it feels. I always forget to ride when I need it the most. </p>\n\n\n\n<p>The lockdown before this lockdown, there was a big storm that swept across Melbourne, <a href=\"https://cyclingtips.com/2021/06/melbournes-cycling-paradise-devastated-by-storm-damage/\">laying waste to the Dandenongs</a>. Trees that were there before people were came crashing down onto houses, over roads, and through power lines. Ten kilometres west of the worst of it, the literal storm passed me by almost unnoticed. I was busy dealing with another one. </p>\n\n\n\n<p>The night after the storm, it was still raining. No time to change into cycling clothes: a big red rain jacket over the top of jeans and a T-shirt, my worst bike, <em><a href=\"https://open.spotify.com/album/6GEMMxfQVeQv6asV3ulqgd?si=OkZZk1cZQ8e3-pTRQA4Oew&amp;dl_branch=1\">Gentlemen</a></em> on repeat, and into the night. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/PXL_20210508_080159115-1340x893.jpg\" /></figure>\n\n\n\n<p>On the hill over Ringwood, the drizzle was a halo around the streetlights. Beyond them, entire suburbs were wiped out. No twinkling lights on the flanks of the ranges. Just a dark hulking indeterminate mass of thousands of households trying to get through this shitshow by candlelight. </p>\n\n\n\n<p>I plotted a course back around it, but Park Orchards was without power too. I had this moment, as I was climbing up Berringa Road, where I felt like I was the only person on Earth, floating in a little bubble illuminated by the beam of my light. </p>\n\n\n\n<p>I paused my music – I was up to <a href=\"https://open.spotify.com/track/6QYYxiqBtTM0L6123MX4m9?si=9ed20cef09a34a77\">‘My Curse’</a>, I remember, right at the part where it always eviscerates me – and just listened to the quiet taps of raindrops landing on my helmet. </p>\n\n\n\n<p>My breath in and out, the quiet human sounds of exertion. Somebody trying to figure things out one pedal-stroke at a time. </p>\n\n\n\n<p>I don’t know if I did – I don’t know if I ever will – but sometimes it feels like I get a little bit closer. </p>\n\n\n\n<p>I guess the power grid’s divided by the creek at the bottom of Park Road. As I rode down through the roundabouts in the silent black, dodging little branches in the bike lane, the glow of the streetlights on the other side of the bridge reeled me in.</p>\n\n\n\n<p>Just before I crossed over, I stopped for a moment, on the threshold of that brightness. Out of the dark and into the light. It was as perfect a visual metaphor for what cycling gives me as I could think of. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/PXL_20210611_120924589.NIGHT_-1340x893.jpg\" /></figure>\n\n\n\n<p>We’re in lockdown again. Last year, when Melbourne lived in a five kilometre bubble and it permanently felt like winter, even when it wasn’t, the ad jingles used to go “We’re all in this together.” Now that half the country’s in bubbles of their own, when we all <em>are</em> in this together, the jingles have stopped. “We’re all in this alone” doesn’t have the same ring to it, even if that’s how it feels half the time. </p>\n\n\n\n<p>I’ve done this before, but I’ve lost the routine. Those hours of daily exercise go wasted, even though I know I need them. My shoulders ache. I prowl the house like a caged animal. I know what I need to do, but there’s a lot of heavy lifting between ‘knowing’ and ‘doing’. </p>\n\n\n\n<p>I can see the flickering flame getting closer. This thing’s going to go off, and it’s going to make a hell of a mess, unless I get it outside before it explodes.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/i-always-forget-to-ride-when-i-need-it-the-most/\">Read More</a>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8fb6d95e14e0f02a68c2b181373e15a144ce99a906e6316c1578111a81ffb717","category":"Cycling"}