{"title":"Bigger than bike racing: the importance of the Tour de France Femmes avec Zwift","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/bigger-than-bike-racing-why-the-tour-de-france-femmes-avec-zwift-was-so-important","date":1687680000000,"content":"\n      <p><span>I was sitting inside the hot, sweaty press room after the first stage of the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a>, when a male French journalist struck up conversation with me. We discussed how Lorena Wiebes had taken an emphatic win on the Champs-Élysées a few hours earlier, how she’d produced such an impressive turn of speed to win by a big margin ahead of Marianne Vos. The conversation moved on, chatting about the days to come in the race: a couple of flat and punchy stages, which we thought could offer more opportunities for a signature Wiebes win, or we considered the possibility of a breakaway getting lucky and making it to the line. </span></p><div></div>\n<p><span>“But you wait until the final two stages,” he said. “You’ll see girls walking up the climbs.”</span></p>\n<p><span>It was here that the exchange came to a rather abrupt end. I was taken aback by his attitudes towards the race and his lack of understanding about the quality of women’s cycling. The man’s sentence stuck with me, it angered me, of course, but looking back now, I’m grateful for it. There are still some in cycling with such attitudes towards women’s racing, and his words highlighted to me exactly how much we needed the return of a women’s Tour de France.</span></p>\n<p><span>As I watched Annemiek van Vleuten and Demi Vollering battle it out on the slopes of the Petit Ballon to the roars of an excited French public on the race’s penultimate stage, I thought about the words of that man on the first day of the Tour Femmes. Watching the final rider cross the finish line atop La Super Planche des Belles Filles the next day, powering up the eye-wateringly savage gradients, I thought about it again. I thought about all the people who would have been proved wrong by the performance of the women’s peloton and how this race will have changed things for the generations to come.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00274-_2_1024x1024.jpg?v=1667828432\" alt />It wasn’t just the legendary Champs-Élysées or the big mountain days that made the Tour de France Femmes spectacular, however. Every single stage told a story. Marianne Vos’s victory on the second day of the race was perhaps the biggest of them all, because it felt right. It felt normal. Vos wearing the</span><i><span> maillot jaune</span></i><span> felt like something that should have happened years ago: she’s the greatest of all time. A once-in-a-generation all-rounder who rides a bicycle like she was born to do it.</span></p>\n<p><span>She’s been a pioneer for the women’s peloton since she took her first road World Championship victory in 2006, fighting for the return of a women’s Tour de France by becoming a founding member of </span><i><span>Le Tour Entier</span></i><span>, an organisation which aimed to “help create a framework to support the growth of women’s cycling and build a sport with greater consumer, media and commercial appeal – starting with a race at the Tour de France”.</span></p>\n<p><span>Vos, at 35, finally got the opportunity she’s been fighting for, and it would be hard to argue that there was a more deserved stage winner and yellow jersey wearer. In the press conference after her first of two stage wins in the race, the Dutchwoman answered a question about her retirement plans with one, simple statement: “I couldn’t stop until this race happened.”</span></p>\n<p><span>On the day Vos sprinted to her first win of the race, I was part of the race convoy in an ASO car driven by Chantal Beltman, a retired Dutch rider who rode the Grande Boucle Féminine Internationale in the early 2000s – one of the many failed previous iterations of a women’s Tour de France.</span></p>\n<p><span>She recounted stories of the race, telling me about riding two stages per day after sleeping on mats in sports halls the night before, how she’d eat plates of plain pasta and sometimes be completely unsure about how many kilometres she had to race in the upcoming stage. She said it with a smile, though: “Things were different, it was pure racing, we did it in our own way. It was nothing like the race we see today.” </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00401-_1_1024x1024.jpg?v=1667828456\" alt />While Beltman, a modest, humble character, played down the part that she and her colleagues had to play in bringing the Tour de France Femmes we saw in 2022 to fruition, it’s undeniable that she, and the generations before her, have been blazing a trail for decades.</span></p>\n<p><span>As Beltman drove the car through the French countryside, dappled with sunlight and dust from the surrounding farm tracks, she came across a familiar face in the convoy: a team-mate she rode with on the Dutch national team, Iris Slappendel. They spotted each other and grinned, it was a moment of recognition, an understanding that, although they were never given the chance to race something of this stature in their careers, they’d been part of the pressure to create it for today’s peloton.</span></p>\n<p><span>Slappendel herself rode on the back of a motorbike throughout the race, giving in-race commentary for Eurosport and GCN. She’s the founder of the Cyclists’ Alliance, a riders’ union set up to provide support to professional female cyclists during and after their careers. Whether it be with contract negotiations, economic or emotional support, or even through a rider mentorship programme, Slappendel’s organisation has been a driving force in giving the women’s peloton equal opportunities to the men’s. The Tour de France Femmes avec Zwift is partly an effect of the Cyclists’ Alliance’s hard work.</span></p>\n<p><span>As Slappendel and Beltman shouted at each other over the noise of race vehicles, there was a small breakaway of four riders in front. It was a group mostly made up of small teams, including riders from Human Powered Health, Parkhotel Valkenburg and AG Insurance-NXTG. The average age of the group was 20. Cheering the riders on by the side of the road was a young fan holding up a sign that read GRL PWR. Beltman tooted the horn of her car as we passed the girl in her yellow dress. She jumped up and down, rejoicing, grinning, laughing and waving her sign triumphantly.</span></p>\n<p><span>The Tour de France Femmes saw all of these generations of women come together for a moment which was bigger than bike racing. All around the race was a sense of change, change that was happening very, very quickly. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-07603_1024x1024.jpg?v=1667828514\" alt />Vos’s victory on stage two set the scene for a series of incredible finales which shaped the earlier part of the race. Danish rider Cecilie Uttrup Ludwig’s win in Épernay was perhaps the most nail-biting. Clad in her red and white national champion jersey, the FDJ-Suez Futuroscope team leader sprinted from the back of the pack in the final 200 metres of the punchy, uphill finish to take the stage win.</span></p>\n<p><span>She did it after the bad luck she and her team had dealt with in stage two, which was marred by a series of distressing crashes. She fought all the way to the finish line. Her post-race comments cemented Uttrup Ludwig as cycling’s favourite interviewee, exuding passion through the viewers’ TV screens. “I just loved how the team kept the fighting spirit. We knew that today was a super good day and, if I had the legs, I could go for the win. To actually do it and be a Tour de France stage winner and in this jersey, oh my god, it doesn’t get better.”</span></p>\n<p><span>The gravel roads of stage four saw more drama: crashes, punctures and mishaps plagued many of the race’s key protagonists. The worst off was UAE Team ADQ’s Mavi García as she collided with her team car chasing back to the bunch. It was pure chaos, a type of chaos that only comes with the Tour. In a tactically brilliant attack, Team SD Worx’s Marlen Reusser took the win that day. A former doctor who has been in the peloton for only three years, Reusser’s win highlighted the stories that every rider in the vast Tour de France Femmes peloton has.</span></p>\n<p><span>Two fiery sprint stages followed the drama on the gravel. One was won by Lorena Wiebes as she unleashed a Hulk-like celebration in the green jersey, and the other by Vos as she wore yellow in a stage filled with chaos and crashes.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-09701_1024x1024.jpg?v=1667828531\" alt />As stage seven rolled round, the mountains came thick and fast, and Movistar’s Van Vleuten stole the show. The 39-year-old attacked on the first climb of the day with only Vollering – who is 14 years her junior – able to hang on to her wheel. That was, at least, until 60 kilometres remained when Van Vleuten decided to go solo. She won the stage by more than three minutes and took the yellow jersey from her countrywoman, Vos.</span></p>\n<p><span>The following day on the climb up to La Super Planche des Belles Filles, Van Vleuten made a similar move. She attacked once, hard, and no one could follow. This time, she won the stage solo by thirty seconds, celebrating in the yellow jersey for the first time in her glittering career. </span></p>\n<p><span>Perhaps Van Vleuten’s victory in the overall general classification was predictable, and maybe the finale didn’t have the suspense that we’d enjoyed in the earlier stages, but there is some awe to be found in watching performances like hers. She was utterly dominant, the best in the mountains by far, and she remained focused and level-headed despite suffering from illness earlier on in the race. Van Vleuten is the type of athlete that doesn’t come around in sports very often. She was the strongest rider in the race, and for that, she deserved the honour of coming home with yellow.</span></p>\n<p><span>But, although Van Vleuten was the rider to stand on the top step of the podium at the end of the race, the Tour de France Femmes avec Zwift was about more than the winner. It was about showing the world what can be done if you simply offer women opportunities that men have. The fans loved it - they watched on television and they came to the roadsides. The media lapped up the stories that emerged from the race. All that we were left wondering was: why did this take so long?</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-02108-_3_1024x1024.jpg?v=1667828549\" alt />“We didn’t expect this, all the fans, all the media attention,” said French national champion Audrey Cordon-Ragot ahead of the penultimate stage. “People are saying my name, screaming my name.”</span></p>\n<p><span>“I think more than coming for the women, they came for the Tour,” she continued. “And that’s what we needed. People are coming for the Tour and then they discover what women’s cycling is and what we can do. Only the Tour can offer this kind of spotlight.”</span></p>\n<p><span>She rider was right. The Tour de France Femmes was hit hard, and in the best way possible, with Tour de France fever. It only took a walk around the fan zones to see this: hundreds of people came to every start and finish town to get a glimpse of the riders. People parked their cars at the bottom of the Grand Ballon climb and trekked to the top to see the riders pass hours later. Some drove their motorhomes to get a good spot on the road days before the race passed. </span></p>\n<p><span>Every town that the race came through had made an effort for the occasion. Yellow, green and polka-dot flags waved in the summer breeze, children waddled about in their oversized spotty t-shirts and vintage bicycles decorated with yellow ribbons sat by the side of the road. An old woman leaned out of her balcony window in a lemon-coloured blouse to watch the peloton ride past. France embraced the Femmes, and it made the race a bigger spectacle than any of us dared to dream of in the run-up to the event.</span></p>\n<p><span>But, although riders like Cordon-Ragot thanked the French public for their support, they really had nothing to be grateful for. The women’s peloton deserved such crowds after years of racing as hard as they could, even when there was no one watching. The stages at the Tour de France Femmes were exciting, riveting and exhilarating, like women’s cycling always has been for those who have followed it in the past, but at this race there were simply more eyes on it.</span></p>\n<p><span>All that remains is for the momentum to keep building, for the people that tuned in to enjoy every stage of the Tour de France Femmes to keep watching women’s sport, to soak it up, to get behind it the way they do the men’s equivalent. If there is one thing that both of the Tours de France last year taught us, it’s that cycling is the richest of sports. It’s rife with stories, drama and magic, and it is filled with people pushing their limits and defying expectations. It’s all of this whether it is men or women who are riding bicycles. The Tour de France Femmes has opened this beautiful sport up to even more people, and things are never going to be the same again.</span></p><div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8fb755d991cc2ad78132b04587db5b1110fe5c6fe074a265a7e9748a0f34afdc","category":"Cycling"}