{"title":"Top Announcements of AWS re:Invent 2021","link":"https://aws.amazon.com/blogs/aws/top-announcements-of-aws-reinvent-2021/","date":1638175325000,"content":"<p>Welcome to <a href=\"https://reinvent.awsevents.com/\">AWS re:Invent</a>! From Nov. 29-Dec. 3, 2021, we’ll update this page daily with the most noteworthy launches from our biggest event of the year. AWS Chief Evangelist Jeff Barr and our team of AWS developer advocates from around the globe share the news and offer helpful tips for getting started with all the latest AWS releases.</p> \n<p>More ways to learn:</p> \n<ul> \n <li><a href=\"https://aws.amazon.com/podcasts/aws-podcast/\">The Official AWS Podcast</a>: For keynote recaps each day</li> \n <li><a href=\"https://www.twitch.tv/aws\">AWS OnAir:</a> Livestreaming from the show floor</li> \n <li><a href=\"https://aws.amazon.com/about-aws/whats-new/2021/\">What’s New:</a> All 2021 AWS announcements</li> \n</ul> \n<p><em>(This post was last updated: 10:45 a.m., PST, Nov. 29, 2021.)</em></p> \n<div> \n <hr /> \n <p><a name=\"top\"></a></p> \n <div></div> Quick category links: \n <a href=\"#Architecture\">Architecture</a> | \n <a href=\"#Compute\">Compute</a> | \n <a href=\"#Containers\">Containers</a> | \n <a href=\"#Internet_of_Things\">Internet of Things</a> | \n <a href=\"#Security\">Security</a> | \n <a href=\"#Quantum_Technologies\">Quantum Technologies</a> |\n <p></p> \n <div></div> \n <div></div> \n <h2>Architecture</h2> \n <p><a href=\"https://aws.amazon.com/blogs/aws/well-architected-custom-lenses-internal-best-practices/\">Announcing AWS Well-Architected Custom Lenses: Extend the Well-Architected Framework with Your Internal Best Practices</a><br /> Custom Lenses provide a consolidated view and a consistent way to measure and improve your workloads on AWS without relying on external spreadsheets or third-party systems.</p> \n <h2>Compute</h2> \n <p><a href=\"https://aws.amazon.com/blogs/aws/new-amazon-ec2-m6a-instances-powered-by-3rd-gen-amd-epyc-processors/\">New – Amazon EC2 M6a Instances Powered By 3rd Gen AMD EPYC Processors</a><br /> Amazon EC2 M6a instances feature the 3rd Gen AMD EPYC processors, running at frequencies up to 3.6 GHz to offer up to 35 percent price performance versus the previous generation M5a instances.</p> \n <p><a href=\"https://aws.amazon.com/blogs/aws/cloudwatch-rum/\">New – Real-User Monitoring for Amazon CloudWatch</a><br /> Amazon CloudWatch helps you to build web applications that are highly scalable and highly available. The big challenge we are addressing today is monitoring those applications with the goal of understanding performance and providing an optimal experience for your end users. </p> \n <p><a href=\"https://aws.amazon.com/blogs/aws/cloudwatch-evidently/\">New – Amazon CloudWatch Evidently – Experiments and Feature Management</a><br /> This new Amazon CloudWatch capability makes it easy for developers to introduce experiments and feature management in their application code. CloudWatch Evidently may be used for two similar but distinct use-cases: implementing dark launches, also known as feature flags, and A/B testing.</p> \n <h2>Containers</h2> \n <div></div> \n <a href=\"https://aws.amazon.com/blogs/aws/announcing-pull-through-cache-repositories-for-amazon-elastic-container-registry/\">Announcing Pull Through Cache Repositories for Amazon Elastic Container Registry</a>\n <br /> Pull through cache repositories offer developers the improved performance, security, and availability of Amazon Elastic Container Registry for container images that they source from public registries.\n <p></p> \n <h2>Internet of Things</h2> \n <p><a href=\"https://aws.amazon.com/blogs/aws/new-securely-manage-your-aws-iot-greengrass-edge-devices-using-aws-systems-manager/\">New – Securely Manage Your AWS IoT Greengrass Edge Devices Using AWS Systems Manager</a><br /> Until today, IT administrators have had to build or integrate custom tools to make sure edge devices can be managed alongside EC2 and on-prem instances, through a consistent set of policies. Today, we have integrated AWS IoT Greengrass and AWS Systems Manager to simplify this process.</p> \n <div>\n  <a href=\"https://aws.amazon.com/blogs/aws/preview-aws-iot-roborunner-for-building-robot-fleet-management-applications/\">Preview – AWS IoT RoboRunner for Building Robot Fleet Management Applications</a>\n  <br /> AWS IoT RoboRunner is a new robotics service that makes it easier for enterprises to build and deploy applications that help fleets of robots work seamlessly together.\n  <p></p> \n  <h2>Security</h2> \n  <p><a href=\"https://aws.amazon.com/blogs/aws/codeguru-reviewer-secrets-detector-identify-hardcoded-secrets/\">Amazon CodeGuru Reviewer Introduces Secrets Detector to Identify Hardcoded Secrets and Secure Them with AWS Secrets Manager</a><br /> The new Amazon CodeGuru Reviewer Secrets Detector is an automated tool that helps developers detect secrets in source code or configuration files, such as passwords, API keys, SSH keys, and access tokens.</p> \n  <div></div> \n  <a href=\"https://aws.amazon.com/blogs/aws/improved-automated-vulnerability-management-for-cloud-workloads-with-a-new-amazon-inspector/\">Improved, Automated Vulnerability Management for Cloud Workloads with a New Amazon Inspector</a>\n  <br /> Amazon Inspector is a service used by organizations of all sizes to automate security assessment and management at scale. This new launch enables frictionless deployment at scale, support for an expanded set of resource types needing assessment, and a critical need to detect and remediate at speed.\n  <p></p> \n  <h2>Quantum Technologies</h2> \n  <p><a href=\"https://aws.amazon.com/blogs/aws/introducing-amazon-braket-hybrid-jobs-set-up-monitor-and-efficiently-run-hybrid-quantum-classical-workloads/\">Introducing Amazon Braket Hybrid Jobs – Set Up, Monitor, and Efficiently Run Hybrid Quantum-Classical Workloads</a><br /> With the new Amazon Braket Hybrid Jobs you can avoid extensive infrastructure and software management and confidently execute your algorithms quickly and predictably, with on-demand priority access to QPUs.</p> \n  <p><a href=\"#top\">Back to Top</a></p> \n </div> \n</div>","author":"AWS News Blog Team","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"8fb9a5c3da7b8e1bc174f3bdbc0f7280581e58d461b006bc8c37b218880faed5","category":"Tech"}