{"title":"Symbiotic fungi from a wild grass (Celtica gigantea) increase the growth, grain yield and quality of tritordeum under field conditions","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae013/7629176?rss=1","date":1710460800000,"content":"<span><div>Abstract</div>Abstract. Plants function in symbiosis with numerous microorganisms, which might contribute to their adaptation and performance. In this study, we tested whether fungal strains in symbiotic interaction with roots of <span>Celtica gigantea</span>, a wild grass adapted to nutrient-poor soils in semiarid habitats, could improve the field performance of the agricultural cereal tritordeum (<span>Triticum durum</span> × <span>Hordeum chilense</span>). Seedlings of tritordeum were inoculated with 12 different fungal strains isolated from roots of <span>Celtica gigantea</span> that were first proved to promote the growth of tritordeum plants under greenhouse conditions. The inoculated seedlings were transplanted to field plots at two locations belonging to different climatic zones in terms of mean temperatures and precipitation in the Iberian Peninsula. Only one strain, <span>Diaporthe iberica</span> T6, had a significant effect on plant height, number of tillers and grain yield in one location. This result showed a substantial divergence between the results of greenhouse and field tests. In terms of grain nutritional quality, several parameters were differentially affected at both locations: <span>Diaporthe</span> T6, <span>Pleosporales</span> T7, <span>Zygomycota</span> T29 and <span>Zygomycota</span> T80 increased the content of total carotenoids, mainly lutein, in the colder location; whereas gluten proteins increased with several treatments in the warmer location. In conclusion, early inoculation of tritordeum plants with fungal symbionts had substantial beneficial effects on subsequent plant growth and development in the field. Regarding grain nutritional quality, the effect of inoculation was affected by the agroclimatic differences between both field locations.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"8fbba34c8038ba19654276a02f5180470187a03d00d92fd6821b16db4b1e2d6d","category":"Environment"}