{"title":"Scott overhauls Speedster road and gravel alloy bikes for 2022","link":"https://cyclingtips.com/2021/08/scott-overhauls-speedster-road-and-gravel-alloy-bikes-for-2022/","date":1629956052000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-Gravel-10-650x366.jpg\" /></div><h2>Scott overhauls Speedster road and gravel alloy bikes for 2022</h2><p>\n</p><p>Scott Bikes has had a busy couple of years, having overhauled a handful of its premium ranges. On the road, the <a href=\"https://cyclingtips.com/2019/06/scott-addict-rc-2020-first-ride-review/\" target=\"_blank\">Addict RC</a> earned an aero makeover with wholly hidden cabling, and then more recently we saw similar ideas morph into the new<a href=\"https://cyclingtips.com/2021/07/2022-scott-addict-gravel-goes-longer-and-lower-with-a-slick-new-shape/\" target=\"_blank\"> Addict Gravel</a>. </p>\n\n\n\n<p>Scott has now taken a few of these design concepts and quietly trickled them all the way down to its most entry-level road and gravel bike offerings. </p>\n\n\n\n<p>Here we take a look at the new Speedster (road) and Speedster Gravel bikes. But before you run out to order one of these alloy machines, do know that parts supply shortages in the bike industry mean we won’t likely see them hit shelves until March 2022 (at least for the USA). And such a wait doesn’t seem unique to Scott, either. </p>\n\n\n\n<h2>The trickle-down effect </h2>\n\n\n\n<p>The new Scott Speedster Road and Gravel bikes may serve distinctly different purposes, but much like the premium Addict RC road and Addict Gravel bikes, these new alloy bikes still share a great number of features in common. </p>\n\n\n\n<p>Both versions of the Speedster are now disc-brake-only and feature frames with a double-butted aluminium frame construction. The frame doesn’t change based on the level of bike, but there are some differences in the forks used, with more expensive versions gaining a lighter full-carbon fork, while lower-level models use an aluminium steerer tube. </p>\n\n\n\n<p>The Road version offers clearance for up to 35 mm (measured) tyres and comes stock with 32 mm width tyres fitted. The Gravel version boasts room for a modern 45 mm tyre, and the more expensive models come stock with tyres using all of the available space. </p>\n\n\n\n<p>These frames feature an endurance-type geometry with taller stack heights and longer wheelbases compared to racier (and more expensive) models. As is traditionally the case with Scott bikes, the reach numbers across the seven sizes are typically fairly long, but shorter stems are used to balance things out. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-Gravel-bike-geometry-chart-1340x754.jpg\" /><figcaption>Scott will be offering an impressive size range for both the Speedster and Speedster Gravel. Here are the numbers belonging to the new Speedster Gravel. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-road-bike-geometry-chart-1340x754.jpg\" /><figcaption>And here are the numbers for the new Speedster (road). </figcaption></figure></li></ul></figure>\n\n\n\n<p>Perhaps the most obvious example of the trickle-down tech is the general lack of exposed cabling at the handlebar. Even the most basically equipped models offer such a feature which is surprising given the equipped mechanical disc brakes and gears. </p>\n\n\n\n<p>However, compared to their carbon brethren, these alloy models pull back slightly on just how concealed the cables actually are. The Speedster models run the cables under the bar flats (not through the handlebar) and then under the stem which earns a plastic cover to keep the cables out of the wind. This simpler approach should make future repairs or fit adjustments far less tedious. </p>\n\n\n\n<p>From the covered stem, the cables enter the front of the head tube and run internally to their respective parts. Scott’s method for concealing the cables means the fork steerer tube retains a round shape, tapering from 1 1/2″ diameter at the bottom up to a still-oversized 1 1/4″ at the top. While the bikes are designed to be used with the unique Syncros stems, owners can fit any 1 1/4″ stem (such as those offered by Zipp, Ritchey, and Giant) if they’re willing to accept messier cable routing. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/Scott-Speedster-cabling-1340x754.jpg\" /><figcaption>The new Speedster bikes use Scott’s eccentric steerer tube design that offsets the smaller top bearing back compared to the lower bearing. </figcaption></figure>\n\n\n\n<p>Those allergic to the sight of cables altogether may still want to look at more premium carbon bikes as the cables appear to exit the frame at the bottom bracket and are then run along the chainstays. </p>\n\n\n\n<p>Using a similar design to the <a href=\"https://cyclingtips.com/2021/07/2022-scott-addict-gravel-goes-longer-and-lower-with-a-slick-new-shape/\" target=\"_blank\">Addict Gravel</a>, both Road and Gravel versions feature subtle fender mounts front and rear. Scott will be offering direct-fit Gravel and Road fenders via its Syncros brand, but it’s said other popular fenders should work, too. The Speedster Gravel also offers mounts for a top tube bag. </p>\n\n\n\n<p>Other frame features include the use of a regular 27.2 mm round seatpost held by a standard seat clamp. And the frames appear to use a Press-Fit 86 bottom bracket shell – a polarising choice that quite likely aids in the generous tyre clearance on offer. </p>\n\n\n\n<h2>Speedster</h2>\n\n\n\n<p>Those wanting to stick mainly to tarmac will likely be better served by the regular Speedster. Scott will be offering it at various price points, however specific model availability will certainly depend on your region. Here’s a quick look at the range for the USA. Women’s-specific Contessa versions are listed for other regions. Pricing and availability for other regions are to be confirmed. </p>\n\n\n\n<p>The best-equipped option will sell for US$1,999 and offer a full 2×11-speed Shimano 105 drivetrain (compact crank) with hydraulic disc brakes. Scott’s own component brand Syncros takes care of the wheels and touchpoints, with Schwalbe Lugano 32 mm tyres wrapping the alloy rims. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-10-road-bike-1340x754.jpg\" /><figcaption>The 2022 Speedster 10.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-10-road-bike-1-1340x754.jpg\" /><figcaption>Another angle of the Speedster 10. Scott is clearly vibing the tanwall look.</figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-40-road-bike-1340x754.jpg\" /><figcaption>The Speedster 40. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-50-road-bike-1340x754.jpg\" /><figcaption>The cheapest of the new range is the Speedster 50. Personally at this level I’d much rather have exposed cables in exchange for better shift components. </figcaption></figure></li></ul></figure>\n\n\n\n<p>The Speedster 20 (US$1,599) offers the same frame and full carbon fork but moves to a 2×10-speed Shimano Tiagra groupset with mechanical disc brakes. The wheels and touchpoints remain unchanged from the model above. </p>\n\n\n\n<p>Saving US$100, the Speedster 30 is the same as above but with a 2×9-speed Shimano Sora groupset and cheaper mechanical disc brake callipers. Rounding out the range are the Speedster 40 (US$1,299) and Speedster 50 (US$1,099) which move to alloy fork steerers and further drop the quality of gearing with an obvious proportion of your money going into the frame and concealed cabling. The Speedster 40 is using 2×8-speed Shimano Claris, while the Speedster 50 moves to non-series 2×7-speed Shimano bits. </p>\n\n\n\n<h2>Speedster Gravel </h2>\n\n\n\n<p>While still capable of duking it out on the road, the Speedster Gravel aims to add more versatility with wider tyres, lower gearing ranges, and more stable geometry. </p>\n\n\n\n<p>The Speedster Gravel 10 is the most premium offering in the new alloy bike range across both the road and gravel categories. At US$2,799, this gravel bike offers SRAM’s new Rival XPLR AXS wireless groupset with a 10-44T cassette and hydraulic disc brakes. The 25 mm wide rims come from Syncros, as do many of the other components. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/2022-Scott-Speedster-Gravel-10-1-1340x754.jpg\" /><figcaption>The Speedster Gravel 10 is the most luxurious offering in the entire Speedster range. </figcaption></figure>\n\n\n\n<p>Spending US$1,999 gets you the Speedster Gravel 20 with the same frame and full carbon fork as above but with the move to a 2×11 Shimano GRX groupset. The Syncros wheels and components remain the same, as do the 45 mm-width Schwalbe G-One Bite Performance tyres. </p>\n\n\n\n<p>The Speedster Gravel 30 (US$1,699) has the same frame, fork, wheels, cockpit, and tyres as above but moves to a 2×10-speed version of Shimano GRX. It retains the hydraulic disc brakes. This model is available in either beige or black. </p>\n\n\n\n<p>At US$1,499 the Speedster Gravel 40 EQ appears to be more of a multi-purpose commuter option and comes equipped with full-length fenders and more road-like compact gearing. This one runs 2×10-speed Shimano Tiagra shifting with mechanical disc brakes.</p>\n\n\n\n<p>Finally, spending US$1,199 will get you the Speedster Gravel 50 which features an alloy steerer fork, a 2×8 Shimano Claris drivetrain, and mechanical disc brakes. And yep, the concealed cabling is still present here. </p>\n\n\n\n<h2>A long wait </h2>\n\n\n\n<p>The new Speedster and Speedster Gravel are bikes we’re keen on reviewing but with long lead times and stock not expected until next year it’ll be some time before we have an opinion on these newly announced bikes. </p>\n\n\n\n<p>If you’re looking for a modern all-road-style alloy bike in the meantime then it’s worth checking out bikes such as the <a href=\"https://cyclingtips.com/2021/01/trek-domane-al-disc-4-review/\" target=\"_blank\">Trek Domane Al</a>, the <a href=\"https://cyclingtips.com/2019/10/giant-contend-ar-1-2020-all-road-bike-review/\" target=\"_blank\">Giant Contend AR</a>, and the <a href=\"https://cyclingtips.com/2020/08/2021-orbea-avant-affordable-alloy-all-road-bike/\" target=\"_blank\">Orbea Avant</a>. </p>\n\n\n\n<p>More information can be found at <a href=\"https://www.scott-sports.com/us/en/en/products/bike-bikes\" target=\"_blank\">Scott-Sports.com</a>.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/scott-overhauls-speedster-road-and-gravel-alloy-bikes-for-2022/\">Read More</a>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"8fc7131c411520f0a6e774c7250963df12ecf184f517ca9f81ed878a64c13785","category":"Cycling"}