{"title":"Climate-driven coastal flooding in the US likely to get worse suddenly","link":"https://arstechnica.com/?p=1775463","date":1624404058000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/FullMoon_CROPPED.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/FullMoon_CROPPED.jpeg\">Enlarge</a> </p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Our warming planet is melting lots of ice and heating the waters of the oceans, creating a clear trend of rising oceans. In some areas of the US, this is starting to cause what's called <a href=\"https://arstechnica.com/science/2014/07/sea-level-rise-causing-huge-increases-in-nuisance-flooding/\">nuisance flooding</a>, where high tides cause coastal flooding even in the absence of storms. As the oceans continue to rise, figuring out what areas are likely to become vulnerable to coastal flooding and when is going to be critical to understanding how to manage coastal development.</p>\n<p>Figuring out coastal development is complicated. The rate of sea level rise can vary from year to year, the local ocean levels can vary as the land settles or rises, and the pace of sea level rise is increasing. And now, a team of researchers has quantified an additional factor: regular variations in the Moon's orbit, which influence the levels reached by high tide. The team goes on to show that these changes can suppress the impact of rising seas for a time but can then contribute to a rapid increase in floods.</p>\n<h2>Cycling the Moon</h2>\n<p>The plane of the Moon's orbit isn't located exactly at the equator; instead, it's tilted slightly. That means, for part of its orbit, the Moon is orbiting above the Northern Hemisphere, and for the other part, it's over the Southern Hemisphere. The locations in its orbit where the Moon crosses between the two hemispheres are called <a href=\"https://en.wikipedia.org/wiki/Lunar_node\">nodes</a>, and these shift over time. It takes a bit over 18 years for a node to complete an orbit around the Earth.</p></div><p><a href=\"https://arstechnica.com/?p=1775463#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775463&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8fcc32c81d5ce24d6dc3f48982cd18b3b1d3745668a0fd1c547b6b06a008a4ff","category":"Tech"}