{"title":"Causal effect of porphyria biomarkers on alcohol-related hepatocellular carcinoma through Mendelian Randomization","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299536","date":1710943200000,"content":"<p>by Xiaoyu Yang, Shuomin Wang, Chen Sun, Yunhong Xia</p>\r\nPurpose <p>According to some cohort studies, an association exists between acute intermittent porphyria (AIP) and liver cancer. However, establishing a definitive causal relationship between porphyria and hepatocellular carcinoma (HCC) remains challenging. Prexisting studies regarding porphyria biomarkers and alcohol-related hepatocellular carcinoma (AR-HCC) make possible an entry point. In this study, we aimed to investigate the causal relationships between biomarkers of two types of porphyria, AIP and congenital erythropoietic porphyria (CEP), and AR-HCC.</p> Methods <p>Single-nucleotide polymorphisms (SNPs) associated with porphobilinogen deaminase (PBGD) and uroporphyrinogen-III synthase (UROS), along with outcome data on AR-HCC, were extracted from public genome-wide association studies (GWAS). The GWAS data were then used to explore the potential causal relationships via a two-sample Mendelian randomization (MR) analysis. The effect estimates were calculated using the random-effect inverse-variance-weighted (IVW) method. Additionally, the Cochrane’s Q test, MR-Egger test, and leave-one-out analysis were conducted to detect heterogeneity and pleiotropy in the MR results.</p> Results <p>Using the IVW method as the primary causal effects model in the MR analyses, we found that both PBGD (effect estimate = 1.51; 95% CI, from 1.08 to 2.11, p = 0.016) and UROS (effect estimate = 1.53; 95% CI, from 1.08 to 2.18, p = 0.018) have a significant causal effect on AR-HCC.</p> Conclusion <p>Our findings revealed a causal effect of both PBGD and UROS on AR-HCC, suggesting that both AIP and CEP have a causal association with AR-HCC.</p>","author":"Xiaoyu Yang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"8fe98ea67d6e10ce6838fe347b57b4069c5f7164155331b49ac0943b6eac4921","category":"Interdisciplinary"}