{"title":"PSXIII-27 Effects of long-term dietary supplementation of nitrate on enteric methane production and performance of Hanwoo steers","link":"https://academic.oup.com/jas/article/102/Supplement_3/794/7757760?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Nitrate (NO<sub>3</sub><sup>-</sup>) has been recognized as an effective dietary additive to reduce enteric methane (CH<sub>4</sub>) production in ruminants. Two experiments were performed to evaluate the effects of long-term supplementation and method of supplementing calcium ammonium nitrate (CAN) on enteric CH<sub>4</sub> production in Hanwoo steers. In Exp. 1, Hanwoo steers [n = 20; body weight (BW) = 348 ± 18 kg] were divided into two groups of 10, and were assigned to one of the two diets 1) CON, 500 g/kg timothy hay and 500 g/kg commercial concentrate, or 2) CAN, basal diet top-dressed with 2.5% CAN [1.578% NO<sub>3</sub><sup>-</sup> in the dietary dry matter (DM)] for 115 d in a completely randomized design. Measurement of CH<sub>4</sub> was performed for 3 d starting from d 21, d 51, d 80 and d 112 using whole body respiratory chambers (RC). Rumen fluid and blood samples were collected on d 25 and d 26 of the feeding trial, respectively. In Exp. 2, the animals were re-grouped (476 ± 21 kg) and fed the same basal diet supplemented with 2.0% CAN (1.262% NO<sub>3</sub><sup>-</sup> in the dietary DM) incorporated in the concentrate pellet (P-CAN). Methane was measured on d 19 and d 45 for 3 d. In Exp. 1, CAN supplementation decreased (<span>P</span> &lt; 0.05) DM intake (DMI) of the steers both in the barn and RC. However, no negative effects on average daily gain or feed conversion ratio were observed. Also, no potential toxicity of NO<sub>3</sub><sup>-</sup> was observed based on blood methemoglobin concentrations (all samples &lt; 2.5% of total hemoglobin). A decrease (<span>P</span> &lt; 0.05) in CH<sub>4</sub> production (g/d) caused by decreased DMI was noted in CAN throughout the feeding trial. However, CH<sub>4</sub> yield (g/kg DMI) decreased (<span>P</span> &lt; 0.05) only in the beginning phase (d 21) and did not differ (<span>P</span> &gt; 0.05) thereafter. Ruminal pH, ammonia and total volatile fatty acid concentration did not differ between treatments (<span>P</span> &gt; 0.05), but CAN increased and decreased (<span>P</span> &lt; 0.0001) acetate and butyrate proportions, respectively. Steers fed CAN had greater ruminal abundance of <span>Ruminococcus sp.</span> (<span>P</span> &lt; 0.05), <span>Succiniclasticum</span> (<span>P</span> = 0.066), and <span>Selenomonas ruminantium</span> (<span>P</span> = 0.073), but a reduced (<span>P</span> &lt; 0.05) abundance of <span>Methanobrevibacter ruminantium</span> (<span>P</span> = 0.073). In Exp. 2, P-CAN did not exert any effects on DMI, CH<sub>4</sub> production, CH<sub>4</sub> yield and other production parameters. Overall, CAN can be used as a feed additive for beef cattle in the long-term without NO<sub>3</sub><sup>-</sup> intoxication or any negative effects on growth performance. However, lack of persistent decrease in CH<sub>4</sub> yield suggested the need of further evaluation of CAN under different dietary conditions. Furthermore, incorporating CAN in the concentrate pellet can be a suitable approach, since top-dressing may alter the organoleptic properties of diets that may reduce DMI of the steers.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"8feb4038f32619bd491a2e016a00a75cb30bf343038f06d388b7c441ddcefc3c","category":"Environment"}