{"title":"Cycling’s #MeToo moment","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/cycling-s-metoo-moment-part-one","date":1612368296000,"content":"\n      <figure class=\"wp-block-image\"><a href=\"https://journal.rouleur.cc/subscribe/\"></a></figure>\n<p><em>This article was originally published in 2019. Some names have been changed to protect their identity.</em></p>\n<p><strong>Lying on the massage table after her first UCI stage race, everything still felt unreal to “Rosa”. She should have been spending that spring studying alongside her high school friends back home, preparing for one of the seminal moments in a North American teenager’s life, graduation. Instead, she had one hand on her dream and one foot in the professional peloton, fitting studies around a first season racing in Europe.</strong></p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>Having been spotted while riding for her national team the year before, Rosa was racing with the development squad of a Women’s WorldTour team. Far from home, far from her parents, it was an opportunity to prove she had what it took to make it at the top level of the sport. Now, after her first day competing in a top European junior stage race, she was preparing for one of the professional luxuries she had yet to become accustomed to, the post-race massage.</p>\n<p>The bubble quickly burst. “His hands went way up,” says Rosa, describing the massage. “I was wearing underwear but he touched up there. I was on a team of 16 and 17 year olds and he would brush along the whole length of our vaginas with his thumb, as he ran his hands up our legs.”</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/people-will-say-whens-the-mens-issue-then-orla-chennaoui-on-editing-rouleur-s-women-s-issue\"><strong><em>Related – People will say \"when's the men's issue, then?\": Orla Chennaoui on Rouleur's women's issue</em></strong></a></p>\n<p>At first, Rosa simply didn’t know what to do. “I was thinking maybe it was a mistake and maybe he didn’t mean to run that high. I was naïve. I was excited to be over in Europe racing. A part of me at that stage wasn’t sure if that was a normal occurrence because I’d never really worked with a team whose soigneur gave massage.”</p>\n<p class=\"wp-block-image\">As the only English speaker on a team of Belgian and Dutch girls, communication with the other riders was limited. “I remember having a brief discussion with one of them, saying that massage was really weird, that it went really high,” she says. “Then it would just become through looks and whatnot. It became more of an unspoken thing. We wouldn’t be alone with him.”</p>\n<p>The nature of the massages continued for the duration of the race and seemingly without fear of recrimination: “He would give massages like that even though we’d all be in the room together.” The soigneur also began sending text messages to Rosa in the evenings, adding to her discomfort. “We would all eat together in this dining hall and he would start taking pictures of me across the table and messaging them to me, which was really weird.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Cycling_s_MeToo_moment_title_2_1024x1024.jpg?v=1612369761\" alt=\"\"></p>\n<p>“He would message me in the evening, from their house, and say things like, ‘oh I wish I could come back home with you and be your personal soigneur.’</p>\n<p>“I just wasn’t sure at this point what to do. I was being polite and answering him because I thought, if I make things weird, he’s in charge of nutrition, he’s in charge of massage, our success in the race depends on him.</p>\n<p>“By the end of the tour, I was just disgusted and put up a block. If he puts a hand on your back, you try to ignore it mentally. I thought maybe this is just what it has to be when you’re racing over here. Maybe they are more cosy and touchy over in Europe, who knows? I never had any experience of sexual assault in the past so didn’t really know how to compare it.”</p>\n<p>Rosa did, however, complain to team management when she went back to North America after the race. While not feeling ready to specifically address the physical sexual assault, she had hoped that flagging her discomfort over the nature of the text messages and the general demeanour of the soigneur would suffice. But the team directors brushed it off.</p>\n<p>“Sending those messages, I was scared. I thought, what if it’s really nothing? What if I lose my spot on the team? How bad would it be to keep it a secret? But talking to my parents we just decided that no, we had to tell the team. I wasn’t going to be there for a couple of months while I graduated from high school, so for the other riders who were going to be there for those months, I had to tell them. I was quite shocked that they dismissed something like that. I was shocked that a professional women’s team wouldn’t take that seriously. It just didn’t seem right.”</p>\n<p>The soigneur in question was eventually sacked from the team, but only after a complaint from the elite squad, and not before Rosa was instructed she would have to live in the same house as him when she came back to Europe to race after graduation.</p>\n<p>“I was freaking out. I wasn’t sure what to do,” she says. “My aim was to get there and address it in person.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_2271-3_e3151625-66fc-426d-ad86-84b28e1644c2_1024x1024.jpg?v=1612367738\" alt=\"\"> </p>\n<p>When she landed, Rosa was informed that the soigneur had finally been dismissed. Rosa doesn’t know if the complaints from the senior team were of a similar nature: “It annoyed me that they didn’t take me seriously and the word of the elite rider was more valid than mine – more of an excuse to fire him.”</p>\n<p>Rosa’s story is not only deeply disturbing, but appears to speak of a wider problem within women’s cycling.</p>\n<p>While researching this article, I was told of an atmosphere on several second-tier teams which, if not permissive of sexual harassment and power abuse, at the very least seem to turn a blind eye to it. I have also been told concerns from the WorldTour that the problem could be more widespread than is suspected.</p>\n<p>Stories of abuse in cycling are nothing new. In 2018, a report by the Dutch Cycling Federation found that more than a quarter of top female Dutch riders said they had felt unsafe in the sport. Some 13 per cent said they had been on the receiving end of inappropriate sexual behaviour, including “touching” and comments.</p>\n<p>Until now, victims of abuse in the sport – be it sexual, verbal or otherwise – have tended to stay silent. The innately secretive nature of the issue is compounded by the fact that jobs and livelihoods are at stake, and there can be confusion over where the boundaries of power and personal relationships lie. Speaking out isn’t easy.</p>\n<p>Sara Mustonen is one of the few women prepared to go public on the issue. She has lost her job, her spot on a team, and is being threatened with legal action after cutting ties with her manager Patrick Van Gansen of Health Mate Ladies Team mid-season, and speaking up about the verbal abuse she and others on the team say they endured. [Since the time of initial writing, Van Gansen was found <a href=\"https://www.uci.org/inside-uci/press-releases/uci-statement-on-the-health-mate---ladies-team-procedure\" target=\"_blank\" rel=\"noopener noreferrer\">guilty of violation of the UCI code</a> of ethics by the UCI by the UCI Ethics Commission]. </p>\n<p>Mustonen is one of three riders on the team to have filed an official complaint with the UCI Ethics Commission about Van Gansen. It centres around the UCI Code of Ethics: Appendix 1 that covers protection of physical and mental integrity – sexual harassment and abuse. Since then, six former riders have corroborated Mustonen’s accusations, which include verbal aggression and sexually inappropriate remarks.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_1564_1024x1024.jpg?v=1612367783\" alt=\"\"></p>\n<p>“There was one situation where we were sitting at the lunch table. There was me, Patrick and at least two other riders. Excuse my language but he was talking about a rider on another team, saying ‘if I wanted to, I could fuck her.’ He was laughing, saying ‘maybe if it’s been too long [since he’s had sex] then maybe I will go there.’ I was just looking at him in disbelief like, why would you say something like that? What can you say? Everybody goes quiet and you ignore it, you know?”</p>\n<p>On another occasion, Mustonen claims she was the direct subject of Van Gansen’s inappropriate attention. “We were at a team presentation where I was changing my jersey in front of him and the team. He said, ‘oh yeah, that’s what I wanted to see [referring to Mustonen not wearing a top], now your contract is secure for next year.’</p>\n<p>“I felt uncomfortable but I didn’t take it seriously because I don’t really care about him. It’s beneath me. If it was only me and what happened to me, then I wouldn’t have cared about it, but it’s a much bigger story and it’s not only about me. I need to set an example, like this is not okay behaviour, this is not a professional environment and this has nothing to do with professional cycling.”</p>\n<p>Van Gansen is reported to have referred in his written defence to the UCI about a “love story” with one of the complainants. </p>\n<p><a href=\"https://www.rouleur.cc/pages/subscribe\"><em><strong>Subscribe to receive Rouleur's women-specific issue</strong></em></a></p>\n<p>Mustonen believes that the team manager–rider relationship has crossed professional boundaries on several occasions. “To me, it’s obvious these riders don’t have the results. They don’t have any other team. He is giving them the chance to earn money working for the team and then also get the opportunity to be a professional rider as such, but most of these girls, I don’t think they even realise that the team is not professional. He’s feeding off that.”</p>\n<p>Liz Hatch Fenn believes Van Gansen has a modus operandi when it comes to developing relationships with his riders. She rode on the team in 2013 when Van Gansen was the sponsor rather than team manager, holding the purse strings, and paying Hatch Fenn a direct salary, rather than one from the team. When she rejected Van Gansen’s advances, she was forced to leave.</p>\n<p>“When I started he would do many ‘nice’ things and just give me a kiss on the cheek or a hug here or there,” Hatch Fenn says. “It was boundary-crossing, and I felt he expected me to repay the kindness, which of course I never did.</p>\n<p>“For example, the team didn’t have enough money to pay me so he paid me personally. I had a team car, I had an apartment. He used to come to my house and pick me up in his campervan – he didn’t do that to the others. I thought someone is finally giving me an opportunity here. I felt like he was giving me a chance and could recognise my possible success. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_1819_1024x1024.jpg?v=1612367828\" alt=\"\"></p>\n<p>“I started to realise this was something different and attempted to appease him by being as professional as possible. I can’t pinpoint the exact incidents six years on. It was more a build-up of moments. He was possessive over me.</p>\n<p>“We used to have a regular dinner meeting. I would go over to his house. Sometimes his son would be there. A handful of times he would suggest going to Antwerp. When I realised it was something different, I started extricating myself from that.</p>\n<p>“I told him I’m not here to have anything other than a professional relationship. I said I don’t mind being friendly, but it descended into anger. Every advance being rebuffed ended with him being angry at you with something that had nothing to do with it. It was so uncomfortable.</p>\n<p>“He involved himself so much in my racing it was difficult to extract myself. Also, my apartment was being paid. How do you tell someone you don’t want the relationship but you don’t want to lose that bit? He attempted to kick me out of my apartment, took the team car off me and tried to not pay me.</p>\n<p>“When I read the stories [about the riders who’d filed complaints with the UCI EthicsCommission] it was a complete flashback, and was word-for-word what happened to me.”</p>\n<p>Van Gansen has strongly denied all the accusations and is threatening legal action against the riders in question. In a personal statement published on the Health Mate Ladies Team website, Van Gansen claimed the accusations were motivated by bitterness, “frustrated riders who want to blame their own failures on someone else.”</p>\n<p>At the time of writing, the case at the UCI Ethics Commission was still ongoing, and it remains nigh-on impossible to know from the outside just how isolated, or representative, any of these cases are of a wider malaise in the sport.</p>\n<p>When I asked “Laura”, a former rider who has worked in the sport all her adult life, whether there was a need for cycling to have a #MeToo moment, she told me: “Of course there is. For anyone to say there isn’t would be a lie. And the reason we don’t say anything is because we’re afraid we won’t get jobs, and we’re afraid we won’t get paid.”</p>\n<p>Laura now works as a soigneur and has suffered harassment at the hands of a fellow soigneur: “This one moment in my life last year, I was going through a really hard time, and this predator felt he could say these disgusting things to me. </p>\n<p>“There was once, I was in the feed zone and I had on this little tank top and he said, ‘Oh your nipples, they look so nice when they get wet. If I can get your t-shirt wet, your nipples pop.’ He said this in front of another soigneur. She wanted to say ‘What the hell are you saying?’ but we were both just shocked. </p>\n<p>“It got even worse. At the Tour of Utah last year, it was just him and me walking to the RV and he says ‘Oh, you look all sweaty, how would you like me to make you wet down there? I could make your pussy wet.’</p>\n<p>“I didn’t say anything and it was wrong. When I started feeling stronger and better and back to myself, I was like, what was I thinking? Why didn’t I just slap him in the face?</p>\n<p>“I was afraid to say something because I was afraid for my job and I was afraid how the manager was going to react.</p>\n<p>“I’ve been such a strong personality. However, everybody goes through struggles in life, and I feel like predators know when you’re struggling. If you’re a young professional and you want to make it and this is your dream… I’ve heard so many stories that are just disgusting now that I’m on this side, but they’re afraid to say anything because they want to do it [be a cyclist].” </p>\n<p>Laura has also heard stories of sex being traded for contracts. “I’ve heard from some girls on my team about directors who get [riders on other teams] to have sex with them so that they can stay on the team.</p>\n<p>“I’m putting my ass on the line right now. I could be blackballed in the sport for talking about it, but I don’t care. I’ve seen everything. I’m tired. I am tired of these guys thinking she just needs to shut up because this is the way it is, because I’m a woman in our sport.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_2854-2_1_1024x1024.jpg?v=1612367943\" alt=\"\"></p>\n<p>There is no doubt that the professionalism of women’s cycling has improved the sport from the top down in the past few years. The most shocking cases I have come across for this article have involved second-tier teams, rather than those in the Women’s WorldTour. Arguably though, this is where riders are most vulnerable – desperate to fulfil their dreams without the top results which can serve as protection.</p>\n<p>Even in the Women’s WorldTour, concerns aren’t always taken as seriously as they should be. One rider told me the lengths she and her team-mates had to go to in order to avoid sharing accommodation with a male mechanic at a race. The man in question was supposed to share a bedroom with a female soigneur and communal space, including a bathroom, with the female riders.</p>\n<p>“We said we weren’t comfortable and the team wasn’t really going to do anything about it. They said ‘can’t you make do?’ We said no and we booked a hotel ourselves for the mechanic. All of us girls were paying for it. We were all uncomfortable. After we had booked this hotel room, the owner of the team then saw it was really serious. They remedied the situation and now they always book separate accommodation.”</p>\n<p>Taking action where riders feel unease must surely be the distinguishing difference between a well-meaning and a more sinister team management. While there is plenty of the former, it is only by finding riders who are both willing to speak out and cognisant of what constitutes inappropriate behaviour that we can start to have any sense of the scale of the problem.</p>\n<p>Iris Slappendel co-runs The Cyclists’ Alliance, an organisation which appears to have done more to push progress in the sport than any other since it was launched in December 2017. Despite regularly speaking to, and hearing from, riders about their current grievances, even she has been surprised by what she has recently learned.</p>\n<p>“When you called me in April, you asked: ‘Is this something that happens more?’ I was a bit like, this is quite exceptional. But I think I’ve changed my opinion. I’m surprised. [The Health Mate case] has prompted other riders to come forward. We have also received a few emails from people in another team.” The Cyclists’ Alliance has been supporting and advising any rider or staff member who they have spoken to about the ongoing cases, but even they say it’s hard to put a number on the problem.</p>\n<p>“The bad culture of the sport is that we pretend this is not part of it, or we have the opinion that you have to toughen up or not take it personally. That’s pretty shocking to me,” she says. “I think a lot of riders have had some kind of uncomfortable experience. I guess that, like with the Me Too thing, it’s maybe something every woman has experienced.”</p>\n<p>And therein lies the very crux of the problem. In isolation, any given incident may appear shocking. In societal context, it can often feel like something women are simply expected to put up with. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/180810_Vargarda_2687_1024x1024.jpg?v=1612367970\" alt=\"\"></p>\n<p>I myself have twice been groped by directeur sportifs some years older. On both occasions the men in question seemed to think of it as harmless fun. I didn’t. It still amazes me that what is, after all, physical sexual assault, can be framed in any way as “banter”. As with every woman I spoke to for this article, you question yourself almost as much as the man involved. As Liz Hatch Fenn said: “You self-reflect, did I do something wrong?” What did I do to allow him to think that was okay? Am I being prudish? In my experience, I was still fairly new to the sport and had to ask, was it worth causing a fuss when women everywhere simply put up with this kind of behaviour, and always have?”</p>\n<p>“I think for us at the moment it’s a top priority to educate on this. We need to be more proactive,” says Slappendel. “We need to work with the UCI to tackle this globally if the problem is as serious as we think. We need to look for solutions or at least make it easier for people to address it, and I think that’s not just riders, but journalists or female members of staff.”</p>\n<p>Slappendel says she is planning an extensive survey among The Cyclists’ Alliance members to try to gauge the scale and extent of the problem. She is also calling on the UCI to lead an independent investigation.</p>\n<p>“What I’ve tried to make the UCI comprehend is that, in my opinion, I understand it takes some time, and I understand there needs to be a very thorough investigation, but there would not be a lot of trust from the riders in this commission if nothing came of these cases.”</p>\n<p>Trust is, of course, crucial when it comes to tackling this problem; trust that those affected can speak out safely, that their concerns will be taken seriously, but also that staff and volunteers have been properly vetted.</p>\n<p>Rosa’s soigneur, who was eventually dismissed because of a complaint from an elite rider, is still working in professional cycling. She believes an embarrassment at allowing the abuse on her squad to happen meant her management didn’t make clear to other prospective employers the reason for his removal.</p>\n<p>Similarly the Dutch Cycling Federation report may have created headlines at the time but, according to Slappendel, it has not resulted in follow-up action.</p>\n<p>Encouraging victims to speak out will only succeed if consequences are seen to result. Otherwise, those suffering become victims twice over – from the original abuse, and the potential repercussions from having dared to publicly defend themselves.</p>\n<p>While The Cyclists’ Alliance is already starting to affect significant improvements in the state of women’s cycling, there has to be greater change from within the sport.</p>\n<p>Society, thankfully, is finally evolving. What has been acceptable since the dawn of time, is no longer so. Cycling will have to keep pace with that societal change. Standing on the wrong side of history cannot be an option.</p>\n<p><em>*Some names have been changed to protect their identity</em></p>\n<p><strong>Any rider, whether they are a member of The Cyclists’ Alliance or not, can contact the association if they are experiencing abuse within the sport. As is the case with the UCI Ethics Commission, for purposes of confidentiality, any discussions surrounding such cases will remain confidential. Contact: </strong><a href=\"mailto:%20iris.slappendel@cyclistsalliance.org\">iris.slappendel@cyclistsalliance.org</a></p>\n<div class=\"klaviyo-form-T7axNG\"></div>\n    ","author":"Alison McCarthy","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"8fec5e6bb05162e94ef20d5a8be8b7a0f57d1c4d533a139e2f0fbda038e282d1","category":"Cycling"}