{"title":"Starship flight attempt on schedule for Tuesday afternoon","link":"https://arstechnica.com/?p=1762199","date":1620137598000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/eE9S6uZc-800x531.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/eE9S6uZc.jpeg\">Enlarge</a> <span>/</span> Beneath the South Texas clouds, SN11, the predecessor to SN15, met an unhappy fate just before it attempted a soft landing. (credit: Trevor Mahlmann)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The vehicle is ready, its paperwork is in order, and weather conditions should be reasonably good in south Texas Tuesday. All of this points toward SpaceX attempting to launch its newest Starship prototype—SN15—later this afternoon.</p>\n<p>Local officials have authorized a road closure from noon (17:00 UTC) on Tuesday through 8 pm local time (01:00 UTC Wednesday). The end of this closure coincides with sunset at the launch site, which will come shortly after 8 pm. In addition, in its <a href=\"https://twitter.com/SciGuySpace/status/1389545119280418816\">daily operations plan</a>, the Federal Aviation Administration confirmed that the launch is scheduled for Tuesday.</p>\n<p>This is an important mission for SpaceX. Already, as part of this experimental test campaign, SpaceX has lost four full-scale Starship prototypes—SN8, SN9, SN10, and SN11—in flights since December. Just one of these four vehicles has made a soft landing, <a href=\"https://arstechnica.com/science/2021/03/starship-goes-up-starship-goes-down-but-is-the-program-moving-forward/\">SN10 in early March</a>, but due to a fuel line problem, it exploded about 10 minutes after touchdown.</p></div><p><a href=\"https://arstechnica.com/?p=1762199#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762199&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"8ff24740930580631eca8988d44e7fba4bc4c15431199e5a16dc1f65db6bcb14","category":"Tech"}