{"title":"Will it rain at Paris-Roubaix 2021?","link":"https://www.cyclist.co.uk/news/10138/paris-roubaix-weather","date":1632836155000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>28 Sep 2021</span></div>    </div></div><p>\nThe spectre of wet cobbles looms over Paris-Roubaix Femmes and Paris-Roubaix races this weekend</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2019/04/ofs_paris-roubaix_110481.jpg?itok=c5Xko03-\" />  </div>\n<div>\n      <p> The forecasts are in and yes, it's going to rain this weekend at Paris-Roubaix Femmes and <a href=\"https://www.cyclist.co.uk/in-depth/1015/paris-roubaix-all-you-need-to-know\" target=\"_blank\">Paris-Roubaix</a>.</p>\n<p>When it comes to rain and Roubaix, cycling fans seem to either live for the prospect or pray to the weather gods in order to avoid it. Whichever camp you fall into, and I happen to be in the latter, the weather for the weekend is looking decidedly like rain with a chance of crashes.</p>\n<p>Météo France is predicting rain ahead of both the inaugural edition of Paris-Roubaix Femmes on Saturday and the men’s Paris-Roubaix on Sunday. The BBC is also expecting light rain and a moderate breeze on both days.</p>\n<p>Compared to the other cobbled Classics on the calendar, Paris-Roubaix has a unique flavour and is wrapped up in its own history and legacy. <a href=\"https://www.cyclist.co.uk/in-depth/3783/cyclist-guide-to-wet-weather-riding\" target=\"_blank\">Riding in the rain</a> isn't easy at the best of times but in a race that inflicts extortionate levels of suffering on those who dare to participate, the weather has the potential to ratchet up the drama still further – not for nothing is Paris-Roubaix's nickname <em>L’Enfer du Nord – </em>The Hell of the North.</p>\n<p>Cobbles lie in wait, jutting out at every angle and protruding from the road in a scattered formation. Crashes and punctures are distributed through the field indiscriminately. Who on earth finds this fun? Well… who wouldn’t? Sure, smooth roads are nice. But cobbles seem to bestow as much joy to cyclists as a child on Christmas morning.</p>\n<p>On the flipside, rain and cobbles can be a highly dangerous mix. Combine that with a race parcours as punishing as Paris-Roubaix and you have the prospect of riders slipping and sliding all the way to the velodrome – if they're lucky enough to stay upright and on their bikes that long.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/1015/paris-roubaix-all-you-need-to-know\">Paris-Roubaix 2021: Route, start list and all you need to know</a></div>      <div><a href=\"/in-depth/6300/photo-essay-the-brutal-reality-of-paris-roubaix\">Photo Essay: The brutal reality of Paris-Roubaix </a></div>      <div><a href=\"/buying-guides/677/gifts-for-cyclists\">Best gifts for cyclists: presents for the cyclist in your life</a></div>    </div></div><p>\nThat said, there hasn’t been a truly rainy edition of Paris-Roubaix since 2002, when Johan Museeuw won solo by three minutes over Steffen Wesemann, crossing the line caked in mud and dirt. Aside from 19 years ago, we also witnessed rain and cobbles collide at the 2014 Tour de France where they wreaked havoc throughout the peloton.</p>\n<p>A rainy Roubaix is like setting a cat amongst the pigeons, and that’s exactly where its appeal lies – in its totally arbitrary influence on the race. Consider that nobody in today's peloton will have raced a wet Paris-Roubaix and the prospect only becomes more tantalising.</p>\n<p>Switching it up in 2021 certainly seems like a fun prospect for the fans (or those watching on TV, at least), as long as it doesn’t come at the expense of serious accident or injury for any of the riders racing. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"8ff5a9a816d7d19456187bdc8c506719684efa9a57d24b2b94fd58227da11bf6","category":"Cycling"}