{"title":"Intelligent Fault Diagnosis using Deep Learning Algorithms: A Comparative Analysis of MLP, CNN, RNN and LSTM","link":"https://www.preprints.org/manuscript/202409.1197/v1","date":1726542839000,"content":"Health management in industrial systems is more critical in maintenance management and it plays an important role in productivity, fault diagnosis, safety, efficiency, and economy in manufacturing industries. Early detection of faults in machinery may increase the effectiveness of maintenance actions and will avoid unwanted consequences in process operations and maintenance. Existing fault diagnosis methods have limitations such as insufficient accuracy, slow detection rate, and handling large and complex data sets. In this digital age, Industry 4.0 techniques have been applied across all fields, including the condition monitoring of machines. This research addresses the gaps in traditional fault diagnosis by using deep learning, a modern AI technique effective for diagnosing faults in various machines. Deep learning algorithms Multilayer Perceptron (MLP), Coevolutionary Neural Network (CNN), and Recurrent Neural Network (RNN) with Long Short-Term Memory (LSTM) are tested for fault diagnosis using vibration datasets collected from Spectra Quest Machinery Fault Simulator (SQMFS).  In this research work, NI-DAQ (National Instruments- Data Acquisition) system, accelerometer, and LabVIEW software are used to collect vibration signals. Preprocessing of the signals has been done using a sampling strategy, shuffling, standardization, and reshaping data augmentation.  The result shows that MLP accuracy in the prediction of fault is 0.9, CNN reached 0.95, and RNN and LSTM with 0.57 and 0.45 respectively. The high performance of CNN is due to its ability to effectively capture spatial patterns in vibration data which is crucial for fault diagnosis in rotating machinery followed by MLP due to its faster convergence during training. However, when scaling the data, MLP outperformed CNN, demonstrating superior adaptability to increased data complexity and volume. Due to the need for larger datasets and temporal patterns in the vibration data, which RNN and LSTM are designed to handle, they resulted in a lower accuracy. This study shows that CNN has given better results than other deep learning algorithms MLP, RNN, and LSTM in fault diagnosis of rotating machinery. Future research could explore the application of these techniques to different types of machinery and fault conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"90016d74d2c253ff556fa58f7a998e2ed7be9da37dd0c9c8312a17b8e662dd59","category":"Interdisciplinary"}