{"title":"Why Romain Bardet and Team DSM Is an Unlikely Success Story","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/why-romain-bardet-and-team-dsm-just-works","date":1634813920000,"content":"\n      <p><span>In recent years, Team DSM have</span><span> developed a knack of spotting and recruiting some of the brightest talents in world cycling. However, they have seemingly developed an equally strong reputation for letting those riders leave, sometimes before their contracts are due to expire. </span></p>\n<p><span>Michael Storer, Lennard Kämna and Marc Hirschi are just three riders who have won WorldTour races, yet have left the team for pastures new before they turn 25. Tom Dumoulin, Wilco Kelderman and Michael Matthews are other, more experienced riders who have also moved on.</span></p>\n<div></div>\n<p><span>One of their latest, apparently unresolved disputes is with Ilan Van Wilder. The 21-year-old displayed promise aplenty at the Tour de Suisse and </span>Critérium du Dauphiné this season<span>, but was not selected for the Vuelta a <span>España </span>later in the year. The Belgian took to Instagram to share his views, “Tomorrow was supposed to be my Grand Tour debut but that has been taken away from me... I can't explain how disappointed I am and how down I have been feeling for weeks.” </span></p>\n<p><span>He then added, “One thing is for sure: I will try to get my pleasure and motivation back of riding a bike and hopefully I can do this from next year in a fresh new environment. I'll be back.”</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_9957-min_1024x1024.jpg?v=1634742451\" />Marc Hirschi impressed for Team Sunweb (now Team DSM) at the 2020 Tour de France, but left for UAE Team Emirates in 2021 (Image credit: </span></i><i><span>Alex Whitehead/SWpix</span></i><i><span>)</span></i></p>\n<p><span>But why are promising riders choosing to leave Team DSM? Head trainer Rudi Kemna</span><span> discussed the situation with </span><a href=\"https://www.wielerflits.nl/nieuws/team-dsm-bijt-van-zich-af-onze-manier-van-werken-is-de-toekomst/\" target=\"_blank\"><span>Wielerflits</span></a><span> in August. When pressed on the matter, Kemna said, “</span><span>The rumours you're talking about are mostly about internal stuff. Things that don't have to come out. And of course, we will not immediately respond to that in the media. One of our keywords is '</span><span>cooperation</span><span>'. Respect is an important pillar in this. We therefore expect our employees and riders not to share certain 'issues' with the media.</span><span>”</span></p>\n<p><span>Kemna used the word ”cooperation” regularly throughout his interview when describing Team DSM's philosophy. He explained that the team as a collective comes above any given individual.  </span></p>\n<p><span>So, where does Romain Bardet come into all of this? </span></p>\n<p><span>Well, the Team DSM approach may not suit all riders, but their setup closely caters to the Frenchman's requirements at this stage in his career.</span><span> </span></p>\n<p><b><i>See Romain Bardet at </i></b><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><b><i>Rouleur Live</i></b></a> <em><strong>2021.</strong></em></p>\n<p><span>Before 2021, Bardet had spent his entire professional career with AG2R La Mondiale. As a prominent climber and stage racer, this left him — a Frenchman, riding for a French team — chasing the yellow jersey at the Tour de France more often than not. After starting his first Tour de France in 2013, Bardet was sent to his home Tour every single year with the French team, only starting a different Grand Tour once in the same period (the 2017 </span>Vuelta a España<span>).</span></p>\n<p><span>Bardet was always the focal point for AG2R, even from an early age. The likes of Mikaël Cherel, Jan Bakelants and Ben Gastauer arrived at the Tour de France year after year, where their main purpose was to assist Romain wherever possible. It wasn’t in vain, either. Bardet achieved a top ten finish in his second Tour de France at the age of 23. Two years later, he earned his first GC podium when he was runner up to Chris Froome, before finishing on the podium again in 2017.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/SW1_7328-min_1024x1024.jpg?v=1634742430\" />Bardet won three stages of the Tour de France with AG2R La Mondiale (Image credit: </span></i><i><span>Simon Wilkinson/SWpix</span></i><i><span>)</span></i></p>\n<p><span>On his situation at AG2R, Bardet said in December 2020, “I never felt really comfortable in this kind of situation, when everyone is expecting everything from you. I’m really proud and really thankful for what the team did for me, and they were absolutely right to do that, because we had some great emotion and success with this way. But, at some point in my career I also need to see new things. Now, it’s a totally different scenario [at Team DSM].”</span></p>\n<p><span>Bardet then went on to discuss what allured him to his new team. \"For sure, I have the highest exceptions of myself, but the fact is when you don’t think about one specific rider, when you think about the collective, I think it’s a better way to make sure you reach your best.\" </span></p>\n<p><span>The Frenchman added, “It won't be a circle around me, but that was something I was looking for. The key will be being part of this collective, and not the opposite.\"</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CorVosSWpix.com386-min_1024x1024.jpg?v=1634742475\" /></span><em><span>Romain Bardet at the Giro d'Italia 2021 with Team DSM (Image credit: CorVos/SWpix)</span></em></p>\n<p><span>After winning Tour de France stages and finishing on the podium in his mid-20s, Bardet went winless at WorldTour level in his final three years with the AG2R. Now, after completing his first season in new colours, i</span><span>t’s safe to say that the change of scenery has benefited Bardet.</span></p>\n<p><span>He headed to the Giro d’Italia for the first time in his career early in the season, where he finished a respectable seventh in the GC while he was also second on the queen stage to Cortina d’Ampezzo, only beaten by Egan Bernal. </span><span>Later in the season, after missing the Tour de France for the first time since 2012, Bardet picked up victories at the Vuelta a Burgos</span><span> and Vuelta a <span>España</span>. His two Spanish triumphs are his first pro wins outside of France.</span></p>\n<p><span>After crossing the line in eighth place at Il Lombardia, which concluded his road season, Bardet told </span><a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Article/Bardet-gaudu-une-confirmation-et-des-promesses-au-tour-de-lombardie/1291196\" target=\"_blank\"><span>L’Equipe</span></a><span>, “I’m on a good path. I’m starting to reap the rewards of this new approach to my profession.” </span><span>His newfound calendar freedom, combined with an environment that treats the collective above any individual, has pulled Bardet back on track.</span></p>\n<p><i><span>Cover image: </span></i><i><span>Tim de Waele/Getty Images</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"90020dccc7d49e062706381d8702b5b2f4bea751c654b0259bf82dc7237c6893","category":"Cycling"}