{"title":"Curve Cycling’s new Big Kev has room for even more rubber","link":"https://cyclingtips.com/2021/05/curve-cycling-teases-big-kev/","date":1620952064000,"content":"<p>The custom bike scene is often the place to watch for new and emerging trends. One small ripple of change at this year’s <a href=\"https://cyclingtips.com/tag/handmade-bicycle-show-australia/\" target=\"_blank\">Handmade Bicycle Show Australia </a>(HBSA) was related to growing tyre sizes for gravel bikes.</p>\n\n\n\n<p>Many parts of Australia (and the world, really) are littered with rough gravel roads, and those roads aren’t always ideal for the common 700×35 or 700×40 mm tyre widths that are in vogue. And while big volume 650B tyres aim to be the answer, the reality is that a bigger wheel is often even better. Cross country mountain bikes learnt this lesson, and I’ve long believed that go-everywhere adventure gravel bikes would inevitably go the way of 29ers, too. </p>\n\n\n\n<p>And if the recent HBSA is anything to go by, I’m not at all alone in this thinking. In addition to pre-existing options from Surly, Salsa, Evil, and Soma (and many more), Mark Hester of Prova Cycles has begun experimenting with frames that fit 700×52+ tyres (aka, 29 x 2.1″ mountain bike tyres). And then there’s the Big Kev that Curve Cycling will soon put into production. </p>\n\n\n\n<p>Of course, such big tyres muddy the waters between mountain bikes and gravel bikes even further, but that’s a debate for another day. For now here’s a look at the yet-to-be-released Big Kev, along with a couple of other unreleased bikes Curve was showing off this past weekend. </p>\n\n\n\n<h2>The Big Kev </h2>\n\n\n\n<p>Revealed at the Handmade Bicycle Show Australia, the Big Kev is quite simply a bigger-tyre version of Curve’s best-selling gravel bike – a bike that’s officially named the GXR while being affectionately referred to as the Kevin.</p>\n\n\n\n<p>Where the regular Kevin can fit 700×45 mm or 650×2.3″ tyres, Big Kev is designed around fitting true 29er mountain bike tyres up to 2.25″ in width (700 x 50 mm +). That’s quite a bit of rubber. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-8-1340x754.jpg\" /><figcaption>Meet Big Kev. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-7-1340x754.jpg\" /><figcaption>Kevin’s big brother. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-6-1340x754.jpg\" /><figcaption>The Big Kev will fit up to 29 x 2.25″ rubber. In roadie terms, that’s roughly 700 x 57 mm. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-5-1340x754.jpg\" /><figcaption>Like Kevin, Big Kev will use a custom machined and dropped chainstay yoke to provide crank and tyre clearance. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-4-1340x754.jpg\" /><figcaption>Big tyres require some careful manipulation of the tubes. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-3-1340x754.jpg\" /><figcaption>Best head badge in the game? </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-2-1340x754.jpg\" /><figcaption>Curve’s ultra-wide Walmer bars are of course present. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Big-Kev-Handmade-Bicycle-Show-Australia-2021-CyclingTips-1-1340x754.jpg\" /><figcaption>Ingrid has offered cranks, chainrings and cassettes for a while now, but the rear derailleur is a new addition to the range. </figcaption></figure></li></ul></figure>\n\n\n\n<p>Curve is currently finalising the details of Big Kev, but the plan is to keep the geometry rather familiar with the current Kevin. This will include the existing longer front-centre to match with a shorter stem. The reach is said to be unchanged, however the stack will be raised across the sizes for a slightly more relaxed fit. Those big tyres will see the chainstays grow to about 440 mm in length. </p>\n\n\n\n<p>Up front will sit a wholly new carbon fork called the Seek 451, with the numbers referring to the axle-to-crown height. This fork will feature an axle flip chip for either 46 or 52 mm fork offsets. It’s a fork that we unintentionally revealed during our <a href=\"https://cyclingtips.com/2021/02/curve-gxr-kevin-of-steel-review/\">review of the Kevin of Steel</a> in our recent <a href=\"https://cyclingtips.com/tag/2021-cyclingtips-road-bike-field-test/\">Field Test in Victoria’s High Country</a>. </p>\n\n\n\n<p>The bike shown above is a pre-production sample, and according to Curve’s founder Steve Varga, the production version will feature bento box mounts on the top tube, a Trek-type T47 bottom bracket, and SRAM’s Universal Derailleur Hanger (which is becoming extremely common on mountain bikes).  </p>\n\n\n\n<p>To begin, Big Kev will start off in titanium but a more affordable steel version is likely to follow. Maybe. Expect to pay slightly more for a Big Kev than what a little Kevin costs (AU$3,999 for a frameset), mostly due to the unique carbon fork that adds to the price. The exact delivery dates for the production version are still to be determined. </p>\n\n\n\n<p>This sample bike was built up with a very fresh 12-speed drivetrain from Italian component manufacturer Ingrid. Curve had this set up with SRAM Force 1 mechanical shifters and had plans to fit the <a href=\"https://cyclingtips.com/2020/10/ratio-technology-sram-1x12-speed-upgrade-kit/\">Ratio 12-speed conversion kit</a>. We’ve reached out to Ingrid for more details. </p>\n\n\n\n<h2>Titanosaur – a 36er gravel bike in the making </h2>\n\n\n\n<p>If you follow Curve’s antics on social media you’ll certainly know that the Melbourne brand has been working on a 36er to mow over any and all terrain. Curve had its Titanosaur on show at HBSA and is continuing to develop the concept, believing that it makes a whole lot of sense for really big people. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Titanosaur-36er-Handmade-Bicycle-Show-Australia-2021-CyclingTips-1-1340x754.jpg\" /><figcaption>Think 29ers are big? Think again. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Titanosaur-36er-Handmade-Bicycle-Show-Australia-2021-CyclingTips-2-1340x754.jpg\" /><figcaption>Vee Tire’s Monster is one of the only rubber options in this space. </figcaption></figure></li></ul></figure>\n\n\n\n<p>The idea of a 36er wheel isn’t a new concept and custom builders have been creating such monsters for a number of years now (typically for really tall people). Rims are often borrowed from the unicycle world, while Vee Tyre Co is arguably the only company producing an off-road suitable tyre at this time. </p>\n\n\n\n<p>There’s more testing to be done for Curve, but there’s apparently at least one eager Australian Rules (AFL) footballer already on the waitlist. </p>\n\n\n\n<h2>An Aussie-made Kev </h2>\n\n\n\n<p>Curve is an Australian bike company but its manufacturing is outsourced to Asia. This has caused a little bit of upset in previous editions of the Handmade Bicycle Show, and so Curve enlisted the framebuilding skills of its lead designer, Jimmy Rostlünd, to make a one-off Australian-made Kevin. </p>\n\n\n\n<figure><ul><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-1-1340x754.jpg\" /><figcaption>An Australian-made Kevin of Steel. This one is a collab with Egress bikes. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-6-1340x754.jpg\" /><figcaption>Jimmy Rostlünd often leaves the filed brazing of his frames bare. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-5-1340x754.jpg\" /><figcaption>Bronze badges. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-4-1340x754.jpg\" /><figcaption>It’s still a Kevin of Steel. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-3-1340x754.jpg\" /><figcaption>The finish is done with a chemical dip. </figcaption></figure></li><li><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/05/Curve-Kevin-of-Australian-Steel-Egress-Handmade-Bicycle-Show-Australia-2021-CyclingTips-2-1340x754.jpg\" /><figcaption>The cockatoo (Australian parrot) has become Curve’s emblem in recent years. </figcaption></figure></li></ul></figure>\n\n\n\n<p>Rostlünd runs Egress Bikes on the side, and this special Kevin has the same uncovered brass brazing that his own bikes are known for. This locally made version shares the identical geometry and features as the production Kevin.</p>\n\n\n\n<p>Curve was coy when asked if they’ll make more of these, but Rostlünd did admit to having a few spare tube sets and that he was open to the idea. </p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/curve-cycling-teases-big-kev/\">Curve Cycling’s new Big Kev has room for even more rubber</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dave Rome","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"90088e82b9b9ed3c13ab731b596ef1f12e7532f7d0bcabea84000c5a2b990e9e","category":"Cycling"}