{"title":"Etiology and Risk Factors of Urinary Tract Infections in Women in a Multidisciplinary Hospital in Romania","link":"https://www.preprints.org/manuscript/202410.0676/v1","date":1728463406000,"content":"Abstract: Background: Urinary tract infections (UTI) are a significant health concern, particularly in women, with almost half of them experiencing at least one UTI in their lifetime. This problem is further compounded by the high recurrence rate within 6-12 months. Postmenopausal women are especially vulnerable to recurrent UTI due to the natural decline in estrogen levels, which alters the urogenital epithelium and subsequently affects the urogenital microbiome. Methods: This study included 674 female patients that were admited at \"Dr. Carol Davila\" Central Military Emergency University Hospital in Bucharest over a period of 3 years. Results: Of the 674 women with urinary tract infection, 435 (79.3%) had more than one positive culture, and 239 (35.4%) experienced at least one recurrent urinary tract infection 6-12 months after the initial diagnosis. The mean age of women with urinary tract infection was 63 (± 15.61 years). Recurrent urinary tract infections were most prevalent in those aged 65-80 years (52%). Escherichia coli was detected in 71% of the positive cultures. Conclusions: The management of recurrent urinary tract infections in women presents a complex challenge that necessitates a multifaceted approach. The emerging understanding of the urobiome and its role in bladder health offers promising avenues for developing targeted interventions. As research in this field advances, it is imperative to integrate these new insights into clinical practice to balance traditional antibiotic treatments with novel strategies that consider the intricate microbial ecosystem of the urinary tract.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"900af10f786c664c4286ab8172a156bd04dddb36c703fbfc6abaa2df0097617f","category":"Interdisciplinary"}