{"title":"★ Thoughts and Observations on This Week’s ‘Spring Loaded’ Apple Event","link":"https://daringfireball.net/2021/04/spring_loaded_thoughts_and_observations","date":1619214208000,"content":"\n<p>Presented in the order in which they were announced:</p>\n\n<h2>Apple Card Family and Co-Ownership</h2>\n\n<p>An oddity of Apple Card, until now, is that all accounts were solely for individuals. Most credit cards can be shared between spouses, for example. (Maybe a lot more than most — Apple Card is the only card I’m aware of that <em>couldn’t</em> be shared between spouses.) My American Express card also lets my wife and me share it with our teenage son — a feature I know other cards offer too. Worse still, there was <a href=\"https://abcnews.go.com/us/york-probing-apple-card-alleged-gender-discrimination-viral/story?id=66910300\">a deserved hubbub</a> last year when it turned out that married couples applying for separate Apple Cards were getting <em>very</em> different credit limits, often with women being offered lower credit limits than their husbands. <a href=\"https://www.thejakartapost.com/life/2019/11/11/apple-co-founder-says-apple-card-algorithm-gave-wife-lower-credit-limit.html\">This happened to the Wozniaks</a>, even. Woz!</p>\n\n<p>So at a glance, it seems like Apple Card Family isn’t offering anything new at all — they’re just catching up in an area where they were lacking. But I think they actually <em>are</em> offering something new, <a href=\"https://www.apple.com/newsroom/2021/04/apple-introduces-apple-card-family-enabling-people-to-share-apple-card-and-build-credit-together/\">with this concept of co-ownership</a>:</p>\n\n<blockquote>\n  <p>“We designed Apple Card Family because we saw an opportunity to\nreinvent how spouses, partners, and the people you trust most\nshare credit cards and build credit together. There’s been a lack\nof transparency and consumer understanding in the way credit\nscores are calculated when there are two users of the same credit\ncard, since the primary account holder receives the benefit of\nbuilding a strong credit history while the other does not,” said\nJennifer Bailey, Apple’s vice president of Apple Pay. “Apple Card\nFamily lets people build their credit history together equally.”</p>\n</blockquote>\n\n<p>The key innovation is that there’s no “primary cardholder”. How exactly that will play out credit-wise when couples divorce, I don’t know, but it seems like a clear improvement over the “primary cardholder” model.</p>\n\n<p>Also, if two spouses already have separate Apple Cards, they can now merge them into one co-owned account and keep the higher credit limit and lower APR of the two accounts.</p>\n\n<h2>Apple Podcasts</h2>\n\n<p>Apple seems to be adding paid subscriptions to Podcasts the right way: it’s an entirely new thing that doesn’t disrupt any of Apple Podcasts’s established support for “regular” podcasts — by which I mean free and open podcasts published over the web using RSS. You can even add paid episodes to a free podcast for a freemium model, and while the paid episodes will only be available to listeners using Apple Podcasts (and paying via iTunes), the free episodes are just in the same RSS feed as before, accessible to any and all third-party podcast players.</p>\n\n<p>Paid podcasts that <em>don’t</em> go through Apple — like my and Ben Thompson’s <a href=\"https://dithering.fm/\">Dithering</a> — will continue to work as before.</p>\n\n<p>In short, these new subscriptions feel less like steering Apple Podcasts in the proprietary direction of Apple News, and more like adding built-in exclusive website subscriptions to Safari. I like it.</p>\n\n<h2>iPhone 12 and 12 Mini, Now in Purple</h2>\n\n<p><a href=\"https://daringfireball.net/linked/2021/04/22/purple-panzer-people-eaters\">It’s a nice color</a>.</p>\n\n<h2>AirTags</h2>\n\n<p><a href=\"https://daringfireball.net/linked/2021/04/22/panzarino-airtags\">Finally</a>, right? My big question going in was whether AirTags had purposes beyond just helping you find your keys or similar items. The answer is no — they’re just $29 location trackers. That’s not a complaint — their purpose is simple and clear, and I’m all in favor of products with simple, clear purposes.</p>\n\n<p>(Spitball idea that will never happen but would be fun if it did: an AirTags commercial set to <a href=\"https://music.apple.com/us/album/even-the-losers/1440860187?i=891418964\">Tom Petty’s “Even the Losers”</a>.)</p>\n\n<h2>New Apple TV 4K</h2>\n\n<p>The big news here is the new remote control. The new A12-based Apple TV 4K box doesn’t really have many new features beyond the A10-based “Apple TV 4K” box that it replaces.  It’s more like a classic “speed bump” update. New features like using your iPhone to properly color balance Apple TV’s output for your TV set are built into tvOS 14.5, and <a href=\"https://www.ithinkdiff.com/tvos-14-5-feature-playstation-5-xbox-controller/\">will be available on previous-generation Apple TV hardware</a>. The big new feature exclusive to the new hardware is the ability to play 60 FPS HDR content, including via AirPlay from footage shot on an iPhone 12 Pro.</p>\n\n<p>The new remote looks like a winner. Made from aluminum with black buttons, it looks like the true successor to <a href=\"https://support.apple.com/en-us/HT200008\">the previous aluminum Apple TV remote</a>. It’s like the black trackpad “Siri Remote” never happened.</p>\n\n<p>What a baffling design that black Siri Remote was. Among its obvious problems: a symmetric layout that made it very difficult to orient in your hand by feel, exacerbated by an edge-to-edge trackpad at the top that can get you into all sorts of trouble on screen if you happen to pick up the remote backwards. Who among us has not accidentally paused a movie when picking up the remote? It’s just a bad design, but to me, the inexplicable part isn’t that Apple shipped it in the first place, but that they stuck with it for over <em>five</em> years. That’s a long time to be shipping a remote control that was nearly universally despised and ridiculed.</p>\n\n<p>The only bad thing I can say about the new remote — which, admittedly, I haven’t actually seen in the flesh yet, and likely won’t until next month — is that it does not include AirTag-like “Find My” support. (I’d call this “inexplicable” but I just used that word.) I misplace my Apple TV remote more often than anything else I own, with the possible exception of my Apple Pencil. Sometimes I’ll absentmindedly carry it out to the kitchen and leave it on the counter while fetching a snack or beverage. Other times it gets lost in the couch cushions — which is crazy because that’s exactly the scenario Apple used for finding lost keys in the AirTags segment of the event. They even had other remote controls down in <a href=\"https://www.youtube.com/watch?v=ckqvG0Rj35I\">the hellscape labyrinth of that guy’s sofa</a>. Yet Apple’s own brand new remote, which debuted alongside AirTags, doesn’t support Find My. I can only chalk this up to Apple’s siloed culture — perhaps the team designing the new remote had no idea what the AirTag/Find My teams were up to, and no one thought to bring them together.</p>\n\n<p>Remote control aside, it’s steady as she goes for Apple TV as a hardware platform. Prices are still high compared to competing streaming boxes and HDMI “sticks” — $179 for 32 GB and $199 for 64 GB. The 2015 Apple TV HD — with a now-ancient A8 chip — <a href=\"https://www.apple.com/shop/buy-tv/apple-tv-hd/32gb\">remains in the lineup for $149</a>. The new remote control <a href=\"https://www.apple.com/shop/product/MJFM3LL/A/siri-remote\">is available for $59</a>, which, by itself, costs more than most entire streaming boxes from competitors like Roku and Amazon. (The new remote works with older Apple TV hardware.)</p>\n\n<p>Given Apple’s steady push to get the Apple TV app <a href=\"https://www.theverge.com/2021/2/18/22287905/apple-tv-app-now-available-chromecast-google-tv\">installed on other companies’ streaming boxes</a> and <a href=\"https://www.flatpanelshd.com/focus.php?subaction=showfull&amp;id=1580796087\">built into new “smart” TVs</a>, it’s no surprise many of us <a href=\"https://daringfireball.net/thetalkshow/2021/03/23/ep-310\">have wondered</a> if Apple’s interest in its own Apple TV hardware platform was waning. Others feel strongly that Apple needs Apple TV hardware — a stick, a box, whatever — that competes better on price. They should sell something for under $100 at least, right?</p>\n\n<p>Apple’s position is clearly that they’re good with the Apple TV hardware platform as we know it: a premium price for a premium experience. And that “premium price” is only premium compared to other streaming boxes, which are <a href=\"https://duckduckgo.com/?q=roku+disable+ads\">generally ad-subsidized</a>. $180 is pretty low for a computer system from Apple. It’s like the Mac of streaming boxes. You either see it as worth the premium, or you think everyone who buys one is the proverbial fool being parted from their money.</p>\n\n<h2>M1 iMac 24-inch</h2>\n\n<p>I love the return of vibrant, cheerful colors. I know Apple works on long timeframes for products like these new iMacs, and these colors were probably specified long before most of us ever heard the word “COVID”, but damn if these cheerful colors don’t feel like the perfect message for 2021. My guess is that non-Pro MacBooks will be available in the same or similar colors when they get a new industrial design.</p>\n\n<p>These new iMacs are just 11.5mm thick. How thin is that? Apple Watch Series 6 <a href=\"https://support.apple.com/kb/SP826\">is 10.7mm thick</a>. <em>These new iMacs are less than 1mm thicker than a goddamned Apple Watch.</em> They’re so thin Apple had to put the Ethernet port on the power adapter — the iMac itself is too thin. I’ve seen a bunch of Debbie Downer-type reactions to this, asking “<em>Who cares how thin a desktop is? Just make it thicker and put more ports on it and stuff.</em>” That’s the same sort of perspective that, 20+ years ago, had critics asking “<em>Who cares what color plastic your computer is?</em>”</p>\n\n<p>Making these new iMacs super thin is <em>cool</em>. It’s a statement. From the side they look like big 24-inch iPads. If you don’t think that’s cool and that <em>cool</em> is something Apple should aspire to in its design and engineering, I have no idea why you’re reading anything I write.</p>\n\n<p>Speaking of cool: <a href=\"https://twitter.com/basvanderploeg/status/1384921465217327105?s=12\">the desktop wallpapers on the new iMacs are close-up crops of sections from the cursive “hello”</a> (which itself, of course, is a throwback to Susan Kare’s iconic 1984 “hello”).</p>\n\n<p>The new 24-inch iMacs are a great upgrade from the old Intel 21-inch iMacs. They’re not so clearly an upgrade from 27-inch iMacs — 3 diagonal inches is a lot of screen real estate. So my guess is that new iMacs with larger displays are coming. Let’s say 30-inch displays, and the same internals as the upcoming 16-inch and 14-inch truly-pro Apple Silicon MacBook Pros. I think branding-wise, Apple should go in the MacBook direction too: 24-inch display: just plain “iMac”, 30-inch display: “iMac Pro”. The Intel iMac Pro had a starting price of $5,000, but that machine was a one-off anomaly. My hypothetical Apple Silicon iMac Pro of the near future would have a starting price akin to the 16-inch MacBook Pros — somewhere between $2,000 and $2,500.</p>\n\n<h2>M1 iPad Pros</h2>\n\n<p>Color me a little surprised that the chip in the new iPad Pro models is the M1, not an A14X. That surprise is simply because I sort of filed the “M” in “M1” under “Mac” in my mind. But once you think about it, it makes sense to just use the M1 and the M1 brand. Right now Apple is achieving tremendous scale across its product line <a href=\"https://www.extremetech.com/computing/322120-apples-m1-positioning-mocks-every-x86-cpu-amd-and-intel-have-ever-launched\">with just two new chips from 2020</a>. The A14 powers all iPhone 12 models and the latest iPad Air, and the M1 powers the MacBook Air, 13-inch MacBook Pro, Mac Mini, the new iMacs, and the new iPad Pros. Two chips!</p>\n\n<p>The M1 might as well be the “A14X”, though. It’s just a name. But that name has people <a href=\"https://www.theverge.com/2021/4/22/22396449/apple-ipad-pro-macbook-air-macos-2021\">clamoring</a> for the ability to boot these iPads running MacOS, or to otherwise “run Mac apps” on iPadOS. There’s nothing about putting the M1 in these iPads that makes this easier technically or more likely strategically. It’s just a name for a chip. But there seem to be a lot of people who want to like iPads but who don’t like iPadOS or iPad apps.</p>\n\n<p>What exactly does the M1 do for serious iPad users that the 12X/Z didn’t? I don’t know. One difference is that for the first time ever with any iPad, <a href=\"https://www.apple.com/ipad-pro/specs/\">Apple is advertising RAM</a>. The models with under 1 TB of storage have 8 GB of RAM, the 1 and 2 TB storage models have 16 GB. That’s a lot of RAM for an iPad.</p>\n\n<p>One neat feature exclusive (so far) to the new iPad Pros is Center Stage — a dynamic zoom-to-crop feature for front-facing video calls that expands, contracts, and pans the field of view based on how many people are in front of the camera and where they are. <a href=\"https://www.pocket-lint.com/tablets/news/apple/156607-apple-center-stage-how-the-camera-feature-works-and-which-devices-support-it\">Apple’s demo during the event</a> makes it look <em>really</em> smooth, like having a cameraperson smoothly zooming the field of view in and out, and it’s not just for FaceTime — <a href=\"https://twitter.com/viticci/status/1384584226050387970\">third-party apps will be able to use it</a>, too.</p>\n\n<h2>Unannounced: iOS 14.5</h2>\n\n<p>I expected Apple to talk about iOS 14.5 and its new controls for limiting surveillance advertising tracking, but, nope, not a word about it.</p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"900b17f4df919adeab260c7892e7f7cec37777be1ff3199c65e2aa1b05d63890","category":"Tech"}