{"title":"Sensor-driven turbine platforms could unlock 4,000 TWh of offshore wind","link":"https://arstechnica.com/?p=1767468","date":1621963149000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/ARPA-E-Summit-ATLANTIS-project-image_crop-800x485.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/ARPA-E-Summit-ATLANTIS-project-image_crop.jpg\">Enlarge</a> <span>/</span> A rendering of GE and Glosten's actively managed tension leg platform for floating offshore wind projects. (credit: Glosten)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US took its first steps toward embracing offshore wind power earlier this month with the <a href=\"https://arstechnica.com/science/2021/05/after-many-delays-massachussets-vineyard-wind-is-finally-approved/\">approval</a> of the Vineyard Wind 1 project off the coast of Massachusetts. When the site is complete, 62 massive wind turbines anchored in the continental shelf will crank out 800 MW of electricity, giving the East Coast its first taste of a large, nearby, and renewable power source. And while the project shows the promise of offshore wind, the industry’s future may lie even deeper in the ocean.</p>\n<p>In US waters alone, <a href=\"https://www.nrel.gov/news/program/2020/floating-offshore-wind-rises.html\">58 percent</a> of offshore wind capacity—some 4,200 TWh per year—is beyond the reach of fixed-foundation wind turbines, which are commercially limited to depths of less than 60 m. Offshore wind represents a massive, untapped resource, and the US used <a href=\"https://www.eia.gov/tools/faqs/faq.php?id=427&amp;t=3\">about 4,000 TWh</a> of electricity last year.</p>\n<p>To access offshore wind power, companies have been experimenting with floating platforms that would support the industry’s largest turbines. Yesterday, General Electric and Glosten, an engineering consultancy, announced a new design and control scheme that could significantly lower the cost of floating offshore wind as part of the ARPA-E ATLANTIS program.</p></div><p><a href=\"https://arstechnica.com/?p=1767468#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1767468&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"90111ba0f56f35a5b17fc8888aed9172b3d7702fd5e22d1611329c522c6b24e8","category":"Tech"}