{"title":"The economic burden of cervical cancer on women in Uganda: Findings from a cross-sectional study conducted at two public cervical cancer clinics","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002554","date":1710511200000,"content":"<p>by Hallie Dau, Esther Nankya, Priscilla Naguti, Miriam Basemera, Beth A. Payne, Marianne Vidler, Joel Singer, Avery McNair, Maryam AboMoslim, Laurie Smith, Jackson Orem, Carolyn Nakisige, Gina Ogilvie</p>\r\n\r\nThere is limited research on how a cervical cancer diagnosis financially impacts women and their families in Uganda. This analysis aimed to describe the economic impact of cervical cancer treatment, including how it differs by socio-economic status (SES) in Uganda. We conducted a cross-sectional study from September 19, 2022 to January 17, 2023. Women were recruited from the Uganda Cancer Institute and Jinja Regional Referral Hospital, and were eligible if they were ≥ of 18 years and being treated for cervical cancer. Participants completed a survey that included questions about their out-of-pocket costs, unpaid labor, and family’s economic situation. A wealth index was constructed to determine their SES. Descriptive statistics were reported. Of the 338 participants, 183 were from the lower SES. Women from the lower SES were significantly more likely to be older, have ≤ primary school education, and have a more advanced stage of cervical cancer. Over 90% of participants in both groups reported paying out-of-pocket for cervical cancer. Only 15 participants stopped treatment because they could not afford it. Women of a lower SES were significantly more likely to report borrowing money (higher SES n = 47, 30.5%; lower SES n = 84, 46.4%; p-value = 0.004) and selling possessions (higher SES n = 47, 30.5%; lower SES n = 90, 49.7%; p-value = 0.006) to pay for care. Both SES groups reported a decrease in the amount of time that they spent caring for their children since their cervical cancer diagnosis (higher SES n = 34, 31.2%; lower SES n = 36, 29.8%). Regardless of their SES, women in Uganda incur out-of-pocket costs related to their cervical cancer treatment. However, there are inequities as women from the lower SES groups were more likely to borrow funds to afford treatment. Alternative payment models and further economic support could help alleviate the financial burden of cervical cancer care in Uganda.","author":"Hallie Dau","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9019ed993ba32880e76e7e3dcbf169ab268f15616f9850f803a9136371b015d8","category":"Environment"}