{"title":"Salivary immune responses after COVID-19 vaccination","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307936","date":1725372000000,"content":"<p>by Kenny Nguyen, Boris Relja, Monica Epperson, So Hee Park, Natalie J. Thornburg, Veronica P. Costantini, Jan Vinjé</p>\r\n\r\nmRNA-based COVID-19 vaccines have played a critical role in reducing severe outcomes of COVID-19. Humoral immune responses against SARS-CoV-2 after vaccination have been extensively studied in blood; however, limited information is available on the presence and duration of SARS-CoV-2 specific antibodies in saliva and other mucosal fluids. Saliva offers a non-invasive sampling method that may also provide a better understanding of mucosal immunity at sites where the virus enters the body. Our objective was to evaluate the salivary immune response after vaccination with the COVID-19 Moderna mRNA-1273 vaccine. Two hundred three staff members of the U.S. Centers for Disease Control and Prevention were enrolled prior to receiving their first dose of the mRNA-1273 vaccine. Participants were asked to self-collect 6 saliva specimens at days 0 (prior to first dose), 14, 28 (prior to second dose), 42, and 56 using a SalivaBio saliva collection device. Saliva specimens were tested for anti-spike protein SARS-CoV-2 specific IgA and IgG enzyme immunoassays. Overall, SARS-CoV-2-specific salivary IgA titers peaked 2 weeks after each vaccine dose, followed by a sharp decrease during the following weeks. In contrast to IgA titers, IgG antibody titers increased substantially 2 weeks after the first vaccine dose, peaked 2 weeks after the second dose and persisted at an elevated level until at least 8 weeks after the first vaccine dose. Additionally, no significant differences in IgA/IgG titers were observed based on age, sex, or race/ethnicity. All participants mounted salivary IgA and IgG immune responses against SARS-CoV-2 after receiving the mRNA-1273 COVID-19 vaccine. Because of the limited follow-up time for this study, more data are needed to assess the antibody levels beyond 2 months after the first dose. Our results confirm the potential utility of saliva in assessing immune responses elicited by immunization and possibly by infection.","author":"Kenny Nguyen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"901d1853ce5085250877cb6fdad453328e039ee13970a2454efd98ac54ae7589","category":"Interdisciplinary"}