{"title":"Susceptibility of Broflanilide and a Broflanilide-based Insecticide Formulation against the Common Bed Bug, Cimex lectularius L. (Hemiptera: Cimicidae)","link":"https://www.preprints.org/manuscript/202404.2009/v1","date":1714489617000,"content":"Broflanilide is a novel active ingredient from a unique insecticide class (IRAC Group 30) and was investigated as a control option against modern insecticide resistant strains of the common bed bug, Cimex lectularius. The susceptibility of technical grade broflanilide and efficacy of a broflanilide-based aerosol formulation (Earth Corp., Japan) were evaluated against five C. lectularius strains (MONH, SYD, DARL, PARRA, RIPPO). Results demonstrated that bed bugs had high susceptibility to broflanilide (RR50: SYD=1.22-fold, DARL=1.03-fold, PARRA=3.65-fold, RIPPO=2.77-fold), compared to the susceptible MONH strain. The aerosol showed high efficacy to adult bed bugs (97.5–100 % mortality to five strains after 24 hrs post-spray) and produced a notable decrease in egg hatch rates (MONH=9.7–23.4 %, PARRA=14.9–22.6 %). The aerosol also demonstrated high residual activity with 97.5–100% mortality in all five bed bug strains within 7 days exposure. The impact of different surface types upon aerosol residual efficacy was limited, although residues on a non-porous surface (tile) killed bed bugs slightly quicker than that on a porous surface (filter paper). The aerosol provided long residual activity to bed bugs, as 6-month-old residues were as equally efficacious to that of fresh residues. Bed bugs did not avoid surfaces treated with the aerosol. The high efficacy (including ovicidal efficacy), long residual activity, and non-avoidance of bed bugs on treated surfaces, demonstrated that broflanilide is highly suitable for modern bed bug management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9023eadd64dd47f0754ad28f3d9da4eec7a4b4d20b9d9af1fe514292ef19ccc2","category":"Interdisciplinary"}