{"title":"There will soon be no more ads denying climate change on Google","link":"https://arstechnica.com/?p=1802496","date":1633718270000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/wildfire-smoke-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/wildfire-smoke.jpg\">Enlarge</a> <span>/</span> A fire engine drives into air thick with smoke along Juniper Hills Road as the Bobcat Fire advances North into the Antelope Valley in 2020. (credit: Robert Gauthier | Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Late Thursday, Google announced that it is demonetizing content that makes misleading or false claims about climate change. As a result, content that calls into question or denies the scientific consensus around anthropogenic climate change will not have Google advertising alongside it. In addition, Google will no longer run any advertising that \"contradicts well-established scientific consensus around the existence and causes of climate change.\"</p>\n<p>With a worldwide public-health crisis taking place in the midst of natural disasters that are fueled, at <a href=\"https://arstechnica.com/science/2019/07/warming-climate-likely-leading-to-larger-california-fires/\">least in part</a>, by human-caused climate change, the amount of misinformation and outright falsehoods is not only frustrating but dangerous. Google has been criticized for its role in the spread of misinformation, and many people are unhappy with the company. People paying for ads don't want their ads appearing alongside misinformation-filled videos, and content producers don't want to see their product interrupted by error-filled ads.</p>\n<p>Message received, says Google.</p></div><p><a href=\"https://arstechnica.com/?p=1802496#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1802496&amp;comments=1\">Comments</a></p>","author":"Eric Bangeman","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"903054a2a3b7cc8ca43812d987dd3b2a2c5e2aaec5fb0e0bd4789c4bdfe085a1","category":"Tech"}