{"title":"18 Progesterone and insulin concentrations during pregnancy in slick and wild type-haired Holstein cows","link":"https://academic.oup.com/jas/article/102/Supplement_1/57/7618015?rss=1","date":1709337600000,"content":"<span><div>Abstract</div>In cattle, the presence of the SLICK gene has been associated with shorter calving intervals when exposed to tropical climates. However, the effects this genotype may have in terms of circulating hormones during pregnancy have not been reported. Therefore, the current study aimed to determine if reproductive hormones concentrations differ during the gestation between slick (SH) and wild type-haired (WT) cattle. Holstein heifers were estrus synchronized and inseminated during Winter (December) and Summer (June). A total of 13 SH and 8 WT Holstein heifers became pregnant and are included in the current study. Beginning on the day of insemination (d 0), blood samples were collected every 28 d. Commercially available ELISA kits were used to determine the plasma concentrations of bovine progesterone and insulin. The effects of hair coat genotype, season, day of pregnancy, and the respective interactions were tested by PROC Mixed in SAS. Day of pregnancy was utilized as a repeated measure for each animal. A significant season x day of pregnancy interaction (P &lt; 0.001) was observed for the plasma concentrations of progesterone. On gestational d 0, 28 and 56, progesterone concentrations were greater for heifers inseminated during the Winter (7.11 ± 0.50, 5.31 ± 0.51, 5.39 ± 0.49 ng/mL, for d 0, 28 and 56 of pregnancy, respectively) when compared with those inseminated during the Summer (3.04 ± 0.45, 3.17 ± 0.45, 3.21 ± 0.45 ng/mL, for d 0, 28 and 56 of pregnancy, respectively). For insulin, also a significant interaction of season x day of pregnancy was observed (P = 0.004). On d 112 of pregnancy, the concentrations of insulin were greater for heifers inseminated during Winter (0.337 ± 0.03 ng/mL) when compared with those inseminated during Summer (0.082 ± 0.08 ng/mL). No other significant interactions were observed. Neither differences in progesterone (P = 0.70; 3.7 ± 0.33 and 3.9 ± 0.25 ng/mL, for WT and SH, respectively) nor insulin (P = 0.46; 0.20 ± 0.02 and 0.18 ± 0.01 ng/mL, for WT and SH, respectively) were observed between genotypes. Further research comparing other hormones during pregnancy may provide useful information between genotypes that may help to explain the better reproductive performance of SH dairy cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"90301ddea87b7dfa35388ccfc7221df843e328498d79540b342639e5c85b12a3","category":"Environment"}