{"title":"DFly: A Publicly Auditable and Privacy-Preserving UAS Traffic Management System on Blockchain","link":"https://www.preprints.org/manuscript/202407.1340/v1","date":1721134824000,"content":"The integration of Unmanned Aircraft Systems (UAS) into the current airspace poses significant challenges in terms of safety, security and operability. As an example, the European Union has defined in 2019 a set of rules to support the digitalization of UAS Traffic Management (UTM) systems and services, namely the U-Space regulations. Current propositions opted for a centralized and private model, concentrated around governmental authorities (e.g., AlphaTango provides the Registration service and depends on the French government). In this paper, we advocate in favor of a more decentralized and transparent model in order to improve safety, security and operability among UTM stakeholders. As such, we propose DFly, a Publicly Auditable and Privacy-preserving UAS Traffic Management system on Blockchain, and developed two initial services: Registration and Flight Authorization. We demonstrate that the use of a blockchain guarantees the public auditability of the two services and corresponding service providers’ actions. In addition, it facilitates the comprehensive and distributed monitoring of airspace occupation and the integration of additional functionalities (e.g., the creation of a live UAS tracker). The combination with zero knowledge proofs enable the deployment of an automated, distributed, transparent and privacy-preserving flight authorization service, performed on-chain thanks to the blockchain logic. In addition to its construction, this paper details the instantiation of the proposed UTM system with the Ethereum Sepolia’s testnet and the Groth16 ZK-SNARK protocol. On-chain (gas cost) and off-chain (execution time) performance analyses confirm that the proprosed solution is a viable and efficient alternative in the spirit of digitalization and offers additional security guarantees.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9034b97f6f22857db50642dba252a2f743cea2f8da72d9e818a8c6a9718d6f84","category":"Interdisciplinary"}