{"title":"Northrop Grumman likely to end its bid for a commercial space station","link":"https://arstechnica.com/?p=1972504","date":1696264844000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/cygnus-station-800x388.jpg\" alt=\"Northrop Grumman proposed a free-flying space station based on Cygnus.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/cygnus-station.jpg\">Enlarge</a> <span>/</span> Northrop Grumman proposed a free-flying space station based on Cygnus. (credit: Northrop Grumman)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Nearly two years ago, <a href=\"https://arstechnica.com/science/2021/12/nasa-sets-sail-into-a-promising-but-perilous-future-of-private-space-stations/\">NASA placed its bets</a> to develop commercial space stations on four companies—Blue Origin, Nanoracks, Northrop Grumman, and Axiom Space. Now, as the US space agency looks to find a successor to the International Space Station in low-Earth orbit, this landscape is shifting dramatically.</p>\n<p>At the International Astronautical Congress meeting this week in Azerbaijan, sources report that there is widespread speculation that one of these four companies, Northrop Grumman, is dropping out of the competition. <a href=\"https://news.northropgrumman.com/news/releases/northrop-grumman-signs-agreement-with-nasa-to-design-space-station-for-low-earth-orbit\">Northrop's plan</a> had been to leverage its successful Cygnus spacecraft design to build a free-flying space station.</p>\n<p>However, Northrop no longer plans to do so. Rather, it will join the venture backed by Voyager Space, which is partnering with Europe-based Airbus to develop a commercial space station. It's likely that Northrop would provide cargo transportation services, with Cygnus as part of the team. Officials from Voyager and Northrop Grumman declined to comment on the change in strategy, which could be announced soon.</p></div><p><a href=\"https://arstechnica.com/?p=1972504#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972504&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9036caa548babd076183ddeb27081c7e5fb47e4fcfc6fdd8030dd9ea077a07ed","category":"Tech"}