{"title":"Multicenter Perioperative Results with a New Endoscopic Powered Stapler in Bariatric Surgery: A Retrospective Study","link":"https://www.preprints.org/manuscript/202408.1246/v1","date":1723810962000,"content":"Background/Objectives: Advancements in surgical stapling devices play a crucial role in improving outcomes for bariatric procedures. This study evaluates the performance and safety of a new endoscopic stapler (EnDrive®BelugaTM) regarding perioperative results across multiple bariatric surgery types.\nMethods: A retrospective analysis was conducted on 112 patients who underwent bariatric procedures using the Beluga stapler at two centres in the UAE and Kenya over 6-month period (June-December 2023). Procedures included laparoscopic sleeve gastrectomy (LSG), Roux-en-Y gastric bypass (LRYGB), mini gastric bypass (OAGB-MGB), and revisions. Perioperative outcomes, complications, and haemoglobin changes were assessed.\nResults: The cohort included 29 males and 83 females, with a mean age of 32.8 years and preoperative BMI of 41.1 kg/m². Procedures performed were 88 primary LSG, three primary LRYGB, 12 primary OAGB-MGB, and nine revision surgeries. No conversions, deaths, bleeding, or leaks occurred. Minor complications were observed in 4 patients. One patient required reoperation for intestinal obstruction. The mean hospital stay was 1.5 days. Haemoglobin levels showed minimal change from preoperative (12.8 g/dL) to postoperative day 1 (12.3 g/dL).\nConclusions: The new Beluga endoscopic stapler demonstrated safe and effective performance across various bariatric procedures, with low complication rates and minimal blood loss. Its enhanced articulation capabilities may offer advantages in specific cases. Further studies are warranted to compare long-term outcomes with established stapling devices.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"90374343944c6e408230acfb99e28043f6d48776bdedecdc5b15578c30979674","category":"Interdisciplinary"}