{"title":"Everybody Wants to Be My Enemy","link":"https://markpeak.net/everybody-wants-to-be-my-enemy/","date":1637678625000,"content":"<p>ช่วงนี้กำลังดูซีรีส์ Arcane ของ Netflix ซึ่งนำเรื่องมาจากจักรวาลเกม League of Legends</p>\n<p>ตัวซีรีส์เดี๋ยวดูจบมาว่ากันอีกที แต่ที่อยากเขียนถึงก่อนเป็นเรื่องของเพลงประกอบซีรีส์ คือเพลง Enemy ที่แต่งโดยวงร็อคชื่อดัง Imagine Dragons เนื้อหาเกี่ยวกับการทรยศ หักหลัง ความเป็นศัตรูที่เชื่อใจใครไม่ได้เลย</p>\n<blockquote><p>Tell you you’re the greatest<br />\nBut once you turn they hate us<br />\nOh, the misery<br />\nEverybody wants to be my enemy</p></blockquote>\n<p>เนื่องจากผมไม่ได้เป็นแฟนของ Imagine Dragons ดังนั้นจะได้ฟังเพลงจากฉากเปิดเรื่องของซีรีส์ทุกตอนก่อน แล้วค่อยมาดูมิวสิควิดีโอหรือการแสดงบนเวทีของวงในภายหลัง</p>\n<p>เลยประทับใจมากเพราะว่า เพลงเดียวแต่พอนำไปวางในบริบทที่ต่างกัน และใช้วิธีนำเสนอในเชิง visual เข้าช่วย ซึ่งในกรณีนี้คือนำสมาชิกของวงไปเป็นตัวละครในซีรีส์ด้วย (ภาษาสมัยนี้คงเรียก metaverse) เลยยิ่งเห็นความแตกต่าง</p>\n<p>หากเราลองดูการแสดงของ Imagine Dragons บนเวทีงาน MTV Music Awards ก็คงรู้สึกว่าเป็นเพลงร็อคธรรมดา</p>\n<p></p>\n<p>พอมาดู Official MV ของเพลง ซึ่งเป็นแอนิเมชันทั้งหมด (สร้างโดยสตูดิโอเดียวกับที่ทำซีรีส์) ก็จะมีความเป็นโลกเสมือนมากขึ้น สมาชิกของวงกลายเป็นตัวการ์ตูน</p>\n<p>คนที่ไม่เคยดูซีรีส์มา อาจไม่เข้าใจภาพที่แสดงในคลิปมากนัก แต่เพลงดังหลายเพลงที่ใช้ MV เป็นการ์ตูนก็ประมาณนี้อยู่แล้วนี่นา</p>\n<p></p>\n<p>พอนำเพลงมาไว้ในฉากเปิดของซีรีส์ทุกตอน ก็จะได้อารมณ์อีกแบบไปเลย เพราะไม่เกี่ยวกับวง Imagine Dragons เลย แต่เป็นเรื่องของ “ความเป็นศัตรู” ของตัวละครในเรื่อง ซึ่งเป็นธีมหลักของซีรีส์ด้วย เป็นการปูอารมณ์ก่อนเข้าไปรับชม (กราฟิกฉากเปิดตอนก็ไม่ได้สื่ออะไรมากนัก นอกจากการต่อสู้กันของตัวละครสำคัญต่างๆ)</p>\n<p></p>\n<p>แต่เท่านั้นยังไม่พอ ทีมสร้างซีรีส์ยังได้นำประโยคหลักของเพลงคือ “Everybody Wants to Be My Enemy” มาใช้เป็นชื่อตอน (Ep. 5) โดยมีฉากที่ตัวละครในเรื่องเดินผ่านบาร์ (ที่มีตัวละครจากวง Imagine Dragons มาร้องเพลงประกอบ – ตอนแรกผมไม่รู้ด้วยซ้ำว่านี่คือ Imagine Dragons 555) เพื่อขับเน้นเรื่อง “ความเป็นศัตรู” ของเส้นเรื่องหลักอีกต่างหาก</p>\n<p></p>\n<p>นอกจากนี้ยังมีเวอร์ชันลูกผสม คือเป็นการแสดงของ Imagine Dragons ที่นำกราฟิกในเกมมาผสานเข้ากับฉากต่างๆ ด้วย</p>\n<p></p>\n<p>ทั้งหมดที่ว่ามา คือตัวอย่างของการแต่งเพลงประกอบซีรีส์ที่เรียกได้ว่า “ใช้ซะคุ้ม” คือวางแผนมาดีมาก เนื้อเพลงกับเนื้อเรื่องไปด้วยกัน หยิบไปวางในบริบทไหนก็ลงตัว น่าชื่นชมทั้งฝั่งคนสร้างซีรีส์และคนทำเพลง (<a href=\"https://www.blognone.com/node/123565\">Riot เป็นค่ายเกมที่จริงจังเรื่องเพลงมากๆ</a> และโปรดิวเซอร์ของ Arcane ก็มาจากสายเพลงมาก่อน)</p>\n<p>ปิดท้ายด้วยคลิปทีมของ Imagine Dragons เล่าเบื้องหลังว่า รับฟังเนื้อเรื่องจาก Riot ก่อน แล้วค่อยมาแต่งเพลง</p>\n<p></p>The post <a href=\"https://markpeak.net/everybody-wants-to-be-my-enemy/\">Everybody Wants to Be My Enemy</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"90376ec0dfece2cbc8655f3baaf42349d2d441f63f0c26e9f517be61f4316f51","category":"Thai"}