{"title":"Isometric Force-Time Curve Assessment: Accuracy, Precision and Repeatability of a Mobile Application and Portable and Lightweight Device&mdash;The DINABANG&reg;","link":"https://www.preprints.org/manuscript/202408.0767/v1","date":1723449535000,"content":"Background: Strength assessment is one of the main fields in sports performance, physical rehabilitation, physical activity and health. Purpose: To compare maximal voluntary isometric contractions (MVIC) and paired voluntary isometric contractions (VIC) of knee extensors between an isokinetic dynamometer (BIODEX) and a portable and lightweight device (DINABANG). Methods: From 19 volunteers (age: 28.7±7 y; body mass: 72±10 kg and height: 173±7 cm) we obtained 114 paired MVIC measures and, from the force-time curves of these repetitions, 22507 paired VIC measures of knee extensors. Results: We observed “excellent” repeatability for MVIC (ICC:1.00; p&amp;lt;0.001) between BIODEX (247±79.5 Nm) and DINABANG (247±74.8 Nm), with “trivial” effect (mean difference: 0.12 Nm (0.02%); 95%CI: -0.13 to 0.23 Nm; p=0.606; d=0.048). Bland-Altman plots revealed high accuracy for MVIC (bias: 0.12 Nm) and consistent distribution (precision) inside the limits of agreement (-4.81 to 5.06 Nm) and respective 95%CI. “Excellent” repeatability was also observed for VIC (ICC:1.00; p&amp;lt;0.001) between BIODEX (219±84.1 Nm) and DINABANG (218±84.0 Nm), with “trivial” effect (0.24 Nm (0.11%); 0.08 to 0.11 Nm; p&amp;lt;0.001; d=0.100). Bland-Altman plots revealed high accuracy for VIC (bias: 0.24 Nm) and consistent distribution (precision) inside the limits of agreement (-4.5 to 4.9 Nm) and respective 95%CI. Conclusion: DINABANG is accurate, precise and reliable for torque measurement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"90401de030369a30222189f37e16a3087ab8d16a5716d5c3288053539bc4a4b9","category":"Interdisciplinary"}