{"title":"LINE เผยสถิติ Group Chat ครอบครัว 82%, งาน 77%, เปิดตัว Sticker Premium จ่ายรายเดือน","link":"https://www.blognone.com/node/135934","date":1695719419000,"content":"<div><div><div><p>ในงาน LINE Conference Thailand 2023 ทาง LINE ได้เปิดเผยว่า Group Chat ได้รับความนิยมในคนไทย โดยมีสถิติการเติบโตสูงกว่า 56% ช่วง 10 ปี ที่ผ่านมา และอัตราการส่งข้อความประเภทต่างๆ เช่น รูปภาพ ไฟล์ เสียง และวิดีโอ มีอัตราการเติบโตสูงกว่าประเทศอื่นๆ ทั่วโลก</p>\n<p>ผลสำรวจจาก LINE ประเทศไทยพบว่า หมวดหมู่ Group Chat ยอดนิยมได้แก่ กลุ่มเพื่อน 82% ครอบครัว 80% ที่ทำงาน 77% และโรงเรียน 27% ยังระบุเพิ่มว่า Group Chat ช่วยให้การทำงานเป็นไปอย่างรวดเร็วและง่ายขึ้น ทำให้เกิดสังคมการทำงานที่มีประสิทธิภาพ นำมาสู่การพัฒนาโซลูชั่นที่ตอบโจทย์ Work Group สำหรับคนไทย เพื่อสร้างความสมดุลระหว่างการทำงาน การใช้ชีวิตและครอบครัวไปด้วยกัน</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6f6e6debf42a803f1bdcec7ba44a70f4.jpg\" /></p>\n<p>นอกจากนี้ภายในงานยังเปิดตัว LINE STICKERS PREMIUM บริการสติกเกอร์จ่ายรายเดือน/รายปี สำหรับคนไทย เพื่อให้ใช้งานชุดสติ๊กเกอร์และธีมมากกว่า 9,000,000 แบบได้</p>\n<ul>\n<li>เบสิค: สติกเกอร์อย่างเดียว 69 บาท/เดือน, 699 บาท/ปี</li>\n<li>ดีลักซ์: สติกเกอร์, อิโมจิและธีม 139 บาท/เดือน, 1,300 บาท/ปี</li>\n</ul>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ed584b8f44d39c1e72483d417539ed96.png\" /></p>\n<p>ทั้งแพ็คเกจแบบเบสิคและดีลักซ์จะได้ทั้ง สติกเกอร์ อิโมจิ และธีมมากกว่า 9,000,000 แบบได้ไม่อั้นและเปลี่ยนสติกเกอร์ได้ไม่จำกัด แต่ดีลักซ์จะได้สิทธิเพิ่มสามารถใช้อิโมจิพรีเมียมที่ร่วมรายการมากกว่า 120,000 แบบ และธีมพรีเมียมที่ร่วมรายการมากกว่า 1,500,000 แบบ</p>\n<p>ในแง่ทิศทางธุรกิจ LINE ยังประกาศมุ่งเน้นสู่การเป็น “แพลตฟอร์มเปิดเพื่อคนไทย” ผ่าน 4 แนวทาง ได้แก่</p>\n<ul>\n<li>Extensive Plug-Ins: เปิดการเชื่อมต่อระบบหรือโซลูชั่น ทั้งโซลูชั่นที่คิดค้นเพิ่มเติมจาก LINE เอง และระบบที่พาร์ทเนอร์หรือนักพัฒนาทั่วไปไ้ด้พัฒนาขึ้นมา</li>\n<li>Data Utilization: ส่งเสริมให้พันธมิตรและนักพัฒนาสามารถเข้าถึงข้อมูลได้มากขึ้น ทั้งในเชิงปริมาณและคุณภาพ</li>\n<li>Performance Marketing: เพิ่มประสิทธิภาพทางการตลาดบนแพลตฟอร์ม ด้วยศักยภาพการจัดการและวิเคราะห์ข้อมูลที่แข็งแกร่งขึ้น</li>\n<li>Privacy Focused: ให้ความสำคัญกับความปลอดภัยและความเป็นส่วนตัวของผู้ใช้อย่างเคร่งครัด</li>\n</ul>\n<p>ที่มา: ข่าว PR LINE ประเทศไทย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0a9729c8ff75455e979ebcdedad2475a.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/line\">LINE</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"90421fab86fd05de873780b7f8bceb31f0412eddd1f6086e9e10aedd55ff5c23","category":"Thai"}