{"title":"Differences in mixed‐species bird flocks across forest succession: Combining network analysis and trait‐based ecology related to the fast‐slow continuum","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14540?af=R","date":1709965438000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/0b466185-6f35-4fba-bd33-df1f0e6e8e15/fec14540-toc-0001-m.png\" alt=\"Differences in mixed-species bird flocks across forest succession: Combining network analysis and trait-based ecology related to the fast-slow continuum\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/29/differences-in-mixed-species-bird-flocks-across-forest-succession-combining-network-analysis-and-trait-based-ecology-related-to-the-fast-slow-continuum/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSecondary forests are increasingly important for biodiversity conservation and ecosystem functioning. Yet, we know little on how species interactions shift across the wide range of life history strategies in the context of forest succession, especially for non-trophic animal social systems.\n\nUsing data from mixed-species flocks (hereafter MSFs) and life history and morphological traits from the ‘fast-slow’ continuum, we utilized a novel combination of network theory and trait-based ecology to examine the assembly of associations of MSFs among species with different fast-slow strategies across stages of forest succession that exhibit different degrees of forest complexity.\n\nMSFs formed the most connected and cohesive network in the intermediate successional stage. In contrast, we observed the least connected and cohesive network in the early stage, and a strongly connected but intermediately cohesive network in the late stage. Fast species with smaller body size and mass, and larger clutch size, were gradually replaced by slow species during succession. Interspecific associations generally shifted from those among similarly fast species (early stage) to associations between fast and slow species (intermediate stage), and finally to those among similarly slow species (late stage).\n\nWe suggest that vegetation complexity (e.g. tree size, height, diversity and canopy cover), related to the availability of resources and number of niches, shaped the network structure and functional composition of MSFs. Although the late successional forests play an irreplaceable role in protecting forest specialists (i.e. slow species), intermediate stage forests should be also protected, because the large-sized networks formed by MSFs at intermediate stages can simultaneously conserve more species with varying ecological strategies.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/02/29/differences-in-mixed-species-bird-flocks-across-forest-succession-combining-network-analysis-and-trait-based-ecology-related-to-the-fast-slow-continuum/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Yong Shen, \nSergio Estrada‐Villegas, \nMaría Natalia Umaña, \nEben Goodale, \nScott Robinson, \nQing Quan, \nQiang Zhang","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"904a573b6be1bd72590f7f30dc78b39b5c683b0d3a33275cf947bc5d9efeb06c","category":"Environment"}