{"title":"The GRAS transcription factor CsTL regulates tendril formation in cucumber","link":"https://academic.oup.com/plcell/article/36/8/2818/7649240?rss=1","date":1713312000000,"content":"<span><div>Abstract</div>Cucumber (<span>Cucumis sativus</span>, <span>Cs</span>) tendrils are slender vegetative organs that typically require manual removal to ensure orderly growth during greenhouse cultivation. Here, we identified cucumber <span>tendril-less</span> (<span>tl</span>), a <span>Tnt1</span> retrotransposon-induced insertion mutant lacking tendrils. Map-based cloning identified the mutated gene, <span>CsaV3_3G003590</span>, which we designated as <span>CsTL</span>, which is homologous to <span>Arabidopsis thaliana LATERAL SUPPRESSOR</span> (<span>AtLAS</span>). Knocking out <span>CsTL</span> repressed tendril formation but did not affect branch initiation, whereas overexpression (OE) of <span>CsTL</span> resulted in the formation of two or more tendrils in one leaf axil. Although expression of two cucumber genes regulating tendril formation, <span>Tendril</span> (<span>CsTEN</span>) and <span>Unusual Floral Organs</span> (<span>CsUFO</span>), was significantly decreased in <span>CsTL</span> knockout lines, these two genes were not direct downstream targets of CsTL. Instead, CsTL physically interacted with CsTEN, an interaction that further enhanced CsTEN-mediated expression of <span>CsUFO</span>. In Arabidopsis, the <span>CsTL</span> homolog <span>AtLAS</span> acts upstream of <span>REVOLUTA</span> (<span>REV</span>) to regulate branch initiation. Knocking out cucumber <span>CsREV</span> inhibited branch formation without affecting tendril initiation. Furthermore, genomic regions containing <span>CsTL</span> and <span>AtLAS</span> were not syntenic between the cucumber and Arabidopsis genomes, whereas <span>REV</span> orthologs were found on a shared syntenic block. Our results revealed not only that cucumber CsTL possesses a divergent function in promoting tendril formation but also that CsREV retains its conserved function in shoot branching.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"904b7189464d9e5f6abed14977cfa1e904063ddbb015b925168ee4e78be8d11d","category":"Environment"}