{"title":"Folding & Furious: A 20″ Wheel-Powered Adventure – Daniel Zaid & Karla Robles","link":"https://theradavist.com/2021/08/folding-furious-a-20-wheel-powered-adventure/?utm_source=rss&utm_medium=rss&utm_campaign=folding-furious-a-20-wheel-powered-adventure","date":1628078418000,"content":"<p>Karla and I headed to Tijuana when we heard that the local government was giving the covid vaccine to anyone who wanted it. We used a <a href=\"https://ronsbikes.com/products/fabios-tech-chest-connecticut-khaki\" target=\"_blank\">Fabio’s chest</a> as luggage bags because although we didn’t bring our bikes, we had the idea of borrowing some to move around the city and try to fit in an overnighter, so we also brought our sleeping bags and bike touring tool kit. With the Baja Divide being so close the thought of jumping on it crossed our minds but we decided to settle for something that required fewer logistics and that could be started and finished from the place we were staying in.<span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Folding-Furious-2.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>When we visited our friend Irlanda’s bike bag shop, Movigo, she offered to lend us the two folding bikes she has that are her means of transport. After a test ride around the block and making sure that our Fabio’s fit on the narrow bars, we asked her if we could take them on an overnighter bikepacking trip, making full disclosure that it would most likely include riding dirt with a light load. She immediately said yes and admitted that she has been thinking of making her first-ever bike tour on one of these, but people’s comments are generally discouraging about the capabilities of a 20-inch folding bike for an endeavor such as the Trans Peninsular Route, so she wanted to find out how they performed. I told her we weren’t doing anything new since many people have traveled around the world on folding bikes, but I promised to give her an account of our experience.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Folding-Furious-18.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>One of the bikes was in a bike shop for a tune-up so we went to pick it up and made time to talk with JC, the mechanic, and owner of JC Bikes. Uncle JC, as his friends call him, is a passionate cyclist and lover of steel bikes who often hosts bike travelers going through town; there we met a cyclist from Poland who was about to embark on a trip across the peninsula and made time to get vaccinated. A local couple told us about a canyon not too far south that’s crossed by a dirt road and where there are a few options for camping, which sounded like what we were looking for so we loaded the folding bikes to head out the next day.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Folding-Furious-24.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We take the busy highway south of Tijuana which luckily has a wide shoulder; a long climb brings us out of the city then once at the top Karla disappears downhill while I take my time because these narrow bars don’t inspire me too much confidence. The town of Rosarito appears as the forever active vacation spot but we skip it as we’re itching to get out of this noisy road. Some kilometers later a giant monument of Jesus Christ overlooking the highway marks the spot where we detour and soon our little tires are crunching dirt. We can definitely tell that the bumps feel bumpier as compared to our usual touring bikes but the hard-packed soil makes for a very enjoyable ride; about an hour later we come across a fence that marks the point where private property begins, thus the fun ends. We u-turn and go to Rancho El Cascabel where we ask for a camp spot and they offer us a small cabin where we have tostadas de frijoles for dinner before going into our sleeping bags.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Folding-Furious-29.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The next morning we finish what’s left of the beans and head out to the highway, taking our time to enjoy the dirt as we leave the peace and quiet of the canyon and go back into the noise. People ask us about the bikes whenever we stop, mostly if they’re light, but they don’t feel any lighter than my steel touring frame I guess mainly because it’s a solid bar of aluminum as opposed to hollow tubes. A shopkeeper says Karla looks good on her bike but that I need to get something my size. Once back in Rosarito we go to say hi to the Pacific Ocean, which we haven’t seen since our Baja Divide trip in 2019. We sit on the sand even though there’s nowhere to hide from the sun and our skin is starting to burn; we still have a long climb to deal with, but the thought of being vaccinated gives us a little hope that we’ll be back on the road again and for a moment, everything is good.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"90567a223cdf1c944c114bd5a009d911b2a02dd89f45f1114335d51b24300828","category":"Cycling"}