{"title":"Automatic Multi-Temporal Land Cover Mapping with Fine Spatial Resolution Using the Model Migration Method","link":"https://www.preprints.org/manuscript/202410.1402/v1","date":1729231576000,"content":"Land cover refers to the combination of various material types and their natural characteristics on the Earth. Accurately mapping the spatial distribution and temporal changes of the earth's land cover is of great significance for studying the energy balance and carbon cycle of the earth system. However, there is still a high degree of human participation in the production of multi-temporal land cover products. Developing an automated method for multi-epoch land cover mapping has become a key research focus. To this end, an automatic training sample extraction method was first employed using multi-source prior land cover products. Then, based on the generated training dataset and the Random Forest classifier, local adaptive land cover classification models of the reference year were developed. Finally, by migrating the classification model to the target epoch, the multi-epoch land cover products were generated. Yuli County in Xinjiang and Linxi County in Inner Mongolia were used as test cases. The classification models were first generated in 2020 and then transferred to 2010 to enable automatic classification of multi-temporal land cover. The mapping results showed high accuracy in both regions, with Yuli County achieving 92.52% in 2020 and 88.33% in 2010, and Linxi County achieving 90.28% in 2020 and 85.28% in 2010. Additionally, uncertainty analysis of the model migration method revealed that land types such as water bodies, wetlands, and impervious surfaces, which exhibit significant spectral changes over time, are less suitable for the model migration. Our research can offer valuable insights for fine-resolution land cover mapping. Furthermore, the approach provides a scalable solution for multi-period land cover monitoring, which could facilitate more efficient and accurate environmental assessments.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"905749f66518a50aeb91acf156e7ade543ec24a8b6a459d2e615d7e48d2cf8b8","category":"Interdisciplinary"}