{"title":"Players replace Tears of the Kingdom’s patched-out item-dupe glitches","link":"https://arstechnica.com/?p=1943535","date":1685633079000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>A guide for watching \"memories\" to perfectly time a new item-duplication glitch. </p></div>\n<p>It has been only a week since Nintendo removed a number of popular <em>The Legend of Zelda: Tears of the Kingdom</em> <a href=\"https://www.polygon.com/zelda-tears-of-the-kingdom-guide/23726961/duplication-glitch-dupe\">item-duplication glitches</a> with the release of <a href=\"https://en-americas-support.nintendo.com/app/answers/detail/a_id/61936/#v112\">the game's 1.1.2 update patch</a>. But intrepid players have already found alternate methods for creating infinite items to build and fight to their heart's content.</p>\n<p>The most straightforward (if slow) new method for item duplication, as <a href=\"https://www.youtube.com/watch?v=096PCULpMgI\">described by Kibbles Gaming</a>, involves fusing an item to a weapon, preparing to throw that weapon, and then watching previously viewed cutscenes via the \"memories\" section of the Adventure Log. Each memory you view apparently advances the game's logic by a single frame, letting you easily pinpoint the four-frame timing window where you can throw a weapon while also retaining a copy in your inventory. While this method is consistent and simple to perform (even early in the game), it can take quite a while to fill up your inventory this way.</p>\n<p>A <a href=\"https://www.youtube.com/watch?v=kz101Pilkqk\">more efficient item duplication method</a> requires you to purchase Link's House near Tarry Town in the east, then place a shock emitter item near the weapon display. With good timing, you can place a weapon on that display during the same frame that the shock emitter knocks it out of your hands, thus creating two copies of the weapon (and any fused item) instantly.</p></div><p><a href=\"https://arstechnica.com/?p=1943535#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1943535&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"90583b7fbfe0e71c204804fe5f26768e70807e90a95d0deb9326ce18050aa034","category":"Tech"}