{"title":"Tour de France Femmes 2024 route: A split stage, a taste of the Ardennes, and the Alpe d'Huez","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-route","date":1698228000000,"content":"\n      <p><span>The <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> continued its success in 2023 with its second edition, which saw thousands of fans flock to the roadside to watch the race unfold as Demi Vollering went on to win the overall title. The unveiling of the 2024 Tour de France Femmes route in Paris on Wednesday proved that we are in for another exciting year for the women’s WorldTour race. </span></p>\n<div></div>\n<div></div>\n<p><span>Following a similar format to the previous two editions, the week-long race will feature a total of eight stages. However, there are two major changes to the 2024 edition. Firstly, its place on the racing calendar has been moved to a later date due to the 2024 Paris Olympics Games, with the first stage taking place on Monday August 12. This will remove itself completely from the men’s Tour de France, something the race had tried to do last year by moving the opening stage from the Champs-Élysées to Clermont-Ferrand. The Tour de France Femmes will then finish seven days later on Sunday August 18, 2024. </span></p>\n<p><span>Secondly, similarly to the men’s race, the 2024 edition of the Tour de France Femmes will feature a foreign start with the first three stages taking place in the Netherlands and the Grand Départ in Rotterdam. This is the first time the Tour de France Femmes has started outside of France and is another demonstration of how the women’s race is continuing to grow in terms of popularity and complexity.</span></p>\n<p><span>Even with the changes made to the 2024 edition, we still expect another spectacular race with battles between the stage hunters and the riders targeting the prestigious yellow jersey. </span></p>\n<h3><b>Tour de France Femmes 2024 route and map </b></h3>\n<p><span>The third edition of the Tour de France Femmes sees eight stages spread across seven days, with one day featuring a split stage, something that hasn’t been done in the Tour de France since 1991. The overall route is 946 kilometres across the Netherlands, Belgium, and France and includes an individual time trial, three flat stages, three hilly stages and two mountain stages at the end of the week. </span></p>\n<p><span>The Grand Départ takes place in the Dutch city of Rotterdam and is defined by the country’s flat, open roads. Therefore, the first stage is a prime opportunity for a sprinter in the bunch to take the first win and don the yellow jersey. The second stage is of similar parcours as the race heads back to the city for the individual time trial happening on the same day. While the ITT may be short and uncomplicated, making it a true test of speed, it’ll be a question of how well the riders can recover after already racing 67 kilometres earlier that day. Nevertheless, the opening stages in the Netherlands look to be the only opportunities for the sprinters, and they will need to make sure they make the most of it before the route heads to Belgium. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TdFF2024_map.jpg?v=1698237189\" /></span></p>\n<p><span>The 2024 route also includes some Classics-style stages with notable climbs from the Ardennes Classics'<a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/amstel-gold-race\"> Amstel Gold Race</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/liege-bastogne-liege-all-you-need-to-know-about-the-oldest-monument\">Liège-Bastogne-Liège</a>. This style of stage in the 2023 edition produced some of the most exciting racing and certainly some unpredictable outcomes. But while the middle of the race will be favoured by the puncheurs and breakaway artists, it is the end of the week that the climbers will be preparing themselves for. </span></p>\n<p><span>The Tour de France Femmes visited the Vosges in 2022, the Pyrenees in 2023, and for 2024, it’ll visit the Alps, with back-to-back mountain stages to round off the week and draw out those in contention for the yellow jersey. The first stage is a summit finish to the Le Grand-Bornand, followed by the legendary Col du Glandon and Alpe d’Huez on stage eight, the grand finale of the week. The fabled climb will be the opportunity for those to give it their all and leave everything they have on the ascent to the Alpe d’Huez to be crowned the 2024 winner. Stage eight’s elevation gain will also be the highest the race has climbed yet, with it topping the 2023 Col du Tourmalet stage by 900 metres. </span></p>\n<p>The race is seemingly a build-up in anticipation and elevation to this double-header in the mountains, and it will be a key part of winning the yellow jersey, with the Alpe d’Huez as the final decider. But the eventual yellow jersey will have some tricky days to overcome with a route that has a bit of everything, meaning they need to be a supreme all-round rider, too. </p>\n<h3><b>Stage one: Rotterdam - La Haye, 124km</b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_ONE.jpg?v=1698237204\" /></span></p>\n<p><span>The opening stage starting in the city of Rotterdam will hold no surprises for the riders as the entire 124km route is as flat as a pancake, making it a nailed on bunch sprint and a likely win for the fast finishers. The only difficulty that may arise will be the wind as the course is quite exposed as it weaves through the Dutch countryside until it reaches the urban area of La Haye for the finish where it is more sheltered.</span></p>\n<h3><b>Stage two: Dordrecht - Rotterdam, 67km </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_2.jpg?v=1698237259\" /></span></p>\n<p><span>The second day of the Tour de France Femmes sees two stages in one day, something that has been abandoned from the Tour since 1991. The first stage, stage two, is a 67km short but intense route back to Rotterdam from Dordrecht. Again, the wind could come into play, deciding how the stage will unfold. With a one kilometre straight finish, it seems another day nailed on for the sprinters, but with such a short route at just 67km, we could see more aggressive style racing from the start from those looking to make the most of the opportunity of a stage win, hampering the chances of the fast finishers getting to the end first.</span></p>\n<h3><b>Stage three: Rotterdam - Rotterdam, 6.3km individual time trial </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_THREE.jpg?v=1698237276\" /></span></p>\n<p><span>The second part of day two sees an individual time trial around Rotterdam. The course is similar to the men’s 2010 Tour de France prologue where Fabian Cancellara took the win, however, the women’s course is slightly shorter at 6.3km. There will be little for the riders to contend with, only small rises across the two bridges – Érasme and Guillaume. The route is mainly on wide, straight boulevards, so it’ll be a race against the clock for the pure specialists.</span></p>\n<h3><b>Stage four: Valkenburg - Liège, 122km </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_4.jpg?v=1698237290\" /></span></p>\n<p><span>With the first three stages centred around the sprinters and fast finishers, stage four finally welcomes some hillier terrain, making it a day for the puncheurs. Stage four is certainly made for those who flourish in the Ardennes Classics as this stage is a mix of both Amstel Gold and Liège-Bastogne-Liège. From Valkenburg, the peloton will be faced with Amstel Gold’s Bemelerberg, Cauberg, Geulhemmerberg, and Bemelerberg. </span><span>The route then heads into Belgium, riding on the same roads as <em>La Doyenne</em>, with the race’s punchy climbs defining the second half of the stage, including Mont-Theux, Côte de la Redoute, Côte des Forges, and Côte de la Roche aux Faucons. The stage boasts an elevation gain of 2,000 metres, so it’ll be the first stage with an uphill challenge.</span></p>\n<h3><b>Stage five: Bastogne - Amnéville, 150km </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_5.jpg?v=1698237359\" /></span></p>\n<p><span>Starting in Bastogne, stage five is the first time the 2024 edition enters France. It’s another stage with 2,000 metres of elevation, featuring five categorised climbs that are short but punchy. With undulating terrain from the start, getting more rugged towards the end, it could be an opportunity for the breakaway to go clear and take the stage win. But the final climb of the day, the Côte de Montois-la-Montagne (1.7km at 6%), could be the deciding factor before the short ramp to the finish. </span></p>\n<h3><b>Stage six: Remiremont - Morteau, 160km </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_6.jpg?v=1698237371\" /></span></p>\n<p><span>Another stage featuring five categorised climbs, the toughest of which comes at the end with the La Roche du Prêtre, a 5.5km climb at 5.6%, peaking at 9%. The first half of the stage is relatively easy going, but it is the second half of the stage that’ll really test the riders legs as they must haul themselves up a succession of hills favourable to the puncheurs and climbers, safely ruling out a bunch sprint in Morteau. </span></p>\n<h3><b>Stage seven: Champagnole - Le Grand-Bornand, 167km </b></h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_7.jpg?v=1698237383\" /></span></p>\n<p><span>A mountain-top finish at Le Grand Bornand plays host to the penultimate stage, a welcome sight for the pure climbers. This is also the longest stage of the race at 167 kilometres, but has over 3,000 metres of elevation gain across five categorised climbs – making it a true test of the legs. </span></p>\n<p><span>The final climb to Le Grand-Bornand is 7km long with an average gradient of 5.1%. The climb hosted </span><i><span>La Course</span></i><span> back in 2018 and was witness to the battle between Annemiek van Vleuten and Anna van der Breggen, with Van Vleuten just beating her Dutch rival to the line. In the 2024 Tour de France Femmes, we expect another battle between the GC contenders as this will be the first of two decisive days in the Alps as to who will be wearing the yellow jersey at the end of the race. </span></p>\n<h3>\n<b>Stage eight: Le Grand-Bornand - Alpe d’Huez, 150km</b><span> </span>\n</h3>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDFF24_STAGE_8.jpg?v=1698237395\" /></span></p>\n<p><span>This is the stage where the riders will need to give it their absolute all if they are aiming for the yellow jersey, especially if they didn’t manage to close any gaps on stage seven. Picked as the queen stage of the 2024 edition, stage eight features 3,900 metres of climbing and is designed for those who excel in long, uphill challenges. </span></p>\n<p><span>Starting where they left off in Le Grand-Bornand, the peloton tackles the 9.5km Col de Tamié as a warm up before facing the gruelling Col du Glandon – a 19.7km climb at 7.2% – and making their way to the third and final climb of the stage, the legendary Alpe d’Huez. Featuring 21 hairpin bends, the riders will have to climb 13.8km at an average gradient of 8.1%. Unlike last year, where the mountain test was shortened to 90km due to the sheer amount of climbing, this year’s second mountain stage remains at 150km, and will be a true test of both endurance and ability. </span>It’ll be an exciting stage from start to finish, and an explosive end to the seven-day race.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"906c63f78895c46aafafd7dc4ca940a0100e84e34a57a456a236a30f06a4133e","category":"Cycling"}