{"title":"KeePassXC ออกรายงานตรวจสอบความปลอดภัยโค้ด พบส่วนใหญ่ทำได้ดี มีข้อแนะนำปรับปรุงบางส่วน","link":"https://www.blognone.com/node/133448","date":1681632261000,"content":"<div><div><div><p>KeePassXC โปรแกรมจัดการรหัสผ่านโอเพนซอร์สเปิดเผยรายงานตรวจสอบความปลอดภัยโค้ด ที่ตรวจสอบโดย  Zaur Molotnikov ที่ปรึกษาด้านความปลอดภัย การตรวจสอบเน้นเฉพาะระบบการอ่านและเขียนฐานข้อมูลรหัสผ่าน โดยไม่ได้ตรวจสอบส่วนอื่นๆ เช่น เช่น ระบบการสุ่มรหัสผ่าน</p>\n<p>KeePassXC เป็นโครงการโอเพนซอร์สที่พัฒนาโปรแกรมโดยใช้ฐานข้อมูลร่วมกับโปรแกรม KeePass ได้ แม้จะใช้ฐานข้อมูลแบบเดียวกัน แต่ KeePass นั้นพัฒนาด้วยภาษา C# และต้องการ .NET ขณะที่ KeePassXC ใช้ภาษา C++ และพัฒนาด้วย Qt สำหรับ<a href=\"https://www.blognone.com/node/83766\">โปรแกรม KeePass เองนั้นเคยถูกตรวจสอบโดยสหภาพยุโรปเป็นผู้ให้ทุน</a></p>\n<p>แม้ไม่มีช่องโหว่ร้ายแรง แต่รายงานก็ระบุว่าไฟล์ KDBX4 นั้นปลอดภัยกว่าไฟล์ฟอร์แมตเดิมมาก  Molotnikov แนะนำให้ทางโครงการเตือนผู้ใช้เมื่อเปิดไฟล์ในฟอร์แมตเก่า และพยายามผลักดันให้ผู้ใช้ย้ายไปฟอร์แมตใหม่ และยังมีกระบวนการจัดการหน่วยความจำที่สามารถปรับปรุงเพื่อให้แน่ใจว่าไม่มีรหัสผ่านที่ไม่ได้เข้ารหัสหลงเหลืออยู่</p>\n<p>กระบวนการตรวจสอบความปลอดภัยโค้ดโดยหน่วยงานภายนอกเป็นแนวทางสำคัญในการเพิ่มความปลอดภัยซอฟต์แวร์ แต่กระบวนการนี้ก็มีข้อจำกัด เพราะการตรวจสอบคุณภาพมีค่าใช้จ่ายสูง และมักมีการจำกัดขอบเขตการทำงานไว้ชัดเจน รวมถึงการตรวจสอบก็ตรวจสอบที่เวอร์ชั่นที่ระบุเท่านั้น หลังการตรวจสอบแล้วโค้ดที่มีการพัฒนาเพิ่มเติมก็จะต้องรอการตรวจสอบรอบต่อไป</p>\n<p>ที่มา - <a href=\"https://keepassxc.org/blog/2023-04-15-audit-report/\">KeePassXC</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fb9de86ad1ce4b473f35a36ed9066a9a.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/password-manager\">Password Manager</a></div><div><a href=\"/topics/open-source\">Open Source</a></div><div><a href=\"/topics/keepass\">KeePass</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"906c5e878c9c4616bd3a88e394203952fb3243cd429f349458b9143d4039eb73","category":"Thai"}