{"title":"'I had kind of come from nowhere' - Claire Steels is just getting started at 36-years-old","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/claire-steels-is-just-getting-started-at-36-years-old-i-had-kind-of-come-from-nowhere","date":1689940415000,"content":"\n      <p><span>Claire Steels would understand if you’d barely heard of her before the 2023 season. “I think it is fair to say I had kind of come from nowhere,” she tells me via phone call from a pre <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France Femmes</a> training camp.</span></p>\n<div></div>\n<p><span>Steels, who is racing her first season as a WorldTour pro at 36-years-old, hails from Bourne in Lincolnshire but has spent the past three years living on the island of Mallorca where she balanced running a fitness coaching and cycling tour guiding business with racing on the Spanish scene with Continental squad, Sopela. </span></p>\n<p><span>“If you hadn't followed Spanish domestic cycling then you wouldn't really know anything about me really. Even in the UK scene, I'm not really particularly well known or anything just because I haven't raced in the UK for the last few years anyway,” she says. </span></p>\n<p><span>Anyone who did happen to follow the Spanish domestic scene would know Steels as a regular animator of the races in the Spanish national cup and the Basque cup, which she led after winning three of the rounds. However it wasn’t until the latter part of 2022 that things started to come together for Steels when it came to racing at UCI level. A 5th place at the 1.2 La Périgord Ladies was followed by a top-20 at the 1.1 Kreiz Breizh Elites Féminin before an impressively consistent Tour Cycliste Féminin International de l'Ardèche that netted her 8th overall. </span></p>\n<p><span>This pick up in Steels’ performance towards the end of 2022 was no coincidence. Tired of balancing her busy work schedule – which, between online workout classes and cycling guiding, would consume her whole day – alongside her sport, she decided it was time to choose one or the other. </span></p>\n<p><span>“Halfway through last year, I was running my business and I was working a lot, training a lot, racing a lot. And I just got to that point where I thought I either need to take a step up to WorldTour where I can afford to really pull back on my work and commit to cycling and make it a priority or I just need to stop and just focus on my business because doing both is it slowly but surely wearing me down,” she recalls.</span></p>\n<p><span>With the support of her team manager at Sopela, Francisco Pla Garcia, Steels decided to focus fully on becoming a pro from 2023. “He was like, ‘right, okay, let's go for WorldTour, you can't stop now, you have to see how far you can go, you owe it to yourself,’” she recalls.</span></p>\n<p><span>“He's such a great guy. I owe everything to where I am now to him. And he has taught me so much tactically about racing as well. He's a fantastic guy and a fantastic sports director.”</span></p>\n<p><span>Although she has been living in Mallorca and racing in Spain since 2020, Steels began her cycling career in the UK after moving over from duathlon. “I've always been really sporty,” she says. “I did duathlons for a few years, two years maybe, and did the GB age group programme. And then I was racing for a French duathlon team and the bike part of the duathlon was draft legal so I had to learn to ride in a bunch. I started doing the Milton Keynes Bowl midweek evening crits, and just loved it. I mean, I was terrified, but absolutely loved it.” <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00942_1024x1024.jpg?v=1689940024\" alt /></span></p>\n<p><span>Steels describes each of the upward steps that she has taken in her career as “terrifying”. </span></p>\n<p><span>“I remember, when I raced in the UK, my first national series race was the Lincoln GP, and I remember doing it and just thinking, 'what am I doing, I'm not cut out for this at all.' That was terrifying,” she recalls.</span></p>\n<p><span>Then, racing the Spanish national cup was “another step up” as was her first UCI race “I did my first UCI race and was like, 'this is this is terrifying.' But I look back to that moment, after the Lincoln GP standing by the boot of my car thinking 'I can't do this, what am I doing?' But I did do it.”</span></p>\n<p><span>Each of those “terrifying” steps within the sport helped Steels to the WorldTour contract she signed for 2023 with </span>Israel Premier Tech Roland<span>, and the results that have come with it. Beginning in January, at the Santos Tour Down Under, Steels made her presence in the WorldTour peloton known, attacking and animating the race. She then went on to race the inaugural UAE Tour women, coming 11th on the Jebel Hafeet climb. </span></p>\n<p><span>Unsurprisingly, Steels flourished throughout the Spanish block of racing in April and May, taking the win at the 1.1 ReVolta and racing the Vuelta Femenina before taking third at Durango - Durango Emakumeen Saria behind Ashleigh Moolman Pasio and Ane Santesteban.</span></p>\n<p><span>It’s been a packed calendar so far for someone still relatively new to the sport. At the time of writing, Steels had notched up 43 race days so far in 2023. </span></p>\n<p><span>“I'm a big believer in saying yes, rather than no. I don't have another 10 years left in me doing this. So I want to get as much experience as possible and have as much enjoyment from it as possible, and also help the team as much as possible. They essentially took quite a big chance on me giving me a contract.  I was 35, very nearly 36 when they agreed to take me which is quite late, and nobody really knew much about me,” she explains. </span></p>\n<p><span>“They took the word of the other sports director that I would be a good signing. So my mindset was, they've given me this great opportunity, how can I help the team as much as possible? What can I do to show that it was worth it?”</span></p>\n<p><span>However she has, she admits, had to curb her enthusiasm somewhat in order to maximise her performance in her target races. </span></p>\n<p><span>“But then as the season has progressed, it has become sort of more obvious and more apparent that to get those good results I do need more rest and more recovery and you can't race all the time. So – believe it or not – we have removed some race days from the calendar. May was particularly hard for me. Because a lot of it's been stage racing as well…But at the start of the year I wanted to do the Giro and the Tour and do the double, but I quickly changed my mind on that.”</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-01318_1024x1024.jpg?v=1689940040\" alt />What Steels may lack in race experience, she makes up for in life experience which allows her to take a more pragmatic approach to her career than those for whom the sport has played an all-consuming role in their whole life.</span></p>\n<p><span>“Who I am isn't defined by how I race. At the end of the day, it's entertainment, and it's just a bike race. It's a job that I love. But it isn't the be all and end all for me. And I think that allows you to not get caught up in getting stressed if things aren't going to plan or getting frustrated or annoyed or upset if you're on a crap training day, or you can't hit the numbers or you crash or you don't have a great race or anything like that. It's just a bike race. It's fine,” she says.</span></p>\n<p><span>“A terrible day at this job is better than some very good days at other jobs I've had. So it's easier to put it into perspective when you've had terrible jobs before.”</span></p>\n<p><span>One of Steels’ standout performances came in her most recent race, the British National Championships. On a gruelling course around Saltburn-by-the-Sea that culminated on a tough rise to the line, Steels took second place behind Pfeiffer Georgi of Team DSM and ahead of Anna Henderson of Team Jumbo Visma. “I really enjoyed that. I like climbing. It was good fun in a certain type of way,” Steels says of the race.</span></p>\n<p><span>“I really enjoy climbing. The mountains, they feel freeing. And, this sounds awful, but I quite enjoy the suffering of climbing. I can't explain it. It's just I think you either love it or you hate it. I would say I'm learning that I prefer one day races to stage races on the whole. Which a lot of people are surprised about, I just really liked the attacking nature of a one day race. So similar to the Nationals, that was so much fun, just being able to drive things forward and attack and push rather than playing that slow waiting game of GC riding. </span></p>\n<p><span>Don't get me wrong, I really enjoy that as well. But if I had to have a preference, it would be more of a one day race than a stage race.” </span></p>\n<p><span>Her performances to date this season point towards a potential selection for the World Championships in Glasgow next month, which, says Steels “would be an absolute dream come true.” </span></p>\n<p><span>“That sort of thing is something I've always wanted from a young age, not necessarily in cycling obviously because as a young girl I didn't know that I was going to be a cyclist, but, you know, watching the Olympics and watching various World Championships of different sports. I just always wanted that GB kit. So the opportunity to represent my country, and all the pride and all the emotions that come with that – it would be a very special opportunity and special moment for me, but we'll see.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW9_9899_1024x1024.jpg?v=1689940066\" alt /></span></p>\n<p><span>Even if Worlds doesn’t work out, Steels still has her debut at the Tour de France Femmes to look forward to where she, alongside teammate Tamara Dronova, can show off her climbing skills on the Tourmalet.</span></p>\n<p><span>“To be honest as a young girl I didn't really know much about it at all,” she says of the Tour.  “And until recently, it wasn't an option for any female, let alone me. So I was hopeful when I started this year that I would be doing it. And it's very, very exciting. Very cool that I'm doing it. </span></p>\n<p><span>I'm really looking forward to the Tourmalet, being the climber that I am. And after the Tour de Suisse [where she came seventh in the ITT], I'm kind of looking forward to the time trial as well. Which I think, as a cycling fan, it's really exciting that we finish with the time trial. It keeps the race a lot more open than just a summit finish.”</span></p>\n<p><span>At 36, Steels may be one of the oldest Tour debutants but her career is just getting started.</span></p>\n<p><span>“I joke with some of my younger teammates, like, ‘just you wait till you're my age,’ like, I just need a couple of days to get over the last race. Or if we go for a ride the next day, I'm like, ‘I'll start like an hour before you because my whole body needs time to get going,’” she says.</span></p>\n<p><span>“But actually, I don't want to stop anytime soon. And I feel as though I've worked so hard to get to this. To be a professional athlete has been a dream of mine and now I'm here I feel as though I'm living the life and the lifestyle that I was supposed to live. And I don't want to give that up until I absolutely have to, whether that will be a combination of lack of physical ability, and also lack of sort of mental desire. But as long as I do want to and as long as I still can and as long as a team will still take me then I want to keep going as long as possible.”</span></p>\n<p><span>Even once she reaches that point, Steels says, “I don't see myself leaving the sport anytime soon at all.”</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"906f92ed8a9fad90826048b5956a036ddcd724b2cf9bb75c54373fdc74852f26","category":"Cycling"}