{"title":"iPhone's Roadside Assistance via Satellite Feature Tested in New Video","link":"https://www.macrumors.com/2023/11/20/iphone-roadside-assistance-feature-tested/","date":1700509575000,"content":"Starting with iOS 17, all iPhone 14 and iPhone 15 models offer a <a href=\"https://www.macrumors.com/2023/09/12/roadside-assistance-via-satellite/\">roadside assistance via satellite feature</a> that allows users in the U.S. to contact roadside assistance company AAA for vehicle service when outside of cellular and Wi-Fi coverage. In a <a href=\"https://www.youtube.com/watch?v=wf1c6oGZNrw\">video shared today</a>, tech reviewer Brian Tong provided a look at the feature in action.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/apple-roadside-assistance.jpg\" width=\"1596\" height=\"897\" />\r<br />\nTo use the feature, open the Messages app and start a new message. Next, type \"roadside\" into the address field. When there is no cellular and Wi-Fi coverage available, a \"Roadside Assistance\" option will appear. Tap on \"Roadside Assistance\" and follow the on-screen instructions to connect your iPhone to a Globalstar satellite and request help from AAA. You'll need to be outside with a clear view of the sky and horizon, according <a href=\"https://support.apple.com/en-us/HT213886\">to Apple</a>.\r<br />\n\r<br />\nTong demoed the feature by having AAA come to jump-start his car's battery. The feature can also be used if you are locked out of your vehicle, have a flat tire, run out of fuel, and for other services offered by AAA.\r<br />\n\r<br />\n<div></div>\r<br />\nThe feature is included free for two years starting at the time of activation of any new iPhone 14 or iPhone 15 model, with service covered per your AAA membership plan. If you aren't a AAA member, you can still use the service on a pay-per-use basis.\r<br />\n\r<br />\nApple said roadside assistance via satellite is available \"beginning\" in the U.S., suggesting that it will expand the feature to additional countries over time, but it has not provided any specific details. In Canada, there is a AAA-like organization called CAA, so it would make sense for the service to expand to that country eventually.\r<br />\n\r<br />\nRoadside assistance via satellite is an extension of the Emergency SOS via satellite feature. Apple recently <a href=\"https://www.macrumors.com/2023/11/15/emergency-sos-extra-year-iphone-14/\">extended free usage of the satellite features</a> for an additional year.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-17/\">iOS 17</a>, <a href=\"https://www.macrumors.com/roundup/ipados-17/\">iPadOS 17</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/ios-17.241\">iOS 17</a>, <a href=\"https://forums.macrumors.com/forums/ipados-17.242\">iPadOS 17</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/11/20/iphone-roadside-assistance-feature-tested/\">iPhone's Roadside Assistance via Satellite Feature Tested in New Video</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphones-roadside-assistance-via-satellite-feature-tested-in-new-video.2411543/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9073950f3c182a24ef96ee488452ebbe7f4c1f5c12188e291dba875d8e0b9558","category":"Apple"}