{"title":"What to Expect From October 18 'Unleashed' Apple Event: New MacBook Pros, AirPods 3 and More","link":"https://www.macrumors.com/guide/october-18-apple-event-what-to-expect/","date":1634332249000,"content":"Apple's first fall event of 2021 focused on the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and the Apple Watch, but the second, set to be held on Monday, October 18, is expected to be Mac-centric. The upcoming event will see the debut of the highly anticipated 14 and 16-inch MacBook Pro models, plus we could also get refreshed <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> and a new <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a>.\r\n<br />\r\n\r\n<br />\r\n<div></div><div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nThis guide highlights everything that we might see at the October event based on the rumors that we've heard so far.\r\n<br />\r\n\r\n<br />\r\n<h2>14 and 16-inch MacBook Pro Models</h2>\r\n<br />\r\nIt's been two years since the 16-inch MacBook Pro models last saw a refresh, and we're long overdue for an update. We've been hearing rumors about significantly redesigned 14 and 16-inch MacBook Pro models for many months now, making this one of the most anticipated refreshes of the year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Ports-2021-MacBook-Pro-Mockup-Feature-1-copy.jpg\" />\r\n<br />\r\nApple is expected to introduce new 14 and 16-inch MacBook Pro models with a design update that features the same flat-edged look we've seen introduced for the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a>, <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a>, <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a>, and <a href=\"https://www.macrumors.com/roundup/ipad-mini/\">iPad mini</a>, but on the MacBook Pro, don't expect the new machines to look too wildly different.\r\n<br />\r\n\r\n<br />\r\nThe new MacBooks will have slimmer bezels and will lack \"MacBook Pro\" wording at the bottom to save space. In a callback to the MacBook Pros of yore, Apple is planning to reintroduce ports that have been missing since the 2016 refresh. We're expecting an SD card slot and an HDMI port, which will join the USB-C ports and headphone jack.\r\n<br />\r\n\r\n<br />\r\nThe 2021 machines will also see the return of <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, and will feature a breakaway ‌MagSafe‌ charging port that's not too different from the ‌MagSafe‌ port that Apple used for pre-2016 machines. ‌MagSafe‌ technology may bring faster charging speeds than are available with USB-C, but specific details aren't known yet. As expected, ‌MagSafe‌ will require a new charging cable design and an updated power adapter.\r\n<br />\r\n\r\n<br />\r\nContinuing on with the return to a classic design, the 2021 MacBook Pro models will not have an interactive OLED Touch Bar, with Apple instead opting for a standard row of function keys.\r\n<br />\r\n\r\n<br />\r\nA <a href=\"https://www.macrumors.com/2021/10/15/new-macbook-pro-could-have-a-notch/\">last minute rumor</a> from Weibo has suggested the upcoming MacBook Pro models will feature a notch at the top that houses the webcam, which could suggest very thin bezels. This notch, says the leaker, will be similar in size to the notch on the <a href=\"https://www.macrumors.com/roundup/iphone-12/\">iPhone 12</a>. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/MacBook-Pro-Notch-Feature.jpg\" />\r\n<br />\r\nThis rumor might sound implausible, but looking at the resolutions of the two machines, it's not out of the realm of possibility. The MacBook Pro models feature resolutions of 3024 by 1964 and 3456 by 2234, and if you subtract 74 pixels from the height of both for the alleged notch, the resulting 3024 by 1890 and 3456 by 2160 resolutions are equivalent to a 16:10 aspect ratio. \r\n<br />\r\n\r\n<br />\r\nAll of Apple's existing MacBooks feature a 16:10 aspect ratio, so a 74 pixel notch could theoretically happen, but it's not clear how that would work with the macOS interface. The 74 pixel bar at the top could be used for some other purpose than a notch, but we don't know what. A follow-up <a href=\"https://www.macrumors.com/2021/10/16/macbook-pro-notch-alleged-photo/\">alleged photo leak of a MacBook Pro display</a> indeed shows a notch, along with almost non-existent bezels.\r\n<br />\r\n\r\n<br />\r\nAlong with the notch, the original rumor claims that the entire keyboard area of the new MacBook Pro is black rather than just the keys, and that the new machines will be thicker with larger fans. \r\n<br />\r\n\r\n<br />\r\nAs for display technology, Apple is expected to use mini-LED, and the MacBook Pro models will be the second Apple devices to feature mini-LED displays after the 2021 12.9-inch ‌iPad Pro‌. ‌<a href=\"https://www.macrumors.com/guide/mini-led/\">Mini-LED</a>‌ technology will allow for a thinner and lighter design, while offering many OLED-like benefits such as improved wide color gamut, high contrast and dynamic range, and truer blacks.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/Mini-LED-MacBook-Pro-Feature.jpg\" />\r\n<br />\r\nRumors suggest that 120Hz \"ProMotion\" refresh rates are also a possibility, though this isn't a sure thing just yet. With ProMotion, the MacBook Pro models would offer a variable refresh rate. The maximum 120Hz refresh rate would bring smoother scrolling, gameplay, and other benefits, while at the lower end, a slower refresh rate would conserve energy when high frame rates are not required, preserving battery life.\r\n<br />\r\n\r\n<br />\r\nTrue 2x retina resolutions also appear to be coming based on display details that leaked in a recent <a href=\"https://www.macrumors.com/roundup/macos-12/\">macOS Monterey</a> update. The 14 and 16-inch MacBook Pros are expected to feature a display resolution of 3024 x 1964 and 3456 x 2234, respectively.\r\n<br />\r\n\r\n<br />\r\nWith the updated 14 and 16-inch MacBook Pro models, Apple will eliminate Intel chips from the MacBook lineup. The new machines will be equipped with a faster and more powerful \"M1X\" chip that builds on the technology introduced with the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a>. The M1X is expected to The M1X could feature a 10-core CPU with eight high-performance cores and two energy-efficient cores, along with 16-core or 32-core GPU options.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/M1X-MBP-Feature.jpg\" />\r\n<br />\r\nThe new MacBook Pro models are expected to support up to 64GB RAM, and both may have feature parity due to Apple's plans to use the same M1X chip for the 14 and 16-inch sizes. Because both machines will be similar, pricing differences between the two sizes will be less pronounced than prior generations. Base models are expected to feature 16GB RAM and 512GB storage with upgrades available at higher price points.\r\n<br />\r\n\r\n<br />\r\nThere's one other notable feature that Mac users will be pleased to hear about - webcam improvements. The new machines are rumored to feature an updated 1080p webcam, which would be the first significant webcam improvement introduced in a MacBook. Current models use years-old 720p technology, but the need for improved video quality has increased due to the prevalence of online work over the past two years.\r\n<br />\r\n\r\n<br />\r\nFor more on what to expect from the MacBook Pro, we have a <a href=\"https://www.macrumors.com/guide/14-inch-macbook-pro/\">dedicated MacBook Pro guide</a> that aggregates all of the rumors that we've heard about the upcoming machines.\r\n<br />\r\n\r\n<br />\r\n<h2>AirPods 3</h2>\r\n<br />\r\nApple is developing a new version of the ‌AirPods‌ and rumors say they're ready to go, so it's possible we'll see an announcement at the October event. That said, we also expected to see the ‌AirPods‌ introduced in September alongside new iPhones, which did not happen, so Apple could also hold the launch until later in the year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/AirPods-Gen-3-Feature-2.jpg\" />\r\n<br />\r\nThe ‌‌AirPods‌‌ 3 are expected to feature a more ‌‌AirPods‌‌ Pro-like design with shorter stems and a redesigned charging case, but they'll continue to be available at a more affordable price point and won't have high-end features like Active Noise Cancellation. More about what to expect from the ‌AirPods‌ 3 can be <a href=\"https://www.macrumors.com/guide/airpods-3/\">found in our dedicated guide</a>.\r\n<br />\r\n\r\n<br />\r\n<h2>Mac mini</h2>\r\n<br />\r\nApple is working on a <a href=\"https://www.macrumors.com/roundup/mac-mini/\">high-end version</a> of the ‌Mac mini‌ with an updated design and the same \"M1X\" chip that's expected to be used in the MacBook Pro, so it's possible we'll see a new ‌Mac mini‌ at the event.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/02/m1-mac-mini-screen.jpg\" />\r\n<br />\r\nThe new machine is rumored to have a design similar to the current ‌Mac mini‌, but with a smaller footprint and a \"plexiglass-like top\" that sits over the aluminum enclosure. It will feature four Thunderbolt ports, two USB-A ports, an Ethernet port, and an HDMI port, much like current models, but it is expected to swap to the same magnetic power power port that Apple first introduced for the 24-inch <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a>.\r\n<br />\r\n\r\n<br />\r\n<em>Bloomberg</em>'s Mark Gurman said in August that the refreshed ‌Mac mini‌ would be coming in the \"next several months,\" which lines up well with August. The ‌Mac mini‌ is expected to replace the Intel ‌Mac mini‌ that Apple is still selling, and it will be sold alongside the current ‌M1‌ ‌Mac mini‌.\r\n<br />\r\n\r\n<br />\r\n<h2>macOS Monterey Launch Date</h2>\r\n<br />\r\n<a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a>, <a href=\"https://www.macrumors.com/roundup/watchos-8/\">watchOS 8</a>, and tvOS 15 all launched in September, but we're still waiting on ‌macOS Monterey‌, which Apple continues to beta test.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/macOS-Monterey-on-MBP-Feature.jpg\" />\r\n<br />\r\nNew versions of macOS often come later than other software updates, and at the October event, we're expecting to hear a release date. Apple's upcoming 14 and 16-inch MacBook Pro models will presumably ship with ‌macOS Monterey‌, so the software needs to launch before they do.\r\n<br />\r\n\r\n<br />\r\n<h2>In the Works But Not Expected Yet</h2>\r\n<br />\r\nThere are also several other devices that are in development, but most of these are rumored for 2022. That said, Apple could surprise us or do pre-announcements, so we thought these upcoming devices might also be worth mentioning.\r\n<br />\r\n<ul>\r\n<br />\r\n <li><a href=\"https://www.macrumors.com/roundup/macbook-air/\"><strong>MacBook Air</strong></a> - Rumored to have a mini-LED display, a new Apple silicon chip, and multiple color options, the <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> refresh is expected in 2022.</li>\r\n<br />\r\n <li><a href=\"https://www.macrumors.com/roundup/ipad-air/#whats_next_for_the_ipad_air\"><strong>iPad Air</strong></a> - The next-generation ‌iPad Air‌ may feature an OLED display and Pro-level features like 5G connectivity, LiDAR, and new cameras and speakers, but it's not rumored to be coming until 2022.</li>\r\n<br />\r\n <li><a href=\"https://www.macrumors.com/guide/upcoming-apple-products/\"><strong>AirPods Pro</strong></a> - Apple is working on a new version of the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> with a stemless design and a new wireless chip, and these could come in 2022.</li>\r\n<br />\r\n <li><strong><a href=\"https://www.macrumors.com/roundup/imac/\">Larger iMac</a></strong> - There's another ‌iMac‌ in the works that has a larger display and a faster Apple silicon chip, but little is known about it and it's not expected in 2021.</li>\r\n<br />\r\n <li><strong><a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a></strong> - Apple is developing two versions of the <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>, one of which will feature a redesigned chassis that's smaller in size. The new ‌Mac Pro‌ models will feature high-end Apple silicon chip options with 20 or 40 computing cores, made up of 6 high-performance or 32 high-performance cores and four or eight high-efficiency cores. We don't yet know when the new ‌Mac Pro‌ models are coming.</li>\r\n<br />\r\n</ul>\r\n<br />\r\n<h2>How to Watch</h2>\r\n<br />\r\nThe 'Unleashed' event will kick off on Monday, October 18 at 10:00 a.m. Pacific Time. Apple will live stream the event <a href=\"https://www.apple.com/apple-events/\">on its website</a> and on YouTube.\r\n<br />\r\n\r\n<br />\r\nFor those unable to watch, MacRumors will have live coverage of the event both on MacRumors.com and through our <a href=\"https://twitter.com/macrumorslive?lang=en\">MacRumorsLive Twitter account</a>.\r\n<br />\r\n\r\n<br />\r\n<b>Update 8:30 a.m. October 16</b>: Added mention of alleged MacBook Pro display photo leak.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro-13/\">MacBook Pro 13\"</a>, <a href=\"https://www.macrumors.com/roundup/macbook-pro/\">MacBook Pro 16\"</a>, <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/october-2021-apple-event/\">October 2021 Apple Event</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods\">AirPods (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_13\">13\" MacBook Pro (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#MacBook_Pro_16\">16\" MacBook Pro (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#Mac_Mini\">Mac Mini (Neutral)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a>, <a href=\"https://forums.macrumors.com/forums/macbook-pro.90\">MacBook Pro</a>, <a href=\"https://forums.macrumors.com/forums/mac-mini.146\">Mac mini</a></div><br />This article, \"<a href=\"https://www.macrumors.com/guide/october-18-apple-event-what-to-expect/\">What to Expect From October 18 'Unleashed' Apple Event: New MacBook Pros, AirPods 3 and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/what-to-expect-from-october-18-unleashed-apple-event-new-macbook-pros-airpods-3-and-more.2317133/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=H_hRKX7ye24:X5hH3PH8l5k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=H_hRKX7ye24:X5hH3PH8l5k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/H_hRKX7ye24\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9075fe16ad7dafdea5bb3617c2b16fe0f75fc7b1f35f170e0cb982a67555bab1","category":"Apple"}