{"title":"ADAMTSL2 is a potential prognostic biomarker and immunotherapeutic target for colorectal cancer: Bioinformatic analysis and experimental verification","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303909","date":1717077600000,"content":"<p>by Zhe Huang, Xu Hu, Yiqiu Wei, Yousheng Lai, Jiaming Qi, Jinglin Pang, Kang Huang, Huagui Li, Pengzhu Cai</p>\r\n\r\nThe ADAMTS Like 2 (ADAMTSL2) mutation has been identified to be associated with different human genetic diseases. The role of ADAMTSL2 is unclear in colorectal cancer (CRC). The study investigated the expression of ADAMTSL2 in both pan cancer and CRC, using data from The Cancer Genome Atlas (TCGA) database to assess its diagnostic value. The study examined the correlation between ADAMTSL2 expression levels and clinical characteristics, as well as prognosis in CRC. The study explored potential regulatory networks involving ADAMTSL2, including its association with immune infiltration, immune checkpoint genes, tumor mutational burden (TMB) / microsatellite instability (MSI), tumor stemness index (mRNAsi), and drug sensitivity in CRC. ADAMTSL2 expression was validated using GSE71187 and quantitative real-time PCR (qRT-PCR). ADAMTSL2 was aberrantly expressed in pan cancer and CRC. An increased level of ADAMTSL2 expression in patients with CRC was significantly associated with the pathologic N stage (<i>p</i> &lt; 0.001), pathologic stage (<i>p</i> &lt; 0.001), age (<i>p</i> &lt; 0.001), histological type (<i>p</i> &lt; 0.001), and neoplasm type (<i>p</i> = 0.001). The high expression of ADAMTSL2 in patients with CRC was found to be significantly associated with a poorer overall survival (OS) (HR: 1.67; 95% CI: 1.18–2.38; <i>p</i> = 0.004), progression-free survival (PFS) (HR: 1.55; 95% CI: 1.14–2.11; <i>p</i> = 0.005) and disease-specific survival (DSS) (HR: 1.83; 95% CI: 1.16–2.89; <i>p</i> = 0.010). The expression of ADAMTSL2 in patients with CRC (<i>p</i> = 0.009) was identified as an independent prognostic determinant. ADAMTSL2 was associated with extracellular matrix receptor (ECM-receptor) interaction, transforming growth factor β (TGF-β) signaling pathway, and more. ADAMTSL2 expression was correlated with immune infiltration, immune checkpoint genes, TMB / MSI and mRNAsi in CRC. ADAMTSL2 expression was significantly and negatively correlated with 1-BET-762, Trametinib, and WZ3105 in CRC. ADAMTSL2 was significantly upregulated in CRC cell lines. The high expression of ADAMTSL2 is significantly correlated with lower OS and immune infiltration of CRC. ADAMTSL2 may be a potential prognostic biomarker and immunotherapeutic target for CRC patients.","author":"Zhe Huang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"90795cbb54344793a35d07db3a102b82244d6883417e15b9a67faba0feaa7b3c","category":"Interdisciplinary"}