{"title":"Maximizing Computation Rate for Sustainable Wireless Powered MEC network: An Efficient Dynamic Task Offloading Algorithm with User Assistance","link":"https://www.preprints.org/manuscript/202407.1542/v1","date":1721333194000,"content":"In the Internet of Things (IoT) era, Mobile Edge Computing (MEC) significantly enhances the efficiency of smart devices but is limited by battery life issues. Wireless Power Transfer (WPT) addresses this issue by providing a stable energy supply. However, effectively managing overall energy consumption remains a critical and under-addressed aspect for ensuring the network’s sustainable operation and growth. In this paper, we consider a WPT-MEC network wit user cooperation to migrate the double near-far effect for the mobile node (MD) far from the base station. We formulate the problem of maximizing long-term computation rates under a power consumption constraint as a multi-stage stochastic optimization (MSSO) problem. This approach is tailored for a sustainable WPT-MEC network, considering the dynamic and varying MEC network environment, including randomness in task arrivals and fluctuating channels. We introduce a virtual queue to transform the time-average energy constraint into a queue stability problem. Using the Lyapunov optimization technique, we decouple the stochastic optimization problem into a deterministic problem for each time slot, which can be further transformed into a convex problem and solved efficiently. Our proposed algorithm works efficiently online without requiring further system information. Rigorous mathematical analysis shows that our algorithm achieves O(1/V),O(V) trade-off between computation rate and queues stability. Extensive simulation results demonstrate that our proposed algorithm outperforms baseline schemes, achieving approximately 4% enhancement while maintain the queues stability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"907a22823003416592254eb279cf377bdb923e6e7b17e8caaffe8b63d54b2197","category":"Interdisciplinary"}