{"title":"Chitosan-Stabilized Liposomal Nanocarriers for Medicinal Plant Extracts from the Bulgarian Flora with Anti-coronavirus Activity","link":"https://www.preprints.org/manuscript/202405.0084/v1","date":1714644227000,"content":"The difficulties faced by the society in its goal of reducing mortality and improving the health status during the period of the COVID-19 pandemic showed that it is necessary to develop new approaches in the therapy of infectious diseases, leading to higher treatment efficiency and few side effects. The subject of the present study is the formation and characterization of the proper-ties of stable liposomes loaded with extracts from Bulgarian medicinal plants and monitoring their antiviral action against the human strain of coronavirus OC43 (HCoV-OC43) in vitro. The hydrodynamic diameter and -potential of the liposomes containing each type of payload were determined with DLS and electrokinetics. The encapsulated amount of extracts was evaluated against quercetin and gallic acid by using colourimetric methods. The BALB 3T3 Neutral Red Uptake (NRU) phototoxicity/cytotoxicity assay was used to estimate the safety of the compounds. For assessment of the antiviral activity against HCoV-OC43 of liposomes (Lip) containing medicinal plant extracts, the cytopathic effect inhibition test was used. Measurements of the virucidal activity and the effect on the virus adsorption stage was carried out using the endpoint dilution method, and ∆lgs were calculated by comparison with untreated controls. The estimated photo irritation factors (PIF) for the Lip containing extracts were &lt; 2 which assigns them to the category of non-phototoxic substances. When the extracts were introduced into the liposomes as their carriers, the antiviral activity of the vesicles against the replication of HCoV-OC43 in vitro in-creased by several times compared to their individual activity described in our previous study. The determination of the effect of structures loaded with extracts on the extracellular virions and the stage of their adsorption to sensitive HCT-8 cells proved that the liposomes do not affect directly the viral surface or cell membrane, but only perform a function of carriers of the active substances and the observed result is due solely to the intracellular action of the extracts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"907cfa678091fa68e62d9185715572b60fd9300289f10a54c9ff71b26c774b39","category":"Interdisciplinary"}