{"title":"Hypoxia‐Associated GPNMB+ Macrophages Promote Malignant Progression of Colorectal Cancer and Its Related Risk Signature Are Powerful Predictive Tool for the Treatment of Colorectal Cancer Patients","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24426?af=R","date":1728104357000,"content":"<h2>ABSTRACT</h2>\n<p>Colorectal cancer (CRC) is a highly malignant tumor with hypoxia being a crucial feature during its progression. This study utilized multiple independent CRC cohorts for bioinformatics analysis and in vitro experiments to investigate the role of hypoxia-related subgroups in CRC. Machine learning was employed to construct risk features associated with this subgroup and further explore its therapeutic value in CRC. The study identified the GPNMB+ Macrophage (GPNMB+ Macr) subgroup as most relevant to hypoxia. GPNMB+ Macr showed significantly higher infiltration in tumor tissues compared to non-tumor tissues, increasing with CRC stage. High infiltration of GPNMB+ Macr was associated with poor prognosis in terms of overall and recurrence-free survival in CRC patients. GPNMB+ Macrophages exhibit M2-like characteristics and have the ability to promote 5-FU resistance, proliferation, and metastasis of CRC cells. The study developed the Hypoxia-Related Macrophage Risk Score (HMRS), which not only served as an independent prognostic factor for CRC patients but also demonstrated robust prognostic performance compared to 84 previously published prognostic features. Patients with low HMRS were sensitive to fluorouracil, oxaliplatin (FOLFOX), and anti-PD-1 immunotherapy, while those with high HMRS showed resistance. Additionally, HMRS was identified as an independent prognostic factor in other digestive tract tumors (hepatocellular carcinoma, pancreatic cancer, esophageal cancer, and gastric cancer), indicating potential extrapolation to other tumor types. In conclusion, GPNMB+ Macr promotes the malignant progression of CRC, and HMRS serves as a powerful predictive tool for prognosis, chemotherapy, and immunotherapy in CRC patients, aiding in improving the quality of survival.</p>","author":"Junli Zhang, \nShangshang Hu, \nXinxin Jin, \nYiwen Zheng, \nLianchen Yu, \nJunrao Ma, \nBiao Gu, \nFen Wang, \nWenjuan Wu","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"9082bc448e0739c4e3724d8dc5aee9edf8f69c340b21a654c2566c07268ddebd","category":"Environment"}