{"title":"BikeRadar’s Tour de France Podcast | Episode 1 – Who will win the Tour? And our tech predictions!","link":"https://www.bikeradar.com/news/tour-de-france-podcast/","date":1624620964000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Primoz-Roglic-Tadej-Pogacar-4419293.jpg?quality=45&amp;resize=620,413\" />                                            <p></p><div>\n    <div>\n        \n    </div>\n</div>\n\n<p>Here we go! It’s the eve of the <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a>, with the 108th edition of cycling’s greatest race due to roll out of Brest on Saturday (26 June).</p>\n<p>The opening stage should, we hope, serve as a mouth-watering aperitif for the next three weeks – 176km and six categorised climbs on the rolling roads of Brittany.</p>\n<p>This year, we’ll be ramping up the BikeRadar Podcast through the Tour de France and, with the Grand Départ upon us, it’s time to kick things off with episode one.</p>\n<p>In this bumper episode, BikeRadar’s editor-in-chief George Scott is joined by deputy editor Jack Luke and technical writer to talk all things Tour.</p>\n<p>Who will win this year’s race? How is the green jersey competition shaping up? Can Mark Cavendish add to his total of 30 Tour de France stage wins? And what does the Tour hold in store for Chris Froome?</p>\n<p>We’ve got Tour tech covered, too. What new <a href=\"https://www.bikeradar.com/features/pro-bike/tour-de-france-bikes/\">Tour de France bikes</a> can we expect to see? And what are our tech predictions for the next three weeks?</p>\n<p>We’ve got plenty more coming from the Tour, including our favourite climbs, the tech that’s defined Tour de France history and, of course, the latest bikes and equipment our eagle-eyed tech writers spot.</p>\n<p>Don’t forget to subscribe to the BikeRadar Podcast via <a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\">Apple</a> or <a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\">Spotify,</a> or just search for us on your preferred podcast provider, so you don’t miss an episode.</p>\n<p><a href=\"https://podcasts.apple.com/gb/podcast/the-bikeradar-podcast/id1461106709\" target=\"_blank\"><div>\n    <img /></div></a></p>\n<p><a href=\"https://open.spotify.com/show/6aLvE13Bge7WC7AWbiR3LS\" target=\"_blank\"><div>\n    <img /></div></a></p>\n<p> </p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"90855dfb5c37164084dc57ba0f84d9f2dc7d71f32badbf6779d67aeb8148b884","category":"Cycling"}