{"title":"PSIII-29 Evaluating the efficacy of bioelectrical impedance analysis using machine learning models for the classification of parasitized goats","link":"https://academic.oup.com/jas/article/102/Supplement_3/458/7757675?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Rapid identification and evaluation of animal health condition is one of the most important concerns when it comes to livestock productivity, particularly for small ruminants susceptible to infection from blood-feeding gastrointestinal nematodes, like <span>Haemonchus contortus</span>. The present study was designed to optimize the process of differentiating parasite infected goats from healthy goats. This study used male intact Spanish goats (n = 65), aiming to establish a proof of concept for the efficacy of bioelectrical impedance, specifically through the metrics of Resistance, and Reactance, in identifying the health status of goats. The research involved the development and comparative analysis of seven machine learning (ML) models, divided into four classification-based models and three regression models, to assess their capabilities in accurately classifying goats based on bioelectrical properties. The data for this study were gathered from live animals using CQR 3.0 (Sea food analytics), with measurements taken from both ear and tail ends to ensure comprehensive and reliable bioelectrical readings. Among the classification models evaluated, the Random Forest Classification model emerged as the most effective, demonstrating a validation accuracy of 71.8% and a testing accuracy of 77.1%. This was closely followed by the K-NN Classification model, which showed a promising testing accuracy of 86.7%. Conversely, the Support Vector Machines and Boosting Classification models displayed decreased accuracies, indicating variability in the performance of classification models in this context. The regression models, evaluated through metrics such as Mean Squared Error (MSE) and R-square, revealed the K-NN Regression model as the most proficient, with the least Test MSE of 0.13 and an R-square of 0.482. This suggests a moderate correlation and predictive capability in determining the health status of goats based on bioelectrical impedance measurements. The Decision Tree Regression and Support Vector Regressor models showed varying degrees of effectiveness, with the latter indicating a minimal R-square value, highlighting the challenges in applying regression models to this domain. The conducted proof of concept research not only underscores the potential of bioelectrical impedance analysis in veterinary diagnostics, but also opens avenues for further refinement of ML algorithms in classifying and predicting the health status of farm animals. The outcomes of this study could significantly influence management strategies for small ruminants, offering a non-invasive, rapid, and potentially cost-effective tool for early detection of parasitism, thereby enhancing animal welfare and productivity in the agricultural sector.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"908a8a0100ded286813f91e7890edfe9601ff84327c49b36bffd350c69a18707","category":"Environment"}