{"title":"Vertical and temporal flight patterns of coffee berry borer (Coleoptera: Curculionidae) in Hawaii","link":"https://academic.oup.com/ee/article/53/4/640/7684658?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Coffee berry borer (<span>Hypothenemus hampei</span> Ferrari) (Coleoptera: Curculionidae) is the most damaging insect pest of coffee worldwide, causing significant losses in coffee yields and quality. Knowledge of vertical and temporal flight patterns in coffee berry borer could be used to optimize spray timing and precision targeting of areas within the coffee tree, which may be more susceptible. In the present study, we estimated the vertical distribution of coffee berry borer females using traps set at 1-m intervals up to 5 m in height. We also quantified coffee berry borer infestation in the low, mid, and high canopy and documented fruit availability. Temporal flight patterns were estimated using timer traps, and correlation analyses were conducted to determine the relationship between the timing of daily flight and weather variables. Across the 4 study sites, we observed that 77%–84% of the trap catch was at 1 m, 11%–20% was at 2 m, and 1%–4% was at 3–5 m in height. Fruit infestation was significantly higher in the low branches (35%) relative to the high branches (17%). Flight height remained the same year-round, regardless of fruit availability. Coffee berry borer flew in low numbers during the day and night but peaked from 12 to 4 PM. Daily flight was positively correlated with an increase in air temperature and wind speed and negatively correlated with relative humidity. Findings from this study suggest that pesticide sprays should target low- to mid-level branches at 1–2 m in height and aim to be conducted in the early afternoon when coffee berry borer are actively flying and most vulnerable to chemical controls.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"908a58c3b87214a70223b49d582f7ad1cb076151ae97c14c76ef2f6363b6eff0","category":"Environment"}