{"title":"Determining land subsidence potential using the evidential belief function model: A case study for the Bardaskan Aquifer, Iran","link":"https://onlinelibrary.wiley.com/doi/10.1111/nrm.12397?af=R","date":1723546237000,"content":"<h2>Abstract</h2>\n<p>In this study, we employed the evidential belief function model (EBF) to evaluate the potential for land subsidence in the primary aquifer of Bardaskan. Through field visits, we recorded GPS coordinates for 174 land subsidence points. Factors considered in assessing land subsidence potential included well density, groundwater extraction rate, geological characteristics, proximity to faults, vegetation cover, distance from the river, slope, and land use. To develop and validate the model, 70% of the recorded points were randomly selected for training and implementation, while the remaining 30% were reserved for model validation. The number and percentage of land subsidence points in the different classes of the corresponding layers were determined by integrating the training points with influential variables maps such as distance from the river, distance from the fault, land use, and extraction volume. The EBF model rate was calculated for different layer classes. For modeling, all rates of the EBF model in each cell were summated, and the ‎potential of land subsidence was calculated.‎ Finally, the map of land subsidence potential based on the EBF model was determined with GIS. The results showed that most of the subsidence points were located in alluvial sediment of the Holocene period, in areas with high groundwater harvesting, a distance of at least 3000 m from a river, a distance of at least 6000 m from a fault, low-density rangelands, slopes of at least 0%–2%, and farmlands and gardens. A receiver operating characteristic curve analysis of the EBF model showed that it could accurately predict land subsidence in 87.5% of cases using 30% of the validation data. This suggests that the model can be used for practical applications.</p>","author":"Mehdi Eghbali, \nMaryam Azarakhshi, \nMohammad R. Khalaj","siteTitle":"Wiley: Natural Resource Modeling: Table of Contents","siteHash":"3719477483f67b16afdbb60e07461dbbb5827188dd5d72806069fb36caa95c59","entryHash":"908d083de27fe4a6668b6aa984711a0bfe9d922ed76ea59d78e023e4ef12bb53","category":"Environment"}