{"title":"Archaeologists find ancient Egyptian warship sunk near Alexandria","link":"https://arstechnica.com/?p=1782548","date":1627065600000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Egyptian-shipwreck-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/Egyptian-shipwreck.jpg\">Enlarge</a> (credit: Ministry of Tourism and Antiquities)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Twenty-four hundred years ago, Heraklion was ancient Egypt’s largest port on the Mediterranean Sea. Today, the ancient city lies submerged beneath Abu Qir Bay, a few kilometers off the coast of Alexandria. Archaeologists recently discovered the wreck of a warship from the city’s final years buried in the seabed for 2,100 years beneath five meters of clay and crumbled pieces of an ancient temple to the Egyptian god Amun.</p>\n<h2>A fast but unlucky warship</h2>\n<p>The outline of the wrecked ship suggests speed. Its 25 meter-long hull is about six times longer than it is wide, meaning that it was a long, sleek vessel built to race through the water. Clearly, this was no cargo vessel; ships built to haul cargo or passengers tend to be wider, built for capacity rather than speed and agility. The archaeologists from the European Institute for Underwater Archaeology who discovered the wreck say it was probably a warship, and its captain picked an unlucky day to tie up in the channel that flowed along the south side of the Temple of Amun in Heraklion.</p>\n<p>Some of the city’s inhabitants called the place Heraklion; others called it Thonis, and archaeologists have found stone monuments inscribed with both names together. Coins and bits of pottery found among the city’s submerged ruins suggest that Thonis-Heraklion flourished from the 500s to the 300s BCE. When Alexander the Great founded Alexandria 32 kilometers to the southeast in 331 BCE, the new city replaced Thonis-Heraklion as Egypt’s largest Mediterranean port, and the older city began to decline.</p></div><p><a href=\"https://arstechnica.com/?p=1782548#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782548&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"908ded17f0d699058d312f31365007cca2922197bf2ba0013a5367f53247f571","category":"Tech"}