{"title":"Rockstar Games","link":"https://markpeak.net/rockstar-games/","date":1636873044000,"content":"<p>ช่วงนี้เขียนถึง Rockstar Games บ่อยเพราะเกม <a href=\"https://www.blognone.com/node/125195\">GTA Trilogy Remaster</a> กลับมาขายใหม่ เลยต้อง fact-check ข้อมูลหลายอย่าง ไหนเลยมาเขียนสรุปเรื่อง Rockstar ไว้สักหน่อย</p>\n<p>เกมยอดนิยมของ Rockstar นั้นให้บรรยากาศที่เป็นอเมริกันมากๆ ทั้งซีรีส์ GTA และ Red Dead แต่แท้จริงแล้ว Rockstar เป็นสตูดิโอที่มีต้นกำเนิดจากสหราชอาณาจักร (ฐานหลักอยู่ที่ Edinburgh ในสกอตแลนด์) และจากความสำเร็จของ GTA ก็คงไม่มีใครเถียงได้แล้วว่า Rockstar คือสตูดิโอเกมสัญชาติบริติชที่ประสบความสำเร็จสูงที่สุดแล้ว</p>\n<p>จุดกำเนิดของ Rockstar ต้องย้อนไปไกลถึงปี 1984 โดยมีสตูดิโอเกมสัญชาติสกอตแลนด์ชื่อ DMA Design ตั้งขึ้นในเมืองดันดี เกมที่โด่งดังที่สุดคือ Lemmings ที่ออกขายในปี 1991 (สมัยเด็กๆ ผมก็เคยเล่นบ้างแต่เล่นไม่ค่อยเป็น) แล้วตามมาด้วย Grand Theft Auto ภาคแรก (ที่ยังเป็น 2D) ในปี 1997 ซึ่งเป็นยุคของ PlayStation 1</p>\n<p>เกมของ DMA Design ยุคแรกๆ จัดจำหน่ายโดย Psygnosis ซึ่งภายหลังถูก Sony ซื้อในปี 1993 จึงย้ายมาจับมือกับ BMG Interactive (บริษัทลูกของค่ายเพลง BMG จากอังกฤษ) แทน ซึ่ง GTA จัดจำหน่ายโดย BMG</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/11/games-by-rockstar.jpg\" /></p>\n<p>ปี 1997 เป็นจุดเปลี่ยนสำคัญของ DMA/BMG เพราะหลัง GTA ภาคแรกวางขาย ก็เกิดการซื้อกิจการที่เป็นทางแยก ดังนี้</p>\n<ul>\n<li>บริษัทพัฒนาเกม DMA Design ขายกิจการให้ Gremlin Interactive (อังกฤษ) ในปี 1997 จากนั้น Gremlin เองก็ขายให้ Infogrames (ฝรั่งเศส) ในปี 1999 แล้วถูกปิดกิจการในปี 2003</li>\n<li>BMG Interactive ผู้จัดจำหน่ายเกม GTA ถูกซื้อกิจการโดย Take-Two (อเมริกัน) ในปี 1998 โดยได้ลิขสิทธิ์ของเกม GTA ไปด้วย</li>\n</ul>\n<p>หลังจากนั้น Take-Two นำผู้บริหารของ BMG Interactive คือสองพี่น้อง Sam และ Dan Houser ย้ายไปอยู่ที่นิวยอร์ก และตั้งค่ายเกมใหม่ชื่อ Rockstar Games ที่ทำหน้าที่เป็นผู้จัดจำหน่าย (publisher) ในเครือ Take-Two</p>\n<p>ปี 1999 Take-Two ซื้อกิจการ DMA Design มาจาก Infogrames ทำให้ทีมงาน DMA/BMG เดิมกลับมาร่วมงานอีกครั้ง ภายใต้บริษัทแม่ใหม่คือ Rockstar ผลงานเด่นในยุคนี้คือ GTA 2 (1999) ก่อนมาดังเป็นพลุแตกกับ GTA 3 (2001)</p>\n<p>ปี 2002 บริษัท DMA Design ถูกเปลี่ยนชื่อใหม่เป็น Rockstar North และย้ายสำนักงานมาอยู่ที่ Edinburgh แทน โดย Rockstar North ยังถือเป็นสตูดิโอหลักของ Rockstar และมีผลงานคือ GTA ภาคหลักทุกภาค</p>\n<p>ส่วน Rockstar บริษัทแม่เอง หลังจากก่อตั้งในปี 1998 ก็ทยอยไล่ซื้อสตูดิโอ หรือตั้งสตูดิโอเกมเพิ่มเติมมาเรื่อยๆ</p>\n<ul>\n<li><strong>Rockstar Lincoln ซื้อปี 1998 </strong>(ชื่อเดิม Spidersoft ก่อตั้งปี 1992) ช่วงแรกรับผิดชอบการพอร์ตเกมลง Game Boy แต่ภายหลังไม่พัฒนาเกมแล้ว กลายเป็นทีม QA เกมในเครือแทน</li>\n<li><strong>Rockstar Toronto ซื้อปี 1999</strong> (ชื่อเดิม Imagexcel ก่อตั้งปี 1988) รับผิดชอบทำภาคเสริมของ GTA, ช่วยสนับสนุนสตูดิโออื่น, ทำเกมเองเกมเดียวคือ The Warriors ในปี 2005</li>\n<li><strong>Rockstar San Diego ซื้อปี 2002</strong> (ชื่อเดิม Angel Studios ก่อตั้งปี 1984) รับผิดชอบเกมตระกูล Red Dead และเกมแข่งรถ Midnight Club</li>\n<li><strong>Rockstar Vancouver ซื้อปี 2002</strong> (ชื่อเดิม Barking Dog ก่อตั้งปี 1998) ทำเกม Bully ภาคแรก, <span>ถูกยุบรวมกับ Rockstar Toronto ในปี 2012</span></li>\n<li><strong>Rockstar Vienna ซื้อปี 2003</strong> (ชื่อเดิม Neo Software ก่อตั้งปี 1993) ช่วยพอร์ตเกม GTA 3/Vice City, <span>ถูกปิดกิจการในปี 2006</span> โยกเกม Manhunt 2 ให้ London ทำ</li>\n<li><strong>Rockstar Leeds ซื้อปี 2004</strong> (ชื่อเดิมคือ Möbius Entertainment ก่อตั้งปี 1997) รับผิดชอบการพอร์ตเกมเวอร์ชัน PSP และช่วยสนับสนุนงานของสตูดิโออื่นในเครือ</li>\n<li><strong>Rockstar London ก่อตั้งปี 2005 </strong>ทำเกม Manhunt 2 ต่อจาก Vienna, Max Payne 3 และ RDR2 (สองเกมหลังร่วมกันทำหลายสตูดิโอ)</li>\n<li><strong>Rockstar New England ซื้อปี 2008</strong> (ชื่อเดิม Mad Doc ก่อตั้งปี 1999) ช่วยพอร์ตเกม GTA 4 และสนับสนุนเกมจากสตูดิโออื่น</li>\n<li><strong>Rockstar India ก่อตั้งปี 2016</strong> อยู่ที่บังกะลอร์ ช่วยพัฒนาเกม RDR2</li>\n<li><strong>Rockstar Dundee ซื้อปี 2020</strong> (<a href=\"https://www.blognone.com/node/119012\">ชื่อเดิมคือ Ruffian Games ก่อตั้งปี 2008</a>) ยังไม่มีผลงานออกมา</li>\n</ul>\n<p>เนื่องจาก<a href=\"https://markpeak.net/the-cost-of-making-games/\">แนวทางเกมในยุคหลัง ต้องสร้างเกมใหญ่ๆ ที่มีหลายสตูดิโอช่วยกันทำแทน</a> ทำให้เกมของ Rockstar ออกน้อยลงมากในรอบ 10 ปีนี้ (2011-2021) มีเกมใหญ่ที่ทำเองเพียง 3 เกมคือ Max Payne 3 (2012), GTA 5 (2013), RDR2 (2018) เท่านั้น</p>\n<p>สตูดิโอหลักที่ทำ GTA 5 คือ Rockstar North เช่นเคย ส่วน Max Payne 3 และ RDR2 เป็นการนำสตูดิโอในเครือหลายๆ แห่งมาช่วยกันทำในชื่อ Rockstar Studios แทน ซึ่งก็เป็นแนวทางเดียวกับค่ายเกมใหญ่ๆ อื่นๆ อย่าง <a href=\"https://www.blognone.com/node/122460\">Activision ที่ขนทุกสตูดิโอในเครือมาทำ Call of Duty</a> หรือ <a href=\"https://www.blognone.com/node/121465\">EA ที่ทุ่มกำลังมาทำ Battlefield</a> ทำให้โอกาสที่เราจะเห็นสตูดิโอในเครือ Rockstar ออกเกมใหม่ของตัวเองเป็นไปได้ยากมากแล้วในอนาคต</p>The post <a href=\"https://markpeak.net/rockstar-games/\">Rockstar Games</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"90914a2bc50ba61ec1d2b9d621f85b6614074a9360da64693b0df82ebcdea310","category":"Thai"}