{"title":"Spatiotemporal variations of groundwater and gully impact in two peatland watersheds in the Upper Yellow River, Qinghai‐Tibet Plateau","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2698?af=R","date":1721820670000,"content":"<h2>Abstract</h2>\n<p>The spatiotemporal variability of groundwater level is an important property of peatland hydrology that directly alternates water storage. Nonetheless, the current understanding of the variations of groundwater level over long periods of time remains limited. In this study, we investigated two peatland watersheds (0.151 km<sup>2</sup> for Watershed 1 and 0.844 km<sup>2</sup> for Watershed 2) in the Zoige Basin in the upper watershed of the Yellow River to monitor temporal variability of groundwater level using self-recorded water loggers over 4 years (2017–2021). The main results demonstrate that (1) groundwater level variations were controlled by gully drainage in sites adjacent to the gully but were more affected by rainfall in sites distant from the gully. The groundwater level near the gully downcut was lower than that near the gully without complete downcutting through the pear layer, with a maximum difference of 58.3 cm, indicating the longitudinal effect of groundwater level in the watershed. (2) Because the rainfall had a lag effect on the groundwater level, the length of lag gradually decreased with increased rainfall intensity (i.e., the lag time for sites distant from the gully was about 18 min shorter than that of sites close to the gully in Watershed 1). (3) The peak values of the groundwater level occurred simultaneously with the maximum and minimum rainfall in Watershed 2, and the peak occurrence time was related to the ratio of precipitation to evaporation. In the downstream sites, the groundwater level fluctuated more than the upstream ones in Watershed 2. Moreover, the average groundwater level in the upstream sites was 14.3 cm higher than that of the middle ones, indicating a decreasing trend of water storage along the gully. (4) The differences in groundwater level between wet and dry seasons were clear, but the difference was smaller in the upstream sites due to limited gully incision and higher water storage within the peat layer. Additionally, groundwater level changes were more extreme on rainy days during both the wet and dry seasons, but the different intensities of rainfall resulted in stable groundwater in the dry season and an oscillating groundwater level in the wet season in Watershed 2. This study uncovers the groundwater dynamics in the two peatland watersheds, which is of great significance for understanding runoff variation, ecohydrological processes, and wetland shrinkage.</p>","author":"Zhiwei Li, \nBingyu Zhou, \nXiwei Guo, \nPeng Gao, \nBang Chen, \nShimin Tian","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"90996fb5764b1dfb657980a013c310eb4da491b8c7a8f9589785514bcf323c03","category":"Environment"}