{"title":"FaNPR3 Members of the NPR1-Like Gene Family Negatively Modulate Strawberry Fruit Resistance against Colletotrichum acutatum","link":"https://www.preprints.org/manuscript/202407.2069/v1","date":1721909174000,"content":"Strawberry fruit is highly appreciated worldwide for its organoleptic and healthy properties. However, this plant is attacked by many pathogenic fungi, which significantly affect fruit production and quality at pre- and post-harvest stages, making chemical applications the most effective but undesirable strategy to control diseases, so far. Alternatively, genetic manipulation employing plant key genes involved in defense, such as members of the NPR-like gene family, has been successful in many crops to improve resistance. The identification and use of the endogenous counterpart genes in the plant of interest (as it is the case of strawberry) is desirable as it would increase the favorable outcome and requires prior knowledge of their defense related function. Using RNAi technology in strawberry, we show that transient silencing of Fragaria ananassa NPR3 members in fruit significantly reduces tissue damage after Colletotrichum acutatum infection whereas the ectopic expression of either FaNPR3.1 or FaNPR3.2 does not have an apparent effect. Furthermore, the ectopic expression of FaNPR3.2 in Arabidopsis thaliana double mutant npr3npr4 reverts the disease resistance phenotype to Pseudomonas syringe to wild type levels. Therefore, our results reveal that members of the strawberry FaNPR3 clade negatively regulate the defense response to pathogens, as do their Arabidopsis AtNPR3/AtNPR4 orthologs. Also, we provide evidence that FaNPR3 members act in strawberry (F. ananassa) as positive regulators of WRKY genes, FaWRKY19 and FaWRKY24, and that in Arabidopsis, FaNPR3.2 negatively regulates its orthologous genes AtNPR3/AtNPR4. We report for the first time the functional characterization of FaNPR3 members in F. ananassa which provides a relevant molecular basis for the improvement of resistance in this species through new breeding technologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"90b03a4619f6e08e6010337766fd079d2300e8fa0181bdd7907a47a1c4e8275e","category":"Interdisciplinary"}