{"title":"What’s it like to drive a Bugatti Chiron Pur Sport... in traffic?","link":"https://arstechnica.com/?p=1781335","date":1626719389000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/2021-Bugatti-Chiron-Pur-Sport-1-980x735.jpg\" /></div>\n        <p>\n          With an MSRP of $3,959,900, the Bugatti Chiron Pur Sport is the most expensive car we've ever tested at Ars.                       [credit:\n                        Jonathan Gitlin                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>I'm not sure anything can adequately prepare you to drive a modern Bugatti. If the thought of more than a megawatt of power under your right foot isn't daunting enough, there's the price tag. The Bugatti Chiron Pur Sport that we tested goes for $3,959,000. All press test drives require the presence of a chaperone—in our case, the affable Butch Leitzinger, one of a handful of racing drivers that Bugatti employs for this reason.</p>\n<p>In fact, the car is so far out of the normal frame of reference that it's perhaps even more daunting to write about than to drive, as evinced by the fact that it has taken me many weeks to properly marshal these words.</p>\n<p>At least there's no <a href=\"https://arstechnica.com/cars/2019/09/this-is-what-its-like-driving-a-bugatti-chiron-at-305mph/\">300 mph (405 km/h) top speed</a> to worry about. Topping out at 218 mph (350 km/h) means the Chiron Pur Sport is actually the slowest car Bugatti has made since its (second) resurrection in 1998. In terms of top speed, that is. Because it's also probably the quickest car Bugatti has ever made in terms of acceleration, sacrificing a bit of Vmax for even more brutal acceleration. No pressure, then.</p></div><p><a href=\"https://arstechnica.com/?p=1781335#p3\">Read 14 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1781335&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"90ca4774ebd858a67d06a38624204cfe7a20fbd5ab614c3bc2420f78b9a2fdca","category":"Tech"}