{"title":"Contribution Of Structure Learning Algorithms In Epidemiology: An Application In A Real-World Dataset","link":"https://www.preprints.org/manuscript/202410.1905/v1","date":1729759191000,"content":"The objective was to explore the contributions and limitations of structure learning methods within an epidemiological analysis of real-world data. The specific aim was to use these networks to identify determinants of access to healthcare among various social factors. We analyzed data from the 2010 wave of the SIRS cohort, which included a sample of 3,006 adults from the Paris region, France. Healthcare utilization, encompassing both direct and indirect access, was the primary outcome. Candidate determinants included health status, demographic characteristics, and socio-cultural and economic positions. We employed a dual approach: a non-automated epidemiological method (initial expert-knowledge network and logistic regression models) and structure-learning techniques based on several algorithms, with and without knowledge con-straints. We compared the results based on the presence, direction, and strength of specific links within the produced network. Although the interdependencies and relative strengths identified by approaches were similar, the structure-learning algorithms detected fewer associations with the outcome than the non-automated method. Relationships between variables were sometimes incorrectly oriented when using a purely data-driven approach. Structure learning algorithms can be valuable in exploratory stages, helping to generate new hypotheses or mining novel databases. However, results should be validated against prior knowledge and supplemented with additional confirmatory analyses.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"90cc3e14370c2ed693a1843ff8fd3c137f6ab817b89d4768d66a8b7a1861f158","category":"Interdisciplinary"}