{"title":"A mechanohydraulic model supports a role for plasmodesmata in cotton fiber elongation","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae256/7713014?rss=1","date":1720742400000,"content":"<span><div>Abstract</div>Plant cell growth depends on turgor pressure, the cell hydrodynamic pressure, which drives expansion of the extracellular matrix (the cell wall). Turgor pressure regulation depends on several physical, chemical, and biological factors, including vacuolar invertases, which modulate osmotic pressure of the cell, aquaporins, which determine the permeability of the plasma membrane to water, cell wall remodeling factors, which determine cell wall extensibility (inverse of effective viscosity), and plasmodesmata, which are membrane-lined channels that allow free movement of water and solutes between cytoplasms of neighboring cells, like gap junctions in animals. Plasmodesmata permeability varies during plant development and experimental studies have correlated changes in the permeability of plasmodesmal channels to turgor pressure variations. Here, we study the role of plasmodesmal permeability in cotton fiber growth, a type of cell that increases in length by at least three orders of magnitude in a few weeks. We incorporated plasmodesma-dependent movement of water and solutes into a classical model of plant cell expansion. We performed a sensitivity analysis to changes in values of model parameters and found that plasmodesmal permeability is among the most important factors for building up turgor pressure and expanding cotton fibers. Moreover, we found that nonmonotonic behaviors of turgor pressure that have been reported previously in cotton fibers cannot be recovered without accounting for dynamic changes of the parameters used in the model. Altogether, our results suggest an important role for plasmodesmal permeability in the regulation of turgor pressure.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"90d0026eab31168c26a44e2e0945879d6ee225d0e0887ab48b3cca8dc9c969fe","category":"Interdisciplinary"}