{"title":"Apple Seeds iOS and iPadOS 15.1 Release Candidates to Developers","link":"https://www.macrumors.com/2021/10/18/apple-seeds-ios-15-1-rc-to-developers/","date":1634580503000,"content":"Apple today seeded the RC versions of upcoming iOS 15.1 and iPadOS 15.1 betas to developers for testing purposes, one week after <a href=\"https://www.macrumors.com/2021/10/13/apple-seeds-ios-15-1-beta-4-to-developers/\">seeding the fourth betas</a> and a month after <a href=\"https://www.macrumors.com/2021/09/20/ios-15-now-available/\">releasing iOS 15 and iPadOS 15</a> to the public.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/General-iOS-15.1-Feature-Green-1.jpg\" />\r\n<br />\r\niOS and iPadOS 15.1 can be downloaded through the Apple Developer Center or over the air after the proper profile has been installed on an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>.\r\n<br />\r\n\r\n<br />\r\nSharePlay makes a return in iOS 15.1, with Apple once again testing the feature that was removed before the launch of <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>. SharePlay is designed to let users call their friends and family and interact by watching movies, watching TV, or listening to music together.\r\n<br />\r\n\r\n<br />\r\nApple has added features like shared playlists and TV show syncing so everyone sees the same thing at the same time. SharePlay also has a built-in screen sharing feature, and Apple is still working out the bugs.\r\n<br />\r\n\r\n<br />\r\nFor <a href=\"https://www.macrumors.com/roundup/iphone-13-pro/\">iPhone 13 Pro</a> users, the iOS 15.1 beta adds support for ProRes video capture, which is a higher quality professional video format that takes up quite a bit of storage space. For that reason, ProRes capture is limited to 30fps at 1080p on devices with only 128GB of storage, but higher capacity devices can record in 4K. ProRes can be toggled on in the Camera section of the Settings app.\r\n<br />\r\n\r\n<br />\r\nThere's also a new Auto Macro toggle for the ‌iPhone 13 Pro‌ models, which allows users to disable the feature that causes the camera to automatically swap to the Ultra Wide lens for a macro photo when in close proximity to an object. \r\n<br />\r\n\r\n<br />\r\nPaired with the <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> 15.1 beta (which is invite only), iOS 15.1 adds Lossless Audio and Dolby Atmos with Spatial Audio support to the ‌HomePod‌ and the <a href=\"https://www.macrumors.com/roundup/homepod-mini/\">HomePod mini</a>, bringing Apple's speakers in line with iPhones, iPads, and Macs.\r\n<br />\r\n\r\n<br />\r\n‌iPhone‌ users who have a health care provider or state record that uses SMART Health Cards can import their COVID-19 vaccination records into the Health app and can then add a vaccine card to the Wallet app. This is an opt-in feature that uses a global specification, but healthcare providers need to implement it.\r\n<br />\r\n\r\n<br />\r\nRight now, Smart Health Cards are or will be available to those in California, Louisiana, New York, Virginia, Hawaii, and some Maryland counties, as well those who were vaccinated at Walmart, Sam's Club, and CVS Health. Healthcare providers like electronic health record vendors like Epic and Cerner also support Smart Health Cards.<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, <a href=\"https://www.macrumors.com/roundup/ipados-15/\">iPadOS 15</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/ios-15.233\">iOS 15</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/18/apple-seeds-ios-15-1-rc-to-developers/\">Apple Seeds iOS and iPadOS 15.1 Release Candidates to Developers</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-seeds-ios-and-ipados-15-1-release-candidates-to-developers.2317551/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=RcF3xXJ-FT0:xYZACMNl-e8:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=RcF3xXJ-FT0:xYZACMNl-e8:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/RcF3xXJ-FT0\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"90d8ce982eae00b8aa0ff5d9b64b7229d24d0160d4e42f5b6deb3aa7f00d5fa6","category":"Apple"}