{"title":"BMW uses autonomous cars for boring, repetitive tests","link":"https://arstechnica.com/?p=1956358","date":1690383605000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Driverless-016-800x532.jpg\" alt=\"A camouflaged BMW i7 and a blue BMW M3 drive autonomously around a test track in the Czech Republic.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Driverless-016-scaled.jpg\">Enlarge</a> <span>/</span> Neither of these test BMWs has a human in the driver's seat.  (credit: BMW)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>BMW provided a flight from San Francisco to the Czech Republic and three nights in a hotel so we could visit the Sokolov test center. Ars does not accept paid editorial content.</aside>\n<p>On a large empty slab of asphalt, two BMWs take off. They drive in figure eights and along an oval path separate from each other but nearly in tandem, like two ice skaters practicing the same routine on a piece of black ice before coming to a stop.</p>\n<p>Neither of the cars has a driver. That's not that impressive; self-driving cars in testing environments shouldn't impress anyone at this point. Essentially the automaker tells the car to drive a route, and it does it. The important thing here is why these cars, outfitted with additional sensors, are driving along the same route again and again, each time depressing the accelerator the same amount and applying the exact amount of pressure on the brakes: They're testing hardware with the least amount of variables you can encounter outside of a lab.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Driverless-019-scaled.jpg\"><img alt=\"A closer look at one of the instrumented BMWs.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Driverless-019-980x652.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Driverless-019-scaled.jpg\">A closer look at one of the instrumented BMWs.</a> (credit: BMW)</p></div>\n<p>\"It's boring for human drivers,\" says BMW's project lead for driverless development, Philipp Ludwig. When a human is asked to perform the exact same task repeatedly, the quality of the work diminishes as they lose interest or become fatigued. For a computer-controlled car, it can do this all day. And it has done exactly that.</p></div><p><a href=\"https://arstechnica.com/?p=1956358#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1956358&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"90e3a18ae487bd6bc703224af31eb3df4fa3fdcb170166ca3bab4066b5fe60f3","category":"Tech"}