{"title":"Ford builds an affordable, efficient small truck: The new Maverick","link":"https://arstechnica.com/?p=1771304","date":1623156073000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Ford-Maverick-Family_Hybrid-2L-EcoBoost-AWD_Lariat_01-980x403.jpg\" /></div>\n        <p>\n          This is the 2022 Ford Maverick. It comes with a hybrid powertrain as standard and starts at $19,995.                      [credit:\n                        Ford                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>America's love affair with the truck shows no signs of abating. The country buys millions of them each year, providing the bread and butter for domestic automakers. But not everyone is well-served by the products on offer. Some might want a truck but are turned off by their <a href=\"https://arstechnica.com/cars/2020/02/supersized-trucks-and-suvs-seem-here-to-stay-unlike-the-auto-show/\">ever-increasing size</a>, particularly hood heights that hide small pedestrians. Others are put off by the poor efficiency. Enter Ford. After blowing everyone's socks off with its <a href=\"https://arstechnica.com/cars/2021/05/heres-what-we-know-about-fords-electric-f-150-lightning-pickup/\">electric F-150 Lightning</a>, the Blue Oval is back with yet another truck, but this one's small, efficient, and cheap—it's the new Ford Maverick.</p>\n<p>Unlike its bigger siblings, the Maverick uses a monocoque chassis construction rather than a body on frame. At just under 200 inches (5,072 mm) in length, it's significantly shorter than the (232-inch/5,885-mm) F-150, and smaller even than the Ranger. And that means a shorter and lower hood and, therefore, a smaller forward blind spot, <a href=\"https://www.consumerreports.org/car-safety/the-hidden-dangers-of-big-trucks/\">which will be welcome news to pedestrians, cyclists, and road users with small cars</a>.</p>\n<p>Under that small hood, you'll find a hybrid powertrain that combines a 162 hp (120 kW), 155 lb-ft (210 Nm), 2.5 L four-cylinder gasoline engine (that operates on the more efficient Atkinson cycle) with a 126 hp (94 kW), 173 lb-ft (235 Nm) permanent magnet electric motor. Together, they provide 191 hp (142 kW) to the front wheels via a continuously variable transmission.</p></div><p><a href=\"https://arstechnica.com/?p=1771304#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1771304&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"90e752fe648772e96e55631af36e2af285913c1bccc2ea1046f3f79854fe5dca","category":"Tech"}