{"title":"Tracking flight activity of potato leafhopper (Hemiptera: Cicadellidae) with the Midwest Suction Trap Network","link":"https://academic.oup.com/ee/article/53/3/433/7635534?rss=1","date":1711411200000,"content":"<span><div>Abstract</div>Potato leafhopper (PLH), <span>Empoasca fabae</span> Harris (Hemiptera: Cicadellidae), is an economic pest of a variety of crops that migrates between overwintering sites in the southern United States and northern breeding grounds. Since 2005, the Midwest Suction Trap Network (STN) has monitored the magnitude and timing of aerially dispersing aphids’ activity, but the potential of the network to monitor other taxa is only beginning to be explored. Here, we use the Midwest STN to examine how the magnitude and timing of PLH activity vary with weather, cropland cover, and time of year. We found that weekly PLH activity increased early in the season (May–June) with increasing degree day accumulation and decreased mid-season (July–August) with increasing occurrence of rain. The first detections occurred earlier in southern latitudes, while the last detections occurred sooner, when there was more surrounding potato land cover, and later over time between 2018 and 2021 and in southern latitudes. PLH activity was thus longer in duration in southern latitudes and has continued to extend later into the year overall. Resolving uncertainty about how well the Midwest STN captures migratory activity and how closely suction trap detections reflect local population densities in crop fields remain important research priorities before the potential of the Midwest STN for PLH monitoring can be realized. Still, observed patterns suggest that PLH could increase in economic importance as insects disperse over larger portions of the growing season in the warming, agriculturally productive US Midwest and that the STN can become a useful tool to monitor these changes.</span>","author":"","siteTitle":"Environmental Entomology Current Issue","siteHash":"cd31a9dedc650c44bfe34759a4460ac84326db14be1c0b158778f764b538baf2","entryHash":"90ea5c7f977c6788b72406ecc8d7040c2c0bc4181c103b1ba7ccd539cde0f087","category":"Environment"}