{"title":"Tim Urban on ‘Social Authoritarianism’","link":"https://twitter.com/waitbutwhy/status/1637867750168166400","date":1679363838000,"content":"\n<p>Tim Urban, on Twitter:</p>\n\n<blockquote>\n  <p>We can illustrate this by comparing how people react to an\nupcoming talk by a speaker they disagree with. High-rung thinkers\nfind a lot of value in having their beliefs challenged. Low-rung\nthinkers, not so much. But only the idea supremacist tries to\ncancel the event.</p>\n\n<p>Low-rung thinkers may not be great at learning, but as long as\nthey don’t prevent others from learning, it’s fine. Even the\nsocial bully is fine — they only hurt people who choose to be\ntheir friend.</p>\n\n<p>But idea supremacy is a direct affront to the workings of a\nliberal society.</p>\n</blockquote>\n\n<p>A short thread, but a good one. If you refuse to listen to people you disagree with, let alone try to prevent them from even speaking, how do you even <em>know</em> you disagree with them? Perhaps because I was young at the time, I often think back to <a href=\"https://www.nytimes.com/1995/06/04/us/reviews-by-weekend-moviegoers-are-in-dole-gets-a-thumbs-down.html\">Bob Dole’s “nightmares of depravity” broadside against popular movies and music</a> in 1995, when he began his campaign for president:</p>\n\n<blockquote>\n  <p><em>Natural Born Killers</em>, the story of a couple on a killing spree\nas they cross the country, was one example of films and\nrecordings cited by Mr. Dole as “nightmares of depravity” for\ntheir depictions of gratuitous sex and violence. He also attacked\nthe film <em>True Romance</em> and the rap groups Cannibal Corpse, Geto\nBoys and 2 Live Crew. Aides to Mr. Dole said he had not seen the\nmovies he cited but had read about them and had also read\noffending rap lyrics.</p>\n</blockquote>\n\n<p>The thing that got me then and still gets me now is that Dole <em>had not seen the movies</em>. Railing against a movie you haven’t seen is more offensive to me than the actual contents of any movie could be.</p>\n\n<p>Anyway, Urban’s Twitter thread is promoting his new book, <em><a href=\"https://waitbutwhy.com/\">What’s Our Problem: A Self-Help Book for Societies</a></em>, which is at the top of my reading pile.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/03/20/tim-urban-social-authoritarianism\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"90ec0a15521e81126414f55adb7500c01f36adcb4b565d8e76fc8727b914589c","category":"Tech"}