{"title":"The burden and trends of child and maternal malnutrition across the regions in Ethiopia, 1990–2019: The Global Burden of Disease Study 2019","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002640","date":1721138400000,"content":"<p>by Mesfin Agachew Woldekidan, Asrat Arja, Getaye Worku, Ally Walker, Nicholas J. Kassebaum, Alemnesh Hailemariam, Mohsen Naghavi, Simon Hay, Awoke Misganaw</p>\r\nIntroduction <p>Child malnutrition is the main contributor to the disease burden in Ethiopia. The objective of this study was to determine the prevalence and trends of child malnutrition and maternal anemia in Ethiopia at the national and regional state levels between 1990 and 2019.</p> Methods <p>We used all accessible data sources and analyzed prevalence, death, and years of life lost (YLL) due to child malnutrition and maternal anemia across nine regions and two chartered cities in Ethiopia, as part of the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2019. The burden and trends of child and maternal malnutrition and anemia at the national level, across the regions, and in cities were assessed. Point estimates with 95% uncertainty intervals (UI) are presented.</p> Findings <p>Of the 190,173 total under-5 deaths in Ethiopia in 2019, 108,864 (95% UI: 83,544–141,718; 57·2%, 51·3–62·7) were attributed to malnutrition. The prevalence of stunting, underweight, and wasting was 37·0%, 27·0%, and 7·0%, respectively, in 2019. The YLL rate attributable to child malnutrition declined from 251,964 per 100,000 population (95% UI: 218,720–287,559) in 1990 to 57,615 (95% UI: 44,190–75,015) in 2019. The YLL rate of wasting, stunting, and underweight in Ethiopia was 18,566 per 100,000 population (95% UI: 12,950–26,123), 3,290 (95% UI: 1,443–5,856), and 5,240 (95% UI: 3,608–7,312) in 2019, respectively. Gambella showed the highest YLL rate reduction among regions, with a 98·2% change for stunting, 95·9% for wasting, and 97·9% for underweight between 1990 and 2019. The prevalence of anemia among under-5 children in Ethiopia was 62·0% (95% UI: 59·1%–65·1%) in 2019. Somali has the highest child anemia prevalence, 84·4% (95% UI: 79·8%–88·8%), compared to others in 2019. The prevalence of anemia in women of reproductive age (15–49 years) in Ethiopia was 20·4% (95% UI: 19·0%–21·8%) in 2019.</p> Interpretation <p>The prevalence of child malnutrition and maternal anemia in Ethiopia remains high compared to national, WHO, and UNICEF 2030 targets in all indicators of child malnutrition and anemia despite several interventions in the last three decades. The YLL rate due to child malnutrition was high, with regional variations. In conjunction with other sectors, especially agriculture, the National Nutrition Program and other nutrition initiatives must make greater efforts with short-term and long-term interventions to improve access and better nutrition.</p>","author":"Mesfin Agachew Woldekidan","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"91089bbb7330dc96797fdb73e11e7b4489dc3b312dd894d4e95bfc098249aeb3","category":"Environment"}