{"title":"Antioxidant and Antibacterial Activities of Selected Medicinal Plants from Addis Ababa against MDR-Uropathogenic Bacteria","link":"https://www.preprints.org/manuscript/202408.1231/v1","date":1723795867000,"content":"Potentially, traditional medicine is used to manage multidrug resistance (MDR) bacterial infections. This study determined the antioxidant and antibacterial activities of Thymus schimperi (Ts), Rhamnus prinoides (Rp) and Justicia schimperiana (Js) from Addis Ababa against MDR-Uropathogenic Bacteria. Hydromethanolic extracts were prepared. Quantitative determination of phytochemicals and DPPH, ABTS and FRAP assays for antioxidant activities were carried out. In vitro, antibacterial activity and minimum inhibitory concentration (MIC) were performed. Ts had the highest total phenolic (TPC), flavonoid (TFC) and proanthocyanidin content. GC-MS analyses identified 14 bioactive-compounds: in Ts extract, with hexanedioic acid, bis(2-ethylhexyl) ester, thymol, and o-cymen-5-ol being the most predominant, respectively; in Rp extract (6 compounds; hexanedioic acid, bis(2-ethylhexyl) ester, β-D-glucopyranoside, methyl and desulphosinigrin respectively); and in Js extract (5 bioactive-compounds: hexanedioic acid, mono (2-ethylhexyl) ester, debrisoquine, and 8,11,14-heptadecatrienoate, methyl ester) being predominant, respectively. The extracts' TPC showed a strong negative correlation with the DPPH assay (r= -0.999; p=0.023), while its TFC correlated significantly with the ABTS assay (r=0.999; p= 0.032). Ts showed the highest antibacterial activity against clinical isolates of Escherichia coli and Klebsiella pneumoniae ESBL at 1000 mg/mL, and TS had the lowest MIC (4 mg/mL) among evaluated extracts against E. coli (ATCC25922). In conclusion, Ts and Rp showed activity against patient-isolated MDR-uropathogenic E. coli and K. pneumoniae ESBL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"910c8e70d0292864f2205db98bc49365791340181f359d0363552f9e03c6bf3f","category":"Interdisciplinary"}