{"title":"Here’s what caused black stains on Leonardo da Vinci’s Codex Atlanticus","link":"https://arstechnica.com/?p=1934263","date":1683058033000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/codex1CROP-800x545.jpg\" alt=\"Folio 843 of Codex Atlanticus\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/codex1CROP.jpg\">Enlarge</a> <span>/</span> Researchers examined folio 843 of Leonardo da Vinci's <em>Codex Atlanticus</em> to determine the cause of mysterious black stains. (credit: Veneranda Biblioteca Ambrosiana, Milan)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Researchers at the <a href=\"https://www.polimi.it/en\">Politecnico di Milan</a> in Italy examined mysterious black stains on a folio of <a href=\"https://en.wikipedia.org/wiki/Leonardo_da_Vinci\">Leonardo da Vinci</a>'s <a href=\"https://www.ambrosiana.it/en/discover/codex-atlanticus-leonardo-da-vinci/\"><em>Codex Atlanticus</em></a> and confirmed the presence of starch and vinyl glues in the affected areas. The glues were most likely applied during an earlier restoration effort some 50 years ago, according to a <a href=\"https://www.nature.com/articles/s41598-023-31129-2\">recent paper</a> published in the journal Scientific Reports. They also identified a likely cause of the dark stains: nanoparticles of a mercury sulphide called metacinnabar in the protective paper holding the folio, although it is unclear how this unusual black crystalline phase might have formed.</p>\n<p>Da Vinci produced more than 13,000 pages <a href=\"https://www.fulltextarchive.com/book/The-Notebooks-of-Leonardo-Da-Vinci-Complete/\">in his notebooks</a> (later gathered into codices), less than a third of which have survived. The notebooks contain all manner of inventions that foreshadow future technologies: flying machines, bicycles, cranes, missiles, machine guns, an “unsinkable” double-hulled ship, dredges for clearing harbors and canals, and floating footwear akin to snowshoes to enable a man to walk on water. The notebooks also contain da Vinci's detailed notes on his extensive anatomical studies. Most notably, his drawings and descriptions of the human heart captured how heart valves can ebb blood flow 150 years before William Harvey worked out the basics of the human circulatory system.</p>\n<p>The largest single set is the 12-volume <i><a href=\"https://en.wikipedia.org/wiki/Codex_Atlanticus\">Codex Atlanticus</a></i>, in which (among other observations) da Vinci foresaw the possibility of constructing a telescope when he wrote of “making glasses to see the moon enlarged”—a century before the instrument’s invention. The codex was subjected to a major 10-year restoration effort from 1962 to 1972, in which each individual folio in the 12 volumes was framed by a \"passe-partout\": a protective paper cover consisting of three modern paper layers glued to each folio so they could be more easily handled and displayed. It also enabled the double-sided documents to be read and examined. The codex is currently housed in the <a href=\"https://www.ambrosiana.it/en/discover/codex-atlanticus-leonardo-da-vinci/\">Biblioteca Ambrosia</a> in Milan.</p></div><p><a href=\"https://arstechnica.com/?p=1934263#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1934263&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"910d6b70f54fb4e5eba75958510d7941f12c46b6bd5e19ec5fb1b0bcfa74ca77","category":"Tech"}