{"title":"Horse for the Course | Racing The Merida Ex Enduro on a hardtail","link":"https://www.bikeradar.com/features/routes-and-rides/marin-el-roy-merida-ex-enduro/","date":1632405611000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-bike-102-81ed8b5.jpg?quality=90&amp;resize=620,413\" />                                            <p>I spend a lot of my time riding, writing, thinking and, at times, dreaming about bikes. It’s kinda in the job description.</p>\n<p>A lot of the time it’s full-suspension mountain bikes that take up valuable processing space in my head – the intricacies of <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-bike-geometry-and-handling/\">mountain bike geometry</a>, <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">rear suspension</a> and <a href=\"https://www.bikeradar.com/features/quick-guide-to-bike-frame-materials/\">frame materials</a>. It’s all a bit of a mess in there at times.</p>\n<p>As you’ll have realised over the past decade, the ‘enduro’ genre has been at the forefront of mountain bike design – pushing engineers to make lighter, smoother and faster machines with long-ish travel, dedicated to getting to the top of the hill efficiently and getting down the other side almost as quick as a full-bore <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downhill-mountain-bikes/\">downhill bike</a>.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Not my best pose ever, but I didn’t realise the snapper was there!</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>The <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-bikes/\">best enduro bikes</a> are remarkably capable machines. They’re also popular with riders and, as a result, a lot of my time is spent riding such machines.</p>\n<p>I’ll let you into a little secret, though. I’ve only ever raced one enduro. Yep, <a href=\"https://www.bikeradar.com/features/beginners-guide-to-enduro-racing/\">enduro racing</a> – the most popular and arguably most influential mountain bike race format of the decade, and that’s something I’ve been meaning to change.</p>\n\n<p>My long-term test bike this year is the Marin El Roy – a bike I’ve <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/marin-el-roy-review/\">reviewed on both BikeRadar</a> and <a href=\"https://www.youtube.com/watch?v=eH8c_YUU_VY\" target=\"_blank\">our Youtube channel</a>. Despite the El Roy lacking rear suspension, it is very much an enduro bike, so it felt fitting that I should race an enduro on it before the year was out.</p>\n<p>Handily, along popped <a href=\"https://the-ex.co.uk/\" target=\"_blank\">The Merida Ex Enduro</a>, a three-day enduro on public and private land on a collection of hills sandwiched between the Bristol Channel and Exmoor, a two-hour drive from home.</p>\n<p>The Ex has a great reputation among the few lucky enough to have raced it, thanks to trails that aren’t often open to the public, an event that takes place over multiple days, and an organising team who certainly don’t shy away from making you earn your descents. An enduro in the truest sense of the word.</p>\n<section><div>\n        <h3>Tom’s Ex Enduro experience</h3>\n<p><strong>The horse:</strong> While a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail bike</a> with stout tyres or a full-suspension enduro bike would definitely have been appropriate, this was a true test of my Marin El Roy. A very long, very low, very slack and rather heavy steel hardtail with a 140mm Marzocchi Z1 fork.</p>\n<p><strong>The course:</strong> At 110km, and with 4,000m of climbing (and rather more descending), The Ex’s course is no joke. Long days in the saddle are the name of the game, but the reward is more than 20 incredible stages.</p>\n<p>From super-fast flow, to mega-tight and twisty, The Ex never gets dull. There might not be the big hits that modern enduro races can have, but to go fast, you’ve got to have your witts about you and some seriously on-point bike handling skills.</p>\n<p><strong>The goal:</strong> Well, it’s a race – the goal was to win my category. How did I get on? Keep reading!</p>\n<p>\n\n    </p></div>\n    </section><h2>In at the deep end</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Maps were studied, and studied again.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>This year’s event started officially just after lunch on the Friday and, while there was a sneaky uplift to get us to the top of Dunkery Beacon – a 1,705ft/520m hill in Exmoor National Park – there was absolutely no rest for the wicked from there.</p>\n<p>Straight in, I was sprinting my barely warmed up legs along a progressively narrower, progressively more rutted rock and mud track, in the rain, towards the first checkpoint.</p>\n<p>My heart rate, by the time I’d dibbed my dibber for the first time, was so far through the roof all I could mutter were words that would definitely not get past BikeRadar’s swear filter.</p>\n<p>It was a taste of things to come – it turns out that the red mist definitely descends when I’m in between the tapes, and I can’t but help sprint my little legs off (and then brake heavily at the first hint of a corner) when it’s my turn to go.</p>\n<h2>Night fever</h2>\n<p>This year’s Ex included a couple of night stages, sponsored by <a href=\"https://www.bikeradar.com/brand/exposure/\">Exposure Lights</a>. Having completed six stages through the first day, we ended up back at the race village, refuelled on some excellent snacks put on by the team (The Ex is a fully catered affair), and then pedalled out as the early-autumn sun dipped beneath the horizon.</p>\n<p>I’ve raced at night before – multiple <a href=\"https://www.mbuk.com/articles/video-surviving-the-strathpuffer-we-take-on-britains-toughest-24-hour-race/\" target=\"_blank\">Strathpuffer</a> races have been completed, along with numerous other 10-/12-/24-hour events in the distant past – but there’s definitely something different about riding an enduro track, blind, in the dark.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Racing enduro at night is a unique experience.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>By this point the weather was dry, and the tracks ridiculously loose and dusty. Maybe it’s the effect of riding in the dark with a high-powered light strapped to my lid, but it certainly felt like I was riding at warp speed, dodging trees, bounding over drainage ditches and scurrying round rocky switchback corners.</p>\n<p>While I stayed rubber side down, it was only by the skin of my teeth. Props to <a href=\"https://www.bikeradar.com/brand/maxxis/\">Maxxis</a> and the brand’s MaxxGrip compounds and DoubleDown carcasses.</p>\n<p>All good things come to an end though, and a cracking BBQ finished the day off nicely.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> A slap-up BBQ refuelled riders after the night stages.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<h2>The fun never stops</h2>\n<p>Day one was just a taste of the fun to come. The following two days covered yet more ground, focusing on trails deep in the woods – rooty, tight, steep, fast. Pretty much everything was on offer, providing a true all-round test of riding – especially on a hardtail.</p>\n<p>There were times when I struggled a touch on my un-sprung El Roy – when tracks are flat and you want to get the power down, it’s not so easy when you’re rattling over matted roots!</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Pre-race yoga, for those who like to stretch.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>While the Enduro World Series these days seems to be largely lift-accessed, there was no let-up in this enduro’s climbing. Day two was a monster, with almost 1,900m of vertical ascent and just under 40km in distance, with eight stages to race.</p>\n<p>Fortunately, this being the southwest of England, a vintage afternoon tea stop was put on, with fine china crockery and scones, jam and cream (cream, then jam – apologies to our Cornish readers). Combine climbs with cream teas, and I was very glad of the 30t chainring I’d bolted to my crankset.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> More tea?</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>It’s touches like these that separate The Ex from many other events. It’s small enough that by day two you feel like you know everyone, and there’s scope from the organisers to put on these cute events within the event, but there are still enough people to make the racing flat-out and competitive.</p>\n<h2>Tense times</h2>\n<p>By the start of day three I’d managed to get myself into first position in the (not exactly over-subscribed) hardtail category, with a 30-second buffer (it had been only four seconds at the end of day one!).</p>\n<p>I’d not given my bike any TLC whatsoever in the first two days and, while it probably should have had some love, nothing changed for the third – other than popping a spare SRAM eTap AXS battery in my pocket.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fuelling up for the ride ahead.</span></figcaption><span></span></div>\n<p>Day three didn’t get off to a smooth start. Not only were the trails rough, but they were damp, greasy and very, very rooty. It’s fair to say that despite the compound, this isn’t where the Maxxis Assegai performs at its strongest. And, with a couple of big days in the legs, and not much sleep, neither did I.</p>\n<p>I’d like to take this opportunity to publicly apologise to any members of the public who heard me descending any of the first three stages that day. The air, as they say, was blue, and I was convinced my slender win was gone.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Threading my way through the trees.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<p>Fortunately, the rider just behind me was also having a ‘mare, and told me so as we passed each other on the course – much to my relief.</p>\n<p>With the race coming towards its final stage, we plummeted down the hill, hitting the fastest speeds of the weekend on a beautifully flowy stage through the woods.</p>\n<p>Dusty switchbacks were once again making their presence felt, with my <a href=\"https://www.bikeradar.com/reviews/components/brakes/disc-brake-systems/sram-code-rsc-brake-review/\">SRAM Code RSC brakes</a> doing a sterling job of dropping anchor and making sure I (just about) got round them intact.</p>\n<p>With that all done, it was just a case of crossing my fingers and waiting to see whether I’d maintained my leading position…</p>\n<h2>The result</h2>\n<p>And in the hardtail class, I had!</p>\n<p>If you exclude the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bikes</a> (not because I’m a hater, but because I think the comparison with human-powered bikes is fairer here), I came 15th overall with a time of 01:06:14 hours, only 75 seconds ahead of the second-placed hardtail.</p>\n<p>Despite more than an hour of race time, the margin was only just over a minute – tight!</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> So awkward! But, you gotta get a snap if you’re stood on the top step.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Paul Box</i></span></div>\n<h2>But what about the bike?</h2>\n<p>So, I got the result I wanted, but what about the bike? Here’s a closer look at my setup for The Ex.</p>\n<p>The El Roy takes progressive geometry to the extreme for a hardtail.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Marzocchi Z1 looks the business up front.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Jon Woodhouse</i></span></div>\n<p>The 29in front wheel projects forward at 63 degrees, while its reach is more than 500mm in the ‘Grande’ size I ride. Combine that with a slammed <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> and you can see how it might be a monster on the descents.</p>\n<p>Keeping everything under control at the front is a Marzocchi Z1 fork with 140mm of travel. It’s not flashy, with a relatively simple GRIP damper borrowed from parent company Fox, but when the rear wheel has no springs, it makes the front of the bike feel like you’re riding on a cloud in comparison.</p>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-pedals-113-c1ba2ab.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Nukeproof’s Horizon CL pedals – the big platform adds to foot stability.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-bars-119-afd67ca.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>An old Spank Vibrocore bar – foam inside helps dampen vibration, reducing arm pump.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<h3>AXS upgrades</h3>\n<p>This is where the stock parts finish.</p>\n<p>Shimano provided the bulk of the 1x 12-speed Deore groupset on the El Roy when I originally reviewed it in September 2020, with the 10-51t cassette paired with an FSA Comet chainset, 32t chainring and KMC chain.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> With no cables to worry about, my rushed pre-race rebuild of the bike was made much easier with SRAM AXS.</span></figcaption><span> <i>THE MERIDA EX ENDURO / Jon Woodhouse</i></span></div>\n<p>I didn’t upgrade the drivetrain just for the hell of it – after a year of ragging it about, the Shimano group was well-worn and due some attention. As a complete mechanic-o-phobe, the ease at which SRAM’s new AXS wireless gears can be installed, and the presence of a box of parts in the office, made it a no-brainer to upgrade.</p>\n<p>In use, the wireless AXS setup is fantastic. Shifting is accurate, clean, crisp, consistent and light. I’ve no issue with old-school cables, but AXS is a definite step up the performance ladder.</p>\n<p>The 30t chainring and 10-52t cassette ensured I had a wide spread of gears for The Ex’s relentless climbing, too.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-shifter-110-3da8461.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Gucci it might be, but it’s hard to look past the performance of SRAM’s AXS gears.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-dropper-112-29f950a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>It is expensive, but shared between three bikes, the Reverb AXS is a little easier to justify.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe AXS theme continues with the dropper post.\n<p>With such a light and instantaneous action, the wireless <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/rockshox-reverb-axs-wireless-dropper-post-review/\">RockShox Reverb AXS</a> is one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">best dropper posts</a> we’ve tested.</p>\n<p>Yes, it is eye-wateringly expensive, but this post rotates between three different bikes in my garage and takes seconds to swap between them.</p>\n<h3>Rolling stock</h3>\n<p>On a hardtail, aside from the fork, it’s the wheels and tyres that have the biggest influence on your ride.</p>\n<p>Having just completed a wheels group test, I popped on Zipp’s new 3ZERO MOTO wheels.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/zipp-wheels-178f1b5.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Having just finished testing Zipp’s 3ZERO MOTO wheels, the fancy carbon wheels made their way onto the El Roy for The Ex.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/zipp-rim-profile-6e1f730.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>A single-wall rim articulates on the spokes, adding compliance, grip and puncture protection.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe rim has a single-wall design, with no triangular void you’d normally find in a rim. This helps the rim bed articulate around the spokes, providing a little more comfort and a touch more puncture resistance.\n<p>While the differences in wheels can be very hard to feel, especially with thick enduro tyres wrapped around them, there’s something good going on with these and they seem to smooth the way a little.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-brakes-118-72daabf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Thick floating rotors from Magura help to keep the Code calipers cool.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-brake-lever-115-5799a06.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Are you even ‘enduro’ if you don’t have quick links taped to your brake lines?</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nJoining these were a pair of Maxxis tyres. The El Roy originally came with an Assegai DoubleDown MaxxGrip front and rear. At the back, it was like dragging an anchor, but up front, on rocks, roots and dust, it’s next level, making it one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">best enduro tyres</a> around, I reckon.\n<p>So I kept the Assegai on the front and paired it with a 2.5in Aggressor at the back. It’s faster rolling but still has enough bite in dry to damp conditions. The 2.5in version is significantly better than the 2.3in version in this regard, in my opinion.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-front-tyre-107-4f375da.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Assegai is one of my favourite dry-weather tyres.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/EX-Enduro-Tom-rear-tyre-104-0dabbac.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The Aggressor rolls fairly fast and brakes okay – it’s versatile rather than being exceptional in any one area.</span>\n    </figcaption><span>\n                    <i>THE MERIDA EX ENDURO / Jon Woodhouse</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nOnce again, with the rear of the bike having nothing in the way of suspension, the DoubleDown carcass was a given – it’s strong, and relatively puncture resistant. However, I stuck with a standard dual-compound rubber.\n<p>How did the El Roy fare on the whole?</p>\n<p>Its stretched-out shape means it’s not shy of going fast when pushed to the limit of what a hardtail can do, while the stout, grippy tyres meant I had no excuses when it came to battering the bike over roots or slinging it into corners.</p>\n<p>A few choice upgrades, most notably the AXS groupset and fancy Zipp wheels (perks of the job, eh) meant I was able to focus more on the course, rather than nursing my way to the bottom of it.</p>\n<p>And I came away with a trophy to show for it.</p>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"91178c6b7d39dace415af01d489eca9d8b0ea31313f6a1a9d4ddae2f5426f8c5","category":"Cycling"}