{"title":"Apple Plans to Expand Ad Visibility in App Store","link":"https://www.macrumors.com/2021/04/22/apple-expanding-ads-for-app-store/","date":1619078444000,"content":"Apple is planning to boost its advertising business through a new ad slot on the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> search page which will allow developers to promote their apps across the entire platform, rather than just when users search for a specific app, according to a new report from the <em><a href=\"https://www.ft.com/content/5527ddd1-77a8-4cd0-82fd-4568be5da80f\">Financial Times</a></em>.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/app-store-search-ads-2.jpg\" />\r\n<br />\r\nApple <a href=\"https://searchads.apple.com\">already boasts</a> an ‌App Store‌ advertising business where it allows developers to pay for the top result spot when users search for a specific app on the platform. Apple says these ads are \"an efficient and easy way to help people discover your app at the top of ‌App Store‌ search results,\" and now the company wants to expand on it.\r\n<br />\r\n\r\n<br />\r\nAccording to the <em>Financial Times</em>, citing people familiar with the matter, the company plans to roll out a second ad slot within the ‌App Store‌, but this time directly within the Search page, by the end of the month. The new ads will appear alongside the current \"Suggested\" section on the page and will be visible to users across the whole platform.\r\n<br />\r\n\r\n<br />\r\nThe report lacks specific details on the mechanism behind the new ad slot. For example, Apple's current search ads include careful features that ensure smaller developers can bid and pay for ads and not get dominated by large developers and corporations. The new ad slot comes as the advertising industry is bracing for impact from the fallout of the upcoming iOS and iPadOS 14.5 update.\r\n<br />\r\n\r\n<br />\r\nBeginning with the new update <a href=\"https://www.macrumors.com/2021/04/20/ios-14-5-release-date-next-week/\">rolling out to users next week</a>, apps will be required to ask for users' permission to access their IDFA or identifier for advertisers. By accessing the IDFA, developers can track a user's activity across other apps and websites, even those owned by different companies, to provide personalized ads to users.\r\n<br />\r\n\r\n<br />\r\nThe new requirement, called App Tracking Transparency, has received heavy criticism from <a href=\"https://www.macrumors.com/2020/12/16/facebook-takes-out-full-page-ads-to-attack-apple/\">companies such as Facebook</a>, who are concerned that the new requirement will result in a majority of users opting out of ad tracking. A large portion of Facebook's business comes from selling ads across its platform, and ATT could cut into its revenue by making it harder to provide personalized, relevant ads to users.<div>Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/22/apple-expanding-ads-for-app-store/\">Apple Plans to Expand Ad Visibility in App Store</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-plans-to-expand-ad-visibility-in-app-store.2292729/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1QMJrGSAW30:lQxXpXS2ek0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=1QMJrGSAW30:lQxXpXS2ek0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/1QMJrGSAW30\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9122ebda6bcaf2e5950f7ef8730016d39110e3bb74082f793f069cd6c2b699bf","category":"Apple"}