{"title":"Apple's Q4 2023 Earnings Call Takeaways","link":"https://www.macrumors.com/2023/11/02/apple-q4-2023-earnings-call-takeaways/","date":1698963637000,"content":"Apple today held an earnings call for the fourth fiscal quarter of 2023 (third calendar quarter), with Apple CEO <a href=\"https://www.macrumors.com/guide/tim-cook/\">Tim Cook</a> and Apple CFO Luca Maestri sharing details on recent product sales, services growth, Apple's future plans, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/01/Apple-Logo-Cash-Feature-Yellow.jpg\" width=\"2676\" height=\"1504\" />\r<br />\nWe've highlighted the most interesting takeaways from Apple's earnings call.\r<br />\n\r<br />\n<h2>Services</h2>\r<br />\nApple's quarterly revenue was down one percent year over year at $89.5 billion, but services revenue hit a new all-time revenue record. Services revenue was $22.3 billion, up 16 percent from $19.2 billion in the year-ago quarter.\r<br />\n\r<br />\nAcross all of 2023, Apple's services category brought in $85 billion, up from $78 billion in 2022.\r<br />\n\r<br />\n<a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, advertising, <a href=\"https://www.macrumors.com/guide/icloud/\">iCloud</a>, <a href=\"https://www.macrumors.com/guide/applecare/\">AppleCare</a>, payment services, and video hit all-time revenue records, while <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> saw an all-time revenue record for the September quarter.\r<br />\n\r<br />\n<h2>iPhone Sales</h2>\r<br />\n<a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> revenue was up during the quarter, coming in at $43.8 billion, up from $42.6 billion in the year-ago quarter. ‌iPhone‌ revenue was down for the year, though, at $200.6 billion, down from $205.5 billion last year.\r<br />\n\r<br />\nApple's ‌iPhone‌ revenue set a September quarter revenue record.\r<br />\n\r<br />\nAccording to Apple CEO ‌Tim Cook‌, the <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> models sold better than the <a href=\"https://www.macrumors.com/roundup/iphone-14/\">iPhone 14</a> models, but supplies of the <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> and Pro Max were constrained, which impacted Apple's total ‌iPhone‌ revenue.\r<br />\n\r<br />\nCook said that Apple is \"working hard\" to make more ‌iPhone 15 Pro‌ and Pro Max devices, and that the company expects to reach supply/demand balance at the end of the holiday quarter. ‌iPhone‌ revenue is expected to grow year-over-year in the December quarter.\r<br />\n\r<br />\n<h2>Mac Sales</h2>\r<br />\nMac sales <a href=\"https://www.macrumors.com/2023/11/02/mac-revenue-down-m3-sales-improvements/\">were way down</a> in Q4 2023, with Macs bringing in $7.6 billion, down 34 percent $11.5 billion in the year-ago quarter. Mac revenue for all of 2023 was $29.4 billion, down from $40.2 billion in 2022.\r<br />\n\r<br />\nLast year, September Mac sales were up because of supply chain issues in June, a situation that Apple could not compete with this year. Cook expects Mac revenue to improve next quarter thanks to the October introduction of the M3 Macs, and he said that the negative 34 percent growth should not be seen as representative of the underlying performance of the Mac.\r<br />\n\r<br />\n<h2>iPad Sales</h2>\r<br />\n<a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> sales did not fare quite as badly as Mac sales, but ‌iPad‌ revenue was also down. The ‌iPad‌ category brought in $6.4 billion, down from $7.1 billion in the year-ago quarter. Apple has not released any new iPads this year, so the drop in ‌iPad‌ revenue does not come as a surprise.\r<br />\n\r<br />\nAcross 2023, ‌iPad‌ revenue came in at $28.3 billion, down from $29.3 billion in 2022. Apple CFO Luca Maestri said that year over year performance for the ‌iPad‌ will \"decelerate significantly\" because of changes in product launch timing. Apple last year launched a new <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> during the December quarter, and no new iPads are planned in 2023.\r<br />\n\r<br />\n<h2>Wearables, Home and Accessories</h2>\r<br />\nWearables revenue dropped as well, coming in at $9.32 billion for the quarter, down from $9.65 billion in the year-ago quarter. Wearable revenue for 2022 was at $39.9 billion, down from $41.2 billion last year.\r<br />\n\r<br />\nYear over year revenue for the wearables category is expected to drop in the December quarter.\r<br />\n\r<br />\n<h2>Research and Development Spending</h2>\r<br />\nApple spent a total of $30 billion on research and development in 2023, up from $26.3 billion in 2022. Apple CEO ‌Tim Cook‌ said that Apple's increased spending is due to Vision Pro, AI, machine learning, and silicon investments.\r<br />\n\r<br />\n<h2>Active Install Base</h2>\r<br />\nApple CFO Luca Maestri said that Apple's active installed base of devices has hit a new all-time high across all products and all of Apple's geographic segments.\r<br />\n\r<br />\n<h2>Vision Pro</h2>\r<br />\nApple CEO ‌Tim Cook‌ was asked whether he thinks the Vision Pro launch and consumer education process will ultimately be similar to the AirPods and Apple Watch, but he said no, because of the purchasing experience.<blockquote>\"I would say no. There's never been a product like the Vision Pro, so we're purposely bringing it out in our stores only so we can really put a great deal of attention on the last mile of it. We'll be offering demos in the stores and it'll be a very different process than a normal grab-and-go kind of process.\"</blockquote>Cook went on to say that Apple is seeing a \"tremendous amount of excitement around Vision Pro.\" Cook has tested some of the apps that developers are working on, and he claims that some \"real blow away kind of things are coming out.\"\r<br />\n\r<br />\nThe Vision Pro will be sold solely in the United States to begin with, and Cooks comments suggest that customers might be required to visit a retail store to make a purchase. Apple's Vision Pro website says that the headset will be available for purchase both online and in retail stores, but Apple could ask customers to come to a retail store to pick up an online purchase in order to ensure a proper fit.\r<br />\n\r<br />\n<em>Bloomberg</em>'s <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a> <a href=\"https://www.macrumors.com/2023/10/22/apple-to-host-secretive-vision-pro-training-event/\">recently said</a> that Apple will assemble Vision Pro headsets for customers in its stores, giving each user the appropriate headband, light seal, and prescription lenses if necessary.\r<br />\n\r<br />\n<h2>Generative AI</h2>\r<br />\nCook was asked how Apple might be able to monetize generative AI, which he of course declined to comment on, but he said that Apple is \"investing quite a bit\" in AI and that there are going to be product advancements <a href=\"https://www.macrumors.com/2023/11/02/tim-cook-generative-ai-comments/\">that involve generative AI</a> in the future.\r<br />\n\r<br />\n<h2>Apple silicon</h2>\r<br />\nAn analyst asked Cook if it would ever be feasible for Apple to purchase \"from the industry.\" Cook said that Apple silicon is \"at the heart of the primary technologies\" that Apple likes to control in its devices, and so he does not see the company \"going back to buying off of the shelf.\"\r<br />\n\r<br />\n\"I am happier today than I was yesterday than I was last week that we made the transition that we've made and I see the benefit every day of it,\" said Cook.\r<br />\n\r<br />\n<h2>Apple's Search Deal With Google</h2>\r<br />\nCook was asked to comment on its web search partners, with a specific focus on the ongoing antitrust lawsuit that Google is facing from the U.S. Department of Justice.\r<br />\n\r<br />\nCook said that Apple has \"important relationships\" with its web sear partners, but that he would not get into \"commercial relationships\" on the call. Cook said that he sees them \"as important\" and that Apple makes \"decisions that we feel are in the best interests of our users.\"\r<br />\n\r<br />\n<h2>Read More</h2>\r<br />\nA more complete picture of Apple's earnings on a per-category basis can be found in <a href=\"https://www.macrumors.com/2023/08/03/apple-3q-2023-results/\">our full live blog</a>.<br />This article, \"<a href=\"https://www.macrumors.com/2023/11/02/apple-q4-2023-earnings-call-takeaways/\">Apple's Q4 2023 Earnings Call Takeaways</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apples-q4-2023-earnings-call-takeaways.2409684/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"912e829f4cc166c1b11c64f760af59848f201b53df5725d91ec4a1d64d87692f","category":"Apple"}