{"title":"Advances in Laboratory Diagnosis of Coronavirus Infections in Cattle","link":"https://www.preprints.org/manuscript/202405.0299/v1","date":1714991788000,"content":"Coronaviruses cause infections in humans and diverse species of animals and birds with a global distribution. Bovine coronavirus (BCoV) produces predominantly two forms of disease in cattle, a respiratory form, and a gastrointestinal form. All age groups of cattle are affected by the respiratory form of coronavirus whereas the gastroenteric form causes neonatal diarrhea or calf scour in young cattle and winter dysentery in adult cattle. The tremendous impacts of bovine respiratory disease and the associated losses are well-documented and underscores the importance of this pathogen. Beyond this, studies have demonstrated significant impacts on milk production associated with outbreaks of winter dysentery, with up to a 30% decrease in milk yield. Research data so far have shown that the viral structure or strain is not a determinant of tissue tropism and clinical form of the disease. In North America, BCoV was identified for the first time in 1972, and it continues to be a significant economic concern for the cattle industry. The virus is classified under Coronaviridae family, Betacoronavirus genus and Betacorovirus 1 species. A number of conventional and molecular diagnostic assays are available for the detection of BCoV from clinical samples. Conventional assays for BCoV detection include virus isolation, which is challenging from clinical samples, electron microscopy, fluorescent antibody assays, and various immunoassays. Molecular tests are mainly based on nucleic acid detection and predominantly include conventional and real-time polymerase chain reaction (PCR) assays. Isothermal amplification assays and genome sequencing have also been used increasingly in recent years for the detection and identification of BCoV.  Loop-mediated isothermal amplification, helicase-dependent amplification, recombinase polymerase amplification, and multienzyme isothermal rapid amplification are some examples of the isothermal amplification assays for used BCoV. Point-of-care testing has gained some popularity recently as they can offer user-friendly testing on the farm (barn-side). The present study reviewed literature on coronavirus infections in cattle from the last three and a half decades and presents information mainly on the current and advancing diagnostics in addition to epidemiology, clinical presentations, and the impact of the disease on the cattle industry.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"913cc37fd64512ea960b2fa6c59e28879409e29dba56b77b905675620dbd383f","category":"Interdisciplinary"}