{"title":"Instagram อธิบายอัลกอริทึมในการคัดเนื้อหามาแสดง ทั้งใน Feed, Stories และ Explore","link":"https://www.blognone.com/node/123160","date":1623581712000,"content":"<div><div><div><p>Adam Mosseri <a href=\"https://www.blognone.com/node/105597\">หัวหน้าทีม</a>ของ Instagram เขียนบล็อกอธิบายรายละเอียดเพิ่มเติม เพื่อให้เข้าใจการทำงานของอัลกอริทึมคัดเลือกเนื้อหาขึ้นมาแสดง สำหรับผู้ใช้งานแต่ละคน ซึ่ง Instagram ได้<a href=\"https://www.blognone.com/node/81843\">เปลี่ยนระบบฟีด</a>นี้มาตั้งแต่ 5 ปีที่แล้ว เคย<a href=\"https://www.blognone.com/node/102800\">อธิบาย</a>หลักการคัดเลือกเนื้อหามาครั้งหนึ่ง แต่รอบนี้ลงรายละเอียดที่มากขึ้น</p>\n<p>Instagram เริ่มด้วยคำอธิบายว่าในตอนแรกที่ Instagram ใช้การแสดงโพสต์แบบเรียงตามลำดับเวลานั้น ผู้ใช้งานราว 70% ไม่เห็นโพสต์ใหม่ครบทุกอัน เกือบครึ่งหนึ่งที่พลาดไปเป็นโพสต์จากคนที่เขาติดตาม จึงเป็นที่มาของการจัดอันดับคัดเลือกโพสต์เพื่อนำมาแสดงในฟีดของแต่ละคน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/c3671af06eb0632a05d4bf62ce5a08ee.png\" /></p>\n<p>ใน Instagram มีส่วนของแอปที่ต่างมีอัลกอริทึมคัดเลือกเนื้อหาเพื่อแสดงผลแตกต่างกันไป รายละเอียดดังนี้</p>\n<h4>ฟีด และ Stories</h4>\n<p>เป็นส่วนแสดงผลของบัญชีที่ผู้ใช้งานแต่ละคนติดตามอยู่แล้ว (ยกเว้นโฆษณา) โดย Instagram เก็บข้อมูลของโพสต์ เช่น เนื้อหาในโพสต์ คนที่โพสต์ ข้อมูลของผู้ใช้งาน นำมาเป็นค่า Signal ที่มีหลายพันรายการ เพื่อเป็นปัจจัยจัดอันดับแสดงผล โดย Signal ที่มีความสำคัญและส่งผลต่อการถูกนำมาแสดงผลเรียงลำดับได้ดังนี้</p>\n<ul>\n<li>ข้อมูลของโพสต์ เช่น ความนิยมโพสต์นั้น จำนวนคน Like วันเวลาของโพสต์นั้น สถานที่ในโพสต์ ฯลฯ</li>\n<li>คนที่โพสต์ หากเรามีการ Like หรือคอมเมนต์บ่อย ก็จะเพิ่มน้ำหนักในการแสดงผล</li>\n<li>พฤติกรรมการใช้งานของเจ้าของบัญชี เช่น ปกติ Like กี่โพสต์ในฟีด หยุดดูแต่ละโพสต์นานแค่ไหน</li>\n<li>ประวัติการ Like หรือคอมเมนต์ โพสต์ต่าง ๆ</li>\n</ul>\n<h4>Explore</h4>\n<p>เป็นส่วนให้ผู้ใช้งานได้ค้นพบโพสต์ใหม่ ๆ ที่คิดว่าจะสนใจ ไม่ว่าจะเป็นรูปภาพหรือวิดีโอ ฉะนั้น Signal ที่นำมาจัดอันดับโพสต์ จึงเป็นข้อมูลอดีตว่าผู้ใช้งาน กด Like, กดติดตาม หรือเซฟโพสต์แบบใดไว้บ้าง การจัดลำดับนั้นคล้ายกับ ฟีดและ Stories คือดูข้อมูลของโพสต์นั้น ๆ ก่อน จากนั้นจึงให้น้ำหนักประวัติของผู้ใช้งาน เช่น ไม่เคยติดตามแต่ไปกด Like ก็จะถูกนำมาแสดง เป็นต้น</p>\n<h4>Reels</h4>\n<p>ส่วนการแสดงคอนเทนต์วิดีโอนี้ใช้แนวคิดเหมือนกับ Explore คือแสดงคอนเทนต์ของคนที่ผู้ใช้งานไม่ได้ติดตามเป็นส่วนใหญ่ เน้นไปที่โพสต์ซึ่งให้ความบันเทิง Signal ที่มีน้ำหนักสูงจึงเป็นประวัติการใช้งาน เช่น โพสต์แบบไหนที่เราหยุดดู โพสต์แบบไหนที่เรา Like หรือคอมเมนต์</p>\n<p>อย่างไรก็ตามทั้งหมดนี้อาจทำให้ผู้ใช้งานรู้สึกว่า Instagram เป็นฝ่ายกำหนดเนื้อหามาให้ มากกว่าที่พวกเขาจะควบคุมเนื้อหาได้เอง Instagram จึงแนะนำแนวทางเพื่อกำหนดเนื้อหาที่เราอยากเห็นจริง ๆ ได้แก่ ให้กำหนด <a href=\"https://www.blognone.com/node/106737\">Close Friends</a>, Mute คนที่เราไม่อยากเห็น และหากมีโพสต์แนะนำแสดงขึ้นมาและไม่ชอบ ให้เลือก Not Interested เพื่อสร้าง Signal ขึ้นมา</p>\n<p>ที่มา: <a href=\"https://about.instagram.com/blog/announcements/shedding-more-light-on-how-instagram-works\">Instagram</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/instagram\">Instagram</a></div><div><a href=\"/topics/social-network\">Social Network</a></div><div><a href=\"/topics/algorithm\">Algorithm</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"913e1f032ae9d0d8609561c653cd8d6b6eedf05a5326b5a16395096a083c70f0","category":"Thai"}