{"title":"Creating a diagnostic assessment model for autism spectrum disorder by differentiating lexicogrammatical choices through machine learning","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311209","date":1727445600000,"content":"<p>by Sumi Kato, Kazuaki Hanawa, Manabu Saito, Kazuhiko Nakamura</p>\r\n\r\nThis study explores the challenge of differentiating autism spectrum (AS) from non-AS conditions in adolescents and adults, particularly considering the heterogeneity of AS and the limitations ofssss diagnostic tools like the ADOS-2. In response, we advocate a multidimensional approach and highlight lexicogrammatical analysis as a key component to improve diagnostic accuracy. From a corpus of spoken language we developed, interviews and story-recounting texts were extracted for 64 individuals diagnosed with AS and 71 non-AS individuals, all aged 14 and above. Utilizing machine learning techniques, we analyzed the lexicogrammatical choices in both interviews and story-recounting tasks. Our approach led to the formulation of two diagnostic models: the first based on annotated linguistic tags, and the second combining these tags with textual analysis. The combined model demonstrated high diagnostic effectiveness, achieving an accuracy of 80%, precision of 82%, sensitivity of 73%, and specificity of 87%. Notably, our analysis revealed that interview-based texts were more diagnostically effective than story-recounting texts. This underscores the altered social language use in individuals with AS, a csrucial aspect in distinguishing AS from non-AS conditions. Our findings demonstrate that lexicogrammatical analysis is a promising addition to traditional AS diagnostic methods. This approach suggests the possibility of using natural language processing to detect distinctive linguistic patterns in AS, aiming to enhance diagnostic accuracy for differentiating AS from non-AS in adolescents and adults.","author":"Sumi Kato","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"91443bac9cfdb66a4a47b95427923352283f2e0f2163c195b4edca3d9f308888","category":"Interdisciplinary"}