{"title":"Unlocking the potential of rice bran oil body as fat replacement in cookies: single and double crosslinked binary emulsion‐filled gels based on lutein‐loaded rice bran oil body emulsion","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13794?af=R","date":1722951904000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Rice bran oil body is rich in nutritional value, which is a byproduct of rice processing. The aim of this study is to develop a novel emulsion-filled gel with lutein-loaded rice bran oil body and investigate its functionality as a fat replacer in cookies. The effects of incorporating structured oil body in the form of emulsion-filled gel instead of butter in cookies with a ratio of 0, 10, 20 and 50 wt% formulation were determined by measuring appearance, texture, thermodynamic properties, moisture distribution and microstructure.</p>\n<h2>RESULTS</h2>\n<p>The results demonstrated the relationship between geometry, moisture and structure. The 20 wt% emulsion-filled gel substitution ratio yielded mobility and distribution abilities of melted fat and sugar in the cookies that were closest to those of butter. The addition of emulsion-filled gel increased the <i>L</i>* value and decreased the <i>a</i>* value, while the <i>b</i>* value of the cookie increased due to the advanced delivery of lutein by oil body. By controlling the addition ratio, the texture of the cookies can be adjusted. Starch granules were separated due to colloidal particles, reducing saturated fat content and decreasing cookie gelatinization enthalpy. The fat coating on starch particles enhanced the binding capacity of free water, improving air entrapment and forming a constrained gluten network structure.</p>\n<h2>CONCLUSION</h2>\n<p>These findings provide a theoretical basis for rice bran oil body as a novel substitute for butter in the development of healthy, high-quality cookies. © 2024 Society of Chemical Industry.</p>","author":"Xiaoyu Li, \nWei Chen, \nWenwen Lv, \nIkram Alouk, \nYingmao Yuan, \nYanbo Wang, \nDuoxia Xu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9151cb8775be4c2b1b89a49eee52633019109edada584d3bb4f66c925257cc2a","category":"Environment"}