{"title":"455 Evaluating the effect of a phenology-based timeline on the interpretation of enteric methane emission results","link":"https://academic.oup.com/jas/article/102/Supplement_3/318/7757223?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The methodology of analyzing methane emissions in cattle grazing native rangeland is imperative for producing reliable and repeatable estimations of total enteric emissions on an individual and herd basis. However, due to seasonal differences in climate from year to year, there are distinct differences in forage biomass availability and nutrient composition on extensive rangelands. Thus, our objective was to evaluate the differences in methane emissions using phenological forage phases compared with specific time periods. Yearling Angus steers (n = 127) were allocated to one of six pastures grazed from June to September (2023) at the South Dakota State University Cottonwood Field Station (Cottonwood, SD). Each pasture was equipped with a GreenFeed (C-Lock Inc., Rapid City, SD) pasture system to measure individual animal CH<sub>4</sub> emissions. A subset of CH<sub>4</sub> data from two cool-season-dominated pastures were aggregated from the overall study. We used two methods to segment CH<sub>4</sub> by either 1) month (June, July, August) or 2) phenology (vegetative, reproductive, and senescence) to derive average CH<sub>4</sub> (gּ animalּ <sup>-1</sup>ּ d<sup>-1</sup>) for each period. Western wheatgrass (WWG), a cool-season native, was used as a proxy for cool season grass development. On May 28<sup>th</sup>, 2023, the growing degree days (GDD) reached 632, representing the 3.5 leaf stage. WWG has been documented to reach maturity at approximately 1,100 GDD, which occurred on June 20<sup>th</sup>, 2023. Nutrient content of the forage (i.e., lignin) was used to approximate the start of senescence on August 11<sup>th</sup>. These developmental markers created estimates of the vegetative, reproductive, and senescence periods within our emissions data. Differences in enteric emissions for each approach were analyzed using a linear mixed effects model in R, and post-hoc contrast between methods was assessed using the lsmeans package. There were no statistical differences in CH<sub>4</sub> by month (<span>P</span> &gt; 0.05), and the means for June, July, and August were 217, 214, and 211 ± 4, respectively. By phenological phases, there was a difference (<span>P</span> &lt; 0.05) between maturity and senescence, with means for vegetative, reproductive, and senescence as 214, 219, and 206 ± 4, respectively. Methane intensity (gּ animal<sup>-1</sup>ּ d<sup>-1</sup>) per period was then multiplied by the number of days in each month or phase to estimate total emissions for the entire grazing season (86 d). The monthly approach totaled 18,383 g CH<sub>4</sub> per animal, while phenology totaled 18,504 g for the grazing season. This is a difference of 0.654% between the same data segmented by month or by phenology. Therefore, because of the dynamic nature of forage and cattle production, it is likely that accounting for phenology will provide greater clarity for GHG on rangeland systems rather than arbitrary periods of time and will require the use of dynamic models to handle the complexity of enteric emissions of grazing animals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"91557257b6c94950a28eaf0f404e9759922517e08e93402fc06f656f27e75d1d","category":"Environment"}