{"title":"Report: Enhanced 3nm M3 Ultra to debut in Mac Studio this summer","link":"https://www.macworld.com/article/2193146/m3-ultra-enhanced-3nm-mac-studio-wwdc-summer-2024.html","date":1704471165000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>We don’t expect much when it comes to <a href=\"https://www.macworld.com/article/2156878/2024-could-be-one-of-the-dullest-years-ever-for-the-mac.html\">2024 Mac releases</a>, but there is one update we’re looking forward to: the debut of the M3 Ultra.</p>\n\n\n\n<p>According to a report by <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.thelec.kr/news/articleView.html?idxno=24527&amp;xcust=1-1-2193146-1-0-0&amp;sref=https://www.macworld.com/feed\">The Elec</a> (registration required), TSMC, the company that manufactures Apple’s SoCs, is all set to go with producing the M3 Ultra–in fact, TSMC has developed an enhanced 3nm process that it will use for the M3 Ultra. The <a href=\"https://www.macworld.com/article/2120691/m3-m3-pro-and-m3-max-specs-features-cpu-gpu.html\">M3, M3 Pro, and M3 Max</a> that were released last October are produced with the standard 3nm process, and the enhanced process will allow for chips with better performance and power efficiency.</p>\n\n\n\n<p>The report suggests that the M3 Ultra will be in the updated Mac Studio that will be released in the middle of this year, which sounds like a debut at Apple’s Worldwide Developers Conference which is usually in June every year. However, the publication doesn’t mention the Mac Pro, which arrived at WWDC alongside the M2 Ultra Mac Studio last year. That doesn’t mean it’s not going to happen, but as Macworld contributor Thiago Trevisan points out, the Mac Pro addresses<a href=\"https://www.macworld.com/article/2175175/m3-ultra-mac-studio-performance-graphics-price.html\"> a specific niche</a>, and it’s the Mac Studio that’s really Apple’s top-of-the-line Mac for pros.</p>\n\n\n\n<p>The report also notes that the enhanced 3nm process will be used for the A18 Pro that will be in the iPhone 16 Pro.</p>\n\n\n\n<p>The 3nm process refers to the production of the chip, and 3nm allows for increased transistor density over the previous 5nm and enhanced 5nm processes. The higher the transistor density, the better the performance, and the process can also result in better power efficiency. Apple first started using 3nm chips with the A17 Pro in the iPhone 15 Pro, which was followed by the M3 in the <a href=\"https://www.macworld.com/article/2126614/24-inch-imac-m3-review.html\">iMac</a> and 14-inch MacBook Pro, and the M3 Pro and Max in the 14- and 16-inch MacBook Pros.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9158f2bb7e88d9712882c5381a033ee919bd65d8869bb000d299d0069b626d92","category":"Apple"}