{"title":"Future Drought‐Induced Tree Mortality Risk in Amazon Rainforest","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023EF003740?af=R","date":1723545369000,"content":"<h2>Abstract</h2>\n<p>The future evolution of the Amazon rainforest remains uncertain not only due to uncertain climate projections, but also owing to the intricate balance between tree growth and mortality. Many Earth System Models inadequately represent forest demography processes, especially drought-induced tree mortality. In this study, we used ORCHIDEE-CAN-NHA, a land surface model featuring a mechanistic hydraulic architecture, a tree mortality sub-model linked to a critical loss of stem conductance and a forest demography module for simulating regrowth. The model was forced by bias-corrected climate forcing data from the ISIMIP-2 program, considering two scenarios and four different climate models to project biomass changes in the Amazon rainforest until 2100. These climate models display diverse patterns of climate change across the Amazon region. The simulation conducted with the HadGEM climate model reveals the most significant drying trend, suggesting that the Guiana Shield and East-central Amazon are approaching a tipping point. These two regions are projected to transition from carbon sinks to carbon sources by the mid-21st century, with the Brazilian Shield following suit around 2060. This transition is attributed to heightened drought-induced carbon loss in the future. This study sheds light on uncertainties in the future carbon sink in the Amazon forests, through a well-calibrated model that incorporates tree mortality triggered by hydraulic damage and the subsequent recovery of drought-affected forests through demographic processes.</p>","author":"Yitong Yao, \nPhilippe Ciais, \nEmilie Joetzjer, \nSongbai Hong, \nWei Li, \nLei Zhu, \nNicolas Viovy","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"915a7faf9d93632aece77a8ea64272c809acb06f7f4ca51d2f789a75305185b5","category":"Environment"}