{"title":"Giro d'Italia 2021 Preview: Route, predictions and contenders","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview","date":1620215678000,"content":"\n      <p><span>The Giro d'Italia is the first of the three Grand Tours in the 2021 cycling season and begins on 8th May.</span></p>\n<p>Known for its steep, demanding climbs, the 2021 route is set to provide an enthralling spectacle with many of the world's most esteemed climbers in attendance.</p>\n<div></div>\n<p>The 2021 Giro was peculiar for a number of reasons. Usually taking place in May, the race was postponed until October. This made it challenging for riders attempting to complete the Tour-Giro double as they'd be forced to ride them in quick succession. The Vuelta a España also overlapped with the Giro, making it impossible for a rider to complete 100% of both races.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a> <br /><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – </a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span>The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p>\n<p>As the world attempts to return to normality, so too will the cycling calendar begin to resemble the familiar pattern of the last years. This means that the Giro d'Italia has been restored to its common slot in May, two months prior to the Tour.</p>\n<p>The race for the maglia rosa also made 2020 an atypical edition. Geraint Thomas, Simon Yates, Jakob Fuglsang and Vincenzo Nibali were the pre-race favourites, but Thomas crashed out early whilst Yates contracted COVID-19, meaning the 1-2 from Tirreno-Adriatico were out.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><em><strong>Related – The Tour de France 2021 Preview</strong></em></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\" target=\"_blank\"><em><strong></strong></em></a><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico-2021-preview\" target=\"_blank\"><em><strong></strong></em></a>In Remco Evenepoel’s absence, João Almeida filled his shoes with flying colours. The Portuguese man quickly became a star. He held the maglia rosa between stages three and eighteen before battling on to finish fourth in his first Grand Tour. <span>Tao Geoghegan Hart </span>filled the void left by Geraint Thomas to go clear on the Passo dello Stelvio alongside the Team Sunweb duo of Wilco Kelderman and Jai Hindley — the three riders were separated by 15 seconds in the GC with three stages remaining. </p>\n<p><span>Kelderman fell away, though, and <span>Geoghegan Hart</span> was distinctly stronger than Hindley in the final time-trial into Milan, catapulting the Brit to a sensational victory which could never have been foreseen.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032639-083_1024x1024.jpg?v=1614857757\" />Tao <span>Geoghegan Hart after winning the 2020 Giro d'Italia</span> </span></i><i><span>(Image credit: </span></i><i><span>LB/RB/Cor Vos</span></i><i><span>)</span></i></p>\n<h4><strong>Route</strong></h4>\n<p><span>The Giro d’Italia is renowned for its multitude of steep climbs and hilly roads throughout, while also including some flat stages to tempt some of the world's strongest sprinters to join the fun.</span></p>\n<h4><strong>Giro d'Italia 2021 - Stage 1 ITT (Turin &gt; Turin)</strong></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage1_e107d5d7-f419-4402-a82f-d8777963aa4d_1024x1024.png?v=1619693389\" /></p>\n<p>The 2021 Giro kicks-off in <span>Turin</span> with a 9km flat time-trial — Filippo Ganna territory. The World Champion in the time-trial discipline had won a remarkable nine TT's in a row before he was beaten by Wout Van Aert at Tirreno-Adriatico. Remi Cavagna may be the Italian's closest challenger — the Deceuninck Quick-Step man is the current French time-trial champion. Other potential stage challengers include <span>Victor Campenaerts</span> and Nelson Oliveira. The battle for the inaugural maglia rosa will be Pippo Ganna vs. the field.</p>\n<h4><strong>Giro d'Italia 2021 - Stage 2 (<span>Stupinigi</span> &gt; <span>Novara</span>)</strong></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage2_71d8904e-c55f-4762-8b6b-7ba223828467_1024x1024.png?v=1619693480\" /></p>\n<p>The next couple of stages are set to be decided in a mass sprint. Heading to Novara, we also have the Montechiaro d'Asti, a short climb of just under 2km where the fight for the first KOM jersey will take place. </p>\n<h4><strong>Giro d'Italia 2021 - Stage 3 (<span>Biella</span> &gt;<span> Canale</span>)</strong></h4>\n<p><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage3_ef6fd989-14c0-4bb9-9708-e78cbe527904_1024x1024.png?v=1619693515\" /></strong></p>\n<p><span>Stage three does feature some short but sharp ramps which will likely put the purest sprinters into difficulty. After winning stage one of the Tour de Romandie which also featured some ramps, Peter Sagan will have this one bookmarked. A breakaway may try their luck, though, and BORA will be under pressure to control for the Slovak.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 4 (<span>Piacenza</span> &gt;<span> Sestola</span>)</strong></span></h4>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage4_c2c81722-a9ab-42e4-9609-0003e946095b_1024x1024.png?v=1614857823\" />Stage four is the first of the mountain stages and features 3000 metres of climbing to Sestola. With up and down terrain for the final 100km, the race may be difficult for the peloton to control and we will likely see a multitude of attacks. The final ascent, the Colle Passerino, is 4.3km and a leg-sapping 9.5%. </span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 5 (<span>Modena</span> &gt;<span> Cattolica</span>)</strong></span></h4>\n<br />\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage5_3a979803-b8d0-427c-8178-d844df699b10_1024x1024.png?v=1619694199\" /></strong></span></p>\n<p><span>The pancake-flat stage five follows, where the sprinters who had been conserving legs in the grupetto yesterday will get a chance to shine. Caleb Ewan will be the man to beat.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 6 (<span>Grotte di Frasassi</span> &gt;<span> Ascoli Piceno</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage6_65632a47-2e7d-43f3-975c-d97e28cdaea9_1024x1024.png?v=1619694304\" /></strong></span></p>\n<p><span>It's just a single day off for the GC favourites, though. Stage six includes the longest climb of the race thus far, the Colle San Giacomo is 15.5km and has a gradient of 6% before the stage finishes in Ascoli Piceno.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 7 (<span>Notaresco</span> &gt;<span> Termoli</span>)</strong></span></h4>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage7_4e1cf1a2-4a39-475f-bb28-0fdd30985d81_1024x1024.png?v=1619694325\" /></div>\n<p><span>A fourth opportunity for the sprinters lies on stage seven to round out the first week as the riders head from Notaresco to Termoli.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 8 (<span>Foggia</span> &gt;<span> Guardia Sanframondi</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage8_44a5f2c4-b35e-4382-8760-6ae8eca6372c_1024x1024.png?v=1619694361\" /></strong></span></p>\n<p><span>Week two gets underway with 3000+ metres of climbing — commonplace on this year’s route. The Bocca della Selva provides a strenuous early test, the climb is 19km long though averages just 4.6%. </span><span>The final ascent to Guardia Sanframondi isn’t the most strenuous of the race, though at 5.3km and 6.7%, those targeting pink must stay focused. </span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 9 (<span>Castel di Sangro</span> &gt;<span> Campo Felice</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage9_527f2e66-7cbe-410c-a85a-0bb90da17a80_1024x1024.png?v=1619694385\" /></strong></span></p>\n<p><span>Stage nine is no easier and has the potential to be a thrilling stage. Climbs are scattered throughout and coming in at under 160km, the stage could be ridden in an attacking fashion. This is particularly the case as stage 10 is the next opportunity for the sprinters, which will in-turn be followed by a rest-day.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 10 (<span>L’Aquila</span> &gt;<span> Foligno</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage10_6deb3b30-78ba-4c4c-a158-a35b024e68ca_1024x1024.png?v=1619694625\" /></strong></span></p>\n<p><span>Assuming the sprinters have stayed within the time-limit on stage 9, they will fight for this one in Foligno. The Valico della Somma provides the main obstacle at 6.8km and a gradient of 5%, though it takes place 40km from the finish line.</span></p>\n<p><span>T</span><span>o this point, numerous uphill finishes will have taken place, but none of them come close to the queen stage. This means that we could see a tight general classification entering the first rest-day.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 11 (<span>Perugia</span> &gt;<span> Montalcino</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage11_52fcf0da-2440-47b9-bd49-bb45e5efba2b_1024x1024.png?v=1619694654\" /></strong></span></p>\n<p><span>Stage 11 could be one of the most exciting at this year’s Giro d'Italia. Starting in Perugia, the peloton will head west into Tuscany before riding some of the gravelled roads that are raced at Strade Bianche. This is one of the must-see stages, anything could happen.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 12 (<span>Siena </span>&gt;<span> Bagno di Romagna</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage12_c62b6adf-f254-4a15-b1a4-fd9ca1444395_1024x1024.png?v=1619694411\" /></strong></span></p>\n<p><span>Stage 12 begins in Siena and the mountains return. Over 4,000 metres will be climbed as the stage difficulty ramps up into the second half of the race. The Passo della Consuma (15.1km @ 6.1% ) and the Passo della Calla (16.1km @ 5.3%) are long, gruelling efforts which also feature steeper pitches. Again, the following stage could enable more attacks and general explosiveness as stage 13 is the definition of flat.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 13 (<span>Ravenna </span>&gt;<span> Verona</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage13_741836b1-0b76-4808-b7d4-1f1a82116df2_1024x1024.png?v=1619694687\" /></strong></span></p>\n<p><span>An entirely flat stage 13 from Ravenna to Verona will provide a much needed rest for the GC candidates and another chance for the sprinters and their leadout men.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 14 (<span>Cittadella </span>&gt;<span> Monte Zoncolan</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Stage14_f088a356-0855-439e-ab87-2f2ce737455b_1024x1024.png?v=1619694430\" /></strong></span></p>\n<p><span>Stage 14 will tell us who is capable of winning the maglia rosa, the revered Monte Zoncolan awaits. At 13.3km and 8.9%, the Zoncolan will be ruthless. It has been used on six occasions since 2000, most recently in 2018. Chris Froome won that day ahead of Simon Yates and the top 10 were spread across almost two minutes. Expect the group of favourites to shatter in a similar fashion this year.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Giro_2010_96_1024x1024.jpg?v=1618572402\" /></p>\n<p><em>The Zoncolan is one of the most feared climbs in all of pro cycling</em></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 15 (<span>Grado </span>&gt;<span> Gorizia</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage15_c7460411-d8c2-4ea9-85eb-7f9cc6d1be39_1024x1024.png?v=1619694707\" /></strong></span></p>\n<p><span>Stage 15 to Gorizia is much less complex. A breakaway win is feasible and if not, a day for any of the sprinters that survived Zoncolan could be on the menu. </span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 16 (<span>Sacile </span>&gt;<span> Cortina d’Ampezzo</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage16_137a367c-0dbd-4c0a-b341-a68cdd798b85_1024x1024.png?v=1619694448\" /></strong></span></p>\n<p><span><span>Stage 16 is the final stage before the second rest-day and the riders will need it. 210km and well over 5,000 metres of climbing awaits, featuring multiple iconic mountains including the Passo Fedaia (13.6km @ 7.6%), Passo Pordoi (11.9km @ 6.6%) and the Passo Giau (9.8km @ 9.3%). The peloton then run downhill to the finish in Cortina d’Ampezzo — the hosts of the Alpine Ski World Championships in February earlier this year. Perhaps the queen stage.</span></span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 17 (<span>Canazei </span>&gt;<span> Sega di Ala</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage17_7b8ab862-ca8e-4fbb-b1ba-3627f6ef4f69_1024x1024.png?v=1619694947\" /></strong></span></p>\n<p><span>The queen stage may have been completed, but there are still opportunities aplenty for the GC contenders to take time on their rivals. The peloton must tackle the Passo San Valentino (15.1km @ 7.6%) on stage 17 before finishing on the Sega di Ala (11.6km @ 9.5%). Anyone not feeling well-rested will suffer.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 18 (<span>Rovereto </span>&gt;<span> Stradella</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage18_3bdadc66-7541-47c4-a626-8b6de7db63c0_1024x1024.png?v=1619695074\" /></strong></span></p>\n<p><span>Next up, the longest stage of the 2021 Giro d’Italia. Stage 18 is flat for 200km before a series of short hills in the final 30km could shake things up. Depending on who makes the early breakaway and whether the team defending pink possess motivation to chase, this could be one to mark for the breakaway specialists.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 19 (<span>Abbiategrasso </span>&gt;<span> Alpe di Mera</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage19_6d7f7373-f488-4211-9107-7d2b8320ec52_1024x1024.png?v=1619694472\" /></strong></span></p>\n<p><span>Stage 19 is another test for the GC riders and features a summit finish on the Alpe di Mera (9.6km @ 9.1%). This climb is exceptionally steep and those that are struggling will be found out. The Mottarone and Passo della Colma precede the final climb to make 3350 vertical metres across the stage.</span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 20 (<span>Verbania </span>&gt;<span> Valle Spluga-Alpe Motta</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage20_8d42b317-4d84-4487-9915-52532b07a0e4_1024x1024.png?v=1619694495\" /></strong></span></p>\n<p><span><span>The most difficult test in the final week comes on stage 20, though. Although the stage doesn’t finish here, the Passo san Bernardino (23km @ 6.3%) will put any strugglers to the sword. The stage ends on the Alpe Motta, a climb of 7.4km @ 8.5%, just kilometres from the Swiss-Italian border. Those that typically lose time in the time-trial discipline will do everything they can to gain as much time as possible.</span></span></p>\n<h4><span><strong>Giro d'Italia 2021 - Stage 21 ITT (<span>Senago </span>&gt;<span> Milan</span>)</strong></span></h4>\n<p><span><strong><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage21_3ab5802c-4d20-43b8-9697-8384ffb4d3fd_1024x1024.png?v=1619695186\" /></strong></span></p>\n<p>The torturous mountains may be done and dusted, but the GC riders must stay strong for one final day. A 29.5km individual time-trial to the centre of Milan could prove decisive in the chase for pink. After all, the pink jersey changed hands in the stage 21 time-trial last year. Assuming he has survived the three week trip around Italy, Filippo Ganna will start again as the hot-favourite, with Victor Campenaerts and Remi Cavagna looking to spoil the Italian's fun.</p>\n<h4><b>Contenders</b></h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20200827TDF0034-A.S.O._Alex_Broadway_1024x1024.jpg?v=1614858430\" />Egan Bernal (<i><span>Image credit: Alex Broadway/ASO/SWPix)</span></i></p>\n<p><span>The Giro d’Italia has a riveting startlist this season. The route features less time-trial kilometres than the Tour de France which means many of the strongest climbers in the world have turned their focus to Italy instead</span><span> of the Tour. Perhaps the anticipated domination of </span><span>Tadej Pogačar </span><span>and Primož Roglič</span><span> in France is also a factor.</span></p>\n<p><span>Tao Geoghegan Hart</span><span>, the reigning Giro champ, will not return this season. Instead, he looks to help INEOS at the Tour de France. The Grenadiers remain key protagonists, though. Egan Bernal will ride the Giro d'Italia for the first time in his career, and although he has stated that he is still struggling with back pain, his 2021 results suggest he is on strong form. The winner of the 2019 Tour is one of the premier favourites.</span></p>\n<p><a href=\"https://youtu.be/jWSQgE6EM1c\"><em><strong>Watch our video: Who will win the 2021 Giro d'Italia?</strong></em></a></p>\n<p><span>Pavel Sivakov also joins the Grenadier squad and we expect to see further progression from the Russian this season. He is very talented and could take the reins should Bernal struggle. <span>Daniel Felipe Martínez</span> and </span>Iván Ramiro Sosa <span>could be given chances to shine, although may be forced to ride for the team throughout. Filippo Ganna will look to win the two time-trials and help the team elsewhere.</span></p>\n<p><span>Astana Premier-Tech have a great chance led by emerging Russian talent Alex Vlasov. He did well at the Vuelta last year after an impressive inaugural season at WorldTour level. Vlasov has proven to be one of the most exciting young climbers in the world, proven by his win on Mont Ventoux last Summer.</span></p>\n<p><span>Deceuninck-Quick-Step are an interesting proposition. Remco Evenepoel crashed out heavily at Il Lombardia last year and hasn’t raced since. We still await confirmation from Deceuninck Quick-Step, but should</span> the Belgian prodigy start in Turin he could be the out-and-out favourite. He started four stage-races in 2020, winning all four and defeating riders such as Jakob Fuglsang, Mikel Landa and Miguel Angel Lopez. His fitness is questionable though after a lengthy lay-off. We wait to see whether he is able to race and what type of form he is in.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032316-009_1024x1024.jpg?v=1614869556\" /><em><span>Remco Evenepoel (Image credit: Luis Gomez/Cor Vos)</span></em></span></p>\n<p><span><span>It’s been a difficult period in Thibaut Pinot's career. After winning on the Tourmalet at the 2019 Tour, his subsequent withdrawal was a hammer-blow when he looked to be in the form of his life. He also struggled at the Tour last year after crashing on stage one. Something often seems to go wrong for Pinot, whether it be a crash, illness, or losing time in crosswinds. After struggling at the Tour of the Alps, Pinot announced he would not be riding the Giro d'Italia as originally planned. We wait to see what the Frenchman will look to next.</span></span></p>\n<p><span>Mikel Landa returns to the Giro this year after he finished fourth in 2019. The Spaniard is one of the strongest pure climbers in the world and cannot be underestimated, despite his inevitable time loss in the two time-trials. He is backed up by Pello Bilbao who finished in the top-5 at the Giro last season himself. Bilbao is one of the world's best descenders too, proven by his win on stage four of the Tour of the Alps this season which concluded with a treacherous descent into <span>Pieve di Bono</span>.</span></p>\n<p><span>Emanuel Buchmann had a year to forget in 2020 after a crash at the Dauphine meant he was unable to perform at his best. The German had been improving every year and achieved fourth at the 2019 Tour de France overall. Buchmann has never ridden the Giro d'Italia before and his debut in Italy could see him challenge for pink.</span></p>\n<p><span>Simon Yates returns to the Giro again this year after being forced to withdraw on his last attempt. The Brit is searching for his second Grand Tour win after winning the Vuelta in 2019. We know that both Yates bros are among the best in the world when the road goes uphill, meaning if Yates is on-form, he is a leading contender. Yates looked at his very best at the Tour of the Alps in April where he won stage two.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2022077_giro_019_1024x1024.jpg?v=1619108954\" /></span><span><em>Simon Yates (Image credit: <span>Presse Sports / Offside</span>)</em></span></p>\n<p><span>Another Brit looking to challenge overall is Hugh Carthy of EF Education-NIPPO. Carthy demonstrated elite climbing and time-trialling legs at the Vuelta in 2020, earning a place on the final podium. This was by far Carthy’s best result in his career yet, and at 26-years-old, we see no reason why Carthy cannot improve further as he gains experience racing directly against the finest cyclists around.</span></p>\n<p><span>Trek-Segafredo were expected to arrive in Turin with both Vincenzo Nibali and Bauke Mollema as their dual leaders, but ‘Lo Squalo’ crashed in training putting his participation into doubt. However, his recovery has gone well so far and he is on-track to make the start of the Giro, with the team announcing on Monday 3rd May that he will be participating. His form may have taken a step back, though. </span></p>\n<p><span>On the other hand, Bauke Mollema started 2021 in exceptional form. First he won a stage at the Tour des Alpes, then the <span>Trofeo Laigueglia.</span> He could be going under the radar.</span></p>\n<h4>Outsiders to watch</h4>\n<p>Finishing in the top 10 at the Tour of the Alps and 8th at Tirreno-Adriatico, Romain Bardet’s form looks to be building nicely towards the Giro. His team, Team DSM, have had a lacklustre start to their season and will be hoping to get some results as the stage races begin. With Jai Hindley, who finished second in last year’s Giro, also in their roster, him and Bardet could make a strong duo in the mountains.</p>\n<p>Dan Martin (Team ISN) was also riding well in the Alps, in contention for a podium finish until a crash on the penultimate stage sent his chances awry. In a statement by his team, Martin explained that he feels stronger than ever ahead of this year’s Giro and is well-suited to the course.</p>\n<p>Movistar’s Marc Soler could also challenge in the mountains, his recent stage win at the Tour de Romandie is an indication of his form, but perhaps more importantly for the Giro’s course this year, he finished 8th in the time trial at Romandie. His performances against the clock look to be improving – this will be essential in the fight for pink.</p>\n<p>The tifosi will be cheering on Italian riders Davide Formolo (UAE-Team Emirates) and Domenico Pozzovivo (Qhubeka-Assos), who both have a long shot at a podium finish at the Giro. Formolo has finished in the top 10 in Grand Tours three times now and will be leading UAE-Team Emirates in the race which will be passing close to his hometown. Pozzovivo will also be his team’s leader for the GC and will want to build on his impressive performance in the Giro last year.</p>\n<p>Clement Champoussin is in his first full season with AG2R Citroen. At 22 years old, he’s an up-and-coming French talent who will hope to make his mark in his second ever Grand Tour. Despite his age, Champoussin claimed some impressive top 10 results in stages of the Vuelta last year.</p>\n<p>Tobias Foss of Jumbo Visma is another rider making his Giro debut. He won the Tour de l’Avenir in the under-23 ranks, showing great climbing prowess. Normally, a rider of his age wouldn’t be expected to perform in a race like the Giro, but with the results of riders like Pogacar and Evenepoel, there’s every chance Foss will have to go for it if something goes wrong for his leader.</p>\n<h4>Giro d’Italia jersey predictions</h4>\n<h4>Maglia azzurra</h4>\n<p>The maglia azzurra is the bright blue climber’s jersey of the Giro d’Italia. Points are awarded to the leading riders over designated climbs. Each climb is put into a classification depending on its difficulty and where it falls in the day’s stage. However, bonus points are awarded for mountain top finishes and over the Cima Coppi, the title given to the highest peak of the race.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2021126_cyclisme_009_1024x1024.jpg?v=1620215073\" /></p>\n<p>In the past, this jersey has been won by the leader of the general classification, as it was by Chris Froome in 2018. However, it often lends itself to riders who can get themselves in the breakaway on hilly stages and pick up points before the GC battle commences on the final climb.</p>\n<p>Ruben Guerreiro won the maglia azzurra in 2020 and he could well be targeting it again in this year’s race. Breakaway specialist Thomas de Gendt could also have a shot, if he isn’t held back to help out Ewan in the sprints. This classification is often most difficult to predict, however, as riders tend to see how they feel in the race before committing to fighting for maglia azzurra.</p>\n<h4>Maglia bianca – best young rider predictions</h4>\n<p>The maglia bianca is awarded to the best young rider of the race, the competition is restricted to those of 25 years of age or under. In the past, this jersey would have been an indication of new talent to look out for in the future, but as the winners of Grand Tours are getting younger, it’s most common for the winner of this jersey to be targeting the overall race victory. The maglia bianca is then decided in the process.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/2022061_giro_010_1024x1024.jpg?v=1620215747\" /></p>\n<p>Tao Geoghegan Hart is an example of this, he won both the pink and white jerseys in last year’s race. Nairo Quintana did the same in 2014. This year, Egan Bernal will be eligible to win the white jersey, as will Pavel Sivakov – two favorites for the overall win. Remco Evenepoel could also target the young rider’s classification, depending on how his form is after his long break from racing.</p>\n<h4>Trofeo Fast Team</h4>\n<p>Known as the Trofeo Fast Team, the team classification in the Giro is not one of the most hotly contested prizes, but it still gives nice bragging rights to the winners, as well as a monetary reward.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032639-048_1024x1024.jpg?v=1620215505\" /></p>\n\n<p><em>Photo: Cor Vos/SWpix.com</em></p>\n<p>It is calculated by adding up the times’ of the top three riders from each team, then the team with the lowest amount of time wins the classification. Last year, Ineos Grenadiers took this prize and they have a good chance of doing it again in 2021 with strong GC riders like Bernal and Sivakov in their line-up.</p>\n<p>Jumbo-Visma could also challenge, as could team Movistar.</p>\n<h4>Maglia ciclamino – Sprinters to watch</h4>\n<p>The maglia ciclamino (technically mauve in colour) is the points jersey at the Giro, awarded to the race’s most consistent finisher. Each stage is put into one of three levels, each with their own points classification scheme. The flatter stages award the most points (to the top 20 riders, from 50 to 1 point) and this is altered according to the parcour of each stage, with the hilliest stages awarding the least points in the competition.</p>\n\n<p>Last year, Arnaud Demare won this jersey, by virtue of his four stage wins and strong performances in the intermediate sprints. It normally goes to the best sprinter in the race, previous winners include Ackermann, Viviani, Gaviria and Nizzolo.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032587-053_1f740f26-fbbb-481d-81a8-577610103108_1024x1024.jpg?v=1620215399\" /></p>\n\n<p><em><span>The maglia ciclamino (</span>Photo: Cor Vos/SWpix.com)</em></p>\n<p>This year, Caleb Ewan looks to be the favourite to take the maglia ciclamino. Although, if he wins stages early in the race, it may be unlikely we’ll see Ewan make it all the way to Milan with sprint opportunities few and far between in the final stages.</p>\n<p>Peter Sagan will also be racing. He may not be the single quickest man in the peloton, but the stages with enough meters uphill to drop the pure sprinters are perfect for the Slovak. He won recently at the Tour de Romandie and the Volta Catalunya so enters with growing confidence.</p>\n<p>They could be challenged by other fast finishers in the race. Viviani, Gaviria and Nizzolo will all be present in 2021, alongside Tim Merlier and Peter Sagan, who have both had some eye-catching results so far this season.</p>\n<p>The newest sprinter on the block is David Dekker. The 23-year-old impressed early on in 2021 at the UAE Tour where he achieved two second-place finishes at his first WorldTour race. We are not certain just how good Dekker is yet, but he is definitely one to watch.</p>\n<p><i>Cover image: </i><i>Dario Belingheri/LB/RB/Cor Vos</i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"916074ff47314ee5ab149f3500a5f75557cf2e448ec47140d3e47a11790fdd91","category":"Cycling"}