{"title":"Intention to leave the current health facility among healthcare workers in Ethiopia: Systematic review and meta-analysis","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003548","date":1723644000000,"content":"<p>by Gizew Dessie Asres, Yeshiwork Kebede Gessesse, Molalign Tarekegn Minwagaw</p>\r\nBackground <p>Strengthening workforce management to address retention challenges is worldwide concern. Ethiopia did different human resource reforms to improve retention and performance of available health workforce to step up towards universal health coverage. However, there is limited and fragmented research on intention to leave their current facility and related factors on health workers. This review was done to assess pooled national prevalence of intention to leave their current health facility and related factors among Ethiopian health workers.</p> Methods <p>This systematic review and meta-analysis followed PRISMA guidelines. Authors prepared a review protocol per Joanna Briggs Institute (JBI) manual for evidence synthesis and got registered from PROSPERO for transparency. The authors conducted a comprehensive search of PubMed, Web of Science, Cochrane, Google Scholar and African Index Medicus databases and grey literature like WHO library from 8 June 2022 to 30 May 2023. Pooled prevalence of intention to leave current health facility and related factors was computed using MedCalk, Meta Essentials and R software. Publication bias was assessed using Egger’s test and a funnel plot.</p> Results <p>Pooled prevalence of intention to leave among health workers in Ethiopian healthcare setting was found to be 63.52% (95% CI (58.606–67.904)) for random effects model at Q = 141.5689 (I<sup>2</sup>(inconsistency) = 90.82%, P &lt; 0.0001). Only organizational justice OR = 0.29 (0.14–0.61) was found to be a significantly associated factor for health workers’ intention to leave their current healthcare setting in Ethiopia.</p> Conclusion <p>More than 6 in 10 of the health workers in Ethiopia were ready to leave their current healthcare facility. This result was higher than studies done in other parts of the world, even in African countries. The associated factor for health workers’ intention to leave their current health facility was only organizational justice. So, health authorities should improve their organizational justice to retain their employees.</p>","author":"Gizew Dessie Asres","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"916782406b5d7e7e8b4fdff746d29abda51b71ab024a70559b1e9465ab2660ad","category":"Environment"}