{"title":"Future-Oriented Methodologies for Inner-Outer Sustainability Assessment: Student Teachers Recognizing IDGs in Higher Education Didactics for Sustainability","link":"https://www.preprints.org/manuscript/202405.1592/v1","date":1716546337000,"content":"Methodologies for future-oriented research are mutually beneficial to highlight different methodological perspectives and proposals for extending higher education didactics towards sustainability. This study explores how different augmented reality applications can enable new ways of teaching and learning. It systematically investigates how student teachers (n=18) in higher education experienced ongoing realities while designing learning activities for a hybrid conference and interconnecting sustainability knowings via didactic modelling and design thinking. This qualitative study aims to develop a conceptual hybrid framework concerning the implications of student teachers incorporating the design thinking and inner transition into their professional work with future-oriented methodologies on didactic modelling for sustainability commitment. With a qualitative approach data was collected during and after a hackathon-like workshop through student teachers’ reflections, post-workshop surveys, and observation field notes. The thematic analysis shed light on transgressive learning and a transition in sustainability mindset through activation of inner dimensions. Findings reinforcing sustainability commitment evolved around the following categories: being authentic (intra-personal competence), collaborating co-creatively (inter-personal competence), thinking long-term-oriented (futures-thinking competence on implementing didactics understanding), relating with creative confidence (values-thinking competence as embodied engagement), and acting based on perseverant professional knowledge driven change (bridging didactics) by connecting theory-loaded empiricism and empirically loaded theory. The results highlight some of the key features of future-oriented methodologies – and approaches to future-oriented methodologies feature collaboration, boundary crossing and exploration – and show the conditions that can support or hinder methodological development and innovation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"91685209903c4fa720810a1a473879eaf9ec66d86a7439fb996b233a60a4cd00","category":"Interdisciplinary"}