{"title":"Nanoleaf Adds Thread Border Router Support to Shapes and Elements in Latest Update","link":"https://www.macrumors.com/2021/08/19/nanoleaf-thread-border-router-support/","date":1629393579000,"content":"Nanoleaf today announced the addition of Thread Border Router technology to the Nanoleaf Shapes and Elements Controllers, with the functionality available through a firmware update in the Nanoleaf app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/nanoleaf-elements-main.jpg\" />\r\n<br />\r\nWith the Nanoleaf Border Router, Nanoleaf Essentials devices will be able to connect to the Thread network automatically when the Shapes or Elements Controller is connected to WiFi.\r\n<br />\r\n\r\n<br />\r\nNanoleaf is also partnering with Eero for similar capabilities. The Eero Pro, Eero Beacon, Eero Pro 6, and Eero 6 will function as Border Routers with the Nanoleaf Essentials line. Eero will expand compatibility with other products in the future.\r\n<br />\r\n\r\n<br />\r\nNanoleaf is one of the first companies bringing Thread Border Routers to the <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a> network, making Thread technology available to other Thread-based smart home devices.\r\n<br />\r\n\r\n<br />\r\nThread technology is designed to improve the smart home networking and usage experience. Thread is a networking protocol designed for smart home products, and it offers improved connectivity, reliability, and range compared to the single connection points of Bluetooth and WiFi. Border Router technology connects a Thread network to another network like WiFi and is essential for the Thread system.\r\n<br />\r\n\r\n<br />\r\nWith Thread Border Router functionality built into the Nanoleaf Shapes Controller, Elements Controller, and Eero routers, there is no need for an extra hub because these devices serve as a bridge to connect the WiFi network and the Thread network together.<div>Tags: <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, <a href=\"https://www.macrumors.com/guide/nanoleaf/\">Nanoleaf</a>, <a href=\"https://www.macrumors.com/guide/thread/\">Thread</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/08/19/nanoleaf-thread-border-router-support/\">Nanoleaf Adds Thread Border Router Support to Shapes and Elements in Latest Update</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/nanoleaf-adds-thread-border-router-support-to-shapes-and-elements-in-latest-update.2308057/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6_Wz5UeW1Ls:xgIeuTwTnhM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=6_Wz5UeW1Ls:xgIeuTwTnhM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/6_Wz5UeW1Ls\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"916ea4c261b0eaddb27c657b9d6d58e55a0ee2b577b2884df1ac3d1de2d9146a","category":"Apple"}