{"title":"A Simplified Model to Predict the Repeated Shear Strain during the Cyclic Triaxial Test by Using an Elastic Coefficient-Damping Ratio System","link":"https://www.preprints.org/manuscript/202404.0486/v1","date":1712586763000,"content":"This study uses a mass-spring-damping system to simulate the repeated strain of liquefaction cyclic triaxial tests. The two results are compared in this paper to understand the feasibility of the mass-spring-damping system developed in this paper and the feasibility of future research on this related topic and development potential. The main factors affecting this mode's repeated strain are the spring coefficient k and the external force Q0. The spring coefficient has an inverse relationship but does not increase in multiples. The external force has a direct proportional relationship but does not increase the result- a non-multiple increase. When the pore water pressure of the liquefied cyclic triaxial test specimen rises, it will cause the specimen to liquefy, decreasing effective stress, shear modulus G, and damping ratio D, causing an increase in strain. The shear modulus and damping ratio are related to the spring coefficients k and c. Both are variables that change with time. This article takes an original thin-tube specimen at point A in the Yunlin area in Taiwan as a testing example. Through Mathematica software, it can be obtained that the mass m=1kg, the spring coefficient k=244e-0.1t kgf/cm, and the damping coefficient c=0.739e-0.257t kgf-s/cm and external force Q0=10.1sin2πt kg; Finally, this study selected the original thin-tube specimens from four locations in the Yunlin area, and simulated the repeated strain amount of the cyclic triaxial test specimens through a spring-damping system. The results show that the spring-damping system is feasible for simulated cyclic triaxial tests because the model is simple and the parameters are easy to understand and obtain, which also shows the extensibility of this model. Preliminary results of the research show that this model can further simulate the repeated strain obtained by cyclic triaxial tests without considering the increased trend in pore water pressure and the decrease in effective stress during cyclic loading.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9174fd5b73541c439a7cecf45ec71616b1fc0d924d6f6743584423550f6d6c8d","category":"Interdisciplinary"}