{"title":"Feasibility and acceptability of integrating a multicomponent breastfeeding promotion intervention into routine health services in private health facilities in Lagos State, Nigeria: A mixed methods process evaluation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301695","date":1714140000000,"content":"<p>by Diana Allotey, Valerie L. Flax, Abiodun F. Ipadeola, Olatoun Adeola, Katie Grimes, Linda S. Adair, Carmina G. Valle, Margaret E. Bentley, Sujata Bose, Stephanie L. Martin</p>\r\n\r\nMost health care providers in Lagos State, Nigeria are private and are not required to offer breastfeeding counseling to women. From May 2019-April 2020, Alive &amp; Thrive implemented a multicomponent breastfeeding promotion intervention in private health facilities in Lagos that included training and support to implement the Baby-Friendly Hospital Initiative and provide breastfeeding counseling and support to pregnant women and lactating mothers in person and on WhatsApp. We conducted a mixed methods process evaluation in 10 intervention and 10 comparison private health facilities to examine the feasibility and acceptability of integrating the intervention into routine health services. We conducted in-depth interviews with 20 health facility owners/managers and providers, 179 structured observations of health providers during service provision to pregnant and lactating women and 179 exit interviews with pregnant and lactating women. The in-depth interviews were transcribed and analyzed thematically. The structured observations and exit interviews were summarized using descriptive and inferential statistics. The in-depth interviews indicated that almost all health facility owners/managers and providers at the intervention health facilities had generally positive experiences with the intervention. However, the health providers reported implementation barriers including increased workload, use of personal time for counseling on WhatsApp, and some mothers’ lack of access to WhatsApp support groups. Observations suggested that more breastfeeding counseling occurred at intervention compared with comparison health facilities. Third trimester exit interviews showed that 86% of women in the intervention health facilities were very confident they could carry out the breastfeeding advice they received, compared to 47% in the comparison health facilities. Our research suggests that provision of breastfeeding counseling and support through private health facilities is feasible and acceptable, but service delivery challenges must be considered for successful scale-up.","author":"Diana Allotey","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9175acf1a6a4dd0e531802216748b20fc526db3ae72f0039892f8342f5f2ebca","category":"Interdisciplinary"}