{"title":"65 mpg without hypermiling in the Lincoln Aviator hybrid","link":"https://arstechnica.com/?p=1788660","date":1630407618000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/Lincoln-Aviator-2021-1-980x551.jpg\" /></div>\n        <p>\n          That subdued Aviator nameplate is much better than spelling out the model name across the front of the hood. I'm looking at you, F-L-E-X.                      [credit:\n                        Eric Bangean                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Temptation comes in different forms, especially behind the wheel. With a plug-in hybrid SUV, there are two competing urges. Sometimes, the move is to put it in sport mode and scream down the highway to take full advantage of the hybrid powertrain. In the case of the Lincoln Aviator, the urge was to ignore the engine altogether, instead relying on electrons rather than hydrocarbons for propulsion. To Lincoln's credit, the Aviator made that an easy choice.</p>\n<p>In revamping its SUV lineup, Lincoln has gone hard for big grilles and classic styling, both of which the Aviator has. It sports classic SUV contours, but the slope of the windshield and the tapering top, paired with the Aviator nameplate on the front quarter panels, give it a light art deco vibe. The mid-size, three-row Aviator plugs into Lincoln's lineup between the full-size Navigator and the compact <a href=\"https://arstechnica.com/cars/2019/05/the-2019-lincoln-nautilus-how-does-american-luxury-stack-up/\">Nautilus</a>.</p>\n<p>Unfortunately the Aviator's comfortable interior doesn't show the same level of design elegance. The materials all feel high-quality—there are scads of leather and wood trim—but it's busy. A massive center console makes what should be a spacious front row feel slightly cramped. But the seats are excellent, and both front row occupants can sink into the Aviator's 30-way (!) adjustable seats. The second-row captain’s chairs are roomy and comfortable, but the third row is difficult to get into and is best suited for kids.</p></div><p><a href=\"https://arstechnica.com/?p=1788660#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788660&amp;comments=1\">Comments</a></p>","author":"Eric Bangeman","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"917b9efa762e57a19fb4bf2a589e2d760a4301afa992f5e721ff9ecce76ebc71","category":"Tech"}