{"title":"Soaring to second on the Vuelta’s queen stage, Roglič tightens his grip on red","link":"https://cyclingtips.com/2021/09/soaring-to-second-on-the-vueltas-queen-stage-roglic-tightens-his-grip-on-red/","date":1630611535000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/09/roglic1-650x433.jpg\" /></div><h2>Soaring to second on the Vuelta's queen stage, Roglič tightens his grip on red</h2><p>\n</p><p>There are still three stages to go at the 2021 Vuelta a España, but Primož Roglič powered through what was likely the biggest test left to his race lead on Thursday as he rode to second <a href=\"https://cyclingtips.com/2021/09/high-mountain-victory-for-miguel-angel-lopez-on-stage-18-of-the-vuelta-a-espana/\" target=\"_blank\">atop the Altu d’El Gamoniteiru on stage 18.</a></p>\n\n\n\n<p>The challenging day in northern Spain featured two Cat 1s and a Cat 2 in the run-up to the grueling final climb, which saw Miguel Ángel López (Movistar) solo out of the GC group to claim at least a little bit of time on the overall standings. Roglič, however, followed every other major move with ease before closing down much of López’s advantage and finishing second on the day.</p>\n\n\n\n<p>His strong performance came only a day after he soared to a stage win and a bigger lead on Wednesday’s stage 17 to Lagos de Covadonga. After stage 18, Roglič enjoys a GC cushion of 2:30 to Movistar’s Enric Mas, who finished third on the day, while Mas’s Movistar teammate López sits 2:53 back in third.</p>\n\n\n\n<p>“Today really felt like a queen stage,” Roglič said afterward. “It was very tough. Especially after yesterday’s efforts.”</p>\n\n\n\n<p>A 14.6 km climb at 9.8%, the Altu d’El Gamoniteiru was significantly harder than any ascent left in the race and thus a clear opportunity for the climbers to show themselves. As the GC riders made their way up the early slopes in pursuit of the last survivors of the breakaway, however, none of Roglič’s rivals got clear for a long-range move.</p>\n\n\n\n<p>“It wasn’t easy for me, but I’m glad I had something left on the final climb,” Roglič said. “We also didn’t have to control the stage with Bahrain and Movistar setting the pace. Their pace was fast, so the attacks we expected didn’t happen.”</p>\n\n\n\n<p>López made his move with around 4 km to go in the climb, sailed past breakaway rider David de la Cruz (UAE Team Emirates), and continued on solo, but he was never able to get enough of an advantage to seriously threaten any big surge up the overall standings. López held on to take the stage win, but behind, Roglič distanced the rest of the GC riders in the finale, and ultimately extended his lead to everyone else in the race bar López.</p>\n\n\n\n<p>Now, he needs only survive an intermediate stage 19 and a flurry of short but moderately steep climbs on stage 20 before the final time trial, where he will be among the top favorites to win (and to take significant time on all of his GC rivals too).</p>\n\n\n\n<p>In other words, only three days of racing now stand between Roglič and his third straight overall victory at the Vuelta a España.</p>\n\n\n\n<p>“I’m glad we’re done with the real high mountains,” Roglič said. “We’re all feeling the efforts of the past two days and the weeks before that. There are still a few difficult stages to come. Especially the one of Saturday. We have to stay focused.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/09/soaring-to-second-on-the-vueltas-queen-stage-roglic-tightens-his-grip-on-red/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"918708baac0ed550330ec7fbe326e11ed956b47214368717337aba744f4b106c","category":"Cycling"}