{"title":"Daily Telescope: A dazzling view of the Milky Way from southern Africa","link":"https://arstechnica.com/?p=1980281","date":1698840044000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/MilkyWayRising_1200x800_with-ICC-800x533.jpg\" alt=\"The Milky Way Galaxy rises over Namibia.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/10/MilkyWayRising_1200x800_with-ICC.jpg\">Enlarge</a> <span>/</span> The Milky Way Galaxy rises over Namibia. (credit: Curt Belser)</p>  </figure>\n\n\n\n\n      <p><em>Welcome to the <a href=\"https://arstechnica.com/tag/daily-telescope/\">Daily Telescope</a>. There is a little too much darkness in this world and not enough light; a little too much pseudoscience and not enough science. We'll let other publications offer you a daily horoscope. At Ars Technica, we're going to take a different route, finding inspiration from very real images of a universe that is filled with stars and wonder.</em></p>\n    \n\n<div><a name=\"page-1\"></a></div>\n<p>Good morning. It is November 1, and today's photo brings us inspiration from southern Namibia. Perhaps the most iconic tree in the southern region of Africa is the quiver tree—so named because its tubular branches can be fashioned into a carrier for arrows.</p>\n<p>Curt Belser took this image of the Milky Way Galaxy rising over a quiver tree in May as part of a photography tour of Namibia. The Moon had already set, so that enhanced the darkness of the skies locally. This remote part of Africa already boasts some of the darkest skies in the world.</p></div><p><a href=\"https://arstechnica.com/?p=1980281#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1980281&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9188db8a53c03332831a46b73cdc8531eab42464489619067cc23e38ef4e8d9d","category":"Tech"}