{"title":"What’s going on with Ineos Grenadiers?","link":"https://www.cyclist.co.uk/in-depth/ineos-grenadiers-problems-2023","date":1702575396000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/ineos-grenadiers-problems-2023\">What’s going on with Ineos Grenadiers?</a></p>\n\n<p>The words ‘Team Sky’ were synonymous with cycling success in the 2010s. Between 2012 and 2019 the British outfit won seven of eight Tours de France and dominated most other stage races, with a few Classics and a fair few more Grand Tours thrown in for good measure.</p>\n\n\n\n<p>But since changing title sponsor in 2019, they have stagnated. They haven’t won a Grand Tour since Egan Bernal claimed the 2021 Giro, although they’ve come close to others, notably through evergreen leader Geraint Thomas losing the <a href=\"https://www.cyclist.co.uk/in-depth/giro-ditalia-2023-gallery\" target=\"_blank\">2023 Giro</a> on the final day. But big names leaving, personnel changes and an unclear racing strategy mean the team has lost its edge.</p>\n\n\n\n<p>Before this year’s Vuelta, deputy team principal Rod Ellingworth had said Ineos were aiming for ‘a podium finish, at least’. Crossing the line in Madrid on the final day, their best-placed rider was Thomas in 31st.</p>\n\n\n\n<p>And recent events suggest Ineos itself is at a crossroads. CEO Sir Jim Ratcliffe owns a portfolio of other sporting interests and looks close to cementing partial control of football club Manchester United as the jewel in the crown. With several of the top brass looking to move with him to direct football operations, the cycling outfit may be somewhat left in the lurch.</p>\n\n\n\n<p>In an era of cycling dominated by megateams like Jumbo-Visma and superstars like <a href=\"https://www.cyclist.co.uk/news/tadej-pogacar-greatest-of-all-time\" target=\"_blank\">Tadej Pogačar</a>, Ineos look to be falling behind.</p>\n\n\n\n<p>So what’s going on at Ineos Grenadiers – and what comes next?</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h4><span>Related Posts</span></h4>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/multi-discipline-cyclocross-riders-2023\">8 multi-discipline cyclocross riders to watch this winter</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/saudi-pro-cycling-league\">What is the rumoured Saudi racing league – and what would it mean for pro cycling?</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h4>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/mens-pro-cycling-highlights-2023\">My top 10 moments in the 2023 men’s road cycling season</a>\r\n                       </h4>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<h2>Staff</h2>\n\n\n\n<figure><img width=\"970\" height=\"364\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/dave-brailsford-ineos-970x364.jpeg\" /><figcaption>Ineos Grenadiers</figcaption></figure>\n\n\n\n<p>Long-time team principal Sir Dave Brailsford was at the centre of Sky’s evolution, first turning British Cycling into a medal-winning powerhouse before building a new road racing team.</p>\n\n\n\n<p>During the transition to Team Ineos, Brailsford’s role shifted to director of sport across all Ineos businesses – not just cycling. He moved in 2021, and Ineos haven’t won a Grand Tour since.</p>\n\n\n\n<p>Brailsford is expected to be a major part of Ratcliffe’s football operations team at Manchester United and <a href=\"https://theathletic.com/5120468/2023/12/07/ineos-man-utd-brailsford-blanc-ratcliffe/\" target=\"_blank\">was seen visiting Old Trafford last week</a>. His expected departure raises questions over who will take charge of day-to-day decisions on the cycling side and how much influence he’ll continue to have.</p>\n\n\n\n<p>Some of those questions were answered last week as a new raft of appointments were announced, just in time for the team’s pre-season training in Mallorca. Managing Director John Allert, who joined the team in 2022, has been promoted to CEO and will report directly to Brailsford and co at Ineos Sport.</p>\n\n\n\n<p>Allert is likely to provide an element of continuity between Ineos’s existing strategy and its new phase, as will <a href=\"https://www.cyclist.co.uk/in-depth/steve-cummings-profile\" target=\"_blank\">Steve Cummings</a>, a Team Sky veteran as a rider and DS for the last two editions of the Tour, who now gets a promotion to ‘director of racing’.</p>\n\n\n\n<p>Other appointments bring in different perspectives. Ex-Movistar stalwart Imanol Erviti joins as a DS having retired from racing this year, and Dr Scott Drawer joins as Performance Director having most recently worked at Millfield School, the UK’s most well-renowned school for sports.</p>\n\n\n\n<p>He previously also had a spell at the team and has had stints at England Rugby, Team GB, and UK Sport. Ineos will be hoping his experience with such winning machines translates to improved team performance.</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-970x647.jpg\" alt=\"man next to boat\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2022/03/03010440/steve_cummings_profile_04.jpg 1200w\" /><figcaption>Steve Cummings has been promoted to ‘director of racing’. </figcaption><figcaption>Alex Wright / Cyclist</figcaption></figure>\n\n\n\n<p>What these appointments don’t shed much light on is the structure of how the team actually runs. Brailsford’s second-in-command Ellingworth, a founding member of the team and – barring one season at Bahrain-McLaren – a constant there since 2009, was suddenly announced to be leaving the team at the end of this year.</p>\n\n\n\n<p>Rumours suggest Ellingworth was frustrated at not having the final say on transfers, contracts or team strategy, which were controlled by those higher up in Ineos Sport and not the cycling outfit.</p>\n\n\n\n<p>Allegedly none of the riders had been informed when the news broke and the team have stayed tight-lipped on the reasons why. A brusque two-sentence statement was released confirming the news and adding that ‘no further comment will be made at this stage’.</p>\n\n\n\n<p>Sport director coordinator Roger Hammond has also left the team, as has Ben Williams, previously head of performance and sport, as well as another sporting director, Matteo Tosatto.</p>\n\n\n\n<p>The overhaul raises obvious questions of what’s going on behind the scenes. Is the team in turmoil – and if so, will a personnel refresh help or hinder their future hopes?</p>\n\n\n\n<p>And with the Man United investment on the horizon, how much attention will Ineos Grenadiers get now, with the attention – and funding – of the top brass possibly diverted elsewhere?</p>\n\n\n\n<h2>Riders</h2>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-970x647.jpg\" alt=\"Man in cafe with espresso mug and pink cycling jersey on table next to saucer\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-1536x1024.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2020/12/06032614/tao_geoghegan_hart_profile_2020_06.jpg 2000w\" /><figcaption>Tao Geoghegan Hart will be racing against Sky/Ineos for the first time in 2024 after moving to Lidl-Trek.  </figcaption><figcaption>Pete Goding</figcaption></figure>\n\n\n\n<p>It’s not just management that have been heading for the exit. The team have also seen an exodus of top riders, losing 2020 Giro winner <a href=\"https://www.cyclist.co.uk/in-depth/sitting-pretty-in-pink-how-tao-geoghegan-hart-climbed-to-the-top\" target=\"_blank\">Tao Geoghegan Hart</a> to Lidl-Trek, superdomestique Pavel Sivakov, young Brit <a href=\"https://www.cyclist.co.uk/in-depth/cyclist-magazine-podcast-episode-14-ben-tulett-the-next-big-thing-in-british-cycling\" target=\"_blank\">Ben Tulett</a> and GCN contender Dani Martínez to other rivals. Richard Carapaz was the team’s main Grand Tour leader but was let go to EF Education-EasyPost last off-season.</p>\n\n\n\n<p>It begs the questions: how and why are they letting these riders go, and what is their recruitment strategy?</p>\n\n\n\n<p>Ineos don’t seem to have the purchasing power they once did. Speculation was rife earlier this year about if the team would make a move for 2022 Vuelta winner and current world time-trial champ Remco Evenepoel but that fizzled out and the Belgian stayed at Soudal-QuickStep after the team’s <a href=\"https://www.cyclist.co.uk/in-depth/jumbo-quick-step-merger\" target=\"_blank\">rumoured merger with Jumbo-Visma</a> didn’t go through.</p>\n\n\n\n<p>Speaking of Jumbo, Primož Roglič was looking for a new team this year after it became apparent he would leave Jumbo-Visma, and Ineos were seen as a likely destination given their budget and ambitions.</p>\n\n\n\n<p>But the four-time Grand Tour winner chose to pin his 2024 Tour de France hopes on German outfit Bora-Hansgrohe instead. It seems a bit embarrassing for Ineos, who were allegedly willing to – and able to – pay him a considerable amount more.</p>\n\n\n\n<p>The squad feel as if they’re in a transitional period, with some brilliant riders who have been with the team for several seasons coming towards the end of their careers, like Thomas, Jonathan Castroviejo, Michał Kwiatkowski, and Luke Rowe. But they lack the focal points they once had in Bradley Wiggins, Chris Froome, Geraint Thomas and Egan Bernal before the horror crash he was lucky to survive in 2022.</p>\n\n\n\n<p>It’s not all doom and gloom – there are a few exciting new faces brought in over the past couple of years, like time-trial talents Tobias Foss and Josh Tarling and young Americans <a href=\"https://www.cyclist.co.uk/in-depth/magnus-sheffield-cyclist\" target=\"_blank\">Magnus Sheffield</a> and AJ August. But whether the team can create a new identity and strategy around these riders remains to be seen.</p>\n\n\n\n<h2>Strategy</h2>\n\n\n\n<figure><img width=\"970\" height=\"645\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-970x645.jpg\" alt=\"team sky train 2015\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-768x511.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-750x499.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-1140x758.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20150707TDF0017-ASO_B.Bade_.jpg 1500w\" /><figcaption>ASO/Bruno Bade</figcaption></figure>\n\n\n\n<p>Dave Brailsford’s ruthless management strategy may not have earned him many friends, but it certainly earned him and the team a lot of admirers. More importantly, it worked.</p>\n\n\n\n<p>The Team Sky selection process was unsympathetic but it got results, picking riders around a core figure who represented their Tour de France hopes each year. It meant there was little space or support for sprinting GOAT Mark Cavendish, who moved on from Sky after just one season in 2013 to a team that would more definitively focus on his goals.</p>\n\n\n\n<p>But it meant the squad had a real identity, and that was all about controlling and winning the Tour de France, with the Giro d’Italia and Vuelta a España the back-ups and Classics not a focus. The infamous ‘Sky train’ was perhaps the defining image of this era of racing and it oversaw a period of incredible dominance over the peloton, first with Wiggins and then Froome.</p>\n\n\n\n<p>As of today, Ineos look to be stretching themselves thinly over many different aims. They’re a team that have a wealth of young talent in Carlos Rodríguez, Josh Tarling, and Tom Pidcock in particular and have almost become a Classics team in recent seasons. They can also count on the services of Thomas, who will have a crack at at least one more season before retirement.</p>\n\n\n\n<p>But can a squad base their strategy on three or four competing riders with different aims and very different styles, whether that be Grand Tour hopes for Rodriguez, Classics with Tom Pidcock or whatever Filippo Ganna is aiming for these days?</p>\n\n\n\n<p>Recent news is that Pidcock will prioritise – possibly against general wisdom – going for GC at the Tour de France in 2024 over one-day races, so will likely be part of a co-leader setup as it also looks like Thomas could be returning to the Tour, but where does that leave Rodríguez, who finished fifth in 2023 and just signed a big contract extension?</p>\n\n\n\n<p>In recent years Ineos seem to have opted to divide and conquer – the problem is, that hasn’t worked.</p>\n\n\n\n<h2>Opposition</h2>\n\n\n\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-970x646.jpg\" alt=\"cyclists in white and yellow grimace as they race up hill\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-1536x1023.jpg 1536w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-2048x1364.jpg 2048w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-1140x759.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/07/Tour-de-France-2023-goding-1-350x233.jpg 350w\" /><figcaption>Bernard Papon/Pool/GodingImages</figcaption></figure>\n\n\n\n<p>Ineos are also operating in a very different cycling landscape to Team Sky. Cast your mind back ten years: beyond Astana’s Vincenzo Nibali and Movistar’s Nairo Quintana (the first time around), there didn’t seem many characters who could stop the unstoppable Sky machine.</p>\n\n\n\n<p>But now Ineos have fallen behind. Visma-Lease a Bike, formerly Jumbo-Visma, have dominated the past couple of years, including winning a hat-trick of Grand Tours in 2023 with three different riders and a full podium lock-out at the Vuelta.</p>\n\n\n\n<p>Their transfer strategy has been enviable, snapping up the best domestiques including <a href=\"https://www.cyclist.co.uk/in-depth/dylan-van-baarle-interview\" target=\"_blank\">Dylan van Baarle</a> from Ineos and Grand Tour nearly-man Wilco Kelderman from DSM – not to mention ever-loyal super-domestique Sepp Kuss – to support leading men Roglič and Jonas Vingegaard.</p>\n\n\n\n<p>While it did get a bit messy at the Vuelta, their racing strategy has been a lot more coherent than Ineos’s in recent seasons, entirely centred around fighting for Grand Tour victory – to the point that Wout van Aert has been occasionally admonished for putting his own stage goals above the squad’s aims.</p>\n\n\n\n<figure><img width=\"970\" height=\"647\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-970x647.jpg\" alt=\"2023 Tour de France podium riders holding trophies in air\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-768x512.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-1140x760.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230723TDF0117-A.S.O._Pauline_Ballet.jpg 1500w\" /><figcaption>ASO/Pauline Ballet</figcaption></figure>\n\n\n\n<p>Elsewhere, UAE Team Emirates have formed a team that is perhaps less flashy in terms of supporting characters, but has the advantage of being built around the once-in-a-generation talent that is Tadej Pogačar.</p>\n\n\n\n<p>For the (probably few) races in 2024 that the Slovenian won’t contest, they have the immense talents of Juan Ayuso and João Almeida. They also signed Adam Yates from Ineos last season to support Pogačar at the Tour and he finished just one place behind his leader overall in third.</p>\n\n\n\n<p>Despite Ineos’s budget – reported to be among the highest in the WorldTour – they have struggled to deal with the fierceness of the competition.</p>\n\n\n\n<p>It’s not just the quality of their riders, it’s how they manage racing. Much like Team Sky used to do, Jumbo-Visma have perfected controlling the peloton, sitting on the front to avoid breakaways and quickly reeling them back in when they do escape.</p>\n\n\n\n<p>Beyond what spectators can physically see on the roads, Sky professionalised how teams worked behind the scenes with the marginal gains philosophy, from nutrition to training to recovery. Essentially, Sky changed how teams were run, inventing a new system of road racing. Other teams have now worked out how to beat them at their own game.</p>\n\n\n\n<h2>What does the future hold for Ineos Grenadiers?</h2>\n\n\n\n<figure><img width=\"970\" height=\"646\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-970x646.jpg\" alt=\"cyclist riding up mountain in crowd of fans\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-970x646.jpg 970w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-300x200.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-768x511.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-750x500.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-1140x759.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-465x310.jpg 465w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-620x413.jpg 620w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet-350x233.jpg 350w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/12/20230715TDF0026-A.S.O._Pauline_Ballet.jpg 1500w\" /><figcaption>ASO/Pauline Ballet</figcaption></figure>\n\n\n\n<p>The team’s future looks uncertain now, especially as they wait for the fallout of the Man United investment.</p>\n\n\n\n<p>But there are positive signs: up-and-coming young riders, their cultivation of exciting talent, and the signing of Pauline Ferrand-Prévot, which hopefully signals a future expansion into building a women’s team. Pidcock and Martínez, among others, look certain to get results in 2024, the team just needs to find its feet again and establish how it’s going to support them.</p>\n\n\n\n<p>Ineos will have to adapt to other teams blazing ahead, in the same way that they did in the early 2010s. They oversaw a period of unprecedented dominance before entering one of managed decline – but there’s no reason why they can’t get back to those heights again in the future.</p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/ineos-grenadiers-problems-2023\">What’s going on with Ineos Grenadiers?</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"Will Strickson &#124; Deputy Website Editor","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"918ef86081863e5f9f896b668239d979e388f2f034b1466637b8c8243c8524a9","category":"Cycling"}