{"title":"★ Charlie Watts","link":"https://daringfireball.net/2021/08/charlie_watts","date":1630183770000,"content":"\n<p>Some sad news this week: Rolling Stones drummer Charlie Watts died at age 80. I don’t know much about how music is made but I know what I like, and I’ve loved the Stones ever since I can remember. The first time I can remember being asked my favorite band, my answer was The Stones. 40-some years later, my answer is unchanged. In all those years, I’ve never heard a musician who <em>does</em> understand the mechanics of playing rock-and-roll do anything but positively rave about Charlie Watts’s talent, and his central role in the Stones’ sound and success. And by all accounts, he was a good person and a dear and loyal friend. He was also the best-dressed man in all of rock and roll.</p>\n\n<p>Mick Jagger — one of the most poetic, eloquent writers the world has known — <a href=\"https://www.instagram.com/p/CS-UlpDKe_N/\">had no words</a>. <a href=\"https://www.instagram.com/p/CS-U-z6rEyO/\">Nor did Keith Richards</a> (whose photo I cribbed, below). <a href=\"https://www.instagram.com/p/CS_PhICMo-C/\">Ronnie Woods had but a few</a>. The band’s homepage <a href=\"https://rollingstones.com/\">is just a lovely portrait</a> — reminiscent of what Apple did a decade ago when Steve Jobs died. I slag on social media frequently, and though Instagram has its problems, when it works, it works, and of all the major social platforms, it remains the one that’s primarily about sharing good thoughts and good feelings. It’s a mere token, but it feels good to press Like on posts like these, just to express, in some small way, that we miss Charlie too.</p>\n\n<p>Yesterday <a href=\"https://twitter.com/RollingStones/status/1431274250984427525\">the band posted this lovely short video tribute</a> — set to, of course, the perfect song.</p>\n\n<p><img src=\"/misc/2021/08/keef-to-charlie.jpeg\" /></p>\n\n\n\n    ","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"918f0f6c72b4860142872f18b94ba51c81193582684b9842c660136bce5d9012","category":"Tech"}