{"title":"Contrasting responses of different mixotrophic protists to light and nutrient availability","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12565?af=R","date":1716913718000,"content":"<h2>Abstract</h2>\n<p>Mixotrophic protists are important members of aquatic microbial food webs where they can dominate bacterivory and strongly impact energy and nutrient flow. While light and nutrient availability are known to impact grazing rates by mixotrophs in laboratory studies, little is known about how changes in resource availability affect mixotrophic organisms in natural communities. Here, we performed a short-term grazing assay using fluorescently labeled bacteria in a phosphorus-limited subalpine mountain lake to test how the availability of light and nutrients affect mixotroph grazing rates. High grazing rates by a <i>Pseudopedinella</i>-like dictyochophyte were unaffected by nutrient or light manipulation. In contrast, grazing rates by pigmented cryptophytes significantly decreased upon phosphorus addition, light deprivation, and a combination of both. We compare these findings with the seasonal analysis of a 4-yr time-series dataset of 18S rRNA gene amplicon abundances. While cryptophytes dominated in autumn and winter and were negatively related with water column stability, <i>Pseudopedinella</i> amplicon abundances showed a consistent spring–summer peak and were positively related with chlorophyll <i>a</i> concentrations. These results demonstrate the diversity in nutritional strategies among co-occurring mixotrophic protists, which cannot be resolved by quantification of bulk grazing rates. Moreover, these different strategies result in distinct seasonal dynamics and coexistence of different mixotrophs, suggesting their respective trajectories into future aquatic ecosystems will also differ.</p>","author":"Sebastiaan Koppelle, \nMarina Ivanković, \nMia M. Bengtsson, \nChristian Preiler, \nJef Huisman, \nCorina P. D. Brussaard, \nJulia C. Engelmann, \nRobert Ptáčník, \nSusanne Wilken","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"919f5101e9c2f1d859304392f20fa463e5259567a895d2480dd5d17cbdb4d598","category":"Environment"}