{"title":"184 Effects of cattle hide color and changing environmental conditions at northern latitudes on feeder cattle performance and behavior","link":"https://academic.oup.com/jas/article/102/Supplement_3/317/7757421?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>While suitable research has been done on the influence of climatic conditions on feeder cattle welfare, we have seen limited work done that assesses the relationship of hide color and cattle thermoregulation in response to extreme environmental changes, particularly of those seen at northern latitudes. Specifically, there is limited research on the effects of environmental stressors and cattle hide color on performance and intake. Therefore, the objective of this study is to evaluate feeder cattle performance in response to environmental conditions and hide color. Angus-based yearling steers [n = 40; average body weight (BW) = 409.28 kg were stratified by BW and hide color (red, white, and black) and were randomized into 10 pens at the Northern Agricultural Research Center in Havre, MT. Steers were on trial from 20 February 2023 to 11 July 2023 (141 d) and fitted with an electronic ear tag and adapted to the Vytelle system (Vytelle, Lenexa, KS) for 14 d prior to the start of the study. All 10 pens consisted of two electronic feed bunks equipped with an antenna to detect animal presence, load cells to measure feed disappearance and wireless transfer to a data-acquisition computer. Finishing diet (8.6% CP, 75% TDN) consisted of 69% corn, 21% corn silage, 10% wheat straw, and 0.45 kgּ animal<sup>-1</sup>ּ d<sup>-1</sup> of beef grower pellet with a fortified mineral and vitamin package. Initial and final unshrunk BW were obtained on two consecutive days and averaged. Every 28 d during the experiment, steers were weighed prior to feeding and a measurement of coat depth was taken. Animal surface temperature was recorded via a FLIR E5xt thermal imaging camera on the same day of every week at 0730 h (prior to feeding) and 1330 h (6 h post feeding), for 20 wk. There was no difference in hair depth between the white hided steers and other treatments (<span>P</span> ≥ 0.26). However, there was a treatment effect (<span>P</span> = 0.01) of hide color on cattle surface temperature, with black and red hided steers averaging 2.85°C greater than white hided steers. There was no effect of treatment on average daily gain (<span>P</span> = 0.55) averaging 1.34 kg/d. Additionally, there was no treatment effect on average daily intake (<span>P</span> = <span>0.36),</span> averaging 10.76 kg per day. There was a treatment effect on gain to feed efficiency (<span>P</span> = 0.05); however, post hoc means separation analysis showed no difference between treatments. In summary, although there were treatment effects on animal surface temperature, they were not reflected in animal performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"91a5402eaf4fbc6632b52b1b926894b4b8d6f14045906e260174aa8f34837274","category":"Environment"}