{"title":"Do statistical heterogeneity methods impact the results of meta- analyses? <i>A meta epidemiological study</i>","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0298526","date":1710856800000,"content":"<p>by Samer Mheissen, Haris Khan, David Normando, Nikhillesh Vaiid, Carlos Flores-Mir</p>\r\nBackground <p>Orthodontic systematic reviews (SRs) use different methods to pool the individual studies in a meta-analysis when indicated. However, the number of studies included in orthodontic meta-analyses is relatively small. This study aimed to evaluate the direction of estimate changes of orthodontic meta-analyses (MAs) using different between-study variance methods considering the level of heterogeneity when few trials were pooled.</p> Methods <p>Search and study selection: Systematic reviews (SRs) published over the last three years, from the 1<sup>st</sup> of January 2020 to the 31<sup>st</sup> of December 2022, in six main orthodontic journals with at least one MA pooling five or lesser primary studies were identified. Data collection and analysis: Data were extracted from each eligible MA, which was replicated in a random effect model using DerSimonian and Laird (DL), Paule–Mandel (PM), Restricted maximum-likelihood (REML), Hartung Knapp and Sidik Jonkman (HKSJ) methods. The results were reported using median and interquartile range (IQR) for continuous data and frequencies for categorical data and analyzed using non-parametric tests. The Boruta algorithm was used to assess the significant predictors for the significant change in the confidence interval between the different methods compared to the DL method, which was only feasible using the HKSJ method.</p> Results <p>146 MAs were included, most applying the random effect model (n = 111; 76%) and pooling continuous data using mean difference (n = 121; 83%). The median number of studies was three (range 2, 4), and the overall statistical heterogeneity (I<sup>2</sup> ranged from 0 to 99% with a median of 68%). Close to 60% of the significant findings became non-significant when HKSJ was applied compared to the DL method and when the heterogeneity was present I<sup>2</sup>&gt;0%. On the other hand, 30.43% of the non-significant meta-analyses using the DL method became significant when HKSJ was used when the heterogeneity was absent I<sup>2</sup> = 0%.</p> Conclusion <p>Orthodontic MAs with few studies can produce different results based on the between-study variance method and the statistical heterogeneity level. Compared to DL, HKSJ method is overconservative when I<sup>2</sup> is greater than 0% and may result in false positive findings when the heterogeneity is absent.</p>","author":"Samer Mheissen","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"91b39682bcde50fefaeb92dd759a9add60c4c43d452e134531ffa6e8c897dedb","category":"Interdisciplinary"}