{"title":"Scientists test medieval gunpowder recipes with 15th-century cannon replica","link":"https://arstechnica.com/?p=1798816","date":1632950873000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/gunpowder1-800x531.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/gunpowder1.jpg\">Enlarge</a> <span>/</span> Researchers tested medieval gunpowder recipes in this replica of an early 15th-century stone-throwing cannon. (credit: T.S. Ritchie et al., ACS Omega 2021)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Gunpowder—as opposed to modern <a href=\"https://en.wikipedia.org/wiki/Smokeless_powder\">smokeless powder</a>—isn't used much these days in current weaponry, although it's still useful for historical weapons and remains popular for fireworks and other pyrotechnics. An interdisciplinary team of chemists and historians wanted to learn more about how various recipes for gunpowder evolved over the centuries as master gunners tweaked the basic components to achieve better results. The researchers described their findings in <a href=\"https://pubs.acs.org/doi/10.1021/acsomega.1c03380\">a recent paper</a> published in the journal ACS Omega. They even tested a few of the recipes by firing a replica of a 15th-century stone-throwing cannon at a West Point firing range—you know, for science.</p>\n<p>Also known as black powder, gunpowder is simple enough, chemically speaking. It's a mix of sulfur and charcoal (carbon), which serve as fuels, and potassium nitrate (KNO<sub>3</sub>), an oxidizer also known as saltpeter. First used for warfare around 904 CE in China, its use had spread throughout Europe and Asia by the late 13th century. Modern black powder recipes call for 75 percent saltpeter, 15 percent charcoal, and 10 percent sulfur. But medieval master gunners experimented with many different recipes over the centuries, many of which included additives such as camphor, varnish, or brandy—the purpose of which is still unknown.</p>\n<p>By the late 14th century, manufacturers had discovered that one could improve the performance of gunpowder through a wet-grinding process called \"corning.\" Some kind of liquid (often distilled spirits) would be added as the other ingredients were being ground together, producing a moist paste. The paste would be rolled into balls and then dried, and those balls would be crushed in a mortar by a gunner in the field right before it was used.</p></div><p><a href=\"https://arstechnica.com/?p=1798816#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1798816&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"91c0deaf13fee7fb13d0fc32c13181326ea1130ddcad9cd3e120d63030a0f386","category":"Tech"}