{"title":"wcm.02.2024.241.250","link":"https://www.watconman.org/wcm-02-2024-241-250/","date":1710815201000,"content":"<div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<h3><strong>INTRA-ANNUAL FLOW DISTRIBUTION OF THE RIVERS IN THE YESIL RIVER BASIN</strong></h3>\n<p><span><em>Journal: Water Conservation and Management (WCM)</em></span><br />\n<span><em><span>Author: Lyazzat Makhmudova, Kudaybergen Beisembin, Marat Moldakhmetov, Ainur Mussina, Adilet Kanatuly</span></em></span><br />\n<span><em>Print ISSN : 2523-5664</em></span><br />\n<span><em>Online ISSN : 2523-5672</em></span></p>\n<p><span><em><span>This is an open access article distributed under the Creative Commons Attribution License CC BY 4.0, which permits unrestricted use, distribution, and reproduction in any medium, provided the original work is properly cited</span></em></span></p>\n<p><span><em>Doi: <a href=\"http://doi.org/10.26480/wcm.02.2024.241.250\">10.26480/wcm.02.2024.241.250</a></em></span></p>\n<h3>Abstract</h3>\n<div><img src=\"https://www.watconman.org/wp-content/uploads/2022/06/wcm-cover-tm.jpg\" width=\"212\" height=\"300\" />Climate change and intensive economic activity in the river basins lead to a restructuring of the water regime. Therefore, this study aims to study the current intra-annual flow distribution in the plain rivers of the Yesil river basin, and to determine the estimated intra-annual distribution for different time periods. The results showed that the decrease in spring runoff is most noticeable in the upper stream of the Yesil river, in the lower stream of the river the spring runoff for the period with the disturbed regime is much higher than the spring runoff for the natural period, there is an increase in seasonal runoff. These findings indicate that as a result of an increase in the coefficient of natural flow regulation, the winter runoff of the Yesil river in the middle stream has increased by two or three times.</div>\n<h3>Keywords</h3>\n<p><span>climate change, intra-annual flow distribution, coefficient of natural flow regulation, water regime, flow hydrograph.</span></p>\n<h3><strong>1. INTRODUCTION</strong></h3>\n<div>\n<p>The study of the patterns of intra-annual river flow distribution is one of the most essential issues for the rational and integrated use of water resources. The intra-annual flow distribution primarily determines the basic parameters of water management facilities: the guaranteed return of water from reservoirs, the capacity of regulation, the nature of flow regulation from reservoirs and, therefore, the economic efficiency of water management measures and facilities (Lisetskii, 2021). The intra-annual flow distribution varies constantly from year to year due to differences in the values of water discharge during the same phases of the water regime (peaks of high water, floods, low water level) and due to shifts in the time of occurrence of single-valued phases of the regime in different years (Christodoulou et al., 2020). Data on the intra-annual flow distribution is used in the development of flood control measures, in irrigation, in the development of industrial and economic water supply projects (He et al., 2019; Komilova et al., 2021).</p>\n<p>The intra-annual river flow distribution is influenced by various factors. These include climatic conditions (amount and regime of precipitation, air temperature during the melting of seasonal snow and glaciers, evaporation from the surface of basins), topography, type of river feeding, hydrogeology, etc. (Cui et al., 2020; Korneychuk and Kirichuk, 2018). It is critical that methods and techniques for calculating intra-annual flow distribution must be analyzed both in terms of their correct reflection of existing natural patterns of intra-annual flow and meeting design requirements. The purpose of this research is to study the current intra-annual flow distribution in the plain rivers of the Yesil river basin, to determine the estimated intra-annual distribution for different time periods, and to study the coefficient of natural flow regulation.</p>\n<h3><strong>2. LITERATURE REVIEW</strong></h3>\n<p>The intra-annual river flow distribution varies significantly across the territory in accordance with changes in climatic conditions (Thakur et al., 2020). In addition to climatic factors, local conditions have a great impact on the flow distribution within the year. By the nature of the distribution of natural flow, the rivers of the Yesil river basin belong to the group of rivers with spring floods. During the spring period, 90-95 % of the annual runoff occurs within one to two months, and on small rivers up to 100 %.</p>\n<p>According to H. Tan et al. (2021) classification, the rivers of the Yesil river basin belong to the Kazakhstani type, and according to A. Azarisamani et al. (2020) classification to the area of exclusively snow feeding: hence, the annual runoff of rivers in the concerned area is formed exclusively during spring floods (spring runoff makes up 90-95 % of the annual runoff). Spring floods in the Yesil river basin usually start in the second half of March – early April. In the first days of flooding, the intensity of water level rise is insignificant and reaches up to 5-10 cm per day, but then the intensity sharply increases and in years with average water content reaches up to 200 cm per day. In high-water years with smooth snowmelt (Moldakhmetov et al., 2019), the floods in the rivers of the Yesil river basin are very intense. Spring floods end in the small and medium-sized rivers of the concerned area by the end of April/early May and in the large rivers – by the end of May/June.</p>\n<p>After the end of the spring high water, the rivers enter a summer-autumn low water season, characterized by consistently low levels. In June-July most of the rivers dry up and the water remains only in the individual reach holes, which are disintegrated with drying cross-overs. Low summer levels in the middle-size rivers occur mostly in July-August, and in the larger rivers, due to the late fall of the floodwaters, in September. Their fluctuations in small rivers do not exceed 15-30 cm and in large rivers – 50 cm (Blum et al., 2020).</p>\n<p>Variations in winter river levels are generally insignificant, as they reflect only changes in the river reaches; cross-overs remain dry during this period. The duration of the summer-autumn and winter low-water periods is from 9 (July-March) to 11 (May-March) months. Winter low-water levels in most rivers occur in November, and in January-February in watercourses with little groundwater feed when groundwater runs out and the river reaches freeze over to the bottom. Winter levels are usually 20-40 cm higher than summer levels (De Niel and Willems, 2019). The annual amplitude of water level fluctuations in the rivers of the concerned area varies within considerable limits.</p>\n<p>Due to the dryness of the climate, rainfall rarely forms floods. Only the most significant rains or series of rains with a rainfall amount of 30-50 mm or more can do this. Rainfall floods occur on average once every 3-5 years. This happens usually in June-July, and the duration of the flood usually does not exceed 5-10 days (Morri and Soualmia, 2020). If the flooding is low, the discharge at the peak of the rainfall flood can be higher on the small rivers than the maximum spring flood. In general, the proportion of rainfall runoff in the annual volume is usually insignificant.</p>\n<h3><strong>3. MATERIALS AND METHODS</strong></h3>\n<p>Data from hydrological yearbooks and funds of Republican state enterprise “Kazhydromet” (Surface water resources…, 1977; 1980; State Water Cadastre, 1987; 2002; 2004) were used for calculations of intra-annual river flow distribution. Data processing was conducted for the following periods: 1933-1973, 1974-2014, and the entire observation period 1933-2014. The choice of the boundaries of the estimated periods is based on the results of the previously performed analysis of multi-year fluctuations of monthly river flow in the Yesil river basin and the authors’ own studies (Moldakhmetov and Makhmudova, 2018). Hydrological calculations and statistical analysis were carried out using standard Excel and Statistica packages, maps were created using ArcGIS 10.6 software (spatial analysis method).</p>\n<p>All calculations have been made in accordance with Code of practice SP 33-101-2003 “Determination of design hydrological performance” and the Methodological recommendations for determining estimated hydrological characteristics in cases of available, insufficient or missing hydrometric observation data and for assessment of uniformity of hydrological characteristics and determination of their estimated values from irregular data.</p>\n<p>Several methods are available for the calculation of intra-annual distributions. The well-known methods are arithmetic mean (dummy) hydrograph, the hydrograph of a real year (characteristic year), equilibrium hydrograph, application of special indicators for calculation of intra-annual flow distribution, use of daily discharge duration curves to describe intra-annual flow distribution, compilation method.<br />\nThe arithmetic mean method (dummy) hydrograph for the calculation of the intra-annual flow distribution is widely used in practice. This method has the advantage that atypical features of the flow regime of individual years are excluded, and the resulting characteristics are more stable and change insignificantly with the addition of new years of observation. The limitation of the method is that it results in a more aligned intra-annual distribution than in individual actual years, so this distribution is known in practice as the “dummy average” and can be used only for an approximate estimate.</p>\n<p>When calculating by method of “equilibrium hydrograph”, empirical probability curves of average monthly discharges for each month are constructed. They are used to derive values of average monthly discharges of different water probability (25, 50, 75, and 90 %). In practice, this method is not applied, since a real year does not consist of monthly discharges of the same probability. The essence of applying special indicators for calculating the intra-annual flow distribution is that special indicators are used to calculate the intra-annual flow distribution. These indicators mainly provide a general characteristic of intra-annual flow distribution. Several dozens of indicators are known: coefficient of natural flow regulation, intra-annual irregularity, etc.<br />\nV.G. Andreyanov (1960) considered this shortcoming and developed a method of calculation of the intra-annual flow distribution, which is suitable for any design problems and any physical-geographical conditions, for any type of intra-annual flow. This scheme assumes the same flow probability for the year, for the limiting period of the year, and within the limiting season. The probability is assumed to be a given.</p>\n<p>The intra-annual distribution is calculated for several gradations of water content. Seasonal and intra-seasonal flow distributions are considered separately. The limiting period and season are selected depending on the prevailing economic use. This methodology is included in the Code of standards and rules 2.01.14-83 as the basic one recommended for the calculation of the intra-annual flow distribution. The calculation time intervals are usually months and seasons, less frequently decades and weeks. If observation materials are available, the calculation is based on series with duration of at least 15 years. This method is adopted for the calculation of the intra-annual flow distribution in the Yesil river basin.</p>\n<h3><strong>4. RESULTS AND DISCUSSION</strong></h3>\n<p>The method of V.G. Andreyanov (1960) gives the best results for those rivers, on which dependence of the intra-annual flow distribution on the water content of the year is observed – these are plain rivers, which have snow feeding. The method is based on the assumption of the equality of flow probability for a year, limiting period and season. Calculation of annual, limiting period and limiting season runoff values is usually carried out according to the following four gradations of water content: high-water (P=25 %), medium (P=50 %), low-water (P=75 %) and very low-water (P=95 %). The hydrological justification of projects should select one design combination (in special cases two or three) out of the many possible flow combinations for individual seasons and parts thereof, which meets the design requirements for the proposed water use scheme. The design combination should be chosen as possible unfavourable, but not too rare frequency, which provides a given degree of guarantee of trouble-free and uninterrupted operation of the water consumer under consideration. In this regard, during the calculation, attention should be paid not only to the water content of the year but also to the water content of those periods and seasons, which are limiting (Andreyanov, 1960).</p>\n<p>According to A.V. Rozhdestvensky et al. (2010), the intra-annual flow distribution is calculated using three methods: compilation; real (characteristic) year; average annual flow distribution of characteristic water content gradation. The boundaries of hydrological seasons and calculations of the intra-annual flow distribution were made based on observation data at 14 major gauging stations using the compilation method. The time frames of hydrological seasons for the rivers of the Yesil river basin are presented in Table 1.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"564\" height=\"158\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t1-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t1-1.jpg 564w, https://www.watconman.org/wp-content/uploads/2024/03/t1-1-300x84.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>In recent decades, the water regime of the rivers in the Yesil river basin and the nature of their intra-annual flow distribution have changed significantly. Let us consider in more detail the current peculiarities of intra-annual flow distribution and water regime for individual gauging stations. Under conditions of economic activity, a special role in changing intra-annual river flow distribution is played by channel storage, irrigation, industrial water supply, municipal economy and land and forest reclamation (Garibli et al., 2021).</p>\n<p>The main factors of economic activity influencing the intra-annual river flow distribution in the basin under consideration are channel storage – multi-annual and seasonal regulation reservoirs (Astana, Sergeevsky, Petropavlovsk), numerous ponds, various water intakes, wastewater discharges, as well as ploughing of catchments. Reservoirs, on the other hand, have the dominant impact on runoff among the above-mentioned economic activities.</p>\n<p>At present, there are 45 water reservoirs in the basin of Yesil river: 3 multi-purpose reservoirs with a capacity of more than 100 million m3; 6 – with a capacity of more than 10 million m3; and 36 reservoirs for special purposes with capacity from 1 to 10 million m3. The total full capacity of multi-purpose and special purpose reservoirs under the project is 1584 million m3, total usable capacity is 1446 million m3, which makes 80 % of the annual volume of the basin’s flow in the Yesil river basin. The water surface area of the reservoirs is 312 km2 (Moldakhmetov et al., 2007) (Table 2).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"815\" height=\"589\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t2-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t2-1.jpg 815w, https://www.watconman.org/wp-content/uploads/2024/03/t2-1-300x217.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t2-1-768x555.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"807\" height=\"537\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t22.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t22.jpg 807w, https://www.watconman.org/wp-content/uploads/2024/03/t22-300x200.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t22-768x511.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Analysis of average monthly precipitation and average monthly air temperatures for 30-40 years showed relative stability of their intra-annual distribution in the basins of the rivers of Yesil river basin, they cannot lead to significant shifts in the intra-annual flow distribution (Mustafaev et al., 2019).</p>\n<p>Analysis of the intra-annual distribution of annual runoff in a multi-year section can be carried out using the moving average method, integral curves of monthly runoff, as well as by comparing the distribution of monthly runoff of different years with different level of flow regulation in the watershed, but with approximately the same meteorological conditions. Calculation methods are also used, where the regulated observed flow is compared with the restored values. However, it is difficult to retransform the monthly and decadal flows using the existing calculation methods, as the errors in flow restoration are often incompatible with the monthly flow.</p>\n<p>The final result of the assessment of changes in the intra-annual flow distribution in a year depends not only on the methods of analysis and comparison of monthly flow and its distribution in a multi-year section with the dynamics of economic activity in the watershed but also, to a certain extent, on comparison of the natural and disturbed flow distribution. It should be noted that when describing the intra-annual flow distribution, there is obviously no, and cannot be universal methods suitable for application to all rivers.<br />\nAs mentioned above, the intra-annual flow distribution under the natural regime is a fairly stable characteristic of the river catchment, and only the construction of large reservoirs leads to clearly visible shifts in the intra-annual flow distribution at the outlet. Under regulated runoff conditions, the natural hydrological regime is disturbed as soon as the reservoir is filled. Subsequently, during the operation of the reservoir, the hydrological regime in the upstream and tailwater can undergo some changes due to the introduction of new reservoirs, growth of water consumption in the river basin, and changes in the regulatory regime (Shcherbak and Korneychuk, 2006).</p>\n<p>When assessing changes in the intra-annual flow distribution under the influence of reservoirs, it should be kept in mind that the water management systems of a particular river basin are in constant development, so in addition to the average flow characteristics it is important to have a flow distribution for each particular year.</p>\n<p>The Ishim reservoir of seasonal flow regulation with a total volume of 9.2 million m3 and a usable volume of 8.2 million m3 was constructed in the upper stream of the Yesil river. The small usable capacity of the Ishim reservoir transforms the flow in the lower stream of the river very insignificantly. The main flow regulator of the Upper Yesil is the Astana (Vyacheslav) reservoir of multi-year regulation with a total volume of 411 million m3 and a usable volume of 378 million m3. The main regulators of Lower Yesil are Sergeevsky reservoir with a total volume of 693 million m3 and a usable volume of 635 million m3. The closing reservoir of the Yesil cascade in the Republic of Kazakhstan is the Petropavlovsk reservoir, which has a total volume of 19.2 million m3 and a usable volume of 16.1 million m3, carries out seasonal regulation of the flow. Due to the commissioning of reservoirs, the intra-annual distribution of the Yesil river flow in the site of Nur-Sultan city and the outlet of Petropavlovsk city has changed dramatically. Changes in the intra-annual flow distribution at different sites are manifested in various manners.<br />\nCalculations were made for two characteristic periods to quantify changes in the intra-annual flow distribution in the Yesil river basin:</p>\n<p>• before the creation of the main reservoirs (1933-1973), characterized by little influence of economic activities – the conditionally natural period;<br />\n• the second period (1974-2014), distinguished from the first by significant disruption of the hydrological regime resulting from profound long-term flow regulation by Vyacheslav and Sergeevsky reservoirs.<br />\nTo confirm the aforementioned, the data on the intra-annual flow distribution for the Yesil river basin in the context of a conditionally natural regime and disturbed regime as the result of the construction of large reservoirs in the watershed is presented (Table 3).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"813\" height=\"549\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t3-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t3-1.jpg 813w, https://www.watconman.org/wp-content/uploads/2024/03/t3-1-300x203.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t3-1-768x519.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>*The “ – “ sign indicates a runoff increasing</p>\n<p>Flow regulation in the Yesil river basin is carried out for the benefit of industrial, municipal and agricultural water supply, inundative and regular irrigation and fisheries. The results of calculations of the intra-annual flow distribution by the compilation method for two periods in the Yesil river Basin are summarized in Table 4.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"807\" height=\"576\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t4.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t4.jpg 807w, https://www.watconman.org/wp-content/uploads/2024/03/t4-300x214.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t4-768x548.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"808\" height=\"579\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t44.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t44.jpg 808w, https://www.watconman.org/wp-content/uploads/2024/03/t44-300x215.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t44-768x550.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>Comparison of the obtained results of calculations for two periods shows that in the upper stream of the Yesil river, flow regulation has not had a significant impact on the hydrological regime. In high-water years in the spring period from April to May in the site of Yesil river – Nur-Sultan city during the conditionally natural period 91.0 % of the annual flow occurs, and the summer-fall period – 6.36 %. In the disturbed period, 72.4 % of the annual flow occurs in the spring period, in the summer-autumn period – 16.0 %, and in the winter period – 13.6 %.</p>\n<p>In the summer-autumn and winter periods, when the reservoirs are drawn down, the regulated water discharge in high-water and medium-water years is significantly higher than the natural water discharge. In Petropavlovsk gauging station, natural water discharge in April decreases under the influence of Sergeevsky reservoir in high-water years by 10 %, and in average and low-water years it practically does not change in water content. In the summer-autumn and winter periods, the sums of regulated water discharges exceed the natural water discharge considerably (Table 4). The assessment of changes in the intra-annual flow distribution in the site of Petropavlovsk city reflects the influence of four large reservoirs of multi-year and seasonal regulation.</p>\n<p>Calculations of intra-annual distribution of flow for specific years of different water content (25, 50, 75 and 95 %) in context of the conditionally natural and regulated regimes (by Chagodaev formula) allowed to estimate changes in the intra-annual flow distribution by comparing graphically natural and disturbed flow hydrographs of Yesil river on separate sites (Figure 1). The analysis of changes in the flow and its intra-annual flow distribution shows that the hydrological regime of the Yesil river has undergone serious changes in most of its territory. At the same time, in the upper stream up to Nur-Sultan city, the flow regime is leveled and transformed.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"774\" height=\"610\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/1-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/1-1.jpg 774w, https://www.watconman.org/wp-content/uploads/2024/03/1-1-300x236.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/1-1-768x605.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"747\" height=\"278\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/1i.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/1i.jpg 747w, https://www.watconman.org/wp-content/uploads/2024/03/1i-300x112.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"754\" height=\"228\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/1ii.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/1ii.jpg 754w, https://www.watconman.org/wp-content/uploads/2024/03/1ii-300x91.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 1: </strong>Flow hydrographs in the context of the conditionally natural and regulated by reservoirs conditions for years of different water content</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>In the upper stream of the Yesil river, the decrease in spring runoff is most noticeable. In the lower stream of the river in the site of Petropavlovsk city, the spring runoff for the period with the disturbed regime is much higher than the spring runoff for the natural period and an increase in seasonal runoff, especially winter runoff, is observed in low-water years with 95% probability. Among other factors of economic activity, inundative and regular irrigation (more than 57.95 thousand hectares in the Yesil river basin) should be noted.</p>\n<p>Influence on flow and hydrological regime of large and middle-size rivers of agro-forestry and reclamation measures (land ploughing, forestation, snow retention), industrial and municipal water supply, inundative and regular irrigation and some other types of economic activity is not beyond the accuracy of flow accounting.</p>\n<p>The final result of the assessment of changes in the intra-annual flow distribution in a year depends not only on the methods of analysis and comparison of monthly flow and its distribution in a multi-year section with the dynamics of economic activity in the watershed but also, to a certain extent, on comparison of the natural and disturbed flow distribution (Shcherbak et al., 2007). It should be noted that when describing the intra-annual flow distribution, there is obviously no, and cannot be universal methods suitable for application to all rivers.</p>\n<p>When studying the intra-annual flow distribution of rivers, in addition to the chronological (calendar) description of flow distribution, an analysis of its non-calendar distribution in the form of daily discharge duration curves is used. They make it possible to estimate the duration of discharges equal to or exceeding a given value.</p>\n<p>It is more common to use the coefficient of natural flow regulation ϕ to describe the irregularity of the intra-annual water flow distribution, which corresponds to the proportion of the “base” flow in the annual volume of runoff. The coefficient of natural flow regulation φ expresses the degree of irregularity of the intra-annual flow distribution and is determined from the hydrograph, based on the ratio of the base volume of runoff to the annual volume.</p>\n<p>The base flow reflects the natural regulation of the catchment and its storage capacity, so the value of the regulation factor decreases with decreasing lakes. This coefficient is mainly used for comparative characterization of different rivers or districts with respect to the value of the most sustainable (“baseline”) water resources. For a particular river, the value of the regulation coefficient varies from year to year, depending on the characteristics of primarily the high-water phase of the water regime.</p>\n<p>In this research, coefficients of natural flow regulation for two periods, 1933-1973 and 1974-2014, were calculated for gauging stations of the Yesil river basin, and average values for these periods were calculated. The changes in the average value of the coefficient of natural flow regulation of the rivers of the Yesil river basin are shown in Table 5.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"777\" height=\"494\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/t5.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/t5.jpg 777w, https://www.watconman.org/wp-content/uploads/2024/03/t5-300x191.jpg 300w, https://www.watconman.org/wp-content/uploads/2024/03/t5-768x488.jpg 768w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>\n<p>The data in Table 5 shows an increase in the values of the coefficient of natural flow regulation in the second period (1974-2014), which is characterized by a significant disturbance of the hydrological regime as a result of profound long-term regulation of flow by reservoirs, compared with the first period which is the conditionally natural flow (1933-1973), characterized by little influence of economic activity. The calculated values of the coefficient of natural flow regulation of only two gauging stations (Silety – Izobilnoye village, Yesil – Petropavlovsk city) have a lower value for the second period (1974-2014) compared with the first period (1933-1973). Thus, a steady increase in the irregularity of flow for the period after 1974 has been revealed for the rivers of the Yesil river basin.</p>\n<p>As a result, the following maps were created for the Yesil river basin using ArcGIS 10.6 software (spatial analysis method):<br />\n1. The average value of the coefficient of natural flow regulation for 1933-1973 (Figure 2).<br />\n2. The average value of the coefficient of natural flow regulation for 1974-2014 (Figure 3).</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"461\" height=\"442\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/2-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/2-1.jpg 461w, https://www.watconman.org/wp-content/uploads/2024/03/2-1-300x288.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 2: </strong>The average value of the coefficient of natural flow regulation for 1933-1973</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\n\t<div>\n\t\t\n\t\t<figure>\n\t\t\t<div><img width=\"503\" height=\"440\" src=\"https://www.watconman.org/wp-content/uploads/2024/03/3-1.jpg\" srcset=\"https://www.watconman.org/wp-content/uploads/2024/03/3-1.jpg 503w, https://www.watconman.org/wp-content/uploads/2024/03/3-1-300x262.jpg 300w\" /></div>\n\t\t</figure>\n\t</div>\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div><strong>Figure 3: </strong>The average value of the coefficient of natural flow regulation for 1974-2014</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<div>The influence of the water content of the year on the degree of natural regulation of the rivers is important for economic entities and the population. Water users and consumers are mainly interested in a constant, stable flow without interruptions and abrupt rises. This means that they benefit most from the flow of rivers with a high degree of natural regulation. For example, a regulated flow during the warm (vegetation) season is crucial for irrigated agriculture. Critically, a low degree of natural flow regulation poses an enormous risk to all in the form of floods and inundations, causing destruction and even loss of life in the adjacent flooded areas. Further research should focus on the search for dependencies linking the characteristics of irregular river flow to the meteorological and hydrographic characteristics of the river basins.<p></p>\n<h3><strong>5. CONCLUSIONS</strong></h3>\n<p>Analysis of spatial and temporal patterns of flow formation of the rivers of the Yesil river basin showed that there is a significant change in the intra-annual river flow distribution in recent decades. The analysis of changes in the flow and its intra-annual flow distribution shows that the hydrological regime of the Yesil river has undergone serious changes in most of its territory. At the same time, in the upper stream up to Nur-Sultan city, the flow regime is leveled and transformed. In the upper stream of the Yesil river, the decrease in spring runoff is the most evident. In the lower stream of the river in the site of Petropavlovsk city, the spring runoff for the period with the disturbed regime is much higher than the spring runoff for the natural period and an increase in seasonal runoff, especially winter runoff, is observed in low-water years with 95% probability.<br />\nThe coefficient of natural flow regulation φ in the river basin depends on the zonal factors on the one hand and the size of the catchment area determining the degree of natural flow regulation on the other hand. An increase in the coefficient of natural flow regulation φ, which expresses the complex influence of physical-geographical factors on the intra-annual flow distribution is accompanied by a substantial decrease in the flow during the flood and a significant increase in the low-water flow during the winter and summer periods. As a result of an increase in the coefficient of natural flow regulation, the winter runoff of the Yesil river in the middle reaches has increased by two or three times.</p>\n<h3><strong>ACKNOWLEDGMENTS</strong></h3>\n<p>This research has been funded by the Science Committee of the Ministry of Science and Higher Education of the Republic of Kazakhstan (Grant No. AP19679134 “Development and improvement of methodological bases for calculating minimum flow of plain rivers Kazakhstan’s in conditions non-stationary climate and flow”).</p>\n<h3><strong>REFERENCES</strong></h3>\n<p>Andreyanov, V.G.,1960. Intra-annual distribution of runoff. St. Petersburg: Gidrometeoizdat.<br />\nAzarisamani, A., Keshavarzi, A., Hamidifar, H., Javan, M., 2020. Effect of rigid vegetation on velocity distribution and bed topography in a meandering river with a sloping bank. Arabian J. for Science and Eng. 45, 8633-8653. https://doi.org/10.1007/s13369-020-04818-7</p>\n<p>Blum, A.G., Ferraro, P.J., Archfield, S.A., Ryberg, K.R., 2020. Causal effect of impervious cover on annual flood magnitude for the United States. Geophys. Res. Lett. 47, e2019GL086480. https://doi.org/10.1029/2019GL086480</p>\n<p>Christodoulou, A., Christidis, P., Bisselink, B., 2020. Forecasting the impacts of climate change on inland waterways. Transport. Res. Part D: Transport and Environ. 82, 102159. https://doi.org/10.1016/j.trd.2019.10.012</p>\n<p>Cui, T., Tian, F., Yang, T., Wen, J., Khan, M.Y.A., 2020. Development of a comprehensive framework for assessing the impacts of climate change and dam construction on flow regimes. J. of Hydrol. 590, 125358. https://doi.org/10.1016/j.jhydrol.2020.125358</p>\n<p>De Niel, J., Willems, P., 2019. Climate or land cover variations: What is driving observed changes in river peak flows: A data-based attribution study. Hydrol. and Earth Syst. Sciences. 23, 871-882. https://doi.org/10.5194/hess-23-871-2019</p>\n<p>Garibli, A.S., Suleymanov, T.A., Ollivier, E., Herbette, G. 2021. Flavonoids from Medicago falcata from the Flora of Azerbaijan. Chem. Nat. Compd. 57(1), 150–151. https://doi.org/10.1007/s10600-021-03302-4</p>\n<p>He, W., Lian, J., Zhang, J., Yu, X., Chen, S., 2019. Impact of intra-annual runoff uniformity and global warming on the thermal regime of a large reservoir. Science of the Total Environ. 658, 1085-1097. https://doi.org/10.1016/j.scitotenv.2018.12.207</p>\n<p>Komilova, N.K., Ermatova, N.N., Rakhimova, T., Karshibaeva, L.K., Hamroyev, M.O. 2021. Urboekological situation and regional analysis of population health in uzbekistan. Int. J. Agricul. Exten. 9(Special Issue), 65–69. https://doi.org/10.33687/ijae.009.00.3722</p>\n<p>Korneychuk, N.N., Kirichuk, G.Y. 2018. Structural and functional organization of phytomicroperiphyton of the transboundary stviga river. Hydrobiol. J. 54(1), 3-18. https://doi.org/10.1615/hydrobj.v54.i1.10</p>\n<p>Lisetskii, F., 2021. Rivers in the focus of natural-anthropogenic situations at catchments. Geosciences (Switzerland). 11, 1-6. https://doi.org/10.3390/geosciences11020063</p>\n<p>Moldakhmetov, M.M., Makhmudova, L.K., 2018. The main hydrological characteristics of the rivers of the Yesil river basin. Taraz: TIGU.</p>\n<p>Moldakhmetov, M.M., Makhmudova, L.K., Zhanabayeva, Z.A., Kumeiko, A., Hamid, M.D., Sagin, J., 2019. Spatial and temporal variabilities of maximum snow depth in the Northern and Central Kazakhstan. Arab. J. Geosci., 12, 336. https://doi.org/10.1007/s12517-019-4505-y.</p>\n<p>Moldakhmetov, M.M., Sarsenbayev, M.Kh., Makhmudova, L.K., 2007. Influence of small reservoirs and ponds on river flow Yesil. in: Materials of the International Scientific and Practical Conference “Problems of ecological geomorphology”. Al-Farabi Kazakh National University, Almaty, pp. 175-180.</p>\n<p>Morri, M., Soualmia, A., 2020. Modeling the impact of riparian vegetation on flow structure and bed sediment distribution in rivers. Arch. of Hydroeng. and Environ. Mech. 66, 59-75. https://doi.org/10.1515/heem-2019-0005</p>\n<p>Mustafaev, Zh.S., Kozykeeva, A. T., Kalmashova, A.N., 2019. Features of the formation of water use in the catchments of the Yesil River basin in the conditions of anthropogenic activity. Res. Result. 4, 295-303.</p>\n<p>Rozhdestvensky, A.V., Lobanova, A.G., Lobanov, V.A., Saharjuk, A.V., 2010. Methodological recommendations for assessing the homogeneity of hydrological characteristics and determining their calculated values from heterogeneous data. St. Petersburg: Nestor-Istoriya.</p>\n<p>Shcherbak, V.I., Korneychuk, N.N. 2006. Influence of hydrological and morphological characteristics of the Teterev river on the structure of phytomicroepilithon. Hydrobiol. J. 42(5), 25-38. https://doi.org/10.1615/HydrobJ.v42.i5.30</p>\n<p>Shcherbak, V.I., Yakushin, V.M., Pligin, Yu.V., Korneychuk, N.N. 2007. Biotic components in the fouling of various substrata in the regulated and non-regulated sections of the river. Hydrobiol. J. 43(6), 23-39. https://doi.org/10.1615/HydrobJ.v43.i6.20</p>\n<p>State Water Cadastre of the Republic of Kazakhstan. Long-term data on the regime and resources of land surface waters. The pools of the Irtysh, Ishim, Tobol, 1987. Available http://www.hydrology.ru/sites/default/files/docs/biblioteka/mds.xls [Accessed June 5 2022].</p>\n<p>State Water Cadastre of the Republic of Kazakhstan. Long-term data on the regime and resources of land surface waters of 1981-1990. Irtysh, Ishim, Tobol river basins, 2002. Available http://www.hydrology.ru/sites/default/files/docs/biblioteka/mds.xls [Accessed June 5 2022].</p>\n<p>State water cadastre of the Republic of Kazakhstan. Long-term data on the regime and resources of land surface waters, 1991-2000. The basins of the Irtysh, Ishim, Tobol rivers, 2004. Almaty: Ministry of Environmental Protection of The Republic of Kazakhstan. Available http://www.hydrology.ru/ sites/default/files/docs/ biblioteka/ mds.xls [Available 7 June 2022].</p>\n<p>Surface water resources of the USSR. Basic hydrological characteristics (for 1963-1970 and the entire observation period). The pools of the Irtysh, Ishim, Tobol, 1977. Available http://www.cawater-info.net/library/ussr-water-resources.htm [Accessed June 6 2022].</p>\n<p>Surface water resources of the USSR. Basic hydrological characteristics (for 1971-1975 and the entire observation period). The pools of the Irtysh, Ishim, Tobol, 1980. Available http://www.cawater-info.net/library/ussr-water-resources.htm [Accessed June 6 2022].</p>\n<p>Tan, H., Cao, R., Wang, S., Wang, Y., Deng, S., Duić, N., 2021. Proposal and techno-economic analysis of a novel system for waste heat recovery and water saving in coal-fired power plants: A case study. J. of Clean. Product. 281, 124372.<br />\nhttps://doi.org/10.1016/j.jclepro.2020.124372</p>\n<p>Thakur, R., Chibuzor, O.S., Harris, G., Thakur, S., 2022. Examining the factors influencing water conservation intentions amongst peri-urban communities of ethekwini municipality, South Africa. Water Conserv. &amp; Manag. 6, 81-88.</p>\n</div>\n\r\n\t\t</div>\r\n\t</div>\r\n\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t<table>\n<tbody>\n<tr>\n<td><strong>Pages</strong></td>\n<td>241-250</td>\n</tr>\n<tr>\n<td><strong>Year</strong></td>\n<td>2024</td>\n</tr>\n<tr>\n<td><strong>Issue</strong></td>\n<td>2</td>\n</tr>\n<tr>\n<td><strong>Volume</strong></td>\n<td>8</td>\n</tr>\n</tbody>\n</table>\n\r\n\t\t</div>\r\n\t</div>\r\n<div><h2>Download</h2><div></div></div></div></div></div></div><div><div><div><div><div><a href=\"https://www.watconman.org/download/8237/\" target=\" _blank\"><i></i>PDF Files</a></div></div></div></div><div><div><div><div><a href=\"https://www.watconman.org/xml/2wcm2024/2wcm2024-241-250.xml\" target=\" _blank\"><i></i>XML Files</a></div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div></div></div></div></div><div><div><div><div>\r\n\t<div>\r\n\t\t<div>\r\n\t\t\t\r\n\t\t</div>\r\n\t</div>\r\n</div></div></div></div>","author":"Natasha","siteTitle":"Water Conservation and Management (WCM)","siteHash":"4b40cdd0834294d8593f52ee7e7261a0ac8d56f637281fa24c6ad595afc9ba11","entryHash":"91c23cdd289614931c05fee7c79f7f2f71ac440cf2b2091e5d2d64a924196b66","category":"Environment"}