{"title":"HNL Dimer in plasma is a unique and useful biomarker for the monitoring of antibiotic treatment in sepsis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310987","date":1727359200000,"content":"<p>by Per Venge, Christer Peterson, Shengyuan Xu, Anders Larsson, Joakim Johansson, Jonas Tydén</p>\r\nIntroduction <p>Sepsis is a growing problem worldwide and associated with high mortality and morbidity. The early and accurate diagnosis and effective supportive therapy are critical for combating mortality. The aim of the study was to compare the kinetics of four biomarkers in plasma in patients admitted to ICU including sepsis and during antibiotics treatment.</p> Methods <p>The biomarkers evaluated were HBP (Heparin-binding protein), HNL Dimer (Human Neutrophil Lipocalin), HNL Total and PCT (Procalcitonin). Plasma was obtained at admission to ICU and during follow-up at days 2 and 3. Antibiotic treatment was started or reviewed on admission to ICU. The results were compared to SOFA and KDIGO-scores and to survival. 277 patients admitted to ICU were included of which 30% had sepsis. The other groups were categorized as miscellaneous, other medical and trauma.</p> Results <p>The plasma concentrations of all four biomarkers were highly elevated with the highest concentrations in sepsis patients. During the follow-up period HNL Dimer decreased already day 2 and further so day 3 (p&lt;0.00001) in contrast to unchanged concentrations of the other three biomarkers. HNL Total showed the strongest relationships to the clinical scores (p&lt;0.0001) and was by multiples regression analysis independently related to these scores.</p> Conclusion <p>Our data supports and confirms our earlier findings of HNL Dimer being a novel and potentially useful clinical tool in antibiotic stewardship in sepsis. HNL Total reflects epithelial cell activity in the body and is an interesting biomarker for the management of organ failure in such patients.</p>","author":"Per Venge","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"91c4dbea660796a0bdeadbba2cfe60899229443bfd4c9cb06d1e2815fc9d8717","category":"Interdisciplinary"}