{"title":"Analysis of Particle Number Emissions in a Retrofitted Heavy Duty-Spark Ignition Engine Powered by LPG","link":"https://www.preprints.org/manuscript/202403.1404/v1","date":1711370198000,"content":"This study aims to examine the non-volatile Particle Number (PN) emissions of a retrofitted Heavy-Duty Spark-Ignition (HD-SI) engine powered by liquefied petroleum gas (LPG) under both steady-state and transient conditions. The engine was tested under seven steady-state operating points to investigate the PN behavior and Particle Size Distribution (PSD) upstream and down-stream of the Three-Way Catalyst (TWC). This analysis intends to assess the impact of including particles with diameters ranging from 10 nm to 23 nm in the total particle count, a consideration for future regulations. The study employed the World Harmonized Transient Cycle (WHTC) for transient conditions to encompass the same engine working region used in the steady-state analysis. A Dekati FPS-4000 diluted the exhaust sample to measure the PSD and PN for particle diameters between 5.6 nm and 560 nm using the TSI-Engine Exhaust Particle Sizer (EEPS) 3090. Findings indicate that PN levels tend to increase downstream of the TWC under steady-state conditions in operating points with low exhaust gas temperatures and flows (equal to or less than 500 °C and 120 kg/h). Furthermore, the inclusion of particles with diameters between 10 nm and 23 nm leads to an increase in PN emissions by 17.70% to 40.84% under steady conditions and by an average of 40.06% under transient conditions, compared to measurements that only consider particles larger than 23 nm. Notably, in transient conditions, most PN emissions occur during the final 600 seconds of the cycle, linked to the most intense phase of the WHTC.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"91d1f6a91cfcd00cf5cc62c120f083b35ac03129e9cc4a0d52886ab017a714e1","category":"Interdisciplinary"}