{"title":"Profound Properties of Protein Rich Platelet Concentrate Matrices as Novel Multi-Purpose Biological Platforms in Tissue Repair, Regeneration, and Wound Healing","link":"https://www.preprints.org/manuscript/202405.1757/v1","date":1716809334000,"content":"Autologous platelet-rich plasma (PRP) preparations are prepared at point of care. Centrifugation cellular density separation sequesters a fresh unit of blood into three main fractions: a platelet-poor plasma (PPP) fraction, a stratum rich in platelets (platelet concentrate) and, bioformulation dependent, also leukocyte and erythrocyte fractions. The employment of autologous platelet concentrates facilitates the biological potential to accelerate and support in numerous cellular activities that can lead to tissue repair, tissue regeneration, wound healing, and ultimately functional structural repair. Normally, after PRP preparation the PPP fraction is discarded. One of the less well known, but equally important features of PPP is that particular growth factors (GFs) are not abundantly present in PRP, as they reside outside the platelet alpha granules. Precisely, insulin-like growth factor-1 (IGF-1) and hepatocyte growth factor (HGF) are mainly present in the PPP fraction. In addition to their roles as angiogenesis activators, these plasma-based GFs are also known to inhibit inflammation, fibrosis, and they promote keratinocyte migration and support in tissue repair and wound healing. Additionally, PPP is known for the presence of exosomes and other macrovesicles, exerting cell-cell communication and cell signaling. Newly developed ultrafiltration technologies incorporate PPP processing methods by eliminating in a fast and efficient manner plasma water, cytokines, molecules, and plasma proteins with a molecular mass (weight) less than the pore size of the fibers. Consequently, a viable and viscous protein concentrate of functional, total proteins, like fibrinogen, albumin, and alpha-2-macroglobulin is created. Consolidating a small volume of high platelet concentrate with a small volume of highly concentrated protein-rich PPP creates a protein rich platelet concentrate (PRPC) biological preparation. After the activation of proteins, mainly fibrinogen, the PRPC matrix retains and facilitates interactions between invading resident cells, like macrophages, fibroblast, and mesenchymal stem cells (MSCs), and the embedded concentrated PRP cells and molecules. The administered PRPC biologic will ultimately undergo fibrinolysis, leading to a sustained release of concentrated cells and molecules that have been retained in the PRPC matrix until the matrix is dissolved. We will discuss the unique biological and tissue reparative and regenerative properties of PRPC matrix.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"91d90abce15fa023c053fe2328da6279e9f415e3c3feafc94c7154a96be04b5c","category":"Interdisciplinary"}