{"title":"Can denticle morphology help identify southeastern Australian elasmobranchs?","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15704?af=R","date":1710582184000,"content":"<h2>Abstract</h2>\n<p>Elasmobranchs are covered in scale-like structures called dermal denticles, comprising dentine and enameloid. These structures vary across the body of an individual and between species, and are frequently shed and preserved in marine sediments. With a good understanding of denticle morphology, current and historical elasmobranch diversity and abundance might be assessed from sediment samples. Here, replicate samples of denticles from the bodies of several known (deceased) shark species were collected and characterized for morphology before being assigned morphotypes. These data were used to expand the established literature describing denticles and to investigate intra- and interspecific variability, with the aim of increasing the viability of using sediment samples to assess elasmobranch diversity and abundance. Denticle morphology was influenced more by life-history traits than by species, where demersal species were largely characterized by generalized function and defense denticles, whereas pelagic and benthopelagic species were characterized by drag-reduction denticles. Almost all species possessed abrasion strength or defense denticles on the snout, precluding their utility for separating species. In a separate manipulative experiment, samples of denticles were collected from sediments in two aquaria with known elasmobranchs to determine their utility for reliably separating species. Visual examination of denticles, morphometric measurements, scaled photographs, and reference collections allowed for some precise identification, but not always to the species level. Ongoing work to develop denticle reference collections could help to identify past and present families and, in some cases, species.</p>","author":"Mariah Appleby, \nVincent Raoult, \nMatt K. Broadhurst, \nTroy Gaston","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"91dff95c445203010aa569ccd4b1308c26668f93dbbd6be8811f88088f605222","category":"Environment"}