{"title":"Supreme Court backs cheerleader over school that punished her for Snapchat post","link":"https://arstechnica.com/?p=1775810","date":1624482183000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-snapchat-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/getty-snapchat.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/\">Getty Images | stockcam</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Supreme Court today ruled in favor of a cheerleader and against the Pennsylvania high school that suspended her from the junior varsity team for a \"vulgar\" Snapchat post.</p>\n<p>Brandi Levy was 14 in 2017 when she used Snapchat to express her frustration after failing to make the Mahanoy Area High School varsity cheerleading squad. Her Snapchat post contained an image of herself and a friend with middle fingers raised and the caption \"Fuck school fuck softball fuck cheer fuck everything.\" A second post she made also complained about the varsity squad's decision but didn't contain any profanity. The posts were not widely distributed: as the Supreme court noted, Snapchat is \"a social media application for smartphones that allows users to share temporary images with selected friends.\"</p>\n<p>\"B.L.'s posts expressed frustration with the school and the school's cheerleading squad, and one contained vulgar language and gestures,\" the ruling said. \"When school officials learned of the posts, they suspended B.L. from the junior varsity cheerleading squad for the upcoming year.\"</p></div><p><a href=\"https://arstechnica.com/?p=1775810#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775810&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"91e5bc5c388afda8fe88a25f47a3e992e6fc12db3d276f08e5de21e08f49379e","category":"Tech"}