{"title":"Pinarello’s new F-Series and X-Series bikes compared: what’s the difference and which is right for you?","link":"https://www.bikeradar.com/advertising-feature/pinarello-f-vs-pinarello-x/","date":1690448444000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/07/Pinarello-Dogma-X-3-494ea81.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" />                                            <p>Pinarello is one of the most prestigious brands in cycling, with a history that stretches back more than 70 years and with a string of top-tier professional racing victories to its name, including 30 Grand Tours. Seven of the last 11 Tours de France have been won on Pinarello’s Dogma bikes.</p>\n<p>The Dogma’s distinctive profile stands out in the pro peloton, and mixes lightweight and aerodynamic characteristics in a way other brands are only now catching up with.</p>\n<p>Now Pinarello has applied its expertise to a new line-up of bikes – the F-Series and X-Series. The range opens up the prospect of owning a Pinarello to a wider range of riders, regardless of whether you’re a go-fast racer, want to lead out the sprint on a weekend group ride or go the distance in a European gran fondo.</p>\n<p>So what do the F-Series and X-Series offer, how do they differ and how can you choose the best Pinarello for your needs?</p>\n<h2>Introducing the Pinarello F-Series and X-Series</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> The F-Series is Pinarello’s latest race bike.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>Pinarello launched its latest F-Series and <a href=\"https://www.bikeradar.com/news/pinarello-x-series/\">X-Series</a> bikes in February 2023. They’re built to offer the brand’s race-winning design and tech in packages tailored to a broader spectrum of riders.</p>\n<p>In short, the F-Series is a performance race bike through and through, but with two frame tiers.</p>\n<p>It’s Pinarello’s latest ‘Competition’ model, designed for those who want to ride fast and with a pro-level geometry. That means the F-Series is low and long, and built for riders who want to extract every watt from their rides.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" /></div><div><figcaption><span><i></i> The X-Series is Pinarello’s new endurance bike.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>The X-Series, meanwhile, is for riders who love cycling for the pure joy and escapism of turning the pedals. It’s designed for cyclists looking for a Pinarello ‘endurance’ bike with a more comfortable riding position, while still demanding an exhilarating machine.</p>\n<p>Let’s look in more detail at the differences between the F-Series and X-Series bikes and which one would be better for the riding you do.</p>\n<h2>Pinarello F-Series vs Pinarello X-Series – what’s the difference?</h2>\n<h3>Geometry</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> The F-Series has an aggressive, race-focused geometry.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>A key difference between the F-Series and X-Series bikes is their geometry.</p>\n<p>The Competition geometry of the F-Series mimics that of a Tour de France-winning race bike, signalling Pinarello’s intent for this bike.</p>\n<p>The racy position leads to a reduced frontal profile and improved aerodynamics, while the handling is designed to be sharp and responsive, tapping into Pinarello’s extensive racing heritage.</p>\n<p>For the X-Series, expect a shorter reach and higher stack, putting the rider in a more upright position.</p>\n<p>The advantage here, for many cyclists, is added comfort – but that doesn’t mean it’s a dull ride. Expect an exciting edge, whether that be during a full-gas acceleration or on an adrenaline-fuelled descent.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" /></div><div><figcaption><span><i></i> The X-Series puts the rider in a more relaxed position for big days out.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>Ultimately, it’s a geometry designed for those who want to ride all day in comfort, without the handling becoming unresponsive, and with no need to contort into a pro position.</p>\n<p>The geometry differences between the F-Series and X-Series don’t stop there. Pinarello says the length of the chainstays has a major impact on a bike’s performance, so it’s aimed to keep them as short as possible on the F-Series bikes.</p>\n<p>In contrast, the X-Series endurance bike extends the chainstay length slightly. Crucially, this enables you to fit slightly wider 32mm tyres, whereas the F-Series has a maximum clearance of 30mm.</p>\n<p>Finally, the X-Series has a slightly slacker head tube angle than the F-Series, again designed to add stability, while still providing Pinarello’s pin-point handling.</p>\n<p>All of this makes the X-Series a machine primed for endurance riders who want to own a bike from one of cycling’s heritage brands, while delivering up-to-date, real-world performance.</p>\n<h3>Sizes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" /></div><div><figcaption><span><i></i> Pinarello offers its road bikes in a wide range of sizes.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>One major feature of both ranges is the large number of frame sizes Pinarello offers.</p>\n<p>While many brands sell only five sizes – XS, S, M, L, XL or equivalent – Pinarello makes both the F-Series and X-Series bikes in nine size options.</p>\n<p>Alongside a wide range of handlebar and stem options from Pinarello’s componentry brand, MOST, this enables riders to tailor the fit specifically for their preferred position on the bike.</p>\n<h3>Frame construction</h3>\n<p>Geometry aside, how do the F and X compare? Let’s consider the carbon fibre layup, tube shapes and cable routing.</p>\n<h4>Carbon fibre layup</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> F-Series bikes are available in two tiers, with the F9 and F7 using TorayCa T900 unidirectional carbon fibre, and the F5 using T700 carbon.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>The F-Series bikes are made with either TorayCa T900 unidirectional fibre for the F9 and F7, or T700 fibre for the F5 range.</p>\n<p>By offering the F-Series in two carbon fibre layups, Pinarello is enabling riders to choose a frame built to their individual needs, whether that’s the reduced weight of the F9 and F7, or the more accessible positioning of the F5.</p>\n<p>Throw in the expertise of a brand that dates back to 1953, with some of the greatest riders in the history of the sport winning on Pinarello bikes, and the F-Series opens up the opportunity to experience an Italian-designed thoroughbred racer.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" /></div><div><figcaption><span><i></i> The X-Series uses T600 carbon fibre.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>The X-Series bikes, meanwhile, use the T600 fibre in a layup designed to help soak up vibrations.</p>\n<p>This, combined with the frame’s Flex Stays design, which we’ll come on to, is intended to provide a comfortable ride, without the need to add any form of complicated mechanical damping.</p>\n<p>All told, the T600 layup is designed to provide the ideal mix of lightweight, responsiveness and damping ability, for Pinarello riders who value comfort, handling and performance in equal measure.</p>\n<h4>Aerodynamic tube profiles</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> Both the F-Series and X-Series sport aerodynamic tube shapes.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>Both the F-Series and X-Series apply Pinarello’s expertise in aerodynamics, making pro-level performance available to weekend racers and gran fondo riders alike.</p>\n<p>The F- and X-Series frames share a similar profile, using Pinarello’s Flatback tube shapes, with a squared-off design to cut through the wind without compromising on stiffness or weight.</p>\n<p>The down tube is also shaped to partially shield a water bottle, while the sleek, new integrated seatpost clamp points to Pinarello’s attention to detail and is designed to reduce the overall size of the seat tube for comfort and aerodynamics.</p>\n<p>Both the F and X ranges have Pinarello’s signature asymmetric frame profile. This strengthens the driveside of the frameset to help balance out the forces on the frame caused by the one-sided pull of the chain.</p>\n<h4>Flex Stays</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma X endurance road bike\" title=\"Pinarello Dogma X endurance road bike\" /></div><div><figcaption><span><i></i> The Flex Stays of the X-Series improve comfort.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>One key difference between the X- and F-Series frames is the ‘Flex Stays’ design of the endurance-focused X-Series.</p>\n<p>The stays are slightly longer than on the F-Series bikes, with a curved structure. Combined with the use of mid-modulus T600 carbon fibre, they help to absorb road imperfections for added long-range comfort.</p>\n<p>It’s a key design feature of the X-Series and one that focuses the range on endurance, enabling riders to perform at distance without having to push their bodies to the absolute limit.</p>\n<h4>Onda fork</h4>\n<p>Pinarello’s distinctive Onda fork design, which has been carried over from the brand’s high-performance race bikes, is a feature of both the new F and X.</p>\n<p>Pinarello has used an Onda fork on its bikes since 2000, with the current, slightly less wavy design debuting on the Tour-winning Dogma F8 in 2014.</p>\n<p>The Onda fork is designed to be aerodynamic and stable, delivering accurate steering but also helping to dispel vibration and shocks transmitted from the road surface.</p>\n<p>It includes Pinarello’s Fork Flaps, which, according to the brand’s wind tunnel testing, have shown to help improve airflow over the tips of the fork and dropouts.</p>\n<h4>Integrated cable routing</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> Pinarello’s TiCR internal cable routing system ensures clean lines throughout.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>All of the F-Series and X-Series bikes benefit from Pinarello’s TiCR internal cable routing system, which sees cables and hoses hidden entirely within the bars, stem and frame.</p>\n<p>This not only gives a really clean look to the bikes, it also has an aerodynamic advantage, with Pinarello claiming to save up to five watts over external cables.</p>\n<p>Top-end road groupsets may now all have wireless electronic connections between the shifters and the derailleurs, but TiCR also works with wired electronic and mechanical shifters.</p>\n<p>On the subject of electronic groupsets, Pinarello’s framesets fit a Shimano Di2 battery just above the bottom bracket, rather than in the seat tube.</p>\n<p>This enables the seat tube to be thinner, reducing air resistance and also lowers the bike’s centre of mass, further improving handling.</p>\n<h4>Tyre clearance</h4>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> The F-Series (pictured) has room for 30mm tyres, while the X-Series increases clearance to 32mm.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>As well as the frame’s Flex Stays, the additional tyre clearance of the endurance-targeted X-Series sets it apart from the racier F-Series.</p>\n<p>The X has clearance for 32mm tyres, providing room for riders who want to benefit from the additional comfort of wider rubber – or even to take the X-Series on a cobbled or light off-road excursion.</p>\n<p>The F remains fully up-to-date in terms of clearance, though, with room for 30mm tyres. This makes it well-suited to racy riders who want to add some additional comfort without adversely impacting on weight or rolling speed.</p>\n<h4>Frame weights</h4>\n<p>Pinarello claims a frame weight of 950g for the F9 and F7 frames, made with higher-modulus T900 carbon fibre, and 990g for the F5 frame, made with T700 fibre.</p>\n<p>The X-Series frame is a little heavier, with a claimed weight of 1,070g.</p>\n<h3>Handlebars</h3>\n<p>Let’s move onto the cockpit, with handlebar and stem choices differing between the F-Series and X-Series bikes.</p>\n<p>The higher-end F9 and F7 bikes include the MOST Talon Ultrafast integrated cockpit, adding to the bikes’ aero advantage, while the F5 has a two-piece MOST Jaguar XA Aero TiCR bar and stem.</p>\n<p>The latter offers more adjustability and is also found on the X-Series bikes – a plus for endurance riders seeking to fine-tune fit.</p>\n<p>However, if you’re worried about sizing of the one-piece MOST Talon Ultralight bar/stem, it’s available in 16 different stem-length and bar-width combinations, so choosing one that will fit you isn’t going to be an issue.</p>\n<h2>Pinarello F-Series and X-Series bike specs</h2>\n<p>Pinarello offers a range of different specs for its latest bikes, enabling you to choose one that suits your preferences. Not all specs are available in all territories, but the full worldwide range includes:</p>\n<ul><li>F9 Dura-Ace Di2</li>\n<li>F9 SRAM Red AXS</li>\n<li>F7 Ultegra Di2</li>\n<li>F7 SRAM Force AXS</li>\n<li>F5 Ultegra</li>\n<li>F5 105 Di2</li>\n<li>X3 105 Di2</li>\n<li>X3 SRAM Rival AXS</li>\n<li>X1 105</li>\n</ul><h2>So, which bike is right for you?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Pinarello Dogma F race bike\" title=\"Pinarello Dogma F race bike\" /></div><div><figcaption><span><i></i> Pinarello has both racers and endurance riders covered with the F-Series (pictured) and X-Series.</span></figcaption><span> <i>Pinarello</i></span></div>\n<p>Whether you’re looking for a race bike for competition or a fast endurance bike, the new Pinarello F-Series and X-Series bikes offer something for a wide range of riders, with a broad spectrum of spec options.</p>\n<p>If you’re the type of rider who values the fastest possible ride and performance, the F-Series bikes may be the way to go. The F-Series will get you long and low, and offers race-ready handling in an all-round aerodynamic package.</p>\n<p>That’s great for competition and racing, but should also suit the recreational rider who is comfortable riding in a more aggressive position.</p>\n<p>Alternatively, the X-Series bikes add an extra dose of ride comfort, with a more relaxed geometry, increased tyre clearance and built-in features to help absorb road buzz.</p>\n<p>There’s more adjustability in the two-piece bar and stem than in the one-piece Most Talon Ultrafast, enabling you to adapt your ride position.</p>\n<p>You still get Pinarello’s race-winning ethos and a performance design edge, in a package that you may find more comfortable for extended rides.</p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"91e58c00e9cda15a258f8cd3cfc94b3ad8c0a1b524a5a9dbb77c62990c6bb06a","category":"Cycling"}