{"title":"Tim McCarver Dies at 81","link":"https://www.espn.com/mlb/story/_/id/35673836/world-series-champion-tv-analyst-tim-mccarver-dies-81","date":1676753958000,"content":"\n<p>ESPN:</p>\n\n<blockquote>\n  <p>Tim McCarver, the All-Star catcher and Hall of Fame broadcaster\nwho during 60 years in baseball won two World Series titles with\nthe St. Louis Cardinals and had a long run as one of the most\nrecognized, incisive and talkative television commentators in the\ncountry, died Thursday. He was 81.</p>\n\n<p>McCarver’s death was announced by the National Baseball Hall of\nFame, which said he died Thursday morning in Memphis, Tennessee,\nwhere he was with his family.</p>\n\n<p>Among the few players to appear in major league games in four\ndifferent decades, McCarver was a two-time All Star who worked\nclosely with two future Hall of Fame pitchers: the tempestuous Bob\nGibson, whom McCarver caught for St. Louis in the 1960s, and the\nintroverted Steve Carlton, McCarver’s fellow Cardinal in the ’60s\nand a Philadelphia Phillies teammate in the 1970s.</p>\n\n<p>He switched to television soon after retiring in 1980 and called\n24 World Series for ABC, CBS and Fox, a record for a baseball\nanalyst on television. He became best known to national audiences\nfor his 18-year partnership on Fox with play-by-play man Joe Buck.</p>\n</blockquote>\n\n<p>Longtime readers may recall that a decade or so ago, I joined with some friends to contribute to a low-key sports blog that we named American McCarver in his honor. (American McCarver is long dormant but still standing; <a href=\"https://americanmccarver.com/2023/02/rip-tim-mccarver/\">Jason Snell posted a brief item</a> regarding McCarver’s passing though.)</p>\n\n<p>Keith Olbermann dedicated the entire opening segment of his Countdown podcast yesterday to eulogizing McCarver, with whom he’d become friends as fellow broadcasters. It’s a wonderful tribute, well worth a few minutes of your time. Like many great figures in sports broadcasting, McCarver’s appeal was never about the mechanics of the game, but the poetry of it. The humanity. He told stories about players — <em>people</em> — not achievements.</p>\n\n<p>When news of McCarver’s death came, my dad called me to see if I’d heard. He knows I was a fan. My dad relayed a story about McCarver he’d told me many many times before, and I enjoyed it more than ever. McCarver had a gentle demeanor. <a href=\"https://www.baseball-almanac.com/quotes/bob_gibson_quotes.shtml\">Bob Gibson did not</a>. The story goes, some random game at the peak of Gibson’s dominance, an opposing rookie comes to the plate to face Gibson for the first time. He starts digging in to the batter’s box with his back foot. McCarver, catching, calmly tells the rookie “Kid, I wouldn’t do that if I were you.” The kid ignores McCarver, and stays in the box, dug in. He’s going to show Bob Gibson what he’s got at the plate.</p>\n\n<p>Gibson’s first pitch is a fastball way up and way in. The rookie had to dive into the dirt to avoid getting hit.</p>\n\n<p>McCarver, tossing the ball back to Gibson as the rookie picked himself off the ground: “I told you so.”</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/02/18/mccarver\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"5dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"91e60c91a7870bdc7c40686678a8a36a62c6dad5f419d20a7bca4d","category":"Tech"}