{"title":"Cross-reactivity of 24 cannabinoids and metabolites in blood using the Immunalysis Cannabinoids Direct enzyme-linked immunosorbent assay","link":"https://academic.oup.com/jat/article/48/6/439/7655997?rss=1","date":1713744000000,"content":"<span><div>Abstract</div>With wider availability of synthetic and semi-synthetic cannabinoids in the consumer space, there is a growing impact on public health and safety. Forensic toxicology laboratories should keep these compounds in mind as they attempt to remain effective in screening for potential sources of human performance impairment. Enzyme-linked immunosorbent assay (ELISA) is a commonly utilized tool in forensic toxicology, as its efficiency and sensitivity make it useful for rapid and easy screening for a large number of drugs. This screening technique has lower specificity, which allows for broad cross-reactivity among structurally similar compounds. In this study, the Cannabinoids Direct ELISA kit from Immunalysis was utilized to assess the cross-reactivities of 24 cannabinoids and metabolites in whole blood. The assay was calibrated with 5 ng/mL of 11-nor-9-carboxy-Δ<sup>9</sup>-tetrahydrocannabinol and the analytes of interest were evaluated at concentrations ranging from 5 to 500 ng/mL. Most parent compounds demonstrated cross-reactivity ≥20 ng/mL, with increasing alkyl side-chain length relative to Δ<sup>9</sup>-tetrahydrocannabinol resulting in decreased cross-reactivity. Of the 24 analytes, only the carboxylic acid metabolites, 11-nor-9-carboxy-Δ<sup>8</sup>-tetrahydrocannabinol, 11-nor-9(R)-carboxy-hexahydrocannabinol and 11-nor-9(S)-carboxy-hexahydrocannabinol, were cross-reactive at levels ≤10 ng/mL. Interestingly, 11-nor-9(R)-carboxy-hexahydrocannabinol demonstrated cross-reactivity at 5 ng/mL, where its stereoisomer 11-nor-9(S)-carboxy-hexahydrocannabinol, did not. As more information emerges about the prevalence of these analytes in blood specimens, it is important to understand and characterize their impact on current testing paradigms.</span>","author":"","siteTitle":"Journal of Analytical Toxicology Current Issue","siteHash":"684cff8c881f5537e121ec409f4017c5ba6630e2a004f9595c9e918ac4254c23","entryHash":"91e9de1512e68c4c0b8fd9a30138031aa3761877ef549b770669c6dd098d49c2","category":"Environment"}