{"title":"No general support for functional diversity enhancing resilience across terrestrial plant communities","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13895?af=R","date":1722599663000,"content":"<h2>Abstract</h2>\n<h2>Aim</h2>\n<p>Understanding the mechanisms promoting resilience in plant communities is crucial in times of increasing disturbance and global environmental change. Here, we present the first meta-analysis evaluating the relationship between functional diversity and resilience of plant communities. Specifically, we tested whether the resilience of plant communities is positively correlated with interspecific trait variation (following the niche complementarity hypothesis) and the dominance of acquisitive and small-size species (following the mass ratio hypothesis), and for the context-dependent effects of ecological and methodological differences across studies.</p>\n<h2>Location</h2>\n<p>Global.</p>\n<h2>Time Period</h2>\n<p>2004–2021.</p>\n<h2>Major Taxa Studied</h2>\n<p>Vascular plants.</p>\n<h2>Methods</h2>\n<p>We compiled a dataset of 69 independent sites from 26 studies that have quantified resilience. For each site, we calculated functional diversity indices based on the floristic composition and functional traits of the plant community (obtained from the TRY database) which we correlated with resilience of biomass and floristic composition. After transforming correlation coefficients to Fisher's <i>Z</i>-scores, we conducted a hierarchical meta-analysis, using a multilevel random-effects model that accounted for the non-independence of multiple effect sizes and the effects of ecological and methodological moderators.</p>\n<h2>Results</h2>\n<p>In general, we found no positive functional diversity–resilience relationships of grand mean effect sizes. In contrast to our expectations, we encountered a negative relationship between resilience and trait variety, especially in woody ecosystems, whereas there was a positive relationship between resilience and the dominance of acquisitive species in herbaceous ecosystems. Finally, the functional diversity–resilience relationships were strongly affected by both ecological (biome and disturbance properties) and methodological (temporal scale, study design and resilience metric) characteristics.</p>\n<h2>Main Conclusions</h2>\n<p>We rejected our hypothesis of a general positive functional diversity–resilience relationship. In addition to strong context dependency, we propose that idiosyncratic effects of single resident species present in the communities before the disturbances and biological legacies could play major roles in the resilience of terrestrial plant communities.</p>","author":"Lucrecia Lipoma, \nStephan Kambach, \nSandra Díaz, \nFrancesco María Sabatini, \nGabriella Damasceno, \nJens Kattge, \nChristian Wirth, \nScott R. Abella, \nCarl Beierkuhnlein, \nTravis R. Belote, \nMarkus Bernhardt‐Römermann, \nDylan Craven, \nJiri Dolezal, \nNico Eisenhauer, \nForest Isbell, \nAnke Jentsch, \nJürgen Kreyling, \nVojtech Lanta, \nSoizig Le Stradic, \nJan Lepš, \nOuti Manninen, \nPierre Mariotte, \nPeter B. Reich, \nJan C. Ruppert, \nWolfgang Schmidt, \nDavid Tilman, \nJasper van Ruijven, \nCameron Wagg, \nDavid A. Wardle, \nBrien Wilsey, \nHelge Bruelheide","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"91e9405cb0106daacdd2ca80840e1231e35d18815406b122e37dcfe865904993","category":"Environment"}