{"title":"Blix Vika+ review: A powerful ebike that folds and fits just about anywhere","link":"https://arstechnica.com/?p=1791650","date":1630936842000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/IMG_1718-800x449.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/IMG_1718.jpg\">Enlarge</a> <span>/</span> The 2021 Blix Vika+ foldable ebike, as posed in a neighbor's fancypants garden. Thanks, neighbor. (credit: Sam Machkovech)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>As the ebike universe explodes with options and brands all vying for a piece of the burgeoning market, I keep coming back to a company that I have liked but rarely heard much about: Blix. My first brush with the California e-bike manufacturer came in 2018 when I was offered a test ride of its then-$1,599 Vika folding ebike model. I enjoyed my time with the Vika, but as a relatively new ebike tester, I opted not to write up a novice review.</p>\n<p>Since then, however, Ars' bike-savviest staffers have been testing and reviewing a number of high-quality e-bikes. In my case, I've had a few e-bike tests come and go, sometimes with vehicles not quite meriting Ars coverage. Most recently I reviewed <a href=\"https://arstechnica.com/gadgets/2020/11/vanmoof-x3-ebike-review-at-2000-its-automatic-for-some-of-the-people/\" target=\"_blank\">the handsome VanMoof X3 in 2020</a>, and I both appreciated its best aspects and described how it didn't fit some potential ebike use cases.</p>\n<p>When the time came for me to buy a new bike this year, I opted for an ebike, largely because I want the freedom to ride farther in a single day without feeling worn out or sweaty—especially in a hilly city like Seattle. I soon circled back to Blix—<em>that was a good bike at a good price</em>, I kept thinking, and I found a used Blix cruiser (the 2018 Aveny) for an even better price. It became my daily rider at the outset of this summer.</p></div><p><a href=\"https://arstechnica.com/?p=1791650#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791650&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"91ec9019fcb3e58f2a11e03212c4a991a733723f835649613603f84490da706f","category":"Tech"}