{"title":"Influence of exogenous 24‐epibrassinolide on improving carotenoid content, antioxidant capacity and gene expression in germinated maize seeds","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13870?af=R","date":1725444585000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Carotenoids have various physiological functions, such as immune regulation and cancer prevention. Germination could further improve the content of carotenoids in maize seeds. In this study, yellow maize seeds (Suyu 29) were soaked and germinated with different concentrations of 24-epibrassinolide. The changes of germination percentage, sprout length, bioactive components, antioxidant capacity and carotenoid content of the maize seeds were analyzed. Additionally, the relative expression of key genes in the carotenoid synthesis pathway was investigated.</p>\n<h2>Results</h2>\n<p>The results showed that the sprout length, germination percentage, soluble protein, free amino acids, proline, endogenous abscisic acid, vitamin C, total phenolics and carotenoids displayed a significant increasing trend compared with the control group (<i>P</i> &lt; 0.05). The activity of superoxide dismutase and peroxidase increased by 55.1% and 58.5% <i>versus</i> the control group, and the antioxidant capacity of 2,2-diphenyl-1-picrylhydrazyl, 2,2-azinobis(3-ethylbenzothiazoline-6-sulfonic acid) and ferric reducing antioxidant power was 19.8%, 13.4% and 44.1% higher than that of the control group (<i>P</i> &lt; 0.05). Compared with the control group, the expression of genes was significantly up-regulated (<i>P</i> &lt; 0.05). Under the treatment of 0.1 mg L<sup>−1</sup> of 24-epibrassinolide, carotenoid content reached the highest value. The carotenoids showed a positive correspondence with antioxidant enzyme activity, antioxidant capacity and total phenolics content (<i>P</i> &lt; 0.05).</p>\n<h2>Conclusion</h2>\n<p>This study showed that 0.1 mg L<sup>−1</sup> of exogenous 24-epibrassinolide promoted the accumulation of carotenoids and improved the antioxidant capacity and the quality of germinated maize seeds. It could provide a method for the development of germinated maize products enriched in carotenoids. © 2024 Society of Chemical Industry.</p>","author":"Wenying Yang, \nHao Xu, \nFanyu Wang, \nWeiwei He, \nDajing Li, \nQingqi Guo, \nYihong Bao, \nZhongyuan Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"91f9244d46ee4a5d4b20d9b6f6792e7d170c8b46c9472a85091bf31bc53f4163","category":"Environment"}