{"title":"Risk‐based valuation of surveillance data in open environments: Methods application to a key shellfish aquaculture production region","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13109?af=R","date":1729579136000,"content":"<h2>Abstract</h2>\n<p>Disease freedom surveillance is challenging in settings where environmental conditions and population health can change abruptly. We propose a novel approach to freedom evaluation that is specifically suited to open environments. The approach merges information about pathogen introduction risk with information from pathogen surveillance to estimate assurance of freedom. While the logic is not new, the approach uses a generalizable model designed by an expert panel to estimate introduction probability, easing the need for costly, site-specific risk assessment. This introduction probability is then used to inform the time-adjusted value of historical surveillance data and adapt the consequent requirements (sampling volume and frequency) of future surveys. We apply the approach to an open water region on the Pacific Coast of the United States known for its mollusk production. Results support absence of the target pathogens—<i>Marteilia refringens</i>, <i>Marteilioides chungmuensis</i>, Ostreid herpesvirus 1, <i>Perkinsus marinus</i>, and <i>Perkinsus olseni</i>—for the host species, region, and time-period under investigation. Findings demonstrate (1) the ability to retain assurance in pathogen freedom through time in open systems, (2) the limitations of sample volume, and importance of sampling frequency, for pathogens with higher introduction risk, and (3) expert elicitation as a generalizable alternative to formal risk assessment.</p>","author":"Lori Gustafson, \nMarta Remmenga, \nClara Duncan, \nClayton Bliss, \nDavid Bushek, \nRyan B. Carnegie, \nCem Giray, \nTed Meyers, \nKatherine Davis, \nKathleen Hartman, \nRalph Elston","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"9207d2bb103ebaaa41de40ee3625d20a685a201ff25ddde37dd4a42cc5de96d2","category":"Environment"}