{"title":"How Is Tourism Geography Situated in Taiwan? Geography versus Tourism and Recreation","link":"https://www.preprints.org/manuscript/202408.0646/v1","date":1723133679000,"content":"Tourism Geographers in Anglo-American geographical departments migrate to teach and research tourism in applied schools and departments such as business, resource and environment, and even cultural and creative industry. Under national research assessment and funding pressures, tourism geographers are not encouraged to keep on undertaking serious theoretical researches related to their mother discipline and transferred to research applied researches and publish in hybrid journals. Such changes in tourism geographers` research behavior have not been tested and reported in Asian academic contexts, especially Taiwan while frequently being discussed internationally. This research aims to investigate the differences in the research behavior of tourism geographers between those who are staffed in geography departments and those who migrate to applies departments such as tourism and recreation, resource and environment, and others in terms of publishing journals, paradigmatic approaches, research types(qualitative, quantitative, and mixed), research methods and geographical scales conducted based on content analysis of articles published by tourism geographers in geography and tourism and recreation departments. This study revealed that there are significant differences in the research behavior of tourism geographers between different department. Finally, this paper explains the differences in terms of Taiwan changing social and economic conditions, academic traditions and politics of geography and applied departments, research habits and preferences of tourism geographers among departments and other aspects. This study can help international tourism geography academic circles to understand the complexity and diversity of tourism geography academic landscape of the Chinese language.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"920cb9ab7a732b1a18d68719419611ef6ff3e831f79416457b45bd38a424533d","category":"Interdisciplinary"}