{"title":"Giro d’Italia 2023 stage 12: A lesson in how to lose a bike race","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-2023-stage-12-a-lesson-in-how-to-lose-a-bike-race","date":1684434403000,"content":"\n      <p><span>They were braking so hard you could hear the squeak of disc rotors in the wet conditions over the TV commentary. Many were gesticulating wildly in anger, screaming at their companions to come through and pull a turn. Others just shook their heads, angry and defeated. If it was frustrating to be a participant in the 30 rider strong breakaway on stage 12 of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, it was hard to watch from the comfort of your sofa, too. This was a clear and unequivocal case of ‘group two syndrome’, cycling’s latest trend that has been seen all too often in racing this season.</span></p>\n<div></div>\n<p><span>It all began with the huge fight for the break at the start of the 176km stage, one that eventually amounted to a large group slipping off the front of the Ineos Grenadiers controlled peloton after less than 20km of racing. This scenario wasn’t surprising for today’s stage which featured terrain that was too difficult for the fast men to go for a bunch sprint, but too easy for the general classification contenders to make any real differences (that comes <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-13-preview\">tomorrow in the mountains</a>.) For those who eventually made that big break, the chance of a Grand Tour stage win was a real possibility: the peloton had no incentive to chase them.</span></p>\n<p><span>There was one thing that scuppered the chances of many, however, and that was the complete and utter lack of cooperation in this front group. Eventual stage winner Nico Denz of Bora-Hansgrohe said it himself in his post race interview: “The collaboration was really, really bad so I just kept going on the front and we had a gap so then I really pushed on.’</span></p>\n<p><span>It was with 90km of the stage remaining that Denz and three other riders (Toms Skujiņš, Trek-Segafredo, Sebastian Berwick, Israel-Premier Tech and Alessandro Tonelli, Green Project-Bardiani CSF-Faizanè) drifted off the front of the breakaway, never to be seen again by the riders who they left in their wake. That was when group two syndrome started. Rather than reacting to the danger of four riders riding away at the front of the race, those who were behind began to look at each other. There were exceptions, like Alberto Bettiol of EF Education-EasyPost and Ilan van Wilder of Soudal-Quick-Step, both of whom made some big efforts to try and limit the gap to the four in front, but they were met with no cohesion from the other riders behind.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-Photography--Giro-d_Italia-2023---Stage-12-06165_1024x1024.jpg?v=1684430299\" alt=\"Stage winner Nico Denz in the breakaway during stage 12 \" /></div>\n<p><span></span><em><span>Stage winner Nico Denz in the breakaway during stage 12 (Image: Zac Williams/SWpix)</span></em></p>\n<p><span>Some had excuses for it: eight of the riders in the second group on the road were teammates of the four riders out front, and then there were others like Jumbo-Visma’s Sepp Kuss, who were instructed to just sit on the back of the group today, saving themselves for important work in the mountains. However, this still left 18 riders in the front group with an incentive to chase, but none of them committed to doing it. While the four in front tapped out a steady rhythm, the group behind stopped and started, squabbling between them, with everyone trying to make it to the finish having done the bare minimum. 18 riders should be able to bring back four, but tactics and politics meant that the gap quickly grew to one minute, then two, then three. By 40km to go, it was clear that there was no way those four riders were going to be brought back into the fold of the chase group.</span></p>\n<p><span>This lack of cohesion has been coined ‘group two syndrome’ in the cycling world as it is seen so often in bike racing. One of the most notable cases of it is in the women’s peloton, commonly when a Team SD Worx rider makes an attack off the front of the bunch and rather than chasing, other riders just look at each other behind hoping someone else will take up responsibility, think of <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/from-time-trialist-to-classics-champion-how-marlen-reusser-soloed-to-victory-in-a-wet-and-wild-edition-of-gent-wevelgem\">Marlen Reusser’s win at Gent-Wevelgem</a>, for example, when she attacked and won solo by almost three minutes.</span></p>\n<p><span>It happens so often, but it never gets any less frustrating. It can leave spectators shouting at their televisions, screaming at riders to react quicker, to make an attack, to get on the wheel in front. In today’s Giro d’Italia stage it left the likes of Bettiol and Van Wilder furious and regretful. Making into that big breakaway of the day should have been a box ticked for riders like them, but the chance of victory slipped out of their grasp before they’d really even had a chance to fight for it.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/0dd9097b-1579-e825-095f-f6348330c961_1024x1024.jpg?v=1684430441\" alt=\"Nico Denz celebrates after winning stage 12 of the Giro d'Italia\" /></div>\n<p><em><span>Nico Denz celebrates after winning stage 12 of the Giro d'Italia (Image: RCS Sport/La Presse</span></em></p>\n<p><span>For the likes of Denz and his breakaway companions, it was a dream scenario. The lack of cohesion in the group behind takes nothing away from the strength and impressive style with which Denz took the stage win. He was one of the last riders to bridge to the original breakaway, he looked to be the first rider to instigate the move with 90km to go, and he fought tooth and nail, through gritted teeth, to stay on the wheel of Skujiņš up and over the Colle Braida, a 10km climb which came just 20km from the finish line. In the end, he outsprinted his breakaway companions seemingly by sheer determination alone, celebrating his win emotionally and passionately in post-race interviews. “I don’t know what to say, this is really big for me and I’m really proud,” he beamed.</span></p>\n<p><span>For those who rolled over the finish line from group two, the reaction was a little more sombre. They will all likely rue the choice they made when they decided not to follow Denz as he made that long range move so far from the finish, and perhaps will constantly replay in their heads the moment that they saw the chance of the stage victory slip out of their grasp. Questions will be asked about if they could have done things differently or what they can learn from today's loss.</span></p>\n<p><span>One of the toughest things in bike racing is that the perfect tactics only come with the gift of hindsight and during the race, decisions have to be made in a split second. Part of what makes this sport so intriguing are the tactical nuances, rivalries and frustrations. It’s such a simple proposition, to set 140 riders off at the same time and the rider who crosses the finish line first is crowned the stage winner, but the reality is far more complicated than that. It can be cruel or frustrating, but it's also what makes the sport of cycling so special.</span></p>\n<p><em><span>Cover image: Zac Williams/SWpix</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"921d7d73537ada445f5548abaa983b79c44fb04d03c57c365ac92fcb1208c945","category":"Cycling"}