{"title":"OpenWrt, now 20 years old, is crafting its own future-proof reference hardware","link":"https://arstechnica.com/?p=1998169","date":1706040693000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/wrt54g_salter.jpeg\" alt=\"Linksys WRT54G\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/wrt54g_salter.jpeg\">Enlarge</a> <span>/</span> Failing an image of the proposed reference hardware by the OpenWrt group, let us gaze upon where this all started: inside a device that tried to quietly use open source software without crediting or releasing it. (credit: Jim Salter)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>OpenWrt, the open source firmware that sprang from Linksys' <a href=\"https://lkml.org/lkml/2003/6/7/164\">use of open source code</a> in its iconic WRT54G router and <a href=\"https://tedium.co/2021/01/13/linksys-wrt54g-router-history/\">subsequent release of its work</a>, is 20 years old this year. To keep the project going, lead developers have <a href=\"https://forum.openwrt.org/t/openwrt-one-celebrating-20-years-of-openwrt/183684\">proposed</a> creating a \"fully upstream supported hardware design,\" one that would prevent the need for handling \"binary blobs\" in modern router hardware and let DIY router enthusiasts forge their own path.</p>\n<p>OpenWRT project members, 13 of which signed off on this hardware, are keeping the \"OpenWrt One\" simple, while including \"some nice features we believe all OpenWrt supported platforms should have,\" including \"almost unbrickable\" low-level firmware, an on-board real-time clock with a battery backup, and USB-PD power. The price should be under $100 and the schematics and code publicly available.</p>\n<p>But OpenWrt will not be producing or selling these boards, \"for a ton of reasons.\" The group is looking to the <a href=\"https://www.banana-pi.org/\">Banana Pi makers</a> to distribute a fitting device, with every device producing a donation to the <a href=\"https://sfconservancy.org/\">Software Freedom Conservancy</a> earmarked for OpenWrt. That money could then be used for hosting expenses, or \"maybe an OpenWrt summit.\"</p></div><p><a href=\"https://arstechnica.com/?p=1998169#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1998169&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"922d9052f5a61a2b10847d7662feb034a4ed3fef7e31d03c72f349c991bafbfa","category":"Tech"}