{"title":"Strava adds Group Challenges and updates mapping","link":"https://www.bikeradar.com/news/strava-group-challenges/","date":1622653206000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Strava_Group-Challenges_01_Hero-6048b9a.jpg?quality=90&amp;resize=620,413\" />                                            <p><a href=\"https://www.bikeradar.com/brand/strava/\" target=\"_blank\">Strava</a> has today announced a slew of new features including Group Challenges and a significant update to its mapping capabilities.</p>\n<p>The first major improvement gives Strava users the tools to create customised goals and challenges for themselves and the Strava community to compete in.</p>\n<p>On top of this, Strava has reworked its mapping tools. Combining its segments and routing functions into one tool, the new Maps feature makes use of Strava user data to offer personalised segment suggestions and improve route planning.</p>\n<p>Said to be the app’s largest update of the year, all of these changes are live now and can be accessed via the Strava app.</p>\n<h2>Strava Group Challenges</h2>\n<p>A highly anticipated feature, Group Challenges provides the tools for individual Strava users to create custom goals and to invite up to 24 other Strava users (for a total of 25 athletes) to compete in private challenges.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Individual Strava users can now create custom challenges to compete in.</span></figcaption><span> <i>Strava</i></span></div>\n<p>Meghan Laffey, chief product and experience officer at Strava, says: “When our athletes join a challenge, we know they are more than twice as active as others who don’t”, she also suggests that this latest feature is “democratising peer to peer competition.”</p>\n<p>Strava users can create time-limited group challenges from the following three options:</p>\n<ul><li><strong>Most Activity:</strong> A goal can be set for time, distance or elevation gain. The goal establishes a target for athletes to reach and the leaderboard ranks users by their overall activity</li>\n<li><strong>Fastest Effort:</strong> Targeted primarily at runners and wheelchair users, athletes are challenged to achieve the fastest average pace across a specific distance. The challenge creator sets the distance and the leaderboard will rank participants by their average pace</li>\n<li><strong>Longest Single Activity:</strong> As the name suggests, this is simply a challenge to record the longest distance in a single activity. It is available across all Strava sports that support distance as a measure. Challenge creators can set a minimum distance to help athletes gauge challenge difficulty.</li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Group challenges can be sport-specific or encompass a range of activities, and users can pick from three different challenge types.</span></figcaption><span> <i>Strava</i></span></div>\n<p>The Group Challenges feature is available for non-subscribers to test out, but they can only create or participate in three group challenges before being asked to subscribe.</p>\n<p>Subscribers to <a href=\"https://www.bikeradar.com/features/routes-and-rides/is-strava-premium-worth-the-premium/\">Strava’s premium service</a> face no such limits.</p>\n<h2>Strava Maps</h2>\n<p>In addition to the Group Challenges changes, Strava has announced it is “fundamentally reshaping Maps, with all things segments and routes now in one place.”</p>\n<p>Key to this overhaul is segment suggestions – personalised segment recommendations to help Strava users plan their runs or rides.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Strava’s mapping function has also seen a large update, with segments and routes now combined into one tool.</span></figcaption><span> <i>Strava</i></span></div>\n<p>In a similar manner to the way <a href=\"https://www.bikeradar.com/brand/komoot/\" target=\"_blank\">Komoot</a> – another mapping and route planning <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\" target=\"_blank\">cycling app</a> – works, the segment suggestions tool leverages “the collective knowledge of Strava’s community”.</p>\n<p>The upshot is that a map on Strava will now be populated with recommended segments based on six personalised categories:</p>\n<ul><li><strong>Visit Popular Spots:</strong> This shows you the most popular segments in any given area</li>\n<li><strong>Discover New Places:</strong> Similar to the above, but tailored towards popular segments that you haven’t completed yet</li>\n<li><strong>Break Your Record:</strong> Segments you’ve completed before but you’re closing in on your personal record</li>\n<li><strong>Climb the Leaderboard:</strong> Segments where you’re close to getting a Top 10 spot on the leaderboard</li>\n<li><strong>Go for a Workout:</strong> Helps to find nearby tracks, areas for interval training and other areas where the Strava community trains</li>\n<li><strong>Become a Legend:</strong> Segments where you’re close to becoming the Strava <a href=\"https://www.bikeradar.com/news/strava-local-legend/\" target=\"_blank\">local legend</a>.</li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Strava will now use rider data to suggest popular segments you might want to ride.</span></figcaption><span> <i>Strava</i></span></div>\n<p>Similar to the Group Challenges feature, non-subscribers will be able to trial all of these new features, such as viewing the most popular segments in a given area, before subscribing.</p>","author":"Simon Bromley","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"922eacbe0da9cf8e6366b8460a9954a8770d5e3104239825b2d8563feb768b8c","category":"Cycling"}