{"title":"ระบบป้องกันหารบัญชีได้ผล! Netflix มีจำนวนสมาชิกใหม่เพิ่มขึ้น 5.9 ล้านบัญชี ในไตรมาสที่ผ่านมา","link":"https://www.blognone.com/node/134916","date":1689813961000,"content":"<div><div><div><p>Netflix รายงานผลประกอบการของไตรมาสที่ 2 ปี 2023 โดยมีประเด็นสำคัญในไตรมาสคือการ<a href=\"https://www.blognone.com/node/133979\">เปิดระบบป้องกันการหารบัญชี</a>เพิ่มเติม มากกว่า 100 ประเทศ รวมทั้งประเทศไทย ผลลัพธ์นั้น Netflix บอกว่ารายได้แยกตามภูมิภาคต่างเพิ่มสูงขึ้น มากกว่าก่อนเปิดระบบป้องกันนี้ จำนวนสมาชิกก็เพิ่มขึ้นถึง 5.89 ล้านบัญชี ทำให้จำนวนสมาชิกรวมมี 238.39 ล้านบัญชี แนวโน้มที่ดีนี้ทำให้ Netflix บอกว่าจะเปิดระบบในประเทศที่เหลือทั้งหมด</p>\n<p>ตัวเลขทางการเงิน Netflix มีรายได้ 8,187 ล้านดอลลาร์ เพิ่มขึ้น 2.7% เมื่อเทียบกับไตรมาสเดียวกันในปีก่อน กำไรสุทธิ 1,488 ล้านดอลลาร์ ซึ่งเป็นผลจากทั้งระบบป้องกันหารบัญชี และรายได้ใหม่จากแพ็คเกจแบบมีโฆษณา นอกจากนี้ Netflix ยังปรับเพิ่มประมาณการกระแสเงินสดอิสระในปีนี้ จากเดิม 3.5 พันล้านดอลลาร์ เป็น 5 พันล้านดอลลาร์ สาเหตุจากการประท้วงหยุดงานของ<a href=\"https://www.blognone.com/node/134840\">สมาคมนักแสดง</a>และสมาคมผู้เขียนบทในฮอลลีวูด ทำให้โครงการถ่ายทำต้องเลื่อนออกไป</p>\n<p>คอนเทนต์เด่นในไตรมาสที่ผ่านมาได้แก่ Beef, Love is Blind ซีซัน 4, Queen Charlotte: A Bridgerton Story และ The Night Agent นอกจากนี้ Netflix ยังเห็นแนวโน้มน่าสนใจคือคอนเทนต์ที่ไม่ใช่ภาษาอังกฤษจากหลากหลายประเทศ และหลากหลายประเภทเนื้อหา มีความนิยมในการรับชมจากคนดูทั่วโลกมากขึ้น ซึ่งเดิมมักนิยมรับชมเฉพาะประเทศตนเอง ตัวอย่างเช่น Physical 100 (เกาหลี), The Glory (เกาหลี), Alice in Borderland (ญี่ปุ่น), AKA (ฝรั่งเศส), Marked Heart (โคลัมเบีย) และ <a href=\"https://www.blognone.com/node/133481\">Hunger ของประเทศไทย</a></p>\n<p>ที่มา: <a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q2/FINAL-Q2-23-Shareholder-Letter.pdf\">Netflix</a> (pdf)</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/600d75e50e1dcdeefe969a88ea5aa7b4.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9232e0a779abc02e6cecc3f3496fe7711a2c0f734be61df2c8d022b8d4b1ec5b","category":"Thai"}