{"title":"Metformin and chidamide synergistically suppress multiple myeloma progression and enhance lenalidomide/bortezomib sensitivity","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24093?af=R","date":1709898124000,"content":"<h2>Abstract</h2>\n<p>Multiple myeloma (MM) is a common hematological malignancy, and patients with MM are recommended to take immunomodulatory drugs such as lenalidomide along with proteasome inhibitors such as bortezomib to extend survival. However, drug resistance influences the efficacy of treatment for MM. In our study, we found that metformin and chidamide both suppressed MM cell growth in a concentration- and time-dependent way (<i>p</i> &lt; .001). Moreover, combined therapy with metformin and chidamide exhibited enhanced inhibition of the growth of MM cells compared with monotherapy (<i>p</i> &lt; .05). Additionally, the triple-drug combination of metformin and chidamide with lenalidomide or bortezomib was used to stimulate the MM cells, and the results revealed that metformin and chidamide treatment sensitized MM cells to lenalidomide and bortezomib. As a result, the apoptosis (<i>p</i> &lt; .001) together with cell cycle arrest at G0/G1 phase (<i>p</i> &lt; .05) was stimulated by lenalidomide and bortezomib, and showed significant elevation in the triple-drug combination group compared with the lenalidomide or bortezomib treatment alone group (<i>p</i> &lt; .05). Furthermore, the impacts of different drugs on glycolysis in MM cells were examined. We found that metformin and chidamide combined treatment significantly promoted glucose uptake and reduced energy production in MM cells treated with lenalidomide and bortezomib (<i>p</i> &lt; .001), suggesting that metformin and chidamide affected glycolysis in MM cells and enhanced the sensitivity of lenalidomide and bortezomib in MM by regulating glucose metabolism. In conclusion, metformin and chidamide synergistically hindered MM cell growth and sensitized cells to lenalidomide/bortezomib. The findings of this study might provide novel clues to improve MM therapy.</p>","author":"Jianping Mao, \nRan Chen, \nLianguo Xue, \nYuanxin Zhu, \nLidong Zhao, \nJuan Wang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"923aafe2589f020074c0bac64d1f611c89ce6ee4ed75119892be52a7cadc65ac","category":"Environment"}