{"title":"EVgo knows that DC fast charging is still rough, so it’s fixing more stations","link":"https://arstechnica.com/?p=1971155","date":1695751722000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/evgo-Large-800x533.jpeg\" alt=\"Man showing his son the EVgo app while charging a car\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/evgo-Large.jpeg\">Enlarge</a> <span>/</span> If my dad had been able to show me the intricate dance between smartphone app, car, cable, and station, perhaps my first outing wouldn't have been quite so confusing. (credit: EVgo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>EVgo, one of the nation's largest DC fast charging providers, seems to be coming around to the idea that while having more chargers would be nice, having reliably functioning chargers is more important at the moment. So it's doing something that would be odd for most other companies and announcing its progress in fixing and upgrading its network.</p>\n<p>As part of \"<a href=\"https://www.evgo.com/press-release/evgo-advances-network-enhancements-through-evgo-renewtm-program-releases-best-practices-to-promote-greater-industry-wide-charger-reliability/\">EVgo ReNew</a>,\" the company's plan focuses on \"overall network performance and the holistic customer experience.\" EVgo says it \"upgraded, replaced, or decommissioned\" charging gear at 120 of its more than 850 stations. It has also brought at least one 350 kW charger to nearly all its stations, claims to have cut its average station repair time in half over the last 12 months, and improved its repair parts inventory and customer service staffing. And EVgo says it will track \"One &amp; Done\" success rates, measuring how many people are able to initiate a charging session on their first attempt.</p>\n<p>EV charging reliability has been an issue for a few years now. It's something <a href=\"https://arstechnica.com/cars/2022/07/electric-cars-are-doomed-if-fast-charger-reliability-doesnt-get-better/\">we wrote (warned, really) about in 2022</a>, and <a href=\"https://arstechnica.com/cars/2023/08/public-ev-charging-keeps-getting-worse-according-to-new-study/\">a JD Power study on the EV public charging experience last month</a> showed it's not getting better. EVgo rated a 569 out of 1,000 in that study, roughly midway between ChargePoint at 606 and Electrify America at 538, with all of them dropping from 2022. Tesla, meanwhile, with its nationwide network of Supercharger spots with first-mover placement advantage, rated 739 out of 1,000, unchanged from 2022.</p></div><p><a href=\"https://arstechnica.com/?p=1971155#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1971155&amp;comments=1\">Comments</a></p>","author":"Kevin Purdy","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"92406ad6d2c84a2d51bbde1c3517b0c2a58fc0a87ce67a159164afbb4e3177dd","category":"Tech"}