{"title":"ผู้เชี่ยวชาญเผยสาเหตุว่าทำไมใส่ Apple Vision Pro แล้วไม่เวียนหัวเหมือนแว่น VR อื่น","link":"https://www.blognone.com/node/134811","date":1689221302000,"content":"<div><div><div><p>David Reid ศาสตราจารย์ด้าน AI และ Spatial Computing ของมหาวิทยาลัย Liverpool Hope อธิบายถึงเหตุผลที่ใส่ <a href=\"https://www.blognone.com/node/134171\">Apple Vision Pro</a> แล้วไม่เวียนหัวเหมือนอุปกรณ์ VR อื่น เนื่องจาก Apple พยายามแก้ไขปัญหาโดยการทำให้ภาพที่เห็นดูเป็นธรรมชาติมากขึ้นและปรับระยะโฟกัสสายตา</p>\n<p>ปัญหาที่พบบ่อยที่สุดในการใส่แว่น VR คือ อาการเวียนหัว จากความขัดแย้งระหว่างจุดรวมสายตาและการปรับโฟกัส Vergence-Accommodation Conflict (VAC) เมื่อจุดรวมสายตาและจุดโฟกัสไม่ตรงกันระหว่างระยะทางของวัตถุ 3D เสมือนจริงกับระยะโฟกัสที่วัตถุนั้น จะส่งผลให้รู้สึกไม่สบายตา, ปวดตา และเหนื่อยล้าจากการใช้แว่น VR</p>\n<p>Reid อธิบายกับทาง BBC ว่า Apple แก้ไขโดยการทำภาพวัตถุเสมือนให้รู้สึกสมจริงมากขึ้น พยายามลดการเหนื่อยจากการเคลื่อนไหวของภาพให้ได้มากที่สุด โดยเพิ่มความเร็วของภาพให้เหมือนจริงและใช้จอแสดงผลคุณภาพสูง Micro OLED สองจอที่มีพิกเซลมากกว่าภาพ 4K ของทีวี อัตราการรีเฟรชสูงกว่าและชิปแบบ Custom สำหรับ Virtual Reality และ Augmented Reality ที่เรียกว่า R1 ยังบอกอีกว่าชิปนี้สามารถประมวลผลอินพุตจากกล้อง, เซนเซอร์, ไมโครโฟน, สตรีมรูปภาพไปยังจอแสดงผลภายใน 12 มิลลิวินาที</p>\n<p>ฟีเจอร์ทั้งหมดนี้เกิดจากการลงทุนที่มากขึ้นในเทคโนโลยีจอแสดงผล ถือเป็นการยกระดับ Apple Vision Pro ให้แตกต่างจากแบรนด์อื่น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/1beb56a10e3bec521d2369ec9518f666.jpg\" alt /></p>\n<p>ที่มา: <a href=\"https://bgr.com/tech/how-apple-vision-pro-will-prevent-motion-sickness/\">BGR</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple-vision-pro\">Apple Vision Pro</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/oled\">OLED</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9245c0ecc93fcb30603e17b6db8bab3256a60b952ceb75af616f8cc0c82c2eb3","category":"Thai"}