{"title":"UK Supreme Court says Uber drivers are not independent contractors","link":"https://arstechnica.com/?p=1743797","date":1613754894000,"content":"<div id=\"rss-wrap\">\n<figure class=\"intro-image intro-left\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1184544393-800x534.jpg\" alt=\"UK Supreme Court says Uber drivers are not independent contractors\"><p class=\"caption\" style=\"font-size:0.8em\"><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/GettyImages-1184544393.jpg\" class=\"enlarge-link\" data-height=\"4912\" data-width=\"7360\">Enlarge</a> (credit: Peter Summers/Getty Images)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The Supreme Court of the United Kingdom has ruled that Uber drivers are legally workers, not self-employed contractors as Uber has argued in courts around the world. The ruling means that drivers in Britain and Northern Ireland are eligible for additional benefits and protections, including a minimum wage.</p>\n<p>Uber claims that it merely acts as a technology provider and broker between independent drivers and their customers—much as eBay facilitates sales between buyers and sellers. In Uber's view, this means that it doesn't owe its drivers benefits like unemployment insurance, doesn't need to reimburse drivers for their costs, and isn't bound by minimum wage and overtime rules. Uber emphasizes that its drivers are free to decide when, where, and how much they work.</p>\n<p>But critics point out that Uber exerts a lot more control over its drivers—and over the driver-passenger relationship—than a conventional platform like eBay or Airbnb. Uber sets fares, collects payments from customers, deducts its own fee, and remits the remainder to the driver. It requires drivers to accept a large majority of the rides they are offered. It handles customer complaints and kicks drivers off the platform if their average rating falls too low.</p></div><p><a href=\"https://arstechnica.com/?p=1743797#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1743797&comments=1\">Comments</a></p>","author":"Timothy B. Lee","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"924918d21a353b6e97951bb4c7d32d6d0098ecefec989a5f9ba1185a6e759320","category":"Tech"}