{"title":"Supporting patient self-management: A cross-sectional and prospective cohort study investigating Patient Activation Measure (PAM) and Clinician Support for PAM scores as part of a multi-centre haemodialysis breakthrough series collaborative","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0303299","date":1716386400000,"content":"<p>by Maria Keriakos, Sonia Lee, Catherine Stannard, Steven Ariss, Louese Dunn, Martin Wilkie, James Fotheringham</p>\r\nBackground <p>Patient self-management, measured by the Patient Activation Measure (PAM), is associated with reduced healthcare utilisation and better health-related quality of life. Self-management in haemodialysis (HD) is challenging and may require support from clinicians with positive attitudes towards self-management, measured by the Clinician Support for PAM (CSPAM).</p> Objectives <p>To assess whether kidney staff CSPAM scores are: 1) associated with their centre’s patient PAM scores and 2) modifiable through staff coaching.</p> Methods <p>Baseline PAM and CSPAM and six-month CSPAM were collected from HD patients and kidney staff respectively in seven UK kidney centres as part of a six-month breakthrough series collaborative (BTSC), which trained kidney staff in supporting patient independence with HD tasks. Firstly, multivariable linear regression analyses adjusted for patient characteristics were used to test the baseline association between centre-level staff CSPAM scores and patient PAM scores. Secondly, paired univariate and unpaired multivariable linear regression analyses were conducted to compare staff CSPAM scores at baseline and six months.</p> Results <p>236 PAM questionnaires (mean score = 55.5) and 89 CSPAM questionnaires (median score = 72.6) were analysed at baseline. There was no significant association between centre-level mean CSPAM scores and PAM scores in univariate analyses (P = 0.321). After adjusting for patient-level characteristics, increasing centre-level mean CSPAM score by 1 point resulted in a non-significant 0.3-point increase in PAM score (0.328 (95% CI: -0.157 to 0.812; P = 0.184). Paired (n = 37) and unpaired (n = 174) staff analyses showed a non-significant change in CSPAM scores following the BTSC intervention (mean change in CSPAM score in unpaired analysis = 1.339 (95% CI: -1.945 to 4.623; P = 0.422).</p> Conclusions <p>Lack of a significant: 1) association between CSPAM and PAM scores and 2) change in CSPAM scores suggest that modifying staff beliefs alone is less likely to influence patient self-management, requiring co-production between patients and staff.</p>","author":"Maria Keriakos","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"924c31249b52a3b239494ad3c95034e5a8bbbf8b1971b72b7719e06782c75296","category":"Interdisciplinary"}