{"title":"Clicks is a $139 iPhone case for people who hate touchscreen typing","link":"https://arstechnica.com/?p=1993862","date":1704478094000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/clicks-keyboard.jpg\" alt=\"Clicks keyboard\" />\n      <p>There's an app for the keyboard promising new features, but it's not mandatory for the keyboard to work. (credit: Clicks Technology)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>I used to be a speed demon on phone keyboards. Similar to when I use a <a href=\"https://arstechnica.com/gadgets/2022/03/the-ars-technica-guide-to-mechanical-keyboards/\">mechanical keyboard</a>, I could type with so much ease that during their early days of text messaging, people in my household would ask me to write out their longer messages. Those days of carefree cell phone typing hit a rut when I got my first iPhone.</p>\n<p>Now, I can't start without first looking at my touchscreen keyboard. And I almost always make at least one typo when writing long texts, emails, or documents. That's why I'm intrigued by the latest attempt to bring old-school physical keyboards to iPhones.</p>\n<h2>A snap-on keyboard for the iPhone</h2>\n<p>On Thursday, Clicks Technology unveiled Clicks, a keyboard available for the <a href=\"https://arstechnica.com/gadgets/2022/09/iphone-14-and-14-pro-review-a-picture-is-worth-a-thousand-dollars/\">iPhone 14 Pro</a>, <a href=\"https://arstechnica.com/gadgets/2023/09/iphone-15-and-15-pro-review-the-final-form/\">iPhone 15 Pro</a>, and iPhone 15 Pro Max that snaps to the phone like a case. But instead of adding protection, it adds a physical keyboard. Each key boasts 0.22 mm of travel, Jeff Gadway, SVP of product marketing at Clicks, told Ars via email. That seems like miles compared to the flat nature of touchscreens.</p></div><p><a href=\"https://arstechnica.com/?p=1993862#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993862&amp;comments=1\">Comments</a></p>","author":"Scharon Harding","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"924d525d7a9ad67120cfef1bd9bb3a4dffbfdd6ce8377406a867fec5f55fc965","category":"Tech"}