{"title":"Megmeister Ultrafris Pro Cool jersey review","link":"https://www.cyclist.co.uk/reviews/10212/megmeister-ultrafris-pro-cool-jersey-review","date":1635246507000,"content":"<span>\n      <span><a href=\"/authors/paul-norman\">Paul Norman</a></span>\n  </span><div>  \n  <div>      <div><span>Monday, November 1, 2021 - 12:30</span></div>    </div></div><p>\nNice soft fabric but the claimed cooling effect is unconvincing</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/10/megmeister_ultrafris_jersey_1.jpg?itok=XGXPOfq8\" />  </div>\n<div>  \n  <div>      <div><div>  \n  <div>\n    <div>\n      <div></div>\n    </div>\n  </div>\n      <span>\n      <strong>4.0</strong>\n      / <span>5</span>\n    </span>\n  \n</div>\n</div>    </div></div><div>  \n  <div>      <div>£99.95</div>    </div></div><div>\n      <p> The Megmeister Ultrafis Pro Cool jersey's 'unique' cooling properties aren't as obvious as the marketing claims suggest, but it does a good job nonetheless and represents reasonable value for money.</p>\n<p>Megmeister is a Dutch brand that looks to provide a technical edge to its clothing designs. In the case of the Ultrafris jersey, it claims that the fabric’s unique property is the ability to wick sweat away from the body and promote cooling on hot rides. Don’t all technical jerseys do that?</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/10/megmeister_ultrafris_jersey_2.jpg\" />  </div>\n</div>\n<p>The Ultrafris is made from a fabric that’s a bit silkier in feel than most cycling jerseys, with a soft, almost brushed feel to its outside surface, whereas the inner surface is coarser.</p>\n<p>The fluffier outer side might possibly provide a bit more surface area for evaporation, but I’m not convinced it does more than a more open weave to help you keep your cool. It does feel nice though.</p>\n<p>At the sides of the jersey are mesh inserts made of black fabric that provide a bit more airflow to the jersey’s interior – again that’s not a unique feature of the Ultrafris.</p>\n<p> </p>\n<p>I’ve got a couple of Megmeister base layers that I use regularly and like. They’re very stretchy, close-fitting and have differential thicknesses, for example under the armpits, to help balance out body heat.</p>\n<p>In contrast, the Megmeister Ultrafris jersey looks a lot less sophisticated, with the main panels uniform in texture.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/10/megmeister_ultrafris_jersey_3.jpg\" />  </div>\n</div>\n<h2>Megmeister Ultrafis Pro Cool jersey fit</h2>\n<p>Fit isn’t that close either, so any sweat you produce isn’t necessarily going to find its way into the fabric very easily. You might want to size down if you’re looking to take advantage of the purported cooling properties. Megmeister recommends wearing the jersey without a base layer.</p>\n<p>If you’re wearing the Ultrafris for summer rides, you’ll like the SPF50 UV protection. That’s an actual advantage over a more open weave summer jersey, some of which are pretty see-through, necessitating sunscreen underneath if you don’t want to burn.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/9790/best-of-the-best-cyclist-s-favourite-gravel-bikes\">Best of the best: Cyclist’s favourite gravel bikes</a></div>      <div><a href=\"/in-depth/9961/sram-zipp-and-rockshox-unite-to-launch-xplr-gravel-component-family\">Sram, Zipp, and Rockshox unite to launch XPLR gravel component family </a></div>      <div><a href=\"/reviews/8350/giant-revolt-0-gravel-bike-review\">Giant Revolt 0 gravel bike review</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 120: on sale now!</a></div>    </div></div><p>\nMegmeister also claims antibacterial properties. I was more convinced by these than the cooling claims. Even after quite a long, hard, warm ride the Ultrfris was noticeably less smelly than the majority of jerseys, so I allowed it to fester in the washing pile that bit longer. I reckon it would be a good bet for multi-day rides (e.g. <a href=\"https://www.cyclist.co.uk/in-depth/2879/an-introduction-to-bikepacking\" target=\"_blank\">bikepacking</a>) for the same reason.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/10/megmeister_ultrafris_jersey_4.jpg\" />  </div>\n</div>\n<p>You get the usual collection of pockets out back, with a fourth zipped pocket as a bonus. Despite the loose-ish fit, they weren’t prone to sag or to drift to the side, which was a bonus. They’re capacious enough for all the usual bits and bobs too, without needing to resort to a saddle pack.</p>\n<p>There’s a nice large Megmeister logo sewn onto the centre rear, but no reflectives. With Dutch road infrastructure doing a great job of segregating cycle and motor traffic, being seen by drivers is much less of an issue in the Netherlands than it is in the UK. The fairly muted palette available across the four colour options bears this out. </p>\n<p>So if you’re after a comfortable summer jersey with good UV protection the Megmeister Ultrafris Pro Cool bears consideration alongside other options – just don’t expect it to keep you significantly cooler though.</p>\n<p><a href=\"https://www.cyclist.co.uk/cyclist-reviews-policy\" target=\"_blank\"><em>All reviews are fully independent and no payments have been made by companies featured in reviews</em></a> </p>\n  </div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"92571ad929eb7cb7135bb685d0d4e8fab6c54253779d8e0dc44264cda79234b6","category":"Cycling"}