{"title":"Plasma Gasification of a Simulated Low-Level Radioactive Waste: Co, Cs, Sr, and Ce Retention Efficiency","link":"https://www.preprints.org/manuscript/202407.2161/v1","date":1721987791000,"content":"Thermal plasma is a versatile technology that can be used to treat various types of wastes, including vegetal and mineral oils, solvents, plastics, papers and cardboard, glasses, bricks and rocks, metals, clothes, and mixtures of these materials. In this study, we utilized a commercial plasma cutter as a thermal plasma source to decrease the volume of a simulated low-level radioactive mixed solid waste. The simulated waste included papers, plastics, clothes, gloves, metals and stable Co, Cs, Sr, and Ce additives as surrogates of 60Co, 137Cs, 90Sr, and 144Ce, the latter typical contaminants in nuclear LLW. As a result of the process two products were obtained, a solid phase in which we focused this work and a gaseous phase. To retain as much as possible surrogates in the solid final phase, crushed glass from broken bottles was included as a vitrification additive to the original waste. After undergoing heat treatment, a dense vitreous slag was produced and ashes. The process resulted in a volume reduction of 70%, indicating the successful gasification of organic excess materials. The surrogate elements were retained in the process and were found in the ashes composition: Co (3.4% w/w), Cs (37.7% w/w), Ce (0.6% w/w) and in the glass matrix composition of Co, Cs, Sr and Ce: 72.4 ± 14.7, 32 ± 18.2, 125.3 ± 31.6, 80 ± 13.1 % w/w respectively. For the actual experimental conditions, retention efficiencies were estimated for Cobalt (Co) at 72.4 ± 14.7%, Cerium (Ce) at 80 ± 13.1%, Strontium (Sr) at 125.3 ± 31.6%, and notably Cesium (Cs) at 32 ± 18.2%.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"926d7b94fa4ff3ba1a2a19caaf6e778a548a20585a30a02ad666e31d5cf99665","category":"Interdisciplinary"}