{"title":"Tour de France Femmes avec Zwift stage six preview - the final sprint opportunity","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-avec-zwift-stage-six-preview","date":1690474139000,"content":"\n      <p><b>Distance:</b><span> 122km<br /></span><b>Start location: </b><span>Albi<br /></span><b>Finish location: </b><span>Blagnac<br /></span><b>Stage type: </b><span>Flat<br /></span><b>Start time: </b><span>14:40 CEST <br /></span><b>Finish time (approx): </b><span>17:20 CEST</span></p>\n<p><span>The department in which Blagnac sits is the birthplace of a number of riders, including last year’s <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> rider Valentine Fortin, a rider of the Cofidis team and GCS Blagnac. Overall she placed 88th in the inaugural edition of the race. Fortin is not on the start list for this year’s race, which goes through her home region, but a number of French riders will be waving the blue, white and red flag for her.</span></p>\n<p>A new town for the women’s peloton, the men’s Tour de France has visited Blagnac, however, this town has mainly been used as a launchpad for stages that have headed high into the mountains. The last depart from Blagnac in the Tour de France was when Michael Matthews won the stage that ended in Rodez, the town in which the women’s peloton finished on stage four. </p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_six_ed4202fc-7e62-47c7-88d8-4cebcf13582a.jpg?v=1690035771\" alt /></span></p>\n<p><i><span>Stage six profile secured via ASO</span></i></p>\n<p><span>The stage favoures towards a sprint finish considering the elevation profile. There are still three categorised climbs throughout the day at 30km, 51km, 58km, and 81km ridden. But once through those, there is nothing to slow down the fast finishers in the bunch, who will be looking to take the stage in Blagnac. And they will be able to really showcase their pure speed, with a completely flat, straight final kilometre to the finish line. <br /></span></p>\n<h3><strong>Contenders</strong></h3>\n<p>Although stage six of the Tour de France Femmes looks ideal for a sprint finish, the 2023 race has been anything but predictable. The 'flat' route of stage five looked set for a sprint, but in the end Ricarda Bauernfeind (Canyon-SRAM) was able to ride solo to victory from the break in the hills of that particular parcours.</p>\n<p>With the abandonment of Lorena Wiebes on Thursday there's also one less team with incentive to keep things together for the sprint, with SD Worx happy to stay focused on Demi Vollering's GC bid, which comes into full focus on the weekend.</p>\n<p>If a complete peloton does make it the finish, the overall leader <strong>Lotte Kopecky</strong> looks like a strong contender to win a sprint. A versatile rider, she'll almost certainly stay in touch with the main group on a route of this severity and has looked capable of winning a bunch gallop for the line.</p>\n<p><strong>Marianne Vos</strong> (Jumbo-Visma) has one more chance for a victory in this Tour de France Femmes, and a fourth and second place already shows she'll be in the mix if it does boil down to a sprint. Her team hasn't looked like controlling things so far however, so she may have to wait and gamble that someone else will bring things back together to give her a chance.</p>\n<p><strong>Charlotte Kool</strong> (DSM-Firmenich) does have a strong team built to help her in the sprint, but they too may need assistance to deny a group of breakaway riders. On paper, she is now the strongest sprinter in the bunch after Wiebes withdrawal, and the straight, flat sprint will favour her.</p>\n<p><strong>Elisa Balsamo</strong> (Lidl-Trek) managed to get involved in the one sprint finish we have had in this race on stage three, finishing fifth, but she remains an outside shot give the field the remains here. Her Italian compatriot <strong>Chiara Consonni</strong> (UAE Team ADQ) seems like a safer bet, and could really contend with Vos, Kopecky, and Kool if she times it well.</p>\n<p><strong>Alex Manly</strong> (Jayco-Alula) hasn't won a sprint since the Tour Down Under in January but could be a contender, as could <strong>Julie De Wilde</strong> (Fenix-Deceuninck).</p>\n<h3><strong>Prediction </strong></h3>\nWe think stage six will end in a sprint and Marianne Vos will score her third career Tour de France stage win.\n<p> </p>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"927067aa9e0b390e1236777338ae5781809f58ebc7ed97ac5c72da31f398667a","category":"Cycling"}