{"title":"Parasite transmission stage abundance varies in lakes over time and space","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12657?af=R","date":1723619307000,"content":"<h2>Abstract</h2>\n<p>Environmentally transmitted parasites produce transmission stages that can remain viable and infective for extended periods of time in the environment where susceptible hosts may encounter them. Although many parasites have this mode of transmission, the abundance and distribution of environmental transmission stages have largely been overlooked, especially in aquatic habitats. Without empirical data to characterize spatial and temporal dynamics of parasite transmission stages in the environment, we might make incorrect assumptions about host–parasite contact rates. For aquatic environments, seasonal habitat structure driven by thermal stratification has been hypothesized to affect the patchiness of transmission stages within the water column, leading to uneven exposure risk to hosts. In this study, we quantified transmission stage concentrations of five common parasites of <i>Daphnia</i> spp. and <i>Ceriodaphnia dubia</i> at every meter of the water column at the deep basin of six lakes in southeastern Michigan every 2 weeks from June to November 2021. We found that transmission stage concentration varied by orders of magnitude over time and with depth. We investigated several possible drivers of these spatial and temporal patterns. For instance, our results suggest that greater mixing depth decreased transmission stage vertical patchiness within the water column of lakes with lower Fee's <i>p</i> values. However, horizontal spore patchiness across a lake was not correlated with the nearshore–offshore gradient of our study lakes. Overall, the results of our study show that parasite transmission stage concentrations have spatial and temporal dynamics that could affect disease dynamics within highly structured aquatic environments.</p>","author":"Elizabeth S. Davenport, \nMarcin K. Dziuba, \nLogan E. Jacobson, \nSiobhan K. Calhoun, \nKira J. Monell, \nMeghan A. Duffy","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"9276f4c3a126445bbb737a6d89e278ffaad4a6d1c315c6459d48d3933da68220","category":"Environment"}