{"title":"Polyploidy and hybridization in the Mediterranean: unravelling the evolutionary history of Centaurium (Gentianaceae)","link":"https://academic.oup.com/aob/article/134/2/247/7660149?rss=1","date":1714435200000,"content":"<span><div>Abstract</div><div>Background and Aims</div>Polyploidy is considered one of the main mechanisms of plant evolution and speciation. In the Mediterranean Basin, polyploidy has contributed to making this region a biodiversity hotspot, along with its geological and climatic history and other ecological and biogeographical factors. The Mediterranean genus <span>Centaurium</span> (Gentianaceae) comprises ~25 species, of which 60 % are polyploids, including tetraploids and hexaploids. To date, the evolutionary history of centauries has been studied using Sanger sequencing phylogenies, which have been insufficient to fully understand the phylogenetic relationships in this lineage. The goal of this study is to gain a better understanding of the evolutionary history of <span>Centaurium</span> by exploring the mechanisms that have driven its diversification, specifically hybridization and polyploidy. We aim to identify the parentage of hybrid species, at the species or clade level, as well as assessing whether morphological traits are associated with particular ploidy levels.<div>Methods</div>We sequenced RADseq markers from 42 samples of 28 <span>Centaurium</span> taxa, and performed phylogenomic analyses using maximum likelihood, summary coalescent SVDquartets and Neighbor-Net approaches. To identify hybrid taxa, we used PhyloNetworks and the fastSTRUCTURE algorithm. To infer the putative parental species of the allopolyploids, we employed genomic analyses (SNIPloid). The association between different traits and particular ploidy levels was explored with non-metric multidimensional scaling.<div>Key Results</div>Our phylogenetic analyses confirmed the long-suspected occurrence of recurrent hybridization. The allopolyploid origin of the tetraploid <span>C. serpentinicola</span> and the hexaploids <span>C. mairei</span>, <span>C. malzacianum</span> and <span>C. centaurioides</span> was also confirmed, unlike that of <span>C. discolor</span>. We inferred additional signatures of hybridization events within the genus and identified morphological traits differentially distributed in different ploidy levels.<div>Conclusions</div>This study highlights the important role that hybridization has played in the evolution of a Mediterranean genus such as <span>Centaurium</span>, leading to a polyploid complex, which facilitated its diversification and may exemplify that of other Mediterranean groups.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"928a8ac028a51ff786fd0e1f6bb570100a290396d59e7ff475cee2581a17f3d8","category":"Environment"}