{"title":"Peter Sagan: A New Chapter with Team TotalEnergies Awaits","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/peter-sagan-a-new-chapter-with-totalenergies-awaits","date":1633625831000,"content":"\n      <p>Paris-Roubaix's velodrome is a poignant marker for every rider that finishes the Hell of the North. For Peter Sagan, this year, it marked the conclusion to his five-year spell with Bora-Hansgrohe. The Slovak heads to French outfit Team TotalEnergies in 2022 on a two-year deal.</p>\n<p><span>However, Sagan isn’t the winning machine he once was. He has earned four victories at WorldTour level over the past two seasons. It’s certainly not a bad return, but it’s not quite the seventeen WorldTour wins he picked up over his first two seasons with the team.</span></p>\n<p><span>As Sagan heads to pastures new, we reflect on his spell with Bora-Hansgrohe and contemplate what lies ahead for him and his new team.</span></p>\n<div></div>\n<p><span>The 2021 edition of Paris-Roubaix was the first wet edition in almost twenty years.</span><span> Sagan spoke about the race, which</span><span> he won in 2018, prior to the start. “</span><span>I actually have a love-hate relationship with the race. If you are lucky on the day then Roubaix is a great race, but if you are unlucky Roubaix can be a very long and terrible race</span><span>.”</span></p>\n<p><span>Unfortunately for Sagan, it was the latter this year. A crash with 136km remaining put pay to any chances he had of winning for a second time. He rolled across the finish line in 57th place, over twelve minutes down. <span>A subdued conclusion to his time with Bora-Hansgrohe, but it doesn't take away from what has</span></span><span><span> been one of the best signings in recent years.</span></span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW3_2401-min_1024x1024.jpg?v=1633613104\" />Image credit: </span></i><i><span>Alex Whitehead/SWpix</span></i></p>\n<p><span>Sagan joined Bora-Hansgrohe in 2017. At this point, the team had won just one WorldTour level race in their existence — stage 8 of the 2013 Vuelta a <span>España</span>, whilst racing under the name Team NetApp. Sagan’s signing pushed the team into the WorldTour, and the dominoes began to fall.</span></p>\n<p><span><span>Bora signed Sagan at the peak of his career — an exceptionally versatile rider who could win in a sprint finish or via a solo attack, and on a variety of terrains. </span></span>This meant that, in the short-term<span>, Sagan brought a plethora of victories, contributing 36% of the team’s 33 wins in 2017 and 24% of their 33 victories in 2018.</span></p>\n<p><span>Sagan’s signing also helped Bora-Hansgrohe become an attractive location for up and coming riders. After securing his signature, Bora have gone on to sign the likes of Davide Formolo, Max Schachmann and Nils Politt. </span>Even though the wins have dried up in recent years for Sagan, the team have continued to succeed with at least eight WorldTour victories in the past three seasons.</p>\n<p><span>For Bora-Hansgrohe, it’s the end of an era. Sagan led the team to places they'd never been, but they’ll remain there even after he’s gone.</span><b><br /></b></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/20210708TDF0002-A.S.O._Charly_Lopez-min_182678d1-721f-40fe-9d06-8180ca564e42_1024x1024.jpg?v=1633613191\" />Team TotalEnergies at the 2021 Tour de France (Image credit: </span></i><i><span>A.S.O./Charly Lopez)</span></i></p>\n<p><span>So, what lies next for Sagan in his new adventure with Team TotalEnergies?</span></p>\n<p><span>The French outfit are in a comparable state to Bora-Hansgrohe in 2017. <span>Team TotalEnergies aren't a WorldTour team, they rely on invitations from race organisers to attend top-tier races.</span> Additionally, they have only one WorldTour win to their name in the past three years. Sagan's first major target is to bring more top-level wins to the team.</span></p>\n<p>After completing the signing, team boss Jean-René Bernaudeau said, \"Peter is a huge competitor, everyone knows that, and above all he will bring us victories. We are counting on him for that.\"</p>\n<p><span>TotalEnergies’ 2022 squad is yet to be finalised, but Sagan will bring some of his entourage with him in the form of loyal domestiques Daniel Oss and Maciej Bodnar. The emerging Anthony Turgis is also contracted to stay with TotalEnergies next season.</span></p>\n<p><span>At 27-years-old, Turgis has demonstrated plenty of promise, notably when he was a close second to Mathieu van der Poel at Dwars door Vlaanderen in 2019. The Frenchman has taken yet another big step forward this season with remarkably consistent results in the one-day classics. He was second in Kuurne-Brussels-Kuurne, before finishing in the top ten at Gent-Wevelgem, the Tour of Flanders and Milan-Sanremo.</span></p>\n<p><span>Turgis also finished thirteenth in Paris-Roubaix. Clearly, Turgis is growing into a genuine classics contender.</span><span> It’ll be intriguing to watch how he works in tandem with the incoming Sagan in 2022.</span></p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC_0436-min_1024x1024.jpg?v=1633613179\" />Image credit: </span></i><i><span>Simon Wilkinson/SWpix</span></i></p>\n<p><span>We can also consider what Sagan will bring to the table when he's not on the bike. One of the most popular pro cyclists in the world, Sagan boasts 1.9 million Instagram followers — more than Chris Froome, Mathieu van der Poel and Julian Alaphilippe. Comparatively, TotalEnergies currently have 72,500 followers on Instagram. The marketing boost that Sagan can bring to the team by his sheer presence, regardless of results, cannot be understated.</span></p>\n<p><span>Peter Sagan is a once-in-a-generation talent. He's the only rider to win the rainbow jersey three years in a row, and his seven green jerseys at the Tour de France is unmatched. However, his win rate has decreased as he enters his early thirties and we can’t expect a sudden return to his former ways with TotalEnergies.</span></p>\n<p><span>Despite this, the move makes sense for all parties. Bora-Hansgrohe have moved on and have already started building for the </span><span>post-Sagan era — they’ve signed the likes of Sam Bennett, Alex Vlasov and Sergio Higuita for 2022. Now, Sagan forms an appealing classics duo with Anthony Turgis, while he i</span><span>s presented with a fresh challenge that is not too dissimilar to the one he faced when joining Bora five years ago.</span></p>\n<p><i><span>Cover image: </span></i><em><span>Tim de Waele/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"928b796fb456304ff6a31bee478fb57540028882707eaf1ee0cee55935a78e8a","category":"Cycling"}