{"title":"Validity testing of the Korean version of the Health Literacy Questionnaire (HLQ) and its application in people with chronic diseases","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308086","date":1722520800000,"content":"<p>by Yon Hee Seo, Richard H Osborne, Yeunhee Kwak, Jung-Won Ahn</p>\r\n\r\nHealth literacy plays a crucial role in promoting and maintaining the health of patients with chronic illnesses. Therefore, adequate assessments and the application of interventions based on people’s health literacy strengths, needs, and preferences are required to improve health outcomes. This study aimed to evaluate the psychometrical properties of the Health Literacy Questionnaire (HLQ) in Koreans with chronic diseases. Data were collected from 278 patients (57.04±15.22 years) diagnosed with chronic disease, including kidney disease, hypertension, and diabetes, who visited the outpatient clinic of a university hospital from June to December 2020. For validity assessment, construct, convergent, and discriminant validities were evaluated, along with the HLQ reliability using Cronbach’s α. One-way analysis of variance was used to evaluate mean differences in the HLQ scale scores based on patients’ characteristics. The confirmatory factor analysis (CFA) indicated that all items were loaded on their respective factors. The model fit of a full nine-factor CFA model showed satisfactory or better fit compared with nine one-factor CFA model; χ<sup>2</sup><sub>WLSMV</sub> (866) = 576.596 (<i>p</i> &lt; .001), comparative normed fit index of 1.000 (reference: &gt;0.950), Tucker–Lewis index of 0.981 (reference: &gt;0.950), root mean square error of approximation of 0.066 (reference: &lt;0.080), and standardized root mean square residual of 0.055 (reference: &lt;0.080). All scales demonstrated good to excellent internal consistency (Cronbach’s α ≥.757). Sociodemographic characteristic variables with significant score differences in HLQ scores were reported across nine scales, with the level of education and income showing significant score differences in 8 and 6 scales, respectively. This study revealed that the Korean version of the HLQ has many strong measurement properties among patients with chronic diseases. The validation indicated the HLQ as a robust tool that is used cross-culturally and is recommended for use in the Korean population.","author":"Yon Hee Seo","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9294ed404a09017d517e124a1f5dce553dafd76476fdd129a08b2b03231295e7","category":"Interdisciplinary"}