{"title":"Cyclist’s 31 Inspirational Women No13: Rachel Atherton","link":"https://www.cyclist.co.uk/sponsored/9303/cyclist-s-31-inspirational-women-no13-rachel-atherton","date":1614710788000,"content":"<span class=\"field field-name-field-author field-type-node-reference field-label-hidden\">\n      <span class=\"field-item even\"><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span class=\"field-item odd\"><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div class=\"field field-name-field-published-date field-type-datetime field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><span class=\"date-display-single\" property=\"dc:date\" datatype=\"xsd:dateTime\" content=\"2021-03-13T11:43:00+00:00\">13 Mar 2021</span></div>    </div></div><p class=\"short-teaser\">\nA six-time Downhill Mountain Bike World Champion who&#039;s embracing a whole new challenge</p>\n<div class=\"primary-image\">\n      <img typeof=\"foaf:Image\" src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/03/rachel_atherton.jpg?itok=4d0c4rcF\" />  </div>\n<div class=\"field field-name-body\">\n      <p> <a href=\"/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" alt=\"Cyclist's 31 Inspirational Women\" border=\"0\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David <strong>Photography</strong>: Dan Griffiths</p>\n<p>It’s been a strange couple of years for Rachel Atherton. First a ruptured Achilles tendon during a practice session for the Les Gets round of the Downhill World Cup in July 2019 put her out of action. Then lockdown happened, and now Rachel is looking forward to having a baby in July.</p>\n<p>‘It’s starting to feel a bit more real now. None of my riding kit fits me anymore,’ Rachel laughs. ‘It suddenly feels like I should prepare, but like with racing, I kind of prefer that big last minute rush at the end to get ready!</p>\n<p>‘I have been doing quite a bit of cycling but in those early weeks I wasn’t sure what I should be doing.</p>\n<p>‘It’s a very steep learning curve but once I decided to listen to my body and be sensible it was fine. I’m taking it a lot easier than normal, riding a bit on the road, on the trail bike. I also ride an e-bike, which has been great for the days when I don’t feel like doing much.</p>\n<p>‘I’ve done a bit of very easy downhilling too. For me, riding downhill is second nature, where I feel at home and the most in control.</p>\n<blockquote><p>I’ve had so many messages from women reaching saying how they felt the same as me – that they didn’t have anyone to look to for advice or inspiration, and that they’re grateful that their voice is heard now</p></blockquote>\n<p>‘One of my biggest worries was the judgement from people about what I was doing or not doing. But I guess with everything you have to think, “This is my situation and I’m going to be the one that decides if what I’m doing is sensible.”’</p>\n<p>Eager for some advice, Rachel turned to her fellow cross-country racers but found there was a lack of downhillers who could relate to her situation.</p>\n<p>‘I reached out to Catharine Pendrel, who has just had a baby, and the Scottish trail rider Hannah Barnes. But it was really difficult to find any downhill mountain bikers.</p>\n<p>‘When Tracy Moseley was pregnant she had kept it close to her chest; I don’t think she announced her pregnancy until the baby was here!</p>\n<p>‘That’s why I’ve decided to talk about my pregnancy and not keep it quiet. I think it’s really useful for other people to talk about their pregnancy.</p>\n<p>‘Since I’ve spoken about it, I’ve had so many messages from women reaching saying how they felt the same as me – that they didn’t have anyone to look to for advice or inspiration, and that they’re grateful that their voice is heard now.’</p>\n<p>Now 33, Rachel says she feels it’s important that pregnancy be normalised and that it shouldn’t spell the end of a career.</p>\n<p>‘Initially it felt like being pregnant was a negative thing. I was thinking, “Oh no, I’m pregnant – everyone’s going to be like, it’s the end of everything.” Now, I think it’s an exciting thing and I want it to be positive for my sponsors, for me, for women everywhere.</p>\n<p>‘It’s pretty important to make pregnancy normal and not have it like a negative thing you almost have to hide.</p>\n<p>‘The sponsors, Red Bull and Endura, have been really supportive. Mountain biking is not like the traditional kind of male industry – it’s so inclusive.’</p>\n<p><strong>Find the rest of <a href=\"/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em></a> here</strong></p>\n<p>It’s fair to say the past year and a half has been different from any other time in Rachel’s life, and has required her to adapt to an extended period of being less active.</p>\n<p>She has spent part of the time working alongside brothers Dan and Gee on the production of their Atherton bike range, as well as developing the mountain bike park in Dyfi Forest.</p>\n<p>‘I haven’t raced for a long time – not since halfway through 2019. It’s nice in a way to have some time to slow down and think about things without the pressures of preparing for a race.</p>\n<p>‘I’ve been racing at World Cups since I was 14 or 15, so it’s hard to know who you are without the adrenaline buzz of travelling, racing, winning, losing.</p>\n<p>‘The Bike Park has been amazing, apart from the Covid situation where we’ve had to close. But when it’s been open it’s been so cool to have this park and all these tracks, seeing everyone coming to ride, coaching people, and seeing the smiles on their faces. It’s just so rad and exactly what we wanted.’</p>\n<p>Rachel is also keen to share her knowledge and experience with other women in mountain biking, and help those coming through the ranks.</p>\n<p>‘I think there needs to be more support for women mountain bikers over things like the pay gap and opportunities. It’s infuriating that even now in this day and age it is still an issue.</p>\n<p>‘I remember a couple of years ago speaking to the woman who won the World Cup overall, and she told me how much she was getting from her sponsors.</p>\n<p>‘I was shocked at how low it was, and I said to her she must go back and ask for more money. But she was really nervous and worried she’d be chucked off the team.</p>\n<p>‘Eventually she did ask for, and got, more money. But this shouldn’t have happened in the first place.</p>\n<p>‘I feel so emotional and touched when I get messages of praise or support from young girls or women. It always moves me and I want to be able to connect with them.</p>\n<p>‘Maybe this downtime is the opportunity I’ve needed to help other people or share my expertise. So it’s pretty exciting to think what could happen over the next year or two.’</p>\n<p><strong>For more from Zwift this International Women's Month</strong>, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5637581721&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a>. </p>\n  </div>\n<div class=\"field field-name-field-category-primary field-type-taxonomy-term-reference field-label-hidden\">  \n  <div class=\"field-items\">      <div class=\"field-item even\"><a href=\"/cyclists\" typeof=\"skos:Concept\" property=\"rdfs:label skos:prefLabel\" datatype=\"\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Featured Articles","siteHash":"f129cda89106022134374fa071789f236ffc24ddd29b6bf4220b1143ee6f092f","entryHash":"9296ec680874457cd61699a322b5f533621da8b8b34a42041c8cf679e4fc6419","category":"Cycling"}