{"title":"Migration of humans fleeing conflict in the Lake Chad region may increase pressures on natural resources in Lake Fitri (Chad): A case study on waterbirds","link":"https://onlinelibrary.wiley.com/doi/10.1111/1365-2664.14700?af=R","date":1719979260000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/166c461b-ecfd-44da-90a8-e6ae4027365a/jpe14700-toc-0001-m.png\" alt=\"Migration of humans fleeing conflict in the Lake Chad region may increase pressures on natural resources in Lake Fitri (Chad): A case study on waterbirds\" />\n<p>This work is likely the first quantitative approach of bird harvest sustainability in Africa. It should contribute to fill a methodological and an information gap in the strategic planification of several multilateral environmental agreements like the African-Eurasian Waterbird Agreement and the Ramsar Convention. In particular, this work could help implementing adaptive management of natural resources (including birds) in Ramsar site management plans. African wetlands such as Lake Fitri may not be able to provide enough natural resources in the medium term for movements of displaced civilians forced by armed conflict into such biodiversity strongholds.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSustainable harvest of wildlife is a major food security and conservation issue. In Africa, where wildlife is harvested mainly for subsistence, this remains a challenge. In this study, using waterbirds as model for natural resources, we assessed the sustainability of harvest through fishing bycatch on Lake Fitri (Chad).\n\nWe estimated the abundance of 24 target taxa through aerial distance sampling over four consecutive years (2018–2021) and in parallel estimated the number of birds harvested through interviews of a sample of 105 out of approximately 5500 fishermen.\n\nBy modelling their potential excess growth, we found a high risk of overexploitation for four species, including the world-threatened Black Crowned Crane <i>Balearica pavonina</i>, likely due to an influx of fishermen to Lake Fitri fleeing the Boko Haram security crisis.\n\n<i>Synthesis and applications</i>: This work is likely the first quantitative approach of bird harvest sustainability in Africa. It should contribute to fill a methodological and an information gap in the strategic planification of several multilateral environmental agreements like the African-Eurasian Waterbird Agreement and the Ramsar Convention. In particular, this work could help implementing adaptive management of natural resources (including birds) in Ramsar site management plans. African wetlands such as Lake Fitri may not be able to provide enough natural resources in the medium term for movements of displaced civilians forced by armed conflict into such biodiversity strongholds.\n</p>\n<h2>Résumé</h2>\n<p>\n\nL'exploitation durable de la faune sauvage est un enjeu majeur de sécurité alimentaire et de conservation de la biodiversité. En Afrique, où la faune est principalement exploitée à des fins de subsistance, cela reste un défi. Dans ce travail, en utilisant les oiseaux d'eau comme modèle de ressources naturelles, nous avons évalué la durabilité de leur exploitation à travers les prises accessoires de pêche sur le lac Fitri (Tchad).\n\nNous avons estimé l'abondance de 24 taxons cibles par échantillonnage aérien (distance sampling) sur quatre années consécutives (2018-2021) et en parallèle nous avons estimé les quantités prélevées pour ces même espèces par des entretiens conduits auprès d'un échantillon de 105 pêcheurs interviewés sur environ 5500 actifs sur le lac.\n\nEn modélisant leur surplus potentiel de croissance (Potential Excess Growth), nous avons constaté un risque élevé de surexploitation pour quatre espèces, dont la Grue couronnée <i>Balearica pavonina</i>, menacée au niveau mondial, probablement en raison d'un afflux de pêcheurs au lac Fitri fuyant la crise sécuritaire liée à Boko Haram.\n\n<i>Synthèse et applications</i>. Ce travail est probablement la première approche quantitative d'estimation de la durabilité de prélèvements d'oiseaux en Afrique. Il devrait contribuer à combler un manque de méthodologie et d'information dans la planification stratégique de plusieurs accords environnementaux multilatéraux tels que l'Accord sur la conservation des oiseaux d'eau migrateurs d'Afrique-Eurasie (AEWA) et la Convention de Ramsar. En particulier, ce travail pourrait contribuer à mettre en œuvre une gestion adaptative des ressources naturelles (y compris les oiseaux) dans les plans de gestion des sites Ramsar. Les zones humides africaines telles que le lac Fitri pourraient ne plus être en mesure de fournir suffisamment de ressources naturelles à moyen terme pour les civils déplacés, forcés par les conflits armés à se réfugier dans ces bastions de biodiversité.\n</p>","author":"Nicolas Carenton, \nPierre Defos du Rau, \nAbakar Saleh Wachoum, \nDelphine Ducros, \nMarie Suet, \nClémence Deschamps, \nMaxime Rotoudjimbaye Betoloum, \nJulien Birard, \nM' Baïti Narcisse Djimasngar, \nYves Kayser, \nIb Krag Petersen, \nJaime Dias, \nMahamat Adoum Wachoum, \nBruno Portier, \nAudrey Mbagogo Koumbraït, \nSébastien Le Bel, \nJean‐Yves Mondain‐Monval","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"92a297c7a55033356877b23e82bb78f3ddc01f0f0e6838a8cd124ac48d69e51c","category":"Environment"}