{"title":"Preoperative Mechanical Bowel Preparation Does Not Affect the Impact of Anastomosis Leakage in Left Side Colorectal Surgery &ndash; a Single Center Observational Study","link":"https://www.preprints.org/manuscript/202406.1965/v1","date":1719494890000,"content":"Even despite rapid advances in colorectal surgery, morbidity and mortality rates in elective gastrointestinal surgery play a significant role. For decades, there have been tempestuous discussions on preventive measures to minimize the risk of anastomotic dehiscence. When mechanical bowel preparation before elective procedure, one of the key hypotheses, has been introduced into practice, it was assumed that it would decrease number of infectious complications and anastomotic dehiscence. The advancements in antibiotic treatment supported concomitant administration of oral antibiotics and mechanical bowel preparation.\nIn the prospective study conducted at our clinic, we performed left-side colorectal procedures without the prior mechanical preparation. All patients enrolled in the study underwent the surgery and had been observed in the 3rd Surgical Clinic, Faculty of Medicine, Comenius University in Bratislava, Slovakia, from January 2019 to January 2020. As a control group we used similar group of patients with MBP.\nOur observed group included 87 patients with tumors in the left part of their large intestine (lineal flexure, descendent colon, sigmoid colon, and rectum). Dixon laparoscopic resection was performed in 26 patients. Sigmoid laparoscopic resection was performed in 27 patients. In 12 patients, the procedure was started laparoscopically but had to be converted due to adverse anatomical conditions. The conservative approaches mostly included Dixon resections (19 patients), sigmoid colon resection (5 patients) and left side hemicolectomy (6 patients), and Miles´ tumor resection with rectal amputation (4 patients). Our study highlighted the fact that MBP does not have the unequivocal benefit for patients with colorectal infection, which has an impact on development of anastomotic dehiscence.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"92a7e2306ff54e7802acd42a8e9ea0952f3b36f8cafb95a7fa103a32823f0f62","category":"Interdisciplinary"}