{"title":"Diversity of MHC class II DRB alleles and mitochondrial DNA in northern and eastern European pine marten, Martes martes (Mammalia: Mustelidae)","link":"https://academic.oup.com/biolinnean/article/doi/10.1093/biolinnean/blad133/7503705?rss=1","date":1703808000000,"content":"<span><div>Abstract</div>Four mitochondrial phylogroups are distinguished in the European pine marten (<span>Martes martes</span>), two of which, FNR1/2, are shared with the more easterly sister species, the sable (<span>Martes zibellina</span>). Here, we found that the phylogroup frequencies differed markedly between the southern Finland and western Russia populations in the eastern part of the range of <span>Martes martes</span>, suggesting differential introgression from <span>M. zibellina</span> in these regions. We also examined the diversity of a protein-coding gene, MHC class II <span>DRB</span>, in these two <span>Martes</span> species. We detected 16 functional <span>Martes martes DRB</span> alleles (<span>Mama-DRB</span>s), including several codons that seem to have undergone positive selection, and eight presumed pseudogenes (Mama-DRB*PSs); some alleles/pseudogenes were geographically widespread and others restricted. In a broader carnivoran <span>DRB</span> tree, all <span>Mama-DRB</span>s grouped within a mustelid clade, four in a basal group comprising alleles from early-diverged species and the others in a derived group containing alleles from more recently diverged species. Many alleles showed trans-species polymorphism, suggesting that <span>Mama-DRB</span>s have evolved under pathogen-driven balancing selection. Three of six <span>Mama-DRB</span>s and one of four pseudogenes shared with <span>Martes zibellina</span> were restricted to the FNR1/2 mitochondrial DNA phylogroups, pointing to the possibility that genetic introgression from <span>Martes zibellina</span> might have contributed to <span>Mama-DRB</span> diversity and thus adaptability.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"92ba13dea570fb8be568b2cec87285accdcf3161fb4e497880ec52c7d7f10527","category":"Environment"}