{"title":"60 Effects of a calcareous marine algae on dry matter intake, water intake, rumen temperature, rumen pH and average daily gain of grain-fed steers during a heat wave","link":"https://academic.oup.com/jas/article/102/Supplement_3/299/7757050?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>During summer, feedlot cattle are often subjected to multiple high heat load events which can cause heat stress and negatively impact on cattle performance and well-being. The objective of this study was to evaluate the effects of different dietary buffering feeding strategies, on dry matter intake (DMI), water intake (WI), rumen temperature (T<sub>RUM</sub>), rumen pH and average daily gain (ADG) of grain-fed beef steers exposed to a simulated heat wave event. Angus steers [n = 12; body weight (BW) = 582 ± 8.92 kg] were housed within climate control rooms for 21 d and randomly allocated into one of three dietary treatments (4 steers/treatment): 1) Treatment 1 (T1), finisher diet; 2) Treatment 2 (T2), transitioned from finisher to heat load diet (HLD) on d 4 and fed HLD until d 16; 3) Treatment 3 (T3), fed finisher and supplemented with a calcareous marine algae (CMA; Acid Buffer, Celtic Sea Minerals) on d 4 until d 16. On d 17, T2 and T3 transitioned back to the finisher. Days were split into three phases consisting of i) d 0 to 6 [PI, Temperature Humidity Index (THI), THI 65-78]; ii) d 7 to 11 (PII, THI 83-87); iii) d 12 to 20 (PIII, THI 65-78). Data were analyzed using a repeated measures model, with a first order auto-regressive error structure, including fixed effects for treatment, phase, day and hour, with animal ID as a random effect. Body weight declined (<span>P</span> &lt; 0.005) during PII, with steers losing on average, 17.65 ± 3.06 kg BW/steer (T1), 12.30 ± 3.06 kg BW/steer (T2) and 16.20 ± 3.06 kg BW/steer (T3) at conclusion of PII, with muscle atrophy visually evident (Table 1). There were no effects (<span>P</span> ≥ 0.93) for treatment on ADG. During PII, DMI decreased (<span>P</span> &lt; 0.005), with T2 and T3 having &gt;2kg DMIּ steer<sup>-1</sup>ּ d<sup>-1</sup> greater (<span>P</span> ≤ 0.006) DMI compared with T1. During PIII, T1 maintained decreased (<span>P</span> ≤ 0.001) DMI compared with T2 and T3. During PII, mean WI increased (<span>P</span> ≤ 0.05) for T1 and T3, although remained unchanged (<span>P</span> = 0.11) for T2, T<sub>RUM</sub> increased (<span>P</span> &lt; 0.0001), whilst range in T<sub>RUM</sub> decreased (<span>P</span> ≤ 0.01) for all TRT and rumen pH for T2 and T3 decreased (<span>P</span> ≤ 0.0003), whilst T1 tended (<span>P</span> ≥ 0.05) to decrease. Rumen pH diurnal rhythms were disrupted during PII, range in rumen pH also reduced (<span>P</span> &lt; 0.0001) for T1 and T3, remaining unchanged (<span>P</span> = 0.94) for T2. Mean rumen pH was lower (<span>P</span> ≤ 0.002) during PIII compared with PI for all treatments. Both T2 and T3 had a lower (<span>P</span> ≤ 0.05) range in rumen pH than T1 during PIII. Data from the current study suggest that feeding strategies to include CMA may aide in moderating DMI reductions observed during and post-heat stress periods, whilst also reducing the range in rumen pH during post-heat wave conditions when rumen dysfunction challenges may present.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"92bbc22013bedfafeb418fabdbee1729e486b44da603dd2d4a11bf96e39b7c81","category":"Environment"}