{"title":"Pinpointing the causal influences of stomatal anatomy and behavior on minimum, operational, and maximum leaf surface conductance","link":"https://academic.oup.com/plphys/article/196/1/51/7679682?rss=1","date":1716336000000,"content":"<span><div>Abstract</div>Leaf surface conductance to water vapor and CO<sub>2</sub> across the epidermis (<span>g</span><sub>leaf</sub>) strongly determines the rates of gas exchange. Thus, clarifying the drivers of <span>g</span><sub>leaf</sub> has important implications for resolving the mechanisms of photosynthetic productivity and leaf and plant responses and tolerance to drought. It is well recognized that <span>g</span><sub>leaf</sub> is a function of the conductances of the stomata (<span>g</span><sub>s</sub>) and of the epidermis + cuticle (<span>g</span><sub>ec</sub>). Yet, controversies have arisen around the relative roles of stomatal density (<span>d</span>) and size (<span>s</span>), fractional stomatal opening (<span>α</span>; aperture relative to maximum), and <span>g</span><sub>ec</sub> in determining <span>g</span><sub>leaf</sub>. Resolving the importance of these drivers is critical across the range of leaf surface conductances, from strong stomatal closure under drought (<span>g</span><sub>leaf,min</sub>), to typical opening for photosynthesis (<span>g</span><sub>leaf,op</sub>), to maximum achievable opening (<span>g</span><sub>leaf,max</sub>). We derived equations and analyzed a compiled database of published and measured data for approximately 200 species and genotypes. On average, within and across species, higher <span>g</span><sub>leaf,min</sub> was determined 10 times more strongly by <span>α</span> and <span>g</span><sub>ec</sub> than by <span>d</span> and negligibly by <span>s</span>; higher <span>g</span><sub>leaf,op</sub> was determined approximately equally by <span>α</span> (47%) and by stomatal anatomy (45% by <span>d</span> and 8% by <span>s</span>), and negligibly by <span>g</span><sub>ec</sub>; and higher <span>g</span><sub>leaf</sub>,<sub>max</sub> was determined entirely by <span>d</span>. These findings clarify how diversity in stomatal functioning arises from multiple structural and physiological causes with importance shifting with context. The rising importance of <span>d</span> relative to <span>α</span>, from <span>g</span><sub>leaf,min</sub> to <span>g</span><sub>leaf,op</sub>, enables even species with low <span>g</span><sub>leaf</sub>,<sub>min</sub>, which can retain leaves through drought, to possess high <span>d</span> and thereby achieve rapid gas exchange in periods of high water availability.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"92caa470ca6992ee69795ffc9fe0abe7f78aee1b8997cbac535ed25dd5f266a9","category":"Environment"}