{"title":"มีลูกดีไหม : คำถามสุดฮิตของคนวัยทำงาน","link":"https://iannnnn.com/2022/3038","date":1653630549000,"content":"<p>เวลาอัดเสาเสาเสาเสร็จ จะมีเวลาที่เหล่าผู้จัดรายการยังคงออนซูมคุยนั่นคุยนี่กันอีกนานเป็นชั่วโมง บางทีก็นานกว่านั้น กินนั่นกินนี่หรือทำงานไปด้วย จนดึกดื่นมากๆ นั่นแหละถึงได้แยกย้าย ในแต่ละครั้งจะมีประเด็นสนทนาที่ซีเรียสบ้าง เรื่อยเปื่อยบ้าง ลามกจกเปรตบ้าง ซึ่งปกติแล้วเราจะเป็นคนฟังอย่างเดียว และทำงานหรือวาดรูปไปด้วย ไม่ค่อยได้ออกความเห็นอะไร คือชอบเป็นคนฟังมากกว่า</p>\n\n\n\n<p>แต่สำหรับเมื่อคืน ซึ่งเป็นคืนที่เราทำงานกระหน่ำมาก (เตรียมอาร์ตเวิร์กสกรีนเสื้อที่ออเดอร์ทะลักอยู่ตอนนี้) มีอยู่ช่วงหนึ่งที่น้องมันคุยกันเรื่องชีวิตของแต่ละคน จนถึงเรื่องแต่งงานและการมีลูก</p>\n\n\n\n<p>แน่นอนว่าบทสนทนาร่วมของคนอายุ 30 กว่าๆ มาถึง 40 มันจะไม่ใช่วัยที่แซวกันว่าคนนั้นเป็นแฟนคนนี้ คนนี้ได้กับคนนั้นแล้ว แต่มันจะเป็นประมาณว่า เออเราไปกินข้าวกับเพื่อนครั้งล่าสุด เพื่อนคนนั้นก็อุ้มลูก คนนี้ก็แต่งงานคนนู้นก็เลิกกัน</p>\n\n\n\n<p>แล้วก็จะต้องเข้าสู่คำถามสุดฮิตของคนวัยเรา</p>\n\n\n\n<p>คือ <strong>มีลูกดีไหม</strong></p>\n\n\n\n<p>ซึ่งสังคมเมื่อก่อนเราจะสงสัยเรื่องนี้กันตั้งแต่อายุน้อยกว่านี้เป็นสิบๆ ปี คือเดี๋ยวนี้แม่งชอบมีลูกกันตอนอายุเยอะๆ บางคนก็ไม่มีเลย บางคนอยากมีแต่ก็ไม่มี บางคนยังไม่ได้ทันนึกเลยว่าควรมีหรือไม่มีดีหนอ แต่ก็มีเอง</p>\n\n\n\n<p>บางคนพ่อแม่ยังไม่รู้เลยว่ามีแฟน มาถึงก็อุ้มลูกเลย แบบนี้เรียกว่าลั่น สมัยวัยรุ่นจะเจอบ่อย แต่เดี๋ยวนี้ไม่ค่อยมีแล้ว</p>\n\n\n\n<p>.</p>\n\n\n\n<p>ต้องขอเกริ่นไว้ให้นิดนึง ให้ตัวเองตอนที่ย้อนกลับมาอ่านบล็อกในหลายๆ ปีหลังจากนี้</p>\n\n\n\n<p>ตอนนี้สถานการณ์ประชากรในประเทศไทยโดยรวมก็คือ เส้นกราฟจำนวนคนตายมากกว่าจำนวนคนเกิดแล้ว นั่นแปลว่าเด็กเกิดน้อยลงเรื่อยๆ เรากำลังจะกลายเป็นสังคมผู้สูงอายุ แล้วอะไรล่ะคือสาเหตุ</p>\n\n\n\n<p>เอาแค่เรื่องแต่งงาน หลายๆ คนอายุ 30 – 40 ปี ถ้านับคนที่มีแฟนแล้วก็มีจำนวนมากที่ตัดสินใจไม่แต่งงานเพราะเสียเวลา ยุ่งยาก เปลือง ก็แค่ย้ายมาอยู่ด้วยกัน ง่ายจะตาย ซึ่งไอเดียนี้ไม่ใช่สิ่งใหม่ในหมู่มิตรสหาย เราจะคุ้นชินกันมาหลัก 10-20 ปีแล้ว</p>\n\n\n\n<p>แต่พอสเต็ปถัดไปเรื่องการมีลูก บทสนทนามันจะมาถึงทางแยก โดยเฉพาะในการมีตติ้งสังสรรค์กับเพื่อนมหาลัยหรือเพื่อนมัธยมอะไรแบบนี้</p>\n\n\n\n<p>คนที่ไม่มีลูกก็จะให้เหตุผลว่าไม่อยากมีหรอก แม่งเปลือง หรือไม่พร้อม ไม่มีตังค์ กลัวลูกโตมาเจอสังคมเหี้ย หรือไม่ชอบเด็กหรืออะไรก็ว่าไป</p>\n\n\n\n<p>แต่กับคนที่มีลูกน่ารักสามขวบแก้มยุ้ยอุ้มมานั่งคุยกับเพื่อน คนนั้นมันจะกลายเป็นชาวลัทธิชนิดหนึ่ง ที่พยายามจะเชียร์ให้เพื่อนว่ามึงมีลูกเถอะ ดีนั่นนี่ แฮปปี้ลันล้า มีเถอะมึง</p>\n\n\n\n<p>แล้วสองทีมนี้ก็จะไม่เข้าใจกัน เกิดเป็นสงครามเย็นระหว่าง 2 ค่ายความคิด</p>\n\n\n\n<p>ตามความเห็นของเรา บอกเลยว่า บทสนทนานี้มันก็มาถึงทางตัน เพราะคนที่ไม่มี หรือไม่อยากมี ก็จะไม่เก็ตจริงๆ *ไม่มีทางเลย*</p>\n\n\n\n<p>เอาจริงๆ การมีลูกเนี่ย ใครๆ ก็จะพอรู้กันว่ามันเป็นจุดเปลี่ยนสำคัญที่สุดครั้งหนึ่งในชีวิต อันนี้้เบสิกพื้นฐานเนอะ แต่พอฟังแล้วก็จะยังนึกไม่ออกว่ามันจะทำให้เห็นภาพยังไง</p>\n\n\n\n<p>เราเคยเขียนไว้ในหนังสือ<em><a href=\"https://iannnnn.com/2013/1050\">คือปะป๊าครองพิภพ</a></em> (สำนักพิมพ์แซลมอน ทุกวันนี้ยังมีขายอยู่ตามกระบะหนังสือลดราคา 50 บาท) ด้วยความคิดสมัยเกือบ 10 ปีที่แล้วที่เพิ่งมีลูกคนแรกตอนอายุไม่ถึงขวบ และกำลังเห่อมาก ว่า ชีวิตเรามันคงเหมือนการเดินขึ้นบันได เราจะเลือกเดินขึ้นหรือไม่ก็ได้ แต่ขึ้นแล้วขึ้นเลย คนที่อยู่ขั้นบนก็จะได้พบทัศนียภาพแบบใหม่ และในขณะเดียวกันคนที่อยู่ข้างล่างก็จะนึกไม่ออกหรอกว่าวิวข้างบนเป็นยังไง</p>\n\n\n\n<p>ถ้าลองนึกดู ขั้นบันไดชีวิตเหล่านี้ น่าจะเกิดขึ้นตอนเรียนจบ แต่งงาน จนกระทั่งมีลูก</p>\n\n\n\n<p>ฟังดูแล้วสะเหล่อนิดนึง แต่นั่นแหละ มันเป็นสำนวนที่เอาไว้เขียนหนังสือเมื่อนานมาแล้ว</p>\n\n\n\n<p>ถ้าตอนนี้ย้อนไปเขียนเพิ่มได้ เราจะบอกว่า อีขั้นบันไดพวกนี้มันขึ้นแล้วขึ้นเลย ขึ้นแล้วลงไม่ได้ด้วยนะ</p>\n\n\n\n<p>ถ้าโฟกัสเฉพาะเรื่องการมีลูก เราไม่สามารถทดลองเลือกว่าโอเค กูขออยู่ค่ายมีลูกละกัน พอมีลูกปุ๊บ แล้วตื่นมาอีกวันหนึ่งจะบอกว่า เชี่ยแม่ง ไม่เวิร์ก ขอย้ายไปทีมไม่มีลูก แบบนี้ไม่ได้นะ</p>\n\n\n\n<p>คือการมีลูกมันเป็นชอยส์ ทุกคนมีเหตุผลที่ดี (หรืออาจไม่ดีก็ได้) ตามประสบการณ์ชีวิต และทัศนคติของตัวเองกับคู่ ดังนั้นจะขิงกันเพื่ออะไร</p>\n\n\n\n<p>การเถียงกันเรื่องดีหรือไม่มีลูกดีหว่า จะกลายเป็นเรื่องใหญ่ เมื่อคู่ถกเถียงไม่ใช่แค่เพื่อนที่เจอกันตามงานเลี้ยงมีตติ้ง แต่เป็นคู่ชีวิตตัวเอง</p>\n\n\n\n<p>มีเพื่อนหลายคนที่คิดไม่เหมือนกันกะแฟน คนนึงอยากมีลูก แต่อีกคนไม่อยากมี …</p>\n\n\n\n<p>คำถามว่ามีลูกดีไหม จึงไม่ใช่แค่การเอามาขิงกันเล่นๆ แต่หลายๆครอบครัวก็ประสบปัญหากันแบบนี้จริงๆ บางทีบ้านแตกเลยก็มี</p>\n\n\n\n<p>ดราม่าแบบใน Fast and Feel Love จึงเป็นสิ่งที่ valid ในโลกจริง ในสังคมบ้านเรา อ้าวยังไม่ได้ดูเหรอ เดี๋ยวรอลง นฟ ละกันนะ</p>\n\n\n\n<p></p>\n\n\n\n<p>สำหรับเราที่ถูกตั้งคำถามแบบนี้เป็นระยะๆ เพราะตัวเองเป็นหนึ่งในไม่กี่คนในกลุ่มเพื่อนที่มีลูก ไม่ว่าจะเป็นเพื่อนกลุ่มไหนก็ตาม</p>\n\n\n\n<p>พอถูกถามแบบกระชั้นชิด คนที่ชอบนั่งฟังเพื่อนคุยกันแต่ไม่ค่อยพูดอะไรอย่างเรา ก็นึกคำตอบให้แบบด่วนๆ ไม่ออกจริงๆ</p>\n\n\n\n<p>ก็ได้แต่บอกติดตลกเอาตัวรอดไปว่า เราแม่งมีลูกแล้วไง จะให้ย้อนกลับไปเป็นทีมไม่มีลูกก็ไม่ได้แล้ว ดังนั้นคำตอบของเรามันคือคำตอบลำเอียงของคนที่มีลูกแล้วเท่านั้น มึงจะฟังเหรอ</p>\n\n\n\n<p>หลายครั้งที่คุยกันว่ามีลูกจะเหมือนเลี้ยงหมาไหม</p>\n\n\n\n<p>อีเหี้ย นี่ลูก เป็นคน ไม่ใช่หมา</p>\n\n\n\n<p>ด้วยความเคารพลัทธิเลี้ยงหมาเป็นลูก มันไม่เหมือนกันจริงๆ ถึงบ้านเราจะเลี้ยงหมาเป็นหมา (และเลี้ยงแมวเป็นลูก) แต่ก็ยังมีความแตกต่างที่เห็นได้ชัดแบบที่ไม่ต้องเสียเวลาอธิบายก็ได้มั้ง ว่ามันต่างกัน</p>\n\n\n\n<p>ถึงจะมีจุดร่วมกันคือเลี้ยงแล้วเปลืองตังค์ชิบหายก็เถอะ</p>\n\n\n\n<p>มีลูกเองกับเลี้ยงหลาน ก็ต่างกัน</p>\n\n\n\n<p>บางคนบอกว่าเลี้ยงเด็กที่เป็นลูกของพี่ หลานของน้า แล้วชอบ (บางคนก็ไม่ชอบ) ก็จะตอบอีกว่าการถือครองลูกของคนอื่น มันเป็นประสบการณ์ชั่วคราว</p>\n\n\n\n<p>แต่การมีลูกเองมันเป็นประสบการณ์ถาวร ถาวรแบบอยู่กันไปจนตายไปข้างนึงน่ะ</p>\n\n\n\n<p>บางคนที่อยู่ในลัทธิมีลูก ก็จะให้เหตุผลแบบคนแก่ว่าพอมีลูกแล้ว<br />จะได้เอาไว้ดูแลตอนแก่ หรือเอาไว้ทดแทนคุณ หรืออะไรก็แล้วแต่</p>\n\n\n\n<p>บอกตามตรงจากในมุมมองของเรา ณ ตอนนี้ เราไม่เคยคิดเรื่องนี้เลย ไม่ได้ตอบหล่อๆ แต่คงเพราะยังจินตนาการไม่ถึง หรือด้วยวัยวุฒิที่ยังนึกไม่ออกว่า ไอ้เด็กสองคนที่นั่งเล่นมือถือแคะขี้มูกอยู่ตรงโซฟานี้มันจะมาดูแลอะไรเราได้วะ แค่แปรงฟันเองยังไม่สะอาดเลย</p>\n\n\n\n<p>ที่จริง เรื่องการขึ้นบันไดที่พูดไปข้างบน ตรงหน้าสุดท้ายของหนังสือ (สปอยล์เลยละกัน) เราลองทำนายไว้ว่ามันน่าจะมีจากนั้นอีกหลายขั้น</p>\n\n\n\n<p>ลูกเข้าโรงเรียน ลูกเริ่มเป็นวัยรุ่น ลูกมีแฟน ลูกมีผัว ฯลฯ</p>\n\n\n\n<p>อ้าว วนลูปนี่</p>\n\n\n\n<p>ใช่แล้ว วนลูป และมนุษยชาติก็อยู่ในลูปแบบนี้มาไม่รู้กี่หมื่นกี่แสนปีแล้ว</p>\n\n\n\n<p>คนที่ชื่นชอบการชมวิวอย่างเรา ก็จะขอใช้คำว่า มันเป็นความสุขในการเฝ้าดูละกัน</p>\n\n\n\n<p>ไม่เก็ตใช่ไหม แน่นอน ไม่แปลกใจ 555555</p>\n\n\n\n<p>เอาแค่คนที่มีลูกเหมือนกัน แต่ลูกยังเล็กๆ วัยป้อนนม ก็จะไม่มีทางเก็ตหรอกว่าพอลูกโตจนเดินเองได้พูดได้จะเป็นยังไง</p>\n\n\n\n<p>หรือคนที่มีลูกโตเดินเองได้และพูดได้ ก็นึกไม่ออกหรอกว่าเวลาเด็กมันเข้าโรงเรียนแล้วจะยุ่งยากวุ่นวายหรือมีอะไรสนุกตื่นเต้นขนาดไหน</p>\n\n\n\n<p>หรือแม้แต่คนที่มีลูกโตขึ้นมาแล้ว แต่มี 1 คนก็จะนึกไม่ออกจริงๆ ว่าพอมีอีกคนปุ๊บ ชีวิตของลูกและเรา จะเปลี่ยนแปลงไปยังไง</p>\n\n\n\n<p>ทั้งหมดมันเป็นเรื่องการสัมผัสประสบการณ์ของชีวิต ซึ่งแต่ละคนมีลู่วิ่งเป็นของตัวเอง คุณจะขึ้นหรือไม่ขึ้นบันไดก็ได้ และเอาจริงอย่างที่บอกว่าคุณจะเลือกเดินสู่สเต็ปถัดไปหรือไม่ก็ได้ การขึ้นบันไดมันก็ไม่ได้มีเส้นเดียว ไม่งั้นน่าเบื่อแย่</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"768\" height=\"1024\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123725-768x1024.jpg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123725-768x1024.jpg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123725-225x300.jpg 225w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123725-1152x1536.jpg 1152w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123725.jpg 1200w\" /></figure>\n\n\n\n<p></p>\n\n\n\n<p>ที่นี้มาสู่คำถามสำคัญว่า มีลูกแล้วคุ้มไหม</p>\n\n\n\n<p>ขอใช้คำว่า “คุ้ม” เป็นคำถามทางเศรษฐศาสตร์เลย แบบไม่ต้องโรแมนติก</p>\n\n\n\n<p>สำหรับเรา ซึ่งให้คำตอบแทนใครไม่ได้ เพราะแต่ละคนมีข้อจำกัดต่างกันไป อันนี้ไม่ต้องพูดเยอะนะ มันเป็นสิ่งที่คนโตๆ จะเข้าใจกันปกติ</p>\n\n\n\n<p>ซึ่งคำตอบของเราคือคุ้ม</p>\n\n\n\n<p>ถามอีกทีก็บอกว่าคุ้ม ไม่ได้ชักจูงให้ใครคิดตาม แต่กูคุ้ม จะให้กูพูดใช่ไหม นี่ไง ฟังกูดิ กูบอกว่าคุ้ม</p>\n\n\n\n<p>ไม่ใช่แค่เรื่องเงินทอง (ที่ถ้ามองแบบนี้ไม่คุ้มแน่ กินเปลืองบัดซบ) แต่มันก็ยังคุ้ม แม้ต้องแลกอิสระในการใช้ชีวิตของเราและเมีย</p>\n\n\n\n<p>แลกแบบแลกเยอะมากเลยนะ เคยมีไลฟ์สไตล์ยังไงตอนวัยรุ่น พอมีลูกปั๊บ มันเปลี่ยนเลย เปลี่ยนไปตลอดกาลด้วย ไม่ใช่แป๊บๆ</p>\n\n\n\n<p>บางครั้งก็คิดถึงการได้ออกไปเดินทางท่องเที่ยวง่ายๆ คล่องตัว เมียอยากไปสวิส ไปญี่ปุ่น ฯลฯ แต่พอมีภาระอยู่ที่บ้านปั๊บ มันไปไม่ได้แล้วไงล่ะ ถ้าไปปุ๊บ ภาระแม่งนอนจมกองขี้อยู่บ้านแน่ๆ …ซึ่งตรงนี้อาจจะไม่เกิดก็ได้กับหลายครอบครัวที่มีคนช่วยดูแลลูก</p>\n\n\n\n<p>เห็นไหมว่าเหตุปัจจัยในแต่ละบ้านไม่เหมือนกันจริงๆ</p>\n\n\n\n<p>ซึ่งเราเข้าใจมากๆ อิสระเสรีภาพในการใช้ชีวิต เป็นสิ่งที่มีมูลค่าในทางเศรษฐศาสตร์สูงที่สุดแล้ว บางคนไม่อยากแลก ตรงนี้ก็ควรเข้าใจเขา ไม่ใช่ไปล็อบบี้กดดันกัน</p>\n\n\n\n<p>แต่แลกมาขนาดนั้น แล้วอะไรล่ะที่เรียกว่าคุ้ม</p>\n\n\n\n<p>ตอนนี้ลูกเราคนโตคือ 10 ขวบ อยู่ ป.5 ฮอร์โมนวัยรุ่นกำลังมา สิวเริ่มขึ้น เพื่อนในห้องเริ่มมีเมนส์ ส่วนคนเล็ก 7 ขวบ อยู่ ป.2 กำลังสนุกกับการได้ไปเรียน on-site และเล่นตามประสาเด็กกับเพื่อนๆ</p>\n\n\n\n<p>นี่คือบันไดชีวิตขั้นที่เรายืนอยู่</p>\n\n\n\n<p>เราไม่ได้โรแมนติกอะไร ปัญหาชีวิตก็มีสารพัดอย่างที่น่าจะมี แถมยังไปในอนาคตไม่ได้ บันไดขั้นที่สูงกว่านี้เหรอ ไม่เห็นและไม่มีทางรู้หรอก นึกไม่ออกจริงๆ ว่าลูกเราโตไปจะโอเคไหม เด็กมันจะรอดไหม จะเข้า ม.1 โรงเรียนไหน เพื่อนจะบูลลี่หรือไปบูลลี่เพื่อนไหม และจะต้องเติบโตในสังคมที่ไม่รู้จะเหี้ยต่อไปอีกนานไหม</p>\n\n\n\n<p>เนี่ย วิวตอนนี้</p>\n\n\n\n<p>แต่พอมองย้อนลงไปยังขั้นที่เราก้าวผ่านมา ความคิดของเรา ณ ตอนนี้ก็ยังมั่นใจ</p>\n\n\n\n<p>เราแฮปปี้กับการเฝ้ารอดูการเติบโตของชีวิตเล็กๆ ที่เกิดขึ้น<br />มันลุ้น เหมือนปลูกต้นไม้… (มึงเปรียบเทียบเห็นภาพยากกว่าเลี้ยงหมาอีก)</p>\n\n\n\n<p>เอางี้ก็ได้ มันเหมือนเราได้เล่นเกมที่ไม่มีวันจบ แต่ละวันก็ค่อยๆ เก็บเวลไป ได้ค่าประสบการณ์เพิ่มขึ้น ตีบอสตัวใหม่ๆ ที่ขยันอัปแพตช์ อีห่า แค่บอสโควิดนี่กูกระอักเลือดจริง แทบไม่เงินให้เติมแล้ว มีเควสต์ใหญ่เควสต์ย่อยเกิดขึ้นให้ฝ่าฟันไป เจอบั๊กนิดหน่อย มีปัญหาเกิดขึ้นมากบ้างน้อยบ้าง</p>\n\n\n\n<p>แลกมากับ reward ที่พอแทนค่ากลับแล้ว มันคือรางวัลของชีวิต ไม่ใช่แค่ชีวิตเรา</p>\n\n\n\n<p>แต่เป็นชีวิตของลูกเองด้วย</p>\n\n\n\n<p>เป็นความรู้สึกว่าการอยู่ในสังคมนี้มันยังพอไหว ไม่ได้โหดร้ายบัดซบต่อชีวิตจนไม่อยากอยู่ต่อ แต่เอาวะ แก้ปัญหานี้ได้ก็สนุกดีว่ะ … งั้นกูแตกงอกใหม่เป็นถือไพ่อีกมือเลยละกัน แล้วส่งต่อสิ่งที่เรามี ไปให้ชีวิตใหม่ แล้วเฝ้าดู</p>\n\n\n\n<p>มันคุ้มนะ กับการที่ได้เห็นความงอกงาม และงดงามของชีวิตเล็กๆ ที่บัดนี้โตจนไม่ต้องล้างตูดให้แล้ว</p>\n\n\n\n<p>แต่เปลี่ยนเป็นทุกวันกลับมาบ้าน สวัสดีค่ะ เออ ไปเลย ไปอาบน้ำก่อน ถุงเท้าถอดยัง ไปล้างมือ ทำการบ้านก่อน อย่าเพิ่งเล่นเกม กินข้าวอะไรดีเย็นนี้ หยิบมือถือแม่ให้หน่อย อย่าแกล้งน้อง เออสึกมายากลตอนใหม่มาแล้วนะ อย่าเพิ่งกวนพ่อทำงานอยู่ แล้วเพื่อนหนูว่าไง เฮ้ยดึกแล้วไปนอน แปรงฟันสะอาดไหมเนี่ย ใครทิ้งผ้าเช็ดตัวไว้ พรุ่งนี้งดโควตาเล่นเกม 10 นาทีนะ เออตกลงโรบินนี่มีพลังอะไรนะ เฮ้ยหัวเหม็นมาก อย่าแกล้งมารุ! กินน้ำส้มไหม ใครตด!! ฯลฯ</p>\n\n\n\n<p>จนจบแต่ละคืนด้วยการเล่านิทานก่อนนอนส่งเดช ให้หลับไป</p>\n\n\n\n<p>ง่ายๆ แบบนี้นี่แหละ ชีวิตที่บันไดขั้นนี้</p>\n\n\n\n<p>วิวโคตรแจ่มเลยน้องงง</p>\n\n\n\n<figure><a href=\"https://iannnnn.com/2013/1050\"><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-1024x768.jpg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-1024x768.jpg 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-300x225.jpg 300w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-768x576.jpg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-1536x1152.jpg 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2022/05/20220527_123640-2048x1536.jpg 2048w\" /></a><figcaption>ภาพจาก <em>คือปะป๊าครองพิภพ</em> สนพ.แซลมอน ที่ลูกเอาไปอ่านจนทำเปียกบวมขาดเละ</figcaption></figure>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"92d4505531c91119d17e908e27cd81065e3302faa60928e78c696caa023d84ed","category":"Thai"}