{"title":"344 Preliminary heritability estimate of liver abscess incidence in beef on dairy heifers","link":"https://academic.oup.com/jas/article/102/Supplement_3/47/7757152?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This preliminary study aimed to estimate the heritability of liver abscess incidence in fed, beef on dairy crossbred progeny. Liver abscesses affect approximately 20% to 30% of livers at slaughter. They are commonly identified during viscera inspection at slaughter due to difficulty with antemortem diagnosis. All livers with abscesses are condemned, causing a profit loss for producers. This loss is increased when the abscesses are ruptured or adhered to the gut due to additional condemnation of the gut. The most common prevention techniques include antimicrobial feed additives and nutritional management; however, mitigation has not been highly effective. Few studies have attempted to ascertain if a genetic component for liver abscess incidence exists. Determining if there is a genetic component to liver abscess occurrence could enable the ability to utilize genetic selection as a preventative measure. Liver abscess scores were collected on 1,492 crossbred beef on dairy heifers at slaughter. Cattle were harvested in Kansas. Individual livers were scored using the Elanco scoring system of 0, A-, A, A+. Scores of A+, A+AD, and A+O were combined into the A+ category. A score of 0 indicates a normal liver, as scores of A-, A, and A+ indicate increasing severity of abscesses. Scores of A+AD and A+O represent animals with adhesion to the gut or ruptured abscesses, respectively. In the dataset, the distribution was 903, 168, 69, and 352 for scores of 0, A-, A, and A+, respectively. Overall, the prevalence of liver abscesses was 39.5% in this sample. All 1,492 heifers had recorded sire information, but no dam information existed other than knowing they were of dairy origin. In total, 19 unique sires were represented in the data, with six of the sires producing 89.4% of the heifers. A 3-generation sire pedigree was built from the data, and heritability was estimated using a sire model and the statistical software package ASReml 3.0. Fixed effects included the number of bovine respiratory disease treatments, age in days, and a contemporary group consisting of kill lot and treatment type. These cattle were part of an additional study evaluating the effectiveness of various treatment regimens for mitigating the incidence of liver abscesses. There were three treatment groups, one control and two treatments. Genetic and phenotypic variation for this model was estimated to be 2.70 × 10<sup>-7</sup> ± 9.99 × 10<sup>-9</sup> and 1.58 ± 5.86 × 10<sup>-2</sup>, respectively. With such a small genetic variance estimate, the heritability of liver abscesses was effectively 0 (1.70 × 10<sup>-7</sup>), which suggests the lack of a genetic component for liver abscesses in these data. This was a preliminary study that had limited sire variation. Currently, dam information is being accumulated in an attempt to account for dam genetic variation.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"92d746fc892ffc18018c1e1530903f39ddbab70c1e2d31105aeaaed9f2bccea1","category":"Environment"}