{"title":"Tree Germination Sensitivity to Increasing Temperatures: A Global Meta‐Analysis Across Biomes, Species and Populations","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13921?af=R","date":1727753659000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Climate change is altering forest communities at an unprecedented pace. Current knowledge on trees' responses to climate shifts is based mostly on adults. Yet, germination traits and intraspecific variation can notably modulate species niches. This paper provides a quantitative review about warming effects on tree species' germination, the role of population effects and its implications under future climate.</p>\n<h2>Location</h2>\n<p>Global; covering boreal, temperate, Mediterranean and tropical–subtropical biomes.</p>\n<h2>Time Period</h2>\n<p>1996–2024.</p>\n<h2>Major Taxa Studied</h2>\n<p>Tree species.</p>\n<h2>Methods</h2>\n<p>We reviewed 50 papers addressing 63 species and 250 populations. Then, we conducted a meta-analysis to assess warming effects on germination percentage and time, and how germination is modulated by climate at seed origin. We further evaluated populations' adaptation to local temperature on 27 species. Finally, we estimated population-based germination niches in eight of these species under current climate conditions and a 2080 climate scenario (SSP5-8.5).</p>\n<h2>Results</h2>\n<p>Warming induced more consistent shifts in germination time than in percentage across biomes, hastening germination. Temperature at seed origin shaped responses to warming in boreal and temperate species. In Mediterranean and tropical–subtropical species, different responses were associated with variation in precipitation-related variables. Local adaptation was more frequent in species from the tropics, while adaptation lags towards warmer-than-today conditions observed in the other biomes. Simulation of germination niches yielded slight although extensive germination reductions in tropical–subtropical species under future climate, whereas the temperate and boreal ones showed overall increases.</p>\n<h2>Main Conclusions</h2>\n<p>Population-level adjustments are key moderators of germination percentage and phenology response to warming. Their roles vary depending on the prevailing climate in each biome. Temperature at seed origin is an important factor modulating temperate and boreal species' responses, while precipitation-related variables are more relevant in Mediterranean and tropical–subtropical ones. Local adaptation in the tropical species increases their vulnerability to warming.</p>","author":"Eduardo Vicente, \nMarta Benito Garzón","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"92db8ce06de9abb25c77c5ed06a1b34651b459a72dbc33b35df93d20f9732f38","category":"Environment"}