{"title":"Winter entrainment drives the mixed layer supply of manganese in the Southern Ocean","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12634?af=R","date":1722050329000,"content":"<h2>Abstract</h2>\n<p>Despite the subnanomolar dissolved manganese concentrations that can co-limit Southern Ocean primary production, their physical supply mechanisms during winter, for biological consumption in spring and summer have not yet been explored. During austral winter and spring 2019, two cruises were conducted in the Atlantic sector of the Southern Ocean, to determine the distribution and surface water supply mechanisms of dissolved manganese in the upper water column. The supply mechanisms were used to calculate the total flux of dissolved manganese to productive surface waters and were compared to biological consumption estimates. Mean dissolved manganese concentrations in the upper water column (&lt; 500 m) during winter and spring were comparably low (≤ 0.34 nmol kg<sup>−1</sup>; <i>p</i> &gt; 0.05), with seasonal mixed layer reservoir sizes averaging 65.21 ± 12.93 and 21.64 ± 19.32 <i>μ</i>mol m<sup>−2</sup>, respectively. Winter entrainment contributed 89.33–99.99% (average 97.26% ± 5.28%) of the total dissolved manganese flux, while diapycnal diffusion contributed 0.52–10.58% (average 4.92% ± 5.14%), was identified as the dominant mechanisms for transporting dissolved manganese into the mixed layer in the subantarctic zone, polar frontal zone, and antarctic zone. Here, the winter physical supply rates were higher than the estimated consumption rates during spring, meeting phytoplankton biological demands. Whereas in the subtropical zone, the supply rates were lower than the consumption rates, indicating the presence of additional supply mechanisms such as coastal upwelling, which may help to meet the biological demands in this region.</p>","author":"Thapelo Ramalepe, \nSaumik Samanta, \nRyan Cloete, \nThomas J. Ryan‐Keogh, \nAlakendra N. Roychoudhury","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"92dc69648a5d3f6019e0a07d18b994d9edf3fc8ef6765742115b23b50f9b6640","category":"Environment"}