{"title":"Apple Card Monthly Financing No Longer Available for SIM-Free iPhones","link":"https://www.macrumors.com/2023/08/15/apple-card-financing-no-sim-free-iphones/","date":1692117782000,"content":"Apple today updated its U.S. <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a> Monthly Installment plan to require those who use the feature to purchase an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> that is linked to AT&amp;T, Verizon, or T-Mobile. With this change, the ‌Apple Card‌ Monthly Installment plan can no longer be used to purchase a SIM-free ‌iPhone‌.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/04/apple-card-feature2.jpg\" alt width=\"1144\" height=\"644\" />\r<br />\nAll iPhones purchased through the ‌Apple Card‌ Monthly Installment plan are unlocked so carrier switching is available at any point, but at purchase, customers will need to have a plan with a supported carrier. Buying a SIM-free ‌iPhone‌ and linking it to a carrier like Mint Mobile will no longer be possible using installments.\r<br />\n\r<br />\nApple announced these changes in an <a href=\"https://www.macrumors.com/2023/06/14/apple-card-monthly-installments-term-apple-watch/\">updated support document</a> back in June, and the monthly installment plan has officially been updated. Prior to now, ‌Apple Card‌ installments could be used to purchase an ‌iPhone‌ online with the option to connect to a carrier at a later date, which allowed customers to buy an ‌iPhone‌ and then link it to any carrier of their choosing.\r<br />\n\r<br />\nApple already required customers using ‌Apple Card‌ installments to choose one of the main three carriers when in stores, and now the online policy matches the in-store policy.\r<br />\n\r<br />\nWith the ‌Apple Card‌ Monthly Installment plan, ‌Apple Card‌ holders can pay for their devices over a 24-month period with 0% APR and 3% Daily Cash back on payments.\r<br />\n\r<br />\nApple today is also changing the monthly installment term for the Apple Watch, and customers will be required to pay off the device over 12 months instead of 24 months. Apple now uses a 12-month term for Apple Watch, Macs, displays, and iPads, with the 24-month term limited to the ‌iPhone‌.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-card/\">Apple Card</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/15/apple-card-financing-no-sim-free-iphones/\">Apple Card Monthly Financing No Longer Available for SIM-Free iPhones</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-card-monthly-financing-no-longer-available-for-sim-free-iphones.2398717/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"92e8691d73da0e1bc5486764e1f9f6ed7ca46252b15ac6b2240cf004b797ed87","category":"Apple"}