{"title":"Trains were designed to break down after third-party repairs, hackers find","link":"https://arstechnica.com/?p=1990928","date":1702505660000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Newag-YouTube-800x437.jpg\" alt=\"Dragon Sector uploaded a video to social media after discovering an &quot;undocumented ‘unlock code’ which you could enter from the train driver’s panel&quot; fixed &quot;mysterious issues&quot; impacting trains in Poland.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/Newag-YouTube.jpg\">Enlarge</a> <span>/</span> Dragon Sector uploaded a video to social media after discovering an \"undocumented ‘unlock code’ which you could enter from the train driver’s panel\" fixed \"mysterious issues\" impacting trains in Poland. (credit: <a href=\"https://www.youtube.com/watch?v=Gv6vjhkLQpM\"> Adam Haertle on YouTube</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An unusual right-to-repair drama is disrupting railroad travel in Poland despite efforts by hackers who helped repair trains that allegedly were designed to stop functioning when serviced by anyone but Newag, the train manufacturer.</p>\n<p>Members of an ethical hacking group called Dragon Sector, including Sergiusz Bazański and Michał Kowalczyk, were called upon by a train repair shop, Serwis Pojazdów Szynowych (SPS), to analyze train software in June 2022. SPS was desperate to figure out what was causing \"mysterious failures\" that shut down several vehicles owned by Polish train operator the Lower Silesian Railway, Polish infrastructure trade publication Rynek Kolejowy <a href=\"https://www.rynek-kolejowy.pl/wiadomosci/afera-hakerska--mamy-stanowiska-sps-i-newag--116410.html\">reported</a>. At that point, the shortage of trains had already become \"a serious problem\" for carriers and passengers, as fewer available cars meant shorter trains and reduced rider capacity, Rynek Kolejowy reported.</p>\n<p>Dragon Sector spent two months analyzing the software, finding that \"the manufacturer's interference\" led to \"forced failures and to the fact that the trains did not start,\" and concluding that bricking the trains \"was a deliberate action on Newag's part.\"</p></div><p><a href=\"https://arstechnica.com/?p=1990928#p3\">Read 19 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1990928&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"92ecd5c11cf09fb699bd6f69213cfb6e9acb585c81c1947516af244f139aede3","category":"Tech"}