{"title":"Van der Poel expects an ‘open battle’ at Strade Bianche: Daily News","link":"https://cyclingtips.com/2021/03/van-der-poel-expects-an-open-battle-at-strade-bianche-daily-news/","date":1614982486000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>We head into the weekend with status updates from both Remco Evenepoel and Fabio Jakobsen as well as a few more Strade Bianche news items as the race looms.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Van der Poel: &#8216;I expect an open battle&#8217; at Strade Bianche</h3>\n\n\n\n<p><strong>Mathieu van der Poel</strong> will start <strong>Strade Bianche</strong> as one of the top favorites for the race alongside 2020 winner <strong>Wout van Aert</strong> and 2019 winner <strong>Julian Alaphilippe</strong>, but he said on Friday that he expects there to be more than just three riders contending for the victory in the Italian one-day.</p>\n\n\n\n<p>&#8220;I agree to a certain extent that people see me as one of the favorites, although I believe that the parcours fits slightly better to the real climbers,&#8221; Van der Poel said ahead of the race.</p>\n\n\n\n<p>&#8220;On the other hand, Van Aert for example has already proven that also a Classics rider can win this race. But there will be a lot of strong contestants at the start. I expect an open battle.&#8221;</p>\n\n\n\n<p>Van der Poel&#8217;s assessment was similar to the one Van Aert made on Thursday; the defending champ said that it would be &#8220;wise to keep an eye on more guys&#8221; considering the strength of the field.</p>\n\n\n\n<p>Van der Poel also made a point to clarify that he wasn&#8217;t feeling the need to &#8220;settle a score&#8221; after not achieving quite the results he&#8217;d hoped for last year.</p>\n\n\n\n<p>&#8220;I don&#8217;t feel like I have unfinished business here after last year. My Italian program in general was a bit disappointing, but it&#8217;s not that I came back here to settle a score,&#8221; he said.</p>\n\n\n\n<p>&#8220;I came here to perform well, and of course I hope to do better than in 2020.&#8221;</p>\n\n\n\n<h3>Deignan will miss Strade Bianche due to illness, Brand will make the start</h3>\n\n\n\n<p><strong>Lizzie Deignan</strong>, who won <strong>Strade Bianche</strong> in 2016, will miss this year&#8217;s edition due to illness, but <strong>Trek-Segafredo</strong> will nonetheless line up for the race with multiple riders to watch.</p>\n\n\n\n<p>2017 winner <strong>Elisa Longo Borghini</strong> and <strong>Lucinda Brand</strong>, who won the elite women&#8217;s title at Cyclocross Worlds in January, headline the roster unveiled by Trek-Segafredo on Thursday. Also making the start for Trek-Segafredo will be <strong>Audrey Cordon-Ragot</strong>, <strong>Chloe Hosking</strong>, <strong>Ellen van Dijk</strong>, and <strong>Tayler Wiles</strong>.</p>\n\n\n\n<h3>Women&#8217;s Strade Bianche prize money crowdfunding effort has raised over €21,000</h3>\n\n\n\n<p>The Equal Prize Money for the Women&#8217;s Peloton <strong>crowdfunding campaign</strong> on GoFundMe has raised over €21,000 as of publication time.</p>\n\n\n\n<p>Started by Dutchman Cem Tanyeri earlier this week amid discussions around the cycling world about the disparity in prize money between the men&#8217;s and women&#8217;s races at the <strong>Omloop Het Nieuwbslad</strong>, the campaign initially had a goal of raising €5,000. It has now more than quadrupled that amount, with the final total set to be given to the top five finishers at <strong>Strade Bianche</strong> on Saturday.</p>\n\n\n\n<h3>Evenepoel: &#8216;Nothing is holding me back anymore to start the preparation for my season&#8217;</h3>\n\n\n\n<p><strong>Remco Evenepoel</strong> has provided an update on his status as he works towards his return to racing this season. The 21-year-old Belgian suffered a fractured pelvis and other injuries in a crash at <strong>Il Lombardia</strong> last year and has not raced since, but he recently returned to training with an eye towards racing the <strong>Giro d&#8217;Italia</strong>. As he said on social media on Friday, recent medical evaluations went well.</p>\n\n\n\n<p>&#8220;This was an important week, after testing at the Bakala Academy and another scan &amp; check up with the medical staff, nothing is holding me back anymore to start the preparation for my season to come!&#8221; Evenepoel wrote on Instagram. &#8220;I want to thank the team doctors, the hospital in Herentals, all the staff of @deceuninck_quickstepteam and especially my family and close friends for the support in those difficult times! I cannot thank you enough…&#8221;</p>\n\n\n\n<p>Deceuninck-Quick-Step has said that Evenepoel is aiming to make his first start of the season at the Giro, which gets underway on May 8.</p>\n\n\n\n<h3>Jakobsen sees the &#8216;light at the end of the tunnel&#8217;</h3>\n\n\n\n<p>In other news of the recovery of a talented <strong>Deceuninck-Quick-Step</strong> rider, <strong>Fabio Jakobsen</strong> provided an update on his status on Friday. The Dutch speedster, who suffered numerous fractures in his face and other injuries in a crash on the opening stage of the <strong>Tour of Poland</strong> last year, has undergone multiple surgeries since. Last month, he had implants placed in his jaw that will allow him to get new teeth.</p>\n\n\n\n<p>&#8220;Almost time to restart again! Healing process seems to be going well,&#8221; Jakobsen wrote on Twitter. &#8220;The last 3 weeks have been painful and I struggled with eating and drinking. Implants/screws are in and scar tissue removal/reconstruction completed. Now it will take another 4/5 months to let everything heal and grow strong before I’ll get my ‘new’ teeth. Monday the stitches will be removed and I hope to get back to training! In this way I would like to thank everybody that helped me get this far in my recovery process. There is light at the end of the tunnel and I’m going for it!&#8221;</p>\n\n\n\n<h2>Coming Up &#8230;</h2>\n\n\n\n<p>As you almost certainly already know if you&#8217;ve read any of the news items above, Strade Bianche will take place on Saturday in Italy. The women&#8217;s and men&#8217;s races will both start and finish in Siena, with the women&#8217;s peloton traversing 136 km and the men&#8217;s peloton covering 184 km. Plenty of gravel sections and a few punchy climbs, particularly the final one into the Piazza del Campo, await. Anna van der Breggen, Annemiek van Vleuten, and Kasia Niewiadoma are among the favorites for the women&#8217;s race. Wout van Aert, Mathieu van der Poel, and Julian Alaphilippe will be riders to watch in the men&#8217;s race.</p>\n\n\n\n<p>Then, on Sunday, Paris-Nice gets underway. The eight-day of French stage race will feature a few days for the fast finishers, an individual time trial, and some tough mountain climbs. Potential overall contenders include Primoz Roglic, Tao Geoghegan Hart, and Jai Hindley, while the start list also includes strong sprinters like Sam Bennett, Pascal Ackermann, and Giacomo Nizzolo, to name only a few of the big names set to attend.</p>\n\n\n\n<h2>In case you missed it &#8230;</h2>\n\n\n\n<ul><li>The latest episode of the <a href=\"https://cyclingtips.com/2021/03/freewheeling-podcast-the-great-prize-money-debate-of-omloop-het-nieuwsblad/\" target=\"_blank\" rel=\"noreferrer noopener\">Freewheeling Podcast</a> includes conversations about <strong>prize money</strong> and <strong>Strade Bianche</strong> and chats with <strong>Emma Cecilie Norsgaard</strong> and <strong>Marta Cavalli</strong>.</li><li>José Been caught up with <strong>Peter Van Petegem</strong> to talk about <a href=\"https://cyclingtips.com/2021/03/where-are-they-now-flanders-and-roubaix-winner-peter-van-petegem/\" target=\"_blank\" rel=\"noreferrer noopener\">his career and what he&#8217;s up to now</a>.</li></ul>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/van-der-poel-expects-an-open-battle-at-strade-bianche-daily-news/\">Van der Poel expects an &#8216;open battle&#8217; at Strade Bianche: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"92f278dd90862a9591344177ca14eb5eb79853fe70ff48a8e6207bcde1c06882","category":"Cycling"}