{"title":"Porsche’s new synthetic gasoline may fuel Formula 1 races","link":"https://arstechnica.com/?p=1793855","date":1631343619000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/EX19U17ID0006_low-800x450.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/EX19U17ID0006_low.jpeg\">Enlarge</a> <span>/</span> 70 percent of the cars Porsche has ever built are still on the road. Since it wants to keep it that way, its developing a synthetic fuel that emits 90 percent less CO2 than gasoline derived from fossil fuels. (credit: Porsche)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Even with the best will in the world, it will be many years before we entirely decarbonize our transport. The UK, France, China, <a href=\"https://arstechnica.com/cars/2020/09/by-2035-new-trucks-and-cars-sold-in-california-must-be-emissions-free/\">and even California</a> have announced plans to phase out the sale of new vehicles with internal combustion engines in the late 2030s, but to our knowledge, none of these plans include a ban on vehicles already on the road. If those cars and trucks are going to keep driving for a while longer, it behooves us to get creative when it comes to the fuel they'll burn.</p>\n<p>Which is why I'm a little excited about a collaboration between Porsche and Siemens to do just that. <a href=\"https://arstechnica.com/cars/2021/03/porsche-will-start-testing-a-lower-carbon-biofuel-in-racing/\">As we reported earlier this year</a>, Porsche and Siemens are developing a low-carbon synthetic fuel that combines green hydrogen (produced by wind-powered electrolysis) with carbon dioxide (filtered from the atmosphere) to form methane, which is in turn then turned into gasoline.</p>\n<p>On Friday, the two organizations broke ground on the Haru Oni manufacturing plant near Punto Arenas in Chile. Assuming all goes to plan, the plant should be able to produce 34,000 gallons (130,000 L) of synthetic fuel in 2022, before scaling up to 14.5 million gallons (55 million L) by 2024 and 145 million gallons (550 million L) by 2026, at a cost of around $7.6 per gallon ($2 per L).</p></div><p><a href=\"https://arstechnica.com/?p=1793855#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793855&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9300deb93d6a83412c8aed04fc2e61ad54c715fe036ce221f3e6cfb87b090144","category":"Tech"}