{"title":"Ubisoft at E3: Mario Rabbids sequel, Rainbow Six: Extraction, more","link":"https://arstechnica.com/?p=1772743","date":1623527122000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Screenshot-5311-980x649.png\" /></div>\n        <p>\n          <em>Rainbow Six Siege</em> meets <em>Left 4 Dead</em> in this new three-player co-op gun game, coming September 16 to PC and most consoles.                  </p>\n        </div>\n      </li>\n      </ul><p>On Saturday, Ubisoft joined the E3-timed announcement fray with<a href=\"https://www.youtube.com/watch?v=ydOv_hunhjE\"> its latest Ubisoft Forward video presentation</a>, complete with a mix of familiar and brand-new game announcements.</p>\n<p>The showcase kicked off with <em>Rainbow Six: Extraction</em>, a three-player co-op battling game that drops an alien invasion on top of Tom Clancy's tactical-combat universe. (Did I miss that particular subgenre of Clancy books? No matter.) The game will launch on PC and most consoles on September 16.</p>\n<p>A meaty gameplay preview video showed a three-player squad moving through one of the game's combat levels, which will combine bespoke architecture with random alien placements—and Ubisoft's reps hinted to the aliens being able to create walls, gates, and restrictions to randomly redefine your descent into each level's belly. The resulting gameplay resembles<em> Left 4 Dead</em>, with a mix of weak and superpowered aliens (dubbed \"Archies\") potentially splitting squads up as they battle and survive.</p></div><p><a href=\"https://arstechnica.com/?p=1772743#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1772743&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9302f62d5924cc80501686b12881f68573123c9e4e8ddf1c9726cd2d3f8b4906","category":"Tech"}