{"title":"Lachlan Morton to ride entire 2021 Tour de France route unsupported – including transfers","link":"https://www.bikeradar.com/news/lachlan-morton-alt-tour/","date":1624701624000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Lachlan-Morton-Alt-Tour-01f311a.jpg?quality=90&amp;resize=620,413\" />                                            <p>Lachlan Morton of EF Education-Nippo is planning to ride the entirety of the 2021 <a href=\"https://www.bikeradar.com/events/tour-de-france/\">Tour de France</a> route unsupported.</p>\n<p>Dubbed the Alt Tour, and inspired by the earliest editions of the race that saw riders complete the Tour without the army of support that now accompanies the event, Morton will set off today (Saturday 26 June) and aims to beat the peloton to Paris.</p>\n<p>Already a frankly ridiculous goal, the Australian hasn’t made it any easier for himself. As well as riding the 21 stages, he will be riding the transfers between stages too, which will regularly add 100km to each day, while the final transfer to Paris is 700km.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Morton’s route will cover 5,510km.</span></figcaption><span> <i>Rapha the Alt Tour</i></span></div>\n<p>This will bring the total distance Morton aims to cover to 5,510km, with more than 65,000m of climbing, enduring an extra 2,400km of riding and 15,000m of ascent when compared to peloton’s Tour de France.</p>\n<p>Morton expects to complete his ride in 238 hours across 23 days, and you’ll be able to dot-watch his progress via the <a href=\"https://www.awin1.com/cread.php?id=489797&amp;clickref=bikeradar-0&amp;awinmid=18515&amp;p=https%3A%2F%2Fwww.rapha.cc%2Fgb%2Fen%2Fstories%2Fthe-alt-tour\" target=\"_blank\">Rapha Alt Tour</a> page.</p>\n<h2>A lifetime of prep?</h2>\n<p>Anyone who has followed the career of Lachlan Morton will know his path hasn’t followed the same trajectory as other professional road riders.</p>\n<p>Morton has stepped away from pro racing a number of times, including a stint undertaking trips with his brother, riding across Australia, the Rocky Mountains and Colombia, documented in the Thereabouts film series.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Lachlan Morton is no stranger to pushing himself in alternative events. Here he’s riding the 2020 Badlands, a 725km off-road race in Europe.</span></figcaption><span> <i>Oliver Grenaa</i></span></div>\n<p>Further to this, the Alternative Calendar established with Rapha and EF Education-Nippo in 2019 has seen Morton complete cyclocross, mountain and gravel events such as the Three Peaks, Leadville Trail 100 MTB and Unbound.</p>\n<p>Morton has a history of foregoing the comforts and glamour normally associated with professional cycling and says that without intention he has spent his  “whole life” preparing for the Alt Tour.</p>\n<p>“I know it’s going to be the most physically demanding ride I’ve undertaken but I anticipate the challenges of completing the route self-supported to be equally difficult,” Morton says.</p>\n<h2>Raising funds for World Bicycle Relief</h2>\n<p>While Morton’s ride is an impressive (to put it lightly) feat of endurance, <a href=\"https://www.bikeradar.com/brand/rapha/\">Rapha</a> says he will also be “riding with a new purpose.”</p>\n<p>In honour of Morton’s ride, Rapha and EF Education-Nippo will be donating 500 bikes each to World Bicycle Relief, a non-profit organisation that delivers bicycles to people in need.</p>\n<p>Rapha says that anyone inspired by the Alt Tour and Morton’s efforts can also donate “to provide even more young people with the bikes they need to access an education.”</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"93075164ce2f061d3bfc7ba653a6ca5bc02b742d5326c46809c98dc1d4a25704","category":"Cycling"}