{"title":"AI and the Sustainability of the Signaling and Human Capital Roles of Higher Education","link":"https://www.preprints.org/manuscript/202409.0538/v1","date":1725617322000,"content":"Over the last several decades there has been an arms race to acquire credentials as higher education has shifted from an elitist system to mass education. From an individual perspective, given the higher education system and labor market conditions, it is rational to pursue advanced qualifications. However, whether the education system delivers improvements in human capital or is principally a signaling mechanism is questionable. Estimates of the proportion of labor market rewards due to signaling range as high as 80%, suggesting that education is not only expensive but inefficient. In an increasingly transactional environment in which education providers are highly motivated by financial considerations, this situation is only likely to be exacerbated by the rapid developments in AI. The use of AI has the potential to make learning more effective but, given that many students see credential acquisition as transactional, it may reduce both human capital and the value of the signaling effect. If the credibility of the credentials offered is further damaged, the sustainability of the higher education sector in its present form and scale may well be unsustainable. We examine the evidence on credential inflation, returns to education and mismatch of graduates to jobs before analyzing how AI is likely to affect these trends. We then suggest possible responses of prospective students, education providers and employers to the growing adoption of AI in both education and the workplace. We conclude that the current offerings of generalist degrees, as opposed to vocational qualifications, are not sustainable and that to survive, even in a downsized form, the sector must respond to this disruptive technology by changing both the nature of its offerings and its methods of ensuring that the credentials they offer reflect genuine student learning.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"930b1c1c31c25a85984927c13f3e3723ac0c60064a9f6f0f6d62decde4abc465","category":"Interdisciplinary"}