{"title":"A new spider mite elicitor triggers plant defence and promotes resistance to herbivores","link":"https://academic.oup.com/jxb/article/75/5/1493/7408689?rss=1","date":1699660800000,"content":"<span><div>Abstract</div>Herbivore-associated elicitors (HAEs) are active molecules produced by herbivorous insects. Recognition of HAEs by plants induces defence that resist herbivore attacks. We previously demonstrated that the tomato red spider mite <span>Tetranychus evansi</span> triggered defence in <span>Nicotiana benthamiana</span>. However, our knowledge of HAEs from <span>T. evansi</span> remains limited. Here, we characterize a novel HAE, Te16, from <span>T. evansi</span> and dissect its function in mite-plant interactions. We investigate the effects of Te16 on spider mites and plants by heterologous expression, virus-induced gene silencing assay, and RNA interference. Te16 induces cell death, reactive oxygen species (ROS) accumulation, callose deposition, and jasmonate (JA)-related responses in <span>N. benthamiana</span> leaves. Te16-mediated cell death requires a calcium signalling pathway, cytoplasmic localization, the plant co-receptor BAK1, and the signalling components SGT1 and HSP90. The active region of Te16-induced cell death is located at amino acids 114–293. Moreover, silencing <span>Te16</span> gene in <span>T. evansi</span> reduces spider mite survival and hatchability, but expressing <span>Te16</span> in <span>N. benthamiana</span> leaves enhances plant resistance to herbivores. Finally, <span>Te16</span> gene is specific to <span>Tetranychidae</span> species and is highly conserved in activating plant immunity. Our findings reveal a novel salivary protein produced by spider mites that elicits plant defence and resistance to insects, providing valuable clues for pest management.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"9312208e738a6fc739f051e81c5b356d3c12b0a459e369597e47a2de222e4f5d","category":"Environment"}