{"title":"ศาลสหรัฐฯ สั่งแอปเปิลต้องเปิดให้ผู้พัฒนาแอปโฆษณาช่องทางเก็บเงินโดยตรงภายใน 90 วัน","link":"https://www.blognone.com/node/124697","date":1631293939000,"content":"<div><div><div><p>ศาลรัฐนอร์ทแคโรไลน่า<a href=\"https://s3.documentcloud.org/documents/21060628/epic-apple-injunction.pdf\">ออกคำสั่งศาล (injunction) บังคับแอปเปิลต้องอนุญาตให้ผู้พัฒนาแอปโฆษณาช่องทางจ่ายเงินทางอื่นนอกเหนือจาก In-App Purchase (IAP)</a> ภายใน 90 วัน ซึ่งหากคำสั่งนี้มีผล วันที่ 9 ธันวาคมที่จะถึงนี้ก็จะเป็นวันปลดพันธการของนักพัฒนาแอป ทำให้สามารถเก็บเงินได้โดยไม่ต้องเสียส่วนแบ่งให้กับแอปเปิลอีกต่อไป</p>\n<p>คำสั่งนี้เป็นผลมาจากคดี Apple v. Epic Games ที่เกิดจากทาง <a href=\"https://www.blognone.com/node/117953\">Epic รับจ่ายเงินผ่านบัตรเครดิตในเกม Fortnite โดยตรงและถูกแอปเปิลแบนในเวลาต่อมา</a> โดยคำวินิจฉัยระบุว่าแอปเปิลไม่ได้ผูกขาดแต่อย่างใด แต่ระบุว่าแนวทางของแอปเปิลนั้นต่อต้านการแข่งขัน (anti-competitive) ทำให้มีคำสั่งออกมา</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/b3b3756ecc420b6187abf7268c6ef2b0.jpg\" /></p>\n<p>เงื่อนไขการห้ามจ่ายเงินเข้าผู้พัฒนาซอฟต์แวร์โดยตรงของแอปเปิลนั้นเข้มงวดอย่างมาก ที่ผ่านมาแอปเปิลห้ามแอปโฆษณาว่าสามารถจ่ายเงินตรงได้ ห้ามแม้แต่การแสดงลิงก์ไปยังเว็บภายนอกเพื่อจ่ายเงิน เดิมนั้นแอปต่างๆ มีทางเลือกคือยอมให้แอปเปิลกินส่วนต่าง 30% จากการจ่ายเงินในแอป บางรายอาจจะขึ้นราคาเมื่อซื้อผ่านบริการ IAP ของแอปเปิลเพื่อชดเชยส่วนต่าง หรือบางรายเช่น Kindle นั้นทำแอปให้เป็นแอปอ่านอย่างเดียว ไม่มีช่องทางซื้อคอนเทนต์เลย</p>\n<p><a href=\"https://s3.documentcloud.org/documents/21060631/apple-epic-judgement.pdf\">คำพิพากษา</a>มาพร้อมกับคำสั่งอีกหลายคำสั่ง สำหรับกรณี Fortnite เองทาง Epic Games ต้องจ่ายค่าเสียหายให้แอปเปิลฐานรับบัตรเครดิตโดยตรงทั้งหมด 3.65 ล้านดอลลาร์ และคำพิพากษาระบุว่าการที่แอปเปิลแบนบัญชี Epic นั้นชอบด้วยกฎหมายแล้ว</p>\n<p>งานนี้แม้ Epic Games จะต้องจ่ายค่าเสียหายหลายล้านดอลลาร์ แต่การที่แอปเปิลถูกบังคับให้ต้องปล่อยให้แอปโฆษณาช่องทางรับเงินด้วยตัวเองก็น่าจะสร้างความเสียหายทางธุรกิจให้กับแอปเปิลสูงกว่าหลายสิบหลายร้อยเท่า</p>\n<p>ที่มา - <a href=\"https://arstechnica.com/gadgets/2021/09/injunction-apple-must-open-up-app-store-payments-in-90-days/\">ArsTechnica</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/app-store\">App Store</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/epic-games\">Epic Games</a></div><div><a href=\"/topics/lawsuit\">Lawsuit</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"931583ffc5a1ba02fea31943549051c2261725f420c57a02c1ca23957f108e56","category":"Thai"}