{"title":"Effect of Portulaca (Portulaca oleracea L.) extract on the quality and physicochemical attributes of vacuum‐packed seasoned steaks during chilled storage","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13420?af=R","date":1709126987000,"content":"<h2>ABSTRACT</h2>\n<h2>Background</h2>\n<p>Vacuum packaging had the ability to reduce oxidative deterioration and microbial-induced spoilage of meat. However, in an oxygen-free environment, it can lead to the development of an unappealing purplish-red color and a decrease in the water-holding capacity of meat, thereby impacting the overall meat quality. <i>Portulaca oleracea</i> L. (POL) was a homology of medicine and food known for its exceptional antioxidant and antimicrobial properties.</p>\n<h2>Results</h2>\n<p>The aim of our present study was to investigate the antioxidant and antimicrobial ability of n-butanol phase extract of POL and the effect of POL extract incorporating on the quality (water-holding capacity, shear force, color, and texture) and physicochemical (pH, TVB-N, and total viable counts) attributes of vacuum-packed seasoned steaks at 4°C over a 15-day period. Results showed that the POL extract had excellent antioxidant and antimicrobial capacity. Furthermore, the addition of POL extract significantly inhibited protein oxidation and microbial growth of steaks (<i>p</i> &lt; 0.05), and improved the water-holding capacity, color properties, and tenderness (<i>p</i> &lt; 0.05). Moreover, there were no significant differences (<i>p</i> &gt; 0.05) in the color, water-holding capacity, and tenderness between the 0.05% and 1% POL treatment groups compared to the sodium nitrite control group.</p>\n<h2>Conclusion</h2>\n<p>These results indicated that POL extract had the potential to replace sodium nitrite due to ability to hinder protein oxidation and microbial growth of vacuum-packed seasoned steaks, while enhancing the color, water-holding capacity, and tenderness of seasoned steaks.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Zhengshan Zhao, \nQiuhao Deng, \nXin Wang, \nHuijie Xiao, \nXiaojing Fan, \nLin Chen, \nXianchao Feng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9316301e2cb5158e38f827d63970a2abd826b6d62be1b204b17f2418669d6c26","category":"Environment"}