{"title":"Social and cultural aspects of human–wildlife conflicts: Understanding people's attitudes to crop‐raiding animals and other wildlife in agricultural systems of the Tibetan Plateau社会和文化视角下的人与野生动物冲突:青藏高原农区居民对肇事动物与其他野生动物的态度研究","link":"https://onlinelibrary.wiley.com/doi/10.1002/inc3.30?af=R","date":1706873130000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9fce752a-1eb7-4042-9b9f-191c63ced2d7/inc330-gra-0001-m.png\" alt=\"Social and cultural aspects of human–wildlife conflicts: Understanding people's attitudes to crop-raiding animals and other wildlife in agricultural systems of the Tibetan Plateau 社会和文化视角下的人与野生动物冲突:青藏高原农区居民对肇事动物与其他野生动物的态度研究\" /><p>In this case study from the eastern Tibetan area of China, we used a multi-year data set from a novel compensation insurance initiative in five Buddhist villages, coupled with an extensive questionnaire-based survey. Our aim was to elucidate the local people's tolerance to crop-raiding species. Wildlife tolerance was generally high and predominantly shaped by wildlife preference rather than by economic incentives or mitigation interventions. This finding provides valuable insight for practitioners, underscoring the necessity to consider the local context and the engagement of all stakeholders in conservation strategy.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The social dimensions of human–wildlife conflicts are becoming increasingly important. In regions where crop-raiding is a common issue, local people's attitudes toward wildlife is an important indicator of how successful conservation efforts are likely to be. One such area is the east Tibetan Plateau—a biodiversity hotspot with well-preserved forest ecosystems and mountain villages where subsistence farming is practiced. In this context, we conducted a survey of people's tolerance toward wildlife in five Tibetan villages that experience conflicts arising from crop-raiding incidents. We interviewed 83 respondents, 76 of whom were participants in a compensation scheme that provided payments for crop damage. Wildlife tolerance was generally high, mostly due to mutualistic wildlife values, whereby people believed they should coexist with animals equally instead of exploiting them as natural resources. Tolerance was influenced by people's wildlife preference rather than the level of damage to croplands: people were likely to show higher tolerance toward culturally important species even when they were crop-raiding animals. While economic and mitigation efforts as part of traditional conservation management led to increased tolerance, the compensation scheme and fencing were less important than wildlife preference. We suggest that conservation management for human-wildlife conflicts should develop region and stakeholder-specific engagement strategies. Crucially, such strategies should incorporate cultural considerations to fully address the complex human dimensions inherent in these issues.</p>\n<h2>摘要</h2>\n<p>人兽冲突中的社会科学视角正在变得越来越重要。在野生动物食用农作物的冲突频发地区，当地人对野生动物的态度是衡量保护工作成功与否的重要指标。位于生物多样性热点地区的青藏高原东部农区便是该类型区域的其中之一，这里森林生态系统保存完好，农区山地居民以自给农业为主。在此背景下，本研究针对因野生动物肇事而农作物受损高发的5个藏族村庄，调查了其村民对野生动物的容忍度。研究采访了83户村民，其中76户参与过针对作物损失的人兽冲突补偿项目。结果显示，受访者对野生动物的容忍度普遍较高，主要是由平等共生的野生动物价值观影响，人们认为他们应该与动物平等共存，而不是将其视作自然资源加以利用。容忍度受人们对野生动物的偏好所影响，而不是农田被破坏的程度，特别在文化上有一定意义的肇事动物，人们也通常对其表现出更高的容忍度。虽然经济手段和缓解措施作为传统保护管理的一部分，能在一定程度上提高人们的容忍度，但在此研究中补偿计划和围栏在针对容忍度的影响方面并没有人们对野生动物的偏好程度影响大。我们建议，人兽冲突的保护管理应制定针对特定区域以及特定利益相关方的具体策略。至关重要的是，这些策略应将本地文化因素纳入考量，以充分解决人兽冲突所固有的复杂的人文因素问题。【审阅:李梦姣】</p>","author":"Mengjiao Li, \nWei Jiang, \nBajin Li, \nNathalie Butt, \nAhimsa Campos‐Arceiz","siteTitle":"Wiley: Integrative Conservation: Table of Contents","siteHash":"b2434e359c647f096191c4befea99097fa9394fd28e02b126976eb35d9219c03","entryHash":"93246da9ac8cf9c2c44771d384265960cc690f94dbfe72235a0ecb1ad8c5b6ce","category":"Environment"}