{"title":"[ไม่ยืนยัน] Break Up Big Tech ที่แท้ จีนเตรียมจับแยก Alipay แยกส่วนเงินกู้ออกมาเป็นแอปอิสระ","link":"https://www.blognone.com/node/124722","date":1631516574000,"content":"<div><div><div><p>จากปรากฏการณ์รัฐบาลจีนคุมบริษัทเทคโนโลยีหลายราย และอาลีบาบาถือเป็นรายแรกที่โดนควบคุม ล่าสุด Financial Times รายงานว่าหน่วยงานกำกับดูแลของจีน สั่งให้ Ant Group จับแยก Alipay ออกเป็นส่วนๆ โดยให้แยกส่วนของธุรกิจให้กู้ยืมสองแห่งคือ Huabei ซึ่งคล้ายกับบัตรเครดิตแบบดั้งเดิมและ Jiebei ให้สินเชื่อขนาดเล็กที่ไม่มีหลักประกันออกจากบริการการเงินส่วนอื่นๆ ที่เหลือ และเปิดให้มีนักลงทุนภายนอกเข้ามาถือหุ้น</p>\n<p>นอกจากนี้ หน่วยกำกับดูแลยังอยากให้แยกธุรกิจของทั้งสองแอปเป็นอิสระจากกัน และ Ant Group ต้องส่งต่อข้อมูลผู้ใช้งานในการทำ credit scoring ไปยังอีกบริษัทหนึ่งซึ่งจากคำพูดคนวงในระบุว่ารัฐเป็นเจ้าของบางส่วน และยังบอกด้วยว่า รัฐบาลจีนมีความเชื่อว่าการที่บริษัทเทคโนโลยีจีนผูกขาดได้ขนาดนี้ เป็นเพราะบริษัทถือครองข้อมูลมหาศาล ซึ่งรัฐบาลต้องการหยุดสิ่งนี้</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/3d13379dfb030385e53a2e7da73d4b73.png\" /></p>\n<p>บริการเงินกู้ Huabei และ Jiebei เป็นพลังส่วนหนึ่งที่ขับเคลื่อนให้ Ant Group ได้เข้า IPO แต่ก็ถูกรัฐบาลจีนสั่งระงับเสียก่อน ข้อมูลจาก The CreditTech ระบุว่ารายได้จากทั้งสองธุรกิจแซงหน้าธุรกิจการชำระเงินหลักของ Ant เป็นครั้งแรกในครึ่งแรกของปี 2020 โดยคิดเป็น 39% ของรายได้ทั้งหมด</p>\n<p>ส่วนหนึ่งในบริษัทที่จะเข้ามาถือหุ้นคือ Zhejiang Tourism Investment Group ซึ่งมีรัฐเป็นเจ้าของ และจากคำพูดของคนที่อยู่ใกล้ชิดกับสถานการณ์ระบุว่า ทีมของแจ๊ค หม่า ยังคงเป็นหัวหลักเพราะทาง  Zhejiang ก็ไม่มีความรู้อะไรเลยเกี่ยวกับข้อมูลเงินกู้</p>\n<p>ที่มา - <a href=\"https://www.ft.com/content/01b7c7ca-71ad-4baa-bddf-a4d5e65c5d79\">Financial Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/alipay\">Alipay</a></div><div><a href=\"/topics/ant-group\">Ant Group</a></div><div><a href=\"/topics/china\">China</a></div><div><a href=\"/topics/fintech\">FinTech</a></div><div><a href=\"/topics/alibaba\">Alibaba</a></div><div><a href=\"/topics/jack-ma\">Jack Ma</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9325452dca16ae7342368f1e1033516810b897dd45ce6f6ac3215181191d127b","category":"Thai"}