{"title":"The m6A reader ECT8 is an abiotic stress sensor that accelerates mRNA decay in Arabidopsis","link":"https://academic.oup.com/plcell/article/36/8/2908/7687916?rss=1","date":1717545600000,"content":"<span><div>Abstract</div><span>N</span><sup>6</sup>-methyladenosine (m<sup>6</sup>A) is the most abundant mRNA modification and plays diverse roles in eukaryotes, including plants. It regulates various processes, including plant growth, development, and responses to external or internal stress responses. However, the mechanisms underlying how m<sup>6</sup>A is related to environmental stresses in both mammals and plants remain elusive. Here, we identified EVOLUTIONARILY CONSERVED C-TERMINAL REGION 8 (ECT8) as an m<sup>6</sup>A reader protein and showed that its m<sup>6</sup>A-binding capability is required for salt stress responses in Arabidopsis (<span>Arabidopsis thaliana</span>). ECT8 accelerates the degradation of its target transcripts through direct interaction with the decapping protein DECAPPING 5 within processing bodies. We observed a significant increase in the <span>ECT8</span> expression level under various environmental stresses. Using salt stress as a representative stressor, we found that the transcript and protein levels of ECT8 rise in response to salt stress. The increased abundance of ECT8 protein results in the enhanced binding capability to m<sup>6</sup>A-modified mRNAs, thereby accelerating their degradation, especially those of negative regulators of salt stress responses. Our results demonstrated that ECT8 acts as an abiotic stress sensor, facilitating mRNA decay, which is vital for maintaining transcriptome homeostasis and enhancing stress tolerance in plants. Our findings not only advance the understanding of epitranscriptomic gene regulation but also offer potential applications for breeding more resilient crops in the face of rapidly changing environmental conditions.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"932ab0e403b307b60722b31e2000c6cd13955d72f53a1b64484281643418ccbc","category":"Environment"}