{"title":"Defining a Professional Career Path for Research Core Technical Staff","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.957/7719996?rss=1","date":1721779200000,"content":"<span>Research Cores, often referred to as Core Facilities, have proliferated throughout the academic research community. These shared resources are laboratories that house sophisticated technologies to support the research enterprise, are typically staffed by dedicated Core personnel, and effectively operate as small businesses within their institutions. The broad adoption of the Research Core model is often attributed to the need to support expensive research equipment which may exceed the capabilities and/or budgets of individual investigators and for which the research need spans multiple research groups. While the genesis of many Cores may have been motivated by the resource efficiency that this transition provides, the real power of Cores lies within the expertise developed by and maintained among the Core staff. As research technologies have proliferated, the expertise required to apply these technologies to solve research problems often <span>only</span> exists within the core. We also observe trends toward increased needs for technology customization and technique development across the range of Core specialties. As such, Core staff play an outsized role in teaching and training students, advising them in research directions, collaborating with researchers and often making individual contributions to their fields. Furthermore, unlike individual investigator laboratories, which can often be siloed within institutions, Core staff provide a connection between groups and enable knowledge generation and sharing that otherwise may not exist. This “craft knowledge,” as it has recently been described [<a href=\"#ozae044.957-B1\">1</a>], defines the unique role that Core staff play and provides an opportunity to differentiate these roles from other roles in academia and elevate the visibility and prestige of these positions commensurate with their impact.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"932f31f0517936ff1650665d1017087e41de4d632a93bdc0c61e9fc689478e7f","category":"Environment"}