{"title":"Predictors of the return to work for pregnant employees on preventive leave: Patients from an occupational medicine consultation in Switzerland","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300686","date":1711116000000,"content":"<p>by Karine Moschetti, Loïc Brunner, Alessia Abderhalden-Zellweger, Isabelle Probst, Saira-Christine Renteria, Julien Vonlanthen, Peggy Krief</p>\r\n\r\nAccording to the Swiss legislation on maternity protection in the workplace (OProMa), if pregnant workers are exposed to occupational hazards and no protective measures are taken, a gynecologist will prescribe a certificate of preventive leave and the women must stop working. Returning to work is only possible if job adjustments are made. This study aims to evaluate the burden of absences on companies and to examine the predictors of the return to work for pregnant workers on preventive leave, by examining both the probability of return to work and the time required to return to work. The study sample includes data on 258 workplaces of pregnant workers on preventive leave, collected during an occupational medicine consultation aimed at supporting the implementation of the OProMa. Information is available on the worker (age, date of consultation), the hazards to which she is exposed, the company’s knowledge of the OProMa and whether a risk analysis exists. Descriptive statistics and multivariate regression analysis are carried out. In 58% of the workplaces, it was not possible to return to work before the end of the pregnancy. This corresponds to an average absence of 4.5 months. In 42% of the workplaces, a return to work was possible thanks to workplace adaptations. A conforming risk analysis and a full knowledge of the OProMa for companies, and an early visit to the occupational medicine consultation for workers are good predictors of the likelihood of returning to work. Younger age and exposure to certain types of risks are factors that influence the duration of preventive leave. The implementation of OProMa in Switzerland poses serious challenges, but early identification of occupational hazards and practices that anticipate compliance with the law in the company increase the return to work in safety for pregnant workers.","author":"Karine Moschetti","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93306dc352deaeab12dc6f39bf489eddfc6408528019e40e48b7da2d55dd84ef","category":"Interdisciplinary"}