{"title":"Comparative evaluation of HPV genotyping: A study on the performance concordance between Anyplex II HPV28 detection and Linear Array genotyping tests in nationwide studies in Brazil","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305122","date":1718114400000,"content":"<p>by Isabel Cristina Bandeira, Juliana Comerlato, Marina Bessel, Bruna Vieira Fernandes, Giana Mota, Luisa Lina Villa, Flávia Moreno Alves de Souza, Gerson Fernando Mendes Pereira, Eliana Marcia Wendland</p>\r\nBackground <p>Advances in laboratory techniques for HPV diagnosis necessitate a thorough assessment of the efficiency, replicability, sensitivity, and specificity of those methods. This study aims to validate and compare HPV detection/genotyping using the Anyplex™ II HPV28 Detection assay (Seegene) assay and the Linear Array HPV Genotyping test (Roche Diagnostics) on genital samples for use in epidemiological studies.</p> Methods <p>From 6,388 penile and cervical DNA samples collected in the POP-Brazil, 1,745 were randomly selected to be included in this study. The samples were submitted to HPV detection and genotyping following the manufacturers’ protocols. DNA was genotyped using the Anyplex™ II HPV28 Detection kit (Seegene), and the results were compared to those obtained using the Linear Array HPV Genotyping test (Roche Diagnostics). Concordance of HPV genotyping results was assessed by the percentage agreement and Cohen’s kappa score (κ).</p> Results <p>The agreement between the two methodologies was deemed good for HPV detection (κ = 0.78). Notably, Anyplex™ II HPV28 demonstrated enhanced capability in detecting a broader spectrum of genotypes compared to Linear Array.</p> Conclusion <p>Anyplex™ II HPV28 exhibited comparable results to the Linear Array assay in clinical specimens, showcasing its potential suitability for a diverse array of research applications requiring the detection and genotyping of HPV. The study supports the utility of Anyplex™ II HPV28 as an effective tool for HPV screening in epidemiological studies, emphasizing its robust performance in comparison to established diagnostic tests.</p>","author":"Isabel Cristina Bandeira","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"933a5b6df4fe17c0e5695bf8bb8e4eaaae9f9c6381a50be7681bbc129db38a49","category":"Interdisciplinary"}