{"title":"Effect of circle, surface type and stride duration on vertical head and pelvis movement in riding horses with pre-existing movement asymmetries in trot","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308996","date":1723816800000,"content":"<p>by Eva Marunova, Elin Hernlund, Emma Persson-Sjödin</p>\r\n\r\nHead and pelvis vertical movement asymmetries in horses are often evaluated under different conditions yet better understanding is required of how these asymmetries are altered by factors such as surface type or circle size. This study investigated how stride duration, surface and lungeing in circles of different sizes influenced objectively measured head and pelvis movement asymmetries in riding horses in full training. Movement asymmetries were recorded with body mounted accelerometers and were based on the differences between the two vertical displacement minima or maxima of head (HDmin, HDmax) and pelvis (PDmin, PDmax) within a stride cycle. Each horse was evaluated during straight-line trot and during lungeing (d = 10m/15m) on hard and soft surfaces at slow and fast speed (determined by stride duration). All horses (N = 76) had at least one movement asymmetry parameter above a predefined thresholds (|HDmin| or |HDmax| &gt;6mm, |PDmin| or |PDmax| &gt;3mm) during a straight line trot on hard surface (baseline). The horses were assigned to a ‘predominant asymmetry’ group (HDmin, HDmax, PDmin, PDmax) based on which movement asymmetry parameter was the greatest during the baseline condition; the head movement asymmetry values were divided by two to account for the difference in magnitude of the thresholds. Analysis was carried out for each predominant asymmetry group separately using linear mixed models—outcome variable: predominant asymmetry parameter; random factor: horse; fixed factors: surface, direction with stride duration as covariate (P&lt;0.05, Bonferroni post-hoc correction). The ‘direction’ conditions were either a straight-line locomotion (‘straight’) or lungeing with lungeing conditions further classified by circle diameter and by whether the limb which the predominant asymmetry was assigned to (‘assigned limb’) was on the inside or outside of the circle (‘inside10’, ‘inside15’, ‘outside10’, ‘outside15’). Only parameters related to asymmetrical weight-bearing between contralateral limbs (HDmin, PDmin) were affected by changes in stride duration–the most common pattern was an increase in asymmetries as stride duration decreased. Only pelvic movement asymmetries were affected by lungeing. When the assigned hindlimb was on the inside of the circle, the PDmin asymmetries increased and PDmax asymmetries decreased compared to the straight-line condition. With the assigned hindlimb on the outside, PDmin asymmetries decreased but PDmax asymmetries did not change. Trotting on 10 m circle compared to 15 m circle did not increase movement asymmetries. In conclusion, circular motion and changes in stride duration altered movement asymmetries identified in horses in full ridden work but no changes were seen between the soft and hard surfaces. These patterns should be further investigated in clinically lame horses.","author":"Eva Marunova","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"933ccb20049c7bf37f0fad7c45e7d67d480fbf2658b76e503e5d530d4a8dd564","category":"Interdisciplinary"}