{"title":"Cycling Plus June issue on sale now! Subscribe and receive a free Lezyne Micro Floor Drive Pump worth £54.99","link":"https://www.bikeradar.com/news/cycling-plus-latest-issue-gift/","date":1618300800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/03/BR_blog_image_379_new1-8b0492f.jpg?quality=45&amp;resize=620,413\" />                                            <p>In this latest issue the Cycling Plus team speak to the key workers for whom the bike has proved indispensable during lockdown. Cycling Plus readers reveal how buying an e-road bike has transformed their riding after injury and illness, plus there’s a free, 48-page Britain by Bike supplement that celebrates the best rides around the UK – from Inverness to Truro – with full route details, Komoot links and information on the best cafes, pubs, bike shops and picnic areas to stop off at en route.</p>\n<p>Also in this issue, chief technical editor Warren Rossiter gets first rides of the Cairn E-Adventure 1.0 and Wilier Filante SLR road bike while Matthew Loveridge takes the gravel-curious mile-munching Merida Scultura Endurance 7000-E out for a spin.</p>\n<ul><li><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW379&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=lezyne_CPW379&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe to Cycling Plus to receive your free gift as well as discounts and more</a></li>\n</ul><h2>A grand day out</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> New cyclists! Step up to the next level.</span></figcaption><span></span></div>\n<p>Spending a £1000 on a bike is a big step up for those who want to get serious about cycling. We reveal four of the most wallet-friendly, best bang-for-your-buck bikes with appearances from Boardman, Vitus, Giant and Genesis.</p>\n<h2>Pedal power</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Everything you need to know about clipless pedals.</span></figcaption><span></span></div>\n<p>With the promise of more efficient power transfer it makes sense to get stuck in and go with clipless pedals. The Cycling Plus team set to work finding out which are the top 10 pedals and what to look out for when making that purchase.</p>\n<h2>Small change, big rewards</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Top training tips from the experts.</span></figcaption><span></span></div>\n<p>From burnout to back problems to just plain old boredom, when training goes wrong it’s easy to find yourself stuck in a rut. James Witts takes the eight most common issues and talks to celebrity riders and experts about how to go about setting it right.</p>\n<h2>A Welsh adventure</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Not a soul to be seen in mid-Wales.</span></figcaption><span></span></div>\n<p>Trevor Ward explores the path less trodden on a visit to a deserted mid-Wales where he takes on the formidable, and notorious, Bwlch y Groes (Pass of the Cross) after which Trevor finds himself washed up on the shore of Lake Vyrnwy.</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Subscribe and save 35%.</span></figcaption><span></span></div>\n<p><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW379&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=lezyne_CPW379&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe to Cycling Plus magazine today</a> to join a community of like-minded cyclists and discover the latest news and views in cycling.</p>\n<p>Whether you’re looking at investing in a new bike, trying a different kind of cycling or searching for new gear to make those days on the road more comfortable, Cycling Plus is the magazine for you.</p>\n<p>You’ll find engaging, inspiring features and photography on every page from across the UK and around the world, plus interviews with the movers and shakers breaking records in cycling and becoming household names.</p>\n<p><a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW379&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=lezyne_CPW379&amp;utm_content=editorial-link\" target=\"_blank\">Subscribe today</a> and receive a free Lezyne Micro Floor Drive Mini Pump worth £54.99.</p>\n<section><div>\n        <p><strong>Why subscribe?</strong></p>\n<ul><li><span>Save 35% </span>on the shop price*</li>\n<li>Receive a Lezyne Micro Floor Drive Mini Pump worth £54.99</li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Zone!</li>\n</ul><p>\n\n    </p></div>\n    </section><p>You can <a href=\"https://www.buysubscriptions.com/print/cycling-plus-magazine-subscription?promo=CPW379&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=lezyne_CPW379&amp;utm_content=editorial-link\" target=\"_blank\">subscribe to Cycling Plus here</a> and check out the mag’s <a href=\"https://www.facebook.com/CyclingPlusMagazine/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/cyclingplus/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/cyclingplus\" target=\"_blank\">Twitter</a> accounts for all of the latest cycling news.</p>\n<p><em>*Offer open to new UK customers subscribing to the print edition only. Full details of the Direct Debit Guarantee will be provided and are available on request. Please allow 28 working days for delivery of your gift. You will receive 13 issues per year. Your subscription will start with the next available issue. If at any time you are dissatisfied please notify us in writing and we will refund you for all unmailed issues. 35% saving based on buying 13 issues at full UK shop price. In the unlikely event your selected gift is unavailable, we reserve the right to send an alternative gift. Offer ends: 12/05/21.</em></p>","author":"Katie Nicholls","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"933efe52643f396f6315fa070bb0cdd9bff7004084cf7481bcd00d37f1cf0b5f","category":"Cycling"}