{"title":"Predictive Links between Petal Color and Pigment Quantities in Natural Penstemon Hybrids","link":"https://academic.oup.com/icb/article/63/6/1340/7199657?rss=1","date":1686873600000,"content":"<span><div>Synopsis</div>Flowers have evolved remarkable diversity in petal color, in large part due to pollinator-mediated selection. This diversity arises from specialized metabolic pathways that generate conspicuous pigments. Despite the clear link between flower color and floral pigment production, quantitative models inferring predictive relationships between pigmentation and reflectance spectra have not been reported. In this study, we analyze a dataset consisting of hundreds of natural <span>Penstemon</span> hybrids that exhibit variation in flower color, including blue, purple, pink, and red. For each individual hybrid, we measured anthocyanin pigment content and petal spectral reflectance. We found that floral pigment quantities are correlated with hue, chroma, and brightness as calculated from petal spectral reflectance data: hue is related to the relative amounts of delphinidin vs. pelargonidin pigmentation, whereas brightness and chroma are correlated with the total anthocyanin pigmentation. We used a partial least squares regression approach to identify predictive relationships between pigment production and petal reflectance. We find that pigment quantity data provide robust predictions of petal reflectance, confirming a pervasive assumption that differences in pigmentation should predictably influence flower color. Moreover, we find that reflectance data enables accurate inferences of pigment quantities, where the full reflectance spectra provide much more accurate inference of pigment quantities than spectral attributes (brightness, chroma, and hue). Our predictive framework provides readily interpretable model coefficients relating spectral attributes of petal reflectance to underlying pigment quantities. These relationships represent key links between genetic changes affecting anthocyanin production and the ecological functions of petal coloration.</span>","author":"","siteTitle":"Integrative and Comparative Biology Current Issue","siteHash":"715dd1b0fb4f45600bceadb227e9b7fdf8bd9d1d7a2fd3d5e0399d2c1f410646","entryHash":"934390cbee548fe007b48473d0b7fb697e9ef8191493a2ec58c3ecce8a2ff532","category":"Environment"}