{"title":"Fenugreek Supplementation in Hybrid African Catfish Diets: Effect on Growth Performance, Physio‐Metabolic Response, and Antioxidant Enzyme Capacity","link":"https://onlinelibrary.wiley.com/doi/10.1155/2024/6017812?af=R","date":1727947157000,"content":"<p>The impact of dietary fenugreek (FN) supplementation on growth performance, physio-metabolic enzyme response, and antioxidant enzyme activities in hybrid African catfish (<i>Clarias gariepinus</i> ♀ × <i>Heterobranchus bidorsalis</i> ♂) was investigated in this study. Five isonitrogenous diets (38% crude protein) were developed and fed to the fish for 60 days. The FN was incorporated into the diets at 0%, 0.5%, 1.0%, 1.5%, and 2%. Two hundred twenty-five fingerlings of hybrid African catfish (average weight 4.01 g ± 0.02) were used for the study and randomly distributed to five dietary groups in triplicate. FN supplementation improved growth responses and survival rates; the dietary groups considerably (<i>p</i> &lt; 0.05) outperformed the control group. FN-based diets considerably increased the carcass protein content (<i>p</i> = 0.020) and improved protein retention (<i>p</i> = 0.015). FN supplementation markedly (<i>p</i> &lt; 0.001) and dose-dependently reduced the carcass’s lipid content and substantially (<i>p</i> &lt; 0.001) increased the levels of metabolic enzymes. The fish antioxidant capacity was significantly enhanced (<i>p</i> &lt; 0.001), and hepatic stress enzymes were greatly (<i>p</i> &lt; 0.001) lowered in FN-based diets. In summary, the second-order polynomial regression analysis indicates that the optimal dose of FN supplementation to improve hybrid catfish growth without negatively affecting the fish’s physio-metabolic response or overall wellbeing is 1% dietary inclusion level.</p>","author":"Wasiu Adeyemi Jimoh, \nFemi John Fawole, \nAyodeji Ahmed Ayeloja, \nOlayinka Abosede Ojo, \nBoluwatife Mary Ijalaye, \nAishat Yetunde Adesaogun, \nEmmanuel Oladele Olaitan, \nCarlos Rosas","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"9349a2efb758c8d8b5f932e2dfe6378ab51c0f3656d38f8f59962ec70370c2b5","category":"Environment"}