{"title":"Optimizing gelation properties of mixed meat myofibrillar proteins: investigating the effects of different proportions of beef, pork and chicken on physicochemical, structural and gelation properties","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13812?af=R","date":1724336692000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The gelation properties of myofibrillar protein (MP) directly affect the texture, taste and water-holding capacity (WHC) of meat products. To enhance the gelation properties of single-species meat MP, the present study investigated the influence of different proportions of beef, pork and chicken MP on the physicochemical properties, structure and gelation properties of the MP.</p>\n<h2>RESULTS</h2>\n<p>The results revealed that, when the proportion reached 5:2:3, the particle size decreases, leading to the maximum decomposition and unfolding of MPs, which exposes a greater number of hydrophobic amino acid residues. These changes promote interactions between protein molecules, especially the unfolding of <i>α</i>-helices and the formation of <i>β</i>-sheets during the heating process, which provides favorable conditions for the formation of protein gels and improves the gel strength and WHC of MP gels. Additionally, scanning electron microscopy revealed that the mixed MP gels are more compact and have more uniform gel networks and pores compared to single-species MP gels.</p>\n<h2>CONCLUSION</h2>\n<p>Based on these results, the synergistic effect is induced by the interactions between proteins from different. This research provides a method for the subsequent development of new meat products and improvement of meat product quality, and also lays a theoretical foundation for composite research of proteins from different sources. © 2024 Society of Chemical Industry.</p>","author":"Yajun Zhou, \nLuyao Guo, \nZhiyuan Ma, \nZongping Li, \nQingshu Ma, \nShujie Wang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"934bf6900e7ba96786f96237faa4522ec64ae399c24ae553e36b358054e12bb3","category":"Environment"}