{"title":"Effects of leaf litter traits on terrestrial isopod and millipede consumption, assimilation and growth","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14520?af=R","date":1715144986000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/faa2f337-bf39-49d1-b816-364352350ddf/fec14520-toc-0001-m.png\" alt=\"Effects of leaf litter traits on terrestrial isopod and millipede consumption, assimilation and growth\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/31/effects-of-leaf-litter-traits-on-terrestrial-isopod-and-millipede-consumption-assimilation-and-growth/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nNutrient cycling through leaf litter consumption is an essential ecological function performed by macrodetritivorous invertebrates such as isopods and millipedes. Leaf litter consumption rates can vary greatly depending on the environment, consumer identity and litter traits, but generalizations about the effects of plant traits on macrodetritivore leaf litter consumption, assimilation and growth are not well established and are mostly indirectly inferred.\n\nWe conducted a systematic search of the global literature and obtained 456 standardized measures from laboratory experiments of relative consumption (RCR), assimilation (RAR) and growth (RGR) rates of terrestrial isopods and millipedes, extracted from 56 different articles. We investigated if commonly measured leaf traits, plant functional groups, prior microbial conditioning of leaves and climatic conditions affected these rates. We obtained data on commonly measured leaf traits from the TRY global plant trait database, inferred plant functional groups from taxonomic groupings and obtained climatic data from information reported within articles.\n\nRCR, RAR and RGR varied greatly among macrodetritivore and plant species, but overall, there were no differences between isopods and millipedes. Microbial conditioning of litter greatly increased RCR. Plant functional group was an important predictor of RCR, with eudicot trees and forbs being consumed in greater quantities than magnoliid trees and grasses. Fresh leaf N:P ratio had a positive effect on RAR, and leaf N and C:N ratio had positive and negative effects on RGR, respectively, while climatic variables had weak effects on the three rates.\n\nOur work shows that plant traits (both those associated with plant functional groups and commonly measured leaf traits) exert strong effects on resource processing rates by terrestrial macrodetritivores. Further, prior microbial conditioning of leaf litter has a large and globally consistent positive effect on macrodetritivore litter consumption, suggesting that they may consume little, if any, freshly senesced leaf material when microbially conditioned litter is available. Our results suggest that, where extremes of temperature or precipitation do not occur, variables reflective of food quality (leaf traits and microbe conditioning) are more important drivers of macrodetritivore leaf litter consumption than are extrinsic climatic variables.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/01/31/effects-of-leaf-litter-traits-on-terrestrial-isopod-and-millipede-consumption-assimilation-and-growth/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Weng Ngai Lam, \nEleanor M. Slade, \nDavid A. Wardle","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"935c42dab372f9f692801a46aaf80ca7368d862c3f7b709f2ebc22de6baabd1e","category":"Environment"}