{"title":"Notability Changes App Subscription Policy, Promises Existing Users Lifetime Access to Purchased Features","link":"https://www.macrumors.com/2021/11/03/notability-changes-subscription-strategy-outcry/","date":1635927692000,"content":"Following an outcry from its users, Notability says it is making changes to its controversial subscription policy to ensure that people who previously purchased the app retain lifetime access to all current features and content.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/Notability-Feature.jpg\" />\r\n<br />\r\nThe course correction was announced by the company on Tuesday in a <a href=\"https://notability.medium.com/updates-to-notability-11-0-subscription-9f03a28a06f7\">Medium blog post</a>, after the popular note-taking app received substantial blowback from users who were annoyed to learn that Notability's switch to a subscription model meant features they had purchased would <a href=\"https://www.macrumors.com/2021/11/02/notability-users-frustrated-subscription-model/\">stop functioning after one year</a>.\r\n<br />\r\n<blockquote>Yesterday, we made a big announcement regarding our transition to a free app with an optional subscription. We heard the disappointment from our existing customers, and we want to correct our course.\r\n<br />\r\n\r\n<br />\r\nToday, we are making some changes (coming soon in Notability version 11.0.2). Everyone who purchased Notability prior to our switch to subscription on November 1st, 2021 will have lifetime access to all existing features and any content previously purchased in the app.</blockquote>Lifetime access will include unlimited editing, iCloud sync, and any features or content bought through in-app purchases, according to the developers, who added: \"Future features we develop may also be included, depending on their complexity and cost to maintain.\"\r\n<br />\r\n<blockquote>We are a small company, so we designed the original one-year access plan as a precautionary measure since we were not certain if we could support lifetime access. We sincerely apologize for putting our current users in this position.</blockquote>Notability's course correction means the app no longer appears to violate Apple's <a href=\"https://developer.apple.com/app-store/review/guidelines/#subscriptions\">App Store Review Guidelines</a>, which forbid apps that switch to a subscription model from taking away primary functionality existing users have already paid for. \r\n<br />\r\n\r\n<br />\r\n<div><blockquote><p>We heard you all and we want to make it right. We are making changes to our subscription so that our existing users will have lifetime access to their current features and content. See our blog for more details 💙<a href=\"https://t.co/YhIDIZHfWy\">https://t.co/YhIDIZHfWy</a></p>— Notability (@NotabilityApp) <a href=\"https://twitter.com/NotabilityApp/status/1455683644945678337?ref_src=twsrc%5Etfw\">November 2, 2021</a></blockquote> </div>\r\n<br />\r\nIt's not clear if Apple forced its hand to fall in line with the guidelines or consumer pressure was the main influence. Either way, Notability's change of course may make it unlikely that other app developers eyeing a subscription model will attempt a similar strategy of revoking features that existing users have already purchased.<div>Tag: <a href=\"https://www.macrumors.com/guide/notability/\">Notability</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/03/notability-changes-subscription-strategy-outcry/\">Notability Changes App Subscription Policy, Promises Existing Users Lifetime Access to Purchased Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/notability-changes-app-subscription-policy-promises-existing-users-lifetime-access-to-purchased-features.2321538/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n4KRAUDgHKQ:HyLg3vAy2kk:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=n4KRAUDgHKQ:HyLg3vAy2kk:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/n4KRAUDgHKQ\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"935f40b303274814f1609014548e6c6dd238e6166cbb05373ed04b80eda7c651","category":"Apple"}