{"title":"Rupert Murdoch’s answer to Google News is dead after only 18 months","link":"https://arstechnica.com/?p=1779162","date":1625866508000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/knewz-july-8th-800x370.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/knewz-july-8th.png\">Enlarge</a> <span>/</span> The now-defunct news aggregator was an excellent source of boldface, italics, underline, and wildly mismatched typefaces. (credit: <a href=\"https://web.archive.org/web/20210707085609/https://knewz.com/\">Jim Salter</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In August of 2019, Rupert Murdoch's News Corp announced that it was developing Knwez, its own \"conservative friendly\" alternative to Google News. Knewz went live without much fanfare in January of 2020, and officially died today, less than eighteen months later.</p>\n<h2>What was Knewz?</h2>\n<p>Knewz <a href=\"https://web.archive.org/web/20210702191056/https://knewz.com/about/\">described</a> itself as \"an innovative service designed to let you consume news from a wide variety of sources, free of the bias bubbles and vacuous verticals that frustrate so many discerning readers and thoughtful publishers.\" The service was operated by News Corp, the Murdoch-owned company behind Fox News, the New York Post, the Sun, and the Wall Street Journal.</p>\n<p>In practice, Knewz was a news aggregator, somewhat similar to Google News. It used AI algorithms to scrape content from hundreds of news sources, with human editors to \"highlight a selection of headlines that provide a broad perspective.\" The site's design was particularly garish, with construction-project-yellow headers, an inconsistently sized tile layout, and frequent use of boldface, underlining, and italics in the same headline.</p></div><p><a href=\"https://arstechnica.com/?p=1779162#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779162&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"936ca6a10cb6125cf884c6129c17790624ac08f8d91a53eb2399c0d85505f8d8","category":"Tech"}