{"title":"The hardest climbs of the Vuelta a España 2023","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-hardest-climbs-of-the-2023-vuelta-a-espana","date":1692774000000,"content":"\n      <p><span>The third and final Grand Tour of the year is looming large, much like the daunting array of mountains that are littered throughout the 21 days of racing. The 2023 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> is certainly a race for the climbers, with the route traversing nearly every mountain range in the country</span></p>\n<p><span>Mountain climbs have long been a key part in the Vuelta a España, and this year’s route really plays up to that expectation. Overall, in the 78th edition, there are seven mountain stages, two flat stages with high altitude finishes, and nine summit finishes. That is tiring enough to read, let alone to ride. But that is what it takes to be crowned the winner of the Vuelta, and also what makes it such a spectacle to watch. </span></p>\n<div></div>\n<p><span>We take a look at some of the enormous mountain passes the riders will have to take on in their quest to secure themselves the red jersey and Vuelta a España title. </span></p>\n<h3><b>Stage three - Coll d’Ordino </b></h3>\n<p><span>The climb in Andorra was first featured in the Vuelta in 2000, and since then, has been a part of five more editions. In 2018, the Coll d’Ordino was even featured on the race’s penultimate day, with Enric Mas taking the stage win. Its last appearance was in the 2019 edition when the riders raced from Andorra la Vella to Cortals d’Encamp with Tadej Pogačar taking victory. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_3_climb.png?v=1692175071\" alt /></span></p>\n<p><span>This year, the climb is the route’s first mountain test as it heads into Andorra. It will be a long slog up the 17.3km long climb, with an average gradient of 7.7%, boasting 10% gradient ramps in the very first few kilometres, making pacing a critical factor in determining who will claim the king of the mountains points and bonus seconds that are up for grabs at the summit. </span></p>\n<h3><b>Stage six - Pico del Buitre (summit finish) </b></h3>\n<p><span>Pico del Buitre is the first summit finish of this year’s Vuelta and the climb up to the Astrophysical Observatory of Javalambre is a 10.9km beast. There is only one momentary pause from the climb’s steep ascents halfway up, but this is sandwiched between gradients of 16% either side. Even in the last few metres before the finish line comes into sight, the riders will face a 15% sting as they battle for the win. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_six_climb.png?v=1692175116\" alt /></span></p>\n<p><span>The climb first featured in 2019 as a summit finish, won by Ángel Madrazo, who forged clear of breakaway companions in the final kilometre to take the win by 10 seconds. It was also on the climb’s steep slopes that Miguel Ángel López took the red jersey from Nicolas Roche with a powerful attack, closely followed by that year’s overall winner Primož Roglič. We expect to see the same nail-biting drama to unfold in this year’s GC battle too. </span></p>\n<h3><b>Stage eight - Xorret de Catí </b></h3>\n<p><span>Xorret de Catí is one of the most famous cycling climbs in the Valencia region, making its debut Vuelta appearance in 1998 when Spanish rider Chava Jiménez won the stage. It has been featured in the Grand Tour on six occasions, 1998, 2000, 2004, 2009, 2010, 2017, and soon to be 2023 for its seventh appearance. The climb this year comes within 5km of the finish line and will certainly be the deciding factor in who takes the stage. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stage_eight_climb.png?v=1692175389\" alt /></span></p>\n<p><span>It is only short in length at 3.9km, but its average gradient sits at an eye-watering 11.4%. In the middle, the riders will have to face ascents as steep as 22% as they claw their way up the climb. Currently, Vincenzo Nibali holds the KOM on Strava with a time of 13:39 from August 2017. Will we see times that match Nibali’s, or will they be even quicker?</span></p>\n<h3><b>Stage 13 - Col d’Aubisque and Col du Tourmalet (summit finish)</b></h3>\n<p>Despite being one of the now hallowed climbs in Tour de France history, the mighty Col du Tourmalet will make its first appearance this year in the Vuelta. But in this Grand Tour, the Tourmalet will make the stage’s summit finish, whereas in the Tour, it has only been host to the finish line on three occasions. The climb was meant to make its debut in the 2020 edition, but the race had to be cancelled due to the Covid-19 pandemic, which prevented the race from going into France from Spain. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/tourmalet.png?v=1692175444\" alt />Stage 13 is a brutal day of climbing for the riders with the Puerto de Portalet (4.4km at 5.4%), Col d'Aubisque (16.5km at 7.1%), Col de Spandelles (10.3km at 8.3%), and finishing on the Tourmalet (18.9km at 7.4%). The stage totals over 4,200 metres of climbing over the 134.7km route – with only the descents providing the legs a short break. Having been featured more than 80 times in the course of the Tour’s history, many of cycling’s greatest battles have been written here, and we expect more epic battles to be documented on such a revered climb.</p>\n<h3>\n<b>Stage 14 - Puerto de Larrau</b><span> </span>\n</h3>\n<p>Following the Tourmalet, this year’s route features another climbing-heavy day in the mountains. The second climb of the stage is the Puerto de Larrau, a mountain pass on the border between France and Spain in the western Pyrenees. From the Spanish side, the climb is 14.9km in length with an average gradient of 8%. Near the top, the climb reaches 14% as they reach the summit 1,600 metres above sea level. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/larrau.png?v=1692175602\" alt /></p>\n<h3><b>Stage 17 - Alto de L’Angliru (summit finish)</b></h3>\n<p>Located in the Asturias in northern Spain sits Alto de L’Angliru, a climb considered to be one of the most demanding climbs in professional road racing. The climb was first introduced in 1999, when race organisers wanted a mountain to rival the Tour’s Alpe d’Huez and Mont Ventoux, or the Mortirolo Pass in the Giro d’Italia. Starting from León, stage eight of the 1999 edition headed to the terrifyingly steep climb and in the end José María Jiménez became the first to conquer the Angliru. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/1062f.png?v=1692175634\" alt /></p>\n<p>The climb is 12.4km overall with an average gradient of 9.8%, with some of the ramps reaching a horrific 24%. In the 2002 Vuelta a España, the steep gradients caused many issues, not for the riders, but the team cars. It was raining <span>heavily</span> and this caused the car’s tyres to slip on the roads painted by the fans, preventing them from restarting after stalling on the steepest parts. Riders were getting caught behind the cars and some even had to ride to the top with flat tires because their team car was unable to reach them. David Millar crashed three times and ended up tearing off his race number in protest within metres from the finish, abandoning the race. </p>\n<p>Since that edition, the climb has been featured six times, and while no team cars have caused such disruption, legendary GC battles have been witnessed here. The last rider to win atop the Angliru was pure climber Hugh Carthy in 2020, and before that was Alberto Contador in 2017. </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9375a2d6312efa4097c2431833e2e3f41a418bb0bf88607b68b5808161ba9d32","category":"Cycling"}