{"title":"Salivary Nitrate Level and Lipid Profile in Patients with Hypertension: A Cross-Sectional Study in Saudi Sub-Population","link":"https://www.preprints.org/manuscript/202410.1834/v1","date":1729683176000,"content":"Background: The use of salivary biomarkers offers a non-invasive approach to understanding the metabolic and inflammatory status of hypertensive patients. This study aimed to quantify the salivary nitric oxide (NO), total cholesterol, triglycerides, high-density lipoproteins (HDL), and low-density lipoproteins (LDL) levels in hypertensive individuals and healthy controls in a sub-population in Saudi Arabia.\nMethods: This cross-sectional study comprised diagnosed hypertensive patients (test group, 40–50 years old) and age-matched healthy controls who visited the dental hospital in the College of Dentistry, King Khalid University, for dental treatment. Nitric oxide, total cholesterol, triglycerides, HDL, and LDL levels in saliva were assessed. An independent sample t-test was used to compare the results between the hypertensive and control groups.\nResults: The study included 40 hypertensive patients (20 males and 20 females, aged 40-50) and 40 age-matched healthy individuals (20 males and 20 females). Significant differences in the triglyceride (p = 0.007), cholesterol (p = 0.033), and NO (p = 0.014) levels were observed between the two groups. The triglyceride level was significantly correlated with age in the test group (p = 0.04). \nConclusion: This study demonstrated significant differences in the nitrate levels and lipid profiles between hypertensive patients and healthy individuals in a sub-population in Saudi Arabia. The findings indicate that saliva can be used as a non-invasive diagnostic tool for assessing nitrate levels and the lipid profile. However, additional studies with larger sample sizes and more precise testing parameters are required to validate the findings.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9376aca963cba3be589a58706993da9bb1034b5ac5416a4067cb2f7bd559dbe5","category":"Interdisciplinary"}