{"title":"Respiratory symptoms after TB treatment completion: A qualitative study of patient and provider experiences in urban Blantyre, Malawi","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003436","date":1727445600000,"content":"<p>by Jamilah Meghji, Wezi Msukwa-Panje, Elizabeth Mkutumula, Wala Kamchedzera, Ndaziona P. K. Banda, Peter MacPherson, Nora Engel</p>\r\n\r\nPulmonary tuberculosis (PTB) survivors experience a high burden of residual and recurrent respiratory symptoms after TB treatment completion. However, guidelines for the investigation and care of symptomatic TB-survivors are limited. We used qualitative methods to explore patient and provider understandings, experience and practice around respiratory symptoms in the post-TB period. We conducted in-depth interviews with PTB-survivors who had experienced respiratory symptoms (cough, chest pain, breathlessness) after successful TB treatment completion in Blantyre, Malawi (n = 23). We completed focus group discussions with TB-Officers (n = 12), and in-depth interviews with health care workers (n = 18) from primary and tertiary health facilities. Interviews were conducted in Chichewa, and thematic analysis was used to identify common themes. Our data highlight that TB survivors have negative experiences of respiratory symptoms after TB treatment completion, with anxiety about the cause of symptoms, uncertainty about if and how to return to care, and fear of recurrent TB disease. Our findings suggest four critical practices which shape this experience including: limited counselling at TB treatment completion; the lack of clear health seeking pathways to return to care; the use of TB-focused investigations for those returning to care; and heterogeneous approaches to TB retreatment decisions. This study highlights that the post-TB period is a critical part of the patient’s experience of TB disease. Current practices create a negative patient experience, and carry clinical and public health risks including delayed diagnosis of TB relapse, missed diagnosis of cardio-respiratory disease, and misuse of antimicrobials and TB retreatment. Formative guidelines are needed to improve the care of symptomatic TB-survivors.","author":"Jamilah Meghji","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"938be1dd28353ab17161882abec9581200cae2ddc68b32e5f7d036dfa9c76f57","category":"Environment"}