{"title":"'It was so many setbacks, I thought maybe it’s my time': Michael Matthews's rough road to the Giro d'Italia","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/it-was-so-many-setbacks-i-thought-maybe-it-s-my-time-michael-matthewss-rough-road-to-the-giro-ditalia","date":1684416259000,"content":"\n      <p><span>Michael Matthews answers his phone on the first rest day of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> at 9.45am local time. Apparently, he doesn’t like to sleep in on one of only two days he will be able to during the three-week race. </span></p>\n<div></div>\n<p><span>“Good,” he pauses momentarily to consider the time difference from where he is in Italy to where I am in Australia, “evening,” Matthews says. </span></p>\n<p><span>The 32-year-old has been up most of the night with a sore throat. It’s rained a lot during the first phase of the Giro and some riders in the bunch are tired and raspy from nine consecutive days of competing in the elements, while others have contracted Covid-19. The day before, title contender Remco Evenepoel (Soudal-Quick-Step) abandoned the race, hours after winning stage nine and reclaiming the maglia rosa, having tested positive to the virus. Many more would follow. </span></p>\n<p><span>“It’s sad. Everyone wanted to see how he would go as a GC rider in the Giro,” Matthews says. </span></p>\n<p><span>Matthews’ Jayco Alula team are undergoing daily Covid-19 tests and have already discussed, earlier at breakfast, how the Giro may play out with Geraint Thomas (Ineos Grenadiers) now leading the general classification. </span></p>\n<p><span>“I think Ineos having the jersey now is probably better; it will be a more controlled race because they’re a very strong team … and they know how to control a Grand Tour. Quick-Step, they were doing OK, but obviously not the experience of Ineos,” he continues. </span></p>\n<p><span>Rest days at Grand Tours mean you don’t race, they don’t mean you don’t work, and after this interview Matthews has about 20 minutes before he rolls out for a training ride. </span></p>\n<p><span>You wouldn’t guess it from his resounding victory on stage three, where Matthews outsprinted former world champion Mads Pedersen (Trek-Segafredo) and in-form compatriot Kaden Groves (Alpecin-Deceuninck), but he has had a lot of enforced ‘rest’ this season. </span></p>\n<p><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/how-will-the-ineos-grenadiers-change-game-plan-at-the-giro-ditalia-after-tao-geoghegan-hart-crashes-out\"><em>Read more: Another day at the Giro d'Italia, another abandon: How will Tao Geoghegan Hart crashing out change the GC race?</em></a></strong></p>\n<p><span>Being back in the saddle right now may be just as therapeutic to him as any traditional definition of R&amp;R, considering just over a month ago Matthews left Belgium in a wheelchair after suffering a two-and-a-half-centimetre quadricep tear, torn knee, and sprained ankle from one of three crashes he was involved in at the Tour of Flanders. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-02870.jpg?v=1684415763\" alt=\"Michael Matthews\" /></span></p>\n<p><span>“I couldn’t actually walk. I was trying to get to the airport to fly out and had to be in the wheelchair,” he recalls. </span></p>\n<p><span>“Through the night, the night of the crash, I went to go to the bathroom and couldn’t manage to get from my bed to the bathroom. I passed out from the pain trying to get to the bathroom.” </span></p>\n<p><span>And that wasn’t even the start of a preparation so interrupted by illness and other crash-related injuries that Matthews considered retirement from the sport he’s been competitive in since childhood. </span></p>\n<p><span>“It was so many setbacks, and I was just like, phwoar, maybe it’s my time, you know. Maybe this is God saying just hang it up. I went through stages of those thoughts and had to talk to a lot of different people about whether I wanted to still do it or not,” he says. </span></p>\n<p><span>Matthews’ season from the outset was to look different than those of recent years. He started his campaign at the reinstated Tour Down Under in January, as opposed to staying in Europe and kicking off proceedings at Paris-Nice in early March. He also opted to target the Giro instead of the Tour de France, where he reminded everyone of his class with a solo stage victory last season, as well as the World Championships, which Scotland hosts in August. </span></p>\n<p><span>An ill-timed mechanical at Down Under ruined his chances of title success but he won the points classification, was fourth at the ensuing Cadel Evans Great Ocean Road Race and then underwent a training camp in Spain before lining up at Paris-Nice, after which things went south. </span></p>\n<p><span>“I somehow managed to creep all the way through Paris-Nice and then found out I had Covid. So, that set me back … two weeks off the bike there after Covid. Missed all my Classics that I was really working hard for, Milan-Sanremo obviously one of them, E3 and Gent-Wevelgem also big targets which I couldn’t do,” Matthews recalls. </span></p>\n<p><span>“And then when I could finally get back on the bike and went to Italy for a couple of days for a small training camp and ended up crashing again on the descent at like 70km/h, so it took most of the skin off my body. This was one week before Flanders, which I was trying my best to get back as good as I could for Flanders, and blowing my skin off my body was not the ideal preparation after having two weeks off the bike and missing a lot of the other Classics leading into that one.” </span></p>\n<p><span>The spring and Ardennes Classics are traditionally big early season objectives for Matthews, who invests a lot of physical and mental energy into them, but his skin was still raw when he, four days before Flanders, started Dwars door Vlaanderen in late March, finishing 20th.  </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-07297.jpg?v=1684415850\" alt=\"Michael Matthews Giro d'Italia\" /></span></p>\n<p><span>“It was my first race back after Covid, so I was okay, nothing special, but then came to Flanders and obviously I didn’t have massively high expectations of myself but ... I wanted to see what I could do, and ended up being in three massive crashes,” he says. </span></p>\n<p><span>“The third one really took me out, with a two-and-a-half-centimetre tear in my quad, and a one-centimetre tear down the side of my knee, sprained ankle and also more skin off my body, which was also not healed from the weekend before.” </span></p>\n<p><span>Matthews was again sidelined, and missed another one of his staple events, the Amstel Gold Race, which, with the tear in his quad, he watched on TV instead. Between Flanders on April 2 and the Grande Partenza on May 6 he raced only once, placing 14th at Eschborn-Frankfurt five days before the Giro started. </span></p>\n<p><span>However, viewing a sport that he has been at the top of for more than a decade, beating generational talent from his era, and the fresh waves that have since followed, helped Matthews to turn his mindset from thoughts of retirement back to being competitive. </span></p>\n<p><span>Although even he didn’t anticipate going from wheelchair to a now five-time Giro stage winner in a matter of weeks. </span></p>\n<p><span>“After two weeks off the bike, I really realised actually there’s only one thing I want to do in my life and that’s ride my bike. I was watching all the races on TV and looking outside at people riding their bikes and how happy it made them, so when I saw all of that and thought about not being able to do that anymore I definitely changed my mind back to, ‘I can get back to the level I was at’, and, ‘I can continue winning’,” he says. </span></p>\n<p><span>Under the guidance and with the support of long-time coach Brian Stephens, who he completed a block of recovery and training with at altitude in Livigno, Italy, Matthews endured, with physio and work that his battered body could handle. </span></p>\n<p><span>“I basically did my recovery up there and then once I could get back on the bike, I started training really easily but eventually you need to start training hard so in the end I had to start to push earlier than what me and Brian would have liked to do for the recovery,” he says. </span></p>\n<p><span>“We knew it was going to be difficult, but we just had to see where I was at, so we tested a little bit, but I’ve been to that same place so many times for training, I know pretty much at what power I can get to what points of the climb, and I was totally way off.</span></p>\n<p><span>“It was very frustrating. Brian was there with me. He was with me on the bike most days, keeping me motivated.” </span><b> </b></p>\n<p><span>Central to Matthews’ longevity at the top of the sport has been his consistency, in his sustainable approach to training and diet, and his self-described grit. </span></p>\n<p><span>“I need to be the best and I think that’s something that I’ve had in me since I was a kid. I haven’t really lost it unfortunately! It’s a positive and a negative sometimes too because when you’re not winning it’s difficult to deal with, but when you are winning it’s great,” he says. </span></p>\n<p><span>That drive has seen Matthews effectively reinvent himself over the years, finding different ways to win on different terrain, from reduced group sprints like his against Pedersen and Groves in Melfi to his solo triumph at the Tour last season. <img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-08594.jpg?v=1684415948\" alt=\"Michael Matthews\" /></span></p>\n<p><span>“It was pretty special to be able to keep my head on my shoulders after all that had happened and to pull off a win in the first three days. It was very unexpected, let's say, but definitely took it with both hands, the opportunity, that’s for sure,” he says. </span></p>\n<p><span>“The thoughts have been magical since then. It was something we were dreaming about in Livigno, to come back and turn things around.” </span></p>\n<p><span>The 12-time Grand Tour stage winner in his past three career Giro participations hasn’t finished an edition but hopes to reach Rome at the end of this month. He is mindful of the points classification, though has adopted a measured approach to the race, which, contrary to appearances, he entered “definitely not” at full fitness. </span></p>\n<p><span>“I had to go so, so deep just to be there in the final and then to outsprint Pedersen, who is one of the fastest guys in the world and he’s had a good run in his preparation for this Giro, to be able to outsprint him I was obviously over the moon,” says Matthews. </span></p>\n<p><span>“But I’m also real that I’m not in the shape that I can continuously contest these sorts of stages. I need a couple of days off to really rest and then come back at it. </span></p>\n<p><span>“I’ve noticed also my max sprint on the flats is not anywhere near where it needs to be to contest these guys in the flat sprints. I just haven’t got to the top-end power at the moment. </span></p>\n<p><span>“I’m not going to say I’m going to go and win 10 stages now after I’ve won one. We’re just going to continue trying that’s for sure.” </span><span> </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"939130b7ce61a79ce166b399f5b005b379b2d0ebed59db76a853f1ae8355dffe","category":"Cycling"}