{"title":"Rocket Report: Lack of transparency on Ariane 6, Drastic cuts Down Under","link":"https://arstechnica.com/?p=1958601","date":1691146816000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/FH1-800x533.jpg\" alt=\"SpaceX's Falcon Heavy rocket lifts off from Kennedy Space Center carrying the Jupiter-3 mission.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/08/FH1.jpg\">Enlarge</a> <span>/</span> SpaceX's Falcon Heavy rocket lifts off from Kennedy Space Center carrying the Jupiter-3 mission. (credit: SpaceX)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.05 of the Rocket Report! This week's newsletter has the distinction of including not one, but two items of news from Australia. Unfortunately, one of the items suggests rough waters lie ahead for the country's young commercial space industry.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Australian industry faces cuts</strong>. In June the Australian government cut a $1.2 billion Earth science program, and the cut has been reverberating through the country's nascent commercial space industry since then, the <a href=\"https://www.abc.net.au/news/2023-08-03/australia-space-industry-cuts-730/102683954\">Australian Broadcast Corporation reports</a>. \"This is an industry-wide hit,\" Bec Shrimpton, the director of Defense Strategy and National Security at the Australian Strategic Policy Institute, told the publication. \"The confidence has gone out of the sector, which means that across the board companies are not attracting investment. The ability to attract major money here is gone for a number of companies.\"</p></div><p><a href=\"https://arstechnica.com/?p=1958601#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958601&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9392547c439a2fb2f5ff570da17d0882dde8b898421b8c281d50f1c6d677d74f","category":"Tech"}