{"title":"The Geologic History of Plants and Climate in India","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-040722-102442?TRACK=RSS","date":1721692800000,"content":"<div><p>India's diverse vegetation and landscapes provide an opportunity to understand the responses of vegetation to climate change. By examining pollen and fossil records along with carbon isotopes of organic matter and leaf wax, this review uncovers the rich vegetational history of India. Notably, during the late Miocene (8 to 6 Ma), the transition from C<span>3</span> to C<span>4</span> plants in lowland regions was a pivotal ecological shift, with fluctuations in their abundance during the late Quaternary (100 ka to the present). In India, the global phenomenon of C<span>4</span> expansion was driven by the combined feedback of climate variations, changes in substrate conditions, and habitat disturbances. The Himalayan region has experienced profound transformations, including tree-line migrations, shifts in flowering and fruiting times, species loss, and shifts in plant communities due to changing monsoons and westerlies. Coastal areas, characterized by mangroves, have been dynamically influenced by changing sea extents driven by climate changes. In arid desert regions, the interplay between summer and westerlies rainfall has shaped vegetation composition. This review explores vegetation and climate history since 14 Ma and emphasizes the need for more isotope data from contemporary plants, precise sediment dating, and a better understanding of fire's role in shaping vegetation.\n</p><ul>\n<li><span>▪ \n</span>This review highlights diverse vegetation and landscapes of India as a valuable source for understanding the vegetation-climate link during the last 14 Myr.\n</li>\n<li><span>▪ \n</span>A significant ecological shift occurred during 8 to 6 Ma in India, marked by the transition from C<span>3</span> to C<span>4</span> plants in the lowland regions.\n</li>\n<li><span>▪ \n</span>The abundance of C<span>3</span> and C<span>4</span> plants varied in India during the late Quaternary (100 ka to present).\n</li>\n<li><span>▪ \n</span>This review emphasizes the importance of more isotope data, precise sediment dating, and a better understanding of fire's role in shaping vegetation.\n</li>\n</ul><p></p></div>","author":"Prasanta Sanyal, Sourav Priyam Adhya, Ritwick Mandal, Biswajit Roy, Bibhasvata Dasgupta, Santrupta Samantaray, Rahul Sen, Vijayananda Sarangi, Anurag Kumar, Deepak K. Jha and Ajay Ajay","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"939dd47c54211a7faf875a603aa43b980ed55208640564ae607c66871f4ba233","category":"Environment"}