{"title":"How the courses were designed for the 2022 Wollongong Road Worlds","link":"https://cyclingtips.com/2021/12/how-the-courses-were-designed-for-the-2022-wollongong-road-worlds/","date":1639094940000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-128082983-650x421.jpeg\" /></div><h2>How the courses were designed for the 2022 Wollongong Road Worlds</h2><p>\n</p><p>Today we got our first look at the courses that will be used at the <a href=\"https://cyclingtips.com/tag/2022-road-world-championships\" target=\"_blank\">2022 Road World Championships</a> in Wollongong, Australia. We didn’t get all the details, but we learned enough to know that we’re in for some intriguing racing.</p>\n\n\n\n<p>In putting together <a href=\"https://cyclingtips.com/2021/12/courses-for-the-wollongong-road-worlds-have-finally-been-revealed-sort-of/\" target=\"_blank\">a deep dive on the courses and what we can expect</a>, CyclingTips spoke to two people involved in course design for Wollongong 2022: the event’s head of sport, Steve Peterson, and former pro Gracie Elvin, part of the event’s sport and technical advisory group. Both spoke in detail about what went into designing the routes, why we won’t get to see the full courses and elevation profiles until next year, and what we can expect from the event in general. You can read the transcripts from those interviews below.</p>\n\n\n\n<hr />\n\n\n\n<h2>Q&amp;A with Steve Peterson, head of sport at Wollongong 2022</h2>\n\n\n\n<p><strong>CyclingTips: Where do you start when you’re trying to design a course for Road World Championships?</strong></p>\n\n\n\n<p>Steve Peterson: Effectively AusCycling put forward their bid to the UCI to host the event in Australia and they honed in on some options in terms of the available host cities that best fit the mold, so to speak. And when I say fit the mold, you want to try and strike the balance between a large population within reasonable proximity to an international airport, reasonable availability in terms of some of those core aspects like accommodation. But also I guess, ultimately it’s got the capacity to host something like the World Championships from a course and technical perspective.</p>\n\n\n\n<p>So really that was the process. AusCycling had already identified Wollongong for that location and effectively submitted their bid on that basis. That’s back in September 2018. And then the UCI go through a process of effectively assessing that bid, recognising at that point that you might not have the finished product in terms of what the courses look like at that stage, but there’s an iterative process that takes place from that point.</p>\n\n\n\n<p>But even thinking back to that initial bid process the courses were quite similar to what we see now. They had put some thought together on that. AusCycling, it’s my understanding, they had engaged with a handful of local people – I don’t know specifically who they are – just trying to hone in on some of those regular routes that some of the locals use. But also recognising that when you’ve got a World Championships, you’ve got the opportunity to use some roads that ordinarily wouldn’t form part of a race circuit, you know? I suppose it’s a bit of a luxury in that sense. </p>\n\n\n\n<p><strong>During the bidding process and when you’re working with the UCI, do they come to you and say “We had Flanders this year, in 2022 we need something that’s got a lot more climbing” or “We need something that’s a lot flatter”? Or is it really up to the host?</strong></p>\n\n\n\n<p>There is a little bit of that. It’s a bit of a to-and-fro process. I think year to year, where they’ve got the flexibility to do it, the UCI would tend to mix it up in terms of it being maybe a climber’s race, a sprinter’s race the other year, bit of an all rounder another year. It doesn’t always work out like that. But you know, that’s something that does get looked at.</p>\n\n\n\n<p>One thing that the UCI have probably reflected upon, and I fed this into the organising committees, is probably over the last few years, you’ve had that … call it a spoke and hub model where you’ve got core circuits, but with a whole series of remote start locations. I think it’s fair to say that the UCI and previous organising committees have reflected on that and said “You know what, that’s really complicated, not just in terms of race delivery, but from a cost perspective, but also, in terms of the national federations trying to fashion their logistical approach around that.”</p>\n\n\n\n<p>So I think what we’ve got with Wollongong is a bit of a response to that in the sense that we’ve really tried to consolidate our focus in and around a central Wollongong city circuit. And then have aspects that we sort of bolt onto that, that are able to pick up certain aspects of what we still want to feature in the courses ultimately.</p>\n\n\n\n<p>I think the other thing that the UCI are really adamant about, and this really has come from David Lappartient since he has come in as president – he has a real focus on that city circuit. And the reason that is is, ultimately he’s a big believer and in turn a lot of the UCI are big believers in having the large bulk of races taking place on the city circuit itself. From their perspective, that means more of the race is generally populated heavily by spectators, which makes for good TV images or that sort of stuff.</p>\n\n\n\n<p>Our response to that has been to formulate a configuration that is largely focussed around that city circuit. So we’ve been really, both from a UCI and a local organising committee perspective, [been] working on a configuration and a format of event week that does really hone in on that city circuit. And in fact, as you as you can already see from the maps, that city circuit does feature heavily in both time trial and road race, which is not always the case. Ultimately, quite often that differs. But we’ve got the opportunity to really do that here in Wollongong and produce great races across both the road race and the time trial. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/RR-Wollongong-City-Circuit-1340x1578.jpg\" /><figcaption>The city circuit used in the road races. It’s similar to the course used for the time trials.</figcaption></figure>\n\n\n\n<p><strong>In terms of the start location, was there any temptation to start in Sydney?</strong></p>\n\n\n\n<p>It’s certainly been a consideration. The biggest issue ultimately with that is we’ve been adamant from the beginning that we want for the elite road races to have the same course footprint for both the men’s and women’s race. So what that means is, to be honest, collectively – the organising committee and the UCI – we don’t want to “burn” a lot of kilometres between Sydney and the circuit because the UCI are pretty adamant about the fact that there has to be a minimum number of laps, particularly for the women’s race where we don’t have as much distance to play with, where it still delivers real value.</p>\n\n\n\n<p>And so from that perspective, we couldn’t have a scenario where we start the men’s race in Sydney and not the women. That was just completely off the table from the very beginning. So that’s a long way of saying yes, we considered the Sydney option but it’s just not something we wanted to explore any further.</p>\n\n\n\n<p><strong>Are you able to explain why the full courses aren’t going to be available for a little while yet?</strong></p>\n\n\n\n<p>In the COVID environment, we haven’t had the opportunity to host the UCI out here for the type and quantity of site visits that you would ordinarily do leading to a world champs. Realistically, we would have probably had the UCI out here three or four times between when [Wollongong] got the appointment as host and then the event, and we just haven’t had that opportunity.</p>\n\n\n\n<p>So I think realistically the UCI want to come out here and absolutely double down on what the proposal is, make sure they’re comfortable with the format, safety, all of those things. We think we’ve got a super-compelling proposal and to be honest, from our perspective, we’d love to be talking in precise detail right now about what the courses and the configurations look like. We unfortunately aren’t permitted to do that, by the UCI.</p>\n\n\n\n<p><strong>Are there specific things that the UCI will want to come and look at? Given you’ve revealed all the course elements, it seems like any concerns must be minor?</strong></p>\n\n\n\n<p>It could be a conversation around specific numbers of laps and stuff. They want to keep the door open in that regard. From our perspective, we want to already start that process of talking with the community. From our perspective, it’s super important to have at least the course locations and the course footprints nailed so that we can start to describe what the impact’s going to look like. [It’s a] logistically complex event. We need to maintain as much business-as-usual activity for the residents and businesses as we can, and we want to really start that work now.</p>\n\n\n\n<p>So whilst the door is a little bit open around some of the precise technical details, we’re in a very strong place. If it was up to us, we’d be talking in precise details tomorrow about where we’re at, but that’s the UCI call. Ultimately, it’s their event to own and operate.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/RR-Men-Elite-1340x1577.jpg\" /><figcaption>The full “footprint” of the road races has been revealed. The exact details have not.</figcaption></figure>\n\n\n\n<p><strong>Can you give us a sense of how much climbing will be involved in the road races? We’re talking very different races if you do five times up Mt. Kiera vs one, for example …</strong></p>\n\n\n\n<p>We really can’t talk too precisely about what that configuration looks like. All I can say is the UCI is really focussed on the importance of that city circuit and it playing a really significant part in the race. That is how they think about things, which we take on board. And I think from our perspective, we’ve always believed that the city circuit itself does offer some real opportunity to animate the race. It creates a whole series of potential race dynamics, depending on how the race plays out.</p>\n\n\n\n<p>But aside from the city circuit, here in Wollongong, we couldn’t create a race that didn’t include the climb of Mt. Keira. That had to feature somewhere. And part of that Matt, as you can probably imagine is, the local cycling community’s out here every weekend, climbing up Mt. Keira. You’re a climber; you love climbs – it’s all about seeing how you rate against the world’s best and we wanted to make sure that, from a legacy perspective, it’s got to feature in there somewhere. Ultimately, we’re really happy that we’re able to do that.</p>\n\n\n\n<p><strong>For people that aren’t familiar with the area, can you talk a little bit about what they can expect to see on TV?</strong></p>\n\n\n\n<p>One of the really key core elements of how we’ve designed the circuit is … in Wollongong, we’re right on the coast. We wanted to make sure that we’ve got a start/finish location or in particular, a finish location, that’s right on the foreshore. So right on the beach.</p>\n\n\n\n<p>I suppose all of the massive advantages and aesthetics that we achieve by having that foreshore location ultimately means that we’re … I’ll say “limited” to a degree, but I don’t really mean that. I think we ultimately have to then construct a circuit that still takes in that start/finish on each of those laps.</p>\n\n\n\n<p>What we’ve still achieved here with our city circuit is the ability to kiss that escarpment, which we really wanted to do. So we’re using a part of the residential area within reach of the foreshore that makes sure that we’re accentuating the race how we want to and making sure that we’re going to have a really exciting race. We’ve got a really, pretty tough technical climb that’s going to feature in every one of those laps. So we basically make our way out through the suburbs and then up into that residential zone that ultimately kisses the escarpment and then makes its way back down to the foreshore.</p>\n\n\n\n<p>I think what you can expect is a bunch of suburban streets that never in your wildest lifetime would you imagine a bike race being run on, but here we’re basically converting quiet suburban streets of Wollongong into a world-class field of play. That’s exciting to really imagine. I can’t give you specifics, but by the time we get to the race end, we’re going to be talking really significant elevation across across the race.</p>\n\n\n\n<p><strong>And I guess with the the coastal views and also the rainforest on Mt. Keira, it’s going to be a beautiful race to watch.</strong></p>\n\n\n\n<p>Yeah, that’s right. You’ve got those contrasts. The contrast of the foreshore right by the beach. I can’t remember a world championships where we’ve got the finish of a road race right by the beach. And then you’re up into what’s ultimately subtropical, temperate rainforest up in around Mt. Keira. You’ve got this beautiful contrast between the greens of the escarpment and the blues of the oceans and everything in between.</p>\n\n\n\n<p>It’s exciting. And also a bit of a tip of the hat to the economic foundations of Wollongong in terms of moving through not too far from the port and the industrial steelworks of BlueScope and the like. So it tells a bit of a narrative and it shouldn’t be a problem for the commentators on the day to talk for six and a half hours.</p>\n\n\n\n<h2>Q&amp;A with Gracie Elvin, sport and technical advisor</h2>\n\n\n\n<p><strong>CyclingTips: What’s your role in the Wollongong 2022 project?</strong></p>\n\n\n\n<p>Gracie Elvin: I was invited to be part of the sport and technical advisory group, which is really just a panel of ex-professional riders. So it was myself, Oenone Wood, Mark Renshaw, Kate Bates, and Ben Kersten. So it was a really nice little group to be part of. There’s some shared history there, but certainly a lot of collected history and experience and I was definitely the baby of the group. But it’s kind of fun now to be on the other side of the fence.</p>\n\n\n\n<p>It’s super exciting to have another Worlds in Australia. The last one was 12 years ago. I was a spectator in Geelong – I was a cyclist back then, but certainly not at that level. So it’s cool to have done a whole career and I’ve gone to many world championships, but never raced one in Australia. But to be part of figuring out how we can make a great one in Australia is still really special and it was an opportunity that I was glad to be a part of. </p>\n\n\n\n<p><strong>So what did they bring you all on board to do? What’s the role of the advisory committee? </strong></p>\n\n\n\n<p>Earlier this year, it must’ve been February, we all met in Wollongong, and we’d had a couple of online Zoom meetings as a bit of an intro to the event. When we finally all came together in person, we got to go drive a lot of the roads and some of the proposed courses, and stop a lot, and talk, between the five of us ex-riders and Stu Taggart [Wollongong 2022 CEO] and a couple of other people, we were able to really discuss and sometimes argue, I guess, about what we think would work well and what we thought could be better or how many laps of a proposed loop or where the start should be and the distances and the amount of climbing.</p>\n\n\n\n<p>Everything was on the table. We weren’t the key decision-makers – as the title suggests, we were just there as an advisory group because we raced those events before and know what we liked as athletes and [we could] hopefully bring that kind of perspective.</p>\n\n\n\n<p><strong>We’ve got the <a href=\"https://cyclingtips.com/2021/12/courses-for-the-wollongong-road-worlds-have-finally-been-revealed-sort-of/\" target=\"_blank\">building blocks of the courses</a> now, but you could really make anything from those particular components. How do you take those and arrive at something that is a good course?</strong></p>\n\n\n\n<p>Yeah, it’s a really tough question. I think it’s just something that you can never really perfect. But that’s kind of the beauty of road cycling – no course is the same. And even if it’s the same amount of climbing in metres, it still can be a different outcome depending on how that climbing is dispersed throughout a distance.</p>\n\n\n\n<p>And in some ways, it’s kind of cool to think, “how can we deliver a certain kind of rider to the finish or a situation?” And yeah it’s interesting. There’s certainly some great Aussie riders that you really wish could do well next year, but obviously you can’t build a course around them, either. You have to build a course that spectators want to watch and can be part of if they’re going to be standing on the courses. There’s just so much more to it.</p>\n\n\n\n<p>It was actually quite difficult. I’ve only ever had to show up to a race and then race it. So to be talking about it and how things may or may not work, I think you can only predict so much until the race really happens. It’s a shame that they can’t fully disclose how exactly the courses will be. And that’s really been dictated, unfortunately, by COVID and travel restrictions and the UCI’s inability to come and finalise it earlier than now where they usually would have if it was somewhere else. So I’m sure that it will be tied up sooner rather than later.</p>\n\n\n\n<p>But yes, I think some of the elements that will be announced on Friday will certainly spark a lot of intrigue. I think there’s going to be further speculation on how it’s all really going to be tied up. But I think overall, some of the elements of Wollongong, they’re unmissable, such as Mt. Kiera and some of the coast roads, and I think hopefully some of the smaller loops that they’re talking about will add the exciting, spectator friendly and unpredictability element as the race unfolds.</p>\n\n\n\n<p>But in terms of how it’s going to look on TV, it’s going to be absolutely spectacular either way.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/GettyImages-1150848470-1340x802.jpeg\" /><figcaption>The Sea Cliff Bridge north of Wollongong.</figcaption></figure>\n\n\n\n<p><strong>When they brought the five of you on board, did the organisers say to you “Here are the elements we would like to include, and here’s the sort of outcome that we would ideally like?” Or do they say “It’s a blank slate”</strong>?</p>\n\n\n\n<p>Yes, it’s really a blank slate. There’s certainly no agenda as to what outcomes or results they want. AusCycling and the event organisers are not being biased towards the strength of our Australian riders. Like I said, we all hope for them to win, but we’re not building courses around our kind of riders. And the good thing is that Australia boasts a compliment of riders in all fields that can perform on a range of courses. So it’s not like we only have one good rider that’s a sprinter, you know? We have plenty of people that can perform on any kind of course.</p>\n\n\n\n<p>I think the main goal was to showcase the area because the Wollongong area is a beautiful part of Australia and to make an exciting race; to make a race where people will speculate even once the courses are fully announced – there’s going to be a lot of discussion about how it will unfold. And in my opinion, I think that makes for a great world championship.</p>\n\n\n\n<p>If there’s a 10 kilometre climb once or twice in the race, it really narrows down who can win. And I think in the case of this, we’re showing that Australian roads are not all flat. There can be some climbs in it, but they’re not going to be massive climbs either. And that’s going to make for a really interesting and unpredictable race. I think that’s what a lot of spectators want to see.</p>\n\n\n\n<p><strong>You could do five or 10 laps of the Mt. Kiera loop or you could do once around that circuit and a bunch of times around the city circuit – they’re vastly different races. At some point there’s got to be, I guess, a value judgement made. “Do we want something like Innsbruck was? Or do we want something that’s a bit flatter? Or a bit more in the middle?”</strong></p>\n\n\n\n<p>Yeah, definitely. I’d say that the decision will be swayed more towards that middle range of climbing. So hopefully the UCI can agree on what a lot of us think will make for a good race. Something a lot more spectator-friendly where they can stand on a smaller circuit and still make their way down to the finish, or at least see riders multiple times because it’s a shorter circuit. That adds to the atmosphere so much.</p>\n\n\n\n<p><strong>What other things were you looking out for from the athlete’s perspective? Things like safety or other elements that might not be obvious to fans of the sport?</strong></p>\n\n\n\n<p>Yeah, definitely. So when we got the opportunity to go and drive all of the courses, we weren’t just talking about the tactics and the layout we were commenting on every curve, every island, every sign, everything that could be a safety consideration. There’s elements of the proposed courses that are a bit tricky.</p>\n\n\n\n<p>Cycling is a technical sport. It’s kind of cool when there’s technical elements of a course, but they still have to be safe. So I think almost every metre of the roads that we got to see have been made notes on, and there will certainly be a lot of construction around making sure that it’s a safe course. And also that there’s good traffic flow for the city as well, because at the end of the day, a host city still has to operate as a city and you can’t shut it down for a week.</p>\n\n\n\n<p>So there’s just so much that goes into an event like this, and it’s really eye-opening to see just a small part of how we’re doing it all.</p>\n\n\n\n<p><strong>The elite time trial is going to be the same length for men and women for the first time in Road Worlds history. That’s a pretty cool development right?</strong></p>\n\n\n\n<p>Yeah, that was something that we all got to discuss. It certainly wasn’t up to us to decide, but we all had viewpoints on that, and I think there’s pros and cons to that decision from my personal opinion.</p>\n\n\n\n<p>Traditionally men’s time trials have been longer and women’s time trials have been shorter and I feel like there’s room for that gap to be closed, but I don’t think necessarily that needs to be equal. But I think it’s also a positive in a way to have an event that has an equal distance because the road races … it’s even less viable and less relevant, I think, because it’s so much longer.</p>\n\n\n\n<p>The women don’t need to race an equal distance for the road race, but for a time trial, it’s much more appropriate. And especially on these particular courses – they’ll be technical, there’ll be a couple of climbs and it’ll be really exciting, I think. And a really good challenge for the women’s category to have this opportunity to race a longer time trial at the World Championship level.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/12/TT-Women-Elite-1340x1574.jpg\" /><figcaption>The elite men and women will race the same TT circuit. How many laps? We’re guessing two, for a total of 36 km, but that’s to be confirmed.</figcaption></figure>\n\n\n\n<p><strong>Is there anything else about this whole process or the courses that you think people would be interested to know?</strong></p>\n\n\n\n<p>I think it’s just going to be such an awesome community event for Wollongong, but also for Australia. It’s such an important thing to have big events for cycling in Australia because it’s gaining popularity as a sport, but it’s still not one of our most popular sports. So it is a really cool event.</p>\n\n\n\n<p>I hope that there’s going to be a lot of non-cycling fans that come to this and get excited by it. And I think it’s going to spark a new wave of riders that want to be at that level of cycling, especially going towards the Brisbane Olympics in the decade after [2032].</p>\n\n\n\n<p>I think it’s going to be a really important event in many ways, for cycling awareness, cycling safety on the roads, and excitement to build towards the next Australian Olympic Games. </p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/how-the-courses-were-designed-for-the-2022-wollongong-road-worlds/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"93a6cbfd7f26a87070b5362eb54e1b53b798610ef412e255e6230b4ec88af13c","category":"Cycling"}