{"title":"On the Durability Performance of Two Adhesives to Be Used in Bonded Secondary Structures for Offshore Wind Installations","link":"https://www.preprints.org/manuscript/202404.0888/v1","date":1713149840000,"content":"The development of offshore wind farms requires robust bonding solutions that can withstand harsh marine conditions for the easy integration of secondary structures. This paper investigates the durability performance of two adhesives: Sikadur 30 adhesive and Loctite UK 1351 B25 for use in offshore wind environments. Tensile tests on adhesive samples and accelerated aging tests were carried out under a variety of temperature and environmental conditions, including both dry and wet conditions. The long-term effects of aging on adhesive integrity are investigated by simulating the operational life of offshore installations. The evolution of mechanical properties, studied under accelerated aging conditions, provides an important indication of the longevity of structures under normal conditions. The results show significant differences in performance be-tween the two adhesives, highlighting their suitability for specific operating parameters. It should also be noted that for both adhesives, their exposure to different environments (seawater, distilled water, humid climate) over a prolonged period has shown that i) Loctite adhesive has a slightly faster initial uptake than Sikadur adhesive, but the later reaches an asymptotic plateau with a lower maximum absorption rate than Loctite adhesive; and ii) a progressive deterioration in the tensile properties following an exponential function. Therefore, aging behavior results showed a clear correlation with Arrhenius' law, providing a predictive tool for the aging process. Thus, the aging process of the two adhesives follows Arrhenius kinetics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"93a891a9d31684aead951f94616d766ebe759e2b24f41b92a020d0f62796bbf4","category":"Interdisciplinary"}