{"title":"Ballerini sprints to victory at the Omloop Het Nieuwsblad","link":"https://cyclingtips.com/2021/02/ballerini-sprints-to-victory-at-the-omloop-het-nieuwsblad/","date":1614439357000,"content":"<p>Davide Ballerini took a convincing sprint win at the Omloop Het Nieuwsblad on Saturday, delivering in a fast finish to close off a strong all-round performance from Deceuninck-Quick-Step.</p>\n\n\n\n<p>The first race of Opening Weekend saw plenty of attacks on the Flemish cobbles and climbs, but in the end a sizable group would contest the victory in Ninove. Deceuninck-Quick-Step led the field through the winding final kilometer with Ballerini finishing it off to sprint to a clear win.</p>\n\n\n\n<p>Jake Stewart (Groupama-FDJ) took runner-up honors on the day with Sep Vanmarcke (Israel Start-Up Nation) rounding out the podium in third.</p>\n\n\n\n<h3>How it happened</h3>\n\n\n\n<p>The 76th edition of the Omloop Het Nieuwsblad rolled out from Ghent under chilly conditions, and it didn&#8217;t take long before the early break formed as the quintet of Bert De Backer (B&amp;B Hotels-KTM), Kenny De Ketele (Sport Vlaanderen-Baloise), Yevgeniy Fedorov (Astana), Ryan Gibbons (UAE-Team Emirates), and Matis Louvel (Arkéa-Samsic) went up the road some 10 km into the 200.5 km race.</p>\n\n\n\n<p>The group was given plenty of breathing room in the early goings, with the break&#8217;s advantage getting up over eight minutes and hovering there for a while. With 130 kilometers to go, the pack picked up the pace and the gap began to fall, with Deceuninck-Quick-Step driving the tempo.</p>\n\n\n\n<p>Crossing over the midway point of the race and with several cobbles and climbs looming, the gap was down under six minutes. The advantage continued to drop as the riders began covering several stretches of tricky terrain, with the break&#8217;s gap down to around three minutes with 70 km to go. </p>\n\n\n\n<p>A hectic trip up the Valkenburg saw a big crash in the pack, and the pressure remained high for those who remained upright. After a handful of short-lived attacks out of the bunch, the break&#8217;s gap was under a minute with 50 km to go. Then, as the race hit the punchy Molenberg climb, several riders powered off away from the peloton. Ballerini and Deceuninck-Quick-Step teammates Julian Alaphilippe and Zdenek Stybar were in the move, as was Vanmarcke and Greg Van Avermaet (AG2R-Citroën). It didn&#8217;t take long for the group to catch and pass the break. Tom Pidcock (Ineos Grenadiers) and Kevin Geniets (Groupama-FDJ) joined the new lead group after chasing with another rider, and the front selection took around 25 seconds into the last 35 km, with Alaphilippe driving the pace up the Leberg.</p>\n\n\n\n<p>On the Berendries, Alaphilippe attacked the lead group and built a small gap. Pidcock and Van Avermaet made moves in pursuit but did not create much separation from the other chasers. Meanwhile, the larger pack continued to drive a high pace behind, keeping the gap manageable.</p>\n\n\n\n<p>Stybar crashed inside the last 30 km. With 20 km to go, the pack was within 10 seconds of the second group. Before long, the larger group of Van Avermaet was caught, and then Alaphilippe was reeled in as the race approached the Muur van Geraardsbergen, the penultimate climb of the day. The iconic climb saw some activity at the front as Gianni Moscon (Ineos Grenadiers) jumped clear, while plenty of riders dropped off the back, but Moscon did not open much of a gap. He was caught on the Bosberg, the final climb of the race, and with no one creating much separation on the cobbled ascent, a sprint began to look likely.</p>\n\n\n\n<p>Things held together over the final 13 km with Deceuninck-Quick-Step driving the pace for much of the finale. A mechanical inside the last 2 km saw Alexander Kristoff (UAE-Team Emirates) drop out of contention.</p>\n\n\n\n<p>Deceuninck-Quick-Step led under the flamme rouge with Kasper Asgreen at the head of the race, Florian Sénéchal in second wheel, and Ballerini in third, with Lotto-Soudal&#8217;s Philippe Gilbert just behind. Deceuninck-Quick-Step remained in control through the multiple twists and turns of the final kilometer, with Asgreen peeling off with around 500 meters to go. Sénéchal led the way until the last 200 meters, and when Ballerini launched his sprint, no one came particularly close to catching him. The 26-year-old Italian took what is already his third win of the young season at the line, with Stewart taking second and Vanmarcke in third just ahead of Heinrich Haussler (Bahrain Victorious).</p>\n\n\n\n<p><strong>Results</strong></p>\n\n\n\n<p>1 BALLERINI Davide (Deceuninck &#8211; Quick Step) 4:43:03<br>2 STEWART Jake (Groupama &#8211; FDJ)<br>3 VANMARCKE Sep (Israel Start-Up Nation)<br>4 HAUSSLER Heinrich (Bahrain &#8211; Victorious)<br>5 GILBERT Philippe (Lotto Soudal)<br>6 ARANBURU Alex (Astana &#8211; Premier Tech)<br>7 SÉNÉCHAL Florian (Deceuninck &#8211; Quick Step)<br>8 TRENTIN Matteo (UAE-Team Emirates)<br>9 GENIETS Kevin (Groupama &#8211; FDJ)<br>10 POLITT Nils (BORA &#8211; hansgrohe)</p>\n\n\n\n\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/ballerini-sprints-to-victory-at-the-omloop-het-nieuwsblad/\">Ballerini sprints to victory at the Omloop Het Nieuwsblad</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"93b29471af272bde8aff2eb2018571dabe290e9221aff823a53508eb5806a799","category":"Cycling"}