{"title":"182 Converting spring-born heifers into a summer-calving herd increases subsequent cow longevity and productivity","link":"https://academic.oup.com/jas/article/102/Supplement_3/314/7757424?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Developing replacement heifers is one of the most expensive and complex management decisions for a cow-calf producer, which also has long-term implications for profitability. The objective of this study was to determine the impact of converting spring-born heifers into a summer-calving herd on growth, reproductive performance, longevity, and productivity compared with early or late-born May heifers. Over a 3 yr period, Red Angus/Simmental crossbred heifers (n = 273) were utilized to determine the impact of converting March-born heifers (Convert; n = 90) to a May-calving herd compared with May-born heifers on reproductive performance, body weight (BW), and calf performance from a yearling to 5 yr of age. May-born heifers were retrospectively grouped into 2 different groups: heifers born in the first 21 d of calving as a heifer calf (Early; n = 123) or heifers born after the 21 d of calving as a heifer calf (Late; n = 60). Heifers were exposed to bulls for a 45-d breeding season with a bull-to-heifer ratio of 1:20. Heifers were synchronized with a single injection of prostaglandin F2α (5-mL i.m.; Lutalyse, Zoetis, Parsippany, NJ) 5 d after bulls were introduced in the pasture for breeding. Data were analyzed as a randomized design using the MIXED procedure (SAS Inst. Inc., Cary, NC, USA). All binomial data were analyzed using PROC GLIMMIX. Heifer served as the experimental unit with treatment and year developed set as fixed effects. Heifer BW at December, May, July, and pregnancy check (Oct) were greater (<span>P</span> &lt; 0.01) for Convert heifers with no difference between Early and Late born heifers. Heifer BCS at pregnancy check was not different (<span>P</span> = 0.13) among heifer treatment groups. However, pregnancy rate tended (<span>P</span> = 0.08) to increase for Convert heifers with no difference between Early and Late born May heifers. After 5 yr of age, retention rate was increased (<span>P</span> = 0.04) in Convert cows compared with Early and Late May-born cows with no difference (<span>P</span> = 0.84) between the two May-born heifer groups. Total kilograms of calf weaned was greater (<span>P</span> = 0.04) in Convert cows than their counterparts with no differences (<span>P</span> = 0.94) between Early and Late May-born cows. This study implies that selecting replacement heifers from an earlier calving season for replacements in a later calving season increases the longevity and long-term productivity of the cowherd than selecting heifers within the same calving season. This may be even more important in resource-poor breeding environments that create reproductive challenges for heifers and rebreeding young cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"93bc180169965963df08de3c388dccf7b78fb9cba29d675b282ddce07795bcdd","category":"Environment"}