{"title":"Speed Limits in S&atilde;o Paulo and the Actions for Road Safety and Air Quality","link":"https://www.preprints.org/manuscript/202407.0972/v1","date":1720695639000,"content":"Studies carried out have revealed that every day around three thousand and twelve people lose their lives in the world due to traffic accidents and poor air quality. Large cities, with their millions of inhabitants and vehicles, face many problems relating to vehicular traffic. In 2015 the speed limit was modified on several roads in the city of São Paulo-Brazil. However, in 2017 the speed limits were increased again, but not on all previous routes. This study analyzed the impact of this change on the number of accidents and pollutant concentrations, over a period of ten years, comparing the periods before and after the implementation of the measure, using real data collected and provided by the authorities of the city and the state transit and environmental companies, on more than forty routes and two nearby air quality stations. The results show a clear reduction in the number of accidents without victims on the roads of the city of São Paulo starting in 2010. However, the restrictive measures imposed by government officials may have contributed to the decrease in the number of accidents, but the number of fatalities has not changed much. Air pollution has not improved substantially with speed changes, as new speed increases have been linked to new episodes of congestion. The average number of fatalities due to accidents has been increasing since 2010 and accidents are becoming more serious. The application of a general linear statistical model (GLM) estimated the impact of the speed reduction policy in terms of the number of injuries avoided per month: 43.4 and 14.1 on other roads and on Pinheiros marginal, respectively. The results highlight the need for a constant data collection by the authorities in cities with high vehicle traffic. The important temporal time trend in terms of reduction of injuries but not in terms of fatalities and air quality, shows the need to apply joint public policies, not only speed reduction, but also the use of new technologies and raising drivers’ awareness of the problem.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"93bd254a0512014fb4a7b95f58453607d5a169941d55e1d5988c1774978740be","category":"Interdisciplinary"}