{"title":"PSI-5 Evaluation of EhV (surrogate for African swine fever virus) inactivation in corn- and soybean-based feed ingredients and diets at various times and temperatures during storage","link":"https://academic.oup.com/jas/article/102/Supplement_2/347/7664884?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>African swine fever virus (ASFV) is a member of the nucleocytoplasmic large DNA viruses (NCLDVs) and remains stable in a variety of environments, including animal feed ingredients as shown in previous laboratory experiments and simulations. <span>Emiliania huxleyi</span> virus (EhV) is another member of NCLDV, which has a restricted host range limited to a species of marine algae called <span>Emiliania huxleyi</span>. This algal NCLDV has many similar morphological and physical characteristics to ASFV which makes it a safe and reliable surrogate for studying ASFV survival and inactivation in feed ingredient matrices in-situ under various time and temperature storage conditions. The objective of the present study was to investigate the inactivation of ASFV in various feedstuffs under a wide range of time and temperature conditions during storage using EhV as a surrogate. Corn- and soybean-based feed ingredients including corn, corn fermented protein, distiller dried grains with solubles, extruded soybean meal, high protein distiller’s grains, solvent-extracted soybean meal, soybean hulls, complete feed, and a positive control (no matrix) were inoculated with EhV (1 × 10<sup>8</sup> viruses/mL). Negative controls were inoculated with medium containing no EhV for each matrix. To assess the effects of different times and temperatures of storage, all samples were stored at temperatures of 4, 24, and 34 °C for 1, 5, 60, and 120 d. For each timepoint and temperature combination, samples were evaluated for virus presence (qPCR) and viability using a previously validated viability qPCR (v-qPCR) method. On average, we observed a 0.2 log reduction in viable viral DNA content over the 120-d period, with a 0.1 log reduction across varying temperatures. No reductions in EhV viability exceeding 1 log were detected for any matrix and the positive control at any time and temperature combination evaluated. No EhV was recovered from the negative control samples. Given that the experimental error was calculated to be within the range of 1 log, we concluded that storing EhV at 4, 24, or 34 °C for up to 120 d did not result in the inactivation of EhV in any of the ingredients, complete feed, or the control with no matrix. These results demonstrate that ASFV-like NCLDVs is extremely resilient and can maintain viability in various feed matrices during long-term storage and suggest that extending storage time alone may not be an effective mitigation practice against African swine fever virus.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"93bedf9861a66d79f9cae34ca3b1dab920d9897462f3dd9fb5d29581a58877e3","category":"Environment"}