{"title":"Upstream factors impacting COVID-19 vaccination rates across Africa: A systematic review protocol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310884","date":1727272800000,"content":"<p>by Obidimma Ezezika, Tiana Stephanie Kotsaftis, Alanna Marson</p>\r\nBackground <p>Upstream factors have been found to affect COVID-19 vaccination rates and coverage globally. However, there are inadequate details within the African context. This systematic review aims to close this research gap by investigating upstream factors influencing COVID-19 vaccination rates in Africa.</p> Methods <p>A literature search will be systematically conducted utilizing various databases including: MEDLINE, EMBASE, SCOPUS, CINAHL, Web of Science, and PsycINFO. Eligible studies will include peer-reviewed articles published in the English language from 2020–2023, conducted in Africa, focused on upstream factors, and include one barrier or facilitator to COVID-19 vaccination rates. Two reviewers will use a two-step screening process to examine every article’s title, abstract, and full text. A third-party reviewer will resolve disagreements between both individual reviewers. This review will focus on extracting data from published studies to explain the upstream factors included and their impact on COVID-19 vaccination rates across Africa. Data and records will be managed using Covidence. Preferred Reporting Items for Systematic Reviews and Meta-Analyses [PRISMA] framework will be used as the basis for reporting. To reduce bias, the researchers will use the Mixed Methods Appraisal Tool to assess the studies chosen for review. Results will be compiled utilizing four tables to summarize articles and group determinants based on the Consolidated Framework for Implementation Research (CFIR).</p> Discussion <p>Upstream factors have been cited as affecting population health, vaccination programs, and COVID-19, yet a large-scale systematic review has not been conducted to investigate these factors in relation to COVID-19 vaccination disparities faced in Africa. This review aims to analyze the root causes of African vaccination disparities by focusing on upstream factors. Understanding these factors is vital to help explain why these disparities occur and for designing effective interventions for future vaccinations. The results are expected to provide insights for researchers, policymakers, health systems, and individuals by identifying how resources and efforts can be better utilized to improve vaccination uptake and access.</p> Trial registration <p>Systematic review registration: CRD42024501293.</p>","author":"Obidimma Ezezika","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93d005adc4f66ff7a25c7772bc4a3304faa454dd86219808c5c62bad32ef5189","category":"Interdisciplinary"}