{"title":"Radiological and clinical outcomes after Attune primary total knee arthroplasty using Stemmable Tibia: A two-year follow-up prospective bi-center study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309015","date":1724940000000,"content":"<p>by Seung Joon Rhee, Seung Hun Woo, Jung Shin Kim, Mi Sook Yun, Chankue Park, Sang-Min Lee</p>\r\n\r\nThis prospective bi-center study aimed to analyze the outcomes of primary total knee arthroplasty using the Stemmable Tibia Attune system. A total of 100 patients who underwent primary total knee arthroplasty with Stemmable Tibia from January 2019 to December 2021 were enrolled in the study. Radiological outcomes (hip-knee-ankle axis and medial proximal tibial angle) were assessed preoperatively and postoperatively. Clinical outcomes (visual analog scale score, Hospital for Special Surgery score, Knee Society function score, Knee Society knee score, flexion contracture, further flexion, and range of motion) were analyzed preoperatively and at 6 weeks, 3 months, 6 months, 1 year, and 2 years postoperatively. Complications (periprosthetic joint infection and aseptic loosening) were examined. The hip-knee-ankle axis decreased (preoperative: 9.5° ± 6.3°, postoperative: 1.1° ± 2.7°), whereas the medial proximal tibial angle increased (preoperative: 84.6° ± 4.1°, postoperative: 89.8° ± 1.9°). The visual analog scale score, Hospital for Special Surgery score, Knee Society knee score, and Knee Society function score increased postoperatively. The Knee Society knee score indicated above good outcomes (100.0% and 99.0% at 1 and 2 years postoperatively, respectively). The Knee Society function score also showed above good results (98.0% and 93.0% at 1 and 2 years postoperatively, respectively). The range of motion significantly improved (p &lt; 0.001): flexion contracture decreased from 9.10° ± 7.23° to 2.15° ± 2.87°, whereas further flexion increased from 136.05° ± 14.78° to 139.80° ± 10.02°. One patient developed periprosthetic joint infection; no early loosening was observed. In conclusion, Attune primary total knee arthroplasty with Stemmable Tibia not only is safe and effective but also leads to radiological and clinical improvements.","author":"Seung Joon Rhee","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93d1ee734581376b15004f17a6c5c5c496186afb01c2ea8d605b1705e6552986","category":"Interdisciplinary"}