{"title":"PSIII-13 Putative metabolites for sow lifetime opportunity and production traits","link":"https://academic.oup.com/jas/article/102/Supplement_2/329/7664761?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Identifying females with favorable lifetime born alive (opportunity) and weaned (wn; production) traits requires extended observation. Estimate of lifetime (4 parities) difference in the economic margin over genetic cost between a high producing female (48 pigs weaned; wn) and a low producing female (31 wn) is approximately $1,000. Determining metabolic compounds present from females with favorable or unfavorable longevity traits may provide profiles that could be assessed in younger females prior to entry within the breeding system to indicate their potential productivity. Females within the USMARC breeding system were retained through four parities then harvested between 12 to 15 d following their post-weaning estrus. Liver, skeletal muscle, and subcutaneous adipose tissues were collected and stored at -80° C for later analyses. Females were categorically identified by the level of opportunity (born alive; ba) and production (wn) over their lifetime. Females with consistent opportunity and production traits at each parity were categorized as high (H; 61 ba), medium (M; 50 ba), or low (L; 39 ba) opportunity and H (50 wn), M (42 wn), or L (34 wn) production resulting in six categories (HH, HL, MH, ML, LH, LL). Tissue extracts were subjected to positive mode UPLC-MS and numerous features were detected. Using Progenesis Q software features were annotated and those with a fold-change ≥ 2.0 and <span>P</span> &lt; 0.05 by category were then tested using a mixed model in SAS to determine LS Mean differences of raw abundances among the six categories. Of those compounds tested in SAS, a significance threshold was set at <span>P</span> &lt; 0.01 as a false discovery adjustment. Within liver 877 compounds were analyzed with 152 yielding a significant (<span>P</span> &lt; 0.01) categorical effect. Of those, 43 compounds predominantly identified either HH or LL from other categories. Within skeletal muscle 359 compounds were subjected to mixed models, 221 compounds had significance for a category effect, and 105 compounds were predominantly different for HH or LL from all other categories. Within adipose tissue, 406 compounds were submitted to mixed model testing, 186 compounds had a categorical effect with 44 compounds predominantly different for HH or LL categories. Annotation of these compounds suggest differences in metabolites associated with, but not limited to, bacteria by-products (pradmicin, adifolin, lactobacillic acid), alkyloids, sapogenins, amino acids (lysine, tyrosine), minerals (calcium, copper), lipids (sphingomyelin), and fatty acids (mono-, di-, tri-acylglycerol). Future confirmation and evaluation of these metabolites in young pre-breeding females will need to be done. Establishing a metabolic profile panel that could discern young pre-breeding gilts with a likelihood of becoming a LL female will improve economic productivity and animal welfare concerns.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"93d8d3d17e80666f982b524f8e427d3af8a7e04ddde4a0a0f6548f94170fbfca","category":"Environment"}