{"title":"Bungie wins $489K from player for racist harassment of employee","link":"https://arstechnica.com/?p=1953904","date":1689338000000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/destiny2-800x450.jpg\" alt=\"Artist's conception of Bungie hitting Comer with nearly half a million dollars of damages for harassing their employee.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/destiny2.jpg\">Enlarge</a> <span>/</span> Artist's conception of Bungie hitting Comer with nearly half a million dollars of damages for harassing their employee. (credit: Bungie)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A Washington state judge has issued a $489,000 default judgment against a West Virginia man who sustained an extended and targeted harassment campaign against a <em>Destiny 2</em> community manager. Beyond the direct victory for Bungie and its employee, though, the case sets a new legal precedent for companies seeking to recover expenses related to similar harassment of their staffers.</p>\n<p>The <a href=\"https://drive.google.com/file/d/14s3qU7K78oeSvWW1YL8RD3cofI-7mCaU/view\">judge's order</a>, as <a href=\"https://twitter.com/KathrynTewson/status/1679245990187126785\">shared by paralegal Kathryn Tewson</a> (who worked on the case), details what Tewson calls \"sociopathic conduct\" by one Jesse James Comer, who became \"incensed\" after an unidentified Bungie community manager promoted fan art by a black artist. Comer then proceeded with a campaign of what the court describes as \"carpet bombing\" the community manager with texts and \"hideous, bigoted voicemails,\" including multiple requests \"to create options in its game in which only persons of color would be killed.\"</p>\n<p>The harassment extended to Comer sending \"a virtually inedible, odiferous pizza\" to the target's address, a \"pizza-shaped threat\" that caused the manager and their family to \"legitimately fear... for their safety, as someone clearly was targeting them and knew where they lived.\"</p></div><p><a href=\"https://arstechnica.com/?p=1953904#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1953904&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"93d9c61b3bdab69e7c7e309dc22adde21a9e80ab9e8a6a4bb2cb56721b927c5e","category":"Tech"}