{"title":"Coupling of potential habitat models with particle tracking experiments to examine larval fish dispersal and connectivity in deep water regions","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308357","date":1723471200000,"content":"<p>by Gonzalo Daudén-Bengoa, Julio Sheinbaum, Javier RodríguezOuterelo, Sharon Z. Herzka</p>\r\n\r\nComputing Lagrangian trajectories with ocean circulation models is a powerful way to infer larval dispersal pathways and connectivity. Defining release areas and timing of particles to represent larval habitat realistically is critical to obtaining representative dispersal pathways. However, it is challenging due to spatial and temporal variability in larval density. Forward-tracking particle experiments were conducted to study larval connectivity of four species (neritic or mesopelagic) in the Gulf of Mexico’s (GoM) deep-water region. A seasonal climatology coupled with predicted potential larval habitat models based on generalized additive models was used to delimit the particle dispersal origin. Two contrasting mesoscale circulation patterns were examined: (1) high Loop Current (LC) intrusion, absence of recently detached LC anticyclonic eddies (LC-ACE), and no interaction between LC-ACEs and the semi-permanent cyclonic eddy (CE) in the Bay of Campeche (BoC), and (2) limited LC intrusion, a recently detached LC-ACE, and interaction between LC-ACEs and the BoC’s CE. To simulate larval transport, virtual larvae were randomly released in the potential habitats and advected for 30 days with the velocity fields of the HYbrid Coordinate Ocean Model with hourly-resolution assimilation. Potential habitat location and size played a major role in dispersal and connectivity. A greater percentage of particles were retained in potential habitats restricted to the southern BoC, suggesting lower connectivity with other GoM regions than those encompassing most of the BoC or the central Gulf. Mesoscale feature interactions in the western GoM and BoC led to greater dispersion along the western basin. By contrast, the absence of ACE-CE interaction in the BoC led to greater retention and less connectivity between the southern and northern GoM. Under high LC intrusion, particles seeded north of the Yucatan Shelf were advected through the Florida Straits and dispersed within the GoM. Coupling potential habitat models with particle experiments can help characterize the dispersal and connectivity of fish larvae in oceanic systems.","author":"Gonzalo Daudén-Bengoa","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93da6b5163e3084259590c47b8ed87628038f405415e1bccd1d1e5c9e21d865d","category":"Interdisciplinary"}