{"title":"The Future of Mobility: Recapping Eurobike 2023 Part 02 – Petor Georgallou","link":"https://theradavist.com/the-future-of-mobility-eurobike-2023-part-02/","date":1689246014000,"content":"<p><em>Today, we continue <a href=\"https://www.instagram.com/dear_susan_/?hl=en\" target=\"_blank\">Petor Georgallou</a>‘s <a href=\"https://theradavist.com/eurobike-2023-recap-gallery-01/\" target=\"_blank\">coverage of Eurobike 2023</a>. In his second installment from this year’s convention, Petor looks at an ensemble of beautiful bikes, in addition to what Eurobike considers the future of mobility. While shocked at first, the more Petor peeled back the layers of what was on display, the more interested he became… </em></p>\n<p><span></span></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1343\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=1024,688&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=768,516&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=1800,1209&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=1335,896&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=700,470&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-207.jpg?resize=1536,1031&amp;quality=75 1536w\" /></p>\n<p><em>Continued from <a href=\"https://theradavist.com/eurobike-2023-recap-gallery-01/\" target=\"_blank\">Folding Bikes, Weird Sights, and Crashing Eurobike Part 01</a></em></p>\n<p>After a blur of meetings and a maze of halls, I found myself in Hall 11. Save for a stop at Classified to actually try out their magic hubs, this involved a lot of <em>walking</em> and not a lot of <em>l</em><em>ooking</em> because both actually-nice bikes and the Weird Stuff were both in short supply. I did, however, enter Shimano-land. Not only was the coffee on the Shimano booth excellent but so was the food in the “for-Shimano-employees-only-cafe.” As an extra layer of security after the paper sign on the door, the lady at the cafe asked: “Are you a Shimano employee?” Indeed I was.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1279\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=1024,655&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=768,491&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=1800,1151&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=1335,854&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=700,448&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-121.jpg?resize=1536,982&amp;quality=75 1536w\" /></p>\n<h3>Beautiful Bikes Courtesy of Shimano</h3>\n<p>Besides fuel, there were some surprising and super nice builds on the Shimano booth, which had approximately the footprint of a small airport or an ample train station, or some kind of sports field. Like a golf course or motocross circuit. It was much bigger than a snooker hall or a tennis square. The first build I picked out from Shimano/Pro was this gloriously understated TIG welded Feather gravel build, with paint by Jack Kingston. With a GRX DI2 groupset and a smattering of Pro components, the build was pretty smart while also being reasonably normal. I loved the use of an external headset, allowing for good-sized bearings, but the main thing I loved about this bike was Jack’s paint scheme, with a wild airbrushed fork.</p>\n<p>Ricky Feather is one of the oldest among the new wave of builders in the UK with more frames under his belt than most will ever achieve. Sure, this is just a normal gravel bike but it just has that thing that is really hard to put a name to, where—while nothing specific is wildly out of the ordinary—each part of the process is done to a quality that means that the finished bike is just a cut above what you expect from even a really high-end bike.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-87.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>This Quirk Durmator in signature kintsugi-inspired marble by Lucia at Velefique deserved Dura Ace but wore Ultegra just fine. While 3D printing has become super popular (and, has therefore been adopted by companies and builders across the board for various things that would be just fine without it), Rob uses a mix of printed parts and traditional parts, in a mix of stainless and Columbus steel to great effect.</p>\n<p>Having just reluctantly returned the Suprachub I’ve been testing for the past three months, the printed parts and custom tube mix really add to the build, reducing weight, labor time, and visual impact while increasing stiffness, strength, and integration. In the past couple of years, Quirk has started producing frames that are among the finest steel frames available from any builder anywhere. Producing only 15 frames a year, the level of development and detail from frame to frame is astounding and the last six frames I’ve seen from Rob have all been absolutely mind-blowing. I think I might have to start saving for a stainless Quirk road frame.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-30.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<h3>Torpado Bikes</h3>\n<p>Between Shimano and the basically oppressive “Bulls” (i.e. sea of uninteresting bikes sapping all notion of bikes as something that can have value) was like a little bar where Italian men were eating antipasti. As an eating enthusiast, I felt it appropriate to join in. Trying to bolster the day’s caloric intake with olives and little peppers stuffed with soft cheese (tour-de-francemen need 100g of carbs an hour, but Eurobike eating is more like a camel drinking 30 gallons of water at an oasis, thereby readying itself for an indefinite period of deprivation), I noticed a relaxed looking Diego picking at small hams next to me. Diego Brunello is an anomaly. The first time I met him was at BESPOKED a few years ago, where he was standing on his colleague’s shoulders in the absence of a ladder, tying a banner to a section of truss at the Cybro booth. We got chatting and it turned out that he was a designer, rather than a frame builder, who’d cut his teeth designing paint for the late great Dario Pegorreti.</p>\n<p><em>I’m sorry, did you buy these olives?</em></p>\n<p>I tried to say, although my mouth was so full of olives I’m not sure he understood.</p>\n<p>“Ciao Petor!”</p>\n<p>(Diego is a very jolly, and supremely friendly man.)</p>\n<p><em>Are you here with Cybro? I must have missed you on the exhibitor list (It’s 62 pages of very small print)</em></p>\n<p>“Come see, I’ll show you what I made”</p>\n<p>He led me round the corner to a pretty big booth with a sign that read “Torpado, you and the Italian legend” which I could only assume was meant in reference to Diego.</p>\n<p>“I designed all of these bikes”</p>\n<p>There must have been 30 bikes in total, spanning the Spectrum from middle-of-the-road ebikes to, if I’m being honest, absolute turds. It was a significant departure from the lofty heights of designing paint for Peggoretti or from the highly stylized super shiny Cybro, although I could still see a little personality and design flair in some of them. I struggled for words, and I think he could see I was a little uncomfortable…</p>\n<p>“This one retails for 79 euros. Everything is steel.”</p>\n<p><em>That’s kind of impressive. I guess it’s all mild steel? But even then? The cost of the parts and assembly must be basically nothing.</em></p>\n<p>“Feel it, it weighs a ton! Al also designed these, and these. And look at this one!”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1536\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=1024,786&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=768,590&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=1800,1382&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=1335,1025&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=700,538&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-21.jpg?resize=1536,1180&amp;quality=75 1536w\" /></p>\n<p>Finally, he showed me something I could kind of get behind. A super adjustable carbon fiber upright electric cargo quadricycle with massive carbon leaf springs, weighing only 46kgs, but with a 300kg load capacity, which is pretty much the same as an electric van. It’s a vehicle that can be customized with both wheelbase and body/box options which should, theoretically, offer a very attractive alternative to small cargo vans in cities. The quadricycle is definitely designed as a commercial vehicle, rather than anything any consumer might want or need—having said that I’d be kind of into one!</p>\n<p>While it’s obviously hugely useful as an inner city delivery vehicle, especially where governments give grants for businesses to switch to electric vehicles (it retails at 17,000 euros), I can also see them being super useful and profitable as rental vehicles in the film industry. If you’ve ever seen or even operated a camera rickshaw, the Sum X is a vastly superior vehicle, with more than enough options for customization to make it super useful for all sorts of things. I enjoyed seeing Diego’s joy riding it around the show, with me sat on the back, as well as recognizing his design and visual language in its construction from having seen his work at Cybro.</p>\n<p>As I left the show that evening to go to the start of a local alleycat with the Brompton crew, I picked up Andrew’s press pass, as it was his last day at the show, and it saved me an hour round trip to the press room to print off my own. The following days were much easier entering and exiting the show with a fake name, and a mild disguise.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-85.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Freaky Saturday</h3>\n<p>My penultimate day at the show was spent on a quick four-hour lap of hall 9 which was a brisk walk around looking at this and that, and a decent chunk of time spent in my favorite hall, hall 8. Hall 9 can be summarized into things made of inappropriate materials to low standards, direct knock-offs of known products made to low standards, and some cool and interesting factories, up for making pretty much anything for pretty much anyone to a decent standard that most people would be happy with at astoundingly low prices.</p>\n<p>Many of the factories are government-sponsored or part government-owned, and the range of what’s available is truly impressive. It was interesting to apply the reverse of the immediately obvious ideology of “this is a knock-off of this well-known brand” to “this factory produces everything for all these well-known brands” and in that way, some parts of Hall 9 were pretty interesting but not really suitable for show highlights.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1456\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=1024,745&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=768,559&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=1800,1310&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=1335,972&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=700,510&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-173.jpg?resize=1536,1118&amp;quality=75 1536w\" /></p>\n<p>Halfway down my first row of hall 8, I was hooranged into test riding arguably one of the worst vehicles I’ve ever interacted with. Some kind of electric scooter thing with wheels so fat that it doesn’t fall over. It had some sort of control system that meant it either accelerated at full power after a short delay or not. If Eurobike is an indicator of the genuine future of urban mobility, we all have to cycle so much in the next three to five years that our knees and hips need replacing, because the majority of proposals for what future mobility might look like resembled mobility scooters more than bicycles.</p>\n<p>I took my more-or-less uncontrollable mobility scooter for a lap of the hall, struggling to turn the corners on the insufficient radius of the tires, and mostly succeeding in not hitting anyone or anything. I made a stop at the Saxony booth to see Roman of Qvist, whose hubs I imagine to be part of the future of my mobility (I’m strongly hinting at a pair to test out here), and to see the Saxony bike: a Sour Bikes Purple Haze built entirely with parts made in Saxony.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1366\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=1024,699&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=768,525&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=1800,1229&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=1335,912&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=700,478&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-46.jpg?resize=1536,1049&amp;quality=75 1536w\" /></p>\n<p>Saxony, the state in eastern Germany, is home to a huge number of incredible small manufacturers operating on a scale between independent makers and somewhat niche, yet global, industries: Sour, BEAST, Qvist, Pyrope, and Active, to name just a few. The Saxony Purple Haze mostly featured them all, with a frame made in Dresden, Sour’s new adventure gravel fork, Actofive cranks, Timba patchwork bags, Pyrope hubs and spokes, and BEAST everything else. It was kind of amazing to see a bike that was put together predominantly from parts made within a 100-mile radius, the exception of course being SRAM brakes and gearing, as well as tires and SQlabs bar tape.</p>\n<p>I’m also a huge fan of Actofive for building frames in a more or less insane way, by just milling them out of massive billets, although they are way beyond anything I’d ever need for the kind of riding I do so I’m glad they make a crankset for fanboys, which weighs as little as an aluminum crankset can and fits well on most gravel builds, tucked neatly into the Sour’s cast drive side yolk.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-163.jpg?resize=1536,1024&amp;quality=75 1536w\" /> <img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-162.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Cruising around on my horrid electric accident waiting to happen, I stopped by the booth of a Chinese titanium manufacturer selling a fully titanium BMX frame and fork, with bars and a seatpost for 600 euros which looked pretty nicely made, and kind of tempting. As an old fat guy with a sore back and bad teeth, I don’t ride a BMX, but I did ring around some friends who do to see if they wanted me to smuggle it home for them, because, since Brexit, smuggling has become the UK’s most necessary crime.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1356\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=1024,694&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=768,521&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=1800,1220&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=1335,905&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=700,475&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.1-214.jpg?resize=1536,1041&amp;quality=75 1536w\" /></p>\n<h3>Gunzel Folding Bikes</h3>\n<p>While I was on the phone chatting about the BMX and fondling some titanium grips that looked absolutely useless for anything but a chopper, the booth’s inhabitants wheeled out one of the stranger things I’d seen at Eurobike… an entirely titanium copy of a Brompton branded Gunzel. Even the rear elastomer had been replaced by a titanium spring that sat jauntily at an angle. Brompton is mad enough to build their bikes in London with the exception of the T-line built in Sheffield, so it’s not an unbranded bike from the same factory, it’s a direct knockoff, which as I understand it is stealing IP. It featured a wider rear triangle accommodating a cassette and traditional rear mech as well as disc brakes and a titanium rack with printed foldy wheels.</p>\n<p>While on paper it’s a good bike, it’s also like buying <em>2001: A Space Odyssey</em> on DVD as a pirate copy. The film itself is widely available and is shot using Panavision Super 70 system, for astoundingly imperceivable high resolution. It’s a quality product designed around being of a certain quality, and watching a cheap knockoff might be fine, or might not, but definitely won’t be the same as watching it on a 70mm projector as it’s designed to be watched. Almost the weirdest part was the genuine Brompton leather mudflap attached to a carbon fiber mudguard.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-177.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<h3>The Terminator’s Golf Buggy</h3>\n<p>Perhaps the best thing I saw at Eurobike I approached ready to poke fun at, as per my brief of finding the weird stuff (see <a href=\"https://theradavist.com/eurobike-2023-recap-gallery-01/\" target=\"_blank\">Part 01</a>). The reason why it was probably my favorite thing is that once I’d scratched the surface, it totally changed my mind, and genuinely proposed a new approach to urban mobility that takes into account the total user experience of a vehicle and how it fits into existing systems in a far more holistic way than anything I’ve ever seen at an urban mobility/bike show before. The vehicle on display looked like the Terminator’s golf buggy; a crudely MIG welded steel chassis, covered in wires with a load of folded aluminum panels bolted to it. It was a three-wheeled, two-seater buggy with a roof and windscreen clamped in with MIG welded clamps padded out by printed bits.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-181.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p><em>Okay… so explain this to me. What’s going on here? </em>I asked Nina who came to greet me once I showed an interest in the buggy.</p>\n<p>“So it’s an electric vehicle, classed as a powered trike so you need a license and a number plate, that can go 120kph with two people in it. The really amazing thing we’ve made is this generator which means that it has no drive train, so there’s very little maintenance.”</p>\n<p>I’d ridden bikes which used pedal sensors that relayed cadence to electric motors before, and invariably they’ve been pointless heaps of shit worth less than the scrap they’re made from. You could say I had a stance on the idea for sure. Roman interjected:</p>\n<p>“But what if you run out of battery?”</p>\n<p>“You don’t need a battery for it to run. You generate power by pedaling.”</p>\n<p>“Sure but how much power do you actually generate, that has to be super inefficient compared to just pedaling.”</p>\n<p>“At best a clean drivetrain is about 95% efficient, but that’s the best-geared drivetrain operating under optimal conditions, in reality, it’s more like 90%, but again that is for a cycling enthusiast, who buys super high-quality parts and cleans their bike often. For most normal people on a commuter bike that they might leave locked outside it’s more like 75% or 80% efficiency which is comparable to our system which can generate power to drive the wheel at 75% efficiency with virtually no loss of efficiency over time.”</p>\n<p>Our jaws dropped.</p>\n<p>“So it’s actually generating power when you pedal, and the motor is a separate unit that can be fed solely from the power generated with no battery?”</p>\n<p>“Right, so if you come and have a look at our model…..”</p>\n<p>“Haha I like that you made it a Marcel Duchamp”</p>\n<p>“You’re the first person to have got that! That’s what we call Marcel Duchamp!”</p>\n<p>The illustrative science museum-esque modal they’d made to illustrate the drive, was designed to look like Marcel Duchamp’s famous ready-made “bicycle wheel”.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-179.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>We talked for a while, Roman and I growing increasingly impressed with this oddball drivetrain-less system, which wasn’t even 1% as shitty as either of us had expected. Okay perhaps these people weren’t 100% mad but they still had some convincing to do, because I’m inherently suspicious of all bicycle subversions and their implications as to what hellish contraption might come flying at you at a junction. What dorky middle-aged man in a motorcycle helmet and goggles might catch me during their rounds cruising from bike shop to bike shop under the pretense of a phantom problem as a cigarette paper thin facade for wanting to show bike shop guys his new toy. I asked if I could wheel it outside to photograph it in the light.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-182.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>I was ushered over to meet Pierre, one of the company’s co-founders, who was surprisingly enthusiastic about the idea. I was pretty sure it would be a hard no, but off the bat, he was weirdly cool with the idea. He gathered a crew and opened the shuttered side door of the hall and gently pushed the working prototype out. As we discussed where it was achievable to push the 300kg prototype by hand, we were descended upon by a dozen security guards half-crazed, flailing their arms wildly, red-faced and frothing. I recognized my time with the machine might be limited so I snapped away getting what I could in the less-than-ideal direct blare of the afternoon sun all the while trying to work out what was going on through a melee of German, French, and English. A witch hunt had begun to find the door opener, the guards frantically darted about trying to block me from photographing the vehicle and all kinds of chat ensued on the radio.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-191.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>According to the ancient adage about my enemy’s enemy, Pierre completely shut down any notions of authority the show’s overzealous security guards thought they had, so we were friends. I was growing increasingly impressed with this buggy.</p>\n<p><em>How long have you been working on this thing? </em>I wanted to know.</p>\n<p>“We’ve been working on it for eight years, but now we are a team of 60. This is our first working prototype and this is the first time we’ve shown it, but we’re hoping to go into production in 2025”</p>\n<p><em>Holy shit! Sixty people! That sounds expensive. How are you funding this thing?</em></p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-195.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>“We don’t need funding. We don’t want investors, that way we can stay completely independent and do whatever we want. This is my third business so I can just fund it for now, but soon when we release the drive trains I think they’ll fund the project”</p>\n<p><em>What’s your other business?</em></p>\n<p>“Old people’s homes, we look after people who can’t look after themselves anymore. That’s part of the idea of this project because active people are more healthy, it’s a way for older people to be more active, who would probably never ride a bike”</p>\n<p><em>So you’ll start selling these in 2025?</em></p>\n<p>“No. They’ll only be available for rental, like a rental car which is lease hire, but there’ll also be an app which means that other people can use it when you’re not using it, and they’ll pay rent by the hour. It means that the usage is maximized, which minimizes emissions because fewer vehicles have to be made, and the more you let other people use it the cheaper it becomes, or you could even make money from it.”</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1500\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=1024,768&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=768,576&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=1800,1350&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=1335,1001&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=700,525&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-206.jpg?resize=1536,1152&amp;quality=75 1536w\" /></p>\n<p>Pierre’s ideas are truly revolutionary in a number of ways. There’s a breath of fresh air in the way they measure energy consumption, as a number of KWHs consumed over an average number of journeys made in a week across a spectrum of both electric and petrol-powered vehicles, even showing that an electric SUV uses more KWHs than a normal petrol-powered car. Hearing him speak about the environmental impact of producing any vehicle and reducing that by making fewer vehicles, which are shared and more standard and repairable was music to my ears.</p>\n<p>The vehicle leans to feel more natural, be more stable and make the operator more active, but these leans are designed around people who aren’t used to riding bikes so they are controlled entirely by system haptics. Users have to pedal to move which, while entirely token, is necessary to keep the vehicle in motion, which is again designed around forcing a small and manageable amount of activity on users who would otherwise just be sitting in a car. The vehicle is designed to be comfortable with well-designed adjustable seats and air conditioning (although the prototype doesn’t look that way). Descending hairpin mountain passes near Annecy in the French Alps where Cixi is based, safely (it is crash tested to be comparable to a small car at low speed although there’s no obligation for this sort of vehicle to be crash tested) and at speed looks really really fun!</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1345\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=1024,689&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=768,516&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=1800,1211&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=1335,898&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=700,471&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-213.jpg?resize=1536,1033&amp;quality=75 1536w\" /></p>\n<h3>Look E-Bikes</h3>\n<p>While the Terminators golf buggy represents the macro end-game version of how we might shift to a new system of transport, on display was also a moped-looking electric bike thing that might be more immediately attainable. It was developed in collaboration with a French company and well-respected design house, Look, which was aesthetically pretty similar to the Concept Cargo Bike on the Gates stand. Its weirdo boxy construction and the way it was displayed on a plinth made me think that perhaps this, too, was a concept bike, but astonishingly it was in fact a fully working pre-production prototype. Although I wasn’t allowed to try the Look out, Pierre did whip out a proof of concept fully working bike with a frame built around the Cixi generator with a frame built by local alpine frame builder Epsilon, which he happily let me whizz around on.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1411\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=1024,722&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=768,542&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=1800,1270&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=1335,942&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=700,494&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-224.jpg?resize=1536,1084&amp;quality=75 1536w\" /></p>\n<p>The bike was for sure decently heavy, heavier than a normal bike, but at the same time had way fewer parts, and unusually for this type of bike was made by a legit frame builder from decent, lightweight tubes. Nina quickly briefed me on the controls which were a left and right hand, up and down arrows, each with a little LCD showing from 1-5. The left hand was for electric assist, where 1 is only the power you’re putting in with zero assistance, and where each subsequent level adds battery-powered assistance to double your power input. The right hand is related to cadence where 1 is low cadance and 5 is high cadence, because of course there are no physical gears.</p>\n<p>From the first pedal stroke which was kind of grindy, but only in the way that a brand new Rohloff Speedhub is grindy in the grindy gears, I was blown away by how normal and natural it felt. Because essentially I couldn’t care less about electric assist on a normal bike. I took a lap of the test circuit with zero assistance, trying all the different cadences out. It just felt like a bike. I could put low cadence on and stand up and pedal hard and that felt like a hard gear or do the opposite with no lag or weirdness. It just felt like a normal bike. With assistance added I was able to go too fast but still it just felt like a normal natural bike. With a normal 147mm Q Factor, rather than a silly electric motor.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=1024,682&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=1800,1200&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=1335,890&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=700,467&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-169.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3><span>Auf Wiedersehen, Eurobike 2023</span></h3>\n<p>While I’m definitely not going to rush out and buy a bike with an electric not-drivetrain any time soon, the versatility of the system and its scope to be adapted to a huge number of vehicles like cargo bikes that need super long chains or even pedal-powered boats, running an electric motor with a propeller, makes it a super attractive option for people designing lightweight electric vehicles. I certainly wouldn’t be against a cargo bike with a generator and a small battery, and there’s the added scope of driving multiple wheels at the same time (for example on an ability vehicle like an offroad 4WD handcycle). While the computational technology and haptics software are incredibly complex, the physical technology is pretty basic which means it can be made wherever, hugely reducing shipping emissions and dodging import tax and duty in weird separatist countries like the UK.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1285\" src=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?fit=1024,9999&amp;quality=75\" alt srcset=\"https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1024,658&amp;quality=75 1024w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=768,493&amp;quality=75 768w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1800,1157&amp;quality=75 1800w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1335,858&amp;quality=75 1335w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=700,450&amp;quality=75 700w, https://media.theradavist.com/uploads/2023/07/Eurobike-pt.2-209.jpg?resize=1536,987&amp;quality=75 1536w\" /></p>\n<p>I went to Eurobike looking for the weird stuff, and as expected I found it. What I wouldn’t have bet on was that weird stuff could actually be a starting point for a real systemic change in the sorts of vehicles that drive around cities. A starting point for vehicular infrastructure actually centered around being lower impact and more active. A genuine alternative to the current myopic futurism of “slap a battery on a 3D printed turd and off you go it’s electric. That’s green right?” There are few greater joys than having your mind changed, by being shown a genuine, contrasting, alternative to your deeply held beliefs. While Eurobike is an endurance event that left me burned out and dysfunctionally tired, and Frankfurt is an absolute hellhole, I made new friends, enjoyed hanging out with old ones, and felt the rare joy of having my mind changed.</p>\n<p>The post <a href=\"https://theradavist.com/the-future-of-mobility-eurobike-2023-part-02/\">The Future of Mobility: Recapping Eurobike 2023 Part 02</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"spencer harding","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"93dea983982de36254e314f4df3382a2d50bbac9e28fc218cf40b0b2bab13664","category":"Cycling"}