{"title":"PSI-22 Evaluating colonization success of Bacteroidetes from different host origin in broiler chickens","link":"https://academic.oup.com/jas/article/102/Supplement_3/469/7757737?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Current broiler production practices that aim to maximize biosecurity have limited chick exposure to beneficial microbes. Previous research highlights a notable disparity in <span>Bacteroidetes</span> abundance and taxonomy between birds reared under intensive and extensive systems. Building upon this, we hypothesized that Bacteroidetes strains populating intensively raised birds may originate from human sources, potentially leading to varied colonization efficiencies. The objective of this study was to evaluate the colonization patterns of diverse Bacteroidetes strains within the chicken gastrointestinal tract. One day-old broiler birds (n = 63) were raised in individually ventilated isolators accommodating 3 birds per cage. The chicks were subjected to inoculation either via oral gavage with 150 µL of glycerol stock containing 1x10<sup>4</sup> colony forming units (CFU)/mL; or spray method (2 mL per cage) using chicken-derived, human-derived, and a combination of <span>Bacteroidetes</span> strains. Notably, birds administered via oral gavage displayed an increase in body weight gain by d 07 compared with their counterparts treated via spray and the control group (<span>P</span> &lt; 0.01). Subsequent quantification of <span>Bacteroidetes</span>, <span>Enterobacteriaceae</span>, and total bacteria using qPCR revealed that oral gavage resulted in more successful <span>Bacteroidetes</span> colonization at d 14 (<span>P</span> &lt; 0.01). Moreover, discernible variations were noted in total bacterial abundance across treatment cohorts. It can be concluded that the method of inoculation appears to influence the initial colonization patterns of <span>Bacteroidetes</span> in the chicken gut, or that inoculation in the environment requires a higher dose. Amplicon sequencing that is underway will reveal the success of the <span>Bacteroidetes</span> from different host origin and the most successful strains of chicken origin. Overall, enhanced growth coincided with more successful Bacteroidetes colonization, identifying them as potential targets for enhanced broiler performance. Further investigation is warranted to determine if <span>Bacteroidetes</span> from different sources demonstrate varying colonization efficiencies.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"93e4549018b2bf75f3c874738b96403e0118dbe2a091ed7332d2a46e82bb389c","category":"Environment"}