{"title":"Effects of Chlorella pyrenoidosa Supplementation on Water Quality, Shrimp Growth Performance, and Biofilm Bacterial Community Structure in Litopenaeus vannamei Aquaculture Systems","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/9120191?af=R","date":1697785200000,"content":"<p><i>Chlorella pyrenoidosa</i> is a widely used microalgae in the aquaculture process of <i>Litopenaeus vannamei</i>. In order to evaluate the effects of supplementing <i>C. pyrenoidosa</i> on water quality, shrimp growth performance, and biofilm bacterial community structure in <i>L. vannamei</i> aquaculture systems, <i>C. pyrenoidosa</i> suspension was supplemented in the precultured biofilm (PB) and water exchange (WE) culture systems. The results showed that supplementation with <i>C. pyrenoidosa</i> significantly increased the turbidity and the concentrations of total ammonia nitrogen (TAN) and nitrite nitrogen (NO2−─N) in the PBC system (the PB system supplemented with <i>C. pyrenoidosa</i>), but had no significant effect on those in the WEC system (the WE system supplemented with <i>C. pyrenoidosa</i>). However, the TAN concentration of all systems remained at a low level (&lt;0.1 mg/L) throughout the experiment. Additionally, supplementation with <i>C. pyrenoidosa</i> decreased the final concentrations of total phosphorus in the PBC and WEC systems by 15.74% and 23.33%, respectively. With the supplementation of <i>C. pyrenoidosa</i>, the final weight, final biomass, and average daily growth rate of <i>L. vannamei</i> increased, while the feed conversion ratio decreased. 16srRNA high-throughput sequencing results showed that the supplementation of <i>C. pyrenoidosa</i> to the PBC system resulted in a decrease in the relative abundances of Proteobacteria and Bacteroidetes and an increase in the relative abundance of Acidobacteria. Compared to those in the initial biofilm sample, the relative abundances of nitrifying bacteria, <i>Nitrosococcus</i>, <i>Nitrosomonas</i>, <i>Nitrococcus</i>, and <i>Nitrospira</i>, in PBCF (biofilm in the PB systems with <i>C. pyrenoidosa</i>) and PBOF (biofilm in the PB systems without <i>C. pyrenoidosa</i>) decreased from 10.18% to 3.05% and 0.75%, respectively. In conclusion, <i>C. pyrenoidosa</i>, as a supplement to the aquaculture systems, has practical application prospects.</p>","author":"Yongxin Liu, \nAiling Xu, \nChao Liu, \nMingzhu Sun, \nZhiwen Song, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"93e5104dc58fb66a93bdd2e880262e35fd5daa16f6d37e82679cfb03a4d300a8","category":"Environment"}