{"title":"Association between sleep duration and hypertension incidence: Systematic review and meta-analysis of cohort studies","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307120","date":1721052000000,"content":"<p>by Kaveh Hosseini, Hamidreza Soleimani, Kiarash Tavakoli, Milad Maghsoudi, Narges Heydari, Yasmin Farahvash, Ali Etemadi, Kimia Najafi, Mani K. Askari, Rahul Gupta, Diaa Hakim, Kazem Rahimi</p>\r\nAim <p>Sleep duration has been suggested to be associated with hypertension (HTN). However, evidence of the nature of the relationship and its direction has been inconsistent. Therefore, we performed a meta-analysis to assess the relationship between sleep duration and risk of HTN incidence, and to distinguish more susceptible populations.</p> Methods <p>PubMed, Embase, Scopus, Web of Science, and ProQuest were searched from January 2000 to May 2023 for cohort studies comparing short and long sleep durations with 7–8 hours of sleep for the risk of HTN incidence. Random-effect model (the DerSimonian-Laird method) was applied to pool risk ratios (RR) and 95% confidence interval (CI).</p> Results <p>We included sixteen studies ranging from 2.4 to 18 years of follow-up duration evaluating HTN incidence in 1,044,035 people. Short sleep duration was significantly associated with a higher risk of developing HTN (HR: 1.07, 95% CI: 1.06–1.09). The association was stronger when the sleep duration was less than 5 hours (HR: 1.11, 95% CI: 1.08–1.14). In contrast to males, females (HR: 1.07, 95% CI: 1.04–1.09) were more vulnerable to developing HTN due to short sleep duration. No significant difference between different follow-up durations and age subgroups was observed. Long sleep duration was not associated with an increased incidence of HTN.</p> Conclusion <p>Short sleep duration was associated with higher risk of HTN incidence, however, there was no association between long sleep duration and incidence of HTN. These findings highlight the importance of implementing target-specific preventive and interventional strategies for vulnerable populations with short sleep duration to reduce the risk of HTN.</p>","author":"Kaveh Hosseini","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93edf4937fe434cbdfe7c0782a453e9de11d6eae16e097c4f7c8aaf8420de6fd","category":"Interdisciplinary"}