{"title":"How to set up networked Time Machine backups for a household","link":"https://www.macworld.com/article/2226221/how-to-set-up-networked-time-machine-backups-for-a-household.html","date":1708074000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s Time Capsule base station put a Wi-Fi access point, a network router, and a backup drive that tied into Time Machine all in a single box. That was its downfall, too: if the drive failed or became corrupted, you had relatively few options. Apple stopped selling Time Capsule devices in 2018, and many readers still miss them.</p>\n\n\n\n<p>You can simulate a Time Capsule if you have a desktop Mac that’s always on and has a robust network connection. A few asides:</p>\n\n\n\n<ul>\n<li><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/guide/mac-help/mh15139/mac&amp;xcust=1-1-2226221-1-0-0&amp;sref=https://www.macworld.com/feed\">You can use network-attached storage (NAS)</a>, but not all NAS systems support Time Machine. I’ve also heard many stories of inconsistent performance.</li>\n\n\n\n<li>Your computer acting as a networked Time Machine destination doesn’t have to be on all the time. But it does mean that computer, when it is on, will spend more of its active time performing backups, catching up for when it’s turned off.</li>\n\n\n\n<li>A Mac laptop can work perfectly well as a networked Time Machine destination, but if you take it somewhere else, put it to sleep, or unplug it from battery power, backups cannot occur.</li>\n\n\n\n<li>A robust network connection is advised–that is, connect that machine via ethernet to your network rather than rely on Wi-Fi. If you use the latter, Wi-Fi works fine, but it will potentially congest your network because of the high intermittent value of backup data.</li>\n</ul>\n\n\n\n<p>Time Machine is robust enough that if it can’t back up right away, macOS caches files that need to be backed up if they’re modified between backup sessions. Then, it performs an automatic catchup, using the cached backups on an individual Mac to transfer those to Time Machine.</p>\n\n\n\n<p>Here’s how you get started with networking Time Machine backups; I’ll walk through these points after this overview:</p>\n\n\n\n<ul>\n<li>Get a sufficiently large drive to store the entire potential contents of all devices on your network backing up to it, plus 50 to 100 percent more capacity to store archives.</li>\n\n\n\n<li>Format that drive as APFS.</li>\n\n\n\n<li>Partition the drive if you want to reserve specific storage for each Mac instead of creating a large pool for all Macs on the network.</li>\n\n\n\n<li>Using the Sharing settings to enable Time Machine on the drive.</li>\n\n\n\n<li>Connect from the other Macs to set up Time Machine.</li>\n</ul>\n\n\n\n<h2>Get a big drive and format it as APFS</h2>\n\n\n\n<p>If you add up all the storage required on your network and add 50 to 100 percent on top, and it comes out below 2TB, you might consider an SSD for speed and quiet. The drive may be running some reasonable percentage of the time, and if you or someone else is working next to the computer that’s the Time Machine destination, you’ll hear an hard drive (HDD) chugging away.</p>\n\n\n\n<p>That said, if your total needs are over 2TB, 4TB drives remain quite expensive (more than twice the cost of 2TB) and you either want to purchase multiple 2TB drives or switch to an HDD. You can get extremely high-capacity hard drives (12TB or larger) for a song these days. (I opted to get a two-drive system and use RAID mirroring so that I would have a second backup: each bit of backup is written to both drives in case one fails. You can find RAID systems from many companies, although they add to your cost.)</p>\n\n\n\n<p>APFS has been the preferred Time Machine backup drive format since fall 2021 and I recommend using it. Follow Apple’s instructions to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/guide/disk-utility/dskua9e6a110/mac&amp;xcust=1-1-2226221-1-0-0&amp;sref=https://www.macworld.com/feed\">format your drive as APFS</a>. This is a destructive process, and you will lose any data on the drive, so copy it off and ensure you have a perfect copy before erasing in that case.</p>\n\n\n\n<h2>Partition the drive</h2>\n\n\n\n<p>You have the option with Time Machine to either use one big pool of storage for everyone and Time Machine creates individual backup destinations for each Mac, or you can partition the drive and have each computer on the network target a specific partition. I’ve seen problems (as have forum posters and readers) with the pooled method: Time Machine should automatically purge old snapshots as storage in the pooled storage becomes full, but it doesn’t always seem to recognize that it has to take action.</p>\n\n\n\n<p>Follow Apple’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-gb/guide/disk-utility/dskua9e6a110/mac&amp;xcust=1-1-2226221-1-0-0&amp;sref=https://www.macworld.com/feed\">instructions on APFS partitioning</a>. Create a single container and then partition that container for the number you need.</p>\n\n\n\n<p>Each partition dedicated to a specific Mac should use the 50 to 100 percent guideline above for setting its size.</p>\n\n\n\n<h2>Set up Sharing for Time Machine</h2>\n\n\n\n<p>I’ve found that using the process Apple describes doesn’t always work reliably, where sharing these volumes so anyone can read and write to them enables Time Machine. Instead, I do the following:</p>\n\n\n\n<ol>\n<li>Create a new user on the Mac offering Time Machine backups. You can <a href=\"https://www.macworld.com/article/1386586/debugging-macos-use-fresh-user-account.html\">follow the instructions in this article</a>. The user does not need Administrator privileges. I named this user “Network Time Machine” for clarity on my Mac.</li>\n\n\n\n<li>In macOS Ventura or later, go to <em> &gt; System Settings &gt; General &gt; Sharing</em> and click the i (info) icon to the right of the <em>File Sharing</em> item.</li>\n\n\n\n<li>Drag each volume into the <em>Share Folders</em> list. In turn, select each volume, click the + button at the bottom of the <em>Users</em> lists, and add your networked user. Select <em>Read &amp; Write</em> from the popup menu to the right of that user’s name in the list.</li>\n\n\n\n<li>Also, for each volume Control-click/right-click the volume’s name in the Shared Folders list and choose <em>Advanced Options</em>. Enable “Share as a Time Machine backup destination.” You can set a maximum limit for backups, but it’s not necessary if you’re using the entire volume for Time Machine.</li>\n\n\n\n<li>Click <em>Done</em>.</li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-sharing-net-time-machine-advanced-bordered.png\" alt=\"macOS Shared Folders Advanced Options\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-sharing-net-time-machine-advanced-bordered.png?quality=50&amp;strip=all 1154w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-sharing-net-time-machine-advanced-bordered.png?resize=300%2C224&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-sharing-net-time-machine-advanced-bordered.png?resize=768%2C572&amp;quality=50&amp;strip=all 768w\" width=\"1024\" height=\"763\" /><figcaption><p>After adding volumes, Control-click/right-click to access Advanced Options.</p></figcaption></figure><p>Foundry</p></div>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-time-machine-sharing-configure-advanced-bordered.png\" alt=\"macOS Share as Time Machine backup destination\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-time-machine-sharing-configure-advanced-bordered.png?quality=50&amp;strip=all 944w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-time-machine-sharing-configure-advanced-bordered.png?resize=300%2C179&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-time-machine-sharing-configure-advanced-bordered.png?resize=768%2C457&amp;quality=50&amp;strip=all 768w\" width=\"944\" height=\"562\" /><figcaption><p>Use Advanced Options to enable Time Machine for the volume and to set a limit, if necessary.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>Now, from each Mac:</p>\n\n\n\n<ol>\n<li>In the Finder, choose <em>Go &gt; Network</em>, find the Mac, and log in as the networked Time Machine user. (This shouldn’t be necessary, but I find logging in first and storing the password in the Keychain when prompted helps prevent Time Machine backup problems later.)</li>\n\n\n\n<li>Go to <em> &gt; System Settings &gt; General &gt; Time Machine.</em></li>\n\n\n\n<li>Click the + sign to add a volume. The shared volume (pooled or specific to your Mac) should appear in this list. Select it and click <em>Set Up Disk</em>.</li>\n\n\n\n<li>Next, you may be prompted to log into a user account, even if you’ve already connected to that account in the Finder or with Time Machine.</li>\n</ol>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-choose-networked-time-machine-destination-bordered.png\" alt=\"time machine destination\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-choose-networked-time-machine-destination-bordered.png?quality=50&amp;strip=all 944w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-choose-networked-time-machine-destination-bordered.png?resize=300%2C92&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/02/mac911-choose-networked-time-machine-destination-bordered.png?resize=768%2C234&amp;quality=50&amp;strip=all 768w\" width=\"944\" height=\"288\" /><figcaption><p>The networked volume or volumes appears as an option on other Macs, noting after “on” which Mac the volume is shared from.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>You can optionally use this process to set up encryption for the backup in the final step, which means that the key you choose is the only way to unlock it later. If you choose to encrypt your networked Time Machine backup, make sure you store the key in a password manager. There’s no other way to unlock the backup, as the password is unrecoverable, even from the Mac that’s performing the backup to a connected drive.</p>\n\n\n\n<p><em>This Mac 911 article is in response to a question submitted by Macworld reader Anton.</em></p>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n\nMacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"93fa5e1f93e709fe9470393c2cb30548b12e9e9b4ff56becd25ad84621520f6a","category":"Apple"}