{"title":"Unveiling nuclear chromatin distribution using IsoConcentraChromJ: A flourescence imaging plugin for IsoRegional and IsoVolumetric based ratios analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305809","date":1719928800000,"content":"<p>by Lama Zeaiter, Ali Dabbous, Francesca Baldini, Aldo Pagano, Paolo Bianchini, Laura Vergani, Alberto Diaspro</p>\r\n\r\nChromatin exhibits non-random distribution within the nucleus being arranged into discrete domains that are spatially organized throughout the nuclear space. Both the spatial distribution and structural rearrangement of chromatin domains in the nucleus depend on epigenetic modifications of DNA and/or histones and structural elements such as the nuclear envelope. These components collectively contribute to the organization and rearrangement of chromatin domains, thereby influencing genome architecture and functional regulation. This study develops an innovative, user-friendly, ImageJ-based plugin, called IsoConcentraChromJ, aimed quantitatively delineating the spatial distribution of chromatin regions in concentric patterns. The IsoConcentraChromJ can be applied to quantitative chromatin analysis in both two- and three-dimensional spaces. After DNA and histone staining with fluorescent probes, high-resolution images of nuclei have been obtained using advanced fluorescence microscopy approaches, including confocal and stimulated emission depletion (STED) microscopy. IsoConcentraChromJ workflow comprises the following sequential steps: nucleus segmentation, thresholding, masking, normalization, and trisection with specified ratios for either 2D or 3D acquisitions. The effectiveness of the IsoConcentraChromJ has been validated and demonstrated using experimental datasets consisting in nuclei images of pre-adipocytes and mature adipocytes, encompassing both 2D and 3D imaging. The outcomes allow to characterize the nuclear architecture by calculating the ratios between specific concentric nuclear areas/volumes of acetylated chromatin with respect to total acetylated chromatin and/or total DNA. The novel IsoConcentrapChromJ plugin could represent a valuable resource for researchers investigating the rearrangement of chromatin architecture driven by epigenetic mechanisms using nuclear images obtained by different fluorescence microscopy methods.","author":"Lama Zeaiter","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"93fa0c387df1f8778981eae2c02042c485465bafbe84376023c914e6c25833bc","category":"Interdisciplinary"}