{"title":"A Glimpse of Ocean of Abundant Discoveries: Two-Way Cross Family Analysis of In-Silico Ranked 2nd Order Unexplored, ETC-1922159 Affected, Synergistic Combinations in CRC Cells","link":"https://www.preprints.org/manuscript/202302.0123/v2","date":1726823000000,"content":"Often, in biology, we are faced with the problem of exploring relevant unknown biological hypotheses in the form of myriads of combination of factors that might be affecting the pathway under certain conditions. For example, Brancati et al.1 observe that mutations in poliovirus receptor related protein 4 (PVRL4), encoding cell adhesion molecule nectin-4, causes Ectodermal dysplasia-syndactyly syndrome. Interaction with cad- herins also implies an influence of nectin-4 on Wnt signaling, which plays a relevant role in limb development (Brancati et al.1). However, not much work has been done to explore the relation of Wnts and PVR family. In CRC cells treated with ETC-1922159, both were found up regulated. In a recent unpublished work in Open Science Framework, Sinha2, we had the opportunity to rank these unknown biological hypotheses for both up and down regulated genes at 2nd order level after drug administration. The search engine alloted high nu- merical valued rankings to some combinations of PVR-WNT, thus indicating a possibility of high combinatorial synergy also. The in-silico derived influences can be represented graphically as - PVR w.r.t WNT with PVR &lt;- WNT9A; and WNT w.r.t PVR with WNT-7B/9A &lt;- PVR and WNT4 &lt;- PVRL2; In the light of the recent findings of PVR with IFN (interferon) and the known interactions between IFN and Wnts, there might be a possibilty to explore the bridge of PVR, IFN and WNTs. The 3 fold (PVR - IFN; IFN - WNT; WNT - PVR), 2 way cross family analysis might shed light on the possible combinations that might be of import. Here, we present a 2-way cross family analysis of multiple, such in-silico ranked 2nd order synergistic combinations, after ETC-1922159 treatment of CRC cells. Via this 2-way cross family analysis, we are able to discover through majority voting, the combinations that might of interest to biologists and also derive plausible influences of components of combinations among themselves. Note that these form biological hypotheses which indicate whether a particular combination and the direction of influence within the combination, exist synergistically in CRC cells. Wet lab tests will indicate the veracity of these combinations and if proven true, will lead to further study of mechanism between the components.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"940c681dd178bdeb418f73b06bf8c126330c29301a6e5354add8ff9af6d98e74","category":"Interdisciplinary"}