{"title":"Conserving Freshwater Ecosystems in India: A call to action","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4165?af=R","date":1715236503000,"content":"<h2>Abstract</h2>\n<p>\nIndia boasts of a vast freshwater resource network (rivers, wetlands, and groundwater), which has unique ecological, social and economic values associated with it. Despite their importance for both people and biodiversity, its freshwater ecosystems (FWEs) are heavily impacted through multiple factors such as pollution, overexploitation, habitat loss/modification and climate change. India is also among the hotspots of water resource overuse that has caused a serious decline in freshwater availability.\nGiven that healthy FWEs lie at the centre for supporting the country's ecology, health, economy, livelihoods and ultimately achieving multiple policy goals, it is crucial that holistic and focused efforts are made to protect, conserve, and restore all types of FWEs.\nWe call for an urgent and a greater focus on implementing conservation actions for FWEs in India and suggest the following strategy to enhance focus on their conservation: (1) establishing a shared freshwater conservation vision at a national scale, (2) developing and including national freshwater conservation goals within global efforts, (3) conducting simultaneous conservation action planning at regional scales and (4) bridge planning to implementation gap by strengthening key enabling conditions: i) mainstream FWE conservation within key existing governance instruments, ii) secure sustainable conservation funding, iii) improve data access and knowledge translation; iv) create national awareness around importance of FWEs; v) facilitate collaboration among key actors.\n</p>","author":"R. Arora, \nT. Balachander, \nI. Agrawal, \nR. Panda, \nD. Gupta, \nA. Kasturirangan, \nJ. Vencatesan, \nK. Sivakumar, \nR. Kumar, \nV.B. Mathur, \nS. Chokkakula, \nT. Lal, \nN. Kaushal, \nS. Babu, \nJ. Kiesecker","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"9417d69492600ba5147b9dc6077fc79416c12573419dedb809a53ab61b27f074","category":"Environment"}