{"title":"สหรัฐฯ รับรองยาลดอาการแพ้อาหารหลายชนิดตัวแรก Xolair","link":"https://www.blognone.com/node/138404","date":1708922290000,"content":"<div><div><div><p>องค์การอาหารและยาสหรัฐฯ (FDA) รับรองยา Xolair สำหรับการลดอาการแพ้อาหาร โดยใช้สำหรับการป้องกันก่อนการทานอาหาร ทำให้อาการแพ้เมื่อกินอาหารที่แพ้โดยไม่ตั้งใจเบาลง</p>\n<p>Xolair หรือ omalizumab เป็นยาสำหรับรักษาอาการแพ้มาน มีการพัฒนายามาตั้งแต่ช่วงปี 1990 และ FDA ก็อนุญาตให้ใช้ยาตัวนี้รักษาอาการหอบหืดตั้งแต่ปี 2003 แต่การอนุญาตครั้งนี้เป็นการเพิ่มข้อบ่งชี้การใช้งาน ขณะที่ยาแก้แพ้อาหารนั้นก็มีการรับรองใช้งานมาก่อนแล้ว แต่ Xolair เป็นตัวแรกที่สามารถใช้กับอาการแพ้อาหารหลายชนิดได้พร้อมกัน</p>\n<p>Xolair อาศัยการจับแอนตีบอดี immunoglobulin E (IgE) ไม่ให้รับกับ receptor เพื่อลดการแพ้ลง การทดสอบประสิทธิภาพโดยอาศัยกลุ่มผู้แพ้ถั่วลิสง 168 คน ยาพบว่ากลุ่มได้ Xolair สามารถทนโปรตีนถั่วลิสง 600mg (เทียบเท่าถั่ว 2.5 เม็ด) ได้โดยไม่มีการแพ้ระดับปานกลางถึงรุนแรง คิดเป็น 68% (75 คนจากตัวอย่าง 110 คน) ขณะที่กลุ่มได้ยาหลอก ทนถั่วลิสงปริมาณเท่ากันได้เพียง 6% (3 คนจาก 55 คน) อย่างไรก็ดีกลุ่มตัวอย่าง 17% ทนต่อโปรตีนถั่วลิสงได้เท่าเดิมก่อนได้รับยา นอกจากถั่วลิสงแล้ว ผู้พัฒนายังทดสอบ Xolair กับมะม่วงหิมพานต์, นม, และไข่ ล้วนได้ผลลดการแพ้ได้ดี</p>\n<p>ทาง FDA เตือนว่า Xolair ยังไม่ใช่ยารักษาอาการแพ้ และผู้ที่แพ้อาหารเหล่านี้ก็ต้องระวังการทานอาหารที่มีส่วนผสมของโปรตีนที่แพ้ต่อไป</p>\n<p>ที่มา - <a href=\"https://www.fda.gov/news-events/press-announcements/fda-approves-first-medication-help-reduce-allergic-reactions-multiple-foods-after-accidental\">FDA</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ed68465b99d04cf066b10f5bfb1c2553.jpeg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/fda\">FDA</a></div><div><a href=\"/topics/medical\">Medical</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"941e42200f46cd719d8e882f928b425c3914c74f48139f2d399681dacfe817e8","category":"Thai"}