{"title":"Fresnel Free Imaging Mode (FFIM) for Transmission Electron Microscopy: A Computationally Mediated Solution using Spatio-Temporal Functionalization of the Illumination Optics","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.806/7720018?rss=1","date":1721779200000,"content":"<span>Today’s high performance Transmission Electron Microscopes (TEM), especially those equipped with aberration correctors, operate routinely at incident beam accelerating voltages between 30 – 300 kV, employ field emission sources and operate at extremely high-performance levels [<a href=\"#ozae044.806-B1\">1</a>]. Importantly these advanced field emission electron beam lines have both high brightness and highly coherent beams. Due to the location of the illumination / probe forming apertures and their focal planes, Fresnel diffraction effects in the illumination system are virtually always present. This diffraction manifests itself as a series of concentric rings in the illumination of the specimen as illustrated experimentally and theoretically in Fig. 1. In this figure the experimental images were taken using the Analytical PicoProbe instrument (the prototype of the ThermoFisher Spectra UltraX) [<a href=\"#ozae044.806-B2\">2</a>], while the theoretical images were calculated in Python using Fresnel diffraction theory [<a href=\"#ozae044.806-B3\">3</a>, <a href=\"#ozae044.806-B4\">4</a>]. The systematic variation in spacing and contrast of the fringes at the beam center decreases with larger probes (1a, c) vs the opposite trends for the smaller probes (1b, 1d). The magnitude of which is a function of lens excitation (C1 lens/spot size), condenser aperture size and lens focus. While these interference fringes affect the local illumination intensity by introducing a periodic intensity variation at various radial distances, they do not significantly affect the post specimen scattering/optics, save for introducing an unwanted oscillation in the overall image intensity. Fresnel diffraction is mainly prominent in CTEM vs. STEM experiments in contrast to the latter, which operates closer to Fraunhofer diffraction conditions.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"9435442e75df8b594050e7239fd15388de681e86876571db9c081072657169c4","category":"Environment"}