{"title":"DNA break clustering as a predictor of cell death across various radiation qualities: influence of cell size, cell asymmetry, and beam orientation","link":"https://academic.oup.com/ib/article/doi/10.1093/intbio/zyae015/7762117?rss=1","date":1726704000000,"content":"<span><div>Abstract</div>Cosmic radiation, composed of high charge and energy (HZE) particles, causes cellular DNA damage that can result in cell death or mutation that can evolve into cancer. In this work, a cell death model is applied to several cell lines exposed to HZE ions spanning a broad range of linear energy transfer (LET) values. We hypothesize that chromatin movement leads to the clustering of multiple double strand breaks (DSB) within one radiation-induced foci (RIF). The survival probability of a cell population is determined by averaging the survival probabilities of individual cells, which is function of the number of pairwise DSB interactions within RIF. The simulation code RITCARD was used to compute DSB. Two clustering approaches were applied to determine the number of RIF per cell. RITCARD outputs were combined with experimental data from four normal human cell lines to derive the model parameters and expand its predictions in response to ions with LET ranging from ~0.2 keV/μm to ~3000 keV/μm. Spherical and ellipsoidal nuclear shapes and two ion beam orientations were modeled to assess the impact of geometrical properties on cell death. The calculated average number of RIF per cell reproduces the saturation trend for high doses and high-LET values that is usually experimentally observed. The cell survival model generates the recognizable bell shape of LET dependence for the relative biological effectiveness (RBE). At low LET, smaller nuclei have lower survival due to increased DNA density and DSB clustering. At high LET, nuclei with a smaller irradiation area—either because of a smaller size or a change in beam orientation—have a higher survival rate due to a change in the distribution of DSB/RIF per cell. If confirmed experimentally, the geometric characteristics of cells would become a significant factor in predicting radiation-induced biological effects.<div><strong>Insight Box:</strong> High-charge and energy (HZE) ions are characterized by dense linear energy transfer (LET) that induce unique spatial distributions of DNA damage in cell nuclei that result in a greater biological effect than sparsely ionizing radiation like X-rays. HZE ions are a prominent component of galactic cosmic ray exposure during human spaceflight and specific ions are being used for radiotherapy. Here, we model DNA damage clustering at sub-micrometer scale to predict cell survival. The model is in good agreement with experimental data for a broad range of LET. Notably, the model indicates that nuclear geometry and ion beam orientation affect DNA damage clustering, which reveals their possible role in mediating cell radiosensitivity.</div></span>","author":"","siteTitle":"Integrative Biology Current Issue","siteHash":"08ec31a93e0a3f830088f3051f0870206dac7048d685312e4717ea0a4882ca75","entryHash":"9441de685470cfe06cc11e845dbf4fb713072548bf2448dd73b29429e84fbd6b","category":"Environment"}