{"title":"Light‐use efficiency for coral reef communities and benthic functional types","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12535?af=R","date":1708566794000,"content":"<h2>Abstract</h2>\n<p>Coral reef metabolism is dominated by benthic photoautotrophic communities that comprise varying combinations of algae, coral, and sand. Rates of daily gross primary production (GPP) for these benthic functional types (BFTs) are remarkably consistent across biogeographical regions, supporting the idea that reefs exhibit modal metabolism. Most variability in reported rates likely arises from differences in light availability. In fact, GPP is a linear function of incident photosynthetically active radiation (PAR), the fraction of PAR absorbed (fAPAR) by photoautotrophic organisms or communities, and light-use efficiency (<i>ε</i>), which parameterizes photosynthesizers' biochemical capacity for CO<sub>2</sub> fixation: GPP = <i>ε</i> × fAPAR × PAR. On time scales of days to weeks, fAPAR and <i>ε</i> are far more stable than PAR. <i>ε</i> is a critical parameter, because it represents productive response integrated across all environmental conditions, other than light. If BFTs exhibit consistent GPP across wide geographic ranges, then their <i>ε</i>s must also be consistent. The aim of this study was to estimate <i>ε</i> for algae, coral, and sand. Using data collected during NASA's CORAL mission in 2016–2017, <i>ε</i> was calculated for 32 mixed communities at Lizard Island, Australia (10); Kāne'ohe Bay, Hawai'i (8); Guam (6); and Palau (8). Nonnegative least squares was used to solve for <i>ε</i> of each BFT, producing values of 0.038, 0.060, and 0.016 C photon<sup>−1</sup> for algae, coral, and sand, respectively. These values can be used in light-driven models of reef metabolism. Further work is necessary to refine these estimates and, importantly, to explore how <i>ε</i> is affected by environmental conditions.</p>","author":"Eric J. Hochberg, \nChiara Pisapia, \nRobert C. Carpenter, \nSiarah Hall","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"9448ea6bdf6be8632c822d66453fbf5fa1e968f7254b4398476f388836f57375","category":"Environment"}