{"title":"Apple Invites Some Developers to Try Swift Playgrounds 4 Ahead of Launch","link":"https://www.macrumors.com/2021/11/29/swift-playgrounds-4-beta-test/","date":1638222557000,"content":"Apple is working on an updated version of its Swift Playgrounds app, which is an educational tool designed to teach children and adults alike how to use the Swift programming language that first launched in 2016.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/03/swift-banner.jpg\" />\r\n<br />\r\nThe new version of Swift Playgrounds was first announced at the June Worldwide Developers Conference, and now Apple is allowing some developers to test it out in a beta capacity ahead of launch.\r\n<br />\r\n\r\n<br />\r\nDevelopers who have been invited have been required to sign a non-disclosure agreement to get access, but one developer shared screenshots and details with <em><a href=\"https://9to5mac.com/2021/11/29/heres-a-first-look-at-the-new-swift-playgrounds-4-ahead-of-official-release/\">9to5Mac</a></em>, giving us a quick inside look at the app.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/swift-playgrounds-1.jpg\" />\r\n<br />\r\nWith Swift Playgrounds 4, developers will be able to submit their projects designed with the software directly to the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, allowing for app creation on the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>. There will be a simple, easy to use interface for submitting an app to ‌App Store‌ Connect without the need for Xcode on Mac.\r\n<br />\r\n\r\n<br />\r\nThe app will allow those learning code to preview and see changes in real time as they type, as described by <em>9to5Mac</em>:<blockquote>Swift Playgrounds 4 also lets users preview and see changes in real time as they type. Live editing also works when the developer shares the project with someone else via iCloud Drive, so multiple people can work on the same project at the same time. Users can even test the app in full screen, explore SwiftUI controls, search across all files in a project, use quick inline code suggestions, and easily switch between Swift Playgrounds and Xcode (or vice versa).</blockquote>There are also quick access options for setting app parameters and getting an app up on the store with little hassle. App creators can, for example, use a ready-made icon by choosing a color and an icon, or uploading a custom icon that gets automatically sized.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/11/swift-playgrounds-2.jpg\" />\r\n<br />\r\nRight now, some of the Swift Playgrounds 4 features require iPadOS 15.2, so there's a possibility that we could see Swift Playgrounds 4 released as soon as iPadOS 15.2 launches. There's no word yet on when we can expect iPadOS 15.2, but Apple will likely debut it prior to the end of the year.<div>Tag: <a href=\"https://www.macrumors.com/guide/swift-playgrounds/\">Swift Playgrounds</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/11/29/swift-playgrounds-4-beta-test/\">Apple Invites Some Developers to Try Swift Playgrounds 4 Ahead of Launch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-invites-some-developers-to-try-swift-playgrounds-4-ahead-of-launch.2325527/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FHsMylQLgbs:oH35VH2eoWM:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FHsMylQLgbs:oH35VH2eoWM:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"944ab35158e754c0e381080f5fbdc188d921117114ca7f73188171a1e7efb88e","category":"Apple"}