{"title":"Identification of floral aroma components and molecular regulation mechanism of floral aroma formation in Phalaenopsis","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13742?af=R","date":1721041100000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Most <i>Phalaenopsis</i> cultivars have almost no aroma, with a few exceptions. <i>Phalaenopsis</i> presents significant challenges in fragrance breeding due to its weak aroma and low fertility. It is therefore necessary to identify the aroma components and key regulatory genes in <i>Phalaenopsis</i> cultivars like ‘Orange Beauty’, ‘Brother Sara Gold’, ‘Purple Martin’, ‘H026’, ‘SK16’, ‘SX098’, and ‘SH51’, to improve the aroma of the common <i>Phalaenopsis</i>.</p>\n<h2>RESULTS</h2>\n<p>Floral aroma components were tested on nine <i>Phalaenopsis</i> species, using smell identification and headspace gas chromatography–mass spectrometry. The result showed that alcohols, esters, and alkenes were the key specific components in the different species and cultivar aromas and the aroma intensity and component content of cultivars with different colors were different. The main components of the floral aromas in <i>Phalaenopsis</i> were alcohols (including eucalyptol, linalool, citronellol, and 1-hexanol), esters (including hexyl acetate, leaf acetate, and dibutyl phthalate), alkenes (including pinene and sabinene) and arenes (like fluorene). The transcriptome of flowers in the bud stage and bloom stage of <i>P.</i> ‘SH51’ was sequenced and 5999 differentially expressed genes were obtained. The contributions of the phenylpropionic acid/phenyl ring compound and the terpene compound to the aroma were greater. Sixteen genes related to phalaenopsis aroma were found. <i>TC4M</i>, <i>PAL</i>, <i>CAD6,</i> and <i>HR</i> were related to phenylpropanoid synthesis pathway. <i>SLS</i>, <i>TS10,</i> and <i>P450</i> were related to the synthesis pathway of terpenes. <i>TS10</i> and <i>YUCCA 10</i> were involved in tryptophan metabolism.</p>\n<h2>CONCLUSION</h2>\n<p>This is the first report on the floral aroma components and regulatory genes in <i>Phalaenopsis</i>. The proposed method and research data can provide technical support for <i>Phalaenopsis</i> breeding. © 2024 Society of Chemical Industry.</p>","author":"Yingjie Zhang, \nZihui Gong, \nZhiqi Zhu, \nJixia Sun, \nWenjiao Guo, \nJingwei Zhang, \nPengsong Ding, \nMinxiao Liu, \nZhihong Gao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"944d5308d7af73028c13e2dada664b900e212104a7dc905c3f9fbaa193b30c0b","category":"Environment"}