{"title":"How much is too much: A case study of local self-government units in Slovakia using absolute variability to determine the importance of financial criteria in MCDM analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311842","date":1729000800000,"content":"<p>by Roman Vavrek</p>\r\n\r\nThe performance evaluation of local self-government entities is very difficult, as their primary goal is not to make a profit, but to provide services to their residents that will contribute to an increase in their quality of life. In this context, it is necessary to evaluate their activity from the point of view of several available criteria, for which it is possible to find relevant and recognized sources. The presented research works with five criteria, identified by the Institute for Economic and Social Reforms, and aims to quantify the agreement of the results of the assessment of the financial health of territorial self-government entities in 2020 using the TOPSIS technique with a gradually decreasing number of criteria. For this purpose, a total of 26 combinations of criteria are created, with the number of 5, 4, 3 and 2 used criteria, the importance of which is determined based on their absolute variability using the standard deviation method. The results obtained in this way are interpreted using a wide range of mathematical and statistical methods including the Kolmogorov-Smirnov test, Levene test, Jaccard index and others. As a result, the multi-criteria evaluation of territorial self-government subjects (in our case, district cities) proved to be highly applicable. However, the result itself is largely determined by the structure and number of entry criteria. Based on the performed analyses, we can see that significant differences result from their reduction. Each such reduction has an impact on the overall results, but it is possible to find combinations that defy this conclusion.","author":"Roman Vavrek","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9456873d0223011e63a76a8c61fb5e26ac04bebcacff3d035004bf4ae3bde6e1","category":"Interdisciplinary"}