{"title":"PSIX-19 Effect of protein and starch level on N balance and ruminal fermentation parameters in steers consuming low-quality forage: Bos taurus taurus","link":"https://academic.oup.com/jas/article/102/Supplement_3/736/7757854?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Globally cattle convert low-quality forage to beef and milk; therefore, understanding protein utilization in <span>Bos taurus taurus</span> is critical to enhancing sustainability as over and under-supplementation of protein are economically and environmentally costly. Low-quality forage lacks the N necessary for proper utilization and metabolic function. Supplemental protein improves low-quality forage utilization and is expected to increase N absorption and retention. Supplement starch can increase volatile fatty acid (VFA) production and energy supplied to the animal; however, too much starch decreases ruminally available N and pH potentially decreasing fibrolytic activity. Accordingly, our objective was to determine the effect starch supplementation on N balance and ruminal fermentation parameters in <span>Bos taurus</span> steers. Ruminally cannulated Angus steers [n = 5; body weight (BW) = 375 ± 45 kg] were used in a 4 × 4 Latin square to evaluate the effect of decreasing supplemental starch when consuming King Ranch Bluestem hay (3.5% CP, 73% NDF). Steers received four isonitrogenous (130 mg N/kg BW) supplements providing increasing levels of starch (2% starch = 100% soybean meal; 20% starch = 26.3% corn, 73% soybean meal, 0.7% urea; 38% starch = 51.6% corn, 47% soybean meal, 1.4% urea; 56% starch = 78.6% corn, 19% soybean meal, 2.4% urea). Five 14-d periods were conducted, consisting of 9 d adaptation and 4 d to measure intake and digestion, and 1 d for ruminal fermentation. Supplemental N intake decreased linearly (<span>P</span> &lt; 0.01) with increasing starch as the crude protein content of the soybean was underestimated. Forage and total N intake were not affected by starch level (<span>P</span> ≥ 0.17). Fecal and total urinary N excretion were not different between starch levels (<span>P</span> ≥ 0.43). Urinary ammonia-N and urea-N averaged 6.6 and 16.8% of total urinary N excretion, respectively, but no differences between starch levels were observed (<span>P</span> ≥ 0.39). Level of starch supplementation had no effect on N retention and absorption (<span>P</span> ≥ 0.50). There was a treatment × time interaction observed for ruminal ammonia concentration (<span>P</span> &lt; 0.01). All treatments, except 2% starch, peaked at 4 h post feeding, 20 and 38% treatments gradually decreased following four, but the concentration of ruminal ammonia decreased by 80% between 4 h and 8 h after feeding in the 56% starch treatment. Starch level had no effect total VFA concentration, VFA molar proportions, or ruminal pH (<span>P</span> ≥ 0.10). In conclusion, providing supplemental starch did not affect N balance or VFA production when fed to steers consuming low-quality forage. Nitrogen balance and VFA production likely were not affected because all supplements provided sufficient ruminally available N and, therefore, exerted minimal effects on forage utilization.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"945e5db03e93b8bb384e7094990dc6006f255b675d4081ee909e93b1a10c36d1","category":"Environment"}