{"title":"PSII-20 Effect of increasing glycine equivalent in low crude protein diets on growth performance in broiler chickens raised under multiple stress conditions","link":"https://academic.oup.com/jas/article/102/Supplement_3/704/7757645?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of the current experiment was to investigate the effects of increasing glycine (Gly) equivalent in low crude protein (LCP) diets on growth performance in broiler chickens raised under multiple stress (MS) conditions. Ross 308 broiler chickens (n = 450; 22 d of age) were randomly allotted to 1 of 6 treatments with 6 replicates in a 2 × 3 factorial arrangement. The first factor included two different environmental conditions (normal condition vs. MS condition) and the second factor included three dietary treatments (CON, control diets; LCP, low crude protein diets; LCP+Gly, LCP diets with Gly supplementation). Birds in normal conditions were raised under recommended environmental conditions (22 ± 0.9°C and 53.6 ± 5.99 %) with low stock density (SD; 16.9 birds/m<sup>2</sup>). Birds in MS conditions were exposed to a cyclic heat stress condition (32 ± 0.1°C for 8 h/d and 26°C ± 0.3°C for the remaining time) with high SD (25.3 birds/m<sup>2</sup>). The average relative humidity was 37.9 ± 4.94%. In addition, 15 birds per cage were assigned in MS conditions to increase SD, whereas 10 birds per cage were assigned in normal conditions. The treatment diets included CON diets with adequate energy, crude protein (19.50% CP and 1.15% Gly equivalents), and other nutrients recommended for growing broiler chickens and LCP diets with low CP content (16.50% CP and 1.15% Gly equivalents) but adequate other nutrients. The LCP+Gly diets had increasing concentrations of Gly equivalents (17.19% CP and 1.73% Gly equivalents) by Gly supplementation to LCP diets. The diets and water were provided ad libitum throughout the experiment. Experiment lasted for 16 d from 22 d to 37 d of age. At the conclusion of the study, growth performance including body weight gain (BWG), feed intake (FI), and feed conversion ratio (FCR) was determined. All data were analyzed by 2-way ANOVA in a completely randomized design using the PROC MIXED procedure of SAS (SAS Institute Inc., Cary, NC). Results indicated that no interactions between environmental conditions and dietary treatments were observed for all growth performance measurements (Table 1). For the main effects, as expected, MS conditions decreased (<span>P</span> &lt; 0.001) growth performance of broiler chickens, regardless of dietary treatments. The LCP diets increased (<span>P</span> &lt; 0.05) FI and FCR as compared with CON diets, regardless of environmental conditions. However, LCP+Gly diets decreased FI (<span>P</span> &lt; 0.05) and tended to decrease FCR (<span>P</span> = 0.076) as compared with LCP diets. In conclusion, either MS conditions or LCP diets impair growth performance in broiler chickens with no significant interaction. However, increasing Gly equivalents by Gly supplementation to LCP diets are likely to improve feed efficiency in broiler chickens regardless of stress environments.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"94642a34757f694360a3c34786190301a63efd6791d2d5ef066396c015ab692e","category":"Environment"}