{"title":"Aerenchyma in emergent plants and rhizospheric microbial communities promote methane fluxes in wetlands","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12653?af=R","date":1723460441000,"content":"<h2>Abstract</h2>\n<p>Wetlands are the largest natural source of CH<sub>4</sub> globally, yet our understanding of how environmental parameters and microorganisms affect the production and emission of CH<sub>4</sub> in emergent plant–sediment systems remains limited. In this study, CH<sub>4</sub> fluxes were investigated in a wetland with <i>Canna indica</i> for 42 d, as well as nutrients and microbial community. It was found that the chimney effect formed by aerenchyma in roots, stems, and leaves of <i>C. indica</i> promoted the emission and oxidation of CH<sub>4</sub> in the wetland and reduced the CH<sub>4</sub> concentration in sediments. <i>Canna indica</i> reduced the nutrient release from surface sediments into the overlying water. Pearson correlation analysis showed that temperature, pH, and oxidation–reduction potential were the main influencing factors for CH<sub>4</sub> production and oxidation in the wetland. <i>Canna indica</i> inhibited the diversity of archaeal community but promoted the diversity of bacterial community in the rhizosphere. Stochastic processes had a greater impact on bacterial and archaeal succession trajectories in wetland sediments. Network analysis showed that <i>C. indica</i> promoted interactions among bacteria and archaea that enhanced their ability to resist environmental interference. The well-developed aerenchyma of <i>C. indica</i> provided an important passage for the transport of CH<sub>4</sub> from sediments to the atmosphere and shaped the microbial community structure in the rhizosphere. Meanwhile, CH<sub>4</sub> emissions were also constrained by several variables, such as temperature and physiological adaptation in the long term. Thus, it is necessary to plant emergent plants in areas with low CH<sub>4</sub> emissions and optimize plant configuration in the context of global warming.</p>","author":"Shaozhuang Guo, \nSonghe Zhang, \nXin Lv, \nHezhou Chen, \nJie Chen, \nJunfeng Gao, \nWenming Zhang","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"946dfe4af876ff65c36d8fb1696867d0d6b6c03706b85452beecbdb66c9e4618","category":"Environment"}