{"title":"Leaked EU Document Shows Spain Wants to Ban End-to-End Encryption; Other EU Countries Hanging Their Hopes on Impossible Solutions","link":"https://www.wired.com/story/europe-break-encryption-leaked-document-csa-law/","date":1684803301000,"content":"\n<p>Wired:</p>\n\n<blockquote>\n  <p>Spain has advocated banning encryption for hundreds of millions of\npeople within the European Union, according to a leaked document\nobtained by Wired that reveals strong support among EU member\nstates for proposals to scan private messages for illegal content.</p>\n\n<p>The document, a European Council survey of member countries’ views\non encryption regulation, offered officials’ behind-the-scenes\nopinions on how to craft a highly controversial law to stop the\nspread of child sexual abuse material (CSAM) in Europe. The\nproposed law would require tech companies to scan their platforms,\nincluding users’ private messages, to find illegal material.\nHowever, the proposal from Ylva Johansson, the EU commissioner in\ncharge of home affairs, has drawn ire from cryptographers,\ntechnologists, and privacy advocates for its potential impact on\nend-to-end encryption. [...]</p>\n\n<p>Of the 20 EU countries represented in the document leaked to\nWIRED, the majority said they are in favor of some form of\nscanning of encrypted messages, with Spain’s position emerging as\nthe most extreme. “Ideally, in our view, it would be desirable to\nlegislatively prevent EU-based service providers from implementing\nend-to-end encryption,” Spanish representatives said in the\ndocument.</p>\n</blockquote>\n\n<p>If the EU goes ahead with this, I think it means the end of services like WhatsApp, Signal, and iMessage in the EU. There’s no way to architect a messaging system that uses E2EE in some regions and doesn’t in others. The only way to comply would be to rearchitect these systems to not use E2EE anywhere. Signal certainly wouldn’t do that. Apple wouldn’t either.</p>\n\n<blockquote>\n  <p>Denmark and Ireland expressed support for scanning encrypted\nmessengers for child sexual abuse material while also endorsing\nthe inclusion of wording in the law that protects end-to-end\nencryption from being weakened. The ability to do this would rely\non the invention of technology that can scan encrypted messages\nfor illegal content without altering or breaking the security\nfeatures offered by encryption — a feat cryptographers and\ncybersecurity experts have said is technically impossible.</p>\n</blockquote>\n\n<p>It <em>is</em> technically impossible. There is no he-said/she-said debate here. The cryptographers are correct and the lawmakers are so ignorant that they’re proposing a fantasy. It’s a downwind effect of Arthur C. Clarke’s famous maxim that sufficient technology is indistinguishable from magic: the technology of E2EE is so far above the heads of lawmakers and law enforcement officials that they feel free to demand magic solutions. “<em>Just <a href=\"https://boingboing.net/2018/01/12/imaginary-numbers.html\">nerd harder</a></em>.”</p>\n\n<blockquote>\n  <p>The Netherlands, however, stated that this would be possible\nthrough “on-device” scanning before the illegal material is\nencrypted and sent to its recipient. “There are … technologies\nwhich may allow for automatic detection of CSAM while at the same\ntime leaving end-to-end encryption intact,” the country’s\nrepresentatives stated in the document.</p>\n</blockquote>\n\n<p>Somewhere in Cupertino, <a href=\"https://daringfireball.net/2021/08/apple_child_safety_initiatives_slippery_slope\">a head bangs against a desk</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/05/22/wired-spain-e2ee\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9478dbe18932930894a0bd9e37318fe97b88c10d7278faea815371352c53a821","category":"Tech"}