{"title":"Generalized Structure of Group Method of Data Handling: Novel Technique for Flash Flood Forecasting","link":"http://link.springer.com/10.1007/s11269-024-03811-1","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>In the current study, the Generalized Structure of the Group Method Of Data Handling (GSGMDH) is developed to overcome the main drawbacks of the classical GDMH. The performance of the GSGMDH was checked in two case studies for multi-step flood forecasting at the upstream station (i.e., Saint-Charles station) using the historical records of upstream stations (i.e., Nelson and Croche stations). The results revealed high accuracy in flood forecasting one to six hours ahead for all sample ranges and peak flows, with indices showing R: [0.993, 0.9995], NSE: [0.986, 0.999], RMSE: [0.416, 1.453], NRMSE: [0.0239, 0.152], MAE: [0.146, 0.761], MARE: [0.023, 0.156], and BIAS: [-0.058, 0.01]. Indeed, the descriptive performance of the developed model rates as Very Good for both R and NSE, and Good for NRMSE. The uncertainty analysis of the GSGMDH models demonstrates remarkable precision in flood forecasting, with relative differences between the minimum and maximum uncertainty ranges of less than 1% for both Nelson and Croche upstream stations. Specifically, U95 for Nelson is [0.148, 0.149], and for Croche, it is [0.166, 0.167]. Besides, The reliability analysis of the GSGMDH highlights its effective peak flow forecasting capabilities, with MARE values for various flow discharges remaining below 10% across different lead times, demonstrating the model's precision in predicting high-impact flood events. Moreover, a comparison between the developed GSGMDH and the traditional model reveals that the former surpasses the latter, achieving a maximum relative error of less than 7%, in contrast to the traditional GMDH's minimum MARE exceeding 12%.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"947e80ca967c52bd95e975fb9feeb7fb4d8265a11aab7931bd6f591a55b0fad3","category":"Environment"}