{"title":"Electrical Pulse Stimulation Protects C2C12 Myotubes against Hydrogen Peroxide-Induced Cytotoxicity via Nrf2/Antioxidant Pathway","link":"https://www.preprints.org/manuscript/202405.0960/v1","date":1715735067000,"content":"Skeletal muscle contraction evokes numerous genetic and biochemical alterations that underpin the beneficial effects of exercise. The present study aimed to elucidate the mechanism and significance for contraction-evoked antioxidant adaptation in C2C12 myotubes using electrical pulse stimulation (EPS). As NQO1 and GSTA2 are the top antioxidants upregulated by Nrf2, dose-response and time-course experiments of EPS were performed to optimize the parameter at 10 volts for 4 days by evaluating their protein expression. Western blot analysis demonstrated that EPS-cells expressed significantly higher Nrf2 and a broad array of downstream antioxidant enzymes involved in multiple antioxidant systems. These effects were completely abolished by pretreatment with a ROS scavenger, N-acetylcysteine. MitoSOX-Red, CM-H2DCFDA, and EPR spectroscopy revealed a significantly higher ROS level in mitochondria and cytosol in EPS-cells compared to non-stimulated cells. Seahorse and Oroboros revealed that EPS significantly increased maximal mitochondrial oxygen consumption rate, along with upregulated protein expression of mitochondrial complexes I/V, mitofusin-1, and mitochondrial fission factor. A post-stimulation time-course experiment demonstrated that upregulated NQO1 and GSTA2 last at least 24 hours following the cessation of EPS, whereas elevated ROS declines immediately. These finding suggest an antioxidant preconditioning effect in the EPS-cells. A cell viability study using the CCK-8 assay suggested that EPS-cells displayed 11- and 36-fold higher survival rate compared to control-cells in response to 2 and 4 mM H2O2 treatment, respectively. In summary, we found that EPS upregulated a large group of antioxidant enzymes in C2C12 myotubes via a contraction-mitochondrial-ROS-Nrf2 pathway. This antioxidant adaptation protects cells against oxidative stress-associated cytotoxicity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9486e3331f06e73dc5f6b2f418c006ffe84c93fdb14860ac5558599d6c13fd07","category":"Interdisciplinary"}