{"title":"Biofortified Pressmud Compost for Improved Nitrogen and Phosphorus Content Employing Bacillus strains","link":"https://www.preprints.org/manuscript/202409.0062/v1","date":1725260533000,"content":"Pressmud, a by-product of sugarcane processing, is typically disposed of through incineration or landfilling, though it has considerable potential in organic agriculture. This study explored the com-posting of pressmud through bioaugmentation using specific bacterial strains. Two experimental setups were created: E2 with a cellulolytic and phosphorus-solubilizing strain, Bacillus amyloliquefa-ciens-ASK11, and E3 with a nitrogen-fixing strain, Bacillus megaterium-ASNF3. A control setup (E5) was also maintained without bacterial augmentation. Nitrogen (N) and phosphorus (P) contents were measured using the Kjeldahl and Olsen methods, respectively, while Fourier-Transform Infra-red (FTIR) spectroscopy confirmed compost maturity. Results indicated that the Bacillus-enhanced composts in E2 and E3 significantly increased the nitrogen(49.27% and 91.23%) and phosphorus contents(129% and 83.85%), respectively, compared to the control with only 13.62% N and 65% P contents after 60 days of the pressmud compost maturity.. Additionally, organic matter decomposi-tion improved by 49-50% in the bioaugmented setups after 60 days. FTIR analysis revealed organic phosphate peaks and P-O-C stretching bands at 1025 cm-1 in the E2 compost, while a nitrogen vi-bration band at 3849 cm-1 in E3 indicated significantly higher nitrogen content compared to the control. The Bacillus-enriched pressmud compost not only accelerated the composting process but also enhanced nutrient levels, positioning it as a promising biofertilizer for rehabilitating barren lands.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"948d3af7d5244aa68cb9263cda85288ecc7dab310e59e028016777dde367df9b","category":"Interdisciplinary"}