{"title":"Apple Looks Beyond Silicon Valley to Improve Recruitment and Retention","link":"https://www.macrumors.com/2021/07/05/apple-to-decentralize-silicon-valley-retain-talent/","date":1625485798000,"content":"Apple is \"ramping up efforts to decentralize out of Silicon Valley,\" following difficulties recruiting and retaining talent at its <a href=\"https://www.macrumors.com/guide/apple-park/\">Apple Park</a> headquarters in California, according to <em>Bloomberg</em> journalist Mark Gurman.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2018/04/apple-park-416-security.jpg\" />\r\n<br />\r\nIn the second edition of his new <a href=\"https://www.bloomberg.com/news/newsletters/2021-07-04/apple-hq-is-no-longer-the-center-of-the-company-s-universe-kqpi2879\">Power On newsletter for <em>Bloomberg</em></a>, Gurman suggests that Apple is prepared to jettison its tradition of attracting technologists to Cupertino in favor of opening offices in places where operation costs are less high and living costs aren't as prohibitive for its employees.\r\n<br />\r\n\r\n<br />\r\nThe company is said to be \"losing talent\" because employees are struggling to afford the high cost of living in the San Francisco Bay Area, despite being high earners by most standards. Anecdotally, many engineers who have spoken to Gurman have complained that they've been unable to balance living expenses with things like college tuition for their children and long-term savings. \r\n<br />\r\n\r\n<br />\r\nAt the same time, under the pressure of being the world's most valuable company, Apple is said to have realized that \"it can no longer wait for the best designers and engineers to gravitate toward its spaceship,\" and must instead go to where those people already live, which would also make building a diverse workforce less difficult.\r\n<br />\r\n\r\n<br />\r\nFrom Gurman's newsletter:\r\n<br />\r\n<blockquote>Some members of Apple's executive team had been pushing to decentralize out of Cupertino for years before a fuller realization came into place more recently. Johny Srouji, Apple's head of custom silicon, was one of the strongest proponents of such a shift, I'm told. His group opened up offices in Florida, Massachusetts, Texas, Israel and parts of Asia years ago. It has since expanded in Germany, Oregon and San Diego. \r\n<br />\r\n\r\n<br />\r\n<a href=\"https://www.macrumors.com/guide/eddy-cue/\">Eddy Cue</a>, Apple's online services chief, has also pushed for decentralization, investing in multiple Los Angeles offices and a location in Nashville. The chief operating officer, Jeff Williams, has internally discussed the cost benefits of a more global workforce, and Deirdre O'Brien, the retail and HR chief, has evangelized for the diversity benefits.\r\n<br />\r\n\r\n<br />\r\nDecentralization across the company is entering full swing, and Apple has engaged in a costly expansion from the sunny coasts of LA and San Diego to the Pacific Northwest of Oregon and Washington, the Rocky Mountains of Colorado, Iowa's Midwest, the Eastern Seaboard of Massachusetts, Miami and New York.</blockquote>The plans come as Apple prepares to pilot a <a href=\"https://www.macrumors.com/2021/07/01/apple-store-employees-work-from-home/\">hybrid work model</a> for its global retail employees that would sometimes allow them to work from home. The move also follows recent reports of corporate staff <a href=\"https://www.macrumors.com/2021/06/05/apple-staff-complain-about-plans-for-office-work/\">voicing their displeasure</a> about the company's <a href=\"https://www.macrumors.com/2021/06/02/apple-employees-returning-to-work/\">plan</a> to return to three days of in-person work a week starting in September.<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">bloomberg.com</a>, <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/05/apple-to-decentralize-silicon-valley-retain-talent/\">Apple Looks Beyond Silicon Valley to Improve Recruitment and Retention</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-looks-beyond-silicon-valley-to-improve-recruitment-and-retention.2303288/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i_EWIFnbq70:kWsPJTiIqSA:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=i_EWIFnbq70:kWsPJTiIqSA:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/i_EWIFnbq70\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"949553d71e9629137c02e000f8ca75039b87a36cdbd94a86bf9b88afd647050d","category":"Apple"}