{"title":"RideLondon Classique 2023 preview - route, contenders and prediction","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/ridelondon-classique-preview-route-contenders-and-prediction","date":1685006716000,"content":"\n      <p>The RideLondon Classique is the 18th instalment of the Women’s WorldTour (WWT) calendar, taking place across three days from May 26, 2023 to May 28, 2023. It’s the only WWT race that will be held in the UK this year, as the Women’s Tour, which usually takes place in June, has been cancelled.</p>\n<div></div>\n<p>Originally a one-day race with a circuit route around central London, the RideLondon Classique returned last year, after two missed editions due to Covid, with two additional stages. In 2016, the then one-day race was added to the WWT calendar with a €100,000 prize purse – one of the highest in the calendar.</p>\n<p>Lorena Wiebes dominated the race last year, winning all three stages. The Dutch rider also won the three-stage race in 2019. However, Team SD Worx won’t be participating in this year’s edition, giving another rider the opportunity for victory. In the race’s five-year history, only two other riders have won, namely Kirsten Wild (2016/2018) and Coryn Labecki (2017).</p>\n<p>With three sprint stages again for this year’s edition, we expect the fastest women to be on the podium at the end.</p>\n<h3><b>Route</b></h3>\n<p><span>This year’s edition of the RideLondon Classique takes place across three stages in and around Essex and London. It is a fast-paced affair, with all three stages finishing in a sprint, and only a few minor inclines along the way that the riders will have to tackle. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/frl-classique-stage-one.jpg?v=1684839625\" alt=\"RideLondon Classique stage one\" /></span><span><em>Stage one maps sourced by the RideLondon Classique website</em></span></p>\n<p><span>Stage one starts in the northern part of Essex, in the mediaeval market town of Saffron Walden. The peloton will then head southwest to Clavering before returning through Saffron Walden towards Audley End, where the first sprint classification will take place. The route then follows the northern boundary of Essex, passing through the countryside and towns of Steeple Bumpstead, Wethersfield and Halstead. The road undulates throughout the day, featuring three classified climbs where the Queen of the Mountains points will be up for grabs. The last 25km of the route is on flat open roads and finishes with a slight uphill in Colchester, in front of Colchester Castle. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/frl-classique-stage-two.jpg?v=1684839651\" alt=\"RideLondon Classique stage two\" /></span><em>Stage two maps sourced by the RideLondon Classique website</em></p>\n<p>Starting in the town of Maldon alongside the River Blackwater, stage two heads northeast towards Layer-de-la-Haye on mainly flat roads. The route then heads back towards Maldon, incorporating the first QoM of the stage in Wickham Bishops. After racing up the climb, the peloton will then tackle three laps of the 22km circuit each including an ascent up North Hill. Stage two finishes on a flat finish at the end of the third lap. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/frl-classique-stage-three.jpg?v=1684839645\" alt=\"RideLondon Classique stage three\" /><em>Stage three maps sourced by the RideLondon Classique website</em></p>\n<p>The third and final stage starts and finishes on The Mall, the iconic road which runs from Buckingham Palace to Trafalgar Square in central London. This stage is tailored for the pure sprints, with a completely flat route that twists and turns through the streets of the capital. The Mall then rolls out the red carpet for the champion of the RideLondon Classique in one of the grandest race finishes on the UCI Women’s WorldTour calendar. </p>\n<p><b>Stage one: </b><span>150km / Saffron Walden - Colchester </span></p>\n<p><b>Stage two: </b><span>140km / Maldon - Maldon </span></p>\n<p><b>Stage three:</b><span> 92km / The Mall, London - The Mall, London</span></p>\n<h3><b>Contenders</b></h3>\n<p><b>Elisa Balsamo</b><span> (Trek-Segafredo) will be back for 2023, having placed second in last year’s edition behind Wiebes. So far this year, the Italian rider has had a number of top 10 finishes, including Classic Brugge-De Panne and Miron Ronde van Drenthe. Balsamo has often been overshadowed by Wiebes, the fastest woman in the peloton at the moment, but with her absence, Balsamo has the chance to take the limelight. </span></p>\n<p><span>Team DSM have two riders in their team who could excel across the three stages. </span><b>Charlotte Kool</b><span> will be a favourite in this race, having established herself as one of best sprinters in the bunch. She had an exceptional start to the season with four wins added to her palmarès, including two stage wins at the inaugural Women’s UAE Tour. </span><b>Pfeiffer Georgi</b><span> is another rider who will fancy her chances here. The British rider secured her first WorldTour win this season at Classic Brugge-De Panne with a solo victory and shows no signs of slowing down, with two more top 10 finishes at Paris-Roubaix Femmes and Amstel Gold. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1475573992_24f11acb-0e2f-4df9-be51-245e5270fa0b.jpg?v=1684839863\" alt=\"Pfeiffer Georgi\" /></span><em>Pfeiffer Georgi winning her first WorldTour victory at Classic Brugge-De Panne (Image by Getty Images)</em></p>\n<p><b>Chiara Consonni</b><span> (UAE Team ADQ) came fifth in last year’s general classification, narrowly missing out on a podium place on stage three. Although she hasn’t claimed a WorldTour win since her Dwars Door Vlaanderen victory last year, she is likely to be the fastest rider in her team when it comes to a bunch sprint. </span><b>Anna Henderson</b><span> (Jumbo-Visma), who won the mountains classification last year, seems to be in good form with two top 10 finishes so far. </span></p>\n<p><b>Clara Copponi </b><span>(FDJ-Suez) can produce a strong sprint if she’s having a good day and will be aiming for a victory for herself and her team. For the Uno-X Pro Cycling Team, </span><b>Susanne Andersen</b><span> will be the rider they’ll support for the jersey. </span></p>\n<p><span><strong>Chloe Dygert</strong> (Canyon-SRAM) made her long-awaited return to the peloton at La Vuelta Femenina, proving she is still a rider to watch after securing a top 10 finish in four out of the five stages. The American powerhouse also gave Lorena Wiebes a run for her money at the Vuelta a Burgos Feminas, securing fourth place overall in the GC. </span><b>Shari Bossuyt </b><span>and</span><b> Soraya Paladin</b><span> from Canyon-SRAM will also be formidable contenders in bunch sprints. </span></p>\n<h3><b>Prediction</b></h3>\n<p><span>With it being a race for the sprinters, we think Charlotte Kool from Team DSM will reign victorious outside of Buckingham Palace on stage three.</span></p>\n<p><em><span>*Cover image by SWPix.com</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9496dd88f70396c75b2dcad1410cce293c14d04ebbe19dcc465a2d689d8b6896","category":"Cycling"}