{"title":"Tour de France 2023 stage eight preview - putting the sprinters under pressure","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2023-stage-eight-preview","date":1688745360000,"content":"\n      <p><b>Distance: </b>200.7km<br /><b>Start location: </b>Libourne<br /><b>Finish location: </b>Limoges<br /><b>Start time: </b>12:30 CEST<br /><b>Finish time (approx): </b>17:07 CEST</p>\n<p>As the second of just two stages of this year’s <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> that exceeds 200km, stage eight is a long transition stage designed to take the race north-eastwards to the western edge of the Massif Central. The hills of this highland region of south-central France will be of great significance in the coming days, but in regards to the history of today’s finish town of Limoges, it's the clay soil of Saint-Yrieix-la-Perche, about 40km to the south, that is of most interest. It was here in the 18th century that kaolin was first discovered, the mineral which, when combined with petuntse rock, creates porcelain. Factories were established in Limoges and industry boomed, and soon the town overtook Paris to become the nation’s leading manufacturers of porcelain, and it’s still revered for its quality today.</p>\n<div></div>\n<p>The porcelain industry created a lot of jobs during the industrial revolution — including Pierre-Auguste Renoir, who worked in a factory before transcending his humble origins to establish himself as one of the great painters of the Impressionist movement. One of Limoges famous sons, some of his work is housed in the town’s Museum of Fine Arts, where you can also find examples of the famous local porcelain. </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Tappa8.jpg?v=1688379999\" alt /></p>\n<p><i>Stage eight profile sourced via ASO</i></p>\n<p>The first half of this stage could not be kinder to the sprinters. As the riders make their way north-eastwards through Girande, there’s barely so much as a speed bump to test the climbing legs. However, the category three Côte de Champs-Romain that’s tackled 130km into the stage marks the onset of a new phase of the race, where undulating roads will make attacks difficult to control and put the sprinters under pressure to stay in the peloton. Two more climbs have been given a category four rating, but there’s lots of similar short steepish ramps that have been left uncategorised in the final 50km.</p>\n<p>Even if the sprinters do survive and the attacks are neutralised, there’s a sting in the tail at the finish where an uphill to the line could foil them. The drag wasn’t enough to prevent pure sprinter Marcel Kittel from winning here the last time the Tour visited Limoges in 2016, although he had to dig deep and maintain his sprint for an agonisingly long time to just about edge Bryan Coquard at the line. However, this year the finishing uphill will be a longer one, which means it could be a puncheur rather than a sprinter who triumphs. </p>\n<h3><strong>Contenders</strong></h3>\n<p><span>Despite the number of climbs on this stage, which could pose a difficulty for the pure sprinters in the peloton, we still anticipate a battle among some of the fastest men for the stage victory. It is their last opportunity for a potential bunch sprint before the route takes the riders to the Puy de Dôme, followed by a rest day. </span></p>\n<p><span>This presents a prime opportunity for riders like </span><b>Mathieu van der Poel</b><span> (Alpecin-Deceuninck), who has recently garnered attention not for his winning capabilities, but for his exceptional lead-out skills. His teammate <strong>Jasper Philipsen</strong> has already triumphed in three stages of this Tour, with Van der Poel playing a crucial role, and considering the former's immense form he might fancy his chances at a fourth win here. But could this stage be the moment we witness Van der Poel going for a victory as a thanks for his hard work so far? </span></p>\n<p><span>Another rider who has been putting in considerable effort throughout this Tour, albeit without any podium finishes, is </span><b>Wout van Aert </b><span>(Jumbo-Visma). Despite his valiant attempts, Van Aert has experienced a disappointing opening week in terms of personal chances for stage victories. However, he seemed to conserve his energy in stage seven, preparing himself for this particular stage perhaps.  </span></p>\n<p><span>Lidl-Trek's </span><b>Mads Pedersen</b><span> loves a tough finish, and this slightly uphill sprint to the finish line will certainly provide a challenge. The team’s sprint star hasn’t achieved the desired results thus far, with this best result a ninth-place finish. Nonetheless, this more complicated sprint might offer him an opportunity to step onto the podium. </span></p>\n<p><b>Bryan Coquard </b><span>(Cofidis) secured second place in a photo finish on a similar stage back in 2016 when he faced off against Marcel Kittel. The French rider has demonstrated strength in the current Tour, placing fourth on the lumpy stage four, and is a definite contender for a maiden Tour victory. </span><b>Biniam Girmay</b><span> (Intermarché-Circus-Wanty) will also be a rider to watch and on paper, this looks a stage suited more to his strengths. He's creeping utowards a stage win with a third-place finish on stage seven. </span></p>\n<p><b>Caleb Ewan</b><span> (Lotto Dtsny) possesses the ability to excel in an uphill bunch finish due to this small stature and ability to hold a long sprint. He has come close to claiming victory twice already in this Tour, delivering impressive performances on stages three and four. He appears to be in good form, and if any attacks can be neutralised resulting in a bunch sprint, the slight uphill towards the end might give him the advantage. </span></p>\n<p><span>A rider who has the abilities to grin and bear a gruelling finish is </span><b>Alexander Kristoff </b><span>(Uno-X Pro Cycling Team), who could be an outside contender for the stage. Or punchier riders who could launch an attack on one of the categorised climbs could be </span><b>Julian Alaphilippe</b><span> (Soudal-Quick-Step) or </span><b>Magnus Cort </b><span>(EF Education-EasyPost), both on the hunt for a stage win. </span></p>\n<h3>Prediction </h3>\n<p>We think (again) <strong>Wout van Aert</strong> will win the stage. <span>Prior to the start of stage seven, he expressed his interest in stage eight as a potential opportunity, and considering the outstanding form he displayed in stage five, it is evident that he will be highly motivated to capitalise on this chance.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"94998931193077f91c7139b36c2d7be5f5f1bed52e49e5d4325a24849e0af045","category":"Cycling"}