{"title":"La Vuelta a España 2021 Stage 2 Preview - Sprint in Burgos","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-stage-2-preview-sprint-in-burgos","date":1628942023000,"content":"\n      <p><span>Following a technical time trial around Burgos, which kicked-off the 76th edition of La Vuelta a España, the sprinters will sense an opportunity on stage 2.</span><span> The stage begins in Caleruega before heading back to Burgos where the stage 1 time trial took place. Arnaud Démare, Jasper Philipsen and Fabio Jakobsen are the pre-stage favourites.</span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/la-vuelta-a-espana-2021-preview\">Vuelta 2021 Guide</a></strong></em></p>\n<div></div>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/VE21-Altimetriasv4-2_1024x1024.png?v=1628936352\" />Stage 2 profile</span></i></p>\n<p><span>With just over 1,000 metres of climbing over 166.7km, this is one of the flattest stages of the race. This means the stage is very likely to culminate in a mass sprint.</span></p>\n<p><span>Although there are a couple of minor undulations throughout the stage, there are no categorised climbs, meaning there aren't any points available in the king of the mountain’s competition.</span></p>\n<p><span>The peloton will reach <span>Tardajos, a small town located west of Burgos,</span> with just under 17km remaining. An intermediate sprint waits here, with bonus seconds available to the first three riders. If the breakaway are caught at this point in the stage and therefore aren’t ahead to mop up the seconds, we may see GC contenders come to the fore in an attempt to gain time.</span></p>\n<p><span>The finish isn’t overly technical, and a minor ramp with 4km left won’t be enough to put the sprinters in difficulty. However, there will be a rush for the final left-hand corner, which pops up with 1.5km remaining. From here, it’s a straight run to the finish line. Although there are enough metres remaining</span><span> to move into position after this corner, the stage favourites will want to avoid unnecessary stress and energy expenditure at this crucial moment. </span></p>\n<p><span>Considering there is such a long, straight drag to the finish line in the final kilometre, the sprinters must rely heavily on their lead out men to position them well. The rider that is able to surf the wheels effectively and maximise their slipstream before powering to the line may have the best chance of winning stage 2. </span></p>\n<h4><b>Contenders</b></h4>\n<p><b><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1233714411-min_1024x1024.jpg?v=1628938857\" /></b><em>Image credit: BENOIT TESSIER/POOL/AFP via Getty Images </em></p>\n<p><span></span><span>Following an underwhelming Tour de France, where he DNF’d prior to the first rest day, </span><b>Arnaud Démare</b><span> enters La Vuelta a España with significant intentions. The Frenchman is making his Vuelta <span>debut</span>, and could become the next rider to complete the Grand Tour trilogy with a stage victory at all three races. Matej <span>Mohorič </span>and Dan Martin achieved the feat earlier this season with victories at the Tour de France and Giro d’Italia respectively. With Jacopo Guarnieri and Ramon Sinkeldam to guide Démare in the concluding kilometres, he starts as one of the stage favourites.</span></p>\n<p><span><b>Fabio Jakobsen</b><span> </span>suffered a horrific crash at the Tour of Poland last year, and has endured a year-long rehabilitation process to overcome the severe injuries he suffered that day. This is the Dutchman’s first Grand Tour appearance for two years, he won two stages at the 2019 Vuelta. There can be no doubting Jakobsen’s talent, and after he suffered such shocking injuries just a year ago, simply starting La Vuelta a España can be seen as a success. A stage victory would be a remarkable achievement. This is his first chance.</span></p>\n<p><b>Jasper Philipsen</b><span> provided one of the memorable images of the 2021 Tour de France when he finished second on Champs-</span>Élysées <span>and couldn’t contain his <span>post-race </span>emotions. Philipsen had led teammate Tim Merlier to victory on stage 3, before finishing on the podium five times throughout the race without recording a stage win. E<span>ven though the Belgian is just 23 years old,</span> he is one of the most established sprinters present in Spain. He won his first Grand Tour stage at La Vuelta last season, and will be keen to put his Tour de France near misses to bed with another victory in Spain.</span></p>\n<p><span><i><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1329398407-min_1024x1024.jpg?v=1628936315\" />Jasper Philipsen after finishing second on stage 21 of the Tour de France (Image credit: Tim de Waele/Getty Images)</i></span></p>\n<p><span>Israel Start-Up Nation’s</span><b> Davide Cimolai </b>also has multiple<span> near misses at Grand Tours this season — Cimolai was second twice at the Giro d’Italia. The Italian turned 32 a few days prior to the Vuelta's departure in Burgos, and we can’t think of a better belated birthday present than his first Grand Tour stage victory. If he can replicate his Giro d’Italia form, he has a shot.</span></p>\n<p><span>UAE Team Emirates begin La Vuelta with four-time stage winner </span><b>Matteo Trentin</b><span> in their line up. Trentin was the sprinter to beat in 2017 where he accumulated all four of those wins. However, he looks more likely to leadout </span><b>Juan Sebastián Molano</b><span> this time. The Colombian won two stages at the Vuelta a Burgos last week so enters the race in red-hot form.</span></p>\n<p><b>Michael Matthews</b><span> challenged Mark Cavendish for the green jersey at the Tour de France earlier this year, but ultimately had to settle for second. He is racing his first Vuelta since 2014, where he won stage 3. Team BikeExchange have multiple options </span><span>with </span><b>Luka Mezgec</b><span> who is also capable of producing a strong result here — he was fourth on Champs-Élysées in July.</span></p>\n<p><span>Other riders with a chance include</span><b> Alberto Dainese, Jon Aberasturi </b><span>and </span><b>Martin Laas</b><span>, who beat Alex Kristoff last week to win stage 2 of the Arctic Race of Norway.</span></p>\n<h4><b>Prediction</b></h4>\n<p><span>Earlier this season, Alpecin-Fenix won stage 2 of the Giro d’Italia with Tim Merlier, and later, stage 2 of the Tour de France with Mathieu van der Poel. We are backing the Belgian team to make it a stage 2 hat-trick at Grand Tours with Jasper Philipsen. The 23-year-old has </span>Alexander Krieger <span>and two-time Giro stage winner Sacha Modolo at his disposal, who have a crucial role to play if Philipsen is to win stage 2 of the Vuelta a España.</span></p>\n<p><em><span>Cover image: Gonzalo Arroyo Moreno/Getty Images</span></em></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"949feac1428d57761c69033db28e3009774b9479f2021f7542a38936e50b9864","category":"Cycling"}