{"title":"Genetic improvement of oysters: Current status, challenges, and prospects","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12868?af=R","date":1698649200000,"content":"<h2>Abstract</h2>\n<p>Oysters are one of the most commercially important shellfish species and have been cultured for thousands of years. Oyster aquaculture supports the major aquaculture industries in many countries. Over the last few decades, the oyster breeding and aquaculture industries have developed rapidly to meet the continually growing demand. Many researchers have made significant efforts toward the genetic improvement of commercially important traits in oysters. Some strains with fast-growing, disease-resistant, and stable shell-colours have been developed through selective breeding. Some hybrid varieties have been developed by crossing different geographical populations or cultivated strains. Several hybrids exhibit considerable genetic variation and improved productive performance. Additionally, polyploid induction technologies have been applied in the oyster aquaculture industry, which provides a useful tool for performance improvement and genetic containment of cultured stocks. At present, the development of molecular breeding also provides a great opportunity for oyster genetic improvement. These advances in oyster breeding have improved the quality of oysters, brought great economic benefits, and been conducive to the sustainability of oyster production. Nonetheless, there are still some limitations and obstacles in oyster breeding, such as infectious diseases, summer mortality, conservation of germplasm resources, environmental contamination, and climate change. The present review provides an overview of the current status, challenges, and prospects in oyster breeding.</p>","author":"Kunyin Jiang, \nChen Chen, \nGaowei Jiang, \nYong Chi, \nChengxun Xu, \nLingfeng Kong, \nHong Yu, \nShikai Liu, \nQi Li","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"94a4d8e2b3575d96afc1e7c5eb860e550986c87171ff6472fd77412883de5c75","category":"Environment"}