{"title":"Collaborative Smart Production Supply Chains with Blockchain Based Digital Product Passports","link":"https://www.preprints.org/manuscript/202402.1194/v2","date":1715332457000,"content":"For the purpose of improve the sustainability of products sold in the EU, Digital Product Passports is a mandatory solution. These passports would systematically gather information about products, such as detailing the materials involved to aid recycling and remanufacturing efforts, or recording the emissions produced throughout the manufacturing process. The overall goal is the establishment of a circular economy in the EU. Current research on Digital Product Passports is focused on collating content for sector-specific applications. However, achieving sustainability goals through Digital Product Passports will require new methods and technical solutions for digital collaboration between supply chain participants, especially in the manufacturing sector. Collaborative work on Digital Product Passports requires trust and traceability in data and access management to ensure privacy over the data contained. One way to enable this securely and confidentially is through the use of blockchain technology, in which stored data cannot be concealed, which is key to the traceability of digital product data documentation. This paper therefore presents a concept for the implementation of generically applicable cross-industry blockchain-based digital product passports. To this end, generic supply chain processes have been abstracted and condensed into the architecture of smart contracts. Great attention is paid to the establishment of traceability as well as privacy through the selection of the blockchain technology Secret Network in combination with Gaia-X functionalities. An illustrative use case for digital product passports in manufacturing is used to  demonstrate the applicability of the presented concept. In this use case information about the digital nameplate and carbon footprint is exchanged securely and confidentially in a multi-tenant supply chain network based on the Industry 4.0 infomation model of the Asset Administration Shell.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"94b2d2caf00ec0d885d1d240b2a54afa8517a64f14b469e4ca8d0fc6bb05c962","category":"Interdisciplinary"}