{"title":"Societal drivers for the integration of hydrogeomorphology and human benefits in river restoration projects","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4304?af=R","date":1715151600000,"content":"<h2>Abstract</h2>\n<p>Integrating hydrogeomorphological (HGM) principles into the restoration of degraded rivers can achieve sustainable results and provide various human benefits. HGM principles mainly involve understanding the context and processes that shape a fluvial system before any intervention, in order to support its dynamism and to align with its potential functioning and uses. Despite recent management approaches inspired by HGM principles, most restoration projects carried out in Quebec (Canada) are not process-based and target specific one-dimensional objectives. Although there is an overall lack of post-project monitoring, several projects appear to have failed or had mixed success. This research aims to shed light on the diversity of societal drivers behind river restoration projects and to examine how they influence the integration of HGM principles and human benefits. Four restoration projects were characterized through participant observation and interviews with the organizations running them. Representatives of two ministries involved in river restoration and management were also interviewed. The results show that projects were mainly shaped by public acceptance disregarding HGM principles, which can lead to poorly-informed action. Project funding and stakeholders' expertise have also challenged project implementation and played a key role in defining their objectives. The addition of these components improve the current analytical frameworks for identifying river restoration objectives. Depending on specific sociocultural, political and legislative contexts, funding programs and stakeholders' expertise may either facilitate or restrict the integration of HGM principles and human benefits in the projects. Recognizing these key drivers reframes river restoration as a fundamentally social activity and enlightens how they could impel innovative approaches towards more sustainable results.</p>","author":"Étienne Gariépy‐Girouard, \nThomas Buffin‐Bélanger, \nPascale M. Biron","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"94b3fe9251910cb011311522cee1f736e0ee6bcbabd557cf70374b145e2aec5e","category":"Environment"}