{"title":"Bing Search shows few, if any, signs of market share increase from AI features","link":"https://arstechnica.com/?p=1996998","date":1705614742000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing-800x387.jpeg\" alt=\"Bing Search shows few, if any, signs of market share increase from AI features\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/bing.jpeg\">Enlarge</a> (credit: Microsoft)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Not quite one year ago, Microsoft announced a \"multi-year, multi-billion dollar investment\" in OpenAI, a company that had made waves in 2022 with its ChatGPT chatbot and DALL-E image creator. The next month, Microsoft announced that it was integrating a generative AI chatbot into its Bing search engine and Edge browser, and similar generative AI features were announced for Windows in the apps formerly known as Microsoft Office, Microsoft Teams, and other products.</p>\n<p>Adding AI features to Bing was meant to give it an edge over Google, and reports indicated that Google <a href=\"https://arstechnica.com/gadgets/2023/04/panic-at-google-samsung-considers-dumping-search-for-bing-and-chatgpt/\">was worried enough about it</a> to accelerate its own internal generative AI efforts. Microsoft announced in March 2023 that Bing <a href=\"https://arstechnica.com/gadgets/2023/03/ai-powered-chat-helps-bing-make-a-small-dent-in-googles-search-hegemony/\">surpassed the 100 million monthly active users mark</a> based on interest in Bing Chat and its ilk; by Microsoft's estimates, each percentage of Google's search market share that Bing could siphon away was worth as much as $2 billion to Microsoft.</p>\n\n<p>A year later, it looks like Microsoft's AI efforts may have helped Bing on the margins, but they haven't meaningfully eroded Google's search market share, <a href=\"https://www.bloomberg.com/news/articles/2024-01-18/microsoft-s-bing-market-share-barely-budged-after-adding-chatgpt\">according to Bloomberg</a>. Per Bloomberg's analysis of data from Sensor Tower, Bing usage had been down around 33 percent year over year just before the AI-powered features were added, but those numbers had rebounded by the middle of 2023.</p></div><p><a href=\"https://arstechnica.com/?p=1996998#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1996998&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"94c0d782d6d32c7762f6d5235a5999885eaee4f70e70b2f531f6338b3ad30ea3","category":"Tech"}