{"title":"Factors associated with Paddlefish (Polyodon spathula) restoration success in Oklahoma","link":"https://onlinelibrary.wiley.com/doi/10.1111/fme.12677?af=R","date":1709729842000,"content":"<h2>Abstract</h2>\n<p>The Paddlefish (<i>Polyodon spathula)</i> has been extirpated from portions of its native range due to anthropogenic habitat degradation and fragmentation, most notably the impoundment of rivers. To mitigate some of these losses in Oklahoma, Paddlefish have been stocked into reservoirs throughout the state, with variable success in establishing self-sustaining populations. Two factors thought to contribute to success of Paddlefish stocking are spawning substrate and prey availability, which were quantified in six reservoirs and nine reservoir tributaries. Side-scan sonar and supervised classification of aerial imagery were used to classify 4517-ha of river substrate upstream of the river-reservoir interface in reservoir tributaries. Zooplankton community structure, water clarity, and nutrient availability were also assessed in the same reservoirs and tributaries. One tributary had suitable spawning substrate (&gt;40%), and the rest had minimal (&lt;1.5%), which suggested that availability of suitable spawning substrate was not directly correlated with Paddlefish stocking success. Reservoirs with self-sustaining Paddlefish populations had higher abundance of large zooplankton (copepods and cladocerans) than reservoirs without a reproducing population. Notably, tributaries associated with Lake Texoma, the one known example of failed restoration, were much more turbid than other rivers. We conclude that abiotic factors such as water clarity may contribute more to variable recruitment than spawning substrate or zooplankton abundance by mediating foraging success of Paddlefish post-larvae.</p>","author":"Ryan A. Gary, \nJames M. Long, \nBrian T. Eachus, \nAndrew R. Dzialowski, \nJason D. Schooley","siteTitle":"Wiley: Fisheries Management and Ecology: Table of Contents","siteHash":"2b1b3fff230d9382f58e34a4967fc2d5f8d98012b5e160c81a8e044227f32245","entryHash":"94c7da221666f809af39fa5382d74197aa3dce5d83717146e06bcec601d6c121","category":"Environment"}