{"title":"Evaluation of cooling effect and road performance of warm mixed high viscosity porous asphalt mixture","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307554","date":1722261600000,"content":"<p>by Jun’an Lei, Nanxiang Zheng, Zhiyuan Jia</p>\r\n\r\nIn order to study the effect of different warm mixing agents on the cooling and road performance of porous mixture bonded with High Viscosity Asphalt (HVA), the Superpave Gyratory Compactor (SGC) was proposed to conduct variable temperature compaction test on the warm mixed porous asphalt mixture. The relationship between the compaction difficulty coefficient and the temperature of the mixture was obtained by regression, and the mixing and compacting temperature and cooling effect of the warm mixed porous asphalt mixture were determined. Then, the influence of Evotherm M1 and EC120 warm mix agents on the performance of porous asphalt mixture was compared by rutting tests, beam bending tests, immersion Marshall tests, freeze-thaw splitting tests, and penetration strength tests. The results show that two types of warm mixing agents can reduce the mixing and rolling temperatures of the mixture by more than 10°C. The addition of warm mix agents will increase the high temperature stability, water stability, and shear resistance of porous asphalt mixtures. For the improvement effect of high temperature stability, EC120 warm mixing agent is greater than Evotherm M1 warm mixing agent, and for the improvement effect of water stability, Evotherm M1 warm mixing agent is greater than EC120 warm mixing agent. For shear resistance, the improvement effect of both is equivalent, with a penetration strength increase of about 3% to 4%. For low temperature performance, Evotherm M1 warm mixing agent improved the low temperature performance, while EC120 warm mixing agent showed the opposite effect.","author":"Jun’an Lei","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"94d0bd9d9b526e464d67612e05bad1663341330aed34332d744462e84450d2e4","category":"Interdisciplinary"}