{"title":"Isolation, identification and characterization of Aeromonas jandaei from diseased Chinese soft‐shell turtles","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.13919?af=R","date":1709960884000,"content":"<h2>Abstract</h2>\n<p><i>Aeromonas jandaei</i> is a gram-negative bacterium commonly found in aquatic environments and can induce illnesses in amphibians, reptiles and aquatic animals. In this study, a strain of bacteria was isolated from the diseased Chinese soft-shell turtle (<i>Pelodiscus sinensis</i>), then named strain JDP-FX. This isolate was identified as <i>A. jandaei</i> after analysis of morphological, physiological and biochemical characteristics, as well as 16S rRNA and <i>gyrB</i> gene sequences. Virulence genetic testing further detected temperature-sensitive protease (<i>eprCAI</i>), type III secretion system (TTSS) (<i>ascv</i>), nuclease (<i>nuc</i>), cytotonic enterotoxin (<i>alt</i>) and serine proteinase (<i>ser</i>) in JDP-FX. Compared with healthy Chinese soft-shell turtle, the serum levels of total protein (TP), albumin (ALB) and globulin (GLB) were significantly decreased in the diseased Chinese soft-shell turtle, while, the levels of alanine aminotransferase (ALT), aspartate aminotransferase (AST) and alkaline phosphatase (ALP) were significantly increased. Histopathological observations showed that multiple tissues, including intestinal mucosa, liver and kidney, were severely damaged in the diseased Chinese soft-shell turtle. Moreover, the diseased Chinese soft-shell turtle had significant cell degeneration, necrosis, sloughing and interstitial inflammatory cell infiltration. The pathogenicity of JDP-FX was tested via artificial infection. The median lethal dosage (LD<sub>50</sub>) of the strain was 1.05 × 10<sup>5</sup> colony forming units (CFU/g) per weight of Chinese soft-shell turtle. Drug susceptibility analysis revealed that JDP-FX was susceptible to ceftazidime, minocycline, cefoperazone, ceftriaxone and piperacillin. In addition, JDP-FX was resistant to doxycycline, florfenicol, sulfonamides, gentamicin, ampicillin and neomycin. Therefore, this study may provide guidance for further research into the diagnosis, prevention and treatment of JDP-FX infection.</p>","author":"Mengmeng Chen, \nMingyang Xue, \nJingtao Chen, \nZidong Xiao, \nXiaowei Hu, \nChunjie Zhang, \nNan Jiang, \nYuding Fan, \nYan Meng, \nYong Zhou","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"94d31967000b8f861146ad4d2f0238018edd0f14959c210292f0f55d5222e36a","category":"Environment"}