{"title":"Examining the relationship between social determinants of health, measures of structural racism and county-level overdose deaths from 2017–2020","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304256","date":1716472800000,"content":"<p>by Zoe Lindenfeld, Diana Silver, José A. Pagán, Donglan Stacy Zhang, Ji Eun Chang</p>\r\nIntroduction <p>Despite being an important determinant of health outcomes, measures of structural racism are lacking in studies examining the relationship between the social determinants of health (SDOH) and overdose deaths. The aim of this study is to examine the association between per capita revenue generated from fines and forfeitures, a novel measure of structural racism, and other SDOH with county-level overdose deaths from 2017–2020.</p> Methods <p>This longitudinal analysis of 2,846 counties from 2017–2020 used bivariate and multivariate Generalized Estimating Equations models to estimate associations between county overdose mortality rates and SDOH characteristics, including the fines and forfeitures measure.</p> Results <p>In our multivariate model, higher per capita fine and forfeiture revenue (5.76; CI: 4.76, 6.78), households receiving food stamps (1.15; CI: 0.77, 1.53), residents that are veterans (1.07; CI: 0.52, 1.63), substance use treatment availability (4.69; CI: 3.03, 6.33) and lower population density (-0.002; CI: -0.004, -0.001) and percent of Black residents (-0.7`; CI: -1.01, -0.42) were significantly associated with higher overdose death rates. There was a significant additive interaction between the fines and forfeitures measure (0.10; CI: 0.03, 0.17) and the percent of Black residents.</p> Conclusions <p>Our findings suggest that structural racism, along with other SDOH, is associated with overdose deaths. Future research should focus on connecting individual-level data on fines and forfeitures to overdose deaths and other health outcomes, include measures of justice-related fines, such as court fees, and assess whether interventions aimed at increasing economic vitality in disadvantaged communities impact overdose deaths in a meaningful way.</p>","author":"Zoe Lindenfeld","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"94d6dd8ee7914e2704ff46a0754ec68d014f31f1f95a5d92594fb86ec3372c17","category":"Interdisciplinary"}