{"title":"Mont Ventoux: Fear and the Mountain","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/mont-ventoux-fear-and-the-mountain","date":1625137443000,"content":"\n      <p><strong></strong>‘Wise is he who does not return there. But mad is he who does!’</p>\n<p>These are the words of an old man to Frederic Mistral, on discovering that the Provençal poet and two friends had just climbed Mont Ventoux for no reason other than to look at the view from the top.</p>\n<p>Nine years after his ascent, in 1866, Mistral – himself named after the famous northwesterly wind that blows across the mountain and is said to drive people mad – published an epic poem about Ventoux.</p>\n<p><i>From the North, the Ventoux is frightening:</i></p>\n<p><i>One would say like a wall</i></p>\n<p><i>It arises, grandly chiseled from foot to peak;</i></p>\n<p><i>A black crown of trees,</i></p>\n<p><i>A forest of larch, a hard line</i></p>\n<p><i>Serves as the machicoulis</i></p>\n<p><i>And the portal of the formidable rampart.</i></p>\n<p>Mistral was a Provençal patriot. He valued the warm, sensual Mediterranean way of life over the cold North, hence his emphasis on Ventoux as a rampart, intimidating when approached from the North. Provençal folklore about the mountain maintains that one of the caves on the North face, the Baume de Méne, is an entrance to hell.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-most-difficult-climbs\">Related: Tour de France 2021: hardest climbs</a></em></strong></p>\n<div></div>\n<p>Ventoux is a symbol of Provence, and the south of France, but it’s not part of the cosy and pervasive image of the region created by<i> A Year in Provence</i>. There may be lavender fields at its foot, and vineyards, charming villages nearby, but the mountain itself remains strange, frightening, unique.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/Mont-Ventoux_005_1024x1024.jpg?v=1596792357\" /></p>\n\n<p>The facts. Mont Ventoux rises to 1,912 metres. Geologically, it is part of the Alps, yet it sits alone in the landscape. Alone, and dominant. The white scree at the top, often described as lunar, is limestone.</p>\n<p>Over the centuries the mountain was stripped of its forests for charcoal production, then timber for shipbuilding. Since the 19th century, conservation efforts have had some success in replanting trees. The flora and fauna on the mountain have long attracted collectors and medicine-makers, and are now protected by UNESCO. In the autumn, wild boars are hunted in the forests. Some say that wolves still roam there.</p>\n\n<p><em>Title image by<span> </span><a href=\"https://www.instagram.com/danielhughesuk/?hl=en\">Daniel Hughes</a><span> </span>and available as a print<span> </span><strong><a href=\"https://www.rouleur.cc/products/ventoux-daniel-hughes\">here</a></strong> </em></p>\n<p>It is one of the windiest places on earth. In February, 1967, a wind-speed of 320 km/h was recorded on the summit. That’s very windy indeed.</p>\n<p>The name Ventoux is often thought to originate from the French word for windy, <i>Venteux,</i> but the correct etymology is the word <i>Vinturi,</i> meaning mountain. So the literal translation of Mont Ventoux is Mount Mountain.</p>\n<p>None of which really describes this place. The earliest description of an ascent is credited to Francesco Petrarch, and the letter he wrote about that ascent in 1336 is regarded as the first expression of a modern mountain climbing sensibility. “The life we call blessed is certainly located on high, and a very narrow road leads to it,” Petrarch wrote. In his book <i>The Wind and the Source</i>, academic Allen S. Weiss comments: “The summit must be attained with mind, not body … the mountain is the axis mundi, connecting heaven, earth and underworld.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-991411598_1024x1024.jpg?v=1625138665\" /></p>\n<p>Whether as metaphors for the upward struggle towards God, or as the earthly points closest to the Heavens, mountains have long been connected to religion. In the 18th century, the Romantics associated the idea of the sublime – a blend of fear, awe and joy – with mountains.</p>\n<p>Cycling has a special relationship with landscape, but I would contend that of all the famous places we know and love, only Ventoux inspires fear, awe and joy on such an instinctual level.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\">Related: Tour de France 2021 Preview</a></em></strong></p>\n<p>Paris-Roubaix’s trench of Arenberg comes close; it is the opposite of Ventoux, a dark, dank forest that riders charge into, not knowing what awaits them, and whether they will emerge at the other end. The mines beneath, and the word trench, with its connotations of warfare, accentuate the darkness. Many have come to grief on its cobbles; Johan Museeuw almost lost his leg as a result of his horrific crash on this tract.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Wellen_Forest_1996_01-1200x814_1024x1024.jpg?v=1596792394\" /></p>\n<figure>\n<figcaption><em>Paris-Roubaix 1996. The ominous, enclosed Trouée d’Arenberg.</em></figcaption>\n</figure>\n<p>Ventoux, by contrast, is open, straightforward and brutal. Ascended by the classic Bédoin route, the climb is 21km long, with an average gradient of 7.5 per cent. On paper this sounds manageable, but within it is the 9km section from St Estève to Chalet Reynard, through the forest with an average gradient of 9 per cent, and some ramps up to 12 per cent. Pass this test and you emerge into the infamous blasted cauldron of the last 6km.</p>\n<p>The air is dry and scarce. The crosswinds can have you leaning your bike just to stay on two wheels. And the heat reflects off the merciless rocks. A cyclist should not fear the gradient, the heat or the wind. He or she should fear the combination of all three. In a race, tactics are minimal here. By the last few kilometres, towards the aptly named Col de Tempêtes, there is only road, white rock, wind and pain.</p>\n<p>If the Tour de France has made Mont Ventoux famous, this final section is where its defining moment came on July 13, 1967. It was the 13th stage of that year’s race, but a more significant statistic was the temperature – 55 degrees Celsius. Legend has it that in a café on the climb, the mercury in a thermometer exploded.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/products/mountains-epic-cycling-climbs-expanded-edition\">Mountains: epic cycling climbs by Michael Blann</a></em></strong></p>\n<p>Tom Simpson, riding for a weak British national team, was under pressure to perform well at the Tour. The pressure was mainly self-imposed. He’d proven himself as a one-day racer, and his sixth place in the 1962 Tour had shown his promise, but at the age of 29, he knew he had to make a name for himself at the Tour. If nothing else, a strong Tour meant lucrative post-Tour criterium contracts.</p>\n<p>At the start of the Ventoux stage, he was lying in seventh overall. In Bédoin, at the foot of the climb, Simpson dashed into a café and downed a glass of cognac. Eighteen kilometres later, three from the summit, he wobbled to a halt and collapsed. Put back on his bike by a spectator, he somehow managed to ride another kilometre and a half before collapsing again.</p>\n<p>This time, it was the end. The Tour doctor attempted to revive the unconscious Simpson, and he was airlifted to Avignon hospital, but was pronounced dead late that afternoon. An autopsy was performed, and amphetamines found in his system – not enough to kill him, but enough to mask the true effort his body was making. More were found in his baggage. The Tour director, Jacques Goddet, described Simson as “a great guy who was probably afraid of losing”.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Ferdi_Kubler_1955_05-1200x831_1024x1024.jpg?v=1596792511\" /></p>\n<div><em>Tour de France 1955, Stage 11. Ferdi Kübler and Rapahel Geminiani battle up Mont Ventoux. Tellingly, you can already see that Kübler has gone too deep.</em></div>\n<div><em> </em></div>\n<div><em></em></div>\n\n<p><span>Mont Ventoux has almost claimed the lives of other riders in the Tour. In 1955, during another heat wave, French rider Jean Malléjac collapsed ten kilometres from the summit (the stage crossed the mountain before descending into Avignon). Journalist Jacques Augendre described Malléjac as “streaming with sweat, haggard and comatose, he was zigzagging and the road wasn’t wide enough for him… He was no longer in the real world, still less the world of cyclists and the Tour de France.\"</span></p>\n<p>Malléjac lay unconscious beside the road for 15 minutes. When Dumas, the same race doctor who later treated Simpson, managed to bring Malléjac round, the rider requested his bike. To get the furious Frenchman to hospital in Avignon, Dumas had to strap him to the ambulance bed.</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-polka-dot-jersey-at-the-tour-de-france-a-brief-history\">Related: The Polka Dot jersey at the Tour de France: a brief history</a></em></strong></p>\n<p>On the same stage, Ferdi Kübler, winner of the 1950 Tour, attacked on the early slopes. French star Raphaël Géminiani warned him to be careful, but Kübler could be reckless. It was all part of his attacking style, but this time it cost him dearly. Suffering from heatstroke, delirious and foaming at the mouth, his riding became erratic. On the descent he crashed several times, and on the run-in to Avignon he had to stop to rest in a café. When he emerged and climbed back on his bike, he rode off the wrong way, back towards Ventoux.</p>\n<p>He finished the stage over 26 minutes down on the winner, Louison Bobet. That evening, the chastened Swiss told the press “Ferdi killed himself on the Ventoux.” He then announced his retirement from his Tour de France career, effective immediately. One wonders what kind of madness went through his mind during that infernal experience.</p>\n<p>Even the great Eddy Merckx was humbled by the Bald Giant; in 1970 he won the stage to Ventoux. As he crossed the line he gasped “No, it’s impossible,” before collapsing and being administered oxygen.</p>\n<p><img src=\"//cdn.shopify.com/s/files/1/0040/5251/6910/files/OFS_Eddy_Merckx_1970_02-2-1-1200x1206_1024x1024.jpg?v=1596792549\" /></p>\n<figure><em>1970 Tour de France, Stage 14. Eddy Merckx is helped away on the summit of Mont Ventoux after struggling up the climb.</em></figure>\n<p>In 1957 literary theorist and philosopher Roland Barthes wrote a study of aspects of popular French culture, called <i>Mythologies</i>. His essay about the Tour de France examines the media representation of the race, and the way the landscape is given character. He describes Ventoux as “a god of evil to whom sacrifice must be made.”</p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-greatest-jerseys-of-the-tour-de-france\">Related: the greatest jerseys of the Tour de France</a></em></strong></p>\n<p>There is a sense that in the Tour, the riders – our very own Gods of the road – are throwing themselves at this mountain. In the professional peloton, suffering is an art form; sacrifice a badge of honour. Nowhere do you suffer like Mont Ventoux. Kübler showed his arrogance and the mountain defeated him. Simpson was more afraid of losing the race than of the mountain itself, and the mountain turned out to be the greater foe.</p>\n<p>In this modern age, we are more arrogant than ever. We are still afraid, but afraid of random terrorist attacks, not a mountain that you can drive up, which has a café at the top. And yet Mont Ventoux retains a raw power, something primal to which one can’t help but respond.</p>\n<p>Perhaps its power lies in its ability to throw us back at ourselves. The mountain itself disappears, acting only as a reflection of our true selves, our bravery, our capacity for suffering. In his book <i>Vélo</i>, Paul Fournel writes: “The Ventoux has no it-self. It’s the greatest revelation of <em>your</em>self. It simply returns your fatigue and fear. It has total knowledge of the shape you are in, your capacity for cycling happiness, and happiness in general. It’s yourself you’re climbing. If you don’t want to know, stay at the bottom.”</p>\n<p><em>Title image by <a href=\"https://www.instagram.com/danielhughesuk/?hl=en\">Daniel Hughes</a> and available as a print <strong><a href=\"https://www.rouleur.cc/products/ventoux-daniel-hughes\">here</a></strong> </em></p>\n<div></div>\n    ","author":"AppHQ Collaborator","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"94d74c968aaab795edd36abcebaeb012b14e5913312b1d984dd7434ab37fa604","category":"Cycling"}