{"title":"Fire impacts on the biology of stream ecosystems: A synthesis of current knowledge to guide future research and integrated fire management","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17389?af=R","date":1720594800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/de877c4c-1b0d-4d61-894d-4ca2ceafaef1/gcb17389-toc-0001-m.png\" alt=\"Fire impacts on the biology of stream ecosystems: A synthesis of current knowledge to guide future research and integrated fire management\" />\n<p>Our review found that most research on fire impacts on freshwater ecosystems focused on abiotic endpoints in small streams from North American temperate evergreen forests. Regarding the response of stream biological endpoints to fire, the review showed mixed results influenced by post-fire hydrological events and the condition of riparian forests. While wildfires can cause significant short-term impacts, stream ecosystems often recover within 5–10 years, and prescribed fires have minimal effects. We highlight potential limitations in the literature and make future recommendations to better protect freshwater ecosystems in the context of integrated fire management.</p>\n<br />\n<h2>Abstract</h2>\n<p>Freshwater ecosystems host disproportionately high biodiversity and provide unique ecosystem services, yet they are being degraded at an alarming rate. Fires, which are becoming increasingly frequent and intense due to global change, can affect these ecosystems in many ways, but this relationship is not fully understood. We conducted a systematic review to characterize the literature on the effects of fires on stream ecosystems and found that (1) abiotic indicators were more commonly investigated than biotic ones, (2) most previous research was conducted in North America and in the temperate evergreen forest biome, (3) following a control-impact (CI) or before-after (BA) design, (4) predominantly assessing wildfires as opposed to prescribed fires, (5) in small headwater streams, and (6) with a focus on structural and not functional biological indicators. After quantitatively analyzing previous research, we detected great variability in responses, with increases, decreases, and no changes being reported for most indicators (e.g., macroinvertebrate richness, fish density, algal biomass, and leaf decomposition). We shed light on these seemingly contradicting results by showing that the presence of extreme hydrological post-fire events, the time lag between fire and sampling, and whether the riparian forest burned or not influenced the outcome of previous research. Results suggest that although wildfires and the following hydrological events can have dramatic impacts in the short term, most biological endpoints recover within 5–10 years, and that detrimental effects are minimal in the case of prescribed fires. We also detected that no effects were more often reported by BACI studies than by CI or BA studies, raising the question of whether this research field may be biased by the inherent limitations of CI and BA designs. Finally, we make recommendations to help advance this field of research and guide future integrated fire management that includes the protection of freshwater ecosystems.</p>","author":"Maitane Erdozain, \nAdrián Cardil, \nSergio de‐Miguel","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"94d88fce451b56ec397fde49f2ddaf27ae416f2c3a9cc2436a93b51c008b1cc4","category":"Environment"}