{"title":"Is it Possible for Patients with Early Distal Junctional Kyphosis following Adult Cervical Deformity Corrective Surgery to Achieve Similar Outcomes to their Unaffected Counterparts: an Analysis of Recovery Kinetics","link":"https://www.preprints.org/manuscript/202404.0698/v1","date":1712747580000,"content":"BACKGROUND: Distal junctional kyphosis (DJK) remains a primary concern for surgeons performing cervical deformity (CD) surgery. Many times post-operative complications from CD surgeries render patients with worse recovery profiles than their peers. It is important to understand DJK recovery profiles following CD surgery patients.\n\nPURPOSE: To identify if DJK patients successfully recover from treatment/reoperation\n\nSTUDY DESIGN/SETTING: Retrospective review of prospectively collected database\n\nPATIENT SAMPLE: 113 CD patients\n\nOUTCOME MEASURES: CD, HRQL, DJK, Recovery kinetics\n\nMETHODS: CD patients with available BL and 2Y follow-up data. DJK angle (DJKA) was defined as &gt;10° change in kyphosis between LIV and LIV-2, and a &gt;10° index angle. Patients were stratified into two groups: 1) those who developed DJK by 3M and 2) those that did not develop DJK. Patients who developed DJK beyond 3M were excluded from the study. Means comparison tests analyzed differences in demographic, surgical, radiographic, and health related quality of life (HRQL) scores. Normalized HRQL scores at 3M and follow-up intervals (6M, 1Y, 2Y) were generated. Regression analysis assessed patient reported outcomes adjusting for baseline and surgical characteristics.\n\nRESULTS: 113 patients were included (17 DJK, 96 no DJK). Age (60.3 vs 62.2), gender (F: 71.0% vs 61.0%), BMI (27.0 vs 28.3), CCI (0.77 vs 0.98), OpTime (484.0 vs 556.5min), EBL (1028.3 vs 843.9mL), and presenting neurologic symptoms (70.6% vs 76.0%) were similar between groups (P &gt; .05). DJK patients were more sagittally-malaligned preop (cervical sagittal vertical axis {cSVA}: 59.0 vs 43.9); had more osteotomies (76.5% vs 49.0%), and underwent more combined approaches (64.7% vs 26.0%), all p &lt; .05. Posterior approaches, decompressions, and levels fused were similar between groups (p &gt; .05). Following surgery, rate of complications and neurologic symptoms were similar between groups, except DJK patients experienced more dysphagia (17.7% vs 4.2%; p=0.034). DJK patients remained more malaligned in cSVA through 2-yr follow-up (p &lt; .05). DJK patients exhibited worse reported outcomes from 3M to 1Y (p &lt; .05), but these differences subsided when following patients through to 2Y:  worse NDI (65.3 vs 35.3) and EQ5D (0.68 vs 0.79) scores at 1Y (both P","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"94dba3e4ab7580ec2c2dc33bc1b6bc2592e2b8bffa725e4fb76e35521fc20b41","category":"Interdisciplinary"}