{"title":"Apple Set to Collect $73 Million in Legal Fees From Epic Games","link":"https://twitter.com/games_fray/status/1747504304695484810?s=20","date":1705531142000,"content":"\n<p>Apple, a court filing spotted by <a href=\"https://twitter.com/Florian4Gamers/status/1738673544572162438\">Florian Mueller</a> at Games Fray:</p>\n\n<blockquote>\n  <p>Please take notice that on March 5, 2024 at 10:00 a.m., or as soon \nthereafter as the matter may be heard by the Court, at the \ncourtroom of the Honorable Yvonne Gonzalez Rogers, [...] Apple \nInc. (“Apple”) will and hereby does move that this Court, pursuant \nto the mandate of the Ninth Circuit, enter judgment ordering Epic \nGames, Inc. (“Epic”) to pay Apple $73,404,326, plus additional \namounts Apple is incurring during this ongoing litigation, under \nthe indemnification provision of the Developer Program License \nAgreement. </p>\n</blockquote>\n\n<p>This is not simply about Epic having sued Apple and lost; it’s about the fact that this whole saga started with Epic’s Fortnite in-app payment processing stunt, blatantly violating <a href=\"https://developer.apple.com/support/terms/apple-developer-program-license-agreement/#ADPLA10\">the Developer Program License Agreement</a>. This wasn’t like an edge case or technicality; Epic deliberately violated the clear rules of the DPLA as a publicity stunt to launch their antitrust lawsuit. File under “Fucking Around and Finding Out”.</p>\n\n<p>Mueller writes:</p>\n\n<blockquote>\n  <p>Early into the litigation, Epic accepted that if it loses on its \nantitrust claims (as it did), it owes damages. If Epic had \nprevailed on antitrust, the contract clause wouldn’t have been \nenforceable. [...] </p>\n\n<p>Apple does this as a matter of principle. They won’t leave an \namount in the tens of millions on the table. And their overall \ntreatment of Epic, such as not putting Fortnite back, is meant to \ndiscourage other app makers from challenging Apple and from \nbreaching the DPLA. </p>\n</blockquote>\n\n<p>It’s unsurprising but worth noting that <em>Fortnite</em> is seemingly never coming back to iOS, unless Epic sells the franchise to another company. iOS <em>Fortnite</em> players are like the children in an ugly divorce.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2024/01/17/apple-epic-legal-fees\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"94e35e09b2817d055cf628160222417d86e3a1904541fdfd38e40688d0896df3","category":"Tech"}