{"title":"Efficacy, Safety and Persistence on Therapy after Non-medical Switching from Originator Adalimumab in IBD-Real Life Experience from Two Tertiary Centres","link":"https://www.preprints.org/manuscript/202408.1530/v1","date":1724298745000,"content":"Introduction After the first use of infliximab in Crohn’s disease in 1995, the wide scale introduction of anti-tumour necrosis factor alfa (anti-TNF alfa) medications revolutionized the treatment of inflammatory bowel diseases (IBD’s). \nDuring the last two decades an increased number of molecules with multiple mechanisms of action were approved for the treatment of IBD with substantial increase of the costs of related to therapy. The increasing costs and access to therapy became a concern of payers and regulators but also for healthcare professionals. Biosimilars are biologic medical products that are highly structurally identical to their reference products and without any clinically meaningful differences in immunogenicity, safety or effectiveness. \nThe introduction of biosimilars was seen as a way to provide a lower-cost alternative to the originator anti-TNF molecules and hence to increase treatment access and availability for patients.\nMaterial and methods This an observational, prospective study conducted in two IBD centers in Bucharest. The study included 53 patients, 27 male(M) and 26 female(F), diagnosed with UC or BC according to standard clinical,endoscopic, radiological, histological criteria that were non medically switched to a biosimilar. \nAll patients completed at least the induction treatment with the originator adalimumab and they were clinically stable. After switch they received one of the market available biosimilars of Adalimumab(Hukyndra, Imraldi or Hyrimoz). For each patient, the following data were collected: age, sex, BC or UC diagnosis, previous and current therapy, clinical evolution, endoscopic scores as well as several biological markers. \nAim The primary objective was the maintenance of clinical remission at twelve months after switching the original Adalimumab treatment to the biosimilar Adalimumab. The secondary objectives were to evaluate the presence of adverse effects and the treatment persistence at one year. \nResults In our population, there were 42 patients with Crohn's disease and 11 with ulcerative colitis who switched from the originator adalimumab to a biosimilar Adalimumab. The average age was 44,07 years old for patients with BC and 51,72 years old for patients with UC. No significant differences were found in terms of CF and CRP levels at 6 and 12 months after changing the originator biologic treatment to a biosimilar. Only one patient required changing the biological treatment, following the clinical and biological loss of response. The main adverse effect reported by patients was pain at the injection site. Of the 53 patients, only 2 patients reported pain at the injection site, but this was considered not significant because the patients had a BMI below 20 and they also reported the same symptom when administering the originator. One patient reported experiencing abdominal pain and rectal bleeding immediately after switch, but no recurrence was observed clinically and endoscopically.\n\nConclusion: This observational study is the first carried out in Romania that shows that the after the non-medical switch, biosimilars of Adalimumab were as efficient as the originator Adalimumab in the clinical practice of patients with IBD. These results support that conclusion that the large-scale use of biosimilars does not significantly affect the effectiveness of the therapy and the safety of the patient.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"94f093d0ef6d061ef9d18e9cd3d8008bdb7e4cdf2b38c5dfadb7ac67df7ae8f0","category":"Interdisciplinary"}