{"title":"Missing Arctic ice fueled the “Beast of the East” winter storm","link":"https://arstechnica.com/?p=1758076","date":1618859488000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/1_Hannah-Bailey-Arctic-ice-outbreak-800x695.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/1_Hannah-Bailey-Arctic-ice-outbreak.jpg\">Enlarge</a> <span>/</span> Picking up moisture from the ice-free sea, a storm builds and heads towards Europe. (credit: <a href=\"https://www.nasa.gov/\">NASA</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Extreme weather has become the new normal—whether it’s precipitation, drought, wind, heat, or cold. The question of how the ever-shrinking layer of Arctic sea ice has contributed to any of these changes has prompted some lively discussion over the past few years. Researchers have proposed that a weakened jet stream driven by vanishing Arctic sea ice might play a large role in extreme winter events like the descending polar vortex that <a href=\"https://www.washingtonpost.com/weather/2021/02/16/setup-arctic-outbreak-niziol/\">struck North America</a> earlier this year. But the idea hasn’t held up well in light of <a href=\"https://arstechnica.com/science/2021/02/blaming-a-wiggly-jet-stream-on-climate-change-not-so-fast/\">more recent evidence</a>.</p>\n<p>But now, researchers have identified a direct link between extreme winter weather and sea ice loss. The 2018 “<a href=\"https://www.washingtonpost.com/news/capital-weather-gang/wp/2018/03/06/the-beast-from-the-east-delivered-a-historic-blitz-of-cold-and-snow-to-the-united-kingdom-and-ireland/\">Beast of the East</a>” winter storm hit Europe with record-breaking snowfall and low temperatures. And potentially as much as 88 percent of that snowfall originated from <a href=\"https://www.nature.com/articles/s41561-021-00719-y\">increased evaporation</a> of the Barents Sea.</p>\n<p>The working hypothesis is that Arctic sea ice acts as a cap for Arctic waters, limiting evaporation. Less sea ice and warmer Arctic temperatures mean more evaporation, potentially explaining the increased severity of winter storms like the Beast of the East. Until now, it’s been tough to measure direct evidence linking sea ice loss to extreme European winters, but recent advances in technology are making this a little less challenging.</p></div><p><a href=\"https://arstechnica.com/?p=1758076#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1758076&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"94f20ead741d49c422959bd93772b66a2f03d3dbdc42bfb5e568d80c8ceae2dd","category":"Tech"}