{"title":"133 The effect of sire lines and endpoint cooking temperature on consumer eating experience and visual appeal in pork loin chops","link":"https://academic.oup.com/jas/article/102/Supplement_2/55/7664729?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Prior research and public perception of pork suggest breed influence visual characteristics like color and size and palatability traits like tenderness and flavor of pork chops. Therefore, the objective of this study was to assess consumer perception of visual appeal and palatability of pork loin chops from three sire lines cooked to two different degrees of doneness (DOD). Boneless pork loins from three sire lines (Duroc, Berkshire, and Synthetic) were aged to 14 d post-mortem. Loin quality was then measured, and 2.54-cm chops were frozen from each loin. Chops from each sire line were overwrap-packaged in sets of two and displayed in a retail case with two representative packages per sire line. Panelists rated each package for color, marbling, and size on a just about right (JAR) scale and then indicated their overall liking of each package. Chops from each sire line were cooked to either 63째C or 71째C, cut into 1-cm cubes and two samples from each chop were served to each consumer. Panelists rated 6 samples, each sire line and DOD, for tenderness, flavor, and juiciness on a JAR scale and then rated overall liking. Data were analyzed as a randomized complete block design (RCBD) in SAS 9.4 with panelist age range serving as an influence effect for all panel data. Berkshire chops did not differ (<span>P</span> &gt; 0.08) in redness from other chops, but required 0.13 kg less force to shear, and had a 16.23 cm<sup>2</sup> smaller LEA compared with Synthetic and Duroc chops (<span>P</span> &lt; 0.02). Duroc chops had the greatest marbling (<span>P</span> &lt; 0.04) but did not differ in visual color score from other treatments (<span>P</span> &gt; 0.10). There were no differences in consumer visual evaluations (<span>P</span> &gt; 0.45), with traits from all sire lines averaging between 43 and 57 (JAR = 50). Sire line also did not alter visual liking (<span>P</span> = 0.94). There were tendencies for interactions (<span>P</span> &gt; 0.09) between DOD and sire line for consumer sensory evaluation. In general, consumers rated Berkshire chops cooked to 63째C more favorably than other sire line and DOD combinations. Consumers rated chops with different DOD similarly for tenderness and flavor, but tended to score juiciness of chops cooked to 63째C closer to JAR (<span>P</span> = 0.07). Duroc chops were the least tender and least acceptable (<span>P</span> &lt; 0.05). Berkshire chops were juicer than Duroc and Synthetic chops (<span>P</span> &lt; 0.02). Overall, consumers scored all chops between 3.1 and 12.3 units below the JAR line (100-unit scale) regardless of sire line or DOD for tenderness, juiciness, and flavor with overall acceptability within 10 units of neither like nor dislike, which may be indicative of consumers general negative perceptions of pork loin chops.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"94f91df73bf7b29d526bd7b4a15a0290be48e2d6c3add0b27e67ff0eef11f90b","category":"Environment"}