{"title":"Poly(Vinyl Alcohol) Chemical-Dehydration to Polyacetylene By Fuming Sulfuric Acid","link":"https://www.preprints.org/manuscript/202405.0119/v3","date":1716882497000,"content":"Recently, polyacetylene (PA) and polyenes (polyvinylenes) are receiving renewed scientific attention due to their unique physical properties potentially useful also for a number of non-electrical applications (e.g., hydrogen storage, drug delivery, adsorbent of organic compounds in aqueous systems, gas and liquid separation, oxygen absorbent in gas analysis, etc.). These chemical compounds can be obtained in form of a polyacetylene-PVOH copolymers simply by chemical dehydration of poly(vinyl alcohol) (PVOH), which is a very common type of polymer, widely used in different technological areas. This very inexpensive chemical reaction for the large-scale synthesis of PA/polyvinylenes has been investigated by reacting PVOH with fuming sulfuric acid at room temperature. In this process, PVOH, shaped in form of film, is dipped in fuming sulfuric acid (i.e., H2SO4 at 95-97%) and, after complete chemical-dehydration, it has been mechanically removed from the liquid phase by using a nylon sieve. The reduction process leads to a substantial PVOH film conversion to PA as it has been proved by infrared spectroscopy (ATR-mode). Indeed, the ATR spectrum of the reaction product included all characteristic absorption bands of PA. The reaction product has been also characterized by differential scanning calorimetry (DSC) and absorption optical spectroscopy (UV-Vis) in order to evidence respectively its solid-state thermal isomerization (cis-PA conversion to trans-PA) and presence in the structure of conjugated carbon-carbon double bonds of various extensions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"94fad30520e2b90c5619de5cc5633fb22a55d33ceb8e57cdd2c4d8bf0d1d4642","category":"Interdisciplinary"}