{"title":"‘Extending the Johnson & Johnson Vaccine Pause for a Week Was a Deadly Mistake’","link":"https://www.washingtonpost.com/opinions/2021/04/17/extending-johnson-johnson-vaccine-pause-week-was-deadly-mistake/","date":1618755507000,"content":"\n<p>Govind Persad and William F. Parker, in an op-ed for The Washington Post:</p>\n\n<blockquote>\n  <p>Looking at <a href=\"https://www.cdc.gov/vaccines/acip/members/index.html\">ACIP’s\nroster</a>\nhelps diagnose its mistake. Its voting members are almost all\ndoctors far more familiar with rare vaccine side effects than with\nmarshaling scarce public health capacity to respond to a surge of\ninfections. The committee lacks comparative effectiveness experts\nor health economists familiar with weighing inevitable tradeoffs\nat a population-wide scale. […]</p>\n\n<p>What ACIP must provide, but likely never will, is an estimate of\nhow many of the <a href=\"https://covid.cdc.gov/covid-data-tracker/#trends_dailytrendscases\">hundreds of thousands of Americans\ninfected</a>\nwith covid-19 in the coming days could have been protected if J&amp;J\nvaccines were available. The resulting hospitalizations and\ndeaths, likely concentrated in disadvantaged communities, will\nhappen weeks from now and will probably be ignored by the media.\nNews stories will highlight blood clots following vaccination but\nnot consider whether a one-dose vaccine could have protected a\nhomeless person who arrived at the emergency room deathly ill from\ncovid-19 or prevented an outbreak at her encampment. Without a\ncomparison of the pause’s harms to the vaccine’s side effects, we\nhave every reason to fear that ACIP loudly fiddled while Rome\nquietly burned.</p>\n</blockquote>\n\n<p>The authors both have expertise in bioethics, which is the issue at hand.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/04/18/extending-jnj-pause-a-deadly-mistake\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"94fbc7b828fb9cd5888811f7849ca28ee622c4e999e8535fa21cfc448fe90321","category":"Tech"}