{"title":"Spatial-Temporal Variations of Human Impact on Forest Ecological Functions in the Yellow River Basin from 2004 to 2018","link":"https://www.preprints.org/manuscript/202404.0349/v1","date":1712201657000,"content":"Human activities (e.g., exploitation, utilization, and conservation) exert substantial impact on forest ecological functions (FEF). The human influence on FEF significantly varies across developmental stages, which are attributed to the temporal and spatial in nature. This study evaluates some notable FEF indices (FEFI) in the 448 counties within the Yellow River basin (YRB) using panel data from the Seventh to Ninth National Forest Inventory. Data analysis involves employing the residual trends, geographical and temporal weighted regression. Results indicate that, firstly, the overall forest ecological function in the YRB is moderate to inferior, with superior FEF in counties endowed with more natural forest resources. Afforestation demonstrates a short-term improvement, but its effectiveness diminishes over time. Secondly, the positive spatial correlation is stronger among counties, characterized by both high-high and low-low agglomeration effects. Scattered planting, simple stand structure, and concentrated harvesting of forests at the identical stand ages hinder the formation of complex and large-scale FEF agglomerations. Thirdly, significant spatial-temporal differences exist in the impact of human activities on FEF. In the upper reaches of the basin, increased vegetation coverage through agricultural and forestry production benefited FEF, however, some over-exploitation of forests and grasslands is observed there. In the middle reaches, the economic development, expanding population and the greening activities help to improve FEF effectively, but excessive water using in agricultural production brought more difficulties to FEF improvement. In the lower reaches of the basin, improved wastelands and forest protection positively influence FEF. This study recommends that county governments should prioritize forest management with multi-species and multi-layered complex forests. Each county should define its position in regional development and ecological protection, considering the potential impacts on neighboring regions. This holistic approach promotes more effective integrated regional management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"94fd894e2de8bbbc7d1b7012490bf839e1e3d73359ccf5e27d88afb47dd8347b","category":"Interdisciplinary"}