{"title":"Evaluating Short-Term Intensive Insulin Intervention in Newly Diagnosed Type 2 Diabetes: A Meta-Analysis Perspective","link":"https://www.preprints.org/manuscript/202409.1778/v1","date":1727088901000,"content":"Background: Oral hypoglycemic agents are typically the first-line treatment for type 2 diabetes mellitus (T2DM). This study examines the benefits of initiating insulin as the first-line therapy for newly diagnosed T2DM patients. Methods: A PubMed search using keywords ‘Type 2 Diabetes Mellitus’ and ‘Early STIIT’ included RCTs assessing beta cell function, insulin resistance, glycemic control, and lipid profiles. Revman 5.4.1 software was used for meta-analysis, with outcomes represented as mean difference (MD) and 95% confidence intervals (CI). Results: Significant reductions in fasting blood glucose (FBG: MD -4.75, 95% CI -7.07, -2.43), HbA1c (MD -1.84, 95% CI -3.01, -0.68), and postprandial glucose (PPG: MD -9.02, 95% CI -10.48, -7.56) were observed with early STIIT therapy compared to baseline. Beta cell function improved (HOMA-B: MD 53.70, 95% CI 27.78, 79.63) and insulin resistance decreased (HOMA-IR: MD -1.84, 95% CI -3.65, -0.04). Lipid profile improvements included reductions in total cholesterol (TC), triglycerides (TG), and LDL, with no change in HDL. BMI remained stable (MD -0.15, 95% CI -0.82, 0.51). Most patients achieved long-term remission and glycemic control without oral hypoglycemic agents. Conclusion: Early STIIT in newly diagnosed T2DM patients significantly reduces glycemic markers and maintains long-term glycemic control, preserving beta cell function. The therapy also improves lipid profiles, reducing TC, TG, and LDL. Initiating insulin as a first-line treatment shows promising results for glycemic control and overall metabolic health.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9512a828a05bb467cb558406b3d0c9c511322634da528f588dec863fcfd16fdb","category":"Interdisciplinary"}