{"title":"Optimal Dietary Protein Requirement of Subadult Australian Hybrid Abalone (Haliotis rubra × Haliotis laevigata) at Different Rearing Temperatures","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1676340?af=R","date":1675497600000,"content":"<p>Australian abalone aquaculture is characterised by a prolonged culture period and slow and variable growth, and abalone is cultured in fluctuating water temperatures ranging between 10 and 25°C with distinct seasons. Temperature is a crucial environmental factor influencing abalone’s physiology and energetics, leading to a change in nutritional requirements. However, feeds are generally formulated to match the nutritional requirements at their optimal temperature. Hence, there is a need to optimise dietary protein levels to match temperature-specific requirements during extreme conditions (winter and summer). Given this, a growth trial evaluating five experimental feeds consisting of graded protein inclusion levels (320, 350, 380, 410, and 440 g·kg<sup>−1</sup>) was conducted on subadult hybrid abalone (<i>Haliotis rubra</i> × <i>H. laevigata</i>) at three different temperatures reflecting winter (12°C), summer (22°C), and the annual average water temperature (17°C) for 143 days. At lower water temperature (12°C), there was a marginal improvement in growth performance as dietary protein levels increased from 320 to 440 g·kg<sup>−1</sup>. However, at higher water temperatures (when the culture water temperature is above 17°C), there was a significant improvement in growth performance as dietary protein levels increased from 320 to 440 g·kg<sup>−1</sup> as evidenced by an improved weight gain, specific growth rate, and feed conversion ratio. Furthermore, increasing dietary protein levels did not compromise the nutritional quality of the abalone tissue at all three tested temperatures. Therefore, during periods of higher water temperatures, feeding Australian hybrid abalone with a relatively high dietary protein level (410 g·kg<sup>−1</sup>) is expected to result in improved growth, shorter culture duration, and profit maximisation.</p>","author":"Abdul Lathiff Inamul Hassan, \nThomas S. Mock, \nKieren Searle, \nMelissa M. Rocker, \nGiovanni M. Turchini, \nDavid S. Francis, \nFemi Fawole","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"9512cc8aa755b268e476a31512d2dfd747672aa37e2dc69f1adff165cf174dc9","category":"Environment"}