{"title":"สหรัฐฯ เริ่มทดลองวัคซีนไข้หวัดใหญ่แบบ mRNA ในคนเฟสแรก","link":"https://www.blognone.com/node/133869","date":1684301069000,"content":"<div><div><div><p>สถาบันโรคภูมิแพ้และโรคติดเชื้อสหรัฐฯ (National Institute of Allergy and Infectious Diseases - NIAID) ประกาศเริ่มทดลองวัคซีน H1ssF-3928 mRNA-LNP วัคซีนไข้หวัดใหญ่แบบ mRNA โดยที่ยังอยู่ในเฟสแรกแต่นับเป็นก้าวแรกของการใช้วัคซีนไข้หวัดใหญ่แบบ mRNA</p>\n<p>นอกเหนือจากการเปลี่ยนแพลตฟอร์มสำหรับวัคซีนแล้ว H1ssF-3928 ยังเปลี่ยนเป้าหมาย โดยไปจับกับโปรตีน hemagglutinin (HA) ของไวรัสที่ส่วนก้าน (stem) แทนที่ส่วนหัว ซี่งส่วนก้านนี้มีแนวโน้มที่จะเปลี่ยนแปลงน้อย ทำให้เป็นไปได้ว่าวัคซีนจะสามารถป้องกันไวรัสได้หลายสายพันธุ์ ไม่ต้องฉีดใหม่ทุกปีเช่นทุกวันนี้</p>\n<p>การทดลองเฟสแรกเป็นการทดลองหาโดสที่เหมาะสมเพื่อดูความปลอดภัย และความสามารถในการกระตุ้นภูมิให้กับผู้เข้าร่วมทดลองเท่านั้น ทำให้มีผู้เข้าร่วมเพียง 50 คนเท่านั้น 3 กลุ่มแรกกลุ่มละ 10 คนจะได้รับวัคซีน 10, 25, และ 50 ไมโครกรัมตามลำดับ จากนั้นนักวิจัยจะหาโดสที่เหมาะสมแล้วทดลองให้กับกลุ่มที่เหลือ โดยผู้เข้าร่วมอาจจะเป็นผู้รับวัคซีนไข้หวัดใหญ่เดิมก็ได้</p>\n<p>แม้ไข้หวัดใหญ่จะเป็นโรคที่มีมายาวนานแต่ก็ยังคงนับ<a href=\"https://ourworldindata.org/influenza-deaths\">เป็นโรคที่คร่าชีวิตผู้คนจำนวนมาก</a> ทั่วโลกมีผู้เสียชีวิตจากไข้หวัดใหญ่ 294,000 ถึง 518,000 คนต่อปีในช่วง  2002-2011 ในประเทศไทยเองเมื่อปี ​2011 ก็มีผู้เสียชีวิตจากไข้หวัดใหญ่มากกว่า 70 คนต่อประชากร 100,000 คนเมื่อปี 2011</p>\n<p>ที่มา - <a href=\"https://www.nih.gov/news-events/news-releases/clinical-trial-mrna-universal-influenza-vaccine-candidate-begins\">NIH</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/b3f2c90112a379a69177f93f352ebb12.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/vaccine\">Vaccine</a></div><div><a href=\"/topics/mrna\">mRNA</a></div><div><a href=\"/topics/medical\">Medical</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"951474ae11b847b72986692daef02b9113b64db785a17c633cec6a8fc0b66de3","category":"Thai"}