{"title":"Simulation of Drying‐Rewetting Processes in Numerical Groundwater Models Using a New Picard Iteration‐Based Method","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2022WR034334?af=R","date":1712232949000,"content":"<h2>Abstract</h2>\n<p>When simulating groundwater flow in unconfined and convertible aquifers using a groundwater model with the block-centered finite-difference approach, such as MODFLOW, it frequently encounters drying and rewetting of cells. Although many drying and rewetting simulation methods have been proposed in the past, balancing simulation accuracy and convergence capability all at once is difficult. MODFLOW-2005, which has second-order accuracy, employs a trial-and-error method, but it suffers from computational instability when large quantities of grid cells are dried. MODFLOW-NWT adopts the upstream-weighting approach and Newton iteration method to ensure the stability of the drying and rewetting simulations. However, the upstream-weighting approach has only first-order accuracy, and the Newton iteration method is complex to implement because it necessitates the establishment of an additional Jacobian matrix. The methods employed by MODFLOW-NWT are also available in MODFLOW 6, therefore it inherits both the strengths and weaknesses of MODFLOW-NWT. In this study, a new method, Picard iteration-based always active cell (PAAC), is proposed. Similar to MODFLOW-NWT, the PAAC method also uses dry cells as active cells. The PAAC method, however, does not use the upstream-weighting approach and has second-order accuracy. Moreover, it ensures good convergence stability even under the Picard iteration method. In addition to discussing the algorithm, five cases were used to comprehensively compare the simulation effects of the PAAC method with MODFLOW-2005 and MODFLOW-NWT, including an analytical solution, repeated drying-rewetting of multi-layer grids, pumping well problem, perched aquifer problem and a nearly dry single-layer grid, which verified the practicability of the PACC method.</p>","author":"Chuiyu Lu, \nWen Lu, \nQingyan Sun, \nXin He, \nLingjia Yan, \nTao Qin, \nChu Wu, \nShangqi Han, \nZhenjiang Wu, \nWeichen Wu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"951a196344944783f325d3e1e264dd29e1f1296547c0d8e46c982a256cc25b6b","category":"Environment"}