{"title":"Ron Amadeo’s Pixel Fold Lasted Four Days","link":"https://arstechnica.com/google/2023/06/rip-to-my-pixel-fold-dead-after-four-days/","date":1687828968000,"content":"\n<p>Ron Amadeo, writing for Ars Technica:</p>\n\n<blockquote>\n  <p>I didn’t do anything to deserve this. The phone sat on my desk\nwhile I wrote about it, and I would occasionally stop to poke the\nscreen, take a screenshot, or open and close it. It was never\ndropped or exposed to a significant amount of grit, nor had it\ngone through the years of normal wear and tear that phones are\nexpected to survive. This was the lightest possible usage of a\nphone, and it still broke.</p>\n\n<p>The flexible OLED screen died after four days. The bottom 10\npixels of the Pixel Fold went dead first, forming a white line of\n100 percent brightness pixels that blazed across the bottom of the\nscreen. The entire left half of the foldable display stopped\nresponding to touch, too, and an hour later, a white gradient\nstarted growing upward across the display. [...]</p>\n\n<p>Manufacturers keep wanting to brush off the significant durability\nissues of flexible OLED displays, thinking that if they just shove\nthe devices onto the market, everything will work out. That hasn’t\nbeen the case, though, and any time you see a foldable phone for\nsale, you don’t have to look far to see reports of dead displays.\nI’m sure we’ll see several reports of broken Pixel Folds once the\nunit hits the general public.</p>\n</blockquote>\n\n<p><a href=\"https://daringfireball.net/linked/2023/06/26/pixel-fold-review\">Earlier today</a> I described the market for foldables as a niche (people willing to spend nearly $2,000) within a niche (people willing to buy any phone that doesn’t support using a protective case) within a niche (people who want a foldable phone in the first place). But that’s within another level of niche: people who don’t care that foldables are relatively fragile.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/26/amadeo-pixel-fold\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9524bb0f630e22fa8f36cdd28942ff967587ace160a0744490f8700e62a4e588","category":"Tech"}