{"title":"Ustekinumab Biosimilars","link":"https://www.preprints.org/manuscript/202409.1999/v1","date":1727259260000,"content":"Ustekinumab is a fully human IgG1k monoclonal antibody that binds with high affinity and specificity to the p40 subunit of interleukins (IL-) 12 and 23, inhibiting their activity by preventing binding to their receptors. The European extension of the patent (Supplementary Protection Certificate) of ustekinumab expired on July 20, 2024. Biosimilar alternatives to ustekinumab are now an additional option for treating patients. The efficacy data for this drug in moderate-to-severe psoriasis, obtained both from clinical trials and indirect comparisons through meta-analyses, are superior to those of etanercept and adalimumab, and its safety profile is more favorable than that of tumor necrosis factor (TNF) inhibitors.\nSeveral ustekinumab biosimilars have already been approved by regulatory agencies: between October 2023 and July 2024, Wezlana速 (Amgen ABP 654), Uzpruvo速 (Alvotech AVT04) and Pyzchiva速 (Samsung/Bioepis SB17) have been approved by both the US Food and Drug Administration (FDA) and the European Medicines Agency (EMA). SteQeyma速 (Celltrion Healthcare CT-P43) has been approved by the EMA in August 2024. Several other potential biosimilar candidates are under development, including FYB202 (Formycon), BAT2206 (Bio-Thera), DMB-3115 (Dong-A ST), QX001S (Qyuns Therapeutic), BFI-751 (BioFactura), NeuLara (Neuclone), ONS3040 (Oncobiologics), and BOW090 (Epirus Biopharmaceuticals). In most cases, these monoclonal antibodies are expressed in cell lines (e.g. Chinese Hamster Ovary, CHO) different from those used for the originator (Sp2/0 spleen cell murine myeloma); of note, the cell line of origin is not a requirement for biosimilarity in the totality-of-evidence comparison exercise and may facilitate the production and reduce the immunogenicity of biosimilars originated in CHO cultures. \nThis narrative review will summarize the available data on characteristics of the full comparability exercises and comparative clinical trials of these drugs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"952765da997bff4c5880d4fa6ebfcdd42308ad55fbb39065ab0c121cd4dbddba","category":"Interdisciplinary"}