{"title":"Frontiers of Carbonate Clumped Isotope Thermometry","link":"https://www.annualreviews.org/content/journals/10.1146/annurev-earth-031621-085949?TRACK=RSS","date":1685491200000,"content":"<div><p>Carbonate minerals contain stable isotopes of carbon and oxygen with different masses whose abundances and bond arrangement are governed by thermodynamics. The clumped isotopic value Δ<span>i</span> is a measure of the temperature-dependent preference of heavy C and O isotopes to clump, or bond with or near each other, rather than with light isotopes in the carbonate phase. Carbonate clumped isotope thermometry uses Δ<span>i</span> values measured by mass spectrometry (Δ<span>47</span>, Δ<span>48</span>) or laser spectroscopy (Δ<span>638</span>) to reconstruct mineral growth temperature in surface and subsurface environments independent of parent water isotopic composition. Two decades of analytical and theoretical development have produced a mature temperature proxy that can estimate carbonate formation temperatures from 0.5 to 1,100°C, with up to 1–2°C external precision (2 standard error of the mean). Alteration of primary environmental temperatures by fluid-mediated and solid-state reactions and/or Δ<span>i</span> values that reflect nonequilibrium isotopic fractionations reveal diagenetic history and/or mineralization processes. Carbonate clumped isotope thermometry has contributed significantly to geological and biological sciences, and it is poised to advance understanding of Earth's climate system, crustal processes, and growth environments of carbonate minerals.\n</p><ul>\n<li><span>▪ \n</span>Clumped heavy isotopes in carbonate minerals record robust temperatures and fluid compositions of ancient Earth surface and subsurface environments.\n</li>\n<li><span>▪ \n</span>Mature analytical methods enable carbonate clumped Δ<span>47</span>, Δ<span>48</span>, and Δ<span>638</span> measurements to address diverse questions in geological and biological sciences.\n</li>\n<li><span>▪ \n</span>These methods are poised to advance marine and terrestrial paleoenvironment and paleoclimate, tectonics, deformation, hydrothermal, and mineralization studies.\n</li>\n</ul><p></p></div>","author":"Katharine W. Huntington and Sierra V. Petersen","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"952b791a3cb1a8a91d60b7386019ec27d10186a25e688fbd841751ba13114452","category":"Environment"}