{"title":"Bolivian River Dolphin trends: A long-term analysis in the Mamore basin","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308806","date":1728050400000,"content":"<p>by Luis A. Guizada Duran, Enzo Aliaga-Rossel, Mariana Paschoalini Frias, Alexandre N. Zerbini</p>\r\n\r\nSouth American river dolphins face significant threats from intense human activities, resulting in habitat loss, fragmentation of their natural connectivity, overfishing, pollution, and incidental and intentional catches for use as bait for fisheries. From 1998 to 2022, 12 surveys were conducted in a river system in the Mamore River (Ibare-Tijamuchi-Mamore) basin, one of the primary distribution areas of the Bolivian river dolphin (BRD ‐ <i>Inia geoffrensis boliviensis</i>). Generalized linear models (GLMs) were used to assess population trends. The most supported model does not definitively indicate a decline in population. The estimated mean annual rate of population change for BRDs over the 24-year monitoring period was -0.0115 per year. The average count of BRDs in the Ibare River is lower (mean = 20, n = 4) compared to the mean of Tijamuchi (mean = 260, n = 4), and the same pattern is observed with the Mamore River (mean = 76, n = 4). There is tentative visual evidence of negative trend for the count of BRD based on the GLM curves, but the statistics are still inconclusive to the sub-basin of the Mamore River. This study highlights the importance of continue with monitoring efforts on river dolphin populations. Similar population dynamics are observed in other river dolphin species in the Amazon region, requiring immediate actions to reduce mortality and reverse the concerning decreasing trend exhibited by these populations.","author":"Luis A. Guizada Duran","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"95348d8036aa03a31f370c9a96729da2d838df5585618c38610984de97d2f6c1","category":"Interdisciplinary"}