{"title":"Heart Analyzer v10 Brings New Dashboard and Watch App Experience with Enhanced Swift Charts","link":"https://www.macrumors.com/2023/04/19/heart-analyzer-v10-update-redesign/","date":1681900910000,"content":"<a href=\"https://www.helixapps.co.uk/heart-analyzer\">Heart Analyzer</a> this week reached version 10, bringing some major improvements and changes to the popular heart health app including a new dashboard experience, a refreshed Watch app, enhanced charts, and new tracking complications.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/heart-analyzer-10.jpg\" alt width=\"4050\" height=\"2716\" />\r<br />\nThe new Dashboard experience has been designed to let users switch days more easily and aims to offer clearer indications as to which day the user is looking at, while still offering a summary of heart rate and other Vital Health data for each day. In addition, Dashboard cards have all been refreshed, while for app Customization Premium users, the Health types can now be filtered and sorted based on personal preference.\r<br />\n\r<br />\nAnother change in version 10 is the renaming of \"Heart Home\" to \"Insights.\" Here users can view updated metrics and charts on various Vital Health types. There are trend comparisons for the past 30 days to the preceding 30 days, and the Heart Reports have been updated to use the new Swift Charts for more visually compelling and accurate displaying of Health data.\r<br />\n\r<br />\nThe adoption of Apple's Swift Charts framework in particular is a highlight of the app. As the developer explains in a <a href=\"https://www.helixapps.co.uk/blog/heart-analyzer-v10-release\">blog post</a>:\r<br />\n<blockquote>Up to now, Heart Analyzer has relied mostly on custom charts made to display Heart Rate summaries on your wrist, graph your recent heart rate in a complication and so much more. These charts were ground breaking at the time, but Swift Charts allows me to modernise the app with ever more precise and readable charts. \r<br />\n\r<br />\nIf you're running iOS 16 and WatchOS 9, you'll find these new charts throughout the app. With line, bar, area and range charts implemented across the app, visualizing your data has never been easier. For Blood Oxygen Saturation, Heart Rate Variability and Respiratory Rate Heart Analyzer now offers updated range charts. \r<br />\n\r<br />\nThese charts continue to indicate average values for the day, but the vertical bars now represent 10th and 90th percentiles of the data. Markers still also indicate the day's maximum and minimum values. These percentile bars offer better comparisons between day to day changes by ensuring spikes in the data have less effect on the overall picture.</blockquote>In addition to new charts, the Deep Analytics section of the app now includes new Health types. Cardio Fitness and Sleep Time averages are available to track over the past four years alongside updates to all the other types. The Custom Heart Rate Zones feature has also been updated and now allows users to track this zone on the Dashboard.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/04/heart-analyzer-10-watch.jpg\" alt width=\"1500\" height=\"760\" />\r<br />\nMeanwhile, over on the Heart Analyzer app for Apple Watch, a new app layout houses <a href=\"https://www.macrumors.com/roundup/watchos-9/\">watchOS 9</a>'s enhanced Swift Charts, which means that all charts can now be tapped to reveal additional detail. Complications have also been refreshed, and there's a new Recent HRV complication that works in conjunction with the new Apple Health AFib History feature and shows the last 12 hours of HRV data.\r<br />\n\r<br />\nThe new <a href=\"https://www.helixapps.co.uk/heart-analyzer\">Heart Analyzer v10</a> update is free for both non-paying and premium users with devices running <a href=\"https://www.macrumors.com/roundup/ios-16/\">iOS 16</a> and ‌watchOS 9‌. The app also continues to offer Premium features via one-time purchases with no subscriptions <a href=\"https://apps.apple.com/app/heart-analyzer-cardio-monitor/id1006420410\">via the App Store.</a><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/19/heart-analyzer-v10-update-redesign/\">Heart Analyzer v10 Brings New Dashboard and Watch App Experience with Enhanced Swift Charts</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/heart-analyzer-v10-brings-new-dashboard-and-watch-app-experience-with-enhanced-swift-charts.2387211/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9537273721766468e38f35debbcca2967a5d14804f69d6e6b3414c38b49224f3","category":"Apple"}