{"title":"The effects of CYP2B6 inactivators on the metabolism of ciprofol","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307995","date":1722261600000,"content":"<p>by Ming Lu, Xiaorui Zhang, Wenli Li, Xiangchen Li, Shan Li, Xiaoyu Yin, Zhiqing Zhang</p>\r\n\r\nCiprofol is a novel short-acting intravenous anaesthetic developed in China that is mainly metabolized by cytochrome P450 2B6 (CYP2B6) and uridine diphosphate glucuronosyltransferase 1A9 (UGT1A9). Currently, insufficient evidence is available to support drug‒drug interactions between ciprofol and CYP2B6 inactivators. Here, we established a high-performance liquid chromatography-tandem mass spectrometry (HPLC-MS/MS) method to assess the concentration of ciprofol and investigated the effects of psoralen and clopidogrel on the metabolism of ciprofol in liver microsomes and rats. In rat and human liver microsomes, the median inhibitory concentration (<i>IC</i><sub>50</sub>) values of psoralen were 63.31 μmol·L<sup>-1</sup> and 34.05 μmol·L<sup>-1</sup>, respectively, showing mild inhibitory effects on ciprofol metabolism, whereas the <i>IC</i><sub>50</sub> values of clopidogrel were 6.380 μmol·L<sup>-1</sup> and 2.565 μmol·L<sup>-1</sup>, respectively, with moderate inhibitory effects. SD rats were randomly divided into three groups: psoralen (27 mg·kg<sup>-1</sup>), clopidogrel (7.5 mg·kg<sup>-1</sup>), and the same volume of 0.5% carboxy methyl cellulose. After 7 days, all rats were injected with 2.4 mg·kg<sup>-1</sup> ciprofol. Compared with the control group, the AUC and MRT values of ciprofol in the psoralen and clopidogrel groups were significantly greater, whereas the CL values were significantly lower. In addition, the durations of loss of righting reflex (LORR) in the psoralen and clopidogrel groups were 16.1% and 23.0% longer than that in the control group, respectively. In conclusion, psoralen and clopidogrel inhibit ciprofol metabolism to different degrees and prolong the duration of LORR in rats.","author":"Ming Lu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"953750dcb3eaca7e52058c13fbe099d7ec97e1a301a40d0537886541dac37afb","category":"Interdisciplinary"}