{"title":"Sounds of the underground reflect soil biodiversity dynamics across a grassy woodland restoration chronosequence","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14738?af=R","date":1723780860000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/49a569a8-983d-4ce0-9003-99db2ab439da/jpe14738-toc-0001-m.png\" alt=\"Sounds of the underground reflect soil biodiversity dynamics across a grassy woodland restoration chronosequence\" />\n<p>Our results provide new support that ecoacoustics can help monitor soil biodiversity in different forest restoration contexts, including in UK temperate and Australian grassy woodlands. This technology holds promise in addressing the global need for effective soil biodiversity monitoring methods and protecting our planet's most diverse ecosystems.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nRestoring and monitoring soil biodiversity has never been more important. Ecoacoustics is emerging as a promising tool to detect and monitor soil biodiversity and was recently effective in a temperate forest context. However, there is a need to investigate the efficacy of soil ecoacoustics in other ecosystems and bioregions.\n\nHere, we applied ecoacoustics tools and indices (Acoustic Complexity Index, Bioacoustic Index, Normalised Difference Soundscape Index) to measure soil biodiversity in an Australian grassy woodland restoration chronosequence, spanning three age classes. We collected <i>n</i> = 240 soil acoustic samples from two cleared plots (continuously cleared through active management), two woodland plots undergoing restoration (revegetated 14–15 years ago) and two plots of remnant vegetation over 5 days in Mount Bold, South Australia. We used a below-ground sampling device and sound attenuation chamber to record soil invertebrate communities, which were also manually counted.\n\nWe found that acoustic complexity and diversity were significantly higher in revegetated and remnant plots than in cleared plots, both in-situ and in sound attenuation chambers. The acoustic complexity and diversity also significantly associated with soil invertebrate abundance and richness.\n\n<i>Synthesis and applications</i>. Our results provide new support that ecoacoustics can help monitor soil biodiversity in different forest restoration contexts, including in UK temperate and Australian grassy woodlands. This technology holds promise in addressing the global need for effective soil biodiversity monitoring methods and protecting our planet's most diverse ecosystems.\n</p>","author":"Jake M. Robinson, \nAlex Taylor, \nNicole Fickling, \nXin Sun, \nMartin F. Breed","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"954161927154ef5fe5c6e28126993e6d457257243633b35fcb293bb8994c6c0b","category":"Environment"}