{"title":"Jason Statham does what he does best in Operation Fortune: Ruse de guerre trailer","link":"https://arstechnica.com/?p=1819214","date":1639082143000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Director Guy Ritchie is back with the action comedy <em>Operation Fortune: Ruse de Guerre</em>, starring Jason Statham. </p></div>\n<p>Jason Statham is back doing what he does best—cracking heads while cracking wise as a badass globetrotting super spy—in a new trailer for director Guy Ritchie's latest comedy action film, <a href=\"https://en.wikipedia.org/wiki/Operation_Fortune:_Ruse_de_guerre\"><em>Operation Fortune: Ruse de guerre</em></a>.</p>\n<p>Ritchie made his name with early breakout hits <em>Lock, Stock and Two Smoking Barrels</em> (1998) and <em>Snatch</em> (2000), both showcasing his distinctively bold, quick-cutting style to best advantage. Those were also breakthrough films for Statham, who has since become one of the world's most bankable action stars. Alas, Ritchie hit a slump starting with 2002's <em>Swept Away</em>, starring then-wife Madonna, which bombed both critically and at the box office. (It has an aggregate 5 percent rating on Rotten Tomatoes and won five Golden Raspberry awards.)</p>\n<p>Fortunately, the director found his box office mojo again with 2009's <em>Sherlock Holmes</em> and the 2011 sequel, <em>A Game of Shadows</em>, as well as Disney's live-action <em>Aladdin</em> (2019), which grossed over $1 billion globally despite mixed reviews. And that classic Ritchie magic was back in full force by 2020's <em><a href=\"https://en.wikipedia.org/wiki/The_Gentlemen_(2019_film)\">The Gentlemen</a>,</em> which was released right before the COVID-19 pandemic forced a global lockdown. It nonetheless managed to gross a respectable $115 million worldwide against its $22 million budget.</p></div><p><a href=\"https://arstechnica.com/?p=1819214#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1819214&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9545f85f72409463a8cb14207632dd78e838a7b9145d7d2429bd49df74f335dd","category":"Tech"}