{"title":"Expectations of healthcare professionals of community-based telemedicine in emergency medical service","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310895","date":1726754400000,"content":"<p>by Elisabeth Klager, Anna Teufel, Magdalena Eitenberger, Nils Bukowski, Josef Michael Lintschinger, Valerie Manschein, Philipp Metelka, Harald Willschke, Eva Schaden, Christoph Frimmel, Reinhold Renner, Christina Hafner</p>\r\nBackground <p>In times of demographic change and an immense shortage of qualified personnel in emergency medical services, telemedicine could offer more efficient solutions for better care. Given the community-based nature of emergency services, local communities play an important role. This study explored the expectations of healthcare professionals and volunteers for telemedicine tools in prehospital emergency medicine.</p> Methods <p>This mixed-methods study was conducted in the rural region of Burgenland in Austria with stakeholders of the local emergency medical service in two focus groups (13 participants) and 99 quantitative questionnaires.</p> Results <p>Combining quantitative and qualitative data, we found that a majority of respondents (almost 80%) already experienced basic telemedicine and consider it valuable. In particular, there is a strong expectation for diagnostic support and inquiries related to potential hospitalization. Findings from two focus groups emphasized the importance of cultivating an improved learning culture, developing a specific mindset, and refining soft skills. The optimal telemedicine solution includes a knowledgeable and experienced tele-emergency physician coupled with user-friendly technology.</p> Conclusion <p>To be clear about the expectations of stakeholders, it is essential to involve all stakeholders right from the beginning. The solution should prioritize the integration of existing structures and be seamlessly incorporated into an evolving learning culture, while also fostering the necessary mindsets alongside educational aspects.</p>","author":"Elisabeth Klager","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9546a3f9fb2dc27d7fc2c05fdff10beae4b95b5ffc4152e8ecdd1a73a8eba9ad","category":"Interdisciplinary"}