{"title":"Unraveling the Complexity of Supply Chain Risk Management: Perspectives from Industry Experts","link":"https://www.preprints.org/manuscript/202406.0648/v1","date":1718081884000,"content":"Supply chain risk management (SCRM) is a critical aspect of contemporary business operations, necessitated by the complex and interconnected nature of global supply chains. This qualitative research delves into the intricacies of SCRM through in-depth interviews with industry experts, aiming to unravel the multifaceted nature of supply chain risks and the strategies employed for mitigation. Key themes emerged, including the diverse sources of risks encompassing operational, financial, environmental, and geopolitical factors, highlighting the need for a comprehensive approach to risk management. Challenges such as limited visibility, resource constraints, and organizational silos were identified, underscoring the importance of addressing these barriers to enhance SCRM effectiveness. Strategies for risk mitigation encompassed technological investments for enhanced visibility and predictive capabilities, collaboration and information sharing among supply chain partners, and the integration of sustainability principles into risk management practices. Leadership, organizational culture, and continuous learning emerged as critical factors in driving effective SCRM practices, emphasizing the need for proactive and adaptable approaches to navigate evolving risks. Overall, this study contributes to the existing body of knowledge on SCRM by providing valuable insights for practitioners and academics, and underscores the importance of holistic and proactive approaches to enhance supply chain resilience and agility in today's dynamic business environment.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"954fd64e9a73bf9b52429389f07b8237a7096783cc0eb5ef96f98d0f3638f105","category":"Interdisciplinary"}