{"title":"Uppermost global tree elevations are primarily limited by low temperature or insufficient moisture","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17260?af=R","date":1712041200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3c3b7a9d-8c92-4e55-8e3e-62f965f3f036/gcb17260-toc-0001-m.png\" alt=\"Uppermost global tree elevations are primarily limited by low temperature or insufficient moisture\" />\n<p>Based on a comprehensive quasi-observational dataset of global uppermost tree distribution, this study established the mean growing-season temperature at 6.6 ± 0.3°C as the universal thermal potential threshold for global alpine treelines, built an indicator ΔH which was elevational deviation of the actual treeline from the potential threshold to measure the asynchrony of treeline shifts and global warming. This study found that moisture and mountain elevation effect predominantly contribute to the ΔH at the global scale. Drought conditions constitute the primary driver of ΔH in 51% of cases at regional scale, followed by mountain elevation effect which indicates surface heat (27%).</p>\n<br />\n<h2>Abstract</h2>\n<p>The impact of anthropogenic global warming has induced significant upward dispersal of trees to higher elevations at alpine treelines. Assessing vertical deviation from current uppermost tree distributions to potential treeline positions is crucial for understanding ecosystem responses to evolving global climate. However, due to data resolution constraints and research scale limitation, comprehending the global pattern of alpine treeline elevations and driving factors remains challenging. This study constructed a comprehensive quasi-observational dataset of uppermost tree distribution across global mountains using Google Earth imagery. Validating the isotherm of mean growing-season air temperature at 6.6 ± 0.3°C as the global indicator of thermal treeline, we found that around two-thirds of uppermost tree distribution records significantly deviated from it. Drought conditions constitute the primary driver in 51% of cases, followed by mountain elevation effect which indicates surface heat (27%). Our analyses underscore the multifaceted determinants of global patterns of alpine treeline, explaining divergent treeline responses to climate warming. Moisture, along with temperature and disturbance, plays the most fundamental roles in understanding global variation of alpine treeline elevation and forecasting alpine treeline response to ongoing global warming.</p>","author":"Yuyang Xie, \nZehao Shen, \nTao Wang, \nGeorge P. Malanson, \nJosep Peñuelas, \nXiaoyi Wang, \nXiangwu Chen, \nEryuan Liang, \nHongyan Liu, \nMingzheng Yang, \nLingxiao Ying, \nFu Zhao, \nShilong Piao","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"9555120368014f5063836574c4589610df11cda69a691428c564e30486a80efb","category":"Environment"}