{"title":"PSIII-5 Characteristics of in-vitro digestibility of forage selected by cattle supplemented with crude glycerin while grazing wheat pasture","link":"https://academic.oup.com/jas/article/102/Supplement_3/496/7757772?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Ruminally cannulated mix-breed cows (n = 9) were used in a split-plot design with the objective of evaluating the effects of crude glycerin supplementation on in-vitro rate of digestibility. Treatments were unsupplemented control (CON); and crude glycerin supplementation [SUP; 37.2% glycerin, dry matter (DM) basis] fed at 5% of expected forage intake (2.2% of BW). The wheat maturity stages occurred between mid-March (MAR) and early April (APR) representing the vegetative and early reproductive stage, respectively. Cows grazed in a single wheat pasture with supplements offered at 0700 and 1900 h daily. Each stage consisted of 13 d of adaptation to wheat pasture and SUP. On d 14 at 1200 h, cows were ruminally evacuated and allowed to graze for 60 min. Subsequently, grazed material obtained directly from the rumen via rumen cannula was incubated for 0, 3, 6, 12, 24, and 36 h in a Daisy incubator to estimate rate of in-vitro digestibility. Rate of digestibility was estimated using a non-linear regression of digestibility vs. time of incubation. A supplement × forage maturity interaction (<span>P</span> = 0.05) for in-vitro DM digestibility was detected. During MAR, in-vitro DM digestibility of forage was greater (<span>P</span> = 0.01) for masticates of SUP compared with CON fed cows (53.3 and 49.2 ± 1.97). However, during APR, in-vitro DM digestibility of forage was not affected (<span>P</span> = 0.86) by supplementation (42.7 and 44.8 ± 1.97). Rate of in-vitro DM digestibility of forage was greater (<span>P</span> = 0.04) for SUP than CON cows (2.43 and 4.53 ± 0.667). In-vitro digestibility and rate of digestibility of forage NDF were not affected by crude glycerin supplementation (<span>P</span> ≥ 0.13) or forage stage of maturity (<span>P</span> ≥ 0.10). Results indicate that crude glycerin can be added to supplement of cattle grazing wheat pasture to increase energy intake without negative impacts on characteristics of in-vitro digestibility, especially when introduced during the initial phase of wheat pasture maturity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"955bba5601c9af71dfefbb9d52bbb119fe8c781f192e14b8549184b6de75e63b","category":"Environment"}