{"title":"Beyond the Wedge: Impact of Tidal Streams on Salinization of Groundwater in a Coastal Aquifer Stressed by Pumping and Sea‐Level Rise","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035840?af=R","date":1727438699000,"content":"<h2>Abstract</h2>\n<p>Saltwater intrusion (SWI) is a well-studied phenomenon that threatens the freshwater supplies of coastal communities around the world. The development and advancement of numerical models has led to improved assessment of the risk of salinization. However, these studies often fail to include the impact of surface waters as potential sources of aquifer salinity and how they may impact SWI. Based on field-collected data, we developed a regional, variable-density groundwater model using SEAWAT for east Dover, Delaware. In this location, major users of groundwater from the surficial aquifer are the City of Dover and irrigation for agriculture. Our model includes salinized marshland and tidal streams, along with irrigation and municipal pumping wells. Model scenarios were run for 100 years and included changes in pumping rates and sea-level rise (SLR). We examined how these drivers of SWI affect the extent and location of salinization in the surficial aquifer by evaluating differences in chloride concentration near surface waters and the subsurface freshwater-saltwater interface. We found the presence of the marsh inverts the typical freshwater-saltwater wedge interface and that the edge of the interface did not migrate farther inland. Additionally, we found that tidal streams are the dominant pathways of SWI at our site with salinization from streams being exacerbated by SLR. Our results also show that spatial distribution of pumping affects both the magnitude and extent of salinization, with an increase in concentrated pumping leading to more intensive salinization than a more widely distributed increase of the same total pumping volume.</p>","author":"M. C. Hingst, \nR. M. Housego, \nC. He, \nB. J. Minsley, \nL. B. Ball, \nH. A. Michael","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"955feb529e66dd45a39b4aba7eab170ec3cf91d6cb8b13b30f0f242759e048db","category":"Environment"}