{"title":"Effects of functional training on tennis-specific physical fitness and functional movement screen in junior tennis players","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310620","date":1726754400000,"content":"<p>by Wensheng Xiao, Xiaorong Bai, Kim Geok Soh, Yang Zhang</p>\r\nObjectives <p>Functional training mimics the coordinated motions of multiple muscle groups and joints performed during exercise. The purpose of this study was to compare the effects of a 12-week functional training and traditional resistance training on the performance in junior tennis players.</p> Methods <p>Trained tennis players (mean age: 16.6 years) were assigned to a traditional training group (n = 20) or functional training group (n = 20). The traditional training group received a resistance training program by their coach, while the functional training group was given Santana’s Racket Sport Program. At baseline, after six weeks, and after 12 weeks (T12), the participants’ tennis-specific physical fitness and functional movement screen (FMS) were evaluated.</p> Results <p>At T12, both training improved the values for multistage fitness test, hexagon test, planned agility test, sit and reach, and 20 metre sprint (<i>p</i> &lt; 0.05); except the flexibility, functional training provided no additional advantages. At T12, functional training enhanced (<i>p</i> &lt; 0.01) all seven components of the FMS, and there is a 100% probability that the total score of the FMS would be enhanced. In contrast, for the traditional training group, shoulder mobility of the FMS decreased (<i>p</i> = 0.03), and there was no changes in other FMS components at T12.</p> Conclusions <p>Functional training is not only effective in improving tennis-specific physical fitness, but it also provides greater functional movement advantages for junior tennis players compared to traditional resistance training.</p>","author":"Wensheng Xiao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9564794b45c5f3ebd07eb0fc649aae06ad40063b1f032c3a529fecec062e2a7d","category":"Interdisciplinary"}