{"title":"Atomic Electron Tomography for Multi-Dimensional Data","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.889/7720202?rss=1","date":1721779200000,"content":"<span>By employing the quasi-linear nature of annular dark-field scanning transmission electron microscopy (ADF-STEM) image contrast, 3D tomograms can be reconstructed through the Fourier slice theorem or equivalent linear formulations. With atomic-scale resolution ADF-STEM images achieved using aberration correctors, atomic electron tomography (AET) has been demonstrated, offering quantitative three-dimensional structural information of nanomaterials by determining the 3D atomic coordinates with sub-Angstrom precision [<a href=\"#ozae044.889-B1\">1-15</a>]. Utilizing these 3D atomic coordinates enables direct calculation of 3D polarization vector fields from the relative displacement of cation atoms, providing multi-dimensional vector field maps. This multi-dimensional data reveals polar topological textures (fractional Skyrmions, Bloch points, etc.) for general ferroelectric nanostructures even without epitaxial strain, consistent with theoretical predictions [<a href=\"#ozae044.889-B15\">15</a>]. Additionally, we recently proposed the use of tilt series based on the 4D-STEM scheme (referring to 2D diffraction images of a converged electron beam at each point in a 2D STEM raster [<a href=\"#ozae044.889-B16\">16-18</a>]) for AET reconstructions. This approach allows for the reconstruction of atomic resolution tomograms without relying on linearity assumptions, using a multislice-based 3D reconstruction approach. Our simulations confirmed that the multislice-based approach effectively reduces undesirable artifacts arising from nonlinear contrast, increases sensitivity for light elements, and reduces electron dose requirements [<a href=\"#ozae044.889-B16\">16</a>, <a href=\"#ozae044.889-B19\">19</a>].</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"956d355929d2794a9063411d1b231a943ac4bbcfdb0e08f53a98f3b0653f92f2","category":"Environment"}