{"title":"Population structure and genetic connectivity of the big blue octopus Octopus cyanea in the Ryukyu Archipelago, Japan","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4153?af=R","date":1716358736000,"content":"<h2>Abstract</h2>\n<p>Octopuses are an important fishery resource in the Ryukyu Archipelago, Japan, and <i>Octopus cyanea</i> is an important fishery resource in this region. Although a gradual downward trend in catches of <i>O. cyanea</i> in the Ryukyu Archipelago has been reported, no study has focused on the connectivity and genetic structure, which are important parameters for conservation strategies. We used partial sequences of mitochondrial COI and MIG-seq, which can efficiently obtain single nucleotide polymorphism (SNPs) to evaluate genetic diversity and patterns of gene flow among three populations of <i>O. cyanea</i> in the Ryukyu Archipelago. We combined population genetic analyses with biophysical approaches to understand larval dispersal patterns and the regional connectivity. Although there was a tendency for the Yaeyama population to become isolated from the Okinawa-jima populations, high genetic diversity was maintained overall, indicating frequent genetic exchange between populations. Population genetic analyses combined with larval dispersal simulations revealed that the contemporary migration of <i>O. cyanea</i> is asymmetric patterns among the three populations, suggesting that western coast of Okinawa-jima Island functions as a source population among the three populations we examined. The potential implications of this study on the conservation management of <i>O. cyanea</i> were discussed, namely that future population assessment approaches are needed to include western coast of Okinawa-jima populations. In addition, this study indicates that at least two different management units should be considered. This study is the first population genetic study of <i>O. cyanea</i> in the Ryukyu Archipelago and provides fundamental information on the genetic population structure of this species in this region.</p>","author":"Hiroki Kise, \nNaoki Saito, \nKodai Gibu, \nMasaki Asato, \nTomohiro Kita, \nKenta Matsuzaki, \nAkira Iguchi","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"956f7b208bfed1c58ad2ee94acc50139a37442adca1c3c065e986fd62d4d67b6","category":"Environment"}