{"title":"Inhibitors of Soluble Epoxide Hydrolase and cGAS-STING Pathway Repair the Defects in Macrophage Clearance of Amyloid-&beta; Underlying Vascular Complications of Alzheimer&rsquo;s Disease Patients","link":"https://www.preprints.org/manuscript/202405.1741/v1","date":1716807654000,"content":"Alzheimer’s disease (AD) and the therapies of AD with anti-amyloid1-42 (Aβ) monoclonal antibodies are associated with the vascular complications of brain edema, hemorrhage, and cerebral amyloid angiopathy (CAA) termed amyloid-related imaging abnormalities (ARIAs). The neuropathology of normal and AD brains demonstrates that monocyte/macrophages (MMs) are critical in successful brain clearance in healthy brain by up-loading, transporting, and degrading Aβ but fail degradation and clearance in AD patients by releasing Aβ into vessels at the blood-brain barrier, causing vasculitis and ARIAs. The naturally-formed epoxides (EpFAs) of polyunsaturated fatty acids (PUFA’s), including arachidonic, docosahexaenoic, and eicosapentaenoic fatty acids, may repair degradation of Aβ by regulating Aβ-degrading enzymes, inflammatory cytokines, and unfolded protein response (UPR) to endoplasmic reticulum stress in a homeostatic fashion. EpFAs are, however, degraded by the soluble epoxide hydrolase enzyme (sEH) but are protected by the sEH inhibitor (sEHI) TPPU. In the cultures of AD patients’ macrophages, TPPU with the epoxide EEQ, and the cGAS/STING inhibitor H-151 increased uptake of Aβ at 2 hours and degradation of Aβ at 24 hours. In conclusion, the soluble epoxide hydrolase inhibitor TPPU with omega-3 fatty acids and the cGAS/STING inhibitor H-151 increase Aβ uptake and degradation in macrophages of AD patients, and potentially enhancing Aβ clearance in the AD brain.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9576e62a67a2cc1255bf44c48ed258115333b1e1f12c03ef9010b4063c4ba881","category":"Interdisciplinary"}