{"title":"Exploring Aluminum Tolerance Mechanisms in Crops: A Comprehensive Review of Genetic, Metabolic, and Physiological Adaptations in Acidic Soils","link":"https://www.preprints.org/manuscript/202405.1524/v1","date":1716459909000,"content":"Aluminum (Al), making up a third of the Earth's crust, is a widespread toxic contaminant, particularly in acidic soils. It impacts crops at multiple levels, from the cellular to the whole plant. This review delves into aluminum's reactivity, including its cellular transport, involvement in oxidative redox reactions, development of specific metabolites, and the influence of genes on the production of membrane channels and transporters, as well as its role in triggering apoptosis leading to senescence. It discusses the involvement of channel proteins in calcium influx, vacuolar proton pumping, the suppression of mitochondrial respiration, and the initiation of programmed cell death. At the cellular nucleus level, the effects of Al on gene regulation through alterations in nucleic acid modifications, such as methylation and histone acetylation, are examined. The review in addition outlines the pathways of Al induced metabolic disruption specifically citric acid metabolism, regulation of proton excretion, induction of specific transcription factors, modulation of Al-responsive proteins, changes of citrate and nucleotide glucose transporters and overall metal detoxification pathways in tolerant genotypes. It also considers the expression of phenolic oxidases in response to oxidative stress, their regulatory feedback on mitochondrial cytochrome proteins, and their consequences on root development. Ultimately, the review focuses on the selective metabolic pathways that facilitate Al exclusion and tolerance, emphasizing compartmentalization, antioxidative defense mechanisms, and the control of programmed cell death to manage metal toxicity.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9578436d68444ea309dfd0c9dd04b31c5858f3c0c297f5faafb1f0466b50ecfd","category":"Interdisciplinary"}