{"title":"A Happy Medium: Cedaero Fork Lift Pack Review – Hailey Moore","link":"https://theradavist.com/cedaero-fork-lift-pack-review/","date":1705663893000,"content":"<p><em>In this review of the <a href=\"https://cedaero.com/products/fopoon-fork-pack?_pos=1&amp;_psq=fork&amp;_ss=e&amp;_v=1.0\" target=\"_blank\">Cedaero Fork Lift Pack</a>, <a href=\"https://theradavist.com/tag/hailey-moore/\" target=\"_blank\">Hailey Moore</a> writes about the benefits of hybridizing traditional touring setups with more streamlined bikepacking products, and assesses how Cedaero’s additon to today’s fork bag offerings faired in wet weather this past summer in Colorado.<span></span></em></p>\n<p>The full suite of soft-mount bike bags that have become available in the last decade (and change) has undeniably progressed the sport of bikepacking, and travel-by-bike at large, as compared to a more classic, hardware-dependent, touring setup. But I have to say, I’ve been glad to see the trend pendulum swinging back a bit: if a front/rear rack four-pannier setup anchors one end of the spectrum, than you might mark the other end with the two-foot-long ass-rocket saddle bag that has insisted on characterizing the bikepacking aesthetic in more recent years. With a long list of brands now offering “mini” and “micro” panniers and paired-down fork-blade bags—<a href=\"https://theradavist.com/tailfin-aeropack-mini-panniers-long-term-review/\" target=\"_blank\">Tailfin</a>, <a href=\"https://theradavist.com/revelate-nano-panniers-review/\" target=\"_blank\">Revelate</a>, Swift Industries (forthcoming in 2024), <a href=\"https://theradavist.com/san-util-mini-and-light-weight-panniers-review/\" target=\"_blank\">San Util</a>, Andrew the Maker, Oveja Negra, and others—it seems that we’re honing in on a more balanced approach to how we carry our gear over long distances. The Minnesota company, Cedaero, launched their Fork Lift Pack earlier this year, another product that seems to be steering us towards a happy medium for loaded riding.</p>\n<p><img loading=\"lazy\" width=\"2000\" height=\"1333\" src=\"https://media.theradavist.com/uploads/2024/01/Cedaro-4.jpeg?fit=1200,1333&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/Cedaro-4.jpeg?w=2000&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/Cedaro-4.jpeg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/Cedaro-4.jpeg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/Cedaro-4.jpeg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Debuted at this year’s <a href=\"https://theradavist.com/sea-otter-classic-2023-recap-part-three-bikes-products-people-photo-gallery/\" target=\"_blank\">Sea Otter event</a>, the Cedaero Fork Lift Pack is a slightly tapered, tombstone-shaped bag designed to mount to a fork blade via <a href=\"https://kingcage.com/products/many-things-cage?variant=43914129572082\" target=\"_blank\">King Cage’s Manything Cage</a>. It is available in two materials and features an integrated, semi-rigid plastic sheet to maintain the pack’s shape. Here’s the quick hits about this product:</p>\n<h3>Quick Hits</h3>\n<p>•*$89.95 per Pack; $179.90 for a pair<br />\n•Designed for compatibility with the King Cage Manything Cage ($60 per cage, for solid ti tube option; $66 for hollow-tube version)<br />\n•1000D Cordura Nylon or 15oz Martexin Waxed Canvas Exterior<br />\n•210D Nylon Liner<br />\n•#9 Ideal Coil Zipper with Nanosphere DWR coating<br />\n•Hypalon attachment sleeve<br />\n•12″ x 4.5″ x 3.5″<br />\n•3.3 liter capacity<br />\n•Weight: 9 oz each Waxed Canvas (18 oz per pair); 7 oz each Cordura (14 oz per pair)<br />\n•100% Made in USA</p>\n<p><img loading=\"lazy\" width=\"1365\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/01/DSC02938.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC02938.jpg?w=1365&amp;quality=75 1365w, https://media.theradavist.com/uploads/2024/01/DSC02938.jpg?resize=1200,1800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC02938.jpg?resize=768,1152&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC02938.jpg?resize=1024,1536&amp;quality=75 1024w\" /><img loading=\"lazy\" width=\"1365\" height=\"2048\" src=\"https://media.theradavist.com/uploads/2024/01/DSC02931.jpg?fit=1200,2048&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC02931.jpg?w=1365&amp;quality=75 1365w, https://media.theradavist.com/uploads/2024/01/DSC02931.jpg?resize=1200,1800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC02931.jpg?resize=768,1152&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC02931.jpg?resize=1024,1536&amp;quality=75 1024w\" /></p>\n<h3>Setup</h3>\n<p>There’s not much to setting up the Fork Lift Pack, assuming that your fork has mounting points (but if it doesn’t you’re in <a href=\"https://theradavist.com/old-man-mountain-axle-pack-first-ride-review/\" target=\"_blank\">luck</a>). Simply bolt on a King Cage Manything cage on each blade then slip the Fork Lift’s hypalon sleeve over the rounded top of the cage. The packs are further secured by threading the two nylon-webbing buckle straps around the bottom of the cage before clipping the buckles. Tighten to adjust and—voilà! After a five-minute setup, you’re good to go.</p>\n<p>I call attention to the simplicity of the setup because I think Cedaero did themselves a favor by purposefully designing the Fork Lift around a single cargo cage option, rather than trying to create a design that is compatible across cages, or—worse yet—go the direct-mount route. Personally, I prefer the flat shape of the Manything Cage for mounting fork bags, vs curved and more striated variations (like the Salsa Cargo Anything and Widefoot cages) which feel tedious to thread straps through, and don’t always nest perfectly against the bag in question. Alternatively, I’ve also used the <a href=\"https://www.ovejanegrabikepacking.com/collections/fork-accessory/products/bootlegger-fork-bag\" target=\"_blank\">Oveja Negra Bootlegger</a> fork bags, and—while I’m the proud owner of many Oveja products—I’ve almost always given up in despair while trying to screw the bolts on inside the black hole of the Bootleggers. In the case of fork packs, I think design specificity overrides widespread compatibility.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1365\" src=\"https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?fit=1200,1365&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC02932.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>Design</h3>\n<p>For this review, I opted for the slightly heavier waxed canvas Fork Lift Packs (because: style) and took them on a few tours in the Colorado high country this summer. Upon receiving the bags, I thought they had a delightfully tidy shape and appearance, thanks to the two-tone paneling, classy Cedaero branding, and the semi-rigid shape of the packs. They look a bit like a hybrid between the Bootlegger and my favorite fork packs on the market, Andrew the Maker’s updated<a href=\"https://www.andrewthemaker.com/shop/many-things-sack\" target=\"_blank\"> Many Things Sack v1.2</a>. Notably, at 3.3 L each, the Fork Lift Pack is over 50% larger than the Bootlegger (2 L) and, while Andrew the Maker doesn’t include capacity in his specs list, the dimensions for the Many Thing Sack is similar to that of the Fork Pack.</p>\n<p>One key difference between the Fork Pack and the aforementioned products is the two-thirds zippered opening on the face of the pack—all of the similar options I’ve seen have had reach-in openings only.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1365\" src=\"https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?fit=1200,1365&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC02922.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>In Use</h3>\n<p>At the beginning of this review, I referred—a bit cheekily—to the unsightly protrusions that have taken up residence on the back of many saddles of bikepacking bikes. Aside from my personal aversion to the extended saddle bag look, <em>functionally</em> I’ve often seen them miss the mark. I just think it’s really tough to maintain tension on a bag that sits so high and is prone to absorbing the back-and-forth rocking of the bike when riding out of the saddle, or is getting bounced around when descending rough terrain. It’s also been my experience that a bike handles better when you can keep the weight in the center (frame bag) or as low as possible. Still, I’ve personally experienced carrying capacity limitations while out touring, which is why I’ve been especially glad to see the resurgence of hardware-supported panniers and fork packs, but streamlined for a more light-and-fast-approach.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1365\" src=\"https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?fit=1200,1365&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC02934.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>In loading up the Fork Packs, I found the tapered shape best suited for extra layers, though a small thermos, stove, and/or food would also stow well here. Cedaero, and other makers of analogous products, suggests using the Fork Pack(s) to carry an extra Nalgene bottle. I’m not totally sold on this use case. Yes, a one-liter Nalgene does fit in the Fork Lift Pack, with room to spare for something about the size of a grapefruit. But, to my mind, if I don’t need that extra half-liter of space, and I want to carry water on the fork blades, I’d much prefer to <em>just</em> carry water on the fork blades. I don’t think that taking up some 70% of the Fork Lift’s capacity with a non-compressible Nalgene is the best use of space and the extra weight inherent to running the packs themselves, which to reiterate—empty—add 9 oz per fork blade. Again, if I can make do without that little bit of additional space, I’d much rather just double Voilé strap a couple of Nalgenes to a cargo cage and be on my way. Alternatively, I have often used a soft-sided one or two-liter, screw-top bladder to carry extra water, stashing it in my frame bag then refilling a bike bottle, or two, on the frame when necessary. That way, the volume of space required to carry the extra water is, errr, more fluid and the bladder can all but disappear when it’s not in use. However, if you do choose to carry a Nalgene, stove, or similarly weighty item(s) in the Fork Lift Pack(s), I would advise filling the extra space around said item, as heavier cargo will want to jostle around (especially a Nalgene as the plastic easily slides against the nylon liner).</p>\n<p>Given that my test-riding with the Fork Lift Packs was never more than a half-day’s ride from the next resupply—and water is actually pretty abundant in the Colorado high country—I primarily used them to carry layers, food, and repair items. In early June of last year, I set out solo for my first trip with the packs, on an ambitiously early alpine tour. Unless the forecast seems unequivocal—or I’ll be out for more than a couple days, or in more remote stretches like on the Colorado Trail—it’s very rare that I carry rain pants in the summer in Colorado. Sure, we have the passing afternoon storms of monsoon season, but in the past five years I’ve been touring in the summer, I’ve only really been drenched a scant handful of times. But summer came late this year, so I ensured my over-eager motivation to get into the mountains by carrying the full rain suit (plus some REI waterproof overmittens), along with top and bottom down layers, in the Fork Lift Packs and set out to tag some passes from Leadville.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1365\" src=\"https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?fit=1200,1365&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC03552.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<p>Aside from being exceptionally glad that I brought all my waterproof layers, I was impressed with the waxed canvas’s water-resistant nature after getting bouted by a few downpours during the trip. I also encountered quite a bit of mud one night that thoroughly clogged my drivetrain and caked the frame. At breakfast in the town of Basalt the next morning, I noticed an automatic sprinkler system going across the street and rolled the bike over for a quick pressure wash. The Fork Lift Packs took some pretty targeted and direct hits during that process, but the DWR-coated zipper and waxed canvas exterior held fast. I also didn’t notice any seepage through the face fabric and nylon liner after riding for over an hour in the rain while descending Independence Pass—even with cars passing and sending extra spray my way. On the product page, Cedaero notes that the waxed canvas finish may require re-waxing after extended use but I reckon it would take a season or two (depending on your local climate) to get to that stage with the bags.</p>\n<p>While riding with the load described above, I found the bags to be rock solid. There’s really not much more to say; I never noticed any wiggle or loosening of the bags, even after chundery descents. They just seem to be pretty bombproof. When getting in and out of the bags, I had mixed feelings about the outward-facing opening; on the one hand, it was nice to be able to see everything inside, rather than root around somewhat blindly as is the case with fork bags with narrow-mouthed top closures. On the other hand, opening the bag sometimes resulted in lighter objects stacked in the top half to want to fall out. And, it did require some diligence to not snag a jacket’s stuff sack in the bag’s zipper when closing everything up. Still, by my estimation these are pretty minor nitpicks.</p>\n<p><img loading=\"lazy\" width=\"2048\" height=\"1365\" src=\"https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?fit=1200,1365&amp;quality=75\" srcset=\"https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?w=2048&amp;quality=75 2048w, https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?resize=1200,800&amp;quality=75 1200w, https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?resize=2000,1333&amp;quality=75 2000w, https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?resize=768,512&amp;quality=75 768w, https://media.theradavist.com/uploads/2024/01/DSC03544.jpg?resize=1536,1024&amp;quality=75 1536w\" /></p>\n<h3>TL;DR</h3>\n<p>In closing, I found the Fork Pack to be a completely satisfactory system for adding (or distributing) storage on a bikepacking or touring setup. For the capacity, the Fork Pack is comparably priced to other, similar, MUSA products. The waxed canvas edition exceeded my expectations—in both style and performance—while the base design itself adds something to this product space in the outward-facing opening. Finally, it bridges the best of both worlds—classic bike touring and modern ultra-racing—in a product with wide-ranging applications.</p>\n<h3>Pros</h3>\n<ul>\n<li>Water resistant</li>\n<li>Goldilocks capacity at 3.3 L each helps better distribute weight across bike</li>\n<li>Repairable by Cedaero</li>\n<li>1000D Cordura version is machine washable</li>\n</ul>\n<h3>Cons</h3>\n<ul>\n<li>A bit heavy</li>\n<li>Capacity cannot be cinched down like roll-top fork bags</li>\n</ul>\n<p>The post <a href=\"https://theradavist.com/cedaero-fork-lift-pack-review/\">A Happy Medium: Cedaero Fork Lift Pack Review</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"Hailey Moore","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"957d7da05acba48da7b61cdc6f98dd99daedd463871aabe5bb7c0c76156f84f4","category":"Cycling"}