{"title":"Bezos อาสาออกเงิน 2 พันล้านดอลลาร์ให้ NASA ถ้าเลือก Blue Origin ทำยานลงจอดดวงจันทร์","link":"https://www.blognone.com/node/123904","date":1627354302000,"content":"<div><div><div><p>หลังจาก <a href=\"https://www.blognone.com/node/123579\">Jeff Bezos เกษียณตัวเองจาก Amazon หันมาทำ Blue Origin เต็มตัว</a> เราก็เห็นข่าวอย่างต่อเนื่อง (ทั้งหมดยังไม่พ้นเดือนแรกหลังเกษียณด้วยซ้ำ) เริ่มจาก<a href=\"https://www.blognone.com/node/123805\">การนั่งจรวดขึ้นอวกาศความสูงระดับ 10 กิโลเมตร</a> ที่เป็นข่าวไปแล้วทั่วโลก</p>\n<p>ล่าสุด Bezos เขียนจดหมายเปิดผนึกถึง NASA อาสาจ่ายเงิน 2 พันล้านดอลลาร์ ให้โครงการ Human Landing System (HLS) พัฒนายานอวกาศไปดวงจันทร์รอบใหม่ ที่ถูกรัฐบาลสหรัฐตัดงบประมาณลง</p>\n<p>ท่าทีของ Bezos ต้องย้อนกลับไปดูข่าว <a href=\"https://www.blognone.com/node/122216\">NASA เลือก SpaceX เป็นบริษัททำยานลงจอดดวงจันทร์ในโครงการ HLS</a> เมื่อเดือนเมษายนที่ผ่านมา โดย Blue Origin เข้าแข่งขันด้วยแต่ไม่ได้รับเลือก</p>\n<p>Bezos อธิบายว่าเดิมที NASA จะคัดเลือกแปลนจาก 2 บริษัท ให้ทุนทั้งสองฝ่ายเพื่อมาแข่งขันหาดีไซน์ที่ดีที่สุด แต่รอบนี้ NASA เลือก SpaceX เพียงรายเดียว ด้วยเหตุผลว่าไม่มีงบ ซึ่งจะส่งผลเสียต่ออุตสาหกรรมอวกาศของอเมริกา เพราะ SpaceX ได้ผูกขาดโครงการอยู่รายเดียว ชิ้นส่วนอื่นๆ ต้องล็อคสเปกตามแปลนของ SpaceX ไม่เกิดการแข่งขันในระยะยาว</p>\n<p>Blue Origin จึงอาสาแก้ปัญหาให้ NASA โดยงดเว้นการเรียกเก็บเงินจาก NASA (หาก Blue Origin ได้รับเลือกให้ทำโครงการต่อ ขนานไปกับ SpaceX) มูลค่า 2 พันล้านดอลลาร์ใน 3 ปีงบประมาณ และยินดีออกทุนเอง เพื่อยิงจรวดทดสอบระบบลงจอดบนดวงจันทร์ (ในวงโคจรต่ำของโลก) เพิ่มเองเพื่อลดความเสี่ยงของโครงการ NASA ลงด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/e989d30278804d788ed4b6db9dd26c5d.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.blueorigin.com/news/open-letter-to-administrator-nelson\">Blue Origin</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/blue-origin\">Blue Origin</a></div><div><a href=\"/topics/nasa\">NASA</a></div><div><a href=\"/topics/spacex\">SpaceX</a></div><div><a href=\"/topics/jeff-bezos\">Jeff Bezos</a></div><div><a href=\"/topics/space\">Space</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"95808ee1dd6eedd4e64b7dee350f04e54ee919fa4c4d3470383b0c267e0272fa","category":"Thai"}