{"title":"Improving Self-Efficacy, Quality of Life and Glycemic Control in Adolescents with Type 1 Diabetes: An Experimental Evaluation of the Family Centered Empowerment Model","link":"https://www.preprints.org/manuscript/202404.1318/v1","date":1713780964000,"content":"Aims: This study aims to evaluate the impact of family-centered empowerment on Jordanian adolescents with type 1 diabetes (T1DM), focusing on their HbA1c levels, self-efficacy, and quality of life (QOL).\nBackground:  Poor glycemic management in adolescents with type 1 diabetes increases complications. Improved control is linked to various variables, but few studies focus on Middle Eastern populations.\nMethods: An experimental study involved 68 adolescents with T1DM visiting Jordanian Royal Medical Services' clinics. Two sets of participants were created: control (n = 34) and intervention (n = 34). Data was collected through face-to-face interviews and medical records.\nResults: The study found significant differences in self-efficacy scores between the intervention and control groups, with the intervention group experiencing a significant decrease in HbA1c readings and a significant difference in QOL between pre-program and post-program phases.\nDiscussion: Family empowerment can significantly improve the lives of Jordanian teenagers with type 1 diabetes. This strategy leads to improved glycemic management, increased self-efficacy, and improved quality of life. Future treatments and health policies should recognize and value the critical role families play in the care of this population.\nConclusion: The study suggests that patients with T1DM should receive continuous care education sessions, including self-care training, to improve their health. Nurses should also incorporate these training into treatment plans and educational programs for adolescents to enhance their QOL.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"958480c73998e56bcd528e7204865bfe487a3829f1a74a2e7ed2cab798f7c313","category":"Interdisciplinary"}