{"title":"Correlation between serum uric acid to high-density lipoprotein cholesterol ratio and atrial fibrillation in patients with NAFLD","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305952","date":1719237600000,"content":"<p>by Gaizhen Liu, Qi Zhang, Meng Zhou, Baojie Li, Jianqi Zhao, Rui Bai, Xiaosu Song, Weiwei Qin, Yonglai Zhang</p>\r\nBackground <p>Non-alcoholic fatty liver disease (NAFLD) is independently associated with atrial fibrillation (AF) risk. The uric acid (UA) to high-density lipoprotein cholesterol (HDL-C) ratio (UHR) has been shown to be closely associated with cardiovascular disease (CVD) and NAFLD. The aim of this study is to clarify whether elevated UHR is associated with the occurrence of AF in patients with NAFLD and to determine whether UHR predicted AF.</p> Methods <p>Patients diagnosed with NAFLD in the Department of Cardiovascular Medicine of the Second Hospital of Shanxi Medical University from January 1, 2020, to December 31, 2021, were retrospectively enrolled in this study. The study subjects were categorized into AF group and non-AF group based on the presence or absence of combined AF. Logistic regression was performed to evaluate the correlation between UHR and AF. Sensitivity analysis and subgroup interaction analysis were performed to verify the robustness of the study results. Receiver operating characteristic (ROC) curve analysis was used to determine the optimal cutoff value for UHR to predict the development of AF in patients with NAFLD.</p> Results <p>A total of 421 patients with NAFLD were included, including 171 in the AF group and 250 in the non-AF group. In the univariate regression analysis, NAFLD patients with higher UHR were more likely to experience AF, and the risk of AF persisted after confounding factors were adjusted for (OR: 1.010, 95%CI: 1.007–1.013, P&lt;0.001). AF risk increased with increasing UHR quartile (P for trend &lt; 0.001). Despite normal serum UA and HDL-C, UHR was still connected with AF in patients with NAFLD. All subgroup variables did not interact significantly with UHR in the subgroup analysis. The ROC curve analysis showed that the areas under the curve for UA, HDL-C, and UHR were 0.702, 0.606, and 0.720, respectively, suggesting that UHR has a higher predictive value for AF occurrence in NAFLD patients compared to HDL-C or UA alone.</p> Conclusion <p>Increased UHR level was independently correlated with a high risk of AF in NAFLD patients.</p>","author":"Gaizhen Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9585345304aa51e05485df447cda08c40973f4697dd42c7eef7a70a974a5592f","category":"Interdisciplinary"}