{"title":"423 Comparative post-weaning performance characteristics of four breeds of rabbit in hot humid climate of Nigeria","link":"https://academic.oup.com/jas/article/102/Supplement_3/14/7757114?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Rabbits are one of the most popular livestock breeds raised for their meat, fur, and companionship. Rabbit meat is fast gaining prominence as a healthier meat compared with beef, mutton, pork and chevon, which are mostly consumed in Nigeria. This study investigated breed differences in mortality, survival rates and post-weaning growth rate of rabbits reared under inimical environmental conditions. The animals were fed commercially compounded feed with 18% crude protein and 2300Kcal metabolizable energy with intermittent feeding of <span>Panicum s</span>p and <span>Tridax sp.</span> The study area, located at latitude 6.5867° N and longitude 3.9700° E, had an average daily temperature of 35°C and relative humidity of 64%, which negatively impacted the adaptation, survival rates and growth performance of the rabbits. A total of 48 weaner rabbits 8 wk of age, comprising 12 each (9 does and 3 bucks) of Checkered, Chestnut, Dutch and Hyla breeds were reared for 10 wk post-weaning. Mortality was recorded across the breeds and the body weights (BW) of the rabbits were also recorded on a weekly basis for the entire 10-wk period. The study evaluated survival rates across breeds and sex and BW gain. Statistical analyses were conducted using the Minitab software for Chi Squared test of independence for counts and descriptive statistics and general linear model analysis of variance for bodyweight gain. The statistical model describing the analysis was Y<sub>ijk</sub> = µ + α<sub>i</sub> + (α:β)<sub>ij</sub> + e<sub>ijk</sub> where α<sub>i</sub> is the i<sup>th</sup> fixed effect of breed and β<sub>j</sub> is the j<sup>th</sup> fixed effect of sex. The model accounted for 67.03% variation in total weight gain. Further mean separation was done using the Tukey’s multiple comparison procedure. Mortality rates across breeds on the average was 56.25%, with Checkered, Chestnut, Dutch and Hyla respectively recording 66.67%, 41.67%, 50.00% and 66.67% mortality, respectively. Mortality rate across sexes was 63.89% for does and 33.33% for bucks; however, mortality rates were independent (<span>P</span> &gt; 0.05) of both breed and sex with a Chi-Squared value of 2.285 and 3.41, respectively, despite the numerical differences in mortality rates across breeds and sexes. Average total BW gain during the study period across the breeds and within breeds is as presented in Table 1. The nesting of sex within breed revealed that the only significant (<span>P</span> &gt; 0.05) difference was noticed between the Hyla buck and Chestnut doe, while other means were not statistically different (<span>P</span> &gt; 0.05). The Chestnut breed with the least BW gain adapted well in the environment with greatest survival rate, while the Hyla breed had the greatest BW gain and least survival rate throughout the study. This study indicated a negative relationship between survival rates and BW gain, that lighter breeds of rabbit tend to have greater survival rates than the heavier breeds.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"958ed48b502af8de4b9956ff2e197d7229b521ba0618b21456901be728ec3a37","category":"Environment"}