{"title":"Mechanical advantage makes stomatal opening speed a function of evaporative demand","link":"https://academic.oup.com/plphys/article/195/1/370/7529181?rss=1","date":1705104000000,"content":"<span><div>Abstract</div>Stomatal opening in the light, observed in nearly all vascular land plants, is essential for providing access to atmospheric CO<sub>2</sub> for photosynthesis. The speed of stomatal opening in the light is critical for maximizing carbon gain in environments in which light intensity changes, yet we have little understanding of how other environmental signals, particularly evaporative demand driven by vapor pressure deficit (VPD) influences the kinetics of this response. In angiosperms, and some fern species from the family Marsileaceae, a mechanical interaction between the guard cells and the epidermal cells determines the aperture of the pore. Here, we examine whether this mechanical interaction influences the speed of stomatal opening in the light. To test this, we investigated the speed of stomatal opening in response to light across a range of VPDs in seven plant species spanning the evolutionary diversity of guard cell and epidermal cell mechanical interactions. We found that stomatal opening speed is a function of evaporative demand in angiosperm species and <span>Marsilea</span>, which have guard cell and epidermal cell mechanical interactions. Stomatal opening speeds did not change across a range of VPD in species of gymnosperm and fern, which do not have guard cell mechanical interactions with the epidermis. We find that guard cell and epidermal cell mechanical interactions may play a key role in regulating stomatal responsiveness to light. These results provide valuable insight into the adaptive relevance of mechanical advantage.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"958fb500638c6ca2657244369b8bec7672ae30c504ca9b885bd835e0ceb3cac9","category":"Environment"}