{"title":"Improved Amott Method to Determine Oil-Recovery Dynamics from Water-Wet Limestone using GEV Statistics","link":"https://www.preprints.org/manuscript/202405.1391/v1","date":1716331603000,"content":"Counter-current spontaneous imbibition of water is a critical oil-recovery mechanism. In the laboratory, the Amott test is a widely used technique to assess efficacy of brine imbibition into oil-saturated core plugs. The classic Amott-cell methodology was designed to estimate ultimate oil recovery, but not the recovery dynamics that provides essential information about the imbibition mechanisms. Retention of oil droplets at the external core surface and delayed onset of oil production are the two key artifacts of the classic Amott experiment. This retention, referred to here as the ``external-surface oil holdup effect'', often results in stepwise recovery curves that obscure true dynamics of spontaneous imbibition. To address these holdup drawbacks of the classic Amott method, we modified the Amott cell and experimental procedure. For the first time, using water-wet Indiana limestone cores saturated with brine and mineral oil, we showed that our improvements of the Amott method enabled accurate and reproducible measurements of oil-recovery dynamics. We used the Generalized Extreme Value (GEV) statistics to describe oil-production histories from water-wet heterogeneous limestone cores with finite initial water saturations, for the first time. We demonstrated that our four-parameter GEV model accurately described the recovery dynamics, and that optimal GEV parameter values systematically reflected the key characteristics of the oil-rock system, such as oil viscosity and rock permeability. These findings gave us a more fundamental understanding of spontaneous, counter-current imbibition mechanisms and insights into what constitutes a predictive model of counter-current water imbibition into oil-saturated rocks with finite initial water saturation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"959478d3bc9e6859a21bc6fef72e25c943d9bacde34f94eff6ccbfa15a0a132b","category":"Interdisciplinary"}