{"title":"Highly defended nudibranchs “escape” to visually distinct background habitats","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae053/7706155?rss=1","date":1720051200000,"content":"<span><div>Abstract</div>The “escape and radiate” hypothesis predicts that once species have evolved aposematism, defended species can utilize more visually diverse visual backgrounds as they “escape” the need to be well camouflaged. This enables species to explore new ecological niches, resulting in increased diversification rates. To test this hypothesis “escape” component, we examined whether the background habitats of 12 nudibranch mollusk species differed among species depending on the presence and strength of chemical defenses. We obtained a rich array of color pattern statistics using quantitative color pattern analysis to analyze backgrounds viewed through the eyes of a potential predator (triggerfish, <span>Rhinecanthus aculeatus</span>). Color pattern analysis was done at viewing distances simulating an escalating predation sequence. We identified 4 latent factors comprising 17 noncorrelated color pattern parameters, which captured the among-species variability associated with differences in chemical defenses. We found that chemically defended species, indeed, were found on visually distinct backgrounds with increased color and luminance contrast, independent of viewing distance. However, we found no evidence for increased among-species background diversity coinciding with the presence and strength of chemical defenses. Our results agree with the “escape and radiate” hypothesis, suggesting that potent chemical defenses in Dorid nudibranchs coincide with spatiochromatic differences of visual background habitats perceived by potential predators.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"959f4b6aa5953adeed144f754eb7110fa636f88d73788ed0fc69b2cf8d0a69f2","category":"Environment"}