{"title":"Strains on the human femur after revision total knee arthroplasty: An in vitro study using digital image correlation","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305387","date":1718287200000,"content":"<p>by Elisabeth M. Sporer, Christoph Schilling, Robert J. Tait, Alexander Giurea, Thomas M. Grupp</p>\r\n\r\nPain at the tip of the stem of a knee prosthesis (End-of-Stem Pain) is a common problem in revision total knee arthroplasty (TKA). It may be caused by a problematic interaction between stem and bone, but the exact biomechanical correlate is still unknown. On top of this, there is no biomechanical study investigating End-of-Stem Pain at the distal femur using human specimens. Aim of this study was to find out whether the implantation of a revision total knee implant leads to high femoral surface strains at the tip of the stem, which the authors expect to be the biomechanical correlate of End-of-Stem Pain. We implanted 16 rotating hinge knee implants into 16 fresh-frozen human femora using the hybrid fixation technique and comparing two reaming protocols. Afterwards, surface strains on these femora were measured under dynamic load in two different load scenarios (climbing stairs and chair rising) using digital image correlation (DIC) and fracture patterns after overcritical load were analysed. Peak surface strains were found at the tip of the stem in several measurements in both load scenarios. There were no significant differences between the two compared groups (different trial sizes) regarding surface strains and fracture patterns. We conclude that implantation of a long intramedullary stem in revision TKA can lead to high surface strains at the tip of the stem that may be the correlate of femoral End-of-Stem Pain. This finding might allow for a targeted development of future stem designs that can lead to lower surface strains and therefore might reduce End-of-Stem Pain. Digital Image Correlation proved valid for the measurement of surface strains and can be used in the future to test new stem designs in vitro.","author":"Elisabeth M. Sporer","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"95a63a89bcebe8e39b2bbfeae71bea978c44685b7a4f19d3362df3579dea3fac","category":"Interdisciplinary"}