{"title":"Google Pixel Watch 2 In-Depth Review","link":"https://www.dcrainmaker.com/2023/11/google-pixel-watch2-in-depth-review.html","date":1699038765000,"content":"<p><span>﻿</span></p>\n<p>It’s been a month since Google announced the Pixel Watch 2, and with it, it’s spent the last month on my wrist – compared to a variety of other watches at various purposes and price points. During this timeframe, I’ve gotten a pretty good idea of the changes Google has rolled into the Pixel Watch 2 (and WearOS 4), as well as how much of it really differs from the Pixel Watch 1 (spoiler: not much). But like Apple, the goal of Google’s watch isn’t really to entice Pixel Watch 1 users to upgrade to Pixel Watch 2. Rather, it’s to appeal to new users.</p>\n<p>With that in mind, the bulk of the Pixel Watch 2 changes are internal – with very little on the outside changing. Instead, it focuses on better battery life (it delivers), faster performance (not really noticeable), and a slate of new and updated health sensors taking advantage of that (somewhat noticeable). All of which I’ve been putting to the test.</p>\n<p>Finally, note that Google provided a media loaner Pixel Watch 2 to test. As usual, I’ll get that back to them here shortly. I’ll go out and pick up my own to continue testing the new features once they arrive. If you found this review useful, you can use the links at the bottom, or <a href=\"https://www.dcrainmaker.com/support\">consider becoming a DCR Supporter</a>, which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s talk newness.</p>\n<h3><span><strong>What’s New:</strong></span></h3>\n<p><img title=\"GooglePixelWatch2-Sensor.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GooglePixelWatch2-Sensor-1.jpg\" alt=\"GooglePixelWatch2 Sensor\" width=\"720\" height=\"480\" /></p>\n<p>Starting off with what’s new, it may look like a 1st gen Pixel Watch from the outside, largely because…well…it’s almost identical. There’s only a very slight change in the material composition itself, rather than the overall design of the unit. Here’s everything that’s new or different on the Pixel Watch 2 compared to the Pixel Watch 1:</p>\n<p>– New 100% recycled aluminum housing<br />\n– Increased durability of cover glass<br />\n– Now 10% lighter (weight) due to new aluminum housing<br />\n– Increased battery life to “full 24 hours” in always-on display mode<br />\n– Pixel Watch 2 will now run WearOS 4 (Pixel Watch 1 received this update recently too)<br />\n– New 4-core CPU to increase performance<br />\n– Faster charge times: 12 hours of usage in 30 minutes of charge time<br />\n– Added Google Assistant on-watch ability to now query health/fitness stats<br />\n– Added watch backup and restore &amp; phone transfer<br />\n– Added real-time safety check feature, alerting emergency contacts if you don’t check-in<br />\n– Adding medical ID to watch, allowing first responders to see medical info<br />\n– Adding 6 new styles of watch faces<br />\n– New heart rate sensor: Switched to new “multipath heart rate module design” with 5 photodiodes &amp; 5 LEDs, plus better spacing/coverage<br />\n– New skin temperature sensor (upgrade over previous non-dedicated sensor method)<br />\n– New skin dermatological sensor added as well, allowing Fitbit Body response feature<br />\n– New on-watch zone pacing and heart rate features<br />\n– New automatic workout detection for 7 new workout/sport types<br />\n– Added background irregular heart rate notifications<br />\n– Changed charger design, to non-wireless<br />\n– Three colors offered, pricing is $349 for WiFi models, and $399 for cellular models<br />\n– Includes 6 months of Fitbit Premium<br />\n– Water 50m resistance stays the same, also compatible with existing watch bands</p>\n<p>Instead, as you can see, most of the new changes here that are less visible externally are actually internal sensor changes. In particular, focused on the three new health sensors: new heart rate sensor, new skin temperature sensor, new skin dermatological sensor. The first of those three claims to increase heart rate accuracy significantly, while the other two add those readings/trends into the Fitbit app. Previously they did skin temperature sensing via basically proxy guessing, which wasn’t quite as accurate.</p>\n<p>Whereas from a software standpoint, the focus is mostly on more minor features that make your life easier. Or, usage of the watch easier. For example, the watch backup/restore feature, or the medical ID information on the watch. And then in the sports side, the addition of zone pacing and expanded sport profiles is also new.</p>\n<p>Lastly, there’s the addition of safety check features to the watch. These are only available in the US, Canada, UK, and Germany at this time, so it’s not something I’ve been able to actively test here in the Netherlands. This new on-watch Safety Check feature essentially works the same as it has on Google Pixel phones, but now ported to your wrist. You’ll specify a time you expect to be done, and then if you don’t check back in within that timeframe, it’ll automatically notify your emergency contacts (via either cellular from your phone, or cellular built-in to the watch if you have that variant).</p>\n<p>For those with a cellular-enabled Pixel Watch 2 (but not yet activated on a cellular network), you can still leverage Fitbit’s Safety Signal feature with Fitbit Premium enabled. That feature is basically a background LTE connectivity option for the watch to get that emergency message out. Again, if you have cellular service on the watch via your carrier, then you don’t need Fitbit Premium. But if you didn’t activate that feature with your cellular carrier, then this acts as an alternative.</p>\n<h3><span><strong>In The Box:</strong></span></h3>\n<p><img title=\"DSC_8499.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8499.jpg\" alt=\"DSC 8499\" width=\"720\" height=\"480\" /></p>\n<p>Crack open the pixel box, and you’ll find the watch looking up at you, or, place the box upwards and the two side portions will clamshell out to self-empty.</p>\n<p><img title=\"DSC_8504.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8504.jpg\" alt=\"DSC 8504\" width=\"720\" height=\"480\" /></p>\n<p>Inside the box you’ve got:</p>\n<p>1) The watch<br />\n2) An extra strap (it comes with two sized straps)<br />\n3) The charging puck/cable<br />\n4) Some paper stuffs</p>\n<p>Here’s a closer look at those components:</p>\n<p><img title=\"DSC_8506.JPG\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8506.jpg\" alt=\"DSC 8506\" width=\"720\" height=\"480\" /></p>\n<p>Note that the straps are compatible with past Pixel Watch 1 straps, so you can swap to those if you want. Or, you can pick up other new Pixel Watch 2 straps, like this sport band one you’ll see in the review (orange and grey editions).</p>\n<p><img title=\"DSC_8978.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8978.jpg\" alt=\"DSC 8978\" width=\"720\" height=\"480\" /></p>\n<p>Inversely though, the charging cable is different on the Pixel Watch 2. Specifically, the Pixel Watch 1 charging cable actually was wirelessly charging off the puck. Whereas the Pixel Watch 2 is using the four charging pins. This means the two are not interchangeable (trust me, I tried).</p>\n<p><img title=\"GooglePixelWatch2Cable.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GooglePixelWatch2Cable.jpg\" alt=\"GooglePixelWatch2Cable\" width=\"720\" height=\"480\" /></p>\n<p>With that, let’s dive into the basics of using it day to day.</p>\n<h3><span><strong>Daily Usage Basics:</strong></span></h3>\n<p><img title=\"GooglePixelWatch2ReviewBasics.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GooglePixelWatch2ReviewBasics.jpg\" alt=\"GooglePixelWatch2ReviewBasics\" width=\"720\" height=\"480\" /></p>\n<p>This section is focused on the day-to-day usage of the Pixel Watch 2, from both a hardware perspective as well as the majority of the daily fitness tracking components. Also, I’ll briefly touch on more general WearOS components, but practically speaking, this entire review is focused on sports/fitness, rather than things like playing music or downloading 3rd party apps. I feel like there are plenty more sources out there for that.</p>\n<p>Starting off with the hardware, the unit has two buttons. First being the Digital Crown itself, which both rotates and acts as a button. And then the second being a button just above the Digital Crown, on the right side:</p>\n<p><img title=\"DSC_8981.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8981.jpg\" alt=\"DSC 8981\" width=\"720\" height=\"480\" /></p>\n<p>When you set up the watch you’ll choose which wrist you’re wearing it on, which then also asks you which side the Digital Crown is on. Meaning, you can actually wear it not only on either wrist, but effectively ‘inverted’ on either wrist. Practically speaking though, because it’s a perfectly round watch with no brand markings on the front indicating which side is ‘up’, Google can simply change the orientation of the display in software to suit your preferences. It’s a cool option.</p>\n<p>To begin on the software side, you’ve got your watch face. This is customizable within the Google Pixel Watch app on your smartphone, to a number of different watch faces. Below is an example of some of the stock ones, on which you can customize the complications, as well as coloring. However, in the Google Play Store, you can kinda go crazy on downloading options.</p>\n<p><img title=\"DSC_8982.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8982.jpg\" alt=\"DSC 8982\" width=\"720\" height=\"480\" /></p>\n<p>In fact, it’s from within the Google Pixel Watch app on your phone that you can change a host of watch settings. While many (if not most) of these can also be changed on the watch itself, it can be more efficient to do it from the phone.</p>\n<p><img title=\"DSC_8984.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8984.jpg\" alt=\"DSC 8984\" width=\"720\" height=\"480\" /></p>\n<p>Meanwhile, back on the watch, you can find the majority of these by just swiping down from the top, which accesses the settings panel. This includes everything from do-not-disturb to sleep modes, as well as airplane modes and brightness levels. Even the flashlight is accessible here.</p>\n<p><img title=\"DSC_8985.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8985-1.jpg\" alt=\"DSC 8985\" width=\"720\" height=\"480\" /></p>\n<p>Meanwhile, if you swipe from the bottom, you’ll get notifications from apps or people:</p>\n<p><img title=\"DSC_8986.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8986.jpg\" alt=\"DSC 8986\" width=\"720\" height=\"480\" /></p>\n<p>However, the majority of things you’ll access will come from either pressing the Digital Crown once to access the apps list:</p>\n<p><img title=\"DSC_8987.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8987.jpg\" alt=\"DSC 8987\" width=\"720\" height=\"480\" /></p>\n<p>Or, swiping to the right/left through the various tiles. For example, the first tile in a default configuration is the Steps tile, which shows your steps and progress towards your steps goal:</p>\n<p><img title=\"DSC_8989.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8989.jpg\" alt=\"DSC 8989\" width=\"720\" height=\"480\" /></p>\n<p>If you tap that to open it, then you’ll get more details about your steps over today and the last few days:</p>\n<p><img title=\"DSC_8988.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8988.jpg\" alt=\"DSC 8988\" width=\"355\" height=\"237\" /> <img title=\"DSC_8990.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8990.jpg\" alt=\"DSC 8990\" width=\"355\" height=\"237\" /></p>\n<p>And if we swipe again from the side you’ll get to the Heart Rate tile. Again, this first shows your current heart rate (and detail over the last couple of hours), before you tap open and get details about the last few days.</p>\n<p><img title=\"DSC_8991.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8991.jpg\" alt=\"DSC 8991\" width=\"355\" height=\"237\" /> <img title=\"DSC_8992.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8992.jpg\" alt=\"DSC 8992\" width=\"355\" height=\"237\" /></p>\n<p>If you swipe again, you’ll hit a quick-access exercise menu. I’ll cover that under sports usage. Instead, swipe once more to see the sleep stats:</p>\n<p><img title=\"DSC_8994.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8994.jpg\" alt=\"DSC 8994\" width=\"355\" height=\"237\" /> <img title=\"DSC_8995.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8995.jpg\" alt=\"DSC 8995\" width=\"355\" height=\"237\" /></p>\n<p>As you open this up, you’ll see the sleep details for last night, including sleep stages and your sleep times this week. Note that I’ve found the sleep times (time I went to sleep/woke-up), pretty solid. No issues there, it’s matched within a few minutes. As for sleep stages, that’s not something I focus on from an accuracy standpoint, as the methodologies that you can use to compare sleep stages simply aren’t all that accurate, in the 80% range. Thus, comparing to a non-accurate metric seems a bit odd to me. So instead, I just focus on the times I woke up and fell asleep.</p>\n<p><img title=\"DSC_8996.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8996.jpg\" alt=\"DSC 8996\" width=\"720\" height=\"480\" /></p>\n<p>Now, all of this data, be it steps/sleep/etc, is all accessible within the Fitbit app on your phone. But, it’s worth noting there’s also a consolidated view within the Fitbit Today dashboard on your watch too. From the apps listing (or, on some watches by holding the Fitbit logo), you’ll get to this page here, which you can scroll down through tile after tile of many of the same stats I just showed above. But you will see added ones here, like the blood oxygen levels and skin temperature changes.</p>\n<p><img title=\"DSC_8999.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_8999.jpg\" alt=\"DSC 8999\" width=\"235\" height=\"157\" /> <img title=\"DSC_9001.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9001.jpg\" alt=\"DSC 9001\" width=\"235\" height=\"157\" /> <img title=\"DSC_9003.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9003.jpg\" alt=\"DSC 9003\" width=\"235\" height=\"157\" /></p>\n<p>In total, this section covers the following data: Steps, Floors, Distance, Calories Burned, Active Zone Minutes, Exercise Days this Week, Hourly Activity, Heart Rate, Resting Heart Rate, Sleep, Blood Oxygen, Skin Temperature Variation, Body Responses, and Mindfulness. As with last year, you can’t adjust this list, despite that little settings icon. That simply signs you out of the Fitbit account.</p>\n<p><img title=\"DSC_9005.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9005.jpg\" alt=\"DSC 9005\" width=\"720\" height=\"480\" /></p>\n<p>Now, before I show some of those Fitbit app screens, <strong>I want to point out that *this entire review* is done with a Fitbit basic (non-Premium/non-paid/no-subscription) account</strong>, merely to demonstrate what it looks like at this level.</p>\n<p>So, back on the Fitbit app, you’ll see it’s been revamped from years prior. Back in September the company issued a pretty big update that overhauls much, if not all, of the app. Here’s your home page that shows stats related to today, starting with your sleep up top as the most important component, and then from there steps/zone minutes, and mindfulness days. However, what’s cool is that you can change which ‘template’ you want to focus on – such as one for ‘Getting more active’, or ‘Manage weight’, or ‘Sleep’. The idea being it bubbles those stats up to the top instead:</p>\n<p><img title=\"Screenshot_20231103-143903.png\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143903.png\" alt=\"Screenshot 20231103 143903\" width=\"235\" height=\"522\" /> <img title=\"Screenshot_20231103-143913.png\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143913.png\" alt=\"Screenshot 20231103 143913\" width=\"235\" height=\"522\" /> <img title=\"Screenshot_20231103-143924.png\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143924.png\" alt=\"Screenshot 20231103 143924\" width=\"235\" height=\"522\" /></p>\n<p>I actually really like this customization approach of the top portion. Perhaps they went a bit overkill on all the templates and such, but being able to get rid of things I don’t really care about seeing daily (like the Mindfulness stats) is handy. It lets me bring it closer to what I actually care about day-to-day.</p>\n<p>Meanwhile, down below are all your other stats, which again, are customizable depending on which tiles you want to see (or don’t want to see).</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143941X-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-143953-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144000-1-278x185.png 278w\" /></a>\n\n<p>All of these stats can be tapped into to see more details on them, historically speaking. For example, steps, or heart rate, or sleep.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144024-2-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144045-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144140-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144149-278x185.png 278w\" /></a>\n\n<p>This is one of the key reasons I didn’t use a Fitbit Premium account, as I wanted to demonstrate that you don’t need an account to see historical data. All that works just fine. It’s one of those sorta-rumor things that have grown a bit crazy over the last few years, but simply isn’t accurate. Now, as I’ve said many times, I think Fitbit is doing themselves a device-sales disservice with Fitbit Premium, but, in terms of how the pieces work today (and have worked for at least two years), there’s no loss of historical data here for not having it.</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144316-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144359-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144404-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144412-278x185.png 278w\" /></a>\n\n<p>Sure, there’s other coaching things and the like, but not data-driven components. That’s especially true in the ‘Health Metrics’ dashboard (which, I know is kinda confusing cause all of this is ‘health metrics’ (lowercase)). These pages are all fully accessible to non-premium members.</p>\n<p>Now, turning our attention elsewhere briefly, one of the strengths of the Google Pixel being on WearOS is the ability to install 3rd party apps on the watch, including watch faces. In my case, this has included Strava, Spotify, and Komoot. You can grab these using the Google Play store on your phone:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144428-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144436-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144443-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144616-278x185.png 278w\" /></a>\n\n<p>These apps then show up in the apps list on your watch, alongside other riveting apps like Stopwatch:</p>\n<p><img title=\"DSC_9006.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9006.jpg\" alt=\"DSC 9006\" width=\"720\" height=\"480\" /></p>\n<p>The Spotify one, in my case, lets me download music for offline listening (without any phone required). Whereas the Komoot one will act as a gateway for the phone app to give you wrist-based turn-by-turn instructions. It doesn’t have offline maps on the watch or other fanciness, so it is roughly akin to an advanced notification option:</p>\n<p><img title=\"DSC_9007.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9007.jpg\" alt=\"DSC 9007\" width=\"355\" height=\"237\" /> <img title=\"DSC_9008.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9008.jpg\" alt=\"DSC 9008\" width=\"355\" height=\"237\" /></p>\n<p>In any case, with those basics covered, let’s dive into the sports usage and using the built-in apps.</p>\n<h3><span><strong>Sports Usage:</strong></span></h3>\n<p><img title=\"DSC_9009.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9009.jpg\" alt=\"DSC 9009\" width=\"720\" height=\"480\" /></p>\n<p>To start a workout on the Pixel Watch 2, you’ll swipe to the Exercise Tile/Page, which has the three most recently used workout types at the top, which you can tap to instantly start. Or, you can tap the ‘More’ button, which loads the big list of workout types:</p>\n<p><img title=\"DSC_9010.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9010.jpg\" alt=\"DSC 9010\" width=\"720\" height=\"480\" /></p>\n<p>Here’s the current list of workout types supported on the Pixel Watch 2:</p>\n<blockquote><p>Aerobics, Bike, Bootcamp, Canoeing, Circuit Training, Core Training, Cross-country Skiing, CrossFit, Dancing, Elliptical, Golf, HIIT, Hike, Indoor Climbing, Kayaking, Kickboxing, Martial Arts, Mountain Biking, Outdoor Workout, Paddleboarding (SUP), Pilates, Powerlifting, Rollerblading, Rowing Machine, Run, Skating, Skiing, Snowboarding, Spinning, Sport, Stair Climber, Strength Training, Surfing, Swim, Tennis, Treadmill, Walk, Weightlifting, Weights, Workout, Yoga</p></blockquote>\n<p>It’s a very eclectic mix of sports, but does include the core ones that most people would be likely to use. About the singular exception here that comes to mind is that ‘Swim’ is only indoor swimming, not openwater swimming. Likewise, there’s no triathlon/multisport mode. But hey…we’ve got ourselves Canoeing! Thus covering the gateway activity that always leads to a fight between partners.</p>\n<p>In any case, once you choose an activity, you’ll see this initial screen. It’s here that you can validate you’ve got GPS access (if an outdoors activity), as well as press start to begin. However, you can also change settings.</p>\n<p><img title=\"DSC_9011.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9011.jpg\" alt=\"DSC 9011\" width=\"720\" height=\"480\" /></p>\n<p>The first settings option is that little flag that you see there, this used to be a ‘Goal’ icon. That flag opens up the new Pacer and Zone modes. This is where you can enable modes for: Pacer Mode, Goal Mode, Heart Rate Zone Mode, and Pace Range Alerts. Note these are different than the previous/existing ‘goals’ for the session, such as Distance/Time/Calorie goals. We’ll get to those in a second.</p>\n<p><img title=\"DSC_9012.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9012.jpg\" alt=\"DSC 9012\" width=\"720\" height=\"480\" /></p>\n<p>When you set one of the pacer modes, you’ll then be asked which pace to target, or heart rate zone to target:</p>\n<p><img title=\"DSC_9013.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9013.jpg\" alt=\"DSC 9013\" width=\"720\" height=\"480\" /></p>\n<p>Now in addition to these zones, you can configure a handful of settings. This includes start/end workout reminders, and auto-pause. However, it also includes which stats to display:</p>\n<p><img title=\"DSC_9014.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9014.jpg\" alt=\"DSC 9014\" width=\"720\" height=\"480\" /></p>\n<p>Here you get one customizable stats page, that has four different stats on it:</p>\n<p><img title=\"DSC_9015.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/DSC_9015.jpg\" alt=\"DSC 9015\" width=\"720\" height=\"480\" /></p>\n<p>As an example, for run, here are the data fields you can select:</p>\n<blockquote><p>Distance, Elapsed Time, Heart Rate, Pace, Pace Average, Calories Burned, Steps, Elevation, Elevation Gain, Active Zone Minutes</p></blockquote>\n<p>I’d argue this continues to be a pretty big weak point of the Pixel Watch for sporty folks. Virtually every other platform/watch out there allows far more customization, and certainly more than one data page. While the Pixel Watch will show an added data page once in your workout for the zone pieces, this is still pretty slim pickings.</p>\n<p>With all that set, you can go ahead and start your workout. You’ll get a three-second countdown, then you’ll see the data pages/fields as you’ve configured them.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/11/IMG_6593-720x540.jpeg\" width=\"720\" height=\"540\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_6593-720x540.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_6593-200x150.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_6593-1536x1152.jpeg 1536w, https://media.dcrainmaker.com/images/2023/11/IMG_6593-2048x1536.jpeg 2048w, https://media.dcrainmaker.com/images/2023/11/IMG_6593-125x94.jpeg 125w\" /></p>\n<p>This includes the new pacer/zone pages, which shows where you stand relative to the target you’ve configured:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-720x450.png\" width=\"720\" height=\"450\" srcset=\"https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-720x450.png 720w, https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-200x125.png 200w, https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-1536x961.png 1536w, https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-2048x1281.png 2048w, https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-125x78.png 125w, https://media.dcrainmaker.com/images/2023/11/vlcsnap-2023-11-03-15h21m36s457-e1699021951625-768x480.png 768w\" /></p>\n<p>Note there isn’t any way to change any of the sport-specific settings from your phone. The singular exceptions are the heart rate zone tied to the Fitbit app, as well as your stride length. But otherwise, everything is configured on-watch.</p>\n<p>Once the workout is complete, you’ll get a brief summary of your workout, as well as listing how many Active Zone minutes you had:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_0250-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_0250-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_0250-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_0250-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_0250-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_0250-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_0250-278x185.jpeg 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/IMG_0247-scaled.jpeg\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/IMG_0247-200x132.jpeg\" srcset=\"https://media.dcrainmaker.com/images/2023/11/IMG_0247-200x132.jpeg 200w, https://media.dcrainmaker.com/images/2023/11/IMG_0247-124x82.jpeg 124w, https://media.dcrainmaker.com/images/2023/11/IMG_0247-720x480.jpeg 720w, https://media.dcrainmaker.com/images/2023/11/IMG_0247-300x200.jpeg 300w, https://media.dcrainmaker.com/images/2023/11/IMG_0247-278x185.jpeg 278w\" /></a>\n\n<p>Then, within the Fitbit app you can see your stats displayed:</p>\n\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144658-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144708-278x185.png 278w\" /></a>\n<a href=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712.png\"><img width=\"200\" height=\"132\" src=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-200x132.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-200x132.png 200w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-124x82.png 124w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-720x480.png 720w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-300x200.png 300w, https://media.dcrainmaker.com/images/2023/11/Screenshot_20231103-144712-278x185.png 278w\" /></a>\n\n<p>There’s also connectivity to virtually any fitness/sports app you can think of, via the existing Fitbit connectivity. So things like Strava, TrainingPeaks, etc… are all offered that way. It’ll automatically upload your workout to those platforms within a few seconds of receiving it from your watch.</p>\n<p>If I step back and look at the changes Fitbit made with the Pixel Watch 2, and to a lesser extent WearOS 4, they’re more heavily skewed towards the health side than the sports side. Sure, we got some expanded sport modes and the zone/pacer implementation, but on the whole the sports additions are pretty minimal here compared to Samsung or Apple, or even Huawei for that matter. Maybe that’s Google’s goal, to be more of a general-purpose watch – but as their competitors really double down on being very capable sports watches, it’s something that Google has to consider.</p>\n<h3><span><strong>GPS &amp; Heart Rate Accuracy:</strong></span></h3>\n<p><img title=\"GooglePixelWatch2Accuracy.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GooglePixelWatch2Accuracy.jpg\" alt=\"GooglePixelWatch2Accuracy\" width=\"720\" height=\"480\" /></p>\n<p>In this section, I’m going to look at the sports-focused accuracy of the GPS and heart rate sensors. In the case of GPS, it doesn’t have the fancier multi-band/dual-frequency GNSS like some devices in the same price range. However, as I’ve said many times, I don’t much care how a device achieves good accuracy, as long as it does. We’ve seen other companies achieve great accuracy without multi-band, and inversely, seen companies put forth bad multi-band implementations.</p>\n<p>Likewise, in the case of the optical HR sensor, Google says that they increased accuracy yet again with the Pixel Watch 2, through a new multi-path sensor, combined with updated algorithms. I’d note that the Pixel Watch 1’s optical HR sensor accuracy was largely pretty good. Maybe not industry-leading, but certainly nothing to be worried about.</p>\n<p>So, starting off with a relatively easy run – both in terms of GPS and heart rate. There were no buildings, just light/occasional tree cover, and a bunch of turns to see how it handles. Here we can see that it’s very close to the multi-band Garmin Forerunner 955 and Suunto Race. The Fitbit Charge 6 struggles a bit, although not as much as it usually does.</p>\n<p><img title=\"Accuracy-WindmillGPS-FitbitCharge6.jpg\" src=\"https://media.dcrainmaker.com/images/2023/10/Accuracy-WindmillGPS-FitbitCharge6.jpg\" alt=\"Accuracy WindmillGPS FitbitCharge6\" width=\"719\" height=\"374\" /></p>\n<p>Looking at a section closer, the Pixel Watch 2 performs nearly identically to the Forerunner 955, which is a well-respected watch when it comes to GPS accuracy, so that’s great to see.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/Accuracy-Windmill-GPS2-FitbitCharge6.jpg\" /></p>\n<p>What about the heart rate on this run? Very solid. The Fitbit Charge 6 wanders a bit, but the Pixel Watch 2, with the higher-end sensor tech and more powerful algorithms, virtually matches the chest strap. Only once did we see disagreement on one interval. Otherwise, it’s spot-on.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/Accuracy-Windmill-FitbitCharge6-HR.jpg\" /></p>\n<p>So, let’s increase difficulty a notch, this time<a href=\"https://analyze.dcrainmaker.com/#/public/56bc7751-b3dc-4592-7b47-e0407065ac9d\"> heading into the forest</a>. Here we have it compared to the Garmin Venu 3, the Suunto Race, and the COROS Pace 3. A good blend of different capabilities. And at the high level things look pretty similar:</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage.png\" alt=\"UntitledImage\" width=\"719\" height=\"427\" /></p>\n<p>Zooming in, we see very good alignment on this section:</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-1.png\" alt=\"UntitledImage\" width=\"719\" height=\"398\" /></p>\n<p>However, there were a few minor blips at other random points, like here, where it goes briefly offset for a moment or two.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-2.png\" alt=\"UntitledImage\" width=\"719\" height=\"402\" /></p>\n<p>Still, if we look at the heart rate, it’s very good beyond the first 2 minutes. One pattern I’ve seen with the Pixel Watch 2 is that it can often struggle more than the average duck in those first 2-3 minutes as I start to generate a bit of moisture on the skin (especially here in the fall with cooler temps). But after that point, it’s very solid, virtually identically matching the chest strap.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-3.png\" alt=\"UntitledImage\" width=\"720\" height=\"249\" /></p>\n<p>So, let’s increase difficulty yet again – this<a href=\"https://analyze.dcrainmaker.com/#/public/8bffc616-daf7-40e1-7f47-a3d71a4488f4\"> time into the city/building test</a>. This area has 20-30 story buildings, akin to running in any big city, albeit perhaps more difficult in some ways due to how small the streets themselves are. Here it is against the Fitbit Charge 6, Garmin Forerunner 955, and Suunto Race. I know, looking at it, your head already hurts:</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-4.png\" alt=\"UntitledImage\" width=\"719\" height=\"419\" /></p>\n<p>But here’s the good news: If you manage to ignore the green line of the hopeless GPS antenna on the Fitbit Charge 6, then the Pixel Watch 2 isn’t horrific. This is an area where multiband/dual-frequency really helps, because of the reflections on the building and being able to find an alternate ‘path’ to the satellites. Thus you can see the multi-band Garmin Forerunner 955 and Suunto Race largely come out of this unscathed, whereas the Pixel Watch 2 struggles a few times – though, better than many other non-multi-band watches I’ve seen.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-5.png\" alt=\"UntitledImage\" width=\"720\" height=\"427\" /></p>\n<p>In terms of the heart rate on this one, zero problems, easily tracked through every 1KM interval sprint I did.</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-6.png\" alt=\"UntitledImage\" width=\"719\" height=\"243\" /></p>\n<p>Now, switching topics a bit, let’s look at an indoor workout. Here’s an indoor trainer ride, where the heart rate is spot-on again. Heck, even the Fitbit Charge 6 gets this right too. You can see both track pretty well – with only a few minor missteps briefly for 3-5 seconds – often typical optical HR sensor lag related.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/AccuracyTrainer1-HR-Charge6-Pixel.jpg\" /></p>\n<p>Meanwhile, here’s another indoor trainer workout of relatively sucky intervals to do, and it nailed it perfectly – even just slightly beating the Polar Vantage V3 when it comes to heart rate accuracy – especially in those first few minutes. After that point, it’s a tiny bit faster to respond than the Polar (by a couple of seconds).</p>\n<p><img title=\"UntitledImage.png\" src=\"https://media.dcrainmaker.com/images/2023/11/UntitledImage-7.png\" alt=\"UntitledImage\" width=\"717\" height=\"248\" /></p>\n<p>Again, this is where you can start to see some of the algorithms at play here. Google says this is a blend of machine learning and “AI”, albeit, it’s hard to know how much actual AI is at work here, versus more common machine learning. But again, I don’t really care what they call it – as it clearly works well.</p>\n<p>And ultimately, that’s the general gist of things with the Pixel Watch 2. Yes, the heart rate is largely very very good. In fact, looking across even more data sets that I have, about the only time I ever see errors is in the first 2-3 minutes during the warm-up, but usually after that it’s spot-on from a heart rate accuracy perspective.</p>\n<p>Meanwhile, on GPS it’s very good overall. Sure, it lacks multiband, and we see the impact of that in the downtown/buildings section, as well as very briefly in the forest for some odd reason (those portions it went astray weren’t that complicated). But on the whole, it’s pretty strong for the price point, and definitely the most accurate Fitbit/Google product to date.</p>\n<p><em>(Note: All of the charts in these accuracy portions were created using the DCR Analyzer tool. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, running power, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, <a href=\"https://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p><img title=\"GooglePixelWatch2ReviewFinish.jpg\" src=\"https://media.dcrainmaker.com/images/2023/11/GooglePixelWatch2ReviewFinish.jpg\" alt=\"GooglePixelWatch2ReviewFinish\" width=\"720\" height=\"480\" /></p>\n<p>For many years, the WearOS landscape of options wasn’t great. In the beginning it was bulky hardware, then it was the apps that lacked competitiveness (or were left to die), and then it became the watches burned incredible amounts of battery. But things have finally started turning a corner. With the Samsung Galaxy Watch 5 a year ago, and then the Pixel Watch 1 a few months later, we finally got watches that were reasonably competitive in the fitness/sports realm. We finally got battery life levels that got us (mostly) through the day, and could even do a reasonably solid day hike.</p>\n<p>The Pixel Watch 2 takes that historical perspective and steps it up, especially around accuracy, but also battery life. I’ve had zero issues always getting a full day’s worth of battery life. I’m roughly charging every 1.5 days (non-LTE), or sooner if I do a much longer GPS workout. Combining that with Google’s very solid optical HR sensor accuracy, we’re seeing better options. We’re also seeing better options in terms of apps, and interest from app developers. Sure, most of the sports apps are still lacking much punch, but the developers are at least updating them again.</p>\n<p>I think the Pixel Watch’s biggest challenge in the sports realm is simply the lack of depth in said realm. At a time when other companies are really stepping up the features in sports, the Pixel Watch 2 really only got one new sports feature (zones/pacer). Heck, the Fitbit Charge 6 arguably got more new sports functionality (such as HR broadcasting, despite its flaws). I’d really like to see Google focus on updates that make waves in this category, rather than feeling a few steps behind.</p>\n<p>When it comes to comparing the two leading WearOS watches: Samsung’s Galaxy Watch 6 vs Google’s Pixel Watch 2, I see two core differences. First, the most obvious: Size/style. Samsung has, for my larger-sized wrist, better size options, especially in the Galaxy Watch 6 classic realm. I wish Google had introduced a larger-sized Pixel Watch this year, but alas, that didn’t happen.</p>\n<p>However, what Google lacks in size, they make up for in accuracy. As you saw in my Samsung Galaxy Watch 6 review (or any other reputable reviewer), the Samsung Galaxy Watch 6 is pretty horrible in the accuracy department (and has been for years). Now obviously, Google can’t boast too much with its Fitbit Charge 6 sitting nearby, but ignoring that, Google easily wins in both heart rate/GPS, as well as general stats.</p>\n<p>Finally, it’s worth pointing out that Fitbit’s platform for fitness/health data/analytics is still very strong. As I noted at the beginning, my entire review was written using the free version (non-premium). You’d frankly never know or even notice what you’re missing otherwise. And those stats are leagues ahead of what Samsung offers. But again, only if the shoe [watch] fits.</p>\n<p>With that – thanks for reading!</p><div>\n<h3>Found This Post Useful? Support The Site!</h3>\r\n\r\n<p>Hopefully you found this review useful.  At the end of the day, I’m an athlete just like you looking for the most detail possible on a new purchase – so my review is written from the standpoint of how I used the device.  The reviews generally take a lot of hours to put together, so it’s a fair bit of work (and labor of love).  As you probably noticed by looking below, I also take time to answer all the questions posted in the comments – and there’s quite a bit of detail in there as well.</p>\r\n\r\n<p>If you're shopping for the Google Pixel Watch 2 or any other accessory items, please consider using the affiliate links below! As an Amazon Associate I earn from qualifying purchases. It doesn’t cost you anything extra, but your purchases help support this website a lot. Even more, if you shop with <a href=\"https://pros-closet.sjv.io/OrnmMN\">TPC (The Pro's Closet)</a>, you'll <b>save $40 on purchases over $200 with coupon code DCRAIN40</b>! The Pro's Closet has been a long-time partner of the site here - including sponsoring videos like my <a href=\"https://www.dcrainmaker.com/2022/06/cargo-bike-amsterdam-race-report-power.html\">cargo bike race</a>, as well as just being an awesome Colorado-based company full of good humans. Check them out with the links below and the <b>DCRAIN40</b> coupon!</p>\r\n\r\n\r\n\r\n\r\n<div><a href=\"https://www.amazon.com/Google-Pixel-Watch-Best-Fitbit/dp/B0CCQFL1XV?crid=2NU5XOV2SK066&amp;keywords=pixel%2Bwatch%2B2&amp;qid=1699262193&amp;sprefix=pixel%2Bwatch%2B%2Caps%2C199&amp;sr=8-3&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d518242c8b8ccc90d1dd688f92b7693d&amp;language=en_US&amp;ref_=as_li_ss_tl\" target=\"_blank\"><img width=\"720\" height=\"609\" src=\"https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612-720x609.png\" srcset=\"https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612-720x609.png 720w, https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612-200x169.png 200w, https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612-125x106.png 125w, https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612-768x649.png 768w, https://media.dcrainmaker.com/images/2023/11/PixelWatch2Transparent-e1699262556612.png 1215w\" /></a><div><h4><a href=\"https://www.dcrainmaker.com/2023/11/google-pixel-watch2-in-depth-review.html\" target=\"_blank\">Google Pixel Watch 2</a></h4><div><a target=\"_blank\" href=\"https://www.amazon.com/Google-Pixel-Watch-Best-Fitbit/dp/B0CCQFL1XV?crid=2NU5XOV2SK066&amp;keywords=pixel%2Bwatch%2B2&amp;qid=1699262193&amp;sprefix=pixel%2Bwatch%2B%2Caps%2C199&amp;sr=8-3&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d518242c8b8ccc90d1dd688f92b7693d&amp;language=en_US&amp;ref_=as_li_ss_tl\"><span>Amazon</span> <span>$350</span></a> </div></div></div>\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n<p>And of course – you can always <a href=\"https://www.dcrainmaker.com/support\">sign-up to be a DCR Supporter</a>!  That gets you an ad-free DCR, access to the DCR Quarantine Corner video series packed with behind the scenes tidbits...and it also makes you awesome. And being awesome is what it’s all about!</p>\r\n\r\n<p>Thanks for reading! And as always, feel free to post comments or questions in the comments section below, I’ll be happy to try and answer them as quickly as possible. And lastly, if you felt this review was useful – I always appreciate feedback in the comments below. Thanks!</p></div>\n<p></p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"95b4402c9d728a7bfd2ca7cda98a61bcb201536e3f1cab2313fe6a4e207c31be","category":"Cycling"}