{"title":"Here are the 10 best cars we drove in 2023","link":"https://arstechnica.com/?p=1992876","date":1703853040000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/ars-cars-of-2021-800x450.jpg\" alt=\"Here are the 10 best cars we drove in 2023\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/ars-cars-of-2021.jpg\">Enlarge</a> (credit: Aurich Lawson/Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The mince pies have been eaten, the crackers have been cracked, and the days are starting to get longer. That means it's time to look back on the best vehicles we tested in 2023. It has been a good year for electric vehicles, which accounted for almost one in ten new vehicles sold in the US this year. We've also driven some rather good hybrids, as well as a pair of sports cars that reminded us that there's still room for enthusiast cars. Read on to find out which cars made the cut.</p>\n<h2>1. Polestar 2</h2>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2024-Polestar-2-1-scaled-2.jpg\"><img alt=\"You'd be hard-pressed to spot the difference between the 2023 Polestar 2 and the 2024 Polestar 2, but the improvements are obvious when you drive one.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2024-Polestar-2-1-scaled-2-980x735.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/12/2024-Polestar-2-1-scaled-2.jpg\">You'd be hard-pressed to spot the difference between the 2023 Polestar 2 and the 2024 Polestar 2, but the improvements are obvious when you drive one.</a> (credit: Jonathan Gitlin)</p></div>\n<p>In addition to claiming the top spot in 2023, Polestar might also win a prize for the most significant reengineering job for a midlife refresh. Normally, an automaker might restyle the bumpers or change the headlights and tweak the interior when it gives a model its spruce-up after a few years on sale. Not Polestar—it mostly left the cosmetics alone but moved the electric motor in the single-motor Polestar 2 from under the hood, where it drove the front wheels, to the rear, where it now drives the rear wheels.</p>\n<p>Combined with a bit of a bump in power (ok, 29 percent more power and 48 percent more torque), <a href=\"https://arstechnica.com/cars/2023/09/now-rear-wheel-drive-the-single-motor-polestar-2-is-better-than-ever/\">the result is a real driver's car</a>, with better steering and handling than the front-wheel drive Polestar 2 it replaces. There's more standard equipment than before, and it's more efficient, too. Only about 30 percent of US Polestar customers have picked the single-motor model in the past, but they're missing out. The twin-motor car might be faster, but it's less engaging to drive, has less range, and costs a whole bunch more.</p></div><p><a href=\"https://arstechnica.com/?p=1992876#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1992876&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"95c525b13e3a611da50ed6aa3c30d6fd1118da6e6a231eb9b3492c34c0d2528e","category":"Tech"}