{"title":"Uber Eats Rolling Out Support for Tracking Orders on iPhone's Lock Screen and Dynamic Island","link":"https://www.macrumors.com/2023/05/02/uber-eats-live-activities/","date":1683040027000,"content":"Uber Eats has started rolling out Live Activities support around the world, allowing iPhone users to easily track their order on the Lock Screen and in the Dynamic Island. The feature is available to a small percentage of users in the latest version of the Uber Eats app, and it will be available more widely within the next week or so.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Uber-Eats-iPhone.jpeg\" alt width=\"1920\" height=\"1080\" />\r<br />\nLive Activities is an iOS 16 feature that allows iPhone users to stay on top of real-time events with a live-updating notification on the Lock Screen, and in the Dynamic Island on iPhone 14 Pro models. For Uber Eats, the feature makes it easier to track the live progress of a delivery at a glance without opening the app. Information shown includes the order status, ETA, driver's name and photo, and store's image.\r<br />\n\r<br />\nUber <a href=\"https://www.macrumors.com/2023/02/22/uber-live-activities-support-worldwide/\">added Live Activities support to its main app</a> for rides earlier this year. Uber Eats is a standalone app for delivery of food, groceries, and select other items, and its adoption of the feature will be very useful for tracking an order.\r<br />\n\r<br />\nOther popular apps that support Live Activities include the NBA and MLB apps for basketball and baseball games, Flighty for flight tracking, Citymapper for public transit, ParkMobile for parking, and CARROT Weather for weather forecasts. Google Maps is also <a href=\"https://www.macrumors.com/2023/02/08/google-maps-to-support-live-activities/\">planning to support the feature</a> for turn-by-turn directions in the coming months.<div>Tags: <a href=\"https://www.macrumors.com/guide/uber/\">Uber</a>, <a href=\"https://www.macrumors.com/guide/live-activities/\">Live Activities</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/05/02/uber-eats-live-activities/\">Uber Eats Rolling Out Support for Tracking Orders on iPhone's Lock Screen and Dynamic Island</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/uber-eats-rolling-out-support-for-tracking-orders-on-iphones-lock-screen-and-dynamic-island.2388434/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"95cea8d1440c15620b5b8ca89b3d432a5ff35232a9b281ec3214797742d52902","category":"Apple"}