{"title":"Evaluating the VIIRS Imagery for Developing Near Real-Time Nationwide Vegetation Cover Monitoring in Indonesia","link":"https://www.preprints.org/manuscript/202404.1215/v1","date":1713430647000,"content":"The necessity for precise and current data concerning the dynamics of land cover change in Indonesia is crucial for efforts to reduce natural vegetation cover due to agricultural expansion. The functionality of monitoring systems that incorporate Terra-MODIS is currently compromised by the limited availability of data for the immediate future. This study seeks to assess the potential of VIIRS satellite imagery in developing an early warning system for monitoring vegetation cover change in Indonesia. The Normalized Differential Open Area Index (NDOAI) computed from the 8-day’ VIIRS data was employed to detect changes in vegetation cover based on pixel-by-pixel subtraction in the NDOAI data time series. Evaluating the pixel-level accuracy of change detection is complicated due to the fact that we evaluate a change map at a coarser resolution than the Landsat-based reference map. The results revealed that increasing the threshold percentage is associated with improved accuracy. In change detection, there is often a trade-off between accuracy and sensitivity. A threshold that is too low may result in false positives, while a threshold that is too high may lead to missed changes. This study demonstrates that when a threshold value of less than 20% is applied, Landsat can identify vegetation cover changes at an earlier stage. Conversely, when a threshold value greater than 20% is employed, VIIRS will detect the change 4.5 days earlier than Landsat. Additionally, VIIRS is capable of detecting changes 25.4 days and 54.8 days faster than Landsat, respectively, when using thresholds of 40% and 75%.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"95d4f92eefedea5819a26b23bdcb8635b66721dca0bba148136b6d128e445769","category":"Interdisciplinary"}