{"title":"Functional Improvement at One Year in Fibrotic Interstitial Lung Diseases&ndash;Prognostic Value of Baseline Biomarkers and Anti‐Inflammatory Therapies","link":"https://www.preprints.org/manuscript/202406.0999/v1","date":1718365464000,"content":"Background: The clinical spectrum of fibrotic interstitial lung diseases (ILD) is highly heterogeneous. We aimed to evaluate the prognostic value of widely available baseline biomarkers for improvement of lung function in patients with fibrotic ILD. Methods: This registry-based study included 142 patients with fibrotic ILD as defined by presence of reticulation, traction bronchiectasis or honeycombing on initial high-resolution computed tomography (HRCT). Functional improvement at 1 year was defined as relative increase of 5% in forced vital capacity (FVC) or of 10% in diffusion capacity for carbon monoxide (DLCO). The prognostic value of baseline biomarkers was evaluated for all patients and the subgroup with anti-inflammatory treatment. Results: At one year, 44 patients showed improvement while 73 progressed. Multivariate analyses found prognostic significance for age &amp;lt;60 years (OR 5.4; 95%CI 1.9-15.4; p=0.002), lactate dehydrogenase (LDH) &amp;gt;250U/L (OR 2.5; 95%CI 1.1-5.8; p=0.043) and blood monocyte count &amp;lt;0.8G/L (OR 3.5; 95%CI 1.1-11.3; p=0.034). In 84 patients undergoing anti-inflammatory treatment, multivariate analysis revealed age &amp;lt;60 years (OR 8.5 (95%CI 2.1-33.4; p=0.002) as the only significant variable. Conclusion: Younger age, higher LDH and lower blood monocyte count predicted functional improvement in fibrotic ILD patients, while in those treated with anti-inflammatory drugs, only age had significant implications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"95daf6feb03299c5b7284843efb6632e54acaf74941d62f5ff826e6a56cd0236","category":"Interdisciplinary"}