{"title":"Misaligned factory robot may have sparked Chevy Bolt battery fires","link":"https://arstechnica.com/?p=1789646","date":1629908728000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/09/Bolt-Autocross-11-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/09/Bolt-Autocross-11.jpg\">Enlarge</a> (credit: Chevrolet)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>GM announced last Friday that it was<a href=\"https://arstechnica.com/cars/2021/08/gm-recalls-every-chevy-bolt-ever-made-blames-lg-for-faulty-batteries/\"> recalling every Chevrolet Bolt it had ever made</a>, including the new electric utility vehicle model that debuted this year. After a string of fires affected Bolt models, the company traced the problem to two simultaneously occurring defects in the cars’ LG Chem-made batteries.</p>\n<p>The automaker initially discovered the problem in batteries from one of LG’s Korean plants, and it recalled cars with those cells last November. But then more Bolts caught fire, and other LG plants were ensnared in the investigation, spurring two expansions of the recall. The problem, GM said, has been traced to a torn anode tab and a folded separator.<span> </span></p>\n<p>That’s all GM has said so far. It hasn’t said how widespread the defects are, nor has it said how, exactly, the fires started. But in what little information has been released, and in the timing of GM’s recalls, there are clues. To decipher them, Ars spoke with <a href=\"https://umbatterylab.engin.umich.edu/profile/greg-less/\">Greg Less</a>, technical director of the University of Michigan’s Battery Lab.</p></div><p><a href=\"https://arstechnica.com/?p=1789646#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789646&amp;comments=1\">Comments</a></p>","author":"Tim De Chant","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"95e19d94dd00c15a41d04e684f94a413f9a8c613c125b170355821837a73dacf","category":"Tech"}