{"title":"Estimation of effective number of breeders and effective population size in an abundant and heavily exploited marine teleost","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13758?af=R","date":1721633981000,"content":"<h2>Abstract</h2>\n<p>Obtaining reliable estimates of the effective number of breeders (<i>N</i>\n<sub>b</sub>) and generational effective population size (<i>N</i>\n<sub>e</sub>) for fishery-important species is challenging because they are often iteroparous and highly abundant, which can lead to bias and imprecision. However, recent advances in understanding of these parameters, as well as the development of bias correction methods, have improved the capacity to generate reliable estimates. We utilized samples of both single-cohort young of the year and mixed-age adults from two geographically and genetically isolated stocks of the Australasian snapper (<i>Chrysophrys auratus</i>) to investigate the feasibility of generating reliable <i>N</i>\n<sub>b</sub> and <i>N</i>\n<sub>e</sub> estimates for a fishery species. Snapper is an abundant, iteroparous broadcast spawning teleost that is heavily exploited by recreational and commercial fisheries. Employing neutral genome-wide SNPs and the linkage-disequilibrium method, we determined that the most reliable <i>N</i>\n<sub>b</sub> and <i>N</i>\n<sub>e</sub> estimates could be derived by genotyping at least 200 individuals from a single cohort. Although our estimates made from the mixed-age adult samples were generally lower and less precise than those based on a single cohort, they still proved useful for understanding relative differences in genetic effective size between stocks. The correction formulas applied to adjust for biases due to physical linkage of loci and age structure resulted in substantial upward modifications of our estimates, demonstrating the importance of applying these bias corrections. Our findings provide important guidelines for estimating <i>N</i>\n<sub>b</sub> and <i>N</i>\n<sub>e</sub> for iteroparous species with large populations. This work also highlights the utility of samples originally collected for stock structure and stock assessment work for investigating genetic effective size in fishery-important species.</p>","author":"Andrea Bertram, \nJustin Bell, \nChris Brauer, \nDavid Fairclough, \nPaul Hamer, \nJonathan Sandoval‐Castillo, \nMaren Wellenreuther, \nLuciano B. Beheregaray","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"95e1da92e38f8ca17c5e74667c88abf95149d6cda6c17a5256b93372eda87065","category":"Environment"}