{"title":"Droplet digital PCR for fish pathogen detection and quantification: A systematic review and meta‐analysis","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14019?af=R","date":1726480996000,"content":"<h2>Abstract</h2>\n<p>This study provides a comprehensive summary of the findings regarding the application and diagnostic efficacy of droplet digital PCR (ddPCR) in detecting viral and bacterial pathogens in aquaculture. Utilizing a systematic search of four databases up to 6 November 2023, we identified studies where ddPCR was deployed for pathogen detection in aquaculture settings, adhering to Preferred Reporting Items for Systematic Reviews and Meta-analysis of Diagnostic Test Accuracy guidelines. From the collected data, 16 studies retrieved, seven were included in a meta-analysis, encompassing 1121 biological samples from various fish species. The detection limits reported ranged markedly from 0.07 to 34 copies/μL. A direct comparison of the diagnostic performance between ddPCR with quantitative PCR (qPCR) proved challenging due to limited data, thus only a pooled sensitivity analysis was feasible. The results showed a pooled sensitivity of 0.750 (95% confidence interval [CI]: 0.487–0.944) for ddPCR, compared to 0.461 (95% CI: 0.294–0.632) for qPCR, with no statistically significant difference in sensitivity between the two methods (<i>p</i> = .5884). Notably, significant heterogeneity was observed among the studies (<i>I</i>\n<sup>2</sup> = 93%–97%, <i>p</i> &lt; .01), with the year of publication significantly influencing this heterogeneity (<i>p</i> &lt; .001), but not the country of origin (<i>p</i> = .49). No publication bias was detected, and the studies generally exhibited a low risk of bias according to QUADAS-C criteria. While ddPCR and qPCR showed comparable sensitivities in pathogen detection, ddPCR's capability to precisely quantify pathogens without the need for standard curves highlights its potential utility. This characteristic could significantly enhance the accuracy and reliability of pathogen detection in aquaculture.</p>","author":"Md Afsar Ahmed Sumon, \nEdinson Dante Meregildo‐Rodriguez, \nPo‐Tsang Lee, \nNguyen Dinh‐Hung, \nEarl T. Larson, \nPatima Permpoonpattana, \nHien Van Doan, \nWon‐Kyo Jung, \nNguyen Vu Linh","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"95eb022fe22ddd52c7cfaf1e58016c3ede98c0b8c3fa1bf27fd5d17ad2721c3d","category":"Environment"}