{"title":"The effects of adding various starches on the structures of restructured potato‐based dough and the oil uptake of potato chips","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13541?af=R","date":1713265711000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The material composition significantly influences the oil absorption and quality characteristics of fried food products. The oil absorption of restructured potato chips is highly dependent on the structural properties of the restructured potato-based dough produced prior to frying. In this study, three types of starch were added to modify the structure of the restructured potato-based dough, allowing the production of potato chips with less oil absorption.</p>\n<h2>Results</h2>\n<p>Distinct differences were observed among the three types of starch in terms of amylose content, chain length distribution, swelling power, solubility, crystalline structure, and pasting properties. The addition of wheat starch, corn starch, and tapioca starch changed the rheological properties, water distribution, and the strength of the restructured dough. Importantly, adding wheat starch and corn starch significantly lowered the oil content of potato chips by 7.94% and 13.06%, respectively. The reduction in oil absorption by potato chips was attributed to the increased strength of the starchy gel network of the dough, a slower rate of water evaporation, and a limitation of dough expansion during frying.</p>\n<h2>Conclusion</h2>\n<p>Adding wheat starch or corn starch to the restructured potato-based dough resulted in a decrease in the oil absorption of potato chips by creating a stronger starchy gel network in the dough. This study could guide the development of suitable material compositions, which are important for producing fried food products with lower oil content.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Jin Zhang, \nYang Ni, \nJinwei Li, \nLiuping Fan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"95fa9df7a2510417d2bb48c375a287a145bff6c4010fdc4a281b4319bd94aa5b","category":"Environment"}