{"title":"Russia threatens criminal charges against a NASA astronaut","link":"https://arstechnica.com/?p=1816881","date":1638285523000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/fullsizeoutput_d3d.jpeg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/fullsizeoutput_d3d.jpeg\">Enlarge</a> <span>/</span> Image of the hole in Soyuz MS-09 vehicle docked to the International Space Station in 2018. (credit: <a href=\"https://www.nasa.gov/multimedia/nasatv\">NASA TV</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Russian space corporation, Roscosmos, said it has completed an investigation into a \"hole\" found in a Soyuz spacecraft when the vehicle was docked to the International Space Station in 2018.</p>\n<p>Moreover, Roscosmos told the Russian publication <a href=\"https://ria.ru/20211126/kosmos-1760833889.html\">RIA Novosti</a> that it has sent the results of the investigation to law enforcement officials. \"All results of the investigation regarding the hole in the habitation module of the Soyuz MS-09 spacecraft were transmitted to Law Enforcement officials,\" Roscosmos said. No further details were provided.</p>\n<p>In Russia, the results of such an investigation are sent to law enforcement to allow officials to decide whether or not to initiate a criminal case, which would be akin to issuing an indictment. Russia does not have a grand jury system like in the United States, where investigators hand over their evidence to prosecutors, who decide whether to press charges.</p></div><p><a href=\"https://arstechnica.com/?p=1816881#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1816881&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"95fbe7365753433b18e546f0079b32678c14e570f9acce0e1b9049bb69d71926","category":"Tech"}