{"title":"Tailoring Alginate-Gelatin Hydrogels to Precisely Modulate Osteogenesis in Dental Pulp Stem Cells While Preserving Other Cellular Behaviors","link":"https://www.preprints.org/manuscript/202403.1674/v1","date":1711545611000,"content":"Alginate-gelatin (Alg-Gel) hydrogels have been used experimentally but not clinically associated with mesenchymal stromal / stem cells (MSCs) to guide bone tissue formation. One of the main challenges for its clinical application is optimizing Alg-Gel stiffness to guide osteogenesis. In this study, we investigated how Alg-Gel stiffness could modulate the dental pulp stem cell (DPSCs) attachment, morphology, proliferation, and osteogenic differentiation, identifying the optimal condition to uncouple osteogenesis from the other cell behaviors. An array of Alg-Gel hydrogels was prepared by casting different percentages of Alg and Gel being crosslinked with 2 % CaCl2. We selected two hydrogels, one with 11± 1 kPa called “low” stiffness and one with 55 ± 3 kPa called “high” stiffness. Hydrogel analyses showed that the average swelling rates were 20 ± 3% for low and 35 ± 2% for high hydrogels. The degradation percentage was 47 ± 5% and 18 ± 2% for low and high hydrogels, respectively. Both hydrogel types showed homogeneous surface shape and pro-tein (Alg-Gel) interaction with CaCl2 as assessed by FTIR-ATR and XPS. Cell culture showed good adhesion of the DPSCs to the hydrogels and proliferation. Furthermore, better osteogenic activity was obtained with high-stiffness hydrogels. In summary, this study confirms the possibility of characterizing and optimizing the stiffness of alginate-gelatin gel to guide osteogenesis in vitro without altering other cellular properties of DPSCs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9608dacd1e5ff5d05d960f1bfe6484f6848044d58d77906ce658e0c0b5bab031","category":"Interdisciplinary"}