{"title":"Factors Associated with the Occurrence and Complications of Arterial Hypertension at the Sangm&eacute;lima Referral Hospital &ndash; Cameroon","link":"https://www.preprints.org/manuscript/202409.0548/v1","date":1725618655000,"content":"Summary: Hypertension is a public health problem with serious social, economic, and health consequences. The World Health Organisation (WHO) estimates that 1 in 3 adults worldwide suffers from hypertension. In Cameroon, the prevalence of hypertension is estimated at 35%, with nearly 17,000 deaths recorded each year. This study aimed to determine the factors associated with the occurrence and complications of hypertension at the Sangmélima Referral Hospital (HRS). A total of 528 patients treated in the cardiology department of the HRS were identified between January and December 2023. The data were analyzed using SPSS 28 software. Binary logistic regression determined the odds ratios and 95% confidence intervals associated with each variable. Differences were statistically significant for a p-value &amp;lt; 0.05. At the HRS, the annual incidence of hypertension was 16.13%. Hypertension was present in 78.8% of patients. The factors associated with the occurrence and complications of hypertension were age (OR=1.028; p=0.003 ), level of education (OR=15.49; p=0.023), marital status (OR=3.859; p=0.04), hypercholesterolemia (OR=2.856; p=0.01), monthly income (OR=0.882; p=0.026), number of dependents (OR=1.231; p=0.025), food security (OR=16.666; p&amp;lt;0.001), tobacco consumption (OR=8.592; p=0.041), fruit and vegetable consumption (OR=0.027; p=0.031), salt/sugar consumption (OR=8.129; p&amp;lt;0.001), place of residence (OR=4.794; p=0.005), access to essential technologies (OR=8.851; p=0.002), and use of traditional care (OR=3.137; np=0.032). HTA at the HRS is associated with several factors. In order to limit the impact of hypertension, it is crucial to emphasize improving socioeconomic and health conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"960c3094316c07abc7bd04c835f48c9e3d4851cdcb3d4df2618202fb6d780903","category":"Interdisciplinary"}