{"title":"A hierarchical constrained density regression model for predicting cluster‐level dose‐response","link":"https://onlinelibrary.wiley.com/doi/10.1002/env.2880?af=R","date":1724741333000,"content":"<h2>Abstract</h2>\n<p>With the advent of new alternative methods for rapid toxicity screening of chemicals comes the need for new statistical methodologies which appropriately synthesize the large amount of data collected. For example, transcriptomic assays can be used to assess the impact of a chemical on thousands of genes, but current approaches to analyzing the data treat each gene separately and do not allow sharing of information among genes within pathways. Furthermore, the methods employed are fully parametric and do not account for changes in distribution shape that may occur at high exposure levels. To address the limitations of these methods, we propose Constrained Logistic Density Regression (COLDER) to model expression data from different genes simultaneously. Under COLDER, the dose-response function for each gene is assigned a prior via a discrete logistic stick-breaking process (LSBP) whose weights depend on gene-level characteristics (e.g., pathway membership) and atoms consist of different dose-response functions subject to a shape constraint that ensures biological plausibility. The posterior distribution for the benchmark dose among genes within the same pathways can be estimated directly from the model, which is another advantage over current methods. The ability of COLDER to predict gene-level dose-response is evaluated in a simulation study and the method is illustrated with data from a National Toxicology Program study of Aflatoxin B1.</p>","author":"Michael L. Pennell, \nMatthew W. Wheeler, \nScott S. Auerbach","siteTitle":"Wiley: Environmetrics: Table of Contents","siteHash":"4718a208dff669d8713b9a4772fb9e30bd4e6b10bc59ba738841df9ffc8f1e42","entryHash":"960f276896f155939259ac90ea71161c58179229637b74432d51bf68acc9bb45","category":"Environment"}