{"title":"Some New MacOS 12 Monterey Features Are Unavailable on Intel-Based Macs","link":"https://www.macrumors.com/2021/06/09/macos-monterey-features-for-m1-macs-only/","date":1623354682000,"content":"\n<p>Joe Rossignol, writing for MacRumors:</p>\n\n<blockquote>\n  <p>On the <a href=\"https://www.apple.com/macos/monterey-preview/\">macOS Monterey features page</a>, fine print indicates\nthat the following features require a Mac with the M1 chip,\nincluding any MacBook Air, 13-inch MacBook Pro, Mac mini, and iMac\nmodel released since November 2020:</p>\n\n<ul>\n<li>Portrait Mode blurred backgrounds in FaceTime videos</li>\n<li>Live Text for copying and pasting, looking up, or translating\ntext within photos</li>\n<li>An interactive 3D globe of Earth in the Maps app</li>\n<li>More detailed maps in cities like San Francisco, Los Angeles,\nNew York, and London in the Maps app</li>\n<li>Text-to-speech in more languages, including Swedish, Danish,\nNorwegian, and Finnish</li>\n<li>On-device keyboard dictation that performs all processing\ncompletely offline</li>\n<li>Unlimited keyboard dictation (previously limited to 60 seconds\nper instance)</li>\n</ul>\n\n<p>Apple has not explained why any of these features are not\navailable on Intel-based Macs. For what it’s worth, Google Earth\nhas long offered an interactive 3D globe of the Earth on\nIntel-based Macs both on the web and in an app.</p>\n</blockquote>\n\n<p>I don’t think Apple has to explain. These features all clearly are built on code that uses features exclusive to Apple Silicon. E.g. for Portrait Mode in FaceTime, it uses the M1 imaging pipeline — the same thing that makes all FaceTime footage on the M1 MacBooks look so much better than on any Intel MacBook, even though the camera hardware is the same. The speech/dictation features on this list are surely using the Neural Engine, something Intel Macs don’t even have.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/06/10/macos-monterey-features-not-available-on-intel-macs\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9616b1ce8cf7abacde7284bb1a5740413e7ca50482df4e09ded4d8b8856c5461","category":"Tech"}