{"title":"Soilless cultivation systems to produce tailored microgreens for specific nutritional needs","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13222?af=R","date":1710911381000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The awareness of the importance of following dietary recommendations that meet specific biological requirements related to an individual's health status has significantly increased interest in personalized nutrition. The aim of this research was to test agronomic protocols based on soilless cultivation for providing consumers with new dietary sources of iodine (I), as well as alternative vegetable products to limit dietary potassium (K) intake; proposed cultivation techniques were evaluated according to their suitability to obtain such products without compromising agronomic performance.</p>\n<h2>RESULTS</h2>\n<p>Two independent experiments, focused on I and K respectively, were conducted in a commercial greenhouse specializing in soilless production. Four different species were cultivated using three distinct concentrations of I (0, 1.5 and 3 mg L<sup>−1</sup>) and K (0, 60 and 120 mg L<sup>−1</sup>). Microgreens grown in I-rich nutrient solution accumulate more I, and the increase is dose-dependent. Compared to unbiofortified microgreens, the treatments with 1.5 and 3 mg L<sup>−1</sup> of I resulted in 4.5 and 14 times higher I levels, respectively. Swiss chard has the highest levels of K (14 096 mg kg<sup>−1</sup> of FW), followed by rocket, pea and radish. In radish, rocket and Swiss chard, a total reduction of K content in the nutrient solution (0 mg L<sup>−1</sup>) resulted in an average reduction of 45% in K content.</p>\n<h2>CONCLUSION</h2>\n<p>It is possible to produce I-biofortified microgreens to address I deficiency, and K-reduced microgreens for chronic kidney disease-affected people. Species selection is crucial to customize nutritional profiles according to specific dietary requirements due to substantial mineral content variations across different species. © 2023 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Massimiliano D'Imperio, \nLucia Bonelli, \nCarlo Mininni, \nMassimiliano Renna, \nFrancesco Fabiano Montesano, \nAngelo Parente, \nFrancesco Serio","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"962827ac280a03ad7229d6b1e25282bbf034dfd76fa92cddc99be7787cc32380","category":"Environment"}