{"title":"Aqara Releases Video Doorbell G4 With Facial Recognition and HomeKit Secure Video Support","link":"https://www.macrumors.com/2023/03/23/aqara-video-doorbell-g4-homekit/","date":1679564311000,"content":"Smart home accessory maker Aqara today launched its first video doorbell, the <a href=\"https://www.aqara.com/en/product/smart-video-doorbell-g4\">HomeKit-enabled G4 with facial recognition</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/aqara-G4-launch.jpg\" alt width=\"800\" height=\"445\" />\r<br />\nThe Video Doorbell G4 features a 1080p camera and is compatible with ‌HomeKit Secure Video‌, along with support for local streaming to Amazon Alexa and Google Home smart devices. \r<br />\n\r<br />\nIt features on-device AI facial recognition, which can trigger customized automations for different people. For example, a \"welcome home\" scene is activated when the G4 recognizes a family member coming home. Or in the case that it detects the postman, the doorbell will play a pre-recorded message. \r<br />\n\r<br />\nThe battery-powered video doorbell supports both wireless and wired installation and can use a pack of six AA batteries that lasts about four months, according to Aqara. Alternatively, users can opt to wire the G4 doorbell to an AC/DC transformer for 24/7 recording, and use the battery pack as a back-up power source. \r<br />\n\r<br />\nThe doorbell also offers adjustable sensitivity, configurable motion detection, and a power saving mode for users who live in a high traffic area to extend the battery life. Additionally, the G4's chime repeater, which has a 95 dB speaker, includes a USB-C port, allowing users to place the repeater indoors.\r<br />\n\r<br />\nVideo footage can be stored locally or remotely via iCloud or the Aqara platform. The latter offers subscription-free cloud storage of up to seven days of critical event clips such as motion detection, facial recognition, doorbell ring, and tamper alerts. \r<br />\n\r<br />\nPriced at $119.99, the <a href=\"https://www.aqara.com/en/product/smart-video-doorbell-g4\">Aqara Smart Video Doorbell G4</a> comes in both Shadow Gray and Black colors, with optional local storage via a microSD card slot. Support for the new Matter standard will come via a future over-the-air update, according to Aqara. The G4 is available on <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fstores%2FAqara%2Fpage%2FC2BFB250-C977-49DB-99B1-C8392CDC7B7C%3Fref_%3Dast_bln\">Amazon</a> in both North America and Europe, as well as selective Aqara retailers worldwide.<div>Tags: <a href=\"https://www.macrumors.com/guide/homekit/\">HomeKit</a>, <a href=\"https://www.macrumors.com/guide/homekit-secure-video/\">HomeKit Secure Video</a>, <a href=\"https://www.macrumors.com/guide/aqara/\">Aqara</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/23/aqara-video-doorbell-g4-homekit/\">Aqara Releases Video Doorbell G4 With Facial Recognition and HomeKit Secure Video Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/aqara-releases-video-doorbell-g4-with-facial-recognition-and-homekit-secure-video-support.2384527/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"962bcf1cb206d3488a5abe7ff5364bc1d3dc361cf4e11f35e011531eb5ce4098","category":"Apple"}