{"title":"The iPad-Mac hybrid we all want is now a reality–as a weird Vision Pro accessory","link":"https://www.macworld.com/article/2257592/ipad-mac-hybrid-apple-refused-to-make.html","date":1709738887000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>It would seem odd, to a time traveler from the year 2012, that the post-PC world still hasn’t materialized and Apple continues to sell traditional laptops. Not only has the iPad failed to displace the MacBook, but it hasn’t even been combined with it as a hybrid device, despite vociferous customer interest in such a product.</p>\n\n\n\n<p>One Apple follower, indeed, has become so frustrated with the continued non-existence of an iPad-MacBook hybrid that he has taken matters into his own hands. Federico Viticci, the tech writer and podcaster who founded MacStories, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macstories.net/stories/macpad-how-i-created-the-hybrid-mac-ipad-laptop-and-tablet-that-apple-wont-make/&amp;xcust=1-1-2257592-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">announced Monday</a> that he had finished work on what he describes as the “MacPad,” a bizarre-looking mashup of the two products. It combines a full-size keyboard from a MacBook Air with an 11-inch iPad Pro. Viticci tried a 12.9-inch Pro, which is closer in size to the 13-inch MacBook Air, but found that, while it obviously looked better, it was too heavy.</p>\n\n\n\n<p>The article explaining the method and rationale behind this project is <em>very</em> long and technical, and (we would guess) way outside the comfort zone of the average DIY enthusiast. It’s also extremely impressive, in the same way that eating two <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.marksandspencer.com/personalised-giant-colin-the-caterpillar-cake-serves-40-/p/ckp21041637&amp;xcust=1-1-2257592-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Colin the Caterpillar cakes</a> would be impressive: you’d shake the guy’s hand while wondering why he thought it was a good idea.</p>\n\n\n\n<p>For years I’ve felt that an iPad-Mac hybrid is a non-starter, for two main reasons: touchscreen laptops are annoying to use–it isn’t a natural complement to a keyboard and trackpad, and reaching up to touch a vertically aligned screen is tiring–and iPads are already good enough at being convertible laptop substitutes that there isn’t a compelling case for reinventing the wheel. But Viticci has managed to find a niche use case in which the MacPad just about makes sense.</p>\n\n\n\n<p>The key is Vision Pro and its currently unsatisfactory typing support. (In our <a href=\"https://www.macworld.com/article/2231451/apple-vision-pro-review.html\">review</a> we explain that “if you want to type sentences, pairing a Bluetooth keyboard is <em>mandatory</em>.”) Viticci says he tried using Apple’s Magic Trackpad and Keyboard with the headset, among other options, but kept coming back to the conclusion that the best keyboard setup would be an actual MacBook. But that this MacBook would be heavier than it needed to be, and less versatile because most of the time he wouldn’t be using its screen. Hence the desire to saw off a MacBook’s screen and turn it into an iPad dock.</p>\n\n\n\n<p>I can just about see the logic behind all of this in a perfectionist and hyperspecific niche. (Hardly anyone has bought a Vision Pro headset, and almost all of those have found that a conventional Bluetooth keyboard is more than adequate for typing.) But the MacPad project feels like something that was done to demonstrate what could be done rather than as a practical necessity. Viticci was so preoccupied with whether or not he could, he didn’t stop to think if he should.</p>\n\niPad, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"96305789956da447d13844589ad0403ed15b57fe85d74608d33cf90ef16bdbd7","category":"Apple"}