{"title":"Saprolegniosis in aquaculture and how to control it?","link":"https://onlinelibrary.wiley.com/doi/10.1002/aff2.200?af=R","date":1721295070000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c1b45564-9b9e-47ec-8596-052c50b36bd3/aff2200-gra-0001-m.png\" alt=\"Saprolegniosis in aquaculture and how to control it?\" />\n<p>This review combines the current knowledge regarding the predisposing factors to <i>Saprolegnia</i> infections and current methods to prevent and treat it, including those under further research. So far, many compounds have been tested and studied, but an effective, suitable and safe compound to treat saprolegniosis remains to be found. \n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Saprolegniosis, also called water mould, induces a cotton or wool-like white growth on fish skin. It can kill fish at all stages of life, from eggs to adults. It is caused by oomycetes from the genus <i>Saprolegnia</i> and causes fish mortality and huge financial losses to fish farms and hatcheries. <i>Saprolegnia</i> species are endemic and ubiquitous in all freshwater habitats around the world. The exposing factors for saprolegniosis are still largely unknown, but stressors such as temperature shocks, poor water quality, handling and high fish density have been associated with outbreaks. For decades, malachite green was the most effective treatment against <i>Saprolegnia</i> infection, but it has been banned due to its carcinogenic and toxic effects. This has forced farmers to use alternative disinfection methods against <i>Saprolegnia</i> infection, such as hydrogen peroxide, formalin, Bronopol, NaCl, acetic acid and ozone, although many may have safety concerns or are impractical to use. This has led to the investigation of plant-based compounds with antifungal and antibacterial properties against saprolegniosis. These include extracts of certain herbs, onion, garlic, extracts of the plant <i>Chrysanthemum</i>, essential oils of <i>Eryngium campestre</i>, <i>Mentha piperita</i>, <i>Cuminum cyminum</i> and <i>Thymus linearis</i>, which include a variety of phenolic compounds and fatty acids with antifungal properties. This review combines the current knowledge regarding the predisposing factors to <i>Saprolegnia</i> infections and current methods to prevent and treat them, including those under further research. Thus far, many compounds have been tested and studied, but an effective, suitable and safe compound to treat <i>Saprolegnia</i> infection remains to be found.</p>","author":"Petra Camilla Lindholm‐Lehto, \nPäivi Pylkkö","siteTitle":"Wiley: Aquaculture, Fish and Fisheries: Table of Contents","siteHash":"a2be1e788988f9ff9949a6f7f759773ae166678ee7c383b954a977541fbea3ff","entryHash":"9638778677e7c33e07c5ab5ff2c8936ca14690bc08c1d4d76405f5093021b366","category":"Environment"}