{"title":"Physical Literacy and Physical Activity in Early Years Education: What&rsquo;s Known, What&rsquo;s Done, and What&rsquo;s Needed?","link":"https://www.preprints.org/manuscript/202410.1901/v1","date":1729758300000,"content":"Physical literacy (PL) is increasingly recognised as essential to fostering lifelong physical activity (PA) engagement, particularly when nurtured in early childhood. However, there remains limited understanding of how key stakeholders in early years (EY) education perceive, value, and implement a PL informed approach. This exploratory study aimed to investigate a variety of EY stakeholders' knowledge and beliefs regarding PL and PA in relation to 3-5-year-olds. A concurrent mixed-methods approach was used, incorporating semi-structured expert interviews (n=11), focus groups (n=22), and a survey (n=210) to gather both qualitative and quantitative data. Thematic analysis was applied to identify key themes, and survey data was analysed to complement and triangulate qualitative findings. Findings revealed variation in stakeholders' awareness of PA recommendations, confusion over terminology, and the influence of environmental and policy constraints on practice. Stakeholders acknowledged the importance of PL but expressed uncertainty about the connection between academic theory and practical application. Resource limitations, conflicting priorities, and lack of training and policy support emerged as key barriers. Feedback on an educational PL-EY model was generally positive, emphasising its potential educational value while underscoring the need for clearer guidance and support. Given the pivotal role of EY education in shaping children’s behaviours, health, and well-being, this study highlights the necessity of a holistic approach to interventions, strong stakeholder involvement, and evidence-based practices to foster PL in EY children and raises critical questions about what effective interventions to develop PL in this age group should consider and look like.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"963ce7911b61b0fbecbdab18b1e9d57be08ad7c5460054012e244778807be9bd","category":"Interdisciplinary"}