{"title":"Apple Apologizes to Developer After Indigenous Language App Wrongly Removed From App Store","link":"https://www.macrumors.com/2021/02/10/apple-apologizes-indigenous-app-pulled-store/","date":1612951106000,"content":"Apple has apologized to the developer of an app meant to promote the Indigenous language Sm'algyax after he was falsely accused of dishonest and fraudulent acts, and as a result, had the app removed from the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/appstore.jpg\" alt=\"\" width=\"2000\" height=\"1032\" class=\"aligncenter size-full wp-image-730995\" />\r\n<br/>\r\nBrendan Eshom, a member of the Ts'msyen First Nation community, developed and published \"Sm'algyax Word\" on both Google Play and the &zwnj;App Store&zwnj; this past July. The app serves as a dictionary for phrases and words from Sm'algyaxm archived from FirstVoices.com, and at its core is meant to preserve the language for generations to come.\r\n<br/>\r\n\r\n<br/>\r\nHowever, the app was unexpectedly removed from the &zwnj;App Store&zwnj; when it acquired around 600 downloads, pushing it to the top charts in the Education category. Eshom says that he received an automated email from Apple informing him that his developer account would be terminated due to \"dishonest and fraudulent\" acts that go against Apple's terms and conditions.\r\n<br/>\r\n\r\n<br/>\r\nEshom told <a href=\"https://globalnews.ca/news/7631117/apple-indigenous-language-app-apology/\"><em>Global News</em></a> that it's \"definitely concerning when Apple is accusing you of committing fraud\" and said that he attempted to reach out to Apple for an explanation for his termination, but his attempts were unsuccessful. The freshmen college student ultimately decided to contact Consumer Matter, a segment from <em>Global News</em> in which companies and corporations are pressed for answers, to try and get Apple to respond to the situation.\r\n<br/>\r\n\r\n<br/>\r\nApple responded in a statement to Consumer Matters, explaining that the termination of Eshom's developer account was a mistake and that his app about the Sm'algyax language showcased \"how technology can be used to bridge cultural understanding.\" Apple goes on to apologize to Eshom and promises to improve its processes to ensure it does not happen again. \r\n<br/>\r\n<blockquote>Maintaining the integrity of the &zwnj;App Store&zwnj; is a responsibility we take seriously to ensure the safety of our customers and give every developer a platform to share their brightest ideas with the world. Unfortunately, this developer's app, which is a great example of how technology can be used to bridge cultural understanding, was mistakenly removed from the &zwnj;App Store&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\nWe regret this error and apologize to Mr. Eshom for the inconvenience this caused him. We have since reinstated his developer account and app, and will continue our efforts to improve our processes to ensure this does not happen again.</blockquote>Just this week new questions <a href=\"https://www.macrumors.com/2021/02/09/scam-apps-ios-making-millions-revenue/\">started to circulate</a> following the revelation that scam apps on the &zwnj;App Store&zwnj; continue to enjoy millions in revenue. Apple <a href=\"https://developer.apple.com/app-store/review/guidelines/\">states</a> that apps that attempt to trick users or engage in \"scam practices\" will be removed from the &zwnj;App Store&zwnj;, however many still remain. \r\n<br/>\r\n\r\n<br/>\r\nThe contrast between Eshom's case, where a completely innocent app was removed from the &zwnj;App Store&zwnj;, and the case of scam apps roaming rogue on the platform highlights recent concerns that Apple's losing grip with implementing and maintaining an effective moderation policy.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/10/apple-apologizes-indigenous-app-pulled-store/\">Apple Apologizes to Developer After Indigenous Language App Wrongly Removed From App Store</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/apple-apologizes-to-developer-after-indigenous-language-app-wrongly-removed-from-app-store.2284096/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4mmqz4TWRqM:WdOOewztfUI:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=4mmqz4TWRqM:WdOOewztfUI:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/4mmqz4TWRqM\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9647ec4f2d878584dbb60e2aeade09514be32dba6fa1db9866a17fb136073ffd","category":"Apple"}