{"title":"Single Nucleotide Polymorphisms in Skeletal Muscles of Myogenin and Myostatin Genes of the Nile Tilapia (Oreochromis niloticus)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/1647910?af=R","date":1683010800000,"content":"<p>The present study was conducted on the Nile tilapia (<i>Oreochromis niloticus</i>) and screened for single nucleotide polymorphisms (SNPs) in the muscle hormone genes myogenin (MyoG) and myostatin (MSTN). Samples were collected from the JangHang fish farm and categorized by body weight and sex. The average total weight was 1.02 kg for the 82 males and 0.63 kg for the 70 females. A body weight in the range of the average weight ±10% was considered as normal weight. Target regions of each gene were categorized, such as the promoter region, 5′-untranslated region (5′UTR) and 3′UTR. Genomic deoxyribonucleic acid (gDNA) was extracted, amplified, sequenced, aligned, and screened for the presence of nucleotide variations. Three SNPs, 1,875T&gt;A, 1,892C&gt;T, and 1,946A&gt;G, and one insertion (TGA​CAT​ATT​TCC​CTC​ACA) at 2,138–2,145 were detected in the 3′UTR of the MyoG gene. However, within the MSTN gene, one insertion at 450 (T) and two SNPs at 536 (G&gt;A and A&gt;A) were found in the 5′UTR. In addition, four insertions at 1,278–1,279 (GT, T, TGT, and G) and one short tandem repeat (STR) at 1,129 (TG) in Exon 1, two SNPs at 4,438 (3′UTR; A&gt;C and C&gt;C), and two SNPs at 4,514 (3′UTR; G&gt;A and A&gt;A) were identified. Principal component analysis (PCA) and statistical analyses were performed to evaluate the relationships between the SNPs and body weight, forming 6 and 41 genotype blocks in the MyoG and MSTN genes, respectively. We found significant correlations between the SNPs and body weight traits for the effective genotype blocks GBG-1, GBG-3, and GBG-4 of MyoG and GBN-1, GBN-2, GBN-3, GBN-4, GBN-13, GBN-22, and GBN-24 of MSTN. These outcomes would be significant for fish breeding and may help obtain data for use in genetic marker kits. In some instances, genetic marker kits have a distinct advantage for improvement in genetics, parentage control, identification of species, and enhancing breeding stock and its applications in aquaculture.</p>","author":"Namrata Rambhau Jawanjal, \nHanchen Zhang, \nJun Young Chae, \nByungHwa Yoo, \nMin Sun Kwon, \nHyung Ho Lee, \nUmit Acar","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"964973a0cfe065d2f649a0e3403c92437c6b95137f950dda9d1c0de94f9fc2f7","category":"Environment"}