{"title":"Decades of artificial nests towards African penguin conservation—Have they made a difference?","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12388?af=R","date":1729137669000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/91d51b6e-e639-4aa7-a006-ecf48689eb0f/eso312388-toc-0001-m.png\" alt=\"Decades of artificial nests towards African penguin conservation—Have they made a difference?\" />\n<p>Several types of artificial nests have been deployed in major colonies of endangered African penguins for the past decade to compensate for the reduction of suitable breeding habitat. These nests successfully increase African penguin productivity, but the variety of habitats and threats faced in different colonies further calls for colony-specific conservation strategies, including increasing access to prey beyond artificial nests.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAfrican penguins are among the most threatened seabird species globally and an African Penguin Biodiversity Management Plan (BMP) published in 2013 guides conservation strategies to prevent their extinction. To counter the impact of past guano exploitation which reduced the nesting habitat of these burrowing seabirds, rendering them vulnerable to predators and extreme weather events, a suite of artificial nests was deployed in various colonies over the past decades with varying success. The BMP called for new nest designs to maximise breeding output.\n\nThis study assesses African penguin breeding success over the past 14 years in four types of artificial nests and in natural nests at all major colonies in South Africa.\n\nOverall, artificial nests outperformed natural nests and successfully increased breeding output of African penguins by 16.5% (95% CI: 6.7–26.2). No design was, however, consistently most effective across locations. For example, fibreglass nests had the poorest hatching success of all nest types at one colony (Bird Island), but outperformed cement nests at another (Boulders Beach). The latest design of double-layered ceramic nests tended to perform better than other artificial nests, although not consistently at all colonies and occupancy rates were low in some areas.\n\n<i>Practical implication</i>. The deployment of artificial nests proved to be a successful conservation measure for African penguins although the variety of habitats in the different colonies seems to have prevented a one solution-fits-all approach. The consistent poor breeding output in some areas in all nest types (&lt;30% at the mainland colony in Simons' Town and the islands in Algoa Bay) further calls for colony-specific conservation strategies beyond artificial nests, while the continuous decline in African penguin numbers globally calls for broader measures urgently, primarily increasing access to their forage fish prey.\n</p>","author":"L. Pichegru, \nR. B. Sherley, \nT. Malan, \nB. J. Barham, \nK. Ludynia, \nD. Geldenhuys, \nK. Amos, \nP. J. Barham, \nE. Drost, \nV. Hahndiek, \nA. Hufke, \nC. Hugo, \nC. Lawrence, \nC. McGeorge, \nA. M. McInnes, \nA. M. Makhado, \nM. Mashau, \nR. Milne, \nA. Purves, \nM. Slier, \nC. van der Merwe, \nN. J. van Wilgen, \nL. Waller","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"96554c41bde2722d23046c1a27882a8db44f4feec5a61752f789c57fdbea9d2a","category":"Environment"}