{"title":"Consumer behavior in the model of the circular economy in the field of handling discarded items","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300707","date":1711029600000,"content":"<p>by Otakar Ungerman, Jaroslava Dědková</p>\r\n\r\nThe circular economy is a way of eliminating the shortage of raw materials that Europe is currently facing. However, it is necessary to explicitly identify the problems that prevent greater involvement in the CE. This article is focused on consumers and how they treat discarded or non-functional items. The aim was to fill the research gap, i.e. to compile a suitable CE model and define a methodology that would ensure the efficient disposal of non-functional or unsuitable items by consumers. An original methodology was drawn up to conduct the representative research, designed to lead to the practical application of the proposed CE model. The research explored how consumers treat non-functional or unsuitable items, the costs they incur in discarding, renovating, reusing, and recycling such items, and the alternative costs of unsorted municipal waste. After the data had been implemented into the model the circular economy was proven to have an economic benefit for the national economy in all groups. However, the economic disadvantage for consumers was also calculated, where the cost of involvement in the CE is higher than the cost of unsorted municipal waste. This means that people are motivated to play a part in the CE more by their own responsible approach to life, or social pressure from those around them. Based on this research it may be said that economic aspects are one reason that consumers tend to be reluctant to get more involved in the CE. Unless there is a significant rise in the cost of municipal waste that would motivate consumers to move towards the CE for financial reasons, in order to support the CE consumers need to be better stimulated, educated and informed as much as possible through the media.","author":"Otakar Ungerman","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9665df228677bf933e4828dc7c82d042035aeec0e659a8bee7efcb467481b58a","category":"Interdisciplinary"}