{"title":"Who in England Engages in Outdoor Water-Based Recreation and Who Does the Most?","link":"https://www.preprints.org/manuscript/202403.0799/v1","date":1710399953000,"content":"Visits to coastal and inland-waterways have strong associations with many health and economic benefits but are also opportunities for exposure to environmental pollution.  In England, few balanced survey samples exist which can facilitate accurate identification of correlates with recreation in blue spaces. This information could support risk assessment for likelihood of exposure and message targeting in case of environmental threats.  We process data from a recent (2022-2023) and large (n = 177,551) survey of English residents to describe demographic, seasonal and regional correlates with any participation in water-based recreational activities in previous year (logistic regression model), and in the previous 28 days (zero-inflated negative binomial regression).  Activities studied were: surfing and paddleboarding; open water swimming; scuba-diving and snorkelling; canoeing and kayaking; angling.  Summer was associated with most frequent participation, winter with fewest sessions except for rowing.  Anglers were group most likely to be socially vulnerable: less likely to be university educated, more likely to be disabled and especially likely to be male.  People resident in rural locations were more likely to participate at least once in prior year, but did not have higher participation rates in the previous 28 days.  Regional variations in specific activities may suggest where demand for water recreation is unmet.  The results provide a reference description of outdoor water-recreationalists doing specific types of activity in England and may be useful when designing emergency messages and otherwise setting policy with regard to management of microbiological, radiological or chemical hazards in coastal and inland waters.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9669a3812d97fa4682689dc647e695158dfb76461d2d1f671a10405bc04a2d37","category":"Interdisciplinary"}