{"title":"Apple’s Vision Pro Developer Kit terms are wild","link":"https://www.macworld.com/article/2009563/vision-pro-developer-kit-terms-conditions-private-secure-line-of-sight.html","date":1690386749000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Vision Pro headset</a> doesn’t arrive until next year, but developers can get their hands on one now. It’s unclear whether Apple is charging for the Vision Pro developer kit as it did with the <a href=\"https://www.macworld.com/article/234360/geekbench-results-for-the-apple-silicon-developer-transition-kit-surface-online.html\">Developer Transition Kit</a> for Apple silicon, but regardless of cost, developers might want to read the terms and conditions before applying to receive loaner units.</p>\n\n\n\n<p>Among the terms and conditions developers must agree to are that the Vision Pro is never moved from the address and is never left unattended when in use. That’s fair, but they only get more stringent from there. Here are some of Apple’s terms in the agreement (DK stands for Developer Kit):</p>\n\n\n\n<ul>\n<li>You agree that all access to, usage of, and storage use of the DK will be in a private, secure workspace accessible only by You and Your Authorized Developers (e.g., fully enclosed with solid doors, floors, walls and ceiling, and locks that can be engaged when the DK is in use). </li>\n\n\n\n<li>You must ensure that unauthorized persons (including any family, friends, roommates or household employees) do not access, view, handle, or use the DK. </li>\n\n\n\n<li>When in use, the DK should be in your positive control (on your person or within Your direct line of sight) at all times. </li>\n\n\n\n<li>When not in use, turn off the DK and store it in its locked Pelican case in a locked space that only You have access to (e.g., a locked room or closet, a safe or locked drawer). </li>\n\n\n\n<li>If You will be away from Your workspace for more than 10 days, consult with Your Apple point of contact about how to keep the DK safe while You are away. </li>\n\n\n\n<li>Neither You nor Your Authorized Developers may display, demonstrate, video, photograph, make any drawings or renderings of, or take any images or measurements of or run any benchmark tests or other competitive analysis on the DK.</li>\n</ul>\n\n\n\n<p>For a product that’s already been revealed, those are very intense terms. Apple says it will suspend the account of any developer that breaches any of these terms. We suspect the penalty will be steeper than that.</p>\n\n\n\n<p>The good news is you don’t actually need a Vision Pro Developer Kit to test your spatial computing apps. Apple this week released the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/download/all/?q=visionOS&amp;xcust=1-1-2009563-1-0-0&amp;sref=https://www.macworld.com/feed\">second visionOS beta</a> so developers can build apps for the headset using Xcode on their Mac. </p>\n\nApple Inc, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"96696bd5ea85426ee6ac44d8aa46e23402026e341e35b37bce1c897363f7a9d3","category":"Apple"}