{"title":"How Authentic Leadership Influences Socially Responsible Behavior? Sequential Mediation of Psychological Empowerment and Psychological Capital and Moderating Role of Perceived Corporate Social Responsibility.","link":"https://www.preprints.org/manuscript/202406.1765/v1","date":1719312118000,"content":"This study investigates the relationship between authentic leadership and socially responsible behavior among employees in Saudi Arabia's service sector. Utilizing social cognitive theory as the theoretical framework, the research proposes that authentic leadership indirectly influences socially responsible behavior through psychological empowerment and psychological capital as parallel and serial mediators. Additionally, the study examines the moderating effect of CSR perceptions on these relationships. A cross-sectional survey was conducted with 349 professionals from the service sector. The results, analyzed using partial least squares structural equation modeling (PLS-SEM), revealed that authentic leadership does not directly impact SRB. Instead, the relationship is fully mediated by psychological empowerment and psychological capital. Moreover, CSR perceptions significantly moderate the relationship between authentic leadership and psychological empowerment, as well as the indirect effects of authentic leadership on SRB through psychological empowerment and psychological capital. The findings highlight the importance of fostering an authentic leadership style and how psychological resources of empowerment, and psychological capital carry forward this effect to promote SRB in the service sector. Additionally, the study underscores the role of CSR perceptions in strengthening the impact of authentic leadership on employee outcomes. The research contributes to the literature on leadership, CSR, and employee behavior, and offers practical implications for organizations aiming to enhance their social responsibility initiatives.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"966b11aaadf729cb1fd8211824d4bf6d35b1a9df256f109a31629dcec18c840e","category":"Interdisciplinary"}