{"title":"The weight of expectation: Lotte Kopecky defies obstacles to deliver for Belgium","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/the-weight-of-expectation-lotte-kopecky-defies-obstacles-to-deliver-for-belgium","date":1691957225000,"content":"\n      <p>For a rider hyped up as the overwhelming favourite to win the rainbow jersey this year, there were an awful lot of factors playing against Lotte Kopecky.</p>\n<div></div>\n<p>If it wasn't already obvious, she proved herself to be the very best puncheur in the world during the spring campaign, producing a brilliant series of results that saw her place runner-up at Strade Bianche and Amstel Gold Race and take victory at Omloop Het Nieuwsblad and the Tour of Flanders. The latter victory in particular was a promising omen, as the multiple short steep climbs and excessive length of that race perhaps drew most resemblance to <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/uci-road-world-championship-2023-route-all-you-need-to-know-about-the-routes-for-the-men-s-and-womens-races\">the course</a> In Glasgow (albeit with a lot less corners).</p>\n<p>And in terms of recent form, her performance at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a> a few weeks ago was truly sensational. The way she powered away solo to win the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-it-s-still-all-about-sd-worx-and-other-teams-need-to-wake-up\">opening stage</a> in Clermont-Ferrand, and then defended the yellow jersey during the subsequent days, was vintage Kopecky, and suggested she had her very best legs leading into the Worlds. But the way she then climbed better than she has ever done in her life on the Tourmalet, and better than surely anyone believed she was capable of, to seal an unexpected second overall on the GC, was a revelation, evidence that she had broken through to a whole new level.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/super-legs-but-a-flat-tyre-and-strict-instructions-annemiek-van-vleuten-s-bittersweet-ending\"><strong><em>Read more: 'Super legs' but a flat tyre and strict instructions: Annemiek van Vleuten’s bittersweet ending</em></strong></a></p>\n<p>If she was in strong enough form to place second overall at the Tour de France Femmes, surely she was therefore the hot tip to win in Glasgow on a circuit far better tailored to her strengths?</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AW7_1730.jpg?v=1691956978\" alt=\"Lotte Kopecky\" /></p>\n<p>With such expectations comes pressure, and, as a Belgian, that pressure was intensified for Kopecky. Being an elite rider representing a nation as cycling-mad as Belgium means Kopecky is under more scrutiny than all of her other rivals, as she experienced a couple of years ago when the Worlds were hosted in Leuven, and she fell short of what was hoped of her to finish down in 16th. This year also marked the 50th anniversary since the women's road race was won by a Belgian, a mark of shame for a nation so proud of its cycling heritage, and served to put Kopecky under even more pressure to deliver.</p>\n<p>Kopecky's nationality was also a potential hindrance in that she wasn't blessed with as strong a team as her main rivals. Whereas all of her success so far this season had come as part of the vastly superior SD Worx squad, in which she had the luxury of riding alongside some of the other best riders in the world, now she had to come up with a way of defeating her trade teammates - most notably Demi Vollering and Marlen Reusser. Compared with the collective strength of the Dutch and to a lesser extent the Italian line-ups, Kopecky's Belgium looked to be at a distinct disadvantage.</p>\n<p>Kopecky therefore found herself in the difficult situation of being the rider everyone was watching, but in a team that was not strong enough to control the race. Domestiques Sanne Cant and Justine Ghekiere did a good job of keeping the race under relative control, and not allowing lone attacker Elise Chabbey's lead to grow to to dangerous an advantage, but the line-up's vulnerabilities became very apparent later when the peloton started to thin and the selections were made. The Dutch, Italians, and even the Brits still had almost their full roster of riders present in the group of favourites when Chabbey made her move about 75km from the finish, while Kopecky was already nearly isolated.</p>\n<p>These nations recognised Belgium's vulnerabilities, and exploited the danger they posed by attacking multiple times rather than offer much help in chasing down Chabbey. The Dutch were especially active, with Riejanne Markus and Annemiek van Vleuten making attacks while Vollering lurked ominously behind. Kopecky was eager to counter these moves by also riding on the front foot and making her own attacks, but encountered the other problem of being the race favourite - that no other riders are willing to work with you. On a few occasions she managed to go clear with a few other riders, but each time the move fizzled out as nobody offered her any assistance.</p>\n<p>Nevertheless, Kopecky still managed to force a selection when she countered a move by Van Vleuten on the third-to-last climb up Montrose Street. As a result, just her, Van Vleuten, Vollering, Marlen Reusser, Lizzie Deignan, Cecilie Uttrup Ludwig and surprise package Christina Schweinberger were left chasing Chabbey with about 35km left to ride - a group far better weighted in her favour than it had been previously. And the persistence of Chabbey out front (still ahead but with a gap now under half a minute) was now a blessing in disguise, as it prompted the other riders accompanying her to help chase (with the exception of Chabbey's Swiss teammate Reusser).</p>\n<p>At this point, Kopecky's main threat came in the form of the Dutch, who still had a numerical advantage with both Vollering and Van Vleuten. Until suddenly they didn't. Disaster struck for Van Vleuten on the penultimate lap, when a mechanical saw her drop out of the group, ending any chance she had of defending her title. Having already had to fight back up to the peloton earlier in the day and make up a deficit of over a minute following another mechanical, it was clear the Gods were not on her side this year, and had no interest in scripting <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/super-legs-but-a-flat-tyre-and-strict-instructions-annemiek-van-vleuten-s-bittersweet-ending\">a fairytale end to her career</a>. Still, Van Vleuten did not let the disappointment ruin her day, and seemed later to be soaking up the atmosphere as she waved to the fans on Montrose Street on the last lap, making the most of what will be her last time racing at such a competitive level before retiring.</p>\n<p>In hindsight, this puncture might have been the most decisive moment of the race, as it was the turning point that saw Kopecky elevated from her previously numerical defect and disadvantaged position. When she and Vollering surged clear from the rest of the break on the penultimate climb of Montrose Street, it was clear that they were the two strongest riders, even if the others did manage to catch them in time for the last lap. But which of them was going to win?</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-101104.jpg?v=1691956554\" alt=\"Road World Championships\" /></p>\n<p>Kopecky might not necessarily have been the strongest, but, crucially, she picked her moment while Vollering was caught napping. After Deignan and Schweinberger slipped up the road during the last lap, Kopecky responded with Reusser (the latter now in attacking mode again after Chabbey had finally been caught), while Vollering failed to follow her wheel. A massive effort was required by Vollering to close the gap, and soon after she did, Kopecky struck again while Vollering was still recovering by following a move from Ludwig, then producing her own brutal acceleration up Scott Street 5.5km from the finish.</p>\n<p>After a day of constant attacks and different selections being made, this at last was the one that proved to be the race-winning moment. Kopecky soloed to the finish while Vollering chased in vain to claim silver and Ludwig just about hung on for bronze, bringing an end to Belgian's half-century drought in this event, and delivering on her status as the race favourite despite all the obstacles she had to overcome.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"966d23ef3a94573df5e58e46e462d78e3ac6e54a8554a56f81f164afeda06983","category":"Cycling"}