{"title":"Rocket Report: Amazon bypasses New Glenn, SLS ready for Florida shipment","link":"https://arstechnica.com/?p=1759479","date":1619175653000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/s21-016_core_stage_removal_1163-1024x729-800x570.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/04/s21-016_core_stage_removal_1163-1024x729.jpg\">Enlarge</a> <span>/</span> NASA and Boeing work to remove the SLS rocket core stage from its test stand in Mississippi. (credit: NASA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 3.42 of the Rocket Report! This week we have an update on Virgin Orbit, which has signed a multilaunch deal for its LauncherOne vehicle. Additionally, NASA has provided a couple of news items on the Space Launch System rocket, suggesting progress on not just the first core stage, but on cores for future Artemis launches.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><strong>Virgin Orbit to launch six satellites for QinetiQ</strong>. The California-based satellite-launch company <a href=\"https://virginorbit.com/the-latest/virgin-orbit-to-launch-hyperspectral-constellation-for-qinetiq-hypersat/\" target=\"_blank\">said on Wednesday</a> it has been selected by defense and security company QinetiQ and geospatial analytics company HyperSat to launch a series of six hyperspectral satellites to low Earth orbit. The first satellite will launch no earlier than 2023 on Virgin's LauncherOne rocket.</p></div><p><a href=\"https://arstechnica.com/?p=1759479#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1759479&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"96704f8ef3103a9d9d3eda357be7d965a6d3380f47ee6b52e577173a1f315b06","category":"Tech"}