{"title":"The chemical assessment of surfaces and air (CASA) study: using chemical and physical perturbations in a test house to investigate indoor processes","link":"http://pubs.rsc.org/en/Content/ArticleLanding/2024/EM/D4EM00209A","date":null,"content":"<div><p><img src=\"/services/images/RSCpubs.ePlatform.Service.FreeContent.ImageService.svc/ImageService/image/GA?id=D4EM00209A\" /></p></div><div><i><b>Environ. Sci.: Processes Impacts</b></i>, 2024, Advance Article<br /><b>DOI</b>: 10.1039/D4EM00209A, Paper</div><div><img alt=\"Open Access\" src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/open_access_blue.png\" /> Open Access</div><div><a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\"> <img src=\"http://sod-a.rsc-cdn.org/pubs.rsc-uat.org/content/NewImages/CCBY-NC.png\" alt=\"Creative Commons Licence\" /></a>  This article is licensed under a <a href=\"http://creativecommons.org/licenses/by-nc/3.0/\" target=\"_blank\">Creative Commons Attribution-NonCommercial 3.0 Unported Licence.</a></div><div>Delphine K. Farmer, Marina E. Vance, Dustin Poppendieck, Jon Abbatt, Michael R. Alves, Karen C. Dannemiller, Cholaphan Deeleepojananan, Jenna Ditto, Brian Dougherty, Olivia R. Farinas, Allen H. Goldstein, Vicki H. Grassian, Han Huynh, Deborah Kim, Jon C. King, Jesse Kroll, Jienan Li, Michael F. Link, Liora Mael, Kathryn Mayer, Andrew B. Martin, Glenn Morrison, Rachel O'Brien, Shubhrangshu Pandit, Barbara J. Turpin, Marc Webb, Jie Yu, Stephen M. Zimmerman<br />The Chemical Assessment of Surfaces and Air (CASA) study investigated how chemicals transform in the indoor environment using perturbations (<em>e.g.</em>, cooking, cleaning) and additions of indoor and outdoor pollutants in a test house.<br />To cite this article before page numbers are assigned, use the DOI form of citation above.<br />The content of this RSS Feed (c) The Royal Society of Chemistry</div>","author":"","siteTitle":"RSC - Environ. Sci.: Processes Impacts latest articles","siteHash":"a19294297428f308d37ea8de36189edf4009f489794a2e42897cedcee0d94bbb","entryHash":"96740a990db0b61f1a54022d0590ce7425cf8da4a9a7f2ffeeebfdc79ade761f","category":"Environment"}