{"title":"World waits to see where a Chinese booster will come down","link":"https://arstechnica.com/?p=1762950","date":1620297942000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1249929721-800x500.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/GettyImages-1249929721.jpg\">Enlarge</a> <span>/</span> An artist's depiction of the Tianhe station module. While that's safely in orbit, the booster that got it there isn't in a stable orbit. (credit: <a href=\"https://www.gettyimages.com/detail/photo/core-module-of-chinas-space-station-tianhe-orbiting-royalty-free-image/1249929721?adppopup=true\">Xia Yuan / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>In late April, China successfully launched a major component of its planned space station. Since then, the booster that put the component into orbit has been circulating in an unstable orbit, and various tracking organizations are indicating that it's likely to come back in a completely uncontrolled manner. It's a big-enough piece of hardware that some parts are likely to survive until they reach the ground. While odds are that will happen over the ocean, there's no guarantee re-entry won't happen over a populated area.</p>\n<p>As Ars' Eric Berger <a href=\"https://arstechnica.com/science/2020/05/large-chunks-of-a-chinese-rocket-missed-new-york-city-by-about-15-minutes/\">described last year</a>, the Long March 5B has an unusual design. Meant for heavy lifts to orbit, the rocket doesn't have an upper stage; instead, its main stage travels all the way to orbit with its payload. Once there, one option is to leave it in a stable orbit, where it would add to the increasing clutter in low Earth orbit. The alternative is to de-orbit the stage.</p>\n<p>Most countries have settled on a controlled de-orbit, in which control is maintained over the booster and enough fuel is retained to allow decisions to be made about when the hardware re-enters the atmosphere. That allows any material that survives re-entry to land harmlessly in the ocean.</p></div><p><a href=\"https://arstechnica.com/?p=1762950#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762950&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"96895c5173acb7ed03ed92f2d6c407cd44ddce7bfad83e1f5f2c0bf200564ee1","category":"Tech"}