{"title":"Sustainability: Is It a Strategic Management Research Fashion?","link":"https://www.preprints.org/manuscript/202406.1422/v1","date":1718940532000,"content":"This article aims to identify the relationship between sustainability and strategic management to determine whether sustainability can be considered a strategic management research fashion. This involves a bibliometric analysis of recent academic literature from 2021 to 2023 to identify the latest academic research, key trends, collaboration and keyword networks within this relationship. The analysis was conducted using two datasets from the Scopus database. These datasets focus on English-language journal articles on business, management and accounting. The first covers academic research on strategic management, while the second expands to sustainability and sustainable development. The results show that strategic management research focusing on sustainability has recently grown faster (24.70%) than the whole strategic management research area (14.30%). Furthermore, the geographical analysis of co-authorship identified articles from 88 countries, suggesting a broad interest in this relationship. Notably, the strategic management network mapping revealed a unique, sustainable development, corporate social responsibility and sustainability cluster. Moreover, extended mapping revealed four clusters covering crisis management, strategic and creative sustainable development, operational and regulatory sustainability, sustainable supply chains, and resource management. The results thus confirm the rapid growth and widespread coverage of research on sustainability and strategic management, highlighting sustainability as a strategic management research fashion.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"968bb005715960c7b8f1fd9c937c9261bc72e9332fd266edff08ada524afaf6a","category":"Interdisciplinary"}