{"title":"ณ จุดสูงสุดของความเชื่อ","link":"https://markpeak.net/top-fake-news-believers/","date":1622132375000,"content":"<p>ข่าวที่ชอบที่สุดของปี 2021 (นับถึง ณ เดือนพฤษภาคม 2021) เป็นข่าวนี้แบบไร้คู่แข่ง เหตุผลเพราะบ่งชี้ทุกอย่างของวิวาทะเรื่อง fake news ได้เบ็ดเสร็จในข่าวเดียว</p>\n<div>\n\t\t\t<div>\n\t\t\t\t<a href=\"https://www.businessinsider.com/qanon-followers-fly-from-california-to-dc-watch-trump-inauguration-2021-3\">\n\t\t\t\t\t<img src=\"https://i.insider.com/6043515e44d8e300117b96f7?width=1200&amp;format=jpeg\" />\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div>\n\t\t<a href=\"https://www.businessinsider.com/qanon-followers-fly-from-california-to-dc-watch-trump-inauguration-2021-3\">\n\t\t\tA handful of QAnon followers flew all the way from California to DC in hopes of watching Trump's March 4 'inauguration'\t\t</a>\n\t</div>\n\t<div>\n\t\t<a href=\"https://www.businessinsider.com/qanon-followers-fly-from-california-to-dc-watch-trump-inauguration-2021-3\">\n\t\t\t<p>March 4 had become a highly anticipated date for followers of the QAnon conspiracy theory, who believed it was the day Trump would return to power.</p>\n\t\t</a>\n\t</div>\n\t<div>\n\t\t<img src=\"//www.businessinsider.com/public/assets/BI/US/favicons/favicon-32x32.png?v=2021-05\" />\t\tBusiness Insider\t</div>\n</div>\n<p>เราอยู่กับวาทกรรม fake news และกระแสการเมืองขวาจัดมานาน 4 ปีในยุคของทรัมป์ ความจริง (truth) เป็นสิ่งที่ไม่สามารถนิยามได้ง่ายๆ เหมือนเดิมอีกต่อไป</p>\n<p>การวิเคราะห์หลายสำนักชี้ว่า ทรัมป์ไม่ได้เป็นผู้สร้าง fake news เพราะมันมีอยู่ก่อนนานแล้ว แต่ทรัมป์เป็นผู้ใช้พลังจาก fake news การปั่นกระแสยุคอินเทอร์เน็ตได้เก่งมากๆ ต่างหาก</p>\n<p>ทรัมป์แพ้การเลือกตั้งปลายปี 2020 ลงจากตำแหน่งไปแล้ว เรายังมี fake news อีกหรือไม่</p>\n<p>ข่าวนี้คือคำตอบที่ดีที่สุด</p>\n<p>วงการฝ่ายขวาอเมริกามีเว็บบอร์ด QAnon (เกิดขึ้นจากคนที่ใช้นามแฝง Q ซึ่งปัจจุบันเชื่อว่ามีหลายคน ทำงานเป็นกลุ่ม) คอยปั่นกระแสให้ชาวขวาจัดไม่เชื่อในสื่อกระแสหลักของอเมริกา และเชื่อเฉพาะสื่อของพวกเดียวกันเองเท่านั้น (ถ้าเทียบกับบ้านเราก็คงเป็นข่าว fwd ตามกรุ๊ปไลน์)</p>\n<p>วงการ QAnon ปั่นกันเองจนเชื่อว่า ทรัมป์ไม่ได้แพ้การเลือกตั้ง (ขั้นกว่าของการแพ้เลือกตั้งเพราะโดนโกง) และจะมีพิธีรับตำแหน่ง (inauguration) สมัยที่สองของทรัมป์ในเดือนมีนาคม (ไบเดนเข้าพิธีไปในเดือนมกราคม)</p>\n<p>ข่าวแบบนี้ไปเล่าให้คนปกติทั่วๆ ไปฟัง (เรายังสามารถนิยามคำว่า “ปกติ” ได้อีกไหม แต่ถือว่าทำได้ไปก่อนแล้วกัน) คงเป็นเรื่องตลกไร้สาระ</p>\n<p>แต่มีชาว QAnon อย่างน้อย 4 คนเชื่อแบบนี้ ขอลาหยุดงาน แล้วบินจากแคลิฟอร์เนีย ข้ามประเทศไปยังวอชิงตันดีซี เพื่อรอชมพิธี inauguration ตามวันนัดหมาย</p>\n<blockquote>\n<p>From left, Karyn Carson, John Carson, Lois Houser and Matthew Giannini, supporters of former President Donald Trump, stand near the security perimeter outside of the U.S. Capitol Building, hoping to see evidence of an inauguration of former President Trump. Photo by <a href=\"https://twitter.com/LeahMillis?ref_src=twsrc%5Etfw\">@LeahMillis</a> <a href=\"https://t.co/ptTiS1rG9x\">pic.twitter.com/ptTiS1rG9x</a></p>\n<p>— corinne_perkins (@corinne_perkins) <a href=\"https://twitter.com/corinne_perkins/status/1367548888106827777?ref_src=twsrc%5Etfw\">March 4, 2021</a></p></blockquote>\n<p></p>\n<p>ตามข่าวที่ไปสัมภาษณ์คนกลุ่มนี้ บอกว่าออกมารอชมพิธีที่หน้าอาคาร Capitol Building ตรงสนาม National Mall ทุกวัน รอดูว่าจะมี “ปาฎิหารย์” อะไรเกิดขึ้นไหม</p>\n<p>เรารู้ตอนจบว่าไม่มีอะไรเกิดขึ้นหรอก แต่ก็ไม่มีทางรู้ได้ว่าคนกลุ่มนี้มีปฏิกิริยาอย่างไรหลังจากนั้น คงเศร้าใจ เสียใจ แล้วยอมรับได้ บินกลับบ้านไปทำงานต่อนั่นแหละ</p>\n<p>ในฐานะคนที่ติดตามการเมืองอเมริกัน และอยู่ในการถกเถียงประเด็นแห่งยุคสมัยอย่างเรื่อง fake news หรือ echo chambers ข่าวนี้สร้างแรงสั่นสะเทือนในใจผมมาก</p>\n<p>มันเป็นหลักฐานบ่งชี้ชั้นดีว่า ความเชื่อเหล่านี้มันมีจริง และคนที่มีศรัทธาระดับนี้ มีตัวตนอยู่จริงๆ พร้อมทุ่มทุน แรงเงิน แรงกาย แรงใจ เพื่อสิ่งที่เขาเชื่อ แม้ว่าในสายตาเรามันจะเป็นสิ่งไร้สาระก็ตาม</p>\n<p>คำถามที่ยังหาคำตอบไม่ได้คือ เราจะสามารถสื่อสารกับคนที่คิดแตกต่างอย่างเราแบบสุดขั้วขนาดนี้ได้จริงๆ รึเปล่า เราควรยึดหลักการสื่อสารด้วยเหตุและผลอย่างสันติต่อไปดังเดิม หรือเราควรปล่อยผ่านเพิกเฉยกับคนที่สุดขั้วขนาดนี้กันดี?</p>\n<p>ภาพประกอบจากพิธีรับตำแหน่งของทรัมป์ในปี 2017 (พิธีนี้มีจริงไม่ fake news) Source: <a href=\"https://commons.wikimedia.org/wiki/File:2017_Presidential_Inauguration_CV6A0646.jpg\">Wikipedia</a></p>The post <a href=\"https://markpeak.net/top-fake-news-believers/\">ณ จุดสูงสุดของความเชื่อ</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"968df3a4e87c7c42fa6a982d3f1c0f90ccb43a95c0b2c7db547decc2e434ec14","category":"Thai"}