{"title":"Cloning and Mutagenesis of ampC Encoding for &beta;&ndash;lactamase in Pseudomonas aeruginosa to Identify Potential Allosteric Binding Sites on&beta;&ndash;Lactamase","link":"https://www.preprints.org/manuscript/202405.0730/v1","date":1715492670000,"content":"The opportunistic pathogen Pseudomonas aeruginosa is responsible for numerous chronic infections and has a case fatality rate of 50%. All P. aeruginosa strains express β–lactamase, an enzyme capable of inactivating β–lactam antibiotics, including penicillins. However, β–lactams are still considered desirable therapeutics by physicians due to their low toxicity. The short-term goal of this study was to create an optimal model for ampC expression in P. aeruginosa and determine the selecting antibiotic to be used during mutagenesis. In the long term, this study aims to renew effectiveness of β–lactams by identifying potential allosteric binding sites on β–lactamase for the development of novel β–lactamase inhibitors. To create a system for ampC expression, the chromosomal P. aeruginosa ampC gene encoding for β–lactamase was cloned into Escherichia coli, then conjugated into P. aeruginosa ∆ampC. β– lactamase assays on recombinant E. coli and P. aeruginosa detected much higher production of β–lactamase in pMMB67HE, which was confirmed with antibiotic susceptibility testing (AST) to numerous β-lactams. From AST, carbenicillin was chosen as the antibiotic to select functional β–lactamase production during mutagenesis. Future work includes conducting mutagenesis on ampC to identify allosteric binding sites on the β–lactamase enzyme that may enable the discovery of new β–lactamase inhibitors. This work allows for the development of novel β–lactamase inhibitors that could renew the utility of β–lactams and drastically reduce morbidity and mortality from chronic Pseudomonas infections.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"968fe833db626581b6ce79ccd20da50394e484d0ad07e66315cf781e6c75ee76","category":"Interdisciplinary"}