{"title":"PSLBII-10 Mitigation of sanitary challenge effects in growing pigs through extra supply of functional amino acids","link":"https://academic.oup.com/jas/article/102/Supplement_3/656/7757739?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Immune system activation alters the demand for amino acid (AA) supply, and amino acid-based nutritional strategies may mitigate performance reduction in pigs subjected to a sanitary challenge (SC). This study aimed to evaluate the effect of extra supplementation of a combination of functional amino acids (FAA, +20% Threonine, Methionine, and Tryptophan) preventively (pre-sanitary challenge), curatively (post-sanitary challenge) or both on the performance of growing pigs challenged with <span>Salmonella typhimurium</span> (ST) and poor housing conditions. Male pigs [n = 60; body weight (BW) = 21.7 ± 4,6 kg] were randomly allocated to 4 dietary treatments, with a basal AA profile fed throughout the experimental period (Control; NRC, 2012) or a functional AA profile (FAA+; +20% Trip:Lys, Tre:Lys, and Met+Cys:Lys) fed only before the SC (FAA Preventive), after the SC (FAA Curative), or throughout the experimental period (FAA Continuous). On d 0, after a 7-d adaptation period (d -7 to 0, pre-SC), all pigs were inoculated with ST (2 x 10<sup>9</sup> CFU/mL). Manure from a commercial pig farm was spread on the solid concrete floor, and the room was not cleaned during the experiment for 28 d (d 0 to 28, SC period). Pigs were housed in groups, and diets were supplied using 5 Precision Feeders. Body composition was determined using DXA on d 0 and 28 and protein and lipid deposition was calculated. Data were subjected to analysis of variance, with diets considered a fixed effect and initial BW as a covariate. Each pig was considered the experimental unit, and means were compared using Tukey’s test. There was no effect of providing FAA before the sanitary challenge on performance, indicating that the control diet was adequate for the phase requirements. All pigs tested positive for fecal ST shedding. A 1.2°C increase in rectal temperature was observed on d 1 (<span>P</span> &lt; 0.01), and rectal temperature remained elevated throughout the first week (<span>P</span> &lt; 0.01). The control treatment had a higher rectal temperature than the preventive treatment (<span>P</span> = 0.02). There was an increase in serum haptoglobin on d 7 (<span>P</span> &lt; 0.01). A reduction in albumin on d 7 and 28 compared with the pre-sanitary challenge period was observed (<span>P</span> = 0.02), and pigs in the control group had a greater value compared with the curative and continuous groups (<span>P</span> &lt; 0.01). A heavier final BW (<span>P</span> = 0.02), daily gain (<span>P</span> = 0.02), and feed efficiency (<span>P</span> = 0.01) were observed in the continuous FAA treatment compared with the control, whereas preventive and curative FAA showed intermediate values (Table 1). Providing FAA through a combination of preventive period with curative supply during a chronic sanitary challenge was able to positively modulate the immune response and performance of pigs at the beginning of the growth phase.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"96926b6a1fe5d28f3a82a0921ce5f23f84a9d2b244ff1d02b9c121ef1aebe638","category":"Environment"}