{"title":"A Step Towards CO2 Sequestration through Mineral Carbonation: Using Ammonium Based Lixiviants for the Dissolution of Calcium from Iron Making Blast Furnace Slag","link":"https://www.preprints.org/manuscript/202405.1114/v1","date":1715872943000,"content":"In recent years, technical processes for the sequestration of CO2 through industrial waste mineral carbonation have been explored and developed. There is a large portfolio of Carbon Capture, Uti-lisation and Storage (CCUS) techniques that have been employed on a laboratory and at pilot scale. These include geological storage, ocean storage and mineralisation by carbonate ores. In view of this, the main purpose of this research was to investigate and explore chemical variables, particularly ammonium salts as lixiviants for calcium mineral extraction from iron making slag. The slag in use was acquired from a Steel Mill in the Vaal Triangle Region in Gauteng, South Af-rica. The experimental test work was conducted using different ammonium lixiviants, namely, NH4NO3, NH4Cl and CH3COONH4 to understand the influence of anion type as well as possible differences in mechanisms of interactions. Lixiviant concentration as well as the reaction time were varied in this research study. The three selected ammonium based lixiviants showed different extents of calcium extraction owing to differences in the anion groups. NH4NO3, NH4Cl and CH3COONH4 were found capable of dissolving 50% to 80% of calcium from the selected slag for different molar concentrations. Anion type and leaching time also had significant influences on the leaching of calcium from the slag. Rapid pH degradation resulted in better calcium extraction ca-pabilities. This work has shown that the selected ammonium salts have a potential as lixiviants for calcium dissolution from iron making blast furnace slags. These lixiviants would therefore be important to consider during calcium mineral carbonation for CO2 sequestration.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9693e89dbf527906de99dd5f55b8f74005a41bf7ac2bc7245434504adc58306c","category":"Interdisciplinary"}