{"title":"Sensory Processing Challenges in Children with Neurodevelopmental Disorders and Genetic Conditions: An Observational Study","link":"https://www.preprints.org/manuscript/202408.1325/v1","date":1724062431000,"content":"Sensory processing challenges are crucial yet often neglected aspects in the care of children with neurodevelopmental disorders and genetic conditions. They represent a key area of interest in neuroscience, as they significantly impact children's daily functioning and quality of life. This observational study examines the characteristics of these challenges in a group of 614 children, aged 3 to 14 years and 11 months, divided into three groups: 183 with neurodevelopmental disorders (Autism Spectrum Disorder, Attention Deficit Hyperactivity Disorder, developmental delays, learning disorders), 89 with genetic conditions (22q11.2 Deletion Syndrome, Williams Syndrome, Pseudohypoparathyroidism), and 342 controls. Sensory processing was assessed using the Sensory Profile 2 (SP2). Results indicated that children with neurodevelopmental disorders and genetic conditions exhibited significant sensory processing difficulties compared to controls. The SP2 identified sensory challenges across different sensory systems, with varying configurations depending on the diagnosis. Children with neurodevelopmental disorders and genetic conditions show marked sensory processing challenges impacting daily lives and well-being. These findings highlight the importance of early identification and tailored evidence-based interventions to address these specific sensory processing issues. Further research should explore the long-term impact of these interventions in these different populations and their integration into broader therapeutic programs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9695f7471a307a2d68991d99f3c53c9e193bc268980c5f982ddae5b412e25f8e","category":"Interdisciplinary"}