{"title":"Problem-solving ability and future time perspective among the Chinese nursing interns: The mediating role of future work self","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308669","date":1723125600000,"content":"<p>by Zhangyi Wang, Yue Zhu, Xiaoping Zhan, Tingrui Wang, Xiaochun Tang, Liping Li, Tao Su, Huifang Zhou, Li Liu, Lamei Chen, Xiaoli Pang, Jiaofeng Peng, Yan Wang, Li Yang</p>\r\nBackground <p>The significance of problem-solving ability has been confirmed in numerous studies worldwide, highlighting its role in enhancing the skills of nursing interns and reducing psychological pressure. However, existing research indicates that the problem-solving ability of nursing interns urgently needs to be further improved. Limited research has been conducted on the problem-solving ability of nursing interns, and the correlations among problem-solving ability, future time perspective, and future work self of Chinese nursing interns are unclear.</p> Objectives <p>To investigate problem-solving ability, future time perspective, and future work self among the Chinese nursing interns, and to examine the relationships among these variables. Additionally, the study aims to explore the mediating role of future work self between problem-solving ability and future time perspective.</p> Methods <p>A cross-sectional and correlational design was employed, adhering to the quality reporting conformed to the STROBE Checklist. From May 8, 2023, to February 15, 2024, 1,251 nursing interns were recruited from 15 tertiary grade-A hospitals across six cities in China. The Demographic Characteristics Questionnaire, Social Problem-Solving Inventory, Future Time Perspective Inventory, and Future Work Self Scale were used. The data was analyzed using descriptive statistics, univariate, correlation, and process plug-in mediation effect analyses.</p> Results <p>The total scores for problem-solving ability, future time perspective, and future work self were 64.39 ± 18.55, 45.08 ± 11.37, and 16.92 ± 5.28, respectively. Problem-solving ability was positively correlated with future time perspective (<i>r</i> = 0.638, <i>p</i> &lt; 0.001) and future work self (<i>r</i> = 0.625, <i>p</i> &lt; 0.001). Additionally, future work self partially mediated mediating role between problem-solving ability and future time perspective, accounting for 39.7% of the total effect.</p> Conclusion <p>The problem-solving ability, future time perspective, and future work self among the Chinese nursing interns were relatively moderate, indicating a need for improvement. It is suggested that nursing managers and educators should actively implement career management and planning programs. By enhancing the future time perspective and future work self of nursing interns, their problem-solving ability can be improved. This, in turn, will facilitate their adaptation to clinical work, enhance the quality of nursing care, and promote the development of their nursing profession.</p>","author":"Zhangyi Wang","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9695ae239e5169e7941fe1245bd641db3a7a156a38dac88aaddcd2ccf777daf5","category":"Interdisciplinary"}