{"title":"Apple รายงานผลประกอบการ รายได้ลดลง 1% แม้ iPhone ทำสถิติสูงสุดใหม่ เนื่องจาก Mac ยอดขายลดลง","link":"https://www.blognone.com/node/136551","date":1698964262000,"content":"<div><div><div><p>แอปเปิลรายงานผลประกอบการประจำไตรมาสเดือนกันยายน รายได้รวม 89,498 ล้านดอลลาร์ ลดลง 1% เมื่อเทียบกับ<a href=\"https://www.blognone.com/node/131190\">ไตรมาสเดียวกันในปีก่อน</a> โดยมีกำไรสุทธิ 22,956 ล้านดอลลาร์ คิดเป็น 1.46 ดอลลาร์ต่อหุ้น เพิ่มขึ้น 13%</p>\n<p>ช่วงเดือนสุดท้ายของไตรมาสนี้แอปเปิลมีสินค้าใหม่ที่เริ่มจำหน่ายคือตระกูล iPhone 15 และ Apple Watch รุ่นใหม่</p>\n<p>iPhone มียอดขาย 43,805 ล้านดอลลาร์ เพิ่มขึ้น 3% ทำสถิติสูงสุดของบริษัท เช่นเดียวกับธุรกิจ Services มีรายได้ 22,314 ล้านดอลลาร์ เพิ่มขึ้น 16% ที่ทำสถิติสูงสุดเช่นกัน กลุ่มที่รายได้ลดลงมากคือ Mac มียอดขาย 7,614 ล้านดอลลาร์ ลดลง 34% และ iPad 6,443 ล้านดอลลาร์ ลดลง 10% ส่วนกลุ่ม Wearables, Home, Accessories 9,322 ล้านดอลลาร์ ลดลงเล็กน้อย 3%</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/83497dd3c4dac0c9f7ebcee0c53e2d39.png\" /></p>\n<p>ซีอีโอ Tim Cook ให้สัมภาษณ์กับ CNBC ว่า iPhone 15 มียอดขายที่ดีกว่า iPhone 14 เมื่อเทียบช่วงเวลาเดียวกันหลังเปิดตัว และบอกว่ารุ่น Pro กับ Pro Max มีปัญหาสินค้าขาดตลาดเนื่องจากความต้องการสูง</p>\n<p>ในช่วงแถลงผลประกอบการกับนักวิเคราะห์โดยซีอีโอ Tim Cook และซีเอฟโอ Luca Maestri มีประเด็นน่าสนใจเพิ่มเติมดังนี้</p>\n<ul>\n<li>ยอดขายในอินเดียทำสถิติใหม่สูงสุด รวมทั้งอีกหลายประเทศเช่น บราซิล, แคนาดา, อินโดนีเซีย, ฟิลิปปินส์, เวียดนาม และมีอีกหลายประเทศ</li>\n<li>Cook อ้างข้อมูลการศึกษาล่าสุดของ StudentMonitor พบว่านักศึกษาเกือบ 2 ใน 3 ตอนนี้เลือกใช้ Mac</li>\n<li>จำนวนอุปกรณ์ที่เปิดใช้งานรวมทำสถิติสูงสุด และทำสถิติสูงสุดในทุกภูมิภาค</li>\n<li>Mac รายได้ลดลง 34% เป็นผลจากยอดขายไตรมาสเดียวกันในปีก่อนที่สูงมากกว่าปกติ เพราะมีคำสั่งคงค้างที่ผลิตไม่ทันจากปัญหาชิปขาดแคลน</li>\n<li>ผู้ซื้อ Mac ครึ่งหนึ่งเป็นลูกค้าใหม่ที่ไม่เคยใช้ Mac มาก่อน สินค้าที่ขายดีคือ MacBook Air</li>\n<li>Cook คิดว่า Mac M3 ที่เพิ่งเปิดตัวจะช่วยให้ยอดขายในไตรมาสธันวาคมดีขึ้น</li>\n<li>ลูกค้า Subscription แบบจ่ายเงินผ่านแพลตฟอร์มมีมากกว่า 1 พันล้านบัญชีแล้ว</li>\n<li>ประเมินยอดขายไตรมาสธันวาคมว่าใกล้เคียงกับปีก่อน อีกเหตุผลคือไตรมาสของปีนี้มีจำนวนสัปดาห์น้อยกว่าปี 2022</li>\n<li>เมื่อถามถึง Generative AI ที่หลายบริษัทต่างลงทุน Cook ไม่ได้ให้รายละเอียด แต่บอกว่าแอปเปิลมีการลงทุนพัฒนา AI เป็นเงินพอสมควร และเห็นเทคโนโลยีเหล่านี้ในสินค้ามาโดยตลอดอยู่แล้ว</li>\n</ul>\n<p>ที่มา: <a href=\"https://www.apple.com/newsroom/2023/11/apple-reports-fourth-quarter-results/\">แอปเปิล</a> และ <a href=\"https://www.macrumors.com/2023/11/02/apple-4q-2023-results/\">MacRumors</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f4fe09f69cbcff90a1ce6c4ba42159ea.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9695ac20601fd3d4ab39949b00399b18352cce4fe8d5d692e69ff3456f1df476","category":"Thai"}