{"title":"Apple Announces tvOS 17, Including FaceTime and New Control Center","link":"https://www.macrumors.com/2023/06/05/tvos-10-facetime-control-center/","date":1685989438000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/06/tvos-17-brings-facetime-and-video-conferencing-to-apple-tv-4k/\">announced</a> tvOS 17 which brings <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a> to the <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a> 4K for the first time, includes a new Control Center, and lets you use your <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> to locate a misplaced <a href=\"https://www.macrumors.com/guide/siri/\">Siri</a> Remote. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/tvos-17.jpg\" alt width=\"1600\" height=\"894\" />\r<br />\nControl Center now displays system status, including the time and active profile, and expands with other helpful details based on a user's personal activity.\r<br />\n\r<br />\nUsers will be able to launch the ‌Apple TV‌ remote inside Control Center on ‌iPhone‌ to find their ‌Siri‌ Remote (2nd generation or later). As users get closer to the remote, an onscreen circle grows in size to guide their movement.\r<br />\n\r<br />\n‌Apple TV‌ 4K users can take advantage of the new ‌FaceTime‌ app on ‌Apple TV‌ and initiate calls directly from ‌Apple TV‌, or start calls on ‌iPhone‌ or <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and hand them off to ‌Apple TV‌. ‌FaceTime‌ on ‌Apple TV‌ takes advantage of Continuity Camera support to wirelessly connect to the user’s ‌iPhone‌ or ‌iPad‌, and leverages the device's camera and microphone to bring participants together on the TV.\r<br />\n\r<br />\nCenter Stage keeps everyone in the room framed on the screen, even as they move around, while new gesture-based reactions allow callers to use their hands to generate onscreen effects, such as hearts or fireworks. The introduction of Split View for ‌Apple TV‌ lets users enjoy watching shows or movies together during a SharePlay session while also seeing everyone on the ‌FaceTime‌ call.\r<br />\n\r<br />\nApple says that video conferencing apps like Webex by Cisco and Zoom will launch on tvOS later this year, bringing their communications capabilities to ‌Apple TV‌ 4K. In addition, <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a> Sing – which lets users sing along to their favorite tracks – will integrate Continuity Camera, so users can see themselves onscreen and add entertaining filters.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/Apple-WWDC23-tvOS-17-Memories-230605.jpg\" alt width=\"1920\" height=\"1080\" />\r<br />\nThere are also enhancements to screen savers, so users can now view curated Memories from their personal library, shared library, or both on the big screen. Aerial screen savers will also feature a collection of new locations, including Arizona's Monument Valley and California's coastal redwoods.\r<br />\n\r<br />\nAdditional features coming in tvOS 17 include:\r<br />\n<ul><li><strong>Enhance Dialogue</strong>, which lets users more clearly hear what is being said over effects, action, and music in a move or a TV show (‌Apple TV‌ 4K and <a href=\"https://www.macrumors.com/roundup/homepod/\">HomePod</a> 2nd generation required).</li>\r<br />\n<li><strong>Dolby Vision 8.1 support</strong>, offering ‌Apple TV‌ 4K users a more cinematic visual experience with dynamic metadata.</li>\r<br />\n<li><strong>Apple Fitness+</strong> enhancements, including \"Custom Plans,\" a new way for Fitness+ users to receive a custom workout or meditation schedule based on day, duration, workout type, and more; \"Stacks,\" which allows users to select multiple workouts and meditations to seamlessly do back to back; and \"Audio Focus,\" which gives users the ability to prioritize the volume of the music or the trainers' voices.</li>\r<br />\n<li><strong>Third-party VPN support</strong>, which enables developers to create VPN apps for ‌Apple TV‌.</li></ul><blockquote>\"tvOS 17 transforms the biggest screen in the home with FaceTime and new video conferencing capabilities, giving Apple TV 4K users the ability to easily connect with anyone right from their living room,\" said Bob Borchers, Apple's vice president of Worldwide Product Marketing. \"New features and enhancements make Apple TV simpler to use and even more enjoyable, reinforcing it as the absolute best option in the living room for Apple customers.\"</blockquote>The tvOS developer beta is available for Apple Developer Program members at <a href=\"https://developer.apple.com\">developer.apple.com</a> starting today, and a public beta program will be available to ‌Apple TV‌ users next month at <a href=\"https://beta.apple.com\">beta.apple.com</a>. <div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-tv/\">Apple TV</a></div><div>Tags: <a href=\"https://www.macrumors.com/guide/facetime/\">FaceTime</a>, <a href=\"https://www.macrumors.com/roundup/wwdc/\">WWDC</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#Apple_TV\">Apple TV (Buy Now)</a></div><div>Related Forums: <a href=\"https://forums.macrumors.com/forums/apple-tv-and-home-theater.100\">Apple TV and Home Theater</a>, <a href=\"https://forums.macrumors.com/forums/apple-inc-and-tech-industry.8\">Apple, Inc and Tech Industry</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/05/tvos-10-facetime-control-center/\">Apple Announces tvOS 17, Including FaceTime and New Control Center</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-announces-tvos-17-including-facetime-and-new-control-center.2391643/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"96a48eada95c5ab25e90a67948d7092096aa1fb9cd4e094170c267286fdb4994","category":"Apple"}