{"title":"“Antimicrobial utilization in a paediatric intensive care unit in India: A step towards strengthening antimicrobial stewardship practices\"","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310515","date":1726754400000,"content":"<p>by Madhusudan Prasad Singh, Nitin Rewaram Gaikwad, Yogendra Narayanrao Keche, Atul Jindal, Suryaprakash Dhaneria, Meenalotchini Prakash Gurunthalingam</p>\r\n\r\nAntimicrobials are frequently used in critically ill children admitted to the Paediatric Intensive Care Unit (PICU). The antimicrobial use data from Indian PICUs is limited using standard metrics such as Days of therapy (DOT). This study aimed to determine the baseline trend of antimicrobial use in PICU of a tertiary care teaching hospital of Raipur district of Chhattisgarh, India using standard metrics with the goal of developing facility-wide antibiotic policy and strengthening the antimicrobial stewardship activities. This active surveillance was conducted over a period of 18 months, from November 1, 2019, to March 21, 2021, in patients aged one month to 14 years who were admitted for ≥ 48 hours to the PICU at a tertiary care teaching hospital of Raipur District. Data on patient characteristics, antimicrobial indications, antimicrobial prescription information, and clinical outcomes were collected using pre-designed data abstraction forms. The descriptive statistic was used to represent the results. The antimicrobial consumption was analyzed according to the WHO AWaRe Class (Access, Watch, and Reserve groups) of antibiotics. The antimicrobial consumption was expressed as DOT/1000 patient-days (PD). A total of 216 patients were surveyed during the study period. The average number of antimicrobials prescribed per hospitalisation was 2.60 (range: 1–12), with 97.22% administered via parenteral route. Overall, DOT/1000-PD was 1318. The consumption of Watch Group antimicrobials was highest with 949 DOT/1000-PD, followed by Access (215) and Reserve Group (154), respectively. Ceftriaxone (208 DOT/1000 PD) was the most commonly prescribed antimicrobial agent, followed by Vancomycin (201), Meropenem (175), Piperacillin-Tazobactam (122) and Colistin (91). The patients who were escalated (28.24%) from empirical antimicrobial therapy had longer median PICU stay (8 days) compared those who were de-escalated (23.6%). Targeted therapy was given in 10.2% patients. The overall mortality rate was 14.35% and was higher (29.3%) in patients in whom empirical therapy was escalated compared to those who were de-escalated or continued. The study established a benchmark for antimicrobials use in the PICU and highlighted priority areas for antimicrobial stewardship intervention to enhance de-escalation rates, enhance targeted therapy, and reduce the overuse of antimicrobials especially belonging to the reserve group.","author":"Madhusudan Prasad Singh","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"96a7a8aa178599cd4312c26f64d0d3ed0849a98501912e998da6be83c4945fb3","category":"Interdisciplinary"}