{"title":"Tile Unveils New QR Code-Based 'Lost and Found' Feature and Upcoming 'Tile Ultra' With Ultra Wideband Support","link":"https://www.macrumors.com/2021/10/12/tile-qr-code-ultrawide-band/","date":1634032800000,"content":"<a href=\"https://www.thetileapp.com/\">Tile</a>, a company that makes Bluetooth-based item trackers that compete with Apple's <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a>, today introduced a refreshed lineup of devices and new features that make it easier for users to locate lost items.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/tile-new-slim-mate-pro.jpg\" />\r\n<br />\r\nThe Tile Pro, Tile's most robust tracker with a 400 foot Bluetooth range, has been updated with a new key fob look. Tile says that the Pro is designed to attach to keys right out of the box, and that with the included keychain, it can also be used with bags and purses.\r\n<br />\r\n\r\n<br />\r\nTile's Mate, Sticker, and Slim trackers have all been refreshed and now have a 250 foot Bluetooth range, a louder ring, and upgraded IP67 water-resistance. The Mate has also received a design update and it now features a three-year battery life.\r\n<br />\r\n\r\n<br />\r\nFor locating lost devices, Tile is updating its \"Lost and Found\" network with support for QR codes that will be included on the back of every item tracker. If a lost item with a Tile tracker is found, the person who found it can scan the QR code to get contact details for the owner. All of Tile's refreshed trackers include the QR code with the exception of the Sticker.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/tile-lost-and-found.jpg\" />\r\n<br />\r\nApple has a similar system that allows a lost AirTag to be identified by someone who finds it, but Apple's solution uses NFC functionality. A lost AirTag can be scanned by an NFC-enabled smartphone to bring up details.\r\n<br />\r\n\r\n<br />\r\nTo address unwanted tracking, Tile is introducing a \"Scan and Secure\" feature is designed to let anyone with the Tile app scan for and detect nearby Tile devices and determine if an unknown device is near them. Scan and Secure is coming to Android and iOS users in early 2022.\r\n<br />\r\n\r\n<br />\r\nTo better compete with ‌AirTags‌, Tile next year plans to debut the Tile Ultra, a new tracker that's able to leverage Bluetooth and Ultra Wideband technology for more precise tracking. Tile Ultra uses \"Point and Locate\" finding, which lets users locate their items using an augmented reality interface, similar to how ‌AirTags‌ work.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/10/tile-ultrawide-band.jpg\" />\r\n<br />\r\nWhen paired with iPhones with a U1 chip, ‌AirTags‌ will enter into a Precision Finding mode when close to a lost device. Tile Ultra will work in the same general way with visual finding, and it will be compatible with both iPhones and Android smartphones.\r\n<br />\r\n\r\n<br />\r\nTile's new Tile Pro, Mate, Slim, and Sticker are priced starting at $24.99 and can be <a href=\"https://www.thetileapp.com/\">purchased from the Tile website</a> or from sites <a href=\"https://www.amazon.com/s?k=tile&amp;ref=nb_sb_noss_2\">like Amazon</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/tile/\">Tile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/10/12/tile-qr-code-ultrawide-band/\">Tile Unveils New QR Code-Based 'Lost and Found' Feature and Upcoming 'Tile Ultra' With Ultra Wideband Support</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/tile-unveils-new-qr-code-based-lost-and-found-feature-and-upcoming-tile-ultra-with-ultra-wideband-support.2316560/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FFOxyo9ZeVQ:nCpr2iy8f18:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=FFOxyo9ZeVQ:nCpr2iy8f18:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/FFOxyo9ZeVQ\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"96a864fa8f11b607de0cbcdb7c04b9d9e8307c3c6a3c2456fc361634c4ce6a03","category":"Apple"}