{"title":"62 Implications of factor analyses and Bayesian network learning to develop composite traits of size attributes in developing beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_2/48/7665017?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Advancements in phenotypic data collection methods provide opportunities to capture complex biological traits more efficiently. Even so, interpreting those phenotypes and using them in selection decisions is challenging in beef cattle production. Objectives of this study were to 1) develop composite phenotype(s) of economic importance in beef heifers given attributes of their body conformation and ultrasound-based measures of reproductive and carcass traits, and 2) identify associated genomic regions under selection using the structure equation modeling (SEM) approach. In this study, we hypothesized that the interplay of factor analysis and Bayesian Network Learning (BNL) approaches would better define the complex composite traits for size and carcass-related traits in beef heifers. Phenotypic data of admixed beef heifers (n = 336) for different reproductive, body conformational, and carcass-associated phenotypic traits (n = 16) were collected. Using exploratory and confirmatory factor analyses, two latent variables explaining 14 phenotypic traits were identified, herein called Body Size (BS; n = 7 traits represented) and Body Composition (BC; n = 7 traits represented). To efficiently model them in genome-wide association studies (GWAS), fixed effects of data collection year, dam age, and primary breed group as well as causal network structure identified through BNL were used within SEM model of GWAS. Body Size was directly or indirectly contributing to BC based on BNL structure. Given the data-driven approach and novelty of the data, BayesCπ model was applied with the sliding window of 1 Mb to avoid noise and linkage disequilibrium implications. Regions capturing large amounts of genetic variance (Posterior Probability of Association, PPA ≥ 0.8) were mapped to their closest gene for enrichment analysis. Twenty-four different genes were identified associated with both composite phenotypes. Functional enrichment analysis of significantly involved pathways (FDR &lt; 0.05) indicated that genes from the HERC family (HERC3, HERC6, and HERC5) were found involved in cellular growth, and those from desmosomes (DC2, and DC3) were involved in morphogenesis like BS. Genes related to energy metabolism like IMPAD1, and PIGY, along with genes associated with traits like muscular development, and other carcass traits (i.e., FAM184B, NCAPG, and LCORL), were also found associated with BS and BC. Heritability ranged from 0.551 ± 0.048 to 0.897 ± 0.145 for BS and BC, respectively. The combined heritability of reproductive and carcass traits (BC) was much greater than the heritability of any related individual trait reported to date and was comparable for individual BS-related traits. Given this, we conclude that the implications of factor analyses with BNL can provide better biological insights for improved genomic selection in beef cattle, even for traits of low heritability.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"96afcfc5d4de8145a0e238b3e426f87a6a033724093d62b6c1a0a5824bf89cde","category":"Environment"}