{"title":"Genetic diversity and phylogeographic patterns of the peacock jewel-damselfly, <i>Rhinocypha fenestrella</i> (Rambur, 1842)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301392","date":1712325600000,"content":"<p>by Mamat Noorhidayah, Noor Azrizal-Wahid, Van Lun Low, Norma-Rashid Yusoff</p>\r\n\r\nDespite is known to have widespread distribution and the most active species of the family Chlorocyphidae, the molecular data of <i>Rhinocypha fenestrella</i> (Rambur, 1842) are relatively scarce. The present study is the first that examined the genetic diversity and phylogeographic pattern of the peacock jewel-damselfly <i>R</i>. <i>fenestrella</i> by sequencing the cytochrome C oxidase I (<i>cox1</i>) and 16S rRNA gene regions from 147 individuals representing eight populations in Malaysia. A total of 26 and 10 unique haplotypes were revealed by the <i>cox1</i> and 16S rRNA genes, respectively, and 32 haplotypes were recovered by the concatenated sequences of <i>cox1</i>+16S. Analyses indicated that haplotype AB2 was the most frequent and the most widespread haplotype in Malaysia while haplotype AB1 was suggested as the common ancestor haplotype of the <i>R</i>. <i>fenestrella</i> that may arose from the Negeri Sembilan as discovered from <i>cox1</i>+16S haplotype network analysis. Overall haplotype and nucleotide diversities of the concatenated sequences were <i>H</i><sub>d</sub> = 0.8937 and <i>P</i><sub>i</sub> = 0.0028, respectively, with great genetic differentiation (<i>F</i><sub>ST</sub> = 0.6387) and low gene flow (<i>N</i><sub>m</sub> = 0.14). Population from Pahang presented the highest genetic diversity (<i>H</i><sub>d</sub> = 0.8889, <i>P</i><sub>i</sub> = 0.0022, <i>N</i><sub>h</sub> = 9), whereas Kedah population demonstrated the lowest diversity (<i>H</i><sub>d</sub> = 0.2842, <i>P</i><sub>i</sub> = 0.0003, <i>N</i><sub>h</sub> = 4). The concatenated sequences of <i>cox1</i>+16S showed genetic divergence ranging from 0.09% to 0.97%, whereas the genetic divergence for <i>cox1</i> and 16S rRNA genes were 0.16% to 1.63% and 0.01% to 0.75% respectively. This study provides for the first-time insights on the intraspecific genetic diversity, phylogeographic pattern and ancestral haplotype of <i>Rhinocypha fenestrella</i>. The understanding of molecular data especially phylogeographic pattern can enhance the knowledge about insect origin, their diversity, and capability to disperse in particular environments.","author":"Mamat Noorhidayah","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"96b0be01274aa6763aeb0192e5c8076c66d8cb4cb07f4e41b343ff3141bdcf24","category":"Interdisciplinary"}