{"title":"A Vuelta of chaos continues","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-vuelta-of-chaos-continues","date":1693162275000,"content":"\n      <p>They say that the most nervous period for a professional cyclist is the first week of a Grand Tour. It’s when tension is high, when expectation and pressure leads to sleepless nights, and when crashes are most likely.</p>\n<div></div>\n<p>The opening weekend of the 2023 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> has, some would suggest, been the most stressful and most nervous in recent memory, with a succession of incidents and accidents, some avoidable and some not, but almost all regretful.</p>\n<p>As the race heads north into the Pyrenees on stage three, the prognostic isn’t good: the wet weather that has blighted the Gran Salida in Barcelona isn’t going anywhere, and when the riders head into the high mountains of Andorra, there is even the possibility of snow on both the Coll d’Ordino and the summit finish at Arinsal. As many spectators were heard saying to each other at the start of stage two in Mataró, it’s all a bit of a locura - a madness.</p>\n<p>After the chaos of the opening team time trial in Barcelona, which was ridden under darkened skies and foul wet weather, the race director Javier Guillén must have hoped for an easier second day. He didn’t get his wish: first, around 15 riders were reported to have punctured on the descent of the day’s main climb, Coll d’Estanalles; it was later claimed by Juan Ayuso of UAE Team Emirates that tacks were placed on one of the corners.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-espana-2023-stage-three-preview\"><strong><em>Read more: Vuelta a España 2023 stage three preview: the first summit finish</em></strong></a></p>\n<p>Remco Evenepoel, the best-placed general classification rider after stage one, was one of the victims, as was Geraint Thomas of Ineos Grenadiers. Fifty kilometres later, the Welshman was on the ground, having crashed along with Jumbo-Visma’s co-leader Primož Roglič.</p>\n<p>Both remounted their bikes and carried on, Thomas saying afterwards that he had escaped without any injuries, but it only served to heighten the tension once more. This is a Vuelta, we are being reminded every kilometre, of high risk. So far, wherever the road goes, the asphalt is wet and laced with hazards.</p>\n<p><img alt=\"Vuelta a España stage two\" src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2023-08-27_at_19.43.26.jpg?v=1693161869\" /></p>\n<p><em>The peloton on stage two of the 2023 Vuelta a España (Luis Angel Gomez/Unipublic)</em></p>\n<p>To the organiser’s credit, they made the decision to take the GC timings on stage two 9km from the finish, aware of the finishing circuit’s technical parcours and the slippery conditions. It meant that none of the overall favourites ceded or gained time, but the overnight race leader Lorenzo Milesi of DSM-Firmenich did pass on race leadership to Andrea Piccoli of EF Education-EasyPost.</p>\n<p>Piccolo was in the day’s break, but the stage was won by Andreas Kron of Lotto-Dstny who attacked in the final few kilometres to win convincingly, the Dane dedicating the victory to his teammate Tijl De Decker who died earlier this week after a training ride crash. De Decker’s tragic loss at 22 was both a reminder of the sport’s dangers, and of how fragile cyclists are out on the open and closed roads.</p>\n<p>It had been hoped that the opening weekend of the Vuelta would herald spectacular racing and blow the GC fight wide open. In a roundabout way, it has been a spectacle of sorts, and there are clear time differences between some of the favourites - Evenepoel has 31 seconds on Ayuso and his teammate João Almeida, for example - but the priority for the riders up until this point has just been staying in the race.</p>\n<p>It has been an August dominated by intense heatwaves and wildfires across Europe, but it appears that the current edition of the Vuelta a España is turning into a magnet for bad weather, hard luck and unwanted circumstances.</p>\n<p>Stage three in Andorra might finally produce enjoyable racing, but if the weather Gods continue to hammer the Iberian peninsula, gifting much-needed rain to the drought-stricken region, it will remain a Vuelta on hold, on pause, with the battle for the general classification having to wait that little bit longer yet.</p>\n<p><em>Cover image by Getty Images</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"96b7abcde1cbda8232c9e0e7b640fa1daa95cd91b5293ff2ede2cd1e158d7fb6","category":"Cycling"}