{"title":"Bloomberg: Apple Considering Bid for English Premier League Streaming Rights in the UK","link":"https://www.macrumors.com/2023/03/23/apple-considers-bid-for-epl-streaming-rights/","date":1679569240000,"content":"Apple is considering a bid for the rights to stream the English Premier League in the United Kingdom, among other lower league matches run by the English Football League, according to a <em><a href=\"https://www.bloomberg.com/news/articles/2023-03-23/apple-considers-bidding-for-english-football-streaming-rights\">Bloomberg</a></em> report citing \"people familiar with the situation.\"\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2018/01/Premier_League_Logo.jpg\" alt width=\"1200\" height=\"503\" />\r<br />\nFrom the report:\r<br />\n<blockquote>The rights under consideration would allow Apple to show Premier League games in the UK, as well as lower league matches run by the English Football League, said two of the people, who asked not to be identified because the deliberations are private.</blockquote>If Apple went ahead with the plan, it would become the fourth major player in contention to purchase domestic broadcasting rights for top-flight soccer (or football, as it's called outside North America).\r<br />\n\r<br />\nThat would likely see a marked increase in the current £5.1 billion ($6.23 billion) valuation for domestic EPL rights, which operates on a three-year renewal cycle. Tender rights are currently being reviewed, with existing rights for the current three-year period set to expire in 2025.\r<br />\n\r<br />\nRecent years have seen bidding wars play out between Sky Sports, BT Sport, and Amazon Prime Video, with Sky Sports often being the dominant player, although Amazon has been increasingly wielding its bidding power in recent years. Packaging terms ensure that no one broadcaster gains rights to all English Premier League matches, so any Apple deal for EPL broadcasting rights would necessarily fall short of the exclusivity deal the company successfully negotiated with MLS.\r<br />\n\r<br />\nApple has been pursuing sports content in an effort to attract new viewers to the <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV+</a> streaming service. The company has signed deals with <a href=\"https://www.macrumors.com/2022/04/07/friday-night-baseball-apple-tv-plus-launch/\">Major League Baseball</a> and <a href=\"https://www.macrumors.com/2022/11/16/apple-mls-season-pass-february-2023/\">Major League Soccer</a>, which is currently available on ‌Apple TV+‌ via an <a href=\"https://www.macrumors.com/2022/12/20/mls-2023-schedule-apple-tv-app/\">MLS Season Pass</a> priced at $14.99 per month or $99 per season. Apple has also reportedly expressed interest in acquiring an <a href=\"https://www.macrumors.com/2023/02/13/apple-interested-nba-streaming-rights/\">NBA streaming package</a>.\r<br />\n\r<br />\n‌Apple TV+‌ is also the home of hit sports comedy drama \"Ted Lasso,\" in which an American college football coach is hired to coach an English soccer team.<div>Tags: <a href=\"https://www.macrumors.com/guide/bloomberg-com/\">Bloomberg</a>, <a href=\"https://www.macrumors.com/guide/united-kingdom/\">United Kingdom</a>, <a href=\"https://www.macrumors.com/guide/apple-tv-plus/\">Apple TV Plus</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/23/apple-considers-bid-for-epl-streaming-rights/\">Bloomberg: Apple Considering Bid for English Premier League Streaming Rights in the UK</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/bloomberg-apple-considering-bid-for-english-premier-league-streaming-rights-in-the-uk.2384534/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"96c8a13e6a4aa6873278f0d952d4dd0499bf80acdc0bf4eba3107e4032d0c063","category":"Apple"}