{"title":"A novel isolation technique for sweetpotato starch and its application in thermal property characterization","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13933?af=R","date":1727946915000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The utilization of sweetpotato starch in the food industry is significantly influenced by the granule size of the starch. To isolate sweetpotato starch fractions with different sizes, an efficient isolation method is in demand. The differences in thermal properties of starch fractions with different sizes from various sweetpotato varieties were revealed insufficiently.</p>\n<h2>RESULTS</h2>\n<p>In this study, we devised a time-saving isolation technique to effectively isolate sweetpotato starch fractions based on granule sizes. The new technique was proved applicable for sweetpotato varieties with different flesh colors. The amylose contents of the isolated starch fractions were in the range 16.49–23.27%. A positive association was observed between amylose content, relative crystallinity of starch fractions and their granule size. Conversely, both the swelling power and water solubility at 95 °C displayed a consistent decline from more than 30 g g<sup>−1</sup> to lower than 20 g g<sup>−1</sup> as the granule size increased. <i>T</i>\n<sub>p</sub>, <i>T</i>\n<sub>o</sub> and <i>T</i>\n<sub>c</sub> decreased gradually with an increase of starch granule size, while the medium- or small-sized starch fractions showed higher Δ<i>H</i>. In the first stage of thermogravimetric analysis curves, the weight of the small-sized starch fractions decreased the slowest, but no definite pattern was detected in the second or third stage.</p>\n<h2>CONCLUSION</h2>\n<p>Therefore, the newly established technique and the results of this study will help better understand the properties of sweetpotato starch fractions with different sizes and certainly provide guidelines for the utilization of sweetpotato starch in food processing and product development. © 2024 Society of Chemical Industry.</p>","author":"Lingxiao Zhao, \nJie Wang, \nShizuo Xiao, \nMingjuan Du, \nDonglan Zhao, \nXibin Dai, \nZhilin Zhou, \nQinghe Cao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"96ca34eac31b5b37080aee7d9f8d6975af788179d1ecae9abe4ea998de6aac65","category":"Environment"}