{"title":"The heat shock factor 20-HSF4-cellulose synthase A2 module regulates heat stress tolerance in maize","link":"https://academic.oup.com/plcell/article/36/7/2652/7640809?rss=1","date":1712188800000,"content":"<span><div>Abstract</div>Temperature shapes the geographical distribution and behavior of plants. Understanding the regulatory mechanisms underlying the plant heat stress response is important for developing climate-resilient crops, including maize (<span>Zea mays</span>). To identify transcription factors (TFs) that may contribute to the maize heat stress response, we generated a dataset of short- and long-term transcriptome changes following a heat treatment time course in the inbred line B73. Co-expression network analysis highlighted several TFs, including the class B2a heat shock factor (HSF) ZmHSF20. <span>Zmhsf20</span> mutant seedlings exhibited enhanced tolerance to heat stress. Furthermore, DNA affinity purification sequencing and Cleavage Under Targets and Tagmentation assays demonstrated that ZmHSF20 binds to the promoters of <span>Cellulose synthase A2</span> (<span>ZmCesA2</span>) and three class A <span>Hsf</span> genes, including <span>ZmHsf4</span>, repressing their transcription. We showed that ZmCesA2 and ZmHSF4 promote the heat stress response, with ZmHSF4 directly activating <span>ZmCesA2</span> transcription. In agreement with the transcriptome analysis, ZmHSF20 inhibited cellulose accumulation and repressed the expression of cell wall-related genes. Importantly, the <span>Zmhsf20 Zmhsf4</span> double mutant exhibited decreased thermotolerance, placing <span>ZmHsf4</span> downstream of <span>ZmHsf20</span>. We proposed an expanded model of the heat stress response in maize, whereby ZmHSF20 lowers seedling heat tolerance by repressing <span>ZmHsf4</span> and <span>ZmCesA2</span>, thus balancing seedling growth and defense.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"96ccd14b6727f2c09b02cda6ec5a795b77b5af9a2e1199ebf004c35e0c57c1ae","category":"Environment"}