{"title":"Plasma and Myocardial miRNomes Similarities and Differences during Cardiac Remodelling and Reverse Remodelling in a Murine Model of Heart Failure with Preserved Ejection Fraction","link":"https://www.preprints.org/manuscript/202406.1909/v1","date":1719480783000,"content":"Heart failure with preserved ejection fraction (HFpEF) is a heterogeneous syndrome characterized by multiple risk factors and associated conditions. HFpEF prevalence is rising, and its prognosis remains poor after the first hospitalization. Using a two-hit HFpEF murine model, we aimed at studying cardiac reverse remodelling after stopping the causing stress (Angiotensin II [AngII]) and a high-fat diet [HFD]; MHS) and introducing voluntary exercise. We studied in young male and female C57Bl6/J mice fed or not with an HFD (60% calories from fat) the cardiac response to AngII (1.5 mg/kg/day for 28 days). Then, MHS was stopped, and VE was started for another four weeks (RR). We studied the effects of MHS and RR on the circulatory microRNA (miR) profile (miRNome) and the myocardial miRNome to characterize the cardiac and non-cardiac response of small RNAs.\nAngII alone and MHS but not the HFD caused cardiac hypertrophy (CH), left ventricular (LV) concentric remodelling and left atrial enlargement in male mice. HFD-induced CH and LV concentric remodelling only in female mice. Four weeks after RR, CH, LV concentric remodelling and atrial enlargement were reversed. We performed bulk circulatory and LV miR sequencing. We did not observe differences linked to biological sex. RR restored normality for circulatory miRNome, whereas LV miRNome remained relatively similar to the one after MHS. Among the 25 most abundant circulatory miRs, ten were modulated by MHS (9 upregulated). In the LV, 8 of the 25 most abundant miR were upregulated by MHS, and 10 were downregulated. MiRNomes from AngII, HFD or MHS shared many common modulated miRs (32), suggesting that the overall response of organs producing the bulk of circulatory small non-coding RNA was similar even for seemingly different stress.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"96d8ebdecd5602085ac24b15a3c40c10874c02fc6f741faad7ae4c3c511b2d9e","category":"Interdisciplinary"}