{"title":"AIS BUSINESS ร่วมมือ OMRON เสนอโซลูชั่น Smart Manufacturing เพื่อรองรับอุตสาหกรรมในยุค Industry 4.0","link":"https://www.blognone.com/node/124084","date":1628659396000,"content":"<div><div><div><p>AIS ลงนามบันทึกความเข้าใจกับ OMRON ผู้ให้บริการระบบควบคุมอัตโนมัติ เทคโนโลยีเซนเซอร์ กล้องอุตสาหกรรม และระบบหุ่นยนต์ในโรงงานอุตสาหกรรมรายใหญ่ เพื่อเสนอโซลูชั่นสำหรับภาคอุตสาหกรรมให้สามารถปรับตัวเข้าสู่ยุค Smart Manufacturing ที่โรงงานอุตสาหกรรมจะสามารถใช้เทคโนโลยีใหม่ๆ ไม่ว่าจะเป็นระบบหุ่นยนต์อัตโนมัติไร้สาย, การเชื่อมต่อกับคลาวด์ เข้ามาช่วยให้โรงงานสามารถปรับตัวได้อย่างรวดเร็ว</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d82f510e5de27d2f2d0ee5461632abd1.jpg\" /></p>\n<p>นางสาวศิริวรรณ คูอัมพร กรรมการผู้จัดการ บริษัท ออมรอน อีเลคทรอนิกส์ จำกัด ระบุถึงความท้าทายของอุตสาหกรรมในทุกวันนี้ว่าต้องปรับตัวมากขึ้นเรื่อยๆ โรงงานอุตสาหกรรมบางประเภทต้องปรับตัวให้ผลิตสินค้าได้หลากหลายขึ้น มีการปรับแต่งการผลิตเฉพาะของสินค้าให้ล็อตสินค้าที่เหมือนๆ กันมีจำนวนการผลิตน้อยลงแต่มีหลายรุ่นหลายแบบมากขึ้น (small lot size production) การใช้เทคโนโลยีเข้ามาผลิตช่วยให้โรงงานสามารถปรับแต่งสายการผลิตได้อย่างรวดเร็ว โดยที่ยังคงคุณภาพสินค้าได้เทียบเท่ากับสายการผลิตแบบดั้งเดิม โรงงานสามารถควบคุมสายการผลิตที่ซับซ้อนผ่านทางหน้าจอแสดงสถานะการดำเนินการได้ทันที</p>\n<p>คุณศิริวรรณยังระบุว่าที่ผ่านมา OMRON เป็นผู้ให้บริการด้านเทคโนโลยีในโรงงานอุตสาหกรรมจำนวนมากในประเทศไทย โดยโรงงานหลายกลุ่ม เช่น อุตสาหกรรมยานยนต์, อุตสาหกรรมอิเล็กทรอนิกส์, เซมิคอนดักเตอร์, ตลอดจนอุตสาหกรรมอาหารและยา มีการใช้เทคโนโลยีต่อเนื่อง และตอนนี้ทาง OMRON ก็พร้อมเสนอโซลูชั่น Smart Manufacturing ที่ประกอบด้วยการนำข้อมูลการผลิตจากระบบ IoT, การใช้งานหุ่นยนต์ในสายการผลิต, และการใช้เทคโนโลยีปัญญาประดิษฐ์</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a80f56687a7aa9a0c2cad32aa2eca821.jpg\" /></p>\n<p>นายธนพงษ์ อิทธิสกุลชัย หัวหน้าคณะผู้บริหาร กลุ่มลูกค้าองค์กร AIS ระบุว่าเทคโนโลยี 5G เป็นส่วนสำคัญในการปรับตัวของโรงงาน เพราะแนวโน้มอุตสาหกรรมที่มุ่งสู่การผลิตที่มีการปรับสายการผลิตบ่อยขึ้น 5G ทำให้โรงงานสามารถปรับเปลี่ยนสายการผลิตได้โดยไม่ต้องเดินสาย ควบคุมเครื่องจักรจำนวนมากและสายการผลิตสามารถปรับตัวตามการใช้งานที่เปลี่ยนไปได้ทันท่วงที (layout-free production line)</p>\n<p>ปัจจุบัน AIS มีเครือข่าย 5G สามารถให้บริการได้ครอบคลุมทั้งประเทศ โดยเฉพาะในเขตกรุงเทพมหานครและพื้นที่ EEC โดยสามารถออกแบบเครือข่าย 5G แบบเฉพาะ (5G Private Network) ได้ตามความต้องการใช้งานที่แตกต่างกันในแต่ละโรงงาน เพื่อเชื่อมต่ออุปกรณ์ต่างๆ ทั้งรถลำเลียงอัจฉริยะ (autonomous mobile robot - AMR), เซ็นเซอร์ต่างๆ ในโรงงาน ตลอดจนข้อมูลเครื่องจักรสำหรับเตรียมการซ่อมบำรุงล่วงหน้า (predictive maintenance) โดยการเชื่อมต่อเหล่านี้มีความเร็วสูง ความหน่วงต่ำ ปลอดภัยและเชื่อถือได้ รองรับการทำงานของอุปกรณ์ทั้งหมดได้เต็มรูปแบบ</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/cc676e84f94a60ddbd1f3d10f4874610.jpg\" /></p>\n<p>AIS และ OMRON ระบุว่าจะแบ่งการให้บริการลูกค้า โดยเทคโนโลยีต่างๆ ที่อยู่ในโรงงานเช่นเครื่องจักรและเซ็นเซอร์ต่างๆ จะเป็นหน้าที่ของ OMRON และระดับที่สูงกว่านั้น เช่น การเชื่อมต่อ 5G ไปจนถึงบริการคลาวด์จะให้บริการโดย AIS เป็นการผสานกันระหว่าง Information Technology (IT) และ Operation Technology (OT)</p>\n<p>ผู้ที่สนใจบริการธุรกิจจาก AIS เพิ่มเติม สามารถดูข้อมูลรายละเอียดต่างๆ ได้ที่<a href=\"https://business.ais.co.th/\">หน้าเว็บไซต์ของ AIS Business</a> ได้ทันที หรือติดต่อเจ้าหน้าที่ AIS Business ที่ดูแลท่านอยู่</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/omron\">Omron</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/thailand\">Thailand</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"96e0c758ad58c2d89b7164859d27331510009c1596a4f81cb0c3bb70c7cc801b","category":"Thai"}