{"title":"6 เหตุผลที่ IBM Power พร้อมสำหรับ SAP HANA ได้มากกว่า","link":"https://www.blognone.com/node/135308","date":1692257400000,"content":"<div><div><div><p>หลายคนคงทราบดีอยู่แล้วว่าซอฟต์แวร์ที่อยู่เบื้องหลังความสำเร็จขององค์กรมากมายทั่วโลกก็คือ SAP แน่นอนว่าคงไม่มีใครปฏิเสธถึงความสำคัญ ที่ระบบ SAP จำเป็นต้องพร้อมใช้งานอยู่เสมอ เพราะหากระบบ SAP ไม่พร้อมสำหรับบริการแล้ว ธุรกิจคงประสบปัญหาไม่ว่าทางใดก็ทางหนึ่ง แม้ความมีสเถียรภาพของโครงสร้างพื้นฐานจะเป็นเรื่องสำคัญ แต่ความมีประสิทธิภาพก็มีบทบาทไม่แพ้กัน โดยเฉพาะซอฟต์แวร์ in-memory database ที่องค์กรหวังพึ่งพาความเร็วนี้ให้ตอบสนองการตัดสินใจทางธุรกิจได้อย่างทันทีทันใด</p>\n<p>ด้วยความคาดหวังเหล่านี้ IBM จึงได้นำเสนอ IBM Power ที่ช่วยให้ท่านมั่นใจได้ว่า SAP HANA ขององค์กรจะอยู่บนระบบฮาร์ดแวร์ที่พร้อมใช้งานตลอดเวลา และรองรับการเติบโตของธุรกิจ โดยในบทความนี้ท่านจะได้รับทราบ 6 เหตุผลว่าทำไม IBM Power ถึงตอบโจทย์ SAP HANA ได้มากกว่า</p>\n<p><strong>1.) ความมีสเถียรภาพ คงทน</strong></p>\n<p>ทุกการ Downtime ของระบบใดระบบหนึ่งขององค์กรมักมีผลตามมาเสมอไม่มากก็น้อย ยิ่งเป็นระบบที่เป็นหัวใจสำคัญขององค์กรที่ช่วยจัดการเรื่องราวต่างๆอย่าง SAP ที่ความผิดพลาดนั้นเป็นเรื่องที่ยอมรับไม่ได้ ด้วยเหตุนี้หากต้องเลือกเซิร์ฟเวอร์ที่จะนำเข้ามาใช้งานสักตัวหนึ่ง องค์กรคงต้องมองหาเซิร์ฟเวอร์ที่ถูกออกแบบมาอย่างมีสเถียรภาพอย่างแท้จริง โดยเฉพาะ IBM Power ที่มีผลงานการันตีว่า</p>\n<ul>\n<li>IBM เป็นผู้นำด้าน Reliability มากกว่า 13 ปีโดยสถิติ uptime การให้บริการ SAP ถึง 99.999% จากรายงานของ Information Technology Consulting (ITIC)</li>\n<li>IBM มีเทคโนโลยี Memory Protection ที่ช่วยตรวจสอบปัญหาที่อาจจะเกิดขึ้นในส่วนของหน่วยความจำก่อนที่จะเกิดขึ้น เพื่อเป็นการป้องกันในเชิงรุก ซึ่งสำคัญมากับการทำงานแบบ In-memory อย่าง SAP HANA</li>\n<li>กรณีที่ชิปเสียหาย โมดูล Dual in-line memory (DIMM) จะช่วยทดแทนส่วนที่เสียหาย ทำให้งานสามารถดำเนินต่อไปได้ โดยเฉพาะความสามารถของ IBM Power10 ที่ให้ประสิทธิภาพของ Data Throughput และ Latency ต่ำ</li>\n<li>IBM ใส่ใจต่อประเด็นด้านความคงทนเป็นอย่างสูง ซึ่งเริ่มต้นตั้งแต่ในขั้นตอนการออกแบบ อีกทั้งยังมีการทดสอบด้วยระบบจำลอง (Simulation Test) และการทดสอบใช้งานกับโจทย์ในความเป็นจริงอีกด้วย</li>\n</ul>\n<p><strong>2.) พร้อมรองรับการเติบโต</strong></p>\n<p>คำแนะนำหนึ่งจากทีมงาน SAP ต่อลูกค้าที่ใช้งานก็คือการเพิ่มทรัพยากรได้เรื่อยๆ (Scale-up) เพื่อรองรับการเติบโตของข้อมูล ที่ท่านจะเห็นได้ว่าแนวโน้มเหล่านี้เป็นเรื่องที่เกิดขึ้นจริงและเป็นการเติบโตเป็นไปอย่างก้าวกระโดด เพราะมีแหล่งข้อมูลใหม่เพิ่มขึ้นมากเช่น IoT ข้อมูลที่ได้รับจากพาร์ทเนอร์ทางธุรกิจ และแพลตฟอร์มโซเชียลมีเดีย</p>\n<p>อย่างไรก็ดีโจทย์การขยายตัวเหล่านี้เป็นเรื่องที่ทำได้ยากโดยเฉพาะกับฮาร์ดแวร์ x86 ที่ใช้งานกันในอดีต นั่นหมายถึงการเพิ่มจำนวน Appliance เข้ามา หรือต้องใช้ Appliance หลายตัวต่อ SAP HANA เพียงแค่ 1 instance ด้วยเหตุนี้เองการขยายตัวจึงเป็นเรื่องที่มีต้นทุนทางการจัดการสูง แต่ไม่ใช่กับ IBM Power เนื่องจาก</p>\n<p>เทคโนโลยี IBM PowerVM Virtulization ทำให้ผู้ใช้งาน SAP HANA สามารถค่อยๆเพิ่มทรัพยากรการใช้งานได้ตั้งแต่ 0.01 คอร์และหน่วยความจำที่ 1 GB ซึ่งนอกจากจะรองรับการขยายตัวตามความจำเป็นแล้ว ยังหมายถึงการรับมือกับช่วงเวลาที่โหลดการใช้งานพุ่งสูงด้วย ทั้งนี้เทคโนโลยี Virtual Server ยังช่วยให้ธุรกิจสามารถ Provision เครื่องใหม่สำหรับจุดประสงค์การใช้งานที่ต่างกันออกไป เช่น เพื่อการทดสอบและพัฒนา หรือการใช้งานจริงในวัตถุประสงค์อื่น ตลอดจนเครื่อง Virtual เหล่านี้ยังสามารถย้ายข้ามระหว่าง IBM Power Server ได้โดยไม่ต้องปิดหรือรีบูตเครื่องอีกด้วย</p>\n<p><strong>3.) มั่นคงปลอดภัยมากขึ้น</strong></p>\n<p>ประเด็นเรื่องความมั่นคงปลอดภัยเป็นสิ่งที่องค์กรในปัจจุบันมองหา ยิ่งในยามที่ภัยคุกคามทางไซเบอร์กลายเป็นเรื่องที่เกิดขึ้นได้ทุกวัน ซึ่งหลายองค์กรพยายามจัดทำ Policy ที่รัดกุมมากขึ้น โดยจากสถิติของ ITIC พบว่าผู้ใช้งาน IBM Power กว่า 92% ชี้ว่าพวกเขาสามารถตรวจจับและป้องกันการโจมตีอย่างทันท่วงที ซึ่งเป็นสถิติที่เหนือกว่าเซิร์ฟเวอร์ทั่วไปในท้องตลาด</p>\n<p>โดยประสิทธิภาพด้านความมั่นคงปลอดภัยของ IBM Power กับ SAP HANA ยังสามารถทำ Memory Encryption ได้ด้วยอัลกอริทีมที่ได้รับการยอมรับโดยไม่กระทบต่อคุณภาพการทำงานของแอปพลิเคชัน ไม่เพียงเท่านั้นใน IBM Power10 ผู้ใช้งานยังสามารถพึ่งพาความแข็งแกร่งนี้ไปได้แม้กระทั่งวันที่ยุคแห่งควอนตัมมาถึง เนื่องจากการเข้ารหัสได้รองรับ Quantum-Safe แล้ว</p>\n<p><strong>4.) สนับสนุนเป้าหมายด้านความยั่งยืน</strong></p>\n<p>หมวดนึงของเป้าหมายด้านความยั่งยืนที่ภาคไอทีมีบทบาทสำคัญก็คืออัตราการปล่อยคาร์บอน ที่ภาคธุรกิจไอทีมีส่วนร่วมถึง 3.9% ของการปล่อยก๊าซเรือนกระจกทั้งโลก ซึ่งแน่นอนว่าผู้บริหารส่วนใหญ่เริ่มตระหนักถึงประเด็นนี้และบรรจุลงเป็นสิ่งที่ต้องทำในอนาคตอันใกล้ เช่นกันกับ IBM ที่ตระหนักถึงความสำคัญในอนาคตของโลกใบนี้ จนนำไปสู่การตั้งเป้าหมายว่า IBM Power รุ่นถัดไปต้องมีอัตราการใช้ไฟน้อยลงเรื่อยๆ เช่น เมื่อเทียบระหว่าง IBM Power9 และ IBM Power10 ในการใช้ไฟเท่ากันแต่ Power10 มีประสิทธิภาพมากกว่าถึง 50% นอกจากนี้ IBM เองยังให้ความสำคัญกับการใช้พลังงานหมุนเวียนและการเลือกใช้วัสดุที่ย่อยสลายได้</p>\n<p><strong>5.) พร้อมทุกทางเลือกในการใช้งาน</strong></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/2bc46600f084358fb7aa34929283db6a.jpg\" /></p>\n<p>แต่ละองค์กรย่อมมีความต้องการที่แตกต่างกันออกไป บางองค์กรอาจพึงพอใจกับการมี Appliance เป็นของตัวเอง แต่ก็อยากได้ความคุ้มค่าเทียบเท่ากันกับคลาวด์ที่ใช้จ่ายตามจริง ซึ่งนี่คือประโยชน์เชิงตัวเลขของ IBM Power ที่เห็นผลได้โดยตรง ด้วยโมเดลที่เริ่มต้นตามความต้องการก่อน และค่อยๆเปิดการใช้งานเพิ่มขึ้นในภายหลัง ด้วยเทคโนโลยี IBM Power Virtual Server หรือแม้แต่บริการคลาวด์เต็มรูปแบบบน IBM Cloud ผ่านโครงการ RISE with SAP ดังนั้นไม่ว่าท่านจะเป็นผู้ใช้งานในรูปแบบใดก็สามารถเลือก IBM Power ได้ทั้งสิ้น</p>\n<p><strong>6.) ความช่วยเหลือระดับพรีเมี่ยม</strong></p>\n<p>แน่นอนว่าทุกการใช้งานของระบบไอทีปัญหาเป็นสิ่งที่เกิดขึ้นได้เสมอ ดังนั้นคำถามที่ควรถูกถามคือจะมีช่องทางใดที่ช่วยให้การแก้ปัญหานั้นเป็นเรื่องง่ายและรวดเร็ว โดยในการใช้งาน IBM Power นั้นมาพร้อมกับเครื่องมือที่ช่วยให้ทีมงานไอทีสามารถตรวจสอบปัญหาที่อาจจะเกิดขึ้นและป้องกันเหตุได้ก่อนเกิดจริง นอกจากนี้ฟังก์ชัน Call Home ยังช่วยให้องค์กรสามารถรับความช่วยเหลือจากทีมงานของ IBM โดยตรง ไม่เพียงเท่านั้นยังมีคำแนะนำจาก AI ที่ช่วยแก้ปัญหาให้ลูกค้าไปแล้วนับหมื่นราย</p>\n<p>ในทางปฏิบัติจริงนั้น SAP HANA มีรายละเอียดปลีกย่อยอีกไม่น้อยที่ต้องคำนึงถึง เช่น การย้าย SAP จากระบบ On-premise เดิมสู่ SAP HANA หรือการใช้งานคลาวด์ ตลอดจนเมื่อการติดตั้งสำเร็จแล้ว ประสิทธิภาพที่เหมาะสมจริงกับองค์กรนั้นควรเป็นอย่างไร เพิ่มหรือลดอะไรได้บ้าง ในส่วนของฮาร์ดแวร์เองท่านสามารถมั่นใจได้เลยว่า IBM Power10 ได้ผ่านการรับรอง (Certified) กับ SAP HANA มาแล้ว แต่ในเรื่องของการออกแบบและดูแลหลังการขาย ผู้สนใจสามารถปรึกษาทีมงานของ Computer Union ได้ที่ email : <a href=\"mailto:cu_mkt@cu.co.th\">cu_mkt@cu.co.th</a> หรอ โทร 02 311 6881 #7151, 7158</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/7a3244a1afc31df8d3c00778c4163e87.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ibm\">IBM</a></div><div><a href=\"/topics/sap\">SAP</a></div><div><a href=\"/topics/hana\">HANA</a></div><div><a href=\"/topics/brandedcontent\">BrandedContent</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"96e0ad77ec20aff3d670eb82bf7621fd6f886bd41aec5892194abf942abc83c2","category":"Thai"}