{"title":"Apple Executive Hints at Using AirPods to Provide Users More Health Data","link":"https://www.macrumors.com/2021/06/16/apple-executive-hints-airpods-health-data/","date":1623850780000,"content":"In a wide-ranging interview about Apple's work and progress in the field of health, the company's vice president of technology, Kevin Lynch, has hinted that Apple may someday use sensor fusion with <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> to provide more health data to customers.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2020/03/apple-airpods-pro-snap.jpg\" />\r\n<br />\r\nCurrently, the <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> and Apple Watch both utilize a wide array of sensors to provide users with health data and information independently. In addition, Apple also uses sensor fusion, which combines data from sensors onboard the Apple Watch and ‌iPhone‌ to provide users with a more comprehensive view of their health. In an <a href=\"https://techcrunch.com/2021/06/16/apple-health/\">interview with <em>TechCrunch</em></a>, Lynch has hinted that Apple may add ‌AirPods‌ to the process of sensor fusion to provide more health data to Apple users.\r\n<br />\r\n<blockquote>Perhaps one place to look for even more potential in terms of future health capabilities lies in sensor fusion, however. Walking steadiness is the result of not just the ‌iPhone‌ or the Apple Watch acting independently, but of what’s possible when the company can use them in combination. It’s another place where Apple’s tight integration of software and hardware give it an edge, and it multiplies as Apple’s ecosystem of devices, and the sensors they carry, continues to grow.\r\n<br />\r\n\r\n<br />\r\nI ended our interview by asking Lynch about what kind of possibilities might open up when you consider that ‌AirPods‌, too, contain their own sensors and gather different data that could complement that monitored by the ‌iPhone‌ and Apple Watch in terms of health.\r\n<br />\r\n\r\n<br />\r\n“We already do sensor fusion across some devices today, and I think there’s all kinds of potential here,” he said.</blockquote>The suggestion from Lynch lines up with reporting from reliable Apple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a>, who has said that Apple does plan to introduce health tracking for ‌AirPods‌. More recently, <a href=\"https://www.macrumors.com/2021/05/28/airpods-pro-2-with-sensors-and-fitness-coming-2022/\"><em>Bloomberg's</em> Mark Gurman reports</a> that the second-generation <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a>, due for release next year, will include \"updated motion sensors with a focus on fitness tracking.\"\r\n<br />\r\n\r\n<br />\r\nDuring the remainder of the interview, Lynch also discusses new health features in <a href=\"https://www.macrumors.com/roundup/ios-15/\">iOS 15</a>, such as Health Tracking and Walking Steadiness. The executive, who has led Apple Watch development, also discussed how the Apple Watch has evolved into an \"intelligent guardian\" for users' health. Kevin Lynch and Apple's Deidre Caldbeck also joined <a href=\"https://youtu.be/MEi0wlWYW_M\">YouTuber Rene Ritchie</a> for an interview about the Apple Watch and health. <div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/airpods/\">AirPods</a>, <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/kevin-lynch/\">Kevin Lynch</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#AirPods\">AirPods (Don't Buy)</a>, <a href=\"https://buyersguide.macrumors.com/#AirPods-Pro\">AirPods Pro (Neutral)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airpods.216\">AirPods</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/06/16/apple-executive-hints-airpods-health-data/\">Apple Executive Hints at Using AirPods to Provide Users More Health Data</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-executive-hints-at-using-airpods-to-provide-users-more-health-data.2301146/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jvqqwp0Dm5I:SPv6MuJOhLc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jvqqwp0Dm5I:SPv6MuJOhLc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/jvqqwp0Dm5I\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"96ec7f6a6c007b34b40e76815274d8924cf0163c2df10ae813125a98272eb921","category":"Apple"}