{"title":"PSXII-2 Real-time detection of parturition in beef cows managed on extensive rangeland pasture","link":"https://academic.oup.com/jas/article/102/Supplement_3/603/7757660?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Parturition is a critical event in the beef production cycle and timely detection is extremely difficult to monitor when cows are managed on large rangeland pastures with varying topography, vegetation cover and long walking distances to water. Parturition may affect walking, grazing, and resting behaviors and cause social isolation. Altered behavior could possibly be detected in real-time using a low-cost LoRa WAN monitoring system capable of transmitting a cow’s position and activity over extensive distances (30 km). We tested this hypothesis using a combination of mathematical (MR) and statistical change point detection (CPR; Python rupture package) rules to alert parturition. Multiparous Brangus cows (n = 15) were observed at the New Mexico State University’s Chihuahuan Desert Rangeland Research Center from January to April 2023. Cows were collared with LoRa WAN GPS trackers embedded with triaxial accelerometers reporting position and activity at 1-h and 2-min intervals, respectively. Systematic monitoring through late gestation (&gt;7 mo) was conducted while cows grazed on a 690-ha desert shrubland and grassland pasture. Additionally, a trained operator inspected the herd twice daily, recording the parturition event to the nearest hour. Sensor data for 21 d prior to parturition were processed and hourly calculations of distance traveled (D; m), activity index (Ac), and Euclidean distance (m) to one (NN<sub>1</sub>), 2 (NN<sub>2</sub>) or three (NN<sub>3</sub>) nearest neighbors were combined to determine the best calving index for each rule. The best calving index for MR was IN<sub>MR</sub> = Ac*NN<sub>1</sub>/D<sup>2</sup>, which used ratios (RIN<sub>MRxy</sub>) between the IN<sub>MRxy</sub> for any hour x in day yr and the average IN<sub>MRxy</sub> in previous 7 d: RIN<sub>MRxy</sub>=IN<sub>MRxy</sub> /((IN<sub>MRxy-1</sub> +IN<sub>MRxy-2</sub>+…+IN<sub>MRxy-7</sub>)/7) to detect parturition for each cow. The best calving index for CPR was IN<sub>CPR</sub>=Ac*NN<sub>1</sub>/D. Parturition was declared either when RIN<sub>MRxy</sub> &gt; 9 and average RIN<sub>MRxy</sub> for three consecutive hours was &gt; 35 or using one change point detection of IN<sub>CPR</sub>. A detection window of 3 h before and 23 h after true parturition time was considered positive detection. A total of 15 and 14 true positive events and 2 and 1 false positive events were detected for MR and CPR, respectively. The MR successfully detected all events. The CPR missed one calving event, but detection failure was reverted by increasing the number of detection change points to two. A precision of 0.88 and 0.93, recall of 1.00 and 0.93 and F1-score of 0.94 and 0.93 were obtained for MR and CPR, respectively. Results support the use of low-cost LoRa WAN monitoring systems for near real-time remote detection of parturition of beef cows managed on large rangeland pastures. Further testing with more cows, parturition events, management systems and alternative machine learning procedures would be needed to confirm this hypothesis.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"96f44c4d76f3068e9dc10150bc0d733d9f90fb3f747d3720f132d6ac7189e27a","category":"Environment"}