{"title":"MacKeeper review: A convenient security suite saddled with a shady past","link":"https://www.macworld.com/article/552819/mackeeper-review.html","date":1637924400000,"content":"<div>\n<section><div></div></section><div><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Convenience of having multiple tools in one product</li><li>Free version lets you access most of the features</li></ul></div><div><h3>Cons</h3><ul><li>Paid subscription is expensive</li><li>Burdened with a bad reputation</li></ul></div></div></div>\n</div><h3>Price When Reviewed</h3><p>$62.64/year Family Plan; $60/year single Mac; $10.95/month single Mac</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Clario</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span>$11</span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mackeeper.com&amp;xcust=1-1-552819-2-242872-18684&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t</div>\n\t\t\n\n\n<p>Utter the word “MacKeeper,” and many Mac users will cringe in horror. That’s because this utility program picked up a sordid reputation in years past. Under its previous owners, MacKeeper was severely criticized for <a href=\"https://www.macworld.com/article/224718/how-to-uninstall-mackeeper-from-your-mac.html\">being difficult to uninstall</a> and for using scareware tactics to try to convince people to upgrade to the paid version. A former owner was even the target of a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.documentcloud.org/documents/2071538-zeobit-class-action-settlement-copy&amp;xcust=1-1-552819-1-0-0&amp;sref=https://www.macworld.com/feed\">class action lawsuit in 2014</a>, alleging that the company deceived users by reporting phony problems with their Macs. To make matters worse, a <a href=\"https://www.macworld.com/article/227004/mackeeper-hacked-data-for-13-million-accounts-exposed.html\">2015 data breach</a> leaked certain account details of millions of MacKeeper users.</p>\n\n\n\n<p>Now MacKeeper is owned by Clario, which has been striving to repair the past damage to the product’s reputation. The new owner has pulled back on the aggressive marketing schemes and rid itself of dubious affiliates. The software itself received a good grade from <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.av-test.org/en/antivirus/home-macos/macos-catalina/december-2020/clario-mackeeper-5.0-205208/&amp;xcust=1-1-552819-1-0-0&amp;sref=https://www.macworld.com/feed\">AV-Test</a> as well as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mackeeper.com/blog/mackeeper-achieves-ISO-27001-certification/&amp;xcust=1-1-552819-1-0-0&amp;sref=https://www.macworld.com/feed\">ISO 27001 certification</a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mackeeper.com/blog/mackeeper-notarisation/&amp;xcust=1-1-552819-1-0-0&amp;sref=https://www.macworld.com/feed\">notarization from Apple</a>. Assuming the company and product have learned from past mistakes, is it worth giving the suite another shot at this point?</p>\n\n\n\n<p>MacKeeper consists of 11 separate tools organized into four different categories. The Security category provides an antivirus scanner and an adware remover. Under the Cleaning category are a safe cleanup feature, a duplicate file finder, and a smart uninstaller. In the Performance category are a memory cleaner, a software update tracker, and a startup item locator. And under the Privacy category are an ID theft guard, a VPN, and an online ad blocker.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/mackeeper-overview.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>MacKeeper has a chat module so you can ask a “personal tech expert” any questions.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>MacKeeper comes in a free version and a paid subscription-based edition. The paid edition starts at $5 a month for an annual subscription and $10.95 a month for a monthly subscription. A family plan that covers four computers runs $5.20 a month for an annual subscription.</p>\n\n\n\n<p>The free flavor gives you access to most of the 11 built-in tools. The anti-adware tool provides on-demand scanning for free but requires a paid subscription for real-time scanning. The safe cleanup tool scans for junk files clogging up your Mac, while the private connect feature offers a VPN to secure your online connection. Both of those tools require the paid version.</p>\n\n\n\n<p>After installing MacKeeper, the program offers to scan your Mac for viruses, privacy problems, wasted storage space, and performance issues. You can review the findings but fixing any flagged issues is another option that requires you to pay. A subscription also grants you 24-7 tech support through which you can email, chat with, or talk to support staff. </p>\n\n\n\n<p>Still, what you get for free is mostly effective (though an <em>Unlock Free Version</em> button is a constant reminder) and the interface is clean and easy to use. The antivirus protection offers both real-time and on-demand scanning, while the duplicate file finder will scan your entire system or just specific folders for duplicate photos and other files. The smart uninstaller checks for unneeded applications, widgets, browser plugins, and leftovers, allowing you to choose the items you want removed. They all work well enough but nothing stands out against other cleaners apps.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/mackeepr-smart-unistaller.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The smart uninstaller checks for unneeded applications, widgets, browser plugins, and leftovers, allowing you to choose the items you want removed.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>The memory cleaner will free up RAM by removing unnecessary items from memory without you having to reboot your computer. The update tracker will check for any updates available for installed apps. The Login items tool looks for any programs that automatically launch at startup so you can disable the ones you don’t need. The ID theft tool sees if your email address was caught in any data breaches. Finally, the StopAd tool sets up extensions for Safari and Chrome to prevent ads and trackers from monitoring your online activities.</p>\n\n\n\n<h2>Bottom line</h2>\n\n\n\n<p>You can probably find individual products—and in some cases, more robust products—for each of the features in MacKeeper. But having all these tools under one roof makes for ease and convenience. As the paid subscription is pricey at $5 or more a month, the free version is good enough if you don’t need the cleanup tool or VPN or the 24-7 support. Based on my testing, each tool ran reliably, producing mostly useful results and no obvious scareware tactics. I especially liked the smart uninstaller, the software update tracker, and the ID theft guard. Those of you turned off by MacKeeper’s shady history may not be so willing to forgive and forget. But if you can get past all that, the latest version could be worth trying.</p>\n</div>","author":"Lance Whitney","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"96f89309cf2e0e3b28ae96f30bdbd45d187e3cad1ca70861060d3a8ea9a8679e","category":"Apple"}