{"title":"Investigating the Influence of Body Mass Index on Organs at Risk Doses for Adjuvant HDR Vaginal Cuff Brachytherapy In Patients with Early Stage Endometrial Carcinoma","link":"https://www.preprints.org/manuscript/202410.0606/v1","date":1728392158000,"content":"Background: This study aims to investigate the influence of Body Mass Index (BMI) on the doses received by organs at risk (OAR) during high-dose-rate (HDR) vaginal cuff brachytherapy in pa-tients diagnosed with early-stage endometrial carcinoma. Understanding the relationship be-tween BMI and OAR doses could enhance treatment planning and minimize complications.\nMethods: We collected brachytherapy data for 242 endometrial cancer patients treated with ad-juvant HDR vaginal cuff brachytherapy. The patients were categorized based on their BMI into normal weight, overweight, and obese groups. Dosimetric data were collected for OARs, includ-ing the bladder, rectum, and sigmoid colon and also for dose fractionation, D90 and the active length of the brachytherapy cylinder. The analysis included comparing the doses received by each organ across different BMI categories using appropriate statistical methods\nResults: Preliminary findings indicated a significant variation in the doses to OARs correlating with BMI classifications. Obese patients exhibited  slightly higher mean doses to the rectum and bladder compared to those with a normal BMI. The statistical analysis demonstrated that as BMI increased, the dose to these organs at risk also tended to increase, suggesting a need for ad-justed treatment planning strategies in this population.\nConclusions: Obesity is a key concern in endometrial cancer patients, with higher BMI linked to slightly increased doses to the rectum and sigmoid, though treatment remained homogeneously delivered.Future work should focus on refining dosimetric techniques and exploring strategies to mitigate OAR exposure in patients with higher BMI.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"96fff0700bd6361f69821c238e84b5742e777bad25897e13ce4d83c12586bc1d","category":"Interdisciplinary"}