{"title":"PSLBI-22 Identifying plasma metabolites influencing body weight in Salmonella challenged growing pigs: A machine learning approach","link":"https://academic.oup.com/jas/article/102/Supplement_3/638/7757651?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Body weight (BW) is an important component of pig productivity. Understanding the metabolic factors affecting growth rate is key to guiding nutritional strategies and bringing economic benefits to pig farms. Machine learning (ML) algorithms have been used to capture patterns in large datasets and predict animal production traits based on integrated information of performance data and blood records. However, utilizing ML models and metabolomic profiling to predict BW of pigs in small datasets with challenged animals has yet to be reported. Therefore, this study investigated use of plasma metabolites in predicting BW of pigs at the growing stage. This simulation used data from gilts (n = 40; BW = 25.6 ± 2.3 kg) raised over a 28-d trial. Plasma samples and BW were collected on d 0, 14, and 28 after 8 h of fasting. Ninety plasma metabolites were identified and quantified from an untargeted metabolomics assay. The development dataset included 30, and the validation dataset contained 10 unique animals with repeated measures in time. The metabolites were log-transformed, Pareto-scaled and missing values were imputed using the minimum nonzero value method. The BW prediction model was performed in R with the caret package. The optimal hyper-parameter configuration for the random forest and neural network algorithms was evaluated based on repeated cross-validation. The final model was the random forest composed of 400 trees with 45 randomly selected predictors. Model accuracy was estimated on repeated cross-validation with 10-folds and 5 repeats and compared with the validation set based on the coefficient of determination (R2), the root mean squared error (RMSE), and Pearson correlation (r). The metabolites with greater contribution with variable importance score above 10 to the model development were extracted. Aiming to understand differences in BW categories, the model response was visualized with an alluvial diagram for the 3 variables with the greatest metabolite importance, and BW was classified as high, medium, and low. The main metabolites driving BW were lysine, oleic acid, aminomalonic acid, myo-inositol, and linoleic acid. The RMSE after cross-validation was 7.22 kg of BW (r = 0.70), and R<sup>2</sup> = 0.39. For pigs with a high BW, the predicted BW was explained by generally less plasmatic concentrations of lysine, oleic acid, and aminomalonic acid. Lysine is the main amino acid for muscle protein accretion, whereas oleic acid is for energy substrate. Aminomalonic acid is a metabolite resulting from glycine metabolism and is important in reversing oxidative damage caused by pathogens. Therefore, decreased plasma lysine, amino malonic acid, and oleic acid may indicate faster growth and lean deposition, leading to heavier BW in pigs. Using random forests helped to connect the plasma dynamics to BW and is a promising avenue to understand the main drivers in BW of group-housed pigs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9704199bb36a90ab7c8386da4202dd1fc0a909b06bb5db0fce9484fa5d17fea9","category":"Environment"}