{"title":"Source partitioning of dissolved inorganic carbon addition to Pacific Winter Water in the western Arctic Ocean","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12684?af=R","date":1726622345000,"content":"<h2>Abstract</h2>\n<p>Pacific Winter Water (PWW) with high dissolved inorganic carbon (DIC) is the key water mass in which subsurface acidification occurs in the western Arctic Ocean. To investigate and partition carbon sources added to PWW across the Chukchi shelf to the adjacent Canada Basin, we investigated the distributions of DIC and its stable isotope (δ<sup>13</sup>C-DIC) with other hydrographic and biogeochemical parameters during the Mirai cruise in the late summer of 2021. Using a four-end-member mixing model, we deciphered the water masses and separated DIC changes induced by biological processes from those induced by conservative mixing. We demonstrated that DIC dynamics in PWW were mainly controlled by the biological decomposition of organic carbon (OC). A mass balance model analysis of DIC and δ<sup>13</sup>C-DIC suggested that the apparent δ<sup>13</sup>C signature of the respired organic carbon (δ<sup>13</sup>C<sub>OCx</sub>) within PWW was −22.2‰ ± 1.1‰ on the shelf and −25.6‰ ± 1.6‰ in the basin. Therefore, we concluded that marine-origin OC was the dominant carbon source that was decomposed in the Chukchi shelf bottom water, while respired terrestrial-origin carbon made a major contribution to DIC pool in the basin PWW. We proposed that terrestrial OC from the Chukchi and Beaufort coastal seas could be an important carbon source, which was associated with winter water formation on the shelves and influenced by Beaufort Gyre state shift and circulation changes. This unconventional finding has important ramifications for the prediction of the future state of ocean acidification in the western Arctic Ocean.</p>","author":"Zhangxian Ouyang, \nAmane Fujiwara, \nShigeto Nishino, \nAkihiko Murata, \nQian Li, \nMariko Hatta, \nYun Li, \nNajid Hussain, \nWei‐Jun Cai","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"97161497384899406b53dfe96c1cf2adddacf097a8f405a4016675fe1691f71f","category":"Environment"}