{"title":"The Platformisation of Cycling. The Development of Bicycle Sharing Systems in China between Innovation, Urban and Social Regeneration and Sustainability","link":"https://www.preprints.org/manuscript/202404.0759/v1","date":1712814631000,"content":"In recent years, the widespread introduction of bike-sharing systems in China has had a profound impact on the daily lives of Chinese citizens and the development of the urban transport system. This article attempts to analyse the impact of this phenomenon on sustainability. The gradual improvement of related monitoring measures has facilitated the maturation of the bike-sharing industry from the initial stage of uncontrolled growth to the current stage of standardised management. By tracing the global development of bike-sharing systems with a special focus on China, this study sheds light on the platformisation of bicycles and its multiple impacts on technical, environmental, cultural, economic and social sustainability. Furthermore, the study provides a comprehensive analysis of the transformation of bicycles in China and highlights the diverse impacts of platform-based bike sharing on various facets of Chinese society. The development of different bike-sharing systems in China is a unique and crucial case to interpret the current situation of bike-sharing and imagine future scenarios. In contrast to the prevailing and uniform approach derived from the experiences of Northern European countries, the massive and widespread experimentation with different bike-sharing schemes in China reveals not only potentials and aspects of sustainability, innovation and urban and social regeneration, but also some hidden shadows similar to those in small-scale contexts such as Northern Europe. Furthermore, the study emphasises the crucial role of sustainable development principles in addressing urban challenges specific to China.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"971e62f41d6b862d6982e683e63113d75fe6f26d1805f0f23d41069645bc8a07","category":"Interdisciplinary"}