{"title":"Are weapon allometries steeper in major or minor males? A meta-analysis","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae069/7753501?rss=1","date":1725840000000,"content":"<span><div>Abstract</div>Competition for mates can drive the evolution of exaggerated weaponry and male dimorphism associated with alternative reproductive tactics. In terrestrial arthropods, male dimorphism is often detected as non-linear allometries, where the scaling relationship between weapon size and body size differs in intercept and/or slope between morphs. Understanding the patterns of non-linear allometries is important as it can provide insights into threshold evolution and the strength of selection experienced by each morph. Numerous studies in male-dimorphic arthropods have reported that allometric slopes of weapons are shallower in large “major” males compared to small “minor” males. Because this pattern is common among beetles that undergo complete metamorphosis (holometabolous), researchers have hypothesized that the slope change reflects resource depletion during pupal development. However, no comprehensive survey has examined the generality of this trend. We systematically searched the literature for reports of weapon allometries in male dimorphic species and conducted a phylogenetically controlled meta-analysis to explore the factors influencing the difference in slopes between morphs. Our search identified 59 effect sizes from 19 studies, 50 species, and 5 orders of terrestrial arthropods. We found strong evidence that metamorphosis type influences the patterns of weapon allometries. Slopes were significantly steeper in minor males compared to major males in holometabolous species, but there was no difference in slopes between morphs in hemimetabolous species (i.e. those that undergo incomplete or no metamorphosis). These results support the hypothesis that holometabolous species face a resource ceiling during pupal development that limits the exaggeration of weapon size.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"9730d2a72cbb394fcc7dfc6b4fe5daab1d9dd67203375353627885a5247ae634","category":"Environment"}