{"title":"Effects of warm environmental temperature on human placental transcriptomes in term and preterm births","link":"https://www.preprints.org/manuscript/202407.2445/v1","date":1722325279000,"content":"Demographic studies have revealed a strong association between exposure to high ambient temperatures during pregnancy and increased risks of preterm birth (PTB). The mechanism underlying this association is unclear, but it is plausible that altered placental function may contribute. In this study, we conducted differential gene expression analysis, gene set enrichment analysis (GSEA), and gene ontology (GO) analysis on bulk RNA-seq data from human placentas delivered at term and preterm during the warmer months compared to placentas delivered at term and preterm during the colder months in the UK. We detected 48 differentially expressed genes in preterm placentas delivered during the warmer months compared to preterm placentas delivered during the colder months, the majority of which were inflammatory cytokines and chemokines, including SERPINA1, IL1B, CCL3, CCL3L3, CCL4, CCL4L2, CCL20, and CXCL8. The GSEA positively enriched 17 signalling pathways, including the NF-κB, IL17, toll-like receptor, and chemokine signalling pathways, in warm-exposed preterm placentas, which were not observed in warm-exposed term placentas. The GO analysis revealed several biological processes, including neutrophil, granulocyte, monocyte, and lymphocyte chemotaxis, as well as inflammatory and humoral immune responses in warm-exposed preterm placentas, but not in warm-exposed term placentas. We conclude that maternal exposure to warm environmental temperatures during pregnancy alters the placental transcriptome towards inflammation and immune regulation, potentially leading to PTB.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"97408e7387a30633670690f48d424d3ddaf515a5dbc9e29d3d24ace8ecf5c595","category":"Interdisciplinary"}