{"title":"Dietary patterns; serum concentrations of selenium, copper, and zinc; copper/zinc ratio; and total antioxidant status in patients with glaucoma","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301511","date":1712066400000,"content":"<p>by Izabela Zawadzka, Maryla Młynarczyk, Martyna Falkowska, Katarzyna Socha, Joanna Konopińska</p>\r\n\r\nThis study aimed to identify the biochemical parameters that determine the occurrence of glaucoma and assess the correlation between oxidative stress and clinical data in patients with glaucoma and healthy controls. We enrolled 169 participants; the glaucoma group comprised 104 patients with primary open-angle, pseudoexfoliation, or angle-closure glaucoma, and the control group comprised 65 healthy individuals. Serum concentrations of selenium (Se), copper (Cu), and zinc (Zn); Cu/Zn ratio; and total antioxidant status were measured in both groups. Significantly lower Se and Zn serum levels were observed in men (67.7 ± 17.14 g/L and 0.76 ± 0.11 mg/L, respectively) and women (68.73 ± 16.21 g/L and 0.76 ± 0.13, respectively) with glaucoma. Moreover, significant correlations were identified between serum Se concentration and corrected distance visual acuity (CDVA) and between serum Cu concentration and CDVA (p &lt; 0.005 and p &lt; 0.05, respectively). We also observed a significant positive correlation (r = 0.244, p &lt; 0.05) between pRNFL thickness and BMI and a negative correlation (r = -0.289, p &lt; 0.05) between serum Se concentration and the age of male patients with glaucoma. Additionally, the percentages of participants with below-normal, normal, and above-normal Se, Zn, and total antioxidant capacity serum levels were compared between both groups. Compared with healthy controls, a significantly higher percentage of patients with glaucoma had a below-normal Se serum concentration. A notable negative correlation was observed between Zn and copper serum levels of patients with glaucoma in both sexes. We believe that this study serves as a basis for considering personalized nutritional therapy for the prevention and supportive treatment of patients with glaucoma.","author":"Izabela Zawadzka","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9746d18798038ba9e97942ae757d4b82c54b8d15046744559f9ab9d0a0e681ab","category":"Interdisciplinary"}