{"title":"Garmin Changes Public Beta Program For Faster and Easier Access","link":"https://www.dcrainmaker.com/2023/03/garmin-changes-public-beta-program-for-faster-and-easier-access.html","date":1679306497000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2023/03/Garmin-Beta-Program-Changes.jpg\"><img title=\"Garmin-Beta-Program-Changes\" src=\"https://media.dcrainmaker.com/images/2023/03/Garmin-Beta-Program-Changes_thumb.jpg\" alt=\"Garmin-Beta-Program-Changes\" width=\"720\" height=\"480\" /></a></p>\n<p>Garmin has announced a set of changes to their public beta program, which they say are based on feedback from customers. While Garmin has had public beta firmware versions for a number of years, it was only a year ago that they formalized it into a cohesive program. <a href=\"https://www.dcrainmaker.com/2022/05/garmin-beta-platform-revamp.html\">That program allowed users</a> to sign-up their watches to receive public beta firmware updates, including via WiFi and Bluetooth.</p>\n<p>Previously, beta users had to manually connect their watch to their computer and download/install each update with a USB cable. As one might expect, that lowered participation – as well as lowered people remembering to update to the latest beta versions. Thus, the beta program a year ago meant once you signed up your unit, it would get the latest beta updates within a day of them coming out, as well as the final production version too.</p>\n<p>Except, they also made one quirky change: They relabeled the earlier beta builds as “Alpha” builds, and then made those computer-only installs. By the time they got to the public beta builds, it was basically the final few days of the beta, and the feedback wasn’t as valuable anymore. In reality, this made little sense. Those public alpha builds were already internal-Garmin beta level quality, and historically would have been public beta builds. Adding a layer of manual-download to this process only limited the feedback Garmin would get. Also, it was just confusing AF as to which category things were in – without serving any real-world difference.</p>\n<p>Today, that changes. Well, today for the Outdoor group, and Monday for the Fitness group. But either way, the change is essentially immediate. Here’s what’s changing:</p>\n<blockquote><p>1) All pre-release software is now just called ‘Beta’, no more public ‘Alpha’ term used<br />\n2) Beta updates will be divided into “Early Beta” and then just “Beta”<br />\n3) However, now you can check via WiFi to download those “Early beta” updates (what were previously Alpha updates)<br />\n4) For devices with WiFi, the menu option allows for instant checking and downloading of early beta updates<br />\n5) For all other regular beta updates, they’ll automatically download/install<br />\n6) For production releases, you can also now force-check within the watch, even before 100% roll-out</p></blockquote>\n<p>In other words, <strong>super boiled down, the big differences for geeks like me that care are</strong>:</p>\n<blockquote><p>A) Alpha naming goes away<br />\nB) You can now avoid grabbing the cable/computer<br />\nC) You can force the latest early beta/beta/production build immediately, via WiFi, from your watch</p></blockquote>\n<p>There’s literally no downside to this at all. This is purely upside. The singular gap is of course for non-WiFi products, such as the Garmin Instinct series. They don’t have a ‘check-now’ option like the WiFi-enabled products do, despite the fact that it could be triggered over Bluetooth. Garmin says they’re exploring how this could work down the road for those products, and they seem to understand there’s just as much interest in streamlining this process for Instinct/etc users as everyone else. Till then, they’ll just simply sideload any betas via computer/cable like they always have.</p>\n<p>The only nitpick I’d have right now in the process is that there’s not any obvious way to know an ‘Early Beta’ update is available to go and check for. Sort of a ‘if a tree falls in the forest’ type of thing. Certainly, the goal is that you go to the <a href=\"https://forums.garmin.com/beta-program/\">Garmin Beta Forums</a> on a regular basis and then know. But ideally, this is where it’d be cool to see a bit of Garmin Connect Mobile integration. For example, when an Early Beta (or even regular beta) is available for your product, to have it do a standard app push notification (e.g. like when someone comments on a Facebook post of yours). I could see Garmin waiting perhaps 12-24 hours for that push notification, just in case very early forum feedback indicates an issue. But something to let me know to check, with a link to the details of what’s changed, would be great.</p>\n<p>In any case, Garmin is gearing up to start their next quarterly beta cycle. The company says the following products will be included on that beta cycle under the above new WiFi updating scheme:</p>\n<blockquote><p>– Edge 1040 Solar<br />\n– Edge 1040<br />\n– Fenix 7/Epix Gen 2<br />\n– Forerunner 255 Music<br />\n– Forerunner 945 LTE<br />\n– Forerunner 955<br />\n– Venu 2<br />\n– Venu 2 Plus</p></blockquote>\n<p>Again, the pattern you’ll notice is all of the above products have WiFi. That means that non-WiFi products like the Instinct 2 or Forerunner 255 non-Music won’t have the WiFi force-update option yet. Those products will just get computer/cable sideloads like normal for Early Beta. Similarly, I wouldn’t overthink there not being a beta program for the Forerunner 265/965 yet. Historically Garmin has waited a little bit before launching beta programs for just-announced products. Likewise, Garmin is confirming some details on the Fenix 6/MARQ in terms of the Force Update WiFi option, but they did confirm it’ll continue to get beta updates.</p>\n<p>Finally, just in case you want to join the beta, you can follow <a href=\"https://forums.garmin.com/beta-program/w/beta-wiki/112/how-to-enroll-for-public-beta-program\">the instructions here</a> to get your device registered. Unless your device is registered, the beta updates won’t show up, no matter how many times you try to force update.</p>\n<p>Expect that next quarterly release cycle to begin in the very very near future, where we typically see new features that tend to release to production about 30-45 days later, depending on the product and how things go. It’s expected we’ll see some of the new <a href=\"https://www.dcrainmaker.com/2023/03/garmin-forerunner-265-265s-the-complete-beginners-guide.html\">Forerunner 265</a>/<a href=\"https://www.dcrainmaker.com/2023/03/garmin-forerunner-965-in-depth-review.html\">Forerunner 965</a> features launched on the Fenix 7/Epix/Forerunner 955/255 units, such as wrist-based running dynamics.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"974c639994f3c71db58d01a09f035964add7725c8dc55a9d30f8732342613089","category":"Cycling"}