{"title":"Time-frequency analysis reveals an association between the specific nuclear magnetic resonance (NMR) signal properties of serum samples and arteriosclerotic lesion progression in a diabetes mouse model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299641","date":1709906400000,"content":"<p>by Kanako Yui, Yoshimasa Kanawaku, Akio Morita, Keiko Hirakawa, Fanlai Cui</p>\r\n\r\nDiabetes causes arteriosclerosis, primarily due to persistent hyperglycemia, subsequently leading to various cardiovascular events. No method has been established for directly detecting and evaluating arteriosclerotic lesions from blood samples of diabetic patients, as the mechanism of arteriosclerotic lesion formation, which involves complex molecular biological processes, has not been elucidated. “NMR modal analysis” is a technology that enables visualization of specific nuclear magnetic resonance (NMR) signal properties of blood samples. We hypothesized that this technique could be used to identify changes in blood status associated with the progression of arteriosclerotic lesions in the context of diabetes. The study aimed to assess the possibility of early detection and evaluation of arteriosclerotic lesions by NMR modal analysis of serum samples from diabetes model mice. Diabetes model mice (BKS.Cg db/db) were bred in a clean room and fed a normal diet. Blood samples were collected and centrifuged. Carotid arteries were collected for histological examination by hematoxylin and eosin staining on weeks 10, 14, 18, 22, and 26. The serum was separated and subjected to NMR modal analysis and biochemical examination. Mice typically show hyperglycemia at an early stage (8 weeks old), and pathological findings of a previous study showed that more than half of mice had atheromatous plaques at 18 weeks old, and severe arteriosclerotic lesions were observed in almost all mice after 22 weeks. Partial least squares regression analysis was performed, which showed that the mice were clearly classified into two groups with positive and negative score values within 18 weeks of age. The findings of this study revealed that NMR modal properties of serum are associated with arteriosclerotic lesions. Thus, it may be worth exploring the possibility that the risk of cardiovascular events in diabetic patients could be assessed using serum samples.","author":"Kanako Yui","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"976b4ac1d4d8203292b7670094624a3a9dcca01972476ed06c57a9f586835272","category":"Interdisciplinary"}