{"title":"Dendrobium officinale flos water extract ameliorates ethanol‐induced acute gastric mucosal injury via inhibiting oxidative stress and inflammation","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13687?af=R","date":1719410345000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Dendrobium officinale</i> flos (DOF), a novel food raw material, is used in Chinese folk medicine to nourish the stomach. However, there is still no available study to evaluate the effects of DOF on animal models of acute gastric injury and its mechanism by modern pharmacological research.</p>\n<h2>RESULTS</h2>\n<p>Herein, we characterized the major components of an aqueous extract of DOF and assessed its potential ameliorative effects in a rat model of acute gastric mucosal injury. The DOF water extract showed significant protective effects on the gastric mucosa and exhibited excellent antioxidant and anti-inflammatory activities. Acute gastric injury rat models induced by ethanol (6 mL kg<sup>−1</sup>) were pretreated with different doses of DOF water extract (50–100 mg kg<sup>−1</sup> day<sup>−1</sup>), and the biological effects of DOF extract in gastric tissues were evaluated. DOF extract alleviated the symptoms of ethanol-stimulated acute gastric mucosal injury, as evidenced by a significant reduction in gastric injury index and the degree of gastric pathological changes. Additionally, treatment with DOF extract upregulated mucin expression in the gastric mucosa, attenuated oxidative stress, decreased the release of inflammatory mediators (TNF-<i>α</i>, IL-6), suppressed the expression of key proinflammatory enzymes (COX-2 and iNOS), reduced the phosphorylation of p38 MAPK and p65 NF-<i>κ</i>B and increased the level of PGE2 in gastric tissues.</p>\n<h2>CONCLUSION</h2>\n<p>DOF exerts protective effects against ethanol-induced acute gastric mucosal injury, mainly by inhibiting inflammation and oxidative stress. © 2024 Society of Chemical Industry.</p>","author":"Pinglong Fan, \nShuchun Xie, \nZhiQian Zhang, \nQuan Yuan, \nJiajiang He, \nJie Zhang, \nXinyue Liu, \nXiaoyi Liu, \nLieqiang Xu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"976f5abf11689953a12d9b0128c6c46a98a9d3ad57504f66b9b5a7fc6800ffc2","category":"Environment"}