{"title":"Facebook Pay extends its reach later this summer","link":"https://arstechnica.com/?p=1780591","date":1626371825000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1215678331-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/GettyImages-1215678331.jpg\">Enlarge</a> <span>/</span> Facebook Pay is one of many payment services aiming to eliminate the \"phone, laptop, credit card\" shuffle by offering easily accessed one-tap payment options. (credit: <a href=\"https://www.gettyimages.com/detail/photo/middle-aged-woman-in-white-jeans-and-a-yellow-royalty-free-image/1215678331\">Fiordaliso via Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>This August, Facebook will be making its Facebook Pay payment service available outside its own platforms for the first time. Facebook's <a href=\"https://www.facebook.com/business/news/integrate-facebook-pay-directly-into-business-website\">announcement</a> describes the move as providing a mobile-friendly seamless checkout experience for businesses that elect to use it, pointing out that Facebook users already use the service to send money and buy items in <a href=\"https://about.fb.com/news/2020/05/introducing-facebook-shops/\">Facebook Shops</a> and the Facebook Marketplace.</p>\n<p>There isn't much meat in Facebook's announcement, which mostly rehashes feel-good bullet points that apply to the entire online financial industry, not just Facebook Pay—for example, the system's use of encrypted storage and the fact that businesses accepting Facebook Pay don't need to manage customers' card or bank account numbers. While these features sound good at first blush, they're both <em>de rigueur</em>, not innovations—the majority of online stores already use third-party payment processors that manage credit card and bank account numbers for them.</p>\n<p>Facebook pledges that Pay users' credit card and bank account information won't be used to \"personalize their experience\" or target advertisements. The company also says that payments and purchases will not be shared with a user's friends or to a user's profile or feed. It's worth noting that these are explicitly separate promises, though—Facebook <em>isn't</em> promising that payments and purchases won't be used for \"personalization\" or ad targeting.</p></div><p><a href=\"https://arstechnica.com/?p=1780591#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780591&amp;comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9773e3f89a0af722235e5d070e6cb9458ca8c34ca8a9584ab23f667830edfd2d","category":"Tech"}