{"title":"Need for annual COVID shots may hinge on how many get vaccinated now, Fauci says","link":"https://arstechnica.com/?p=1766436","date":1621547372000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1230260772-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/12/GettyImages-1230260772.jpg\">Enlarge</a> <span>/</span> Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, receives the Moderna Inc. COVID-19 vaccine during an event at the NIH Clinical Center Masur Auditorium in Bethesda, Maryland, on Tuesday, Dec. 22, 2020.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/anthony-fauci-director-of-the-national-institute-of-allergy-news-photo/1230260772?adppopup=true\">Getty | Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>As COVID-19 vaccination efforts continue across the United States, many are wondering how long protection from the shots might last. And if protection is relatively short-lived, what does that mean for the years ahead? Will we need boosters? Will COVID-19 vaccines become an annual jab like the seasonal flu shot?</p>\n<p>In back-to-back public interviews, top infectious disease expert Anthony Fauci provided the current outlook based on the latest data. Boosters are looking likely, but it's still unclear when we'll need them, with current speculation landing in the range of a year or so after previous vaccination. Whether we'll need them <em>every</em> year seems, for now, dependent on how many people get vaccinated this year.</p>\n<h2>Boosters</h2>\n<p>Speaking at <a href=\"https://www.youtube.com/watch?v=gwtFCp1_UDU\">an Axios virtual event</a> Wednesday, Dr. Fauci emphasized that “we don’t know exactly when” a booster will be required. We know that the current vaccines remain protective for at least six months—“and likely considerably more,” Fauci added.</p></div><p><a href=\"https://arstechnica.com/?p=1766436#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1766436&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"97797454b254eca8715a616fe8ffeaebbdc3ee08db4c03d49e75ce62add7905a","category":"Tech"}