{"title":"Estimating Fishing Exploitation Rates to Simulate Global Catches and Biomass Changes of Pelagic and Demersal Fish","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004604?af=R","date":1729142138000,"content":"<h2>Abstract</h2>\n<p>Robust projections of future trends in global fish biomass, production and catches are needed for informed fisheries policy in a changing climate. Trust in future projections, however, relies on establishing that models can accurately simulate past relationships between exploitation rates and ecosystem states. In addition, historical simulations are important to describe how the oceans have changed due to fishing. Here we use fisheries catch, catch-only assessment models and effort data to estimate regional fishing exploitation levels, defined as the fishing mortality relative to fishing mortality at maximum sustainable yield (F/F<sub>MSY</sub>). These estimates are given for large pelagic, forage and demersal fish types across all large marine ecosystems and the high seas between 1961 and 2004; and with a ‘ramp-up’ between 1841 and 1960. We find that global exploitation rates for large pelagic and demersal fish consistently exceed those for forage fish and peak in the late 1980s. We use the rates to globally simulate historical fishing patterns in a mechanistic fish community model. The modeled catch aligns with the reconstructed catch, both for total catch and catch distribution by functional type. Simulations show a clear deviation from an unfished model state, with a 25% reduction in biomass in large pelagic and demersal fish in shelf regions in recent years and a 50% increase in forage fish, primarily due to reduced predation. The simulations can set a baseline for assessing the effect of climate change relative to fishing. The results highlight the influential role of fishing as a primary driver of global fish community dynamics.</p>","author":"P. D. van Denderen, \nN. Jacobsen, \nK. H. Andersen, \nJ. L. Blanchard, \nC. Novaglio, \nC. A. Stock, \nC. M. Petrik","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"9789371ce4a21e6d05e0f27d6443ce79458d2d4d56612026fb85b34eccbd3ed8","category":"Environment"}