{"title":"Trump Ban From Facebook Upheld by Oversight Board","link":"https://www.nytimes.com/2021/05/05/technology/facebook-trump-ban-upheld.html","date":1620225057000,"content":"\n<p>Mike Isaac, reporting for The New York Times:</p>\n\n<blockquote>\n  <p>Facebook’s Oversight Board, which acts as a quasi-court to deliberate the company’s content decisions, said the social network was right to bar Mr. Trump after he used the site to foment an insurrection in Washington in January. The panel said the ongoing risk of violence “justified” the suspension. But the board also said that Facebook’s penalty of an indefinite suspension was “not appropriate,” and that the company should apply a “defined penalty.” The board gave Facebook six months to make its final decision on Mr. Trump’s account status. […]</p>\n\n<p>But while Mr. Trump’s Facebook account remains suspended for now, it does not mean that he will not be able to return to the social network at all once the company reviews its action. On Tuesday, Mr. Trump had unveiled a new site, “From the desk of Donald J. Trump,” to communicate with his supporters. It looked much like a Twitter feed, complete with posts written by Mr. Trump that could be shared on Facebook, Twitter and YouTube.</p>\n</blockquote>\n\n<p>The word is <em>blog</em>. He doesn’t have a “<a href=\"https://www.foxnews.com/us/trump-circumvents-twitter-facebook-bans-launches-own-communications-platform\">new communications platform</a>” — he has a blog. Which is good! He should. This is exactly why being kicked off Twitter and suspended from Facebook doesn’t silence or censor Trump, in the same way that being banned from a restaurant doesn’t starve someone.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/05/05/trump-facebook\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"978cf4d5da79790170d5139758511dac4551867ac73e583b97a22a6c6888b696","category":"Tech"}