{"title":"517 The effects of pellet starch concentration and allocation amount for Holstein cows in peak, mid, and late lactation in an automatic milking system","link":"https://academic.oup.com/jas/article/102/Supplement_3/147/7757399?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>This study evaluated the effects of pellet starch concentration and amount of pellet delivered in an automated milking system (AMS) on AMS pellet and partial mixed ration (PMR) intake, milk and milk component yield, and milking and feeding behavior for Holstein cows at different stages of lactation. Twenty-four Holstein cows at peak [n = 8; 85 ± 25.7 days in milk (DIM)], mid (n = 8; 185 ± 35.1 DIM) or late (n = 8; 290 ± 69.5 DIM) lactation (3 squares/DIM category), housed in a free-stall barn with a feed-first guided traffic flow AMS, were used. Treatments included low (LS; 24% DM) or high (HS; 34% DM) starch pellets that were provided at low (LA; 2 kg/d DM) or high (HA; 6 kg/d DM) quantities within replicated 4 × 4 Latin square design. Each period lasted 21 d including 16 d of adaptation and 5 d of data and sample collection to evaluate feed intake and behavior, milking characteristics, milk and milk component yields. Pellet starch did not affect the amount of pellet consumed, but HA cows consumed more pellet than LA (4.3 vs. 1.8 kg/d; <span>P</span> &lt; 0.01). Relative to LA, HA had greater pellet refused in the AMS (<span>P</span> &lt; 0.01) and decreased PMR intake (<span>P</span> = 0.04). Total DMI was 1.3 kg/d greater for HA than LA cows (<span>P</span> = 0.05). Pellet starch and DIM did not affect PMR intake or DMI. Neither pellet starch nor allocation affected the number of PMR meals; however, LA increased PMR eating time by 20 min/d (<span>P</span> &lt; 0.01) and PMR meal length by 2 min/meal (<span>P</span> = 0.03). Milking frequency was not affected by pellet starch or DIM, but HA tended to increase total milking frequency (2.7 vs. 2.6 no/d; <span>P</span> = 0.06) over LA, with greater voluntary milkings (2.5 vs 2.3 no/d; <span>P</span> &lt; 0.01). Milk yield/visit and milking duration were not affected by pellet starch or allocation. Milk yield was not affected by pellet starch, or the amount allocated averaging 43.2, 41.3 and 43.2 kg/d for peak, mid, and late lactation cows (<span>P</span> ≥ 0.19). Compared with LS, HS decreased milk fat concentration (4.1 vs 3.9%; <span>P</span> &lt; 0.01) and providing the HA reduced milk fat concentration (4.1 vs 3.96%; <span>P</span> &lt; 0.01) when compared with LA; however, neither pellet starch nor allocation affected fat yield, averaging 1.67 kg/d (<span>P</span> ≥ 0.15). True protein yield was not affected. Cows fed the LA had greater milk urea nitrogen (14.8 mg/dL) relative to HA (14.3 mg/dL; <span>P</span> = 0.03). Increasing the amount of pellet allocated in the AMS reduced PMR intake, while increasing total DMI and resulted in greater amounts of pellet refusals by cows; however, greater amounts of pellet may increase attendance at the AMS without affecting milk or milk component yields. Starch concentration of the pellet had little effect on productivity.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"978d93d12baa48affb3982ec1b1b8efa98389d290d571c9bde189d451720a4b3","category":"Environment"}