{"title":"Guiding seed movement: environmental heterogeneity drives genetic differentiation in Plathymenia reticulata, providing insights for restoration","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae032/7684935?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Forest and landscape restoration is one of the main strategies for overcoming the environmental crisis. This activity is particularly relevant for biodiversity-rich areas threatened by deforestation, such as tropical forests. Efficient long-term restoration requires understanding the composition and genetic structure of native populations, as well as the factors that influence these genetic components. This is because these populations serve as the seed sources and, therefore, the gene reservoirs for areas under restoration. In the present study, we investigated the influence of environmental, climatic and spatial distance factors on the genetic patterns of <span>Plathymenia reticulata</span>, aiming to support seed translocation strategies for restoration areas. We collected plant samples from nine populations of <span>P. reticulata</span> in the state of Bahia, Brazil, located in areas of Atlantic Forest and Savanna, across four climatic types, and genotyped them using nine nuclear and three chloroplast microsatellite markers. The populations of <span>P. reticulata</span> evaluated generally showed low to moderate genotypic variability and low haplotypic diversity. The populations within the Savanna phytophysiognomy showed values above average for six of the eight evaluated genetic diversity parameters. Using this classification based on phytophysiognomy demonstrated a high predictive power for genetic differentiation in <span>P. reticulata</span>. Furthermore, the interplay of climate, soil and geographic distance influenced the spread of alleles across the landscape. Based on our findings, we propose seed translocation, taking into account the biome, with restricted use of seed sources acquired or collected from the same environment as the areas to be restored (Savanna or Atlantic Forest).</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"978e4c73cc44984c645e3dc6a4ee7f54b0180199763b4b29fcaa6cc2af956e99","category":"Environment"}