{"title":"Apple Plans to Reduce iPad Bezel Sizes, Just Like on iPhone 15 Pro Models","link":"https://www.macrumors.com/2023/07/31/apple-reduce-ipad-bezel-sizes-like-iphone-15-pro/","date":1690797459000,"content":"Apple is <a href=\"https://www.macrumors.com/2023/03/05/iphone-15-pro-front-glass-leak/\">shrinking the bezels</a> on its upcoming iPhone 15 Pro models using a special manufacturing process, and the company also plans to use the same technology to reduce screen borders on future iPads, according to <em>Bloomberg</em> reporter Mark Gurman.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2013/09/10th-generation-ipad-camera.jpg\" alt width=\"1474\" height=\"829\" />\r<br />\nWriting in his latest <a href=\"https://www.bloomberg.com/news/newsletters/2023-07-30/apple-iphone-15-pro-features-usb-c-port-new-design-thinner-bezels-lkpemg29\">Power On newsletter</a>, Gurman says Apple is using low-injection pressure over-molding, or LIPO, to shrink the display border size on the iPhone 15 Pro and iPhone 15 Pro Max to 1.5 millimeters (versus around 2.2 millimeters on current iPhones). \r<br />\n\r<br />\nProvided that Apple can avoid <a href=\"https://www.macrumors.com/2023/07/28/iphone-15-pros-thinner-bezels-issue/\">reported manufacturing issues</a>, this could mean the iPhone 15 Pro models will have the <a href=\"https://www.macrumors.com/2023/03/17/iphone-15-pro-max-thinnest-bezels-ever/\">thinnest bezels of any smartphone</a> currently on the market, and Apple is apparently keen to replicate an equivalent achievement with its iPads, too.\r<br />\n\r<br />\nAs noted by Gurman, Apple first used LIPO on the Apple Watch Series 7 to make the device's borders thinner and increase the size of the display. If Gurman's source is accurate, LIPO is set to follow the same product trajectory as OLED display technology, which went from Apple Watch to iPhone, with OLED iPads expected to launch <a href=\"https://www.macrumors.com/2022/06/16/oled-13-inch-macbook-rumor-ross-young/\">next year</a>. However, which iPad model will be first to benefit from the LIPO process, and when it will arrive, remains unclear.\r<br />\n\r<br />\nAccording to iPhone rumors, the bezels on all four iPhone 15 models are expected to be slightly curved around the edges, similar to the iPhone 11 series. Most rumors have claimed only the Pro models will have a bezel reduction this year, but a previously-accurate leaker has <a href=\"https://twitter.com/UniverseIce/status/1680196595231645697\">shared an image</a> showing that the iPhone 15 and iPhone 15 Plus might have slightly thinner bezels as well. \r<br />\n\r<br />\nApple is expected to announce its next iPhone lineup in September as usual. For all the latest rumors, be sure to read our dedicated <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a> and <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro roundups</a>.<div>Tag: <a href=\"https://www.macrumors.com/guide/mark-gurman/\">Mark Gurman</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/07/31/apple-reduce-ipad-bezel-sizes-like-iphone-15-pro/\">Apple Plans to Reduce iPad Bezel Sizes, Just Like on iPhone 15 Pro Models</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-plans-to-reduce-ipad-bezel-sizes-just-like-on-iphone-15-pro-models.2397342/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9793490b89a3d58a2f62acac60aada68f7e516b51e2bdbe19a5c57f526954f2d","category":"Apple"}