{"title":"GoodNotes 6 Brings AI-Powered Handwriting Spellcheck and Autocomplete Features","link":"https://www.macrumors.com/2023/08/09/goodnotes-6-ai-powered-handwriting-spellcheck/","date":1691579461000,"content":"Popular note-taking app and PDF editor <a href=\"https://www.goodnotes.com\">GoodNotes</a> has received its first major update in four years, introducing new AI-powered handwriting recognition features, a marketplace for digital stationery, new pen gestures, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/GoodNotes-6-feat.jpg\" alt width=\"990\" height=\"556\" />\r<br />\nThe sixth version builds on Goodnotes 5's <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> handwriting recognition by adding AI-powered Spellcheck, which draws heavily  on the neural engine in Apple silicon to recognize mistakes in writing and suggest a correction or rewrite the word in the user's handwriting style. \r<br />\n\r<br />\nCurrently, the spellcheck feature supports English, Spanish, German and Dutch. GoodNotes 6 also introduces an experimental word autocomplete feature for handwriting in English. \r<br />\n\r<br />\nElsewhere, GoodNotes 6 brings new pen gestures include Scribble to Erase and Circle to Lasso, while a new in-app marketplace allows users to download new templates, stickers, and digital stationery directly within the app.\r<br />\n\r<br />\nThere are additional options to customize folders and dynamic templates that allow users to customize the size and color of the digital paper in their notebooks. The app also introduces AI-driven writing features, enabling users to extend or condense text, modify its tone, or paraphrase content.\r<br />\n\r<br />\nLastly, this version includes interactive exam prep materials for SAT and other standardized tests, with built-in hints and AI Math Assistance to identify errors.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/goodnotes-6.jpg\" alt width=\"1650\" height=\"1024\" />\r<br />\nGoodnotes 6 is free to download on <a href=\"https://apps.apple.com/app/apple-store/id1444383602?platform=iphone\">iOS</a>, <a href=\"https://apps.apple.com/app/apple-store/id1444383602?platform=ipad\">iPadOS</a> and <a href=\"https://apps.apple.com/gb/app/goodnotes-6/id1444383602\">macOS</a>, and free to use for up to three notebooks. The full suite of features can be unlocked with unlimited notebooks for $9.99 per year or $29.99 as a one-time purchase.\r<br />\n\r<br />\nExisting paid GoodNotes 5 users can continue using GoodNotes 5, or upgrade to Goodnotes 6 at a discount. Goodnotes 6 will continue to be free for educational institutions through Apple School Manager.<div>Tag: <a href=\"https://www.macrumors.com/guide/goodnotes/\">GoodNotes</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/09/goodnotes-6-ai-powered-handwriting-spellcheck/\">GoodNotes 6 Brings AI-Powered Handwriting Spellcheck and Autocomplete Features</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/goodnotes-6-brings-ai-powered-handwriting-spellcheck-and-autocomplete-features.2398166/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"97963dced58b2f5467270f39f64a58f750923712413ab695083d74b8407ae416","category":"Apple"}