{"title":"Analysis of animal-to-human translation shows that only 5% of animal-tested therapeutic interventions obtain regulatory approval for human applications","link":"https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.3002667","date":1718287200000,"content":"<p>by Benjamin V. Ineichen, Eva Furrer, Servan L. Grüninger, Wolfgang E. Zürrer, Malcolm R. Macleod</p>\r\n\r\nThere is an ongoing debate about the value of animal experiments to inform medical practice, yet there are limited data on how well therapies developed in animal studies translate to humans. We aimed to assess 2 measures of translation across various biomedical fields: (1) The proportion of therapies which transition from animal studies to human application, including involved timeframes; and (2) the consistency between animal and human study results. Thus, we conducted an umbrella review, including English systematic reviews that evaluated the translation of therapies from animals to humans. Medline, Embase, and Web of Science Core Collection were searched from inception until August 1, 2023. We assessed the proportion of therapeutic interventions advancing to any human study, a randomized controlled trial (RCT), and regulatory approval. We meta-analyzed the concordance between animal and human studies. The risk of bias was probed using a 10-item checklist for systematic reviews. We included 122 articles, describing 54 distinct human diseases and 367 therapeutic interventions. Neurological diseases were the focus of 32% of reviews. The overall proportion of therapies progressing from animal studies was 50% to human studies, 40% to RCTs, and 5% to regulatory approval. Notably, our meta-analysis showed an 86% concordance between positive results in animal and clinical studies. The median transition times from animal studies were 5, 7, and 10 years to reach any human study, an RCT, and regulatory approval, respectively. We conclude that, contrary to widespread assertions, the rate of successful animal-to-human translation may be higher than previously reported. Nonetheless, the low rate of final approval indicates potential deficiencies in the design of both animal studies and early clinical trials. To ameliorate the efficacy of translating therapies from bench to bedside, we advocate for enhanced study design robustness and the reinforcement of generalizability.","author":"Benjamin V. Ineichen","siteTitle":"PLOS Biology","siteHash":"63268de9c1fab91327fb48afeeb83afb4047c365a2f6807080f2b99ab35eb8c8","entryHash":"979760b3bbcfa33be5b46f3ab080f431eb9d3889d25eb2bf2ce54ffd581ebf11","category":"Environment"}