{"title":"Guiding Lights: The Cyclists' Alliance Mentor Programme","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/guiding-lights","date":1635163103000,"content":"\n      <p><span>There is an alternative life thread in which </span><span>Kerry Jonker’s eyes lock</span><span> with yours from the cover of a business magazine. Perhaps you’re sitting in a dentist’s waiting room or idly passing time at the hairdresser’s. There might be something about her look or stance that makes her stand out among the </span><span>other assured</span><span> cover stars of that particular issue. Or, it could be that she blends </span><span>in</span><span> with the rest, and you barely notice her among the other headshots. Either way, her presence in the choreographed seriousness of </span><span>these</span><span> 30 CEOs under 30 is testament to her intellectual and business nous. Whether you see her individually, or not, she’s made it.</span></p>\n<div></div>\n\n<p><span>In reality, Kerry is in the apartment she rents with her boyfriend in Girona, talking to me on the phone ahead of a<span> </span>12-hour travel day to Prague. For the next six nights, she<span> </span>will<span> </span>share a single dorm room with four other team-mates, before flying to Belgium to couch-surf and cram in some Flandrian racing. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro-Womens-8th-July-58-_1_1024x1024.jpg?v=1635161499\" /></span></p>\n<p><span>A South-African born, Australian-educated electrical engineer with long-held business ambitions, Kerry has not only had to put her corporate dream to one side to try to make it to the Women’s WorldTour, but her parents’ misgivings, too.</span></p>\n<p><span>“My mum and dad couldn’t afford chicken for lunch when they were kids, and they’ve both got their own very successful companies now. So, when I told them I was going to go do some racing in Belgium, they were kind of like, ‘what are you doing?’ My family are so close and they’re really supportive, but my </span><span>m</span><span>um still tells her friends I’m on a gap year.”</span></p>\n<p><span>In fact, the </span><span>25-year-old</span><span> has been working her way through </span><span>cycling’s</span><span> Continental ranks, building switchboards for corporate clients when funds have been short. She says having examples to follow in the professional peloton has been crucial to her pursuing a career in cycling.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro-Womens-3rd-July-38_1024x1024.jpg?v=1635161557\" /></span></p>\n<p><span>“I look at girls like Ashleigh Moolman Pasio and Rachel Neylan. They’ve both come into the sport at a later age, both of them had their degrees, and if it wasn’t for people like that, there’s no way I would be here. One hundred per cent, that was the reason I came back to Belgium for a second year. The fact there are other smart, bright engineers and people who’ve also chosen to go for a cycling career over their professional </span><span>one</span><span> makes me think that maybe it’s not actually a bad decision, or such a risk to take.”</span></p>\n<p><span>Attracting Jonker’s brand of intellect and life skills to women’s cycling is not unusual. As well as chemical engineer Moolman Pasio and professional physio Neylan, there’s qualified doctor Elise Chabbey and venture capitalist Kristen Faulkner in the bunch, to name but a few. </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/kristen-faulkner-theres-so-many-business-models-that-cycling-can-adopt\">Related: Kristen Faulkner – \"There are so many business models that cycling can adopt\"</a></em></strong></p>\n<p><span>Retaining that talent and helping change the face and brains of the sport for the future, is a much bigger challenge. Which is, partly at least, where The Cyclists’ Alliance</span><span>’s (TCA)</span><span> new mentor scheme comes in.</span></p>\n<p><span>A three-tiered programme, the mentorship pairs up junior riders with more experienced peers, developing riders with those in the latter stages of their careers, and racers approaching retirement with some of the most advanced businesses in the sport. On a practical level, it means that someone like Kerry can be mentored from within the sport as she develops her racing career, and can also apply for an internship when she retires with one of the five current Podium Partners, or sponsors</span><span>:</span><span> Cannondale, Liv Cycling, Specialized, Sram and Trek.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Giro-Women-4th-July_-37_1024x1024.jpg?v=1635161607\" /></span></p>\n<p><span>As founding member Gracie Elvin, who runs the programme along with TCA treasurer Roos Hoogeboom, explains: “Our number one priority is wanting to provide riders with support within their cycling careers. The second part, though, is keeping more women involved in cycling and getting them some mentored opportunities within the brands, so they can stay in cycling and increase diversity in leadership.”</span></p>\n<p><span>While informal mentor relationships naturally develop within teams, the structured nature of the programme, as well as the internships and in-house experience on offer with the programme sponsors, </span><span>is</span><span> entirely new.</span></p>\n<p><span>“We have all these amazing women with incredible experience in the sport, all very smart in their own way, and we never hear from them again,” says Elvin. “That’s sad. We want to make it obvious that there are opportunities. We want people to see racing as a career and know that there are careers after that as well.”</span></p>\n<p><span>In order to pair riders, Elvin considered more than simply the riders’ racing ambitions and skills, </span><span>but also</span><span> their interests, hobbies and life experience. If it sounds more like the matching involved in a dating website, it’s because the individuals have to click for the programme to work.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-growth-of-womens-worldteams-a-delicate-balance\">Related: Women's WorldTeam Salaries, a delicate balance</a></em></strong></p>\n<p><span>As fate, or detailed questionnaires, would have it, Jonker found herself paired with one of the riders she most looks up to, the 12-year professional and </span><span>Worlds road race runner-up</span><span>, Neylan. </span><span> </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GiroWomens10th-July-49_1024x1024.jpg?v=1635161636\" />“I think learning is the greatest thing in life,” Neylan tells me, “so a structured programme within the sport is a golden opportunity to give back, to share experiences and also for the younger ones to learn and grow.” The Australian Olympian had to learn quickly herself, having come to cycling late after a career as a physio for the Australian rowing team.</span></p>\n<p><span>“My career has never been easy, nothing has been served on a platter. There’s been no federation gravy train. It worked but it has certainly not been pretty at times.\"</span><b> </b></p>\n<p><span>Neylan’s passion for sharing a career’s worth of knowledge and experience fizzes across the phone line. We spend 40 minutes talking on the subject, </span><span>well over double our scheduled time</span><span>. As with most systems, success is dependent upon the people. “A lot of athletes finish up their career and they feel washed up,” she says. “They feel they have to move onto a whole other life. I disagree. A life as a professional athlete, whether it’s five, ten or 15 years, is like a PhD, you could write a thesis on what you learn. </span><span> </span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related: \"We can change the culture of the sport\" – Iris Slappendel Interview</a></em></strong></p>\n<p><span>“Work ethic and resilience are the two biggest things for me. But there are other practical things in terms of sacrifice, focus, knowing when you have to really double down, the work to rest ratio, goal orientation and knowing what it takes to deliver a project or to nail a goal, stripping it down to the process and being self-driven.</span></p>\n<p><span>“You have to know your value. That’s where the transition is missed, athletes don’t know how to package what they’ve learned.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Ceratizit-5th-July-14_1024x1024.jpg?v=1635161664\" /></span></p>\n<p><span>Listening to riders talk about the structure and resources available, it strikes me not only how heavily and how well the </span><span>Cyclists’ Alliance</span><span> scheme seems to borrow from the corporate world, but how many of us could benefit from a similar scheme in our own lives. Having never had the benefit of a mentor in my own career, I can see a multitude of ways in which the guidance, knowledge transfer and female-specific support would be invaluable. </span></p>\n<p><span>The corporate element appears to have been heavily influenced by Rhian Ravenscroft, vice-director of TCA, whose day job as Senior Legal Counsel at MarketAxess, a global trading platform, has seen her become the youngest person and only woman on the management board.</span></p>\n<p><span>“Rhian has been a big part of bringing corporate thinking into this,” says Elvin. “Some of these people, coming from the outside world, have been really helpful in terms of doing things differently.” In a sport usually so reliant on competence drawn from those </span><span>individuals</span><span> steeped in its traditions, there is a freshness and vigour to how </span><span>TCA</span><span> approach practical matters such as career support, that seems lacking on the men’s side of the sport. </span></p>\n\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/letters-from-tca-mentoring-programme?_kx=\">Related: Letters from the TCA Mentoring Programme</a></em></strong></p>\n<p><span>Doing things differently has meant not only sending out monthly emails with prompts for conversation starters between mentors and mentees, but bringing in professional coaching, which is more common in the world of business.</span></p>\n<p><span>“We’re providing extra support with guests who give webinars,” Elvin says. \"We’ve already had a great presentation from Cynthia Dassen, who runs her own business, Paratam. They do a colour test, which is a personality test, and is a really nice way for people to understand themselves as well as each other.</span></p>\n<p><span>“Last night we had a presentation from a long-term TCA supporter called the Mind Room, a psychology clinic, specialising in sports psychology. They ran a really </span><span>good</span><span> webinar on how to mentor, because we realise that we need to support the mentors as well. More often than not, this is their first time doing that particular role.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GiroWomens-11th-July-29_1024x1024.jpg?v=1635161728\" /></span></p>\n<p><span>Where The Cyclists’ Alliance scheme differs from most professional sport mentor programmes, is the </span><span>depth and breadth</span><span> of its reach, </span><span>extending</span><span> into the junior levels and with plans to expand into national level and club riders.</span></p>\n<p><span>Natasha Badertscher is a second-year junior and Canadian national champion on the track. She has recently moved to the Netherlands to study psychology at the University of Leiden and is hoping that becoming a mentee can help her adapt to a new, European way of life, as well as further her racing career.</span></p>\n<p><span>“I knew that coming over to the Netherlands and starting university was going to be a big change for me,” she says. I thought, I’ll give it a shot and apply for the mentor programme, because I was really just looking for someone I could connect with and who could give advice and guidance when I needed it.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/de/blogs/the-rouleur-journal/5-years-on-what-impact-has-the-introduction-of-the-women-s-world-tour-had\">Related: 5 years on – Is the women's WorldTour working?</a></em></strong></p>\n<p><span>Badertscher has been matched with experienced Italian racer Valentina Scandolara</span><b>. </b><span>“I think, especially with my mentor being someone from Europe, she’s Italian and she’s also gone through university, and that’s a big help,” says Badertscher. “I think one of the reasons they paired her with me is that she studied psychology. She’s also done the same as me, but the other way around, in that she went over to North America to do some races. She’s not Dutch, but she obviously knows the European lifestyle and has been through going from Europe to North America and back again. I’m looking forward to getting guidance for cycling, but also in terms of life changes.”</span></p>\n<p><span>While such advice, is a crucial aspect of the scheme, having spoken to half a dozen riders involved in the mentorship, there is one recurring theme that comes up time and again</span><span>:</span><span> empowerment.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mags-LOW-RES-38_1024x1024.jpg?v=1635161785\" /></span></p>\n<p><span>“I can tend to dip in confidence,” says 26-year-old American Heidi Franz, </span><span>currently</span><span> on her fourth season with the Rally Cycling team. “I’m an endurance athlete, but I’m not very good with my endurance in advocacy for my own future and career.” </span></p>\n<p><span>Franz has been paired with former racer and author, activist, and documentary maker Kathryn Bertine. “Kathryn has come from so many different areas and has had so many struggles,” Franz says. “She can understand, educate and motivate me to keep going when I feel really down about the future, and how long I think I can do this. Also, for someone to tell me that I’m not the only one who’s feeling like I’m having a really hard time, because it’s just a hard sport to be in – that is really useful.</span></p>\n<p><span>“It’s really empowering to have someone like that available, and to have an entire community – the TCA community – behind you and pushing women forward.”</span></p>\n<p><span>The strength and dedication of this community feels most apparent in the </span><span>opening phase</span><span> of this programme. In the days that followed my conversation with Rachel Neylan, we continued our discussion on WhatsApp, with the </span><span>Team Burgos Alimenta racer</span><span> keen to ensure I had an understanding of the philosophy behind her mentorship, as much as the practical detail. It was </span><span>her</span><span> who provided the opening quote of this article. “Mentorship is important,” Neylan says. “However, I realise it can be less about imposing knowledge and more about empowering and enabling people to ask themselves questions. It’s about moving towards self-reflection, getting to truly know oneself.” </span></p>\n<p><span>As a life ambition, it doesn’t get more fundamental. If The Cyclists’ Alliance mentor scheme can retain and build on even some of that compassion, wisdom and experience, the world of women’s cycling </span><span>will</span><span> be a better place for it.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9799fb6750c19aa29746f2a1b541216c838d1404de0987504c2fd56f16371a7f","category":"Cycling"}