{"title":"New effort IDs the genes that made the mammoth","link":"https://arstechnica.com/?p=1929988","date":1680889202000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/P12-DNAMammoth-image-Beth-Zaiken-800x450.jpg\" alt=\"Artist's view of a mammoth superimposed over DNA sequencing data.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/P12-DNAMammoth-image-Beth-Zaiken.jpg\">Enlarge</a> (credit: Beth Zaiken)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An international team of scientists has published the results of their research into 23 woolly mammoth genomes in <a href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(23)00404-9\">Current Biology</a>. As of today, we have even more tantalizing insights into their evolution, including indications that, while the woolly mammoth was already predisposed to life in a cold environment, it continued to make further adaptations throughout its existence.</p>\n<p>Years of research, as well as multiple woolly mammoth specimens, enabled the team to build a better picture of how this species adapted to the cold tundra it called home. Perhaps most significantly, they included a genome they had previously sequenced from a woolly mammoth that lived 700,000 years ago, around the time its species initially branched off from other types of mammoth. Ultimately, the team compared that to a remarkable 51 genomes—16 of which are new woolly mammoth genomes: the aforementioned genome from Chukochya, 22 woolly mammoth genomes from the Late Quaternary, one genome of an American mastodon (a relative of mammoths), and 28 genomes from extant Asian and African elephants.</p>\n<p>From that dataset, they were able to find more than 3,000 genes specific to the woolly mammoth. And from there, they focused on genes where all the woolly mammoths carried sequences that altered the protein compared to the version found in their relatives. In other words, genes where changes appear to have been naturally selected.</p></div><p><a href=\"https://arstechnica.com/?p=1929988#p3\">Read 21 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1929988&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"979ea7f4065a62d27804da4f137476784980d81a533adbc5a8fd62e62dc444e9","category":"Tech"}