{"title":"Land sparing outperforms land sharing for Amazonian bird communities regardless of surrounding landscape context","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14596?af=R","date":1715145339000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e6e33cdc-dc53-424c-b833-f0c543457bf1/jpe14596-toc-0001-m.png\" alt=\"Land sparing outperforms land sharing for Amazonian bird communities regardless of surrounding landscape context\" />\n<p>Landscape wildlife friendliness (WF) provided through land sharing is of limited benefit to many tropical forest-dependent species that are unable to move across or utilise pasture, even at high levels of farm and landscape WF. To ensure the persistence of these species, policymakers should urgently implement sustainable intensification mechanisms to increase farmland productivity while enabling the protection of large blocks of spared natural habitat.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nTwo strategies are central to the debate regarding agricultural development: one integrates farming and conservation (land sharing), and the other separates farming and conservation, intensifying production to allow the offset of natural habitat (land sparing). The role of wildlife-friendly habitat in the wider surrounding landscape (landscape wildlife friendliness (WF)) in promoting farmland diversity is potentially an unexplored benefit of land sharing.\n\nWe sampled birds across primary forests and cattle pastures in the western Amazon, where terrestrial biodiversity peaks. We tested the hypothesis that increased landscape WF will lead to increased species richness (SR) on farmland, even at low levels of ‘on-farm’ wildlife-friendly habitat (farm WF).\n\nWe show that while there is a minor increase in SR linked to increased levels of landscape WF, a large component of the avian community is functionally absent. Most forest-dependent species are missing from pasture, even at high levels of farm WF. For these species, the preservation of blocks of contiguous forest under land sparing is vastly superior.\n\nWe modelled both strategies under different levels of production. Land sparing always retained significantly higher SR than land sharing, regardless of the level of landscape WF.\n\n<i>Synthesis and applications</i>. Landscape wildlife friendliness (WF) provided through land sharing is of limited benefit to many tropical forest-dependent species that are unable to move across or utilise pasture, even at high levels of farm and landscape WF. To ensure the persistence of these species, policymakers should urgently implement sustainable intensification mechanisms to increase farmland productivity while enabling the protection of large blocks of spared natural habitat.\n</p>","author":"Benjamin D. J. Birch, \nSimon C. Mills, \nJacob B. Socolar, \nDiego E. Martínez‐Revelo, \nTorbjørn Haugaasen, \nDavid P. Edwards","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"97a61b8d85d096274db5b45c48c7664bd56f8be74c302ff49aac30c70e375e9f","category":"Environment"}