{"title":"To the Wire: the first women’s Tour de Suisse","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/to-the-wire-the-first-women-s-tour-de-suisse","date":1623256522000,"content":"\n      <p>A two-day 2.1 stage race with only four of the nine Women’s WorldTeams present might not be the most prestigious race on the calendar, but the women's Tour de Suisse brought a level of competition and excitement that transcended its stature. A feat which was, of course, down to the riders as much as the race organisers.</p>\n<p><span>The race almost didn’t happen. With just two months to go it was facing existential threat as the Swiss federation waited for the return of funds from the cancelled 2020 </span><span>Aigle-Martigny World Championships. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-donne-preview-a-new-leaf\">Related – Giro d'Italia Donne 2021 preview</a></strong></em></p>\n<p><span>Despite the uncertainty, what was technically the second edition of the women’s Tour de Suisse — a one-time five stage edition took place in 2001 — went ahead, and with live coverage to boot. Thanks to that coverage fans were able to witness the final few hours of racing as both stages unfolded, and they did not disappoint.  </span></p>\n<p><span>The riders were met with a lumpy 114km in the rain for the first stage, during which a break of five — containing no fewer than three Swiss riders alongside Lizzie Deignan and Mikayla Harvey — went clear. </span></p>\n<p><span>One of those Swiss riders was Elise Chabbey of Canyon//SRAM who has been amongst the most aggressive (and impressive) riders of the early season — working tirelessly for her team throughout the classics and briefly taking the leader’s jersey at the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/vuelta-a-burgos-feminas-debrief-clash-of-the-titans\">Vuelta a Burgos Feminas</a> last month. Chabbey also happens to be the Swiss national champion and, in a home race, was finally given the chance to lead. </span></p>\n<h4><span>Deignan in doubt</span></h4>\n<p><span>The 28-year-old qualified doctor attacked with 15km to go, taking Deignan with her. The two riders worked together to get a gap on their breakaway companions which took them to the finish. On paper the final was Deignan’s to lose — and she did. By her own admission, she made a mistake which allowed Chabbey to come around her on the line and take the win. That Chabbey won because Deignan fluffed the sprint takes nothing away from the Swiss rider, her tactics were impeccable as she forced her rival to go early. The gap between the two riders at the end of the day was a mere four seconds. </span></p>\n<p><span>Thanks to Chabbey’s tight margin over Deignan, the second and final stage — a 98km flat circuit race with bonus seconds on offer at three intermediate sprints — became a nail biting tactical masterclass. There is a tendency to view flat races as boring or formulaic but with Canyon//SRAM on the defence for Chabbey and Trek-Segafredo initiating full lead-outs for Deignan to take seconds it was anything but. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1321920616_1024x1024.jpg?v=1623255890\" /></span></p>\n<p><span>With 50km to go Deignan had won the first intermediate sprint and recovered three seconds on Chabbey who had suffered a small crash earlier on in the race. With just one second now separating the two riders it was incumbent on Canyon//SRAM to disrupt the bonus seconds and on Trek-Segafredo to position Deignan to pick up two more crucial seconds to become the virtual leader. Canyon/SRAM, alive to the threat, threw the kitchen sink at trying to establish a breakaway to neutralise the bonus seconds but Trek were having none of it. </span></p>\n<p><span>Deignan’s team did everything in their considerable power to keep the peloton together for the second intermediate sprint. Their efforts culminated with Audrey Cordon Ragot, Trixi Worrack, and Lucinda Brand executing a textbook leadout for Deignan who took second and the bonus seconds to give her a one second lead over Chabbey. </span></p>\n<p><span>For their part, Canyon//SRAM pulled off their tactics perfectly, putting sprinter Alexis Ryan up against Deignan and her teammates to win the intermediate and mitigate the margin to just one second — but it wasn’t enough.</span></p>\n<div></div>\n<p><span>While Trek-Segafredo were then more than happy to let a break go up the road and mop up any additional seconds in the third and final sprint, Canyon//SRAM repeatedly tried to launch Chabbey, or one of their riders, into a move. Mikayla Harvey in the young rider’s jersey was most active, policing the front and instigating attacks, but Trek were never far behind. </span></p>\n<p><span>When Hannah Barnes eventually got into a break that approached the intermediate sprint with just a 10 second lead she tried to slow the pace to either allow Chabbey to bridge or contest for the final bonus seconds on offer. However it was too late, and the break took the seconds and with them Chabbey’s dwindling chance at defending the lead. </span></p>\n<h4><span>One-Second lead</span></h4>\n<p><span>Refusing to be defeated so easily, Chabbey went into her default racing style, attacking multiple times within the final 10km in an attempt to gap Deignan but Trek simply had too much clout and she was repeatedly thwarted. Marta Bastianelli eventually took the stage ahead of young Czech rider Tereza Neumanova — who pulled off an impressive sprint. — while Barnes took third on the stage. Deignan’s winning margin over Chabbey stayed at a slender one second.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1322089674_1024x1024.jpg?v=1623256141\" /></span></p>\n<p><span>After two days of thrilling racing everyone was left wishing there were more stages to come. Stage racing is still scant on the women’s calendar and both riders and fans are desperate for multi-day events. </span></p>\n<p><span>In her post-race interview Deignan, who is well and truly back after an early-season that was fraught with illness, said: </span><span>“Obviously we know about the men’s Tour de Suisse and how much of an iconic race it is and finally we have a women’s race so it’s pretty special to be the first winner of it.” When asked if she would come back next year she replied in the affirmative but said:  “I think they should make it a bit longer.” </span></p>\n<p><span>Let’s hope the organisers listen to Deignan’s suggestion, and that we don’t need to wait another 20 years for the next Tour de Suisse women. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"97b5d2738fd7364c0f0a2ec99b76790450e1a17b5d012a8ad807466a7581572f","category":"Cycling"}