{"title":"Seagate เปิดตัว Game Drive SSD สำหรับ PS5 แล้ว ราคาเริ่ม 99.99 ดอลลาร์ (ยังไม่ขายในไทย)","link":"https://www.blognone.com/node/136072","date":1696416219000,"content":"<div><div><div><p>ก่อนหน้านี้มีเพียง WD เจ้าเดียสที่วางขาย SSD สำหรับ PS5 ที่ได้รับการรับรองโดยตรงจาก PlayStation ในรุ่น WD Black SN850P วันนี้ Seagate ก็กระโดดเข้ามาร่วมวงเริ่มขาย SSD แบบ PCIe 4.0 NVMe สำหรับ PS5 ซึ่งได้การรับรองจาก PlayStation แล้วเช่นกัน</p>\n<p>Seagate Game Drive SSD มีขนาดเท่ากับ WD Black SN850P เป็น PCIe 4.0 ที่ใส่ได้กับ PS5 ใช้คอนโทรลเลอร์ PS5018-E18 PCIe 4.0 SSD ของ Phison ที่มีความเร็วเขียน และอ่านมากกว่า 7GB/s พร้อมเทคโนโลยีการผลิตชิปแบบ 12 nm จาก TSMC</p>\n<p>Seagate Game Drive SSD มีให้เลือกความจุ 3 แบบได้แก่ 1 TB, 2 TB และ 4 TB ให้ความเร็วในการอ่าน 7.3GB/s และการเขียน 6.9GB/s การทดสอบการอ่านเขียนแบบสุ่มทำได้ถึง 1 ล้าน IOPS แต่ตัวที่ทำได้มีเพียง 2 TB ส่วนความจุอื่นจะมีประสิทธิภาพแตกต่างกันไปตามความจุ</p>\n<p>ในด้านความทนใน 1 TB ได้ 1,275 TBW (Terabytes Written หรือ หน่วยปริมาณข้อมูลที่วัดได้) ในขณะที่ขนาด 2 TB และ 4 TB จะอยู่ที่ 2,550 TBW และ 5,100 TBW ตามลำดับ ซึ่งถือว่า Game Drive ทนกว่า WD Black SN850P ถึง 2 เท่า เนื่องจากระดับความทนทานของ WD_Black SN850P ขนาด 1 TB, 2 TB และ 4 TB คือ 600 TBW, 1,200 TBW และ 2,400 TBW ตามลำดับ</p>\n<p>Game Drive รุ่น 1 TB และ 2 TB วางจำหน่ายในราคา 99.99 ดอลลาร์ และ 159.99 ดอลลาร์ตามลำดับ ส่วน 4TB มีราคาอยู่ที่ 479.99 ดอลลาร์ ในภาพรวมมีราคาถูกกว่าของ WD สำหรับราคาไทยของ Seagate Game Drive SSD ยังไม่มีปรากฏแต่อย่างใด</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8af0f6501fd9015e5d621e20e5f3be28.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.anandtech.com/show/21082/seagate-releases-game-drive-pcie-4-0-ssds-for-playstation-5\">AnandTech</a> via <a href=\"https://www.seagate.com/news/news-archive/seagate-delivers-speed-and-performance-to-playstation-gamers-with-the-officially-licensed-seagate-game-drive-ps5-nvme-ssd-pr/\">Seagate</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/seagate\">Seagate</a></div><div><a href=\"/topics/ssd\">SSD</a></div><div><a href=\"/topics/ps5\">PS5</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"97b800b06ba767086bb18e53d0818e6749a15a2a0e5f0af84d191a29b3d42f1b","category":"Thai"}