{"title":"NBC demanded that YouTube TV bundle Peacock or lose access to NBC channels","link":"https://arstechnica.com/?p=1799084","date":1632854842000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/getty-peacock-nbc-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/getty-peacock-nbc.jpg\">Enlarge</a> <span>/</span> A giant peacock in front of 30 Rockefeller Plaza in New York City. (credit: Getty Images | NBC)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>NBCUniversal recently asked YouTube TV to bundle Peacock, the NBC streaming service that has apparently failed to get many paying subscribers. The Comcast-owned NBC wants the Google-owned YouTube TV to pay for Peacock as a condition of continuing to have access to NBC channels after the companies' current contract expires.</p>\n<p>Google objected to the demand, and NBC is apparently willing to drop it. But a dispute over how much Google must pay NBC is still pending, and both sides have warned that YouTube TV subscribers could lose access to NBC channels.</p>\n<p>NBC's Peacock demand came during an ongoing carriage dispute between NBC and YouTube TV, according to a <a href=\"https://lightshedtmt.com/2021/09/27/is-comcasts-nbcu-fighting-a-losing-battle-with-googles-youtube-tv-the-industrys-largest-vmpvd/\">blog post</a> yesterday by investor research firm LightShed Partners. The existing carriage contract between YouTube TV and NBC expires on Thursday, and about 15 NBCUniversal channels would be dropped from YouTube TV if the companies don't strike a new deal in time.</p></div><p><a href=\"https://arstechnica.com/?p=1799084#p3\">Read 20 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799084&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"97c0dc40b6484314fb2cd684cc6a584acae45a71a80944e233d613be41ef0860","category":"Tech"}