{"title":"Redescription of Cyprinion muscatense (Teleostei: Cyprinidae) with the first phylogenetic analysis of the genus","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15708?af=R","date":1719289824000,"content":"<h2>Abstract</h2>\n<p>Members of the genus <i>Cyprinion</i> (Cypriniformes: Cyprinidae) are found in the Indus River basin west to the Arabian Peninsula and the Tigris-Euphrates River drainages (Persian Gulf basin). The taxonomic status of <i>Cyprinion</i> including <i>Cyprinion muscatense</i> is poorly understood when compared to other cyprinid genera. <i>C. muscatense</i> has been considered as a member of the <i>Cyprinion watsoni-microphthalmum</i> group and a valid species endemic to the Arabian Peninsula. Here, we redescribe <i>C. muscatense</i> based on an integrative morphological and molecular approach and freshly sampled material from several localities in the Oman Mountains ecoregion. The results showed that <i>C. muscatense</i> is distinguished from the other <i>Cyprinion</i> species in the Arabian Peninsula by having a short, thin, and slightly serrated last unbranched dorsal fin ray; the lower number of circumpeduncular scales; lateral line scales; and also scales between the lateral line and the dorsal-fin origin. Subterminal mouth, presence of one pair of small barbels at the mouth corner, 3–4 unbranched and 9½–10½ dorsal-fin branched rays, 12–14 pectoral-fin rays, 7–8 pelvic-fin rays, 2–3 unbranched and 6½–7½ branched anal-fin rays, and 37–40 lateral line scales are other morphological characteristics of <i>C. muscatense</i>. <i>C. muscatense</i> is also well distinguished by molecular characters among its congeners. The first molecular phylogenetic analysis of the genus, covering all currently recognized <i>Cyprinion</i> species except for <i>C. watsoni</i>, is also presented. <i>C. muscatense</i> is resolved as the sister species to another endemic fish of the Arabian Peninsula <i>Cyprinion mhalense</i>, with a Kimura-2-Parameter model distance of 5.3%.</p>","author":"Hamid Reza Esmaeili, \nAmir Hassan Masoumi, \nGolnaz Sayyadzadeh, \nFatah Zarei, \nJames Maclaine","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"97c25d4da0a0c1a9d4a0bf43ceb1c1c6b29983f505bbf91fc2f7bd30879a6197","category":"Environment"}