{"title":"The geographical distribution of scorpions, implication of venom toxins, envenomation, and potential therapeutics in Southern and Northern Africa","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae118/7727208?rss=1","date":1722729600000,"content":"<span><div>Abstract</div>Scorpions are predatory arachnids whose venomous sting primarily affects people in tropical and subtropical regions. Most scorpion stings can only cause localized pain without severe envenomation. Less than one-third of the stings cause systemic envenoming and possibly lead to death. About 350,000 scorpion stings in Northern Africa are recorded yearly, resulting in about 810 deaths. In Eastern/Southern Africa, there are about 79,000 stings recorded yearly, resulting in 245 deaths. Farmers and those living in poverty-stricken areas are among the most vulnerable to getting stung by scorpions. However, compared to adults, children are at greater risk of severe envenomation. Scorpion venom is made up of complex mixtures dominated by peptides and proteins that confer its potency and toxicity. These venom toxins have intra- and interspecies variations associated with the scorpion’s habitat, sex, diet, and age. These variations alter the activity of antivenoms used to treat scorpion sting envenomation. Thus, the study of the proteome composition of medically important scorpion venoms needs to be scaled up along their geographical distribution and contributions to envenomation in Southern and Northern Africa. This will help the production of safer, more effective, and broad-spectrum antivenoms within these regions. Here, we review the clinical implications of scorpion sting envenomation in Southern and Northern Africa. We further highlight the compositions of scorpion venoms and tools used in scorpion venomics. We discuss current antivenoms used against scorpion sting envenomation and suggestions for future production of better antivenoms or alternatives. Finally, we discuss the therapeutic properties of scorpion venom.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"97c3d8a18e9fad6a27f1cf186f4bebd37e46455409d343e690f91e89954e6512","category":"Environment"}