{"title":"Robust hydraulic traits correlation in woody species despite large trait variation along natural and experimental environmental gradients","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14591?af=R","date":1716188392000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/ed5cba79-cee4-40ba-8fb0-a7c533d261a4/fec14591-toc-0001-m.png\" alt=\"Robust hydraulic traits correlation in woody species despite large trait variation along natural and experimental environmental gradients\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/08/phenotypic-variation-of-plant-hydraulics/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nHydraulic traits are major determinants of plant fitness, thus exerting control over vegetation structure, function and distribution. Yet it remains unclear whether and how hydraulic traits respond to environmental stimuli (i.e. phenotypic variation of hydraulic traits; PVHT) and if the coordination between different hydraulic traits and the trait–climate relationship are affected by PVHT.\n\nHere, we synthesized data of PVHT (maximum hydraulic conductivity and water potential inducing 50% loss of hydraulic conductivity) and potentially related morphological and anatomical traits (e.g. sapwood density, branch Huber value, mean and hydraulic weighted conduit diameter). We analysed the magnitude, direction and source of variation of the plastic response, as well as the influence of environmental factors on trait coordination. Additionally, we compared the intra- and inter-specific variation between key hydraulic traits and climate metrics (mean annual precipitation and mean annual temperature) at the site of growth, as well as across the population range.\n\nPVHT was highly variable in both magnitude and direction, which was contingent on the environmental factor. The variation in PVHT mainly occurred at high taxonomic levels (i.e. family and genus), whereas phenology explained little variation for PVHT. Despite the high variability, trait correlation remained robust in the presence of environmental stimuli. Moreover, trait–climate relationships differed at inter-specific and intra-specific levels. The intra-specific variation of hydraulic traits in most species showed no correlation with climate metrics compared with the high correlation of hydraulic traits with climate metrics across species.\n\nOur findings suggest that the high variability of PVHT does not affect the trait correlation which may be valuable in predicting vegetation dynamics under varying environments. The distinct trait–climate relationships highlight the need to unravel the driving force of PVHT, as well as the adaptive strategy across populations.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/05/08/phenotypic-variation-of-plant-hydraulics/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>摘要</h2>\n<p>\n\n水力学结构性状同植物的适宜度密切相关，因此是调控植被结构、功能和分布的重要因素。然而目前仍不清楚植物水力学性状是否及如何响应环境因子(既可塑性变化)。同时，对于水力学性状之间的协调关系以及性状-气候之间的关联是否会受可塑性变化影响这一问题尚缺乏足够了解。\n\n本研究通过汇总已发表数据构建了木本植物水力学性状环境响应数据集。数据集中性状包括枝条最大导水率(<i>K</i>)、枝条导水率损失50%时的水势(<i>P</i>\n<sub>50</sub>)以及相关形态学和解剖学性状(如边材密度、枝条胡伯尔值、平均导管直径和水力加权导管直径)。基于该数据集分析了关键水力学结构性状(<i>K</i>和<i>P</i>\n<sub>50</sub>)可塑性变化的程度、方向及变异来源及性状间相关性对环境因子的响应。此外，分析了关键水力学结构性状同包括年平均降水和年平均温度在内的气候因子之间的关联，并比较了性状-气候关联在种内和种间尺度的差异。\n\n关键水力学结构性状可塑性变化的程度和方向同环境因子类型相关，并在物种间表现出极大变异性。在种间水平，水力学结构性状可塑性变化程度的差异同物种的生物学分类有关，并主要发生在科和属一级层次，而物种的物候学特征则不能很好的解释该差异。尽管如此，物种间性状的协调关系并未受到可塑性变化的影响。此外，性状-气候关系在种内和种间尺度存在差异。与物种间性状-气候的显著相关性不同，对于大部分物种，水力学结构性状在不同种群间的变化规律同气候因子无关。\n\n研究结果证明，物种间水力学结构性状之间的相关性不受性状可塑性变化的影响，因此对预测多变环境条件下植被的动态具有重要价值。性状-气候关联在种内和种间水平的分异反映出种内对水分环境不同的适应性对策，并同时强调了解析水力学结构性状可塑性变化驱动力的重要性。\n</p>","author":"Ruike Huang, \nYe Wang, \nJie Duan, \nBenye Xi, \nJinyan Yang, \nXimeng Li, \nJinchao Feng, \nBrendan Choat, \nDavid T. Tissue","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"97d7af0706b3e6ba6171067513b2a49202cfb06b16e399abbc72c09ce23b3f82","category":"Environment"}