{"title":"What's Still Coming in 2021 at Apple's Second Fall Event","link":"https://www.macrumors.com/2021/09/15/apple-second-fall-event-possibilities/","date":1631741546000,"content":"Apple held its \"California Streaming\" event yesterday to unveil new iPads, the <a href=\"https://www.macrumors.com/roundup/iphone-13/\">iPhone 13</a> lineup, and the <a href=\"https://www.macrumors.com/roundup/apple-watch/\">Apple Watch Series 7</a>, but we're not yet done with new products for the year.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/06/16-inch-macbook-pro-m2-render.jpg\" />\r\n<br />\r\nWe're expecting a second fall event to be held in either October or November, and this event will likely focus on Macs. Below, we've highlighted the products that are still rumored to be launching before the end of 2021.\r\n<br />\r\n\r\n<br />\r\n<h2>14 and 16-inch MacBook Pro Models</h2>\r\n<br />\r\nWe're overdue for a 16-inch MacBook Pro refresh, and rumors suggest that it's coming soon. Multiple rumors have pointed towards <a href=\"https://www.macrumors.com/guide/14-inch-macbook-pro/\">14 and 16-inch MacBook Pro models</a> with slimmer bezels and a flat-edged design that's not too much of a departure from the current design.\r\n<br />\r\n\r\n<br />\r\nThe new MacBook Pro models will regain ports that have been missing since 2016, including an SD card slot and an HDMI port, which will join the headphone jack and USB-C ports.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/Ports-2021-MacBook-Pro-Mockup-Feature-1-copy.jpg\" />\r\n<br />\r\nApple is making a return to <a href=\"https://www.macrumors.com/guide/magsafe-battery-pack/\">MagSafe</a>, and the new MacBook Pro models will use ‌MagSafe‌ ports for charging rather than a USB-C cable. Prior to 2016, MacBook Pro models used a quick-release ‌MagSafe‌ cable that prevented damage to the computer when the cord was yanked. ‌MagSafe‌ technology could bring faster charging speeds than are available with USB-C, but specific details aren't known yet.\r\n<br />\r\n\r\n<br />\r\nIn addition to reintroducing ports, the MacBook Pro models are expected to do away with the Touch Bar that's been used since 2016. Instead, Apple plans to replace the Touch Bar with a standard row of function keys.\r\n<br />\r\n\r\n<br />\r\n<a href=\"https://www.macrumors.com/guide/mini-led/\">Mini-LED</a> display technology is a possibility, and the new MacBook Pro models may be the first Macs to gain mini-LED, which was introduced in the 2021 <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models. ‌Mini-LED‌ technology will allow for a thinner and lighter design, while offering many OLED-like benefits such as improved wide color gamut, high contrast and dynamic range, and truer blacks.\r\n<br />\r\n\r\n<br />\r\nRumors suggest the MacBook Pro models will be equipped with a faster and more powerful \"M1X\" chip that builds on the technology introduced with the <a href=\"https://www.macrumors.com/guide/m1/\">M1</a>. The M1X could feature a 10-core CPU with eight high-performance cores and two energy-efficient cores, along with 16-core or 32-core GPU options.\r\n<br />\r\n\r\n<br />\r\nThe new MacBook Pro models are expected to support up to 64GB RAM, and both may have feature parity due to Apple's plans to use the same M1X chip for the 14 and 16-inch sizes.\r\n<br />\r\n\r\n<br />\r\n<h2>M1X Mac Mini</h2>\r\n<br />\r\nApple is working on a <a href=\"https://www.macrumors.com/roundup/mac-mini/\">high-end version of the Mac mini</a> that features a revamped design, and <em>Bloomberg</em>'s Mark Gurman said in August that a new mini would come in the \"next several months.\"\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/08/m1x-mac-mini-screen-feature.jpg\" />\r\n<br />\r\nBecause the machine is expected to use the same M1X chip that's being introduced in the MacBook Pro models, we may see it before the end of the year.\r\n<br />\r\n\r\n<br />\r\nThe high-end <a href=\"https://www.macrumors.com/roundup/mac-mini/\">Mac mini</a> is expected to replace the Intel ‌Mac mini‌ that Apple is still selling, and it will likely be offered alongside the ‌M1‌ ‌Mac mini‌ introduced last year.\r\n<br />\r\n\r\n<br />\r\n<h2>AirPods 3</h2>\r\n<br />\r\nRumors have suggested that <a href=\"https://www.macrumors.com/guide/airpods-3/\">AirPods 3</a> are ready to launch, and we were expecting to see them at Apple's September event given their link to iPhones and the Apple Watch.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/01/AirPods-Gen-3-Feature.jpg\" />\r\n<br />\r\nThat didn't happen, so if <a href=\"https://www.macrumors.com/guide/airpods/\">AirPods</a> are still coming before the end of 2021, we could see them introduced at Apple's second fall event.\r\n<br />\r\n\r\n<br />\r\nThe ‌AirPods‌ 3 are expected to feature a more ‌AirPods‌ Pro-like design with shorter stems and a redesigned charging case, but they'll continue to be available at a more affordable price point and won't have high-end features like Active Noise Cancellation.\r\n<br />\r\n\r\n<br />\r\n<h2>Mixed Reality Headset Reveal?</h2>\r\n<br />\r\nBack in March, <em>Bloomberg</em>'s Mark Gurman said that Apple would announce a mixed-reality headset at an event \"in the next several months.\" Gurman said that Apple did not want to announce a new product like the headset at an online event and would aim for an in-person event, but that's not going to happen in 2021.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/apple-mixed-reality-headset-mockup-feature-orange.jpg\" />\r\n<br />\r\nWe haven't heard anything else about a mixed-reality headset being debuted this year, so it's possible that Apple has decided to hold off on unveiling the product until it can indeed do so in person.\r\n<br />\r\n\r\n<br />\r\nThere have been endless rumors about the AR/VR headset that's in the works, which is distinct from the <a href=\"https://www.macrumors.com/roundup/apple-glasses/\">Apple Glasses</a> that are also in development. The latest rumors indicate that it will look similar to an Oculus Quest VR headset, but with a sleeker, more lightweight design. It will feature two high-resolution displays along with several cameras for tracking hand, head, and eye movement.\r\n<br />\r\n\r\n<br />\r\nThe headset will focus more on virtual reality than augmented reality, and it will not work on its own - it will need to tether to an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> for processing power.\r\n<br />\r\n\r\n<br />\r\nApple analyst <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a> and sites like <em>The Information</em> have indicated that Apple is aiming for a 2022 launch date, so we may not see an unveiling this year since Apple can't hold an in-person event.\r\n<br />\r\n\r\n<br />\r\n<h2>In the Works But Not Coming Yet</h2>\r\n<br />\r\nThere are also several other devices that are in development, but for the most part, launches are rumored for 2022 rather than 2021. The products below are coming, but we're not expecting them this year.\r\n<br />\r\n<ul>\r\n<br />\r\n \t<li><a href=\"https://www.macrumors.com/roundup/macbook-air/\"><strong>MacBook Air</strong></a> - Rumored to have a mini-LED display, a new Apple silicon chip, and multiple color options, the <a href=\"https://www.macrumors.com/roundup/macbook-air/\">MacBook Air</a> refresh is expected in 2022.</li>\r\n<br />\r\n \t<li><a href=\"https://www.macrumors.com/roundup/ipad-air/#whats_next_for_the_ipad_air\"><strong>iPad Air</strong></a> - The next-generation <a href=\"https://www.macrumors.com/roundup/ipad-air/\">iPad Air</a> may feature an OLED display and Pro-level features like 5G connectivity, LiDAR, and new cameras and speakers, but it's not rumored to be coming until 2022.</li>\r\n<br />\r\n \t<li><a href=\"https://www.macrumors.com/guide/upcoming-apple-products/\"><strong>AirPods Pro</strong></a> - Apple is working on a new version of the <a href=\"https://www.macrumors.com/roundup/airpods-pro/\">AirPods Pro</a> with a stemless design and a new wireless chip, and these could come in 2022.</li>\r\n<br />\r\n \t<li><strong><a href=\"https://www.macrumors.com/roundup/iphone-se/\">iPhone SE</a></strong> - There's a new version of the <a href=\"https://www.macrumors.com/roundup/iphone-se/\">iPhone SE</a> in development, and it's rumored for the first half of 2022. It's expected to feature the same general design, but with an updated chip and 5G connectivity.</li>\r\n<br />\r\n \t<li><strong><a href=\"https://www.macrumors.com/roundup/imac/\">Larger iMac</a></strong> - There's another <a href=\"https://www.macrumors.com/roundup/imac/\">iMac</a> in the works that has a larger display and a faster Apple silicon chip, but little is known about it and it's not expected in 2021.</li>\r\n<br />\r\n \t<li><strong><a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a></strong> - Apple is developing two versions of the <a href=\"https://www.macrumors.com/roundup/mac-pro/\">Mac Pro</a>, one of which will feature a redesigned chassis that's smaller in size. The new ‌Mac Pro‌ models will feature high-end Apple silicon chip options with 20 or 40 computing cores, made up of 6 high-performance or 32 high-performance cores and four or eight high-efficiency cores. We don't yet know when the new ‌Mac Pro‌ models are coming.</li>\r\n<br />\r\n</ul>\r\n<br />\r\n<h2>Event Date Speculation</h2>\r\n<br />\r\nApple last year held three events, one in September, one in October, and one in November. The split last year was largely due to ‌iPhone‌ delays, which didn't happen this year, so there may only be two fall events rather than three.\r\n<br />\r\n\r\n<br />\r\nIf there's a second event, it could happen in October or November, but October is perhaps the more likely target to allow Apple to prepare for holiday sales. The last three October events that have happened have been held on the following dates: Thursday, October 27, 2016; Tuesday, October 30, 2018; and Tuesday, October 13, 2020.\r\n<br />\r\n\r\n<br />\r\nThe 2020 event date may have been an outlier due to Apple's three event plan, so based on the two prior events, we could see a late October event, perhaps right around the 26th. If Apple wants to line up with the 2020 event, though, October 12 is <a href=\"https://www.macrumors.com/2021/09/13/when-is-apples-october-event/\">a strong possibility</a>, and we can't rule out October 19th or even dates in November.\r\n<br />\r\n\r\n<br />\r\nThis is all just speculation, and we have no solid details yet on when the second event might happen, but there definitely appears to be one in the works. We should be hearing more in the coming weeks, allowing us to narrow down a possible event date and get more concrete information on the products that we'll see.<div>Tag: <a href=\"https://www.macrumors.com/guide/september-2021-event/\">September 2021 Apple Event</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/09/15/apple-second-fall-event-possibilities/\">What's Still Coming in 2021 at Apple's Second Fall Event</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/whats-still-coming-in-2021-at-apples-second-fall-event.2311141/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=SGOhBH81zo4:8FHjdQtYh5k:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=SGOhBH81zo4:8FHjdQtYh5k:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/SGOhBH81zo4\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"97dd81eebd0bb99b1b1b3cf5ca37d7abe87b7464f8f70135ef7a4396f3745889","category":"Apple"}