{"title":"FoodStory ผู้ทำ POS ร้านอาหารรับเงินลงทุน Series B จาก Beacon VC และ JWD บริษัทโลจิสติกส์","link":"https://www.blognone.com/node/122877","date":1622093914000,"content":"<div><div><div><p>FoodStoryสตาร์ทอัพผู้นำด้านการพัฒนาระบบPOSสำหรับร้านอาหาร ประกาศรับเงินลงทุนในรอบ Series B จาก Beacon VC บริษัทเงินร่วมลงทุนของธนาคารกสิกรไทย ร่วมกับบริษัท เจดับเบิ้ลยูดี อินโฟโลจิสติกส์ จำกัด (มหาชน) โดยไม่เปิดเผยมูลค่าการลงทุน ตั้งเป้ายกระดับ Restaurant Ecosystemให้มีความครอบคลุม เปลี่ยน Data เป็น Insight เพื่อให้เจ้าของธุรกิจร้านอาหารและผู้ใช้งานมีความเข้าใจการดำเนินงานของธุรกิจทั้งในเรื่องการจัดการภายในและการขาย</p>\n<p>นายธนพงษ์ ณ ระนอง กรรมการผู้จัดการ Beacon VC เผยว่าทางบริษัทได้เข้าลงทุนใน FoodStoryโดยมุ่งหวังเพื่อสนับสนุนผู้ประกอบการธุรกิจร้านอาหารรายย่อยในการให้เข้าถึงการบริการทางด้านการเงิน และใช้ประโยชน์จากข้อมูลเพื่อสนับสนุนผู้ประกอบการร้านอาหารให้เข้าถึงแหล่งเงินทุนในการดำเนินธุรกิจได้ดีขึ้น</p>\n<p>ด้านนายธเนศ พิริย์โยธินกุล ประธานเจ้าหน้าที่บริหารฝ่ายการค้าพัฒนาธุรกิจและการลงทุน บริษัท JWD กล่าวว่า JWD Group เล็งเห็นความสำคัญของธุรกิจอาหาร และเชื่อว่าจะยังเติบโตอย่างต่อเนื่องในอนาคต โดยเฉพาะการเติบโตผ่าน e-Commerce channel ซึ่งเป็นช่องทางที่มีศักยภาพในการเติบโตที่สูง</p>\n<p>นายฐากูร ชาติสุทธิผล ผู้ก่อตั้งและประธานเจ้าหน้าที่บริหาร บริษัท ลีฟวิ่ง โมบาย จำกัด เผยการมี Restaurant Ecosystem ที่สมบูรณ์แบบเพื่อเชื่อมต่อตั้งแต่ Farm to Folk นั้นต้องการพาร์ทเนอร์ที่แข็งแกร่งทางด้านการเงินจาก KBank และระบบขนส่งรถเย็น (Cold Chain Logistics) จาก JWD ที่สามารถเติมเต็มในส่วนที่เราขาดเพื่อการพัฒนาต่อยอดธุรกิจ Supply Chain รูปแบบใหม่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/414db47c4bed9e1cb51facc0cece6b20.png\" /></p>\n<p>ที่มา - ข่าวประชาสัมพันธ์</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/beacon-venture-capital\">Beacon Venture Capital</a></div><div><a href=\"/topics/kasikorn-bank\">Kasikorn Bank</a></div><div><a href=\"/topics/investment\">Investment</a></div><div><a href=\"/topics/food\">Food</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"97e3abb520f4a8d9a9ddac4beeb33fbc6c0dd0739e0f14cd1dcc902cdc9c1e48","category":"Thai"}