{"title":"Everesting in cars is a thing now. What other cycling niches would be better on four wheels?","link":"https://www.bikeradar.com/features/opinion/jaguar-ipace-everesting/","date":1622739634000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/Jag_I-PACE_22MY_EVeresting_01_Elinor_Barker_020621_6043-4359c40.jpg?quality=45&amp;resize=620,413\" />                                            <p>We get <em>a lot</em> of press releases sent to us at BikeRadar and, if we’re being charitable, some of them are more interesting than others.</p>\n<p>Here’s a story that ticks the boxes however: the <a href=\"https://newspressuk.com/publicReleaseView/97995/54238/bmV3c0BiaWtlcmFkYXIuY29tRW1haWxIYXNo?token=nQa1FVDg8KRHfu69LOlv\" target=\"_blank\">news</a> that Jaguar’s I-PACE electric car has completed an Everesting challenge on a single charge, with Olympic champion Elinor Barker at the wheel.</p>\n<p>In case you’ve been living under a rock – or simply don’t find somebody repeatedly riding up and down the same hill all that interesting – Everesting is doing 8,848m of climbing in a single ride, i.e. the equivalent of climbing that big ol’ mountain.</p>\n<p>This Jaguar story has it all:</p>\n<ul><li>Appropriation of a very specific niche of competitive cycling</li>\n<li>An elite cyclist (mostly not riding a bike)</li>\n<li>A futuristic electric car which is <a href=\"https://www.bikeradar.com/features/long-reads/cycling-environmental-impact/\">sort of green</a> I guess, like an <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">ebike</a>?</li>\n<li>A <a href=\"https://www.youtube.com/watch?v=YZoVEauHDt4\" target=\"_blank\">video</a> with some <em>very</em> natural dialogue</li>\n</ul><p>Lest you think I’m being a big meanie, I actually like cars and happen to believe the tech behind ones like the I-PACE is really cool – a claimed 292-mile range is not to be sniffed at and nothing about the performance is likely to leave you wanting. I also have nothing but respect for Elinor Barker’s achievements in cycling.</p>\n<p>According to Jaguar, the challenge required 16.2 repeats of Great Dun Fell in the Pennines, with the I-PACE covering 124 miles (199.6km) in total, including an 8-mile drive to the start, and finishing with 31 per cent battery remaining, partly thanks to its regenerative braking.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> This would be rubbish on a bike, right? No fun at all.</span></figcaption><span> <i>Jaguar</i></span></div>\n<p>Despite all this, Everesting in a car makes the cycling equivalent look absolutely riveting, and that’s saying something (although even I’ll admit that sometimes <a href=\"https://www.bikeradar.com/features/ronan-mclaughlin-everesting-bike/\">the bikes are seriously cool</a>).</p>\n<p>I’d like to propose some other cycling activities that could be undertaken in cars. Here are some ideas to kick off:</p>\n<ul><li><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\"><strong>Gravel riding</strong></a><strong>:</strong> Drive through the woods with big floppy bags tied to your car. Put it on Instagram.</li>\n<li><strong><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-enduro-bikes/\">Enduro</a>:</strong> Drive up the hill and then back down again, but wear pyjamas.</li>\n<li><strong>The weekly club 10-mile <a href=\"https://www.bikeradar.com/advice/fitness-and-training/10-steps-to-your-best-ever-time-trial/\" target=\"_blank\">time trial</a>:</strong> Drive your family car up and down the local dual-carriageway, write your time on a clipboard, eat a cake. Rear lights must be fitted, no drafting other cars, weird custom aero mods encouraged. Alienate family and friends via endless discussion of CdA, rolling resistance and watts.</li>\n<li><strong>Sportives:</strong> Drive round a signposted route, viciously overtake other drivers who are enjoying themselves. Tell your friends you were “racing” at the weekend.</li>\n<li><strong><a href=\"https://www.bikeradar.com/advice/skills/technique/5-reasons-you-need-a-fixie-in-your-life-its-not-the-ones-you-think/\">Fixed gear</a>:</strong> Remove your car’s brakes, drive everywhere in second gear, talk about the zen of driving, get a rear differential tattooed on your calf.</li>\n<li><a href=\"https://www.bikeradar.com/news/hill-climb-diaries-2020/\"><strong>Hill climbs</strong></a><strong>:</strong> Replace every single part of your car with one that’s anodised, 20 per cent lighter, and 250 per cent more expensive. Drive up hill thronged by a shouting crowd, vomit at the top.</li>\n<li><strong><a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">Indoor training</a>:</strong> Play Mario Kart.</li>\n</ul><p>Which cycling disciplines would you like to see borrowed for automotive marketing purposes? Answers in the comments, please.</p>","author":"Matthew Loveridge","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"97e8d7895d71211df7ce7d65fe37106564066a2249d0fa7a1dceea5c0370806d","category":"Cycling"}