{"title":"The response of marine fish population productivity to juvenile habitat modifications depends upon life histories","link":"https://onlinelibrary.wiley.com/doi/10.1111/faf.12821?af=R","date":1709742262000,"content":"<h2>Abstract</h2>\n<p>Coastal and estuarine habitats are essential for both growth and survival at juvenile stages for a large proportion of marine fish but are exposed to a variety of threats. However, the quantitative impacts of anthropic-mediated nursery degradation on exploited population dynamics and productivity are rarely addressed. We developed a comprehensive steepness-based parameterization of the stock–recruitment relationship that directly depends upon juvenile habitat quality and surface area and used a generic age- and stage-structured model to simulate exploited population dynamics under nursery degradation/restoration scenarios. Population responses to juvenile habitat modification were estimated for three species with contrasting life histories. Modifying the surface area of nursery habitat has a predictable direct scaling effect on population size and affects biomass and fishing yield, with identical responses observed for various life histories. Modification of habitat quality affects both the population size and the shape of the productivity curve, leading to more complex responses of biomass and fishing yields that depend upon combinations of life history traits. Populations with low steepness and hence lower resiliency to fishing are the most sensitive to the degradation of habitat quality. Our study emphasizes the critical impact of juvenile habitat modification on population dynamics and productivity and the need to integrate habitat consideration into the management of exploited marine species. Our modelling framework is generalizable and can be extended to handle many diverse life histories and case studies to quantify the consequences of coastal habitat degradation/restoration for the dynamics of exploited marine fish populations.</p>","author":"J. Champagnat, \nE. Rivot, \nO. Le Pape","siteTitle":"Wiley: Fish and Fisheries: Table of Contents","siteHash":"3de509ad0f312c77d6dd4d37070c89263edb7695bf1d0e15e1eb17cfd4455e34","entryHash":"980759b515ae04f1cca13533b3f58a75c82f0e9404939af8bed58ea7cc3a2f26","category":"Environment"}