{"title":"iPhone notes, rough planning, and riding in the dark: Ultra cyclist Cynthia Frazier shares her tips for going the distance","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/eat-sleep-and-practice-riding-in-the-dark-ultra-cyclist-cynthia-frazier-shares-her-tips-for-going-the-distance","date":1697268600000,"content":"\n      <p><span>Cynthia Frazier is no rookie when it comes to ultra cycling racing. She holds a number of records for some of the sport’s biggest races from across the world. Her biggest result was at Europe’s premier ultra gravel race, Badlands, where not only was she the first woman to cross the line after 780 kilometres of riding in one day, 21 hours, and 34 minutes, but she also beat the previous women’s time by 10 hours. On top of that, she placed eighth overall, the only woman to ever place inside the top 10 in the race’s history. </span></p>\n<div></div>\n<div></div>\n<p><span>The month before, she took the women’s win at the Memory Bike Adventure, another 720km race. Then before that she raced Unbound XL, won the women’s title at Gran Guanche Gravel, and then raced the Transcordilleras in Colombia, where she not only took the women’s title but became the first woman to ever finish the race. Believe it or not, Frazier has only been riding on the rough stuff since 2021. However, in those two years, the Virginian-based endurance cyclist has achieved feats that many would only dare to dream about – especially when the thought of riding basically 24 hours a day can seem tricky to comprehend. </span></p>\n<p><span>With the rise of gravel continuing to boom, more and more people are popping up on social media announcing how they’ve just completed some of the most epic, and gruelling, ultra gravel rides. But if you are sitting on the outside, looking in, wishing you could achieve feats like them, some questions may be stopping you from signing up to that epic adventure. Where do you sleep? Do you even sleep? What about food and drink? How do you carry all your stuff? Isn’t it scary being on your own in the middle of nowhere in the dark? Frazier admits that ultra gravel racing is a continual learning curve, and whether you are a meticulous planner or a wing-it type of person, there will always be something to learn on each and every race. She shares with </span><i><span>Rouleur</span></i><span> her top tips for those wanting to take on the challenge.</span></p>\n<h3>1. Eat more food</h3>\n<p>“Your mood and state of being is totally correlated to how much food you eat, and you never can eat enough food, but you definitely can eat too little food. If you're riding for days and days, then you'll definitely want to keep your food levels up. Every 45 minutes is when I try to eat, so I have an alert on my phone and my Wahoo that basically just says snacks. Sometimes I ignore it, and other times I know I need to eat in five minutes because I can almost feel that I'm getting a little bit tired or distracted, so your ability to focus and do everything is 100% related to how much food you're eating. </p>\n<p><span>“For example, at Badlands, I was on the phone with two of my best friends and all of a sudden I was at a point where I was really racing hard because the second place rider was so close. And I just felt so good until a couple of minutes after this point and then I was like, ‘I think I'm gonna cry’ to my friends. I said, ‘I think I'm overwhelmed. Everything just seems like it's failing and I feel like I'm gonna cry.’ And one of my best friends just told me to eat right away, not to do anything else but eat and wait. I shoved some gummies down and then within five minutes I felt back to normal and back to my regular baseline. So, if you're feeling down, no matter what, eat and it'll help fix your problem.</span><span> </span></p>\n<p>“Also having food that's easily accessible I think is a huge thing. I have raced without a food bag on my bike and you’re having to dig in your pockets trying to find some food that has been buried. Then you’re pulling everything out and you’re slowing down, so having some easy accessed food is super important.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Badlands_Day02_028.jpg?v=1696953227\" /></p>\n<h3>2. Sleep, and sleep in the daylight</h3>\n<p>“If eating doesn't fix the problem, then it probably means you need to sleep. I have learned that I can do sleep deprivation because I have the desire to get to the finish before anybody else. But I don't think sleep deprivation, like full on sleep deprivation, is the key for a lot of people who are just wanting to complete the course. So sleep, even better if you can sleep for three or four hours, depending on the distance, will do you great. </p>\n<p>“For me, I take short naps. A 10 minute nap will make a world of difference, especially if I am falling asleep on the bike. So, if you don’t feel great 10 minutes after eating, definitely try to sleep. I’ve found that a lot of people will decide to stop racing in the middle of the night or in the dark, but that is when they get overwhelmed. That’s the biggest lesson I have learned, don’t stop the race in the nighttime, wait until daylight, or until you’ve slept, because that can really change your mindset. </p>\n<p>“I think getting used to riding in the dark is a good thing to do before a race like this. When I started racing, or started trying to figure out how to do it, I would leave work on a Friday at 5pm, and then I would ride through the night before stopping to have breakfast and then go to sleep. It’s such a weird feeling riding in the dark, but after a while you become numb to it and I am not fazed by the fact it’s dark anymore. The only thing about it being dark for me at this point now is just it's dark for another eight hours – I’m more annoyed than scared. But it takes practice and I mean, that’s my whole thing, practice makes prepared. You're not going to be perfect. But if you try it outside of a race scenario, when you go into the race scenario, you'll feel more prepared.”</p>\n<h3>3. Don’t weigh your bike </h3>\n<p>“I don’t actually care what my bike weighs. I just want to know my bike has everything I’ll need on it. The only time I weighed by bike was before the Across Andes race and I saw how much it weighed, and even they mentioned how heavy my bike was, and I remember thinking, ‘oh, great.’ Just don’t give yourself that negative energy.”</p>\n<h3>\n<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/DSC03410.jpg?v=1696000870\" />4. Do your research for points of interest </h3>\n<p>“I'm actually the worst at this as I don't typically do much prep. I'm sure if I do a really big race, like the Tour Divide or Silk Road, where it's really significantly long, I will do more research, but I often just do my research the week before the race. And even this is more of a rough plan. I will write down a list in the notes on my iPhone and that basically has little emojis with distances and then other information, like the French fries emoji means resupply food or food will be here. Or if there is a big town, I will do a building emoji – it’s just like my own secret emoji code. I know there are bike computers that’ll tell you that sort of thing now, but in some kind of way, that research helps me process what I am taking on.</p>\n<p>“You’ll get people who’ll spend days and days on Google maps, zooming in and looking at different locations, using the different views. That is not me. It’s really good planning and I wish I was better because I would know so much more about the route, but I also kind of like the idea of the unknown a bit and having an adventure. I think this is why we do these sorts of things. Anyway, do enough research to get by, especially in terms of resupply locations and how much food you’ll need to carry from one point to another.” </p>\n<h3>5. Make a list of thing you need when resupplying </h3>\n<p>“This is my favourite tip to tell people. When you get to a resupply location, you’re not just getting food, you’re also dealing with your body, throwing rubbish away, potentially needing to get things outside of food, lube your chain, change your bibs, or even put something in your saddlebag. So that is a lot to remember when you have stopped. And if you want to try and do all this, I always find that making a list of things you want to do or buy is really helpful. As I get closer to my stopping point, I make a note on my phone of things I want to do. That way you are not stopping again 10 minutes later. </p>\n<p>“It definitely helps you not feel like a zombie walking down the shopping aisles too. However, I think no matter what, you’re still going to end up doing that, but a list will certainly help.” </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Badlands_Day01_00004.jpg?v=1696953007\" /></p>\n<h3>6. When it comes to weather, always prepare for worst case scenario </h3>\n<p>“You never know whether it will rain, so rain pants and jackets are super helpful depending on where you are racing. Waterproof socks also if there is going to be a lot of rain. If you’re going up high at all, make sure you have enough clothing. A down jacket is the key to survival in a lot of these races, so even if you don’t use it, just have it there. I didn’t use it at Badlands this year, but I’ve used it at every other race I have done.” </p>\n<h3>7. Don’t make a strict plan, be flexible </h3>\n<p>“When you’re looking at a route you’ve never done before, you never know what you’re going to expect, or what to expect from the race itself. It’s easier when it's completely paved, as you’ll know more about what to expect. But if it is off-road, then the road could have been washed out, the pavement could be broken, or the roads might just be terrible – so you just don’t know. That’s why I don’t follow a timetable. I think following a timetable for me would be a huge Debbie Downer. It would make me feel really sad if I wasn't hitting it. Some people thrive on that and if they don't have it then they are not pushing themselves properly. For me, I just need competition. </p>\n<p>“Making a rough plan of your race tactic can be helpful, but also remember to be flexible if you have to change your plans. You could get a flat, crash your bike, need to sleep for longer, a resupply location could be closed, anything could happen. You’ve just got to roll with the punches, and be positive while doing so. </p>\n<p>“A positive mindset is so, so important. I have really worked hard on changing how I felt about things when something was really hard over the past year. Just recognise that something is challenging, but deciding to push through it with a positive attitude will be a gamechanger. Plus, no one will want to be around you if you are constantly being negative.” </p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Badlands_Day01_00137.jpg?v=1696953249\" /></p>\n<h3>8. Don’t carry too much of the same food </h3>\n<p>“I can't eat Cliff Bars anymore. I’ve had enough of those in my life. If you bring too much of the same food, you're just not going to eat it and then that's a recipe for disaster. So having a mix of foods, something sweet, something savoury, and gels or bars and then also those emergency foods will keep you in good stead. And trust me, after 24 hours or 48 hours of eating gummies, you’re not going to want to see them anymore. </p>\n<p>“Also, bring a toothbrush, especially if a race is longer than two days. Your tongue and mouth will just taste of salt. When you finish a race, your tongue just doesn’t feel the same for about five days, so brushing your teeth really helps!”</p>\n<h3>9. Nothing new on race day</h3>\n<p>“I gave myself Sherman’s neck at Across Andes last year with my new headlight. I couldn’t hold my head up, and in the end, I was really straining my neck for all that time. Now, I make sure I go out at night and check everything before a race. Even clothes, if you haven’t tested them, could rub away the skin and make it uncomfortable, or a new bar bag could rub the inside of your thigh, or a helmet could irritate your head. So make sure you test everything before you decide to pack it. The Sherman’s neck was terrible. I hope I don't experience that again.”</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Badlands_Day02_021.jpg?v=1696953288\" /></p>\n<h3>10. If things are not going your way, do not choose to DNF at night – always wait until sunrise </h3>\n<p>“So many people stop the race in the night and then the next day feel better. It is hard when you feel so low at that moment, but the first steps should be my other tips. Can you sleep? Have you eaten? The body is resilient and as long as you aren’t experiencing a potential long term injury, then keep going as you will be disappointed in the long run. And if you didn’t finish a race, then go back so you can finish it and get rid of that feeling!</p>\n<p>\"Before you go back to a race you never completed or a new one, make a note of things you learned on the last race, even down to how many gels you had left over or how many hours your batteries lasted, because you'll forget unless you note it down when it is fresh. It'll be a blessing when preparing for you next one.\" </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"980886282374eb3047f977e37e43385e408074ec46e08bec2eeaec7e3cc58997","category":"Cycling"}