{"title":"Analyzing Urban Drinking Water System Vulnerabilities and Locating Relief Points for Urban Drinking Water Emergencies","link":"http://link.springer.com/10.1007/s11269-024-03769-0","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>Urban water is known as a critical sector of urban environments which significantly impacts the life quality and wellbeing of reinstates. In the context of developing sustainable urban drinking system it is critical to analyze network events and develop sufficient systems of water supply. To the best of our knowledge, fewer studies have examined the potential of automated-based approaches such as deep learning convolutional neural network (DL-CNN) for analyzing urban water network events and identifying the optimal location of urban drinking water relief posts. Therefore, the current study aims to propose an efficient approach for Geospatial based urban water network events analyze and determine the optimal location of urban drinking water relief posts in Zanjan. For this goal, first, we prepared and preprocessed various predisposing variables for analyzing the urban water network events and determining the optimal location of urban drinking water relief posts. We then applied an integrated approach of analytical network process (ANP) and DL-CNN methods to locate the best location of urban drinking water relief posts. Finally, intersection over union and accuracy assessment were employed to evaluate the performance of the results. Our findings show that the DL-CNN performed well with an accuracy of 0.942 compared to the ANP (0.895) for determining the optimal location of urban drinking water relief posts. According to the results, the best place to build a relief post is in the city center, and the surrounding areas may not be suitable, which is in accordance with field work analysis. The results of the study also reveal that areas 5 and 3 are at high risk from the number of urban water network events perspective, which requires the construction of urban water relief stations.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"980c73a0c7e384ac5365d80165bcdf1982ec5ec24f055ded11c5d1a71e0fee5c","category":"Environment"}