{"title":"Data analytics-based evaluation of blood indices and adaptation of medicated and non-medicated broiler chickens under humid tropical conditions","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae040/7630389?rss=1","date":1710547200000,"content":"<span><div>Abstract</div>The growth performance and blood indices of medicated and non-medicated broiler chickens have been the subject of this research coupled with a paucity of comparative information on what can actually happen to broiler chickens if not medicated when reared under humid tropical conditions. One hundred unsexed day-old broilers were randomly and equally allotted into two treatment groups of TM (medicated) and TN (non-medicated) in a completely randomized design each treatment with five replicates having ten birds each. The birds were reared on deep litter system for 56 d which was divided into two phases of 28 d each (starter and finisher), during which data were collected with respect to daily feed intake, final body weight, body weight gained (BWG), mortality rate while blood analysis was carried out on 28th and 56th d for starter and finisher phases, respectively. Non-medicated group served as control. Feed conversion ratio (FCR) and feed conversion efficiency (FCE), were later calculated. Data collected were subjected to analysis of variance statistically. There was no significant difference between the medicated and non-medicated broilers for daily feed intake, final body weight, and BWG and also for the blood parameters investigated at starter phase. However, at finisher phase, no significant difference was observed in the daily feed intake of Tm and Tn but there was significant (<span>P</span> &lt; 0.05) difference in the final body weight, BWG, FCR, FCE, and mortality rate between the two groups. Birds on Tm attained higher weight significantly (<span>P</span> &lt; 0.05) than those on TN. BWG, FCR, and FCE followed the same trend and also the mortality rate. White blood cells count of TN was higher significantly (<span>P</span> &lt; 0.05) than TM while TM birds recorded higher packed cell volume, red blood counts, and hemoglobin concentration (Hb) significantly (<span>P</span> &lt; 0.05) than TM birds. Effect of medication was much noticeable at finisher phase as it improved the growth rate though mortality rate was close to that of TN group. These results suggest that broilers can be produced free of medication with good feeding without loss of birds while the growth rate can be enhanced with the use of prebiotics and prebiotics.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"9811aeec1a4cf22f7c594d9e45266544d1a768b84a61f22661aba56028245374","category":"Environment"}