{"title":"Increasing Phosphorus Digestibility in Common Carp (Cyprinus carpio L.) Farming Using Phytase and Citric Acid","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/4781600?af=R","date":1690354800000,"content":"<p>The presence of antinutritional substances, such as phytate, in fish feed affects the digestibility and absorption of minerals and nutrients by fish, while reduced availability of phosphorus (P) in wheat-based feeds used in fish farming can increase pollution in the aquatic environment. Phosphorus digestibility can be effectively increased in aquaculture through the addition of both phytase and citric acid. The aim of our study was to investigate the effects of phytase enzyme and citric acid addition on P digestibility, production parameters and blood parameters in farmed common carp (<i>Cyprinus carpio</i> L.). Two trials were undertaken using the following experimental diets: control with no additives (C), low enzyme content (500 FTU/kg; L), high enzyme content (1,000 FTU/kg; H), low enzyme contents with 3% citric acid (LA), high enzyme contents with 3% citric acid (HA). Initial results showed that LA increased P digestibility by 27% and HA by 26%, with no increase detected using L and H. In the second trial, in which production and blood parameters were examined, use of LA and HA resulted in a 20% decreased feed conversion ratio and 11% higher specific growth rate. Furthermore, acidified diets resulted in an increased blood plasma calcium and inorganic P, without negative effects on any parameter. Addition of phytase and citric acid to <i>C. carpio</i> granulated feeds also has a positive influence on the environment by reducing excreted P.</p>","author":"Ondřej Malý, \nIveta Zugárková, \nMarija Radojičić, \nEva Poštulková, \nJan Mareš, \nJanice Ragaza","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"9813d030daad6d68d0ea434c6424a4ab8c511d4314c555e4adbc68d7da884fcb","category":"Environment"}