{"title":"Social Diversity in Focus: Assessing the Impact of Socioeconomic Backgrounds and Work Experience on Psychological Well-being and Academic Confidence Among German First-Year Medical Students","link":"https://www.preprints.org/manuscript/202409.0251/v1","date":1725398819000,"content":"This investigation pioneers an examination of the scarcely explored terrain of social diversity in medical education, assessing the complex impacts of socioeconomic status (SES), prior working experiences, and completed apprenticeships on a spectrum of psychological and academic facets among first-year medical students (n = 336) in an urban university setting. By utilizing a systematic and detailed approach, the study illuminates prior anatomical knowledge and various psycholog-ical constructs, marking a significant stride into a domain where knowledge remains profoundly limited. Analyses indicated that SES significantly affects financial anxiety (F(4, 331) = 17.391, p &lt; .001) and academic behavioral confidence (F(4, 331) = 4.323, p = 0.002). Students with prior working experience reported higher self-perceived clinical experience but lower A-level grades (t(279.459) = -6.690, p &lt; .001), competence in natural sciences (t(321.045) = -3.178, p = 0.002), and online competence (t(319.429) = -2.026, p = 0.044). Those who completed an apprenticeship showed higher resilience, academic confidence, self-efficacy, and greater concerns about balancing studies and work (t values ranging from 2.020 to 3.158, p &lt; 0.05). Correlation analysis revealed a positive relationship between resilience (RQS) and coping with academic stress (CAS) (r = 0.632, p &lt; .001), as well as between resilience and academic behavioral confidence (ABC) (r = 0.608, p &lt; .001). Negative correlations were observed between resilience, coping with academic stress, academic confidence, and cognitive test anxiety (CTA) (r values from -0.235 to -0.404, p &lt; .001). The findings emphasize the need for tailored support for students from diverse SES backgrounds and with varying expe-riences. The study highlights the value of a comprehensive approach in medical education, con-sidering the diverse backgrounds and experiences of students. Future research should explore the long-term impact of these factors on professional competencies and patient care, leveraging the diversity of the student body for a holistic educational experience.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9818624a87c6c745b72fadd623cfdc71d22cea111e8db1d53796d11aae980924","category":"Interdisciplinary"}