{"title":"‘How to adapt forests?’—Exploring the role of leaf trait diversity for long‐term forest biomass under new climate normals","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17258?af=R","date":1713360923000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/c1645449-f3a2-4fb4-aa0a-c6aa778a0d9d/gcb17258-toc-0001-m.png\" alt=\"‘How to adapt forests?’—Exploring the role of leaf trait diversity for long-term forest biomass under new climate normals\" />\n<p>This modelling study explores the impact of functional diversity on European forest biomass in the context of different climate change scenarios. We found that high functional diversity enhances forest long-term biomass. Even if forest communities are constrained to the best-performing leaf traits in low-diversity experiments biomass is significantly lower than in high-diversity communities. As climate change intensifies, the benefits from functional diversity diminish.</p>\n<br />\n<h2>Abstract</h2>\n<p>Forests, critical components of global ecosystems, face unprecedented challenges due to climate change. This study investigates the influence of functional diversity—as a component of biodiversity—to enhance long-term biomass of European forests in the context of changing climatic conditions. Using the next-generation flexible trait-based vegetation model, LPJmL-FIT, we explored the impact of functional diversity on long-term forest biomass under three different climate change scenarios (video abstract: <a target=\"_blank\" href=\"https://www.pik-potsdam.de/~billing/video/2023/video_abstract_billing_et_al_LPJmLFIT.mp4\">https://www.pik-potsdam.de/~billing/video/2023/video_abstract_billing_et_al_LPJmLFIT.mp4</a>). Four model set-ups were tested with varying degrees of functional diversity and best-suited functional traits. Our results show that functional diversity positively influences long-term forest biomass, particularly when climate warming is low (RCP2.6). Under these conditions, high-diversity simulations led to an approximately 18.2% increase in biomass compared to low-diversity experiments. However, as climate change intensity increased, the benefits of functional diversity diminished (RCP8.5). A Bayesian multilevel analysis revealed that both full leaf trait diversity and diversity of plant functional types contributed significantly to biomass enhancement under low warming scenarios in our model simulations. Under strong climate change, the presence of a mixture of different functional groups (e.g. summergreen and evergreen broad-leaved trees) was found more beneficial than the diversity of leaf traits within a functional group (e.g. broad-leaved summergreen trees). Ultimately, this research challenges the notion that planting only the most productive and climate-suited trees guarantees the highest future biomass and carbon sequestration. We underscore the importance of high functional diversity and the potential benefits of fostering a mixture of tree functional types to enhance long-term forest biomass in the face of climate change.</p>","author":"Maik Billing, \nBoris Sakschewski, \nWerner von Bloh, \nJohannes Vogel, \nKirsten Thonicke","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"982297307706ee746ef37e81819107a4941c41c633ec3bdb03f16f1c8f3c82ab","category":"Environment"}