{"title":"24-inch iMac review: Cutting-edge in full color","link":"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html","date":1622543400000,"content":"<div>\n<section><div></div></section>\n\n\n<div><img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" /><h2>At a glance</h2><h3>Expert’s Rating</h3><div></div>\n<div><div><div><h3>Pros</h3><ul><li>Excellent CPU and GPU performance for a consumer Mac</li><li>Much improved FaceTime HD camera</li><li>Beautiful colors</li><li>Thin, lightweight design</li><li>Smaller bezels </li><li>Touch ID on $1,499 and $1,699 models</li></ul></div><div><h3>Cons</h3><ul><li>Stand not height adjustable</li><li>No nano-texture glass option for the display</li><li>Can’t upgrade the memory yourself</li><li>White bezels may not be to your liking</li></ul></div></div></div><h3>Our Verdict</h3><p>With the new 24-inch iMac, Apple succeeds in making the iMac exciting again. It starts with the bold use of color and a new slim and minimalist design on the outside, and ends with Apple’s impressive M1 System on a Chip (SoC) inside. It all combines to make a cutting-edge desktop computer that looks fantastic in any setting.  </p>\n</div><h3>Price When Reviewed</h3><p>$1,299 | $1,499 | $1,699</p>\n\t\t\t\t<h3>\n\t\t\tBest Prices Today\t\t</h3>\n\t\t\t\t<div>\n\t\t\t<div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Retailer</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Price</span>\n\t\t\t\t</div>\n\t\t\t\t<div>\n\t\t\t\t\t<span>Delivery</span>\n\t\t\t\t</div>\n\t\t\t</div>\n\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/themes/idg-base-theme/dist/static/img/apple-logo.svg\" />\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>US$1299</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-mac/imac&amp;subid1=1-1-347534-0-0-0\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<span>Costco</span>\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>US$1450</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span></span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.costco.com/new-imac-24%22-with-retina-4.5k-display---apple-m1-chip-8-core-cpu%2c-8-core-gpu---8gb-memory---256gb-ssd.product.100694236.html&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/themes/idg-base-theme/dist/static/img/amazon-logo.svg\" />\n\t\t\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>$1,499.00</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>Free</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<a href=\"https://www.amazon.com/dp/B0932G65T7?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">View</a>\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\t\t\n\t\t\t<div>\n\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t\t\tPrice comparison from over 24,000 stores worldwide\t\t\t\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t</div>\n\t\t</div>\n\t\t\n\n\n<p>The iMac was long overdue for a change. Its basic design is about 17 years old, and sure, it had some changes happen during that time, but they were incremental and didn’t alter the way we think about the iMac. To its benefit, it was a design that worked for a long while, but over the past couple of years, the iMac felt dated.</p>\n\n\n\n<p>With the new <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/imac-24/&amp;subid1=1-1-347534-0-0-0\">24-inch iMac</a>, the iMac line gets the new life that it needed, and Apple succeeds in making the iMac exciting again. It starts with the bold use of color on the outside with a new slim and minimalist design and ends with Apple’s impressive M1 system on a chip (SoC) inside. It all combines to make a cutting-edge desktop computer that looks fantastic in any setting.  </p>\n\n\n\n<p>Apple offers three standard configurations of the 24-inch iMac. This review takes a look at the $1,699 model, which has an 8-core M1 SoC, 8GB of memory, an 8-core GPU, a 512GB SSD, gigabit ethernet, and Touch ID.  </p>\n\n\n\n<h2>A beautiful rainbow of colors</h2>\n\n\n\n<p>The idea of an iMac offered in an array of colors isn’t new—it’s an idea Apple first established with the <a href=\"https://www.macworld.com/article/347019/m1-imac-g3-throwback-colors-design-display-mouse-ports-price.html\">iMac G3</a> in 1999. When the <a href=\"https://www.macworld.com/article/218460/the-exceptional-imac-g4-ten-years-later.html\">iMac G4</a> was released (the sunflower model with a dome base and a “floating” display), the color selection went away and Apple stuck with white on the iMac for a while, before switching to aluminum in 2007. It’s been silver and black until now (except for the space gray <a href=\"https://www.macworld.com/article/230880/imac-pro-review-mac-pro-power-in-the-shape-of-an-imac.html\">iMac Pro</a> that was released in 2017 and discontinued this year).</p>\n\n\n\n<p>The color selection is limited to four choices with the $1,299 model. If you spend more, you get three more color options. Here are the colors that are available for each model.</p>\n\n\n\n<figure><table><thead><tr><td>iMac model</td><td><strong>Colors</strong></td></tr></thead><tbody><tr><td>$1,299 24-inch iMac</td><td><strong>blue, green, pink, silver</strong></td></tr><tr><td>$1,499 24-inch iMac</td><td><strong>blue, green, pink, silver, orange, purple, yellow</strong></td></tr><tr><td>$1,699 24-inch iMac</td><td><strong>blue, green, pink, silver, orange, purple, yellow</strong></td></tr></tbody></table></figure>\n\n\n\n<p>The colors on each iMac are offered in two tones, with a dark tone on the back, and a pastel-like hue on the front. The model in our review is pink, and boy, it is pretty. But while Apple calls this model “pink,” it’s really only pink on the front. The back is a rich and stunning red that catches your eye and stands out in a room. It’s truly lovely. (This isn’t (Product)RED-branded, but it’s a very similar shade, so I guess Apple calls it “pink” to avoid confusion.)</p>\n\n\n\n<p>The pink iMac looks marvelous, and I’m someone who would normally pick a neutral-colored Mac, like silver. I’m not alone: according to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.sellcell.com/blog/apple-2021-new-products-survey/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">a survey by SellCell,</a> the most popular iMac colors are blue and silver, the two more neutral colors offered. So why offer different colors? The iMac has always had a bigger role than that of just a desk computer. In smaller rooms, dorms, and apartments, it does double duty as the focal point of an entertainment center. In offices and other businesses, it’s used in kiosks, as demonstration PCs, and other setups. It is often used in places where it can stand out, so why not offer it in colors to match the setting? Better yet, you can pick a color that reflects your personality and style—after all, an iMac is a PC, a <em>personal computer</em>.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_001.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Will there be a lucrative market for iMac bezel covers for those of us who don’t like the 24-inch iMac’s white bezels?</p></figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>Despite being a fuddy-duddy (or a “traditionalist”), I’m excited by the colors, but then that excitement is tempered by the bezel, the border that surrounds the display. It’s white and it stands out to my eye as a distraction. I prefer black bezels and I use a black desktop image in macOS. I use black because of all the screenshots I take, and I like the effect of a darker desktop blending with the black bezel. I can’t replicate that on the iMac, because there’s a black border between the display and the white bezel that disrupts the blending. The white bezel does a better job matching the environments (walls) the iMac is in, but when I use it, I’m looking at the display, not what’s behind it. The only solution is to learn to ignore the bezels—or buy one of the inevitable bezel skins once they arrive.</p>\n\n\n\n<p>Apple includes a magnetic power cable, Magic Keyboard, and Magic Mouse 2 and/or Magic Trackpad that all color-match the iMac, a nice touch. You can’t mix up the colors at the point of purchasing the iMac, nor does Apple offer the colored devices in the Apple Store, so you can’t get a blue Magic Mouse, an orange Magic Trackpad, and a green Magic Keyboard to go with your purple iMac. (You can buy a space gray <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MLA02LL/A/magic-mouse-2-silver&amp;subid1=1-1-347534-0-0-0\">Magic Mouse 2</a> ($79) or a space gray <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MQ052LL/A/magic-keyboard-with-numeric-keypad-us-english-silver&amp;subid1=1-1-347534-0-0-0\">Magic Keyboard with Numeric Keypad</a> without Touch ID ($149) at the Apple Store separately if you <em>really</em> want to mix up the color palette of your setup.)</p>\n\n\n\n<h2>Thin to a fault</h2>\n\n\n\n<p>Apple seems like it’s on a continuous mission to make its computers thinner than before. While most people think of MacBooks, iPhones, and iPads in this endeavor, the iMac is part of it, too. In 2012, Apple came up with a design that tapered from its thickest point at the center of its body to 5mm edges. Since then, Apple has released other devices that are very thin from point A to point B, with no bulges in between. If an Apple insider told me that Apple staffers looked upon the tapered iMac design with disdain, I’d believe it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_47.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The 24-inch iMac is 11.5mm thin and weighs less than 10 pounds.</p></figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>With the 24-inch iMac, Apple has finally achieved the goal of a thin all-in-one without any thickening compromises. This iMac body is 11.5mm thin, but it’s 11.5mm throughout—no more center bulge. It’s so thin that the 3.5mm audio jack must be placed on the iMac’s side because the jack is actually longer than the iMac’s width.</p>\n\n\n\n<p>What does a thin iMac body do for us, though? An iMac isn’t a computer you would move around frequently, and the 24-inch iMac takes up about the same about of space as the 21.5-inch and 27-inch iMacs, so nothing is gained there. But there is something to the fact that the iMac is no longer a hulking beast sitting on a desk, table, or countertop. It used to be that modern technology came at a cost of size and weight, and the 24-inch iMac reminds us that is no longer the case.</p>\n\n\n\n<p>This brings me to the “chin,” the ledge that sits below the iMac’s display. The iMac has always had a chin because the placement of the inner components called for it. But according to an <a href=\"https://www.macworld.com/article/347476/imac-teardown-ifixit-logic-board-m1-speakers-repairability.html\">iMac teardown</a> by iFixit, the 24-inch iMac has its motherboard, speakers, and other components in the chin, leaving a lot of space behind the display. It seems like Apple could’ve placed those parts behind the display and make an iMac that’s thicker but without a chin. I’m indifferent about the chin, but I think it would be cool to have a chinless iMac. It feels like that’s part of the next step in the evolution of iMac design, and I’d be fine with making the body thicker to make it happen. As it is, the chin is there (sans Apple logo), so you have a place to put your Post-It Notes.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_122.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Does Apple consider the “chin” below the display an essential part of the iMac brand identity? It seems like they think so.</p></figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>I hoped Apple would implement a stand with adjustable height in this new iMac design, but that didn’t happen, and I don’t think it will ever happen. Looks like I’ll always need a ream of paper on my desk to boost the iMac so I can use it at a height that won’t leave me with neck pain.</p>\n\n\n\n<h2>Glossy yet gorgeous</h2>\n\n\n\n<p>Despite its 24-inch modifier, the iMac has a 23.5-inch Retina display with a native resolution of 4480-by-2520 resolution at 218 pixels per inch (Apple calls it a 4.5K display). It supports one billion colors and the P3 color gamut, and has a brightness of 500 nits. It’s a gorgeous display, with good brightness, great detail, and excellent color. It’s just as good as other iMac displays.</p>\n\n\n\n<p>In sticking with its color theme, the 24-inch iMac includes desktop backgrounds that match the iMac’s body. When I first launched the 24-inch iMac, the Finder has a distinct pink hue to it, because it was set to match the body. Apple does include the desktop colors for the other iMacs, so if you want to mix things up and use the orange desktop on a blue iMac, you can. Apple also include a special “Hello” screen saver for the 24-inch iMac.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/hello-imac-screensaver-1-4.gif?w=1200\" /><figcaption>The Hello screensaver is color matched to your 24-inch iMac.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>The glass in front of the display is glossy and Apple does not offer the non-glossy nano-texture glass that it does for the 27-inch iMac. That’s too bad, because I prefer the nano-texture, but it’s one of those options that Apple won’t provide in a consumer-level product.</p>\n\n\n\n<h2>Enough expansion for most</h2>\n\n\n\n<p>The $1,699 24-inch iMac reviewed here has two Thunderbolt/USB 4 ports and two USB 3 ports. The ports are visually identical, but Thunderbolt ports are clearly labeled with lighting icons, while the USB 3 ports aren’t labeled at all. The $1,499 model has the same ports, but the $1,299 model has only the two Thunderbolt/USB 4 ports.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_43.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Thunderbolt-compatible ports are indicated by the lightnning icons. The unlabeled ports are USB-C.</p></figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>Four total ports on the $1,499 and $1,699 iMacs are probably enough for most people. But if you’re using older devices with USB-A ports, you need an adapter like Apple’s $19 <a href=\"https://www.amazon.com/Apple-USB-C-to-USB-Adapter/dp/B00VU2OID2?ots=1&amp;slotNum=1&amp;imprToken=aabcd2ac-7f55-9446-1af&amp;tag=macworld05-20&amp;asc_refurl=https://www.macworld.com/article/229045/macbook-pro-thunderbolt-3-adapter-guide-how-to-connect-an-iphone-display-hard-drive-and-more.html\" target=\"_blank\">USB-C to USB Adapter</a>. (Check out our <a href=\"https://www.macworld.com/article/229045/macbook-pro-thunderbolt-3-adapter-guide-how-to-connect-an-iphone-display-hard-drive-and-more.html\">Thunderbolt adapter guide</a> to help you find the adapters you need.) If you need to have multiple non-USB-C devices connected at the same time, consider buying a Thunderbolt hub or dock that has several different ports. For example, we reviewed the <a href=\"https://www.macworld.com/article/234833/corsair-tbt100-thunderbolt-3-dock-review.html\">Corsair TBT100 Thunderbolt 3 Dock</a> ($250) that you could connect to the iMac’s Thunderbolt port, and it will then provide you with two USB-A ports, two USB-C ports, a gigabit ethernet connector, two HDMI video jacks, and an SD card slot. </p>\n\n\n\n<p>The $1,499 and $1,699 iMacs come with gigabit ethernet but the connector is on the power adapter, not on the iMac itself. This makes a lot of sense, since ethernet is a cable running from a wall connection and there’s no need to clutter up your desk with it. Besides, the ethernet connector is too long and wide for the iMac itself.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_40.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The power plug is color-matched to the iMac, and its magnetic hold is very strong.</p></figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>Speaking of the power adapter, Apple uses a magnetic connector (that’s not called MagSafe) to plug into the iMac. The plug has a very strong hold and it takes a good amount of force to remove it, so there’s no need to worry about the plug becoming undone if you move the iMac. It could become unplugged if you trip over the cable, but that’s not likely to happen. Nobody uses an iMac like a MacBook, and usually the iMac would be set up in a stationary spot that isn’t going to be in the way of foot traffic.</p>\n\n\n\n<h2>Expected M1 CPU performance</h2>\n\n\n\n<p>The 24-inch iMac has the same M1 SoC as the Mac mini, the 13-inch MacBook Pro, and the MacBook Air. So it comes as no surprise that the iMac posts benchmark results that are very similar to its M1 siblings. Our first set of benchmarks uses <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.geekbench.com/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Geekbench 5</a> to gauge the single- and multi-core performance of the CPU.</p>\n\n\n\n<p>In Geekbench 5’s single-core test, the difference between the M1 Macs is within 2 percent. In the Multi-Core test, the desktop Macs are faster than the laptops by less than 4 percent. The slower results are probably caused by the tighter quarters of the iMac and the laptops, and their processors need to maintain proper operating temperature. The Mac mini has a little more room to help it stay cool, allowing it to be a little faster. But we’re talking about differences that are practically imperceptible to the user.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-geekbench-5-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>The Geekbench results of the iMac compared to Intel-based Macs are a little more interesting. I ran Geekbench on the following models:</p>\n\n\n\n<ul><li>27-inch iMac (2020) with a 3.6GHz 10-core Core i9 processor, 32GB of RAM, a 16GB Radeon Pro 5700 XT graphics card, and a 1TB SSD ($4,299; <a href=\"https://www.macworld.com/article/234483/27-inch-apple-imac-2020-review.html\">read the review</a>)</li><li>21.5-inch iMac (2019) with a 3.0GHz 6-core Core i5 processor, 8GB of RAM, a 4GB Radeon Pro Vega 20 graphics card, and a 1TB Fusion drive ($1,849 at the time of the <a href=\"https://www.macworld.com/article/232637/215-inch-30ghz-6-core-core-i5-imac-2019-review-new-all-in-one-stands-out-in-multi-core-performance.html\">review</a>)</li><li>Mac mini (2018) with a 3.6GHz quad-core Core i5 processor, 8GB of RAM, Intel UHD Graphics 630 integrated graphics, and a 128GB SSD ($799 at the time of the <a href=\"https://www.macworld.com/article/232082/799-mac-mini-review.html\">review</a>)</li></ul>\n\n\n\n<p>The iMac bests all the tested Intel Macs in single-core performance, with a 20 percent increase in performance over its closest Intel competitor in the 27-inch iMac. The bigger iMac scored 23 percent better in multi-core testing, but the $4,299 27-inch iMac has a 10-core CPU and 32GB of RAM, compared to the 8-core CPU (four performance cores and four efficiency cores) and 8GB of RAM in the $1,699 24-inch iMac. Is that 23-percent boost worth the extra $2,600? It might be, depending on your situation, but for most people, probably not.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-cinebench-r23-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>We use another CPU-intensive benchmark, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.maxon.net/en/cinebench/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Cinebench R23</a>, to get another perspective on performance. Cinebench does CPU-based ray-traced rendering and is considered a test that performs “real world” tasks.</p>\n\n\n\n<p>The 27-inch iMac doubles the performance of the 24-inch iMac, but again, I’ll point out that the 27-inch iMac has more CPU cores and more RAM—the 24-inch iMac does outperform the 27-inch iMac in the single-core test. The 24-inch iMac blows by the 21.5-inch iMac, with a 25-percent improvement in the multi-core test, and a 30-percent increase in the single-core test.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-handbrake-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Another CPU test we run is a file conversion of the 4K <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://mango.blender.org/download/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Tears of Steel</a> video to a 1080p H.265 file in HandBrake 1.4, which is a Universal app that runs natively on the M1. Once again, the buffed-out 27-inch iMac shows that it’s in a different class than the 24-inch iMac. (I left the other M1 Macs out of the HandBrake results and the other tests that follow, since they mirror the 24-inch iMac.)</p>\n\n\n\n<p>But the 24-inch iMac has nothing to be ashamed of. HandBrake has an option to use <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/documentation/videotoolbox&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">VideoToolbox</a>, which allows for video encoding acceleration. The results are dramatically faster overall, but the 24-inch iMac is only 14 seconds behind the 27-inch iMac.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-blackmagic-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>Blackmagic Design is known for its professional video equipment and production software. Its <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/blackmagic-disk-speed-test/id425264550&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Disk Speed Test</a> benchmark is a popular tool that measures the throughput of storage devices handling large data blocks.</p>\n\n\n\n<p>Both the 24-inch and 27-inch iMacs have SSDs and perform well. The 21.5-inch iMac has a 1TB Fusion drive, which combines flash storage with a hard drive. A Fusion drive can’t match the performance of an SSD—Apple doesn’t even offer Fusion drives for the 24- or 27-inch iMac. You can still get a 1TB Fusion drive in the <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-mac/imac-imac/21.5-inch&amp;subid1=1-1-347534-0-0-0\">$1,099 21.5-inch iMac</a> that Apple still sells.</p>\n\n\n\n<h2>Good graphics but not a breakthrough</h2>\n\n\n\n<p>The same story about the M1 Mac’s CPU can be said about the graphics processor unit (GPU). The 24-inch iMac, Mac mini, 13-inch MacBook Pro, and MacBook Air in these results all have 8-core GPUs. Again, no surprise here: these results are similar.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-geekbench-5-compute-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>As I mentioned in the CPU performance section, the Mac mini has an advantage with its case design, so it doesn’t have to work as hard to maintain a proper temperature like the other Macs. That allows it to run faster, but it’s advantage isn’t really all that much—the 24-inch iMac is only 5 percent behind the Mac mini in <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/metal/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Metal</a> performance.</p>\n\n\n\n<p>Comparing the 24-inch iMac to the 2020 27-inch iMac with a 16GB Radeon Pro 5700 XT graphics card and a 2019 21.5-inch iMac with a 4GB Radeon Pro Vega 20 graphics card gives us insight as to how the M1’s 8-core GPU performs. The 24-inch iMac has nothing to be embarrassed about here—in fact its quite remarkable how well it does compare to the high-end AMD graphics cards.</p>\n\n\n\n<p>It’s clear that the M1’s GPU isn’t in the class of the 16GB Radeon Pro 5700 XT, which is a $500 upgrade for the current $2,299 27-inch iMac. But the argument can be made that the 27-inch iMac has a different audience than the 24-inch iMac—it’s made for professionals who want a workstation that can handle high-end software. The 24-inch iMac is a consumer-level Mac, and while it can easily handle pro apps, compromises are made to get the price down.</p>\n\n\n\n<p>The 21.5-inch iMac I tested was 17 percent faster than the 24-inch iMac in Metal performance. This model iMac is no longer available, and it was priced at $1,849 when it was for sale, $150 more than the 24-inch iMac in this review.</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-tomb-raider-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/06/24-inch-imac-civ-vi-1-4.png?w=1200\" /></figure><p>IDG</p></div>\n\n\n\n<p>I ran two videogame benchmarks on the 24-inch iMac to see how well it performs. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/rise-of-the-tomb-raider/id1108032375&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\"><em>Rise of the Tomb Raider</em></a> and <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/civilization-vi/id1123795278&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\"><em>Civilization VI</em></a> both have benchmarks, but these games are not native for the M1, so they are running using the <a href=\"https://www.macworld.com/article/3563771/apple-details-an-impressive-aggressive-transition-to-macs-with-apple-silicon.html#toc-3\">Rosetta2 translation tool</a>.</p>\n\n\n\n<p>If you find the GPU performance of the 24-inch iMac disappointing (I don’t), keep in mind that this is just the start of the iMac revamp. Apple will replace the 27-inch iMac at some point, maybe even this year. Users of the 27-inch iMac tend to be more pro-oriented, so it follows that the next big iMac (possibly 30-inches) will have a CPU and GPU that meets—and maybe even exceeds—the demands of those users. It could be a seriously buffed-out iMac, one that has a lot more muscle than the 24-inch model. And Apple purposely makes it this way to create clear delineations between the 24-inch iMac and its bigger sibling.</p>\n\n\n\n<h2>A massively improved camera</h2>\n\n\n\n<p>The FaceTime camera was an overlooked feature of the iMac. It switched from an <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/ISight&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">iSight</a> camera to a FaceTime HD camera in 2011, but then it stayed that way for a long time. Apple actually introduced a 1080p FaceTime HD camera in the iMac Pro in 2017, but that camera didn’t make its way into the 27-inch iMac until 2020. With the 24-inch iMac, Apple made more image quality improvements with the 1080p FaceTime HD camera, which now has the backing of the M1’s image signal processor to create better-looking video.</p>\n\n\n\n<p>To check the image quality of the camera, I used <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/guide/photo-booth/welcome/mac&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Photo Booth</a> on the 21.5-, 24-, and 27-inch iMacs and snapped a picture of myself. I also decided to give the cameras a challenge: I set up each iMac in the Macworld studio so that the window was behind me during mid-morning, while the sun was shining, creating an intense backlight. I wanted to see how well each camera handled the harsh situation. (This setup is actually the same as my workspace setup at the office.)</p>\n\n\n\n<p>Here are samples. Left: 24-inch iMac with a 1080p FaceTime HD and M1 ISP support. Upper right:  27-inch iMac with a 1080p FaceTime HD. Lower right: 21.5-inch iMac with a FaceTime HD camera.</p>\n\n\n\n<div><div><div><div><figure><img src=\"https://i2.wp.com/b2c-contenthub.com/wp-content/uploads/2021/05/facetime-hd-m1-24-inch-imac.jpg?ssl=1\" /></figure></div><div><figure><img src=\"https://i2.wp.com/b2c-contenthub.com/wp-content/uploads/2021/05/facetime-hd-27-inch-imac.jpg?ssl=1\" /></figure><figure><img src=\"https://i1.wp.com/b2c-contenthub.com/wp-content/uploads/2021/05/facetime-21-inch-imac.jpg?ssl=1\" /></figure></div></div></div></div>\n\n\n\n<p>The 24-inch iMac’s camera produces the best clarity of my face, though the background is washed out—a compromise that’s acceptable considering the harsh setting. The 27-inch iMac’s 1080p FaceTime HD camera is good, but it looks like a shadow is cast across my face. The 21.5-inch iMac’s FaceTime HD camera creates an image that would be great if I want to hide my identity—all I need is a voice modulator.</p>\n\n\n\n<p>The 24-inch iMac doesn’t have Face ID, and if Apple didn’t include it now for the consumer-level model, it probably won’t add it soon, if ever. Face ID could be another one of those features that is used in pro-level products, so maybe we’ll see it in the bigger iMac, along with the faster SoC and maybe a nano-texture glass option. </p>\n\n\n\n<h2>A Touch of convenience</h2>\n\n\n\n<p>The 24-inch iMac is the first desktop Mac to finally get biometric security authentication with Touch ID. Apple bundles the iMac with Magic Keyboards that have a Touch ID button located on the upper right corner, where the eject button used to be. </p>\n\n\n\n<p>Touch ID works just as well as it does on Apple’s MacBooks. When you need to enter a password, a prompt appears, letting you know that you need to press the Touch ID button. Once you touch it with a fingerprint you have on record, you are given access. It’s not as quick and easy as Face ID, but it’s a lot better than having to look up a password and then type it.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/05/Apple-iMac-M1-24inch_13.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Touch ID is available on the $1,499 and $1,699 iMac models. The Magic Mouse 2 that comes with the iMac still requires you to flip it over to change it.</figcaption></figure><a href=\"https://www.macworld.co.uk\" target=\"_blank\">Dominik Tomaszewski/Macworld U.K.</a></div>\n\n\n\n<p>As of this review, the Touch ID Magic Keyboard is not sold separately by Apple. Apple representatives have said that the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/04/26/apple-imac-interview-upgrade-relay-fm/&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\">Touch ID Magic Keyboard will work on any M1 Mac</a>, since the M1 contains the secure enclave that Touch ID requires. Maybe we’ll see the keyboard become available separately when Apple introduces the <a href=\"https://www.macworld.com/article/347466/the-next-mac-mini-slimmer-speedier-and-slicker.html\">rumored Mac mini</a> with a high-end M-series SoC. </p>\n\n\n\n<h2>Should you buy a 24-inch iMac?</h2>\n\n\n\n<p>The 24-inch iMac completes Apple’s consumer Mac lineup and sits alongside the Mac $699 and $899 M1 Mac mini models in the desktop category. Performance is the same across all of Apple’s M1 Macs, so picking a desktop Mac comes down to the features you need. The 24-inch iMac is deal for anyone who needs a complete computer setup, and/or likes a clutter-free setup. A Mac mini seems like a better deal, but if you add the prices for a display such as the $700 <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/HMUA2VC/A/lg-ultrafine-4k-display&amp;subid1=1-1-347534-0-0-0\">LG UltraFine 4K Display</a>, a $99 <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MLA22LL/A/magic-keyboard-us-english&amp;subid1=1-1-347534-0-0-0\">Magic Keyboard</a> (without Touch ID), and a $79 <a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/product/MLA02LL/A/magic-mouse-2-silver&amp;subid1=1-1-347534-0-0-0\">Magic Mouse 2</a>, you’ll pay $1,577 for the Mac mini with a 256GB SSD, and $1,777 for a Mac mini equipped with a 512GB SSD. You end up paying more than you would for an iMac.</p>\n\n\n\n<p>If you have an older 21.5-inch iMac and are looking to upgrade, the 24-inch model is a compelling product. You not only get a speed improvement over the Intel-based iMac, you get to leave behind old technology for exciting new tech in Apple’s System on a Chip—all dressed up in stunning colors (or plain ol’ silver, if you wish).</p>\n\n\n\n<p>And if you’re trying to decide which 24-inch iMac you should buy, we have a separate article that can <a href=\"https://www.macworld.com/article/344032/apple-24-inch-imac-m1-specs-display-storage-ports-ram-ethernet-colors-keyboard-price.html\">help you decide between the $1,299, $1,499, and $1,699 24-inch iMacs</a>.</p>\n\n\n\n<p>If you want an iMac that offers more power, you can invest in a 27-inch Intel-based iMac, but if you can, wait at least until <a href=\"https://www.macworld.com/article/342028/wwdc-2021-how-to-watch-ios-15-macos-12-macbook-pro-june-7.html\">Apple’s Worldwide Developers Conference on June 7</a>. At WWDC, Apple will probably start to reveal its “pro” level Macs that use more powerful versions of its SoC. A replacement for the <a href=\"https://www.macworld.com/article/347553/24-inch-imac-pro-m1-processor-mini-led-xdr-display-ram-thunderbolt-ports.html\">27-inch iMac could be revealed</a> at that time—and if it’s not revealed then, it’ll probably be revealed later this year.</p>\n\n\n\n<p>We’ve been waiting a long time for an all-new iMac. While the Intel-based, silver-and-black design worked well for a long time, the iMac needed a change. That change results in new excitement for the Mac and a computer that can stand proudly in the spotlight as an Apple icon.</p>\n\n\n\n\t\t<div>\n\t\t\t<div>\n\t\t\t\t<h4>\n\t\t\t\t\t\t\t\t\t</h4>\n\t\t\t</div>\n\n\t\t\t<div>\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<h3>24-inch iMac (2021)</h3>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/04/m1-imac-color-lineup-hello.jpg?quality=50&amp;strip=all\" />\n\t\t\t\t\t\t</div>\n\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t<img src=\"https://www.macworld.com/wp-content/uploads/2021/02/MW-Ed-Choice-90x90-1.png\" />\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div></div>\n\t\t\t\t\t\t\t\t\t\t</div><a href=\"https://www.macworld.com/article/347534/24-inch-imac-review-apple-design-display-colors-storage-upgradability-price.html\" target=\"_blank\">Read our review</a>\t\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t\t\t</div>\n\t\t\t\t\n\t\t\t\t<div>\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tMSRP:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t$1,299 | $1,499 | $1,699\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t<div>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\tBest Prices Today:\n\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t<a href=\"https://apple.sjv.io/c/321564/435031/7613?u=https://www.apple.com/shop/buy-mac/imac&amp;subid1=1-1-347534-0-0-0\" target=\"_blank\">US$1299 at Apple</a> | <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.costco.com/new-imac-24%22-with-retina-4.5k-display---apple-m1-chip-8-core-cpu%2c-8-core-gpu---8gb-memory---256gb-ssd.product.100694236.html&amp;xcust=1-1-347534-0-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">US$1450 at Costco</a> | <a href=\"https://www.amazon.com/dp/B0932G65T7?tag=macworld05-20&amp;linkCode=ogi&amp;th=1&amp;psc=1&amp;asc_refurl=https://www.macworld.com/feed\" target=\"_blank\">$1,499.00 at Amazon</a>\t\t\t\t\t\t\t</span>\n\t\t\t\t\t\t</div>\n\t\t\t\t\t\t\t\t\t</div>\n\t\t\t</div>\n\t\t</div>\n\n\t\t</div>","author":"Roman Loyola","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"98237c7ffd1be075d6117a8f031b5453d043fbd8b477a4868cd976b2d28087d6","category":"Apple"}