{"title":"App Privacy Study Looks at Most 'Invasive' Apps Collecting User Data","link":"https://www.macrumors.com/2021/03/16/app-privacy-study-most-invasive-apps/","date":1615917732000,"content":"With App Privacy labels now available for many of the top apps in the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, pCloud earlier this month <a href=\"https://blog.pcloud.com/invasive-apps/\">took a look</a> at the most \"invasive\" apps that collect the most data from users.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/12/appstoreprivacy-feature.jpg\" alt=\"\" width=\"2205\" height=\"1240\" class=\"aligncenter size-full wp-image-774154\" />\r\n<br/>\r\nIt will come as no surprise to many that Instagram and Facebook share the most data with third-party advertisers, collecting info on purchases, location, contact details, user content, search history, browsing history, and more.\r\n<br/>\r\n\r\n<br/>\r\nInstagram collects 79 percent of personal data, while Facebook collects 57 percent. LinkedIn and Uber Eats were also serious offenders, collecting 50 percent of data. This study was done prior to when Google shared App Privacy labels for its Google Search and Chrome apps, but YouTube and YouTube Music were found to be collecting 43 percent of personal data to share with third parties.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/pcloud-instrusive-apps-the-apps-sharing-your-data-with-third-parties.png\" alt=\"\" width=\"700\" height=\"1270\" class=\"aligncenter size-full wp-image-789213\" />\r\n<br/>\r\neBay, TikTok, Duolingo, Deliveroo, and Trainline were all in the top 10 apps for data collection, with Reddit, Snapchat, Spotify, Pandora, ESPN, and CNN making the top 20.<blockquote>Every time you search for a video on YouTube, 42% of your personal data is sent elsewhere. This data goes on to inform the types of adverts you'll see before and during videos, as well as being sold to brands who'll target you on other social media platforms. Instagram shares 79% of your data including browsing history and personal information with others online.\r\n<br/>\r\n\r\n<br/>\r\nYouTube isn't the worst when it comes to selling your information on. That award goes to Instagram, which shares a staggering 79% of your data with other companies. Including everything from purchasing information, personal data, and browsing history. No wonder there's so much promoted content on your feed.\r\n<br/>\r\n\r\n<br/>\r\nWith over 1 billion monthly active users it's worrying that Instagram is a hub for sharing such a high amount of its unknowing users' data.</blockquote>Apps that collect data for third-party use do so for targeting purposes, sharing the info across different apps and websites. Apps also collect data to market their own products, with Facebook and Instagram again collecting the most data in this category.\r\n<br/>\r\n\r\n<br/>\r\nOn the other end of the spectrum, apps that don't collect much data include Signal, Clubhouse, Netflix, Shazam, Etsy, Skype, and Telegram.\r\n<br/>\r\n\r\n<br/>\r\nStarting with the launch of iOS 14.5, Apple will begin requiring apps that access a user's advertising identifier for cross-app and website tracking to get express permission before using it, which may help cut down on some of the third-party data sharing.\r\n<br/>\r\n\r\n<br/>\r\nPrior to downloading an app, it's always worth checking out the App Privacy label to see just what data is being collected, primarily in \"Data Used to Track You\" and \"Data Linked to You\" sections, which include data collected for third-party advertising and for the developer's own advertising or marketing.<div class=\"linkback\">Tag: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/03/16/app-privacy-study-most-invasive-apps/\">App Privacy Study Looks at Most &#039;Invasive&#039; Apps Collecting User Data</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/app-privacy-study-looks-at-most-invasive-apps-collecting-user-data.2288541/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GJZ1cH1GoI4:phv7Kkru2_U:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=GJZ1cH1GoI4:phv7Kkru2_U:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/GJZ1cH1GoI4\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"982463cd21f9ec3bc9ef2f671ea2d80ce587c9406e509300b7cb7f85790b1001","category":"Apple"}