{"title":"Netflix IT exec forced employees to use products from vendors that bribed him","link":"https://arstechnica.com/?p=1762444","date":1620161871000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Netflix's former vice president of IT operations was convicted of taking bribes from technology vendors in exchange for awarding them contracts with Netflix, the US Department of Justice <a href=\"https://www.justice.gov/usao-ndca/pr/former-netflix-executive-convicted-receiving-bribes-and-kickbacks-companies-contracting\">announced Friday</a>. The former Netflix VP's illegal scheme forced colleagues to use a variety of products, including one that suffered from \"severe\" performance problems and another that Netflix employees objected to because they preferred a different product the company was already paying for, the DOJ said.</p>\n<p>Michael Kail, the ex-Netflix executive, was convicted by a federal jury of wire fraud, mail fraud, and money laundering. He used his position at Netflix to approve contracts for vendors that gave him bribes and kickbacks, the DOJ announcement said:</p>\n<blockquote><p>As Netflix's Vice President of IT Operations, Kail approved the contracts to purchase IT products and services from smaller outside vendor companies and authorized their payments. The evidence demonstrated that Kail accepted bribes in 'kickbacks' from nine tech companies providing products or services to Netflix. In exchange, Kail approved millions of dollars in contracts for goods and services to be provided to Netflix. Kail ultimately received over $500,000 and stock options from these outside companies. He used his kickback payments to pay personal expenses and to buy a home in Los Gatos, California, in the name of a family trust.</p></blockquote>\n<p>\"Michael Kail wielded immense power to approve valuable Netflix contracts with small tech vendors, and he rigged that process to unlock a stream of cash and stock kickbacks to himself,\" acting US Attorney Stephanie Hinds said.</p></div><p><a href=\"https://arstechnica.com/?p=1762444#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1762444&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"982575b64d66c68f891c92d2cfebdf2cdbfe6bae97549969e600271c70805517","category":"Tech"}