{"title":"Citrullinated Histone H3, a Marker for Neutrophil Extracellular Traps, Is Associated with Poor Prognosis in Cutaneous Squamous Cell Carcinoma Developing in Patients with Recessive Dystrophic Epidermolysis Bullosa","link":"https://www.preprints.org/manuscript/202405.1877/v1","date":1716958626000,"content":"Recessive dystrophic epidermolysis bullosa (RDEB) is a rare severe hereditary skin disease characterized by skin and mucosa fragility, resulting in blister formation. The most severe complication in RDEB patients is the development of cutaneous squamous cell carcinoma (SCC) leading to premature death. Multiple evidences suggest a permissive tumor micro-environment (TME) as driver of SCC development in RDEB patients. In a cohort of RDEB patients, we characterized the immune profiles of RDEB-SCCs and compared them with clinical, histopathological, and prognostic features. RDEB-SCCs were subdivided into 4 groups based on their occurrence (first onset or recurrences) and grading according to their clinical-histopathological parameters of aggressiveness. Thirty-eight SCCs from 20 RDEB patients were analysed. Five RDEB patients experienced an unfavorable course af-ter the diagnosis of the first SCC, with early recurrence or metastasis, whereas 15 pa-tients developed multiple SCCs without metastasis. High-risk primary RDEB-SCCs showed a higher neutrophil-to-lymphocyte ratio in the tumor microenvironment, and an increased proportion of neutrophil extracellular traps (NET). Additionally, citrullinated histone H3, a marker of NETs, was increased in the serum of RDEB patients with high-risk primary SCC, suggesting that this modified form of histone H3 may serve as a potential blood marker of unfavorable prognosis in RDEB-SCCs.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9829d1156ea561551e1fd235d8fc358fcadc3936597e2a44503301624d43682b","category":"Interdisciplinary"}