{"title":"Continuous Power Management of Decentralized DC Microgrid Based on Transitional Operation Modes under System Uncertainty and Sensor Failure","link":"https://www.preprints.org/manuscript/202404.0139/v1","date":1712035146000,"content":"In this paper, a continuous power management for a decentralized DC microgrid (DCMG) is proposed to achieve voltage regulation and power balance even under system uncertainty and voltage sensor failure. The DCMG system achieves a continuous power management through only the primary controller to reduce the computational burden of each power agent. To enhance the reliability and resilience of the DCMG system under voltage sensor failure, a DC bus voltage (DCV) sensor fault detection algorithm is proposed. In this algorithm, the DCV sensor failure is detected by comparing the measured DCV with the estimated DCV. When the power agent identifies the DCV sensor failure, it changes the operation properly according to the proposed control mode decision algorithm to maintain the stability of the DCMG system. When uncertain conditions such as the power variation of the distributed generations, sudden grid disconnection, DCV sensor failure, electricity price change, and critical battery status occur, the DCMG system is changed to transitional operation modes. These transitional operation modes are employed to transmit the power agent information to other agents without digital communication links (DCLs) and to accomplish power sharing even under such uncertain conditions. In the transitional operation modes of the DCMG system, the DCV levels are temporarily shifted to an appropriate level, enabling each power agent to detect the uncertainty conditions, and subsequently to determine its operation modes based on the DCV levels. Simulation and experimental results under different test conditions confirm the reliability and effectiveness of the proposed control scheme.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9830e02c917c4cf8601f44a2b56c744702ddb15c599d4bae5e8dcd59f4c95181","category":"Interdisciplinary"}