{"title":"An OLED iPad Pro will be worth every extra penny–if it delivers this one feature","link":"https://www.macworld.com/article/2203369/ipad-pro-too-expensive.html","date":1705491000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Look, I don’t know if that <a href=\"https://www.macworld.com/article/2196113/massively-more-expensive-new-ipad-pro.html\">recent report</a> about the new OLED iPad Pro costing between $1,500 and $2,000 is accurate. It’s always tricky to predict product prices since they’re decided deep inside Apple Park, not off on the supply chain from which most new-product rumors emanate.</p>\n\n\n\n<p>But I do know this: Adding OLED to the iPad Pro is only going to make it more expensive. The <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2203369-1-0-0&amp;u=https://www.apple.com/shop/buy-ipad/ipad-pro/\">current iPad Pro models</a> start at $799 and $1,099 and go up from there. (A 2TB 12.9-inch M2 iPad Pro with cellular, an Apple Pencil, and a Magic Keyboard will run you nearly $2,900!) I would be surprised, frankly, if any OLED iPad Pro starts at anything less than $999, and even a price that low seems unlikely.</p>\n\n\n\n<p>We’re talking prices getting pretty comparable to those of Mac laptops, and that’s without factoring in the accessories. While dedicated iPad Pro users might not flinch at prices like that–or, more likely, will flinch and then roll their eyes and then pull out their wallets anyway–it’s asking a lot of other potential iPad buyers.</p>\n\n\n\n<p>Is Apple risking the future of the iPad Pro by making it too expensive? Not necessarily. In fact, this might be one in a series of moves that will set up the iPad for future success at both the high-end and midrange of Apple’s product line.</p>\n\n\n\n<h2>Air for all</h2>\n\n\n\n<p>Throughout the years, so many of Apple’s product strategies have used the “Good, Better, Best” paradigm. This is classic marketing stuff. You break your product line into three different segments, with a low-priced product designed for people on tight budgets… but also to attract interest from other potential buyers. “Oh, the iPad starts at $329!” Many potential buyers who engage will discover they don’t really want the low-priced product but would prefer something a little bit nicer. This is where a large number of sales live: in the lukewarm world of “Better.”</p>\n\n\n\n<p>And then there’s the high end. This is for the very best, the most cutting edge, the finest product with no limits–including on price. These are generally the products Apple frequently labels as “Pro.” Apple spares no expense, and neither do the buyers. It’s a nice, profitable place to be–the margins are great, even if sales volumes are not.</p>\n\n\n\n<p>For a few years, the iPad has been crawling toward an endgame that plays directly into the Good, Better, Best strategy. This is why the iPad Air returned to the lineup in 2019 and, over the last few years, has improved to the point where it’s basically an iPad Pro in all but a few key ways. It’s so close to the iPad Pro, in fact, that many observers have wondered if Apple’s not adding more confusion to the iPad line by offering two models that are so similar.</p>\n\n\n\n<p>A lot of that confusion goes away if Apple injects the iPad Pro with new features and hoists the price into the stratosphere. That move might frustrate a lot of people… but if the iPad Air is updated to provide the features that most iPad users want, and at a reasonable price, it won’t matter too much. Clearly, the iPad Air is poised to become the default iPad for most people, the meat in the Good-Better-Best sandwich.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPad Air 2021\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2022/10/apple_ipad_air_5_review_5.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>An OLED iPad Pro with a higher price tag helps separate it from the iPad Air.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<p>If the rumors are true, Apple will update the iPad Air–a bargain at $599!–to come in two sizes, one that matches the current 10.9/11-inch size and a <a href=\"https://www.macworld.com/article/2168151/12-inch-ipad-air-panel-shipments-2024-launch.html\">new 12.9-inch model</a> that’s a match for the current 12.9-inch iPad Pro in size. Adding that larger model allows the lower-cost iPad Air to fill the needs of users who might want a larger iPad–but don’t want to pay the higher prices of the iPad Pro. It’s a good move, and it also has the advantage of meaning that the iPad Air will be able to use the same Smart Keyboard accessories Apple introduced in 2020.</p>\n\n\n\n<h2>More Magic</h2>\n\n\n\n<p>But if the iPad Air, by all accounts an excellent iPad at an excellent value, is available for less than an iPad Pro and in both familiar sizes, why would <em>anyone</em> spend a lot more for an iPad Pro?</p>\n\n\n\n<p>This is the question of the moment. Apple is going to need to give its high-end, deep-pocketed users a reason to spend so much money on an iPad. As someone who has heavily used the iPad Pro since the very first model was introduced, I do not see the addition of an OLED screen and an M3 processor as doing the trick. There needs to be more.</p>\n\n\n\n<p>If rumors are true, both models are going to get a little bigger–which will break compatibility with the 2020 Magic Keyboard. That’s okay because it sounds like <a href=\"https://www.macworld.com/article/2046116/ipad-pro-revamp-magic-keyboard-pencil.html\">a new Magic Keyboard model is coming</a>–and this is great news. The existing model is expensive–$349 for the 12.9-inch one!–and still lacks a function row. There’s room for improvement, is what I’m saying.</p>\n\n\n\n<p>And I’m excited by the suggestion that Apple may have redesigned the entire thing to be more laptop-like, both in its materials and in the way it attaches to the iPad. Until the Magic Keyboard debuted, I used iPad keyboards that were clad in aluminum and attached to the iPad at the edge with a hinge, like a laptop. It was perfect ergonomically–and the Magic Keyboard, as clever as it is, isn’t as good. A proper Apple take on a laptop-like iPad experience would be awesome and will make people who make their living by typing on a keyboard take notice.</p>\n\n\n\n<p>Since the iPad’s all about its accessories, let’s also throw in a new Apple Pencil with more “pro” features that aren’t available on lesser models, and artists and other people who love driving their iPad with a pencil in hand will also have a reason to pungle up the dough for an iPad Pro.</p>\n\n\n\n<p>But even with OLED, and an M3, and a new keyboard, and a new pencil… will that be enough? Do I, personally, want to spend more than $2,000 on a new iPad Pro setup when (truth be told) my two-generations-back M1 model still handles everything I can throw at it?</p>\n\n\n\n<h2>Back to the Mac</h2>\n\n\n\n<p>I’m not entirely convinced. This is why I’m going to propose that the new iPad Pro could add one other feature that would completely convert me, that would make me buy an iPad Pro the moment it went on sale, even at a much higher price. (Hold on.)</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/macos-ios-app.png\" alt=\"Mac on iPad\" width=\"174\" height=\"208\" /><figcaption> Imagine.</figcaption></figure><p>Jason Snell</p></div>\n\n\n\n<p>Now that today’s iMacs and iPads are essentially the same in terms of their internal hardware, maybe it’s time for Apple to do the unthinkable and allow the iPad Pro (and <em>only</em> the iPad Pro) to run macOS in a virtual machine. How much more useful and valuable would an iPad Pro be if it could not only run in touchscreen mode, driven by fingers or Apple Pencil, but if it could be attached to a keyboard and trackpad and used like a Mac laptop?</p>\n\n\n\n<p>The hardware is capable. The virtualization would allow macOS to act like an iPad app. It wouldn’t need to support the touchscreen since a keyboard and trackpad would be required. And security-wise, Apple could lock the “Mac app” down as much as it needed to… but also, wouldn’t the extra complication be worth it for a product that’s only of interest to pro-level users? There are some things I just can’t do on my iPad Pro because of limitations in iPad software. Adding optional support for the Mac would solve that problem in one swift stroke.</p>\n\n\n\n<p>I’m not saying it will happen. I’m not saying even that it <em>might</em> happen. I’m just saying that among all the things that are even technically feasible, it’s the single feature that I can think of that would make the iPad Pro immediately worth whatever its much higher price tag might be.</p>\n\n\n\n<p>We’ll see what Apple thinks, probably soon. I’m crossing my iPad-loving fingers.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"984155cc2def559f983a814bc9beb37181d6dda2ad36d5e1ff5d13e1cb2a5e9a","category":"Apple"}