{"title":"The First Two Years of COVID-19 Hospitalization Characteristics and Costs: Results from the National Discharge Registry","link":"https://www.preprints.org/manuscript/202403.0676/v1","date":1710228048000,"content":"ABSTRACT\nBackground: To date, the COVID-19 pandemic has been the foremost health concern for humankind in the new millennia. This paper aims to describe the related hospitalizations in Italy during the first two years of the health emergency.\nDesign and methods: This is a retrospective, population-based study of Italian hospitalizations for patients diagnosed with COVID-19 during the 2020-2021 period, extracted from the National Hospital Discharge Registry. The outcome variables considered include hospital admissions, costs, and length of stay, among other hospitalization-level variables. Costs were estimated through the charges associated with the Diagnosis-Related Group and Major Diagnostic Categories coding system, plus an additional cost attributed to COVID-19 admissions. To these charges was added an extra cost defined by the ministry of health.\nResults: In Italy, there were 357,354 hospitalizations for COVID-19 attributed to 298,856 patients in 2020 and 399,043 hospitalizations for COVID-19 attributed to 333,447 patients in 2021. COVID-19 patients faced a transfer rate thrice that of other patients. Hospitalizations were concentrated predominantly in the northern regions, particularly in the first year. Hospitalization rates varied by age in a sine wave pattern, peaking in the youngest and oldest age groups, with mortality rates escalating with age— tending to remain below 3% for those under 44 but surging to 40% in individuals over 75.\nThe financial impact of COVID-19 hospitalizations was substantial, with total costs reaching €3.97 billion in 2020 and €4.99 billion in 2021. Costs per admission and per day also rose, from €11,112 and €807 in 2020 to €12,503 and €844 in 2021, respectively. Excluding the added financial burden of COVID-19, costs would have been notably lower. Hospitalizations involving continuous invasive mechanical ventilation were particularly costly (about 24.000 euros x admission), reflecting the significant resources required for these treatments.\n\nConclusion: Implementing a protective pad around the entire health system that leverages networks of family doctors and nurses, connected in real time to the entire health system, can be crucial. Such a network, tasked with monitoring the local epidemiological situation, protecting vulnerable individuals also through telehealth visits, and establishing a triage system for infections in the initial phase, may effectively help in managing virus spread and protecting hospitals from unpredictable waves of admission demand. Strengthening primary health care could be a decisive factor for the future and enhance the system's resilience in facing new challenges.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9846856b31a4cb6a5b7d316c15716d4224ada99cc559f891ca7725265138bee3","category":"Interdisciplinary"}