{"title":"Genomic Characterization of Partial Tandem Duplication Involving the KMT2A Gene in Adult Acute Myeloid Leukemia","link":"https://www.preprints.org/manuscript/202403.0904/v1","date":1710721578000,"content":"Background. Gene rearrangements affecting KMT2A are frequent in acute myeloid leukemia (AML) and are often associated with a poor prognosis. KMT2A gene fusions are often detected by chromosome banding analysis and confirmed by fluorescence in-situ hybridization. However, small intragenic insertions, termed KMT2A partial tandem duplication (PTD), are particularly challenging to detect using standard molecular and cytogenetic approaches. Methods. We have validated the use of a custom hybrid capture based next-generation sequencing (NGS) panel for comprehensive profiling of AML patients seen at our institution. This NGS panel targets the entire consensus coding DNA sequence of KMT2A; to deduce the presence of a PTD we used the relative ratio of KMT2A exons coverage. We sought to corroborate the KMT2A-PTD NGS results using (1) multiplex-ligation probe amplification (MLPA) and (2) optical genome mapping (OGM). Results. We analyzed 932 AML cases and identified 41 individuals harboring a KMT2A-PTD. MLPA, NGS and OGM confirmed the presence of a KMT2A-PTD in 22 of the cases analyzed where orthogonal testing was possible. Two false positive PTD calls by NGS could be explained by the presence of cryptic structural variants impacting KMT2A and interfering with PTD analysis. OGM revealed the nature of these previously undetected gene rearrangements in KMT2A, while MLPA yielded in-conclusive results. MLPA analysis for KMT2A-PTD is limited to exon 4, whereas NGS and OGM resolved KMT2A-PTD sizes and copy number levels. Conclusion. KMT2A-PTDs are complex gene rearrangements that cannot be fully ascertained using a single genomic platform. MLPA, NGS panels and OGM are complementary technologies applied in standard of care testing for AML patients. MLPA and NGS panels are designed for targeted copy number analysis; however, our results show that integration of concurrent genomic alterations is needed for accurate KMT2A-PTD identification. Unbalanced chromosomal rearrangements overlapping with KMT2A can interfere with the diagnostic sensitivity and specificity of copy number based KMT2A-PTD detection methodologies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9847f0ef90d0c921049ff409b64039d7f1a5407951aa71cfb304435ca31b4f00","category":"Interdisciplinary"}