{"title":"PSI-14 Serum energy metabolite and mineral concentrations in a contemporary flock of Western white-faced ewes during the periparturient period","link":"https://academic.oup.com/jas/article/102/Supplement_3/484/7757672?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Ewe prolificacy and litter weight has increased in Western U.S. sheep flocks potentially leading to greater prevalence of metabolic dysfunction around the periparturient period. Thus, the objective of this research was to quantify serum energy metabolites and minerals in a flock of Rambouillet ewes. A total of 56 ewes [2 to 5 yr; 92.4 ± 0.56 kg body weight (BW] with an average litter size (NLB) of 1.84 ± 0.08 (single n = 15, 27%; twin n = 35, 62%; triplet n = 6, 11%) were evaluated. Blood was collected on d -21, -14, -7, 0, 7, 14, 21, 28 relative to parturition. Serum concentrations of glucose, β-hydroxybutyrate (BHBA), non-esterified fatty acids (NEFA), and minerals were quantified. Data were analyzed as repeated measures with fixed effects of ewe age (2 to 5 yr), sampling timepoint, NLB (1 or ≥ 2), and their interactions. There was a NLB x sampling timepoint interaction for serum Cl where multiple bearing ewes had greater concentration at d -14 (<span>P</span> = 0.03) and single bearing ewes had greater concentration on d -7 (<span>P</span> = 0.01; Figure 1). The NLB x ewe age interaction was significant for serum Fe where concentrations were greater for multiple than single bearing 4-yr-old ewes but greater for single than multiple bearing 5-yr-old ewes (Figure 1; <span>P</span> ≤ 0.05). As main effects (Table 1), 2-yr-old ewes had greater serum glucose than 4-yr-old ewes (<span>P</span> = 0.04), and 4-yr-old ewes had greater serum Ca than 3-yr-old ewes (<span>P</span> = 0.02). Multiple bearing ewes had had greater BHBA and NEFA (<span>P</span> ≤ 0.001) than single bearing ewes. Proportions of ewes within normal concentrations of key serum elements were glucose (single: 100%, multiple: 95%); BHBA (single: 100%, multiple: 49%); NEFA (single: 93%, multiple: 37%); and Ca (single: 100%, multiple: 100%). Serum BHBA and NEFA peaked at d 14, while serum K, Na, Co, Mn, and Mo peaked at d -21. Serum Se was least at d -21 and peaked at d 0. Pearson correlation coefficients were estimated between average serum metabolite concentrations before parturition (PRE; d -21, -14, -7) and after parturition (POST; d 7, 14, 21, 28; Table 2). A moderate positive correlation between PRE-Glucose and POST-Glucose (<span>P</span> = 0.03) and strong negative correlations between PRE-Glucose and PRE-BHBA and PRE-Glucose and PRE-NEFA were observed (<span>P</span> ≤ 0.001). Additionally, BHBA and NEFA were positively correlated within the PRE and POST timepoints (<span>P</span> &lt; 0.001). Ewe age and NLB drive metabolic demands during different timepoints in the periparturient period. Litter size does contribute to increased BHBA and NEFA, increasing the risk for pregnancy toxemia. Increased nutritional intervention of prolific, semi-extensively managed Western white-faced ewes should be considered to reduce the risk of metabolic stress.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"984c5ba424e2ecce0ffdde6d6a856dc6b5a48cc157e46a792a60e076d80989d7","category":"Environment"}