{"title":"Bio‐functional and prebiotics properties of products based on whole grain sorghum fermented with lactic acid bacteria","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13189?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Products fermented with lactic acid bacteria based on whole grain flours of red or white sorghum (<i>Sorghum bicolor</i> (L.) Moench) added with malted sorghum flour, or with skim milk (SM) were developed. Composition, protein amino acid profile, total acidity, pH, prebiotic potential, and bio-functional properties after simulation of gastrointestinal digestion were evaluated.</p>\n<h2>RESULTS</h2>\n<p>In all cases, a pH of 4.5 was obtained in approximately 4.5 h. The products added with SM presented higher acidity. Products made only with sorghum presented higher total dietary fiber, but lower protein content than products with added SM, the last ones having higher lysine content. All products exhibited prebiotic potential, white sorghum being a better ingredient to promote the growth of probiotic bacteria. The addition of malted sorghum or SM significantly increased the bio-functional properties of the products: the sorghum fermented products added with SM presented the highest antioxidant (ABTS<sup>•+</sup> inhibition, 4.7 ± 0.2 mM Trolox), antihypertensive (Angiotensin converting enzyme-I inhibition, 57.3 ± 0.5%) and antidiabetogenic (dipeptidyl-peptidase IV inhibition, 31.3 ± 2.1%) activities, while the products added with malted sorghum presented the highest antioxidant (reducing power, 1.6 ± 0.1 mg ascorbic acid equivalent/mL) and antidiabetogenic (α-amylase inhibition, 38.1 ± 0.9%) activities.</p>\n<h2>CONCLUSION</h2>\n<p>The fermented whole grain sorghum-based products could be commercially exploited by the food industry to expand the offer of the three high-growth markets: gluten-free products, plant-based products (products without SM), and functional foods. © 2023 Society of Chemical Industry.</p>","author":"Antonela G Garzón, \nFlávio Fonseca Veras, \nAdriano Brandelli, \nSilvina R Drago","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9850f6a1bab7b1b1ceb750c789f93f01dd8228e686ea8108cc7cc10c0555f60c","category":"Environment"}