{"title":"Green Gino Mäder is helping keep the planet alive","link":"https://www.cyclist.co.uk/news/10057/green-gino-m-der-is-helping-keep-the-planet-alive","date":1630937091000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>6 Sep 2021</span></div>    </div></div><p>\nThe Swiss rider pledged to donate €1 every rider he beat at the Vuelta a Espana raising €3159</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/cauldphoto-vuelta-stage21-4904.jpg?itok=QcLbGK8w\" />  </div>\n<div>\n      <p> ‘Whatever helps to keep the planet alive.’ Usually the gratification from placing above a rider is enough of a prize on its own. But Bahrain Victorious's Gino Mäder took it one step further at the <a href=\"/tags/vuelta-a-espana\">Vuelta a España</a>, pledging €1 Euro for every rider he beat on a stage towards an environmental organisation.</p>\n<p>Mäder placed 31st on the opening stage, finishing ahead of 153 riders to kick off his growing tally. On Stage 9 from Puerto Lumbreras to the summit of the Alto de Velefique, he kicked ahead of Egan Bernal to cross the line in 7th.</p>\n<p>As the stage numbers rose, so did he on general classification. Eighth on Stage 17. Seventh on Stage 18. Ninth on Stage 20. He ultimately finished 5th overall, 11’33” behind red jersey winner Primož Roglič. He further managed to top the best young rider classification in the process too, 1’54” ahead of Bernal to take the white jersey.</p>\n<p>The final day’s time trial went in favour of Roglič unsurprisingly, but Mäder managed to beat 111 other riders to arrive at a grand total of €3159. He finished his thread by acknowledging his position on general classification saying, ‘Twitter, 10 for everyone in GC?’</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/913/tour-of-britain-route-riders-live-tv-guide-all-you-need-to-know\">Tour of Britain 2021: Route, teams and all you need to know</a></div>      <div><a href=\"/news/10017/flanders-uci-road-cycling-world-championships-2021-key-information\">Flanders UCI Road Cycling World Championships 2021: Key information</a></div>      <div><a href=\"/in-depth/10060/human-rights-campaigner-calls-on-cycling-industry-to-help-female-riders-fleeing\">Human rights campaigner calls on cycling industry to help female riders fleeing Afghanistan</a></div>    </div></div><p> </p>\n<p>It’s not yet been revealed which organisation Mäder will be donating to. <a href=\"https://twitter.com/maedergino/status/1433823574981238788?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1434606527890038785%7Ctwgr%5E%7Ctwcon%5Es2_&amp;ref_url=https%3A%2F%2Fpublish.twitter.com%2F%3Fquery%3Dhttps3A2F2Ftwitter.com2Fmaedergino2Fstatus2F1434606527890038785widget%3DTweet\" target=\"_blank\">He asked Twitter followers</a> to reply with their suggestions, with the one gaining the most likes ultimately being the location of choice. A lot of recommendations ensued.</p>\n<p>One of the most popular is Justdiggit, a grassroots organisation fighting global warming by regreening degraded land in Africa and bringing back vegetation. Other well-liked tweets include those suggesting donating the money to environmental groups in his local area to see the results.</p>\n<p>It’s been nice to see a rider use their time on the bike to help make a difference to the world. He’s not the first to donate to charities through cycling and he won’t be the last – but whatever helps to keep the planet alive. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"985348dee2cce44122d871046e3bab4df8ce5cd4a7f1a2677ae498589fc5cfec","category":"Cycling"}