{"title":"High-Throughput Drug Stability Assessment via Biomimetic Metalloporphyrin Catalyzed Reactions Using Laser-Assisted Rapid Evaporative Ionization Mass Spectrometry (LA-REIMS)","link":"https://www.preprints.org/manuscript/202406.0762/v1","date":1718194532000,"content":"It is an utmost importance to characterize drug candidates as early in the development pipeline as possible. Appropriate application of the emerging high throughput analytical techniques unlocks the opportunities to obtain experimental data for in vitro absorption, distribution, metabolism and elimination (ADME) profiling of large compound libraries which is crucial for selection of lead compounds. In an usual scenario, only one drug candidate will be selected from thousands of early compounds based on several stability and screening results. A high to medium throughput screening approaches could significantly accelerates the subsequent research and production phases. Traditionally, the analysis of metabolic stability assays heavily relies on high throughput LC-MS/MS techniques to meet with the lead profiling demands. In this study presented an innovative experimental approach that can offer a refreshing alternative. Laser Assisted Rapid Evaporative Ionization Mass Spectrometry (LA-REIMS) is a quick and efficient method for characterizing complex biological samples without laborious sample preparation and chemical separation. Therefore, using an automated LA-REIMS well plate reader as fast as 8 seconds per sample, we assessed the oxidative metabolic stability of active agents using biomimetic metalloporphyrin-based oxidative model reactions at various pH for commercially available drug substances and compared stability measurements with traditional HPLC-DAD-MS results.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"985557a555dcba20cbc356540acafcbb95398459c49127c1e0032ea826cccf31","category":"Interdisciplinary"}