{"title":"Egan Bernal can’t believe his Grand Tour stage win","link":"https://cyclingtips.com/2021/05/egan-bernal-cant-believe-his-grand-tour-stage-win/","date":1621178968000,"content":"<p>Despite having won the Tour de France in 2019, when Egan Bernal crossed the finish line at the top of the Rocca di Cambio on Sunday it was the first Grand Tour stage win for the young Columbian. After a turbulent year following his incredible Grand Tour victory, Bernal was understandably emotional to take over the general classification lead at the Giro d’Italia. </p>\n\n\n\n<p>“I even can’t believe what is happening,” Bernal said at the finish of stage 9. “I just won my first stage in a Grand Tour and, you know, I did a lot of sacrifices to be in this position after the Tour [de France] last year so I’m really happy.”</p>\n\n\n\n<p>The year after he wore yellow into Paris Bernal had a few notable results. Results that would have been significant for a 23-year old had he not won the biggest bike race in the world already. In 2020 Bernal won the La Route d’Occitanie overall and was second overall at the Tour de l’Ain behind Primoz Roglic, but after that the road got bumpy. Bernal was third on the opening stage of the Critérium du Dauphiné but <a href=\"https://cyclingtips.com/2020/08/egan-bernal-abandons-criterium-du-dauphine/\" target=\"_blank\">did not start stage 4</a> following a crash on stage 3. He went on to the Tour de France where he lost significant time before ultimately <a href=\"https://cyclingtips.com/2020/09/egan-bernal-is-out-of-the-tour-de-france/\" target=\"_blank\">dropping out</a> ahead of stage 17. </p>\n\n\n\n<p>In the aftermath of the Critérium du Dauphiné crash, Bernal struggled with back pain that hindered the rest of his 2020 season as well as the start of 2021. In October of 2020, Bernal revealed that the cause of the back pain was one leg being longer than the other. This discrepancy had led to scoliosis and a disc herniation which also upset a nerve running from his glute muscle to his knee.</p>\n\n\n\n<p>Given all the pain and frustration of 2020, Bernal was near tears after the Giro d’Italia stage 9 finish. “I can’t believe it. I can’t believe it. I think many things happened for me to be here, and it’s a long way to go, but I think this victory, and to have that pink jersey for a day at least is going to be amazing. It is really worth everything I have gone through,” Bernal said. </p>\n\n\n\n<p>The Giro’s first real test came on <a href=\"https://cyclingtips.com/2021/05/the-gc-winners-and-losers-of-the-giros-first-mountain-stage/\" target=\"_blank\">stage 6</a> where Bernal looked to be the strongest of the general classification hopefuls. He led the group of race favourites up the final 1.5 km to the finish, throwing down enough pressure to drop everyone but Giulio Ciccone, Remco Evenepoel, and Dan Martin. The next real test for Bernal will come in a few days time when the peloton takes on 35 km of gravel. Stage 11 will be an interesting day for the general classification at the Giro d’Italia, finishing in Montalcino with a lot of Strade Bianche feels thrown in. At least for now Bernal can wear his pink jersey in what looks like a day for the sprinters on stage 10 and hopefully on the rest day that follows.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/egan-bernal-cant-believe-his-grand-tour-stage-win/\">Egan Bernal can’t believe his Grand Tour stage win</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"985906f0af50cf49b52bab358b1581a3fbebba35db046d5d213a1f7e9726b88e","category":"Cycling"}