{"title":"AtGames Legends virtual pinball review: The better pre-built choice… mostly","link":"https://arstechnica.com/?p=1777758","date":1625486432000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/legends-pinball-listing.png\" /></div>\n        <p>\n                                [credit:\n                        AtGames                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>If you'd told me at the beginning of 2021 that I'd review not one but two virtual pinball options for the home, I would have nodded and said, <em>sure, that sounds entirely unsurprising</em>. A replica arcade experience seems like a great antidote for any nerd going stir-crazy in a pandemic. Yet while stand-up arcade multi-cabinets have rarely gotten me excited, virtual pinball is another story.</p>\n<p>When I play classics like <em>Pac-Man</em> or <em>Donkey Kong</em> on a console, I generally feel like it's the same experience as standing up with chunky joysticks (your mileage may vary, in which case, there are tons of products for you). But pinball's orientation, form factor, and tactile nature have always precluded it from feeling authentic when virtualized on something like an Xbox. I don't have the cash or space for a fleet of classic pinball machines, however, so I like the idea of a single system that emulates dozens of tables while maintaining the genre's physicality—staples like flipper buttons, nudge options, and a plunger.</p>\n<p>Last month, this led me to <a href=\"https://arstechnica.com/features/2021/06/arcade1up-pinball-cabinet-review-fine-for-families-interesting-for-modders/\">test the Arcade1Up Williams Pinball table</a>, and I was left amused, if not charmed. But its great virtual table selection and solid physical construction were marred by enough issues to make it a tough sell to anyone beyond families. Still, I saw its potential as a moddable machine, whether to add more virtual tables or to use its $600 base as a cheap path to a dreamy homemade system.</p></div><p><a href=\"https://arstechnica.com/?p=1777758#p3\">Read 30 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1777758&amp;comments=1\">Comments</a></p>","author":"Sam Machkovech","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"985e04e8ba8ed8a535a4ebf9e6cac47b61e39721f8ec519c955337ecdcee531b","category":"Tech"}