{"title":"Eco-Friendly TiO2 Nanoparticles: Harnessing Aloe Vera for Superior Photocatalytic Degradation of Methylene Blue","link":"https://www.preprints.org/manuscript/202410.0488/v1","date":1728311904000,"content":": In recent years, the contamination of aquatic environments by organic chemicals has become an increasing concern. To effectively remove toxic pollutants and biologically resistant compounds, a combination of advanced technologies must complement conventional methods. Indeed, among environmental pollutants, dyes such as methylene blue (MB), congo red and crystal violet persist in the environment because they are difficult to biodegrade. Advanced oxidation processes (AOPs) are widely employed to treat various types of wastewaters, often in conjunction with bi-ological treatments. Among these technologies, heterogeneous photocatalysis stands out as one of the most extensively studied, with Titanium dioxide being the most researched photocatalyst due to its high photoactivity. In this study, Titanium dioxide nanoparticles (NPs) were synthe-sized using both a green method, leveraging the natural properties of Aloe vera leaf extract, and a conventional approach. The resulting NPs were thoroughly characterized using XRD, TEM, and ζ-potential analysis. Their photocatalytic performance was assessed by measuring the degrada-tion of MB under UV light. The TiO2 NPs synthesized via the green method demonstrated a degradation efficiency of (50 ± 3) % after 180 minutes, significantly higher than the (16 ± 3)% achieved by NPs synthesized through the conventional route. Moreover, the reaction rate con-stant for the green-synthesized TiO2 NPs was found to be approximately five times greater than that of the conventionally synthesized NPs. These results open new scenario in the pollution removing strategy research.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9862f54c10b61e768a252ef7ed667babdf1689a2bd53f2fa33ca3f00e471fb63","category":"Interdisciplinary"}