{"title":"Patients’ perceptions of targeted breast ultrasound and digital breast tomosynthesis in the diagnostic setting: A mixed methods study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308840","date":1723644000000,"content":"<p>by Carmen C. N. Siebers, Linda Appelman, Lejla Kočo, Mette Palm, Linda Rainey, Mireille J. M. Broeders, Peter T. M. Appelman, Shirley Go, Marja C. J. Van Oirsouw, Ritse M. Mann</p>\r\nBackground <p>Although DBT is the standard initial imaging modality for women with focal breast symptoms, the importance of ultrasound has grown rapidly in the past decades. Therefore, the Breast UltraSound Trial (BUST) focused on assessing the diagnostic value of ultrasound and digital breast tomosynthesis (DBT) for the evaluation of breast symptoms by reversing the order of breast imaging; first performing ultrasound followed by DBT. This side-study of the BUST evaluates patients’ perceptions of ultrasound and DBT in a reversed setting.</p> Methods <p>After imaging, 1181/1276 BUST participants completed a survey consisting of open and closed questions regarding both exams (mean age 47.2, ±11.74). Additionally, a different subset of BUST participants (n = 29) participated in six focus group interviews 18–24 months after imaging to analyze their imaging experiences in depth.</p> Results <p>A total of 55.3% of women reported reluctance to undergoing DBT, primarily due of pain, while the vast majority also find bilateral DBT reassuring (87.3%). Thematic analysis identified themes related to 1) imaging reluctance (<i>pain/burden</i>, <i>result</i>, and <i>breast harm</i>) and 2) ultrasound and DBT perceptions. Regarding the latter, the theme <i>comfort</i> underscores DBT as burdensome and painful, while ultrasound is largely perceived as non-burdensome. Ultrasound is also particularly valued for its interactive nature, as highlighted in the theme <i>interaction</i>. <i>Perceived effectiveness</i> reflects women’s interest in bilateral breast evaluation with DBT and the visibility of lesions, while they express more uncertainty about the reliability of ultrasound. <i>Emotional impact</i> portrays DBT as reassuring for many women, whereas opinions on the reassurance provided by ultrasound are more diverse. Additional themes include <i>costs</i>, <i>protocols</i> and <i>privacy</i>.</p> Conclusions <p>Ultrasound is highly tolerated, and particularly valued is the interaction with the radiologist. Nearly half of women express reluctance towards DBT; nevertheless, a large portion report feeling more confident after undergoing bilateral DBT, reassuring them of the absence of abnormalities. Understanding patients’ perceptions of breast imaging examinations is of great value when optimizing diagnostic pathways.</p>","author":"Carmen C. N. Siebers","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"986da38ae13eb232f609e2c132e52c737c46db54d8a2ff66e5bfd15c54e66b64","category":"Interdisciplinary"}