{"title":"Chanting of Nam-Myoho-Renge-Kyo in the Context of the Buddhist Liturgy of Nichiren Shoshu: Study of Sound Frequencies, Brain Activity, and Microbial Metabolism","link":"https://www.preprints.org/manuscript/202407.0236/v1","date":1719958751000,"content":"This study investigates the effects of chanting Nam-Myoho-Renge-Kyo on sound frequencies, brain activity, and microbial metabolism. Spectral analysis of chanting revealed peaks at 8 Hz and 116 Hz, corresponding to the first Schumann resonance and a frequency linked to chloride ion movements, respectively. Additionally, five peaks corresponding to solfeggio frequencies were identified. These frequencies are known to exert a positive impact on the human endocrine and autonomous nervous systems; improve survival of human brain cells; decrease anxiety in rats; reverse cognitive and endocrine deficits in zebra fish; reduce total concentration of reactive oxidative species in brain tissue. Brain activity changes were measured using functional near-infrared spectroscopy. Prefrontal cortex activity increased modestly during chanting compared to a pre-chanting baseline, but significantly increased afterwards. This suggests a shift towards focused attention during chanting and enhanced activity afterward. The study also examines the effects of chanting on microbial metabolism. Cultures exposed to chanting, either directly or indirectly, showed increased metabolic activity. This suggests local and non-local effects, similar to previously reported phenomena. Importantly, the study clarifies that the spiritual practice of Nichiren Shoshu Buddhism can't be reduced to mere neurophysiological mechanisms in the brain or any other part of the body. The religious and spiritual experience of practicing Buddhism and chanting Nam-Myoho-Renge-Kyo goes well beyond brain activity, neurotransmitters or quantum phenomena of consciousness. It encompasses a mystic dimension that, although not in contradiction with science, can’t be explained solely by science.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9871a16d93c90fd103b3397cdfff462bbb9d3bf3f02adf18054ebc662cb2f80e","category":"Interdisciplinary"}