{"title":"Unraveling the multifaceted effects of climatic factors on mountain pine beetle and its interaction with fungal symbionts","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17207?af=R","date":1709020800000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/29a430f2-c625-4ae3-a60e-ce810f325ea5/gcb17207-toc-0001-m.png\" alt=\"Unraveling the multifaceted effects of climatic factors on mountain pine beetle and its interaction with fungal symbionts\" />\n<p>Mountain pine beetles threaten North American pine forests by causing widespread tree mortality through mass aggregation on host trees. The current study demonstrates exposed beetle–fungal symbiont pairs to manipulated CO<sub>2</sub>, O<sub>3</sub> and humidity levels, finding that lower humidity favoured beetle reproduction and fungal growth, while elevated CO<sub>2</sub> accelerated beetle larval growth and emergence. Elevated O<sub>3</sub> negatively impacted beetle reproduction but boosted immune responses against a fungal pathogen. These findings underscore the need to understand climate change's impact on forest pests and their symbiotic relationships for effective future management strategies.</p>\n<br />\n<h2>Abstract</h2>\n<p>Mountain pine beetles (MPBs) pose a substantial threat to North American pine forests, causing extensive tree mortality over large areas. Their tree-killing ability is closely linked to mass aggregation on host trees triggered via pheromones and dependence on their symbiotic fungi. However, the influence of a changing climate on the biology of MPBs and their co-evolved interactions with their fungal symbionts remains uncertain. To investigate this, male and female pairs of beetles were introduced into freshly cut logs from lodgepole pine trees and placed in controlled climate chambers with manipulated environmental conditions, including two levels of CO<sub>2</sub> (ambient vs. 1000 ppm), O<sub>3</sub> (ambient vs. 100 ppb) and humidity (33% vs. 65%). The beetle-infested logs were left in these chambers for 1 month and then returned to ambient conditions until brood emergence. Emerging broods were collected for further analysis. Additionally, three species of fungal symbionts (<i>Grosmannia clavigera</i>, <i>Ophiostoma montium</i> and <i>Leptographium longiclavatum</i>) were subjected to the same CO<sub>2</sub>, O<sub>3</sub> and humidity conditions for 5 days. Lower humidity promoted MPB reproduction and fungal growth. Elevated CO<sub>2</sub> accelerated larval growth and emergence while improving brood pheromone production. Elevated O<sub>3</sub> had a negative impact on MPB reproduction and brood fitness while improving its immune responses to an entomopathogenic fungus (<i>Beauveria bassiana</i>). It also inhibited fungal growth and reproduction, whereas elevated CO<sub>2</sub> had varied (positive or negative) effects on fungal growth and ergosterol (proxy to fungal mass) production depending on the fungal species. Together, these findings suggest that climate change can potentially alter the interactions between MPBs and their fungal symbionts, highlighting the importance of understanding how climate change affects forest pests and their symbiotic relationships to develop effective management strategies in the future.</p>","author":"Rashaduz Zaman, \nAftab Shah, \nAteeq Shah, \nAziz Ullah, \nGuncha Ishangulyyeva, \nNadir Erbilgin","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"98816fc48607ed05aecf3541e6c44cf8700463203ad410a1ec83b6cc80b40faf","category":"Environment"}