{"title":"The Impact of Environmental, Social, and Governance Disclosure on the Performance of Saudi Arabian Companies: Evidence from the Top 100 Non-Financial Companies Listed on Tadawul","link":"https://www.preprints.org/manuscript/202407.1296/v2","date":1725009794000,"content":"This study investigated the relationship between environmental, social, and governance (ESG) disclosure and the performance of Saudi Arabian companies. We analysed panel data from the 100 non-financial companies listed on the Saudi stock exchange (Tadawul) from 2017 to 2022. Using fixed effects, random effects, and generalised method of moments (GMM) models to account for endogeneity concerns, we examined the impact of ESG disclosure on the return on assets (ROA), return on equity (ROE), and Tobin’s Q. An ESG index was constructed through principal component analysis of individual environmental, social, and governance scores. Our results indicate a significant positive relationship between ESG disclosure and companies’ key performance variables across all models. These findings are consistent with stakeholder theory and signalling theory, suggesting that comprehensive ESG practices can lead to better financial performance and serve as a positive signal to stakeholders. The study also reveals sector-specific differences, with non-manufacturing firms showing stronger positive relationships between ESG disclosure and performance measures compared to manufacturing firms. Additionally, we find that firm size, age, and liquidity are important factors influencing the ESG–performance relationship. This research contributes to the growing literature on ESG and corporate performance in emerging markets, offering valuable insights for policymakers, investors, and corporate practitioners in Saudi Arabia’s evolving sustainable business landscape. Our findings underscore the importance of ESG disclosure in driving sustainable and responsible business practices in the region.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9881711c7a614e007f87228991a89350ed4bb099b225fd86304138ef91a6b0fc","category":"Interdisciplinary"}