{"title":"Improving Discharge Predictions in Ungauged Basins: Harnessing the Power of Disaggregated Data Modeling and Machine Learning","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037122?af=R","date":1726723138000,"content":"<h2>Abstract</h2>\n<p>Current machine learning methods for discharge prediction often employ aggregated basin-wide hydrometeorological data (lumped modeling) for parametric and non-parametric training. This approach may overlook the spatial heterogeneity of river systems and their impact on discharge patterns. We hypothesize that integrating spatiotemporal hydrologic knowledge into the data modeling process (distributed/disaggregated modeling) can improve the performance of discharge prediction models. To test this hypothesis, we designed experiments comparing the performance of identical Long Short-Term Memory Recurrent Neural Network (LSTM-RNN) models forced with either lumped or distributed features. We gather meteorological forcing and static attributes for the Mackenzie basin in Canada- a large and unique basin. Importantly, discharge performance is assessed out-of-sample with k-fold replication across gauges. Training LSTMs with disaggregated data significantly improved model accuracy. Specifically, there was a 9.6% increase in the mean Nash-Sutcliffe Efficiency and a 4.6% increase in the mean Kling-Gupta Efficiency, indicating a better agreement between predicted and actual observations in terms of mean, variability, and correlation. These experiments and results demonstrate the importance of integrating topologically guided geomorphologic and hydrologic information (distributed modeling) in data-driven discharge predictions.</p>","author":"Aggrey Muhebwa, \nColin J. Gleason, \nDongmei Feng, \nJay Taneja","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"98835631af2f34f1c3ecb162f099c5cf1ba4b5c17ca34e0f1da360b497bb03dd","category":"Environment"}