{"title":"Frailty Assessment and Its Impact on Loneliness among Older Adults Receiving Home-Based Healthcare: A Cross-Sectional Study.","link":"https://www.preprints.org/manuscript/202406.0653/v1","date":1718097018000,"content":"To identify the effect of frailty on loneliness of older adults receiving home care, considering their socioeconomic and homebound status. This cross-sectional study enrolled 218 individuals aged ≥65 years receiving home-based health services “Help at Home” in the Region of Evrytania, Greece, after an open invitation by Municipality authorities from March to June 2022. Tilburg Frailty Indicator (TFI) was used for the evaluation of frailty, UCLA Loneliness Scale version 3 for loneliness and social isolation was accessed through five questions (living alone, frequency of interaction with children, relatives, friends, and participation in social organizations). The mean age of the participants was 81.48 ± 9.06, 61.9% were female, 54.1% experienced high levels of loneliness (UCLA-3 mean 45.76 ±11.10 [range 20-68]), and 46.3% of the participants identified as socially isolated. Also, 58.3% of the individuals were classified as frail (TFI mean 5.95 ± 3.07, [TFI range 0-13], with 57.3% experiencing physical frailty, 43.6% psychological frailty, and 27.1% social frailty. An analysis of covariance (ANCOVA) placing UCLA-3 as the dependent variable revealed that loneliness and across all domains of TFI were significantly higher in participants with frailty (total frailty [yes] 49.27 vs. [no] 40,87 p &amp;lt;0.001) particularly, (physical frailty [Yes]=48.99 vs. [No]=41.42, p &amp;lt;0.001, psychological: 48.60 vs. 43.57 p &amp;lt;0.001 and social: 53.38 vs. 42.94 p &amp;lt;0.001) compared to non-frail individuals, even after adjusting for potential confounding effects (covariates: gender, age, marital status, family status, living status, educational level, annual income, chronic diseases, homebound status, and social isolation). Our data analysis confirmed that frailty is a significant risk factor for higher levels of loneliness among older adults who received home-based healthcare.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9886bce7247b708ce35eed3ba2a62941e1dfda5f86e2189795e619e1b0d5c0e3","category":"Interdisciplinary"}