{"title":"Mechanisms of Suprapermafrost Groundwater Recharge Streamflow in Alpine Permafrost Regions: Insights From Young Water Fraction Analysis","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037329?af=R","date":1719903600000,"content":"<h2>Abstract</h2>\n<p>This study investigates the temporal processes of suprapermafrost groundwater (SPG)-supplied streamflow in alpine permafrost regions, aiming to fill the gap in understanding this process from a water-age perspective. Precipitation, streamflow, and SPG samples were collected from the Three-Rivers Headwaters Region (TRHR). We defined the physical meaning of <i>F</i>\n<sub>yw</sub> (the young water fraction) of the SPG and calculated it for the first time. The results showed that in the TRHR, the SPG mean travel time (MTT) was 159 days, and approximately 46.4% of SPG was younger than 77 days, whereas the streamflow MTT was 342 days, and approximately 12.2% of the streamflow was younger than 97 days. The correlation analysis revealed that various climatic factors played dominant roles in the recharge time variations of the SPG-supplied streamflow within the TRHR. The SPG recharge rate did not significantly affect the streamflow <i>F</i>\n<sub>yw</sub>; however, the thickness of the active layer ultimately controlled the SPG transit time distribution. Regression analysis further demonstrated the nonlinear impact of precipitation, average temperature, and average freezing days on SPG <i>F</i>\n<sub>yw</sub>, which is closely related to seasonal freeze–thaw heat conduction and groundwater heat advection in the active layer. During the initial ablation period, the streamflow was primarily recharged by young SPG, resulting in a short-tail travel time distribution. Our findings provide valuable insights into runoff generation and concentration processes in permafrost regions and have important implications for water resource management.</p>","author":"Fa Du, \nZongxing Li, \nJuan Gui, \nBaijuan Zhang, \nJian Xue, \nHuiling Zhou","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"988786ad43bae0f1308ca86c295d588497af6e137972062ce37ae3a5f277b8c0","category":"Environment"}