{"title":"Fermentation of millet bran with bacillus natto: enhancement of bioactive levels and the bioactivity of bran extract","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13455?af=R","date":1709990937000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Millet bran (MB), a byproduct of millet production, is rich in functional components, but has a low utilization rate. In recent years, researchers have shown that fermentation can improve the biological activities of cereals and their byproducts. This study used <i>Bacillus natto</i> to ferment millet bran to improve its added value and broaden the application areas of MB. The bioactive component content, physicochemical properties, and functional activities of millet bran extract (MBE) from fermented millet bran were determined.</p>\n<h2>Results</h2>\n<p>After fermentation, the contents of soluble dietary fiber (SDF), β-glucan, polypeptides, polyphenols, flavones, and total amino acids increased by 92.0%, 164.4%, 111.4%, 32.5%, 16.4%, and 95.4%, respectively. Scanning electron microscopy revealed that the microscopic morphology of MBE changed from complete and dense blocks to loosely porous shapes after fermentation. After fermentation, the solubility, water holding capacity, and viscosity significantly increased, and the particle size decreased. Moreover, the glucose adsorption capacity (2.1 mmol/g), glucose dialysis retardation index (75.3%), and α-glucosidase inhibitory (71.4%, mixed reversible inhibition) activity of the fermented MBE (FMBE) were greater than those of the unfermented MBE (0.99 mmol/g, 32.1%, and 35.1%, respectively). FMBE presented better cholesterol and sodium cholate (SC) adsorption properties, and the adsorption was considered inhomogeneous surface adsorption.</p>\n<h2>Conclusion</h2>\n<p>Fermentation increased the bioactive component content and improved the physicochemical properties of MBE, thereby improving its hypoglycemic and hypolipidemic properties. This study will not only resolve the problem of millet bran waste but also promote the development of a higher value-added application method for millet bran.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Shimei Zhang, \nAn Wang, \nZhaoxin Lu, \nFengxia Lu, \nHaizhen Zhao","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9892900d655583d94130ea943dd6c332af3592a784ec26fcf1f5cd2ce7ea4ae9","category":"Environment"}