{"title":"อำนาจในร่างทรง","link":"https://iannnnn.com/2021/2974","date":1636888797000,"content":"<p><strong>ก่อนอื่น</strong></p>\n\n\n\n<ul><li>สปอยล์แน่นอนครับ</li><li>ถ้ารู้จักกัน จะรู้ว่าหนังเรื่องไหนที่ทำให้เสียงของผู้ชมแตกเป็นสองฝั่ง เราเนี่ยจะชอบนัก คืออยากไปดูว่า แทนที่เขาจะทำให้เป็นหนังที่ทุกคนรัก (แบบดิสนีย์) แต่กลับตั้งใจเลือกเดินเลี้ยวออกจากเซฟโซน ไปเป็นทางที่เสี่ยงแทน แล้วเราล่ะ จะอยู่ฝ่ายที่ชอบหรือเกลียดผลของการตัดสินใจนั้น</li><li>ปรากฏว่าเราเป็นฝ่ายชอบมากจนไปดูเป็นรอบที่สอง ด้วยเหตุผลคือ :<ol><li>เพื่อเคลียร์ข้อสงสัยบางอย่างในสองนาทีสุดท้ายของหนัง ที่ฮุกเราอย่างแรง จนถลกหนังทั้งเรื่องที่ผ่านมาให้กลายเป็นอีกโทนไปเลย คือมึงออกแบบวิธีการมาแบบนี้เพื่อตั้งใจล่อให้เราไปตามเก็บอีกทีด้วยสายตาที่เปลี่ยนไปใช่ไหม …ได้จ้า</li><li>เพื่อหาเหตุผลมาหักล้างให้กับบางฉากที่เราไม่ชอบ (ชาวเน็ตหลายท่านก็บ่นคล้ายกัน) พอมีคนพูดถึงเรื่อง<a href=\"https://www.youtube.com/watch?v=_lFXrVnXoVU\" target=\"_blank\">ทางแยก</a>ของคนทำหนัง ก็เลยสนใจ ดูจบและออกจากโรงมาด้วยความเคลียร์ ปลอดโปร่ง</li><li>เพื่อเก็บรายละเอียด สัญลักษณ์บางอย่าง ที่ไม่แน่ใจว่าหนังใส่มาอย่างจงใจ หรือเราคิดไปเอง ซึ่งบล็อกนี้จะว่าด้วยเรื่องนี้ล้วนๆ</li></ol></li><li>ขอออกตัวว่านี่ไม่ใช่ความเห็นจากปากผู้เชี่ยวชาญ ไม่ได้จะอวยหนัง (ถ้าอวยนางเอกล่ะใช่) อ้อ ถ้าว่าด้วยเรื่องชอบไม่ชอบนี่ เรา<a href=\"https://twitter.com/iannnnn/status/1453376840165249029\" target=\"_blank\">เคยอวยตอนดูครั้งแรกไปแล้ว</a> ดังนั้น คราวนี้จะขอเขียนถึงเฉพาะ “เศษขนมปัง” ที่หนังตั้งใจหรือไม่ตั้งใจไม่รู้ แต่พี่โปรยมาเกลื่อนตลอดทาง เนี่ยว่าจะระบายตั้งแต่ตอนออกมาจากโรง แต่ไม่ว่างสักที จนราจะขึ้นแล้ว ถ้าอ่านไม่ปะติดปะต่อก็ขออภัย</li></ul>\n\n\n\n<p>เริ่มเลยนะ</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-1024x576.jpg\" srcset=\"https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-1024x576.jpg 1024w, https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-300x169.jpg 300w, https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-768x432.jpg 768w, https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-1536x864.jpg 1536w, https://iannnnn.com/wordpress/wp-content/uploads/2021/11/poodhere-2048x1152.jpg 2048w\" /></figure>\n\n\n\n<h3>1. ศาสนาผี</h3>\n\n\n\n<p>หนังเริ่มฉากแรกด้วยการบอกว่า คนไทยนับถือผีกันมาแต่โบราณ</p>\n\n\n\n<p>เรารู้กันดีเนอะว่าภาษาคือตัวบ่งบอกถึงวัฒนธรรม เลยอยากให้สังเกตคำว่า “นับถือ” ครับ คำนี้เป็นคำที่แสดงลำดับชั้นอย่างชัดเจน เป็นหลักฐานว่าเราอยู่ในวัฒนธรรมอำนาจ ผ่านการมีอยู่ดาษดื่นของคำคำนี้นี่แหละ หันไปทางไหนก็เจอกติกาการปลูกฝังให้นับถือนั่น ไหว้นี่ กราบโน่น หมอบนู่น</p>\n\n\n\n<p>พอมีหนังที่เป็นตัวแทนฉายภาพสังคมไทยในรูปแบบหนึ่งขึ้นมา ให้เห็นว่าเราเป็นแบบนี้ ถูกหล่อหลอมกระบวนการคิดด้วยลำดับชั้นแบบนี้ อยู่ภายใต้ระบบจารีตประเพณีที่แสดงออกถึงความไม่เท่ากันของคนแบบนี้ มาตั้งแต่โบราณ ในขณะที่คอนเซปต์ “คนเท่ากัน” ก็เพิ่งมีมาแค่ไม่กี่สิบปีนี้เอง จนแม้กระทั่งนาทีที่พิมพ์อยู่นี่ ก็เพิ่งมีผลการตัดสินคดีความที่ยิ่งตอกย้ำเข้าไปอีกว่าสิ่งที่เรียกร้องกันมาน่ะ มันเป็นแค่ฝุ่นผง ไม่สิ ยิ่งกว่าฝุ่นผงซะอีก แม้กระทั่งจะคุยกับฝุ่น ฝุ่นยังไม่ให้คุย</p>\n\n\n\n<p>กลับมาๆๆๆ…</p>\n\n\n\n<p><sup>// ถ้าอ่านอะไรแบบนี้มาเยอะจนเบื่อแล้ว ก็ผ่านย่อหน้านี้ไปได้เลยครับ //</sup><br />ไม่ใช่แค่ในหนัง แต่ในโลกแห่งความจริง จนถึงวันนี้เราก็ยังนับถือผีกันเป็นหลัก แต่มาในนามของศาสนาพุทธครับ อยากให้ลองจินตนาการ โดยถอดข้อมูลที่ถูกปลูกฝังมาตั้งแต่เด็กๆ ออกไปแป๊บนึง ก็จะพบว่าทุกวันนี้ แม้แต่พระ(พุทธรูป)ที่เราไหว้นั้น นอกจากจะเป็นสิ่งแปลกปลอมที่พระพุทธองค์ไม่เคยเห็น ไม่รู้จัก และไม่คิดมาก่อนว่าวันนึง คนจากประเทศที่บอกว่าตัวเองเป็นเมืองพุทธ จะจริงจังกับการไหว้รูปเคารพกันขนาดนี้</p>\n\n\n\n<p>ลองนึกตามช้าๆ นะครับ เวลาเราไหว้พระเนี่ย เอาจริงแล้วเราตั้งใจระลึกถึงอะไร คุณงามความดีของพระพุทธเจ้า? สุวิสุทธสันดานแบบเพียวๆ เหรอ? ก็ไม่… แต่ความจริง เราๆ ดันไปคิดว่ารูปปั้นรูปหล่อพระเหลืองๆ ตรงหน้าเนี่ย มันคือ “สิ่งศักดิ์สิทธิ์” ครับ เราได้รับการปลูกถ่ายจินตนาการฝังหัวลงไปว่าสิ่งนั้น นั่นคือหลวงพ่อซัมติง หรือถ้าหนักหน่อย(แต่แมสมาก) …นั่นคือวิญญาณของพระพุทธเจ้า ที่มาอาศัยอยู่ในภาชนะสีทองอร่ามตรงหน้า (ซึ่งตัวจริงนิพพานไปแล้ว) ไหนจะการบูชากราบไหว้ศาลเจ้า ศาลพระภูมิ ต้นไม้ จอมปลวก วิญญาณบรรพบุรุษ วิญญาณบรรพชน วิญญาณบูรพกษัตริย์ เทพทั้งหลายตามที่แยกราชประสงค์ ที่ทั้งหลายทั้งปวงแสดงให้เห็นว่าความเชื่อนี้ไม่ได้จำกัดว่าจะต้องเป็นเรื่องของคนต่างจังหวัดบ้านนอกคอกนาขี่ช้างเลี้ยงควายเท่านั้น แต่ชาวกรุงอยู่คอนโดขึ้นรถไฟฟ้าไปทำงานและใช้ไอโฟนโปรแม็กซ์เอง ก็ยังมีความเชื่อนี้ฝังหัวอยู่ไม่ต่างกัน</p>\n\n\n\n<p>นี่แหละครับ ลัทธิบูชาผี</p>\n\n\n\n<p>ไม่ต้องเขินอะไร เพราะเราก็นับถือกันมาแบบนี้แต่ไหนแต่ไรจริงๆ เป็นผีในนามของศาสนาพุทธเวอร์ชันไทยแบบออฟิเชียลเลยด้วย …ซึ่งในหนังร่างทรง กลับจงใจที่จะไม่พูดเรื่องศาสนาพุทธเลยนะ แต่กลับว่าด้วยศาสนาผี คือเอากันตรงๆ เลย เรามาคุยเรื่องสังคมแห่งการบูชาผีกัน</p>\n\n\n\n<p>หนังแสดงให้เห็นภาพแทนจากชุมชนแห่งหนึ่งในอีสาน สมมติให้เป็นเมืองจำลองสักแห่งที่ตั้งอยู่ริมแม่น้ำโขง ท่ามกลางหุบเขาและม่านหมอก โดยเปิดมาก็ปูพื้นเลยว่าชาวบ้านที่นี่เชื่อและศรัทธาผีแบบยำรวมกับศาสนาอื่นๆ มีทั้งศาลเจ้าที่ ศาลเพียงตา โบสถ์คริสต์ ปลัดขิก แขวนเสื้อแดง ฯลฯ  โดยไม่ได้กีดกันคนที่นับถือความเชื่อรูปแบบอื่นๆ เรายังเห็นพระสงฆ์เดินในโรงพยาบาล เห็นภาพวัดพุทธนิกายต่างๆ หรือศาสนจักรอื่นๆ หรือแม้แต่โหมดบูชาผี เราก็เห็นคนทรงเจ้าหลากหลายสไตล์ ทั้งมีสำนัก และแบบที่รวมทีมอเวนเจอร์สในงานคนทรงเฟสติวัล</p>\n\n\n\n<p>โดยทุกคนในชุมชนไม่ว่าจะอยู่มานานหรือย้ายเข้ามา (ยะสันเทียะ เป็นนามสกุลถิ่นโคราช ก็คงจะแต่งเข้ามากับเจ้าสาวที่นี่) ก็อาศัยร่มบุญญาบารมีของผีย่าบาหยันในการปกปักรักษา ว่าเป็นผีที่มีคลาสสำหรับชาวบ้านอยู่ไม่น้อย สังเกตว่าเราจะเห็นรูปเคารพของย่าบาหยันอยู่ในถ้ำบนภูเขาสูง กว่าจะได้ใกล้ชิดคือต้องปีนป่ายขึ้นไป เฟรมภาพในหนังเป็นภาพมุมเงยเสมอเวลาตัวละครมองรูปปั้นย่า</p>\n\n\n\n<p>และสถานที่จริงที่ใช้ถ่ายทำในฉากนั้นเป็นโถงถ้ำตามธรรมชาติที่ชื่อว่า <em>ท้องพระโรง</em></p>\n\n\n\n<p>ในขณะที่การเปิดตัวตัวละครที่เป็นคน ก็เปิดมาเฉยๆ เลย ไม่ได้มีพิธีอะไร (ตัวละครมีบทไปสักพักแล้วค่อยมาขึ้นไตเติลแนะนำตัวตอนสัมภาษณ์) นั่นแสดงให้เห็นไปเลยว่าใครใหญ่กว่ากัน</p>\n\n\n\n<p>เช่นเดียวกับพฤติกรรมของตากล้อง (ที่คนดูไม่ชอบเท่าไหร่) เปิดมาตอนแรกดูเอาอยู่เนอะ แต่อยู่ๆ ไปก็ตัวหดลงเรื่อยๆ เปลี่ยนตำแหน่งจากมือโปรดักชันชาวกรุงตอนต้นเรื่อง พอกลางๆ เรื่อง เจอพลังของผี ก็ค่อยๆ ตัวหดเล็กลง แถมเปลี่ยนสภาพตัวเองกลายเป็นหนึ่งในชาวบ้าน สยบต่ออำนาจไปแล้วตั้งแต่เชื่อว่าผีมีจริง</p>\n\n\n\n<p>และเช่นเดียวกับมิ้ง</p>\n\n\n\n<h3>2. ระบบที่เจือจาง</h3>\n\n\n\n<p>การออกแบบชุมชนอีสานในเรื่อง ต่างจากภาพจำของภาคอีสานในหนังหรือละครอื่นๆ ที่เราคุ้นตาจากภาพผลิตซ้ำว่าช่างร้อนแล้ง แช่แข็ง มีแต่ที่ราบ ทุ่งนาเขียวสุดลูกหูลูกตา มีชาวบ้านยิ้มเกรียมแดดนั่งจกข้าวเหนียวปลาร้าในเถียงนาข้างๆ ควายคู่ใจ</p>\n\n\n\n<p>คือบรรยากาศที่ว่านี่ก็มีอยู่ แต่หนังเลือกใช้บรรยากาศอีกธีมหนึ่งที่ดูมีความเป็นชุมชนขึ้นมาหน่อย เลยดูร่วมสมัย เป็นปัจจุบันจริงๆ ถึงจะเป็นหมู่บ้านห่างไกล แต่ก็ยังมีเสาสัญญาณ 5G ได้ บ้านช่อง ตลาดเทศบาล ถนนหนทาง การโดยสารคมนาคมสาธารณะ ไลฟ์สไตล์แบบที่เป็นต่างจังหวัดจริงๆ (รวมถึงการพูดสำเนียงภาคกลางของเหล่าวัยรุ่น หรือแม้แต่ป้านิ่มเองที่พูดกลางได้กลางเป๊ะ ไม่มีกลิ่นอีสานติดจมูก นั่นก็ใช่) อันนี้เป็นเซ็ตติ้งของหนังที่บอกว่านี่เราอยู่ในยุคปัจจุบันนะ เราจึงได้เห็นความใหม่และเก่าของต่างจังหวัดที่ผสมปนเปกัน แบบเดียวกับที่เขียนไปแล้วเรื่องการผสมผสานความเชื่อต่างๆ</p>\n\n\n\n<p>ส่วนระบบระเบียบต่างๆ ก็ดำเนินตามทางของมันไปในอีกเลน โดยที่หนังแสดงให้เห็นว่ามี แต่ไม่ได้ไปแตะต้องนัก เราจึงได้เห็นหลายฉากที่แสดงว่ากลไกทั้งองค์กรภาครัฐและเอกชนยังทำงานได้ตามปกติ แต่เป็นเพียงพื้นหลัง เห็นสถานีตำรวจ (มีกลไกของกระบวนการยุติธรรม รวมถึงเจ้าหน้าที่ตำรวจที่ออกหลายฉากอยู่นะ แค่ไม่มีบทพูด) เห็นศูนย์จัดหางาน เห็นหน่วยกู้ภัย เห็นวัด (ทั้งพระทั้งบาทหลวงเดินผ่านกล้องอยู่ไม่น้อย) เห็นโรงพยาบาล ที่มีทั้งห้องพิเศษ (สำหรับน้องมิ้งที่บ้านดูไม่ได้เดือดร้อนเรื่องเงิน) ห้องรวมแบบที่ไปนอนเตียงรวมตรงโถงทางเดิน และห้องจ่ายยา</p>\n\n\n\n<p>หนังเรื่องนี้มีฉากโรงพยาบาลบ่อยนะ ไม่แน่ใจว่าผู้สร้างตั้งใจจะทำให้เราเห็นหรือเปล่าว่าชาวบ้านที่นี่ก็ไม่ใช่ว่าจะงมงายจนปฏิเสธการมีอยู่ของระบบการแพทย์สมัยใหม่ ยิ่งบทพูดของตัวละครก็ยิ่งแสดงให้เห็นว่า เอาจริงๆ ระบบก็ยังดำเนินต่อไปได้อยู่ตามปกติ (ถ้าเป็นมะเร็งก็ให้ไปหาหมอ) แต่ถ้าอะไรที่อยู่นอกระบบ (โดนผีทำ) ให้มาหาเรา แล้วจะช่วยปัดเป่าให้</p>\n\n\n\n<p>นั่นคือระบบปกติน่ะมี ดูผ่านๆ ชุมชนนี้ก็ทันสมัยเหมือนสากลโลก</p>\n\n\n\n<p>แต่ในขณะเดียวกัน ก็ยังแอบ<em>มีอีกเลเยอร์ของระบอบ เอ๊ยระบบ ที่ทาบซ้อนอยู่อีกที</em></p>\n\n\n\n<p>มีคนดูแล้วสงสัยว่าเอ๊ะ นี่อาการที่มิ้งเป็นมันอาจเป็นโรคทางจิตเวชก็ได้ ทำไมไม่พาไปหาหมอ (ด้วยเรื่องนี้ ไม่ใช่แค่รักษาอาการบาดเจ็บจากการพยายามฆ่าตัวตาย หรือซีดเพราะหายไปจากบ้านนานๆ) เราเลยได้รู้ว่าพอจวนตัวเมื่อไหร่ แทนที่ตัวละคนจะเลือกทำตามระบบที่มีอยู่แล้ว (โรงพยาบาล, ตำรวจ) แต่กลับเลือกพึ่งพาอำนาจนอกระบบแทน</p>\n\n\n\n<h3>3. อำนาจ 2 แบบ</h3>\n\n\n\n<p>ตลอดทั้งเรื่อง เราจะเห็นการปะทะกันระหว่างอำนาจ 2 แบบ</p>\n\n\n\n<p>แบบแรกคือ Soft Power ที่กำลังเป็นคำฮิตในช่วงนี้ หันไปทางไหนก็ได้ยิน มันเป็นอำนาจที่มองไม่เห็น แต่มีพลังบังคับให้คนทำตามที่ต้องการอย่างได้ผล โดยไม่ต้องใช้ตำรวจทหาร หรือคำสั่งศาลใดๆ</p>\n\n\n\n<p>Soft Power ที่ทรงอำนาจที่สุดตั้งแต่โบราณก็คือศาสนา ถ้าตัดเรื่องสเกลระดับโลกออกไป ย่อเหลือแค่ในหนัง เราได้เห็นการทำงานของศาสนาผีในครั้งแรกตอนเปิดเรื่องเลย ไล่มาตั้งแต่ฉากงานศพ ฉากป้านิ่ม ฉากงานแห่ดาว ฯลฯ ทั้งหมดนี้ไม่ได้มีใครบังคับใครให้ทำอะไรเลย แต่ทุกคนปฏิบัติเป็นปกติในวิถีชีวิตอย่างว่านอนสอนง่าย ไม่รวมเรื่องที่ไม่เกี่ยวกับศาสนาอีก เช่นระบบราชการที่ปรากฏในตอนต้น</p>\n\n\n\n<p><em>แสดงให้เห็นภาพจำลองของสังคมว่า ตลอดเวลาที่ผ่านมา มีอำนาจบางอย่างที่ถูกเซ็ตระบบไว้ และดำเนินต่อเนื่องมาอย่างยาวนาน ส่งต่อจากรุ่นสู่รุ่น สิ่งเหล่านี้หล่อหลอมทัศนคติ กระบวนการคิด วิถีชีวิตทุกอย่างของประชาชนให้ดำเนินตามอย่างสงบ ว่าง่าย และไม่มีข้อสงสัยอะไร</em></p>\n\n\n\n<p>กับอีกแบบนึงคือ Hard Power ที่ไม่ได้ซับซ้อนเลย แค่แสดงออกอย่างแข็งกร้าว จนเห็นแต่ไกลก็รู้แล้วว่าคือการใช้กำลังเพื่อเอาชนะ มีฝ่ายนึงเป็นผู้บังคับ และอีกฝ่ายที่ยอมศิโรราบก็ถูกจูงให้ทำตามสั่ง ไม่ว่าจะด้วยอาวุธหรือกฎหมาย เราได้เห็นอำนาจนี้โผล่มาตลอดเรื่อง ตั้งแต่การเผาตึก จูงหมา (หรือทำอย่างอื่นกับหมา) จูงควาย (หรือทำอย่างอื่นกับควาย) การกักขังมิ้งที่เป็นภาชนะของผี(อำนาจฝ่ายตรงข้าม)ไว้ในห้อง ตลอดจนการกระทำในช่วงท้ายของหนังที่ชัดเจนที่สุด</p>\n\n\n\n<p>ช่วงแรกของหนังยังซอฟต์ๆ เรื่อยๆ พอดำเนินไปกลางทาง เราจะเห็นการเปลี่ยนโหมดของอำนาจที่ ค่อยๆ คืบคลาน แผ่ขยายอาณาเขตของมันมากขึ้นเรื่อยๆ เรื่อยๆ จนในที่สุดก็ระเบิดออกมาจนราพณาสูร</p>\n\n\n\n<p>พอทุกอย่างพังทลายลง หนังจึงค่อยเฉลยให้เห็นสาเหตุว่าที่แท้ การมีอยู่ของตระกูลที่รับพลังจากย่าบาหยัน ไม่ได้เป็นต้นตอของความพินาศสักหน่อย แต่เป็นบรรพบุรุษฝั่งพ่อมิ้งต่างหาก ที่ถูกพลังสาปแช่งและสารพัดผีร้ายมากระทำ ถึงจะเรียกพวกมาสู้แบบตาต่อตา ฟันต่อฟัน ก็ใช่ว่าจะได้ผล เพราะพลังสาปแช่งและสัมภเวสี เจ้ากรรมนายเวรนั้นโหดกว่ามาก</p>\n\n\n\n<p>ที่เด็ดกว่านั้นคือตอนจบจริงๆ หนังก็พาย้อนเวลากลับไปคุยกับป้านิ่ม พอป้าพูดจบปั๊บ เกมพลิก แล้วดันตัดจบ ขึ้นชื่อผู้กำกับและเครดิตทีมงานทันที เป็นสองนาทีสุดท้ายอันโคตรทรงพลัง ดูแล้วเย็ดเข้ๆๆๆ กูต้องมาซ้ำใช่ไหมเนี่ย</p>\n\n\n\n<p>ผมมาทราบตอนอ่านความเห็นชาวเน็ตจำนวนมากที่อุทานเหมือนกัน แต่อุทานว่าอ้าว จบแล้วเหรอ แต่นั่นแหละที่เป็นความต้องการของผู้กำกับที่อยากให้ดูจบแล้วมาเถียงกัน เห็นว่าต่อยกันก็มี …เนี่ยทั้ง soft ทั้ง hard เลย</p>\n\n\n\n<p>ถึง Soft Power นี้จะแสนดูดี เป็นมิตร ฉาบหน้าด้วยรอยยิ้มและทำเพื่อประชาชนมาตลอด แต่พอมาเฉลยว่าอำนาจที่เราเชื่อถือกันมานมนานนั้นที่แท้คือความกลวงเปล่า ทีนี้ก็ไม่เหลืออะไรแล้ว การเสียชีวิตของป้านิ่มที่เหมือนรถยนต์ที่เครื่องยนต์ข้างในพังไปแล้วตลอดกาล จึงเป็นแค่ร่างไร้วิญญาณ</p>\n\n\n\n<h3>4. การทำงานของอำนาจ</h3>\n\n\n\n<p>หนังเรื่องนี้ต้องดูในโรงจริงๆ เพราะตอนอยู่บ้าน เราเดินไปฉี่ ไปเปิดตู้เย็น หรือนั่งขี้ระหว่างดู หรือตอนรอหนังเริ่มได้ แต่ในโรงหนัง เราทำแบบนั้นไม่ได้</p>\n\n\n\n<p>เรายินดีจ่ายเงินเข้าไปเพื่อเสพความหฤหรรษ์ เสพความทรมานบันเทิงที่หนังประเคนให้ แต่ระหว่างนั้น เราจำเป็นต้องอยู่ภายใต้กฎกติกาของโรงหนัง ให้มันกดเราไว้กับเก้าอี้ และกำหนดว่าถ้านั่งลงแล้ว ก่อนหนังเริ่ม มึงจะต้องทนดูโฆษณา! ทั้งสินค้าของผู้สนับสนุน โฆษณาหนังเรื่องอื่น และ<em>โฆษณาเรื่องอื่นๆ…</em></p>\n\n\n\n<p><em>ตั้งแต่หนังยังไม่ฉายด้วยซ้ำ แต่จังหวะนี้แหละ ที่<a href=\"https://twitter.com/iannnnn/status/1454300042815164422?s=20\" target=\"_blank\">แกนหลักของหนังได้เริ่มต้นทำงานแล้ว</a></em></p>\n\n\n\n<p>ช่วงที่มีเพลงขึ้น เราจะสัมผัสได้ถึงบรรยากาศรอบข้างที่มีความกระอักกระอ่วนใจบางอย่าง แว้บนึง แว้บเดียวจริงๆ ไม่เกินสองสามนาที ซึ่งถ้าเป็นโรงในกรุงเทพฯ (รอบแรกที่ดู) ก็จะสบายใจหน่อยตรงที่แทบทุกคนต่างนั่งกันเงียบๆ รู้สึกปลอดภัย ไม่มีใครมาทำอะไรใครแบบที่หลายปีก่อนเคยมีคนโดน หนักมากหนักน้อยก็แล้วแต่ แต่ก็โดนในแบบที่ไม่สมควรจะโดน มันเป็นสิทธิแบบที่ พ.ศ.นี้ไม่ต้องมาถกกันอีกแล้ว (ถึงจะหลายปีก่อนก็ไม่ควรถกปะล่ะ)</p>\n\n\n\n<p>แต่โรงต่างจังหวัดนั้นต่างกันออกไป ช่วงที่มีข้อความเชิญชวนปรากฏขึ้นมาบนจอ ความเอ๊อะอ๊ะ ตัดสินใจว่าจะเอาไงดี มันจะเข้มข้นกว่าในเมืองใหญ่ เหมือนเป็นการช่วงชิงจังหวะ หยั่งพลังดูก่อนว่าเก้าอี้ใกล้ๆ จะยืนหรือนั่ง ถ้าไม่ยืนแล้วจะโดนอะไรแบบที่เคยมีคนโดนไหม เอ๊ะ</p>\n\n\n\n<p>ไม่เกี่ยวกับหนังเลยใช่ไหม? เกี่ยวสิครับ</p>\n\n\n\n<p>“ความไม่ไว้วางใจในบรรยากาศ” ที่มิ้งเจออยู่ตลอดเวลาในช่วงต้นเรื่อง มันคือแบบนี้เป๊ะเลย สิ่งที่มิ้งสงสัยมาตั้งแต่ทีมสารคดีจะเข้าไปถ่ายทำ คือตกลงกูเห็นหรือเปล่าวะ พี่เห็นเหมือนที่หนูเห็นไหม ตกลงแล้วที่ที่เราใช้ชีวิตอยู่เนี่ยมันปลอดภัยจริงไหม</p>\n\n\n\n<p>ยิ่งพื้นหลังเป็นฉากในพื้นที่ที่ชาวบ้านมี<em>ชุดความเชื่อฝังหัวแบบหนึ่ง</em>อย่างแข็งแรงแล้วด้วย การเป็นคนอย่างมิ้ง ซึ่งก็คือวัยรุ่นสมัยใหม่ธรรมดาๆ ที่เราพบเห็นได้ทั่วไป ซึ่งออกตัวแรงว่าไม่เชื่อ เพ้อเจ้อ ไร้สาระ แถมมีไลฟ์สไตล์ที่เหมือนวัยรุ่นสก๊อยหัวสมัยใหม่หน่อยๆ จึงดูห่างไกลจากความเป็นเด็กดีในโอวาทของพ่อแม่ กลายเป็นขบถไป (แต่ก็อยู่กันได้นะ)</p>\n\n\n\n<p>พออาการโดนของแสดงออกมาชัด จะหนีไปไหนก็ไม่ได้ จะถอยก็ไม่รู้จะถอยยังไง มันติดขัดอัดอึดไปหมด และรู้ด้วยว่าถ้าอยู่แบบนี้ต่อไปกูตายแน่ๆ</p>\n\n\n\n<p>เหมือนแมลงเม่าปีกเปียกที่ขยับตัวไม่ได้และรอการช่วยเหลือ ไม่ก็รอวันตายบนโต๊ะสเตนเลสนั่นไง</p>\n\n\n\n<h3>5. การส่งผ่านอำนาจ</h3>\n\n\n\n<p>นอกจากเรื่องภาระการแบกทุกอย่างที่ตกอยู่แต่ในเพศหญิง (ที่มีคนพูดไปเยอะแล้ว) หัวข้อนี้จะพูดแค่เรื่องการส่งต่อทางสายเลือดครับ</p>\n\n\n\n<p><em>อย่างที่บอกว่านี่เป็นการเซ็ตระบบไว้เป็นอย่างดีมาแต่โบราณ ให้มีเพียงตระกูลเดียวที่กุมฐานันดร รวมถึงความจริง(?)ของข้อมูลทางประวัติศาสตร์ไว้ มีการส่งต่ออำนาจนี้ทางสายเลือด ได้รับบทบาทให้เป็นตัวแทน เป็นศูนย์รวมจิตใจของประชาชน</em></p>\n\n\n\n<p>ในขณะที่เราๆ เป็นเพียงชาวบ้านธรรมดา ไม่ได้เกี่ยวอะไรกับเขา แต่เดือดร้อนเมื่อไหร่ค่อยมาขอพึ่งบารมี</p>\n\n\n\n<p>ที่น่าสนใจคือ ยังอุตส่าห์มีคนในตระกูลที่ไม่แฮปปี้กับการสืบทอดฐานันดรที่ว่าด้วยล่ะ</p>\n\n\n\n<p>แม่น้อย แกเลือกตัดช่องน้อย พาตัวเองออกไปจากระบบ ด้วยการย้ายไปนับถือศาสนาคริสต์ <em>(อาจเปรียบได้กับการแต่งงานกับคนต่างชาติเพื่อปลดตัวเองออกจากฐานันดร)</em> แต่ถึงกระนั้น สุดท้ายก็ต้องกลับมาพัวพันกับช่วงเปลี่ยนผ่านอยู่ดี อาจเป็นเพราะสายเลือดของตระกูลที่เจ้มจ้นจัด จนเลี่ยงความจริงไม่ได้ว่าตัวเองก็เป็นหนึ่งในกงเกวียนนี้ ถึงจะออกไปแล้ว แต่พริวิลเลจบางอย่างก็ยังคงอยู่ …และยินดีจะใช้ประโยชน์จากมัน</p>\n\n\n\n<p>และที่น่าสนใจไปกว่านั้นอีกคือ ถ้าหากมีการสมสู่ผิดผีกันในหมู่วงศาคณาญาติ (อย่างมิ้งและแมค) แล้วดั๊น มีทายาทถือกำเนิดออกมาจริงๆ ล่ะ คนที่มาสืบต่อจะได้ตำแหน่งร่างทรงในเจนถัดไปด้วยไหม? อันนี้คิดไปเองว่าลุงมานิตที่ภาพลักษณ์และพฤติกรรมที่ส่อไปในทางหื่นกามอยู่ แกอาจจะเคยไปไข่ทิ้งข้างแจกไว้ที่ไหนมาเยอะแยะก็ได้ ยิ่งจากฉากมิ้งแปลงร่าง ยิ่งทำให้เกิดคำถามใหม่ตามมาว่า อีลุงมึงเคยทำอะไรน้องด้วยหรือเปล่า</p>\n\n\n\n<p><em>เป็นถึงตระกูลที่มีเกียรติแบบนี้ แต่เบื้องหลังกลับเต็มไปด้วยความฉาวโฉ่…</em></p>\n\n\n\n<p>ในขณะที่ตระกูลฝ่ายแม่มีเชื้อมีมูลเป็นตระกูลซูเปอร์ฮีโร่ ผู้คนนับหน้าถือตา แต่ตระกูลฝ่ายพ่อกลับตรงกันข้าม คือมีอดีตเป็นจอมโหด เคยประหัตประหารคนอื่นจนเลือดนองพื้น อันปรากฏในความฝันของมิ้ง รวมถึงการเผาโรงงานอันเป็นต้นเหตุให้ทุกอย่างพินาศ</p>\n\n\n\n<p>ตะปูที่ปักลงในตุ๊กตาสาปแช่งในตอนจบนั้น เมนชันถึง “ยะสันเทียะ” แบบตรงๆ เลย ทำให้เห็นว่าระบบการสืบต่อพลัง(มืด)ที่เข้มแข็งรุนแรง มันก็ผูกเข้ากับสายเลือดอีกที</p>\n\n\n\n<p><em>ถ้าในอดีต ตระกูลของคุณเคยไปทำเวรกรรมอะไรเอาไว้จนสร้างความโกรธแค้น อยากให้รู้ว่าพลังของคำสาปแช่งจากความอาฆาตพยาบาทนั้นมีอยู่จริง และแรงจริง พยายามแก้เคล็ดอย่างไรก็สู้ไม่ไหวอยู่ดี ถึงจะออกดอกออกผลช้าหน่อย แต่ก็มาแน่ คอยดู </em>(ขึ้นทำไมเนี่ยกู)</p>\n\n\n\n<p>อ้อ ถ้ามีภาค What if? เราอาจได้เห็นป้านิ่มรีบจูงมือพามิ้งไปอำเภอเพื่อเปลี่ยนนามสกุลก็ได้นะ เผื่อจะรอด</p>\n\n\n\n<h3>6. ด้านมืดของอำนาจ</h3>\n\n\n\n<p>หนังแสดงความสยองขวัญให้เห็นทั้งภาคกลางวันและกลางคืน นี่จึงไม่ใช่หนังผีที่ตอนกลางวันเราจะรู้สึกโล่งใจว่าเป็นช่วงพักผ่อน แต่ก็ยังคงความอึดอัดไว้ไม่น้อย แถมพอตกกลางคืนนี่แหละยิ่งนรกแตกเข้าไปใหญ่ พี่จะไม่ให้ผมพักหายใจหายคอเลยใช่ไหม</p>\n\n\n\n<p>ขี้เกียจเรียงย่อหน้าละ ลิสต์หัวข้อเกี่ยวกับความดาร์กเท่าที่นึกออกตามนี้ละกันนะ</p>\n\n\n\n<p><strong>6.0 การแอบถ่าย</strong></p>\n\n\n\n<p>ตากล้องสารคดีเป็นสิ่งมีชีวิตที่อยากรู้อยากเห็น พูดง่ายๆ ว่าเสือก แต่เป็นการเสือกที่ทำให้ได้ผลลัพธ์ออกมาน่าสนใจ สารคดีเดี๋ยวนี้ไม่ใช่เหมือนเมื่อก่อนแล้ว ที่เราต้องซุ่มดูสิงโตกินควายป่าอย่างเงียบๆ ห้ามขยับตัวหรือเข้าไปขัดขวาง ถึงแม้ทีมงานจะเผลอทำผิดผีด้วยการโดดเข้าไปช่วยซับเจกต์ (ฉากที่มิ้งเมนส์ทะลักรัวๆ ในสำนักงาน หรือฉากอื่นๆ หลังจากเหตุการณ์มันลุกลาม) แต่ดูรู้เลยว่าในใจมันต้องมีบ้างแหละที่รู้สึกว่าไอ้เหี้ย มีฉากเด็ดมากในสารคดีกู ยิ่งเจอการหักเลี้ยวมากเท่าไหร่ นั่นแหละเป็นว้าวแฟกเตอร์อย่างแรง การได้เห็นซับเจกต์ทำอะไรโหดๆ คอขาดบาดตายได้ยิ่งเหมือนได้รางวัล</p>\n\n\n\n<p>ถ้าคิดแทนตากล้องพวกนี้ ผลงานที่ได้มันก็จะพอลบล้างการผิดจรรยาบรรณไปได้แหละมั้ง แอบถ่ายห้องน้ำหญิงแม่ง แอบติดกล้องในบ้านแม่ง</p>\n\n\n\n<p>ถึงจะทำเรื่องขออนุญาตตามติดชีวิตครอบครัวร่างทรงมาตั้งแต่แรก แต่การไปรุกล้ำพื้นที่ส่วนบุคคลเขาขนาดนั้น มองจากคนดูอย่างเราแม่งก็ไม่สมควร แต่(อีกที)พอได้เห็นผลงานปรากฏเป็นพฤติกรรมของปีศาจร้ายมาโผล่จะจะในจอภาพเขียวๆ ของกล้องวงจรปิด ก็เชื่อแล้วว่าพวกเจ้าสร้างความว้าวกับโปรดักชันได้จริงๆ …ถือว่าพวกนายแทงหวยถูก</p>\n\n\n\n<p>ถูกอะไร ถูกแดกน่ะสิอีลัคกี้</p>\n\n\n\n<p><strong>6.1 ชะตากรรมของหมาผู้จงรักภักดี</strong></p>\n\n\n\n<p>ลัคกี้เป็นตัวแทนภาพจำของหมาพุดเดิ้ลปากเปราะสไตล์สุดฮิตที่ไม่ได้ตัดขน แต่ปล่อยให้ฟูฟูอยู่อย่างนั้น พบได้ทั่วไปตามบ้านของเจ้าของที่เป็นแม่ค้าสไตล์ป้าน้อย คือเลี้ยงไว้เป็นตุ๊กตามีชีวิต ให้กินให้นอนอยู่ในบ้าน ระวังไม่ให้หลุดออกไปข้างนอก ถ้าไปข้างนอกก็ต้องจูงออกไป ขี้เสร็จก็พากลับบ้าน</p>\n\n\n\n<p>บ้านที่ขายเนื้อหมานี่แหละ</p>\n\n\n\n<p>ฉากกล้องวงจรปิดในตำนาน ที่เจ้าลัคกี้ผู้ใสซื่อและภักดี กว่าจะรู้ว่าเจ้านายเหนือหัวที่มีอำนาจสั่งให้ตนอยู่บ้าน กิน นอน ขับถ่าย พาไปเดินเล่นอยู่เป็นประจำทุกวัน ทำไมวันนี้ดูแปลกไปไม่เหมือนเดิม ก็สายไปเสียแล้ว ความไว้ใจนั้นทำให้ลัคกี้ละเลยสัญชาตญาณการป้องกันตัวที่ควรจะแฝงมาในยีน พอโดนจับได้ ลัคกี้ก็กลายเป็นชาบูไป</p>\n\n\n\n<p>เมื่อมองในมุมของเจ้าของหมา การที่มีลูกน้องที่น่ารักและแสนจงรักภักดีนั้นมันช่างสะดวกเสียนี่กระไร ตอนมีประโยชน์ก็ใช้งานได้สบายมือ แต่วันหนึ่งเกิดไม่ถูกใจขึ้นมา ก็แค่ลบออกไป จะบีบก็ตาย จะคลายก็รอดไหมล่ะ</p>\n\n\n\n<p>เช่นเดียวกับเหล่าสาวกชุดขาว ที่มาทำพิธีเพราะเป็นลูกศิษย์อาจารย์เจ้าพิธี (ที่มีบุคลิกคล้ายผู้นำบางประเทศคือคุยอะไรก็ต้องเสียงดังไว้ก่อน จะถามเอาสาระความรู้ก็ไม่มีให้ ที่สำคัญคือยิ่งแก้ยิ่งเจ๊ง แต่คนที่ฝากความหวังก็ฝากนะ)  เหล่าสาวกเหล่านี้เป็นเหมือนอะไรบางอย่าง ที่ใส่เครื่องแบบเหมือนกันหมด สั่งหันซ้ายก็ซ้าย หันขวาก็ขวา<s> สั่งยิงประชาชนก็ยิง ช่างเปรียบเปรยได้ฉลาดมากจริงๆ</s> ห้ามออกจากที่ประกอบพิธีก็เต็มใจ สุดท้ายเป็นไง โดดลงเหวไปด้วยกันให้หมด</p>\n\n\n\n<p><em>นั่นคือผลของการเชื่อฟังแบบเชื่องๆ ยอมสยบต่อระบบอำนาจที่ดูยังไงก็ไม่โอเค สุดท้ายก็ต้องพัง</em></p>\n\n\n\n<p><strong>6.2 ผีหมา</strong></p>\n\n\n\n<p>ที่จริงต้องพูดภถึงสัมภเวสี ผีเร่ร่อนต่างๆ ที่สิงสู่ในรถเสียบกุญแจอย่างมิ้งด้วย ถ้าเอาตามความเชื่อก็คือ มิ้งเปิดโหมด pair bluetooth อัตโนมัติไว้ ใครมาถึงก็ต่อได้เลย ยิ่งเป็นผีที่มีพลัง หรือมีความเคียดแค้นเป็นทุนเดิมหน่อย ก็มาพร้อมกับภาชนะที่เป็นเหล่าของต่ำ ของอัปมงคลทั้งหลายที่มิ้งไปไล่เก็บมาไว้ในห้อง ใครจะรู้ว่าในบ้านนี้จะซุกอะไรไว้ขนาดไหนอีก (ซุกเก่งขนาดว่าห้องแมคเองยังมีความลับมานานขนาดนั้น)</p>\n\n\n\n<p>ผีหมาก็เช่นกัน การที่แม่น้อยทำอาชีพนี้มานมนาน เหล่าน้องๆ ที่กลายเป็นเนื้อสวรรค์ก็คงมีหลงเหลือความแค้นอยู่บ้างแหละ ฤทธิ์เดชของเหล่าเจ้ากรรมนายเวรเหล่านี้ ทีแรกก็ซอฟต์ๆ แต่นานวันเข้าก็แผลงฤทธิ์เดชรุนแรงขึ้นจนระเบิดในวันแปลงร่าง ยิ่งพอตอนท้ายเรื่อง เหล่าผีหมาจึงได้แสดงออกมาเป็นรูปเป็นร่างผ่านการเข้าสิงเหล่าชายชุดขาว กลายเป็นแก๊งหมาบ้าไป จนผู้ชมบางส่วนคิดว่ามันคือผีซอมบี้เกาหลี ฮ่วย</p>\n\n\n\n<p><strong>นอกเรื่อง</strong> : แต่ซีนนี้ในหนังที่ดูรอบสองมาจึงได้คำตอบครับว่าทำไมแต่ละตัวละครมันถึงตัดสินใจโง่กันแบบนั้น ทำไมไม่นั่น ทำไมไม่นี่ พอนึกดูก็เข้าใจ ว่าเออ ที่จริงจังหวะในหนังมันเร็วมากจริงๆ ถ้าเราเป็นตัวละครในนั้น อยู่ดีๆ เกิดมีเหตุการณ์ที่เหนือความคาดหมาย เช่นอยู่ดีๆ อาจารย์เจ้าพิธีโดดลงไปตาย เราจะใช้เวลาช็อกกี่วินาทีกันนะ ที่รอบแรกยังไม่เข้าใจเพราะตอนนั้นเราในฐานะคนดูเนี่ยถูกวางตัวให้ขยับออกมานอกจอ ไม่ได้เป็นหนึ่งเดียวกับตัวละครเหมือนช่วงต้นเรื่องแล้ว แต่เขาออกแบบการนำเสนอให้เราเปลี่ยนมาสวมสายตาของพระเจ้า ที่นั่งกระดิกตีนดูดน้ำอัดลมดูในห้องแอร์เย็นฉ่ำและปลอดภัยแทน เปรียบได้กับเด็กเกาะหลังเบาะคนเล่นเกมตามเน็ตคาเฟ่ หรือคนดูเกมโชว์ ว่าทำไมดารามันโง่จัง ปริศนาฟ้าแลบง่ายๆ ก็ตอบไม่ได้… คือเก่งนอกเกมมันก็เก่งกันทุกคนแหละ แต่ถ้าในเกม ด้วยช่วงเวลาแห่งความเป็นความตาย ณ ตอนนั้น ไม่เข่าอ่อนล้มลงไปกองจนขี้แตกราดน่องก็บุญเท่าไหร่แล้ว ซึ่งในหนังพอไปเก็บรายละเอียดอีกที ตากล้องที่หนีไม่ไหวแล้วมันก็มีอยู่ในนั้นแหละ แสดงให้เห็นกันตรงๆ เลยว่าทรุดอยู่ แต่สัญชาตญาณมันทำให้เอาไฟหัวกล้องส่องไปที่เหล่าภัยพาลตรงหน้า สมองมันทำงานอัตโนมัติน่ะครับ ส่วนภาพที่ได้มาในกล้องก็คือผลพลอยได้จากไฟฉาย เนี่ยที่บอกตอนต้นบล็อกว่าเราดูอีกทีจนเคลียร์ละ (ยกเว้นอีฉากผีอีมิ้งยืมกล้องไปถ่ายนี่ยังไงเราก็ไม่ซื้อ)</p>\n\n\n\n<p>// เขียนเพิ่ม มีคุณ @TonklaHB อธิบายเรื่องจุดจบของตากล้องและผีอีมิ้งไว้สั้นๆ แต่เฉียบมาก <a href=\"https://twitter.com/TonklaHB/status/1460303492346617870?t=RPpNPwwWNWcI45q6q8rSWg&amp;s=19\" target=\"_blank\">กดอ่านทวีตนี้ครับ</a></p>\n\n\n\n<p>กลับมาๆๆๆๆ – ผมเคยสัมภาษณ์น้องคนนึงที่กินหมามาตั้งแต่เด็ก ก็มีประสบการณ์ลึกลับแบบนี้อยู่เหมือนกัน น่าสนใจดีครับ</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>การดีไซน์ผีในเรื่องนี้ เราไม่ได้เห็นออกมาแฮ่เป็นตัวๆ แต่จะมาในรูปของการเข้าสิงแทน เหมือนเป็นปรสิต คือต้องมีโฮสต์ให้อาศัย พอสิงแล้วก็สูบวิญญาณ สูบเลือดสูบเนื้อจนร่างพัง แบบเดียวกับความเชื่อเรื่องปอบ </p>\n\n\n\n<p>ยิ่ง<em>ปรสิตมาเป็นครอบครัว</em>แบบนี้แล้ว คนที่โดนก็ไม่มีอะไรเหลือ</p>\n\n\n\n<p><strong>6.3 แมค</strong></p>\n\n\n\n<p>อันนี้ด้านมืดจริง พี่ชายที่ดูรักกันดี จู่ๆ ก็ตายปริศนา มีการเบี่ยงประเด็นให้คนนอกครอบครัวเข้าใจอย่างหนึ่ง แต่ความจริงคืออะไรก็รู้กันแค่ในบ้าน แถมห้องปิดตายมายาวนาน ไม่มีใครกล้าพูดถึง …ขอพูดเท่านี้พอ</p>\n\n\n\n<p><strong>6.4 คลิป</strong></p>\n\n\n\n<p>สิ่งที่มิ้งกระทำในสำนักงาน ปรากฏออกมาในรูปของคลิปวิดีโอ ถึงหนังจะไม่ได้เล่าเคลียร์ๆ ว่าทำมานานแล้วหรือยัง ทำเพราะผีเข้าหรือเปล่า (ส่วนตัวคิดว่าทำเป็นนิสัยอยู่แล้ว) ถ้าไม่มีใครเห็น ความลับนี้ก็จะเป็นความลับ ที่ประชาชน เอ๊ย เพื่อนร่วมงานได้แต่ซุบซิบนินทากันต่อไป</p>\n\n\n\n<p>ในหนังยังใช้กล้องในการสื่อสารประเด็นเดียวกันนี้อีกตลอดทั้งเรื่อง ผู้กำกับเลือกใช้วิธีนำเสนอผ่านภาพจากกล้องของทีมสารคดีจนชีวาวาย ถ้าไม่นับฉากท้ายเรื่องที่ผีเป็นฝ่ายถือกล้อง (ที่ดูยังไงก็ไม่ชอบ มันเน้นความสยองอย่างเดียวเลยหลุดจากหนังทั้งเรื่องเลย เสียดาย) จะเห็นได้ว่าถ้าไม่มีภาพจากกล้องเหล่านี้ เนื้อหาของหนังทั้งเรื่องก็จะไม่มีใครรู้เห็นเข้าใจว่าเกิดอะไรขึ้น นี่เป็นอำนาจของการบันทึกและเผยแพร่ จากใครก็ได้ ซึ่งเป็นสิ่งใหม่ที่เกิดขึ้นมาในไม่กี่ปีนี้เอง</p>\n\n\n\n<p>มันเปลี่ยนวิธีมองอำนาจของหน่วยงานรัฐเวลาเกิดเรื่องอะไรเลวๆ แล้วกล้องเสียอยู่เสมอ จากความรู้สึกว่าช่วยไม่ได้ กลายเป็นสะกิดไหล่ เมิงๆ รู้กัน เพราะกูก็ถ่าย มึงก็ถ่าย ใครๆ ก็ถ่าย แต่กล้องของสถานีตำรวจทำไมถึงไม่มีหลักฐานถึงมือปืนวะ (อ้าว ออกนอกเรื่อง กลับมาๆๆ)</p>\n\n\n\n<p><strong>6.5 ตัวตลก</strong></p>\n\n\n\n<p>ป้านิ่มพามิ้งเดินผ่านคณะคนทรงสารพัดรูปแบบ เพื่อไปสู่ปลายเส้นทางคือสันติ ที่เป็นหมอผี(หมอธรรม หรืออะไรประมาณนี้) พอเจอหน้า แกก็ถอนหายใจแล้วถามสันติว่า ยังคบกับพวกตัวตลกเหล่านี้อยู่อีกเหรอ (แสดงว่ามีการเกื้อประโยชน์กันมานานแล้ว)</p>\n\n\n\n<p>สันติไม่ปฏิเสธ แล้วให้เหตุผลว่ามันต้องกินต้องใช้ …ใช่แล้ว การเกี้ยเซียะกับเหล่าตัวตลกเหล่านี้ มันทำให้อาชีพของแกอยู่ได้ แกอาจจะเป็นจอมขมังเวทตัวจริงเสียงจริง แต่ในภาคหนึ่ง ถ้าแกเดินทางคนเดียวโดดๆ ก็คงอยู่ได้ไม่นาน จึงจำเป็นจะต้องอยู่เป็น ด้วยการดึงเอาเหล่านี้มาเป็นพวกในพรรค</p>\n\n\n\n<p>ถึงตัวตลกเหล่านี้จะดูโง่ แต่ความจริงไม่ได้โง่ เราเห็นการขโมยซีนพิธีกรและคู่ดีเบตกลางรายการอยู่บ่อยครั้ง ล่าสุดลุงที่รอดคดีปลดสมาชิกภาพ ก็ยังเถียงกับ ส.ส.สามกีบแบบเห็นแล้วอยากแชร์ต่อให้ฮากันทั่วๆ แต่นั่นแหละ เขาเหล่านั้นได้แอร์ไทม์เสมอ ประโยคของพวกเขากลายเป็นมีมเอาไว้ล้อเลียนกันในโลกโซเชียลเสมอ นั่นเป็นความบังเอิญเหรอ? ไม่หรอก :)</p>\n\n\n\n<p>ไอ้จอมขมังเวทนั่นก็ยิ่งไม่ได้โง่ ภายใต้ท่าทีขึงขังและเล่นใหญ่เวอร์ แกก็เอาอยู่ในการบริหารองค์กรนะ …แต่นั่นแหละที่สุดท้ายพลังของแกก็เสื่อม ไม่ได้แกร่งพอจะต่อกรกับ<em>ปีศาจวัยรุ่น</em>ได้อีกต่อไป</p>\n\n\n\n<h3>7. การเสื่อมอำนาจ</h3>\n\n\n\n<p>ฟัง อ.ตุล (เชฟหมี) กล่าวถึงการนับถือพุทธแบบเถรวาทในบ้านเราว่าต่างจากมหายานตรงที่ มหายานเขามองพุทธะเป็นสภาวะ ดังนั้นสภาวะนี้จะเกิดที่ไหนก็ได้ ที่แมวก็ได้ (เราเลยเห็นกาชารูปพระแมว) ในขณะที่พุทธไทยเรามองพุทธเป็นตัวบุคคลอันศักดิ์สิทธิ์ เราบูชาบุคคล (เราเลยมีสำนักพวย ที่คอยฟ้องคนที่ทำกาชารูปพระแมว) เนี่ย ความเคารพนับถือของเราเป็นแบบนี้ คือคีปเมนมากกว่าคีปวง</p>\n\n\n\n<p><em>สถาบันใดๆ ที่ออกแบบระบบองค์กรมาไม่สอดรับกับปัจจุบัน พอวันนึงพอเปลี่ยนเจน เปลี่ยนคน เปลี่ยนถ่ายอำนาจ แล้วคนใหม่ดันบริหารไม่เป็น ความเสื่อมก็จะตามมา</em></p>\n\n\n\n<p>มิ้งนับถือคริสต์ตามแม่ ไม่ได้เพิ่งมานับถือ แต่น่าจะเป็นมานานจนได้สวมมงในขบวนแห่ดาว ก็คือหน้าตาดีด้วย เลยได้เป็นอินฟลูเอนเซอร์ #beautyprivilege</p>\n\n\n\n<p>ย้ำอีกทีว่ามิ้งก็คือวัยรุ่นทั่วไป มีมุมมองด้านความเชื่อด้านศาสนาก็นับถือส่งๆ เข้าโบสถ์แบบส่งๆ ไม่ได้อินอะไรเลย เกิดมาเห็นแม่ไหว้ก็ไหว้ ไม่ได้ต่างจากเราๆ ท่านๆ ที่บัตรประชาชนบอกว่าเป็นพุทธศาสนิก แต่ก็เป็นเพราะไม่ได้คิดจะเปลี่ยนอะไร ที่บ้านเป็นมางี้ก็แค่กรอกให้จบๆ ไป สมัยเด็กๆ ก็ต้องมีภาพจำคือโดนผู้ปกครองหรือตายายลากเข้าวัด พอพระเริ่มสวดก็หลบไปวิ่งเล่น</p>\n\n\n\n<p>ต่างกันสุดขั้วกับป้านิ่ม ที่ทีแรกก็ไม่อินกับการเป็นร่างทรงหรอก แต่พอได้มาเป็น แกก็เออ สบายดีแฮะ สุขสบาย มีกินมีใช้ มีคนนับหน้าถือตา ได้เสพสถานะทางสังคมอันเกิดจากการพึ่งพาย่าบาหยัน เรียกว่าชีวิตแฮปปี้ขึ้นเยอะ ถือเป็นพริวิเลจอีกแบบ เลยแสดงออกว่าแกศรัทธาย่าบาหยันมากๆ</p>\n\n\n\n<p>แต่จากวิกฤติใหญ่ที่เจอ และจากการตั้งคำถามของป้าน้อย ที่เป็นอีกแกนสำคัญของหนัง ว่าชะตากรรมในการเกป็นร่างทรงนี้ ใครหนอเป็นผู้กำหนด</p>\n\n\n\n<p>พระเจ้าเหรอ พระพุทธเจ้าเหรอ?</p>\n\n\n\n<p>เราเลยได้เห็นเฉลยในตอนจบของหนังว่า ที่แท้ป้านิ่มแกก็เก็บความสงสัย และตั้งคำถามเกี่ยวกับศรัทธาของตัวเองเหมือนกันว่าแท้จริงแล้วเราเชื่อจากใจ หรือเราแค่อิงแอบ ตักตวงผลประโยชน์จากอำนาจเท่านั้นกันหนอ ก็ไม่รู้เหมือนกันว่าป้าสงสัยมานานแล้ว หรือเพิ่งมาเอ๊ะตอนที่เกิดเรื่อง </p>\n\n\n\n<p>ถ้าอยากเห็นแววตาของป้า ให้ตีตั๋วเข้าไปดูตั้งแต่แรกอีกรอบเหมือนผม 5555555</p>\n\n\n\n<p>ส่วนอีลุงสันติเจ้าพิธีน่ะ แกไม่ได้อยู่อันเดอร์ย่าบาหยันนะ คือแกก็มีของ มีพลังอำนาจ มีกองทัพของแกเอง และที่สำคัญคือแกมีความมั่นใจสูงลิบ จนไม่รู้สึกว่าตัวเองต้องพึ่งพาอำนาจของใคร แต่แค่อาศัย<em>โหน</em> เอ๊ยยืมมือย่ามาช่วยพิฆาตศัตรูเฉยๆ</p>\n\n\n\n<p>ตัดภาพมาที่ย่าบาหยัน ย่าอาจเก่งจริง ศักดิ์สิทธิ์จริง หรือกลับกัน แกอาจไม่ได้เป็นอะไรมากกว่าแค่ผีบรรพบุรุษ หรือสิ่งศักดิ์สิทธิ์ธรรมดาๆ ที่เผอิญชาวบ้านให้ราคาไว้สูง แต่ตัวจริงไม่ได้มีพลังอำนาจอะไรพิเศษเลย …คือถ้าย่าเก่งจริง ทำไมย่าจึงหลบอยู่ข้างหลังตลอดล่ะ <em>ไม่เปิดหน้าสู้ล่ะ</em> หรือที่ผ่านมาย่าไม่เคยมีตัวตนอยู่จริง แต่เป็นเพียงรูปปั้นที่คนโบราณเซ็ตอัปไว้เฉยๆ</p>\n\n\n\n<p>จึงชวนให้คิดต่อว่า งั้นแล้ว<em>ที่ผ่านมา เรากราบใคร?</em></p>\n\n\n\n<p>ยิ่งยุคสมัยเปลี่ยนไปแล้ว แต่ย่ายังคงเป็นย่าเหมือนเดิม การบูชาย่ายังใช้วิถีประเพณีเดิม บทสวดเดิมๆ อยู่ แล้วต้องอยู่บนนั้นเพื่อรักษาสถานะตัวเองว่าเราเป็นสัญลักษณ์ เป็นมิ่งขวัญของชาวบ้าน เป็นรูปปั้นที่แข็งแกร่งไม่มีวันสั่นคลอน</p>\n\n\n\n<p>พอเจอ<em>ผีเด็ก</em>พลังสูง ที่มาเพื่อทำลายระบบเดิมให้ราบคาบ ย่าแก่ๆ ที่ยังร้องเพลงเดิมๆ หรือจะมาสู้ไหว</p>\n\n\n\n<p>วันหนึ่งพอย่าบาหยันได้ถูก<em>ตัดหัว</em>ไป โดยใคร หรืออะไรก็ไม่รู้ อาจจะเป็นประชาชนที่โกรธแค้น (หนังฉลาดมากที่ไม่เล่าตรงนี้ นี่เป็นอีกเหตุผลนึงที่ต้องเล่าด้วยเทคนิคการถ่ายสารคดี เพราะไม่งั้นการไม่เฉลยประเด็นนี้อาจเป็นความผิดบาปต่อคนดู) หรืออาจจะเป็นผีห่าอำนาจมืดอะไรอีกก็ไม่รู้ได้ ซึ่งนี่เองเป็นหนึ่งจุดตัดที่ทำให้เรารู้ว่า อำนาจสูงสุดใดๆ ก็ไม่อาจอยู่ยงคงกระพันค้ำฟ้าเสมอไป</p>\n\n\n\n<p>และพอป้านิ่มบุกบั่นปีนเขาขึ้นไปพบว่ารูปเคารพของตนเศียรขาดไปแล้ว ทุกสิ่งทุกอย่างที่ป้ายึดถือมาก็ล่มสลาย และดับวูบลงตลอดกาล…</p>\n\n\n\n<p>และเชื่อว่าหลังจากเหตุการณ์ในหนัง (ที่ไม่เหลือใครเป็นตัวบุคคลศักดิ์สิทธิ์ให้นับถือแทนระบอบอีกต่อไปแล้ว) อำนาจที่มีวันเสื่อมก็แสดงออกมาให้เห็นเป็นรูปธรรม ศรัทธาของชาวบ้านทั้งชุมชนที่มีต่อระบอบดั้งเดิมนี้ ก็จะค่อยๆ สูญสลายลง พร้อมกับคนเก่าคนแก่ที่ค่อยๆ ล้มหายตายจากไปตามกาลเวลา</p>\n\n\n\n<p>ขอเพียงเวลา…</p>\n\n\n\n<hr />\n\n\n\n<p><strong>// นึกขึ้นได้เลยขอเขียนเพิ่มเติมครับ</strong>​ : มีประเด็นถกเถียงอีกอย่างในหนัง คือช่วงสุดท้ายที่ย่าบาหยันออกจากป้านิ่ม แล้วย้ายมาเทียมป้าน้อย เราได้เห็นการรวบรวมเศษหม้อที่ถูกทำลายไปแล้ว กลับมาประกอบใหม่ ทำพิธีภิเษกสถาปนาตน นี่เป็นการผลัดเปลี่ยนของอำนาจมาสู่คนใหม่ ช็อตนี้ทุกคนต่างก็มองหน้ากันเลิ่กลั่กว่าแล้วยังไงต่อดีวะ ย่าบาหยันคนใหม่จะเป็นที่พึ่งของพวกเราได้เหมือนกับคนก่อนไหม</p>\n\n\n\n<p>แล้วไงล่ะ ตายห่าหมด ไม่เพียงเหล่าสาวกผู้เชื่อเท่านั้น แต่ขนาดลุงมานิตย์ที่แม้แกจะไม่ได้มองด้วยความศรัทธา แต่ก็ไม่ได้ลุกขึ้นมาต่อต้าน สุดท้ายก็ต้องพบจุดจบเช่นกัน<br />เป็นคำถามที่หนังไม่ได้เฉลยว่าตกลงแล้วพลังอำนาจนั้นเป็นวิญญาณดีจริงๆ ใช่ไหม หรือถ้าพลังมันจบลงตั้งแต่ป้านิ่มตาย และผีที่มาเทียมในตำแหน่งสูงสุดไม่ใช่ย่าบาหยันที่คนศรัทธา แต่เป็นผีห่าตนใดก็มิทราบ ทุกอย่างจึงล่มสลาย และแสงไฟก็ดับวูบลง</p>\n\n\n\n<p>เหลือแต่เพียงปีศาจเด็กรุ่นใหม่เท่านั้นที่เดินฝ่าฝูงหมา (เดี๋ยว) จากพื้นดิน ขึ้นมาต่อกรบนชั้นสูงสุด …ผีมิ้งจุดไฟขึ้นใหม่อีกครั้ง แล้วเผาป้าน้อยจนวอดวาย</p>","author":"iannnnn","siteTitle":"iannnnn.com","siteHash":"a633e1d87162133e28114b6caf1c887bfa26aadefce69cc40a9feea913e71870","entryHash":"989317a8f09eda3ba7be8099a596f92c295878b62fd184d1b73feb9b608f02b2","category":"Thai"}