{"title":"คุยกับ AIS กับการนำ 5G พลิกโฉมอุตสาหกรรมไทยในโลกยุค New Normal","link":"https://www.blognone.com/node/124330","date":1629946800000,"content":"<div><div><div><p>AIS เป็นโอเปอเรเตอร์รายแรกๆ ที่ลงทุนกับเครือข่าย 5G เริ่มต้นเจาะตลาดกลุ่มลูกค้าคอนซูเมอร์ เพื่อการใช้งานมือถือที่เร็วและลื่นไหล และชู 5G ว่าเป็นโอกาสสำคัญของเทคโนโลยีอื่นๆ อย่าง AR/VR, IoT, Smart City, Smart Transportation</p>\n<p>แต่ในระยะหลังเราเห็นแล้วว่า 5G สามารถนำมาใช้กับกลุ่มธุรกิจองค์กรได้ด้วย Blognone ได้พูดคุยกับคุณธนพงษ์ อิทธิสกุลชัย หัวหน้าคณะผู้บริหาร กลุ่มลูกค้าองค์กร AIS ถึงประเด็นโลกหลังจากนี้ว่า 5G จะมีบทบาทสำคัญอย่างไรต่อไป รวมถึงทิศทางของ AIS ในอนาคต</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/281db66288eec079bf56cd3f0662326a.jpeg\" /></p>\n<h3>เทรนด์อนาคตของ 5G</h3>\n<p>จากภาพด้านล่าง เราสามารถแบ่งการใช้งาน 5G ออกเป็น 4 ประเภทใหญ่ๆ ตอนนี้เราผ่านการใช้งาน 5G Mobile กันมาแล้ว กำลังเริ่มเข้าสู่ 5G Infrastructure สำหรับกลุ่มองค์กร และในระยะถัดไป เราจะเห็น 5G เข้ามามีบทบาทสำคัญในภาคธุรกิจ 2 ด้าน คือ 5G Horizontal Solutions กับ 5G Vertical Solutions</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/4fceb5c96862ff4ca66e96031135527b.png\" /></p>\n<p>5G Horizontal Solutions หรือการใช้งานโซลูชันที่สามารถปรับใช้ได้กับทุกอุตสาหกรรม เป็นรูปแบบการใช้งานที่เริ่มเกิดขึ้นแล้ว ยกตัวอย่างเช่นการใช้งาน AR/VR ที่AIS ร่วมกับบริษัท NTT Docomo ของญี่ปุ่น ทำ Remote Supervisor โดยให้คนที่อยู่คนละประเทศ สามารถทำงานร่วมกันโดยผู้เชี่ยวชาญสามารถเห็นภาพและข้อมูลเพื่อให้คำปรึกษากับพนักงานที่ทำงานอยู่ในโรงงานได้ผ่านเครือข่าย 5G และอีกกรณีคือ AIS ร่วมมือกับ Mitsubishi Electric และ TKK Corporation ยกระดับระบบ FA Remote (การทำงานระยะไกลในโรงงาน) เป็นต้น</p>\n<p>สิ่งที่จะเกิดขึ้นตามมาในอนาคตคือ 5G Vertical Solutions หรือการพัฒนา 5G ในแนวดิ่ง เป็นการใช้ 5G เจาะลงลึกเฉพาะอุตสาหกรรมนั้นๆ เพื่อประโยชน์ในการทำ Digitization โดยเฉพาะ โดยโซลูชันที่เราจะได้เห็นในอนาคตจะอยู่ในรูปแบบ 5G สำหรับอุตสาหกรรมการผลิต, อสังหาริมทรัพย์และค้าปลีกหรือกลุ่มโลจิสติกส์ เป็นต้น</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a094b8100bd9193938b24feb9baf3eb0.jpeg\" /></p>\n<h3>5G กับการยกระดับอุตสาหกรรมการผลิต (Manufacturing)</h3>\n<p>อุตสาหกรรมการผลิต หรือ Manufacturing เป็นอุตสาหกรรมที่ยังไม่เห็นเทรนด์การทำ Digitization ชัดเท่ากับอุตสาหกรรมอื่น แต่เมื่อใด 5G เข้ามามีบทบาท เราก็จะมองเห็นการพัฒนาสายการผลิตที่ดีขึ้นอย่างเห็นได้ชัด เช่น สามารถซ่อมบำรุงได้ล่วงหน้า เพิ่มประสิทธิภาพการทำงานของเครื่องจักรในโรงงานดีขึ้น ลดค่าใช้จ่ายการซ่อมบำรุง และป้องกันความเสียหายจากเครื่องจักรล้มเหลวได้อย่างมีนัยสำคัญ</p>\n<p>ด้วยประสิทธิภาพเครือข่าย 5G ของ AIS ที่วางรากฐานไว้แล้ว 77 จังหวัด รวมถึงเขตเศรษฐกิจอีอีซี ครอบคลุมการใช้งานหลากหลายย่านความถี่ ทำให้สามารถปรับใช้งานตามความต้องการของโรงงานได้</p>\n<ul>\n<li>Low Band 700 MHz เน้นการใช้งานครอบคลุมพื้นที่กว้างแต่อาจไม่โดดเด่นเรื่อง low latency มากนัก</li>\n<li>Mid Band 2600 MHz ที่ขยับความเร็วการใช้งานขึ้นมาจาก Low Band</li>\n<li>High Band 26 GHz เหมาะกับการใช้งานในโรงงานอุตสาหกรรมที่ต้องการลด Delay TIme และ ต้องการความแม่นยำของเครื่องจักรและหุ่นยนต์ช่วยการผลิต</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d70863c9674ad40f1dbed39eceab0b82.png\" /></p>\n<h3>โซลูชัน 5G จาก AIS ช่วยให้อุตสาหกรรมปรับตัวได้เร็วขึ้น ไม่ต้องเริ่มจากศูนย์</h3>\n<p>AIS เป็นเจ้าของเครือข่ายก็จริง แต่ลำพัง AIS คนเดียวไม่สามารถนำ 5G มายกระดับอุตสาหกรรมการผลิตได้ เราจึงเห็นความเคลื่อนไหวของ AIS Business ในการสร้างพันธมิตรกับบริษัทผู้เชี่ยวชาญอุตสาหกรรมการผลิต มาพัฒนาโซลูชัน 5G ที่ใช้ในโรงงานร่วมกัน ได้แก่</p>\n<ul>\n<li>ร่วมมือกับ Bosch นำโครงสร้างพื้นฐานและโซลูชันด้าน 5G \"Private Network\" และ \"Edge Computing\" มาร่วมพัฒนา Use Case ใหม่ๆ ในพื้นที่โรงงานโครงการพัฒนาระเบียงเศรษฐกิจพิเศษภาคตะวันออก (EEC) ต่อยอดการใช้โซลูชัน ActiveCockpit ของ Bosch ให้มีประสิทธิภาพมากขึ้น</li>\n<li>ร่วมมือกับ SNC Former ผู้ผลิตกลุ่มชิ้นส่วนยานยนต์และเครื่องใช้ไฟฟ้าในเขตพื้นที่อีอีซี ตั้งเสา 5G ที่โรงงานในระยอง เปิดทางนำเทคโนโลยีใหม่อย่างหุ่นยนต์และอุปกรณ์ IoT เข้ามาเชื่อมต่อผ่านเครือข่าย 5G ในโรงงาน เพื่อเป็น Smart Manufacturing อย่างสมบูรณ์​ เพิ่มขีดความสามารถในการแข่งขันทางธุรกิจ</li>\n<li>ร่วมกับ OMRON ผู้ให้บริการระบบควบคุมอัตโนมัติ เทคโนโลยีเซนเซอร์ กล้องอุตสาหกรรม และระบบหุ่นยนต์ในโรงงานอุตสาหกรรมรายใหญ่ โดยใช้ 5G มายกระดับ พัฒนาโซลูชัน Layout-free Production Line   เพิ่มความยืดหยุ่นให้กับการผลิต ผสานกับระบบ Autonomous Mobile Robot (AMR), IoT, และเทคโนโลยีปัญญาประดิษฐ์</li>\n<li>ร่วมกับ Mitsubishi Electric และ TKK Corporation เสนอโซลูชัน e-F@ctory บนเครือข่าย AIS 5G นำระบบ FA Remote (การทำงานระยะไกลในโรงงาน) ให้สอดคล้องกับการทำงานในภาวะโรคระบาด ลดความเสี่ยงการติดเชื้อและคลัสเตอร์ใหม่จากโรงงาน ยกระดับการทำงาน FA Remote ให้มีเสถียรภาพมากขึ้น</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/db9a1e347c6ac87cf8ab177e03b5a4a2.png\" /></p>\n<p>จากความร่วมมือทั้งหมดที่กล่าวมา ทำให้ AIS สามารถใช้กำลังเครือข่าย 5G ผสานกับโซลูชันของพาร์ทเนอร์ และเทคโนโลยีเมกะเทรนด์ที่ AIS มีได้แก่ คลาวด์, ระบบความปลอดภัยไซเบอร์, IoT มาสร้าง End-to-End Solution ให้ลูกค้าโรงงาน และ AIS ยังพัฒนาบุคลากรมาเรียนรู้ระบบร่วมกับพาร์ทเนอร์ เพื่อที่กลุ่มคนเหล่านี้จะมีความเชี่ยวชาญ สามารถซัพพอร์ตลูกค้า ทำให้เกิดกระบวนการ Digitization ให้เกิดขึ้นในโรงงานอุตสาหกรรม โดยลูกค้าไม่ต้องทำเองทุกอย่างตั้งแต่ต้น หรือลงทุนใหม่ทั้งหมดทั้งฮาร์ดแวร์ ซอฟต์แวร์ และบุคลากร</p>\n<h3>ความต้องการที่จะเปลี่ยนแปลง สำคัญที่สุด</h3>\n<p>การยกระดับโรงงานอุตสาหกรรมให้เป็น Smart Factory ยังมีเรื่องต้องทำอีกมาก แต่ละโรงงานก็มีข้อจำกัดของตัวเอง ทั้งเรื่องเงินทุน การขาดแคลนบุคลากร แต่คุณธนพงษ์บอกว่า สิ่งที่สำคัญไม่แพ้เงินทุนและคนคือ วิสัยทัศน์ผู้บริหารที่ต้องการเปลี่ยนแปลง</p>\n<p>โรงงานบางแห่งอาจติดกับความคิดที่ว่าการนำเทคโนโลยีใหม่ๆ มาใช้ยังเป็นเรื่องไกลตัวเกินไป ยังไม่จำเป็นตอนนี้ ทำให้ยังยึดติดการผลิตแบบเดิม เสี่ยงต่อการแข่งขันทางธุรกิจในอนาคต</p>\n<p>การเปลี่ยนแปลง ทำ Digitization ไม่จำเป็นต้องเริ่มจากสเกลใหญ่ โรงงานสามารถเข้ามาร่วมมือกับ AIS เพื่อหาโซลูชันเริ่มจากสายการผลิตเล็ก แล้วค่อยๆ ขยายการใช้งานไปเรื่อยๆ ซึ่ง AIS และพาร์ทเนอร์ทางธุรกิจมี End-to-End Solution ให้ลูกค้าโรงงานได้</p>\n<p>ผู้ที่สนใจบริการธุรกิจจาก AIS เพิ่มเติม สามารถดูข้อมูลรายละเอียดต่างๆ ได้ที่หน้า<a href=\"https://business.ais.co.th/\">เว็บไซต์ของ AIS Business</a> ได้ทันที หรือติดต่อเจ้าหน้าที่ AIS Business ที่ดูแลท่านอยู่</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ais\">AIS</a></div><div><a href=\"/topics/5g\">5G</a></div><div><a href=\"/topics/manufacturing\">Manufacturing</a></div><div><a href=\"/topics/interview\">Interview</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"98976b9f262c504a0dda8baf796d653a66cf217db7417ec8115f2aa0b1b9ad2d","category":"Thai"}