{"title":"Infill Well Placement Optimization for Polymer Flooding in Offshore Oil Reservoirs Using an Improved Archimedes Opti-Mization Algorithm with Halton Sequence","link":"https://www.preprints.org/manuscript/202408.1581/v1","date":1724288238000,"content":"Infill drilling is one of the most effective methods to improve the performance of poly-mer flooding. The difficulties related to infill drilling are determining the optimal numbers and placements of infill wells. In this study, an improved archimedes optimization algorithm with Halton sequence (HS-AOA) was proposed to overcome the aforementioned difficulties. First, to optimize the infill well placement for polymer flooding, an objective function that considered the economic influence of infill drilling was developed. Then, the novel optimization algorithm (HS-AOA) for infill well placement was developed by combining the AOA with the Halton se-quence. The codes were developed in MATLAB and connected to a commercial reservoir simula-tor CMG STARS to carry out the infill well placement optimization. Finally, the HS-AOA was compared to the basic AOA to confirm its reliability and then used to optimize the infill well placements for polymer flooding in a typical offshore oil reservoir. The results showed that the introduction of the Halton sequence into AOA effectively increased the diversity of the initial ob-jects in the AOA and avoided the HS-AOA trapping into the local optimal solutions. The HS–AOA outperformed the AOA. It was an effective approach to optimize the infill well placement for polymer flooding processes. In addition, infill drilling could effectively and economically im-prove the polymer flooding performance in offshore oil reservoirs. The NPV of the polymer flooding case with infill wells determined by HS-AOA reached 3.5 × 108 $, which was an increase of 7% over that of the polymer flooding case. This study presents an effective method for opti-mizing infill well placement for polymer flooding processes. It also can serve as a valuable refer-ence for other optimization problems in the petroleum industry, such as joint optimization of well control and placement.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"989a5bf3e5672ee5f54ce4166c25c10bbdc20e521e8659e34478a839d856b02c","category":"Interdisciplinary"}