{"title":"Rocket Report: SpaceX’s record year; Firefly’s Alpha rocket falls short","link":"https://arstechnica.com/?p=1993810","date":1704456030000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/53438472439_ac4f723390_h-800x572.jpg\" alt=\"Firefly Aerospace's fourth Alpha rocket lifted off December 22 from Vandenberg Space Force Base, California.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/53438472439_ac4f723390_h.jpg\">Enlarge</a> <span>/</span> Firefly Aerospace's fourth Alpha rocket lifted off December 22 from Vandenberg Space Force Base, California. (credit: <a href=\"Firefly%20Aerospace/Trevor%20Mahlmann\">Firefly Aerospace/Trevor Mahlmann</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.25 of the Rocket Report! We hope all our readers had a peaceful holiday break. While many of us were enjoying time off work, launch companies like SpaceX kept up the pace until the final days of 2023. Last year saw a record level of global launch activity, with 223 orbital launch attempts and 212 rockets successfully reaching orbit. Nearly half of these missions were by SpaceX.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><b>Firefly's fourth launch puts payload in wrong orbit. </b>The <a href=\"https://fireflyspace.com/missions/fly-the-lightning/\">fourth flight of Firefly Aerospace's Alpha rocket</a> on December 22 placed a small Lockheed Martin technology demonstration satellite into a lower-than-planned orbit after lifting off from Vandenberg Space Force Base, California. US military tracking data indicated the Alpha rocket released its payload into an elliptical orbit ranging between 215 and 523 kilometers in altitude, not the mission's intended circular target orbit. Firefly later confirmed the Alpha rocket's second stage, which was supposed to reignite about 50 minutes after liftoff, did not deliver Lockheed Martin's satellite into the proper orbit. This satellite, nicknamed Tantrum, was designed to test Lockheed Martin's new wideband Electronically Steerable Antenna technology to demonstrate faster on-orbit sensor calibration to deliver rapid capabilities to US military forces.</p></div><p><a href=\"https://arstechnica.com/?p=1993810#p3\">Read 22 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1993810&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"98a3b74538b7cf3231e066b61939ef1536ed9969aad63e76bd71933603719422","category":"Tech"}