{"title":"Apple Music Users Report Seeing Other People's Playlists in Their Libraries","link":"https://www.macrumors.com/2023/03/22/apple-music-users-report-unrecognized-playlists/","date":1679480513000,"content":"Apple Music appears to be sparking serious privacy concerns for some users, with multiple complaints on Reddit about other people's playlists randomly appearing in their music libraries in the Music app.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/03/music-strange-playlists-2.jpg\" alt width=\"3024\" height=\"1964\" />\r<br />\nRedditor adh1003, who contacted <em>MacRumors</em> about the issue, has <a href=\"https://www.reddit.com/r/AppleMusic/comments/11ejjbd/comment/jafw6vl/\">compiled several reports</a> from users complaining about the appearance of strange playlists in the app that they do not recognize. <em>MacRumors</em> has since found other posts on Reddit from users <a href=\"https://www.reddit.com/r/AppleMusic/comments/11xxdfm/unknown_playlist_im_100_i_have_never_made_this/\">reporting the same behavior</a>. \r<br />\n\r<br />\nIn some cases, unknown playlists have been merged with user's existing playlists. In other cases, user's playlists have gone missing/been replaced by unrecognized ones. \r<br />\n\r<br />\nSome users have expressed concerns that their Apple accounts have been hacked, but the more likely cause of the issue is an unspecified problem with Apple's iCloud server. Unsyncing and then re-syncing iCloud for the Music app (Settings -&gt; Apple ID -&gt; iCloud -&gt; Show All) has worked for a handful of users, but not all. \r<br />\n\r<br />\nBased on reports, the appearance of unrecognized playlists is only occurring in the Music app for iPhone, with the Music app for macOS remaining unaffected. User reports regarding the issue date back to mid February, suggesting the problem could be related to the <a href=\"https://www.macrumors.com/2023/02/13/apple-releases-ios-16-3-1/\">release of iOS 16.3.1</a>, which included a bug fix for iCloud settings.\r<br />\n\r<br />\nSome users have contacted Apple support to resolve the issue but none have reported success. We've contacted Apple about the problem and will update this article if we learn more.\r<br />\n\r<br />\nThe issue is reminiscent of another iCloud bug that occurred <a href=\"https://www.macrumors.com/2022/11/21/icloud-for-windows-corrupt-video-bug/\">last year</a> in which some users reported videos and images from strangers appearing in their Photo Libraries.<div>Tag: <a href=\"https://www.macrumors.com/guide/apple-music/\">Apple Music</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/22/apple-music-users-report-unrecognized-playlists/\">Apple Music Users Report Seeing Other People's Playlists in Their Libraries</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-music-users-report-seeing-other-peoples-playlists-in-their-libraries.2384419/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"98a3410d8b96cadd109ec8b9584f3deec976d86236b9d37e2b91b0d38be99094","category":"Apple"}