{"title":"The Guide To Ethical Scraping Of Dynamic Websites With Node.js And Puppeteer","link":"https://smashingmagazine.com/2021/03/ethical-scraping-dynamic-websites-nodejs-puppeteer/","date":1615465800000,"content":"<p>Let’s start with a little section on what web scraping actually means. All of us use web scraping in our everyday lives. It merely describes the process of extracting information from a website. Hence, if you copy and paste a recipe of your favorite noodle dish from the internet to your personal notebook, you are performing <em>web scraping</em>.</p>\n<p>When using this term in the software industry, we usually refer to the <strong>automation of this manual task</strong> by using a piece of software. Sticking to our previous “noodle dish” example, this process usually involves two steps:</p>\n<ul>\n<li><strong>Fetching the page</strong><br />We first have to download the page as a whole. This step is like opening the page in your web browser when scraping manually.</li>\n<li><strong>Parsing the data</strong><br />Now, we have to extract the recipe in the HTML of the website and convert it to a machine-readable format like JSON or XML.</li>\n</ul>\n<p>In the past, I have worked for many companies as a data consultant. I was amazed to see how many data extractions, aggregation, and enrichment tasks are still done manually although they easily could be automated with just a few lines of code. That is exactly what web scraping is all about for me: <strong>extracting and normalizing valuable pieces of information</strong> from a website to fuel another value-driving business process.</p>\n<p>During this time, I saw companies use web scraping for all sorts of use cases. Investment firms were primarily focused on gathering alternative data, like <strong>product reviews</strong>, price information, or social media posts to underpin their financial investments.</p>\n<p>Here’s one example. A client approached me to scrape product review data for an extensive list of products from several e-commerce websites, including the rating, location of the reviewer, and the review text for each submitted review. The result data enabled the client to <strong>identify trends</strong> about the product’s popularity in different markets. This is an excellent example of how a seemingly “useless” single piece of information can become valuable when compared to a larger quantity.</p>\n<p>Other companies accelerate their sales process by using web scraping for <strong>lead generation</strong>. This process usually involves extracting contact information like the phone number, email address, and contact name for a given list of websites. Automating this task gives sales teams more time for approaching the prospects. Hence, the efficiency of the sales process increases.</p>\n<h3>Stick To The Rules</h3>\n<p>In general, web scraping publicly available data is legal, as confirmed by the jurisdiction of the <a href=\"https://www.cpomagazine.com/data-privacy/what-the-hiq-vs-linkedin-case-means-for-automated-web-scraping/\">Linkedin vs. HiQ</a> case. However, I have set myself an ethical set of rules that I like to stick to when starting a new web scraping project. This includes:</p>\n<ul>\n<li><strong>Checking the robots.txt file.</strong><br />It usually contains clear information about which parts of the site the page owner is fine to be accessed by robots &amp; scrapers and highlights the sections that should not be accessed.</li>\n<li><strong>Reading the terms and conditions.</strong><br />Compared to the robots.txt, this piece of information is not available less often, but usually states how they treat data scrapers.</li>\n<li><strong>Scraping with moderate speed.</strong><br />Scraping creates server load on the infrastructure of the target site. Depending on what you scrape and at which level of concurrency your scraper is operating, the traffic can cause problems for the target site’s server infrastructure. Of course, the server capacity plays a big role in this equation. Hence, the speed of my scraper is always a <strong>balance between the amount of data that I aim to scrape and the popularity of the target site.</strong> Finding this balance can be achieved by answering a single question: “Is the planned speed going to significantly change the site’s organic traffic?”. In cases where I am unsure about the amount of natural traffic of a site, I use tools like <a href=\"https://ahrefs.com\">ahrefs</a> to get a rough idea.</li>\n</ul>\n<h3>Selecting The Right Technology</h3>\n<p>In fact, <strong>scraping with a headless browser</strong> is one of the <em>least</em> performant technologies you can use, as it heavily impacts your infrastructure. One core from your machine’s processor can approximately handle one Chrome instance.</p>\n<p>Let’s do a quick <em>example calculation</em> to see what this means for a real-world web scraping project.</p>\n<h4>Scenario</h4>\n<ul>\n<li>You want to scrape 20,000 URLs.</li>\n<li>The average response time from the target site is 6 seconds.</li>\n<li>Your server has 2 CPU cores.</li>\n</ul>\n<p>The project will take <strong>16 hours</strong> to complete.</p>\n<p>Hence, I always try to avoid using a browser when conducting a scraping feasibility test for a dynamic website.</p>\n<p>Here is a small checklist that I always go through:</p>\n<ul>\n<li>Can I force the required page state through GET-parameters in the URL? If yes, we can simply run an HTTP-request with the appended parameters.</li>\n<li>Are the dynamic information part of the page source and available through a JavaScript object somewhere in the DOM? If yes, we can again use a normal HTTP-request and parse the data from the stringified object.</li>\n<li>Are the data fetched through an XHR-request? If so, can I directly access the endpoint with an HTTP-client? If yes, we can send an HTTP-request to the endpoint directly. A lot of times, the response is even formatted in JSON, which makes our life much easier.</li>\n</ul>\n\n<p>If all questions are answered with a definite “No”, we officially run out of feasible options for using an HTTP-client. Of course, there might be more site-specific tweaks that we could try, but usually, the required time to figure them out is too high, compared to the slower performance of a headless browser. The beauty of scraping with a browser is that you can scrape anything that is subject to the following basic rule:</p>\n<p><strong>If you can access it with a browser, you can scrape it.</strong></p>\n<p>Let’s take the following site as an example for our scraper: <a href=\"https://quotes.toscrape.com/search.aspx\">https://quotes.toscrape.com/search.aspx</a>. It features quotes from a list of given authors for a list of topics. All data is fetched via XHR.</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8fb6a20c-5e1e-4a5b-80ca-98f167131bfa/1-guide-ethical-scraping-dynamic-websites-nodejs-puppeteer.jpg\" /></p>\n<p>Whoever took a close look at the site’s functioning and went through the checklist above probably realized that the quotes could actually be scraped using an HTTP client, as they can be retrieved by making a POST-request on the quotes endpoint directly. But since this tutorial is supposed to cover how to scrape a website using Puppeteer, we will pretend this was impossible.</p>\n<h3>Installing Prerequisites</h3>\n<p>Since we are going to build everything using Node.js, let’s first create and open a new folder, and create a new Node project inside, running the following command:</p>\n<pre><code>mkdir js-webscraper\ncd js-webscraper\nnpm init</code></pre>\n\n<p>Please make sure you have already installed npm. The installer will ask us a few questions about meta-information about this project, which we can all skip, hitting Enter.</p>\n<h4>Installing Puppeteer</h4>\n<p>We have been talking about scraping with a browser before. Puppeteer is a Node.js API that allows us to talk to a <strong>headless Chrome instance</strong> programmatically.</p>\n<p>Let’s install it using npm:</p>\n<pre><code>npm install puppeteer</code></pre>\n\n<h3>Building Our Scraper</h3>\n<p>Now, let’s start to build our scraper by creating a new file, called <em>scraper.js</em>.</p>\n<p>First, we import the previously installed library, Puppeteer:</p>\n<pre><code>const puppeteer = require('puppeteer');</code></pre>\n\n<p>As a next step, we tell Puppeteer to open up a new browser instance inside an asynchronous and self-executing function:</p>\n<pre><code>(async function scrape() {\n  const browser = await puppeteer.launch({ headless: false });\n  // scraping logic comes here…\n})();</code></pre>\n\n<p><strong>Note</strong>: <em>By default, the headless mode is switched off, as this increases performance. However, when building a new scraper, I like to turn off the headless mode. This allows us to follow the process the browser is going through and see all rendered content. This will help us debug our script later on.</em></p>\n<p>Inside our opened browser instance, we now open a new page and direct towards our target URL:</p>\n<pre><code>const page = await browser.newPage();\nawait page.goto('https://quotes.toscrape.com/search.aspx');</code></pre>\n\n<p>As part of the asynchronous function, we will use the <code>await</code> statement to wait for the following command to be executed before proceeding with the next line of code.</p>\n<p>Now that we have successfully opened a browser window and navigated to the page, we have to <strong>create the website’s state</strong>, so the desired pieces of information become visible for scraping.</p>\n<p>The available topics are generated dynamically for a selected author. Hence, we will first select ‘Albert Einstein’ and wait for the generated list of topics. Once the list has been fully generated, we select ‘learning’ as a topic and select it as a second form parameter. We then click on submit and extract the retrieved quotes from the container that is holding the results.</p>\n<p>As we will now convert this into JavaScript logic, let’s first make a list of all element selectors that we have talked about in the previous paragraph:</p>\n<table>\n  <tbody>\n    <tr>\n      <td>Author select field</td>\n      <td><code>#author</code></td>\n    </tr>\n    <tr>\n      <td>Tag select field</td>\n      <td><code>#tag</code></td>\n    </tr>\n    <tr>\n      <td>Submit button</td>\n      <td><code>input[type=\"submit\"]</code></td>\n    </tr>\n    <tr>\n      <td>Quote container</td>\n      <td><code>.quote</code></td>\n    </tr>\n  </tbody>\n</table>\n\n<p>Before we start interacting with the page, we will ensure that all elements that we will access are visible, by adding the following lines to our script:</p>\n<pre><code>await page.waitForSelector('#author');\nawait page.waitForSelector('#tag');</code></pre>\n\n<p>Next, we will select values for our two select fields:</p>\n<pre><code>await page.select('select#author', 'Albert Einstein');\nawait page.select('select#tag', 'learning');</code></pre>\n\n<p>We are now ready to conduct our search by hitting the “Search” button on the page and wait for the quotes to appear:</p>\n<pre><code>await page.click('.btn');\nawait page.waitForSelector('.quote');</code></pre>\n\n<p>Since we are now going to access the HTML DOM-structure of the page, we are calling the provided <code>page.evaluate()</code> function, selecting the container that is holding the quotes (it is only one in this case). We then build an object and define null as the fallback-value for each <code>object</code> parameter:</p>\n<div>\n<pre><code>let quotes = await page.evaluate(() =&gt; {\n        let quotesElement = document.body.querySelectorAll('.quote');\n  let quotes = Object.values(quotesElement).map(x =&gt; {\n              return {\n                  author: x.querySelector('.author').textContent ?? null,\n    quote: x.querySelector('.content').textContent ?? null,\n    tag: x.querySelector('.tag').textContent ?? null,\n  };\n});\n return quotes;\n});</code></pre>\n</div>\n\n<p>We can make all results visible in our console by logging them:</p>\n<pre><code>console.log(quotes);</code></pre>\n\n<p>Finally, let’s close our browser and add a catch statement:</p>\n<pre><code>await browser.close();</code></pre>\n\n<p>The complete scraper looks like the following:</p>\n<div>\n <pre><code>const puppeteer = require('puppeteer');\n\n(async function scrape() {\n    const browser = await puppeteer.launch({ headless: false });\n\n    const page = await browser.newPage();\n    await page.goto('<a href=\"https://quotes.toscrape.com/search.aspx')\">https://quotes.toscrape.com/search.aspx')</a>;\n\n    await page.waitForSelector('#author');\n    await page.select('#author', 'Albert Einstein');\n\n    await page.waitForSelector('#tag');\n    await page.select('#tag', 'learning');\n\n    await page.click('.btn');\n    await page.waitForSelector('.quote');\n\n    // extracting information from code\n    let quotes = await page.evaluate(() =&gt; {\n\n        let quotesElement = document.body.querySelectorAll('.quote');\n        let quotes = Object.values(quotesElement).map(x =&gt; {\n            return {\n                author: x.querySelector('.author').textContent ?? null,\n                quote: x.querySelector('.content').textContent ?? null,\n                tag: x.querySelector('.tag').textContent ?? null,\n\n            }\n        });\n\n        return quotes;\n\n    });\n\n    // logging results\n    console.log(quotes);\n    await browser.close();\n\n})();\n</code></pre>\n</div>\n\n\n<p>Let’s try to run our scraper with:</p>\n<pre><code>node scraper.js</code></pre>\n\n<p>And there we go! The scraper returns our quote object just as expected:</p>\n<p><img src=\"https://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9b803d20-5b03-4119-a3e0-fdcb621028e9/3-guide-ethical-scraping-dynamic-websites-nodejs-puppeteer.jpg\" /></p>\n<h3>Advanced Optimizations</h3>\n<p>Our basic scraper is now working. Let’s add some improvements to prepare it for some more serious scraping tasks.</p>\n<h4>Setting A User-Agent</h4>\n<p>By default, Puppeteer uses a user-agent that contains the string <code>HeadlessChrome</code>. Quite a few websites look out for this sort of signature and <strong>block incoming requests</strong> with a signature like that one. To avoid that from being a potential reason for the scraper to fail, I always set a <em>custom</em> user-agent by adding the following line to our code:</p>\n<div>\n<pre><code>await page.setUserAgent('Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4298.0 Safari/537.36');</code></pre>\n</div>\n\n<p>This could be improved even further by choosing a random user-agent with each request from an array of the top 5 most common user-agents. A list of the most common user-agents can be found in a piece on <a href=\"https://techblog.willshouse.com/2012/01/03/most-common-user-agents/\">Most Common User-Agents</a>.</p>\n<h4>Implementing A Proxy</h4>\n<p>Puppeteer makes connecting to a proxy very easy, as the proxy address can be passed to Puppeteer on launch, like this:</p>\n<pre><code>const browser = await puppeteer.launch({\n  headless: false,\n  args: [ '--proxy-server=&lt;PROXY-ADDRESS&gt;' ]\n});</code></pre>\n\n<p><a href=\"https://www.sslproxies.org/\">sslproxies</a> provides a large list of free proxies that you can use. Alternatively, <a href=\"https://zenscrape.com/ultimate-list-15-best-services-offering-rotating-proxies/\">rotating proxy services</a> can be used. As proxies are usually shared between many customers (or free users in this case), the connection becomes much more unreliable than it already is under normal circumstances. This is the perfect moment to talk about error handling and retry-management.</p>\n<h4>Error And Retry-Management</h4>\n<p>A lot of factors can cause your scraper to fail. Hence, it is important to handle errors and decide what should happen in case of a failure. Since we have connected our scraper to a proxy and expect the connection to be unstable (especially because we are using free proxies), we want to <strong>retry four times</strong> before giving up.</p>\n<p>Also, there is no point in retrying a request with the same IP address again if it has previously failed. Hence, we are going to build a small <strong>proxy rotating system</strong>.</p>\n<p>First of all, we create two new variables:</p>\n<pre><code>let retry = 0;\nlet maxRetries = 5;</code></pre>\n\n<p>Each time we are running our function <code>scrape()</code>, we will increase our retry variable by 1. We then wrap our complete scraping logic with a try and catch statement so we can handle errors. The retry-management happens inside our <code>catch</code> function:</p>\n<p>The previous browser instance will be closed, and if our retry variable is smaller than our <code>maxRetries</code> variable, the scrape function is called recursively.</p>\n<p>Our scraper will now look like this:</p>\n<pre><code>const browser = await puppeteer.launch({\n  headless: false,\n  args: ['--proxy-server=' + proxy]\n});\ntry {\n  const page = await browser.newPage();\n  … // our scraping logic\n} catch(e) {\n  console.log(e);\n  await browser.close();\n  if (retry &lt; maxRetries) {\n    scrape();\n  }\n};</code></pre>\n\n<p>Now, let us add the previously mentioned proxy rotator.</p>\n<p>Let’s first create an array containing a list of proxies:</p>\n<pre><code>let proxyList = [\n  '202.131.234.142:39330',\n  '45.235.216.112:8080',\n  '129.146.249.135:80',\n  '148.251.20.79'\n];</code></pre>\n\n<p>Now, pick a random value from the array:</p>\n<div>\n<pre><code>var proxy = proxyList[Math.floor(Math.random() * proxyList.length)];</code></pre>\n</div>\n\n<p>We can now run the dynamically generated proxy together with our Puppeteer instance:</p>\n<pre><code>const browser = await puppeteer.launch({\n  headless: false,\n  args: ['--proxy-server=' + proxy]\n});</code></pre>\n\n<p>Of course, this proxy rotator could be further optimized to flag dead proxies, and so on, but this would definitely go beyond the scope of this tutorial.</p>\n<p>This is the code of our scraper (including all improvements):</p>\n<div>\n <pre><code>const puppeteer = require('puppeteer');\n\n// starting Puppeteer\n\nlet retry = 0;\nlet maxRetries = 5;\n\n(async function scrape() {\n    retry++;\n\n    let proxyList = [\n        '202.131.234.142:39330',\n        '45.235.216.112:8080',\n        '129.146.249.135:80',\n        '148.251.20.79'\n    ];\n\n    var proxy = proxyList[Math.floor(Math.random() * proxyList.length)];\n\n    console.log('proxy: ' + proxy);\n\n    const browser = await puppeteer.launch({\n        headless: false,\n        args: ['--proxy-server=' + proxy]\n    });\n\n    try {\n        const page = await browser.newPage();\n        await page.setUserAgent('Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/88.0.4298.0 Safari/537.36');\n\n        await page.goto('<a href=\"https://quotes.toscrape.com/search.aspx')\">https://quotes.toscrape.com/search.aspx')</a>;\n\n        await page.waitForSelector('select#author');\n        await page.select('select#author', 'Albert Einstein');\n\n        await page.waitForSelector('#tag');\n        await page.select('select#tag', 'learning');\n\n        await page.click('.btn');\n        await page.waitForSelector('.quote');\n\n        // extracting information from code\n        let quotes = await page.evaluate(() =&gt; {\n\n            let quotesElement = document.body.querySelectorAll('.quote');\n            let quotes = Object.values(quotesElement).map(x =&gt; {\n                return {\n                    author: x.querySelector('.author').textContent ?? null,\n                    quote: x.querySelector('.content').textContent ?? null,\n                    tag: x.querySelector('.tag').textContent ?? null,\n\n                }\n            });\n\n            return quotes;\n\n        });\n\n        console.log(quotes);\n\n        await browser.close();\n    } catch (e) {\n\n        await browser.close();\n\n        if (retry &lt; maxRetries) {\n            scrape();\n        }\n    }\n})();\n</code></pre>\n</div>\n\n<p>Voilà! Running our scraper inside our terminal will return the quotes.</p>\n<h4>Playwright As An Alternative To Puppeteer</h4>\n<p>Puppeteer was developed by Google. At the beginning of 2020, Microsoft released an alternative called <a href=\"https://github.com/microsoft/playwright\">Playwright</a>. Microsoft headhunted a lot of engineers from the Puppeteer-Team. Hence, Playwright was developed by a lot of engineers that already got their hands working on Puppeteer. Besides being the new kid on the blog, Playwright’s biggest differentiating point is the cross-browser support, as it supports Chromium, Firefox, and WebKit (Safari).</p>\n<p>Performance tests (<a href=\"https://blog.checklyhq.com/puppeteer-vs-selenium-vs-playwright-speed-comparison/\">like this one</a> conducted by Checkly) show that Puppeteer generally provides about 30% better performance, compared to Playwright, which matches my own experience — at least at the time of writing.</p>\n<p>Other differences, like the fact that you can run multiple devices with one browser instance, are not really valuable for the context of web scraping.</p>\n<h4>Resources And Additional Links</h4>\n<ul>\n<li><a href=\"https://pptr.dev/\">Puppeteer Documentation</a></li>\n<li><a href=\"https://theheadless.dev/\">Learning Puppeteer &amp; Playwright</a></li>\n<li><a href=\"https://zenscrape.com/web-scraping-with-javascript-and-node-js-tutorial/\">Web Scraping with Javascript</a> by Zenscrape</li>\n<li><a href=\"https://techblog.willshouse.com/2012/01/03/most-common-user-agents/\">Most Common User-Agents</a></li>\n<li><a href=\"https://blog.checklyhq.com/puppeteer-vs-selenium-vs-playwright-speed-comparison/#:~:text=The%20first%20thing%20that%20catches,less%20variation%20in%20its%20performance.\">Puppeteer vs. Playwright</a></li>\n</ul>","author":"","siteTitle":"Articles on Smashing Magazine — For Web Designers And Developers","siteHash":"ab069ca35bf300e9db0da36f49701f66485a5b0d2db0471dfeee07cef6204939","entryHash":"98ae88955e637e9f7e8c73f4fce04afdc7afe1a167a781403630cb6f7ba89470","category":"Tech"}