{"title":"Beneficial effects of native broadleaved forests on canopy beetle diversity are not reduced by admixture of non‐native conifers","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14623?af=R","date":1710426837000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/85aa52ca-637c-4793-9f04-294e13174331/jpe14623-toc-0001-m.png\" alt=\"Beneficial effects of native broadleaved forests on canopy beetle diversity are not reduced by admixture of non-native conifers\" />\n<p>Monospecific stands of fast-growing non-native Douglas fir and native Norway spruce planted outside its natural occurrence showed undesirable effects such as low diversity and a shifted community composition of canopy beetles compared to native European beech. However, mixed stands mitigated negative effects and specifically admixed non-native Douglas fir did not reduce species turnover and landscape-scale beetle diversity. In line with recent studies on other forest taxa, we conclude that admixtures of introduced conifers to European beech forests, but not monospecific plantations, can potentially serve as a compromise between conservational and economic interests.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBiodiversity loss and vast forest diebacks due to climate change-induced disturbances require adapted forest management strategies that reconcile economic interests and conservation. Tree species selection, including admixture of fast-growing and drought-tolerant non-native species to native forests, is an increasingly considered approach. However, we lack data on how such mixtures affect native forest biodiversity, especially for the sparsely researched major above-ground part of trees, the canopy.\n\nIn 40 temperate forest plots in northwest Germany, we investigated how monocultures and admixtures of introduced fast-growing conifers (native Norway spruce planted outside its natural range and non-native Douglas fir) to native broadleaved European beech forests affect abundance, biomass, taxonomic and functional diversity and community composition of canopy beetles across trophic guilds. Diverse arthropod communities are vital contributors to forest health and resilience, and therefore valuable indicators to assess and evaluate forestry measures.\n\nMonospecific stands of non-native Douglas fir reduced canopy beetle abundance and diversity compared to native European beech, exceeding the negative effects of Norway spruce. These effects were more pronounced for herbivorous beetles, while they were less strong for predators. Beetle communities in monospecific Norway spruce stands had low functional richness. European beech and mixtures with non-native Douglas fir had high dissimilarity between local communities (turnover, i.e. beta diversity) and high total beetle diversity at landscape scale (gamma diversity). Mixtures generally mitigated the negative effects of introduced conifers, including shifts in species community composition compared to native European beech.\n\n<i>Synthesis and applications</i>: Monospecific stands of fast-growing non-native Douglas fir and native Norway spruce planted outside its natural occurrence showed undesirable effects such as low diversity and a shifted community composition of canopy beetles compared to native European beech. However, mixed stands mitigated negative effects and specifically admixed non-native Douglas fir did not reduce species turnover and landscape-scale beetle diversity. In line with recent studies on other forest taxa, we conclude that admixtures of introduced conifers to European beech forests, but not monospecific plantations, can potentially serve as a compromise between conservational and economic interests.\n</p>","author":"Benjamin Wildermuth, \nJonas Hagge, \nCarlo L. Seifert, \nRoman Tjaden, \nAndreas Schuldt","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"98ae86b81fb20224c5ca1e8d74c72e9f3972859f9a534395f2fa0e44cd5aa03b","category":"Environment"}