{"title":"Impact of Cumulus Options from WRF-Chem in Atmospheric Modeling in the Andean Region of Southern Ecuador","link":"https://www.preprints.org/manuscript/202404.1109/v1","date":1713333199000,"content":"Cumulus parameterization schemes model the subgrid-scale effects of moist convection, affecting the prognostic of cloud formation, rainfall, energy levels reaching the surface, and air quality. Working with a spatial resolution of 1 km, we studied the influence of cumulus parameterization schemes coded in the Weather Research &amp;amp; Forecasting with Chemistry Version 3.2 (WRF-Chem 3.2) for atmospheric modeling in Cuenca, an Andean city of Southern Ecuador (2500 masl), during September 2014. For assessing the performance, we used meteorological records from the urban area and stations located mainly over the Cordillera, with heights above 3000 masl, and air quality records from the urban area. Firstly, we did not use any cumulus parameterization (0 No Cumulus). Then we considered four schemes: 1 Kain-Fritsch, 2 Betts-Miller-Janjic, 3 Grell-Devenyi, and 4 Grell-3 Ensemble. On average, the 0 No Cumulus option was better for modeling meteorological variables over the urban area, capturing 66.5% of records and being the best for precipitation (77.8%). However, 1 Kaint-Fritsch was better for temperature (78.7%) and 3 Grell-Devenyi for wind speed (77.0%) and wind direction (37.9%). All the options provided acceptable and comparable performances for modeling short-term and long-term air quality variables. The results suggested that using no cumulus scheme could be beneficial for holistically modeling meteorological and air quality variables in the urban area. However, all the options, including deactivating the cumulus scheme, overestimated the total amount of precipitation over the Cordillera, implying that its modeling needs to be improved, particularly for studies on water supply and hydrological management. New WRF-Chem versions and microphysics parameterization, the other component directly related to cloud and rainfall processes, must be assessed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"98b423be623cd089df38425e9c810340802dfc5370b5b363c19ba53b41c76960","category":"Interdisciplinary"}