{"title":"PSIV-A-10 Pilot study: Acute changes in mare milk composition in response to concentrate feeding","link":"https://academic.oup.com/jas/article/102/Supplement_2/356/7664933?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Evaluating dietary effects on mare milk composition is important for optimizing nutrition programs for broodmares. Additionally, accurately measuring milk composition is important for many research studies. Different techniques have been used to collect milk samples, however, the effect time of collection after feeding has not been investigated. The objective of this study was to evaluate the short-term changes in mare milk composition after a concentrate meal. We hypothesized that milk composition, specifically lactose, follows a similar pattern as blood glucose after a high starch meal. Milk samples were collected from four mares at 6 to 7 d postpartum. Baseline blood samples and milk samples were collected, then mares were fed a concentrate meal containing 0.697 g starch/kg body weight (BW). Blood samples were collected via jugular venipuncture at 60, 120, 240, 360, and 480 min postprandial. Blood glucose was measured using a glucometer (OneTouch Ultra 2, LifeScan, USA). Milk samples were collected every 60 min for 480 min postprandial. Foals were muzzled for 60 min intervals and allowed to nurse at each time point to induce milk ejection. Milk samples (&gt; 50 mL) were collected by hand while foals nursed. Milk lactose was measured using an infrared-based milk analyzer (MilkoScan FT+, Foss, Denmark). Area under the curve for lactose and glucose were calculated using the trapezoid method. Changes over time in milk lactose and blood glucose were evaluated using mixed model ANOVA with repeated measures. Pearson’s correlation coefficient was used to evaluate relationships between variables (SAS 9.4). Results were considered significant when <span>P</span> &lt; 0.05. There was a change over time in milk lactose after the concentrate meal (<span>P</span> &lt; 0.0001). Milk lactose was the least pre-feeding (59.0 ± 0.50 g/L) and greatest between 240 to 360 min postprandial (61.6 ± 0.47 g/L; <span>P</span> &lt; 0.05). Blood glucose changed over time after the concentrate meal (<span>P</span> = 0.0365). Pre-feeding glucose was 88.25 ± 2.10 mg/dL which increased to 126.75 ± 10.82 mg/dL by 60 min postprandial (<span>P</span> &lt; 0.05). By 240 min blood glucose was similar to pre-feeding (91.25 ± 6.90 mg/dL; <span>P</span> &gt;0.05). Mean blood glucose AUC was 663 and mean milk lactose AUC was 834. Time to peak glucose was 82.5 min whereas time to peak milk lactose was 225 min. There was no relationship between peak blood glucose and peak milk lactose (<span>P</span> = 0.7311) or AUC for blood glucose or milk lactose (<span>P</span> = 0.8256). The lack of significant relationships may be due to the small sample size. The results from this pilot study demonstrated short term changes in milk lactose after a concentrate meal. Collecting milk samples between 240 to 360 min may be suitable to evaluate dietary effects on milk lactose. However, additional research is needed to evaluate other milk components.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"98c11926a721f3fea52c0a7d85454c8216aee2b66d9aa4aa47bb54fbf0bafad0","category":"Environment"}