{"title":"Giro d’Italia pro bike: Thibaut Pinot’s personalised Lapierre Xelius SL3","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-d-italia-pro-bike-thibaut-pinot-s-personalised-lapierre-xelius-sl3","date":1685120032000,"content":"\n      <p><span>While he is in his final season as a professional bike rider, Thibaut Pinot is certainly not going out quietly. The Groupama-FDJ rider has been impressively active throughout this year’s <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, currently leading the mountains classification and finishing in second place on two tough stages. Pinot is known for his attacking style and trademark climbing technique in which he varies the pace and gets in and out of the saddle regularly. His Lapierre Xelius SL3 is set-up to assist Pinot as he storms up the climbs in this unique style – he has an upright position clearly made for climbing rather than aerodynamic benefits.</span></p>\n<div></div>\n<p><span>The Xelius SL3 was released at the start of 2022 as the third-generation Xelius from French bike brand Lapierre. On release, this version of the Xelius was said to be the lightest yet, despite it being disc-brake only. Lapierre claimed that the new SL3 was designed to be “more racy, more aggressive and more powerful”. It featured a new carbon construction with lighter and stronger Torayca carbon fibres, as well as a new “rigid polypropylene mandrel”, which Lapierre says offers improved stability during the lay-up phase.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre04_rouleur_Giro_2023_1024x1024.jpg?v=1685115167\" alt />Another key area where Lapierre’s Xelius SL3 was improved compared to the previous iteration is in aerodynamics. The down tube, seat tube and seatstays were all redesigned when the bike was released, as was the aero profile of the head tube and forks. The compact frame design borrows its geometry from Lapierre’s Aircode DRS (a frame that’s used by Groupama-FDJ’s sprinters and rouleurs), it should lower a rider’s centre of gravity on fast descents and improve aerodynamics. The hole between the seat tube into the dropouts is said to be there to increase compliance and comfort on rough surfaces.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre07_rouleur_Giro_2023_1024x1024.jpg?v=1685115191\" alt />At the front of Pinot’s bike, he is using Lapierre’s integrated cockpit which sits on top of a very high stack height – the Frenchman is not adhering to the trend of slammed stems that is more common in today’s peloton. His shifters also sit high and his handlebars are wide, this is likely to give Pinot more leverage to get in and out of the saddle and really torque the bike during his trademark attacks.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre08_rouleur_Giro_2023_1024x1024.jpg?v=1685115211\" alt />Pinot’s handlebars were dressed in white Prologo bar tape on the drops, and left bare along the tops, one of the few aerodynamic considerations on his Xelius SL3. </span>The saddle that Pinot uses is the Prologo Nago Evo Tirox with carbon rails.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre02_rouleur_Giro_2023_1024x1024.jpg?v=1685115233\" alt />When it comes to gearing, Pinot was using a 54/40 chainring combination his Shimano Dura-Ace R9600 groupset, alongside what looks like an 11-30 cassette. The cassette runs with titanium gears from 19T to the 30T and steel from 11T to 17T for weight saving which is why there is a differentiation in colour.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre05_rouleur_Giro_2023_1024x1024.jpg?v=1685115311\" alt />The top tube of Pinot’s bike features a list of the impressive results he’s achieved in his career so far, something that no doubt motivates the Frenchman when he puts his head down in races. The rest of the bike is painted in Groupama-FDJ’s team colours, it’s blue on the top tube and black on the seat tube with blue and white patterning on the forks and down tube.</span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre03_rouleur_Giro_2023_1024x1024.jpg?v=1685115376\" alt />His bottle cages are Elite’s Leggero Carbon Fibre bottle cages and he’s also using the Elite lightweight bottles. This is a bike designed for every weight saving as Pinot is a rider who will be targeting results in mountainous races this season.</p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Pinot_Lapierre10_rouleur_Giro_2023_1024x1024.jpg?v=1685115412\" alt />Pinot’s bike featured the Shimano Dura-Ace C50 wheels with a 50mm rim depth, intended as an all-around wheel. The tubeless rims feature a 21mm inner rim width to capitalise on optimal aerodynamics when paired with the most popular tyre sizes. Pinot was using Continental GP5000 tubeless tyres which looked to be a 28mm width.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"98c65a34b2358bee2c69d7c9326c0113e452d931d9b416dc4b925f9761633734","category":"Cycling"}