{"title":"How Apple can reboot the iPad in 2024","link":"https://www.macworld.com/article/2159344/how-apple-can-reboot-the-ipad-in-2024.html","date":1701948600000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>After a long and fruitless year, there is finally some hope for fans of the iPad. Following a <a href=\"https://www.macworld.com/article/2107278/new-ipads-october-2023-spec-bump-conflicting-reports.html\">false alarm</a> in October, it now seems almost certain that Apple will kick off 2024 with some new iPads after, for the first time since the device debuted in 2010, finishing a calendar year with no launches or upgrades whatsoever.</p>\n\n\n\n<p>The iPad’s inconsistency isn’t all that surprising.  Arriving three years after the iPhone, many pundits believed it could go on to be even more successful than its predecessor, thanks to its larger screen and greater capabilities as a work machine. Following the tech logic that multiple specialist devices are always eventually replaced by versatile all-rounders, it was thought that consumers would stop carrying around a separate smartphone and laptop and just use a tablet. Despite an initial boom in sales, the iPad revolution never quite happened, and Apple’s tablet remains a relatively minor component of <a href=\"https://www.macworld.com/article/2124873/apple-q4-2023-earnings-loss-iphone-mac-sales.html\">its annual revenue</a>.</p>\n\n\n\n<p>But that doesn’t mean Apple has given up on the iPad. The latest rumors say 2024 will be a big year for the Cupertino tablet, with new models, new features, and every line getting some kind of an update. Fourteen years after its debut, Apple has a rare opportunity to reboot the iPad and inject some real excitement into the tablet again. Provided, that is, Apple does exactly what I say.</p>\n\n\n\n<h2>Step 1: Simplify the range</h2>\n\n\n\n<p>The key here is simplicity because the iPad range at the moment is far too confusing. There are four separate lines available in Apple’s store, with one of these further subdivided by size and another available in two different generations. They all get updated on different (irregular) cycles and at different times, which means you never know when a model is going to be replaced, and the best choice for the average user (as I explain in this <a href=\"https://www.macworld.com/article/625135/ipad-air-m1-review.html\">iPad Air review</a>) is constantly changing. Apple has even committed the branding sin of calling one of its iPads simply “iPad,” so you don’t know whether someone is talking about the range as a whole or specifically its cheapest model.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPad Air (2022) review: Purple colour option\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?quality=50&amp;strip=all 1600w, https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?resize=300%2C202&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?resize=768%2C517&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?resize=1200%2C808&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?resize=1536%2C1034&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2022/03/iPad_Air_2022_review_colour.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"808\" /><figcaption><p>The iPad Air should follow the MacBook Air and become the entry-level tablet,</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<p>I write about iPads all the time and even I find the range baffling. How the average consumer is supposed to know which is which, and how to choose the right model for their needs, is beyond me.</p>\n\n\n\n<p>So here’s the plan. We simplify things. From now on, there are just two iPad sub-brands, to match those of the MacBook: the iPad Pro and the iPad Air. The Pro models are costlier, more powerful, and fuller-featured, with a wider range of premium accessories, aimed at those who want to use them for work and getting things done. The Air models are cheaper, lighter, and more portable (more on that in a bit), and aimed at those who want to check their email and watch Netflix on the sofa.</p>\n\n\n\n<p>If that seems like I’m not offering enough choice, note that there will still be some size variations. Like so:</p>\n\n\n\n<ul>\n<li>iPad Air (8.3 inches)</li>\n\n\n\n<li>iPad Air (11 inches)</li>\n\n\n\n<li>iPad Pro (12.9 inches)</li>\n\n\n\n<li>iPad Pro (14 inches)</li>\n</ul>\n\n\n\n<p>Again, this is to mirror the MacBook range, where the Air models come in 13- and 15-inch sizes, and the Pros in 14 and 16 inches. It’s also to preserve the iPad mini form factor, which offers something different and will now be the cheapest model in the range. Most importantly, this removes the situation where someone looking for a mid-size iPad is faced with four different models and has no obvious way to tell which is best. In this system, it’s straightforward: do you want a basic or advanced iPad? And how big does it need to be? Easy.</p>\n\n\n\n<p>This means that the two just-iPads will be retired and the iPad mini will need to get a little cheaper to fill the void. (I’m thinking $399 will do nicely.) Oh, and you may have heard that Apple is reportedly <a href=\"https://www.macworld.com/article/2164386/spring-2024-larger-ipad-air-oled-ipad-pro-m3-macbook-air.html\">working on a larger iPad Air</a>. Don’t do it, Apple! That will only make things more confusing, and won’t be part of our imaginary revamp.</p>\n\n\n\n<h2>Step 2: Normalize the update cycle</h2>\n\n\n\n<p>From now on, all of the iPads will be updated at the same predictable time. Customers should be aware that, just as new iPhones come out every fall, there will be new iPads every spring. Or, if that’s too frequent, then it could be an 18-month cycle that alternates between spring and fall. But Apple should establish a proper upgrade cycle in 2024 and stick to it in 2025.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/deal/3810815/apple_ipad_pro_11_inch_2021_review_34.jpg?quality=50&amp;strip=all\" alt=\"iPad Pro 2021\" loading=\"lazy\" /><figcaption><p>It’s been more than five years—the iPad Pro needs a redesign.</p></figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Step 3: Do a proper redesign</h2>\n\n\n\n<p>The iPad is difficult to get excited about, and part of that is related to the fact that it never really seems to change. We got the switch to a (sort of) all-screen design, starting with the 3rd-gen iPad Pro in 2018 and gradually diffused into the rest of the range, but there’s been little else for design buffs to get their teeth into.</p>\n\n\n\n<p>So in 2024, whether it’s necessary or not from a functional point of view, we’re going to redesign the lot. First, we’ll have a proper all-screen design, with those fat bezels shrunk back and the front-facing sensors housed in a new Dynamic Island. Second, we’ll offer both Face ID, using the aforementioned sensors, and Touch ID in the power button on all models. Sure, it’s not needed, but each type of biometric input has its fans and we want to attract them all. (Also, each has its advantages in certain situations.)</p>\n\n\n\n<p>And third, we’re going to make the iPad Air thinner. We’re aiming to emulate that “wow” moment when Steve Jobs pulled the first MacBook Air out of a manila envelope. We want people to be excited. The iPad Air isn’t simply going to be a crappier version of the iPad Pro; it will offer something different. It will focus on portability and power efficiency so that it’s easy to carry around but still lasts a long time between charges.</p>\n\n\n<div><figure><img src=\"https://images.macworld.co.uk/cmsdata/features/3810214/apple_ipad_mini_2021_review_24.jpg?quality=50&amp;strip=all\" alt=\"iPad mini\" loading=\"lazy\" /><figcaption><p>We love the iPad mini—but it should become part of the Air line.</p></figcaption></figure><p>Foundry</p></div>\n\n\n\n<h2>Step 4: Give the iPad Pro specs to die for</h2>\n\n\n\n<p><a href=\"https://www.macworld.com/article/2136057/giant-ipad-air-more-expensive-oled-ipad-pro.html\">Rumors</a> suggest that Apple plans to replace the current LED (on the 11-inch model) and mini-LED (12.9-inch) iPad Pro screens with OLED, which provides superior quality, contrast, and power efficiency. It’s also understood that the 2024 iPad Pro will get an M3 processor. As the imaginary head of the iPad division, I will be following these rumors to the letter, because it’s vital that we really hammer home the Pro’s laptop-replacement capabilities: It’s a MacBook Pro in an iPad.</p>\n\n\n\n<p>You’ll also note, in the screen dimensions listed above, that I like the popular rumor that Apple is about to bump the iPad Pro’s larger size <a href=\"https://www.macworld.com/article/784193/ipad-pro-14-1-inch-display-mini-led-promotion-2023.html\">to 14 inches</a>. Again, this helps to make it more appealing as a work tool, so we’re going to action that one.</p>\n\n\n\n<h2>Step 5: Sort out the Apple Pencil</h2>\n\n\n\n<p>If you think the iPad range is confusing–and believe me, I do–then try to get your head around the <a href=\"https://www.macworld.com/article/2109119/apple-pencil-usb-c-lightning-features-comparison.html\">Apple Pencil lineup</a>. We’ll be simplifying things by ensuring that every iPad currently on sale is compatible with both the USB-C and 2nd-gen Pencils (including magnetic storage and charging), which will make customers’ decision far easier: it will come down to whether they want to pay more and get all the nice features, or pay less but not get pressure sensitivity. Then we can quietly discontinue the 1st-gen Pencil as soon as possible.</p>\n\niPad</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"98c753b414c69048ad2d96293bad74e15ce3cc72795a8e6a58eabad57a2ea7fa","category":"Apple"}