{"title":"Enhancing Colorimetric Detection of Nucleic Acids on Nitrocellulose Membranes: Cutting-Edge Applications in Diagnostics and Forensics","link":"https://www.preprints.org/manuscript/202407.2267/v1","date":1722235825000,"content":"This study re-introduces a protein-free rapid test method for nucleic acids on paper based lateral flow assays utilizing special multichannel nitrocellulose membranes and DNA-Gold conjugates, achieving significantly enhanced sensitivity, easier protocols, reduced time of detection, reduced costs of pro-duction and advanced multiplexing possibilities. It is shown for the first time a protein-free nucleic acid based lateral flow assay (NALFA) with a limit of detection of 1 pmol of DNA. The total production duration of such an assay was successfully reduced from the currently known several days to just a few hours. The simplification and acceleration of the protocol make the method more accessible and practical for various applications. The developed method supports multiplexing, enabling the sim-ultaneous detection of up to six DNA targets. This multiplexing capability is a significant improve-ment over traditional line tests and offers more comprehensive diagnostic potential in a single assay. The approach significantly reduces the run time compared to traditional line tests, which enhances the efficiency of diagnostic procedures. The protein-free aspect of this assay minimizes the prevalent complications of cross-reactivity in immunoassays especially in cases of multiplexing. It is also demonstrated that the NALFA developed in this study is amplification-free and hence does not rely on specialized technicians, nor does it involve labour-intensive steps like DNA extraction and PCR processes. Overall, this study presents a robust, efficient, and highly sensitive platform for DNA or RNA detection, addressing several limitations of current methods documented in the literature. The advancements in sensitivity, cost reduction, production time, and multiplexing capabilities mark a substantial improvement, holding great potential for various applications in diagnostics, forensics, and molecular biology.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"98ca1a5bbc5d9b276e10e0249c6879e5b2f2e546462dcfe80c07801b4f40ba1a","category":"Interdisciplinary"}