{"title":"KBTG เผยวิสัยทัศน์ \"AI จะไม่มาแทนคน แต่คนที่รู้จักใช้ AI จะทำงานแทนคนอื่น\" ในงาน The Age of AI","link":"https://www.blognone.com/node/133535","date":1682332200000,"content":"<div><div><div><p>คุณกระทิง เรืองโรจน์ พูนผล ประธานกลุ่มบริษัท KBTG บรรยายในงาน The Age of AI: Augmented Intelligence นำเสนอแนวทางการยกระดับวงการปัญญาประดิษฐ์ในประเทศไทย และสิ่งที่ต้องระมัดระวังต่อการใช้งานปัญญาประดิษฐ์ต่อไปในอนาคต โดยในปี 2023 นี้นับว่าเป็นจุดเริ่มต้นแห่งยุคปัญญาประดิษฐ์อย่างแท้จริง และโลกกำลังเปลี่ยนจากยุค Mobile First ไปยังยุค AI First</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/55da90418fd51b46d6af7e20dad7a06e.jpg\" /></p>\n<p>คุณกระทิงพูดถึงความกังวลว่าปัญญาประดิษฐ์ว่าจะมาแทนคนทำงาน โดยระบุว่าความกังวลนี้มานานกว่า 200 ปีแล้ว และทุกครั้งก็เป็นความกังวลคล้ายๆ กันว่าเครื่องจักรจะทำให้คนตกงาน แต่เมื่อเรามองพัฒนาการของเทคโนโลยีแต่ละรอบ เรากลับพบว่าเครื่องจักรไม่ได้แทนคนไปเสียหมด แต่คนทำงานกลับมีผลิตภาพ (Productivity) สูงขึ้นอย่างมาก ในมุมมองของคุณกระทิง AI ที่กำลังเข้ามาในปีนี้ก็ไม่ได้มาแทนคนทำงานเช่นกัน แต่คนทำงานที่รู้จักใช้ AI เพื่อพัฒนาศักยภาพของตัวเอง จะสามารถไปแทนคนทำงานคนอื่นๆ ได้ โดยจุดที่ทำให้มนุษยังเป็นส่วนสำคัญอยู่ คือ ความเข้าใจในเพื่อนมนุษย์ (Humanity) และความเห็นอกเห็นใจ (Empathy) ที่ไม่สามารถใช้เครื่องจักรหรือซอฟต์แวร์เข้ามาทดแทนได้</p>\n<p>แนวคิดนี้ทำให้ KBTG มองว่าจำเป็นต้องทำให้คนไทยเข้าใจ AI ให้มากขึ้น เพื่อให้คนไทยมีความรู้ความเข้าใจ และไม่ตกรถไฟเมื่อ AI เข้ามาในชีวิตประจำวันของเรามากขึ้นเรื่อยๆ เมื่อ AI ทำงานร่วมกับมนุษย์ อาจจะเรียกว่า Augmented Intelligence ที่ใช้ความฉลาดของ AI ร่วมกับความฉลาดของมนุษย์ ที่การทดสอบหลายต่อหลายครั้งแสดงให้เห็นว่าสามารถทำงานได้ดีกว่าการใช้ AI อย่างเดียว หรือให้มนุษย์ทำงานโดยไม่มี AI ช่วย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0e355fc84ffd3c88ebf6fd1d75839e00.png\" /></p>\n<p>สำหรับองค์ประกอบที่เพื่อสร้าง Thai AI Ecosystem นั้น คุณกระทิงระบุว่ามี 5 องค์ประกอบ ได้แก่ ฮาร์ดแวร์ที่เรามีใช้งานหรือหาซื้อมาได้, ข้อมูลที่มากขึ้นเรื่อยๆ, ความต้องการของผู้ใช้, โครงสร้างพื้นฐาน เช่น การโทรคมนาคมต่างๆ, และส่วนที่สำคัญที่สุดคือบุคคลากรที่มีความรู้ความเข้าใจใน AI และเป็นจุดที่ขาดกันทั่วโลก</p>\n<p>ที่ผ่านมา KBTG ทำงานเพื่อสร้างบุคคลากรมาอย่างต่อเนื่องผ่านทางโครงการ KBTG KAMPUS ที่ฝึกอบรมความรู้ด้านต่างๆ พร้อมกับการทำงานวิจ้ยระดับลึก</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1017356c14ece3eb10190f9eb2f901f4.jpg\" /></p>\n<p>สำหรับงานวิจัยของ KBTG ในตอนนี้ก็มีทั้งส่วนที่พัฒนาไปใช้งานจริงแล้ว และส่วนที่กำลังอยู่ระหว่างการวิจัยและพัฒนาอยู่ เช่น เบื้องหลังของ Chatbot ที่ ธนาคารกสิกรไทยใช้สื่อสารกับลูกค้าในช่องทางต่างๆ นั้นมีเทคโนโลยีการประมวลผลภาษาธรรมชาติ (Natural Language Processing – NLP) อยู่เบื้องหลัง ทำให้สามารถตอบปัญหาได้อย่างรวดเร็ว สามารถประหยัดเวลาการใช้งานของลูกค้าไปกว่า 500,000 ชั่วโมง</p>\n<p>งานวิจัยที่กำลังอยู่ระหว่างการพัฒนาที่นำเสนอในงาน The Age of AI ครั้งนี้ ทาง KBTG แสดงโครงการ Future You ที่เป็นแพลตฟอร์ม AI เพื่อสร้างตัวตนของผู้ใช้ในอนาคต เช่น ตัวเราเองเมื่ออายุถึง 60 ปีขึ้นมา และเปิดโอกาสให้เราคุยกับตัวเอง ตัวปัญญาประดิษฐ์สามารถสร้างความทรงจำสังเคราะห์ว่าผ่านประสบการณ์อะไรมาบ้าง</p>\n<p>Future You เป็นการพัฒนาจากทฤษฎีทางจิตวิทยาว่าหากเรามีความเชื่อมโยงกับตัวเองในอนาคต เราก็มีพฤติกรรมในเชิงบวก เช่น ออมเงิน, ตั้งใจเรียน, หรือรักษาสุขภาพ ผู้เข้าร่วมโครงการ Future You ยังสามารถลดความรู้สึกแง่ลบกับตัวเองลงได้ มีแรงบันดาลใจในการทำเป้าหมายต่างๆ ที่ตั้งไว้ให้ประสบความสำเร็จ</p>\n<p>แต่สำหรับการสร้างปัญญาประดิษฐ์ภาษาไทยนั้น ทีมนักวิจัยของ KBTG ที่ทำงานวิจัยร่วมกับ MIT Media Lab เริ่มจากโมเดลในกลุ่ม GPT แต่ก็พบว่ามีเงื่อนไข 3 ด้านเพื่อให้ AI ทำงานในภาษาไทยได้ดี ได้แก่</p>\n<ul>\n<li>Language Specific Knowledge: ตัวโมเดลปัญญาประดิษฐ์มีความเข้าใจภาษาและวัฒนธรรม เช่น คำลงท้ายประโยคในภาษาไทย</li>\n<li>Domain Specific Knowledge: ความเข้าใจในความรู้เฉพาะด้าน เช่น ความรู้ด้านการเงินธนาคาร</li>\n<li>Human-Centered Knowledge: ความเข้าใจในพฤติกรรมของมนุษย์ เพื่อให้สามารถทำงานร่วมกับมนุษย์และช่วยเพิ่มศักยภาพของผู้ใช้ได้</li>\n</ul>\n<p>แนวทางนี้ทำให้ทีมงานเรียกสถาปัตยกรรมของปัญญาประดิษฐ์นี้ว่า Knowledge-GPT หรือ K-GPT</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3c094f26fcba1b47722aed5ee2ee7004.png\" /></p>\n<p>สำหรับบริการที่ทีมวิจัยสร้างออกมาจาก K-GPT นี้มีตัวแรกคือ คู่คิด ซึ่งอยู่ในช่วงของการวิจัยและพัฒนา(Proof of Cencept) โดยเปิดให้ผู้ใช้สามารถพูดคุยกับ AI สองตัวที่ชื่อว่า คะน้าและคชา โดย AI ทั้งสองตัวจะมีมุมมองที่ต่างกัน เพื่อช่วยให้ผู้ใช้ที่พูดคุยกับ AI ได้รับมุมมองที่กว้างขึ้น แม้มุมมองจะต่างกัน แต่ AI จะอ้างอิงข้อมูลที่เชื่อถือได้</p>\n<p>แนวทางการสร้าง AI สองตัวคู่กันยังช่วยแก้ปัญหาอคติ (bias) ที่ AI อาจจะเรียนรู้ข้อมูลและมีแนวโน้มจะแนะนำด้านใดด้านหนึ่งเพียงอย่างเดียว การสร้าง AI สองตัวสามารถแนะนำผู้ใช้ในมุมมองที่ต่างกัน ทีมวิจัยทำให้คะน้ามีพฤติกรรมกล้าลอง ขณะที่คชาจะระมัดระวัง</p>\n<p>การสร้างปัญญาประดิษฐ์ที่มีพฤติกรรมต่างกันอาศัยการสร้างความทรงจำสังเคราะห์ ที่ทีมงานได้ประสบการณ์มาจากการสร้างโครงการ Future You แต่ AI ทั้งสองตัวก็เข้าถึงข้อเท็จจริงชุดเดียวกัน และข้อความที่ตอบออกมาก็ผ่านตัวกรองเพื่อให้เหมาะสมกับบริบทในประเทศไทยก่อนแสดงผลให้กับผู้ใช้</p>\n<p>ตัวอย่างคำถามทั่วไป เช่น ทำไมต้องออมเงิน คชาจะตอบถึงข้อดีของการออมเงินว่าเป็นการสร้างความมั่นคงในชีวิต ขณะที่คะน้าจะมองว่าการออมเงินเป็นการสร้างโอกาสใหม่ๆ ที่อาจจะต้องใช้เงินในอนาคตเช่นการไปท่องเที่ยว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/9f70710664e8f29f9b01eb51dc4ebabb.png\" /></p>\n<p>การทำงานด้าน AI มากๆ ยังทำให้ KBTG ร่วมกับ MIT Media Lab และองค์กรต่างๆ เช่น NECTEC, มหาวิทยาลัยธรรมศาสตร์ หารือถึงความเป็นไปได้ในการใช้งาน AI ในอนาคตที่คนในรุ่นต่อไป สามารถใช้ปัญญาประดิษฐ์ได้อย่างมีประสิทธิภาพ โดยออกมามาเป็น Thai AI-Augmented Literacy Guideline ที่วางแนวทางการใช้งาน AI ให้มีประสิทธิภาพและปลอดภัย โดยเตรียมออกร่างแรกภายในเดือนมิถุนายนี้</p>\n<p>อีกด้านหนึ่ง คุณกระทิงก็พูดถึงการใช้งาน AI โดย KBTG ตระหนักถึงประเด็นทางจริยธรรม และประกาศว่า KBTG จะวางหลักการทางจริยธรรมในการใช้ AI และใช้งานกับทุกสินค้าและบริการของ KBTG พร้อมกับจะสนับสนุนคอร์สออนไลน์เพื่อให้ทุกคนได้เรียนรู้ประเด็นทางจริยธรรมกับการใช้งาน AI ได้กว้างขวางขึ้น</p>\n<p>งานครั้งนี้แสดงให้เห็นว่า KBTG ให้ความสำคัญกับเทคโนโลยี AI อย่างเต็มตัว ขณะเดียวกันก็พร้อมที่จะทำงานร่วมกับองค์กรต่างๆ โดยเชิญชวนทุกคนสมัครทดลองใช้งานเทคโนโลยี AI ของ KBTG เช่น Future You และคู่คิดได้แล้ว หรือหากข้อการพัฒนาเทคโนโลยีต่อยอดกับเทคโนโลยีของ KBTG ก็สามารถติดต่อได้ที่ co-innovation@kbtg.tech</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/kbtg\">KBTG</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"98d21ddb280d0d63f5baed0cad3c352579ab3aba793687b858f17613d5507cdf","category":"Thai"}