{"title":"Analysis of Groundwater Time Series With Limited Pumping Information in Unconfined Aquifer: Response Function Based on Lagging Theory","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036747?af=R","date":1718869358000,"content":"<img src=\"https://agupubs.onlinelibrary.wiley.com/cms/asset/9470bd9e-45d6-4714-9b3e-64bb2cabb984/wrcr27277-toc-0001-m.png\" alt=\"Analysis of Groundwater Time Series With Limited Pumping Information in Unconfined Aquifer: Response Function Based on Lagging Theory\" />\n<p>A novel mathematical model for groundwater extraction in unconfined aquifer systems. The model captures drawdown response due to pumping, integrates insights from uniform pumping approach for reflecting heavy pumping activities, the Boussinesq equation for formulating the unconfined flow, and lagging theory for capturing the effect from capillary fringe.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Groundwater extraction from aquifers is a common practice for human use, and variations in groundwater levels can provide valuable information on the hydrogeological properties of the aquifer. However, reliable data on pumping rates and distribution are often lacking due to unsupervised groundwater pumping activities. This study presents a new mathematical model for transfer function modeling that depicts the drawdown response caused by pumping in an unconfined aquifer system. To account for the dense and unsupervised pumping events, the uniform pumping approach was used to estimate these effects. To more accurately represent unconfined flow, the model first integrates lagging theory into a response function derived from the Boussinesq equation. The lagging theory accounts for the effects of both inertial force and capillary suction. Furthermore, the model has been used to derive both specific yield and transmissivity along with two lagging parameters simultaneously using only groundwater level information from the Choshui River region in Taiwan. The estimated results suggest that this approach provides reliable estimates of hydrogeological parameters, demonstrating its usefulness for water resource management and water budget evaluation.</p>","author":"Ying‐Fan Lin, \nHua‐Ting Tseng, \nShih‐Yao Lee, \nHwa‐Lung Yu","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"98d52b9f7812b500b0967895901ef4e77548e91e11f75482c7fd653ff851fb97","category":"Environment"}