{"title":"Charities from our contributors to Issue 106","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/charities-from-our-contributors-to-issue-106","date":1631633817000,"content":"\n      <p><span>The latest issue of Rouleur, number 106, is all about empowering people: giving a platform to those who have often been voiceless, and telling inspirational stories, driven by a diversity of race, age, experience, gender, religion and background. Cycling: everyone should be welcome. Simple. </span></p>\n\n<p><span>We also wanted to make a difference beyond our powerful storytelling. So, we decided to put the green Empower casquette, which our cover star and numerous interviewees wear so well inside our pages, up for sale. You can buy it </span><a href=\"https://www.rouleur.cc/products/empower-cycling-cap\"><b>here</b></a><span>.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Screen_Shot_2021-09-02_at_17.00.45_1024x1024_c8b179f1-474a-4acd-81f1-bdcc717d1015_1024x1024.png?v=1631284657\" />The profits will be divided between a number of cycling charities and good causes. We felt it was reductive to choose just one beneficiary; instead, we asked the contributors who made this edition to choose those close to their heart.</span></p>\n<p><span>Get them while stocks last, and hats off to all the contributors and interviewees in this very special Empower edition.</span></p>\n<h4>\n<strong>SUPPORT AFGHAN CYCLISTS</strong><b><br /></b><span></span>\n</h4>\n<p><span>This isn't exactly a charity; it's a fundraiser to help get Afghan women cyclists out of Afghanistan. These women are on evacuation lists, but funds are necessary to get them out of harm's way. War can make us all feel powerless; this is a small but important way to give power back to those who are most vulnerable. </span> <br /><a href=\"https://fundly.com/support-afghan-cyclists\"><span></span></a></p>\n<p><em><strong><a href=\"https://fundly.com/support-afghan-cyclists\">Find out more</a> </strong></em></p>\n<p><i>Dan Cavallari, writer</i></p>\n<h4><strong></strong></h4>\n<h4><strong>The Bike Project </strong></h4>\n<p><span>The Bike Project fixes up old bikes and gives them to refugees in the UK. They also run cycle training for refugee women in London and Birmingham. A bike offers mobility, freedom, and social connections: the very definition of empowerment. Climate change disproportionately hits the disadvantaged; repairing and recycling old machines reduces demand for the energy-intensive </span>manufacture of new bikes too.</p>\n<p><strong><em><a href=\"https://thebikeproject.co.uk/pages/about-us\">Find out more</a></em></strong></p>\n<p><em>Richard Abraham, writer</em></p>\n<h4><strong>Africa Rising</strong></h4>\n<p>Africa Rising has been instrumental in helping us to build Sierra Leonean cycling, but they’re also active across the continent, from Uganda to Algeria, Benin to Rwanda. They have been making incredible things happen in Africa for a decade now, with no signs of slowing down. From lobbying ambassadors to get athletes visas, to setting up Zwift hubs, your support will help them achieve change, as we fight towards a level playing field for African cyclists. <br /><a href=\"https://teamafricarising.org/\"></a></p>\n<p><a href=\"https://teamafricarising.org/\">Find out more</a><br /><em></em></p>\n<p><em>Tom Owen, writer</em></p>\n\n<h4><strong>Village Bicycle Project</strong></h4>\n<p><span>I got the chance to see the work they do whilst covering the Tour de Lunsar in Sierra Leone. They are doing incredible work to empower local communities by strengthening bike culture, increasing people's freedom and work opportunities. Women and girls, who are often marginalised, are specifically targeted for inclusion in programs which begin to address the gender inequalities that limit their access to bicycles.</span></p>\n<p><a href=\"https://www.villagebicycleproject.org/\"><span>Find out more</span></a></p>\n\n<p><em><span>Matt Grayson, photographer</span></em></p>\n<h4>\n<strong>Bearings Bike Works</strong><span> </span>\n</h4>\n<p><span>Bearings Bike Works is an exciting organisation based in Atlanta, Georgia, that invites kids to earn a bike of their own while developing the skills necessary to </span><span>successfully transition into adulthood.</span> <br /><a href=\"https://bearingsbikeworks.org/\"><span></span></a></p>\n<p><a href=\"https://bearingsbikeworks.org/\"><span>Find out more</span></a> <br /><em></em></p>\n<p><em>Kit Karzen, photographer</em></p>\n<h4><strong>Adsum Foundation Northern Ireland - Sending Bikes to Madagascar</strong></h4>\n<p><span>One of AdSum’s many functions is gathering unwanted Northern Irish cycling steeds, fixing them up, and shipping them off to rural Madagascar where they provide life-changing access to quality and sustainable bike transport for health centre agents, youth leaders, farmers, rural school teachers, and builders. Brendan McCartan has been a stalwart of the initiative since it launched. Nicknamed 'Zulle' for the well-used Saeco top he used to don on Sunday club runs, his work ethic, selflessness, and generosity; are inspiration to what I want Northern Ireland to be known for. At the end of the day, cycling is not about the racing - our sport is here to shine a light of hope on people who are searching for some, and to inspire others to help those who haven’t found hope, yet. But don't take my word for it, Zulle is featured in<a href=\"https://www.bbc.co.uk/aboutthebbc/northernireland/appeals/radio/adsum\"> this article's second video</a></span></p>\n<p><a href=\"https://adsumfoundation.org/bikes\"><span>Find out more</span></a></p>\n\n<p><em>Daniel Stewart, writer</em></p>\n\n<h4><strong>Wheels for Wellbeing</strong></h4>\n<p>Based in south London, this small charity works to make cycling - in all its facets - accessible to disabled people. They helped me out with a university project a few years ago and I never got a chance to give them a proper shout out for both their help and their day-to-day incredible work.</p>\n<p><a href=\"https://wheelsforwellbeing.org.uk/\">Find out more</a></p>\n\n<p><em>Mirianna La Grasta, writer</em></p>\n\n<h4><strong>EMERGENCY</strong></h4>\n<p><span>I would like to pick this charity because its late founder Gino Strada was a great man with great ideas and projects – and somebody who did much to help the Afghan people as well.</span><br /><a href=\"https://en.emergency.it/\"><span></span></a></p>\n<p><a href=\"https://en.emergency.it/\">Find out more</a><br /><i><span></span></i></p>\n<p><i><span>Giacomo Frison, photographer</span></i></p>\n\n<h4><strong>DEBRA - PIEL DE MARIPOSA (Epidermolysis Bullosa)</strong></h4>\n<p>I would like to donate part of the proceeds to the association DEBRA - PIEL DE MARIPOSA (Epidermolysis Bullosa).  I think that although society has recognised this disease, there is still a long way to go in terms of research and development to improve the quality of life of families. <br /><a href=\"https://www.pieldemariposa.es/en/what-is-eb/\"></a></p>\n<p><a href=\"https://www.pieldemariposa.es/en/what-is-eb/\">Find out more</a></p>\n\n<p><em>Gastón Mendieta, artist</em></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"98df0da7e4c492a944c61b842b2e0fedee10c96f65fa497411a5484b674c489b","category":"Cycling"}