{"title":"Spatiotemporal Data Augmentation of MODIS‐Landsat Water Bodies Using Adversarial Networks","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036342?af=R","date":1710313200000,"content":"<h2>Abstract</h2>\n<p>With increasing demands for precise water resource management, there is a growing need for advanced techniques in mapping water bodies. The currently deployed satellites provide complementary data that are either of high spatial or high temporal resolutions. As a result, there is a clear trade-off between space and time when considering a single data source. For the efficient monitoring of multiple environmental resources, various Earth science applications need data at high spatial and temporal resolutions. To address this need, many data fusion methods have been described in the literature, that rely on combining data snapshots from multiple sources. Traditional methods face limitations due to sensitivity to atmospheric disturbances and other environmental factors, resulting in noise, outliers, and missing data. This paper introduces Hydrological Generative Adversarial Network (Hydro-GAN), a novel machine learning-based method that utilizes modified GANs to enhance boundary accuracy when mapping low-resolution MODIS data to high-resolution Landsat-8 images. We propose a new non-saturating loss function for the Hydro-GAN generator, which maximizes the log of discriminator probabilities to promote stable updates and aid convergence. By focusing on reducing squared differences between real and synthetic images, our approach enhances training stability and overall performance. We specifically focus on mapping water bodies using MODIS and Landsat-8 imagery due to their relevance in water resource management tasks. Our experimental results demonstrate the effectiveness of Hydro-GAN in generating high-resolution water body maps, outperforming traditional methods in terms of boundary accuracy and overall quality.</p>","author":"Soukaina Filali Boubrahimi, \nAshit Neema, \nAyman Nassar, \nPouya Hosseinzadeh, \nShah Muhammad Hamdi","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"98e54d96a020870a00f334f56f7c0acbbe33c649d91da0d5224d5a02bb2fcfdc","category":"Environment"}