{"title":"Strategies for enhancing acid resistance of lactobacillus acidophilus through analyzing nutrient consumption patterns","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13424?af=R","date":1709307797000,"content":"<h2>ABSTRACT</h2>\n<h2>Background</h2>\n<p>One of the largest challenges in using <i>Lactobacillus acidophilus</i> as a probiotic is acid stress. The current research aimed to identify substances that help <i>L. acidophilus</i> resist acid stress; this was achieved through assessing its nutrient consumption patterns at various pH conditions.</p>\n<h2>Results</h2>\n<p>The consumption rates of alanine, uracil, adenine, guanine, niacin, and manganese were consistently higher than 60% for <i>L. acidophilus</i> LA-5 cultured at pH 5.8, 4.9 and 4.4. The consumption rates of glutamic acid + glutamine and thiamine increased with decreasing pH and were higher than 60% at pH 4.9 and 4.4. The viable counts of <i>L. acidophilus</i> LA-5 were significantly increased under the corresponding acidic stress conditions (pH 4.9 and 4.4) through the appropriate addition of either alanine (3.37 and 2.81 mM), glutamic acid + glutamine (4.77 mM), guanine (0.13 and 0.17 mM), niacin (0.02 mM), thiamine (0.009 mM) or manganese (0.73 and 0.64 mM) (<i>P</i> &lt; 0.05). The viable counts of <i>L. acidophilus</i> LA-5 cultured in a medium supplemented with combined nutritional factors was1.02–1.03-fold of the counts observed in control medium under all acid conditions (<i>P</i> &lt; 0.05).</p>\n<h2>Conclusion</h2>\n<p>Alanine, glutamic acid + glutamine, guanine, niacin, thiamine and manganese can improve the growth of <i>L. acidophilus</i> LA-5 under acidic environment in present study. The results will contribute to optimising strategies to enhance the acid resistance of <i>L. acidophilus</i> and expand its application in the fermentation industry.</p>\n<p>This article is protected by copyright. All rights reserved.</p>","author":"Yali Qiao, \nBoxing Yin, \nWei Zhou, \nMengrui Wang, \nZiqing Chang, \nJunping Zhou, \nMingzhe Yue, \nJunxia Chen, \nFei Liu, \nZhen Feng","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"98f7b26e2384a9188a997a8762d74bb16a9ecdbf5d07da9e3ece847001457108","category":"Environment"}