{"title":"H-SVEST- Validation of the Hebrew Version of the Second Victim Experience and Support Tool","link":"https://www.preprints.org/manuscript/202409.1762/v1","date":1727088584000,"content":"Adverse medical events not only harm patients and families, but also cause significant negative impact on healthcare providers, with potential to compromise future professional functioning. These “second victims” may need organizational support and rehabilitation to return to functionality. We analyzed the validity of an adapted tool, the Second Victim Experience and Support Tool (SVEST), to a population in Israel, H-SVEST. The H-SVEST was completed by 172 nurse participants working in a variety of patient care settings. The H-SVEST was assessed for content validity, internal consistency, and construct validity with confirmatory factor analysis (CFA). The CFA run on the initial model with 10 factors and 36 items did not meet criteria for goodness of fit.  After removing five items based on their low factor loadings and the correlation, The model fit significantly improved with acceptable CFI, TLI, RMSEA, and SRMR; χ2(389) =626.939, p&lt;.001; χ2/df=1.61; TLI=0.901; CFI=0.917; RMSEA [90% CI]=0.060 [0.051, 0.068]; SRMR=0.064. The final version included 31 items and 10 factors with Cronbach α values ranging from 0.66 to 0.94. The H-SVEST demonstrates robust psychometric properties and valuable insights into the second victim experience in the Israeli context. Comparative analysis with other versions highlights potential cultural influences and areas for further investigation. Implementing this tool and developing evidence-based interventions based on its results can significantly improve well-being and resilience of healthcare providers in Israel and other countries with diverse cultural populations. This study was not registered.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"98fa9db447d45cccf2289febaae5e2be674e896bbc93005d35ec4040fad4591a","category":"Interdisciplinary"}