{"title":"White wine vinification and an expanded insight into pellicular macerations: bibliometric and bibliographic review","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13685?af=R","date":1718971748000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Pellicular macerations in the vinification of white wines involve the contact of grape skins and seeds with the must before, during or after alcoholic fermentation. Pre-fermentative pellicular maceration aims to enrich the must with volatile compounds and aroma precursors. Fermentative maceration occurs during alcoholic fermentation, whereas post-fermentative maceration is carried out after this process, associated with orange, amber or skin-contact wines, which have experienced a growing global demand in recent years. In this context, this research aimed to conduct a bibliometric review on pellicular macerations in white wines using two search strategies on the specific platform for the period from 2010 to 2023. Additionally, we sought to identify research trends in this segment of the wine industry through a comprehensive literature review of the retrieved documents.</p>\n<h2>RESULTS</h2>\n<p>The results emphasized more studies on pre-fermentative pellicular maceration than on long-duration macerations during and after alcoholic fermentation. Alternative maceration techniques, such as grape freezing, were also observed as study subjects, including their effects on final wines. The research identified a wide variety of grapes explored in studies related to pellicular macerations of the <i>Vitis vinifera</i> L. species, with approximately 50 distinct nomenclatures identified. Regarding pre-fermentative macerations, the contact time varied from 2 to 60 h, with the temperature range 1–20 °C.</p>\n<h2>CONCLUSION</h2>\n<p>The specific search for extended skin contact white wines revealed a limited number of available documents, indicating that studies related to this product style are promising and necessary, given the growing commercial relevance of this product profile. © 2024 Society of Chemical Industry.</p>","author":"José Ricardo Machado dos Santos, \nAniela Pinto Kempka","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"98fc8d0beb1ff54c9f42d12f4a8cb0eb99e7116c146d971c8f7e394cb3040061","category":"Environment"}