{"title":"Spoke Tension | Are current tech trends taking bikes in the right direction?","link":"https://www.bikeradar.com/features/opinion/mtb-tech-trends/","date":1699866041000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2024/11/BikeRadar-MTB-trendsetters-Spoke-Tension-opinion-piece-thumbnail-32084e0.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"BikeRadar MTB trendsetters Spoke Tension opinion piece thumbnail\" title=\"BikeRadar MTB trendsetters Spoke Tension opinion piece thumbnail\" />                                            <p>Our annual MTB Headliners bike test features the rigs at the cutting edge of technology and rider needs, but the bikes are also chosen to represent the direction the industry as a whole is taking.</p>\n<p>The differences between trail-focused lightweight <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">electric mountain bikes</a> and hardcore full-power enduro models beg the question: do <a href=\"https://www.bikeradar.com/features/tech/best-electric-mountain-bike-motor/\">electric bike motor</a> output and battery capacity truly matter?</p>\n<p>Well, the <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/vitus-e-mythique-lt-vrx-review/\">Vitus E-Mythique LT</a> and Scott Lumen in this year’s test are perfect examples of the surprisingly divergent power-assisted category, each with its own take on performance. To boot, the Vitus’ asking price raises questions around the value for money of other brands’ offerings.</p>\n<p>Elsewhere, has the quest for <a href=\"https://www.bikeradar.com/features/opinion/peak-mountain-bike-geometry/\">longer, slacker and lower geometry</a> simmered down in the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-trail-bikes/\">trail bikes</a> category?</p>\n<p>Goldilocks figures are emergent on an ever-increasing number of bikes; reaches have stabilised, bottom brackets stopped dropping to give pedal-friendly characteristics, while seat tube angles aren’t getting steeper yet.</p>\n<p>Are more mellow figures just a calm before the next geometry storm, or do bikes fit us perfectly now? The Norco Fluid seems to provide some answers to that question.</p>\n<p>Some of the most fun and broadest-performing bikes of late have rather diminutive <a href=\"https://www.bikeradar.com/advice/buyers-guides/how-much-suspension-travel-do-i-need-on-my-mountain-bike/\">suspension travel</a> figures. <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downcountry-mountain-bikes/\">Downcountry</a>’s increasing popularity is also spurring on the resurgence of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">cross-country</a>, with each discipline benefitting the other.</p>\n<p>Two of our test bikes, the razor-sharp XC-focused <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/cervelo-zfs-5-xx-sl-axs-review/\">Cervelo ZFS-5</a> and downcountry-cum-trail <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/merida-one-twenty-700-review/\">Merida One-Twenty</a>, are out there to prove short-trail bikes are the rider’s choice. But is that really the case?</p>\n\n<p><a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/trek-slash-9-9-xo-axs-t-type-review/\">Trek’s latest Slash</a> adds to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-high-pivot-mountain-bike/\">high-pivot suspension design</a> head count, but is the trend here to stay this time?</p>\n<p>Like the ebb and flow of the ocean, this design has come and gone, and come again. Improvements in tech have negated many of the bad bits of <a href=\"https://www.bikeradar.com/advice/buyers-guides/what-is-a-high-pivot-mountain-bike/\">high-pivot bikes</a> and broadened their scope from downhill to trail.</p>\n<p>Here, BikeRadar’s tech experts chime in on whether they think these trends are just flashes in the pan or at the cutting edge of the MTB industry.</p>\n<h2>Alex Evans: Do motor output and battery capacity really matter?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Scott Lumen and Vitus E-Mythique LT electric mountain bikes\" title=\"Scott Lumen and Vitus E-Mythique LT electric mountain bikes\" />\n\n</div><div><figcaption><span><i></i> The Scott Lumen and Vitus E-Mythique LT are like chalk and cheese, but both are indicative of potential trends to come.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Lightweight ebikes appear to be the yin to their full-powered sibling’s yang, with each occupying a slightly different place in the market.</p>\n<p>Although some brands have taken the long-travel route with their lightweight ebikes (think the Transition Relay’s 160mm rear, 170mm front figures), most, just like our Scott Lumen on test, have gone as pared back as possible.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Scott Lumen lightweight electric mountain bike\" title=\"Scott Lumen lightweight electric mountain bike-3\" />\n\n</div><div><figcaption><span><i></i> The TQ motor is small and lightweight.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>That makes sense; reduce assistance levels and battery capacity, and you want your bike to be as light and nimble as possible.</p>\n<p>Achieving just that is the highest-spec, most expensive Lumen (£13,699), which is claimed to weigh just 15.5kg.</p>\n<p>Arguably at the forefront of innovation, not only is its shock concealed in the down tube, but so are its battery and motor, giving its frame a discreet appearance.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Scott Lumen lightweight electric mountain bike\" title=\"Scott Lumen lightweight electric mountain bike-2\" />\n\n</div><div><figcaption><span><i></i> An integrated display keeps the bike’s looks discreet.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Certainly not lacking in power, the TQ motor has 55Nm of torque and 300W of power, with a 360Wh battery providing the juice.</p>\n<p>However, the Lumen feels like an aperitif to our yet-to-be-served high-tech main meal. Batteries and motors are only going to improve, so bikes of this ilk can only get lighter and better.</p>\n<p>But if you’re after more of almost everything (weight, power, travel), the 25.44kg <a href=\"https://www.bikeradar.com/reviews/bikes/electric-bikes/vitus-e-mythique-lt-vrx-review/\">Vitus E-Mythique</a> might break your scales, but it won’t do as much damage to your bank account.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vitus E-Mythique LT VRX electric mountain bike\" title=\"Vitus E-Mythique LT VRX - 03\" />\n\n</div><div><figcaption><span><i></i> The Bafang motor has plenty of power.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>The range-topping VRX model retails for £4,399.99, but packs a powerful enduro-worthy punch.</p>\n<p>Its value-friendly Bafang motor is claimed to deliver 95Nm of torque and 550 peak watts, all powered by an in-built 630Wh battery. Those figures are nearly double the Scott Lumen’s.</p>\n<p>And while we can all agree full-power <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">ebikes</a> are a pound a dozen, the Vitus’ value is truly outstanding, especially given how well it performs on the trails.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Vitus E-Mythique LT VRX electric mountain bike\" title=\"Vitus E-Mythique LT VRX - 05\" />\n\n</div><div><figcaption><span><i></i> The Vitus offers brilliant value for money.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Arguably though, a technological convergence is on the cards.</p>\n<p>Motors and batteries will get lighter, more powerful and more efficient. It’s likely SL and full-power ebike hardware will be the same, with firmware and software blocking or limiting performance and features.</p>\n<p>This concept is already used in the automotive industry, and could be a way for manufacturers to differentiate their range of bikes – and how much they cost – while saving money by reducing hardware options.</p>\n<p>Until then, however, we should enjoy the range of performance afforded by current-generation ebikes, whether that’s an SL superbike, or a full-power bargain, both illustrated perfectly by bikes in this test.</p>\n\n<h2>Tom Law: Has the geometry arms race halted?</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Norco Sight FS C2\" title=\"Norco Sight FS C2\" />\n\n</div><div><figcaption><span><i></i> Norco’s Fluid doesn’t stand out on paper, but it shines on the trail.</span></figcaption><span> <i>Steve Behr / OurMedia</i></span></div>\n<p>A fierce debate over geometry has raged unabated in the mountain bike world for the last decade.</p>\n<p>Finally though, we seem to have reached something of a consensus. I, for one, am glad the industry is finally settling down.</p>\n<p>Norco’s Fluid looks, on paper, like a copy-and-paste trail bike. If you were to average out the numbers of the most popular trail bikes around, you’d probably end up with something shaped like Norco’s new carbon rig.</p>\n<p>You could say it is as middle-of-the-road as trail bikes get. There’s no super-slack head angle; the seat angle isn’t 80 degrees; the reach doesn’t stretch out beyond 500mm; the chainstays are neither super-short nor as long as many forums are asking for.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"SDG Tellis dropper post on Norco Fluid mtb. Pitch Hill , near Peaslake , Surrey Hills . October 2023 .\" title=\"20231003surrey410\" />\n\n</div><div><figcaption><span><i></i> A tiny 410mm seat tube on a size-large bike gives tons of room for modern dropper posts.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>In fact, the only really standout measurement is the 410mm seat tube on my large test bike. It gives tons of standover, a low-slung look and acres of space for massively long <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper posts</a>.</p>\n<p>The truth is, though, despite looking like a Ford Mondeo on paper, it absolutely shreds on the trail.</p>\n<p>Wherever I took it, I couldn’t help but grin like a Cheshire cat before, during and after every ride.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Norco Fluid FS C2 ridden by Male mountain biker\" title=\"20231003surrey584\" />\n\n</div><div><figcaption><span><i></i> Geometry doesn’t need to be outlandish to work on the trail, as the Fluid proves.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>The 65-degree head angle was slack enough to give oodles of stability in the steeps and rough, yet snappy enough for tamer, tighter XC trails.</p>\n<p>The 480mm reach was more of the same. There’s enough stability to get you into and out of trouble, but it’s not so cumbersome that it feels like trying to manoeuvre the Ever Given through the Suez Canal.</p>\n<p>The 76.7-degree seat angle was equally agreeable. It was steep enough to put me nicely over the bottom bracket at all times, but not so steep as to result in undue pressure on my wrists.</p>\n<p>It’s a properly balanced set of numbers, indicative of where the industry is heading.</p>\n<p>Reaches are becoming pretty standard from one genre to another, at around 470-480mm for most size-large bikes, whether it be an XC race rig or an enduro shredder.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Trek Slash 9.9\" title=\"Trek Slash 9.9\" />\n\n</div><div><figcaption><span><i></i> Trek’s latest Slash might be much burlier than the Fluid, but the reach is very similar.</span></figcaption><span> <i>Steve Behr / OurMedia</i></span></div>\n<p>Head angles are settling in a fairly narrow range for a given category and bottom brackets aren’t really getting any lower.</p>\n<p>Seat tube and chainstay lengths are still an area of experimentation, but overall, the idea of the ever-lasting longer, lower and slacker war does seem to be reaching its conclusion.</p>\n<p>And if more bikes follow the lead of the ‘more than the sum of its numbers’ Fluid, then maybe conforming to the law of averages isn’t such a bad place for mountain bikes to be.</p>\n<h2>Tom Marvin: Short-travel bikes are the rider’s choice</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Cervelo ZFS-5 XX SL AXS full suspension mountain bike\" title=\"Cervelo ZFS-5 three quarters\" />\n\n</div><div><figcaption><span><i></i> Okay, the Cervélo ZFS-5 is a true-blooded XC race bike, but it still rips against longer-travel offerings.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>I’ve long stuck up for the shorter-travel bike.</p>\n<p>The Cervélo ZFS-5 is a true, no-holds-barred <a href=\"https://www.bikeradar.com/features/tech/5-of-the-latest-xc-bikes/\">XC race bike</a> – and one with only 100mm of travel. This marks it out from a number of the most recent XC bikes that have come with 110-120mm of travel (I’m looking at you, <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2022-giant-anthem-advanced-pro-29-1-review/\">Giant Anthem</a> and <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/2023-orbea-oiz-m-team-review/\">Orbea Oiz</a>).</p>\n<p>Likewise, the Merida One-Twenty (that actually has 130mm of travel) is at the shorter-middle end of travel, if you look at it through trail-bike tinted glasses (which you should).</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Merida One-Twenty 700 full suspension mountain bike\" title=\"merida one-twenty off drop\" />\n\n</div><div><figcaption><span><i></i> These days, I don’t believe shorter travel numbers necessarily hold a bike back.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Therefore, neither of these bikes are anywhere near the upper travel limits of their respective genres.</p>\n<p>However, both bikes more than capably tackle anything such bikes should be expected to do so.</p>\n<p>Progressive geometry and dialled suspension play far more of a part in how well a bike rides than how much suspension the fork and shock offer.</p>\n<p>The Merida, especially, feels as though it has far more suspension than the spec sheet admits to, thanks to its supple, then supportive and then highly progressive rear end.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Merida One-Twenty 700 full suspension mountain bike\" title=\"merida one-twenty rear suspension linkage\" />\n\n</div><div><figcaption><span><i></i> A progressive rear-suspension system can make a bike out-perform its travel figures.</span></figcaption><span> <i>Steve Behr / Our Media</i></span></div>\n<p>Bikes are almost always about compromise, and in my eyes, sorted suspension and modern geometry on shorter-travel rigs more than make up for their ‘lack’ of suspension on the trail.</p>\n<p>If your kicks come from pushing yourself and your bike towards the theoretical limits, it’s these shorter-travel bikes that’ll deliver that in spades, far before those longer-travel rigs can provide adrenaline-filled thrills.</p>\n<h2>Luke Marshall: High-pivot bikes are here to stay this time</h2>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Trek Slash 9.9 X0 AXS T-Type rear suspension layout\" title=\"Trek Slash 9.9 X0 AXS T-Type rear suspension layout\" />\n\n</div><div><figcaption><span><i></i> You can see how elevated the new Trek Slash’s main pivot is, giving an axle path that arcs 19mm rearwards through its 170mm travel.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>It shouldn’t be a surprise Trek evolved its hard-hitting enduro bike into a high-pivot trail slayer. The brand has plenty of experience and success with its <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/trek-session-8-27-5-review/\">Session downhill bike</a>, which uses an elevated main pivot and chain idler system.</p>\n<p>But let’s not forget that the high-pivot design is still something of an underdog on shorter-travel, single-crown bikes, championed by less mainstream brands such as Deviate and Forbidden.</p>\n<p>So, when a big player such as Trek hops on the bandwagon, it certainly gives the trend a stamp of approval. Other brands, such as Devinci, Norco, Cannondale and GT, must be feeling quite validated right now.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Trek Slash 9.9 X0 AXS T-Type\" title=\"Trek Slash 9.9 X0 AXS T-Type\" />\n\n</div><div><figcaption><span><i></i> With Trek now in the high-pivot market for single-crown bikes, will we see more mainstream brands start to follow suit?</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>Now, with Trek in the high-pivot club, it’s safe to say this trend is here to stay. Word on the mountain bike trails is that other brands are now considering high pivots as an option for their future frame designs.</p>\n<p>After test-riding various high-pivot bikes, it’s clear Trek has done a commendable job in crafting an efficient pedalling system under my highly scientific ‘ride feel’ and ‘spin the pedal backwards’ tests.</p>\n<p>As the big players with deeper pockets get involved, we can expect to see rapid advancements in high-pivot design, making these bikes more efficient, easier to maintain and smoother to ride.</p>\n<div>\n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n        \n    \n    <img width=\"620\" height=\"413\" alt=\"Trek Slash 9.9 X0 AXS T-Type chain idler layout\" title=\"Trek Slash 9.9 X0 AXS T-Type chain idler layout\" />\n\n</div><div><figcaption><span><i></i> As bigger brands develop chain idler drivetrains, hopefully we’ll see quicker improvements in high-pivot drivetrain efficiency.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>This means the drawbacks that were once associated with high-pivot bikes should slowly become a thing of the past, giving riders the best of both worlds: great bump absorption and a familiar feel in terms of weight and efficiency.</p>\n<p>With Trek’s new Slash making its debut, it’s highly likely the high-pivot trend is reaching new heights.</p>","author":"Alex Evans","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"98ff8031228baf0b60225efe2d52f6452a6b7b68e7de842b015d876e9ea6b5d9","category":"Cycling"}