{"title":"Economic and environmental impact of green infrastructures on developing economies: Pakistan a case in point","link":"https://onlinelibrary.wiley.com/doi/10.1111/1477-8947.12417?af=R","date":1707881971000,"content":"<h2>Abstract</h2>\n<p>Environmental concerns are pressing nations worldwide to embrace greener and sustainable practices in every field. However, the existence of old unplanned cities devoid of greenery and rapid rates of urbanization are becoming a major source of pollution and a constant thorn in the sight of a sustainable future. To deal with these problems, different types of green infrastructures (GI) are introduced in developed nations. Nevertheless, these infrastructures require proper planning and economic investments for implementation, which is a huge hindrance to their adoption in developing countries. Therefore, this study aims to plan and analyze the impact of GI on the environment and the economy if it is introduced in a developing country like Pakistan. Geographic information system is used to analyze the current level of greenery and plan the installation of a new GI in one of the major cities of Pakistan. Furthermore, the reduction in carbon emissions, the environmental and economic benefits of different types of GI are measured and compared with the cost of implementation using techno-economic analysis. Finally, the payback period and internal rate of return are calculated to check the return of the initial investment. The results show that the economic and environmental benefits of GI surpass the cost of installation by a great margin. Therefore, GI can be a feasible option for sustainable development in other developing countries. The economic and environmental analysis on the practical case study of a developing country like Pakistan are the prime novelties of this study.</p>","author":"Abdul Haseeb Khan Babar, \nYousaf Ali, \nAli Gohar","siteTitle":"Wiley: Natural Resources Forum: Table of Contents","siteHash":"7676559e36bee1a0185863394c45dc24d579291ceb628f3f1e31104b38f4a5af","entryHash":"9904dc47f773cd8872f8ac0a9a3471f96f1f54d6f7ea4d5208184185de820296","category":"Environment"}