{"title":"Effects of Acetoin on Growth Performance, Digestive Function, Antioxidant Status, and Immune Capacity of Largemouth Bass (Micropterus salmoides)","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/6114525?af=R","date":1679382000000,"content":"<p>The purpose of this study was to investigate the effects of dietary acetoin on Largemouth Bass (<i>Micropterus salmoides</i>). In 45 d of farming, the experimental diets were supplemented with 0%, 0.3%, 0.6%, and 0.9% of acetoin levels, respectively. Results showed that the activities of lipase (LPS), amylase (AMS), and trypsin in fish fed with acetoin at 0.6% displayed the most obvious improvement compared with the other levels of acetoin (<i>P</i> &lt; 0.05). Furthermore, the incorporation of acetoin at 0.3% and 0.6% in <i>Micropterus salmoides</i> diet significantly enhanced the number of beneficial bacteria (such as <i>Cetobacterium</i>) and reduced the number of harmful bacteria (such as <i>Proteobacteri</i>a) in the gut flora of <i>Micropterus salmoides</i>. Meanwhile, the activities of superoxide dismutase (SOD), glutathione peroxidase (GSH-PX), and catalase (CAT) in the liver of the samples treated with acetoin at 0.6% were significantly higher than the control (<i>P</i> &lt; 0.05), while the content of malondialdehyde (MDA) and the activities of alanine aminotransferase (ALT) and aspartate aminotransferase (AST) in the liver notably decreased with the increase of the addition amount of acetoin (<i>P</i> &lt; 0.05). Furthermore, the contents of IgA, IL-6, and TNF-<i>α</i> and the activity of acid phosphatase (ACP) in the serum of the samples added with acetoin exhibited a concentration-dependent decline compared with the control (<i>P</i> &lt; 0.05). In summary, acetoin had potential feeding attraction effects on <i>Micropterus salmoides</i>, and the most suitable dose of dietary application was 0.6% acetoin, which can effectively improve the physiological characteristics and immune activity of <i>Micropterus salmoides</i>.</p>","author":"Chunjing Cai, \nZhe Li, \nJunhua Lu, \nYing Wang, \nChen Wang, \nPengfei Li, \nHui Wang, \nWu Meng, \nJie Chu, \nLiqiao Chen","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"990651715cbcb0f269a307ec8a4d9663c6b7abfe3dfab4be1ea0822df69ad00b","category":"Environment"}