{"title":"Twitter ต่างประเทศปิดการมองเห็นลิงก์ที่มีคำว่า “เกย์” “ทรานส์” ไม่ขึ้นเป็นพรีวิวในช่องแชต DM","link":"https://www.blognone.com/node/133343","date":1680866142000,"content":"<div><div><div><p>ผู้ใช้ Twitter รายงานว่ามีการปิดการมองเห็นข้อความที่เกี่ยวข้องกับ LGBTQ+ ในช่อง DM ของ Twitter ซึ่งทางสำนักข่าว Insider ได้ทำการทดสอบโดยส่งลิงก์ข้อความ “Here's a test tweet that has the word gay in it\" ซึ่งผลปรากฏว่าลิงก์ข้อความที่มีคำว่า trans, transgender, gay, lesbian, queer, bisexual, และ intersex จะปรากฏเป็นลิงก์ URL ที่ไม่แสดงพรีวิวเว็บไซต์ แต่กลับเป็นลิงก์ข้อความอย่างเดียว ยกเว้นคำว่า \"bisexuality\" ที่ยังโชว์พรีวิวได้อยู่ (แต่พอลองในประเทศไทยข้อความทั้งหมดยังคงปรากฏช่องพรีวิวตามปกติอยู่ทั้งในภาษาไทยและภาษาอังกฤษ)</p>\n<p>ทดสอบเพิ่มเติมรอบที่ 2 ด้วยการพิมพ์ลิงก์ที่มีคำว่า \"guns\"  ซึ่งยังไม่ปรากฏหน้าพรีวิว มีเพียงแค่ลิงก์ข้อความเท่านั้น แต่พอทดลองคำที่สอง \"drugs\" ปรากฏว่าโชว์หน้าพรีวิวได้ตามปกติ ถึงแม้ว่าคำเหล่านี้จะไม่ได้ถูกแบนโดยตรง แต่วิธีการดังกล่าวอาจเป็นรูปแบบการตรวจสอบเนื้อหาใหม่ของ Twitter ภายใต้การบริหารของ Elon Musk</p>\n<p>ซึ่งทาง Twitter ยังไม่ได้ออกมาชี้แจ้งว่าเป็นความผิดพลาดของระบบหรือตั้งใจให้เกิดขึ้นกันแน่ แต่ Elon Musk เคยกล่าวว่าต้องการสนับสนุน <a href=\"https://www.blognone.com/node/127484\">\"free speech absolutist\" (เสรีภาพในการแสดงออก)</a> ก่อนที่จะเข้าซื้อ Twitter ด้วยมูลค่า 44 พันล้านดอลลาร์</p>\n<blockquote><p>Starlink has been told by some governments (not Ukraine) to block Russian news sources. We will not do so unless at gunpoint.Sorry to be a free speech absolutist.</p>\n<p>— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1499976967105433600?ref_src=twsrc%5Etfw\">March 5, 2022</a></p></blockquote>\n<p>ที่มา: <a href=\"https://www.businessinsider.com/twitter-limits-visibility-tweets-trans-gay-lgbtq-dm-elon-musk-2023-4\">Insider</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/twitter\">Twitter</a></div><div><a href=\"/topics/elon-musk\">Elon Musk</a></div><div><a href=\"/topics/lgbtq\">LGBTQ</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"99252fd13585672ee6ab9b0b76f6556b0ed925d751aebe4cf18e114114ee2d86","category":"Thai"}