{"title":"Sensible power output makes the DBA Mini eMastered a huge amount of fun","link":"https://arstechnica.com/?p=1984688","date":1700393409000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/MINI_e_MASTERED_1-800x533.jpg\" alt=\"A cream mini Cooper restomod parked in London\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/MINI_e_MASTERED_1-scaled.jpg\">Enlarge</a> <span>/</span> David Brown Automotive makes modernized minis with electric power for well-heeled buyers. (credit: David Brown Automotive)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Have you ever thought: \"I wonder what a $150,000 classic Mini would be like?\" If so, you're in luck, because David Brown Automotive (DBA) has just the car for you: the Mini eMastered. It's a classic Mini, powered by electricity, and it costs a lot of money.</p>\n<p>You'll be forgiven for not knowing who David Brown Automotive is. It's a small outfit that specializes in cars for the ultra wealthy, but it does so rather wonderfully. Founded in 2013 by a chap called, perhaps unsurprisingly, David Brown (no relation to the Aston Martin David Brown, before you ask), its first car was the Jaguar XK Convertible-based <a href=\"https://www.autocar.co.uk/car-review/david-brown/speedback-gt\">Speedback GT</a>.</p>\n<p>Launched in 2014, the Speedback GT came with a 5.0 L supercharged V8, more than 500 hp (373 kW), and a look that apes a classic Aston Martin. Brown, an avid classic car enthusiast, loved the look of his classics but hated having to fix them all the time, so he made something that looks old but shouldn't break down anywhere near as often. The company says no more than 100 will be built, and with a pretty spicy entry fee one can imagine the wider appeal may be a smidge limited.</p></div><p><a href=\"https://arstechnica.com/?p=1984688#p3\">Read 12 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1984688&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"992c5d7eff468dc71dedb51b344aff2174fd5058d7b72647ecfacbeb0a9f39d6","category":"Tech"}