{"title":"The BMW M5 CS is seriously potent, seriously expensive","link":"https://arstechnica.com/?p=1809170","date":1635780226000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/09-2022-BMW-M5-CS-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/09-2022-BMW-M5-CS.jpg\">Enlarge</a> <span>/</span> The first BMW M5 to ever receive the CS treatment is a seriously potent sports sedan, but that performance comes with some notable compromises. (credit: Bradley Iger)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Although today’s M5 is a far cry from the <a href=\"https://en.wikipedia.org/wiki/BMW_5_Series_(E28)\">hot-rodded E28</a> that BMW introduced in 1984, the company has followed a common ethos with the badge throughout the decades. While other M cars like the M1 and <a href=\"https://arstechnica.com/cars/2021/05/the-2021-bmw-m3-when-youre-driving-it-you-dont-have-to-see-its-nose/\">M3</a> have had clear sports car intentions, the M5 has always made more sense as a posh Autobahn missile.</p>\n<p>Over time, as the 5-Series has increased in size, weight, and amenities, BMW has leaned further and further into that notion, piling on power and comfort in nearly equal measure with each passing generation. Outfitted with a twin-turbocharged V8, all-wheel drive, and a traditional eight-speed automatic rather than a manual gearbox or a dual-clutch transmission, the current M5 is incredibly capable but also unapologetically civil. Your grandmother could take one to the grocery store and back without incident.</p>\n<p>Well, unless it’s an M5 CS. As with the M4 CS and M2 CS that came before it, the M5 Competition Sport package is the swan song for the current-generation car, which brings a significantly stronger focus on outright performance. The result is a sedan that can generate Nürburgring Nordschleife lap times that put sports cars like the <a href=\"https://arstechnica.com/cars/2020/02/the-mid-engine-corvette-was-60-years-in-the-making-now-weve-driven-it/\">latest Corvette</a> or <a href=\"https://arstechnica.com/cars/2020/12/the-911-carrera-s-two-pedals-good-three-pedals-better/\">911 Carrera S</a> in its rear-view mirror.</p></div><p><a href=\"https://arstechnica.com/?p=1809170#p3\">Read 15 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1809170&amp;comments=1\">Comments</a></p>","author":"Ars Staff","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"99384f311d748b2fe1e2452ad9deb247d84ce0e848d69e17fa98334ecd738b85","category":"Tech"}