{"title":"Agricultural specialisation increases the vulnerability of pollination services for smallholder farmers","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14732?af=R","date":1721806517000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/e59fcf2c-52c8-403e-aaba-49019a44f890/jpe14732-toc-0001-m.png\" alt=\"Agricultural specialisation increases the vulnerability of pollination services for smallholder farmers\" />\n<p>We highlight the increased vulnerability of pollination services when smallholders transition to specialised cash crop farming and emphasise the role of crop, pollinator and wild plant diversity in mitigating this risk. The method we present could be readily applied to other smallholder settings across the world to help characterise and manage the ecosystem services underpinning the livelihoods and nutritional health of smallholder families.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nSmallholder farms make up 84% of all farms worldwide and feed 2 billion people. These farms are heavily reliant on ecosystem services and vulnerable to environmental change, yet under-represented in the ecological literature. The high diversity of crops in these systems makes it challenging to identify and manage the best providers of an ecosystem service, such as the best pollinators to meet the needs of multiple crops. It is also unclear whether ecosystem service requirements change as smallholders transition towards more specialised commercial farming—an increasing trend worldwide.\n\nHere, we present a new metric for predicting the species providing ecosystem services in diverse multi-crop farming systems. Working in 10 smallholder villages in rural Nepal, we use this metric to test whether key pollinators, and the management actions that support them, differ based on a farmers' agricultural priority (producing nutritious food to feed the family vs. generating income from cash crops). We also test whether the resilience of pollination services changes as farmers specialise on cash crops.\n\nWe show that a farmers' agricultural priority can determine the community of pollinators they rely upon. Wild insects including bumblebees, solitary bees and flies provided the majority of the pollination service underpinning nutrient production, while income generation was much more dependent on a single species—the domesticated honeybee <i>Apis cerana</i>. The significantly lower diversity of pollinators supporting income generation leaves cash crop farmers more vulnerable to pollinator declines.\n\nRegardless of a farmers' agricultural priority, the same collection of wild plant species (mostly herbaceous weeds and shrubs) were important for supporting crop pollinators with floral resources. Promoting these wild plants is likely to enhance pollination services for all farmers in the region.\n\n<i>Synthesis and applications</i>. We highlight the increased vulnerability of pollination services when smallholders transition to specialised cash crop farming and emphasise the role of crop, pollinator and wild plant diversity in mitigating this risk. The method we present could be readily applied to other smallholder settings across the world to help characterise and manage the ecosystem services underpinning the livelihoods and nutritional health of smallholder families.\n</p>","author":"T. P. Timberlake, \nA. R. Cirtwill, \nS. Sapkota, \nD. R. Bhusal, \nK. Devkota, \nR. Karki, \nD. Joshi, \nN. M. Saville, \nS. Kortsch, \nS. Baral, \nT. Roslin, \nJ. Memmott","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"993ccae2a61e3f8d2a3e7085c1ed4515949afa1f07c7641578eb14faf7780155","category":"Environment"}