{"title":"Differential impact of environmental factors on airborne live bacteria and inorganic particles in an underground walkway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300920","date":1711029600000,"content":"<p>by Hiroyuki Yamaguchi, Torahiko Okubo, Eriko Nozaki, Takako Osaki</p>\r\n\r\nWe previously reported that variations in the number and type of bacteria found in public spaces are influenced by environmental factors. However, based on field survey data alone, whether the dynamics of bacteria in the air change as a result of a single environmental factor or multiple factors working together remains unclear. To address this, mathematical modeling may be applied. We therefore conducted a reanalysis of the previously acquired data using principal component analysis (PCA) in conjunction with a generalized linear model (Glm2) and a statistical analysis of variance (ANOVA) test employing the χ<sup>2</sup> distribution. The data used for the analysis were reused from a previous public environmental survey conducted at 8:00–20:00 on May 2, June 1, and July 5, 2016 (regular sampling) and at 5:50–7:50 and 20:15–24:15 on July 17, 2017 (baseline sampling) in the Sapporo underground walking space, a 520-meter-long underground walkway. The dataset consisted of 60 samples (22 samples for “bacterial flora”), including variables such as “temperature (T),” “humidity (H),” “atmospheric pressure (A),” “traffic pedestrians (TP),” “number of inorganic particles (Δ5: 1–5 μm),” “number of live airborne bacteria,” and “bacterial flora.” Our PCA with these environmental factors (T, H, A, and TP) revealed that the 60 samples could be categorized into four groups (G1 to G4), primarily based on variations in PC1 [Loadings: T(˗0.62), H(˗0.647), TP(0.399), A(0.196)] and PC2 [Loadings: A(˗0.825), TP(0.501), H(0.209), T(˗0.155)]. Notably, the number of inorganic particles significantly increased from G4 to G1, but the count of live bacteria was highest in G2, with no other clear pattern. Further analysis with Glm2 indicated that changes in inorganic particles could largely be explained by two variables (H/TP), while live bacteria levels were influenced by all explanatory variables (TP/A/H/T). ANOVA tests confirmed that inorganic particles and live bacteria were influenced by different factors. Moreover, there were minimal changes in bacterial flora observed among the groups (G1–G4). In conclusion, our findings suggest that the dynamics of live bacteria in the underground walkway differ from those of inorganic particles and are regulated in a complex manner by multiple environmental factors. This discovery may contribute to improving public health in urban settings.","author":"Hiroyuki Yamaguchi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"994a71f826e6bc5bb00708427a669c405ecd399a11ee226ec9d1112fb66d7d23","category":"Interdisciplinary"}