{"title":"Apple will reportedly stick with ’13’ for the next iPhone","link":"https://www.macworld.com/article/350256/apple-will-reportedly-stick-with-13-for-the-next-iphone.html","date":1625492189000,"content":"\n<div>\n<section><div></div></section><p>One of the only things we don’t know about the next iPhone is what it will be called. Recent reports have suggested that Apple will go with “12s” due to the relative lack of monumental new features, but now it looks like Apple has decided against that route.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://translate.google.com/translate?sl=auto&amp;tl=en&amp;u=https://money.udn.com/money/story/5612/5578271&amp;xcust=1-1-350256-0-0-0&amp;sref=https://www.macworld.com/feed\">According to the Economic Daily News</a>, Apple will be naming the new handset the iPhone 13, based on the publications supply chain sources. Previous reports have basically confirmed that there will be four models of iPhone again, so the new lineup should look very similar to the iPhone 12, with an iPhone 13 mini, iPhone 13, iPhone 13 Pro, and iPhone 13 Pro Max.</p>\n\n\n\n<p>Apple hasn’t followed a predictable cadence for its iPhone names since the iPhone 6s, so it’s not surprising that it’s jumping right to iPhone 13. Here’s how the last few models have looked:</p>\n\n\n\n<ul><li>iPhone 7: 2016</li><li>iPhone 8: 2017</li><li>iPhone X: 2017</li><li>iPhone Xs: 2018</li><li>iPhone 11: 2019</li><li>iPhone 12: 2020</li></ul><p>Rumors about the next iPhone have painted <a href=\"https://www.macworld.com/article/234814/2021-iphone-13-12s-rumors-specs-120hz-a15-display-notch-camera-battery-charging-colors-storage-release.html\">a near-complete picture of the device</a>, with a smaller notch, faster processor, better camera, and a high-refresh screen on the Pro models. Other smaller improvements may also arrive, including reverse wireless charging, better battery life, and new colors.</p>\n\n\n\n<p>The iPhone 13 name is <a href=\"https://www.macworld.co.uk/news/skip-iphone-13-3805976/\">something of a risk for Apple</a> due to the unlucky nature of the number. However, the numbering ultimately doesn’t matter, since it’s mainly used as a marketing identifier. The phone itself doesn’t have any numbering on it, and Apple hasn’t put a number on the box since the iPhone 7.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9950b7d442b0f0150650d228b2bd1c320a3d09cc98c1127347c58a1005712a51","category":"Apple"}