{"title":"Controls and relationships of soil organic carbon abundance and persistence vary across pedo‐climatic regions","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17320?af=R","date":1715841900000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/cf25947d-4eef-47cd-b6c3-edb0d9d3dbab/gcb17320-toc-0001-m.png\" alt=\"Controls and relationships of soil organic carbon abundance and persistence vary across pedo-climatic regions\" />\n<p>One of the largest uncertainties in the terrestrial carbon cycle is the timing and magnitude of soil organic carbon (SOC) response to climate and vegetation change. We present a global synthesis of SOC and radiocarbon profiles to assess the timescales of SOC storage and the relationship between SOC abundance and persistence across pedo-climatic regions. This process-oriented grouping of SOC abundance and persistence provides a valuable benchmark for global C models, highlighting that pedo-climatic boundary conditions are crucial for predicting the effects of climate change and soil management on future C abundance and persistence.</p>\n<br />\n<h2>Abstract</h2>\n<p>One of the largest uncertainties in the terrestrial carbon cycle is the timing and magnitude of soil organic carbon (SOC) response to climate and vegetation change. This uncertainty prevents models from adequately capturing SOC dynamics and challenges the assessment of management and climate change effects on soils. Reducing these uncertainties requires simultaneous investigation of factors controlling the amount (SOC abundance) and duration (SOC persistence) of stored C. We present a global synthesis of SOC and radiocarbon profiles (n<sub>Profile</sub> = 597) to assess the timescales of SOC storage. We use a combination of statistical and depth-resolved compartment models to explore key factors controlling the relationships between SOC abundance and persistence across pedo-climatic regions and with soil depth. This allows us to better understand (i) how SOC abundance and persistence covary across pedo-climatic regions and (ii) how the depth dependence of SOC dynamics relates to climatic and mineralogical controls on SOC abundance and persistence. We show that SOC abundance and persistence are differently related; the controls on these relationships differ substantially between major pedo-climatic regions and soil depth. For example, large amounts of persistent SOC can reflect climatic constraints on soils (e.g., in tundra/polar regions) or mineral absorption, reflected in slower decomposition and vertical transport rates. In contrast, lower SOC abundance can be found with lower SOC persistence (e.g., in highly weathered tropical soils) or higher SOC persistence (e.g., in drier and less productive regions). We relate variable patterns of SOC abundance and persistence to differences in the processes constraining plant C input, microbial decomposition, vertical C transport and mineral SOC stabilization potential. This process-oriented grouping of SOC abundance and persistence provides a valuable benchmark for global C models, highlighting that pedo-climatic boundary conditions are crucial for predicting the effects of climate change and soil management on future C abundance and persistence.</p>","author":"Sophie F. von Fromm, \nAlison M. Hoyt, \nCarlos A. Sierra, \nKaterina Georgiou, \nSebastian Doetterl, \nSusan E. Trumbore","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"99519c72767b8034b29f61fa98e1b486a3f78f3fe4e3ace704360d84a63d3d65","category":"Environment"}