{"title":"Apple’s keyboards are suddenly very boring again","link":"https://www.macworld.com/article/551049/macbook-pro-keyboard-touch-bar.html","date":1636542000000,"content":"<div>\n<section><div></div></section><p>With the removal of the Touch Bar from top-of-the-line MacBook Pro models–and make no mistake, the grim reaper is coming for the <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">13-inch MacBook Pro</a> with Touch Bar, too–Apple’s era of experimentation with the keyboard is over. Out with 2015’s “butterfly” keyboard, out with 2016’s Touch Bar, in with the Magic Keyboard and a row of full-height function keys.</p>\n\n\n\n<p>For some reason, in the middle of the 2010s, Apple decided it was <a href=\"https://www.macworld.com/article/230706/apples-laptop-designs-are-cornering-mac-users.html\">ready to reinvent</a> how keyboards on laptops work. It was a bad decision that the company has spent years trying to fix. Of all the innovations from that period, the only one that remains intact is the Touch ID sensor on the power button. The rest of the changes are just a bad memory. So now what?</p>\n\n\n\n<h2>Stick with the classics</h2>\n\n\n\n<p>Never say never, but it sure feels like Apple has learned its lesson–or at least has been beaten up enough for its decisions for a good, long while. While it’s not very Apple-like to consider any area of its products completely solved and impervious to innovation, when Apple pushed on the keyboard, the keyboard (and its users) pushed back. Hard.</p>\n\n\n\n<p>Taking it easy for a while seems like a very good idea. The truth is, we rely on our computers–and the keyboards attached to them–to do our work, day in and day out. It’s not always glamorous, whether it’s sending an email or writing a college paper or filling out a web form, but it’s usually important.</p>\n\n\n\n<p>Reliability matters. Especially on a laptop keyboard, since it’s integrated with the rest of the device. On an iMac, I can swap out Apple’s included external keyboard for one I like better. On a MacBook, I don’t have that option. And if an external keyboard breaks, you can substitute a new one and keep on working–but with a laptop, you have to take it in for repair and lose your entire computer.</p>\n\n\n\n<p>And then there’s the fact that keyboards have worked pretty well for decades, looking more or less like they do today. (In fact, these days I write on a mechanical keyboard that looks and sounds a lot like something I would have written on in the 1980s.) Longevity also leads to ubiquity, and ubiquity equals familiarity. Pretty much everyone knows how a keyboard works, and we can all pick up a computer and start using it without needing to familiarize ourselves with how text input will work.</p>\n\n\n\n<p>That’s boring and not cutting edge… but it’s powerful all the same. Everyone knows how it works. If you want to change it, you’d better change it for the better.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/macbook-pro-globe-key.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>The Globe key (lower left with the fn key) was introduced with the iPad external keyboard and is now on the MacBook Pro.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>In fact, the only real recent innovation Apple has introduced to the keyboard is its rechristening of the venerable Fn key–used to toggle between functions on the function-key row of the keyboard–as the Globe key. iPadOS 15 <a href=\"https://www.macworld.com/article/349404/apple-ipad-mac-floating-resizing-windows-keyboard-shortcuts-apps-shelf-quick-notes.html\">makes great use of the Globe key</a> for global keyboard shortcuts, but that globe symbol also appears on the Mac, and it seems like Apple is going to lean into it as an additional layer for keyboard shortcuts.</p>\n\n\n\n<h2>It’s hard to resist</h2>\n\n\n\n<p>And yet, it’s hard to imagine that Apple isn’t still dreaming of ways it could improve or reinvent the keyboard. So despite the scars it bears from the mid-2010s, I’ve got to think Apple designers and engineers will continue to ask themselves if there are ways they can improve the input experience on Mac laptops.</p>\n\n\n\n<p>A few years ago <a href=\"https://www.macworld.com/article/231090/where-apples-reinvention-of-the-keyboard-may-go-next.html\">I pondered this very question</a> with more than a little trepidation. Over the years, we’ve seen patent filings for various keyboard “improvements” that made it seem like Apple was driving to a future where the physical keyboard would be entirely replaced with a second touchscreen. No moving parts, no key travel, but maybe a little tactile feedback. The ultimate victory of the Touch Bar.</p>\n\n\n\n<p>That seems… a lot less likely now. In 2020 Apple introduced the Magic Keyboard for iPad, which seems like a pretty solid admission that physical keys and a trackpad are the answer, not just on the Mac, but on any laptop-like device.</p>\n\n\n\n<p>Still, there might be ways for Apple to move input forward on the Mac. Making the Mac’s display a touchscreen is still out there as a possibility, despite Apple’s refusal thus far to consider it. A future Mac that could be used with an Apple Pencil is another possibility. Ergonomic considerations probably prevent this from being very likely.</p>\n\n\n\n<p>The trackpad, which Apple has continued to enlarge, is an interesting possibility for a successor to the Touch Bar. Imagine a larger trackpad surface with a display underneath, allowing portions of the surface to be mapped to different functions with visual feedback. It could happen, though after a decade spent unwinding its keyboard mistakes, I’m not sure Apple wants to risk screwing up the trackpad.</p>\n\n\n\n<p>There’s one area where there’s recently been a lot of excitement when it comes to key input, though, and perhaps Apple could take a lesson from it: macro pads like Elgato’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.elgato.com/en/stream-deck&amp;xcust=1-1-551049-1-0-0&amp;sref=https://www.macworld.com/feed\">Stream Deck</a> and Loupedeck’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://loupedeck.com/us/products/loupedeck-live/&amp;xcust=1-1-551049-1-0-0&amp;sref=https://www.macworld.com/feed\">Loupedeck Live</a> combine a button-driven interface with custom software that allows the buttons to display custom labels and change appearance in different modes.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/elgato-stream-deck.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p>Apple’s next input innovation could take some cues from devices like Elgato’s Stream Deck.</p></figcaption></figure><p>Elgato</p></div>\n\n\n\n<p>I wonder if there’s something there that could combine some of the appeal of the Touch Bar with the tactile feel of the traditional function-key row. I use a Stream Deck Mini, and while I could attach all of the functions I’ve assigned to its buttons to the function keys on my keyboard, it’s <em>much</em> better to be able to see exactly what I’m going to get when I press the button.</p>\n\n\n\n<p>Maybe Apple will get excited about taking another crack at the traditional keyboard someday. I’d love to see Stream Deck-style programmable labels in the function row. Or maybe Apple will decide to put <a href=\"https://www.macworld.com/article/546624/touch-bar-macbook-air-ipad-magic-keyboard.html\">new focus on the Touch Bar</a>, as Macworld’s Michael Simon has suggested. But you know what? If the price we all pay for Apple’s dalliance with the Touch Bar and the butterfly keyboard in the mid-2010s is that for the next decade, Apple just focuses on shipping a reliable traditional keyboard, it’s probably worth it.</p>\n\n\n\n<p>We’ve all seen the alternative. Boring and traditional isn’t so bad, after all.</p>\n</div>","author":"Jason Snell","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"99523311969a4c8ee7925b825422016bb0eddb3ab14bbc53d8fce0c8439813da","category":"Apple"}