{"title":"From Issue 120: Who is Tadej Pogačar?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/from-issue-120-who-is-tadej-poagcar","date":1687944962000,"content":"\n      <p><strong><a href=\"https://www.rouleur.cc/pages/subscribe\"><i>This is an abridged article from Rouleur 120: The Tours Issue. To read the full interview with Tadej Pogačar, subscribe to Rouleur magazine to receive your copy.</i></a></strong></p>\n<p>Before an unfortunate crash and broken wrist derailed his Classics season early in Liège-Bastogne-Liège, Tadej Pogačar had spent the first part of the year redefining what is possible in road cycling, again.</p>\n<p>By the end of 2022, his fourth season as a pro, he’d already been on a streak of 18  consecutive top-six places in stage races, including 11 victories. These included, of course, two Tours de France. Plus he’d won twice at Il Lombardia and once each at Liège and Strade Bianche. Early 2023 was, impossible though that seems, even more special, and he won virtually everything he started. He won Jaén Paraiso Interior and the Vuelta Andalucia (including three stages). He won three stages and the GC of Paris-Nice. He followed fourth in Milan-Sanremo and third in E3 Saxo Classic with victories in the Tour of Flanders, Amstel Gold Race and Flèche Wallonne.  </p>\n<p>Pogačar may well be the greatest male rider of his generation, and ever since turn- ing professional he has had that rare ability to make winning look easy. According to some, he may well be the first male rider in 50 years really worthy of the ‘Merckx’ comparison. But despite his ubiquity at the front of the biggest bike races in the world since his debut season in 2019, we still know very little about the 24-year-old.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Issue120_by_Alessandra_Bucci_-9857_580e3750-614b-4962-8f2c-c1af4fd6b00d.jpg?v=1687944816\" alt />His placid demeanour and propensity for goofing around make us think we know him, but there has also been an air of mystery around the young Slovenian, reinforced by the ability to ride an entire peloton off his wheel.  </p>\n<p>Pogačar is intriguing in a paradoxical way. He has the face of a choirboy and he  rides like he has a killer instinct. But unlike the closest he has to peers in the current peloton – Wout van Aert, Mathieu van der Poel and Remco Evenepoel – winning  seems like a byproduct of the main goal, which is to have fun. Bike racing is very much a game to him; it just so happens he has the strength to turn the fun side of it – attacking and riding hard – into wins. And Pogačar understands that life is not just about winning bike races.</p>\n<p>But while the young Slovenian gives the impression that he’s cruising through the cycling seasons looking for a good time, the rest of us have certainly noticed that there is something about him that hits different. “There is a certain aura around Tadej,” says UAE manager Mauro Gianetti, when speaking of his star rider. “I have only seen this once before and it was not in cycling. It was the first time I met Roger Federer. We were sharing a house for the Swiss national team at the 2000 Olympic Games. Federer was only 18, but he was representing the country for tennis, and I was on the cycling team. He wasn’t the No1 player in the world yet, and I didn’t know who he was, but I knew there was something special. When you approached him you could just feel his energy. You could touch it. And Tadej has that too. When you are around him you just feel relaxed, because he is so relaxed. It’s truly special. I don’t think this is something you can learn. You have to be born with it.”</p>\n<p>Rouleur sat down with Pogačar during his stunning classics campaign. We talked about growing up in Slovenia and we talked about the highs and lows in bike racing and in life. We talked about a lot of things, really. Pogačar spoke easily throughout our conversation, opening up about cracking in the Tour de France last year. We also followed up about his crash in Liège. We talkedabout how he fell in love with cycling and about personal loss. And through our conversation we learned just a little more about who Tadej Pogačar is.</p>\n<p><a href=\"https://www.rouleur.cc/pages/subscribe\"><em><strong>To read the full interview, subscribe to Rouleur today and you'll receive your copy of 120: The Tours Issue.</strong></em></a></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"995290fa2372222be695b4cf5ab1adfee06ab119a96cca27b7289eeebd6bdc71","category":"Cycling"}