{"title":"Selenium in soil enhances resistance of oilseed rape to Sclerotinia sclerotiorum by optimizing the plant microbiome","link":"https://academic.oup.com/jxb/article/75/18/5768/7684933?rss=1","date":1716940800000,"content":"<span><div>Abstract</div>Plants can recruit beneficial microbes to enhance their ability to resist disease. It is well established that selenium is beneficial in plant growth, but its role in mediating microbial disease resistance remains poorly understood. Here, we investigated the correlation between selenium, oilseed rape rhizosphere microbes, and <span>Sclerotinia sclerotiorum</span>. Soil application of 0.5 and 1.0 mg kg<sup>–1</sup> selenium [selenate Na<sub>2</sub>SeO<sub>4</sub>, Se(VI) or selenite Na<sub>2</sub>SeO<sub>3</sub>, Se(IV)] significantly increased the resistance of oilseed rape to <span>Sclerotinia sclerotiorum</span> compared with no selenium application, with a disease inhibition rate higher than 20% in Se(VI)0.5, Se(IV)0.5 and Se(IV)1.0 mg kg<sup>–1</sup> treatments. The disease resistance of oilseed rape was related to the presence of rhizosphere microorganisms and beneficial bacteria isolated from the rhizosphere inhibited Sclerotinia stem rot. <span>Burkholderia cepacia</span> and the synthetic community consisting of <span>Bacillus altitudinis</span>, <span>Bacillus megaterium</span>, <span>Bacillus cereus</span>, <span>Bacillus subtilis</span>, <span>Bacillus velezensis</span>, <span>Burkholderia cepacia</span>, and <span>Flavobacterium anhui</span> enhanced plant disease resistance through transcriptional regulation and activation of plant-induced systemic resistance. In addition, inoculation of isolated bacteria optimized the bacterial community structure of leaves and enriched beneficial microorganisms such as <span>Bacillus</span>, <span>Pseudomonas</span>, and <span>Sphingomonas</span>. <span>Bacillus</span> isolated from the leaves were sprayed on detached leaves, and it also performed a significant inhibition effect on <span>Sclerotinia sclerotiorum</span>. Overall, our results indicate that selenium improves plant rhizosphere microorganisms and increase resistance to <span>Sclerotinia sclerotiorum</span> in oilseed rape.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"995789e37f91e36536bd9663fbebb4babddd3bfbb32a3d6fdce181f22f3f7c48","category":"Environment"}