{"title":"E3 Saxo Bank Classic 2021 Preview","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/e3-saxo-bank-classic-2021-preview","date":1616027400000,"content":"\n      <p><em>Tom Boonen's race.</em></p>\n<p>One of them, at least. Tom Boonen won E3 five times throughout his career, including four times in row between 2004 and 2007.</p>\n<div class=\"klaviyo-form-Ymj3Vm\"></div>\n<p>The first edition took place in 1958, meaning E3 is one of the newest Flanders Classics.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/PRESSESPORTS_574813_cycle_-6_1024x1024.jpg?v=1616091070\" alt=\"E3 Finish\"><em>The 2017 finish between Greg Van Avermaet, Phillipe Gilbert and Oliver Naesen (Image credit: Presse Sports / Offside)</em></p>\n<p>Like Dwars Door Vlaanderen, the race succumbed to the global pandemic in 2020, so we must flick back to 2019 to check the formbook. <span>Zdeněk Štybar</span> won on that occasion ahead of Wout Van Aert and Greg Van Avermaet — he was simply quicker on the day.</p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/2021-procycling-calendar\">Related – The 2021 Men's Early Season: The Rouleur Racing Guide</a> <br><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\">Related – </a></strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/the-womens-2021-early-season-a-guide\"><strong><span class=\"s1\">The Women's 2021 Early Season: The Rouleur Racing Guide</span></strong></a></em></p>\n<p>At 205km, the race’s length adds difficulty but isn’t the main factor. Many of the most challenging cobbled climbs Flanders has to offer pose the main obstacle.</p>\n<p>One of the main chances for riders to attack lies on the Taaienberg (0.6km @ 6.8%), which arrives with over 80km still remaining. Later, the Paterberg (0.4km @ 10.6%) and Oude-Kwaremont (1.5km @ 4.7%) arrive with 58 and 53 kilometres remaining respectively. At this point we could already see a major selection made. However, the distance to the line does provide the opportunity for a group working well together to close the gap to any escapees. The final 12.5km are entirely flat to the finish in Harelbeke.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/E_Profile_1024x1024.png?v=1616084074\" alt=\"E3 Saxo Bank Classic\"><em>E3 Saxo Bank Classic 2021 Profile (Image credit: La Flamme Rouge)</em></p>\n<h4><strong>Contenders</strong></h4>\n<p>We may or may not sound like a broken record at this point. But the prowess of Deceuninck-Quick-Step in the cobbled classics is impossible to ignore.</p>\n<p>They have won the previous two editions of E3 and are in a strong position to make it a hat-trick. Defending champion <span>Zdeněk Štybar</span> returns alongside Yves Lampaert, <span>Florian Sénéchal </span>and Kasper Asgreen. These four riders are all very capable on the cobbles and provide the team with attacking options that can be sent up the road with the ambition to win. If not, Davide Ballerini will sit in their wake and hope to be there should the race be decided in a reduced sprint. The Italian has shown superb form this season and is more than capable on the cobbles — he won Omloop Het Nieuwsblad in February.</p>\n<p>Like many of the other Flanders Classics this year, it won’t be easy for Deceuninck because of two names: Wout Van Aert and Mathieu van der Poel. The two cyclo-cross sensations have taken road racing by storm and have shown no signs of slowing down. Four of the seven stages at Tirreno-Adriatico were won by either WVA of VDP. The only chink in the duo’s armour could be inexperience. Between them, they have only one start at E3 — Wout Van Aert’s second-place in 2019. We doubt this will be of any major concern, but at least we’re trying, right?</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/CORVOS_00032325-182_1024x1024.jpg?v=1616090589\" alt=\"Wout Van Aert\"><em>Wout Van Aert (Image credit: LB/RB/CorVos/SWpix)</em></p>\n<p>Michael Matthews is making his second appearance at E3 this season. The race could suit him, though. He’s shown form on climbs like the Oude-Kwaremont and Paterberg before when he finished 6<sup>th</sup> at the Tour of Flanders in 2019. If Matthews can hold onto the front of the race he will be one of the quickest riders present.</p>\n<p>AG2R Citroen will be led by newly formed duo of Greg Van Avermaet and Oliver Naesen. Van Avermaet his finished on the podium in the previous three editions and won in 2017, whilst Naesen has always finished in the top-10. If any of the Flanders Classic suit the team it could well be this one.</p>\n<p>Sep Vanmarcke has been consistent yet unspectacular at E3 — he has achieved six top-10s but never a podium. He will be the out-and-out leader for Israel Start-Up throughout the entirety of the Spring so he can be sure to have a full team behind him.</p>\n<p>Groupama-FDJ enter the classic season with numerous options. <span>Stefan Küng</span> was the assumed leader before a wheel was turned in 2021, but Jake Stewart and Kevin Geniets have blossomed. Stewart possesses a fast finish and used that to good effect when he finished second at Omloop Het Nieuwsblad, whilst Geniets led-out Stewart well at Omloop and then finished in the top-20 at Strade Bianche. <span>Küng</span> has also shown form though and that was evident when he defeated Pippo Ganna in the Tirreno-Adriatico time-trial. With numerous choices Groupama-FDJ are one to keep an eye on.</p>\n<p>Alberto Bettiol has fared well at E3 previously. He was fourth and in the final sprint in 2019 and in the top-10 in 2017. Still just 27, the Italian is just entering his prime. He was a surprise winner of the Tour of Flanders two years ago and although not a key favourite, he is more closely marked these days.</p>\n<p><strong>Favourites</strong>: Wout Van Aert, Mathieu van der Poel, Deceuninck-Quick-Step</p>\n<p><strong>Outsiders: </strong>Michael Matthews, Kevin Geniets, Sonny Colbrelli</p>\n<p><em>Cover image: <span>Alex Broadway/SWpix</span></em></p>\n<div class=\"klaviyo-form-UFKPji\"></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"995cb32e555b1ab6e6ff351f1f1a2abf64ff86d0d2c72b52ee974dc223973062","category":"Cycling"}