{"title":"Top Harvard cancer researchers accused of scientific fraud; 37 studies affected","link":"https://arstechnica.com/?p=1997993","date":1705963532000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1857709174-800x533.jpeg\" alt=\"The Dana-Farber Cancer Institute in Boston. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/GettyImages-1857709174-scaled.jpeg\">Enlarge</a> <span>/</span> The Dana-Farber Cancer Institute in Boston.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/boston-ma-exterior-of-dana-farber-cancer-institute-news-photo/1857709174?adppopup=true\">Getty | Craig F. Walker</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The Dana-Farber Cancer Institute, an affiliate of Harvard Medical School, is seeking to retract six scientific studies and correct 31 others that were published by the institute’s top researchers, including its CEO. The researchers are accused of manipulating data images with simple methods, primarily with copy-and-paste in image editing software, such as Adobe Photoshop.</p>\n<p>The accusations come from data sleuth Sholto David and colleagues on PubPeer, an online forum for researchers to discuss publications that has frequently served to spot dubious research and potential fraud. On January 2, David posted on his research integrity blog, For Better Science, <a href=\"https://forbetterscience.com/2024/01/02/dana-farberications-at-harvard-university/\">a long list of potential data manipulation from DFCI researchers</a>. The post highlighted many data figures that appear to contain pixel-for-pixel duplications. The allegedly manipulated images are of data such as Western blots, which are used to detect and visualize the presence of proteins in a complex mixture.</p>\n<p>DFCI Research Integrity Officer Barrett Rollins told <a href=\"https://www.thecrimson.com/article/2024/1/22/dana-farber-issues-corrections/\">The Harvard Crimson</a> that David had contacted DFCI with allegations of data manipulation in 57 DFCI-led studies. Rollins said that the institute is \"committed to a culture of accountability and integrity,\" and that \"every inquiry about research integrity is examined fully.\"</p></div><p><a href=\"https://arstechnica.com/?p=1997993#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997993&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"996028a4260eb775f7445355c0a31ef6c437c9167f6fcc2b850490274c613048","category":"Tech"}