{"title":"Explainable machine learning on baseline MRI predicts multiple sclerosis trajectory descriptors","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306999","date":1721138400000,"content":"<p>by Silvia Campanioni, César Veiga, José María Prieto-González, José A. González-Nóvoa, Laura Busto, Carlos Martinez, Miguel Alberte-Woodward, Jesús García de Soto, Jessica Pouso-Diz, María de los Ángeles Fernández Ceballos, Roberto Carlos Agis-Balboa</p>\r\n\r\nMultiple sclerosis (MS) is a multifaceted neurological condition characterized by challenges in timely diagnosis and personalized patient management. The application of Artificial Intelligence (AI) to MS holds promises for early detection, accurate diagnosis, and predictive modeling. The objectives of this study are: 1) to propose new MS trajectory descriptors that could be employed in Machine Learning (ML) regressors and classifiers to predict patient evolution; 2) to explore the contribution of ML models in discerning MS trajectory descriptors using only baseline Magnetic Resonance Imaging (MRI) studies. This study involved 446 MS patients who had a baseline MRI, at least two measurements of Expanded Disability Status Scale (EDSS), and a 1-year follow-up. Patients were divided into two groups: 1) for model development and 2) for evaluation. Three descriptors: <i>β</i><sub>1</sub>, <i>β</i><sub>2</sub>, and EDSS(t), were related to baseline MRI parameters using regression and classification XGBoost models. Shapley Additive Explanations (SHAP) analysis enhanced model transparency by identifying influential features. The results of this study demonstrate the potential of AI in predicting MS progression using the proposed patient trajectories and baseline MRI scans, outperforming classic Multiple Linear Regression (MLR) methods. In conclusion, MS trajectory descriptors are crucial; incorporating AI analysis into MRI assessments presents promising opportunities to advance predictive capabilities. SHAP analysis enhances model interpretation, revealing feature importance for clinical decisions.","author":"Silvia Campanioni","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9965c3db6778d45ee3a2ddf249016f851f45437aa1a169611db060c4b20052a0","category":"Interdisciplinary"}