{"title":"Dual Fractions Proteomic Analysis of Silica Nanoparticles Interactions with Protein Extracts","link":"https://www.preprints.org/manuscript/202409.0515/v1","date":1725617587000,"content":"Dual-fraction proteomics reveals a novel class of proteins impacted by nanoparticle exposure. Background: Nanoparticles (NPs) interact with cellular proteomes, altering biological processes. Understanding these interactions requires comprehensive analyses beyond solely characterizing the NP corona. Methods: We utilized a dual-fraction mass spectrometry (MS) approach analyzing both NP-bound and unbound proteins in Saccharomyces cerevisiae sp. protein extracts exposed to silica nanoparticles (SiNPs). We identified unique protein signatures for each fraction and quantified protein abundance changes using spectral counts. Results: Strong correlations were observed between protein profiles in each fraction and non-exposed controls, while minimal correlation existed between the fractions themselves. Linear models demonstrated equal contributions from both fractions in predicting control sample abundance. Combining both fractions revealed a larger proteomic response to SiNP exposure compared to single-fraction analysis. We identified 302/56 proteins bound/unbound to SiNPs and an additional 196 \"impacted\" proteins demonstrably affected by SiNPs. Conclusion: This dual-fraction MS approach provides a more comprehensive understanding of nanoparticle interactions with cellular proteomes. It reveals a novel class of \"impacted\" proteins, potentially undergoing conformational changes or aggregation due to NP exposure. Further research is needed to elucidate their biological functions and the mechanisms underlying their impact.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9974553e239eaeb78b90562913914beea9d10a98b765647261cb1442dab5dc9e","category":"Interdisciplinary"}