{"title":"NAC transcription factor SlNOR-like1 plays a dual regulatory role in tomato fruit cuticle formation","link":"https://academic.oup.com/jxb/article/75/7/1903/7323459?rss=1","date":1697673600000,"content":"<span><div>Abstract</div>The plant cuticle is an important protective barrier on the plant surface, constructed mainly by polymerized cutin matrix and a complex wax mixture. Although the pathway of plant cuticle biosynthesis has been clarified, knowledge of the transcriptional regulation network underlying fruit cuticle formation remains limited. In the present work, we discovered that tomato fruits of the NAC transcription factor <span>SlNOR-like1</span> knockout mutants (<span>nor-like1</span>) produced by CRISPR/Cas9 [clustered regularly interspaced short palindromic repeats (CRISPR)/CRISPR-associated protein 9] displayed reduced cutin deposition and cuticle thickness, with a microcracking phenotype, while wax accumulation was promoted. Further research revealed that SlNOR-like1 promotes cutin deposition by binding to the promoters of <span>glycerol-3-phosphate acyltransferase6</span> (<span>SlGPAT6</span>; a key gene for cutin monomer formation) and <span>CUTIN DEFICIENT2</span> (<span>SlCD2</span>; a positive regulator of cutin production) to activate their expression. Meanwhile, SlNOR-like1 inhibits wax accumulation, acting as a transcriptional repressor by targeting wax biosynthesis, and transport-related genes <span>3-ketoacyl-CoA synthase1</span> (<span>SlKCS1</span>), <span>ECERIFERUM 1-2</span> (<span>SlCER1-2</span>), <span>SlWAX2</span>, and <span>glycosylphosphatidylinositol-anchored lipid transfer protein 1-like</span> (<span>SlLTPG1-like</span>). In conclusion, SlNOR-like1 executes a dual regulatory effect on tomato fruit cuticle development. Our results provide a new model for the transcriptional regulation of fruit cuticle formation.</span>","author":"","siteTitle":"Journal of Experimental Botany Current Issue","siteHash":"742c07dc7ba60f1337de1e3aa176bc14944549a55b7425c2e178eb413eed1e54","entryHash":"9975d64969c82135cebd4da209c3fd6a4cd6d98dc3ac674938a21ba47f11e208","category":"Environment"}