{"title":"REGGIE MILLER: UPPING THE GAME WITH A CUSTOM VAMOOTS DISC RSL","link":"https://moots.com/reggie-miller-upping-the-game-with-a-custom-vamoots-disc-rsl/","date":1614268979000,"content":"<p>Words by: Micah Ling</p>\n<p>Images by: Moots + Pedalers Fork</p>\n<p>Basketball legend Reggie Miller has been upping his biking game for more than a decade now. And most recently, he welcomed a Vamoots Disc RSL road bike to his quiver. Reggie and his family live in Malibu, <span></span>California, and although he really fell in love with the bike scene via single track and mountain biking, he says most of his conditioning has always been done on tarmac. “I’m a mountain biker by discipline, but most of my hard training and intervals are done on the road.”</p>\n<p>And Reggie isn’t new to the Moots family, “I had Moots road and mountain bikes about 8 years ago,” but he’s since been riding a cyclocross bike for his road training, so he knew it was time to upgrade. “I knew Moots was the bike I needed because of the attention to detail.” And the details on his new Vamoots are drool worthy.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/2ND-IMAGE-.jpg\" /></p>\n<p>Nate Bradley, who oversaw the build from start to finish at Moots, says the project was a careful process, but one that’s not so different from the steps they go through with anyone who purchases a bike. It’s always important that the geometry and specifics are just right. “We had been fortunate enough to build bikes for Reggie in the past, both with very ‘tall’ characteristics. This was good beta for us to understand how Reggie felt about his bikes, and gave good direction going into this build.” To kick the build off, Moots worked with their dealer in Calabasas, CA, Pedalers Fork, which happened to be Reggie’s local shop of choice. “They got him in the shop earlier this summer and went over what he was looking for in a new bike, and how he wanted to be set up on it.” Pedalers Fork relayed the necessary information to the crew building the bike: Reggie wanted to blast around the hills and canyons of Southern California. He wanted a responsive and aggressive road bike, something that would be up to the task of hard accelerations on intervals, but also not get uncomfortable for longer rides.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/5TH-IMAGE.jpeg\" /></p>\n<p>Even though the bike seems tall at first glance, Nate says it’s rather low for someone of Reggie’s height. “This is one thing that we were able to gather from the conversation with Pedalers Fork. Despite his height, Reggie is rather flexible. This allowed us to tighten up the size of the front triangle to get a little more torsional stiffness for someone who is a great athlete on and off the bike. Just check out some of his ride data.” From there, Nate says they had a rough draft for the frame shape and configuration. Then it just came down to the details. “We looked into our selection of tubing and were able to pick a great double butted tubeset in a slightly larger diameter than we typically use on stock builds. With this larger diameter we were able to hold tight to our ideal butt profiles that gives our bikes the snappy feel, while also having the smooth glide that titanium is known for.”</p>\n<p><img src=\"https://moots.com/wp-content/uploads/6TH-IMAGE.jpeg\" /></p>\n<p>Nate says they were also pleased to be able to use their 3D printed flat RSL dropouts (pictured above). “These dropouts allow us to have a really tight rear end with the thru axle and flat mount, but also puts us in control of only adding material where it is needed to keep the dropouts stiff while remaining light.” From this point the ‘recipe’ or blueprint was in place and the Moots crew treated it like every other bike they make.</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0067-copy.jpg\" /></p>\n<p>“In the finishing stage of Reggie’s bike, we did a sweet gold ano to go hand in hand with the anodized blue bit throughout the build, and it really came out sharp.” Nate says that even though this particular build was for a high-profile rider, they handle all custom builds relatively the same. “We’ve established a very streamlined process when it comes to gathering pertinent information about the rider to build them a perfect bike without having them in front of us.”</p>\n<p>Last week, Reggie picked his new bike up from Pedalers Fork. The finished product, with blue and gold finishing touches as a nod to his 18-years with the Indiana Pacers, is sharp indeed. It also includes disc brakes and the SRAM RED eTap AXS FTW electronic shifting, which make the bike, “feel like a dream.” Four rides in and Reggie says, “She’s smooth as buttah!”</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0002-copy.jpg\" /></p>\n<p>Reggie says he’s excited to put in some serious miles because the more road riding he does on his Vamoots, the stronger he’ll get at mountain biking, and vice versa. “All of my long endurance rides will be on the Vamoots.” He’ll transition his cyclocross bike back to what it was made for — dirt and gravel. And use the Moots for those long all-day treks through the canyons.</p>\n<p>It’s clear that Reggie is like a kid again when he gets on a bike. He certainly takes training seriously, but mostly it’s all about fun. And that’s something he thinks everyone should get to enjoy. Beyond his own training and riding, Reggie always has an eye on the bigger picture. He says that ultimately, he hopes that more and more kids can grow up riding bikes, popping wheelies, and just having the freedom to go places. “I’m still somewhat new to this, but so far the cycling community has welcomed me. My main goal is to bring more diversity and inclusion to cycling. It’s a wonderful sport to get into and stay fit with.” Reggie says that everyone should feel welcomed when it comes to bikes. “The more people who look like me on bikes, the better. Everyone wants to have the same opportunity as the person next to them. So I try to bring awareness to everyday ways that we can all be better at helping in our cycling communities. It starts with conversation, and hopefully leads to action.”</p>\n<p>Reggie has also recently worked with Castelli on a “Say their names” jersey, which benefits the Equal Justice Initiative, an organization that challenges racial injustice in the United States. Reggie is clear that bikes are for fun, and fitness, and organized competition. But you can’t talk about any of those things without talking about race and representation. Reggie is bridging the gap. Look for him and his beautiful Vamoots out on the roads and trails around Malibu, but more importantly, look for ways to improve the cycling community as a whole, and make everyone feel welcome.</p>\n<p> THE BUILD DETAILS:</p>\n<p>Final assembly by: Derek Weider @ Pedalers Fork</p>\n<p>Frame: CUSTOM VAMOOTS DISC RSL</p>\n<p>Fork: ENVE ROAD ALL CARBON TAPERED</p>\n<p>Head Set: CHRIS KING</p>\n<p>Stem: ENVE CARBON</p>\n<p>Bar: ENVE CARBON ROAD</p>\n<p>Post: ENVE CARBON</p>\n<p>Groupset: SRAM RED AXS W/BLUE HOPE BRAKE CALIPERS</p>\n<p>Wheels: ENVE CARBON 3.4AR SES W/CHRIS KING R45 DISC HUBS, CUSTOM GRAPHICS</p>\n<p>Tires: VITTORIA CORSA CONTROL 30MM</p>\n<p><img src=\"https://moots.com/wp-content/uploads/IMG_0042-copy-1.jpg\" /></p>\n<p> </p>\n<p>The post <a href=\"https://moots.com/reggie-miller-upping-the-game-with-a-custom-vamoots-disc-rsl/\">REGGIE MILLER: UPPING THE GAME WITH A CUSTOM VAMOOTS DISC RSL</a> appeared first on <a href=\"https://moots.com\">Moots</a>.</p>","author":"Jon Cariveau","siteTitle":"Moots","siteHash":"dbee4c0f87f6913283dcacd1f8b3e2603e0d744c0d8d7eea7b1691bee838c4cd","entryHash":"997856f25f878805c3c40c34e7f8cdeadfd337c178ddae5a917f6698aea76e2d","category":"Cycling"}