{"title":"Long-Term Immunity Against SARS-CoV-2 Wild Type and Omicron XBB 1.5 in Indonesian Residents after Vaccination and Infection","link":"https://www.preprints.org/manuscript/202407.0805/v1","date":1720577473000,"content":"In the post-pandemic era, evaluating long-term immunity against COVID-19 has become increasingly critical, particularly in light of continuous SARS-CoV-2 mutations. This study aimed to assess long-term immunogenicity by analyzing booster shots’ impact and sera infection history collected in Makassar, Indonesia. We measured anti-RBD IgG levels and neutralization capacity (NC) against both the wild-type (WT) Wuhan-Hu and Omicron XBB 1.5 variants across groups of COVID-19 vaccinated individuals with no booster (NB), single booster (SB), and double booster (DB). The mean durations since the last vaccination were 25.11 months, 19.24 months, and 16.9 months for the NB, SB, and DB group, respectively. Additionally, we evaluated the effect of breakthrough infection (BTI) history, with a mean duration since the last confirmed infection of 21.72 months. Our findings indicate fair long-term WT antibody (Ab) titers, with the DB group showing significantly higher level than other groups. Similarly, the DB group demonstrated higher anti-Omicron XBB 1.Ab titer, which was insignificantly different from the other groups. Although the level of anti-WT Ab was moderate, we observed near-complete (96-97%) long-term neutralization against the WT pseudo-virus for all groups. There was a slight decrease in NC against Omicron XBB 1.5 compared to the WT among all groups; DB group, SB group, and NB group showed 80.71±3.9%, 74.29±6.7%, and 67.2±6.3% neutralization activity, respectively. Breakdown analysis based on infection and vaccine status showed that booster shots increase the NC against XBB 1.5. Individuals with BTI demonstrate a better NC compared to their counterpart uninfected individuals with the same number of booster shots. Our findings suggest that long-term immunity against SARS-CoV-2 persists and is effective against the mutant variant. Booster shots enhance the NC especially among uninfected individuals .","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"998239213ebc50685d0e68c533c003524776cd9c7b10c1ac4537bd6a2f7e0ddf","category":"Interdisciplinary"}