{"title":"Are Macs affected by that scary Intel ‘Downfall’ vulnerability?","link":"https://www.macworld.com/article/2026071/intel-downfall-vulnerability-macs-affected.html","date":1691609433000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Remember those serious <a href=\"https://www.macworld.com/article/230874/protect-your-mac-meltdown-spectre-faq.html\">Meltdown and Spectre CPU flaws</a> from about five years ago? Well, Intel’s in hot water again with another serious vulnerability that affects <em>years</em> worth of processors. </p>\n\n\n\n<p>Known as “Downfall,” the vulnerability exploits a flaw in the AVX vector extensions of every Intel CPU from the Skylake generation onward until we get to the more recent 12th-gen Alder Lake processors. </p>\n\n\n\n<p>Macs with these processors started appearing in late 2015 with the 21.5-inch iMac, and just about every Intel-based Mac–desktop or laptop–since that time is on the list of affected processors. Apple switched to its own chips in 2020 rather than using the newer 12th- and 13th-gen Intel processors (though those aren’t affected by the flaw anyway).</p>\n\n\n\n<h2>What is Downfall?</h2>\n\n\n\n<p>Researcher Daniel Moghimi, who discovered the flaw, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://downfall.page/&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">created a microsite about it</a> and describes it this way:</p>\n\n\n\n<blockquote>\n<p>Downfall attacks target a critical weakness found in billions of modern processors used in personal and cloud computers. This vulnerability, identified as <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-40982&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">CVE-2022-40982</a>, enables a user to access and steal data from other users who share the same computer. For instance, a malicious app obtained from an app store could use the Downfall attack to steal sensitive information like passwords, encryption keys, and private data such as banking details, personal emails, and messages. Similarly, in cloud computing environments, a malicious customer could exploit the Downfall vulnerability to steal data and credentials from other customers who share the same cloud computer.</p>\n</blockquote>\n\n\n\n<p>In short, the flaw exploits the way a particular “Gather” instruction (part of the vector instructions in these Intel processors) is executed to access data in RAM that the program shouldn’t normally have any access to. <a href=\"https://www.pcworld.com/article/2025589/downfall-serious-security-vulnerability-in-billions-of-intel-cpus-how-to-protect-yourself.html\">PCWold has more info on this flaw</a>.</p>\n\n\n\n<p>That’s bad. Real bad.</p>\n\n\n\n<p>The vulnerability was first revealed to Intel last summer, but only just now published in order to give Intel time to work on a fix. Intel has just begun releasing microcode for its processors to mitigate the issue, which users would get in the form of updates from their hardware vendors.</p>\n\n\n\n<h2>Are any Macs affected?</h2>\n\n\n\n<p>At this point, it’s unclear whether Macs are affected. Nearly every Mac from the Skylake generation onward (starting in late 2015) that has an Intel CPU inside uses a processor that is on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.intel.com/content/www/us/en/developer/topic-technology/software-security-guidance/processors-affected-consolidated-product-cpu-model.html#tab-blade-1-0&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">Intel’s list of affected products</a>. If you have an Intel-based Mac from 2016 or later (or the iMac released in late 2015), your CPU is almost certainly affected.</p>\n\n\n\n<p>But Macs are sort of unique. Intel Macs used custom motherboards and firmware, some even have the <a href=\"https://www.macworld.com/article/230870/the-t2-chip-makes-the-imac-pro-the-start-of-a-mac-revolution.html\">T2 processor</a> that manages a lot of stuff. It doesn’t <em>seem</em> as though any of this would necessarily prevent an attack using the Downfall vulnerability, but it’s hard to know until we get confirmation from Apple. we’ve reached out for clarification and will update this article if someone responds.</p>\n\n\n\n<p>It’s worth noting that the Skylake generation was the main impetus for Apple turning to its own silicon for the Mac, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.pcgamer.com/intel-skylake-why-apple-left/&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">according to a 2020 interview</a> with Ex-Intel principal engineer, François Piednoël. Piednoël claims that “Apple” quality assurance of Skylake was more than a problem,” and “Apple became the number one filer of problems in the architecture.” So it’s very possible that Apple took extraordinary steps to mitigate any potential issues with the chip, such as this Downfall flaw.</p>\n\n\n\n<p>We can find no reference to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-40982&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">CVE-2022-40982</a> on the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT201222&amp;xcust=1-1-2026071-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple Security Releases site</a>, but it was only just published, so even if there was a fix it wouldn’t have referenced it by name or CVE ID. Odds are, if Intel is only <em>just now</em> releasing microcode to mitigate this problem, Apple has not yet incorporated it into a macOS update.</p>\n\n\n\n<h2>What should you do next? Is there a fix?</h2>\n\n\n\n<p>If you have a Mac made in late 2015 or later, you might be affected, but there’s not much to do but wait. Apple will push out a macOS update to update the processor microcode, if necessary, or implement any other necessary mitigations. If you have a Mac that uses Apple Silicon (an M1 or M2-based processor), you have nothing to worry about.</p>\n\n\n\n<p>As always, it’s a good idea to only use software from trusted sources. That utility you downloaded from a website you never heard of before carries far more risk of malware than the latest release from a known entity like Microsoft or Google, or something from the Mac App Store.</p>\n\n\n\n<p>Macworld has several guides to help, including a guide on <a href=\"https://www.macworld.com/article/670537/do-macs-need-antivirus.html\">whether or not you need antivirus software</a>, a <a href=\"https://www.macworld.com/article/672879/list-of-mac-viruses-malware-and-security-flaws.html\">list of Mac viruses</a>, malware, and trojans, and if you want more protection, take a look at our roundup of the <a href=\"https://www.macworld.com/article/668850/best-mac-antivirus-software.html\">best Mac antivirus software</a>.</p>\n\nMac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9985e688aae7ba7c30c69bf0c6be4507eef75ef74050743ad1de58cac2ea72bd","category":"Apple"}