{"title":"Programmed Aging, Digital Genetics, and the Evolution of Acquisition Traits in Mammals","link":"https://www.preprints.org/manuscript/202308.1851/v2","date":1724927394000,"content":"Acquisition traits are those that depend for their evolutionary (fitness) value on the acquisition of something that gradually accumulates during an organism’s life but is not transmitted genetically to descendants. This situation causes these traits including language, immunity, intelligence, and social status to represent a special need for evolvability and programmed aging. Programmed aging refers to the idea that mammals and some other multiparous sexually reproducing organisms evolved complex biological mechanisms that cause gradually increasing fitness deterioration and internally limit individual organism lifetimes.  The rationale is that this process enhances the survival (non-extinction) of a species population. Evolvability theories propose that mammals have evolved design characteristics that aid their ability to evolve, that is, reduce the time required for a particular increment of evolutionary adaptation and/or increase the precision with which the adaptation can be performed. Because an increase in evolvability aids a population in escaping extinction, evolution selects the associated design characteristics. Both concepts conflict with traditional (Darwinian) theory regarding details of the nature of evolution. However, more recent genetics discoveries have exposed rich detail regarding the nature of the evolution process including the fact that biological inheritance involves the transmission of organism design information from parent to descendant in digital form. These discoveries have acted to support both programmed aging and evolvability theories.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"998752d251c9fb56db534f76819b68b69eceafaaf1a74ae8b3991b6f641a28f6","category":"Interdisciplinary"}