{"title":"Mucosal epithelial homeostasis: Reference intervals for skin, gill lamellae and filament for Atlantic salmon and other fish species","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfd.14023?af=R","date":1727174642000,"content":"<h2>Abstract</h2>\n<p>Mucosal barriers are gatekeepers of health and exhibit homeostatic variation in relation to habitat and disease. Mucosal Mapping technology provides an in-depth examination of the dynamic mucous cells (MCs) in fish mucosal barriers on tangential sections, about 90° from the view of traditional histology. The method was originally developed and standardized in academia prior to the establishment of QuantiDoc AS to apply mucosal mapping, now trademarked as Veribarr™ for the analysis of skin, gills and gastrointestinal tracts. Veribarr™ uses design-based stereology for the selection and measurement of cell area (size) (μm<sup>2</sup>), the volumetric density of MCs in the epithelium (MCD, amount of the epithelia occupied by MCs, in %) and the calculated abundance of the MCs (barrier status or defence activity). MC production was mapped across the skin and gill epithelia in 12 species, discovering that gills consistently have two distinct groups of MCs, one on the lamellae where MCs are few and small and one on the filament where MCs are larger and more abundant. MCs were usually much larger in the skin than in the gills, with the latter requiring fewer and smaller cells for adequate respiration. The difference observed between MCs in gill lamella and gill filament is likely a result of functional demands. In addition, our findings also highlight a variation in the mucosal parameters between the species skin, which cannot be explained by the weight differences, and a potential link between MC distribution and species-specific lifestyles in the gill lamella. This diversity necessitates the development of species and tissue site-specific reference intervals for mucosal health evaluation. Mucosal bivariate reference intervals were developed for MC production, including size (trophy) and calculated defence activity (plasia) in the skin and gills of Atlantic salmon, to contrast new measurements against historical data patterns. The application of mucosal reference intervals demonstrates that stress from parasites and treatments can manifest as changes in mucosal architecture, as evidenced by MC hypertrophy and hyperplasia within the gill lamellae. These reference intervals also facilitate comparisons with wild Atlantic salmon, revealing a somewhat higher MC level in farmed salmon gill lamellae. These findings suggest that MC hyperplasia and hypertrophy in the gills are stress/environmental responses in aquaculture. They also advocate for developing specific mucosal bivariate homeostatic reference intervals in aquaculture to improve fish health and welfare across all farmed species.</p>","author":"Grigory V. Merkin, \nAlbert Girons, \nMearge A. Okubamichael, \nKarin Pittman","siteTitle":"Wiley: Journal of Fish Diseases: Table of Contents","siteHash":"522bae7a716dcc0a36dfec7d8f82102ddbcbd512e9a42d779409929aec07420a","entryHash":"998c6b3b261cfc3f50cb5440e1ef936247eb949ac5b75281418a89f1fcab5d59","category":"Environment"}