{"title":"Top 6 gravel bike upgrades","link":"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-upgrades/","date":1686988800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2021/04/best-gravel-bike-accessories--ad1bb87.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"best gravel bike accessories\" title=\"best gravel bike accessories\" />                                            <p>It’s safe to say gravel riding is still one of the hottest things in cycling, with new bikes and tech being released all the time.</p>\n<p>Our guide to the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">best gravel bikes</a> is one of the most popular articles on BikeRadar and several of the team are keen gravel riders, so we know first-hand how popular – and fun – all-terrain bikes are.</p>\n<p>As with anything in cycling, however, buying a new bike is only the start. Upgrading your machine is all part of the fun. But what’s really worth your money when tinkering with your <a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-setup/\">gravel bike setup</a>?</p>\n<p>With that in mind, here are our top six gravel bike upgrades. Some of them may be obvious, others less so. As always, let us know if you have any suggestions of your own in the comments, or head over to the <a href=\"https://www.youtube.com/channel/UCyrQSvn6_25rINepVZ6H0qQ\" target=\"_blank\">BikeRadar YouTube channel</a> for more videos like this.</p>\n\n<h2>1. Tubeless tyres</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Four gravel tyres\" title=\"gravel_tyres\" /></div><div><figcaption><span><i></i> The best gravel bike tyres can be converted to tubeless.</span></figcaption><span> <i>Robyn Furtado / Our Media </i></span></div>\n<p>Our first upgrade? Converting your gravel bike to <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless tyres</a>.</p>\n<p>Tubeless tyres are yet to become truly mainstream in the road world, but in the off-road world they’ve become widely accepted as the tyre of choice, and now some of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">best gravel bike tyres</a> are available in tubeless-ready options, too.</p>\n<p>Tubeless tyres work by ditching a traditional <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a>, and instead use a small amount of <a href=\"https://www.bikeradar.com/features/which-tubeless-sealant-works-the-best/\">tubeless sealant</a> to fill the tyre that can usually plug holes up to 3mm wide.</p>\n<p>You do need dedicated tubeless tyres and rims, but these now come as standard on many gravel bikes.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"How to repair a punctured tubeless bike tyre\" title=\"How to repair a punctured tubeless tyre\" /></div><div><figcaption><span><i></i> It is still possible to puncture a tubeless tyre, but repair is often easier than with a tube (and you may not even notice many punctures).</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>The obvious advantage to tubeless tyres is increased puncture resistance compared to a clincher tyre setup, thanks to the sealant sealing small cuts that might otherwise result in a full-blown puncture. You also get improved grip and ride quality because you can generally run lower pressures with tubeless tyres.</p>\n<p> </p>\n<h2>2. Bar or bum bag</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Jack Luke Horse for the Course Scottish bikepacking on Vitus Energie\" title=\"Jack Luke Horse for the Course Scottish bikepacking on Vitus Energie\" /></div><div><figcaption><span><i></i> Bar bags are a neat on-bike solution for carrying your bits and bobs.</span></figcaption><span> <i>Jack Luke / Immediate Media</i></span></div>\n<p>If you’re heading out on an all-day gravel ride, you’ll need somewhere to stash food and spares.</p>\n<p>Among the BikeRadar team, there are two schools of thought when it comes to packing for a <a href=\"https://www.bikeradar.com/advertising-feature/what-is-gravel-riding/\">gravel riding</a> adventure: some prefer to keep things on the bike, while others prefer to keep their things on them.</p>\n<p>If you’re in the on-bike camp, then we recommend starting with something like a bar bag. Our videographer Robyn has used her Apidura Backcountry on many a gravel escapade, while our video manager Felix goes for the Bagel Bag from Straight Cut Design.</p>\n<p>They’re quick to fit and can hold a surprising amount. More importantly, their position on the front of the bike means it’s super-easy to get the contents out while you’re on the move.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"We take 11 bumbags out over some tough trails to see which is the best buy. Ian Linton\" title=\"MBK_413_group.IL_bumbags_RNED7987\" /></div><div><figcaption><span><i></i> Some gravel riders love a cheeky bum bag.</span></figcaption><span></span></div>\n<p>If you like to keep your bike as lean as possible, then one of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hip-packs/\">best bum bags</a> could be the way to go.</p>\n<p>On shorter rides, up to three to four hours, Evoc’s 1-litre Hip Pouch is popular among the BikeRadar staffers. For longer four to eight hour rides, you may want to up your game to the 3-litre Hip Pack.</p>\n<p>Either way, a bar or bum bag does a brilliant job of carrying all of your gravel essentials. And if you’re planning a multi-day trip, <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a> will allow you to carry everything you need on the bike.</p>\n<h2>3. Easier gears</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"The Liv Devote Advanced Pro women's gravel bike uses a SRAM eTap AXS Wide groupset\" title=\"Liv Devote Advanced Pro\" /></div><div><figcaption><span><i></i> SRAM’s eTap AXS Wide groupset for gravel riding.</span></figcaption><span> <i>Phil Hall / Immediate Media</i></span></div>\n<p>There are lots of things brands get right when it comes to gravel bikes – be it <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/road-bike-geometry-explained/\">geometry</a>, tyre choice or mounting points, your options as a consumer get better by the year.</p>\n<p>However, they sometimes slip up when it comes to gearing choice.</p>\n<p>While gravel bike gearing is getting ever-lower, with the rise of gravel-specific groupsets including <a href=\"https://www.bikeradar.com/reviews/components/groupsets/shimano-grx-review/\">Shimano GRX</a> and <a href=\"https://www.bikeradar.com/reviews/components/groupsets/campagnolo-ekar-groupset-review/\">Campagnolo Ekar</a>, how a brand specs your bike when you buy it might not work for you.</p>\n<p>Now, it’s important to say that gearing is totally down to personal preference, as well as where and how you ride, but members of our test team often find themselves wanting lower – easier – gears on their gravel bikes.</p>\n<p>After all, long, hard days on bumpy terrain can really sap the legs, so it’s great to have those lighter gears for when your legs have had enough. Equally, if you’re on a bikepacking trip and your bike is fully loaded, you’ll need lower gears to help with the extra weight.</p>\n<p>There are a couple of ways to lower the gearing on your gravel bike. Number one is fitting a bigger cassette, but this is limited by your bike’s <a href=\"https://www.bikeradar.com/advice/buyers-guides/a-complete-guide-to-rear-derailleurs/\">rear derailleur</a>.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SRAM Apex Eagle mechanical groupset with mullet gearing on a Rose Backroad gravel bike\" title=\"SRAM Apex Eagle mechanical groupset with mullet gearing on a Rose Backroad gravel bike\" /></div><div><figcaption><span><i></i> It’s worth considering a mullet setup if you want a 1x drivetrain with the lowest gearing possible.</span></figcaption><span> <i>SRAM</i></span></div>\n<p>If your rear derailleur can’t take a bigger cassette, you can look into aftermarket options such as derailleur hanger extenders, or you could just change your rear derailleur and cassette at the same time.</p>\n<p>The other way is to fit a smaller chainring – or chainrings, if you have a double crankset. This can be done either by changing the whole crankset or just the rings. However, chainring size is limited by the BCD (Bolt Circle Diameter) on your crankset, so make sure they match.</p>\n<p>Those looking for the lowest gearing possible may be best-served by a mullet drivetrain.</p>\n\n<h2>4. A rear mudguard</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"SKS Speedrocker gravel mudguards\" title=\"SKS Speedrocker gravel mudguards\" /></div><div><figcaption><span><i></i> Mudguards are not a crime.</span></figcaption><span></span></div>\n<p>This one came straight from the mouth of our senior tester and gravel aficionado <a href=\"https://www.bikeradar.com/author/tommarvin/\">Tom Marvin</a>.</p>\n<p>Followers of <a href=\"https://www.instagram.com/tommarvin1/?hl=en\" target=\"_blank\">Tom’s Instagram account</a>, will no doubt be familiar with his gravel rides out to pastures unknown, and the one thing that changed his winter riding for the better was the humble rear mudguard.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mudguards-fenders-a-buyers-guide/\">Mudguards</a> have been a staple of <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-winter-road-bikes/\">winter road bikes</a> for many a year. Where they’re not so common is on gravel bikes, and we (or, more specifically, Tom) think that’s an absolute travesty.</p>\n<p>They’re affordable, easy to fit and do a great job of keeping you dry on an all-day epic. What’s not to like? If you’re after recommendations, check out our round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bike-mudguards/\">best gravel mudguards</a>.</p>\n<h2>5. Comfort upgrades, including suspension</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Canyon Grail: ON CF7 gravel eBike\" title=\"Canyon Grail ON CF7 - 07\" /></div><div><figcaption><span><i></i> Canyon’s VCLS seatpost brings compliance to the back end.</span></figcaption><span> <i>Russell Burton / Our Media</i></span></div>\n<p>These upgrades cover anything that makes your riding experience more comfortable. You’ve got a range of options here, to suit a variety of bikes and budgets.</p>\n<p>At the more affordable end, we’ve found many gravel bikes come with relatively thin, road bike-style <a href=\"https://www.bikeradar.com/features/6-of-the-best-bar-tape/\">handlebar tape</a>. Replacing this with something a little thicker is an easy way to add some comfort to the controls.</p>\n<p>Spend more and you can start to look at components such as Canyon’s snappily named S14 VCLS 2.0 CF Seatpost. Its unique construction is claimed to offer 20mm of flex, which should take some of the sting out of those washboard gravel tracks.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Fox 32 Taper-Cast Gravel Performance Factory suspension fork\" title=\"Fox 32 Taper-Cast Gravel Performance Factory suspension fork\" /></div><div><figcaption><span><i></i> You can now buy aftermarket suspension forks for your gravel bike.</span></figcaption><span> <i>Fox</i></span></div>\n<p>If you want to spend the big bucks? Then you can start looking at dedicated gravel suspension from the likes of <a href=\"https://www.bikeradar.com/brand/fox/\">Fox</a> and <a href=\"https://www.bikeradar.com/brand/lauf/\">Lauf</a>.</p>\n<p><a href=\"https://www.bikeradar.com/news/fox-32-tc-gravel-fork/\">Fox’s 32 Taper-Cast</a> is a gravel-specific suspension fork available with either 40 or 50mm of suspension travel, whereas Lauf goes for a striking leaf-sprung design, with 30mm of travel.</p>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-suspension/\">Do you actually need suspension on your gravel bike</a>? Well, that depends on where and how you ride, and is a debate for another day.</p>\n<h2>6. Gravel tyre tubeless inserts</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt=\"Gravel tyre tubeless insert\" title=\"Gravel tyre tubeless insert\" /></div><div><figcaption><span><i></i> Tubeless tyre inserts are popular on mountain bikes.</span></figcaption><span> <i>Vittoria</i></span></div>\n<p>Tyre inserts are a relative newcomer to the gravel world, but are <a href=\"https://www.bikeradar.com/features/no-more-flat-tyres-three-puncture-preventers-tested/\">becoming increasingly popular among mountain bikers</a>.</p>\n<p>They’re basically foam/rubber rings that butt up against the rims on the inside of tyres. While they add a small amount of weight, they can help protect tyre sidewalls and rims against any big hits, especially important if you’re running the lower pressures. They’re especially useful if you ride regularly on rooty or rocky terrain.</p>\n<p>From experience, we’ve also found a tyre insert will enable you to limp home on a catastrophically punctured tyre, such as a huge tear in a sidewall.</p>\n<p>You certainly won’t be getting any KOM/QOMs, but you’ll get home much faster than if you have to walk.</p>","author":"Felix Smith","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"9994a063b5ecab249823b15cd9eb79d767e66602eeff1ffd872e368a23c0a004","category":"Cycling"}