{"title":"PSIII-19 Impact of EnduraPig and EnduraSow supplementation on growth performance of wean to finish pigs naturally infected with porcine reproductive and respiratory syndrome virus","link":"https://academic.oup.com/jas/article/102/Supplement_2/299/7664917?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Porcine reproductive and respiratory syndrome (PRRS) continues to be an economically devastating disease to the pork industry around the world. Apart from vaccination and biosecurity measures, nutritional strategies are needed to mitigate the negative effects of PRRS virus (PRRSV) infection on pork production. The aim of the present study was to determine the effect of EnduraPig and EnduraSow (PMI Additives) on growth performance, viremia, and livability of wean to finish pigs naturally infected with PRRSV. A total of 660 newly-weaned pigs [DNA L600 x 241 genetics; average body weight (BW) = 7.3 ± 0.14 kg) were divided into 33 pens (11 pens per treatment, 20 pigs per pen). Each pen within a location block was randomly assigned to one of three dietary treatments consisting of either a non-supplemented basal diet (NC), basal diet with EnduraPig (EP), or basal diet with EnduraSow (ES). Apart from growth [average daily gain (ADG), average daily feed intake (ADFI), feed to gain ratio (F:G)] and livability metrics, serum sample was also collected from 1 sentinel pig per pen at 0, 21, 42, and 63 d postweaning to monitor recovery from PRRSV infection, based on the change in percentage of viremic pigs. Analysis of variance for growth and mortality was performed using Mixed Procedure in SAS (SAS 9.4, SAS Institute Inc., Cary, NC) and a priori contrasts were used to detect treatment differences at <span>P</span> &lt; 0.05. Association between treatments and % viremic pigs at each time point was assessed using Fisher’s exact test and declared significant at <span>P</span> &lt; 0.05. Mortality and removals were greatest during the first 4 wk postweaning, but no treatment differences were detected in overall wean to finish mortality (23.6, 21.8, and 20.4% for NC, EP, and ES, respectively). At d 21, 89.9% of the pigs sampled were viremic compared with 56.8% on d 0. The average % viremic pigs went down to 57.5 and 18.5%, for d 42 and 63, respectively, with no treatment differences observed in both periods. Feeding EP, however, improved all growth performance metrics compared with NC (+11.8 kg in final body weight, <span>P</span> &lt; 0.01; +13% in ADG, <span>P</span> &lt; 0.01; +7% in ADFI, <span>P</span> &lt; 0.05; and -5.5% in F:G, <span>P</span> &lt; 0.05). Feeding ES also improved performance of wean to finish pigs over NC (+16.4 kg in final body weight, <span>P</span> &lt; 0.01; +18% in ADG, <span>P</span> &lt; 0.01; +12% in ADFI, <span>P</span> &lt; 0.01; and -5.2% in F:G, <span>P</span> &lt; 0.05). In summary, the results of this study indicate that dietary supplementation of EnduraPig or EnduraSow improved growth performance of wean to finish pigs naturally infected with PRRSV, indicating that these nutritional technologies help boost the immune response against PRRSV.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"99a98f968ec41998f94997b37e2a6f57f02711fb6a96ea2cc71912dd843c909a","category":"Environment"}