{"title":"Tour Series 2021 calendar revealed","link":"https://www.cyclist.co.uk/news/9789/tour-series-2021-calendar-revealed","date":1624526222000,"content":"<span>\n      <span><a href=\"/authors/will-strickson\">Will Strickson</a></span>\n  </span><div>  \n  <div>      <div><span>25 Jun 2021</span></div>    </div></div><p>\nThis year's Tour Series will be held in August and visit Guisborough, Sunderland and Castle Douglas. Photo: SWPix</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/06/anna_henderson_x_tour_series.jpg?itok=Ehcfujlf\" />  </div>\n<div>\n      <p> The host venues for the 2021 <a href=\"https://www.cyclist.co.uk/tags/tour-series\">Tour Series</a> have been revealed, with the three-date series visiting Guisborough, Sunderland and Castle Douglas.</p>\n<p><a href=\"https://www.cyclist.co.uk/news/9170/tour-series-2021-postponed-until-august\">Pushed back to August for this year</a>, the week-long series will see men's and women's races in Guisborough, North Yorkshire on Sunday 8th August, before heading further north to Sunderland on Tuesday 10th August and Castle Douglas in Dumfries and Galloway on Thursday 12th August.</p>\n<p>It will be the first time the Tour Series has had a Yorkshire round as it opens in the market town of Guidborough in the borough of Redcar and Cleveland.</p>\n<p>Mary Lanigan, leader of Redcar and Cleveland Council, said, 'We are so excited – and privileged – to be welcoming Britain's cycling elite back to our borough. Lockdown saw many people in the area take up the sport as their one form of exercise a day, and now they have the very unique opportunity to watch the professionals take on their own streets.</p>\n<p>'The televised event will be a real boost for the local economy too, giving Guisborough the chance to showcase all it has to offer from its idyllic position at the foot of the North Yorkshire Moors.'</p>\n<p>It's also the first time the series visits Castle Douglas as the town hosts the race as part of the CD Bike and Food Festival, although three <a href=\"https://www.cyclist.co.uk/tags/tour-of-britain\">Tour of Britain</a> stages have finished there, including an André Greipel win in 2016.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/news/9811/chris-boardman-appointed-chair-of-sport-england\">Chris Boardman appointed chair of Sport England</a></div>      <div><a href=\"/in-depth/9810/gallery-mark-cavendishs-fairytale-tour-de-france-victory\">Gallery: Mark Cavendish's fairytale Tour de France victory</a></div>      <div><a href=\"/news/1755/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Tour de France 2021: Everything you need to know</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 115: on sale now!</a></div>    </div></div><p>\n<a href=\"https://www.cyclist.co.uk/tags/tour-series\">Tour Series</a> race director Mick Bennett said, 'We know the importance of the Tour Series to teams and riders, and their sponsors, but also to fans in the UK so it was always a key aim for SweetSpot in 2021 to make sure that the Tour Series in 2021 to make sure that the Tour Series returned.</p>\n<p>'Hopefully this news can contribute an increase in confidence for domestic racing, not just for the rest of the year but going into 2022 as well.'</p>\n<p>Provided the current <a href=\"https://www.cyclist.co.uk/tags/coronavirus\">Covid-19</a> roadmap doesn't change, unticketed, standing spectators will be allowed at all three events and highlights of each round will be broadcast on ITV4. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"wstrickson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"99aa8ef2f89e2f00e6a0692025b2198108f0fc9a5b40d38e8a371753b9aee989","category":"Cycling"}