{"title":"Facing Life in Old Age: Exploring Resilience in Older Adults with Bipolar Disorder","link":"https://www.preprints.org/manuscript/202406.0129/v1","date":1717507530000,"content":"Background: Older adults with bipolar disorder (OABD) are individuals aged 50 years and older with bipolar disorder (BD). People with BD may have fewer coping strategies or resilience. A long course of the disease, such as in OABD, could impact the development of resilience strategies, but this remains under-researched in OABD. Therefore, this study aims to assess resilience levels within the OABD and explore associated factors, hypothesizing that resilience could improve psychosocial functioning, wellbeing and quality of life of OABD patients. \nMethods: This study sampled 33 OABD patients from the OABD cohort at the Bipolar and Depressive Disorders Unit of Hospital Clinic of Barcelona. This was an observational, descriptive and cross-sectional study. Demographic and clinical variables as well as psychosocial functioning, resilience and cognitive reserve were analyzed. Resilience was measured using the CD-RISC-10. Non-parametric tests were used for statistical analysis. \nResults: The average CD-RISC-10 score was 25.67 points (SD 7.87). Resilience negatively correlated with the total number of episodes (p = 0.034), depressive episodes (p = 0.001), and the FAST (p &lt; 0.001). Participants with normal resilience had a lower FAST (p = 0.046), a higher CRASH (p = 0.026), and more EOBD (p = 0.037) compared to those with low resilience.\nConclusions: OABD individuals may exhibit lower resilience levels which correlate with more psychiatric episodes, particularly the number of depressions and worse psychosocial functioning and cognitive reserve. Better understanding and characterization of resilience could aid in early identification of patients requiring additional support to foster resilience and enhance OABD management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"99abcbc054f32c69088b4b236bc3a02b5075deb51355bc2eb807cd661e355926","category":"Interdisciplinary"}