{"title":"ทีมวิจัยนำโดย DeepMind ดึงข้อมูลฝึก ChatGPT ออกมาสำเร็จ เพียงแค่สั่งให้ท่องคำซ้ำไปเรื่อยๆ","link":"https://www.blognone.com/node/137024","date":1701369279000,"content":"<div><div><div><p>ทีมวิจัยร่วมระหว่าง DeepMind และนักวิจัยจากมหาวิทยาลัยหลายแห่ง รายงานถึงเทคนิคการดึงข้อมูลที่ใช้ฝึกปัญญาประดิษฐ์ในกลุ่ม LLM โดยเฉพาะ ChatGPT ที่ถูกจูนเพื่อไม่ให้คืนข้อมูลที่ใช้ฝึกออกมาตรงๆ (ดู<a href=\"https://chat.openai.com/share/456d092b-fb4e-4979-bea1-76d8d904031f\">ตัวอย่างแชต</a>)</p>\n<p>การดึงข้อมูลที่ใช้ฝึก AI นั้นมีการวิจัยมานาน แต่ก่อนหน้านี้มักเป็นการทดลองในโมเดลโอเพนซอร์สที่นักวิจัยสามารถศึกษากระบวนการทำงานได้อย่างละเอียด และสามารถตรวจสอบข้อมูลได้ทันทีว่า AI แสดงข้อมูลที่ใช้ฝึกหรือยังเพราะนักวิจัยเห็นข้อมูลฝึกอยู่แล้ว ในกรณี ChatGPT นั้นยากกว่ามากเพราะ OpenAI ฝึกโมเดลเพื่อไม่ให้คืนข้อมูลที่ฝึกเข้าไป และนักวิจัยไม่เห็นอะไรนอกจาก API ของ OpenAI เอง</p>\n<p>แนวทางของ DeepMind อาศัยการดาวน์โหลดข้อมูลจากอินเทอร์เน็ตมาขนาดรวมถึง 10TB และตรวจสอบข้อมูลที่ได้จาก ChatGPT ว่าตรงกับข้อมูลในฐานข้อมูลหรือยัง</p>\n<p>การป้องกันการโจมตีเช่นนี้ทำได้ไม่ยากนัก OpenAI อาจจะสั่งให้ ChatGPT เลิกตอบคำสั่งที่สั่งให้พูดซ้ำไปเรื่อยๆ  แต่ก็ไม่ใช่การแก้ปัญหาโดยตรง ทีมวิจัยระบุว่าควรมีการศึกษาต้นเหตุของช่องโหว่ที่เปิดให้โจมตีเช่นนี้ได้แต่แรก ทีมงานแจ้ง OpenAI  และผู้พัฒนาโมเดลอื่นๆ ในงานวิจัยนี้ก่อนเผยแพร่เป็นเวลา 90 วัน ดังนั้นตอนนี้บริษัทต่างๆ ก็อาจจะแก้ปัญหาไปแล้ว</p>\n<p>ที่มา - <a href=\"https://not-just-memorization.github.io/extracting-training-data-from-chatgpt.html?ref=404media.co\">GitHub.io</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/247f26f9a2ea79bf5bf1b0843c473ab5.png\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/chatgpt\">ChatGPT</a></div><div><a href=\"/topics/deepmind\">DeepMind</a></div><div><a href=\"/topics/llm\">LLM</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"99bf50bddb34692bb962ea57278a4e3e340842ffaeb0ed14563a079f0b42b1d2","category":"Thai"}