{"title":"Instrument Optimization of a High-Energy Electron Energy-loss Spectrometry System in an Aberration-Corrected Scanning Transmission Electron Microscope","link":"https://academic.oup.com/mam/article/doi/10.1093/mam/ozae044.685/7719868?rss=1","date":1721779200000,"content":"<span>Electron energy loss spectrometry (EELS) analysis can offer not only elemental identification and compositions, but also insight on chemical bonding status such as bonding types through near edge features and bonding distances with coordination numbers through extended edge features appear in spectra. The bonding-related information obtainable by EELS analysis is similar to that generated by X-ray absorption spectroscopy (XAS) in synchrotrons available at several Department of Energy National Labs. In fact, an EELS system mounted on the latest aberration-corrected scanning transmission electron microscope (STEM) has benefits over the synchrotron-based XAS approaches. For example, electrons have much higher interactions with matters than X-ray, so that energy-loss signal generation is more efficient. Furthermore, analytical spatial resolution in the STEM-EELS can be as low as sub-Å levels in ab aberration-corrected STEM, whereas achievable resolution can be ∼20 nm in the latest synchrotron-based XAS system. Due to the limitation in energy-loss ranges (∼3,000 eV) in a typical EELS system, unfortunately, EELS information recorded from lower energy-loss edges is hardly compared with XAS data obtained through relatively higher energy edges. Therefore, we have developed a new EELS system acquirable for higher electron energy-loss signals (aiming to expand the acquirable energy-loss range from conventional ∼3,000 eV to 13,000 eV) and installed to an existing aberration-corrected S/TEM JEOL JEM-ARM200CF together with a new scanning generator called MDP at Lehigh. The system development and installation were performed in collaboration with JEOL (USA, Germany and Japan) and CEOS (Germany). In this study, we applied further system optimization to acquire higher energy EELS signals.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"99cb1ac3cd833ba5b1f5542d8f0d35fabbe248f114e7ec54def6d91a57ed01d3","category":"Environment"}