{"title":"Compounding impacts of COVID-19, cyclone and price crash on vanilla farmers’ food security and natural resource use","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311249","date":1727964000000,"content":"<p>by Henintsoa Rakoto Harison, James P. Herrera, O. Sarobidy Rakotonarivo</p>\r\n\r\nThe intersection of the COVID-19 pandemic with other crises can amplify vulnerabilities and push communities further into poverty. In low-income countries, the dual impacts of COVID-19 and extreme weather events, along with multidimensional poverty and structural vulnerabilities in agriculture can decimate farmer livelihoods. This study aims to understand the effects of individual and compounding crises (COVID-19, cyclones, and vanilla price collapse) on smallholder vanilla farmers and local coping strategies in Madagascar, one of the world’s largest vanilla producers and poorest countries. We used semi-structured and scenario-based interviews across two case study villages with contrasting enforcement of forest regulations. We found that the impact of the pandemic, combined with the cyclone event, disrupted livelihoods, resulting in income losses and food security challenges that exacerbated farmer vulnerabilities. Sixty eight percent of households reported crop losses due to strong winds and heavy rainfall brought by cyclone Enawo in 2017. The COVID-19 outbreak struck the region just as the residents were recovering from the effects of the cyclone. COVID-19-related travel restrictions in the aftermath of the cyclone took a substantial economic toll, with 54.1% of respondents experiencing a decline in earnings, and 17% facing a total loss of income due to the imposed lockdown. The decline in vanilla prices at the onset of 2020 had a far-reaching additional impact, affecting not only farmers but also residents who rely on other sources of income. Local communities reported using the forest resources more frequently as a safety net during crises in the village with more lenient regulations. This study underscores the importance of understanding the interconnectedness and compounding impacts of cascading crises on food security and natural resource use. We highlight the need for a comprehensive approach to increasing farmer resilience, particularly for those reliant on global market crops such as vanilla.","author":"Henintsoa Rakoto Harison","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"99cba360a406b8492c5da1be5f4633d7106c2464d26a58d6541e2b10f8e514b0","category":"Interdisciplinary"}