{"title":"Report: Apple’s upcoming A18 and M4 chips to get boosted AI capabilities","link":"https://www.macworld.com/article/2237842/report-apples-upcoming-a18-and-m4-chips-to-get-boosted-ai-capabilities.html","date":1708015000000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s push into generative AI this year seems more and more certain, especially after <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://money.udn.com/money/story/5612/7769194&amp;xcust=1-1-2237842-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Economic Daily</a> published a report on Thursday about Apple’s plans for its upcoming chips. The plans, according to ED (translated from Chinese), “will not only greatly strengthen the AI computing power of M3 and A17 processors, but also significantly increase the number of AI computing cores and performance of the new generation of M4 and A18 processors, and the carrying rate of AI applications in all product lines will be greatly improved.”</p>\n\n\n\n<p>This likely means that Apple will be making enhancements to the Neural Engine, the section of Apple chips that handles machine learning. However, ED does not detail how the chips will “strengthen the AI computing power,” whether by increasing the core count, improving processing speed, introducing new core functions, a combination of all three, or some other means.</p>\n\n\n\n<p>It’s also easy to see how an AI enhancement will happen in the M4 and A18 chips; they haven’t been released yet and it makes sense that Apple would implement it in these chips. An A18 Pro chip will likely be at the heart of the iPhone 16 Pro when it is released this fall. As for the M4, it may not appear until the end of this year when Apple updates the MacBook Pro and iMac.</p>\n\n\n\n<p>However, the ED report also refers to the M3 and A17 processors, which Apple has already used in shipped products. That makes it sound as if Apple will make AI updates to unreleased versions of these chips. Apple has yet to release the last chip in the M3 series, the M3 Ultra, so ED could be referring to the Ultra in its report. The A17 Pro is already in the iPhone 16, so does that mean the non-pro A17 that will end up in the new iPhone 16 have an AI-boosted chip? Perhaps.</p>\n\n\n\n<p>During Apple’s first-quarter financial statement earlier this month, CEO Tim Cook made <a href=\"https://www.macworld.com/article/2225998/tim-cook-confirms-gen-ai-ios-18.html\">several references to the company’s work in AI</a>. Cook said that AI is an area where the company has spent “a tremendous amount of time and effort, and we’re excited to share the details of our ongoing work in that space later this year.” That could be at Apple’s Worldwide Developers Conference in June. Cook’s comment came after Bloomberg’s Mark Gurman <a href=\"https://www.macworld.com/article/2113912/apple-generative-ai-siri-suggested-replies-ios-18.html\">reported</a> that Apple’s generative AI push will start with iOS 18.</p>\n\n\n\n<p>Here’s <a href=\"https://www.macworld.com/article/2221069/ios-18-ai-release-date-features-compatibility-beta.html\">everything we know so far about iOS 18</a>. And here’s <a href=\"https://www.macworld.com/article/2007943/iphone-16-release-date-specs-features-rumors.html\">what we know so far about the iPhone 16</a>.</p>\n\nCPUs and Processors, iPhone, Mac</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"99cf880a3982ed3b73fc1a13b8540e4c71822949b7023a0d67f8e81174781f90","category":"Apple"}