{"title":"Follow-Up Period Affects the Association between Serum 25-Hydroxyvitamin D Concentration and Incidence of Dementia, Alzheimer&rsquo;s Disease, and Cognitive Impairment","link":"https://www.preprints.org/manuscript/202408.0993/v1","date":1723620924000,"content":"Background/Objectives: Vitamin D’s effect on risk health outcomes is often evaluated using prospective cohort studies. Risk ratios (RRs; e.g., hazard ratios or odds ratios) are determined for incidence for participants with baseline serum 25-hydroxyvitamin D [25(OH)D] concentrations below or above specified values. Serum 25(OH)D concentrations vary over time, thereby diluting the effect of 25(OH)D for long follow-up periods. Inverse relationships between RR and follow-up period have been reported for all-cause mortality rate and cancer incidence rates. Here I evaluate the effect for neurological outcomes. Methods: I analyzed how follow-up period affected results from 10 cohort studies of all-cause dementia, 6 studies of Alzheimer’s disease, and 9 for cognitive impairment with respect to vitamin D deficiency. Results: For all-cause dementia, Alzheimer’s disease, and cognitive impairment, respectively, the linear regression fits are RR = 2.9 – 0.14 × years, r = 0.73, p = 0.02; RR = 2.9 – 0.14 × years, r = 0.69, p = 0.13; and RR = 1.8 – 0.066 × years, r = 0.72, p = 0.03. The regression fit to RR for the shortest follow-up period for each outcome is considered the best estimate of vitamin D deficiency’s effect on risk. Those values are approximately twice that found by averaging all RRs without considering the effect of follow-up period. Conclusions: Vitamin D’s effect on risk of neurological conditions should be determined with relatively short follow-up periods after repeated 25(OH)D measurements as warranted during follow-up.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"99d6e1605f9594685e7c2c47c0cfe3ef90ae3f12ad96a606881b917d3d5913e6","category":"Interdisciplinary"}