{"title":"Cheat-maker brags of computer-vision auto-aim that works on “any game”","link":"https://arstechnica.com/?p=1779166","date":1625868031000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/cv7-980x481.png\" /></div>\n        <p>\n          A sample video shows how computer vision (running on an external computer) detects the enemy and calculates how far the mouse needs to move to target that enemy.                  </p>\n        </div>\n      </li>\n      </ul><p>When it comes to the cat-and-mouse game of stopping cheaters in online games, anti-cheat efforts often rely in part on technology that ensures the wider system running the game itself isn't compromised. On the PC, that can mean <a href=\"https://arstechnica.com/gaming/2020/04/ring-0-of-fire-does-riot-games-new-anti-cheat-measure-go-too-far/\">so-called \"kernel-level drivers\"</a> which monitor system memory for modifications that could affect the game's intended operation. On consoles, that can mean relying on system-level security that prevents unsigned code from being run at all (until and unless <a href=\"https://arstechnica.com/gaming/2020/05/nintendo-goes-to-court-to-stop-sale-of-new-switch-hacking-tech/\">the system is effectively hacked</a>, that is).</p>\n<p>But there's a growing category of cheating methods that can now effectively get around these forms of detection in many first-person shooters. By using external tools like capture cards and \"emulated input\" devices, along with machine learning-powered computer vision software running on a separate computer, these cheating engines totally circumvent the secure environments set up by PC and console game makers. This is forcing the developers behind these games to look to alternate methods to detect and stop these cheaters in their tracks.</p>\n<h2>How it works</h2>\n<p>The basic toolchain used for these external emulated-input cheating methods is relatively simple. The first step is using an external video capture card to record a game's live output and instantly send it to a separate computer. Those display frames are then run through a computer vision-based object detection algorithm like <a href=\"https://pjreddie.com/darknet/yolo/\">You Only Look Once (YOLO)</a> that has been trained to find human-shaped enemies in the image (or at least in a small central portion of the image near the targeting reticle).</p></div><p><a href=\"https://arstechnica.com/?p=1779166#p3\">Read 16 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1779166&amp;comments=1\">Comments</a></p>","author":"Kyle Orland","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"99e21622510759b174cf471b5d08a2bd869cb2f03b9526da6a02d8fc79a59764","category":"Tech"}