{"title":"The quantity and composition of household food waste: Implications for policy","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305087","date":1718200800000,"content":"<p>by Drajat Martianto, Rian Diana, Yayuk Farida Baliwati, Dadang Sukandar, Agung Hendriadi</p>\r\n\r\nStudies on food waste in Southeast Asia are currently limited, with a notable absence of comparative analyses investigating the volume and composition of food waste in urban and rural areas through direct measurement. This study aimed to analyze the differences in the quantity, composition, and drivers of household food waste between urban and rural areas. Household food waste was assessed through waste compositional analysis for food and diaries for beverages. This cross-sectional study included 215 households in Bogor Regency, Indonesia. Comparisons between the two areas were performed using an independent t-test. The average of household food waste in Bogor Regency was 77 kg/cap/year (edible 37.7%, inedible 62.3%). Household food waste was higher in urban areas (79.4 kg/cap/year) than in rural areas (45.8 kg/cap/year) (p&lt;0.001). Cereals, tubers and their derivatives (especially rice) and vegetables were the major contributors to edible food waste, whereas fruits were the main contributors to inedible food waste in both areas. Food waste drivers were spoilage/staleness/moldiness, changes in texture, short shelf life, cooking too much, and plate leftovers. Households in urban areas had a higher quantity of food waste and disposed of more edible food than those in rural areas. Meanwhile, the drivers of food waste generation were similar in both areas. Understanding the quantity, composition, and drivers of household food waste is pivotal for developing effective awareness campaigns and fostering behavioral changes to prevent household food waste.","author":"Drajat Martianto","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"99e965f5bdaa97fea9f1f134c2a7d4faf7c538293f58135f539b537e7cf4f364","category":"Interdisciplinary"}