{"title":"Study on vertical variation characteristics of soil phosphorus adsorption and desorption in black soil region of Northeast China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306145","date":1719237600000,"content":"<p>by Wenzhi Zhao, Xu Xie, Tian He, Jintao Zhang, Jiufen Liu</p>\r\n\r\nThe adsorption and desorption of phosphorus (P) in soil constitute a crucial internal cycle that is closely associated with soil fertility, exerting direct influence on the quantity, form, and availability of P within the soil. The vertical spatial variation characteristics of soil adsorption and desorption were investigated for the 0–100 cm soil layer in the northeast black soil region in this study. The maximum adsorption capacity (Q<sub>max</sub>) and maximum adsorption buffer capacity (MBC) of black soil in the study area ranged from 313.8 to 411.9 mg kg<sup>-1</sup> and from 3.1 to 28.8 L kg<sup>-1</sup>, respectively, within the soil layer of 0–100 cm depth, exhibiting an increasing trend with greater soil depth. The degree of P adsorption saturation (DPS) exhibited a contrasting trend with the variations in Q<sub>max</sub> and MBC, ranging from 3.8% to 21.6%. The maximum desorption capacity (D<sub>max</sub>) and desorption rate (D<sub>r</sub>) of soil P ranged from 112.8 to 215.7 mg kg<sup>-1</sup> and 32.1% to 52.5%, respectively, while the readily desorbable P (RDP) in soil was within the range of 1.02 to 3.35 mg kg<sup>-1</sup>. Both D<sub>max</sub>, D<sub>r</sub>, and RDP exhibited a decreasing trend with increasing soil depth before showing an upward trend. These research findings not only provide essential background data for the systematic investigation of soil P in the black soil region but also serve as a valuable reference for assessing soil quality in this area.","author":"Wenzhi Zhao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"99eba6a48eaa7940e01de984ee9c9450643ddbe94dcfccf7878858077453ea73","category":"Interdisciplinary"}