{"title":"Wahoo KICKR CORE Zwift One: In-Depth Review","link":"https://www.dcrainmaker.com/2024/02/wahoo-kickr-core-zwift-one-review-cog-click.html","date":1707322714000,"content":"<p><span>﻿</span></p>\n<p>I know, the name is confusing. Look, I didn’t choose it, I just review it. A more explainable name would be the Wahoo KICKR CORE Cog, which is what this is: The Wahoo KICKR CORE, with the Zwift Cog attached instead of a regular cassette. It’s really as simple as that.</p>\n<p>For those not familiar with the Zwift Cog, it eliminates the need for your physical bike shifters, and instead you shift with a little remote button (included). Zwift introduced it a mere four months ago on the Zwift Hub One, a product that as of today, is now officially discontinued.</p>\n<p>However, with the Zwift &amp; Wahoo partnership inching ever close, Wahoo has essentially taken on the hardware aspects of Zwift’s branded hardware efforts. Zwift still has a team internally doing some things, but big heavy hardware bits is now on Wahoo’s plate.</p>\n<p>And while this might seem like just installing the Zwift Cog on the Wahoo KICKR CORE, there’s concurrently new zero-calibration software/firmware on the CORE, thus, I’m just gonna review it as a single new package. Hopefully this review will have a longer shelf-life than the 4-months that the <a href=\"https://www.dcrainmaker.com/2023/10/zwift-hub-one-zwift-cog-clicks-review.html\">Zwift Hub One</a> did.</p>\n<p>Finally, note that this unit is a media loaner, and once this review is complete, will go back to Zwift/Wahoo. As always, I don’t accept advertising from any company I review – so, if you found this review useful, consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a>, which gets you an ad-free site, plus the behind-the-scenes video series between both myself (and my wife) on everything that happens in the DCR Sports Tech Cave/universe.</p>\n<h3><span><strong>The Main Specs:</strong></span></h3>\n<p><img title=\"DSC_0963.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0963.jpg\" width=\"720\" height=\"480\" /></p>\n<p>First, just a quick run through the top-line specs, which are identical to the KICKR CORE because it’s the same trainer. Nonetheless, here’s the current KICKR CORE Zwift One specs:</p>\n<p><strong>– Direct drive trainer:</strong> This means you remove your rear wheel<br />\n<strong>– Flywheel:</strong> It has a flywheel weight of 5.4kg<br />\n<strong>– Cassette:</strong> Zwift Cog virtual cassette, compatible with 8-12 speed bikes, though practically compatible with any bike/chain that you can physically mount on the trainer (axle-wise).<br />\n<strong>– Sound:</strong> Essentially silent. Only the sound of your drivetrain is heard<br />\n<strong>– Handle:</strong> This unit lacks a handle, which continues to make it slightly awkward to move around<br />\n<strong>– Protocol Compatibility:</strong> ANT+ FE-C, ANT+ Power, Bluetooth Smart Trainer Control, Bluetooth Smart Power (everything you need). However, note that while fully compatible with other apps, you can *ONLY SHIFT* with Zwift. So, this will work perfectly fine in ERG mode on TrainerRoad, but you’ll be going nowhere fast on Rouvy or IndieVelo without shifting. More on that later.<br />\n<strong>– Unique Party Trick: </strong>Compatible with the KICKR CLIMB gradient simulator accessory (previous Zwift Hub wasn’t compatible<br />\n<strong>– App Compatibility:</strong> From a protocol standpoint, anything, but from a practical standpoint, just Zwift for simulation mode due to the aforementioned shifting limitation.<br />\n<strong>– Skewer Compatibility:</strong> All the skewers and adapters you could ask for: Road 130mm, 135mm, 142x12mm, 148x12mm<br />\n<strong>– Max Incline:</strong> 16% simulated grade<br />\n<strong>– Max Wattage:</strong> 1,800 watts resistance<br />\n<strong>– Stated Accuracy:</strong> &lt; +/-2.0%<br />\n<strong>– Power Cable Required:</strong> Yes, power block compatible with 100-240v<br />\n<strong>– Pricing and Availability:</strong> $599USD, €599, and £549 – Including 1-year of Zwift subscription</p>\n<p>Additionally, Zwift/Wahoo will be selling it in Canada and Australia from late March, via WahooFitness.com. Otherwise the trainers available from both Wahoo and Zwift’s sites only.</p>\n<p>With all the geeky specs covered, let’s dive straight into getting it unboxed.</p>\n<h3><span><strong>In the Box:</strong></span></h3>\n<p><img title=\"DSC_0794.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0794.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Both Zwift &amp; Wahoo see this unboxing experience as temporary, rather than the desired end state. That’s because by later this year, this Zwift-forward variant of the Wahoo KICKR CORE will be in a brown box, akin to previous Zwift Hub hardware. It’ll also have better in-box instructions (like the Zwift Hub hardware had), and generally be Zwift-branded rather than Wahoo-branded.</p>\n<p>But that state is not today. Today is simply a Wahoo KICKR CORE Box:</p>\n<p><img title=\"DSC_0933.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0933.jpg\" width=\"720\" height=\"480\" /></p>\n<p>In fact, if you look at the side, you’ll see non-Zwift apps list. Some of those apps don’t exist, and the rest don’t really work well with the new KICKR CORE Cog (which, I’ve decided is what I’m calling it for the rest of this review, to make things clear). More on why, later.</p>\n<p>In any case, you’ll dump out the KICKR CORE COG, and find you’ve got two legs to install, and a power cord to attach. It’s pretty straight forward:</p>\n<p><img title=\"DSC_0797.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0797.jpg\" width=\"720\" height=\"480\" /></p>\n<p>It includes a quick release skewer, as well as thru-axle adapters, so it’s pretty compatible in terms of most bikes you’d stick on it.</p>\n<p><img title=\"DSC_0798.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0798.jpg\" width=\"355\" height=\"237\" /><img title=\"DSC_0799.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0799.jpg\" width=\"355\" height=\"237\" /></p>\n<p>Assembling the legs is easy enough, albeit not as clear/clean as the color-coded system of the Zwift Hub (which makes it virtually impossible to accidentally put the legs on the wrong way). In this case, you can start putting on a leg the wrong way, before realizing the screw holes don’t perfectly line up. I mean…that’s what my friend says anyway.</p>\n<p><img title=\"DSC_0812.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0812.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The whole process takes 3-4 minutes, it’s quick and easy:</p>\n<p><img title=\"DSC_0901.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0901.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The Zwift Cog is already pre-installed, as you can see. More on that down below.</p>\n<p>Here’s the power block, in the event you lose it some day and are trying to figure out which one it is:</p>\n<p><img title=\"DSC_0817.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0817.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The leg partially folds under, but not super well (just like it wasn’t super well on the CORE before). It’s a half-hearted fold.</p>\n<p>With that, we’re ready to get rolling with it.</p>\n<h3><span><strong>Basic Usage:</strong></span></h3>\n<p><img title=\"DSC_0952.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0952.jpg\" width=\"720\" height=\"480\" /></p>\n<p>To get started with the KICKR Cog, you’ll need to remove your rear wheel from the bike. This is because the trainer is a so-called direct drive trainer, and thus your chain connects directly to the Cog on the back of the trainer. This effectively eliminates slippage issues seen with wheel-on trainers, and significantly increases accuracy compared to wheel-on trainers.</p>\n<p>To make your life easier, try and put your bike in a middle-gear in the back (cassette). That way it’ll roughly align with the Zwift Cog. This cog replaces your entire cassette, and is as the name implies – a single cog. You can see what this looks like off the bike (I’ll cover retrofitting existing KICKR units later on):</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/DSC_8817_thumb.jpg\" alt=\"DSC_8817\" /></p>\n<p>Now, with things placed on the trainer, you’ll see the status light on the back once plugged in. This status shows both Bluetooth Status and ANT+ status. Essentially, it’s showing connectivity and control status, as to which protocol is controlling it. Practically speaking, you won’t bother look at it for anything other than whether or not the trainer is plugged in and powered.</p>\n<p><img title=\"DSC_0958.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0958.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Speaking of that power cable, it’s got a nifty little quick-release mechanism, for when you trip over it, it doesn’t physically tear, but just pulls apart. Because yes, eventually you’ll trip over it.</p>\n<p>Next, now’s a good time to crack open the Wahoo app (not the Zwift one), and ensure the firmware on your KICKR CORE is fully up to date. This takes just a second to add the unit, and then get the firmware updated:</p>\n<p><img title=\"IMG_3460.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_3460.png\" width=\"235\" height=\"509\" /><img title=\"IMG_3462.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_3462-1.png\" width=\"235\" height=\"509\" /></p>\n<p>One downside to the KICKR CORE compared to the Zwift Hub though, is that it lacks the heart rate monitor briding/pairing seeing on the Zwift Hub series. This was useful primarily for Apple TV users, as that has a two concurrent Bluetooth device limit (plus the remote). Thus, if you had a heart rate strap, you’d be over that (HR + trainer + Zwift Play or Click). You can still use Apple TV just fine here though, you’ll just need to use the Zwift Companion app on your phone for that connectivity.</p>\n<p>Next, you’ll want to mount up the Zwift Click button. That little button lets you control your shifting (easier or harder). It becomes your new shifters. You can mount it in a few different places, such as on the outside of the handlebars, or on the inside, or even on top of the handlebars. Wherever you want. Keep in mind though that if you want to sprint, you’ll want them accessible from the drops (lower portion of handlebars):</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/DSC_8588_thumb.jpg\" alt=\"DSC_8588\" /> <img src=\"https://media.dcrainmaker.com/images/2023/10/InsideHandlebars_thumb.png\" alt=\"InsideHandlebars\" /></p>\n<p>I’ve played with a few different spots for the buttons. While I find it most comfortable to use on the inside of the handlebars with my thumb, that spot doesn’t work for shifting while sprinting, so I’ve kinda landed on the outside of the handlebars.</p>\n<p>Just as with the Wahoo KICKR CORE firmware update, you’ll also want to update the firmware on the Zwift Click to. But you’ll need the Zwift Companion app for that (yes, we’re up to three apps now, including Zwift’s main game app too). The update process is quick here:</p>\n<p><img title=\"IMG_3468.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_3468.png\" width=\"235\" height=\"509\" /><img title=\"IMG_3469.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_3469-1.png\" width=\"235\" height=\"509\" /></p>\n<p>Now, with everything updated, we’ll crack open the Zwift game app (on whichever platform you choose), and get things paired. You may need to wake-up your Zwift Click buttons, else they won’t appear:</p>\n<p><img title=\"IMG_0347.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_0347-1.png\" width=\"640\" height=\"480\" /></p>\n<p>That option to pair the Zwift Click is super important, because without that, you won’t get any shifting. Like, at all. Instead, Zwift will simply assume you’re on a regular trainer and that you can shift using cassette/shifters (which, you can’t here).</p>\n<p><img title=\"IMG_0348.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_0348.png\" width=\"640\" height=\"480\" /></p>\n<p>You’ll also want to ensure virtual shifting is enabled in the settings:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/clip_image00119_thumb.jpg\" alt=\"clip_image001[19]\" /></p>\n<p>With all that set, you’re ready to start Zwifting. Note that by default Zwift will be set for 50% trainer difficulty level. This changes how the game simulates gradient. To understand what this means, assume you’re coming up on a 10% gradient climb, it’ll actually only feel like a 5% climb (if set for 50% trainer difficulty). This won’t impact your in-game speed (since that’s based on wattage), but does impact how the climb feels to your legs, and which specific gearing you’ll use.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/clip_image0015_thumb.jpg\" alt=\"clip_image001[5]\" /></p>\n<p>With the KICKR CORE being a smart trainer (as opposed to a dumb trainer), it’ll change resistance automatically in a few different ways, primarily driven by different applications/methods. But most of this all boils down to two core methods:</p>\n<blockquote><p><span><strong>ERG Mode:</strong> </span>Setting a specific power level – e.g., 220w. In this mode, no matter what gearing you use, the trainer will simply stay at 220w (or whatever you set it to).</p>\n<p><span><strong>Simulation (SIM) Mode:</strong></span> Simulating a specific outdoor grade – i.e., 8% incline. In this mode, it’s just like outdoors in that you can change your gearing to make it easier or harder. Wattage is not hard-set, only incline levels.</p></blockquote>\n<p>In the case of simulation (aka slope) mode, the KICKR CORE can simulate from 0% to 16% incline – the same as the previous Zwift Hub series. While other trainers can simulate above 20% these days, I continue to question how many people actually want to ride such a gradient. When I’m outside doing any road rides with more than about 12% gradient, it just sucks – let alone 14%, 16%, and more. A 24% incline? There’s just no reason I want to relive that scenario voluntarily indoors.</p>\n<p><img title=\"vlcsnap-2024-02-07-16h58m41s271.png\" src=\"https://media.dcrainmaker.com/images/2024/02/vlcsnap-2024-02-07-16h58m41s271.png\" width=\"719\" height=\"467\" /></p>\n<p>Of course at this point you’re probably wondering how you shift as you suffer up that climb. For that, we’ve got the Zwift Click. As I mentioned, you’ll probably play around with the exact spot you want these.</p>\n<p>Zwift has a ‘virtual cassette’ or ‘virtual drivetrain’ that consists of 24 non-configurable gears. Meaning, there is no concept of big ring/small ring like on most normal bikes. Instead, it’s just one linear shift drivetrain. That’s not terribly unlike Shimano or SRAM shifting options that automatically shift up/down the cassette and chainring based on the next hardest/easiest gear.</p>\n<p>You’ll see your current gear located in the upper left corner of Zwift – shown here in “Gear 17”:</p>\n<p><img title=\"vlcsnap-2024-02-07-16h56m04s579.png\" src=\"https://media.dcrainmaker.com/images/2024/02/vlcsnap-2024-02-07-16h56m04s579.png\" width=\"640\" height=\"480\" /></p>\n<p>To shift these gears, you’ll press the “+” button to make things harder, or the “-“ button to go into an easier gear. Responsiveness is instant in my testing. Note that from a technical standpoint the Zwift Click (buttons) aren’t talking directly to the trainer. Instead, they’re talking to the Zwift app running on your tablet/phone/TV, and then in turn that tells the trainer how to simulate that particular gearing combination. I’ll dive into this more in the ‘Compatibility’ section, on why that matters for 3rd parties.</p>\n<p><img title=\"IMG_4497.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4497.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>Just as with the Zwift Hub, for riding on the flats I found I tended to stay around Gear 16 or 17, but that depended on whether or not I was in the big chainring or the small chainring. In the case the Zwift Hub, I usually stayed in the big ring, but with the Wahoo KICKR CORE, Zwift recommends staying in the small ring for all but the most massive sprints. I found that worked perfectly fine (whereas with the Zwift Hub I’d run out of power in the small ring).</p>\n<p>Now that said, you’ll undoubtedly accidentally shift your rear derailleur at some point (your real physical shifters). I find this usually happens if I’ve been riding on the flats a long time, and then go into the hills or into a big sprint out of nowhere, especially if this is the first trainer ride back after a few days outside. When you do so, you’ll immediately hear that you’ve effed up. On both the bikes I tried, the first shift notably increased noise/smoothness, but didn’t make a racket. Whereas that second shift made an immediate racket – because at that point your rear derailleur is trying to put the chain up on the Ikea plastic bowls, which won’t end in success.</p>\n<p><img title=\"DSC_0965.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0965.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Like I showed in the Zwift Hub One review, this is literally basically two Ikea bowls and a single cog in between:</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/clip_image0019_thumb.jpg\" alt=\"clip_image001[9]\" /></p>\n<p>The good news though is that nothing ‘bad’ happens. It’ll just make a bunch of noise but won’t get caught up anywhere. It’s noisy, but totally harmless.</p>\n<p>Now, the second mode the trainer has is ERG mode. In that case, Wahoo claims up to 1,800w of resistance. Although, realistically, you don’t care about that. I can only barely (maybe) break 1,000w for a second or two, and even most front of the non-pro pack cyclists aren’t going to top 1,800w. The pros would only be just a bit beyond that. Said differently: Peak numbers in this competition don’t matter. Instead, what matters is actually a harder metric to make clear – which is the ability to simulate high grades and lower speeds (especially if you’re a heavier cyclist).</p>\n<p>Now, normally in ERG mode on any trainer, you aren’t shifting (you shouldn’t shift in ERG mode, as it’s pointless because resistance is controlled inside the trainer). With the KICKR CORE Cog, the buttons instead simply control ERG mode intensity (bias). Thus allowing you to tap to quickly change intensity from 100% of prescribed interval to 99% or 101%, etc…</p>\n<p><img title=\"vlcsnap-2024-02-07-16h55m47s960.png\" src=\"https://media.dcrainmaker.com/images/2024/02/vlcsnap-2024-02-07-16h55m47s960.png\" width=\"640\" height=\"480\" /></p>\n<p>One little thing to note is that if you were to stop pedaling, ERG mode will de-activate automatically. The idea here being that if the FedEx person arrives at the door and you need to receive your new super accurate Shimano power meter package, when you return to the bike, it won’t be impossible to start pedaling again (which otherwise, it’s very difficult mid-interval). However, one catch with the current implementation is that you’ll need to use the Zwift Click shifters to change gearing to get enough power on the trainer to re-activate ERG mode.</p>\n<p>Said differently, when you get back from FedEx person, you’ll likely find the trainer only putting out about 120w, and if your current interval is at 150-250w, it WILL NOT reactivate ERG mode until you get your power that high. You can do this by shifting, and then it’ll automatically re-activate ERG mode and you’ll be back in the workout. You can see this at the top, showing that it’s reactivating.</p>\n<p>Now, Zwift aside, ERG mode is actually the singular mode on the KICKR CORE that works with other trainer apps. I’ll get into this more in the next section, but I did test this with TrainerRoad here, on my 30×30 tests:</p>\n<p><img title=\"vlcsnap-2024-02-07-17h00m39s219.png\" src=\"https://media.dcrainmaker.com/images/2024/02/vlcsnap-2024-02-07-17h00m39s219.png\" width=\"720\" height=\"540\" /></p>\n<p>Next, normally I’d note how the smart trainer has the ability to calibrate it, but like many other newer smart trainers, the KICKR CORE Cog largely does away with that, and instead has a new automatic calibration routine which automatically corrects for temperature shifts. However, Wahoo has left in the ability to manually calibrate it – and in fact, recommends you do so after about 20-30 minutes on your first ride with the unit after unboxing.</p>\n<p>I’d agree with that recommendation, as I saw some quirks in this on two new factory units. Which reminds me, neither unit sent over for review was perfect. The first unit made a bunch of noise within the flywheel, which Zwift/Wahoo ultimately decided was causing severe inaccuracy issues I was seeing (about 25-30w high). The second unit also made some clicking noises, though those disappeared after about an hour. Those noises haven’t returned since. Either way, if your trainer is making weird noises – contact Wahoo support.</p>\n<p><img title=\"DSC_0952.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0952-1.jpg\" width=\"720\" height=\"480\" /></p>\n<p>So what about normal noise and road feel?</p>\n<p>Like I always say – for me personally, it’s hard to separate the fact that I’m riding indoors from outdoors. It’s still a trainer, and I’m still looking at a wall in front of me. My brain can only turn off so much of that. Still, much of the road-like feel is driven by the flywheel, and be it physical or virtual, flywheel sizes tend to be measured in weight. This impacts inertia and how it feels – primarily when you accelerate or otherwise change acceleration (such as briefly coasting).</p>\n<p>Starting with road feel, the KICKR CORE has a flywheel weight of 5.4kg, larger than the 4.7kg of the Zwift Hub series. However, unlike some endeavors, size isn’t everything – because flywheel weight is merely one factor – especially because it can be multiplied depending on the exact gearing internally. Nonetheless, this feels essentially the same to me as the Zwift Hub did, in terms of road feel. Accelerations are good, decelerations are good, and I’m totally happy with riding it. I’d be totally happy if this was the only trainer I had, in terms of road feel.</p>\n<p>Now, one thing the KICKR CORE has that the Zwift Hub doesn’t, is compatibility with the <a href=\"https://www.dcrainmaker.com/2018/08/wahoo-kickr-climb-in-depth-review.html\">Wahoo KICKR CLIMB accessory</a>. It’s fully compatible there, in the event you want to simulate gradient with the front of you bike going up/down to match the terrain in Zwift:</p>\n<p><img title=\"IMG_4496.jpeg\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_4496.jpeg\" width=\"720\" height=\"480\" /></p>\n<p>Finally, what about noise. Well – I’ve included that in my video review up above, but it’s essentially in the same ballpark as the KICKR CORE cassette would have. However, there’s some slight differences there. Notably, it’s quieter in cases where you would have been either cross-chained or otherwise at the upper/lower limits of the cassette. However, if you’ve got a very straight chainline (like in ERG mode), I found it a bit louder than a normal cassette. This is likely because I’m running a 12-speed bike on a cog (Zwift Cog) that isn’t exactly designed for 12-speed chain sizes, and thus makes a tiny bit more noise there than a perfect manufacturer chain. Overall though, it’s a wash.</p>\n<h3><span><strong>App/Connectivity Compatibility:</strong></span></h3>\n<p><img title=\"vlcsnap-2024-02-07-17h01m35s449.png\" src=\"https://media.dcrainmaker.com/images/2024/02/vlcsnap-2024-02-07-17h01m35s449.png\" width=\"720\" height=\"540\" /></p>\n<p>When I first started writing this section on trainers more than a decade ago, the landscape was a mine-field of compatibility hell – both on the app and protocols standpoint. However, over the past decade, things have entirely standardized, and I can usually copy/paste most of the specs in this section and tweak slightly as appropriate to the nuances of each unit. At the end of the day, minor capability differences aside, everything worked with everything…until the Zwift Hub One.</p>\n<p>With the Zwift Hub One (with Cog) and now the KICKR CORE Cog, we’re starting to turn back that clock a bit.</p>\n<p>That’s because while these two trainers are fully compatible from a protocol standpoint with all the ANT+ &amp; Bluetooth Smart standards, the ability for you to shift is very much not. You see, the KICKR CORE Cog will happily broadcast your power/cadence/etc to any app on the planet. And likewise, any app on the planet can also control the KICKR CORE Cog, just like you could do with the previous KICKR Core cassette. That’s because they properly adhered to all the trainer industry standards. And technically, that’s still true now.</p>\n<p>Except, with the Zwift Click (or Zwift Play) sending their data *ONLY* to the Zwift app, you can’t shift without Zwift involved. And thus, for any indoor trainer app where you want to shift (simulation mode), you’re out of luck with the KICKR CORE Cog. Whereas, for any indoor trainer app in ERG mode (structured workout mode), you’re perfectly fine because you don’t need to shift. Those apps will control the KICKR CORE Cog, just as they always did.</p>\n<p><img title=\"IMG_0347.PNG\" src=\"https://media.dcrainmaker.com/images/2024/02/IMG_0347.png\" width=\"640\" height=\"480\" /></p>\n<p>In an ideal world, the Zwift Click would actually talk directly to the trainer instead. In fact, that’s why we saw Wahoo years ago have the KICKR CLIMB talk instead to the trainer, rather than apps. It ensures compatibility no matter the app.</p>\n<p>When asked about this, Zwift and Wahoo said they’re working to release API documentation that lets 3rd party apps add support for Zwift Play/Click into their apps. This means that apps like Rouvy or FulGaz or MyWhoosh could make their apps compatible with the KICKR CORE Cog. However, when pressed for a date for when that documentation/kit would be released, Zwift/Wahoo said “later this year”, which frankly, seems like unacceptably long time to release something that Zwift has said last year they were already working on. It’s just not that difficult.</p>\n<p>Of course, you could always swap out the Zwift Cog for a regular cassette, and then the KICKR CORE will work exactly like any previous KICKR CORE (fully compatible).</p>\n<p>With all that said, here’s the complete list of protocol transmission standards/types the KICKR CORE Cog Supports:</p>\n<blockquote><p><strong>ANT+ FE-C Control:</strong> This is for controlling the trainer via ANT+ from apps and head units, and includes power &amp; cadence data. Read tons <a href=\"https://www.dcrainmaker.com/2016/07/everything-you-ever-wanted-to-know-about-ant-fe-c-and-bike-trainers.html\">about it here</a>.</p>\n<p><strong>ANT+ Power Meter Profile:</strong> This broadcasts as a standard ANT+ power meter, with cadence and speed data baked in.</p>\n<p><strong>Bluetooth Smart FTMS:</strong> This is the industry standard for apps controlling the trainer via Bluetooth Smart, and includes ANT+ power and cadence baked in.</p>\n<p><strong>Bluetooth Smart Power Meter Profile:</strong> This broadcasts as a standard BLE power meter with cadence and speed data.</p></blockquote>\n<p>It DOES NOT, however, support these protocols/transmissions (which trainers from Tacx and Elite do support):</p>\n<blockquote><p><strong>ANT+ Speed/Cadence Profile:</strong> This broadcasts just your speed and cadence as a standard ANT+ Speed/Cadence combo sensor.</p>\n<p><strong>Bluetooth Smart Speed/Cadence Profile:</strong> This broadcasts just your speed and cadence as a standard BLE combo Speed/Cadence sensor.</p></blockquote>\n<p>The above two are mostly just useful when pairing to more basic smartwatches that might not support power meters/cadence, but I don’t expect it matters to too many people.</p>\n<p>Note that for my testing, I tested within Zwift itself of course, but also did test connectivity to TrainerRoad with an ERG workout (in the accuracy section below), as well as broadcasting to multiple Garmin watches, an Apple Watch, and Garmin bike computer. All recorded the data without issue.</p>\n<p>So, then the question became, is the KICKR CORE Cog worth the tradeoffs over KICKR CORE cassette/mechanical/</p>\n<h3><span><strong>Zwift Cog vs Mechanical Cassette:</strong></span></h3>\n<p><img title=\"DSC_0963.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0963-1.jpg\" width=\"720\" height=\"480\" /></p>\n<p><em>[This section is virtually identical to the one I wrote for the Zwift Hub One review, because…well…it’s identical to how things work there.]</em></p>\n<p>There are many times in technology where a proposed technology solution is in search of a non-existent problem. I actually don’t think the Zwift Cog is one of those cases, but concurrently, it’s also not solving a problem everyone actually has. Instead, you need to look at it through the lenses of which problems it solves, and for which groups.</p>\n<p>To be clear – by far the biggest winner for Zwift Cog is actually Zwift and somewhat Wahoo themselves. It ‘solves’ a bunch of distribution/compatibility/stocking/etc issues for the company when they had multiple cassette versions of the Zwift Hub. It’s also undoubtedly cheaper than Zwift/Wahoo buying cassettes to put on trainers. After all, the Zwift Cog is basically two plastic pieces with a single cassette cog in the middle. It’s far cheaper to produce than buying full 9/10/11/12 speed cassettes. And again, it reduces the amount of pre-installed cassette inventory they have to have on hand for each cassette type. There’s virtually no downside here for Zwift/Wahoo.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/DSC_8818_thumb.jpg\" alt=\"DSC_8818\" /></p>\n<p>For consumers, the wins are a bit fuzzier and less obvious. For example, if you have multiple bikes of different cassette types (e.g., an 11-speed cassette and a 12-speed cassette bike) – the Zwift Cog is a clear winner for you. You can seamlessly use both bikes on the same trainer. Same goes if you share a trainer with multiple people of varying cassette types. And it even gives you more power/range if the gearing on your bike is suboptimal for the flats (e.g., many mountain bikes). It’s also quieter too, in most cases, due to lack of shift noise (depending on your bike).</p>\n<p>But there are downsides. First and foremost is that if you use the KICKR CORE Cog (with Zwift Cog) with another training platform (e.g., Rouvy, Kinomap, or IndieVelo), you can’t shift anymore. The Zwift Click shifters only work with Zwift, not 3rd party platforms – because they only pair with the Zwift app. Thus if you leave the Zwift ecosystem (even just for a single ride), you’ve gotta swap back to a regular cassette (including buying said cassette). Secondly, is that while the Zwift Click buttons are good, they aren’t amazing. It’s functional, in the same way generic smart bike shifting from 3-5 years ago was functional. But it’s not how we’ve shifted bikes for decades, and for good reason: It’s not super efficient for the rider in multiple positions the way normal shifters are.</p>\n<p><img src=\"https://media.dcrainmaker.com/images/2023/10/DSC_8549_thumb.jpg\" alt=\"DSC_8549\" /></p>\n<p>Smart bikes from Wahoo, Stages, Tacx, and others have all adopted standard-style bike shift levers for shifting that virtual drivetrain, not because they want to expend extra money, but because they’re going for the realism that’s just like riding a bike outdoors. While the Zwift Cog is a step forward in terms of compatibility, it’s a step backwards in terms of realism and ride feel.</p>\n<p>Thus, here’s a quick recap of the pros/cons of Zwift Cog:</p>\n<p><span><strong>Pros for Consumer:</strong></span></p>\n<p>– Ideal if you have multiple bikes with different cassette types<br />\n– Ideal if you share the trainer with multiple riders with different cassette-equipped bikes<br />\n– Ideal if your bike drivetrain is noisy AF, as it’s quieter, especially at the upper/lower ranges of the cassette where you might be cross-chaining<br />\n– Ideal for riding some MTB on flatter Zwift courses (or really any bike with limited cassette range, gives you more range)<br />\n– Can also shift under virtually any load, since there’s no movement of the chain to be aware of<br />\n– I suppose it reduces battery charging/wear on Di2/AXS/eTAP/etc systems, but practically speaking that’s pretty minimal</p>\n<p><span><strong>Cons for Consumer:</strong></span></p>\n<p>– Doesn’t work with apps other than Zwift<br />\n– Simply doesn’t feel as good as regular shifting (shifter feel)<br />\n– Button placement isn’t really as ideal (especially if trying to use it from both drops and hoods)<br />\n– Isn’t as fast as regular shifting for big jumps (shifter responsiveness)</p>\n<p>And then there’s the Zwift side of the equation. This isn’t to slight Zwift, but simply to point out, that like any company – Zwift is trying to optimize their own business components here. And while this has both pros and cons for different consumers, it’s heavily slanted towards pros for Zwift and a lesser extent Wahoo.</p>\n<p><span><strong>Pros for Zwift/Wahoo:</strong></span></p>\n<p>– Reduces cost for KICKR CORE components (cassettes are more expensive)<br />\n– Reduces on-hand inventory needed for KICKR CORE cassette combinations<br />\n– Increases bike compatibility beyond 8/9/10/11/12 cassette speed bikes (e.g., some 7 speed cassettes)<br />\n– Makes KICKR CORE vastly more appealing for multi-bike/multi-person scenarios</p>\n<p><span><strong>Cons for Zwift:</strong></span></p>\n<p>– I can’t think of any</p>\n<p>So, the TLDR of this section is that if you’re a solo rider/bike scenario on a singular 10/11/12-speed bike, I’d personally choose a mechanical cassette every time over the Zwift Cog. Same goes if you plan to use other training app platforms. Whereas if you’re sharing a KICKR CORE Cog with other riders on different bikes with varying cassettes, then I’d probably go KICKR CORE Cog over mechanical cassette – as it makes that scenario really darn easy.</p>\n<h3><span><strong>Power Accuracy:</strong></span></h3>\n<p>While the KICKR CORE power accuracy is well established over many years, this new KICKR CORE Cog introduces automatic power calibration, akin to what we’ve seen on the higher-end KICKR series for the past few years. Except, this is different hardware, and as such, behaves different.</p>\n<p>Thus, I wanted to re-test it, and see if it’s as accurate as Wahoo and Zwift claim.</p>\n<p>The goal here being that I’m comparing the KICKR CORE Cog to a variety of known-good power meters, and testing everything from resistance control accuracy, to speed of change, to any other weird quirks along the way. The following configurations were used in testing:</p>\n<p><strong>Bike Config 1:</strong> Stages LR (dual-sided power), Favero dual-sided pedals, (+KICKR CORE COG)</p>\n<p><strong>Bike Config 2:</strong> 4iiii Precision (dual-sided power), Favero dual-sided pedals, (+KICKR CORE COG)</p>\n<p>There’s been some other configs as well, but we’ll just stick to the data from those two, and primarily from the second bike above, since that’s the second KICKR CORE Cog I tested with (the first unit had accuracy issues as noted above).</p>\n<p>First up, let’s up, let’s start off with some fun 30×30 intervals. This was actually in TrainerRoad, and is a great test of how quickly the trainer can respond. Thus, first let’s look at the latency involved going from ~150w to ~450w. Ideally we’d see the trainer accomplish this in 2-4 seconds, without any major overages:</p>\n<p><img title=\"KICKRCORECog-Accuracy-30x30TrainerRoad.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-30x30TrainerRoad.png\" width=\"720\" height=\"198\" /></p>\n<p>I selected one of the middle intervals, since some of the responsiveness is related to me, not just the trainer. The first interval came at me like a freight train, but by the 2nd and 3rd I’d gotten used to it. In any case, you can see it took about 3 seconds to reach the correct level, and then it wobbled a little bit, but was fine. It’s not quite as good as some higher trainers, but perfectly fine. Note that ERG Mode Smoothing is *DISABLED* here (via the Wahoo app), because otherwise that just overly smooths (basically fakes) the data to always look perfect.</p>\n<p>In any event, below is the accuracy when compared to the Favero &amp; 4iiii power meters. <a href=\"https://analyze.dcrainmaker.com/#/public/bf6f0c92-e603-4356-7cda-711fc6afe5e3\">As you can see in the data</a>, outside of the first interval (when I got slammed), everyone basically agrees quite happily.</p>\n<p><img title=\"KICKRCORECog-Accuracy-30x30Wide.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-30x30Wide.png\" width=\"719\" height=\"263\" /></p>\n<p>Zooming in, you can see things are pretty good across the intervals as well:</p>\n<p><img title=\"KICKRCORECog-Accuracy-30x30CloseUp.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-30x30CloseUp.png\" width=\"720\" height=\"266\" /></p>\n<p>About the only place you notice some discrepancies is in the cadence chart. Notice the blue line of the KICKR CORE, how it detaches from the real cadence each time my cadence reduces? That’s actually tied to me coming down from each interval, and it freewheeling a bit. Most trainers struggled there, and the KICKR CORE is no exception.</p>\n<p><img title=\"KICKRCORECog-Accuracy-30x30Cadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-30x30Cadence.png\" width=\"718\" height=\"261\" /></p>\n<p>Next, let’s look at another ERG workout, this one in Zwift. This one is interesting, as you can see the automatic calibration kicking in, after I coasted about 15 minutes into it (the KICKR CORE Cog will do automatic calibration anytime you coast for more than 5 seconds). Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/757f6aa3-7608-4bbe-6c41-d6574db5b523\">the data</a>:</p>\n<p><img title=\"KICKRCORECog-Accuracy-ERGIntervals-Wide.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-ERGIntervals-Wide.png\" width=\"719\" height=\"264\" /></p>\n<p>Notice how at the beginning for the first 15 minutes, the KICKR CORE Cog is reading high, about 10w or so in most places (when in reality, it should be reading slightly low if anything, due to drivetrain loses). However around the 15 minute marker I stopped pedaling and let it coast down (I did not do a manual calibration here). You can see that once I resumed, it was nicely within spec:</p>\n<p><img title=\"KICKRCORECog-Accuracy-ERGIntervals-CloseUp.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-ERGIntervals-CloseUp.png\" width=\"719\" height=\"264\" /></p>\n<p>Meanwhile, on the cadence side, you can see it’s similar to above, slightly inaccurate in some cases where I’ve released power, but probably fine for most situations.</p>\n<p><img title=\"KICKRCORECog-Accuracy-ERGIntervals-Cadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-ERGIntervals-Cadence.png\" width=\"719\" height=\"264\" /></p>\n<p>Next, let’s look at SIM mode, which is when you’ve got to shift, and thus have far more variability in your power. Additionally, the trainer is no longer controlling the power values, you are. Here’s <a href=\"https://analyze.dcrainmaker.com/#/public/2a3c0a98-450b-4644-687e-9e3c8d3d130c\">that data set</a>:</p>\n<p><img title=\"KICKRCORECog-Accuracy-SIM-Wide.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-SIM-Wide.png\" width=\"720\" height=\"280\" /></p>\n<p>As you can see, at a high level those lines are all very close together. Let’s look a bit closer though, starting with some sorta steady-state stuff riding in a group:</p>\n<p><img title=\"KICKRCORECog-Accuracy-SIM-CloseUp.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-SIM-CloseUp.png\" width=\"718\" height=\"289\" /></p>\n<p>You can see all of the power meters ebb and flow together, albeit with tiny differences. Nothing that vastly sticks out though.</p>\n<p>If we look at a half-hearted 800w sprint, you can see all the units accelerate well together, but we do see the KICKR CORE overshoot a tiny bit as I come down from that. This is somewhat normal for trainers, but just something to be aware of.</p>\n<p><img title=\"KICKRCORECog-Accuracy-SIM-Sprint.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-SIM-Sprint.png\" width=\"718\" height=\"289\" /></p>\n<p>Meanwhile, looking at the cadence side of things, they look reasonably good here. No major gaps or such, which is good to see:</p>\n<p><img title=\"KICKRCORECog-Accuracy-SIM-Cadence.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-SIM-Cadence.png\" width=\"718\" height=\"225\" /></p>\n<p>And then finally, the Mean-Max chart, which compares the peak power values for all units across different timeframes. This too looks pretty darn good, with only slight variations at the very top. That’s usually somewhat normal, given the nuances of recording/transmission rates, and peak power calculations of different devices. I don’t tend to worry about that too much.</p>\n<p><img title=\"KICKRCORECog-Accuracy-SIM-MeanMax.png\" src=\"https://media.dcrainmaker.com/images/2024/02/KICKRCORECog-Accuracy-SIM-MeanMax.png\" width=\"719\" height=\"212\" /></p>\n<p>Overall, the accuracy of the KICKR CORE Cog looks pretty darn good, and inline with past Wahoo KICKR CORE trainer accuracy aspects. This is true for both the power as well as cadence values, across both SIM mode and ERG mode.</p>\n<p>About the only area of complaint is some offsets that appear, which are resolved by automatic calibration. However, Wahoo/Zwift also note that at least once after unboxing (and after 20-30 mins of riding), that you’ll want to do a manual calibration (from the Wahoo app, Zwift has removed it for the KICKR CORE for their app), to ensure things are in the right ballpark. Wahoo’s automatic calibration won’t make big shifts to power that the manual calibration will, hence why it’s valuable to do.</p>\n<p><em>(Note: All of the charts in these accuracy sections were created using the DCR Analyzer tool. It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well, <a href=\"http://www.dcrainmaker.com/analyzer\">more details here</a>.)</em></p>\n<h3><span><strong>Retrofit other KICKR Trainers with Zwift Cog/Click:</strong></span></h3>\n<p><img title=\"DSC_0800.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0800.jpg\" width=\"720\" height=\"480\" /></p>\n<p>Undoubtedly some of you will be wondering whether or not you can slap a Zwift Cog on your existing KICKR or KICKR CORE. The answer is yes, but, you might want to wait a tiny bit. There are two things of note here:</p>\n<p>1) KICKR Firmware/Software Compatibility<br />\n2) KICKR Hardware Compatibility</p>\n<p>On the software/firmware side, the KICKR CORE units (all of them) recently received a firmware update from mid-January that allows for Zwift Cog compatibility. Of course, people didn’t know that, because in order to use it, you had to be in a certain Zwift access group. As for today (Feb 7th, 2024) Zwift is rolling out access to everyone to use virtual shifting with the KICKR CORE. This will be phased 50% today, and 50% tomorrow (Feb 8th).</p>\n<p>Of course, that still requires you have either the Zwift Play or Zwift Click buttons in order to virtually shift with the KICKR CORE. But, if you do, then you can use an existing KICKR CORE (with existing cassette) and then the Zwift Play/Click buttons to start virtual shifting by at latest the end of tomorrow.</p>\n<p>So, that covers the software side of the KICKR CORE, but what about other KICKR trainers? Wahoo/Zwift say that very shortly you’ll see firmware updates for the <a href=\"https://www.dcrainmaker.com/2022/09/wahoo-kickr-smart-trainer-v6-2022-in-depth-review.html\">KICKR V6</a> (2022), and <a href=\"https://www.dcrainmaker.com/2023/09/wahoo-kickr-move-smart-trainer-review.html\">KICKR MOVE</a> (2023) trainers released. Additionally, Wahoo is also working on the <a href=\"https://www.dcrainmaker.com/2018/07/wahoo-kickr-2018-trainer-in-depth-review.html\">KICKR V4</a> (2018), <a href=\"https://www.dcrainmaker.com/2020/08/wahoo-kickr-v5-2020-smart-trainer-in-depth-review.html\">KICKR V5</a> (2020) firmware, but that won’t quite be as quick. Again, this is all just using Zwift Play or Click, with your existing cassette and new firmware.</p>\n<p>But what if you want to put the Zwift Cog on a Wahoo KICKR V4/V5/V6/Move or existing CORE? Well, from a pure hardware standpoint, you can do that. But the upgrade kit currently sold by Zwift for the Zwift Hub has a different free hub body attached/contained with it than the KICKR series uses. That’s not a deal-breaker, but it requires an extra tool or two to swap out.</p>\n<p>Zwift/Wahoo says to simply hang tight, and they’ll start selling a variant that makes the swap much easier, just like how it was on the Zwift Hub (Classic) to swap onto KICKR trainers.</p>\n<h3><span><strong>Wrap-Up:</strong></span></h3>\n<p><img title=\"DSC_0909.jpg\" src=\"https://media.dcrainmaker.com/images/2024/02/DSC_0909.jpg\" width=\"720\" height=\"480\" /></p>\n<p>The entrance of the Wahoo KICKR Cog (or whatever they want to call it) was pretty easy to predict. Largely because Zwift pretty much signaled as such back in the October-November timeframe, when the partnership with Wahoo started ramping up, and they noted that Wahoo trainers would eventually get compatibility. Add to that the alignment of pricing between Wahoo &amp; Zwift on the Wahoo KICKR CORE &amp; Zwift Hub, and it was a no-brainer that Zwift would ditch the Zwift Hub and focus on a branded variant from Wahoo instead.</p>\n<p>At present, that (CORE) trainer isn’t yet orange. Down the road? Who knows.</p>\n<p>What we do know is that they’ve largely taken the best pieces of the Wahoo KICKR CORE, and merged them with the popular pieces of the Zwift Hub One (the virtual shifting), and all for the same price.</p>\n<p>From a consumer standpoint, that’s not a bad thing. From an industry standpoint, they’ve reduced competition further, and increased the power that Zwift/Wahoo has together. Long term, that’s likely not a good thing. I’d really like to see Wahoo work faster to introduce development options to leverage the Zwift Click shifting for other apps, versus the previously promised ‘end of year’. Further, I’d like to see that be an open standard, so any trainer app/company can take advantage of it.</p>\n<p>Till then, it’s very difficult to beat the pricing and appeal of Wahoo’s KICKR CORE offering, whether it be with the Zwift Cog, or traditional cassette.</p>\n<p>With that, thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"99ed1be9434d154a7ab684c26a31d08450cbebfd871e706dcb6e687c0fa8cb2c","category":"Cycling"}