{"title":"Evaluation of Gastric Digestion Behavior of Protein Sports Supplements by In Vitro Dynamic Gastrointestinal Digestion Model","link":"https://www.preprints.org/manuscript/202407.0654/v1","date":1720504183000,"content":"Commercial protein supplements are the main sources for the sports nutrition. Nowadays, those protein supplements mainly differ in the ingredients and formulations, possibly affecting the digestion behavior and protein absorption during gastrointestinal digestion. Herein, this work aimed to investigate the gastric digestion behavior and protein hydrolysis of commercial protein supplements by using an in vitro dynamic digestion model. Five commercial protein supplements were selected, including three protein powders and two liquid protein beverages. The results indicated that liquid protein beverages had smaller particle size than protein powder dispersions, and one of the protein powders existed as the microcapsules. During gastric digestion, all samples tended to form aggregates as the pH decreased, and the degree of aggregation was more pronounced in liquid protein beverages than in protein powders, where the intact structure of the microcapsules was gradually disrupted. Protein hydrolysis degree in liquid protein beverages was higher than that in protein powders. One of the liquid products (M20) had the highest protein hydrolysis degree of around 35.74% after 120 min gastric digestion and a half-empty time of 37.82 min. These findings suggest that the formulation and ingredients of commercial protein supplements will affect their digestion behavior, resulting in varying degree of protein hydrolysis. Hence, sports supplements should be carefully designed to provide precise nutrition for the athletes and exercisers.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"99ed30427bee392a8c4b60b0bd170bc5842f829da933030d6e0c2fcdf1a69bae","category":"Interdisciplinary"}