{"title":"Analysis of Behavioural Thermoregulatory Responses in Giraffa, Regarding Temperature and Sunlight Exposure during Daylight Hours","link":"https://www.preprints.org/manuscript/202403.1683/v1","date":1711548485000,"content":"Research topics surrounding the giraffe have been subject to recent disagreement, with work focusing on taxonomy over ecological phenomena such as behavioural thermoregulation. Much interest in taxonomy arises around the existence of distinct local populations of giraffes, often enclosed in small, fenced reserves, preventing natural gene flow. Targeted management of reserves may act as a buffer for declining populations, providing landscape that minimises requirements for thermoregulatory behaviours. Notable behaviours include shade-usage via trees and other giraffes, and positioning of the body towards the sun, employing an individual’s own neck as a shade source. Breeding programmes and translocation of individuals away from large communities on fenced reserves may increase giraffe population numbers across their range; however, the genetic diversity of large populations in enclosed spaces may be called into question. 55 of the 57 giraffes from the population on the Mogalakwena River Reserve (MRR) were observed over eight months, recording thermoregulatory behaviours such as body positioning in response to sun exposure, and shade usage; behaviours both noted in secondary works. These behaviours were compared across identities, such as sex and age, to assess how thermoregulation varies per individual. The population on the MRR spent more time facing the sun during high temperature days, with adults, sub-adults, males, and dark-coated individuals prioritising the behaviour beyond other individuals. Body positioning behaviours of individuals were also found to be more important in thermoregulation than shade-seeking, with shade usage decreasing on hotter days. Positional behaviour, disregarding identity, was also observed across wet and dry seasons, with a clear contrast; giraffes face the sun significantly more during the hotter wet season. The behaviours observed in this work provide an insight into the direction conservational strategies may take on closed reserves. However, further work is required on other reserves with varied population structures, to determine whether one strategy may be implemented across the giraffe's range, or whether specialised strategies are required in individual locations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"99f43c23ecb5e06744a490aa4d77f5614095c73ca02ebdc01b035c4e7c38fb77","category":"Interdisciplinary"}