{"title":"Environmental Factors Associated With Fish Reproduction in Regulated Rivers","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4376?af=R","date":1725956749000,"content":"<h2>ABSTRACT</h2>\n<p>Humans have extensively altered rivers to accommodate anthropogenic uses. Dams modify river flow and temperature regimes important for lotic fish reproduction. Yet, assessments of fish production in relation to environmental conditions in regulated rivers are lacking but are needed to guide experimental environmental flows. We evaluated the effects of water temperature and discharge on larval Catostomidae, Sciaenidae, and Clupeidae production to inform environmental flow management. We sampled ichthyoplankton from April through June on the Des Moines and Iowa rivers prior to (2014–2015) and after (2021–2022) an experimental environmental flow was incorporated on the Des Moines River. We used a hurdle model to assess the effects of water temperature, discharge, and discharge variation on larval presence (logistic regression) and density (linear regression). Larval Catostomidae were captured once water temperatures exceeded 15°C, Sciaenidae appeared when water temperature surpassed 18°C, while Clupeidae appeared when water temperature exceeded 20°C. The probability of larval Sciaenidae and Clupeidae presence increased with discharge variation while densities were both positively associated with discharge and discharge variation. The probability of Sciaenidae and Catostomidae larval presence increased with water temperature. Interactions between water temperature and discharge influenced Clupeidae presence and Catostomidae density. The probability of Clupeidae presence increased with discharge at warmer water temperatures. Catostomidae densities increased with discharge at cool water temperature (13°C) and decreased with discharge at warm (25°C) temperatures. Our results provide information about the effects of discharge, discharge variation, and water temperature driving larval fish production in anthropogenically altered rivers to guide environmental flow management.</p>","author":"Erik M. Griffen, \nMichael J. Weber","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"99f580a37bcab26f30c677c586d5279bb2d992009148a7696a345beab6f96264","category":"Environment"}