{"title":"Comprehensive study on pharmacognostic, pharmacological, and toxicological features of Ficus racemosa in Alzheimer’s disease using GC–MS and molecular docking analyses","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae098/7701764?rss=1","date":1719792000000,"content":"<span><div>Abstract</div><div>Background</div>Alzheimer's disease (AD) presents as a widespread neurodegenerative condition impacting over 55 million individuals globally, with an annual rise of 10 million new cases. Despite its staggering prevalence, the absence of a definitive cure establishes the need for a revisit.<div>Methods</div>We explore the alternative strategies, focusing on the potential therapeutic efficacy of ethanolic extracts derived from the fruit and leaf of <span>Ficus racemosa</span> Linn.<div>Results</div>The investigation comprehensively explores pharmacognostic, phytochemical, toxicological, and pharmacological characteristics. In addition to pharmacognostic and physicochemical analyses, toxicological evaluations conducted on experimental animals demonstrated the innocuous nature of the ethanolic extracts (from both fruit and leaf) of <span>F. racemosa</span>, as evidenced by assessments of hemocompatibility, oxidative parameters, and vital organ histology. Phytochemical profiling via GC-MS identified 48 and 80 phytoconstituents in the fruit and leaf extracts, respectively. These constituents were screened for bioactive potential using the “Lipinski Rule of Five,” resulting in the selection of 25 and 33 constituents from fruit and leaf extracts, respectively. Subsequent molecular docking studies against the AChE enzyme revealed promising interactions of the selected phytoconstituents. Furthermore, the top-scoring phytoconstituents were subjected to in silico screening to assess their interactions with β- and γ-secretase enzymes, in addition to the AChE enzyme. The cumulative findings substantiate the therapeutic utility of the plant extracts, particularly in the context of AD.<div>Conclusion</div>In conclusion, our investigation highlights the promising therapeutic potential of selected phytoconstituents derived from ethanolic extracts of <span>F. racemosa</span> in mitigating AD pathology by targeting key enzyme sites such as AChE, β-, and γ-secretase.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"99fac2b34d09bba4043e25ec24fbe4e28fe19dcd245fcec758687f514953df61","category":"Environment"}