{"title":"Effects of (2<i>R</i>,6<i>R</i>)-hydroxynorketamine in assays of acute pain-stimulated and pain-depressed behaviors in mice","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301848","date":1713535200000,"content":"<p>by Todd M. Hillhouse, Kaitlyn J. Partridge, Patrick I. Garrett, Sarah C. Honeycutt, Joseph H. Porter</p>\r\n\r\nKetamine has been shown to produce analgesia in various acute and chronic pain states; however, abuse liability concerns have limited its utility. The ketamine metabolite (2<i>R</i>,6<i>R</i>)-hydroxynorketamine (HNK) has been shown to produce antidepressant-like effects similar to ketamine without abuse liability concerns. (2<i>R</i>,6<i>R</i>)-HNK produces sustained analgesia in models of chronic pain, but has yet to be evaluated in models of acute pain. The present study evaluated the efficacy of acute (2<i>R</i>,6<i>R</i>)-HNK administration (one injection) in assays of pain-stimulated (52- and 56-degree hot plate test and acetic acid writhing) and pain-depressed behavior (locomotor activity and rearing) in male and female C57BL/6 mice. In assays of pain-stimulated behaviors, (2<i>R</i>,6<i>R</i>)-HNK (1–32 mg/kg) failed to produce antinociception in the 52- and 56-degree hot plate and acetic acid writhing assays. In assays of pain-depressed behaviors, 0.56% acetic acid produced a robust depression of locomotor activity and rearing that was not blocked by pretreatment of (2<i>R</i>,6<i>R</i>)-HNK (3.2–32 mg/kg). The positive controls morphine (hot plate test) and ketoprofen (acetic acid writhing, locomotor activity, and rearing) blocked pain-stimulated and pain-depressed behaviors. Finally, the effects of intermittent (2<i>R</i>,6<i>R</i>)-HNK administration were evaluated in 52-degree hot plate and pain-depressed locomotor activity and rearing. Intermittent administration of (2<i>R</i>,6<i>R</i>)-HNK also did not produce antinociceptive effects in the hot plate or pain-depressed locomotor activity assays. These results suggest that (2<i>R</i>,6<i>R</i>)-HNK is unlikely to have efficacy in treating acute pain; however, the efficacy of (2<i>R</i>,6<i>R</i>)-HNK in chronic pain states should continue to be evaluated.","author":"Todd M. Hillhouse","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"99fcd986e7b144a5f1f955f55a743ed5bfd5afa0157b326e27bdbcd2de676a42","category":"Interdisciplinary"}