{"title":"Exploring the Landscape of Routine Immunization in Nigeria: A Scoping Review of Barriers and Facilitators","link":"https://www.preprints.org/manuscript/202405.1388/v1","date":1716285165000,"content":"Despite global efforts to improve vaccination coverage, the number of zero dose and under immunized children has increased in the African continent, particularly in Nigeria where more than 2.3 million unvaccinated children currently reside, making it the country with highest number of unvaccinated children on the African continent. It is thus imperative to identity barriers and facilitators of immunization in Nigeria with a view to formulate and design targeted interventions that can effectively bridge the immunization gap in Nigeria. In this review, we systematically mapped and summarized existing literature and data on key barriers to vaccine uptake, and facilitators influencing immunization practices in Nigeria. The electronic databases were systematically searched and articles that reported determinants of routine immunization uptake in Nigeria from inception of the databases up till October 2023 were included. The eligible articles were evaluated using a set of pre-defined criteria and the extracted data were analysed and visualized. This scoping review identified barriers spanning logistical, socio-economic, cultural, and healthcare system-related aspects, highlighting the need for a multi-pronged approach to address these challenges. While considerable progress has been made over the years, persistent barriers like distance between area of residence of caregivers and immunization centers, vaccine shortages, poor interpersonal relationship between healthcare workers and caregivers and cultural/religious influences persist. Lastly, collaborative efforts among stakeholders and communities remain paramount in ensuring improved routine immunization coverage across the Nigeria’s diverse socio-cultural landscape.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"99ff399edf6f08be2cf20a69abe2331cb63154e345f62191fd6672691e4053f5","category":"Interdisciplinary"}