{"title":"Kuo: iPhone 15 Pro Models Will No Longer Feature Solid-State Buttons","link":"https://www.macrumors.com/2023/04/11/kuo-iphone-15-pro-no-solid-state-buttons-after-all/","date":1681265522000,"content":"The next-generation iPhone 15 Pro and iPhone 15 Pro Max will no longer feature solid-state buttons due to \"unresolved technical issues before mass production,\" according to the latest information shared by Apple analyst Ming-Chi Kuo. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/11/iPhone-14-Pro-Purple-Side-Perspective-Feature-Purple.jpg\" alt width=\"2250\" height=\"1265\" />\r<br />\nKuo said iPhone 15 Pro models would be <a href=\"https://www.macrumors.com/2022/10/28/kuo-iphone-15-pro-models-solid-state-buttons/\">equipped with solid-state buttons</a> back in October. He said two additional Taptic Engines inside the iPhone would provide haptic feedback to simulate the feeling of pressing the buttons, without them physically moving, similar to the Home button on the iPhone 7 or the Force Touch trackpad on newer MacBooks. However, in a <a href=\"https://medium.com/@mingchikuo/two-iphone-15-pro-models-removal-of-solid-state-button-design-negatively-affects-cirrus-logic-and-a456d5e7386c\">Medium post</a> today, he said the devices will have mechanical buttons after all.\r<br />\n\r<br />\n\"My latest survey indicates that due to unresolved technical issues before mass production, both high-end iPhone 15 Pro models (Pro &amp; Pro Max) will abandon the closely-watched solid-state button design and revert to the traditional physical button design,\" wrote Kuo. It's unclear if a \"traditional\" design means there will be two volume buttons or if Apple will still adopt a <a href=\"https://www.macrumors.com/2023/03/20/iphone-15-volume-mute-buttons-cad/\">single, elongated volume button</a>, as was previously rumored.\r<br />\n\r<br />\nKuo said there is still time for Apple to modify the iPhone 15 Pro's design given the device remains in the EVT development stage. He believes the change will have \"limited impact\" on the mass production schedule and shipments for the Pro models.\r<br />\n\r<br />\nThe reversal was also reported by tech analysts Jeff Pu and Shelly Chou at Hong Kong-based investment firm Haitong International Securities. The analysts believe the solid-state button design has been <a href=\"https://www.macrumors.com/2023/04/12/iphone-16-pro-solid-state-buttons/\">delayed until the iPhone 16</a> series in 2024.\r<br />\n\r<br />\nKuo said this news is \"unfavorable\" for Cirrus Logic and AAC Technologies, two key suppliers of Taptic Engine-related components for iPhones.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/04/11/kuo-iphone-15-pro-no-solid-state-buttons-after-all/\">Kuo: iPhone 15 Pro Models Will No Longer Feature Solid-State Buttons</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-iphone-15-pro-models-will-no-longer-feature-solid-state-buttons.2386571/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9a06c50909327dc96951c7d2a43530c4b1bf3f5e4f46717fb71f81f62c8eb331","category":"Apple"}