{"title":"Top Stories: Major iOS 17.4 Changes, MacBook and iPad Updates, and More","link":"https://www.macrumors.com/2024/01/27/top-stories-major-ios-17-4-changes/","date":1706364000000,"content":"Huge news this week for iOS users in the European Union, with major changes to Apple's policies coming with iOS 17.4 related to alternative app stores, default browsers, NFC payment options, and more.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/top-stories-27jan2024.jpg\" width=\"1600\" height=\"900\" />\r<br />\nThis week also saw the public release of iOS 17.3 with several new features, rumors about upcoming hardware, the end of an era for Apple retail, and more, so read on below for all the details!\r<br />\n\r<br />\n<h2>iOS 17.4 Introduces Alternative App Marketplaces With No Commission in EU</h2>\r<br />\nApple this week seeded the <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-beta-1/\">first developer beta of iOS 17.4</a>, and it comes alongside significant changes, particularly for users in the European Union to comply with the Digital Markets Act that goes into effect in early March.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/ios-17-4-major-app-store-changes.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nMost notably, iOS 17.4 will allow EU users to <a href=\"https://www.macrumors.com/2024/01/25/ios-17-4-alternative-app-marketplaces-eu/\">install apps from marketplaces other than the App Store</a>. Apple will not charge a commission on purchases for these apps, but there will be a per-install Core Technology Fee.\r<br />\n\r<br />\nOther changes coming as part of iOS 17.4 include <a href=\"https://www.macrumors.com/2024/01/25/apple-allows-game-streaming-apps-on-app-store/\">worldwide support for game streaming apps</a>, allowing EU users to <a href=\"https://www.macrumors.com/2024/01/25/third-party-default-browsers-eu-ios-17-4/\">set third-party browsers as default</a>, and <a href=\"https://www.macrumors.com/2024/01/25/apple-nfc-third-party-apps-eu/\">opening up the iPhone's NFC capabilities</a> in the European Economic Area to support payments by systems other than Apple Pay and the Wallet app.\r<br />\n\r<br />\n<h2>Apple Releases iOS 17.3 and iPadOS 17.3 With Stolen Device Protection, Collaborative Apple Music Playlists and More</h2>\r<br />\nThe initial beta of iOS 17.4 comes just after the <a href=\"https://www.macrumors.com/2024/01/22/apple-releases-ios-17-3/\">public release of iOS 17.3</a> and related operating system updates this week. <a href=\"https://www.macrumors.com/guide/ios-17-3-features/\">iOS 17.3 brings</a> a new Stolen Device Protection feature to help keep your device and accounts secure.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iOS-17.3-Whats-New-Thumb-1.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe update also brings <a href=\"https://www.macrumors.com/how-to/use-collaborative-apple-music-playlists/\">collaborative Apple Music playlists</a> with emoji reactions, support for using AirPlay to <a href=\"https://www.macrumors.com/2024/01/17/ios-17-3-airplay-hotel-room-tvs/\">stream content directly to select hotel TVs</a>, and more.\r<br />\n\r<br />\n<h2>New iPad Air, iPad Pro, and MacBook Air Models Likely to Launch in March or April</h2>\r<br />\nApple plans to <a href=\"https://www.macrumors.com/2024/01/21/new-ipads-and-macbook-airs-spring-2024-rumor/\">release new iPad Air, iPad Pro, and MacBook Air models in the spring</a> this year, according to <em>Bloomberg</em>'s Mark Gurman. Based on this time frame, the devices could be released as early as this March or April.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/10/iPad-Air-12.9-Inch-Feature.jpg\" width=\"2192\" height=\"1233\" />\r<br />\nThe iPad Pro is expected to see a significant redesign including OLED displays, an M3 chip, and <a href=\"https://www.macrumors.com/2024/01/25/ipad-pro-landscape-face-id-camera/\">perhaps a landscape Face ID camera system</a>. Meanwhile, the iPad Air is expected to see a <a href=\"https://www.macrumors.com/2024/01/20/next-gen-ipad-air-with-12-9-inch-display-and-redesigned-camera-unit-revealed-in-cad-renders/\">new 12.9-inch option</a> join the existing 10.9-inch size, while the MacBook Air should see largely internal upgrades such as a move to the M3 chip.\r<br />\n\r<br />\n<h2>Here's What Apple Vision Pro's Huge Box Looks Like</h2>\r<br />\nApple has yet to officially reveal to the public what the box for the Apple Vision Pro will look like, but <em>MacRumors</em> has seen an internal employee video that offers a glimpse of the packaging and we've <a href=\"https://www.macrumors.com/2024/01/22/heres-what-apple-vision-pros-box-looks-like/\">created a rendering that approximates the design</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/Apple-Vision-Pro-Box-and-Ref-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nThe box is somewhat larger than might be expected, with the headset, bands, and other various parts all packaged inside a relatively plain white box with a front-on view of the headset on top.\r<br />\n\r<br />\n<h2>iPhone 7 Users in U.S. Could Receive Up to $349 Payment From Apple</h2>\r<br />\nApple last year agreed to pay $35 million to settle a U.S. class action lawsuit alleging that the iPhone 7 and iPhone 7 Plus were prone to audio issues due to a defective chip in the devices, and it has <a href=\"https://www.macrumors.com/2024/01/21/iphone-7-apple-settlement/\">now started notifying eligible customers by email</a>.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/iPhone-7-Plus-Jet-Black-feature.jpg\" width=\"1600\" height=\"900\" />\r<br />\nYou may be eligible for a payment from Apple if you are a U.S. resident who owned an iPhone 7 or iPhone 7 Plus between September 16, 2016 and January 3, 2023, and reported audio issues covered by the settlement to Apple, and/or paid Apple out of pocket to have your iPhone repaired or replaced as a result of the covered audio issues.\r<br />\n\r<br />\n<h2>Apple's Infinite Loop Store Permanently Closes</h2>\r<br />\nAs previously announced, Apple <a href=\"https://www.macrumors.com/2024/01/20/two-apple-stores-permanently-close-today/\">permanently closed its Infinite Loop and Royal Hawaiian retail stores</a> in the U.S. on January 20. Apple said all employees at both stores would be given the opportunity to remain with the company.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Apple-Infinite-Loop-Store.jpeg\" width=\"2880\" height=\"1612\" />\r<br />\nInfinite Loop served as Apple's headquarters in Cupertino, California, from 1993 until 2017, when Apple Park opened nearby. The store on the campus existed in various forms for over 30 years and was located at street level near the entrance to the main office building. In its most recent incarnation, it sold a mix of standard Apple products and unique Apple-branded merchandise, such as shirts, reusable bottles, mugs, and notebooks.\r<br />\n\r<br />\n<h3>MacRumors Newsletter</h3>\r<br />\nEach week, we publish an email newsletter like this highlighting the top Apple stories, making it a great way to get a bite-sized recap of the week hitting all of the major topics we've covered and tying together related stories for a big-picture view.\r<br />\n\r<br />\nSo if you want to have <a href=\"https://mailchi.mp/macrumors/jan-25-2024\">top stories</a> like the above recap delivered to your email inbox each week, <b><a href=\"http://eepurl.com/OHdUX\">subscribe to our newsletter</a></b>!<div>Tag: <a href=\"https://www.macrumors.com/guide/top-stories/\">Top Stories</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/01/27/top-stories-major-ios-17-4-changes/\">Top Stories: Major iOS 17.4 Changes, MacBook and iPad Updates, and More</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/top-stories-major-ios-17-4-changes-macbook-and-ipad-updates-and-more.2417592/\">Discuss this article</a> in our forums<br /><br />","author":"MacRumors Staff","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9a0d12bcb0c5a28cdf28b081de3d857ee2348b7700a7121403d1108a45b2a48f","category":"Apple"}