{"title":"Most of the power sector’s emissions come from a small minority of plants","link":"https://arstechnica.com/?p=1786422","date":1628702580000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1229470950-800x534.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/GettyImages-1229470950.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/november-2020-north-rhine-westphalia-bergheim-the-sun-news-photo/1229470950?adppopup=true\">Picture Alliance / Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The world seems to be simultaneously on fire and flooding, and the <a href=\"https://arstechnica.com/science/2021/08/new-ipcc-climate-report-is-the-clearest-guidebook-for-selecting-a-future/\">latest expert report</a> indicates that we've just about run out of time to avoid even more severe climate change. All of that should have us looking for ways to cut carbon emissions as quickly and economically as possible.</p>\n<p>Some good news in that regard came via the recent release of a paper that looks at how much each power plant contributes to global emissions. The study finds that many countries have many power plants that emit carbon dioxide at rates well above either the national or global average. Shutting down the worst 5 percent of this list would immediately wipe out about 75 percent of the carbon emissions produced by electricity generation.</p>\n<h2>CARMA revisited</h2>\n<p>It's easy to think of power generation in simple terms, like \"renewables good, coal bad.\" To an extent, that statement is accurate. But it also compresses all power generation, from \"somewhat bad\" to \"truly atrocious,\" into a single category. And it's clear from a variety of research that the situation is more complex. Depending on their vintage, many plants convert fossil fuels to power at different degrees of efficiency. And some of the least efficient plants are only brought online during periods of very high demand; the rest of the time, they're idle and produce no emissions at all.</p></div><p><a href=\"https://arstechnica.com/?p=1786422#p3\">Read 13 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1786422&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9a17e6d8a6d5d36ed4a428075cfb989c36c6c801cfdf14945133038e059f921b","category":"Tech"}