{"title":"PSIII-11 Long-term effects of intra-articular lipopolysaccharide on markers of inflammation and cartilage metabolism in young Quarter Horses","link":"https://academic.oup.com/jas/article/102/Supplement_3/497/7757771?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Intra-articular lipopolysaccharide (LPS) is an established model for inducing robust, transient inflammation and increasing cartilage metabolism for up to 24 h following administration. Currently, there is limited information evaluating the long-term effects of this gram-negative endotoxin on the intra-articular environment of young horses. Therefore, the objective of this study was to determine the lasting effects of a single administration of intra-articular LPS on synovial biomarkers of inflammation and cartilage metabolism over 35 wk. Quarter Horse yearlings [n = 10; body weight (BW) = 409 ± 24 kg; 619 ± 16 d of age; fillies, (n = 7) and geldings (n = 3), originating from a single herd were used to test the hypothesis that intra-articular inflammation and cartilage metabolism would not be elevated at 35 wk post-injection. Each horse had one randomly selected radiocarpal joint injected with 0.8 mL of a 0.5 ng LPS solution derived from <span>Escherichia coli</span> O55:B5 (INFL; Sigma-Aldrich, St. Louis, MO) and the contralateral joint received sterile lactated Ringer’s solution (CON) as a control. Synovial fluid was obtained on 0 (before injection of LPS), 2, and 35 wk following arthrocentesis. Synovial fluid samples were analyzed in duplicate for carboxypropeptide of type II collagen (CPII), collagenase cleavage neopeptide (C2C), chondroitin sulfate 846 epitope (CS846), and prostaglandin E<sub>2</sub> (PGE<sub>2</sub>) by commercial ELISA (IBEX Pharm, Montreal, Quebec, CA and Arbor Assays, Ann Arbor, MI). Biomarkers were analyzed using PROC MIXED of SAS v9.4 with repeated measures (time). The model included treatment (CON, INFL), time (week), and treatment × time interaction as fixed effects. Synovial biomarkers PGE<sub>2</sub>, CPII, and CS846 changed over time (<span>P</span> &lt; 0.01) regardless of LPS administration, increasing from 0 to 2 wk and declining to below baseline concentrations at wk 35. There was a treatment × time interaction (<span>P</span> ≤ 0.01) in which INFL joints had decreased catabolic C2C concentrations compared with CON joints at wk 35. Therefore, LPS administration did not increase cartilage metabolism and inflammation levels at 2 or 35 wk post-LPS induction, indicating no negative effects compared with the contralateral controls. This study supports using intra-articular LPS in young horses without negative long-term effects.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9a1e9cca4a7ace1aa06fa90991218bca98e95b9fb3c8b371b663817a8635e340","category":"Environment"}