{"title":"Congressman confronts FBI over “egregious” unlawful search of his personal data","link":"https://arstechnica.com/?p=1923238","date":1678474643000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1240727905-800x534.jpg\" alt=\"Rep. Darin LaHood (R-Ill.)\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/03/GettyImages-1240727905.jpg\">Enlarge</a> <span>/</span> Rep. Darin LaHood (R-Ill.) (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/rep-darin-lahood-r-ill-leaves-the-house-republican-news-photo/1240727905?phrase=%22darin%20lahood%22\">Bill Clark / Contributor | CQ-Roll Call, Inc.</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last month, a <a href=\"https://www.intelligence.gov/assets/documents/702%20Documents/declassified/24th-Joint-Assessment-of-FISA-702-Compliance.pdf\">declassified FBI report</a> revealed that the bureau had used Section 702 of the Foreign Intelligence Surveillance Act (FISA) to conduct multiple unlawful searches of a sitting Congress member’s personal communications. <a href=\"https://www.wired.com/story/fbi-section-702/\">Wired was the first to report the abuse</a>, but for weeks, no one knew exactly which lawmaker was targeted by the FBI. That changed this week when Rep. Darin LaHood (R-Ill.) revealed during an annual House Intelligence Committee <a href=\"https://www.youtube.com/watch?v=vWqxFlphcXg\">hearing on world threats</a> that the FBI’s abuse of 702 was “in fact” aimed at him.</p>\n<p>“This careless abuse by the FBI is unfortunate,” LaHood said at the hearing, suggesting that the searches of his name not only “degrades trust in FISA” but was a “threat to separation of powers” in the United States. Calling the FBI’s past abuses of Section 702 “egregious,” the congressman—who is leading the House Intelligence Committee's working group pushing to reauthorize Section 702 amid a steeply divided Congress—said that “ironically,” being targeted by the FBI gives him a “unique perspective” on “what’s wrong with the FBI.”</p>\n<p>LaHood has said that having his own Fourth Amendment rights violated in ways others consider “frightening” positions him well to oversee the working group charged with implementing bipartisan reforms and safeguards that would prevent any such abuses in the future.</p></div><p><a href=\"https://arstechnica.com/?p=1923238#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1923238&amp;comments=1\">Comments</a></p>","author":"Ashley Belanger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9a35750b063f18726a1f046b9b033786af2aa7f85fffbbb8d553110915000b42","category":"Tech"}