{"title":"DNA Methylation Carries Signatures of Sublethal Effects Under Thermal Stress in Loggerhead Sea Turtles","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70013?af=R","date":1726383600000,"content":"<h2>ABSTRACT</h2>\n<p>To date, studies of the impacts of climate warming on individuals and populations have mostly focused on mortality and thermal tolerance. In contrast, much less is known about the consequences of sublethal effects, which are more challenging to detect, particularly in wild species with cryptic life histories. This necessitates the development of molecular tools to identify their signatures. In a split-clutch field experiment, we relocated clutches of wild, nesting loggerhead sea turtles (<i>Caretta caretta</i>) to an in situ hatchery. Eggs were then split into two sub-clutches and incubated under shallow or deep conditions, with those in the shallow treatment experiencing significantly higher temperatures in otherwise natural conditions. Although no difference in hatching success was observed between treatments, hatchlings from the shallow, warmer treatment had different length–mass relationships and were weaker at locomotion tests than their siblings incubated in the deep, cooler treatment. To characterise the molecular signatures of these thermal effects, we performed whole genome bisulfite sequencing on blood samples collected upon emergence. We identified 287 differentially methylated sites between hatchlings from different treatments, including on genes with neurodevelopmental, cytoskeletal, and lipid metabolism functions. Taken together, our results show that higher incubation temperatures induce sublethal effects in hatchlings, which are reflected in their DNA methylation status at identified sites. These sites could be used as biomarkers of thermal stress, especially if they are retained across life stages. Overall, this study suggests that global warming reduces hatchling fitness, which has implications for dispersal capacity and ultimately a population's adaptive potential. Conservation efforts for these endangered species and similar climate-threatened taxa will therefore benefit from strategies for monitoring and mitigating exposure to temperatures that induce sublethal effects.</p>","author":"Eugenie C. Yen, \nJames D. Gilbert, \nAlice Balard, \nInês O. Afonso, \nKirsten Fairweather, \nDébora Newlands, \nArtur Lopes, \nSandra M. Correia, \nAlbert Taxonera, \nStephen J. Rossiter, \nJosé M. Martín‐Durán, \nChristophe Eizaguirre","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"9a4be6d9d06b4e539cbbd05a60c3985bf78fc085e00a645ab7419d9899449f1d","category":"Environment"}