{"title":"Alibaba รายงานผลประกอบการ รายได้โต 9% - เลื่อนแผนไอพีโอธุรกิจ Cloud","link":"https://www.blognone.com/node/136786","date":1700160018000,"content":"<div><div><div><p>Alibaba รายงานผลประกอบการของไตรมาสเดือนกันยายน รายได้เพิ่มขึ้น 9% เทียบกับไตรมาสเดียวกันในปีก่อนเป็น 224,790 ล้านหยวน มีกำไรสุทธิ 27,706 ล้านหยวน</p>\n<p>Eddie Wu <a href=\"https://www.blognone.com/node/135661\">ซีอีโอคนใหม่ของ Alibaba</a> กล่าวในช่วงแถลงผลประกอบการว่าบริษัทพร้อมลงทุนเพื่อการเติบโต ด้วยสถานะทางการเงินที่ไม่เคยดีเท่านี้มาก่อน บริษัทสร้างกระแสเงินสดอิสระย้อนหลัง 12 เดือน ได้มากถึง 2.7 หมื่นล้านดอลลาร์ และตอนนี้มีเงินสดในมือ 6.3 หมื่นล้านดอลลาร์ บริษัทจึงประกาศจ่ายเงินปันผลให้ผู้ถือหุ้นเป็นครั้งแรกของบริษัท ที่ 0.125 ดอลลาร์ต่อหุ้นปกติ และ 1.00 ดอลลาร์ต่อหุ้น ADS</p>\n<p>Alibaba อัพเดตแผน<a href=\"https://www.blognone.com/node/133198\">การแยก 6 กลุ่มธุรกิจ</a> โดยกลุ่มคลาวด์นั้นจะเลื่อนแผนแยกบริษัทออกไปก่อน เนื่องจากผลกระทบของการห้ามส่งออกชิปเทคโนโลยีประมวลสูงมายังจีน ทำให้ธุรกิจคลาวด์ของ Alibaba อาจไม่สร้างผลตอบแทนที่ดีสำหรับผู้ถือหุ้นปัจจุบันตามที่เคยประเมินก่อนหน้านี้</p>\n<p>เช่นเดียวกับเชนซูเปอร์มาร์เก็ต Freshippo ที่เลื่อนแผนไอพีโอออกไปก่อน ระบุว่ามีปัจจัยหลายอย่างกระทบต่อแผนเดิมที่วางไว้ ขณะที่ธุรกิจอีคอมเมิร์ซต่างประเทศ (AIDC) จะใช้วิธีเพิ่มทุนผ่านนักลงทุน VC ไปก่อน และธุรกิจขนส่ง Cainiao <a href=\"https://www.blognone.com/node/135886\">ยื่นไฟลิ่ง</a>เพื่อเตรียมเข้าตลาดหุ้นฮ่องกงแล้ว</p>\n<p>ที่มา: <a href=\"https://www.alizila.com/alibaba-dividend-q2-solid-results-reorganization-cloud-cainiao-ipo/\">Alibaba</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/23589089af3497d65003abc18b8a0672.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/alibaba\">Alibaba</a></div><div><a href=\"/topics/alibaba-cloud\">Alibaba Cloud</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9a4c790a58ef3a18a8e6222434ee5eeec459387faca3a825bc4db3964ef6272c","category":"Thai"}