{"title":"Tri‐component hydrocolloid as egg white replacement in meringues: gellan gum with soy protein isolate and maltodextrin","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13452?af=R","date":1718692178000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In the quest for sustainable food ingredients, the present study delves into the potential of a tri-component hydrocolloid blend, comprising gellan gum (GG), soy protein isolate (SPI) and maltodextrin (MD), as a replacement for egg white in meringue production. The research aims to elucidate the intricate physical properties of meringue containing this tri-component structure, focusing on foaming dynamics, rheological behavior and the textural properties of the resulting meringue cookies.</p>\n<h2>RESULTS</h2>\n<p>Experiments were conducted with various hydrocolloids (<i>k</i>-carrageenan, GG, and locust bean gum) and GG was identified as optimal for improving foaming capacity and foaming stability. Rheological evaluations showed a positive correlation between increased GG concentration within the tri-component matrix and an increase in both storage modulus (<i>G</i>') and loss modulus (<i>G</i>\"), indicating improved structural integrity. Furthermore, a comparative analysis of the texture profiles of cookies prepared with this blend highlighted the ability of higher GG concentrations to satisfactorily replicate the tactile and visual qualities of traditional egg white-based meringues. This result was particularly evident compared to formulations utilizing solely SPI or the combined SPI–MD configuration.</p>\n<h2>CONCLUSION</h2>\n<p>Conclusively, the results of the present study highlight the significant potential of the GG-SPI-MD tri-component structure to closely mimic the critical properties of egg white, thus offering a promising plant-based alternative for meringue production. © 2024 Society of Chemical Industry.</p>","author":"Hyun Woo Choi, \nYoungsang You, \nSeung Hwan Ham, \nYaeji Choe, \nSangeun Park, \nJungwoo Hahn","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9a5430790548758b5924be3eba521446f26c8e4cd04a23e017fe33a346e23e26","category":"Environment"}