{"title":"The evolutionary consequences of interactions between the epigenome, the genome and the environment","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13730?af=R","date":1721796016000,"content":"<h2>Abstract</h2>\n<p>The epigenome is the suite of interacting chemical marks and molecules that helps to shape patterns of development, phenotypic plasticity and gene regulation, in part due to its responsiveness to environmental stimuli. There is increasing interest in understanding the functional and evolutionary importance of this sensitivity under ecologically realistic conditions. Observations that epigenetic variation abounds in natural populations have prompted speculation that it may facilitate evolutionary responses to rapid environmental perturbations, such as those occurring under climate change. A frequent point of contention is whether epigenetic variants reflect genetic variation or are independent of it. The genome and epigenome often appear tightly linked and interdependent. While many epigenetic changes are genetically determined, the converse is also true, with DNA sequence changes influenced by the presence of epigenetic marks. Understanding how the epigenome, genome and environment interact with one another is therefore an essential step in explaining the broader evolutionary consequences of epigenomic variation. Drawing on results from experimental and comparative studies carried out in diverse plant and animal species, we synthesize our current understanding of how these factors interact to shape phenotypic variation in natural populations, with a focus on identifying similarities and differences between taxonomic groups. We describe the main components of the epigenome and how they vary within and between taxa. We review how variation in the epigenome interacts with genetic features and environmental determinants, with a focus on the role of transposable elements (TEs) in integrating the epigenome, genome and environment. And we look at recent studies investigating the functional and evolutionary consequences of these interactions. Although epigenetic differentiation in nature is likely often a result of drift or selection on stochastic epimutations, there is growing evidence that a significant fraction of it can be stably inherited and could therefore contribute to evolution independently of genetic change.</p>","author":"Pierre Baduel, \nIris Sammarco, \nRowan Barrett, \nMarta Coronado‐Zamora, \nAmélie Crespel, \nBárbara Díez‐Rodríguez, \nJanay Fox, \nDario Galanti, \nJosefa González, \nAlexander Jueterbock, \nEric Wootton, \nEwan Harney","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"9a55354363ee928ed32d8aaff77518e89a0cfda7d7aed962cf916d63a24f4fba","category":"Environment"}