{"title":"What do the Tour de Romandie results mean for the Tour de France?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/what-do-the-tour-de-romandie-results-mean-for-the-tour-de-france","date":1620298490000,"content":"\n      <p><span>The rain arrived in Romandy last week, and when it rained, it poured. For the latter stages of the race, riders were enveloped in clouds, soaking and shivering, making those of us watching at home feel pretty smug from the comfort of our sofas. </span></p>\n<div></div>\n<p><span>The UCI’s recent safety rules on positions and bottle throwing seemed obscene considering the treacherous conditions the peloton faced. Still, adverse weather leads to dramatic bike racing, and there was plenty of that at the Tour of Romandie.</span></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2021-preview\"><em><strong>Related – Giro d'Italia 2021 Preview</strong></em></a></p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><em><strong>Related – Tour de France 2021 Preview</strong></em></a></p>\n<p><span>Although only five stages and a prologue, the race can be a good early indication of where many of the main contenders are ahead of the three Grand Tours. It included a sprint stage, a couple of opportunities for the puncheurs, some tough mountains and a challenging closing time trial, allowing riders to test themselves on a variety of parcours.</span></p>\n<p>Stage wins went to Rohan Dennis, Peter Sagan, Sonny Cobrelli, Marc Soler and Mike Woods, with Geraint Thomas taking the final GC. Each win gave us a good insight into each rider’s form. With that being said, here’s what the Tour de Romandie results could mean for the Tour de France:</p>\n<h4>The Grenadiers are looking good for July</h4>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/4_KASK_Wasabi_StradeBianche---Image-Credit-_pocispix_1024x1024.jpg?v=1620297738\" /></p>\n<p><em>Image credit: pocispix</em></p>\n<p><span>Perhaps the story of the race was Geraint Thomas’s bizzare crash at the summit of Thyon, when he was so close to taking the victory and the overall race lead. His team had had a near perfect race up until that point, taking the top three spots of the podium in the prologue. With Dennis in the yellow leader’s jersey for the first few days, they had controlled the race impressively, faltering only when Marc Soler of Movistar took the race lead after his solo win in stage three.</span></p>\n<p><span>Trailing Soler by only 20 seconds, and stronger than him in the mountains, Thomas reached the queen stage perfectly poised to take back the yellow jersey for his team. After a gruelling five hours in the lashing rain, stage four could have been Thomas’s first win since the Tour in 2018.</span></p>\n<p><span>But, as he approached the line, his hand slipped changing gear and he found himself up-close and personal with the slippery black tarmac. Shocked and slightly embarrassed, Thomas remounted, but he’d lost 21 seconds to Israel Start-Up Nation’s Mike Woods, who won the stage. Afterwards, Thomas explained that his hands were numb due to the freezing conditions, meaning he couldn’t properly hold on to his bars and lost control getting out of the saddle.</span></p>\n<p><span>However, giving us all a lesson in perseverance and determination, Thomas bounced back in the final time-trial the next day, finishing third on the stage but winning the GC by 28 seconds. His teammate, Richie Porte, also finished second overall, proving he is building nicely towards the Tour and will be a huge aid for Thomas in the mountains, as well as a back-up leader if Thomas is unlucky enough to have another crash or mishap.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/Mike-Woods-Geraint-Romandie_1024x1024.jpg?v=1620297536\" /></span></p>\n<p><em><span>Photo credit: Fabrice Coffrini/AFP via Getty Images</span></em></p>\n<p><span>Rohan Dennis looks like he will be a domestique extraordinaire for Ineos, too. He may well go into the Tour with his own ambitions for the time trials, but he is no slouch on the climbs, as he proved when he supported Geoghegan Hart in the Giro last year. Dennis did some impressive work at Romandie and will be an invaluable asset to Ineos’ team in July.</span></p>\n<h4>Could Bahrain-Victorious’ Sonny Cobrelli put up a challenge for the green jersey?<br /><span></span>\n</h4>\n<p><span>Sonny Cobrelli was victorious (see what I did there?) in stage two of the Tour of Romandie and it wasn’t a stage we might expect to be suited to him as a sprint specialist. With 24km to go, the riders hit La-Vue-des-Alpes, a steep 7km climb. Ineos set the pace at the front.</span></p>\n<p><span>Riders like Peter Sagan were shot out of the back, unable to hang on to the tempo set by the Grenadiers. When the race reached the summit, only around 30 riders remained, and Cobrelli was part of this group. His ability to hang on over the climbs and still pack a punch in the finish could make Cobrelli perfectly suited to the green jersey competition at the Tour de France.</span></p>\n<p><span>He had finished second to Sagan in the bunch kick in stage one already, proving his consistency – a key characteristic for a rider looking to accumulate points over a three-week race.</span></p>\n<p><span>Of course, as a seven-time winner of the green jersey competition, Sagan will be targeting it once again this year and he did prove faster than Cobrelli in the opening stage at Romandie. Throw Sam Bennett in the mix and the green jersey competition at the Tour de France looks like it is going to be exciting and hotly contested.</span></p>\n<h4>Israel Start-Up Nation’s big signings for 2021 are starting to come good</h4>\n<p><span>ISN is a team who have gone against the recent trends of signing young, superstart talents. Instead, for 2021, they spent their budget mainly on experienced riders who already had a wealth of results.</span></p>\n<p><span>These riders included Chris Froome and Andre Greipel. Much has been made about the underperformance of Froome so far this season and Greipel’s inability to secure a win as yet in a sprint stage, despite having a well-drilled leadout squad behind him. The team may also have been disappointed with their results in the Classics season: Sep Vanmarcke finished on the podium at Omloop, but might have had a shot at the top step with a stronger team behind him.</span></p>\n<p><span>However, Mike Woods’ form in Romandie signals a change in Israel Start-Up Nation’s luck – suggesting that their signing of older, well-practiced riders could serve them well in the Grand Tours. His win over Geraint Thomas in stage four shows that Woods has the ability to climb with the best and his consistency across the Ardennes week indicates that his endurance is there to deal with three weeks of racing.</span></p>\n<p><span>Woods was only let down by a disappointing performance in the final time-trial, but there are still a couple of months to go until the Tour for him to fine-tune his race against the clock.</span></p>\n<h4>Ilan van Wilder could be a future Tour contender</h4>\n<p><span>Team DSM’s van Wilder looks like he could be the next best thing to come out of Belgian cycling’s talent pool. At only 20 years old, he finished fourth in the closing time-trial at Romandie, only one second behind Geraint Thomas and ahead of Porte, Dennis and Ganna.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1315851453_1024x1024.jpg?v=1620298117\" /></span></p>\n\n<p><em>Photo credit: Luc Claessen / Stringer</em></p>\n<p><span>At such a young age, this performance can’t be overlooked and surely announces van Wilder as a potential winner of a race like the Tour de France in the not so distant future. He also finished seventh in stages two and three, riding an attacking race with the tactical prowess of a rider beyond his years.</span><br /><span></span></p>\n<p><span>Last year, van Wilder had to abandon the Vuelta due to knee problems after only one stage, but it seems that he has resolved any issues now and is heading into the stage racing season at full throttle, with the Critérium du Dauphiné next on his calendar. It may be a few years before van Wilder will start the Tour, but should he continue on this trajectory, he is one to watch as part of the next generation of Grand Tour winners.</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9a609dad91a8e5236b0ebdb90689b3a0828933b30ea5fa65ce1109f6cd35955d","category":"Cycling"}