{"title":"For Jolien Verschueren, rest in peace","link":"https://cyclingtips.com/2021/07/for-jolien-verschueren-rest-in-peace/","date":1625251921000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Verschueren-1-of-1-650x434.jpg\" /></div><h2>For Jolien Verschueren, rest in peace</h2><p>\n</p><p>This morning I learned about the death of Jolien Verschueren. She was only 31 years young. To many, it came as a surprise, because they had hoped the brain tumor she was diagnosed with in 2018 was gone forever. Unfortunately, the cancer had come back. The family wanted to keep that quiet in her final months and I respected that.</p>\n\n\n\n<p>Jolien was a champion but didn’t want to treated as one. She was just Jolien from Kruisem, in East Flanders. Daughter, sister, friend, school teacher, devout Christian and a huge cyclocross talent. Though she stood on the podium often, winning the iconic Koppenbergcross twice as the highlights of her career, she was uneasy on the podium. She was uneasy with the spotlight. She was uneasy with being the centre of attention.</p>\n\n\n\n<p>When I met Jolien she was soft spoken but smiling all the time. She was back at the place she loved so much: the cyclocross world with her family around her. Her mother as soigneur, her father as mechanic as so often is the case in this sport. I was invited into her camper van and we had coffee with some chocolates. We had made this appointment to write a book about her life but the book never happened when life caught up with Jolien.</p>\n\n\n\n<p>Born in Kortrijk in 1990, Jolien grew up to be as successful cyclocross rider. What some would see as a weakness became her strength. She was a petite rider who did really well on the hilly courses. From the 2013/2014 season she started to become a regular in the top ten. From the season 2015/2016 she started winning races. She won the Koppenbergcross, on the cobbles so famous from the Belgian spring classics, with a margin of over a minute on the competition in 2015. She did it again in 2016.</p>\n\n\n\n<p>She explained to me when we started on the book that cyclocross races had changed so much. There were too many turns and unnecessary technicalities. New riders started to win the races she had excelled in. That Koppenbergcross win in 2016 was her last victory.</p>\n\n\n\n<p>In 2018 Jolien was diagnosed with a brain tumor. I followed her on social media and she shared gospel music and bible quotes. I sent her some of my favorite Christian songs as encouragement during her treatment and we kept in contact. Jolien was a faithful Christian who felt carried by God, her Father. She could testify of her faith but would never be forceful. She didn’t need to be because her faith was visible in all she did, said and didn’t say.</p>\n\n\n\n<p>That last thing became a bit of an issue in our book process. I had never written a book and Jolien herself felt uneasy talking about herself all the time. She hadn’t kept notes of the time she was treated for cancer and deep down didn’t feel her story was interesting for a bigger public than her own inner circle. She really did want to testify of her faith but she didn’t have the words. After a wonderful bike ride in the province of East Flanders where she beat me on all the climbs, we both agreed that I would not be the person to write her story but that a mutual friend, a more experienced editor would take over. Unfortunately, the cancer returned and time was running out.</p>\n\n\n\n<p>Today she died, just 31 years old. She will be missed by so many people. Her parents, brother and sister first and foremost. Her family and her many friends. Jolien was the kind of person who didn’t have an enemy in the world. Even in her darkest days she would look out for others, sharing her podium flowers with someone in need. The kids at the school she so passionately worked as a gym teacher and her fans will miss her. I will miss her perseverance and her solid faith.</p>\n\n\n\n<p>What struck me most is that Jolien never returned to her former level but she kept fighting in every race she lined up for. She was so happy to be part of the cyclocross world again and her supporters kept cheering her, even when she was in last place, which happened a lot after that cancer treatment. She was adamant, stubbornly fighting and knew that she would get better. She prayed and she sang the worship songs that gave her strength. I can only pray that she is now at home with her heavenly Father and that He welcomed her with some good cheers and open arms.</p>\n\n\n\n<p>Her last race was the Koppenbergcross in 2020, the race she loved so much. May there be mud and cobbles in Heaven! Rest in peace, Jolien</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/for-jolien-verschueren-rest-in-peace/\">Read More</a>","author":"José Been","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9a62b6df8f5750d6b7afc4a3847c11e0ba98f250e3c90c46ddfd27366ed179ad","category":"Cycling"}