{"title":"Biological control of cat's claw creeper (Dolichandra unguis‐cati; Bignoniaceae): Current status and future prospects","link":"https://onlinelibrary.wiley.com/doi/10.1111/aab.12930?af=R","date":1724923492000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d080c836-7199-4d45-9a02-1c5f804f7c13/aab12930-toc-0001-m.png\" alt=\"Biological control of cat's claw creeper (Dolichandra unguis-cati; Bignoniaceae): Current status and future prospects\" />\n<p>Cat's claw creeper (<i>Dolichandra unguis-cati</i>) is a target for biological control. Progress with the biological control programmes in Australia and South Africa over the last two decades are reviewed. To date, five agents, all targeting leaves, were released in South Africa, while only three of them were released in Australia. Establishment status and impacts of agents vary widely between Australia and South Africa. An accidentally introduced leaf-spot pathogen <i>Neoramulariopsis unguis-cati</i> causing widespread defoliation in South Africa was tested as a biological control agent in Australia. Future research will focus on the gall rust <i>Uropyxis rickiana</i> targeting shoots and the seed-feeding weevil <i>Apteromechus notatus</i>.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Cat's claw creeper (<i>Dolichandra unguis-cati</i>), native to tropical South America, is a major invasive species and a target for biological control in Australia, South Africa and some South Pacific Island countries. Native range surveys in Argentina, Brazil, Paraguay and Venezuela have identified eight insects and four fungal pathogens as potential agents. Five leaf-feeding insects a tortoise beetle <i>Charidotis auroguttata</i>, two tingids <i>Carvalhotingis visenda</i> and <i>C. hollandi</i>, a leaf-tying moth <i>Hypocosmia pyrochroma</i> and a leaf-mining beetle <i>Hedwigiella jureceki</i>, have been tested and all were released in South Africa. Four of these have become established but are not widespread and cause only limited damage. In Australia, only three of these, <i>C. visenda</i>, <i>H. pyrochroma</i> and <i>H. jureceki</i> were released, while <i>C. auroguttata</i> was not approved due to perceived non-target risks. All agents have become widely established, except for <i>H. pyrochroma</i> which is restricted to riparian corridors in southeast Queensland. In South Africa, an accidentally introduced leaf-spot pathogen, <i>Neoramulariopsis unguis-cati</i>, causes necrotic lesions and premature abscission of leaves in cat's claw creeper infestations, resulting in widespread defoliation. Based on its impact and field-host specificity in its native range and in South Africa, the pathogen has been prioritised for evaluation as a potential additional agent in Australia. The current priority is to seek approval for the introduction of this leaf-spot pathogen into Australia. Future research should focus on the gall-inducing rust <i>Uropyxis rickiana</i> and the seed-feeding weevil <i>Apteromechus notatus</i> as prospective agents.</p>","author":"Kunjithapatham Dhileepan, \nAnthony M. King, \nDianne B. J. Taylor, \nKathryn M. Pollard, \nMarion K. Seier","siteTitle":"Wiley: Annals of Applied Biology: Table of Contents","siteHash":"a403b38a3432c20b8a9e38602184acbfc416cca77ff6bdf54b49e3b6eafe9c39","entryHash":"9a6b400e0a0cb0a087a551286179019f8dbc07784a0c25e6764d29f6f9230595","category":"Environment"}