{"title":"Caregiver-assisted testing with HIV self-test kits for children 18 months and older: A GRADE systematic review","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003588","date":1723644000000,"content":"<p>by Kathleen McGee, Muhammad S. Jamil, Nandi Siegfried, Busisiwe Msimanga Radebe, Magdalena Barr-DiChiara, Rachel Baggaley, Cheryl Johnson</p>\r\n\r\nCaregiver-assisted testing using HIV self-test (CG-HIVST) kits has been proposed to enhance paediatric HIV case finding and contribute toward ending paediatric HIV/AIDS by 2030. We conducted a systematic review to assess the risks and benefits of CG-HIVST. We searched nine electronic databases and consulted experts to identify relevant articles through 5 February, 2022. Studies comparing CG-HIVST to other testing services among children over 18-months, or to no intervention, were included. Outcomes included uptake, acceptability, diagnostic accuracy, feasibility, HIV positivity, linkage to care, social harm, values and preferences, costs, and cost-effectiveness. Risk of bias was assessed using relevant Cochrane tools and certainty of evidence was evaluated with GRADE. Among 2203 screened articles, nine observational studies from sub-Saharan Africa were included. All studies used and assessed caregiver-assisted testing using oral fluid-based HIVST. In one non-randomized intervention study of 6062 children, overall CG-HIVST uptake was lower than other standard testing services (3.30% vs. 56.71%). In the same study, HIV positivity following CG-HIVST appeared lower or comparable to standard testing (RR = 0.44; 95% CI: 0.06, 3.20). Two single-arm studies reported high linkage to confirmatory testing (97.48%) and treatment initiation (97.7%) among children reported positive with CG-HIVST. Pooled positive predictive value was 36.72% across three non-randomized intervention studies. Reported social harms were rare, and acceptability appeared high among caregivers taking up the intervention, but feasibility was unclear as some reported anxiety in relation to reactive results. Evidence was appraised very low certainty. Average CG-HIVST costs varied widely and were consistently higher than standard testing services. CG-HIVST may be acceptable, but feasibility remains uncertain with potential higher costs. Current evidence favours standard testing for uptake and positivity. Low positive predictive values raise concerns about false positives and potential harm. Programmes should prioritize evidence-based approaches for paediatric case-finding, while research to fully evaluate this approach continues.","author":"Kathleen McGee","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9a77a76cb4e5513db457769e7e372e058523075f7ffc07c66089b3985185c36c","category":"Environment"}