{"title":"Review: Classicbot's Latest iBoy Accessory is a Wearable iPhone Pouch","link":"https://www.macrumors.com/review/classicbot-iboy-wearable-pouch/","date":1631813445000,"content":"<a href=\"https://classicbot.com/store/\">Classicbot designer Philip Lee</a> has created a range of robot figurines, toys, plushes, and pins that are modeled after classic Apple devices like the Mac and the iPod.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy.jpg\" />\r\n<br />\r\nThe latest Classicbot product is an updated version of the iBoy that's <a href=\"https://classicbot.com/store/iBoy-Phone-Pouch-p380527666\">available in pouch form</a>. Lee's previously released iBoy was made from plastic and modeled after the Classic iPod. The <a href=\"https://classicbot.com/store/iBoy-Phone-Pouch-p380527666\">iBoy Phone Pouch</a> looks similar to the original figurine, but in a larger plush format.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy-size.jpg\" />\r\n<br />\r\nBecause it uses an iPod design, the iBoy Phone Pouch is rectangular in shape with plush stuffed headphones for ears, long arms, and short legs. The stitching is top notch and this feels like a high-quality accessory, which I would expect at this price point.\r\n<br />\r\n\r\n<br />\r\nThere's an embroidered display at the front with a cute robot face and an embroidered click wheel, which is what gives the iBoy its recognizable iPod styling. All of the limbs and add-ons are well attached, and it feels like a durable little bag that's going to hold up well.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy-on-desk.jpg\" />\r\n<br />\r\nSize wise, the iBoy has a limited amount of space inside. It will fit an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, including the <a href=\"https://www.macrumors.com/roundup/iphone-12-pro/\">iPhone 12 Pro Max</a> in a case, but that's a snug fit and not much else is able to go inside. In fact, it's such a snug fit that I don't think this is something I'd want to use for my Pro Max unless I wasn't using a case, but it is a looser fit for the smaller iPhones. There is a soft plush lining inside that's going to prevent an ‌iPhone‌ (or whatever else is inside) from getting scratched up, and a plastic zipper at the top keeps the pouch closed up.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy-with-iphone.jpg\" />\r\n<br />\r\nIn terms of measurements, the iBoy Phone Pouch measures in at 7 inches by 4.25 inches by 1 inch, and there's an adjustable 34-inch strap that attaches to the earbud antennas for carrying it cross body or around the neck. It is not big enough to hold more than an ‌iPhone‌, a set of keys, and a few other small accessories. There's also a small pocket at the back with the iBoy branding, and this pocket is big enough to hold a chapstick, a pen, or something similarly small.\r\n<br />\r\n\r\n<br />\r\nGiven its small size and plush design, the iBoy Phone Pouch isn't something that's practical for most people for everyday use. I personally would not use this out and about on a day to day basis, but I might bring it along on an Apple-themed event like <em>MacRumors</em>' annual WWDC meetup.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy-back.jpg\" />\r\n<br />\r\nI don't think most Apple enthusiasts who might be interested in this will want to wear it, but the strap can be removed and it can be placed on a desk as a little accessory that can also hold your odds and ends, and this is my preferred way to use it. The iBoy Pouch does not stand up on its own, but it can kind of sit leaned up against something on a shelf.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/09/iboy-hanging.jpg\" />\r\n<br />\r\nThe front of the iBoy is white and the back is a light gray, so I'm concerned that if this was used as a bag, it could potentially get dirty, so it will need to be used with care. On a shelf as a trinket holder, it's much less prone to dirt stains. The iBoy Phone Pouch could also be used to hold cables and other small accessories in a bigger backpack for those who need more storage space or don't want to carry it like a purse.\r\n<br />\r\n\r\n<br />\r\n<h2>Bottom Line</h2>\r\n<br />\r\nThe iBoy Phone Pouch is undeniably adorable and will be appealing to some, but it's a niche product that isn't entirely practical and definitely something to be bought for the aesthetic rather than the function. It works as a pouch for small accessories, but I suspect most people on <em>MacRumors</em> who might be interested in it would prefer to use it as a desktop or shelf decoration, and luckily it also looks great as decor.\r\n<br />\r\n\r\n<br />\r\n<h2>How to Buy</h2>\r\n<br />\r\nThe iBoy Phone Pouch can be <a href=\"https://classicbot.com/store/iBoy-Phone-Pouch-p380527666\">purchased from the Classicbot website</a> for $49.<br />This article, \"<a href=\"https://www.macrumors.com/review/classicbot-iboy-wearable-pouch/\">Review: Classicbot's Latest iBoy Accessory is a Wearable iPhone Pouch</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/review-classicbots-latest-iboy-accessory-is-a-wearable-iphone-pouch.2311309/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nYx3Wr_xjQA:URKX4s6e2J0:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=nYx3Wr_xjQA:URKX4s6e2J0:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/nYx3Wr_xjQA\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9a77e2e3f2750ec3ff38300fa4be6d5a456f7a3e5bd2f706469e73feb68d83e9","category":"Apple"}