{"title":"Forest structure, plants, arthropods, scale, or birds’ functional groups: What key factor are forest birds responding to?","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304421","date":1717164000000,"content":"<p>by Swen C. Renner, Martin M. Gossner, Manfred Ayasse, Stefan Böhm, Miriam Teuscher, Wolfgang W. Weisser, Kirsten Jung</p>\r\n\r\nForest birds respond to a diverse set of environmental factors, including those altered by forest management intensity, such as resource and habitat availability in the form of food or nesting sites. Although resource/habitat availability and bird traits likely mediate responses of bird diversity to global change drivers, no study has assessed the direct and indirect effects of changes in forest management and traits on bird assemblages jointly at large spatial scales. In this context the questions remain whether (1) the birds’ response to forest management changes through alterations in structural properties and/or food availability, or (2) if birds’ eco-morphological traits act as environmental filters in response to environmental factors. We audio-visually recorded birds at 150 forest plots in three regions of Germany and assessed the forest structure (LiDAR) as well as the diversity of the herbaceous layer and diversity and biomass of arthropods. We further assessed eco-morphological traits of the birds and tested if effects on bird assemblages are mediated by changes in eco-morphological traits’ composition. We found that abundance and species numbers of birds are explained best by models including the major environmental factors, forest structure, plants, and arthropods. Eco-morphological traits only increased model fit for indirect effects on abundance of birds. We found minor differences between the three regions in Germany, indicating spatial congruency of the processes at the local and regional scale. Our results suggest that most birds are not specialized on a particular food type, but that the size, diversity and species composition of arthropods are important. Our findings question the general view that bird traits adapt to the resources available.","author":"Swen C. Renner","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9a785ef7a29afe0c5dd340dc755b5a9e534db5a52ba529e07648835ef3ec17f4","category":"Interdisciplinary"}