{"title":"Chimeric Viruses Enable Study of Antibody Responses to Human Rotaviruses in Mice","link":"https://www.preprints.org/manuscript/202405.1063/v1","date":1715839768000,"content":"The leading cause of gastroenteritis in children under the age of five is rotavirus infection, accounting for 37% of diarrhoeal deaths in infants and young children globally. Oral rotavirus vaccines have been widely incorporated into national immunisation programs, but whilst these vaccines have excellent efficacy in high-income countries, they protect less than 50% of vaccinated individuals in low- and middle-income countries. In order to facilitate the development of improved vaccine strategies, a greater understanding of the immune response to existing vaccines is urgently needed. However, the use of mouse models to study immune responses to human rotavirus strains is currently limited as rotaviruses are highly species-specific and replication of human rotaviruses is minimal in mice. To enable characterisation of immune responses to human rotavirus in mice, we have generated chimeric viruses that combat the issue of rotavirus host range restriction. Using reverse genetics, the rotavirus outer capsid proteins (VP4 and VP7) from either human or murine rotavirus strains were encoded in a murine rotavirus backbone. Neonatal mice were infected with chimeric viruses and monitored daily for development of diarrhoea. Stool samples were collected to quantify viral shedding, and antibody responses were comprehensively evaluated. We demonstrated that chimeric rotaviruses were able to efficiently replicate in mice. Moreover, the chimeric rotavirus containing human rotavirus outer capsid proteins elicited a robust antibody response to human rotavirus antigens, whilst the control chimeric murine rotavirus did not. This chimeric human rotavirus therefore provides a new strategy for studying human rotavirus-specific immunity, and could be used to investigate factors causing variability in rotavirus vaccine efficacy. This small animal platform therefore has the potential to test the efficacy of new vaccines and antibody-based therapeutics.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9a7922695c936ef140f99e193ed13456d47f0f0be550d44e9f781d81b6817a0f","category":"Interdisciplinary"}