{"title":"Synergistic Responses Conferred by Concurrent Optical and Magnetic Stimulation are Attenuated by Simultaneous Exposure to Streptomycin: An Aminoglycoside Antibiotic Dilemma","link":"https://www.preprints.org/manuscript/202406.0362/v1","date":1717753648000,"content":"Concurrent Optical and Magnetic Stimulation (COMS) combines extremely low frequency electromagnetic and light stimulation modalities for enhanced wound healing. In this report, we investigated the potential mechanistic synergism between magnetic and light components by comparing their individual and combined cellular responses. Although each individual stimulation mode was capable of stimulating cell proliferation, magnetic fields exposure alone produced greater proliferation enhancement than light alone, yet their combined effects of were supra-additive of the individual responses. Reactive oxygen species were incrementally reduced by exposure to light, magnetics fields and their combination, where statistical significance was ultimately achieved. On the other hand, ATP production was significantly enhanced in response to magnetic exposure alone or in combination with light. These results suggest that mitochondrial respiratory efficiency was preferentially improved by the combination of the two stimuli. Protein expression related to cell proliferation was preferentially enhanced by the combinatory COMS modality as were the protein levels of the TRPC1 cation channel previously implicated as part of a calcium-mitochondrial signaling axis invoked by electromagnetic exposure and involved in proliferation. These results corroborate that light facilitates functional synergism with magnetic fields that ultimately impinge on mitochondria-dependent developmental responses. The aminoglycoside antibiotics (AGAs) have been previously shown to antagonize TRPC1-mediated magnetotransduction. Streptomycin applied during the exposure to any of the stimulation modes reduced proliferation enhancement, whereas streptomycin added after the exposure did not. Notably, the COMS modality and magnetic field exposure were capable of partially overcoming streptomycin antagonism of proliferation, whereas light alone was not. Transductional antagonism of combinatorial photon-electromagnetic effects by streptomycin thus aligns with previous studies showing that the AGAs block TRPC1-mediated magnetotransduction when applied during exposure. The prophylactic usage of the AGAs (neomycin) should be avoided during COMS therapy to maintain clinical efficacy and would be a common concern with most other electromagnetic regenerative paradigms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9a7ba8a20020c5ca0acee3574ac72cd4834382c12d774378bccc38421bc3b525","category":"Interdisciplinary"}