{"title":"$200 Puro Pro hybrid over-the-ear headphones are almost perfect","link":"https://arstechnica.com/?p=1739493","date":1614085224000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/000_Puro-unopened-box-980x735.jpg\" alt=\"\"></div>\n        <p>\n          Puro Pro comes in an attractive bamboo box with brass clasp, reminiscent of a good cigar box.                      [credit:\n                        Jim Salter                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Last December, a representative for <a href=\"https://purosound.com/\" target=\"_blank\" rel=\"noopener\">Puro Sound Labs</a> offered me a review sample of the company's flagship Bluetooth hybrid headphones. Her timing couldn't have been better—I had surgery scheduled for January 8 that would put me on the couch all day, every day, for two weeks straight with nothing to do but watch movies and television (ideally without driving my wife and kids insane).</p>\n<p>The <a href=\"https://fave.co/39PnFhP\" target=\"_blank\" rel=\"noopener\">Puro Pro</a> is an over-the-ear design, which can be connected to audio sources via Bluetooth 5.0 pairing or a simple headphone cord. It offers just about any feature you might dream up for a pair of headphones: safety volume limiting (configurable for either 85dBA or 95dBA), 30+ hour battery life, content control via buttons on the left can, active noise cancellation, and even an inline mic for phone calls.</p>\n<p>At $200, the Puro Pro costs more than I'd normally spend on a pair of headphones for watching late-night TV and flying on the occasional airplane (my two primary use cases). But after spending several hours per day with the Puro Pro for a couple of months, I would drop the cash in a heartbeat.</p></div><p><a href=\"https://arstechnica.com/?p=1739493#p3\">Read 51 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1739493&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9a7f06f143d56d96b00976e071def1b0bc9769cb98a692785908fd87bf45d047","category":"Tech"}