{"title":"35 Beneficial role of 1.3,.1.6 yeast beta glucan in pet health","link":"https://academic.oup.com/jas/article/102/Supplement_3/123/7757125?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>In recent years, 1.3, 1.6 yeast beta-glucans (BG) have gained increasing attention for their diverse health-promoting properties in both humans and animals. Yeast beta-glucans are polysaccharides known for their immunomodulatory effects, which have been extensively studied in various animal models. Especially when they are coming from yeasts, these polysaccharides exhibit the ability to train the innate immune system in particular monocytes and macrophages, enhancing phagocytosis, cytokine production, and overall immune response. A number of studies have already shown that 1.3, 1.6 yeast beta glucans can address several pet health specific concerns, such as periodontal disease, atopy, osteoarthritis, diabetes. At Phileo, we conducted a trial where canine monocytes and macrophages were trained with a proprietary 1.3, 1.6 yeast beta glucan to identify whether those canine phagocytes could benefit from the training by 1.3, 1.6 yeast BG. Our results show that canine phagocytes cultured in presence of 1.3, 1.6 yeast BG display a greater cytokines production of tumor necrosis factor (TNF)α and interleukin (IL)-12. Those data are really encouraging as IL12 is essential to initiate T cell responses against pathogens. These benefits against pathogens have shown reduced incidences of infections, subsequently reducing the reliance on antibiotics and enhancing sustainability. Several examples will be given on species close to dogs. Taking these results all together, the inclusion of 1.3, 1.6 yeast BG in pet diets or supplements offer a promising avenue for enhancing their health. Their multifaceted benefits, including immunomodulation or inflammatory control, make them valuable purified actives in the pet care industry.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9a825fc5221bb4258f34f87c370f26168b9eddcade53ff94306792391ed6a744","category":"Environment"}