{"title":"Forget the Vuelta a Espana three peat, Primoz Roglic needs a Tour de France for true greatness","link":"https://www.cyclist.co.uk/in-depth/10056/forget-the-vuelta-a-espana-three-peat-primoz-roglic-needs-a-tour-de-france-for-true","date":1630935896000,"content":"<span>\n      <span><a href=\"/authors/joe-robinson\">Joe Robinson</a></span>\n  </span><div>  \n  <div>      <div><span>6 Sep 2021</span></div>    </div></div><p>\nThat elusive Tour de France title is needed if Roglic plans to be remembered as one of the greats</p>\n<div>\n      <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/09/cauldphoto-vuelta-stage21-5785.jpg?itok=n6sKVveN\" />  </div>\n<div>\n      <p> <strong>That elusive Tour de France title is needed if Primož Roglič plans to be remembered as one of the greats</strong></p>\n<p><strong>Words:</strong> Joe Robinson <strong>Photography:</strong> Chris Auld</p>\n<p>‘Did you know Primož Roglič used to be a ski jumper?’ Comfortably the most tired cliché in professional cycling over the past few years. Easily eclipsing fellow favourites such as ‘Andre Greipel climbs well for a big man’ and ‘Geraint Thomas has crashed’.</p>\n<p>Such is the constant reminder of the <a href=\"https://www.cyclist.co.uk/tags/jumbo-visma\">Jumbo-Visma</a> man’s winter sports past, he has even got in on the joke, incorporating a ski jump landing into his victory celebration. Not quite Alberto Contador’s smoking pistols but we sure have seen it an awful lot over the past few years, haven’t we?</p>\n<p>But, honestly, did you know that Roglič was a ski jumper until the age of 21? Because it really never gets any less insane. Ten years ago, Roglič was flying off the end of ski jumps all across Europe. Now he is flying up mountains, dominating an entirely different sport. In 2011, Roglič had cycled less than 3,000km in his entire life. Since the 14th August, he has ticked off 3,417km in what was, let’s be honest, a 21-day victory lap of Spain and his third consecutive <a href=\"https://www.cyclist.co.uk/tags/vuelta-a-espana\" target=\"_blank\">Vuelta a España </a> title.</p>\n<p>From victory on the opening day’s time-trial in Burgos, Roglič was in complete control of this year’s race. Four stage wins, four further second-place stage finishes, 11 days in the red jersey are impressive but the manner in which he won the race is what really had us amazed. At no point did the 31-year-old look out of control. Not once did you ever doubt Roglič's asphyxiating grip on the race. Whenever a rival attacked, he was there, glued to their wheel. And then, when the time was right, he would simply ride off on his own. It was remarkable.</p>\n<p>On paper, this should have been his toughest Vuelta so far. <a href=\"https://www.cyclist.co.uk/tags/team-ineos\">Ineos Grenadiers</a> had Egan Bernal and Adam Yates, Movistar had Enric Mas and Miguel Ángel López, Bahrain Victorious with Mikel Landa, Jack Haig, Gino Mäder. In reality, it turned out to be his most comfortable victory of the three.</p>\n<div>\n<div>    <img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/09/cauldphoto-vuelta-stage21-5121.jpg\" />  </div>\n</div>\n<p>This latest victory at a stage race continues what has effectively been a four-season long domination of the discipline. Since taking the overall victory at Itzulia Basque Country in 2018, Roglič has completed 16 stage races. He has won 11 of them. His record in the last six Grand Tours he has raced goes as follows: 4th, 3rd, 1st, 2nd, 1st, 1st. This is consistency of Merckxian proportions.</p>\n<p>Roglič is the best stage racer in the world right now and there is a strong argument for the Slovenian being the best cyclist in the world, period. Roglič's third consecutive Vuelta is also a feat that is as rare as an FSA groupset.</p>\n<p>Only nine riders have ever won Grand Tours in three consecutive seasons. Only two have taken the Vuelta three-peat - Tony Rominger and Robero Heras. This should be lauded as one of cycling’s great achievements, legacy-guaranteeing from the best stage racer of his era.</p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/in-depth/10055/gallery-champoussin-shock-on-eventful-final-2021-vuelta-road-stage\">Gallery: Champoussin shock on eventful final 2021 Vuelta road stage</a></div>      <div><a href=\"/in-depth/9995/gallery-fabio-jakobsen-the-comeback-kid\">Gallery: Fabio Jakobsen, the Comeback Kid</a></div>      <div><a href=\"/news/8967/fabio-jakobsen-back-riding-his-bike-after-horror-crash\">Fabio Jakobsen back riding his bike after horror crash</a></div>      <div><a href=\"/in-depth/5922/new-kid-in-town-fabio-jakobsen-is-ready-to-join-the-sprinting-elite\">New kid in town: Fabio Jakobsen is ready to join the sprinting elite</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 118: on sale now!</a></div>    </div></div><p>\nBut there is an issue. In our sport of cycling, not all races are equal. Both are Monuments but we would be lying to say a Liège–Bastogne–Liège win was held in the same regard as a <a href=\"https://www.cyclist.co.uk/tags/paris-roubaix\">Paris-Roubaix</a> victory. And while impressive, winning the Vuelta a España is no <a href=\"https://www.cyclist.co.uk/tags/tour-de-france\">Tour de France</a>. In fact, not even three consecutive Vueltas are one Tour.</p>\n<p>It's harsh but true. That is not to say three weeks of racing around Spain is a walk in the park. It’s stiflingly hot, it comes at the end of a long season, the mountains that regularly feature are so difficult they border on workplace bullying. Speak to those that have raced both and plenty will even tell you the Vuelta outdoes the Tour on the toughness scale. But red just isn’t yellow.</p>\n<p>Aitor González, Chris Horner and Fabio Aru are just not Andy Schleck, Cadel Evans or Geraint Thomas. Alex Zülle's two Vuelta titles do not trump Bradley Wiggins’s one Tour win. And Roglič's Vuelta hattrick does not hit the way standing on the Champs-Élysées dressed in yellow does.</p>\n<p>The journey of turning from ski jumper to cyclist in his 20s to becoming a WorldTour pro in less than five years to becoming a triple Grand Tour winner in ten should be regarded as one of the sport’s great stories. But retire tomorrow and Roglič's successes will soon become a footnote in the sport rather than its own chapter.</p>\n<p>In fact, retire tomorrow and there will be those who remember Roglič solely for one of the very few failures he has endured in cycling, ironically at the Tour in 2020 when he went from nailed-on champion to meme in 36.2kms from Lure to La Planche des Belles Filles. For Roglič to enter the annals of cycling history, he needs to win that yellow. To sit alongside Evans, Schleck, Wiggins and, most prevalently, his compatriot Tadej Pogačar, victory at the Tour is a must have, not a nice to have.</p>\n<p>Win that Tour and we all claim to be looking at one of the all-time greats. Don’t and Roglič remains the man who was once a ski-jumper, didn’t you know? </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"jrobinson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"9a8f2a0fdf0cacf7a0e49221fea033e387d61f9bfea466c12b5e25265b41f015","category":"Cycling"}