{"title":"Trans-Atlantic genomic differentiation and parallel environmental and allelic variation in Lumpfish (Cyclopterus lumpus)","link":"https://academic.oup.com/icesjms/article/81/6/1025/7664061?rss=1","date":1714694400000,"content":"<span><div>Abstract</div>In marine species with large populations and high dispersal potential, large-scale genetic differences and clinal trends in allele frequency can provide insight into the evolutionary processes that shape diversity. Lumpfish, <span>Cyclopterus lumpus</span>, is found throughout the North Atlantic and has traditionally been harvested for roe and more recently used as a cleaner fish in salmon aquaculture. We used a 70 K SNP array to evaluate trans-Atlantic differentiation, genetic structuring, and clinal variation across the North Atlantic. Basin-scale structuring between the Northeast and Northwest Atlantic was significant, with enrichment for loci associated with developmental/mitochondrial function. We identified a putative structural variant on chromosome 2, likely contributing to differentiation between Northeast and Northwest Atlantic Lumpfish, and consistent with post-glacial trans-Atlantic secondary contact. Redundancy analysis identified climate associations both in the Northeast (<span>N</span> = 1269 loci) and Northwest (<span>N</span> = 1637 loci), with 103 shared loci between them. Clinal patterns in allele frequencies were observed in some loci (15%—Northwest and 5%—Northeast) of which 708 loci were shared and involved with growth, developmental processes, and locomotion. The combined evidence of trans-Atlantic differentiation, environmental associations, and clinal loci, suggests that both regional and large-scale potentially-adaptive population structuring is present across the North Atlantic.</span>","author":"","siteTitle":"ICES Journal of Marine Science Current Issue","siteHash":"54f8cca1acc450a23f886e7003c55f387c2b0793320a665b1e27fbbf191461e5","entryHash":"9aa8502956e8a3c5321d964c7bcd219b3bdc829f8a0a3ffdccf8958c052e4181","category":"Environment"}