{"title":"Japanese lander appears to fail just before touchdown on the Moon [Updated]","link":"https://arstechnica.com/?p=1933838","date":1682442627000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/hakuto-1-800x423.jpg\" alt=\"A photo of the Moon taken by the ispace lander's on-board camera from an altitude of about 100 km above the lunar surface. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/hakuto-1-scaled.jpg\">Enlarge</a> <span>/</span> A photo of the Moon taken by the ispace lander's on-board camera from an altitude of about 100 km above the lunar surface.  (credit: ispace)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p><strong>Update, April 25 at 1:15 pm ET</strong>: The Japanese company ispace maintained communication with its Hakuto-R spacecraft until the final moments before was supposed to land on the Moon, the company's founder, Takeshi Hakamada, said Tuesday. His comments came about 25 minutes after the company's lander was due to make a soft touchdown on the lunar surface. Then, they lost contact. As a result, it is highly likely the lander crashed into the Moon.</p>\n<p>\"We have to assume that we did not complete the landing on the lunar surface,\" Hakamada said on the company's webcast, his voice filled with emotion. \"We will keep going, never quit in our quest.\"</p>\n<p>The company's engineers will continue assessing data from the spacecraft during its descent on Tuesday. They will use that knowledge, Hakamada said, to improve future versions of the company's lander. With this apparent failure, ispace's lander becomes the second privately funded effort attempting to make a soft landing on the Moon that has failed. The Israeli Beresheet spacecraft crashed into the Moon in 2019 after a main engine failure.</p></div><p><a href=\"https://arstechnica.com/?p=1933838#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1933838&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9aa81eed825c9a43a0a2f535928402843ca9244e71dcb4ee9ab82d741700269c","category":"Tech"}