{"title":"Apple Limiting Alternative App Stores and Payments to EU Due to Malware, Fraud and Scam Risks","link":"https://www.macrumors.com/2024/01/25/alternative-app-store-eu-risks/","date":1706212365000,"content":"In <a href=\"https://developer.apple.com/support/dma-and-apps-in-the-eu/\">developer documentation</a> outlining systemwide changes to the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> in the European Union, Apple explains why alternative app stores, alternative payment options, and other updates are being limited to the EU.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2020/07/iPhone-Security-Feature-1.jpg\" width=\"2844\" height=\"1600\" />\r<br />\nApple claims that these changes are introducing notable risks for users and developers, introducing \"new avenues for malware, fraud and scams, illicit and harmful content, and other privacy and security threats.\"\r<br />\n\r<br />\nFurther, Apple says that the updates compromise its ability to \"detect, prevent, and take action\" against malicious apps, and also to support users impacted by issues with apps that are downloaded outside of the ‌App Store‌.\r<br />\n\r<br />\n\"We're limiting these changes to the European Union because we're concerned about their impacts on the privacy and security of our users' experience - which remains our North Star,\" Apple writes.\r<br />\n\r<br />\nTo limit risk, Apple is requiring alternative app stores to undergo a notarization process that will check for malware and viruses, but Apple will not evaluate an app's content. Though notarization will add safeguards, Apple says there is risk involved with the alternate app store system.\r<br />\n<blockquote>If not properly managed, alternative distribution poses increased privacy, safety, and security risks for users and developers. This includes risks from installing software from unknown developers that are not subject to the Apple Developer Program requirements, installing software that compromises system integrity with malware or other malicious code, the distribution of pirated software, exposure to illicit, objectionable, and harmful content due to lower content and moderation standards, and increased risks of scams, fraud, and abuse. Apple has less ability to address these risks, and to support and refund customers regarding these issues. Even with safeguards, many of these risks remain.</blockquote>\r<br />\nGoing forward, Apple plans to engage with the European Union, developer community, and EU users about the impacts of alternative app stores.\r<br />\n\r<br />\nOutside of the EU, app developers must continue to use the ‌App Store‌ and in-app purchase system as usual.<br />This article, \"<a href=\"https://www.macrumors.com/2024/01/25/alternative-app-store-eu-risks/\">Apple Limiting Alternative App Stores and Payments to EU Due to Malware, Fraud and Scam Risks</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-limiting-alternative-app-stores-and-payments-to-eu-due-to-malware-fraud-and-scam-risks.2417436/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9aab3df8645ce5510ddaac0769a0fd79c68ba49d7540b5611b43806c62069c63","category":"Apple"}