{"title":"Google Photos is so 2020—welcome to the world of self-hosted photo management","link":"https://arstechnica.com/?p=1774386","date":1624446940000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/05/30-980x549.jpg\" /></div>\n        <p>\n          Say hello to Google's new pricing tiers for Google Photos.                  </p>\n        </div>\n      </li>\n      </ul><p>We take more photos now than ever before. Growth in this already astronomical segment is explosive, with over 1.4 trillion photos taken last year, according to InfoTrends. That's up from 1 trillion in 2017. Video is much the same, with YouTube <a href=\"https://www.cnbc.com/2018/03/14/with-over-1-billion-users-heres-how-youtube-is-keeping-pace-with-change.html\">saying in recent years</a> that about 500 hours of video is uploaded to the platform <em>every minute</em>.</p>\n<p>Finding a solution to organizing and safely storing these precious memories is more important than ever, and it's becoming an increasingly large problem to solve. Photos depict a special moment in time, a memory or event that can't be recreated. They are irreplaceable and largely only exist digitally. Because of this, there are few categories of data that suit a free and open self-hosted solution better.</p>\n<p>Purists will argue that your photos are yours and you should own them forever, no matter what, in full resolution. Pragmatists will argue that so long as the export tools are good enough, purity doesn't matter. For many day-to-day photo service users, though, that was all an academic thought experiment—most people use Google Photos. The service <a href=\"https://www.theverge.com/2019/7/24/20708328/google-photos-users-gallery-go-1-billion\">passed a billion users</a> two years ago. (Exporting on Google Photos, by the way, means using <a href=\"https://takeout.google.com\">Google Takeout</a>. I've been waiting for my requested data for seven days as of this writing.) </p></div><p><a href=\"https://arstechnica.com/?p=1774386#p3\">Read 88 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1774386&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9aae6ac9b3ad19eca2ff429af6f663620dda1ab8d72e435007afce428f89db6d","category":"Tech"}