{"title":"Can anyone beat Jonas Vingegaard at Tirreno-Adriatico?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/will-anyone-be-able-to-beat-jonas-vingegaard-at-tirreno-adriatico","date":1709469000000,"content":"\n      \n<p><span>There can be no doubt that Jonas Vingegaard is the hot favourite to win <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tirreno-adriatico\">Tirreno-Adriatico</a>, which begins in Tuscany on Monday next week. Not only did he solidify his status as the world’s best Grand Tour rider in 2023, handing out a crushing defeat to Tadej Pogačar and the rest at the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a>, he also discovered a new-found prolificness in stage races in general, winning four of the six he entered. And he’s begun this year in much the same way, repeating the exact same start to his 2023 season by overcoming bad weather to win three successive stage wins and overall victory at O Gran Camiño. With this pedigree, form, and the absence of Pogačar, Primož Roglič and Remco Evenepoel, it’s difficult to see how he can be stopped.</span></p>\n<div></div>\n<div></div>\n<p><span>Tirreno-Adriatico is also one of the biggest on the calendar outside of the Grand Tours, and will therefore be one that Vingegaard is eager to add to his palmarès. Its parcours has a bit of everything, with a small uphill finish at Valle Castellana, a big one at Monte Petrano, and an individual time trial to shape the GC, plus a handful of sprint and punchy stages in between. A look at the list of past winners reveals just how high a calibre a rider usually triumphs here, from two victories each for Slovenian superstars Pogačar and Roglič, and other Grand Tour heavyweights before them such as Nairo Quintana, Vincenzo Nibali and Alberto Contador. And even more significantly, victory here in those recent editions has been the start of very successful seasons; Roglič’s two wins in 2019 and 2023 were followed by Grand Tour triumphs at the <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> and <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a>, while Pogačar’s successive victories here in 2021 and 2022 preceded two of his history-making seasons. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2037536093.jpg?v=1709288908\" /></span><em>Jonas Vingegaard at the 2024 O Gran Camiño (Getty Images) </em></p>\n<p><span>Yet Tirreno-Adriatico can also provide a chance for fledgling stage race riders to hone their skills and show what they can do — as himself knows. At the 2022 edition, the Dane finished second-place behind Pogačar, the best-of-the-rest in a strong field that also included Evenepoel, Mikel Landa and Richie Porte. With a deficit of 1-52 to the winning Slovenian, it was a distant second-place for sure, much as it was at the Tour de France the year before, where Vingegaard tended to be the first rider after Pogačar to reach the top of mountains, or, in the best case scenario, the only rider capable of clinging onto his wheel. But it did prove that that runner-up finish at the Tour was no fluke, and that Vingegaard was the real deal. Four months later, he made another leap and defeated Pogačar to win the Tour de France, a result that flipped the balance of power between the two, that has remained ever since. </span></p>\n<p><span>Can any rider going against Vingegaard at this year’s Tirreno-Adriatico use the race as a similar springboard for future success? Intriguingly, some of the most exciting emerging talents are set to ride. Chief among them is Juan Ayuso, who, in the absence of Pogačar, is poised to have a leadership role. The 21-year-old Spaniard is already widely-recognised as being one of the most rawly talented riders in the peloton, with no apparent weakness in his repertoire that includes first-class climbing, time trialling that has already seen him take multiple wins at WorldTour level, plus a quick sprint finish, and two top Grand Tour finishes under his belt with third and fourth at the last two respective Vueltas. Ahead of his expected Tour de France debut this year, this could be the moment he makes another leap and proves himself capable of challenging the best stage racer in the world.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography-05515.jpg?v=1709289043\" /></span><em>Tom Pidock during last year's Tirreno-Adriactiro (SWPix.com)</em></p>\n<p><span>Another well-known major young talent is Tom Pidcock (Ineos Grenadiers), for whom Tirreno-Adriatico will be the first WorldTour stage race in a season in which he wants to prioritise riding for GC more than in the past. Though the Brit has shown glimpses of how well he can climb (most notably at the 2022 Tour de France, where he memorably won atop Alpe d’Huez), most of the success of his road career so far has been in the Classics. Sixth place overall at the recent Volta ao Algarve was a solid start, and if he is indeed specialising more on stage racing, it’s plausible we’ll see him raise his level and take on Vingegaard next week.</span></p>\n<p><span>Might Vingegaard’s main challenger come from within his own team? Visma-Lease Bike's new signing Cian Uijtdebroeks is set to be his lieutenant at Tirreno-Adriatico, having already successfully played that role at O Gran Camiño, where he himself finished fifth overall while helping Vingegaard seal overall victory. Visma signed the Belgian (who turned 21-years-old on Wednesday) with an eye on the future, after a breakthrough 2023 season culminated in him making the top ten of the Vuelta on Grand Tour debut, but there’s no telling how rapidly he might develop. Remembering how Vingegaard himself usurped the senior Roglič a few years ago at the top of Visma’s GC hierarchy, another generational shift is not impossible. </span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-2032289548.jpg?v=1709289211\" /></span><em>Cian Uijtdebroeks during the time trial stage of O Gran Camiño (Getty Images)</em></p>\n<p><span>As well as these young prospects, there will be plenty of older, more accomplished contenders who could compete with Vingegaard if they can find their very best legs. Adam Yates wasn’t too far from his level throughout the 2023 season, and, based on his overall victory at the Tour of Oman a few weeks ago, could have the form to give Vingegaard a real headache, teaming up with his UAE Team Emirates teammate Ayuso — although the crash and concussion that forced him to abandon the UAE Tour puts that into doubt. His twin, Simon Yates (Jayco-Alula), has also made a promising start to the season with overall victory at the Saudi Tour, and does tend to excel in week-long stage races like this. He won the 2020 edition of Tirreno-Adriatico; while Dani Martínez (Bora-Hansgrohe) caused a stir by beating Evenepoel not once but twice on uphill finishes at the Volta ao Algarve (albeit missing out on the GC to him), and has history of surprising the most fancied stage races from both the 2020 Critérium du Dauphiné and 2022 Itzulia Basque Country, on both occasions overthrowing Roglič to win the GC.</span></p>\n<p><span>There will also be a trio of former Grand Tour winners at Tirreno-Adriatico, all of whom have very high ceilings if circumstances align. Richard Carapaz looked more like his previous self at the Tour of Colombia following a compromised first season riding for new team EF Education-EasyPost, and has a history of making even the top GC riders uncomfortable; 2022 Giro winner Jai Hindley is always a force to reckoned with at his best, though the signs at the Volta a la Comunitat Valenciana suggest he might not be there yet; and 2024 is a new start for 2020 Giro winner Tao Geoghegan Hart as he spearheads new team Lidl-Trek, hoping to recapture the form that saw him place third overall here last year. If even one of these riders can find their best form, both for the Tirreno-Adriatico and the rest of the season, then things might not be quite so straightforward for Jonas Vingegaard after all.</span></p>\n<p><em>Cover image by Getty Images</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9abfebc4c622ec9750e89d4bf6e45151588da587f6479a3b8fd0c85eedbec8b9","category":"Cycling"}