{"title":"From the Top: Building Cervélo","link":"https://cyclingtips.com/2021/12/from-the-top-building-cervelo/","date":1638317837000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/cervelo_Hero1600x900-1-650x366.jpg\" /></div><h2>From the Top: Building Cervélo</h2><p>\n</p><p>I would argue that Cervélo is one of the most innovative bike brands in the cycling industry. Back in the 1990s when they first started, almost everyone else was focusing on lightweight bikes. Cervélo, meanwhile, was busy pioneering bicycle aerodynamics. I’ve ask engineers at various bike companies which brand impresses them most with regards to engineering and innovation, and overwhelmingly I hear them say Cervélo.</p>\n\n\n\n<p>The genesis of Cervélo started in 1995 when two young engineering students named Phil White and Gerard Vroomen met in the composites lab at McGill University in Canada. Over a span of 15 years they went from building a crazy aerodynamic time trial bike as a university project to creating one of the most disruptive and loved bike brands in the world. </p>\n\n\n\n<p>But what many people don’t know is that as wildly successful Cervélo was up until 2011, it was a pressure cooker of constant financial challenges which ultimately led Cervélo towards insolvency. That ultimately led to Gerard and Phil selling the business to Dutch holding company, PON. 2008-2011 had been the perfect storm for Cervélo with the global financial crisis, setting up a professional team that was far more successful than anticipated, and an unscrupulous lender which led to the company’s troubles.</p>\n\n\n\n\n\n\n\n<p><em>Thank you to Malcolm Bloedel for producing this episode and Ashley de Neef for composing the music. </em></p>\n\n\n\n<p><strong><img src=\"https://cyclingtips.com/wp-content/uploads/2020/12/c74257e0-deda-49fc-b2ea-551819ac9483.gif\" />     SUBSCRIBE TO THE ‘FROM THE TOP’ PODCAST</strong><br />Never miss an episode. Subscribe to our new ‘From the Top’ podcast on <strong><a href=\"https://podcasts.apple.com/podcast/from-the-top/id1503581934\">iTunes</a>, <a href=\"https://open.spotify.com/show/1jA29mWjW6Lb1Y9eiz6G5q\">Spotify</a>,  <a href=\"https://play.google.com/music/m/Iikwqfil36mmyxssdhqfx4rrxtm?t=From_The_Top\">Google Play</a></strong> or wherever you get your podcasts.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/12/from-the-top-building-cervelo/\">Read More</a>","author":"Wade Wallace","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9ac3dbb752939c8c2cc78f3863ebcf078d60cc74f60369117618335eb976a668","category":"Cycling"}