{"title":"Trade-off recycling the organic wastes generated in tomatoes production under greenhouses with soilless agricultural technology in Turkey","link":"http://link.springer.com/10.1007/s13762-023-05417-3","date":1714521600000,"content":"<h3>Abstract</h3>\n                    <p>There has been an enormous information gap on product loss and waste management in the context of sustainable agricultural development. Therefore, this study aimed to explore the feasibility of alternative methods of recycling plant wastes generated in tomato production and to calculate the social cost of using inappropriate agricultural waste management methods in tomato production under greenhouses in Turkey. The research data were collected using questionnaires from 97 greenhouse farms growing tomatoes with soilless agriculture technology in Turkey. The feasibility of switching to the best recycling method was explored using partial budget analysis. According to the research results, on average, the amount of tomato plant waste generated in greenhouse farms was 1753 tons. 71% of vegetable waste was disposed of, while that of reused and recycled was 28% and 1%, respectively. The research also showed that farms that recycled their plant wastes would gain extra return by USD $ 5571 per year if the greenhouse farms switched to farm-level composting. The social cost of disposing of tomato plant wastes was USD $ 356,659 per year and USD $ 593 per hectare in Turkey. The study suggests designing a waste monitoring system via collaboration of state-private sector-NGO-university and putting it into practice to increase waste management efficiency. Checking the prevailing policy and policy instruments and establishing financial and technical infrastructure for recycling waste may be beneficial.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"9ac497fddf0dce84175a0b05205c7f3145f8212727e944b3afbe6d2d1049dd8c","category":"Environment"}