{"title":"No Word for Stranger: the Migration Gravel Race – Fail 4 – Ryan Le Garrec","link":"https://theradavist.com/2021/07/no-word-for-stranger-the-migration-gravel-race-fail-4/?utm_source=rss&utm_medium=rss&utm_campaign=no-word-for-stranger-the-migration-gravel-race-fail-4","date":1626955208000,"content":"<p>“Expect the Unexpected”</p>\n<p>The MGR is a 650 km gravel route, 4 stages, about 8000 meters of elevation,<br />\nsome like to call it a disguised mountain bike race with a bit of gravel,<br />\nsome will argue that this is the spirit of gravel, a limitless exploration of where the bike can take you.<span></span></p>\n<div></div>\n<p> </p>\n<p>It is called “Migration” because it happens during the herd migration in Kenya, more precisely in the Maasai Mara.<br />\n“We move with the animals, they move with the rain.” explains the Massaï guide and conservationist Duncan.<br />\nDuncan’s job is to create bridges between worlds, the animals and the humans, the old and the new. In the past, things were perhaps easier, there were no borders to the Massaï lands, no barriers, they could go where they pleased or more accurately where their cows pleased. They lived in harmony with all the animals.</p>\n<p>“Except the buffalo, the buffalo is stupid, he charges. all the time, no matter what, no matter why he’s stupid and charges all the time!”</p>\n<p>They share the land “because it is just healthier”, cows can graze where they want. The idea of property is a total nonsense to them, how could anyone own the land, the land owns you, period. Now Duncan’s job is to juggle with all the nonsense, the barriers, the animals not able to migrate as they please but also the old traditions, killing a lion as a rite of passage to adulthood is not legal anymore, it might still be happening in some tribes, I’ve heard.</p>\n<p>“We have to protect all animals, not only ours, so I make sure that during migrations, everything goes as smooth as possible.” Ironically Duncan has to protect lions now, “I make sure that the herds can avoid barriers, I make sure that people don’t have to retaliate against predators too.”</p>\n<p>And I wonder to myself, how do you convince an elephant to make a left turn!?</p>\n<p>Mikel Delagrange, founder, and co-organizer of the race:</p>\n<p>“The MGR is one of a number of initiatives arising out of the <a href=\"https://www.instagram.com/teamamani/\" target=\"_blank\">Amani Project</a>. The aim of the Amani Project is, simply put, to help create racing opportunities for cyclists from East Africa. With the MGR, we thought we’d turn the tables on the traditional model of sending a select few (East African riders) to a pressure-packed European race environment and instead have them enjoy home-field advantage for once and invite the best from the West over to race in Kenya. This has the knock-on effect of exposing far greater numbers of riders from the region to the benefits of stronger, international competition. Through consultations with our various partners/teams in the region, we’ve come to understand that the lack of exposure to the best in cycling is one of the key factors holding the East African riders back from progressing to the professional ranks. Imagine if you only had your mates to compare yourself against – you’d be forgiven for thinking that you were pretty good. It’s like that.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-2-DUNCAN-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Duncan is an elder.</p>\n<p>He doesn’t talk that much but says a lot.</p>\n<p>Duncan has this look that makes you think: “He knows something that I don’t…”</p>\n<p>“You know the five great? There is the elephant, the hippo, the lion, the rhino, and the cheetah, we like to think we are the 6th.” says another Maasai youngster.</p>\n<p>We only had a glimpse of the Maasai culture during this race, they were there to protect us. Ironically, they protected the very animal that menaces their culture the most, the white man. The modern world is pushing the young generations to put barriers in the Wild, and in so doing disturbing the migration process, compromising the harmony they always lived in with the Wild. Duncan knows that in order to protect your own, you need to protect others.</p>\n<p>“There was a lion yesterday not far from camp.”</p>\n<p>“What do you mean, not far?” I ask with a gulp.</p>\n<p>“About 500 meters.”</p>\n<p>That is not far and yet that feels too far to even know that the lion was there both scary and reassuring news.</p>\n<p>Ian Boswell: “The hardest thing for me was probably Stage 1 because it was so early in the race and I had a puncture cause the course was so… and of course I didn’t realize what this course was gonna be so the first day was really the toughest, just accepting what we were racing across… This race was completely different from anything I’ve ever done. But in hindsight, a gravel bike is able to ride all these surfaces, it’s just a mindset, being able to accept the conditions and not try to fight it cause that’s when you start to have a miserable time, you are mentally like: ‘this isn’t a gravel race’ but it is, it’s just different than what you are used to, what everyone else is used to coming from the US or from Europe.”</p>\n<p>Personally, I accept sleeping surrounded by hyenas as long as Duncan and co. are around.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-6-RIDERS-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>On day 1, after about half an hour, I passed Ian Boswell fixing a flat on the side of the road.</p>\n<p>“Race is gone but well, I can enjoy now! No better place to fix a flat eh?” He says before getting back on his bike. Ian doesn’t look as fast as he looks smooth and that’s what surprises me the most, he rides those rocks like a carpet and disappears away in the blink of an eye.</p>\n<p>Ian, like the rest of us, is thrown into this race with no expectation or the smallest idea of what’s about to come, the hard parts on paper are not the hardest parts, in reality, the headwind that drags for 60 km is nothing compared to the bumpiness of the track working in tandem to slow you down and make you feel miserable.</p>\n<p>So when a world tour rider, Unbound winner, says the race is rather tough, you can imagine what I have to say about the race, it is bloody hard, that’s what it is, but it is gloriously gorgeous too.</p>\n<p>Everything comes at a price, money is the cheapest way to get the lowest kind of experience, blood, sweat and tears, flat tires and broken souls, that’s the price here I guess and it is still a bargain.</p>\n<p>The landscapes roll out under fast-moving herds, there are a few trees, majestic trees, but their shadow is kept away from us. We all get into the inferno of what was described as a 50 km section of Paris Roubaix on rocks. Imagine each cobble has a faceted side as sharp as a blade. You are not far from the truth. 15 punctures or so, in less than 5 km into the race, even the best riders end up still for a while.</p>\n<p><em>Me being too slow to get a flat, I can see all the rocks in detail, give them names, and wave goodbye.</em></p>\n<p>I keep my tires safe the whole first half of the day, it costs me no puncture on the rear or front but a big one in my ego, it’s leaking all over the route, being last on the course, I collect dead bodies as I go, the only people I pass are scratching, I have only one intention, no flat, no crash and reach camp on my bike, I leave my ego on the track and accept that with no prior experience at all in gravel and a very questionable tarmac fitness, well if I get to ride my bike all day, that is already a token!</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-5-THE-22ROAD22-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Samuel Kagiri: “I think it is a big privilege for African riders like me to ride in such races. Because we are able to race with the ‘big boys’ and have that exposure we need especially as young riders. We get to hear some advice from pro riders who went into world tours. On day 2, I broke my rear hanger which forced me to ride single speed, it was a bit challenging cause the course started to get really hilly after 160 km, that’s when I told myself: I have fought all the way to here, I can’t quit 15 km from the line, I have to fight until the end, I’ll look for a solution but only for tomorrow. Now I must fight.”</p>\n<p>Ian Boswell: “I think what I’ve learned is that bicycles and humans are much more resilient than we think… We shouldn’t complain as much as we do about the road or the terrain, or the adversity we face, seeing some of the African riders and what they did just to be able to finish is inspiring, coming from a pro background you want everything to be perfect you know, the bike should be able to shift and brake, everything should be working perfectly, you complain if it’s not, these guys don’t complain, they just get off and keep riding, it’s very inspiring to see.”</p>\n<p>Day 2 and nothing ever seems to get easier, the Queen stage, they call it. Well, the queen is mean, she starts at 1800 meters and fast enough takes you near 3000. The air is not that rare, there are schools at the top, kids run with ease, they are Kenyan after all. I feel so extremely white dragging my sorry bum up there, I think am paler than ever. Then the altitude empales me and spits me back down. The long descent to the Safari-like plains of Out Of Africa is less technical and a little more fun, I make friends with the race for a second there.</p>\n<p>Sharif Hassan is a rider from Atlanta, he’s just passing by on his way to Egypt for a long bikepacking down the Nile. Sharif is a wise man, he talks a lot with the Maasai, he takes advantage of the opportunity to discover that tribal culture: “Bro, you know, there is no word for <em>stranger</em> in the Maasai language.”</p>\n<p>No word for <em>stranger</em> resonates in me like the extract of a poem, no word for <em>stranger</em>…</p>\n<p>“Deep brother,” I say with my not enough oxygenated brain that barely grasps the concept of what just hit it!<br />\nIt stays with me though, no word for <em>stranger</em>, what a wise absence of a word in the Maasai language. The Inuit people have fifty words for snow, the Maasai have none for “<em>stranger</em>”.</p>\n<p>Funny enough, prior to this, Sharif and I didn’t know each other at all, strangers, but he takes long pulls in the headwind for Cate and me on day 1. Cate is suffering, she walked on a thorn at camp during the night and now she can barely walk, yet she is still riding. Every half hour Sharif has to stop and find a bush to deliver himself from what seemed to be food poisoning of some sort “I think it was the milk in that black tea, I’d stay away from it if I was you.”</p>\n<p>20 km before the line, I slowed down and let them go ahead. I took a pull a bit too long for me! At the line that day, Sharif is waiting for me with a beer and a smoke, brother move, no word for <em>stranger</em>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-3-SHARIF-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Mikel: “I admire the Massai, but not with rose-tinted lenses, I admire the worts as well. Out of the 53 tribes in Kenya, the Maasai have been the most stubborn in retaining their cultural heritage and practices. In return for their non-conformity,  they have seen their culture appropriated and fetishized. Thus, I think it’s important to tread lightly when we talk about the Massai and their culture since as outsiders, we are likely to have only gleaned a superficial understanding of both (if we are lucky). With that said, the Massai that owns the land where the MGR takes place are essential partners.”</p>\n<p>“We as cyclists are late to the game of environmental stewardship. We, who like to ride off-road, have taken undeveloped, pristine land for granted. I’d say the time for complacency on that front is well and truly over. With the MGR, we hope to show the Maasai the economic value of undeveloped land. The Maasai are under a great amount of pressure from predatory agents as well as the modern world to settle, put up a picket fence, and parcel off the land that they’ve historically maintained through semi-nomadic stewardship.”</p>\n<p>“Some of the younger generations are succumbing to these pressures and putting up fences directly in the traditional migratory paths of millions of wild animals. And they can be forgiven for doing so. They need to put bread on the table and feed their families just like the rest of us. Thus, without overstating the importance of a four-day race, it’s important that the cycling industry stops taking these unspoiled vistas for granted and starts creating real economic incentives for the true owners of the land to keep their spaces wild and undeveloped. With the MGR, we constantly ask ourselves, is this something we can source in the Mara from the Maasai? If yes, we do it. There is still room for improvement but we hope to create a model of local partnership and mutual respect that can be emulated elsewhere.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-4-RIDE-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“The World is a beautiful place and we have the responsibility to travel and see it!”</p>\n<p>Fabian Burri once told me. My friend got it all figured out a long time ago. Maybe that has to do with his nomadic origins. I now remember that when I was sixteen my father took me to Burkina Faso. We traveled alongside an ethnology researcher, a friend of his, I got to hang out with “Grios” the African storytellers who taught me that Babylon was the invention of paper and all that comes with it, “all that comes with writing…”</p>\n<p>I didn’t fully understand, “Time is not horizontal like you westerners trace it from left to right, it is vertical and the Sun is going up and down and he’s in charge, not your watch, not your clocks, not your agenda, schedule or to-do list, the Sun.”</p>\n<p>I have barely ever worn a watch since then, and each one I got or tried to keep, interestingly enough, broke quickly.</p>\n<p>I remember how they lived in harmony too, I remember how they treated me, welcomed me, educated me without ever teaching or preaching, just showing and asking “Do you see?” yes I see this man in the dark, in this hut: “Did you see that he is blind?” No, I didn’t see that he is blind, but I saw his guitar with three strings, I saw his left hand with three fingers and I heard him play that guitar and sing the blues. “It was not the blues.” He pauses, looks at me: “It was a story.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/SHOT-7-SACRED-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The race goes on and everybody breaks at some point or breaks something. I don’t. I don’t break anything on my bike, I don’t even break mentally, but am crawling at this race and dropping more little parts of my ego all along the track.</p>\n<p>I landed back home a few days ago already, the rush of blood has turned into a misty memory, a foggy trip that doesn’t yet fully comes back to the surface, I try to write about it but honestly, I fail to tell you what it was all about, how it was and why it was necessary for all of us. Other people will tell you about a race I didn’t see cause it was far ahead. I haven’t yet been able to empty the suitcase, it’s full of memorabilia and a bit of the Kenyan dust that my lungs still hold and try to cough out every once in a while. The brain is a funny twister who chants at night inside my dreams, I can still see the giraffes looking at me surprised, I can still see that lonely elephant too: “He’s old, that’s why he is alone, they leave the herd when they’re old and can’t fight anymore, maybe because they are useless to the herd, maybe cause they are a liability to the group so they leave and roam alone, I don’t think they’re unhappy no… They have a great memory.”</p>\n<p>I guess you can’t be unhappy with a great memory, you can’t be unhappy with so many memories, we made a few in the Mara but we all failed at one thing, meeting the Maasai, we were too busy racing our bikes to really immerse ourselves in their culture, grasp a part of their heritage and inherit some of their ancestral wisdom. But we got a glimpse and a glimpse is a lot sometimes.</p>\n<p>Sharif misses his flight and because he is Sharif when others go down to Mombassa and the beach, he jumps in a car and goes right back to the Mara and the Maasai, “Man, when you meet the Maasai, you understand you’re only half the man they are! I question my manhood big time now!” I do too.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Migration-Gravel-RaceDSC05721-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Back to Kenya and that moment, the race is done in just a few hours and we are heading back in coach. You can’t really feel it yet but soon enough, you are alone in a hotel room. Back to the surface but there were no stages in that coming back. It came fast as a shark. The pressure went down a little bit too abruptly. Decompression. It’s not far as a word from depression.</p>\n<p>What makes sense now? Not much.</p>\n<p>A hot shower with no time limit, a bed with a little bit more padding. A room with fewer insects. The noise of the city as opposed to the hyena’s lullabies to put you to sleep. Where are the Maasai now as I really need protection from this wild depth of emptiness?</p>\n<p>Food poisoning is about to hit a lot of us, we are to be stuck in bed with a fever for 24 hours or so.</p>\n<p>Sleep deprivation, general tiredness makes for a low immune system that provides barely any response to a little bug. Let alone an African bug. (Maybe it’s the 7th Great!)</p>\n<p>This adds to the feeling.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Migration-Gravel-RaceDSC06718-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We’re still a few at the hotel, we sometimes gather a bit and almost count the remaining of us, it fast comes down to just a very few. I start working cause that’s what I do if I feel the bottom coming too close. I am back in the Mara, editing memories one after the other, writing feelings and sensations, remembering stories or encounters. It keeps me sane.</p>\n<p>I remember my friend Josh said: “I film races and trips just so I don’t forget too much.”</p>\n<p>The chronology gets lost in your recollection, a lot of things start to fade away but as I see them back on my little screen, the smells come back with them. The warmth of the Mara, the altitude and all the feels, the elephant and all his memories. The lone elephant, it’s me right now, but I have some stories for my son, tales of tall men dressed in red, lions and hyenas, and the Great 6.</p>\n<p>If there is one thing you can know with certainty in life, it is that life itself is ruled by uncertainty.<br />\nI went to ride my bike in the Mara. I was scared as a kite in the storm. I knew I would struggle but I didn’t know much more. What happened is I struggled but I can’t remember that anymore. The struggle is the first thing to fade away.</p>\n<p>A fire that never ceased at night, a man that slept seating and aware of their surroundings.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/07/Migration-Gravel-RaceDSC06668-scaled.jpeg?fit=1024,9999&amp;quality=75\" /></p>\n<p>That won’t fade away either, the incredible length of his legs resting on that wood log.</p>\n<p>I have images in my head that blow shivers around my skin and I can’t take it out of my mind, I can’t take him out of my mind, Duncan, he is now ready to patrol as I speak, ready to follow a wounded lion with no binoculars and as close as he can, to evaluate the exact wound by observing its tracks, the way it moves, by observing the lion close, as close as possible, so that when the vet comes, he will know what to do and that shall go faster.</p>\n<p>“Sometimes the wounded lion gets annoyed if humans come too close, you have to mind that and yet you have to identify what hurts him.”</p>\n<p>Why? Isn’t that the vet’s job?</p>\n<p>“Yes but it takes time for the vet to arrive and we save time this way.”</p>\n<p>And I think, maybe the wild does that to us, it gets annoyed at us for coming just a bit too close and it sends its poison, it’s the poison of addiction, of feeling that not much is important and nothing is sacred in the end, except the Wild. The planet talks to you every day if you care to listen. And the Wild bites you with a blessing poison that only says:</p>\n<p>“Hey, that’s where it’s at. Know that and leave, know that and go away, maybe tell your friends about it but don’t come too close, you were born so very far away, you don’t know what He knows.”</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"9ac55651bcf130f7c93cf64bd5ee178a7e6109053fb283d16586d8f7c71cf9ab","category":"Cycling"}