{"title":"Linking optical data and nitrates in the Lower Mississippi River to enable satellite‐based monitoring of nutrient reduction goals","link":"https://onlinelibrary.wiley.com/doi/10.1002/eco.2631?af=R","date":1708243200000,"content":"<h2>Abstract</h2>\n<p>Hypoxic zones and associated nitrate pollution from farms, cities and industrial facilities is driving declines in water quality that affect ecosystems, economies and human health in major rivers and coastal areas worldwide. In the Mississippi River, the United States Environmental Protection Agency set a goal of reducing nitrogen loading 20% by 2025, but estimating progress towards this goal is difficult because data from in-stream gauges and laboratory samples are too sparse. Satellites have the potential to provide sufficient data across the Mississippi River, if a key methodological challenge can be overcome. Satellites provide data from visible light, but nitrates are only observable with ultraviolet light. We address this methodological challenge by using a two-step surrogate modelling procedure to link optical data and nitrates in the Lower Mississippi River. First, we correlate in situ nitrate measurements to common water quality parameters, particularly turbidity and chlorophyll, using data from water sensors installed at Baton Rouge, Louisiana, USA, and a long-term dataset from Louisiana State University. Second, we correlate these water quality data to satellite estimates of water quality parameters. We found a correlation between these water quality parameters and nitrate concentrations, as indicated by a coefficient of determination, when the relationship was viewed in nonlinear parameter space. The spatial extent of the correlation was tested with an upstream nitrate sensor 140 km north of the estimation location. These results provide proof of concept that we can develop models that use satellite data to provide large-scale monitoring of nitrates across the Mississippi River Basin and other impaired rivers, globally.</p>","author":"Nicholas Tufillaro, \nBryan P. Piazza, \nSheila Reddy, \nJoseph Baustian, \nDan Sousa, \nPhilipp Grötsch, \nIvan Lalović, \nSara De Moitié, \nOmar Zurita","siteTitle":"Wiley: Ecohydrology: Table of Contents","siteHash":"d4e136e5883a50f33ecc87d3538a4a44e073442841082fa59fe499953a06e418","entryHash":"9ad771715c84e8ab865055d73a7933f427b9448a36ab655b1a4f654dc7e3963e","category":"Environment"}