{"title":"I spy: Factors influencing the observation of oxytetracycline in calcified structures of fishes viewed using standard light and fluorescence microscopy","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15674?af=R","date":1707111605000,"content":"<h2>Abstract</h2>\n<p>The antibiotic oxytetracycline (OTC) is a fluorochrome marker, and fluorescence microscopy is used to view OTC marks in fishes' calcified structures. However, OTC marks have been observed in calcified structures using standard light microscopy for multiple species. Therefore, we conducted an experiment to investigate potential factors (i.e., season, total length of fish, growth rate, and sex) influencing the observation of OTC in calcified structures (otoliths and fin rays or spines) from channel catfish <i>Ictalurus punctatus</i>, gray redhorse <i>Moxostoma congestum</i>, Guadalupe bass <i>Mircopterus treculii</i>, and redbreast sunfish <i>Lepomis auritus</i> viewed using standard light and fluorescence microscopy. OTC stains were not observed in any otoliths under standard light; however, OTC marks were commonly observed in <i>I. punctatus</i> spines using standard light microscopy (56.2%). Ninety-nine percent of otoliths and 88.9% of spines and fin rays had a visible fluorescent OTC mark when viewed using fluorescence microscopy. There was a negative relationship between the observed OTC mark and total length of fish for each season, but fish injected in the summer had the most structures with an observed OTC mark under either light condition. Understanding how OTC marking is affected by biological processes and environmental conditions will assist in future studies that rely on chemical marking of calcified structures by increasing efficacy of OTC marking and interpretation of marks.</p>","author":"Meredith B. Pfennig, \nDerek P. Crane, \nNate G. Smith, \nDave L. Buckmeier","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"9adef9d01c0ff03972a2339b7a9a6e702b1d8e1fcac2e0f32832b524cde4e910","category":"Environment"}