{"title":"Effects of resisted sprint training with ball on speed and agility performance in U-19 elite soccer players","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311002","date":1727877600000,"content":"<p>by Alejandro Sal-de-Rellán, Mehdi Ben Brahim, Ariadna Hernaiz-Sánchez, Raghad Tarwneh, Víctor Martín</p>\r\n\r\nThe purpose of this study was to analyze the effects on speed and agility of including ball driving during resisted sprint training in relation to regular soccer training. Thirty male soccer players (age: 18.10 ± 0.66 years; height: 179 ± 0.06 cm; body mass: 76.22 ± 4.76 kg; systematic practice: 8.6 ± 1.73 years) participated in the study and were randomly assigned to an experimental group (EG; n = 18) or a control group (CG; n = 12). The research was conducted during a training camp. The intervention period lasted 6 weeks and during that period all players performed their usual soccer training. However, the EG performed two weekly sessions of a supplementary training of resisted sprints with a ball. Within-group analysis showed significant improvements in 5-m (<i>p</i> = 0.005) and 10-m (<i>p</i> = 0.016) sprint performance; and New multi-change of direction agility test (NMAT; <i>p</i> = 0.002), Illinois (IAT; <i>p</i> = 0.002), T-test (<i>p</i> = 0.003), Arrowhead COD (Arrowhead-R, <i>p</i> = &lt; 0.001; Arrowhead-L, <i>p</i> = &lt; 0.001) test and Zigzag agility test (Zigzag-B; <i>p</i> = 0.006) from pretest to posttest in EG. However, the CG didn’t show any significant improvements. Between-groups analysis revealed differences in favor of the EG in Zigzag-B, IAT, Arrowhead-R, Arrowhead-L and NMAT. This study’s results support the efficacy of a short-term training program that includes resisted sprints exercises to improve the performance of soccer players.","author":"Alejandro Sal-de-Rellán","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9af0996da49c36c189f38e93a80bee81469dd3321dda709c6253c2952302184f","category":"Interdisciplinary"}