{"title":"Streamflow Prediction in Human‐Regulated Catchments Using Multiscale Deep Learning Modeling With Anthropogenic Similarities","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036853?af=R","date":1726328329000,"content":"<h2>Abstract</h2>\n<p>Accurate streamflow prediction in human-regulated catchments remains a formidable challenge due to the complex disturbance of hydrological processes. To consider human disturbance in hydrological modeling, this study introduces a novel static attribute collection that combines river-reach attributes with catchment attributes, referred to as multiscale attributes. The attribute collection is assembled into two deep learning (DL) methods, that is, the Long Short-Term Memory (named as Multiscale LSTM) and the Differentiable Parameter Learning (DPL) model, and the performance is evaluated across 95 human-regulated catchments in the United States (USA) and 24 catchments in the Yellow River Basin in China. In the USA, the Multiscale LSTM and the DPL models achieve similar performance with median Kling-Gupta Efficiency (KGE) of 0.78 and 0.71, respectively. However, in the Yellow River Basin, the KGE values are 0.58 for Multiscale LSTM and 0.24 for DPL. These results highlight the DL models' ability to leverage multiscale attributes for improved performance compared to traditional catchment attributes. The performance of Multiscale LSTM and DPL models is predominantly influenced by river-scale attributes, encompassing factors such as connectivity status index (CSI), degree of regulation (DOR), sediment trapping (SED), and number of dams. Additionally, satellite-derived attributes such as mean and maximum river width (Width), slope and mean water surface elevation (WSE) from the Surface Water and Ocean Topography River Database (SWORD) contribute valuable insights into anthropogenic influences. Moreover, our study highlights the significance of selecting the appropriate training data period, which emerges as the most dominant factor affecting model performance across human-regulated catchments. The diversity of data during the training period enables the model to capture a broad spectrum of hydrological signatures within these catchments. Consequently, this study emphasizes the advantages of Multiscale LSTM and underscores the significance of considering both natural and anthropogenic signatures to enhance hydrological predictions within human-regulated environments.</p>","author":"Arken Tursun, \nXianhong Xie, \nYibing Wang, \nDawei Peng, \nYao Liu, \nBuyun Zheng, \nXinran Wu, \nCong Nie","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"9af4c04584f570d03d08b1672ae758b80fa889cad3a621b01746306e227a3182","category":"Environment"}