{"title":"COVID-19 Vaccine Hesitancy among the Adult Population in Bangladesh: A Nationally Representative Cross-sectional Survey","link":"https://www.preprints.org/manuscript/202408.1189/v1","date":1723776613000,"content":"Background: The Government of Bangladesh is currently providing COVID-19 vaccines free of cost, but for a massive population, the free vaccination program’s sustainability is challenging. In this regard, assessing willingness to pay can help to explore vaccine pricing, subsidizing strategy, and vaccine demand. The study aimed to evaluate the prevalence of willingness to pay (WTP) for the COVID-19 vaccine and its associated factors to ensure the sustainability of the vaccination program.    \n\nMethods:  A cross-sectional research design was adopted to collect data from 1497 respondents through online and face-to-face interviews. Data were analyzed using the chi-square test and point-biserial correlation for descriptive statistical analysis, and multiple logistic regression analysis was also used to identify the factors associated with the dependent variable in the study.\n\nResults:   The prevalence of WTP towards a COVID-19 vaccine was 50.9 %, and mean and median WTP were respectively 754.55 BDT (US$ 8.93), 300 BDT (US$ 3.55). WTP of other religions was significantly higher than Muslims (aOR=1.5, P=0.037). WTP was also higher among Graduate (aOR=2.2, P=0.007), Masters &amp; MPhil/PhD (aOR=2, P=0.030), higher family income group (aOR=1, P=0.039) and respondents with higher knowledge about the vaccine (aOR=1.1, P=0.003), behavioral practice (aOR=1.1, P&lt; 0.001), higher subjective norms (aOR=1.2, P=0.009), higher anticipated regret (aOR=1.2, P=0.005) and higher perceived benefits from the vaccine (aOR=1.1, P=0.029). On the contrary, WTP is lower among respondents who had a higher negative attitude toward vaccines (aOR= 0.9, P","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9b0735caf773adc832df93213a6889f5ee035bd12ff536bc5a33d633fb9966cc","category":"Interdisciplinary"}