{"title":"24,000 years on ice weren’t enough to kill these gals","link":"https://arstechnica.com/?p=1775475","date":1624445136000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Rotifer-CREDIT-Michael-Plewka-800x581.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/06/Rotifer-CREDIT-Michael-Plewka.png\">Enlarge</a> <span>/</span> After thawing out, these tiny creatures started making clones of themselves. (credit: Michael Plewka)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Rotifers are microscopic freshwater-dwelling multicellular organisms. They're already known to withstand freezing (<a href=\"https://www.youtube.com/watch?v=ytJ1yvFPbTE\">even in liquid nitrogen</a>), boiling, desiccation, and <a href=\"https://www.nationalgeographic.com/science/article/bdelloid-rotifers-the-worlds-most-radiation-resistant-animals\">radiation</a>, and the group has persisted for millions of years without having sex. The humble yet remarkably hardy bdelloid rotifer has now surprised researchers yet again—a <a href=\"https://www.cell.com/current-biology/fulltext/S0960-9822(21)00624-2\">recent study</a> unearthed 24,000-year-old Siberian permafrost and found living (or at least revivable) rotifers there. Surviving 24,000 years in deep-freeze is a new record for the species.</p>\n<p>Rotifers aren’t the only living organisms to emerge from permafrost or ice. The same researchers behind this latest discovery had previously found roughly 40,000-year-old <a href=\"https://www.smithsonianmag.com/smart-news/ancient-roundworms-allegedly-resurrected-russian-permafrost-180969782/\">viable roundworms</a> in the region’s permafrost. Ancient moss, seeds, viruses, and bacteria have all shown impressive longevity on ice, prompting <a href=\"https://arstechnica.com/science/2014/03/scientists-revive-largest-virus-yet-from-30000-year-old-permafrost/\">legitimate concern</a> about whether any potentially harmful pathogens may also be released as glaciers and permafrost melt.</p>\n<p>Given that bdelloids are generally only a threat to bacteria, algae, and detritus, however, there’s not much need for concern regarding this particular discovery. But as key players in the bottom of the food chain, newly re-emerged rotifers indicate that maybe we should think about how species that haven’t been seen for millennia might reintegrate into modern ecosystems.</p></div><p><a href=\"https://arstechnica.com/?p=1775475#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1775475&amp;comments=1\">Comments</a></p>","author":"Ars Contributors","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9b1be5b6019c17e7a651407a9adc0aedbcebf24c87646a5d78ad51b64870c6cc","category":"Tech"}