{"title":"Neural representation in active inference: Using generative models to interact with—and understand—the lived world","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15118?af=R","date":1713373495000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/7292c3f1-da47-468f-8b21-5b702890e87b/nyas15118-gra-0001-m.png\" alt=\"Neural representation in active inference: Using generative models to interact with—and understand—the lived world\" />\n<p>This paper examines neural representation under active inference. Organisms employ generative models to navigate the world adaptively, not (or not solely) to understand it. Crucially, different organisms might employ different types of generative models, ranging from action-oriented models (predicting outcomes) to explicit models (reconstructing the external environment). Connecting meaning to agentive action to the array of generative models imparts diverse forms of understanding of an organism's ecological niche.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This paper considers neural representation through the lens of active inference, a normative framework for understanding brain function. It delves into how living organisms employ generative models to minimize the discrepancy between predictions and observations (as scored with variational free energy). The ensuing analysis suggests that the brain learns generative models to navigate the world adaptively, not (or not solely) to understand it. Different living organisms may possess an array of generative models, spanning from those that support action-perception cycles to those that underwrite planning and imagination; namely, from explicit models that entail variables for predicting concurrent sensations, like objects, faces, or people—to action-oriented models that predict action outcomes. It then elucidates how generative models and belief dynamics might link to neural representation and the implications of different types of generative models for understanding an agent's cognitive capabilities in relation to its ecological niche. The paper concludes with open questions regarding the evolution of generative models and the development of advanced cognitive abilities—and the gradual transition from pragmatic to detached neural representations. The analysis on offer foregrounds the diverse roles that generative models play in cognitive processes and the evolution of neural representation.</p>","author":"Giovanni Pezzulo, \nLeo D'Amato, \nFrancesco Mannella, \nMatteo Priorelli, \nToon Van de Maele, \nIvilin Peev Stoianov, \nKarl Friston","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"9b24b608533bc1b731436a1e2bf005aba1e515002c92885c7296ec392afa0d0b","category":"Environment"}