{"title":"Giro d'Italia 2023 stage five preview - a far from straightforward sprint opportunity","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/giro-ditalia-2023-stage-five-preview","date":1683648135000,"content":"\n      <p><b>Distance: </b><span>171km<br /></span><b>Start location: </b><span>Atripalda<br /></span><b>Finish location: </b><span>Salerno<br /></span><b>Start time: </b><span>12:40 CEST<br /></span><b>Finish time (approx): </b><span>17:12</span><b> </b>CEST</p>\n<div></div>\n<p><span>The story goes that, one stormy night during the ninth century in Salerno (the host of stage five’s finish), a Greek pilgrim named Pontus sought refuge under the arches of the town’s aqueduct. While there, he encountered an injured Latin man named Salernus tending to his wounds, and, together with the Jewish traveller Helinus and Arabic Abdela, worked mutually to heal his injuries. Inspired by the experience, they decided to form the Salerno Medical School, an institution that would become renowned throughout Europe as the most important source for medical knowledge on the continent. </span></p>\n<p><span>A legend rather than a historical account, this story nevertheless symbolises the spirit of cooperation that made the school such a success. Combining knowledge from Greek, Latin, Arab and Jewish cultures, the school drew upon a wealth of knowledge to advance medical science, and sick people from around the world would travel here in the hope of being cured. </span></p>\n<p><span>While medical advancement in cycling is often unfortunately associated with ‘dodgy doctors’ and the doping culture that permeated the sport a few decades ago, it’s perhaps overlooked just how vital a role medical science plays to keep the riders fit and healthy in a sport so demanding on the body and with such a risk of injury. The very fact that, for instance, Remco Evenepoel is here as one of the overall favourites is thanks to the minor miracle achieved in patching him back together after he fell into a ravine during the 2020 Il Lombardia. </span></p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/e3tFvCxKngse6CIzcVfq_170423-104251.jpg?v=1683622804\" alt /><em>Stage five profile sourced on the Giro d'Italia website</em></p>\n<p><span>The terrain here is gentler than yesterday, as the riders head westwards away from the Apennines to the region of Campania and towards the Amalfi coast, so the only immediate worry for GC riders is their health, and steering clear of crashes. But though the flat 50km run-in to the finish virtually rules out the chance of any action among the overall contenders, the undulating parcours during the first half of the day make this a complicated one for sprinters. </span></p>\n<p><span>Firstly, some will face a battle to survive in the peloton, should teams with sprinters with superior climbing legs choose to lay down the hammer on the early hills in an attempt to take them out of contention. Secondly, there is a strong chance the stage won't even be decided by a sprint. The category three Passo Serra that’s tackled just a few kilometres into the stage, as well as the lumpy terrain that follows that eventually brings the riders to almost 1,000 metre above altitude, make for tasty launchpads for a strong breakaway to go clear early on, that, if powerful and cohesive enough, the sprinters teams will find difficult to bring back.</span></p>\n<h3>Contenders</h3>\n<p><span>If the stage is decided with a sprint finish there are a number of riders who have been making a statement in the past several stages. </span><strong>Michael Matthews</strong> (Jayco Alula) is one of those riders, proving he can secure a win on terrain like stage five, having taken his first Grand Tour victory since 2017 on stage three of this year's race. Fellow Australian <strong>Kaden Groves</strong> (<span>Alpecin–Deceuninck</span>) has also been in the mix, coming third in both stage two and three. </p>\n<p>Trek-Segafredo will also be able to pick up the pace to drive out the pure sprinters of the bunch after the climbs as they'll be looking for <strong>Mads Pedersen</strong> to go for the win. The Dane has been in touching distance of a victory since the race started, coming second in stage three and being involved in an untimely crash on stage two – where he was the favourite to win. </p>\n<p>EF Education-EasyPost rider <strong>Magnus Cort</strong> could be in contention. This type of route suits his abilities of being able to climb as well as put in a solid sprint effort, although he looked far off the pace on stage three. Another rider to keep an eye on during stage five is <span><strong>Fernando Gaviria</strong> (Movistar), who like Cort, is a sprinter but can handle the climbs when needed. While he didn't have the best of days during stage four, he came seventh on stage two to San Salvo. </span></p>\n<p><span>If the pace of the peloton is kept reasonably serene then we may see the pure sprinters come into play. That means stage two winner <strong>Jonathan Milan</strong> (Bahrain Victorious) may have a chance to double up, while <strong>David Dekker</strong> (Arkéa-Samsic), <strong>Pascal Ackermann</strong> (UAE Team Emirates), and <strong>Niccolò Bonifazio</strong> (Intermarché-Wanty-Circus) will all hope to better their results from stage two.</span></p>\n<p><span><strong>Mark Cavendish</strong> (Astana Qazaqstan) and <strong>Alberto Dainese</strong> (Team DSM) are both also potential winners should it end in a bunch sprint, but their current form remains an unknown after a crash stopped them fighting for victory on Sunday's stage.</span></p>\n<h3>Predictions</h3>\n<p>Trek-Segafredo have been at the fore of the race in pretty much all the road stages so far, with riders like Amanuel Ghebreigzabhier and Toms <span>Skujiņš</span> putting in the hard work in the breakaways for the team. With this in mind and <strong>Mads Pedersen</strong> hungry for the stage win, we think it'll be third time lucky for him. </p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9b2d1aac6f4af00744f5a26390c29130e790e3c738f832b53396ff5433a4a1a9","category":"Cycling"}