{"title":"Netflix ไตรมาล่าสุด สมาชิกเพิ่ม 13.12 ล้านบัญชี - เตรียมลงทุนคอนเทนต์มากขึ้น ขณะที่คู่แข่งเริ่มชะลอ","link":"https://www.blognone.com/node/137826","date":1706049972000,"content":"<div><div><div><p>Netflix รายงานผลการดำเนินงานประจำไตรมาสที่ 4 ปี 2023 จำนวนสมาชิกเพิ่มขึ้นจากไตรมาส 3/2023 อีก 13.12 ล้านบัญชี ทำให้จำนวนสมาชิกรวมเป็น 260.28 ล้านบัญชี</p>\n<p>ตัวเลขการเงิน Netflix มีรายได้ 8,833 ล้านดอลลาร์ เพิ่มขึ้น 12.5% จากช่วงเดียวกันในปีก่อน และมีกำไรสุทธิ 938 ล้านดอลลาร์ กระแสเงินสดอิสระ 1,581 ล้านดอลลาร์</p>\n<p>Netflix ยังพูดถึงภาพรวมอุตสาหกรรมบันเทิง และแนวโน้มในปี 2024 ว่าบริษัทขนาดใหญ่ต่างควบรวมกิจการกันมากขึ้นตลอด 10 ปีที่ผ่านมา อย่างไรก็ตามบริษัทยังไม่มีความคิดซื้อกิจการ โดยเฉพาะบริษัทที่เกี่ยวข้องกับสื่อทางโทรทัศน์แบบดั้งเดิมที่มีแนวโน้มผู้ชมลดลง ที่ Netflix ทำคือจะเพิ่มการลงทุนให้มากขึ้น เพราะตอนนี้คู่แข่งหลายรายเริ่มชะลอการลงทุนผลิตคอนเทนต์ใหม่กัน นอกจากนี้จะลงทุนในคอนเทนต์ถ่ายทอดสดมากขึ้น ซึ่งล่าสุดก็คือลิขสิทธิ์มวยปล้ำ <a href=\"https://www.blognone.com/node/137821\">WWE Raw</a> ที่จะเริ่มในปี 2025</p>\n<p>สำหรับแพ็คเกจสมาชิก Netflix บอกว่าในประเทศที่มีแพ็คเกจราคาถูกแบบมีโฆษณานั้น ปัจจุบัน 40% ของคนสมัครใหม่เลือกแพ็คเกจดังกล่าว สะท้อนการเติบโตและโอกาสของธุรกิจโฆษณา ซึ่งในประเทศกลุ่มที่มีแพ็คเกจโฆษณานี้ Netflix เตรียมยกเลิกแพ็คเกจราคาถูกที่สุด (Basic) ที่ไม่มีโฆษณา เพื่อผลักดันให้ลูกค้ามาใช้แพ็คเกจแบบมีโฆษณาแทนมากขึ้นด้วย เช่น แคนาดา สหราชอาณาจักร</p>\n<p>ที่มา: <a href=\"https://s22.q4cdn.com/959853165/files/doc_financials/2023/q4/NEW-FINAL-Q4-23-Shareholder-Letter.pdf\">Netflix</a> (pdf)</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/421e858cdf6f26c318f9dc5ccdd7c222.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/financial-report\">Financial Report</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9b42f850c445b7bb86857292f2b5a167e08548997d72fb25dc6d68ed75bf039d","category":"Thai"}