{"title":"A dramatic turn of events","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-dramatic-turn-of-events","date":1689714087000,"content":"\n      <p><span>In Ernest Hemingway’s novel </span><i><span>The Sun Also Rises</span></i><span>, one of the protagonists, Mike Campbell, recounts that he went bankrupt in two ways: “Gradually, then suddenly.”</span></p>\n<div></div>\n<p><span>When Tadej Pogačar looks back at the story of the 2023 <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> at the end of the race, he may relate. There are still five stages left, including two very hard mountain stages, perhaps the two hardest of the entire race. However, the huge beating that Jonas Vingegaard administered to the Slovenian in the stage 16 time trial to Combloux suggests that the Dane has put himself in a good position to win the Tour for a second year running.</span></p>\n<p><span>In a way, this was worse than the Col du Granon – in the 2022 Tour, Pogačar’s impetuous riding on the Col du Galibier in the face of Jumbo-Visma’s aggression cost him so much energy that he completely cracked on the final climb, but at least he could argue that his tactics, rather than his physical capacities, had cost him the yellow jersey. This time around, in a straight physical contest which took little over half an hour, Vingegaard put 1:38 into Pogačar. Considering the Slovenian had taken 10 stages, from Cautarets to Saint-Gervais, to chisel 43 seconds back out of Vingegaard after the Dane dropped him on stage five to Laruns, this was a dish of instant reprisal, served up ice cold.</span></p>\n<p><span>This has been coming. The momentum from the second Pyrenean stage through to the Col du Grand Colombier was with Pogačar. He put 24 seconds into the Dane at La Cambasque, eight on the Puy de Dôme and four on the Grand Colombier. He was also taking time bonuses here and there, which helped to chip away at Vingegaard’s lead. However, the gains were diminishing, and the Slovenian’s momentum finally ground to a halt on the Col de Joux Plane, en route to Morzine. On that stage, Pogačar attacked and dropped Vingegaard, but this time, unlike the previous three mountain stages, the Dane was able to come back to him. At Saint-Gervais, Pogačar tried to attack, but was unable to drop his rival at all. Those last two Alpine stages before the rest day were a gradual, barely perceptible tilt back in the direction of Vingegaard: it looked like he had worked Pogačar out.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-08879_1024x1024.jpg?v=1689714022\" alt=\"Jonas Vingegaard tour de france stage 16\" /></div>\n<p><em><span>Photo: Zac Williams/SWPix</span></em></p>\n<p><span>There’s a theory of narrative structure developed by the German playwright Gustav Freytag in his book </span><i><span>Die Technik des Dramas</span></i><span>, in which he described the narrative arc common to many classical stories, which he presented as a triangle (‘Freytag’s Pyramid’). According to Freytag, a story needed five parts. First comes exposition, in which the story’s characters are introduced, and which sets up the main conflict with some kind of crisis – the inciting incident. Second is ‘rising action’, in which the story begins to approach the main conflict. The third part, and the peak of the triangle, is the climax, which is the turning point of the drama, the great twist. After that comes the fourth part, falling action, which tracks the inevitable consequences of the moment of truth. And finally: catastrophe, or denouement – the happy or tragic ending.</span></p>\n<p><span>Freytag described the necessary elements of the climax: “This outburst of deed from the soul of the hero… the first great result of a sublime struggle…must appear inseparably connected with what goes before as well as what follows.” If the 2023 Tour de France is following the narrative structure of Freytag’s Pyramid, the rising action was the quest of Tadej Pogačar, in search of the time that would put him into the yellow jersey. However, what was Jonas Vingegaard’s performance in the time trial in Combloux, other than an outburst of deed from the soul of the hero? </span></p>\n<p><span>The concerning thing for Pogačar is that Vingegaard and Jumbo-Visma have turned this Tour into a physical contest, which, on the evidence of the last two Tours, suits the Dane. They have patiently weathered the constant niggling attacks and jabs, and though Pogačar was chipping away at Vingegaard’s lead through the middle part of the race, he was also evidently chipping away at his own reserves. In future races, Jumbo-Visma may have confidence that containing Pogačar is all they need to do, and wait for the point in the race that Vingegaard emerges as the stronger rider. (It should be pointed out that while there was a gulf in class between Vingegaard and Pogačar in Combloux, there was also a gulf in class between Pogačar and the rest: he put 1:13 into third-placed Wout van Aert and 1:17 into the next GC contender, Pello Bilbao.)</span></p>\n<p><span>There’s one more thing, however. That 1:38 didn’t just look like the product of superior strength and recovery. There was a visible difference in the way each rider tackled the time trial. Pogačar looked unsure of himself and rode steadily, his expression curiously neutral and dark shadows under his eyes betraying the first signs of weariness; Vingegaard rode violently and with ambition – it was reminiscent of Pogačar himself on the Planche des Belles Filles in 2020.</span></p>\n<p><span>There is still hope for Pogačar. Vingegaard made a big effort on stage five to Laruns and seemed to pay for it the next day, when Pogačar put significant time back into him. And Tadej Pogačar is Tadej Pogačar after all – he will not give up, he’ll ride aggressively and he’ll make Jonas Vingegaard’s life stressful for the next four days at least. There is still time for one last twist in the tale.</span></p>\n<p><em><span>Cover photo by James Startt</span></em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9b4e7465198a1506e259024c6340260e67afc658502092ff43e87230e0a9cad2","category":"Cycling"}