{"title":"Tencent Cloud ประสบความสำเร็จในการยกระดับบริการของภาครัฐพร้อมศักยภาพด้านดิจิทัลโซลูชัน","link":"https://www.blognone.com/node/137123","date":1701934200000,"content":"<div><div><div><p>รัฐบาลกรุงอาบูดาบีเล็งเห็นความสำคัญของการเข้าสู่สังคมดิจิทัลจึงพยายามสร้างแพลตฟอร์ม TAMM ที่เปรียบเสมือนดิจิทัลเกตเวย์ของรัฐ โดยรวบรวมบริการภาครัฐกว่า 700 รายการผ่านเว็บไซต์หรือแอปพลิเคชั่นในโทรศัพท์มือถือซึ่งบริการต่างๆ นั้นดูแลโดยหน่วยงานในรัฐบาลกว่า 30 หน่วยงาน ทำให้ต้องการแพลตฟอร์มกลางที่มีมาตรฐาน สามารถแบ่งส่วนงานกันพัฒนาได้อย่างเป็นระบบ พร้อม ๆ กับความสามารถในการกำหนดสิทธิ์การเข้าถึงข้อมูลและความปลอดภัย</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/acb72718cd8bc11f5641c87e6721b00a.png\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/ed004e52960c67f0f8b130798843c2d7.png\" /></p>\n<p><em>TAMM ซูเปอร์แอปที่ใช้</em> Tencent Cloud Mini Program Platform (TCMPP) <em>รวบรวมบริการของรัฐบาลกรุงอาบูดาบีกว่า 700 รายการไว้ในโปรแกรมเดียว</em></p>\n<p>ด้วยการช่วยเหลือของ Tencent Cloud ที่มีความยืดหยุ่นของโซลูชันต่างๆ ที่บริษัทพร้อมจะทำงานร่วมกับลูกค้าหาเพื่อหาทางเลือกที่เหมาะสมและนำเสนอรูปแบบบริการตามความต้องการของลูกค้า เสริมด้วยประสบการณ์ของ Tencent จากอุตสาหกรรมต่างๆ เช่น บริการด้านการเงิน, บริการเกม, ตลอดจนบริการด้านสื่อออนไลน์ต่างๆ ทำให้มีเทคโนโลยีประสิทธิภาพสูงสำหรับบริการเหล่านี้อยู่ภายใน และเปิดให้บริการกับลูกค้าองค์กรและรัฐบาลต่างๆ ผ่านทาง Tencent Cloud เช่น บริการภาครัฐต้องการบริการ e-KYC เพื่อยืนยันตัวตนผู้ใช้ Tencent Cloud ก็มีบริการเหล่านี้พร้อมสรรพ ด้วยประสบการณ์ที่ให้บริการทางการเงินมาก่อนแล้ว</p>\n<p>Tencent Cloud ได้นำเอาเทคโนโลยีด้านคลาวด์อันล้ำสมัย และบริการ SuperApp-as-a-Service มาตอบโจทย์ความต้องการของรัฐบาลกรุงอาบูดาบี โดยหัวใจสำคัญในการยกระดับ TAMM คือ Tencent Cloud Mini Program Platform (TCMPP) ซึ่งเป็นระบบนิเวศของ SuperApp ที่นำเสนอบริการที่หลากหลายและมีประสิทธิภาพที่ไม่มีใครเทียบได้ พัฒนาการนี้ทำให้ Tencent Cloud ก้าวข้ามการเปลี่ยนแปลงสู่ยุคดิจิทัล โดยสร้างประสบการณ์ที่เน้นผู้ใช้เป็นศูนย์กลางอย่างแท้จริง</p>\n<p><strong>Tencent Cloud ช่วยสร้างซูเปอร์แอปได้อย่างไร</strong></p>\n<p>TAMM อาศัยแพลตฟอร์ม TCMPP ทำให้สามารถรวมเอาบริการที่หลากหลายกว่า 700 บริการ สามารถให้บริการได้ทั้งบริการประชาชนทั่วไป เช่น การขอบัตรประชาชนหรือหนังสือเดินทาง, จองคิวสถานที่แต่งงานของรัฐบาล, หรือการจ่ายค่าปรับ รวมไปถึงบริการสำหรับภาคธุรกิจ เช่น การขอใบอนุญาตธุรกิจต่างๆ, การจดทะเบียนธุรกิจ</p>\n<p>TCMPP เป็นแพลตฟอร์มทีประกอบด้วยฟีเจอร์สำคัญ 6 ประการทำให้เป็นแพลตฟอร์มที่พร้อมสำหรับทำ SuperApp-as-a-Service ได้แก่</p>\n<ol>\n<li>Mini program containerization: สำหรับการนำโปรแกรมย่อยไปรันใน SuperApp</li>\n<li>Developer IDE: ระบบพัฒนาครบวงจร ทั้งการเขียนโปรแกรม, การดีบั๊ก, และการจำลองการทำงาน</li>\n<li>Operation tools: ระบบมอนิเตอร์ประสิทธิภาพการทำงานของ mini program ภายใน ทำให้ประสบการณ์ผู้ใช้ไม่ขาดตอน</li>\n<li>Enterprise operation tools: เครื่องมือควบคุมระดับองค์กร ตรวจสอบการทำงานอย่างละเอียด (audit) เพื่อความปลอดภัย</li>\n<li>Safety/Security: ระบบสแกนความปลอดภัยของ mini program ให้แน่ใจว่าโปรแกรมย่อยๆ นั้นทำงานอย่างปลอดภัย</li>\n<li>One Code, Many Ends: mini program ที่พัฒนาขึ้นมาสามารถนำไปใช้งานได้หลายที่ที่ใช้แพลตฟอร์ม TCMPP รวมถึง WeChat ลดค่าใช้จ่ายในการพัฒนาในอนาคต</li>\n</ol>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/4c256cf734e2a72cdc1d4c5ad513fa07.png\" /></p>\n<p><strong>Tencent Cloud: พร้อมบุกเบิกการเปลี่ยนแปลงในเอเชียตะวันออกเฉียงใต้ผ่านโซลูชันดิจิทัลที่ปรับแต่งได้</strong></p>\n<p>การให้บริการ TCMPP กับรัฐบาลกรุงอาบูดาบี แสดงให้เห็นความสำเร็จของ Tencent Cloud ในการยกระดับบริการของภาครัฐบาล ทั้งนี้ Tencent Cloud มุ่งมั่นและพร้อมขยายความร่วมมือกับรัฐบาลและภาคเอกชนทั่วโลก</p>\n<p>ในเอเชียตะวันออกเฉียงใต้ โดยเฉพาะประเทศไทย ซึ่งพร้อมรับมือกับการเปลี่ยนแปลงทางดิจิทัลในภูมิภาคนี้ SuperApp-as-a-Service ของ Tencent Cloud สามารถมีบทบาทสำคัญในการกระบวนการนี้ ด้วยการจัดหาแพลตฟอร์มแบบครบวงจรสำหรับการโฮสต์บริการและหน้าข้อมูลต่างๆ ในรูปแบบของมินิโปรแกรม ทำให้ผู้ใช้เข้าถึงและการโต้ตอบกับบริการต่างๆ แบบเรียลไทม์ได้ง่ายขึ้น การบูรณาการในโครงสร้างพื้นฐานของระบบคลาวด์นี้สอดคล้องกับพลวัตรทางดิจิทัลแบบติดสปีดของเอเชียตะวันออกเฉียงใต้</p>\n<p>Tencent Cloud ไม่เพียงแต่ช่วยภาครัฐยกระดับบริการสาธารณะที่หลากหลายเท่านั้น แต่ยังมอบแพลตฟอร์มที่ปรับแต่งได้ซึ่งออกแบบมาเพื่อตอบสนองความต้องการที่แตกต่างกันของแต่ละประเทศและภูมิภาค ตลอดจนเล็งเห็นความสำคัญของการลงทุนตั้งศูนย์ข้อมูลในประเทศที่ให้บริการเพื่อสร้างความมั่นใจให้ผู้ใช้งาน ทำให้ Tencent Cloud เป็นพันธมิตรที่มีความพร้อมทางดิจิทัลสำหรับรัฐบาลหรือองค์กรขนาดใหญ่ที่ต้องการสร้างแพลตฟอร์มที่ครบครันและครอบคลุม</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tencent-cloud\">Tencent Cloud</a></div><div><a href=\"/topics/superapp\">SuperApp</a></div><div><a href=\"/topics/advertorial\">Advertorial</a></div></div></div>","author":"sponsored","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9b526e352ce40f8cbdd0fc1568c9b07a95965b476ebf295f20b9c12bc92661cf","category":"Thai"}