{"title":"Efficient design and implementation of approximate FA, FS, and FA/S circuits for nanocomputing in QCA","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310050","date":1725631200000,"content":"<p>by Saeid Seyedi, Hatam Abdoli</p>\r\n\r\nRecently, there has been a lot of research in Quantum Cellular Automata (<i>QCA</i>) technology because it promises low power consumption, low complexity, low latency, and compact space. Simultaneously, approximate arithmetic, a new paradigm in computing, streamlines the computational process and emerges as a low-power, high-performance design approach for arithmetic circuits. Furthermore, the XOR gate has been widely used in digital design and is a basic building block that can be used in many upcoming technologies. The full adder (<i>FA</i>) circuit is a key component of QCA technology and is utilized in arithmetic logic operations including subtraction, multiplication, and division. A great deal of research has been done on the design of approximate FA, full subtractor (<i>FS</i>), full adder/subtractor (<i>FA/S</i>), and <i>4-bit</i> ripple carry adder (<i>RCA</i>) based on XOR logic, establishing them as essential components in the creation of QCA-based arithmetic circuits. This study presents three new and effective QCA-based circuits, based on XOR logic: an approximate FA, an approximate FS, an approximate FA/S, and an approximate <i>4-bit</i> ripple carry adder (<i>RCA</i>). Interestingly, some designs have inputs on one side and outputs on the other, making it easier to reach the components without being encircled by other cells and leading to a more effective circuit design. In particular, a delay of <i>0</i>.<i>5 clock phases</i>, an area of <i>0</i>.<i>01 μm2</i>, and implementation utilizing just <i>11</i> cells was accomplished in the approximate FA and subtractor designs. In a similar vein, the estimated FA/S designs showed <i>0</i>.<i>5 clock phase</i> delay, <i>0</i>.<i>01 μm2</i> area, and <i>12</i> cells used for implementation. An approximate <i>4-bit</i> RCA is proposed using <i>64</i> QCA cells. The effectiveness of these designs is evaluated through functional verification with the QCADesigner program. According to simulation results, these proposed solutions not only function well but significantly outperform previous ideas in terms of speed and space. The proposed FA, FS, and RCA designs surpassed the previous best designs by <i>21%</i>, <i>21%</i>, <i>and 43%</i>, respectively, in terms of cell count.","author":"Saeid Seyedi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9b59b8b06223fb5c958dda22b9c4f1ed77b2959dd814b3879a848678b9a24a57","category":"Interdisciplinary"}