{"title":"Eating Behaviors during Pregnancy: A Cross-Sectional Study","link":"https://www.preprints.org/manuscript/202406.1442/v1","date":1718886776000,"content":"Background Eating disorders are complex illnesses with serious long-term consequences. They are linked to negative outcomes such as miscarriage, low birth weight, and other obstetric and postpartum difficulties. Our study in Muscat, Oman, examines the eating habits of pregnant women who consult primary care physicians. We aim to understand how eating disorders affect pregnant women and inform more effective interventions. Method We used the Eating Disorder Examination Questionnaire to assess the potential for the presence of eating disorders. Chi-Square and Fisher's Exact tests were used to analyze relationships between improper eating behavior and independent variables. Results The study showed that 1.6% of participants had a potential diagnosis of an eating disorder, with the most common inappropriate behavior being binge-eating at a prevalence of 18.8%. A pre- gestational low Body Mass Index (BMI) was associated with a higher prevalence of binge eating during pregnancy. Additionally, we found that pregnant women who were working were more prone to self-induced vomiting. High BMI before pregnancy was significantly associated with various inappropriate eating behaviors such as restraint behavior (p = 0.000), shape concern (p = 0.000), weight concern (p = 0.040), eating (p = 0.045), laxative use (p = 0.020), and excessive exercise (p = 0.043). Conclusion The study reveals a high prevalence of eating disorders in pregnancy. Less educated women exhibit higher laxative use, while working women show more instances of binge eating and self-induced vomiting. These findings emphasize the critical need to prioritize targeted interventions and support for vulnerable pregnant women.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9b5bc8507fc0e3619f560b039be8c8532702f2d3f1ab006d7cb3769351471363","category":"Interdisciplinary"}