{"title":"Force in Cable of Pretensioner Tube &ndash; A Method of Car Accident Reconstruction","link":"https://www.preprints.org/manuscript/202403.0841/v1","date":1710740297000,"content":"The reconstruction of traffic accidents has grown as an interdisciplinary field since the first accident occurred. Various methods have been developed over time, starting with primary data collected at the scene of the accident. In this work, I proposed a method by which the value of the force in the safety belt buckle can be determined when it is equipped with a pretensioning system with pyrotechnic trigger in the tube, PBP or PLP type. The anti-return system of the pretensioner mechanism, which prevents the passenger's body from moving forward, contains a set of balls that block the movement of the piston in the pretensioner tube after its activation. When limiting the movement, the force the human body exerts on the safety belt webbing is transformed into the deformation of the pretensioner tube by the balls of the anti-return system. Depending on the magnitude of the force, the marks left by the balls differ. I propose a relationship of dependence between the acting force and the deformation of the tube. An experimental test bench was created to perform shock traction tests on the pre-tensioning system, under similar conditions to those of the human body acting on the belt in case of a frontal collision. Following the tests, the force value of the seat belt buckle cable and the diameter of the spherical indentations that the balls left in the pretensioner tube were measured. A mathematical model was proposed to determine the normal force with which a ball from the anti-return system deforms the tube. The normal force was also determined by two other methods specific to contact mechanics and used in the specialized literature. By comparing the normal forces obtained by the three methods, a good correlation between the proposed mathematical model and the Komvopoulos-Ye method resulted, the \"Hardness\" method not being suitable for this study. The determined polynomial regression curve allows finding out the force in the cable of the closer depending on the size of the deformations produced by the balls in the tube. The forces in the belt webbing can be thus determined and biomechanics specialists can evaluate the injuries to the chest and abdomen of the occupants of a vehicle.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9b63d0e7a4d911b574e5bd82305cb211fe4fd57586f75db59b9cb5b44e5a09d0","category":"Interdisciplinary"}