{"title":"The effects of multifactorial stress combination on rice and maize","link":"https://academic.oup.com/plphys/article/194/3/1358/7319535?rss=1","date":1697500800000,"content":"<span><div>Abstract</div>The complexity of environmental factors affecting crops in the field is gradually increasing due to climate change-associated weather events, such as droughts or floods combined with heat waves, coupled with the accumulation of different environmental and agricultural pollutants. The impact of multiple stress conditions on plants was recently termed “multifactorial stress combination” (MFSC) and defined as the occurrence of 3 or more stressors that impact plants simultaneously or sequentially. We recently reported that with the increased number and complexity of different MFSC stressors, the growth and survival of Arabidopsis (<span>Arabidopsis thaliana</span>) seedlings declines, even if the level of each individual stress is low enough to have no significant effect on plants. However, whether MFSC would impact commercial crop cultivars is largely unknown. Here, we reveal that a MFSC of 5 different low-level abiotic stresses (salinity, heat, the herbicide paraquat, phosphorus deficiency, and the heavy metal cadmium), applied in an increasing level of complexity, has a significant negative impact on the growth and biomass of a commercial rice (<span>Oryza sativa</span>) cultivar and a maize (<span>Zea mays</span>) hybrid. Proteomics, element content, and mixOmics analyses of MFSC in rice identified proteins that correlate with the impact of MFSC on rice seedlings, and analysis of 42 different rice genotypes subjected to MFSC revealed substantial genetic variability in responses to this unique state of stress combination. Taken together, our findings reveal that the impacts of MFSC on 2 different crop species are severe and that MFSC may substantially affect agricultural productivity.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"9b691974ad29eb0275b599280803caa57511880a5512c8c45581521d93b080af","category":"Environment"}