{"title":"Linking landscape structure, floral resource distribution, pollen use and movement distances of a generalist predator","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14783?af=R","date":1727095189000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/0da93ce9-28a2-4c72-a489-0f3d85fda52e/jpe14783-toc-0001-m.png\" alt=\"Linking landscape structure, floral resource distribution, pollen use and movement distances of a generalist predator\" />\n<p>Our findings suggest that the spatial distribution of flowering wild plants can inform movement patterns of lacewings and other flower-visiting insects in agricultural landscapes. In addition, the location of floral resources in the landscape is important for its capacity to sustain natural enemies. Given the strong reliance of lacewings on pollen from nearby insect pollinated woody plants, the promotion of native shrubs and trees, such as Prunus, Salix and Castanea, should be prioritized for natural enemy enhancement in agricultural landscapes. Doing this in the form of hedgerows or agroforestry systems would lead to only minimal reduction in production areas and provide additional benefits such as biodiversity conservation.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nUnderstanding the habitat use and movement patterns of natural enemies in agricultural landscapes is essential for enhancing biological pest control. Since many natural enemies rely on floral resources, the distribution of these resources in combination with movement behaviour likely influence biological control in field crops. Nevertheless, few studies have assessed natural enemy movement at the landscape scale.\n\nHere we estimated minimal movement distances of the green lacewing <i>Chrysoperla carnea</i> based on consumed pollen and the spatial distribution of the respective plant species in 24 agricultural landscapes (500 m radius). Lacewings were sampled using sticky traps in the centre of each landscape, and the consumed pollen were identified. The location of the most important pollen-providing plants was mapped in each landscape. Distances to potential sources of pollen consumed by 346 lacewings were used to derive minimal movement distances.\n\nLacewings consumed mostly pollen from insect-pollinated plants that were present within 500 m from the sampling location. The distance to the nearest source of consumed pollen exceeded 200 m in 31% of lacewing individuals, demonstrating the relevance of the landscape scale to understand their population dynamics.\n\nDistances were shorter to insect-pollinated than to wind-pollinated plants, and shorter early than late in the season. Mean and median distances to pollen sources were negatively associated to flower availability and edge density in the landscape, but this was not the case for minimal distances.\n\n<i>Synthesis and applications</i>. Our findings suggest that the spatial distribution of flowering wild plants can inform movement patterns of lacewings and other flower-visiting insects in agricultural landscapes. In addition, the location of floral resources in the landscape is important for its capacity to sustain natural enemies. Given the strong reliance of lacewings on pollen from nearby insect pollinated woody plants, the promotion of native shrubs and trees, such as <i>Prunus</i>, <i>Salix</i> and <i>Castanea</i>, should be prioritized for natural enemy enhancement in agricultural landscapes. Doing this in the form of hedgerows or agroforestry systems would lead to only minimal reduction in production areas and provide additional benefits such as biodiversity conservation.\n</p>\n<h2>Resumen</h2>\n<p>\n\nComprender el uso del hábitat y los patrones de movimiento de los enemigos naturales en paisajes agrícolas es esencial para mejorar el control biológico de plagas. Dado que muchos enemigos naturales dependen de recursos florales, la distribución de estos recursos en combinación con el comportamiento de movimiento probablemente influye en el control biológico en los cultivos. Sin embargo, pocos estudios han evaluado el movimiento de los enemigos naturales a escala del paisaje.\n\nAquí estimamos las distancias mínimas de movimiento de la crisopa verde <i>Chrysoperla carnea</i> en función del polen consumido y la distribución espacial de las especies de plantas en 24 paisajes agrícolas (radio de 500 m). Se muestrearon crisopas utilizando trampas pegajosas en el centro de cada paisaje y se identificó el polen consumido. Se mapeó la ubicación de las plantas proveedoras de polen más importantes en cada paisaje. Se utilizaron las distancias a las posibles fuentes de polen consumido por 346 crisopas para derivar las distancias mínimas de movimiento.\n\nLas crisopas consumieron principalmente polen de plantas polinizadas por insectos que estaban presentes dentro de los 500 m alrededor de los puntos de muestreos. La distancia a la fuente más cercana de polen consumido superó los 200 m en el 31% de los individuos de crisopas, lo que demuestra la relevancia de la escala del paisaje para comprender la dinámica de sus poblaciones.\n\nLas distancias fueron más cortas para plantas polinizadas por insectos que para plantas polinizadas por viento, y más cortas al principio que al final de la temporada. Las distancias medias y medianas a las fuentes de polen se asociaron negativamente con la disponibilidad de flores y la densidad de los bordes en el paisaje, pero esto no se observó para las distancias mínimas.\n\n<i>Síntesis y aplicaciones</i>. Nuestros hallazgos sugieren que la distribución espacial de las plantas silvestres con flores puede informar los patrones de movimiento de las crisopas y otros insectos que visitan flores en paisajes agrícolas. Además, la ubicación de los recursos florales en el paisaje es importante para su capacidad de sustentar enemigos naturales. Dada la fuerte dependencia de las crisopas del polen de plantas leñosas polinizadas por insectos cercanas, promover arbustos y árboles nativos, como <i>Prunus</i>, <i>Salix</i> y <i>Castanea</i>, debería priorizarse para favorecer a los enemigos naturales en paisajes agrícolas. Hacerlo en forma de setos o sistemas agroforestales conduciría sólo a una reducción mínima en las áreas de producción y proporcionaría beneficios adicionales como la conservación de la biodiversidad.\n</p>","author":"E. González, \nF. J. J. A. Bianchi, \nP. W. Eckerter, \nM. H. Entling","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"9b713228c68a7db7fc469b7d0bea7afed80ce29b17634909b7bc4618ae0df563","category":"Environment"}