{"title":"T-Mobile to Acquire Ryan Reynolds' Mint Mobile Brand","link":"https://www.macrumors.com/2023/03/15/t-mobile-acquiring-mint-mobile/","date":1678919580000,"content":"U.S. carrier T-Mobile <a href=\"https://www.t-mobile.com/news/business/t-mobile-to-acquire-mint-and-ultra-mobile\">today announced</a> that it plans to acquire Mint Mobile, the affordable smartphone brand that is promoted by and backed by actor Ryan Reynolds. Reynolds and T-Mobile CEO Mike Sievert teamed up for a video letting customers know about the coming acquisition.\r<br />\n\r<br />\n<div></div>\r<br />\nThe deal is for Ka'ena Corporation, the parent company of Mint Mobile, Ultra Mobile, and Plum, with T-Mobile paying up to $1.35 billion, split into 39 percent cash and 61 percent stock. The final purchase price will be settled later this year after the deal closes.\r<br />\n\r<br />\nT-Mobile plans to continue Mint Mobile's $15 per month pricing option, which provides 4GB of high-speed 4G or 5G data along with unlimited text and talk. T-Mobile is purchasing Mint Mobile's sales, marketing, digital, and service operations, and says that it will use the T-Mobile supplier relationships and distribution scale to help Mint Mobile grow.\r<br />\n\r<br />\nMint Mobile's \"industry leading\" marketing expertise will be incorporated into T-Mobile's portfolio to reach new customer segments and geographies, with Reynolds staying on in his creative role.\r<br />\n<blockquote>\"Mint has built an incredibly successful digital direct-to-consumer business that continues to deliver for customers on the Un-carrier's leading 5G network and now we are excited to use our scale and owners' economics to help supercharge it - and Ultra Mobile - into the future,\" said Mike Sievert, CEO of T-Mobile. \"Over the long-term, we'll also benefit from applying the marketing formula Mint has become famous for across more parts of T-Mobile. We think customers are really going to win with a more competitive and expansive Mint and Ultra.\"\r<br />\n\r<br />\n\"Mint Mobile is the best deal in wireless and today's news only enhances our ability to deliver for our customers. We are so happy T-Mobile beat out an aggressive last-minute bid from my mom Tammy Reynolds as we believe the excellence of their 5G network will provide a better strategic fit than my mom's slightly-above-average mahjong skills. I am so proud of the entire Mint team and so excited for what's to come,\" said Ryan Reynolds.</blockquote>\r<br />\nT-Mobile's Mint Mobile acquisition will be its second major mobile purchase following its 2020 merger with Sprint.<div>Tag: <a href=\"https://www.macrumors.com/guide/t-mobile/\">T-Mobile</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/03/15/t-mobile-acquiring-mint-mobile/\">T-Mobile to Acquire Ryan Reynolds' Mint Mobile Brand</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/t-mobile-to-acquire-ryan-reynolds-mint-mobile-brand.2383817/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9b7c21bf19ea7d27cf1a90258a08a37f7015a84c32fa0a5689d2bc99d9f55eb4","category":"Apple"}