{"title":"Spotify Set to Rival Apple Podcasts Subscriptions With New Service That Won't Charge Content Creators","link":"https://www.macrumors.com/2021/04/23/spotify-to-take-on-apple-podcasts-subscriptions/","date":1619177122000,"content":"Apple this week <a href=\"https://www.macrumors.com/2021/04/20/apple-30-percent-cut-podcast-subscriptions/\">announced</a> a new subscription feature coming to the Podcasts app in May that will let podcast publishers sell subscriptions to an individual show or a group of shows, with pricing starting at 49 cents per month.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/03/spotify-vs-apple-podcasts-feature.jpg\" />\r\n<br />\r\nPublishers will be able to set their own pricing, but Apple will reportedly take a 30% of subscription revenue that creators generate in their first year on the platform, and after that, Apple will collect 15%. This is the same pricing setup that Apple uses for other subscription options.\r\n<br />\r\n\r\n<br />\r\nAccording to a new report from <em><a href=\"https://www.wsj.com/articles/apple-spotify-and-the-new-battle-over-who-wins-podcasting-11619170206\">The Wall Street Journal</a></em>, Spotify will announce a similar podcast subscription feature next week, but in contrast to Apple, the rival streaming service won't be collecting revenue on any of the content it hosts.\r\n<br />\r\n\r\n<br />\r\nThe potential announcement from Spotify will pose a dilemma for some content creators looking to monetize their content on Apple devices. On the one hand, Apple's Podcasters Program, which is priced at $19.99 per year, promises a streamlined method of distribution through the Podcasts app, which comes pre-installed on all Apple devices. \r\n<br />\r\n\r\n<br />\r\nOn the other hand, Spotify commands a much larger subscriber base and isn't locked into Apple's ecosystem. Spotify has also been making inroads in the podcasting market over the course of the last few years, ramping up its original podcast offerings and making major acquisitions like <a href=\"https://www.macrumors.com/2019/02/06/spotify-reaches-96m/\">Gimlet Media</a>, <a href=\"https://www.macrumors.com/2019/03/26/spotify-third-podcast-acquisition/\">Parcast</a>, and Anchor, as well as scoring key deals such as the rights to the popular <a href=\"https://www.macrumors.com/2020/05/20/spotify-signs-up-the-joe-rogan-experience-podcast/\">Joe Rogan Experience podcast</a>. According to <a href=\"https://www.emarketer.com/content/spotify-podcast-listener-numbers-will-surpass-apples-this-year\">one prediction</a>, Spotify could soon have more podcast listeners than Apple.\r\n<br />\r\n\r\n<br />\r\nHow Spotify's announcement goes down will be interesting to watch. Apple won't require podcast creators to create content exclusively for Apple, but it does have a number of partners on board ready to create premium podcast content, including Tenderfoot TV, Pushkin Industries, Radiotopia from PRX, and QCODE, NPR, the Los Angeles Times, The Athletic, Sony Music Entertainment, and more. How many grassroots podcast creators it will be able to attract remains to be seen.<div>Tags: <a href=\"https://www.macrumors.com/guide/wsj-com/\">wsj.com</a>, <a href=\"https://www.macrumors.com/guide/podcasts/\">Podcasts</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/23/spotify-to-take-on-apple-podcasts-subscriptions/\">Spotify Set to Rival Apple Podcasts Subscriptions With New Service That Won't Charge Content Creators</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/spotify-set-to-rival-apple-podcasts-subscriptions-with-new-service-that-wont-charge-content-creators.2292908/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xsegwjDf3pc:f06fxVvsCUw:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=xsegwjDf3pc:f06fxVvsCUw:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/xsegwjDf3pc\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9b8303d7e0c0fddbf8422830df8c2318b773bf24e235389819a4c01177330230","category":"Apple"}