{"title":"When it comes to Apple reviews, bias is as bias does","link":"https://www.macworld.com/article/350751/macalope-ipad-pro-reviews-affordability-ipados-magic-keyboard-apple-pencil-privacy-longevity.html","date":1626166800000,"content":"\n<div>\n<section><div></div></section><p>One proven axiom of bias is that it is always in others, never in ourselves. That’s just science.</p>\n\n\n\n<p>On July 4th, Matthew Sheffield <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/mattsheffield/status/1411732346760351744&amp;xcust=1-1-350751-0-0-0&amp;sref=https://www.macworld.com/feed\">keyed a Twitter thread</a> taking aim at what he saw as a “blatant pro-Apple bias” in tech journalism. (Tip o’ the antlers to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://twitter.com/flargh/status/1412046945359745024&amp;xcust=1-1-350751-0-0-0&amp;sref=https://www.macworld.com/feed\">Peter Cohen</a>.)</p>\n\n\n\n<p>This is amusing to the Macalope as he has largely made a career based on responding to the knee-jerk anti-Apple bias presented by a large swath of tech punditry.</p>\n\n\n\n<p>Not a <em>good</em> career, mind you. But a career.</p>\n\n\n\n<p>Of particular note to Sheffield was the fact that the iPad Pro consistently gets very strong reviews when it so clearly sucks.</p>\n\n\n\n<blockquote><p>The biggest negative of iPads is that they are drastically overpriced for what they can do. You have to pay a minimum of $1,000 US for tablet that comes with none of the following:</p></blockquote>\n\n\n\n<p>Sheffield is really just talking about the 12.9-inch iPad Pro here as the 11-inch iPad Pro starts at $799. But it’s a little ironic for someone railing against the laziness of reviewers to blithely drop important modifiers to his irate claims.</p>\n\n\n\n<p>You can be excused for thinking that Sheffield’s list of items missing from iPads was faxed in from 1999. Yes, there’s the obligatory storage slots, but please make sure your mouth is free of any beverages before you get to the last one.</p>\n\n\n\n<blockquote><p>-Storage card slots<br />-Upgradeable internal storage<br />-Keyboard<br />-Stylus<br />-A headphone jack<br />-More than a single port<br />-An OS that can actually open files<br />-An ability to boot third-party OSes</p></blockquote>\n\n\n\n<p>Indeed. If there’s one thing people interested in iPads want it’s the ability to boot a third-part OS. Personally, if the Macalope can’t boot his iPad into <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://archive.org/details/IBMOS2Warp4Collection&amp;xcust=1-1-350751-0-0-0&amp;sref=https://www.macworld.com/feed\">OS/2 Warp</a>, what’s even the point?</p>\n\n\n\n<p>The only two keyboards Sheffield discusses are the ones made by Apple, which he complains are overpriced since they start at $200. There is, however, a large and rather thriving ecosystem of iPad peripherals. The <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/wirecutter/reviews/best-ipad-pro-keyboard-cases/&amp;xcust=1-1-350751-0-0-0&amp;sref=https://www.macworld.com/feed\">Wirecutter’s</a> suggested keyboards for the iPad Pro start at $120 and, of course, you can use any ol’ Bluetooth keyboard you want.</p>\n\n\n\n<p>About the Magic Keyboard, Sheffield says:</p>\n\n\n\n<blockquote><p>…it has major flaws…</p></blockquote>\n\n\n\n<div><div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Macalope</figcaption></figure></div><p>IDG</p></div>\n\n\n\n<p>Honestly, the Macalope resisted buying a Magic Keyboard for his iPad Pro for a long time. It <em>did</em> seem expensive and he wasn’t sure how much he’d use it. Now that he has one, though, he never takes it off the device. It has utterly transformed how he uses his iPad. It’s terrific.</p>\n\n\n\n<blockquote><p>You get a trackpad but bc iPadOS sucks…</p></blockquote>\n\n\n\n<p>I am very impartial. I am the only impartial iPad reviewer.</p>\n\n\n\n<blockquote><p>…you don’t get an arrow to move around. Instead, you get an imprecise blob.</p></blockquote>\n\n\n\n<p>An imprecise blob that is sort of magnetically attracted to targets, highlights the item it’s selecting for clarity and turns into a standard caret for text. If anything, this combination is more precise than the arrow on a desktop operating system. And, really, the Magic Keyboard is pretty flawless. If you have a problem with the operating system, that’s not a knock on the keyboard.</p>\n\n\n\n<blockquote><p>Then we have the Apple Pencil stylus.<br />…<br />…it has no safe storage place. So easy to lose.</p></blockquote>\n\n\n\n<p>It magnetically attaches to the device. The Macalope stuck his to iPad when he got it and he’s never lost it once. It did come off once in a backpack. Guess where it was.</p>\n\n\n\n<p>It was in the backpack.</p>\n\n\n\n<p>Odd bit of bias for storing pens in some kind of dedicated pen receptacle from our intrepid unbiased reviewer. One of the devices Sheffield recommends instead of an iPad is the Lenovo ThinkPad X12, which has a fabric loop to hold the stylus when not in use.</p>\n\n\n\n<p>Literally the first <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.pcmag.com/reviews/lenovo-thinkpad-x12-detachable&amp;xcust=1-1-350751-0-0-0&amp;sref=https://www.macworld.com/feed\">review</a> the Macalope found for the ThinkPad X12 had this to say:</p>\n\n\n\n<blockquote><p>That said, if I were planning lengthy digital inking sessions, I’d spring for the upgraded Precision Pen, which adds the capability for magnetic attachment to the tablet itself.</p></blockquote>\n\n\n\n<p>Silly Macalope. All reviews other than Sheffield’s are biased. Duh.</p>\n\n\n\n<p>As we are discussing things reviewers never mention, let us mention the one feature of the sucktacular iPadOS that Sheffield, like so many reviewers of Apple devices, somehow neglects to bring up: privacy. Some complain that Apple only uses privacy as a marketing tool which is like saying that Ford only uses engines as a marketing tool. If it’s actually in the device, it’s a feature.</p>\n\n\n\n<p>The iPad Pro is not cheap, certainly, and God knows Apple is still struggling with certain aspects of the device, particularly multitasking. But iPads are unmatched in terms of longevity. The iPad the Macalope had previous to his 11-inch Pro was an iPad Air 2, which he had for six years. And when he went to look up how long he’d had his 11-inch Pro, he was shocked to realize it was over two and a half years old. It feels brand new, even when using apps like Affinity Designer.</p>\n\n\n\n<p>An iPad Pro isn’t necessarily for everyone. But it’s still a fantastic device for many.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9b8978c3e4f74b7a01914b86b8efecb3ccad151a18d3178e29e60e68302259cb","category":"Apple"}