{"title":"How Vision Pro can replace every Apple device (one day)","link":"https://www.macworld.com/article/2229879/vision-pro-replace-iphone-ipad-mac-apple-watch-tv-homepod.html","date":1707391800000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Vision Pro is all about the future: if you think it’s too heavy or too expensive or hasn’t got enough apps, you’re just not thinking long term enough. Apple is aware that the smartphone won’t rule the tech roost forever, so it’s trying to build a platform for the next 20 years. The question isn’t whether it’s succeeded already–<a href=\"https://www.macworld.com/article/2222047/apple-vision-pro-reviews-roundup.html\">most reviewers</a> agree that it hasn’t–but whether it can succeed before time runs out.</p>\n\n\n\n<p>With this in mind, I’ve been thinking about the ways in which Vision Pro, or a future iteration of that product, can ultimately expand in scope to take the place of all the Apple products we currently use.</p>\n\n\n\n<h2>iPhone</h2>\n\n\n\n<p>Let’s start with the big one: the platform that currently dominates Apple’s revenues to an unhealthy degree, as well as holding an astonishing cultural headlock on smartphone buyers in the U.S. My guess is that finding a replacement for the iPhone was the principal motivating factor behind Apple starting this project in the first place.</p>\n\n\n\n<p>But does Vision Pro have the ingredients to match or even surpass the iPhone’s dominance? Not right now. Obviously–and this will apply to every product we discuss–it needs to reach a price point that’s in reach of far more people. But it also needs to become more accessible in other ways.</p>\n\n\n\n<p>There are four obstacles to overcome: it needs a less intimidating (and less novel) interface; it needs to be smaller and lighter; it needs 5G or whatever wireless connectivity comes next, and a bigger battery for on-the-go utility; and it needs to be socially less intrusive and isolating. If you want a device to become omnipresent in society, it needs to learn to fit in.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"iPhone 15 Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?quality=50&amp;strip=all 5469w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/10/iphone-15-pro-hero02.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>The iPhone is Vision Pro’s ultimate victim, but it needs some hardware upgrades first.</p></figcaption></figure><p>Jason Cross / Foundry</p></div>\n\n\n\n<p>That might seem like a lot, and it will take multiple generations to get there. But the first problem will resolve itself as more people try Vision Pro or the rival headsets that follow its lead, and realize that the controls are easier than they seem; novelty is a self-curing malady. Vision Pro will also naturally shrink and improve in battery performance over time since technology does that by default. And wireless connectivity is a straightforward hardware upgrade.</p>\n\n\n\n<p>Which leaves the issue of social isolation. The iPhone–or indeed the smartphone in general–would never have reached its present level of success if it only worked well on the sofa; instead, it became the device that everyone carries with them everywhere. Vision Pro needs to become something that people use on the bus without everyone staring, and that means, ultimately, it needs to become something much closer in external appearance to a pair of smart glasses… yet without losing the immersive experience you get from an enclosing headset. It’s a design and an existential challenge, to be sure.</p>\n\n\n\n<h2>Mac</h2>\n\n\n\n<p>This is a smaller target–the Mac made about a ninth of the revenues of the iPhone in Apple’s <a href=\"https://www.macworld.com/article/2225177/apple-ekes-out-a-small-year-over-year-revenue-gain-on-eve-of-vision-pro-launch.html\">most recent financial quarter</a>–but also an easier one for Vision Pro. The Mac occupies a less dominant place in its users’ lives, so replacing it is a simpler task.</p>\n\n\n\n<p>The Mac’s main selling point, the thing that has allowed it to resist its widely predicted cannibalization by the iPad, is its still-unmatched suitability for work. Vision Pro has the beginnings of such a function, thanks to its neat ability to sync effortlessly with… well, with a Mac as a virtual display. But there’s no reason why Apple can’t ultimately cut out the middleman and have Mac or Mac-esque software running on Vision Pro itself and keep the rest of the interface the same since it mostly works so well already.</p>\n\n\n\n<p>The only significant problem with this is typing, since Vision Pro’s software keyboard is hit-and-miss: most Vision Pro users say they became far more productive the moment they connected a Bluetooth keyboard and mouse. For the headset to become a one-stop shop, that isn’t going to work, and Apple needs to find a way to make virtual typing work better. Haptic feedback isn’t really an option–any kind of ‘smart glove’ accessories would be a step back–so the company should begin by tweaking the interface. Bearing in mind that software keyboards on smartphones used to be regarded as difficult to use, growing user expertise may be enough to meet Apple halfway.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Vision Pro\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?quality=50&amp;strip=all 2570w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=300%2C197&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=768%2C505&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=1200%2C789&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=1536%2C1010&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=2048%2C1347&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2024/01/Vision-Pro-1.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"789\" /><figcaption>Does there need to be a Mac involved at all?</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>iPad</h2>\n\n\n\n<p>What is the iPad best for? Casual tasks–checking email, watching movies, light gaming, and surfing the web–and bringing it wherever you go, be it a commuter train or a comfy sofa. It’s about making entertainment accessible everywhere.</p>\n\n\n\n<p>Vision Pro is some way off from covering this role. It can handle the sofa part of the equation, with the ability to offer unprecedentedly immersive videos and movies wherever you go in the home, but only the intrepid few are daring to wear the thing outside. As we mentioned when discussing the iPhone, this can be solved by turning Vision Pro into something more lightweight and less isolating. This will also help reduce neck strain when enjoying those multi-hour binge-watching sessions that the iPad is so good at. Of the iPhone, iPad, and Mac, the iPad feels like it’s in the most immediate jeopardy of replacement—especially since Vision Pro already runs lots and lots of iPad apps.</p>\n\n\n\n<h2>Apple TV</h2>\n\n\n\n<p>This is the easiest one: Vision Pro is already excellent at delivering entertainment in the home, which is Apple TV’s main job. Cut the weight a little and give Vision Pro the ability to serve as a smart home hub, and we’re done.</p>\n\n\n\n<h2>Apple Watch</h2>\n\n\n\n<p>What is the Apple Watch’s selling point? It started off as a timepiece and a notification delivery system you could access at any time without taking your iPhone out of your pocket, but it quickly found a better niche as a health and fitness device. If Vision Pro gets a <em>lot</em> slimmer and lighter it could theoretically work as a fitness companion–you’d have times and distances and geographical targets superimposed over what I’d hope would be a very clear view of the world around you–but it’s debatable how effectively such a device could monitor the same health metrics as the Apple Watch because it isn’t sited on a convenient pulse point.</p>\n\n\n\n<p>But wait… it’s possible to measure heart rate <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/circuitbreaker/2016/10/19/13329086/moov-hr-heart-rate-monitoring-wearable-fitness-sweatband&amp;xcust=1-1-2229879-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">through the forehead</a>. Now we’re talking!</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Ultra 2 review - Modular Ultra\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?quality=50&amp;strip=all 2231w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=1200%2C674&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=1536%2C863&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=2048%2C1151&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/11/Apple-Watch-Ultra-2-review-modular-ultra.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"674\" /><figcaption><p>Could Vision Pro pick up health sensors in the future?</p></figcaption></figure><p>Jim Martin / Foundry</p></div>\n\n\n\n<h2>AirPods and HomePod</h2>\n\n\n\n<p>Reviewers agree that Vision Pro delivers excellent audio already; the main reason why users would choose to use a pair of AirPods with the device is its leakage. If Vision Pro were equipped with <a href=\"https://www.techadvisor.com/article/722276/aftershokz-openmove-review.html\" target=\"_blank\">bone conduction audio</a> it would become far more appealing as an option for listening to music during a commute. It’s not clear what Apple’s path for the HomePod is, but if it gains a screen or better AI features. Vision Pro could do all that too.</p>\n\n\n\n<h2>Conclusion</h2>\n\n\n\n<p>Our journey is complete, and we’ve found a way for Vision Pro to replace every other major Apple product. All it needs to do is:</p>\n\n\n\n<ul>\n<li>Shrink down (while boosting battery performance)</li>\n\n\n\n<li>Gain 5G</li>\n\n\n\n<li>Improve virtual typing (without adding haptic glove accessories)</li>\n\n\n\n<li>Gain the ability to serve as a smart home hub</li>\n\n\n\n<li>Add a heart rate monitor and other health sensors</li>\n\n\n\n<li>Deliver bone-conduction audio</li>\n</ul>\n\n\n\n<p>Oh, and obviously cost a lot less. Do all that, Apple, and we’ll be first in line.</p>\n\nVirtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9b91cac301782ded029e4e09514d612408b65f3cacdc3dba09eb9da2f77a7671","category":"Apple"}