{"title":"The possible therapeutic role of intravenous lipid emulsion in acute aluminium phosphide poisoning: a randomized controlled clinical trial","link":"https://academic.oup.com/toxres/article/doi/10.1093/toxres/tfae090/7692333?rss=1","date":1718236800000,"content":"<span><div>Abstract</div><div>Introduction</div>Aluminum phosphide (ALP) is a highly toxic rodenticide and the mortality rates caused by it have been demonstrated up to 70–100% in various studies. Unfortunately, there is no specific antidote to manage its toxic effects. This study aimed to assess the biochemical and clinical efficacy and safety of intravenous lipid emulsion as an adjuvant therapy in acute aluminum phosphide poisoning.<div>Patients and methods</div>Sixty-four cases with acute ALP poisoning were stratified according to severity by the Poison Severity Score into severe and moderate groups (32 patients each). Patients were then randomly allocated into either receiving intravenous lipid emulsion in addition to the conventional treatment or receiving the conventional treatment only by using block randomization.<div>Results</div>Treatment by ILE resulted in a significant improvement in the survival time, the mean arterial blood pressure, arterial blood gases, and a significant reduction in serum lactate levels. The need for intubation and mechanical ventilation was insignificantly lower in the intervention groups compared to control groups. However, the reduction in mortality rate in the patients of intervention groups compared with control groups was found to be non-significant. Intravenous lipid emulsion use in acute ALP poisoning significantly prolonged the survival time, improved the metabolic acidosis, decreased the serum lactate levels and increased the mean arterial blood pressure and hospital stay in the intervention groups. And insignificantly decreased the mortality rate, need of intubation and mechanical ventilation, and the total dose of vasopressors.</span>","author":"","siteTitle":"Toxicology Research Current Issue","siteHash":"b4c183320fbed6120c93a640e0e7a17777c96543a048ebef2a2041a7da93a66a","entryHash":"9b94637d8d37bce62632f74a621d4b2f375d8668948a6d1fcd4b9d997e74caca","category":"Environment"}