{"title":"Inventions, innovations and the origins of spelt wheat","link":"http://link.springer.com/10.1007/s00334-023-00978-2","date":1719792000000,"content":"<h3>Abstract</h3>\n                    <p>What turns an invention into an innovation? How, if at all, might we observe this process archaeologically? Loosely put, new varieties of plants or animals might be considered as inventions (whether from deliberate breeding or by chance), but ones that are only taken up by humans more systematically as innovations when certain social, demographic, economic and environmental factors encourage such take-up. The archaebotanically-observed history of spelt wheat (<em>Triticum spelta</em>) is an interesting case in this respect. Prior to 3000 <span>bce</span>, spelt is occasionally found in very small amounts at sites in eastern Europe and south-west Asia, but is usually considered to be a crop weed in such contexts, rather than a cultivar. However, rather suddenly across Central Europe ~ 3000−2500 <span>bce</span> spelt appears more consistently at multiple Chalcolithic and especially Bell Beaker sites, in quantities which suggest a shift to its use as a deliberate crop. By the full-scale Bronze Age in this region, spelt becomes one of the major crops. This paper discusses this Central European process in greater detail via macro-botanical evidence. It argues that demographic factors during the Neolithic may have inhibited the spread of Asian spelt into central Europe, and that while small amounts of local European spelt were probably present earlier on, it was only at the very end of the Neolithic, in tandem with human population increases and major technological changes such as the introduction of the plough that spelt was taken up as a cultivar. In particular, a shift by some communities in the region ~ 3000−2500 <span>bce</span> to more extensive (and sometimes plough-enabled) agricultural strategies may have favoured deliberate cultivation of spelt on less productive soils, given this variety’s relative robustness to harsher conditions. In other words, a combination of conditions was necessary for this innovation to really take hold.</p>","author":"","siteTitle":"SPRINGER Earth Sciences","siteHash":"166bc39ae9940063147ac151ace0074199efd889a447fa33929d8fa2ea20d31e","entryHash":"9b95a4874024b3b4ea7a556e6f0b8ce34464f82ae52fd10471acf3d0459bb7a7","category":"Environment"}