{"title":"Lost AirTags Can Be Read By NFC-Enabled iPhones and Android Devices","link":"https://www.macrumors.com/2021/04/21/lost-airtags-read-nfc-android-phones/","date":1618991002000,"content":"Apple's AirTag tracking devices can be identified by Android phones when they're in Lost Mode, according to a new support document published by Apple.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/airtag-notification.jpg\" />\r\n<br />\r\n<a href=\"https://www.macrumors.com/2021/04/20/apple-unveils-airtags-tracking-devices/\">Announced on Tuesday</a>, Apple's new AirTag item trackers let you easily track things like your keys, wallet, purse, backpack, luggage, and more. They work using an ultra-wideband U1 chip to keep in touch with the <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> network. \r\n<br />\r\n\r\n<br />\r\nHowever, what Apple didn't highlight in its announcement is that when an AirTag is placed in Lost Mode by the user, its discovery message be read by any NFC-enabled device, including not just iPhones but also Android phones.\r\n<br />\r\n\r\n<br />\r\nAccording to Apple, tapping an AirTag and holding the white side to an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> or other NFC-capable device will display a notification with a tappable link that offers information about the AirTag, including whether it has been marked as lost by the owner and their contact details. From the <a href=\"https://support.apple.com/en-us/HT212227\">support document</a>:\r\n<br />\r\n<blockquote>Tap and hold the top of your ‌iPhone‌ or NFC-capable smartphone to the white side of the AirTag. Tap the notification that appears. This opens a website that provides information about the AirTag, including its serial number. If the owner marked it as lost, you might see a message with information about how to contact the owner. You can contact the owner to let them know that you found their AirTag. You can view a Lost Mode message on any NFC-capable smartphone, such as an ‌iPhone‌ or Android phone. </blockquote>It's worth noting that <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> require an iOS device and ‌Find My‌ to set them up, so it's not as if this means the trackers will be useful to Android users, but their NFC compatibility does mean that Apple users have a higher chance of recovering lost items.\r\n<br />\r\n\r\n<br />\r\n‌‌AirTags‌‌ start at $29 each or $99 for a four-pack. Online orders open this Friday, April 23, with ‌‌AirTags‌‌ shipping April 30.<div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/21/lost-airtags-read-nfc-android-phones/\">Lost AirTags Can Be Read By NFC-Enabled iPhones and Android Devices</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/lost-airtags-can-be-read-by-nfc-enabled-iphones-and-android-devices.2292529/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ESbebpCyJV8:keTJgj9nNII:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=ESbebpCyJV8:keTJgj9nNII:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/ESbebpCyJV8\" />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9b9c9e7268bc35ad49e855ff471b220d31461c321f4a94b496f2ea9e8c6b7e16","category":"Apple"}