{"title":"Preparation of spore‐immobilized glutathione reductase and its application in inhibiting browning of pear wine","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13524?af=R","date":1720851246000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>Browning is the key problem hindering the industrialization of pear wine. The use of high-yield glutathione <i>Saccharomyces cerevisiae</i> in the fermentation of pear wine can inhibit browning. Glutathione reductase (GR) can ensure the reduction of glutathione. Spore immobilization of enzymes is a new technology. It is a new attempt to apply spore-immobilized GR in combination with high-yield glutathione <i>S. cerevisiae</i> to inhibit browning of pear wine.</p>\n<h2>Results</h2>\n<p><i>Saccharomyces cerevisiae</i> spore immobilization enzyme technology was used to immobilize GR in the spores of mutant <i>S. cerevisiae dit1∆</i>, <i>osw2∆</i> and <i>chs3∆</i> and wild-type <i>S. cerevisiae</i>. The enzyme activity of GR immobilized by <i>chs3∆</i> spores was the highest of 3.08 U mg<sup>−1</sup> min<sup>−1</sup>. The <i>chs3∆</i> spore-immobilized GR had certain resistance to ethanol, citric acid, sucrose, glucose and proteinase K. Electron microscopy analysis showed that the spore wall of <i>chs3∆</i> had moderate size holes, which might be the main reason why it immobilized GR with the highest enzyme activity. And the GR was immobilized between the prespore membrane and mannoprotein layer of the spore wall. When <i>chs3∆</i> spore-immobilized GR (<i>chs3∆</i>-GR) was added to Dangshan pear wine fermented by high-yield glutathione <i>S. cerevisiae</i> JN32-9, the presence of <i>chs3∆</i>-GR could further protect amino acids, polyphenols and glucose from oxidation, thereby reducing the browning of the pear wine during storage by 47.32%.</p>\n<h2>Conclusion</h2>\n<p>GR immobilized by <i>S. cerevisiae</i> spores was effective in inhibiting the browning of pear wine. The method was simple, green and effective and did not increase the production cost of pear wine. © 2024 Society of Chemical Industry.</p>","author":"Hua Yang, \nShang Wang, \nMing Chen, \nJian Lu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9ba971d0e588c91be7e2f5a2235ba8b1846a17964c84f32b463c4503e6b8b48d","category":"Environment"}