{"title":"Delivery platforms for reaching adolescents with nutrition interventions in low‐ and middle‐income countries","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15196?af=R","date":1724520566000,"content":"<img src=\"https://nyaspubs.onlinelibrary.wiley.com/cms/asset/442bdb7a-a07c-446c-9a7b-40e5b2571c6a/nyas15196-gra-0001-m.png\" alt=\"Delivery platforms for reaching adolescents with nutrition interventions in low- and middle-income countries\" />\n<p>This scoping review describes delivery modalities for providing nutrition services to vulnerable adolescents in low- and middle-income countries (LMICs). Through a comprehensive analysis of 86 publications, various effective platforms were identified, including school-based initiatives, health facilities, community-based approaches, social safety nets, and technology-based solutions. These mechanisms targeting adolescents for health and development present opportunities for the provision of nutrition interventions to this challenging-to-reach group.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Adolescents in low- and middle-income countries (LMICs) are a vulnerable population given increased nutritional needs as puberty approaches. School-based nutrition programs exist in some settings, but the comprehensive provision of nutrition services requires knowledge of the mechanisms to reach out-of-school adolescents. A comprehensive scoping review was performed using formal and informal search strategies to landscape all potential delivery platforms with nutrition services to reach adolescents. Peer-reviewed studies, institutional strategies, program evaluations, and programmatic reports in LMICs were reviewed, including gray literature. A total of 87 out of 270 identified publications and reports describing nutrition programs for adolescents were identified. Although nutrition programs targeted at adolescents were sparse, various innovative and inclusive delivery platforms were included, such as school feeding programs, school-based anemia control, and nutrition-friendly school initiatives; health facility–based, youth-friendly health and nutrition services; social safety nets targeted at adolescents; community-based approaches targeting youth development and peer education within youth centers and faith-based settings; and technology-based platforms, including digital health services and mass media communication sensitization and mobilization efforts. Existing delivery mechanisms and platforms in health and other sectors that target adolescents offer great potential to extend nutrition interventions to this vulnerable yet hard-to-reach population.</p>","author":"Mahum Khizar, \nJulie Ruel‐Bergeron, \nEleonor Zavala, \nKaren Chang, \nYunhee Kang, \nSaskia de Pee, \nRobert E. Black, \nParul Christian","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"9bbd5d0c83da9fd9ab54f4231db344ca3daeb66928c8a6514afd51e14af697d9","category":"Environment"}