{"title":"A Growth Mindset Scale for Young Children (GM-C): Development and validation among children from the United States and South Africa","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0311205","date":1728309600000,"content":"<p>by Melis Muradoglu, Tenelle Porter, Kali Trzesniewski, Andrei Cimpian</p>\r\n\r\nBeliefs about the malleability of intellectual ability—mindsets—shape achievement. Recent evidence suggests that even young children hold such mindsets; yet, no reliable and valid instruments exist for measuring individual differences in young children’s mindsets. Given the potential relevance of mindsets to children’s achievement-related behavior and learning, we developed and tested the psychometric properties of the Growth Mindset Scale for Children (GM-C). Among other psychometric properties, we assessed this instrument’s (a) factor structure, (b) measurement invariance, (c) internal consistency, (d) temporal stability (test-retest reliability), (e) concurrent validity, and (f) cross-cultural robustness in samples of US children (Study 1; <i>N</i> = 220; ages 4 through 6; 50% girls; 39% White) and South African children (Study 2; predominantly grades 4 and 5; <i>N</i> = 331; 54% girls; 100% non-White). The GM-C scale exhibited four factors, representing beliefs about the instability of low ability, the malleability of low ability, the instability of high ability, and the malleability of high ability. The GM-C scale also demonstrated invariance across age, acceptable internal consistency (αs between .70 to .90), and moderate temporal stability over approximately one month (<i>r</i>s between .38 to .72). Concurrent validity was supported by significant relations between children’s scores on the subscales about low ability and their goal orientations (Studies 1 and 2), challenge-seeking behavior, and achievement in math and English (Study 2). These findings suggest that the GM-C scale is a promising tool for measuring mindsets in young children. We offer practical recommendations for using this new scale and discuss theoretical implications.","author":"Melis Muradoglu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9bbd724be367f488f3f0a1d4b6358bbea22dc4b0b35178bbce7e5d0b99234b52","category":"Interdisciplinary"}