{"title":"Virtual racing results now have real-world implications","link":"https://cyclingtips.com/2021/08/virtual-racing-results-now-have-real-world-implications/","date":1629481862000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/joemartin-650x392.jpg\" /></div><h2>Virtual racing results now have real-world implications</h2><p>\n</p><p>Last June, with outdoor racing on a hiatus around the world, Jordan Cheyne (Elevate-Webiplex) and Lauren Stephens (Tibco-SVB) put their Zwifting chops on display at the Virtual Joe Martin Stage Race, organized by Project Echelon. While the traditional event was called off for 2020, Cheyne and Stephens nonetheless took virtual victories from aboard their trainers.</p>\n\n\n\n<p>A little over a year later, the outdoor Joe Martin Stage Race is set to return to the roads of Northwest Arkansas, and Cheyne and Stephens are set to make the start – wearing the race leader’s jerseys.</p>\n\n\n\n<p>According to race organizers, Cheyne and Stephens will open the race in the yellow and pink jerseys, respectively, and their squads will have the number one team cars by virtue of their wins in the virtual event last year.</p>\n\n\n\n<p>Project Echelon racing director Eric Hill said that the virtual event organizers “decided that we wanted the virtual event to give people real ties to the Fayetteville community and the race itself,” and that tying the 2020 virtual event to an opportunity to start the 2021 outdoor event in the leader’s jersey was one way of making that happen.</p>\n\n\n\n<p>“On the men’s side, Jordan Cheyne put together some massive and consistent performances to win the overall, with the foundations laid in the uphill TT. On the women’s side, Lauren Stephens dominated the race from start to finish, an event that was a catalyst to future successes in virtual racing later in the year,” Hill said.</p>\n\n\n\n<p>“So, here we are, attending the first UCI stage race in North America since the onset of COVID-19 and we are on the verge of making history by having the race leader of the event identified prior to the start of Stage 1 as a result of virtual racing. For us, it is opportunity to expand our reach and influence and grow the sport as whole and we are excited to see this vision continue to come to life.”</p>\n\n\n\n<p>As far as the organizers know – and as far as we know – this marks the first time a virtual race outcome has afforded a rider the opportunity to wear the leader’s jersey to start a real outdoor UCI-sanctioned event. Could it be a sign of things to come in other races? Or is it just a one-off oddity in the latter half of what have been two very, very unusual years for cycling and the world generally? Only time will tell.</p>\n\n\n\n<p>The Joe Martin Stage Race gets underway on Thursday, August 26.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/virtual-racing-results-now-have-real-world-implications/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9bbdf039a31173c79c6a1ce24dccd3c058f778a467f33eda1bd7ee8b8dadf5b8","category":"Cycling"}