{"title":"Development and Validation of a Machine Learning Model for Predicting Endoscopic Intervention in Upper Gastrointestinal Bleeding","link":"https://www.preprints.org/manuscript/202403.1832/v1","date":1711709605000,"content":"This study aimed to introduce a novel machine learning (ML) model designed to predict the need of interventions during endoscopy in patients with upper gastrointestinal bleeding (UGIB). The risk stratification tools in current use, such as the Glasgow Blatchford Score (GBS) and pre-endoscopic Rockall score, have limitations in accurately predicting the need for endoscopic interventions. All patients diagnosed with UGIB from January 2013 to October 2023 who underwent endoscopy were included in the study. Variables extracted included demographics, social history ,clinical history, clinical presentation and symptoms, drug history, management prior to endoscopy, findings during endoscopy, laboratory variables and vitals, and post-endoscopic results. Three machine learning models including Random Forest Classifier (RFC), Gradient Boosting Classifier (GBC), and AdaBoost Classifier were used to evaluate the need for intervention during endoscopy in our study. A total of 1372 patients were included from three major hospitals in Jordan, of whom 242 underwent endoscopic intervention. The GBC outperformed all other models and pre-endoscopic scores in predicting the need for endoscopic intervention with an area under the curve of 0.861. Findings during endoscopy, platelet count, pulse rate and systolic blood pressure during admission were the most contributing features in predicting the need for the need of endoscopic intervention. This study highlights the potential of machine learning models in enhancing decision making for UGIB management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9bc2032984c40a294b3ec5bb5d7e1eb1e955260f76129bf5f338776321d9e273","category":"Interdisciplinary"}