{"title":"Escaping the midway trap: A mixed method study highlighting roadblocks and coping mechanisms of female researchers in Cameroon","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0001759","date":1729692000000,"content":"<p>by Nicole Fouda Mbarga, Sylviane Maffo Tsinda, Corinne Tchoula Mamiafo, Marcel Mbarga, Lamare Tchachoua, Julienne Ngo Likeng, Mireille Ndje Ndje, Emilienne Epee, Olga Bassong, Yap Boum II, Sylvie Kwedi Nolna</p>\r\n\r\nAcross the world, women make most of the health workforce, but remain underrepresented in academia. This is even worst in Sub-Saharan Africa where women are the least represented as first and last authors in publications, especially in francophone countries. However, there is a lack of data on the reason explaining this inequity. Therefore, we sought to describe challenges which hinder the growth of Cameroonian female researchers and conducted a mixed method study over one year from January 2020 to December 2020. We included Cameroonian female researchers in health. For the quantitative arm, data was collected through an online google questionnaire. In-depth interviews were organized for the qualitative arm. Data was analyzed using python software version 21 for the quantitative arm and content analysis was performed for qualitative data. A total of 119 participants were included in this study. Most participants were aged between 25 and 35 years (72%) and they were Christians (94%). The majority had at least a PhD degree (29.6%) and they came from the West region of Cameroon (34.2%) the Northern regions were grossly underrepresented. More than half of our participants faced issues with balancing career, work, and academia and this is linked to culture. Socioeconomic, sociocultural, institutional, and environmental roadblocks hinder the progress and research productivity of most female researchers. The burden of unpaid maternity leaves, and sexual harassment remains high for most women. The use of English language as <i>lingua Franca</i> is perceived as another barrier for one on two women. However, there are coping strategies adopted by female scientists including the development of soft skills such as self-confidence, determination, and hard work. Extrinsic factors such as global policy, international partnerships, workshops, mentorship, and networking are also supporting women in global health. Gender-based interventions are critical to support women in escaping the midway trap.","author":"Nicole Fouda Mbarga","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9bc459a94ed7ff92d3e6a172b03de1c02bb6ca9be7e35fe25456b24c1d705677","category":"Environment"}