{"title":"Apoptotic and Antiproliferative Effect of Thymoquinone on Ovarian Adenocarcinoma Cell Line Via The RAS/RAF Signaling Pathway","link":"https://www.preprints.org/manuscript/202407.2327/v1","date":1722290621000,"content":"Aim: Ovarian cancer is one of the most frequently diagnosed cancers in women in the world. Recognition of the differences between tumors in cancers and resistance to treatment in patients have made the treatment potential of chemotherapy, radiotherapy and immunotherapy controversial. Especially against drug resistance, laboratories have implemented the drug diversion system by putting old drugs into new forms. In this study, the cytotoxic and apoptotic effects of the combination of doxorubicin (DX) and thymoquinone (TQ) on ovarian adenocarcinoma cells (OVCAR3) were investigated.\nMaterial Method: OVCAR3 cell line was cultured in RPMI medium containing 10% FBS, 1% penicillin/streptomycin. Cell viability and cell growth rate were determined by MTT viability test by combining doxorubicin and thymoquinone. Nucblue immunofluorescent staining was used to determine the mechanism of cell death at different doses of doxorubicin and thymoquinone compounds, qRT-PCR to determine the pathways underlying the apoptotic mechanism, and western blot methods to show protein levels.\nResult: We found that the combination of DX and TQ reduced the viability of OVCAR3 cells (MTT assay), induced apoptosis (RAF, RAS, Bcl2, Bax by qRT-PCR) and increased RAF, RAS protein levels in TQ and DX-treated cells by western blot analysis.\nConclusion: The results obtained revealed for the first time that combining DX and TQ also had cytotoxic/apoptotic and anti-proliferative effects against ovarian adenocarcinoma cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9bcb9afb528a783cb549c398d116bbd9432a29191fca189283fb4796a3bbbb05","category":"Interdisciplinary"}