{"title":"Comparative efficacy of anti-vascular endothelial growth factor on diabetic macular edema diagnosed with different patterns of optical coherence tomography: A network meta-analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304283","date":1717768800000,"content":"<p>by Jiajia Yao, Wanli Huang, Lixia Gao, Yan Liu, Qi Zhang, Juncai He, Li Zhang</p>\r\n\r\nIntravitreal anti-vascular endothelial growth factor (anti-VEGF) injections have emerged as the most common therapeutic approach for the management of diabetic macular edema (DME). Despite their proven superiority over other interventions, there is a paucity of data regarding the relative effectiveness of anti-VEGF agents in treating DME diagnosed with different patterns of optical coherence tomography (OCT). In this regard, we conducted a systematic review and comparative analysis of the therapeutic efficacy of intravitreal bevacizumab, ranibizumab, aflibercept, and conbercept in the management of DME with diffuse retinal thickening (DRT), cystoid macular edema (CME), and serous retinal detachment (SRD) patterns identified using OCT. Our study encompassed a comprehensive search of PubMed, Embase, Web of Science, China National Knowledge Infrastructure (CNKI), and Wan Fang Data from their inception until January 25, 2023. The network meta-analysis involved the inclusion of 1606 patients from 20 retrospective studies with a moderate risk of bias but no evidence of publication bias. The DRT group had the highest increase in best-corrected visual acuity (BCVA) with anti-VEGF, while the SRD group had the greatest reduction in Central Macular Thickness (CMT). Furthermore, conbercept, ranibizumab, and bevacizumab, respectively, showed the best treatment outcomes for patients with DRT, CME, and SRD in terms of improvement in BCVA. And, conbercept exhibited the highest reduction in CMT in the DRT, CME, and SRD groups. In conclusion, our study highlights the efficacy of anti-VEGF agents in the management of DME and provides valuable insights into the selection of anti-VEGF agents tailored to the individual needs of patients.","author":"Jiajia Yao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9bcd40034caf81f8138da40663cb3e6b1c24e9ed4745959ffd2db0b0855a6b52","category":"Interdisciplinary"}