{"title":"Sustainability of Kikuyu Grass (Pennisetum clandestinum) for the Development of Highland Livestock Farming in the Northern Macro-Region of Peru","link":"https://www.preprints.org/manuscript/202410.1340/v1","date":1729146769000,"content":"The productive sustainability of Pennisetum clandestinum in the Peruvian highlands was evaluated through productivity, growth and chemical composition. The effect of the nitrogen (N2) dose applied to the soil, the use of organic matter and the frequency of cutting or phenological age on the productive yields, chemical composition, plant height and growth rate of Kikuyu were determined. Experimentation was carried out under a randomised block design in divided plots. A multivariate analysis of variance (MANOVA) was used to determine the associated differences in each study factor. It was determined that applying 120 kg of N2 increases the annual protein production to 3 454.53 kg ha-1. yr-1, and a crude protein (CP) level of 23.54%, the distance of the live fences influences the biomass production to 19 176.23 kg DM ha-1 at an interval of 8.5 to 11.5 meters from the base of the cypress tree (Cupressus lusitanica). Organic matter favours the biomass yield of Kikuyu. Although there is no difference in dry matter production between 30 and 60 days of cutting, CP production is higher at 30 (p&amp;lt;0.05). The highest DM production per day is obtained at 45 days, generating a higher biomass accumulation of 21 186.9 kg DM ha-1. yr-1. The consideration of Pennisetum clandestinum for dairy cattle is viable, taking into account that the possibility of implementing a plant improvement programme on this species is open, aimed at increasing the composition of the diet in high-production cows due to its high yield and good chemical composition in highland conditions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9bd425bf542a9d539f304014b11135f74cf99161d9a4013103bf6bcf8d331f2f","category":"Interdisciplinary"}