{"title":"The distribution of the juvenile stages and eggcases of skates (Rajidae) around the British Isles","link":"https://onlinelibrary.wiley.com/doi/10.1002/aqc.4149?af=R","date":1714114800000,"content":"<h2>Abstract</h2>\n<p>\nSkates (Rajidae) include species of conservation and commercial importance, but there is limited information regarding their ecologically important habitats, including spawning and nursery areas, in northern European seas.\nData on the distribution, relative abundance and length composition of skates were collated from scientific trawl surveys, and based on length-frequency information, length-at-hatching and length-at-maturity, skates were allocated to length-based categories representing early-juvenile stages (EJS) and mid-juvenile stages (MJS).\nCitizen science data were used to inform on the occurrence of eggcases. The Great Eggcase Hunt (starting in 2003) citizen science recording project collects georeferenced data for elasmobranch eggcases, primarily from around the British Isles. This provided verified species-specific data for a total of 227,407 specimens from 11 skate species. Purse Search Ireland (starting in 2005) provided a further 2491 records of 10 skate species from around Ireland.\nThe most frequently observed skate eggcases were from the genus <i>Raja</i> and occurred around much of the British Isles. The EJS and MJS of such species were observed most frequently in inshore waters. Data for EJS were more limited for <i>Raja microocellata</i> and <i>Raja undulata,</i> indicating that the EJS of these species occur in shallower (&lt;20 m) waters.\nJuveniles of the genus <i>Leucoraja</i> occurred further offshore. Only the eggcases of <i>Leucoraja naevus</i> were recorded regularly, with the eggcase of <i>Leucoraja fullonica</i> described here.\nThe data collated here provide an overview of skate spawning and nursery areas, thus informing fisheries management and marine spatial planning, including the identification and delineation of Important Shark and Ray Areas (ISRAs).\n</p>","author":"Jim R. Ellis, \nCat A. Gordon, \nHarriet L. Allen, \nJoana F. Silva, \nChristopher Bird, \nGraham Johnston, \nBríd O'Connor, \nSophy R. McCully Phillips, \nAli Hood","siteTitle":"Wiley: Aquatic Conservation: Marine and Freshwater Ecosystems: Table of Contents","siteHash":"53f1a0c472ad7591633d0b281e1df2834126145a77ec9c0585f4049ad3e52c8f","entryHash":"9bd7f3c043ed75c7dab1e9897d78c7a343409a624ddc434e138f53f4d07b3805","category":"Environment"}