{"title":"Paris-Nice 2024: Essential guide to the Race to the Sun","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-nice","date":1709109000000,"content":"\n      <p><b>Date:</b><span> Sunday March 3, 2024 - Sunday March 10, 2024<br /></span><b>Start:</b><span> Les Mureaux<br /></span><b>Finish: </b><span>Nice <br /></span><b>Total distance:</b><span> 1,220.6km <br /></span><b>Teams:</b><span> 22 <br /></span><b>Defending champion: </b><span>Tadej Pogačar (UAE Team Emirates)</span></p>\n<p><span>Now in its 82nd edition, Paris-Nice, also named the Race to the Sun, has become one of the most critical races in many riders' calendars outside of the three Grand Tours. Run by ASO, the same company which runs the </span><a href=\"https://www.rouleur.cc/pages/tour-de-france\"><span>Tour de France</span></a><span> and Paris-Roubaix, Paris-Nice is a testing week-long tour, with competing riders needing to be good climbers and time triallists to be in with a chance of winning. Much like the Tour, the leader in the general classification will wear a yellow jersey. </span></p>\n<p>Sean Kelly holds the record for victories in this race having won seven consecutive editions from 1982 until 1988. The only other rider to come close to Kelly’s record is French rider Jacques Anquetil, who won the Paris-Nice GC on five occasions. No one in recent years has come close to rivalling Kelly’s dominance. </p>\n<p>The defending champion is Tadej Pogačar, who in 2023 won the race for the first time in his career. However, the 25-year-old Slovenian rider will not be back to defend his title in favour of racing Tuscany’s Strade Bianche. Despite last year’s winner not on the starting line for the 82nd edition, an exciting battle awaits fans as the 2022 winner Primož Roglič (Bora-Hansgrohe) will make his season debut for his new team after moving from Visma-Lease a Bike at the end of last season, and he will go head-to-head with Soudal–Quick-Step’s GC superstar, Remco Evenepoel, who has never raced Paris-Nice before.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg07_pogacar07_paris-nice_2023.jpg?v=1709113686\" /></p>\n<h3><b>Paris-Nice teams: </b></h3>\n<ul>\n<li><span>Alpecin-Deceuninck </span></li>\n<li><span>Arkea-B&amp;B Hotels</span></li>\n<li><span>Astana Qazaqstan</span></li>\n<li><span>Bahrain-Victorious</span></li>\n<li><span>Bora-Hansgrohe </span></li>\n<li><span>Cofidis </span></li>\n<li><span>Decathlon AG2R La Mondiale Team</span></li>\n<li><span>EF Education-EasyPost</span></li>\n<li><span>Groupama-FDJ</span></li>\n<li><span>Ineos Grenadiers</span></li>\n<li><span>Intermarché-Wanty</span></li>\n<li><span>Israel-Premier Tech</span></li>\n<li><span>Lidl-Trek</span></li>\n<li><span>Lotto Dstny</span></li>\n<li><span>Movistar</span></li>\n<li><span>Soudal–Quick-Step</span></li>\n<li><span>Team dsm-firmenich PostNL</span></li>\n<li><span>Jayco Alula</span></li>\n<li><span>Visma-Lease a Bike</span></li>\n<li><span>TotalEnergies</span></li>\n<li><span>Tudor Pro Cycling </span></li>\n<li><span>UAE Team Emirates</span></li>\n</ul>\n<h3><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg03_jumbo_visma_vingegaard_paris-nice_2023_024f0e73-ebd7-47e9-879b-1fcc309b00b3.jpg?v=1709113773\" /></h3>\n<h3><b>Paris-Nice route: </b></h3>\n<p><span>The 2024 edition follows a similar format to previous years with the race starting in Les Mureaux, a suburb to the north-west of Paris, before heading south towards Nice where the race finishes. It is a well-rounded race, featuring a team time trial, a chance for the sprinters, a medium mountain stage and plenty of opportunities for those who love the high mountains. </span></p>\n<p>Stage one is littered with category three climbs – four to be precise over the 157km route. The first of those four arrives after just 10km of racing and is 1.7km with an average gradient of 6.6%. The other three come in the second half of the stage, featuring similar stats. Those looking to target the GC will have no time to ease into the race and will have to be cautious of any breakaway chancers looking to get a substantial early lead. </p>\n<p>Stage two from Thiory to Montargis is a relatively flat stage, but it is exposed, and therefore the wind can play a critical factor in who wins the stage. However, the short downhill into a flat finish should favour the sprinters of the bunch before the arrival of the team time trial on stage three. At 26.9km, the TTT is shorter than last year’s stage, but is more undulating, so will require more pacing and tactics amongst the teams. </p>\n<p>The following stage sees the first summit finish atop Mont Brouilly, which was meant to feature in the 2016 edition, however, due to snow, the peloton did not ascend this 3km climb. Before taking on the summit finish however, the peloton will need to tackle five category two (including a trip up and over Mont Brouilly) and one category one climb, totalling over 3,000 metres of elevation on this stage. </p>\n<p>Stages five and six are easier and will favour the breakaway as the race makes it way further down south. Stage five features four category three climbs which could provide any brave rider the springboard to get away. However, a long downhill and relatively flat finish may cause the sprinting teams to catch anyone who has gone clear in order to contest for the stage win. Stage six is a similar stage, but 20km from the end, a 1.9km climb with an average gradient of 10%, peaking at an eye-watering 19%, could stop any fast finishers from reaching the line first. </p>\n<p>The penultimate stage of the race is where the peloton will get a real taste of the upcoming Tour de France. The stage starts in Nice and will climb the category two Côte de Gattières, before the La Colmiane – a 7.5km climb with an average gradient of 7.1% – and features in the race in July. After reaching Isola, the Paris-Nice route makes its own tracks, turning towards Auron, where the stage will close on a summit finish. </p>\n<p>Starting and finishing in Nice, the final stage of the race is no walk in the park. Over the short 109km stage, the riders will face three category two climbs and two category one climbs in the second half of the stage. The final climb, just 10km from the finish, is 3.6km in length and sees peaks of 16%. If there are small time gaps between the top 10, no rider will be able to rest on their laurels. </p>\n<p><b>Stage one: </b><span>Les Mureaux - Les Mureaux / 158km<br /></span><b>Stage two: </b><span>Thoiry - Montargis / 179km<br /></span><b>Stage three: </b><span>Auxerre - Auxerre / 26.9km (TTT)<br /></span><b>Stage four:</b><span> Chalon-sur-Saône - Mont Brouilly / 183km<br /></span><b>Stage five:</b><span> Saint-Sauveur-de-Montagut - Sisteron / 193.5km <br /></span><b>Stage six:</b><span> Sisteron - La Colle-sur-Loup / 198.5km <br /></span><b>Stage seven:</b><span> Nice - Auron / 173km<br /></span><b>Stage eight: </b><span>Nice - Nice / 109.5km </span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9bdf2eed898041fab0a7e83a23cf4529da413f33522e1862648a356bb03969cb","category":"Cycling"}