{"title":"Evaluation of Different Anti-Browning Treatments on the Quality of Potato (Solanum tuberosum L.) from Colombian Varieties as Raw Material for the Development of Minimally Processed Products","link":"https://www.preprints.org/manuscript/202410.1459/v1","date":1729503945000,"content":"The increasing demand for fresh and convenient foods has led to the production of Minimally Processed Products (MPP), making them more suitable for culinary and industrial uses. However, cutting potatoes can trigger browning, negatively impacting their sensory and nutritional quality. This study aimed to evaluate different anti-browning methods on Colombian potato varieties (Diacol Capiro, Pastusa, Nevada, and Sabanera) as raw materials for the development of MPP. The physicochemical properties evaluated included moisture, pH, acidity, enzymatic activity, total phenolic content, vitamin C, and browning index. The anti-browning treatments involved immersing the potatoes in citric acid (1%), ascorbic acid (1%), and garlic extract (0.5%). Evaluations were carried out over a 15-day storage period at refrigerated conditions. The results indicated that the Sabanera variety had the highest browning index, followed by Nevada, while Diacol Capiro and Pastusa showed lower browning indices even without the use of technological coadjuvants. Among the treatments, citric acid proved to be the most effective across all varieties, with Diacol Capiro exhibiting the least browning after 15 days. Garlic extract was the least effective against browning. Sensory analysis indicated that the acidic descriptor was noted for both treated (with citric acid) and untreated (control) Diacol Capiro potatoes at similar intensities, suggesting that citric acid did not negatively affect sensory quality and/or was masked during cooking, enhancing overall quality. In conclusion, the Diacol Capiro variety treated with 1% citric acid is the most appropriate choice for use as raw material for MPP without compromising sensory quality.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9beb595b00802c582e0675517e22af49fbf326e0c29ef709166749494c0183d2","category":"Interdisciplinary"}