{"title":"iPhone 15 OLED Supplier Still Plagued by Leaky Light Issues","link":"https://www.macrumors.com/2023/12/05/iphone-15-oled-supplier-problems-persist/","date":1701781496000,"content":"Apple supplier BOE still can't catch a break in its production of OLED displays for iPhone 15 models. According to a new report by <em><a href=\"https://www.digitimes.com/news/a20231205PD204.html\">DigiTimes</a></em>, the Chinese-based manufacturer is still struggling to expand panel supply due to yield issues.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2022/05/iphone-15-dynamic-island.jpg\" width=\"2096\" height=\"1179\" />\r<br />\nDespite investing in panel research and development, BOE has continually struggled with yield rate problems, particularly for OLED panels for the iPhone 15 basic model. The panels were conditionally approved for mass production by Apple in <a href=\"https://www.macrumors.com/2023/03/27/apple-samsung-oled-iphone-15-panels/\">March 2023</a>, but in September the supplier <a href=\"https://www.macrumors.com/2023/09/12/iphone-15-oled-display-orders-dominated-by-samsung/\">failed to get formal approval</a> and Apple ended up dropping the order.\r<br />\n\r<br />\nBOE was supposed to be supplying OLED displays for both the standard ‌iPhone 15‌ and larger ‌iPhone 15‌ Plus, but that fell through when the manufacturer experienced problems with light leakage around the portion of the OLED display where the pill and hole cutouts secure the space necessary for the TrueDepth camera and Face ID, where the Dynamic Island is located.\r<br />\n<ul><li><a href=\"https://www.macrumors.com/how-to/use-dynamic-island-iphone-14-pro/\">iPhone 15: What Dynamic Island Does and How to Use It</a></li></ul>\r<br />\nInitial speculations suggested that BOE might supply around 5 million iPhone 15 panels in 2023. However, due to delays and poor yield rates, the expected supply volume has been reduced to 2 to 3 million panels. What makes things worse for BOE is that the light leakage is harder to avoid on a larger panel. As a result, it is now considered very unlikely that BOE will get production approval for the iPhone 15 Plus panels in 2023. Its yield rate is still estimated to be around only 30%.\r<br />\n\r<br />\nCurrently, Samsung Display supplies panels for the entire iPhone 15 series and held a 91% market share in these kinds of panels from June to August 2023. If BOE cannot expand its supply, Samsung will reap the benefits once again.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/iphone-15/\">iPhone 15</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/boe/\">BOE</a></div><div>Buyer's Guide: <a href=\"https://buyersguide.macrumors.com/#iPhone-15\">iPhone 15 (Buy Now)</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/iphone.99\">iPhone</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/05/iphone-15-oled-supplier-problems-persist/\">iPhone 15 OLED Supplier Still Plagued by Leaky Light Issues</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/iphone-15-oled-supplier-still-plagued-by-leaky-light-issues.2412860/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9bed0af148a3bcd3e42c07c2556156b1723dba641219632376825e3782f09b9e","category":"Apple"}