{"title":"Graphene veils may hold the secret to conserving priceless works of art","link":"https://arstechnica.com/?p=1789025","date":1629929766000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/matina1CROP-800x533.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/matina1CROP.jpg\">Enlarge</a> <span>/</span> Detail from Matina Stavropoulou's original painting, <em>Triton and Nereid</em>, one of several used for a series of experiments with graphene veils. (credit: Matina Stavropoulou)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Graphene is the thinnest material yet known, composed of a single layer of carbon atoms arranged in a hexagonal lattice. That structure gives it many unusual properties that hold great promise for real-world applications: batteries, super capacitors, antennas, water filters, transistors, solar cells, and touchscreens, just to name a few. And now this wonder material might just provide a solution to the fading of colors of many artistic masterpieces, according to <a href=\"https://www.nature.com/articles/s41565-021-00934-z\">a recent paper</a> published in Nature Nanotechnology.</p>\n<p>\"All art establishments are concerned with the discoloration of paintings upon exhibition and storage, since harmful factors such as sunlight, moisture, and certain volatile organic compounds (VOCs) accelerate the degradation,\" said co-author Costas Galiotis, a chemical engineer at the University of Patras in Greece. \"There are many references to well-known endangered artworks, such as [Vincent] Van Gogh's <em>The Bedroom</em> and <em>Sunflowers</em>, or [Edvard] Munch's <em>The Scream</em>.\"</p>\n<p>A variety of culprits are behind the degradation of fine art. For instance, several of Georgia O'Keeffe's oil paintings housed in the Georgia O'Keeffe Museum in Santa Fe, New Mexico, have developed tiny <a href=\"https://news.northwestern.edu/for-journalists/press-kits/2019-aaas-conference/georgia-okeeffe/\">pin-sized blisters</a>, almost like acne, for decades. Conservators have found similar deterioration in oil-based masterpieces across all time periods, including works by Rembrandt. As <a href=\"https://arstechnica.com/science/2019/02/scientists-develop-new-tool-to-study-acne-in-georgia-okeefe-paintings/\">we've previously reported</a>, conservationists and scholars initially assumed they were grains of sand trapped in the paint. But then the protrusions grew, spread, and started flaking off. </p></div><p><a href=\"https://arstechnica.com/?p=1789025#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1789025&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9bf060264d4e33a3d6c5ba15ac31531f6cbbadf6302e643a3132c8a71a0e79cc","category":"Tech"}