{"title":"From Cow to Climate: Tracing the Path of Dairy Sustainability: Unveiling the Impact on Sustainable Development Goals through Bibliometric and Literature Analysis","link":"https://www.preprints.org/manuscript/202406.1054/v1","date":1718787621000,"content":"Dairy farming dates to the early Neolithic era in Europe, Middle East, Asia, and Africa. Over time, the industry has evolved from small ranches and farmhouses milk processing units to large, intensive dairy farms and big, high-tech processing units. Despite the industry’s contribution to the economy and food production, multiple studies have tainted cattle farming as a main contributor to climate change. This study explores literature in dairy farming and sustainable development goals (SDGs) to identify current scholarly developments since the formulation and adoption of SDGs in 2015 and themes for future research. This paper argues that dairy animals are not the source of sustainability shortfalls as depicted by multiple scholarly articles, but human processes associated with dairy farming. Data was analyzed using R package, Excel, NVIVO, and VoS Viewer. A review of literature shows that dairy farming and its contribution to sustainability has gained more intensive scientific interest since 2015. Moreover, livestock management, feed production and management, stakeholder’s management, logistics and supply chain management, and waste management are the sources of environmental adversities associated with dairy farming. Notably, these are human processes developed from commercialization of dairy farming and involve multiple stakeholders across the supply chain. While solutions are embedded within these processes, innovation emerges as a key driver of sustainability and source of opportunities to strengthen sustainability in dairy farming sector and achieve the sustainable development goals.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9bf2410ddc78c740fb9256489a6c26ed77de97313b4d7488c7380d76b8d6b3a9","category":"Interdisciplinary"}