{"title":"Zombies rise, terrorize a town in trailer for SyFy’s Day of the Dead series","link":"https://arstechnica.com/?p=1782914","date":1627252998000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>At this year's Comic-Con@home, SyFy dropped the first trailer for its new series, <em>Day of the Dead</em>—the ultimate love letter to the godfather of zombies, George A. Romero. </p></div>\n<p>Somehow I missed the news last February that SyFy <a href=\"https://deadline.com/2020/02/day-of-the-dead-the-surrealtor-series-orders-at-syfy-1202870263/\">had greenlit</a> a TV reboot of George A. Romero's classic 1985 zombie horror film, <em>Day of the Dead</em>—just before the widespread onset of a deadly global pandemic, no less. And somehow the series managed to get into production despite all the shutdowns. SyFy dropped the official trailer for the ten-episode series during a panel at Comic-Con@home, with a planned premiere date this October, just in time for Halloween. You can watch the full 45-minute panel <a href=\"https://www.youtube.com/watch?v=aIrcFT0R5cw&amp;t=1s\">here</a>.</p>\n<p>The original <a href=\"https://en.wikipedia.org/wiki/Day_of_the_Dead_(1985_film)\"><em>Day of the Dead</em></a> was the third in a trilogy of films that launched a franchise, preceded by <a href=\"https://en.wikipedia.org/wiki/Night_of_the_Living_Dead\"><em>Night of the Living the Dead</em></a> (1968) and its sequel, <a href=\"https://en.wikipedia.org/wiki/Dawn_of_the_Dead_(1978_film)\"><em>Dawn of the Dead</em></a> (1978). Romero originally envisioned <em>Day of the Dead</em> as the <em>Gone With the Wind</em> of zombie movies, but disagreements with the studio over a proposed R-rating—Romero wanted the film to be unrated—meant that the director ended up with half his original budget (about $4 million). He was forced to scale back his vision substantially, so much of the film takes place in a secure underground bunker in the Everglades, where tensions rise between the scientists and soldiers on-site.</p>\n<p>Romero has said that <em>Day of the Dead</em> is his favorite within the franchise, although it has the lowest \"fresh\" rating (83 percent) on Rotten Tomatoes of the initial trilogy. It only grossed $34 million worldwide (mostly from VHS, DVD, and Blu-Ray releases), but it still left its mark on popular culture. The pseudo-civilized zombie \"Bub\" made a cameo on a S4 episode of <em>The Walking Dead</em> as one of the \"walkers\" encountered in a railroad tunnel. And in <a href=\"https://arstechnica.com/gaming/2019/07/flay-your-mind-stranger-things-s3-just-might-be-the-shows-best-season-yet/\"><em>Stranger Things</em> S3</a> (set in 1985), the teens all sneak into a mall theater to watch an early screening of <em>Day of the Dead</em>. Three more films in the franchise were released in 2005, 2007, and 2009, and <em>Night of the Living Dead II</em> is currently in production, slated for a 2022 release. Three of the original cast members from <em>Day of the Dead</em> will reprise their roles in that film.</p></div><p><a href=\"https://arstechnica.com/?p=1782914#p3\">Read 5 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1782914&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9c00ac935284da69f4d081a744be84d9aab82c03177325afd81eff3ee85bb6a9","category":"Tech"}