{"title":"The year of Windows on Arm? Google launches official Chrome builds.","link":"https://arstechnica.com/?p=1999219","date":1706291785000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/2-2-800x385.jpg\" alt=\"The Chrome nightly download page with an important section highlighted.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/2-2.jpg\">Enlarge</a> <span>/</span> The Chrome nightly download page with an important section highlighted. (credit: Ron Amadeo)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Chrome is landing on a new platform: Windows on Arm. We don't have an official announcement yet, but X user <a href=\"https://twitter.com/itanium_guy/status/1750686687020417237\">Pedro Justo</a> was the first to spot that the Chrome Canary page now quietly hosts binaries for \"<a href=\"https://www.google.com/chrome/canary/?platform=win_arm64\">Windows 11 Arm</a>.\"</p>\n<p>Chrome has run on Windows for a long time, but that's the x86 version. It also supports various Arm OSes, like Android, Chrome OS, and Mac OS. There's also Chromium, the open source codebase on Chrome, which has run on Windows Arm for a while now, thanks mostly to Microsoft's Edge browser being a Chromium derivative. The official \"Google Chrome\" has never been supported on Windows on Arm until now, though.</p>\n<p>Windows may be a huge platform, but \"Windows on Arm\" is not. Apple's switch to the Arm architecture has been <a href=\"https://arstechnica.com/gadgets/2020/11/apples-m1-macbook-air-has-that-apple-silicon-magic/\">a battery life revelation</a> for laptops, and in the wake of that, interest in Windows on Arm <a href=\"https://arstechnica.com/gadgets/2022/11/project-volterra-review-microsofts-600-arm-pc-that-almost-doesnt-suck/\">has picked up</a>. A big inflection point will be the release of laptops with the <a href=\"https://arstechnica.com/gadgets/2023/10/qualcomm-snapdragon-x-elite-looks-like-the-windows-worlds-answer-to-apple-silicon/\">Qualcomm Snapdragon X Elite</a> SoC in mid-2024. Assuming Qualcomm's pre-launch hype pans out, this will be the first Arm on Windows chip to be in the same class as Apple Silicon. Previously, Windows on Arm could only run Chrome as an x86 app via a slow translation layer, so getting the world's most popular browser to a native quality level in time for launch will be a big deal for Qualcomm.</p></div><p><a href=\"https://arstechnica.com/?p=1999219#p3\">Read 1 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1999219&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9c0286ef8ca00b98d75f02237045a6681e9687d8f293864e1cec3ffc084f02cf","category":"Tech"}