{"title":"Fleets, We Hardly Knew Ye","link":"https://twitter.com/TwitterSupport/status/1415364736015798278","date":1626287250000,"content":"\n<p>Twitter Support:</p>\n\n<blockquote>\n  <p>We had planned for Fleets to help people feel comfortable joining\nthe conversation in a low-pressure way, but it turns out Fleets\nwere mainly used by those Tweeting the most.</p>\n\n<p>So now we’re ready to explore other ways for people to share on\nTwitter.</p>\n</blockquote>\n\n<p><a href=\"https://twitter.com/Twitter/status/1415362679095635970\">The @Twitter account put it better</a>:</p>\n\n<blockquote>\n  <p>we’re removing Fleets on August 3, working on some new stuff</p>\n\n<p>we’re sorry or you’re welcome</p>\n</blockquote>\n\n<p>I’ll resist dunking on Twitter for this, because I think it’s better for Twitter to try more new ideas — even if many wind up abandoned — than to find itself paralyzed by indecision over how to evolve the platform. Fleets were a fine experiment because, other than taking up a bit of screen real estate at the very top, they didn’t interfere with Twitter’s core features.</p>\n\n<p>(The above encapsulates my thinking on the filibuster in the U.S. Senate. It’d be better to abolish it and let the party in power pass its agenda by a simple majority, even knowing that eventually the other party will be in power, and they’ll do things you don’t like. Let the majority pass its agenda, and if they’re good ideas, they’ll prove popular, and if they’re not, they won’t. Fear of letting the other side achieve its goals <em>when they’re in the majority</em> has resulted in a legislature that can barely pass <em>anything</em> — and that hasn’t worked out well.)</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/07/14/twitter-fleets\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9c03d85629d88e2d6862b0f7de6be1eb3f37fdbd1411f302dff7175d326caa09","category":"Tech"}