{"title":"PSVI-3 Finishing-based diets degradability of beef cows supplemented with a Bacillus-based probiotic","link":"https://academic.oup.com/jas/article/102/Supplement_3/538/7757523?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Probiotics, sometimes referred to as direct-fed microbials (DFM), are live microorganisms that, when given in sufficient quantities, confer health benefits to livestock animals. Research has indicated that probiotics based on <span>Bacillus</span> enhance the dry matter and neutral detergent fiber digestibility of various feed sources, animal feed, and commercial total mixed rations (TMRs) in vitro. Given that, the aim of this study was to evaluate the influence of a <span>Bacillus</span>-based probiotic supplementation on nutrient degradability of commercial finishing-based diets. Ruminally fistulated Angus × Hereford cows (n = 15; 6.1 ± 1 yr of age; body weight = 658 ± 57) were used in complete randomized designs and housed in individual pens with water, and forage intake monitored daily. Treatments consisted of 1) 500 g of protein supplement (dry distillers grain + mineral mix) without probiotic (CON n = 8), and 2) 500 g of protein supplement + 3 g of a probiotic containing <span>Bacillus licheniformis</span> and <span>B. subtilis</span> (BOV; n = 7; 2.2 ×10<sup>9</sup> CFU of the mixture/g; Bovacillus, Novonesis, Hørsholm, Denmark). The experimental period lasted 33 d, consisting of 21 d of adaptation and 12 d of collection. From d 28 to 32, four different commercial finishing diets (4 g; Table 1) were fitted in Dracon bags and incubated in the rumen for 0, 12, 24, 48, 72, and 96 h in reverse order so that all bags were removed at the same time and immediately washed until clear water was obtained. After washing, the bags were dried at 56 ºC for 72 h to determine the dry matter. Subsequently, the NDF and ADF content was determined. A treatment effect was detected (<span>P</span> ≤ 0.05) for dry matter degradability in 3 out of 4 finishing-based diets used herein, which increased by approximately 4% in cows supplemented with BOV vs. CON. Supplementing beef cows with BOV also enhanced (<span>P</span> ≤ 0.05) neutral detergent fiber degradability by 12.1, 22.3, and 24.0% in finishing diets A, B, and C, but not D (<span>P</span> = 0.52), compared with CON cows, respectively (Table 2). Cows receiving BOV had greater (<span>P</span> = 0.04) acid detergent fiber degradability in finishing diet A and a tendency (<span>P</span> = 0.07) for finishing diet C compared with CON cows, whereas acid detergent fiber degradability was similar (<span>P</span> ≥ 0.13) among treatments for finishing diets B and D. In conclusion, Bacillus-based products could be used as a nutritional alternative tool to increase nutrient degradability of finishing-based diets.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9c1eb51d3ccf39f7a0951ec6cdbd4180273d43b987f536bdf0425b256d53256c","category":"Environment"}