{"title":"A thrilling Tour de France serves up one final twist on the Champs-Élysées","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/a-thrilling-tour-de-france-serves-up-on-final-twist-on-the-champs-elysees","date":1690144330000,"content":"\n      <p>Right until the very last kilometre, the very last bike throw, this remarkable, this whacky, this most unpredictable and this most captivating <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> had one final twist, one last surprise, up its sleeve.</p>\n<div></div>\n<p>Winning on the Champs-Élysées was meant to be the crowning glory for Jasper Philipsen. His fifth win of an outstanding Tour, a repeat of his win in Paris from 12 months ago, and the perfect accompaniment to him stepping onto the podium as the winner of the points classification. But then his steam, his luck and some would say his judgement fizzled out in the third week.</p>\n<p>Before Philipsen stamped his mark all over the race as soon as the first sprint back in Bayonne on stage three, Paris was meant to be a date with destiny for Mark Cavendish. The day he finally became the outright stage record holder of this race. But then the roads of the Massif Central had a different say in the outcome.</p>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-avec-zwift-2023-stage-two-preview-a-testing-day-in-the-massif-central\"><strong><em>Read more: Tour de France Femmes avec Zwift 2023 stage two preview - a testing day in the Massif Central</em></strong></a></p>\n<p>Well before Cavendish and even Philipsen was Sam Bennett. The winner of the 21st stage in 2020, Bennett was set to be returning to the race for the first time since that late September day when, dressed in the green jersey, he claimed the most memorable victory of his career. But then Bora-Hansgrohe decided, shockingly, surprisingly, almost unfathomably, to leave the Irishman at home. <br />Replacing him in Bora’s eight-man squad was not another climber to help Jai Hindley’s overall ambitions, but another sprinter, a fastman apparently deemed better than Bennett. His name was Jordi Meeus, and, no, don’t feel bad if you hadn’t heard of him before.</p>\n<p>A Belgian rider who only turned 25 on the day the race got underway in Bilbao, he has only previously won eight stages as a professional. None had been at WorldTour level.</p>\n<p>His best return during the Tour was two sixth places and a seventh; hardly a convincing set of performances to demonstrate that the belief entrusted in him was well-founded.</p>\n<p>But then Paris called. The champagne was drunk by the victorious Jumbo-Visma team, and when the serious racing began, it was assumed the finale would be settled in a straight shoot-out between Philipsen, Mads Pedersen and maybe Dylan Groenewegen. Meeus was not a horse being touted.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/stg21_meeus01_tdf_2023.jpg?v=1690143684\" alt=\"Jordi Meeus Tour de France 2023\" /></p>\n<p>As the peloton turned onto the cobbled boulevard, Mathieu van der Poel raced to the front to do his job as a leadout man for Philipsen, a task he has embraced so well this July. But rather than lead his Alpecin-Deceuninck teammate to yet another win, Meuss, the little-known and unfancied Other Belgian, came from eighth position, darted to the left and… won. It needed a photo finish to separate Meuss, Pedersen, Groenewegen and Philipsen, but when it came it was clear: Meeus was the undoubted winner.</p>\n<p>He celebrated wildly, put his hands to his head, and seemed completely unaware of what to do. He had just won the sprinter’s world championships, along cycling’s most famous streets, in the city of romance. It was what dreams are made of.</p>\n<p>“I knew in the previous sprints it was more possible than the results I showed, and today everything went perfect. I am super happy to finish it off,” he smiled afterwards. “It’s my first Tour. To take the win today is just an indescribable feeling.” Of all the winners in Paris in this race's long, fabled history, Meeus is among the most surprising. It's little wonder he was struggling to comprehend it.</p>\n<p>And with that, the 2023 Tour de France signed off with one final thrilling chapter. Jonas Vingegaard, like many predicted, is the winner; but no one really backed Cofidis to win two stages, no one really backed Vingegaard and Pogačar to be engaged in such a mesmerising and closely-fought tussle until the third week, and no one most certainly backed Jordi Meeus to win on the Champs-Élysées. What a phenomenal Tour de France. <br /> <br /><br /></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9c209465d6919619d0c734d0f19cf0633b22cc9df62f7ccd6f15b6172fe1ece7","category":"Cycling"}