{"title":"Glassdoor เข้าซื้อ Fishbowl แอปที่เปิดให้แสดงความเห็นต่อเพื่อนร่วมงานแบบตรงไปตรงมา","link":"https://www.blognone.com/node/124833","date":1632121275000,"content":"<div><div><div><p>Glassdoor แพลตฟอร์มที่เปิดให้ผู้ใช้งานรีวิวสถานที่ทำงาน, องค์กร เข้าซื้อ Fishbowl แอปพลิเคชันที่ให้แสดงความเห็นต่อเพื่อนร่วมงานแบบไม่ระบุตัวตน พร้อมทั้งสามารถเข้าร่วมกลุ่มสนทนาตามความสนใจเกี่ยวกับงานและค้นหางาน โดยในดีลครั้งนี้ ฟีเจอร์ของ Fishbowl จะ integrate เข้ากับแพลตฟอร์มหลัก Glassdoor ถือเป็นการรวมฟังก์ชันเพื่อให้สามารถแข่งขันกับ LinkedIn ได้</p>\n<p>ปัจจุบัน Glassdoor มีผู้ใช้รายเดือน 55 ล้านคน ส่วน Fishbowl แม้ต้องรวมเนื้อหาเข้ากับแพลตฟอร์มหลักแต่ยังสามารถให้บริการในแอปแยกของตัวเองต่อไปได้ โดย Fishbowl มีผู้ใช้งาน 1 ล้านราย</p>\n<p>ด้านคู่แข่งรายใหญ่อย่าง LinkedIn เป็นแพลตฟอร์มโซเชียลมีเดียเกี่ยวกับการทำงานที่ใหญ่ที่สุด โดยกำหนดเป้าหมายไปยังมืออาชีพและเนื้อหาเกี่ยวกับความก้าวหน้าทางการงาน สร้างโปรไฟล์แสดงความสำเร็จของตัวเองเพื่อดึงดูดคนจ้างงานและสร้างเครือข่ายเกี่ยวกับการทำงาน แต่สิ่งที่  LinkedIn ยังขาดหายไปคือ การรีวิวและวิจารณ์สถานที่ทำงานอย่างตรงไปตรงมา ซึ่งเป็นสิ่งที่ Glassdoor ทำอยู่</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9667c0c35e543c449b59d6b4f8a502da.png\" /><br />\nภาพจาก Fishbowl</p>\n<p>ซึ่ง Fishbowl จะมาช่วยเสริม Glassdoor ในแง่ของเครื่องมือ เพื่อให้ Glassdoor เป็นแพลตฟอร์มที่คนจะเข้ามาดูว่ามีความคิดเห็นเกี่ยวกับบริษัทของตนหรือบริษัทที่ตนกำลังจะเข้าไปทำงานอย่างไรบ้าง</p>\n<p>การเข้าซื้อกิจการครั้งนี้ดำเนินการโดย Recruit Holdings บริษัทจัดหางานและยักษ์ใหญ่ด้านเทคโนโลยีของญี่ปุ่น ซึ่งเข้าซื้อกิจการ Glassdoor ในราคา 1.2 พันล้านดอลลาร์ในปี 2018</p>\n<p>ที่มา - <a href=\"https://techcrunch.com/2021/09/14/glassdoor-fishbowl-linkedin/?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A+techcrunchIt+%28TechCrunch+IT%29\">TechCrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/glassdoor\">Glassdoor</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div><div><a href=\"/topics/linkedin\">LinkedIn</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9c270de1a92777893bec9a46211a7ea5794253c3412f58027aa0482886c5da25","category":"Thai"}