{"title":"A new report finds NASA has spent an obscene amount of money on SLS propulsion","link":"https://arstechnica.com/?p=1942328","date":1685049438000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/SSC-2015-00064_large-800x533.jpg\" alt=\"NASA conducts a test of an RS-25 rocket engine on the A-1 Test Stand at Stennis Space Center.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/08/SSC-2015-00064_large.jpg\">Enlarge</a> <span>/</span> NASA conducts a test of an RS-25 rocket engine on the A-1 Test Stand at Stennis Space Center. (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>An <a href=\"https://oig.nasa.gov/docs/IG-23-015.pdf\">independent report</a> published Thursday had troubling findings about the money spent by the agency on propulsion for the Space Launch System rocket. Moreover, the report by NASA Inspector General Paul Martin warns that if these costs are not controlled, it could jeopardize plans to return to the Moon.</p>\n<p>Bluntly, Martin wrote that if the agency does not rein in spending, \"NASA and its contracts will continue to exceed planned cost and schedule, resulting in a reduced availability of funds, delayed launches, and the erosion of the public’s trust in the agency’s ability to responsibly spend taxpayer money and meet mission goals and objectives—including returning humans safely to the Moon.\"</p>\n<p>The 50-page report analyzed contracts that NASA has given to Aerojet Rocketdyne, for RS-25 main engines, and to Northrop Grumman, for solid-rocket boosters. The engines and boosters power the first stage of the Space Launch System rocket, which made a successful debut flight in November 2022. The rocket will launch astronauts for the Artemis missions to the Moon.</p></div><p><a href=\"https://arstechnica.com/?p=1942328#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1942328&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9c2c9ae4619d5c181ea7a0c2880c3f3c397102d288f2e393f0d032eeea84d4cc","category":"Tech"}