{"title":"Farm Monitoring System with Drones and Optical Camera Communication","link":"https://www.preprints.org/manuscript/202408.1528/v1","date":1724222601000,"content":"Smart agriculture is a new way of farming that uses advanced technology. It makes a significant contribution to improving the efficiency and productivity of farming practices. Systems that use drones to monitor pests and spray pesticides greatly reduce the burden on farmers. In addition, remote sensing technology facilitates the monitoring of crop growth conditions and the early detection of diseases and pests. However, the high cost of equipment to communicate sensor data is preventing farmers from adopting sensing systems. As a result, many studies have been conducted to make the sensing system available at a low cost. Nevertheless, many farmers have not yet adopted them. Therefore, this paper proposes an agricultural sensor network system using drones and optical camera communication (OCC). The proposed system aims to achieve high-density farm sensing at low cost. The proposed system uses OCC as the communication method for sensor data. Low cost light sources such as LED panels can be used as transmitters. In addition, existing agricultural drones equipped with cameras can be used as receivers. We also propose a trajectory control algorithm for the receiving drone to efficiently collect the sensor data. The proposed system is suitable for deploying sensor networks in areas with underdeveloped infrastructure and radio silence. In this paper, we conducted a preliminary experiment at a leaf mustard farm in Kamitonda-cho, Wakayama to demonstrate the effectiveness of the proposed system using a Mavic 2 Pro drone, launched by DJI Co., Ltd.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9c2daa702ce6564470a528ae33bbc9e2c839fabebe9fb7005db3c915d15cb35d","category":"Interdisciplinary"}