{"title":"From Pre‐Darcy Flow to Darcy Flow in Porous Media: A Simple Unified Model","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR036902?af=R","date":1721384138000,"content":"<h2>Abstract</h2>\n<p>Extensive experiments have demonstrated that fluid flow in low-permeability media deviates from Darcy's law at low pressure gradients, which is called pre-Darcy flow. Although numerous pre-Darcy flow models have been proposed, these models generally contain one or more empirical parameters with no clear physical meaning. In this paper, we present a simple unified model to describe pre-Darcy flow in porous media by introducing the concept of loss permeability. The physical meaning of the loss permeability parameter and its relationship to permeability are analyzed. Based on the statistics of the loss permeability parameter results of 24 core samples, we found that there is a good positive correlation between the loss permeability parameter and the absolute permeability. A smaller loss permeability indicates a stronger fluid-solid interaction and a stronger nonlinearity between the flow velocity and the pressure gradient. Taking a one-dimensional linear unsteady flow of a slightly compressible fluid in a homogeneous porous medium as an example, we solve the pressure diffusion equation based on the proposed model using a finite difference method. Our results demonstrate that the rate of pressure propagation for pre-Darcy flow is slower than that for Darcy flow for the entire observation period, which corrects previous conclusions. This study is highly important for improving the understanding of fluid flow in low-permeability media.</p>","author":"Hui Cheng, \nFugang Wang, \nShengwei Li, \nZhongle Cheng, \nYilong Yuan, \nGuanhong Feng","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"9c2f6f3903cfe929eb6d5865ab675ddc449c925ebd07559cd5c53239b99206b7","category":"Environment"}