{"title":"[ข่าวลือ] อินเทลเสนอซื้อ SiFive บริษัทของผู้ออกแบบซีพียู RISC-V","link":"https://www.blognone.com/node/123132","date":1623397232000,"content":"<div><div><div><p>Bloomberg รายงานข่าวว่า SiFive บริษัทผู้ผลิตชิป RISC-V กำลังได้รับข้อเสนอซื้อกิจการจากอินเทล ในราคาประมาณ 2 พันล้านดอลลาร์</p>\n<p>SiFive เป็นสตาร์ตอัพสายออกแบบซีพียูสัญชาติอเมริกัน ก่อตั้งในปี 2015 โดยทีมนักวิจัยจาก University of California Berkeley ซึ่งเป็นผู้คิดค้นซีพียูสถาปัตยกรรม RISC-V นั่นเอง (แกนนำคือ Krste Asanović ที่ริเริ่มโครงการ RISC-V ในปี 2010)</p>\n<p>RISC-V (อ่านว่า ริสก์ไฟว์) เป็นสถาปัตยกรรมซีพียู (ISA) แบบเปิดให้ใครนำไปใช้ก็ได้ ตัวชุดคำสั่งเป็นโอเพนซอร์ส ส่วนเอกสารเทคนิคเป็น Creative Commons ทำให้ RISC-V ได้รับความสนใจมากขึ้นมากในยุคที่ NVIDIA ซื้อ Arm ไปแล้ว ปัจจุบันมีองค์กรไม่หวังผลกำไรคือ RISC-V International ทำหน้าที่ดูแลพัฒนาสเปกและเอกสารต่างๆ</p>\n<p>ส่วน SiFive เน้นพัฒนาซีพียูที่เป็นสินค้าจริงๆ บนสเปกของ RISC-V และบอร์ดในแบรนด์ HiFive นอกจากนี้ยังรับออกแบบซีพียูแบบคัสตอมตามการใช้งานเฉพาะด้าน บริษัทรับเงินลงทุนจากบริษัทผู้ผลิตชิปหลายราย เช่น Qualcomm, SK hynix และบริษัทลงทุน Intel Capital ของอินเทลด้วย</p>\n<p>แหล่งข่าวของ Bloomberg บอกว่า SiFive ได้รับข้อเสนอซื้อกิจการจากหลายทาง และอาจเลือกรับเงินลงทุนรอบใหม่แทนการขยายกิจการ เพื่อรักษาความเป็นอิสระต่อไป</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/2c1c7c3b5d6dbb5b1f9a2b25dc2fa752.jpg\" /></p>\n<p>ที่มา - <a href=\"https://www.bloomberg.com/news/articles/2021-06-10/chipmaker-sifive-is-said-to-draw-intel-takeover-interest\">Bloomberg</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/sifive\">SiFive</a></div><div><a href=\"/topics/risc-v\">RISC-V</a></div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/acquisition\">Acquisition</a></div><div><a href=\"/topics/rumor\">Rumor</a></div><div><a href=\"/topics/cpu\">CPU</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9c36969f8f3ef877bc0db4f04d0083d16271c18d24649d7b8ca47564e1327b27","category":"Thai"}