{"title":"A new trophic specialization buffers a top predator against climate-driven resource instability","link":"https://academic.oup.com/beheco/article/doi/10.1093/beheco/arae005/7564692?rss=1","date":1705449600000,"content":"<span><div>Abstract</div>Intraspecific phenotypic variability is key to respond to environmental changes and anomalies. However, documenting the emergence of behavioral diversification in natural populations has remained elusive due to the difficulty of observing such a phenomenon at the right time and place. Here, we investigated how the emergence of a new trophic strategy in a population subjected to high fluctuations in the availability of its main trophic resource (migrating songbirds) affected the breeding performance, population structure, and population fitness of a specialized color polymorphic predator, the Eleonora’s falcon from the Canary Islands. Using long-term data (2007–2022), we found that the exploitation of an alternative prey (a local petrel species) was associated with the growth of a previously residual falcon colony. Pairs in this colony laid earlier and raised more fledglings than in the other established colonies. The specialization on petrels increased over time, independently of annual fluctuations in prey availability. Importantly, however, the positive effect of petrel consumption on productivity was stronger in years with lower food availability. This trophic diversification was further associated with the genetically determined color morph, with dark individuals preying more frequently on petrels than pale ones, which might promote the long-term maintenance of genotypic and phenotypic diversity. We empirically demonstrate how the emergence of an alternative trophic strategy can buffer populations against harsh environmental fluctuations by stabilizing their productivity.</span>","author":"","siteTitle":"Behavioral Ecology Current Issue","siteHash":"1db0533e04d0549951ccffff4320904ff6ab62ef3f2aa22718600b7dc255e125","entryHash":"9c37324e4d7deaef35dafe3dd50df22507e422a33adc10d262d63cb511df899b","category":"Environment"}