{"title":"Suitability and Structural Optimization of Vegetation Restoration on the Loess Plateau: A MaxEnt Model-Based Study of Environmental and Anthropogenic Impacts","link":"https://www.preprints.org/manuscript/202407.2399/v1","date":1722327803000,"content":"In recent years, the problem of ecosystem degradation caused by human activities has become increasingly serious. Vegetation restoration is a key means to solve this problem, which has increased. To address the suitability and structural optimization of vegetation restoration in the Loess Plateau, the MaxEnt model was used to quantify the impacts of environmental and human activities on the planting suitability of vegetation restoration species at the raster scale. Three layers of trees, shrubs, and herbs with 12 common vegetation restoration species were selected. The factor index system was constructed by combining climatic, ecological, and socio-economic data, and the MaxEnt model predicted land suitability.\nIt was found that human activities significantly increased the unsuitable planting area. This especially affected Robinia pseudoacacia in the tree layer and Amorpha fruticosa in the shrub layer. Highly suitable and moderately suitable areas were mainly located in sparsely populated areas with close water sources. Through maximum suitability optimization, it was identified that the overall spatial distribution of the three layers in the study area was relatively consistent, and the structural dominance of trees + shrubs + herbs and single herbs in the vertical structure was obvious, which were concentrated in the southwestern and northeastern parts of the study area, respectively. In addition, organic content (OC) and distance from the road to woodland (RW) were the dominant factors affecting land suitability, with a contribution rate of more than 50% and up to 80%. These results provide a scientific basis for optimizing planting structures. They are of significant theoretical and practical significance in guiding vegetation restoration work.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9c3da69a25fa1cb85e25f2f1e664eab282348ab3f6afa49f2c557347d4e7cefb","category":"Interdisciplinary"}