{"title":"New Report Lends Credence to Rumors of Foldable Google Pixel Phone Launching This Year","link":"https://www.macrumors.com/2021/02/24/google-pixel-foldable-coming-2021/","date":1614170421000,"content":"With more and more Android smartphone vendors coming out with their take on the foldable phone concept, and Apple rumors swirling about a possible future foldable <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>, Google appears keen to get in on the act as soon as this year with its first foldable Pixel device.\r\n<br/>\r\n\r\n<br/>\r\n<img src=\"https://images.macrumors.com/article-new/2020/08/Pixel-Fold.jpg\" alt=\"\" width=\"2500\" height=\"1406\" class=\"aligncenter size-full wp-image-753343\" /><div class=\"center-wrap\"><em>MacRumors concept render</em></div>\r\n<br/>\r\nAccording to a new report by <em><a href=\"http://www.thelec.net/news/articleView.html?idxno=2413\">TheElec</a></em>, Samsung is in the process of developing in-folding foldable OLED panels to supply to Oppo, Xiaomi, and Google. The panels are said to be destined for use in devices to be launched later in 2021, and Google has reportedly requested Samsung Display develop a foldable OLED panel around 7.6-inches in size. \r\n<br/>\r\n\r\n<br/>\r\nDocuments <a href=\"https://www.macrumors.com/2020/08/06/foldable-pixel-phone-leaked-google-docs/\">leaked</a> in August last year suggested Google plans to release a foldable pixel phone in the fourth quarter of 2021. Google <a href=\"https://www.cnet.com/news/google-is-already-working-on-a-foldable-pixel-phone/\">confirmed</a> in 2019 that it is developing technology that could be used in foldable devices, although at the time the company played down the prospect of actually launching a foldable, saying it didn't see \"a clear use case yet.\" \r\n<br/>\r\n\r\n<br/>\r\nThat said, Google develops the software that has to run on all Android foldable devices, which would put it at a distinct advantage when it comes to foldable hardware-software integration.\r\n<br/>\r\n\r\n<br/>\r\nToday's report adds further support to the prospect of a Google foldable, which will use the now more commonly preferred in-folding design, demonstrated most recently by the <a href=\"https://www.macrumors.com/2021/02/22/huawei-unveils-mate-x2-foldable-phone/\">Xiaomi Mate X2</a>, whose predecessor was out-folding by comparison. According to Xiaomi, advances in hinge technology and materials used in the Mate X2 allow for a seamless fold without a gap and eliminate the problem of display creasing. \r\n<br/>\r\n\r\n<br/>\r\nSamsung was first to launch a consumer foldable device, but the 2019 Galaxy Fold suffered from <a href=\"https://www.macrumors.com/2019/04/17/samsung-broken-galaxy-fold-devices/\">major design issues</a> including display creasing and panel breakages along the hinge due to the ingress of debris and other issues.\r\n<br/>\r\n\r\n<br/>\r\nThanks to lessons learned from the design of the Fold, Samsung <a href=\"https://www.macrumors.com/2019/07/24/samsung-galaxy-fold-launching-september/\">improved the design</a> and eventually brought the Fold back to market. The company has since released foldable flip phones - most recently the clamshell-style Galaxy Z <a href=\"https://www.macrumors.com/2020/07/22/samsung-galaxy-z-flip-5g/\">Flip</a>. \r\n<br/>\r\n\r\n<br/>\r\nMarket research firm Omdia expects foldable OLED sales to reach US&#36;2.1 billion this year, a 203% increase from 2020. Most of the sales are expected to come through foldable panels made by Samsung Display, and while Apple appears to have not made a firm decision on whether it will launch a foldable smartphone, previous rumors have suggested that Apple has <a href=\"https://www.macrumors.com/2020/09/10/apple-orders-samsung-foldable-display-samples/\">requested</a> foldable display samples from Samsung for testing purposes in a future &zwnj;iPhone&zwnj;.\r\n<br/>\r\n\r\n<br/>\r\nSamsung has historically been a key supplier to Apple, providing the OLED screens for iPhones. The company intends to dominate the foldable display market as a supplier, and was considering a move to step up production to 10 million units a year depending on demand.\r\n<br/>\r\n\r\n<br/>\r\nApple has been <a href=\"https://www.macrumors.com/2021/01/15/iphone-13-in-display-fingerprint-sensor/\">known</a> to be working on <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">foldable display technology</a> for some time, filing multiple <a href=\"https://www.macrumors.com/2016/11/22/apple-foldable-iphone-with-flexible-display/\">patents</a> regarding the technology, and rumors have also floated around <a href=\"https://www.macrumors.com/2021/02/17/lg-apple-foldable-displays/\">LG's potential involvement</a>.\r\n<br/>\r\n\r\n<br/>\r\nThe repeated insinuation of Samsung's involvement and orders being placed by Apple offers a more concrete suggestion that work on a foldable ‌&zwnj;iPhone&zwnj;‌ is continuing at pace, with some rumors suggesting a release as <a href=\"https://www.macrumors.com/2021/02/16/7-inch-foldable-iphone-with-apple-pencil-2023/\">early as 2023</a>.<div class=\"linkback\">Tags: <a href=\"https://www.macrumors.com/guide/google-pixel/\">Google Pixel</a>, <a href=\"https://www.macrumors.com/guide/foldable-iphone/\">Foldable iPhone</a></div><br/>This article, &quot;<a href=\"https://www.macrumors.com/2021/02/24/google-pixel-foldable-coming-2021/\">New Report Lends Credence to Rumors of Foldable Google Pixel Phone Launching This Year</a>&quot; first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br/><br/><a href=\"https://forums.macrumors.com/threads/new-report-lends-credence-to-rumors-of-foldable-google-pixel-phone-launching-this-year.2286012/\">Discuss this article</a> in our forums<br/><br/><div class=\"feedflare\">\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=M24GqqcsVxQ:xgFmIorN6Z4:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" border=\"0\"></img></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=M24GqqcsVxQ:xgFmIorN6Z4:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" border=\"0\"></img></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/M24GqqcsVxQ\" height=\"1\" width=\"1\" alt=\"\"/>","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9c3e12ddfd70e003ea865cd553ceb4f1ac32cfc5b31c17543ba2a53c5f7a4dca","category":"Apple"}