{"title":"Herbicide changes the role of body condition in mating interactions of a wolf spider but courtship is primarily affected by female immunity","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13473?af=R","date":1716633640000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/04d9b2bc-661f-45f7-8881-a46bac5b352d/eth13473-toc-0001-m.png\" alt=\"Herbicide changes the role of body condition in mating interactions of a wolf spider but courtship is primarily affected by female immunity\" />\n<p>The presence of herbicide increased the importance of body condition on mating success in the wolf spider. Females in good condition were more likely to mate and those in poor condition engaged in sexual cannibalism. Courtship behavior was not predictive of mating success but it was negatively correlated with female immunity.</p>\n<br />\n<h2>Abstract</h2>\n<p>Animals that live in human-impacted landscapes experience an onslaught of novel stimuli that may interfere with natural communication pathways. During mating, this interference may alter the criteria deployed to assess potential mates as males and females find they must shift their focus and emphasize alternative sensory modalities. The wolf spider, <i>Tigrosa helluo</i> (Araneae, Lycosidae) is common in agricultural fields where commercial formulations of herbicides with glyphosate as the active ingredient are regularly applied. With the development of genetically resistant crops, glyphosate-based herbicides have become among the most widely used and heavily applied agricultural chemicals in the world. In a laboratory experiment, we explored the effects of this herbicide on male—female interactions during courtship, mating, and sexual cannibalism. We expected that it might impact assessment such that there was a shift in the features that were important to the outcome of mating interactions. When herbicide was present, female body condition, an indication of recent feeding success, became important to mating success. This result was, in part, due to higher rates of sexual cannibalism in parings of males and females with low body condition values. The leg raises and pedipalp waves that males perform in courtship were not affected by herbicide nor were they related to mating success but, across all treatments, they were negatively correlated with lytic activity of females as measured just prior to pairing. This result indicates that males detected this aspect of the female's physiology and that a strong immune response made the female less attractive, possibly because it indicated a current or recent infection. Taken together, these results verify that a common herbicide shifts mating criteria used by an agribiont spider and, separate from the herbicide, the immune status of females affects the reactions of courting males.</p>","author":"Jake A. Godfrey, \nKatrina Culbertson, \nMegan Archdeacon, \nAnn L. Rypstra","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"9c3f328d4217c46ec72f7f16d88227e859aa819db44033fba38a1bd84ecc8bec","category":"Environment"}