{"title":"Evaluating methods for measuring in‐river bathymetry: Remote sensing green LIDAR provides high‐resolution channel bed topography limited by water penetration capability","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4245?af=R","date":1706333902000,"content":"<h2>Abstract</h2>\n<p>The objective was to evaluate the feasibility of measuring bathymetry using airborne green LiDAR in long and variable river reaches (4 km or more), across three rivers with varying gradients, water depths and light penetration (3.5–10 m), using four alternative LiDAR sensors. The accuracy of green LiDAR data was compared to in situ measurements collected by stratified transect point sampling and Multibeam bathymetry. Factors potentially limiting the feasibility of green LIDAR in rivers were explored. If remote sensing signals were reflected by the riverbed, the sensors generally provided elevation data consistent with in situ elevation measurements, indicating high accuracy (±10 cm) across different hydraulic conditions. The loss of green LiDAR data was mainly a consequence of limited signal water penetration capability, that is, water clarity. Secchi depth was a proxy variable strongly associated with green LiDAR penetration capability across rivers. Data loss was low up to the Secchi depth but increased rapidly thereafter. Surface water turbulence (‘white water’) and dark riverbed vegetation also increased green LiDAR signal loss. Sensors with lower point density and therefore less spatial resolution had more signal strength and therefore penetrated deeper water. However, with increasing coverage of surface turbulence (‘white water’), the importance of high point density also increased. Signal power should be balanced with signal density (spatial resolution), depending on river characteristics and project objectives. We conclude that remote sensing green LiDAR bathymetry is a robust method that efficiently provides accurate elevation data across rivers with different hydraulic conditions and water depths.</p>","author":"Leif Kastdalen, \nMorten Stickler, \nChristian Malmquist, \nJan Heggenes","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"9c4161e435ce1fb7a8bf73e607dab678b030cf3d791011bf4b409f5ee91a66c9","category":"Environment"}