{"title":"Maze-solving in a plasma system based on functional analogies to reinforcement-learning model","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300842","date":1712757600000,"content":"<p>by Osamu Sakai, Toshifusa Karasaki, Tsuyohito Ito, Tomoyuki Murakami, Manabu Tanaka, Makoto Kambara, Satoshi Hirayama</p>\r\n\r\nMaze-solving is a classical mathematical task, and is recently analogously achieved using various eccentric media and devices, such as living tissues, chemotaxis, and memristors. Plasma generated in a labyrinth of narrow channels can also play a role as a route finder to the exit. In this study, we experimentally observe the function of maze-route findings in a plasma system based on a mixed discharge scheme of direct-current (DC) volume mode and alternative-current (AC) surface dielectric-barrier discharge, and computationally generalize this function in a reinforcement-learning model. In our plasma system, we install two electrodes at the entry and the exit in a square lattice configuration of narrow channels whose cross section is 1×1 mm<sup>2</sup> with the total length around ten centimeters. Visible emissions in low-pressure Ar gas are observed after plasma ignition, and the plasma starting from a given entry location reaches the exit as the discharge voltage increases, whose route converging level is quantified by Shannon entropy. A similar short-path route is reproduced in a reinforcement-learning model in which electric potentials through the discharge voltage is replaced by rewards with positive and negative sign or polarity. The model is not rigorous numerical representation of plasma simulation, but it shares common points with the experiments along with a rough sketch of underlying processes (charges in experiments and rewards in modelling). This finding indicates that a plasma-channel network works in an analog computing function similar to a reinforcement-learning algorithm slightly modified in this study.","author":"Osamu Sakai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9c422f710c2bd9e209f0f2ab4709accc4bb3787bfd38352a57ffb4102e06c883","category":"Interdisciplinary"}