{"title":"Equivalent mating system parameters in post‐mining and undisturbed native plant populations confirms restitution of bird‐pollinator function","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14667?af=R","date":1715145145000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/20a92fd4-8b9d-45a2-8098-d26961ed92f5/jpe14667-toc-0001-m.png\" alt=\"Equivalent mating system parameters in post-mining and undisturbed native plant populations confirms restitution of bird-pollinator function\" />\n<p>Reviewing our results with other published studies to date suggests a resilience of bird-pollinator services in restored plant communities. These findings provide some reassurance to restoration practitioners working in these global south systems where bird pollination is a feature, at least for similar landscape scenarios. Our study also highlights the global contribution of ecological genetics to the objective assessment of functional species interactions in ecological restoration, an increasingly important goal of land managers and regulators seeking to improve restoration standards.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nThe restoration of diverse self-sustaining ecosystems requires re-establishment of functional interactions among species. For plant communities, pollinators are usually essential for pollination, seed set and seed quality. A common assumption in ecological restoration for plants pollinated by animals is one of ‘build it and they will come’, which is rarely tested. Beyond seed set, there may be negative genetic consequences for seed quality if pollinators and their behaviour do not reflect those in reference populations.\n\nHere, we conduct an ecological genetic assessment of seed quality via mating system parameters in <i>Lambertia multiflora</i> (Proteaceae), a species dependent on nectar-feeding birds for pollination. Four populations of <i>L. multiflora</i> in disturbed sites that were rehabilitated following mineral sands mining were compared with four native reference populations, near Eneabba, Western Australia. In each population, approximately 10 offspring from each of 10 maternal plants were genotyped with 11 highly polymorphic microsatellite markers.\n\nFrom these data, genetic diversity and mating system parameters were assessed, and found to be equivalent across all populations. Mean allelic diversity and heterozygosity across loci were very high. All populations were completely outcrossing with no bi-parental inbreeding. Mean correlated paternity, sibship and effective population size estimates for restored and natural populations were not significantly different and reflected uniformly high paternal diversity and wide outcrossing. Equivalent genetic results for restored and natural reference populations indicate successful restitution of bird-pollinator services for <i>L. multiflora</i> in these post-mining rehabilitation sites.\n\n<i>Synthesis and applications</i>. Reviewing our results with other published studies to date suggests a resilience of bird-pollinator services in restored plant communities. These findings provide some reassurance to restoration practitioners working in these global south systems where bird pollination is a feature, at least for similar landscape scenarios. Our study also highlights the global contribution of ecological genetics to the objective assessment of functional species interactions in ecological restoration, an increasingly important goal of land managers and regulators seeking to improve restoration standards.\n</p>","author":"Siegfried Krauss, \nJanet Anthony, \nSuzanne Lapenzee, \nAlison Ritchie, \nCarole Elliott, \nMark P. Dobrowolski, \nRachel Standish","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"9c46b9ba2f7a63cae777b9260d396dc2df9199478673b8156e00e2beca2b72ff","category":"Environment"}