{"title":"Brazil towards malaria elimination: A time-series analysis of imported cases from 2007 to 2022","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003822","date":1728655200000,"content":"<p>by Klauss Kleydmann Sabino Garcia, Gabriel Z. Laporta, Seyi Soremekun, Christian Bottomley, Amanda Amaral Abrahão, Gilberto Gilmar Moresco, Chris Drakeley, Anielle de Pina Costa, André M. Siqueira</p>\r\n\r\nMalaria is a global health challenge, and international efforts are underway to alleviate its impact by 2035. Within the 249 million global cases, 0.6 million occur in the Americas, mainly in Venezuela, Brazil, and Colombia. Considering Brazil’s geographical proximity to malaria-endemic countries in South America, this study objective is to analyze the epidemiological characteristics and time trends of imported malaria cases in Brazil from 2007 to 2022, discussing their influence on the elimination process. This is an ecological time-series study that analyses malaria imported cases (infected in other countries) notified in Brazil, from 2007 to 2022. Brazil’s Ministry of Health data were used. Descriptive statistics were employed to analyze sociodemographic and spatial patterns, while the impact of the Covid-19 pandemic on imported malaria trends was assessed using Prais-Winsten regression methods. In the study period there was a total of 109,914 imported cases (2.6% of Brazil’s total malaria burden). There was an annual reduction of 515.3 cases (p = 0.001) prior to the Covid-19 pandemic. During the pandemics there was an overall reduction of -3,301.8 cases (p = 0.001). In the Amazon region <i>P</i>. <i>vivax</i> imported infections predominated, whereas in the extra-Amazon region <i>P</i>. <i>falciparum</i> imported infections were more prevalent. Most imported cases were males (67.8%), of Black ethnicity (47.5%), with incomplete primary education (45.1%), aged 20–39 (61.1%), and primarily gold miners (54.0%). Most cases are from French Guiana (31.7%), Venezuela (30.0%), and Guyana (17.9%). African nations, notably Angola and Nigeria, were primary sources of imported cases to the extra-Amazon region. The imported cases flux, predominantly from Latin America, threatens Brazil’s elimination goals by potentially reintroducing the disease into previously cleared areas and sustaining the transmission in endemic areas. Strengthening epidemiological surveillance at the borders and fostering international cooperation are imperative steps in addressing this challenge.","author":"Klauss Kleydmann Sabino Garcia","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9c4a4a54ad38f09ae96f1baac029f2c16fcaee5cb716094ef010603ce3fc29d1","category":"Environment"}