{"title":"Hydrogeochemical features, genesis, and quality appraisal of confined groundwater in a typical large sedimentary plain","link":"https://onlinelibrary.wiley.com/doi/10.1002/wer.11088?af=R","date":1722577811000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/79687597-c05d-4758-a52c-259b472205fe/wer11088-toc-0001-m.png\" alt=\"Hydrogeochemical features, genesis, and quality appraisal of confined groundwater in a typical large sedimentary plain\" />\n<p>The present research investigates the hydrochemistry quality of confined groundwater in an arid sedimentary plain, which has been disturbed by long-term anthropogenic extraction. The findings reveal the suitability for multiple purposes, hydrochemical characteristics, and formation mechanism of confined groundwater.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The confined groundwater of arid sedimentary plains has been disturbed by long-term anthropogenic extraction, and its hydrochemical quality is required for sustainable development. The present research investigates the hydrochemical characteristics, formation, potential health threats, and quality suitability of the confined groundwater in the central North China Plain. Results show that the confined groundwater has a slightly alkaline nature in the study area, predominantly dominated by fresh-soft Cl-Na and HCO<sub>3</sub>-Na types. Water chemistry is governed by water–rock interactions, including dissolution of evaporites and cation exchange. Approximately 97% of the sampled confined groundwaters exceed the prescribed standard for F<sup>−</sup>. It is mainly due to geological factors such as mineral dissolution, cation exchange, and competitive adsorption of HCO<sub>3</sub>\n<sup>−</sup> and may also be released from compacted soils because of groundwater extraction. Enriched F<sup>−</sup> in the confined groundwater can pose an intermediate and higher non-carcinogenic risk to more than 90% of the population. It poses the greatest health threat to the population in the north-eastern part of the study area, especially to infants and children. For sustainable development, the long-term use of confined groundwater for irrigation in the area should be avoided, and attention should also be paid to the potential soil salinization and infiltration risks. In the study area, 97% of the confined groundwaters are found to be excellent or good quality for domestic purposes based on Entropy-weighted Water Quality Index. However, the non-carcinogenic health risk caused by high contents of F<sup>−</sup> cannot be ignored. Therefore, it is recommended that differential water supplies should be implemented according to the spatial heterogeneity of confined groundwater quality to ensure the scientific and rational use of groundwater resources.</p>\n<h2>Practitioner Points</h2>\n<p>\nThe hydrochemistry quality of confined groundwater in an arid sedimentary plain disturbed by long-term anthropogenic extraction was investigated.\nThe suitability of confined groundwater for multiple purposes such as irrigation and drinking were evaluated.\nThe hydrochemical characteristics and formation mechanism of confined groundwater under the influence of multiple factors were revealed.\n</p>","author":"Yuqing Zhang, \nYong Xiao, \nHongjie Yang, \nLiwei Wang, \nJie Wang, \nWenxu Hu, \nNing Wang, \nZhongyuan Xu, \nGongxi Liu, \nFeiyu Chen, \nXu Guo","siteTitle":"Wiley: Water Environment Research: Table of Contents","siteHash":"915ff976ef111e955885693934e4a6d064cfcc3acd138e9208be8bcd5ab4fe77","entryHash":"9c4bea66f2ec592504aff63f970617982453da7deb8efa8424f471f83ad89270","category":"Environment"}