{"title":"Upland Sandpipers select for later time since fire and experience high nest survival in grasslands managed with patch-burn grazing","link":"https://academic.oup.com/condor/article/doi/10.1093/ornithapp/duae001/7516368?rss=1","date":1704931200000,"content":"<span><div>Abstract</div>Upland Sandpipers (<span>Bartramia longicauda</span>) are a grassland obligate shorebird that nests in dense vegetation structure near recently disturbed areas and could benefit from management practices that promote heterogenous vegetation structure. Upland Sandpipers primary breeding range is generally managed for livestock production using traditional practices that lack patchy disturbances to facilitate higher levels of structural heterogeneity. Patch-burn grazing (PBG) could be an alternative management practice for Upland Sandpiper conservation for its use to create areas of dense vegetation structure near recently disturbed areas. However, limited information is available regarding nest production of Upland Sandpipers within a PBG framework. To assess the compatibility of PBG with Upland Sandpiper conservation, we estimated nest site selection and survival of Upland Sandpiper nests on private lands managed with PBG in the unglaciated plains region of North Dakota. We located 59 nests from 2017 to 2020. Upland Sandpipers avoided 1 year since fire (YSF) patches and selected for 2 and 3 YSF patches for nest sites. Additionally, nest site selection decreased with increased bare ground and at intermediate distances to the nearest Upland Sandpiper nest. Upland Sandpipers experienced high overall nest survival during the study with 51 of 59 nests successfully hatching, which limited our ability to make inferences between daily survival rates and variables of interest. Our findings suggest that PBG can provide suitable nesting cover for Upland Sandpipers in later YSF patches despite annual prescribed fire and livestock grazing during the nesting season. PBG seems a suitable grassland management strategy that should be included in conservation planning within Upland Sandpiper’s breeding distribution.</span>","author":"","siteTitle":"Ornithological Applications Current Issue","siteHash":"0adf13706282b3ccfec74e0cd9d72c5688cecb6af30a6dfa64315dbe0b12427f","entryHash":"9c5da4831b458edac4bc94ecf44b82d138ea25b6685ecb3807533e6dd2ffec2e","category":"Environment"}