{"title":"Dispersal from Africa to the Neotropics was followed by multiple transitions across Neotropical biomes facilitated by frugivores","link":"https://academic.oup.com/aob/article/133/5-6/659/7424320?rss=1","date":1700092800000,"content":"<span><div>Abstract</div><div>Background and Aim</div>Plant disjunctions have fascinated biogeographers and ecologists for a long time. We use tribe Bocageeae (Annonaceae), a predominantly Neotropical plant group distributed across several present-day Neotropical biomes and with an African–American disjunction, to investigate long-distance dispersal mediated by frugivorous animals at both intercontinental and intracontinental scales.<div>Methods</div>We reconstructed a species-level phylogeny of tribe Bocageeae with a dataset composed of 116 nuclear markers. We sampled 70 % of Bocageeae species, covering their geographical range and representing all eight genera. We estimated divergence times using BEAST, inferred ancestral range distributions and reconstructed ancestral states for fruit traits related to long-distance dispersal in a Bayesian framework.<div>Key Results</div>The ancestral Bocageeae date to the Early Eocene and were inferred to occur in Africa and proto-Amazonia. Their ancestral fruits were large and dehiscent. The first lineage split gave rise to an exclusively Neotropical clade during the Middle Eocene, in proto-Amazonia. Range exchange between the Amazon and the Atlantic Forest occurred at least once during the Miocene, and from Amazonia to Central America and Mexico during the Early Miocene. Transitions in different sets of fruit morphologies were inferred to be related to dispersal events across South American regions/biomes.<div>Conclusions</div>In Bocageeae, mammals might have been responsible for long-distance dispersal through the Boreotropics. In the Neotropics, proto-Amazonia is proposed to be the source for dispersal to other tropical American biomes. Long-distance dispersal might have happened via a wide range of dispersal guilds, depending on frugivore radiations, diversity and abundance in particular time periods and places. Hence, inter- and intracontinental dispersal might not rely on a single dispersal syndrome or guild, but more on the availability of frugivorous lineages for seed dispersal.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"9c687c80dfe65e81c299d9ec1a63c5a77a88f15ed8ddd75937020da9aaabd1e8","category":"Environment"}