{"title":"Predicting hypertension control using machine learning","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0299932","date":1710943200000,"content":"<p>by Thomas Mroz, Michael Griffin, Richard Cartabuke, Luke Laffin, Giavanna Russo-Alvarez, George Thomas, Nicholas Smedira, Thad Meese, Michael Shost, Ghaith Habboub</p>\r\n\r\nHypertension is a widely prevalent disease and uncontrolled hypertension predisposes affected individuals to severe adverse effects. Though the importance of controlling hypertension is clear, the multitude of therapeutic regimens and patient factors that affect the success of blood pressure control makes it difficult to predict the likelihood to predict whether a patient’s blood pressure will be controlled. This project endeavors to investigate whether machine learning can accurately predict the control of a patient’s hypertension within 12 months of a clinical encounter. To build the machine learning model, a retrospective review of the electronic medical records of 350,008 patients 18 years of age and older between January 1, 2015 and June 1, 2022 was performed to form model training and testing cohorts. The data included in the model included medication combinations, patient laboratory values, vital sign measurements, comorbidities, healthcare encounters, and demographic information. The mean age of the patient population was 65.6 years with 161,283 (46.1%) men and 275,001 (78.6%) white. A sliding time window of data was used to both prohibit data leakage from training sets to test sets and to maximize model performance. This sliding window resulted in using the study data to create 287 predictive models each using 2 years of training data and one week of testing data for a total study duration of five and a half years. Model performance was combined across all models. The primary outcome, prediction of blood pressure control within 12 months demonstrated an area under the curve of 0.76 (95% confidence interval; 0.75–0.76), sensitivity of 61.52% (61.0–62.03%), specificity of 75.69% (75.25–76.13%), positive predictive value of 67.75% (67.51–67.99%), and negative predictive value of 70.49% (70.32–70.66%). An AUC of 0.756 is considered to be moderately good for machine learning models. While the accuracy of this model is promising, it is impossible to state with certainty the clinical relevancy of any clinical support ML model without deploying it in a clinical setting and studying its impact on health outcomes. By also incorporating uncertainty analysis for every prediction, the authors believe that this approach offers the best-known solution to predicting hypertension control and that machine learning may be able to improve the accuracy of hypertension control predictions using patient information already available in the electronic health record. This method can serve as a foundation with further research to strengthen the model accuracy and to help determine clinical relevance.","author":"Thomas Mroz","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9c69b0bb12ece24ec3bcc22dabb63a783a4e32cfab822e410c9c80416a702e98","category":"Interdisciplinary"}