{"title":"Consilience in practice: social–ecological dynamics of the Lake Volvi region (Greece) during the last two millennia","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3645?af=R","date":1720779907000,"content":"<h2>ABSTRACT</h2>\n<p>The Lake Volvi area, part of the region of Macedonia (northern Greece), is a biodiversity hotspot, located in the central part of a major communication corridor connecting the western and eastern parts of the Balkans. The sediment succession from Lake Volvi is investigated here to provide a unique high-resolution pollen and geochemical record for the last 2000 years combining palaeoecological and historical methods, implementing the concept of consilience. The palaeoecological data document the environmental dynamics since the occupation of the area by the Romans. The vegetation changes reveal the development of wetland habitats and the variations of the mixed deciduous oak and thermophilous–mesophilous forests, as well as cereal cultivation, grazing and arboriculture, whose intensity varied over time. Archaeological data are available for the 1st millennium <span>ce</span>, but detailed historical evidence becomes accessible from the 13th century \n<span>ce</span> onwards through Byzantine and Ottoman documents. Both historical and palaeoecological data indicate that the 16th century was the period of strongest population pressure on the environment of the Volvi region. However, for other periods, it is possible to observe disagreements between the proxies. We demonstrate that these contradictions can be resolved with a more complex understanding of the region's social–ecological dynamics.</p>","author":"Lucrezia Masci, \nGeorgios C. Liakopoulos, \nRaphael Gromig, \nElias Kolovos, \nKaterina Kouli, \nMatthias Moros, \nLaura Sadori, \nAlexander Sarantis, \nPhilip Slavin, \nJakub Sypiański, \nGeorgios Vidras, \nCristiano Vignola, \nBernd Wagner, \nAdam Izdebski, \nAlessia Masi","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"9c6b2415dcf64d78fa613d67344ea96ea8b391d94cc5925cb617ec0b5cdd52fc","category":"Environment"}