{"title":"Phytochemical profiling and bioactivity assessment of underutilized Symphytum species in comparison with Symphytum officinale","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13279?af=R","date":1712732400000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p><i>Symphytum</i> (comfrey) genus, particularly <i>Symphytum officinale</i>, has been empirically used in folk medicine mainly for its potent anti-inflammatory properties. In an attempt to shed light on the valorization of less known taxa, the current study evaluated the metabolite profile and antioxidant and enzyme inhibitory effects of nine <i>Symphytum</i> species.</p>\n<h2>RESULTS</h2>\n<p>Phenolic acids, flavonoids and pyrrolizidine alkaloids were the most representative compounds in all comfrey samples. Hierarchical cluster analysis revealed that, within the roots, <i>S. grandiflorum</i> was slightly different from <i>S. ibericum</i>, <i>S. caucasicum</i> and the remaining species. Within the aerial parts, <i>S. caucasicum</i> and <i>S. asperum</i> differed from the other samples. All <i>Symphytum</i> species showed good antioxidant and enzyme inhibitory activities, as evaluated in DPPH (up to 50.17 mg Trolox equivalents (TE) g<sup>−1</sup>), ABTS (up to 49.92 mg TE g<sup>−1</sup>), cupric reducing antioxidant capacity (CUPRAC, up to 92.93 mg TE g<sup>−1</sup>), ferric reducing antioxidant power (FRAP, up to 53.63 mg TE g<sup>−1</sup>), acetylcholinesterase (AChE, up to 0.52 mg galanthamine equivalents (GALAE) g<sup>−1</sup>), butyrylcholinesterase (BChE, up to 0.96 mg GALAE g<sup>−1</sup>), tyrosinase (up to 13.58 mg kojic acid equivalents g<sup>−1</sup>) and glucosidase (up to 0.28 mmol acarbose equivalents g<sup>−1</sup>) tests. Pearson correlation analysis revealed potential links between danshensu and ABTS/FRAP/CUPRAC, quercetin-<i>O</i>-hexoside and DPPH/CUPRAC, or rabdosiin and anti-BChE activity.</p>\n<h2>CONCLUSIONS</h2>\n<p>By assessing for the first time in a comparative manner the phytochemical–biological profile of a considerably high number of <i>Symphytum</i> samples, this study unveils the potential use of less common comfrey species as novel phytopharmaceutical or agricultural raw materials. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Simon Vlad Luca, \nGokhan Zengin, \nŁukasz Kulinowski, \nKouadio Ibrahime Sinan, \nKrystyna Skalicka‐Woźniak, \nAdriana Trifan","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9c71ba149248e40513c5e178fa8e896b91bd7844c89d862088c440dc3c6d2060","category":"Environment"}