{"title":"PSVIII-2 Effects of post-ruminal yeast cell wall extract on dry matter intake, gastrointestinal fermentation and permeability, and concentrations of white blood cell types in beef heifers exposed to feed restriction","link":"https://academic.oup.com/jas/article/102/Supplement_3/585/7757785?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The objective of this study was to evaluate whether post-ruminal provision of a yeast cell wall extract (YCW) affected gastrointestinal fermentation characteristics and permeability, and white blood cell concentrations for heifers exposed to feed restriction (FR). Ruminally cannulated beef heifers (n = 8) were used in a 2 × 2 crossover design. Treatments (TRT) included an abomasal infusion of a placebo (PLC; maltodextrin) or YCW derived from <span>Saccharomyces cerevisiae</span> (2 g/dose) infused at 0600 and 1800 h. Heifers were subject to a 5-d baseline period followed by 5 d of FR where dry matter intake (DMI) was restricted to 30% of ad libitum intake. Data collection included daily DMI, and rumen, fecal and blood samples. Total gastrointestinal and post-ruminal permeability were measured using a ruminal dose of Cr-EDTA and an abomasal dose of Co-EDTA during the baseline and FR phases. Data were analyzed to determine the effects of YCW provision and phase, and the 2-way interaction. There were no TRT or TRT × phase interactions except for fecal propionate concentration. By design, DMI during FR was 30% (<span>P</span> &lt; 0.01) of that observed during baseline (4.1 vs. 13.4 kg/d, respectively). The ruminal concentrations of acetate (45.4 vs. 69.2 mmol/L), propionate (14.5 vs. 26.7 mmol/L), and butyrate (9.9 vs. 16.5 mmol/L) were reduced (<span>P</span> &lt; 0.01) by 34, 46, and 52%, respectively, with FR relative to baseline. Fecal propionate concentration (interaction, <span>P</span> = 0.04) numerically increased (<span>P</span> = 0.12) from baseline to FR for PLC (7.7 vs. 9.6 mmol/L, respectively), while YCW did not change among phases; however, no means differed. Exposure to FR reduced fecal butyrate concentration by 28% (<span>P</span> = 0.03). Gastrointestinal tract permeability (<span>P</span> &lt; 0.01; 2.3 and 2.5% for total and post-ruminal, respectively) was greater during FR compared with baseline, with 2.0% of the Cr-EDTA and 1.6% of the Co-EDTA excreted in urine. The concentrations of neutrophils (<span>P</span> = 0.03) and eosinophils (<span>P</span> &lt; 0.01) were greater during FR relative to baseline (2.28, 1.27 and 0.53, 0.30 ×106 cells/mL, respectively). Exposure to FR altered ruminal SCFA concentrations, increased blood concentrations of neutrophils and eosinophils, and increased gastrointestinal permeability suggesting an inflammatory response; however, post-ruminal provision of a YCW did not mitigate the response to a feed restriction challenge.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9c77928bd1a6833c3fddb7fa11d234e295356f3f062c09fb7045866cbd2f8a22","category":"Environment"}