{"title":"AWS Application Migration Service Major Updates: Global View, Import and Export from Local Disk, and Additional Post-launch Actions","link":"https://aws.amazon.com/blogs/aws/aws-application-migration-service-major-updates-global-view-import-and-export-from-local-disk-and-additional-post-launch-actions/","date":1688577175000,"content":"<p><a href=\"https://aws.amazon.com/application-migration-service/?trk=baf3bae1-e662-4e4c-ae0f-9a69c96a5573&amp;sc_channel=el\">AWS Application Migration Service</a> simplifies, expedites, and reduces the cost of migrating your applications to AWS. It allows you to lift and shift many physical, virtual, or cloud servers without compatibility issues, performance disruption, or long cutover windows. You can minimize time-intensive, error-prone manual processes by automating replication and conversion of your source servers from physical, virtual, or cloud infrastructure to run natively on AWS by using Application Migration Service for migration. Earlier this year, we <a href=\"https://aws.amazon.com/blogs/aws/aws-application-migration-service-major-updates-import-and-export-feature-source-server-migration-metrics-dashboard-and-additional-post-launch-actions/\">introduced major improvements</a>, such as a server migration metrics dashboard, import and export, and additional post-launch modernization actions.</p> \n<p>Today, I’m pleased to announce three major updates to Application Migration Service. Here’s the quick summary for each feature release:</p> \n<ul> \n <li><strong>Global View </strong>– You can manage large-scale migrations across multiple accounts. This feature provides you both visibility and the ability to perform specific actions on source servers, apps, and waves in different AWS accounts.</li> \n <li><strong>Import and Export from Local Disk </strong>– You can now use Application Migration Service to import your source environment inventory list to the service from a CSV file on your local disk. You can also export your source server inventory list from the service to a CSV file and download it to your local disk. You can continue leveraging the previously launched import and export functionality to and from an S3 bucket.</li> \n <li><strong>Additional Post-launch Actions </strong>– In this update, Application Migration Service added four additional predefined post-launch actions. These actions are applied to your migrated applications when you launch them on AWS.</li> \n</ul> \n<p>Let me share how you can use these features for your migration.</p> \n<p><strong><span>Global View</span><br /> </strong>Global View provides you the visibility and the ability to perform specific actions on source servers, applications, and waves in different AWS accounts. Global view uses <a href=\"https://docs.aws.amazon.com/organizations/latest/userguide/orgs_introduction.html\">AWS Organizations</a> to structure a management account (which has access to source servers in multiple member accounts) and member accounts (which only have access to their own source servers).</p> \n<p>To use this feature, you need to have an AWS account in which AWS Application Migration Service is initialized. This account must be an admin in AWS Organizations or a delegated admin for AWS Application Migration Service. You can view the Global View page on the Application Migration Service page in the <a href=\"https://console.aws.amazon.com/\">AWS Management Console</a> by selecting Global View in the left navigation menu.</p> \n<p>You can use the global view feature to see source servers, applications and waves across multiple managed accounts and perform various actions, including:</p> \n<ul> \n <li>Launching test and cutover instances across accounts</li> \n <li>Monitoring migration execution progress across accounts</li> \n</ul> \n<p>The main Global View page provides an overview of your account and this information changes depending on whether you have a management account or a member account.</p> \n<p>In a management account, you can see the AWS organizations permissions, the count of linked accounts, and the total number of source servers, applications, and waves under Account information. The Linked accounts section displays the relevant information for your linked accounts. It shows all the linked accounts this account has access to, including the account you’re logged into (the management account) and the member accounts that are linked to it. If the management account has access to two additional member accounts, the Linked accounts section will show three accounts. It’s the total number of accounts that are visible through this management account (including itself). For member accounts, this page only displays the account information that includes the AWS organizations permissions and the number of source servers, applications, and waves in the specific account.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/20/Global-view-N-1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/20/Global-view-N-1.png\" alt=\"Global view\" width=\"879\" height=\"375\" /></a></p> \n<p>In your management account, you can access and review source servers, applications and waves within your account and across all member accounts. As a manager, you can choose between All accounts and My account from the drop-down menu, which allows you to change you view of presented source servers, applications or waves.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Waves.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Waves.png\" alt=\"Waves\" width=\"879\" height=\"389\" /></a></p> \n<p><span><strong>Import and Export from Local Disk</strong></span><br /> A comprehensive data center inventory forms the foundation of any successful migration endeavor. This inventory encompasses a comprehensive list of servers and applications managed by customers on premises. The inventory is categorized into migration waves to facilitate efficient migration planning.</p> \n<p>Typically, this inventory is compiled using discovery tools or created manually by IT administrators. Perhaps you maintain your data center inventory in Excel spreadsheets. With Application Migration Service, we offer seamless support for importing your inventory list from a CSV file, which follows a format similar to the one used by <a href=\"https://docs.aws.amazon.com/solutions/latest/cloud-migration-factory-on-aws/solution-overview.html\">Cloud Migration Factory</a>.</p> \n<p>In the <a href=\"https://aws.amazon.com/blogs/aws/aws-application-migration-service-major-updates-import-and-export-feature-source-server-migration-metrics-dashboard-and-additional-post-launch-actions/\">previous release</a>, Application Migration Service supported the option to import a file from Amazon S3 and export a file to Amazon S3. In this latest release, Application Migration Service supports the option to import a file from local disk and export a file to local disk. This makes it easy for you to manage large scale-migrations and ingest your inventory of source servers, applications and waves, including their attributes such as EC2 instance type, subnet and tags. These attributes are the parameters used to populate the EC2 launch template.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Import-and-Export.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Import-and-Export.png\" alt=\"Import and Export\" width=\"468\" height=\"1102\" /></a></p> \n<p>To start using the import feature, you need to identify your servers and application inventory. You can do this manually or using discovery tools. The next thing you need to do is download the import template, which you can access from the console.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Import-Local.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Import-Local.png\" alt=\"Import Local\" width=\"879\" height=\"375\" /></a></p> \n<p>After you download the import template, you can start mapping your inventory list onto this template. While mapping your inventory, you can group related servers into applications and waves. You can also perform configurations, such as defining Amazon Elastic Compute Cloud (Amazon EC2) launch template settings and specifying tags for each wave.</p> \n<p>The following screenshot is an example of the results of my import template.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/23/Inventory1.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/23/Inventory1-1024x202.png\" alt=\"Inventory\" width=\"879\" height=\"152\" /></a></p> \n<p>On the <strong>Application Migration Service</strong> page in the <a href=\"https://console.aws.amazon.com/\">AWS Management Console</a>, select <strong>Import</strong> on the left-side navigation menu (under Import and Export). Under the <strong>Import inventory</strong> tab, select <strong>Import from local disk</strong>. Select <strong>Choose file</strong> and choose the local file containing your inventory list. Select <strong>Import</strong>, and the inventory file is imported into Application Migration Service. When the import process is complete, the details of the import results appear.</p> \n<p>Now, you can view all your inventory inside the Source servers, Applications, and Waves pages on the Application Migration Service console.</p> \n<p>To export your inventory to a local file, select <strong>Export</strong> on the left-side navigation menu of the Application Migration Service page. Under <strong>Export inventory </strong>tab, choose <strong>Export to local disk</strong>. Specify the name of the file to download under Destination filename. Choose <strong>Export</strong>, and the inventory file downloads to your local disk. Application Migration Service uses an S3 bucket within your account for the import and export operations, even when using local disk. You must have the required <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/security-best-practices.html\">permissions</a> to perform this action. You can modify the exported inventory file and reimport it to perform bulk configuration updates across your inventory. When the global view feature is activated upon reimport, configuration changes are applied also across accounts.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Export-Local.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/16/Export-Local.png\" alt=\"Export Local\" width=\"879\" height=\"362\" /></a></p> \n<p><span><strong>Additional Post-launch Actions</strong></span><br /> Post-launch actions allow you to control and automate actions performed after your servers have been launched in AWS. You can use predefined or custom post-launch actions.</p> \n<p>Application Migration Service now has four additional predefined post-launch actions to run in your <a href=\"https://aws.amazon.com/ec2/\">Amazon EC2</a> instances on top of the existing predefined post-launch actions. These additional post-launch actions provide you with flexibility to maximize your migration experience.</p> \n<p><a href=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/19/Post-Launch-template-new.png\"><img loading=\"lazy\" src=\"https://d2908q01vomqb2.cloudfront.net/da4b9237bacccdf19c0760cab7aec4a8359010b0/2023/06/19/Post-Launch-template-new.png\" alt=\"Post Launch template \" width=\"977\" height=\"616\" /></a></p> \n<p>The new four additional predefined post-launch actions are as follows:</p> \n<ul> \n <li><strong>Configure Time Sync </strong>– You can use the Time Sync feature to set the time for your Linux instance using ATSS.</li> \n <li><strong>Validate disk space </strong>– You can use the disk space validation feature to obtain visibility into the disk space and to ensure that you have enough available disk space on your target server.</li> \n <li><strong>Verify HTTP(S) response </strong>– You can use the Verify HTTP(S) response feature to conduct HTTP(S) connectivity checks to a predefined list of URLs. The feature verifies the connectivity to the launched target instance.</li> \n <li><strong>Enable Amazon Inspector </strong>– The Enable Amazon Inspector feature allows you to run security scans on your Amazon EC2 resources, including the target instances launched by Application Migration Service. The Amazon Inspector service is enabled at the account level. This action uses the <code><a href=\"https://docs.aws.amazon.com/inspector/v2/APIReference/API_Enable.html\">Enable</a></code>, <code><a href=\"https://docs.aws.amazon.com/inspector/v2/APIReference/API_BatchGetAccountStatus.html\">BatchGetAccountStatus</a>,</code> and <code><a href=\"https://docs.aws.amazon.com/IAM/latest/APIReference/API_CreateServiceLinkedRole.html\">CreateServiceLinkedRole</a></code> APIs.</li> \n</ul> \n<p><span><strong>Now Available</strong></span><br /> The Global View, Import and Export Feature from Local, and Additional Post-launch Actions are available now, and you can start using them today in all Regions where <a href=\"https://aws.amazon.com/application-migration-service/?trk=baf3bae1-e662-4e4c-ae0f-9a69c96a5573&amp;sc_channel=el\">AWS Application Migration Service</a> is supported. Visit the <a href=\"https://docs.aws.amazon.com/mgn/latest/ug/what-is-application-migration-service.html?trk=520c9246-6b69-477b-aa85-ce1d505aa5d3&amp;sc_channel=el\">Application Migration Service User Guide</a> to dive deeper into these exciting features and you can refer to the <a href=\"https://docs.aws.amazon.com/mgn/latest/ug/getting-started.html?trk=3f6fe751-2202-48aa-aeb8-8d993b364989&amp;sc_channel=el\">Getting started with AWS Application Migration Service</a> to kickstart your workload migration to AWS.</p> \n<p>—Irshad</p>","author":"Irshad Buchh","siteTitle":"AWS News Blog","siteHash":"6093e072e4117ec22616e844cb857d03ca62c57a411a8affc77cb5e8b6b15bf6","entryHash":"9c788bcce5031fd7f2360f772fe938823d9d99a4f9766a33f32e5ba271197e6b","category":"Tech"}