{"title":"Genetic dissection of cis-regulatory control of ZmWUSCHEL1 expression by type B RESPONSE REGULATORS","link":"https://academic.oup.com/plphys/article/194/4/2240/7462146?rss=1","date":1701907200000,"content":"<span><div>Abstract</div>Mutations in <span>cis</span>-regulatory regions play an important role in the domestication and improvement of crops by altering gene expression. However, assessing the in vivo impact of <span>cis</span>-regulatory elements (CREs) on transcriptional regulation and phenotypic outcomes remains challenging. Previously, we showed that the dominant <span>Barren inflorescence3</span> (<span>Bif3</span>) mutant of maize (<span>Zea mays</span>) contains a duplicated copy of the homeobox transcription factor gene <span>ZmWUSCHEL1</span> (<span>ZmWUS1</span>), named <span>ZmWUS1-B</span>. <span>ZmWUS1-B</span> is controlled by a spontaneously generated novel promoter region that dramatically increases its expression and alters patterning and development of young ears. Overexpression of <span>ZmWUS1-B</span> is caused by a unique enhancer region containing multimerized binding sites for type B RESPONSE REGULATORs (RRs), key transcription factors in cytokinin signaling. To better understand how the enhancer increases the expression of <span>ZmWUS1</span> in vivo, we specifically targeted the <span>ZmWUS1-B</span> enhancer region by CRISPR-Cas9-mediated editing. A series of deletion events with different numbers of type B RR DNA binding motifs (AGATAT) enabled us to determine how the number of AGATAT motifs impacts in vivo expression of <span>ZmWUS1-B</span> and consequently ear development. In combination with dual-luciferase assays in maize protoplasts, our analysis reveals that AGATAT motifs have an additive effect on <span>ZmWUS1-B</span> expression, while the distance separating AGATAT motifs does not appear to have a meaningful impact, indicating that the enhancer activity derives from the sum of individual CREs. These results also suggest that in maize inflorescence development, there is a threshold of buffering capacity for <span>ZmWUS1</span> overexpression.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"9c9266f2840e23d2556d8bc3e4571686389df1dd4af2cf1680776d02354e2252","category":"Environment"}