{"title":"Apple Began Preparing for AirTag Regulatory Approval Nearly Two Years Ago","link":"https://www.macrumors.com/2021/04/23/airtags-fcc-submissions-two-years-ago/","date":1619211568000,"content":"FCC filings for Apple's newly released <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> have revealed that the Cupertino tech giant began regulatory testing and preparing to seek regulatory approval for the product nearly two years before they were officially announced. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/f1618938547.jpg\" />\r\n<br />\r\nA series of <a href=\"https://fcc.report/FCC-ID/BCGA2187/5130981.pdf\">documents</a> <a href=\"https://fcc.report/FCC-ID/BCGA2187/5130980.pdf\">submitted</a> to the Federal Communications Commission indicate that AirTag underwent testing for official certification between July and November of 2019. Despite testing being conducted in mid-2019, official reports for regulatory certification were only issued in September and October of last year.\r\n<br />\r\n\r\n<br />\r\nLike all consumer products, Apple devices must undergo extensive and rigorous testing with the FCC in the United States and regulatory agencies of countries where the device will be sold before they can reach the market. What makes this case particularly interesting is that ‌AirTags‌ were the subject of rumors for a full two years, with a launch seemingly imminent for much of that time. \r\n<br />\r\n\r\n<br />\r\nWith the FCC filings indicating that ‌AirTags‌ were far enough along that they were undergoing regulatory testing in 2019, it suggests that Apple may indeed have pushed back the ‌AirTags‌ launch by as much as a year. While the exact reasoning behind Apple's delay for ‌AirTags‌ remains a point of mystery, an educated guess could be that the company wanted to build out its <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> network before its launch to avoid accusations of anti-competitive behavior.\r\n<br />\r\n\r\n<br />\r\nAs ‌AirTags‌ were rumored to be in development, Tile, which creates a line of similar item trackers, <a href=\"https://www.macrumors.com/2020/01/17/tile-congress-testimony-ios-13-apple/\">began to ring the alarm bells</a> that certain features in iOS would make it harder to compete with the eventual Apple item tracker. At the time, companies such as Tile had no real platform or network on Apple devices that would render their item trackers mainstream or particularly easy to use compared to an Apple-made accessory.\r\n<br />\r\n\r\n<br />\r\nThat all changed earlier this month when Apple announced it's <a href=\"https://www.macrumors.com/2021/04/07/apple-announces-find-my-network-third-party-devices/\">opening up the Find My network to third-party accessory makers</a>. AirTag is built off of the ‌Find My‌ network that consists of more than a billion Apple devices that use encrypted signals to crowdsource the location of other ‌Find My‌ compatible devices and items. \r\n<br />\r\n\r\n<br />\r\nBy opening up the network to third-party companies ahead of the launch of ‌AirTags‌, Apple may have felt it would be avoiding scrutiny and anti-competitive accusations given that its own item tracker would no longer have an advantage on Apple devices compared to those made by other companies.\r\n<br />\r\n\r\n<br />\r\nTile doesn't use Apple's ‌Find My‌ ecosystem, and it's unclear if the company plans to adopt the network in the future. Others, however, such as Belkin, VanMoof, and Chipolo, have announced plans to adopt the ‌Find My‌ network for their own products, including wireless earbuds, bikes, and an item tracker, respectively.\r\n<br />\r\n\r\n<br />\r\nApple's own ‌AirTags‌ became <a href=\"https://www.macrumors.com/2021/04/23/airtags-orders-now-available/\">available for pre-order</a> earlier today and will begin arriving to customers on April 30. <div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/04/23/airtags-fcc-submissions-two-years-ago/\">Apple Began Preparing for AirTag Regulatory Approval Nearly Two Years Ago</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-began-preparing-for-airtag-regulatory-approval-nearly-two-years-ago.2293002/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=XYXzVcUGijE:lmHY0948QzE:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=XYXzVcUGijE:lmHY0948QzE:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/XYXzVcUGijE\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9c983ff79b10c522071ea0666761c1ce172f1e35dfcbe409680bf111dc0373c0","category":"Apple"}