{"title":"US agency sues Tesla as Black workers report “swastikas, threats, and nooses”","link":"https://arstechnica.com/?p=1972215","date":1696001593000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-tesla-cars-800x465.jpg\" alt=\"Aerial view shows cars parked at the Tesla factory in Fremont, California.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/09/getty-tesla-cars.jpg\">Enlarge</a> <span>/</span> Cars parked at the Tesla factory in Fremont, California, on February 10, 2022. (credit: Getty Images | Josh Edelson)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The US Equal Employment Opportunity Commission (EEOC) sued Tesla yesterday, alleging that the electric carmaker violated the Civil Rights Act of 1964 by subjecting Black employees at its manufacturing facilities in Fremont, California, \"to severe or pervasive racial harassment and created and maintained a hostile work environment because of their race.\"</p>\n<p>The US agency also alleged that Tesla \"unlawfully retaliated against Black employees who opposed actions they perceived to constitute unlawful employment discrimination.\" The <a href=\"https://storage.courtlistener.com/recap/gov.uscourts.cand.418764/gov.uscourts.cand.418764.1.0.pdf\">lawsuit</a> was filed in US District Court for the Northern District of California and alleges that the discrimination has been ongoing since May 2015.</p>\n<p>\"Throughout the Relevant Period, racial slurs, chief among them, [different variations of the N-word] as well as racist epithets and race-based stereotyping permeated Tesla's Fremont Factory subjecting Black employees to racial hostility and offenses,\" the lawsuit said. \"Non-Black perpetrators of the racial misconduct have worked in a variety of positions at Tesla, including as managers, supervisors, line leads, production leads, production associates, and temporary workers.\"</p></div><p><a href=\"https://arstechnica.com/?p=1972215#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1972215&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9c9f314a66a7aff065e2078590161c3a09982daa66b22e9e91ab7d3203dadf64","category":"Tech"}