{"title":"Apple to Open Apple Developer Academy in Saudi Arabia, First in the MENA Region","link":"https://www.macrumors.com/2021/07/08/apple-developer-academy-saudi-arabia/","date":1625730717000,"content":"Apple plans to open its first Apple Developer Academy headquarters for the Middle East and North African region (MENA) in Riyadh, the capital city of Saudi Arabia, reports <em><a href=\"https://saudigazette.com.sa/article/608588/SAUDI-ARABIA/Apple-picks-Riyadh-as-headquarters-of-its-academy-in-MENA-region\">Saudi Gazette</a></em>. \r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/07/apple-dev-academy.jpg\" />\r\n<br />\r\nThe Apple Developer Academy is Apple's strategic program to ensure that students interested in technology receive proper training for programming across all of its platforms. Students are taught how to write and manage iOS, macOS, tvOS, and watchOS apps, and are all taught under a curriculum created by Apple.\r\n<br />\r\n\r\n<br />\r\nIn Saudi Arabia, Apple will partner with the Saudi Federation for Cybersecurity, Programming, and Drones alongside the Tuwaiq Academy and the Princess Nourah Bint Abdulrahaman Unversity. Saudi Arabia's Minister of Education, Dr. Hamad Al-Sheikh, called Apple's expansion of the academy into the country a \"key center for producing programmers and technology developers.\" \r\n<br />\r\n\r\n<br />\r\nOne of the academy's key aims will be women's empowerment in the technology space and part of Saudi Arabia's \"Vision 2030\" plan, which aims to diversify the economy beyond reliance on oil. The chairman of the SAFCSP (Saudi Federation for Cybersecurity, Programming, and Drones), Faisal Al-Khamisi, says it is his hope that the new partnership will create more opportunities for the Saudi workforce, and the local community.\r\n<br />\r\n<blockquote>In our partnership with Apple, we will work together and strive to create an economic ecosystem for business to instill skills that enhance innovation and technology, and ensure a sustainable and prosperous future for our local community and the societies of the world that will undoubtedly benefit from the technical cadres that will receive education and training at the Apple Academy. </blockquote>The first Apple Developer Academy launched in Brazil in 2013 and has since expanded to more countries, with Saudi Arabia being the latest as part of Apple's global outreach to students passionate about app development.<div>Tags: <a href=\"https://www.macrumors.com/guide/saudi-arabia/\">Saudi Arabia</a>, <a href=\"https://www.macrumors.com/guide/apple-developer-academy/\">Apple Developer Academy</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/07/08/apple-developer-academy-saudi-arabia/\">Apple to Open Apple Developer Academy in Saudi Arabia, First in the MENA Region</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-to-open-apple-developer-academy-in-saudi-arabia-first-in-the-mena-region.2303592/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HhRgkFT0DMk:mpzxORgdqZg:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=HhRgkFT0DMk:mpzxORgdqZg:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/HhRgkFT0DMk\" />","author":"Sami Fathi","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9cab14ed97876a09c08aee633acb88ffa06c90a02f93d71104e6f57928dcce80","category":"Apple"}