{"title":"Numerical Simulation of the Shed-Tunnel Structure Dynamic Response under the Rockfall Repeated Impacts with FEM-SPH Method","link":"https://www.preprints.org/manuscript/202408.1206/v1","date":1723776376000,"content":"The dynamic response of the shed-tunnel structure under rockfall impact attracts much attention in recent years. However, the research on the dynamic response of the shed-tunnel structure under rockfall impact mostly focuses on the rockfall single impact, while in practical engineering, the shed-tunnel structure often encounters the rockfall repeated impacts during its service life. Therefore, this research focuses on exploring the dynamic response characteristics of the shed-tunnel structure under the rockfall repeated impacts. First of all, based on the model test of the shed-tunnel under rockfall impact as a reference, the FEM (Finite Element Method)-SPH (Smoothed Particle Hydrodynamics) coupling numerical calculation model is established based on ANSYS/LS-DYNA finite element code. The numerical simulation of the dynamic response of the shed-tunnel structure under rockfall impact is realized, and the rationality of the model is verified. Then, with this model and the full restart technology of LS-DYNA code, the effects of four factors, e.g. rockfall mass, rockfall impact velocity, rockfall impact angle and rockfall shape, on the impact force and impact depth of the buffer layer, the maximum plastic strain and axial force of the rebar, the shed roof vertical displacement and the shed-tunnel plastic strain are studied. These results show that the cumulative deformation and damage of the shed-tunnel structure caused by the rockfall repeated impacts play an important role in the destruction of the shed-tunnel structure, and the special attention should be paid to this issue.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9cbdcf06f578811156d8ba22c33d7e9334964bf8723cfc5b21e0a286e9918f02","category":"Interdisciplinary"}