{"title":"Having iPhone or Mac problems? iOS 16.4.1 and macOS 13.3.1 are here to help","link":"https://www.macworld.com/article/1717319/ios-16-4-1-macos-13-3-1updates-bug-fixes-weather-home-handoff.html","date":1681055673000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When it comes to OS updates, we here at Macworld encourage users to install them as soon as possible. Updates sometimes have nice new features, but it’s the bug fixes and security updates that are the most important. But with iOS 16.4, iPadOS 16.4, and macOS 13.3, the <em>update to the update</em> was the one worth waiting for—and they could be the most important ones of the year, depending on the issues you’ve had with your devices.</p>\n\n\n\n<p>On Friday, Apple released small updates to <a href=\"https://www.macworld.com/article/1780577/ios-16-4-1-bug-fixes-security-updates.html\">iOS 16.4</a> and <a href=\"https://www.macworld.com/article/1780591/macos-ventura-13-3-1-bug-fixes-security-updates.html\">macOS 13.3</a>, and if you look at the release notes, they’re extremely small updates. Just three insignificant issues are mentioned—fixes to Siri, Auto Unlock your Mac with Apple Watch, and an emoji—but they are much bigger than that. For one, they include two major security patches for vulnerabilities that “may have been actively exploited.” And for another, they appear to fix most if not all of the bugs introduced in iOS 16.4 and macOS 13.3:</p>\n\n\n\n<h2>iOS 16.4 and iPadOS 16.4</h2>\n\n\n\n<ul><li><strong>Weather app</strong>: The Weather app that many of us come to rely upon to set the tone for the day has <a href=\"https://www.macworld.com/article/1682239/weather-app-ios-ongoing-system-issues.html\">problems displaying the forecast</a>. Earlier this week, the Weather app had a complete data outage, and while service is restored (according to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.apple.com/support/systemstatus/&amp;xcust=1-1-1717319-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple’s System Status</a> website), the app still acts wonky. We don’t know for sure if the Weather app is fixed, but we haven’t experienced any issues since Friday.</li><li><strong>Battery drain</strong>: There always seems to be a vocal number of users who experience shortened battery life when an update is released. But the number of anecdotal accounts, such as those on Apple’s Support Community, seems to be more frequent with iOS 16.4. <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://m.youtube.com/watch?v=tcEFlY87lIo&amp;xcust=1-1-1717319-1-0-0&amp;sref=https://www.macworld.com/feed\">YouTuber iAppleBytes</a> has a video demonstration of a Geekbench battery test with iOS 16.4 that supports the shortened battery life claim. Battery drain is always difficult to quantify, but we haven’t noticed any unusual drain in iOS 16.4.1.</li><li><strong>Home app</strong>: The Home app, used to control smart home devices, got an update to its architecture, but Apple stumbled during its rollout. It was initially offered in iOS 16.2 but it was <a href=\"https://www.macworld.com/article/1442447/ios-16-2-upgrade-to-new-home-architecture-pulled.html\">pulled back</a> and then <a href=\"https://www.macworld.com/article/1660169/ios-16-4-new-features-home-architecture-emoji-web-app-notifications.html\">released with iOS 16.4</a>. Now, there are a number of complaints about the reworked app, reports <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.imore.com/smart-home/homekit/apples-ios-164-update-might-have-broken-homekit&amp;xcust=1-1-1717319-1-0-0&amp;sref=https://www.macworld.com/feed\">iMore</a>. We didn’t experience issues in iOS 16.4, but our Home app is working well in iOS 16.4.1.</li></ul>\n\n\n\n<h2>macOS Ventura 13.3</h2>\n\n\n\n<ul><li><strong>Home directory</strong>: macOS 13.3 introduces a problem with user Home directories saved to external drives. A <a href=\"https://www.macworld.com/article/1683099/macos-ventura-13-3-home-directory-bug-system-integrity-protection.html\">workaround</a> to this problem involves turning off System Integrity Protection, but that’s not ideal. We’ve confirmed that this problem is fixed in the macOS Ventura 13.3.1 update.</li><li><strong>Quick Look</strong>: Though I’ve not had this problem, many users on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://discussions.apple.com/thread/254746920&amp;xcust=1-1-1717319-1-0-0&amp;sref=https://www.macworld.com/feed\">Apple’s Support Community</a> can’t get Quick Look to work in macOS 13.3. Responses to the original post confirm that macOS 13.3.1 fix the issue. </li><li><strong>Universal Control and Handoff</strong>: These features, which rely on roiCloud connectivity, have stopped working for some users after installing 13.3. The <a href=\"https://www.macworld.com/article/1684272/universal-control-not-working-macos-ventura-13-3-ipados-16-4-updates.html\">workaround</a> involves logging off of iCloud and then logging back on, but that can cause a whole bunch of headaches, especially if you use iCloud to sync your Photo library. We need to test to see if this bug persists.</li></ul>\n\niOS, MacOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9cc8b6677d25c001bcce9950ca8ddd1fe64994786664ec3d811a3a3fcf761617","category":"Apple"}