{"title":"Apple left out some pretty cool announcements from the Wonderlust keynote","link":"https://www.macworld.com/article/2067368/wonderlust-little-announcements-wifi-6e-thread-lightning-adapter-heif-max.html","date":1694687400000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s <a href=\"https://www.macworld.com/article/2062871/apple-wonderlust-event-iphone-15-apple-watch-series-9-live-blog.html\">Wonderlust event on September 12</a> dished the details on the iPhone 15, iPhone 15 Pro, Apple Watch Series 9, and Apple Watch Ultra 2. There were a few other odds and ends in there, like a USB-C upgrade to the AirPods Pro (2nd gen) charge case.</p>\n\n\n\n<p>But we found a few interesting little details that weren’t mentioned in the hour-long presentation. I guess Apple had to leave room for its five-minute skit with Mother Earth to brag about its carbon-neutral products and environmental progress. Here are some of the little things we’ve found that you may have missed.</p>\n\n\n\n<h2>The iPhone 15 Pro has Wi-Fi 6E and Thread</h2>\n\n\n\n<p>Apple’s first iPhone to support <a href=\"https://www.macworld.com/article/334313/wifi-6e-explained-spectrum-speeds-reliability-iphone-ipad-mac.html\">Wi-Fi 6E</a> is the iPhone 15 Pro (and Pro Max), and it also supports the low-power home networking mesh networking technology <a href=\"https://www.macworld.com/article/829956/apple-smart-home-homekit-thread-matter.html\">Thread</a>. Neither is a huge deal—Wi-Fi 6E’s new frequency bands are best used for point-to-point communications in home mesh networks and extenders right now, and Wi-Fi 6 routers already exceed the internet bandwidth most homes and businesses have. And Thread is really what you want on always-plugged-in home hubs like Apple TV or HomePod, not your “leaves the house often” iPhone.  But both are nice additions. Hopefully, Apple won’t be two years late to the Wi-Fi 7 party on its flagship products.</p>\n\n\n\n<h2>That $29 USB-C to Lightning adapter</h2>\n\n\n\n<p>The switch from Lightning to USB-C is good. It’s long overdue. It’s better for users, in the long run. Apple was forced to do it, under protest, by the EU and now proudly proclaims its greatness. And for most users, who only use Lightning for charging, it won’t make a difference–Apple gives you the cable, and the power adapters switched to USB-C a few years ago. </p>\n\n\n\n<p>But if you have some Lightning accessories you still need to use, you can rest assured that <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2067368-1-0-0&amp;u=https://www.apple.com/shop/product/MUQX3AM/A/usb-c-to-lightning-adapter\">Apple has an overpriced dongle</a> just for you! How overpriced? How does <em>30 bucks</em> grab you?</p>\n\n\n\n<h2>The iPhone 15’s USB-C port supports 4K/60Hz displays</h2>\n\n\n\n<p>Apple didn’t spend a lot of time talking about the USB-C port on the new iPhones, and one of the features it left out is a big one. The new ports have DisplayPort support so they all can output video at up to 4K/60Hz to an external display. It likely still only supports mirroring so you’ll just see what’s on your iPhone’s screen, but it opens the door to a Stage Manager-style desktop mode in iOS 18.</p>\n\n\n\n<h2> The iPhone 15 Pro Max can zoom up to 25X</h2>\n\n\n\n<p>The new tetraprism lens on the iPhone 15 Pro Max doubles the iPhone 15 Pro’s optical zoom from 3X to 6X. It will also increase the digital zoom from 15X to 25X to get you a whole lot closer to your subject. </p>\n\n\n\n<h2>The iPhone 14 Pro gets a new 48MP HEIF Max option</h2>\n\n\n\n<p>The iPhone 15 and 15 Pro can use their main 48MP cameras to shoot 24MP images, and 48MP in good light. With the iPhone 14 Pro, snapping those 48MP images required shooting in ProRAW format, which results in huge files.</p>\n\n\n\n<p>Since the iPhone 15 doesn’t support ProRAW (it’s still exclusive to Pro iPhones), how does it work? There’s a new HEIF Max option to take those really big images in HEIF format. Fortunately, that’s coming to the iPhone 14 Pro as well with the iOS 17 update.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"HEIF Max\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?quality=50&amp;strip=all 4149w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?resize=300%2C210&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?resize=768%2C538&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?resize=1200%2C841&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?resize=1536%2C1077&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/iphone-heif-max.jpg?resize=2048%2C1436&amp;quality=50&amp;strip=all 2048w\" width=\"1200\" height=\"841\" /></figure><p>Foundry</p></div>\n\n\n\n<p>Just open Settings and go to <em>Camera</em> &gt; <em>Formats</em> &gt; <em>Pro Default</em> and you’ll be able to select between HEIF Max (up to 48MP), ProRAW 12MP, or ProRAW Max (up to 48MP). This saves a <em>ton</em> of space, as the HEIF 48MP images are around 5MB and the ProRAW images are about 75MB.</p>\n\n\n\n<p>It doesn’t look like the iPhone 14 Pro gets the new 24MP image format, though, despite having the same image sensor and A16 processor as the iPhone 15.</p>\n\n\n\n<h2>Apple Watch Series 9 and Ultra 2 have 64GB of storage</h2>\n\n\n\n<p>New Apple Watch models have had 32GB of storage since the Series 5 was released four years ago. With the new S9 chip, Apple is doubling that to 64GB (half of what you get in an iPhone 15 Pro). </p>\n\n\n\n<p>The extra storage seems like overkill, but it’s helpful for those who want to store music, podcasts, audiobooks, or other content on their watch and leave their iPhones at home when they go for a run or ride.</p>\n\n\n\n<h2>MagSafe Duo and MagSafe Battery Pack are discontinued</h2>\n\n\n\n<p>Two of Apple’s MagSafe products have been discontinued, and are no longer available from the Apple Store. The <a href=\"https://www.macworld.com/article/234927/apple-magsafe-duo-charger-review.html\">MagSafe Duo</a> is no more, but it was awful anyway and we always recommended you steer clear of it.</p>\n\n\n\n<p>Also gone is the <a href=\"https://www.macworld.com/article/668186/apple-magsafe-battery-pack-review.html\">MagSafe Battery Pack</a>, which was a pretty good product, though third-party battery packs upstaged it.</p>\n\n\n\n<p>It’s not clear why these have been discontinued, but it may have something to do with them both featuring Lightning connections, while the company’s newest products are all moving to USB-C.</p>\n\n\n\n<h2>The USC-C AirPods Pro have some new features too</h2>\n\n\n\n<p>This one is really weird. In Apple’s press release announcing that the 2nd-generation AirPods Pro now include a USB-C charging case, it has an entire subhead that says “Introducing Lossless Audio with Apple Vision Pro.” </p>\n\n\n\n<p>AirPods Pro (2nd generation) with MagSafe Charging Case (USB‑C) will enable Lossless Audio with ultra-low latency when paired with Apple Vision Pro. The H2 chip in the latest AirPods Pro and Apple Vision Pro, combined with a groundbreaking wireless audio protocol, unlocks powerful 20-bit, 48 kHz Lossless Audio with a massive reduction in audio latency.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"AirPods USB-C case charging with an Apple Watch charger\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?quality=50&amp;strip=all 2400w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=300%2C200&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=768%2C512&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=1200%2C800&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=1536%2C1024&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=2048%2C1365&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=1240%2C826&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/09/airpods-pro-usb-c-case.jpg?resize=150%2C100&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"800\" /><figcaption><p>The AirPods Pro 2 have a USB-C case that also brings some new features.</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>Note that this <em>only</em> works with Apple Vision Pro, and the 20-bit, 48KHz fidelity falls a little short of the 24-bit mark usually used when referring to “hi-res audio.”</p>\n\n\n\n<p>The strange part is that it specifically mentions the new USB-C model. But if it’s all about the H2 chip, why wouldn’t the 2nd-gen AirPods Pro with Lightning work as well?</p>\n\n\n\n<p>The <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-2067368-1-0-0&amp;u=https://www.apple.com/apple-vision-pro/\">Apple Vision Pro marketing site</a> has been updated to mention Lossless Audio with 2nd-gen AirPods Pro but does <em>not</em> stipulate that they need to be the new USB-C model.</p>\n\n\n\n<p>While mostly identical, the new USB-C version of the 2nd-gen AirPods Pro are indeed updated. They have new model numbers–even the earbuds–and likely require new firmware to manage the charging, including using your iPhone 15 to charge them up. They also have an improved dust resistance rating (IP54 vs. IPx4).</p>\n\n\n\n<p>Since the Apple Vision Pro isn’t going to be released until next year, we don’t really know whether the 2nd-gen AirPods Pro with Lightning case will support Lossless Audio with it or not. But it’s not worth worrying about; the sound quality offered by these earbuds is honestly not good enough for Lossless Audio to make a difference, and it seems unlikely anyone would be able to tell the difference in a blind listening test.</p>\n\n\n\n<h2>Re-focusing Portrait shots</h2>\n\n\n\n<p>The iPhone 15 line brings two new Portrait mode features. First, it will recognize people, dogs, and cats in your photo and save depth information along with the image, so you can go into Photos later and enable Portrait mode even if you didn’t take the photo in that mode. Second, in the Photos app, you can choose a new focal subject for Portrait mode shots by tapping on the image when in Edit mode. </p>\n\n\n\n<p>With iOS 17, Apple is also bringing that second feature to prior iPhones, including iPhone 13 and 14 models. You can’t shoot a non-Portrait image of a person or pet and choose to make it a Portrait shot later, but you <em>can</em> choose new focal points for Portrait shots at a later time. You used to only be able to tap the viewfinder to pick a focal point <em>before</em> taking the picture, but once taken that decision was final.</p>\n\nApple Inc, iPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9ccbf0e049b5442a9bc2a36907eb73d94b8896401df04a9b1874638c5182be9f","category":"Apple"}