{"title":"Intel Rocket Lake-S desktop gaming CPUs are here","link":"https://arstechnica.com/?p=1750412","date":1616011833000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/11th-gen-desktop-processors-new-features-980x552.png\" alt=\"\"></div>\n        <p>\n          19 percent gen-on-gen IPC vs 10th gen desktop CPUs sounds great—but the verdict is out on the importance of the \"up to\" hedge, or the impact of reduced core count in the i9 CPUs.                      [credit:\n                        Intel                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>This week, Intel announced its 11th generation S-series desktop CPUs, codenamed Rocket Lake-S. These are gaming-oriented processors optimized for high clock rates and performance, coming in 19 SKUs ranging from i5-11400T through 19-11900K.</p>\n<p>The new chips, based on Intel's <a href=\"https://arstechnica.com/gadgets/2021/01/a-quick-intel-ces-roundup-new-gaming-laptop-cpus-and-a-glimpse-at-alder-lake/\">Cypress Cove</a> architecture, claim up to a 19 percent increase in Instructions per Clock cycle—a very familiar figure, since it's the same number AMD claimed for gen-on-gen IPC uplift between its Zen 2 and Zen 3 architectures. We'll do some hands-on benchmarking in the near future to determine how important the \"up to\" hedge on that claim matters.</p>\n<p>In the meantime, we're cautiously optimistic about the \"up to 19 percent IPC\" and \"up to 50 percent iGPU\" performance Intel is claiming. As usual, the really big numbers Intel shows for the new generation of processors don't have much to do with general-purpose CPU performance—they're tied pretty directly to finding AVX-512 optimized workloads. But the 19 percent isn't tied to AVX-512, and it has not come at the price of reduced clock speeds or higher rated TDP, either.</p></div><p><a href=\"https://arstechnica.com/?p=1750412#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1750412&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9cccabf742159b841c6a69367bb83e269ee7d8b64f95244a81165d9f2280146c","category":"Tech"}