{"title":"Elevated water temperature in combination with an increase in daylength stimulate a synchronized onset of spermatogenesis in male Atlantic salmon (Salmo salar, L.) postsmolts","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13090?af=R","date":1720851926000,"content":"<h2>Abstract</h2>\n<p>Male postsmolt maturation (“jacking”) is undesired in Atlantic salmon aquaculture due to economic and welfare impacts. Unfortunately, incidence of jacking has increased linked to intensive rearing conditions. This study subjected 1000 salmon (52.1 ± 5.2 g) to one of two temperatures (15, 12.5°C) and one of two photoperiods (constant light-LL, a 5-week LD12:12 winter signal regime-WS) to assess their effects on spermatogenesis regulation. Indicators included testis histology images, mRNA transcription of gonadotropin receptors for follicle-stimulating hormone (<i>fshr</i>) and luteinizing hormone (<i>lhr</i>), and of factors regulating spermatogenesis like anti-Müllerian hormone (<i>amh</i>), gonadal-soma-derived factors 1 and 2 (<i>gsdf1</i> and <i>gsdf2</i>), and insulin-like growth factor-3 (<i>igf3</i>). High temperature (15°C) induced early testis development processes irrespective of photoperiod, evidenced by presence of type B spermatogonia before clear increases in testis size or any transcriptional changes. The winter signal at 15°C caused a synchronized onset of spermatogenesis not present under constant light. This was evidenced by a pronounced downregulation of the spermatogenesis-inhibiting factor <i>amh</i> and a clear upregulation in the stimulating factor <i>igf3</i>. Consequently, combining high temperatures with winter signal regimes pose risk; high temperature can stimulate early cellular/endocrine processes of spermatogenesis, which can later be synchronized in the population by an increase in daylength.</p>","author":"Enrique Pino‐Martinez, \nKari Anne Kamlund, \nPablo Balseiro, \nMarianne Kraugerud, \nAlbert Kjartan Dagbjartarson Imsland, \nSigurd O. Handeland","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"9cd010a6bddc2f60382d48a9cc47465b5e6323537a40086160f435596ece1522","category":"Environment"}