{"title":"Color Craft &#038; Counterpoint: A Designer&#8217;s Life with Color Vision Deficiency","link":"https://alistapart.com/article/a-designers-life-with-color-vision-deficiency/","date":1591885872000,"content":"\n<p>So, what is it like to be color blind and also work in the web design and development industry? I'll answer that question throughout this article, but it's something that's always factored into my thoughts, given my passion for design and now my career. I wonder if having “normal” vision would have made me a better artist growing up. Would it make me better at my job now? Would I have pursued a more design-oriented career, as opposed to one that’s more dev-focused? These are just some of the things that pop into my head.</p>\n\n\n\n<p>As to my job and my color vision, no, colorblindness doesn’t affect my work as much as you’d think. During design meetings, I can quickly point out areas where we need to reconsider our color palette. While reviewing layouts, I’m able to explain why we need to evaluate how—and if—we’re only conveying information with color. I like that I can bring a singular perspective to the table and a voice for others like me; I am able to offer insights that others don’t necessarily have. </p>\n\n\n\n<p>When you can see a larger set of colors, it’s easy to gloss over those issues because they’re functionally invisible in the moment. If a design team doesn’t have a member who sees color differently, it’s important they find a way to test with actual users who do. There is no substitute for the real thing. </p>\n\n\n\n<p>Between workarounds anyone can use when color-sensitive situations crop up, and knowing how to separate myth from actual, smart usability practices for vision differences (and which design tools to use)—I want to set the record straight on a few things about designing with color and designing for color accessibility.</p>\n\n\n\n<h2>What it means to be color blind</h2>\n\n\n\n<p>The term <a href=\"https://www.aoa.org/patients-and-public/eye-and-vision-problems/glossary-of-eye-and-vision-conditions/color-deficiency\"><em>color vision deficiency</em></a>,<em> </em>or CVD, more accurately reflects the type of impairment I have.</p>\n\n\n\n<p>When someone hears that I’m color blind, most immediately think that I can’t see colors whatsoever—that my entire field of vision is in grayscale, that I’m truly color <em>blind</em>. The term is very misleading and confusing because most people living with CVD are able to see many colors. (There <em>are</em> people who have a type of CVD called “<a href=\"https://en.wikipedia.org/wiki/Monochromacy\">monochromacy</a>,” which is complete color blindness. About 1 in 30,000 people are affected, and they see the world in shades of gray.)  </p>\n\n\n\n<p>Red-green color blindness is the most culturally-familiar type, but CVD is a lot more interesting and varies far more in definition.</p>\n\n\n\n<h2>So what colors <em>can’t</em> you see?</h2>\n\n\n\n<p>I have been asked this question more times than I can count. My answer is always the same: it’s practically impossible for me to say. For me personally, colors become harder to distinguish the less bold they are. I can attest with absolute certainty that the sky is blue, a stop sign is red, the grass is green, and Big Bird is yellow. I can <em>see</em> those colors because—whether by design or by mother nature—they’re bold. But start placing certain colors adjacent to each other, and it becomes more difficult for me. There are no colors that I <em>can’t</em> see, rather, certain colors become muddied and start blending together. It’s not the same for everyone; that’s just my version of CVD.</p>\n\n\n\n<p>As light sensors go, <a href=\"https://www.bbc.com/future/article/20150727-what-are-the-limits-of-human-vision\">humans don’t have the best eyes for color</a>. Truth be told, they’re subpar compared to most species. WE are dismally color blind—as a species. </p>\n\n\n\n<p>On top of that, normal, “accurate” color vision varies from person to person; only minor anatomical differences determine whether your eyes are normal, “color blind,” or have extra (!) color vision powers. Let’s unpack all of that.</p>\n\n\n\n<p>Without getting too technical, what I can tell you is that our retinas are responsible for our color vision. <a href=\"https://www.colour-blindness.com/general/how-it-works-science/\">Retinas have two main types of cells</a>: rods and cones. Rods are primarily responsible for reading brightness/intensity levels, while cones are more specialized for detail and for picking up a particular range of light wavelengths. A person considered to have normal color vision has three types of cones, one each for bandwidths of short, medium, and long wavelengths of light. The bandwidth each cone can perceive is shaped like a bell curve and is unique to <em>that</em> cone inside <em>your</em> eye, and there are overlaps between cones. Cones also don’t actually correspond to specific colors, but because long wavelengths fall more toward the red part of the spectrum, medium wavelengths hover closer to green, and short wavelengths tend toward blue, you’ll hear them called red, green, and blue cones, due to sheer convenience (Fig. 1).</p>\n\n\n\n<figure><a href=\"https://en.wikipedia.org/wiki/Color_vision\"><img src=\"https://alistapart.com/wp-content/uploads/2020/06/light-spectrum-cone-wavelength-response-600x423-4.jpg\" /></a><figcaption><br /><b>Fig. 1.</b> Normalized cone response spectra in humans for short (S), medium (M), and long (L) wavelengths. Notice the overlapping nature of the bell curves, and that the peak sensitivity for each cone doesn’t neatly match up with red, green, and blue.</figcaption></figure>\n\n\n\n<p>Color vision deficiencies occur because one or more of these cones is missing or has limited sensitivity (such as a narrow range), or when color perception in the brain is influenced by various <a href=\"#colorperception\">other phenomena</a>. This means that those colors in the spectrum effectively “drop out,” but since the light is still there, the brain translates it into <em>a</em> color based on peripheral data picked up by the other cones, combined with its brightness level.</p>\n\n\n\n<p>Since color vision is based on how our eyes and brain perceive light, and since our eyes have different genetic sensitivities to light, we can say that “accurate” color vision is somewhat subjective. Even people with “accurate” color vision don’t see things exactly the same way. </p>\n\n\n\n<p>Some people even have a fourth cone cell in their retinas; \"<a href=\"https://en.wikipedia.org/wiki/Tetrachromacy\">tetrachromats</a>\" have enhanced color differentiation due to extra sensitivity between red and green. The extra cone actually <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2781854/\">came standard for most mammals in the past</a>, but ongoing studies have suggested that <a href=\"https://www.bbc.com/future/article/20140905-the-women-with-super-human-vision\">12% of the world's women</a> might still have this fourth type of cone.</p>\n\n\n\n<p>There are some colors and wavelengths we can’t see because our eyes don’t have the right sensors, but for others, it’s due to anatomical make-up. The lens and cornea physically block very short wavelengths; it's why we can’t see ultraviolet light directly, even though we have the sensor capability. For people with <a href=\"https://www.theguardian.com/science/2002/may/30/medicalscience.research\">aphakia</a> (lack of a lens in one or both eyes, whether congenital or due to surgical removal), that’s not a problem; they see the color variations in near ultraviolet light naturally.</p>\n\n\n\n<h2>Inside look at living with CVDs</h2>\n\n\n\n<p>I think each person who has a CVD has their own set of challenges. There are also a lot of commonly-experienced situations, social and professional obstacles, and forms of discrimination and bullying we’re expected to just quietly put up with. </p>\n\n\n\n<p>Vision disabilities and color vision differences are often treated as quirky, entertaining phenomena on some mysterious map between normal vision and “blind.” People with CVDs encounter condescending remarks and dismissive treatment as part of daily life. It’s an invisible and misunderstood struggle that doesn’t have to be that way. I want to make a difference, and it fuels my desire to educate people on this topic.</p>\n\n\n\n<h3>Insults and passive-aggressive comments</h3>\n\n\n\n<p>I’ve heard my fair share of passive-aggressive comments about my career choice. Also about my passion for art and design. Because <em>how could I possibly be a designer if I can’t see colors?</em> </p>\n\n\n\n<p>A question like that is condescending on two levels. One, it’s as if no one should be allowed to be an artist unless they can see colors accurately. And two, it shows a complete insularity or misconstrued awareness about color vision deficiencies.</p>\n\n\n\n<p>Nowadays, I work primarily as a front-end developer, but early on in my career, I designed web layouts in Photoshop. I didn’t code anything. I didn’t even write HTML. I never had an issue with colors because I was typically starting with a client’s corporate branding guidelines, so I was able to take those colors and use color palette generators to help me build out the look of my designs. I was never called out for making poor color choices, so I felt like I was doing a good job. It wasn’t until I was having a conversation with my boss, a man I looked up to as a professional, when I dropped my guard and mentioned that I was color blind. He then proceeded to question my entire decision to pursue the career I love. For a new professional, it was a pretty rough and demoralizing encounter to sit through and try to process, to say the least. </p>\n\n\n\n<h3>Justifying my skill set</h3>\n\n\n\n<p>It feels as though I have had to justify my career decisions and my skill set on a regular basis over the years—as if CVD prevents me from being good at my job. By and large, it’s truthfully not something that comes up most of the time in my day-to-day work. </p>\n\n\n\n<p>At this point, most coworkers only find out that I have a CVD if I talk about it. Sometimes I even get a kick out of seeing how many months can stretch out before a situation comes along where I can mention it. It’s become an increasingly minor issue over the years, what with updated software and web technologies I can put to use when needed.</p>\n\n\n\n<h3>Life via form factor (or winging it)</h3>\n\n\n\n<p>Think for a moment about ways that color is used to convey information in the world around you. One thing that comes to my mind would be traffic lights. Color is used to let drivers know how they should proceed. No additional information is provided in case a driver is color blind. Traffic lights also use two of the colors most commonly associated with color blindness: red and green. Thankfully, most traffic lights have a common form factor. The top light is red, the middle light is yellow, and the bottom light is green. Even if I couldn’t tell the color, as long as I can tell which light is lit, then I’m able to get the necessary information.</p>\n\n\n\n<p>Unfortunately, not all designs are created equal; there may be no secondary or supplemental indicator to go by. When something is only conveyed with color, that’s a gap where information can get lost on a large group of people.</p>\n\n\n\n<h3>Everyday social interactions</h3>\n\n\n\n<p>Exchanging stories with others who grew up color blind sounds unfailingly familiar. Most of us have had similar experiences when it comes to people first finding out. As in part Q&amp;A, part dog and pony show.</p>\n\n\n\n<p>We’re <em>constantly</em> asked, “What color is this?” <em>(points to a nearby object)</em> and “What color does this look like?” Then we watch as the person who asked us the question has their MIND BLOWN because we can’t see the correct color. Meanwhile, getting the color correct can sometimes be worse. First, there’s a look of confusion on the asker’s face. They can’t comprehend how we can both be color blind <em>and</em> see color at the same time, which leads to even more questions and “tests.” It turns what could have been a brief exchange into a lengthy and technical conversation, maybe at a bad time or inconvenient location.</p>\n\n\n\n<p>What I ended up learning is that these encounters will never go away, since most people I come into contact with have no knowledge about color blindness. I can either get annoyed by getting asked so many questions, or I can use it as an opportunity to educate.</p>\n\n\n\n<h3>Getting passed over for jobs</h3>\n\n\n\n<p>The first time I was passed over for a job specifically due to my CVD was when I was a teenager. It was a part-time job after school, and I was told—point-blank—it was because I’m color blind. A position had opened up in the frame shop at a big-box crafts store I’d been working at for over a year. After having been told I was getting the position, my boss somehow found out I’m color blind, then informed me that I wasn’t qualified to work in the frames department for that very reason. That was it, no discussion. I had to watch the position go to one of my coworkers. </p>\n\n\n\n<p>That may have been a minor blip on my teenage radar at the time, but little did I realize it was the first of many. Between the discrimination and frustration I dealt with at various jobs over the years, I eventually convinced myself to not tell new employers or coworkers about my color vision deficiency. I wasn’t going to lie about it if I got asked, but I wasn’t going to offer up that information unsolicited.</p>\n\n\n\n<p>After working in the web industry for many years, I eventually transitioned to a new approach. At this point, I have successfully proven to myself that my color vision deficiency doesn’t negatively impact my job, and that bringing it up via the lens of accessibility makes it more of a natural thing I can discuss with coworkers so we can put it to constructive use on projects.</p>\n\n\n\n<h2>Inside look at how I do my job</h2>\n\n\n\n<h3>Relying on tools for help</h3>\n\n\n\n<p>Being a professional front-end developer and designer with a CVD is easier than ever because there are so many tools and resources out there. Professionally, I have relied on color picker tools, websites that offer predefined color combinations, image editing software, and the mere fact that all colors can be represented by a hexadecimal value. </p>\n\n\n\n<p>In front-end tasks, I’m able to modify my code editor to suit my needs, for instance. I can use light or dark mode and a wide variety of color themes. I often use high-contrast themes that have been thoughtfully designed for developers with color vision deficiencies.</p>\n\n\n\n<p>Tools and resources I use regularly:</p>\n\n\n\n<ul><li><strong>Trello — </strong>Trello has a nice item labelling feature that takes CVDs into consideration. Not only can users label cards based on color, they can also use stripes, zigzags, polka dots, squiggly lines, and other shapes.</li><li><strong>VSCode — </strong>Visual Studio Code is my preferred code editor. I’m able to customize the interface with pre-built themes, and I can further modify those themes if I need to. I’m currently using one called Vue Theme, which I feel works really well for me. I choose themes based on what feels like the appropriate color contrast for my specific color vision deficiency. I lean toward dark backgrounds with brighter, higher-contrasting text colors that stand out against the background color. Another one of my favorites is <a href=\"https://marketplace.visualstudio.com/items?itemName=sdras.night-owl\">Sarah Drasner</a>’<a href=\"https://marketplace.visualstudio.com/items?itemName=sdras.night-owl\">s Night Owl theme</a>.</li><li><strong>Dev Tools — </strong>Whether it’s Chrome, Firefox, or Safari, I am constantly in the browser’s dev tools. There’s an ever-increasing number of features in dev tools that I can use to get the color information I need. Something I find handy is being able to Shift + click on a color value to cycle through various color formats (3 digit and 6 digit hexadecimal, RGB, HSL, and color name).</li><li><strong>Color Pickers</strong> — I installed a color picker Chrome browser extension called <a href=\"https://chrome.google.com/webstore/detail/eye-dropper/hmdcmlfkchdmnmnmheododdhjedfccka?hl=en\">Eye Dropper</a> to help me quickly grab colors from web pages. It allows me to sample colors from any web page, and provides me with the color in every format. This provides me with a secondary reassurance that the color I wrote in my CSS is truly being rendered. I wish I could trust the code as I see it in dev tools, but occasionally my eyes play tricks on me—I would swear that the color I’m seeing rendered on the screen isn’t the color value in dev tools. When I think that’s the issue, I can just grab the eye dropper and triple-check.</li><li><strong>Contrast Checker — </strong>I use the <a href=\"https://webaim.org/resources/contrastchecker/\">WebAIM Contrast Checker</a> to make sure that the colors I’m using are in compliance with the guidelines.</li></ul>\n\n\n\n<h2>Accessibility and inclusion</h2>\n\n\n\n<p>Statistically, 1 out of every 12 men and 1 out of every 200 women have a color vision deficiency. Across the world, <a href=\"http://www.colourblindawareness.org/colour-blindness/\">approximately 300 million people are color blind</a>. Those are significant numbers to factor in, especially if all those users are hampered by usability issues. Color alone can prevent them from completing interactions, receiving pertinent information, and from having the same experience as users with better color vision. That last fact alone is reason enough to pay attention to the concerns outlined here.</p>\n\n\n\n<h3>Color disabilities and the Web Content Accessibility Guidelines</h3>\n\n\n\n<p>The <a href=\"https://www.ada.gov/\">ADA</a> doesn’t specifically call out color blindness; it simply refers to visual disabilities. However, the Web Content Accessibility Guidelines <a href=\"https://www.w3.org/TR/WCAG21/#use-of-color\">(WCAG) does specifically mention color</a>. Compliance with the WCAG helps as a first step toward ensuring your site is usable by everyone, regardless of disabilities, but keep in mind that there could be additional factors at play with your site which may be “compliant” but still create difficulties for users.</p>\n\n\n\n<h3>Color contrast</h3>\n\n\n\n<p>For those of us who have a CVD, one of the more prevalent issues is a site’s color <em>contrast</em>; trouble with specific colors doesn’t necessarily mean we’ll have trouble with the site. </p>\n\n\n\n<p>If a site doesn’t have the proper color contrast ratio (text color on top of background color), then the site’s information may be more difficult to see or understand. WebAIM, a non-profit organization, published reports in 2019 and 2020 outlining <a href=\"https://webaim.org/projects/million/\">accessibility issues in the top one million home pages</a>. As of February 2020, 86.3% of home pages tested had insufficient contrast.</p>\n\n\n\n<p>So, what does that mean? It means that the information on those sites is not being conveyed equally, to everyone. That’s <a href=\"https://majestic.com/reports/majestic-million\">863,000 of the most influential and high-traffic sites</a> on the web delivering an unequal user experience to billions of users worldwide on a daily basis.</p>\n\n\n\n<h3>Data visualization</h3>\n\n\n\n<p>Color contrast is not the only issue when it comes to color blindness and accessibility. Data visualization is one area in particular that often relies heavily on color to convey information. It is also a prime example of what the WCAG mentions in their success criteria: </p>\n\n\n\n<blockquote><p>Color is not used as the only visual means of conveying information, indicating an action, prompting a response, or distinguishing a visual element. </p><cite>– Web Content Accessibility Guidelines 2.1 - Success Criterion 1.4.1 Use of Color</cite></blockquote>\n\n\n\n<p>I follow a few accounts on Twitter that bring attention to improper use of color in data visualizations. I would recommend getting started with these—they provide a lot of useful information and raise awareness surrounding issues that those of us with a CVD face:</p>\n\n\n\n<ul><li><a href=\"https://twitter.com/colourblindorg\">@colourblindorg</a></li><li><a href=\"https://twitter.com/WeAreColorblind\">@wearecolorblind</a></li><li><a href=\"https://twitter.com/WeTheColorBlind\">@WeTheColorBlind</a>.</li></ul>\n\n\n\n<p>Thankfully, making charts, graphs, and other visual aids color accessible isn’t that difficult. There is no need to remove colors altogether. Just try to use colorblind-friendly color palettes and don’t use problematic color combinations. Make sure all the data in your charts is labeled appropriately so that your readers can get the information in multiple ways. <a href=\"https://ourworldindata.org/\">Our World in Data</a>—a scientific online publication that focuses on large global problems such as poverty, disease, climate change, war, and inequality—has great examples of data visualizations of all types that I would consider to be colorblind-friendly.</p>\n\n\n\n<p>Whenever possible, I try to provide feedback from the perspective of someone who has a CVD, but I don’t make recommendations for specific color changes; I leave the color choices to those who aren’t color blind. Instead, I describe which elements I find difficult to interpret, and why. I tell them which information is getting lost on someone like me. The hope is that my feedback informs other designers of the need to make charts, tables, graphs, and maps more inclusive.</p>\n\n\n\n<h2>Adding people with a CVD to your team</h2>\n\n\n\n<p>As far as those of us who do have a CVD and work in the web industry: we are just as skilled and knowledgeable about our professions as anyone else, and there are plenty of ways that we can contribute to the visual aspects of projects—<em>especially</em> regarding color. We have the ability to review designs and report back whether any information is getting lost due to poor color contrast. We can inform designers if the chosen color palette is problematic. We can be the test subjects for our fellow UX designers during their usability research.</p>\n\n\n\n<p>There is also another point I’d like to get across here. There is a common misconception that a designer with a CVD doesn’t have the ability to do their job effectively. Hiring managers and other coworkers often make this assumption. Much to the contrary, people with CVDs have ways they work smart to work around their limitations. I mentioned earlier about the different tools I personally use to help me in my job. There are plenty of web industry professionals like me who use features in the tools at their disposal, getting the job done right, and so seamlessly that no one would guess they are color blind.</p>\n\n\n\n<p>That brings me to a broader point—the importance of hiring people with disabilities. I won’t go into the many, many, <em>many</em> reasons why companies should do that. Rather, I’ll mention some of the benefits from a design perspective. </p>\n\n\n\n<p>First and foremost, if you don’t have a disability, then how can you say conclusively that you know your product will work for those who do? </p>\n\n\n\n<p>The answer is, you can’t. Not without proper testing. Sure, there are companies out there that can help designers and developers conduct usability tests. But how amazing would it be if you had team members who could provide you with that invaluable feedback throughout the duration of each project? Think about all the knowledge you’ve accumulated about your profession. Think about all of the wisdom you can teach others. Now think about all the knowledge and wisdom that could be passed on to you by teammates living with a disability. Together, you can make your products truly inclusive. Trying to do it separately will always produce and reinforce limitations.</p>\n\n\n\n<h2>Critical CVD tips for your projects</h2>\n\n\n\n<p>Color can enhance the message, but shouldn’t be the messenger. UX and UI designers have within their power the ability to take color blindness into consideration—or to ignore it. You can make sure information is conveyed to everyone, not just people who see color “normally.” That is a great responsibility, with real life-or-death repercussions at stake for many users.</p>\n\n\n\n<p>For those of us in the web industry, there are specific action items I’d like you to take away from all this.</p>\n\n\n\n<h3>Design color palettes for “everyone”</h3>\n\n\n\n<p>Carefully plan your color palette—not for those who are color blind, but for <em>everyone</em>. Always keep in mind that ALL the information you provide in your product needs to be easy to recognize and easy to understand by anyone who touches it. We can get too familiar with what we’re doing and forget that information is delivered in multifaceted ways, so we need to be mindful of what’s specifically being conveyed by color. </p>\n\n\n\n<p>I highly recommend Geri Coady’s book, <a href=\"https://abookapart.com/products/color-accessibility-workflows\"><em>Color Accessibility Workflows</em></a>; it’s a fantastic resource. In it, she discusses color blindness, choosing appropriate color, compliance and testing, implementation, providing alternatives, and she includes some tips and tricks.</p>\n\n\n\n<h3>Don’t assume, and be careful what you ask </h3>\n\n\n\n<p>Do not assume which colors are difficult to see—actually do the research and testing. At minimum, please <a href=\"https://webaim.org/resources/contrastchecker/\">check the color contrast in your layout</a>.</p>\n\n\n\n<p>The reason I say that is because although the ADA doesn’t call out color blindness specifically, it does call out visual disabilities. In the U.S., it is illegal in the workplace (not to mention insulting and unwise) to ask people if they have a disability. In my book, that also applies to color blindness, and while it may not be illegal to ask in non-work contexts, it is definitely personally intrusive. </p>\n\n\n\n<p>However, if people volunteer to help you with your testing and they offer up that information about themselves, that’s a different matter. It may also be a good idea to reach out to some companies that specialize in user testing with people with disabilities. </p>\n\n\n\n<p>Companies such as <a href=\"https://www.levelaccess.com/\">Level Access</a> help organizations incorporate accessibility into their daily workflows. They offer tailored training, auditing services, document remediation, and other services to help organizations achieve—and maintain—compliance with <a href=\"https://section508.gov\">Section 508</a> and the WCAG.</p>\n\n\n\n<h3>Test with colorblind simulators AND colorblind users</h3>\n\n\n\n<p>Don’t rely on colorblind simulators alone. I could write an essay about this topic. Those simulators are not accurate enough to give you a proper understanding of color vision deficiencies.</p>\n\n\n\n<h3>Seek out first-hand perspectives </h3>\n\n\n\n<p>Actually speak to someone who has a color vision deficiency to get their perspective, and listen with an open mind. I can’t recommend this enough. There is no better way to get an understanding of what it’s like to live with a CVD than to hear about it first hand.</p>\n\n\n\n<h3>Stand up for coworkers and users</h3>\n\n\n\n<p>Don’t make light of color vision deficiencies. It’s difficult enough living with it, let alone being an artist with it or trying to make sense of information you literally can’t see.</p>\n\n\n\n<h2>Tools and further reading</h2>\n\n\n\n<h3>Accounts on Twitter </h3>\n\n\n\n<ul><li><a href=\"https://twitter.com/colourblindorg\">@colourblindorg</a></li><li><a href=\"https://twitter.com/WeAreColorblind\">@wearecolorblind</a></li><li><a href=\"https://twitter.com/WeTheColorBlind\">@WeTheColorBlind</a></li></ul>\n\n\n\n<h3>Usability and UX</h3>\n\n\n\n<ul><li><a href=\"https://uxmovement.com/buttons/the-myths-of-color-contrast-accessibility/\"><em>The Myths of Color Contrast Accessibility</em></a> — UX Movement</li><li><a href=\"https://wearecolorblind.com/resources/collection/resources-for-designing-for-the-colorblind/\"><em>Resources for Designing for the Colorblind</em></a> — We Are Colorblind</li><li><a href=\"https://webaim.org/projects/million/\"><em>The WebAIM Million</em></a></li><li><a href=\"https://webaim.org/resources/contrastchecker/\">WebAIM Contrast Checker</a></li></ul>\n\n\n\n<h3>Organizational resources</h3>\n\n\n\n<ul><li><a href=\"https://www.colour-blindness.com/general/how-it-works-science/\">Color-Blindness.com</a> </li><li><a href=\"http://www.colourblindawareness.org/\">ColourBlindAwareness.org</a></li><li><a href=\"https://ourworldindata.org/\">OurWorldinData.org</a></li></ul>\n\n\n\n<h3>Color perception and the brain</h3>\n\n\n\n<ul><li><a href=\"https://en.wikipedia.org/wiki/Chromatic_adaptation\">Chromatic adaptation</a></li><li><a href=\"https://en.wikipedia.org/wiki/Color_constancy\">Color constancy</a> </li><li><a href=\"https://jeb.biologists.org/content/209/5/781\">Nocturnal color vision</a> </li><li><a href=\"https://en.wikipedia.org/wiki/Spectral_color\">Spectral color</a></li></ul>\n\n\n\n<h2>Continuing to make progress</h2>\n\n\n\n<p>Loving design is something that has always come naturally to me; I didn’t have to force myself down this path. Growing up, I didn’t know that I wanted the exact job that I have, but by the time I graduated high school in 2000, I knew that I wanted to combine my passions for art and computers. </p>\n\n\n\n<p>I’m thankful to have been around long enough to have watched the web community evolve into what it is today. I’m thankful for all the tools that exist to help me do what I love in spite of my color vision deficiency. I’m thankful that color blindness is recognized by the WCAG, and that considerations are made for people living with color vision differences.</p>\n\n\n\n<p>There is a lot of information out there, and I recommend that people go out and read as much as they can on the topic. If you’re on Twitter, then follow people who have a CVD, or the organizations that deal with it in various ways. There is so much knowledge that can be gained by doing some simple research and adding it into your workflow.</p>\n","author":"","siteTitle":"A List Apart: The Full Feed","siteHash":"09b09f389b84b264a6ebab120b6208479961d3fe7df4850a75b103b2b9c8a950","entryHash":"9cd1cd808e87a5623c83bc36570a34898cdc6eff59608b1014025cff3ad75d1d","category":"Tech"}