{"title":"The $1,600 Dyson 360 Vis Nav promises to be the world’s most powerful robovac","link":"https://arstechnica.com/?p=1941294","date":1684873044000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n  <ul>\n          <li>\n        <div>\n          <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/RB03_SUBLNK_034_RGB_FrontOn3QVert_A4_REFW-980x569.jpg\" alt /></div>\n          <p>\n            The extremely colored Dyson 360 Vis Nav.                          [credit:\n                              Dyson                            ]\n                      </p>\n        </div>\n      </li>\n      </ul>\n\n<p>Swanky vacuum manufacturer Dyson has had a turbulent relationship with robovacs. The company's first swing at the idea came in 2016 with the <a href=\"https://www.dyson.com/support/journey/guides/64989-01?machineId=64989-01\">Dyson 360 Eye</a>, which sported a weird tall and stumpy form factor that didn't fit under furniture. A 2020 sequel, the <a href=\"https://www.dyson.ie/vacuum-cleaners/robot-vacuums/dyson-360-heurist/dyson-360-heurist-overview\">Dyson 360 Heurist</a>, kept the ultra-tall form factor and<a href=\"https://www.techradar.com/news/first-look-dyson-360-heurist-robot-wants-to-be-the-smartest-vacuum-cleaner-ever\"> wasn't even released</a> in the US as a result. This new robovac, the \"<a href=\"https://www.dyson.co.uk/newsroom/overview/news/may-2023/dyson-launches-most-powerful-robot-vacuum\">Dyson 360 Vis Nav</a>,\" opts for a more typical low, wide body design, making it look like a normal robot vacuum. Or at least, it's as normal as a Dyson product can ever look—it still has a screaming metallic purple paint job and what looks like a silver <em>Alien</em>-like facehugger on the top deck.</p>\n<p>Old Dyson robovacs were around 9 inches wide and 4.7 inches tall, so the company previously opted for a robot with a small footprint and a tall body. That theoretically allowed it to maneuver into tighter places than your average short, flat disk vacuum, but it can't kill the dust bunnies under the couch. Dyson says this new model can fit under a 99 mm (3.9 inch) tall gap, which is right in line with the normal height of a Roomba. It's also D-shaped now, like a Neato vac or <a href=\"https://arstechnica.com/gadgets/2019/05/the-2019-roomba-gets-an-all-new-design-companion-mop-bot/\">high-end Roomba</a>, which allows for a wider coverage path and to really get into those corners.</p>\n<p>Edge coverage is normally done by a spinning brush, but you won't find one here. Instead, there is what looks like an extendable, L-shaped red squeegee just behind the brush bar. When the robot detects a wall, the squeegee extends to connect with the wall, and Dyson says this will \"redirect suction\" and pick up everything.</p></div><p><a href=\"https://arstechnica.com/?p=1941294#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1941294&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9ce4ef256d451cf01af12812833678d1ce0c6125f739b9f77c8667c20960b1f1","category":"Tech"}