{"title":"Cardiac Rehabilitation for Fontan Circulation Patients: A Systematic Review, and Meta-Analysis","link":"https://www.preprints.org/manuscript/202408.1303/v1","date":1724054129000,"content":"Background: Despite procedural advancements in the management of univentricular heart patients palliated with a Fontan-type circulation, their exercise capacity and quality of life remain limited. Postoperative exercise training programs offer potential benefits, yet practical implementation and adherence to guidelines are often inadequate. This systematic review and meta-analysis aimed to evaluate the safety, efficacy, and optimal exercise modalities for Fontan patients. Method: A systematic search was conducted on August 24, 2023, using PubMed, Scopus, Web of Science, and Cochrane Library. Studies were screened via Rayyan QCRI based on pre-set exclusion criteria, and their quality was assessed using the Cochrane RoB Tool 2 and the STROBE checklist. A meta-analysis employed a continuous random-effects model to assess the efficacy of cardiac rehabilitation interventions. Results: The study included twenty-six studies (7 RCTs, 19 cohorts) representing 22 individual cohorts. The key findings were that aerobic exercise, lower-extremity resistance training, and inspiratory muscle training significantly improved VO2, enhancing exercise capacity in Fontan patients. Conclusion: While the results are promising, it's crucial to remember that training programs varied widely. Exercise training shows promise for postoperative management, potentially improving exercise capacity, cardiac biomarkers, lung function, and lower limb strength. However, further research is not just a suggestion, but a necessity. It's necessary to refine protocols, assess long-term impacts, and investigate underlying mechanisms, especially for Fontan patients with severe clinical conditions. This emphasizes the importance and urgency of further research in this area.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9ce6dc7b981b44c2cfddb4b7619de1dd1ac1b2dc74751945dcd58a077606c3ee","category":"Interdisciplinary"}