{"title":"232 Influence of melatonin supplementation on uterine and coccygeal artery hemodynamics of pregnant multiparous crossbred beef cows grazing endophyte-infected tall fescue","link":"https://academic.oup.com/jas/article/102/Supplement_3/284/7757484?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective was to determine the influence of melatonin supplementation on uterine and coccygeal artery hemodynamics of pregnant beef cattle grazing toxic, endophyte-infected (E+) tall fescue during mid-late gestation. Multiparous crossbred cows were artificially inseminated with sex-sorted semen (Y chromosome-bearing sperm) from a single Red Angus sire and maintained on pastures free from E+ fescue prior to the start of the treatment period. Pregnant cows (n = 50) were assigned to one of three treatment groups with two replications per treatment: non-toxic, novel endophyte-infected (NE+) fescue without melatonin supplementation (NE+/NM; n = 16), E+ fescue with melatonin supplementation (E+/M; n = 16), and E+ fescue without melatonin supplementation (E+/NM; n = 18). Treatments were administered over a 70-d period between May and July (d 147 ± 1 to 217 ± 1 of gestation). A commercially available feed was mixed with or without melatonin [100 µg/kg body weight (BW)] and hand-fed daily. Cows were weighed at d 0, 14, 28, 42, 56, and 70 relative to the start of the treatment period. Measures of uterine and coccygeal artery hemodynamics included artery diameter, pulsatility index (PI), resistance index (RI), blood flow (BF), and blood flow as a proportion of BW (BF/BW) and were determined by color Doppler ultrasonography at the conclusion of the 70-d treatment period. Plasma prolactin was determined at the end of the 70-d treatment by radioimmunoassay. After the treatment period, cattle were maintained together as a single group on pastures that were free from E+ fescue. Body weights were analyzed using the MIXED procedure of SAS specific for repeated measures with treatment, time, and the interaction as fixed effects and replicate as random. Prolactin and arterial hemodynamics were analyzed using the MIXED procedure of SAS with treatment as a fixed effect and replicate as random. There was an effect of time and a treatment by time interaction on cow BW (<span>P</span> &lt; 0.01). Prolactin was decreased (<span>P</span> = 0.02) in E+/NM (71.8 ± 14.0 ng/mL) and E+/M (86.9 ± 14.9 ng/mL) relative to NE+/NM (128.9 ± 14.9 ng/mL) cows. Coccygeal artery PI was decreased (<span>P</span> &lt; 0.02) in E+/M (0.86 ± 0.1) relative to NE+/NM (1.06 ± 0.1) cows. Coccygeal artery RI was decreased (<span>P</span> &lt; 0.01) in E+/M (0.53 ± 0.02) relative to NE+/NM (0.62 ± 0.02) cows. There were no other effects of treatment (<span>P</span> &gt; 0.05). Preliminary results suggest limited effects of melatonin on uterine and coccygeal artery hemodynamics in pregnant multiparous crossbred beef cows grazing endophyte-infected tall fescue.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9ce7285707b46d59398e4728b7ba37028609a5e1b582432723f38d60f02e3f7c","category":"Environment"}