{"title":"Mucilage secretion from the root cap requires the NAC family transcription factor BEARSKIN2","link":"https://academic.oup.com/plphys/article/196/2/1180/7730145?rss=1","date":1723075200000,"content":"<span><div>Abstract</div>The root cap secretes mucilage and sheds border cells (border-like cells, BLCs) in Arabidopsis (<span>Arabidopsis thaliana</span>). These mucilage and root cap-derived cells form a defensive barrier against soil pathogens. BEARSKIN1 (BRN1) and BRN2 are 2 homologous NAM, ATAF1/2, and CUC2 (NAC) family transcription factors of Arabidopsis, and mucilage secretion is inhibited in the <span>brn1/2</span> double mutant. BRN1 and BRN2 are also involved in the expression of a pectin-digesting enzyme, <span>POLYGALACTURONASE (RCPG)</span>, that facilitates BLC shedding. To further explore the connection between mucilage secretion and BLC shedding, we examined mucilage production in Arabidopsis lines displaying altered BLC detachment. Inactivation of <span>BRN2</span> blocked mucilage synthesis and secretion, while inactivation of <span>BRN1</span> and <span>RCPG</span> did not. Interestingly, RCPG sorted into mucilage-carrying vesicles budding from the Golgi and inhibited mucilage secretion in <span>brn2-</span>delayed BLC detachment. The root cap of a germinating seedling is initially covered with a cuticle, which is replaced by mucilage from BLCs as the seedling begins to shed these cells. Ectopic expression of RCPG in germinating seedlings caused early BLC formation and accelerated the cuticle-to-mucilage transition, indicating that RCPG expression and mucilage secretion are co-regulated. Furthermore, <span>brn2</span> roots exhibited slower growth and increased cell death when subjected to salt or osmotic stress. Our research suggests that BRN2-mediated mucilage secretion contributes to BLC release to build an extracellular defense zone surrounding the root cap.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"9ce89dcf6bfdffe7318e44a28d0f3010191a2fbb7b688dfe67003a08b13e7994","category":"Environment"}