{"title":"Deciphering the Genetic Landscape: Insights Into the Genomic Signatures of Changle Goose","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13768?af=R","date":1724333426000,"content":"<h2>ABSTRACT</h2>\n<p>The Changle goose (CLG), a Chinese indigenous breed, is celebrated for its adaptability, rapid growth, and premium meat quality. Despite its agricultural value, the exploration of its genomic attributes has been scant. Our study entailed whole-genome resequencing of 303 geese across CLG and five other Chinese breeds, revealing distinct genetic diversity metrics. We discovered significant migration events from Xingguo gray goose to CLG and minor gene flow between them. We identified genomic regions through selective sweep analysis, correlating with CLG's unique traits. An elevated inbreeding coefficient in CLG, alongside reduced heterozygosity and rare single nucleotide polymorphisms (R<sub>SNPs</sub>), suggests a narrowed genetic diversity. Genomic regions related to reproduction, meat quality, and growth were identified, with the <i>GATA3</i> gene showing strong selection signals for meat quality. A non-synonymous mutation in the <i>Sloc2a1</i> gene, which is associated with reproductive traits in the CLG, exhibited significant differences in allelic frequency. The roles of <i>CD82</i>, <i>CDH8</i>, and <i>PRKAB1</i> in growth and development, alongside <i>FABP4</i>, <i>FAF1</i>, <i>ESR1</i>, and <i>AKAP12</i> in reproduction, were highlighted. Additionally, <i>Cdkal1</i> and <i>Mfsd14a</i> may influence meat quality. This comprehensive genetic analysis underpins the unique genetic makeup of CLG, providing a basis for its conservation and informed breeding strategies.</p>","author":"Hao Chen, \nYan Wu, \nYihao Zhu, \nKeyi Luo, \nSumei Zheng, \nHongbo Tang, \nRui Xuan, \nYuxuan Huang, \nJiawei Li, \nRui Xiong, \nXinyan Fang, \nLei Wang, \nYujie Gong, \nJunjie Miao, \nJing Zhou, \nHongli Tan, \nYanan Wang, \nLiping Wu, \nJing Ouyang, \nMin Huang, \nXueming Yan","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"9cea33ce4b1b87cec3cf534514fcf9a736c0640e7c9b9b42e4fe7e30c950dd8e","category":"Environment"}