{"title":"iPhone 14 takes shape with in-display Touch ID, 48MP camera, non-Pro Max","link":"https://www.macworld.com/article/349476/iphone-14-in-display-touch-id-fingerprint-48mp-wide-angle-camera-max-6-7-inch-price.html","date":1624545680000,"content":"\n<div>\n<section><div></div></section><p>With the iPhone 13 nearly here and leaked basically in its entirety, our attention is turning to next year’s phone. Oft-accurate analyst Ming-Chi Kuo <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://9to5mac.com/2021/06/23/kuo-2022-iphones-could-feature-under-display-touch-id-lowest-price-ever-for-6-7-inch-iphone/&amp;xcust=1-1-349476-0-0-0&amp;sref=https://www.macworld.com/feed\">has some predictions</a> and Apple could be planning big changes.</p>\n\n\n\n<p>The biggest upgrade, according to Kuo, will come in the form of an in-display fingerprint sensor, which would be the first Apple product to deliver Touch ID in a virtual reader. On Android phones that have the feature, scanning works by illuminating the section of the screen that has the sensor and using either an optical or ultrasonic scanner under the glass to read your fingerprint. In our experience, it’s not as reliable as a physical scanner, but it’s likely that Apple will have solved that problem if and when it launches in an iPhone.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/oneplus-6-fingerprint-scanner.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>In-display fingerprint scanners are common on Android phones.</figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>Along with the in-display scanner, Apple is also reportedly looking to bolster the non-Pro lineup with a new Max model. Apple introduced a fourth iPhone option with the iPhone 12 mini last year, but numerous reports suggest that it’s not selling as well as Apple hoped. While rumors suggest Apple will be <a href=\"https://www.macworld.com/article/234814/2021-iphone-13-12s-rumors-specs-120hz-a15-display-notch-camera-battery-colors-storage-release.html\">sticking with the mini for the iPhone 13</a>, next year’s lineup could go in the other direction with a cheaper 6.7-inch non-Pro Max.</p>\n\n\n\n<p>Apple introduced the Max phone with <a href=\"https://www.macworld.com/article/231932/iphone-xs-and-iphone-xs-max-review.html\">the iPhone XS in 2018</a> and it’s remained as the flagship iPhone model for three generations, with the iPhone 12 Pro Max sporting Apple’s largest-ever screen and better camera features than the other models. Kuo says the iPhone 14 lineup will include “the lowest price ever” for an iPhone of that size, which he expects will come in at 6.7 inches and under $900. He doesn’t mention anything beyond the size and price, but it will presumably have fewer cameras and features than the Pro version.</p>\n\n\n\n<p>Kuo also expects Apple to dramatically upgrade the wide-angle camera in the Pro models from 12MP on the iPhone 12 to 48MP. Apple has stuck with a 12MP camera for several generations while the iPhone has been outpaced by its Android counterparts, which offer cameras that top 100MP. The iPhone 13 is expected to retain a similar camera with an improved 7-element lens structure with a slightly wider aperture.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9cebf0f6b06c3f188b9f1efad515e5d4526c247cd116fef38e31b4ebef3fa7fd","category":"Apple"}