{"title":"190 Phytogenic feed additive improved growth performance and health of nursery pigs in diets with and without combination of several feed additives","link":"https://academic.oup.com/jas/article/102/Supplement_2/138/7665042?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>An experiment was conducted to test the hypothesis that a phytogenic feed additive (Fresta Protect, Delacon, Austria) would improve growth performance and health indices of nursery pigs fed diets with or without other feed additives. Weaned pigs (n = 1,380; 19 d old with initial body weight (BW) = 5.5 ± 0.3 kg] were allotted to 10 replicate pens per treatment (23 pigs per pen) in 2 barns. Pens were blocked by location within barn and randomly allotted to one of 6 treatments: 1) Basal nursery feed without other feed additives (NC), 2) NC + 0.1% phytogenic (NC+P0.1), 3) Basal nursery feed with other feed additives such as organic acids, antioxidants, and blend of preservatives (PC), 4) PC + 0.05% phytogenic (PC+P0.05), 5) PC + 0.1% phytogenic (PC+P0.1), or 6) PC + 0.2% phytogenic (PC+P0.2). The experiment lasted for 39 d, with pigs fed experimental diets during phase 1 (d 0-10) and 2 (d 10-23) and a common diet without addition of PC or phytogenic during phase 3 (d 23-39). Pig and feed weights were recorded at the beginning and end of each phase. Performance data were analyzed using the lme4 package of R with treatment as fixed effect and barn and pen location within barn as random effects. Contrasts were used to test linear and quadratic effects of phytogenic in PC diets (diets 3 to 6), and diets 1, 2, 3, and 5 were used to compare main effects of phytogenic, diet type, and interaction between phytogenic and diet type. Results indicated that pigs fed diets with phytogenic, regardless of diet type, had increased (<span>P</span> &lt; 0.05) average daily gain (ADG) and gain to feed ratio (G:F) in phase 1, final BW, ADG, and average daily feed intake (ADFI) in phase 2, as well as overall ADG and ADFI. The changes observed in final BW and ADFI in phase 2 had a quadratic response (<span>P</span> &lt; 0.05) as dietary inclusion of phytogenic increased, whereas overall ADG linearly increased (<span>P</span> &lt; 0.05) with greater levels of phytogenic supplementation (Table 1). In phase 2, the phytogenic supplementation increased G:F to a greater extent when diets did not contain other feed additives compared with PC diets (phytogenic x feed type interaction: <span>P</span> &lt; 0.05). Phytogenic supplementation numerically reduced mortality. Pigs fed PC diets, regardless of inclusion of phytogenic, had increased (<span>P</span> &lt; 0.05) final BW, ADG, and G:F in phase 1, final BW, ADG, and ADFI in phase 2, and overall ADG and ADFI compared with pigs fed NC diets. In conclusion, phytogenic supplementation with an optimal dietary inclusion of 0.1% improved growth performance, regardless of supplementation of other feed additives in the diet, and diets containing additional feed additives further improved performance of pigs.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9cf0a2ab0aa5daf85a72b7308bd28b81ac478c5d5b856c9d9c24bfd47e27f1eb","category":"Environment"}