{"title":"Healthcare utilization in Ghana: Insights from the 2017 Ghana Living Standard Survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306032","date":1719324000000,"content":"<p>by Derek Anamaale Tuoyire, Leonard Baatiema, Duah Dwomoh, Samuel Bosomprah</p>\r\nIntroduction <p>The persistence of healthcare utilization disparities in Ghana despite several policy efforts highlights the urgency of understanding its determinants to enhance equitable health access. We sought to examine the determinants of healthcare utilization in Ghana.</p> Methods <p>We used the 2017 Ghana Living Standard Survey (GLSS) data. This was a cross-sectional design, which employed a stratified two-stage random sampling technique. We analyzed data involving 8,298 respondents with information on visits to healthcare facilities for services on account of illness or injury two weeks prior to the survey. Pearson’s chi-squared test was used to assess the distribution of healthcare utilization across background characteristics. Further, we used multivariable Poisson regression model with robust standard error to identify factors independently associated with healthcare utilization.</p> Results <p>Among the 8,298, the median age was 24 years (interquartile range = 7–47), 45% were males, and 45% had no education. About 42% of respondents utilized health services during an episode of illness or injury. Age, sex, educational level, marital status, wealth quintile, health insurance and severity of illness/injury were independently associated with healthcare utilization. Healthcare utilization increased significantly with wealth quintiles—those in the highest wealth quintiles had about 22% increased utilization compared to those in the lowest wealth quintiles (aPR = 1.22; 95%CI = 1.13–1.32) while it was about 77% higher among those who had valid health insurance compared to those without (aPR = 1.77; 95% CI = 1.68–1.86). Regarding severity of illness or injury, those with severe conditions were about 65% more likely to utilize healthcare services compared to those with acute conditions (aPR = 1.65; 95% CI = 1.53–1.78).</p> Conclusion <p>Our study underscores the importance of socio-economic factors and health insurance in healthcare utilization in Ghana. Addressing these can pave the way for more equitable access to healthcare services across all segments of the population.</p>","author":"Derek Anamaale Tuoyire","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9cf6a03f3baa3d1bc339c58a179f49b2f1fb020454d5fdc6fb90b27da866207f","category":"Interdisciplinary"}