{"title":"Ocean circulation contributes to genetic connectivity of limpet populations at deep‐sea hydrothermal vents in a back‐arc basin","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13727?af=R","date":1718689249000,"content":"<h2>Abstract</h2>\n<p>For endemic benthos inhabiting hydrothermal vent fields, larval recruitment is critical for population maintenance and colonization via migration among separated sites. The vent-endemic limpet, <i>Lepetodrilus nux</i>, is abundant at deep-sea hydrothermal vents in the Okinawa Trough, a back-arc basin in the northwestern Pacific; nonetheless, it is endangered due to deep-sea mining. This species is associated with many other vent species and is an important successor in these vent ecosystems. However, limpet genetic diversity and connectivity among local populations have not yet been examined. We conducted a population genetics study of <i>L. nux</i> at five hydrothermal vent fields (maximum geographic distance, ~545 km; depths ~700 m to ~1650 m) using 14 polymorphic microsatellite loci previously developed. Genetic diversity has been maintained among these populations. Meanwhile, fine population genetic structure was detected between distant populations, even within this back-arc basin, reflecting geographic distances between vent fields. There was a significant, positive correlation between genetic differentiation and geographic distance, but no correlation with depth. Contrary to dispersal patterns predicted by an ocean circulation model, genetic migration is not necessarily unidirectional, based on relative migration rates. While ocean circulation contributes to dispersal of <i>L. nux</i> among vent fields in the Okinawa Trough, genetic connectivity may be maintained by complex, bidirectional dispersal processes over multiple generations.</p>","author":"Yuichi Nakajima, \nMasako Nakamura, \nHiromi Kayama Watanabe, \nJun‐ichiro Ishibashi, \nHiroyuki Yamamoto, \nSatoshi Mitarai","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"9cfc44d31e9fd0c1b136ce53f72ed600437d0b08631dcb68fb40b89df3d71ea9","category":"Environment"}