{"title":"iOS 17 introduces strict new app rules in fight against ‘fingerprinting’","link":"https://www.macworld.com/article/2012005/ios-17-required-reasons-apis-fingerprinting.html","date":1690554934000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>When <a href=\"https://www.macworld.com/article/1519552/ios-17-release-date-features-compatibility-beta.html\">iOS 17</a> arrives this fall, it will bring a slew of features that make our iPhones better, including Contact Posters, Standby, and Live Voicemail. But there’s one you might not notice that will make your iPhone safer: a new requirement for developers that seeks to cut down on using APIs to track users by “fingerprinting” them.</p>\n\n\n\n<p>As spotted by 9to5Mac, iOS 17 <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/documentation/bundleresources/privacy_manifest_files/describing_use_of_required_reason_api&amp;xcust=1-1-2012005-1-0-0&amp;sref=https://www.macworld.com/feed\">introduces a set of “required reason” APIs</a> that need to be defined before an app will be approved for distribution in the App Store. Apple says these APIs “have the potential of being misused to access device signals to try to identify the device or user, also known as fingerprinting.” Developers using one of the five required reason APIs–active keyboard, disk space, file timestamp, system boot time, and user defaults–must declare one or more approved reasons for using each of the APIs and the data they collect.</p>\n\n\n\n<p>For example, an app using the file timestamp API must declare why the app needs to display file timestamps to the person using the device, access the timestamps of files inside the app container, or access the timestamps of files or directories that the user specifically granted access to. </p>\n\n\n\n<p>For developers that legitimately use these APIs within their apps, the process should be a short one. However, it could lead to submission rejections for apps that improperly use APIs to collect user data. Apple says the new regulations will go into effect in fall 2023.</p>\n\niOS</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9cfd93ecf83b70aec6e118b80930b7ff16f3e5ee7933cba598f18d78633ac961","category":"Apple"}