{"title":"Oral Antiviral Defense: Saliva- and Beverage-Like Hypotonicity Dynamically Regulate Formation of Membraneless Biomolecular Condensates of Antiviral Human MxA in Oral Epithelial Cells","link":"https://www.preprints.org/manuscript/202403.0727/v1","date":1710253419000,"content":"The oral mucosa represents a defense between the external environment and the rest of the body and encompasses several antimicrobial and antiviral mechanisms. Oral mucosal cells are constantly bathed in hypotonic saliva (normally one-third tonicity compared to plasma) and are repeatedly exposed to environmental stresses of tonicity, temperature and pH by the drinks we imbibe (e.g. hypotonic: water, tea, coffee; hypertonic: assorted fruit juices, red wines), as well as of diverse microbial and viral flora. In the mouth, the broad-spectrum antiviral mediator MxA (a dynamin-family large GTPase) is constitutively expressed in healthy periodontal tissues, and also induced by Type III interferons (e.g. IFN-λ1). Endogenously induced human MxA and exogenously expressed human GFP-MxA formed membraneless biomolecular condensates in the cytoplasm of oral carcinoma cells (OECM1 cell line). These condensates likely represent storage granules in equilibrium with antivirally active dispersed MxA. Remarkably, cytoplasmic MxA condensates were exquisitely sensitive sensors of hypotonicity – the condensates in oral epithelium disassembled within 1-2 min of exposure of cells to saliva-like one-third hypotonicity, and spontaneously reassembled in the next 4-7 min. OECM1 cells preloaded with calcein-AM (a reporter of cytosolic “macromolecular crowding”) confirmed unquenching and then requenching of calcein fluorescence during this process. Hypertonicity had little effect on MxA condensates. The spontaneous reassembly of GFP-MxA condensates in oral epithelial cells even under continuous saliva-like hypotonicity was slowed by the protein phosphatase inhibitor cyclosporin A (CsA) and by the K-channel blocker tetraethylammonium chloride (TEA) suggestive of the involvement of the volume-sensitive WNK kinase-protein phosphatase (PTP)-K-Cl cotransporter (KCC) pathway in the regulated volume decrease (RVD) during condensate reassembly in oral cells. Thus, physiologically, hypotonic drinks (water, tea, coffee) trigger a rapid deployment of antiviral MxA throughout the cytoplasm of oral epithelial cells, with subsequent salvage of MxA back into storage granules/condensates.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9d001f43c7004736d2c0db43693afed6bb6248f035f67bd37433c8cf633f62b4","category":"Interdisciplinary"}