{"title":"The role of macrophyte-associated microbiomes in lacustrine wetlands: an example of the littoral zone of lake Atitlan, Guatemala","link":"http://link.springer.com/10.1007/s10750-022-05043-z","date":1711929600000,"content":"<h3>Abstract</h3>\n                    <p>Despite rapid progress in plant–microbe interaction research within terrestrial environments, our knowledge of aquatic plant and macroalgae microbiome structure, function, and ecology remains scarce, even though these hosts are key players in structuring the lacustrine environments. Here, we used the co-occurring, fast-growing hosts <em>Hydrilla verticillata</em> (Hydrocharitaceae) and <em>Cladophora</em> spp. (Chlorophyta), which dominate the littoral zones of a nitrogen-limited, hard-water lake, Lake Atitlán (Guatemala). The aim of this study was: (1) to assess the structure of <em>Hydrilla</em> phyllosphere-associated and <em>Cladophora</em> filament-associated bacterial and fungal assemblages in the context of host specificity; (2) to predict microbial potential to contribute to biogeochemical cycling in the lake littoral; and (3) to compare the aquatic microbiome structure to available datasets from terrestrial ecosystems, using next-generation amplicon sequencing, co-occurrence network analysis, and N<sub>2</sub>-fixation activity measurements. We show that the microbiomes associated with the phyllosphere of aquatic macrophytes and macroalgal filaments are surprisingly similar, with taxonomic and functional complexity analogous to that of rhizospheric assemblages in terrestrial plants, and have a potential to efficiently recycle nutrients from organic matter. We suggest that especially the fungal associations with these hosts represent an untapped research area of microbial ecology that warrants further attention.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"9d07ea96dd04be9cf56e574e227e4f610ecd6c8d99d5ca958281bf3752afd183","category":"Environment"}