{"title":"Simplifying Submandibular Duct Sialolith Removal Using Diode laser: Description of the Technique and Literature Review","link":"https://www.preprints.org/manuscript/202408.0618/v1","date":1723164429000,"content":"Background: Introduction of new technologies in the management of oral disease has revolutionized treatment approaches, offering less invasive options and improved patient outcomes. Among oral cavity diseases, sialolithiasis is the most common disorder of the salivary glands. It involves the formation of calculi or stones within the salivary ducts, primarily affecting the submandibular gland due to its tortuous duct and the alkaline nature of its saliva. In particular, Laser-assisted techniques have shown significant promise in enhancing the precision and safety in the management of sialolith removal. This article aims to present a case report and also explores the scientific evidence supporting these innovative methods, highlighting their benefits and limitations in clinical practice.; Methods: The research was conducted using PubMed and Scopus search engines with a combination of relevant keywords, including laser, laser-assisted, laser treatment in combination with sialolith, sialolith removal, and sialoadenectomy. Selected articles were carefully reviewed to identify studies reporting data on the effectiveness of laser-assisted sialolith removal; Results: The results of the literature review indicate a growing interest in the application of Diode Laser and CO2, with evidence suggesting improved clinical outcomes and reduced postoperative pain compared to traditional methods; Conclusions: Although lasers offer enhanced safety and reduced morbidity and bleeding, which ensures optimal visibility, their high cost and the need for specialized training are limitations. Further randomized clinical trials and longer follow-up studies are needed to better evaluate their use in sialolith removal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9d0cbe6c64cc5e51f18c0474f685c6b4a8b97facfcb156930df548bfa4244be6","category":"Interdisciplinary"}