{"title":"Demonstrating a Hybrid Machine Learning Approach for Snow Characteristic Estimation Throughout the Western United States","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035805?af=R","date":1718884407000,"content":"<h2>Abstract</h2>\n<p>Snow is a critical component of global climate and provides water resources to over 1 billion people worldwide. Yet current measurement methods and modeling techniques lack the ability to fully capture snow characteristics such as snow water equivalent (SWE) and density across variable landscapes. In recent years, physics-informed machine learning (ML) methods have demonstrated promise for combining data-driven learning and physical information. However, this capability has not been widely explored within snow hydrology. Here, we develop a “hybrid” model that applies ML informed by outputs from a physical model and assess whether it provides more accurate estimations of SWE and snow density. We trained and evaluated models at 49 SNOw TELemetry locations spanning a range of snow climates in the western US using 9 years of daily data. The research addressed two questions. In the first, the performance of the hybrid model was compared against a plain neural network (long short-term memory, Long-Short Term Memory), a high-quality physical model, and a statistical snow density model. The second question focused on how regionally trained hybrid models compared to a westwide model as well as their transferability between multiple snow regions. The results showed that combining physical information and ML reduced SWE Root Mean Square Error by 35% compared to a physical model and 51% compared to a neural network. Additionally, regional training only provided minimal benefits compared with a westwide model. These findings indicate that a hybrid approach can yield more accurate snowpack characterization than either physical snow models or ML alone.</p>","author":"Hannah Steele, \nEric E. Small, \nMark S. Raleigh","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"9d1499ae8b1bc6c38e4ef6192f6dc590bcadddb9d3c036123b6daab9c331f794","category":"Environment"}