{"title":"What does the men's Olympic Road Race tell us about the rest of the season?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/what-does-the-mens-olympic-road-race-tell-us-about-the-rest-of-the-season","date":1627404647000,"content":"\n      <p><span>The men’s Olympic Road Race was one for the ages. A crescendo finale saw a relentless flurry of attacks following a difficult ascent of Mikuni Pass. Richard Carapaz took the Gold medal for Ecuador after a perfectly timed move on the run-in to the Speedway Circuit. </span></p>\n<div></div>\n<p><span>The three medalists came straight from Paris where they had all finished a tough edition of the Tour de France, proving they could handle the fatigue they were carrying from the three-week race. The Olympic Road race was the first test after the Tour and the first opportunity to see how each rider had recovered. It was also the first time we saw some riders who had skipped the Tour to place full focus on Tokyo.</span></p>\n<p><span>With this being said, it gave us an interesting insight into how the rest of the year may play out: who is on form and who may struggle in the latter stages of 2021? Here’s what the Olympic Road race tells us about the rest of this season:</span></p>\n<h4><b>Wout van Aert is a marked man</b></h4>\n<p><span>The Belgian rider proved he was incredibly strong in the Olympic Road Race, but after his eye-catching exploits in the Tour de France – winning three stages of completely varying terrain – Van Aert’s rivals all had their eyes on him on Sunday. With no one keen to take the Champs Elysees stage winner to the line for a sprint, or wanting to allow him to go solo following his Tour de France ITT win, Van Aert was forced to do the majority of the work in the chase group, with many looking to him to close down attacks.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/wout-van-aert\">Related: Wout van Aert – Comeback Kid</a></em></strong></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_3416_1024x1024.jpg?v=1627386244\" /></span></p>\n<p><em><span>Image: </span>Alex Broadway/SWpix.com</em></p>\n<p>\"I was the fastest finisher and you are always looked at. I knew in advance that this was going to be a difficult situation,\" Van Aert said after the race. For the rest of the season, Van Aert’s reputation is likely going to precede him. He will be one of the hot favourites for races like the World Championships and Paris Roubaix, and he’s going to have to ride innovatively to be given a shot at the win. It could be difficult for him to find riders who will cooperate with him in a breakaway, and he almost certainly won’t be given any leeway to go for the win alone. </p>\n<h4><b>Carapaz may secure a Grand Tour win this season after all</b></h4>\n<p><span>Despite Richard Carapaz finishing third in the Tour de France, the Ineos Grenadiers were probably disappointed with their showing in La Grande Boucle. Their tactics were questionable at points, seemingly riding to control the race as they used to when they were holding the yellow jersey. Since Carapaz was minutes down on eventual winner Tadej Pogacar on GC, Team Ineos were really doing work that could have been left to UAE Team Emirates.</span></p>\n<p><strong><em><a href=\"https://www.youtube.com/watch?v=lnA_t0QnghI\" target=\"_blank\">Related: Tour de France 2021, Rouleur's Video Debrief</a></em></strong></p>\n<p><span>Carapaz himself battled valiantly throughout the race, playing clever tactics when he was left alone with Pogacar and second place finisher Jonas Vingegaard towards the end of the mountain stages. He can be proud of his eventual podium finish in Paris, but his performance at the Olympic Road Race proved he could be capable of more. He showed supreme strength and rode a near perfect race, showing he’d recovered well from the Tour.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB3_6867_1024x1024.jpg?v=1627386294\" /></span></p>\n<p><em><span>Image: </span>SWpix.com/CorVos</em></p>\n<p><span>With this being said, could Carapaz head to the Vuelta a España still this year? When asked this question during the Tour de France, he said “possibly”, and the Ecuadorian is on the provisional start list. Although it would be a big ask, Carapaz looks to be in great form and could still get Ineos their second Grand Tour victory of the season.</span></p>\n<h4><b>The Italians look strong ahead of the World Championships and Paris–Roubaix</b></h4>\n<p><span>The final results might not show it, but the Italian team rode an impressive Olympic Road Race, and it wasn’t from the riders we might have expected to excel over the hilly course. Vincenzo Nibali fell away early on Mikuni Pass after putting in some attacks in the lead into the climb. Despite leaving the Tour de France early to focus on the Olympics, the Shark might be a bit disappointed with how his race turned out.</span></p>\n<p><span>Taking up the mantle for the Italians, though, was an incredibly strong Alberto Bettiol. He stayed with an elite group of favorites on the steepest climb of the day. For a rider who has won the Tour of Flanders and is often thought to be well-suited to the punchier, Classics terrain, this was a notably strong ride. He suffered in the hot conditions, though and cramped during the approach to the finish. Gianni Moscon also looked to be in imperious form on a course that probably included climbs too difficult for his liking.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1330354580_d127998a-f1f6-4309-8d13-60030ae1afa4_1024x1024.jpg?v=1627386549\" /></span></p>\n<p><em><span>Image: Tim de Waele/Getty</span></em></p>\n<p><span>As Paris–Roubaix has been moved to the back-end of the season and with the World Championships coming up in Flanders in September, both Moscon and Bettiol have announced themselves as big contenders for these late season Classics. While the Gold medal may have eluded them at the Olympics, the rainbow bands are still very much a possibility for the Italian team, and Bettiol is unlikely to have to worry about the heat in the bergs of Belgium.</span></p>\n<h4><b>Tadej Pogacar might actually be a tiny bit tired</b></h4>\n<p><span>Watching the two-time Slovenian Tour de France champion accelerate and respond to every attack thrown at him over the mountains in the last few weeks, you’d be forgiven for thinking that Tadej Pogacar is super-human. He rarely shows any cracks in his armour, keeping his riding style smooth and calm, he’s always ready to chase down his rivals, not willing to take any risks by allowing them a gap.</span></p>\n\n<p><span><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tadej-tommorow-always\">Related – Tadej Pogačar: From Slovenian village unicyclist to Tour de France champion</a></strong></em></span></p>\n<p><span>In the Olympic Road Race, when Pogacar made his attack on the eye-wateringly steep Mikuni Pass climb, it looked like the decisive move. He rode away in that trademark style, but, unlike at the Tour de France, he didn’t open up such a gap. In fact, even Pogacar himself admitted to regretting his decision to make a move at that point: “I actually don’t know what I was thinking when I attacked. I tried my best but soon I was regretting it and hoping for the climb to finish,” he explained in the press conference afterwards.<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/AB2_3149_1024x1024.jpg?v=1627386649\" /></span></p>\n<p><em><span>Image: </span>Alex Broadway/SWpix.com</em></p>\n<p><span>Although he didn’t outwardly show signs of cracking or fatigue, the fact that two other riders (Mike Woods and Brandon McNulty) could respond to the attack, showed that the Slovenian rider is, understandably, lacking a little punch after the Tour de France. He still finished with a bronze medal and rode a commendable race, ending with a blistering sprint that almost saw him surpass Wout van Aert in the fight for silver. However, Pogacar’s performances over the last few years mean that he is held to an incredibly high standard, and small signs of weakness are easily picked up on.</span></p>\n<p><strong><em><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/what-s-next-for-tadej-pogacar\">Related: What's next for Tadej Pogacar?</a></em></strong></p>\n<p><span>There have been murmurings about the possibility of Pogacar riding the Vuelta a España this season, but it is yet to be confirmed. Could it be that his performance in Tokyo could sway his decision to skip the Vuelta, opting to rest and target one-day races like Il Lombardia that are well-suited to him instead, rather than another taxing three-week Grand Tour?</span></p>\n<div></div>\n    ","author":"Miles Baker-Clarke","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9d20878eebf0538eb69eef5f29f5c36364e10c00ae3900b76070fdcdfed4e193","category":"Cycling"}