{"title":"Six things I want to see in the new Specialized Roubaix","link":"https://www.bikeradar.com/features/opinion/six-things-i-want-to-see-in-the-new-specialized-roubaix/","date":1682424044000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Paris-Roubaix--Specialized-Roubaix-2-9473af0.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"External cables on Peter Sagan's Specialized Roubaix at Paris-Roubaix 2023\" title=\"External cables on Peter Sagan's Specialized Roubaix at Paris-Roubaix 2023\" />                                            <p>The Specialized Roubaix platform is arguably one of the pillars of the endurance bike genre.</p>\n<p>Since its introduction in 2004, the Roubaix has been through a number of revisions. Until 2017, the Roubaix used visco-elastic rubber ‘Zertz’ inserts embedded in the fork and seatstays, claimed to improve compliance.</p>\n<p>In 2017, the brand ditched the Zertz inserts and introduced Future Shock, a damper positioned above the head tube that delivers 20mm of travel. We found the combination of the Future Shock and the cobra-headed <a href=\"https://www.bikeradar.com/reviews/components/seatposts/seatpost-and-seat-pin/specialized-cg-r-seatpost-review/\">CG-R seatpost</a> to be a winning formula and, as a result, the <a href=\"https://www.bikeradar.com/reviews/components/bike-frames/road-bike-frames/specialized-roubaix-2017-review/\">Roubaix Comp was our Bike of the Year in 2017</a>.</p>\n<p><a href=\"https://www.bikeradar.com/news/specialized-roubaix-pro-and-s-works-first-ride/\">Now in its sixth iteration</a>, the bike hasn’t been updated since April 2019. The latest model saw an updated Future Shock and aerodynamic improvements over its predecessor, as well as a redesigned seat clamp area and proprietary D-shaped aero seatpost tuned for compliance.</p>\n<p>Historically, Specialized tends to work on a three-to-four year cycle with the majority of its bikes. Given this, I was a little surprised to not see a brand-spanking-new Roubaix last year, or at this year’s <a href=\"https://www.bikeradar.com/features/pro-bike/2023-paris-roubaix-tech-trends/\">Paris-Roubaix</a> (the infamously tough cobbled classic after which the bike is named).</p>\n<p>Because a new model is likely in development, though, let’s consider what the new Specialized Roubaix may look like.</p>\n<h2>Will it be influenced by the Diverge STR or the Sirrus?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Sirrus is the first Specialized bike to feature the Compliance Junction.</span></figcaption><span> <i>Robyn Furtado / Our Media</i></span></div>\n<p>We were wrong when we suspected the <a href=\"https://www.bikeradar.com/news/new-specialized-roubaix-2023/\">radical double-diamond design patent filed in February 2023</a> was destined for the Roubaix.</p>\n<p>The Compliance Junction, as it has been officially dubbed by the American brand, was in fact for the <a href=\"https://www.bikeradar.com/news/2023-specialized-sirrus-carbon/\">Sirrus Carbon hybrid</a>, but that doesn’t mean Specialized won’t use the design on other bikes. After all, why would Specialized go to all this trouble to redesign a frame for just a two-model hybrid line-up?</p>\n<p>However, there are two gaping holes in this theory’s armour. Firstly, this design would mean the bike is compatible with <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains</a> only and wouldn’t be UCI-legal, which means it couldn’t be raced at the Spring Classics.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Influences from the Diverge STR seem more likely.</span></figcaption><span> <i>Jack Luke / Our Media</i></span></div>\n<p>The same could equally be said of the <a href=\"https://www.bikeradar.com/news/2023-specialized-diverge-str/\">Diverge STR</a> gravel bike, with its Future Shock Rear damper, which provides up to 30mm of rearward flex.</p>\n<p>Although former BikeRadar senior writer Matthew Loveridge found the Roubaix to perfectly balance front and rear comfort in <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-roubaix-expert-long-term-review/\">his long-term review</a>, a new Roubaix could borrow tech from its gravel sibling to help smooth the ride even more.</p>\n<p>Might we see a lighter, shorter-travel rear damper in the vein of the STR? Colour us perplexed, but it will be exciting to see what direction Specialized heads in.</p>\n<h2>Integration</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cables – what are those?</span></figcaption><span> <i>Matt Grayson / Our Media</i></span></div>\n<p>When we recently took a close look at <a href=\"https://www.bikeradar.com/features/pro-bike/2023-peter-sagan-paris-roubaix-bike/\">Peter Sagan’s Specialized S-Works Roubaix</a> at his final Paris-Roubaix, the bike looked positively out of place in the pro peloton.</p>\n<p>Sagan rode with a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-r9100-review/\">Shimano Dura-Ace R9120 mechanical groupset</a>, with the gear cables and hydraulic hoses routed externally between where they exit the handlebar and the down tube internal cable guide.</p>\n<p>While front-end integration certainly has its disadvantages, particularly when <a href=\"https://www.bikeradar.com/advice/workshop/how-to-service-a-headset-and-replace-headset-bearings/\">servicing or replacing headset bearings</a>, it seems almost inevitable Specialized will head down this route on a new Roubaix.</p>\n<p>One of the bike’s main rivals, the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/trek-domane-slr-7-p1-review/\">Trek Domane</a>, went down this route in its latest incarnation, although the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/cannondale-synapse-carbon-ltd-rle-review/\">Cannondale Synapse</a> continues to shun integration.</p>\n<p>Specialized has always tried to keep the Roubaix relatively racey in position so the pros can ride it throughout the Spring Classics. If Specialized thinks there is an aerodynamic advantage that could save the pros time and effort, then integration is a no-brainer.</p>\n<p>Although a part of me hopes Specialized doesn’t head down a fully integrated route and ignites a move back to headsets without cables running through them, this is admittedly wishful thinking.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The current ‘steerer collar’ prevents the cables or hoses from passing through.</span></figcaption><span> <i>Specialized</i></span></div>\n<p>However, my dreams might come true because there is a spanner in the works in the shape of a Future Shock.</p>\n<p>The cockpit and the Future Shock in its current incarnation wouldn’t play nicely together if integrated.</p>\n<p>This is because the Future Shock effectively makes up the steerer tube assembly so there isn’t anywhere for gear cables or hydraulic hoses to pass through.</p>\n<p>Specialized could borrow a leaf out of Cannondale’s book with its previous SuperSix EVO, where the cables and hoses were routed through a separate channel in front of the headset on the head tube.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cannondale even says oversteering is not covered under warranty in the owner’s manual.</span></figcaption><span> <i>Cannondale</i></span></div>\n<p>However, Specialized would then need to engineer a similar steering stop, in order to prevent the cables from being guillotined or the carbon from fracturing when steering at tighter angles.</p>\n<p>This wouldn’t be ideal, though, because this design also comes with compromises. On the previous-generation SuperSix EVO, if the handlebar is steered at an angle greater than 55 degrees, the head tube, fork or locking pin can get damaged.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Please don’t do this, Specialized.</span></figcaption><span> <i>Giant</i></span></div>\n<p>Alternatively, the cables and hoses could be routed over the top of the Future Shock and behind the headset bearing, like previous models of the <a href=\"https://www.bikeradar.com/news/2018-giant-propel-advanced-disc-all-in-on-hydraulics/\">Giant Propel</a> and <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/giant-defy-advanced-pro-0-review/\">Giant Defy</a>. However, many (myself included) felt the design was not <a href=\"https://www.bikeradar.com/features/opinion/bike-stems-are-too-big/\">aesthetically pleasing</a>.</p>\n<h2>New damper</h2>\n<p>On that note, what will happen to Future Shock?</p>\n<p>Specialized currently has two Future Shocks in its range – the Future Shock 1.5 found on cheaper models and Future Shock 2.0 found at the higher end.</p>\n<p>The Future Shock 2.0 features hydraulic damping and is claimed to offer on-the-fly adjustability, whereas the 1.5 relies on a coil spring.</p>\n<p>We’ve generally found the Future Shock to be a top performer on the bikes we’ve tested in its various guises.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Future Shock is the centrepiece of the Roubaix.</span></figcaption><span> <i>Simon Bromley / Immediate Media</i></span></div>\n<p>The current incarnations of the Future Shock were first introduced on the current Roubaix in 2019, so it’s about time they also received an update.</p>\n<p>What would we like to see?</p>\n<p>While Future Shock 2.0 offers an adjustment knob in place of a stem top cap, the adjustability it offers is binary (either fully open or fully locked). The ability to fine tune the amount of squish would therefore be welcome.</p>\n<p>If stepped adjustability isn’t possible, perhaps something more akin to a three-position adjuster, as on a <a href=\"https://www.bikeradar.com/advice/buyers-guides/coil-vs-air/\">suspension shock</a>, would be the way forward. We’d also like it to be a bit quieter when riding.</p>\n<p>Finally, adjusting the headset preload can be quite fiddly, because it relies on a 2mm hex pinch bolt with a 2.5 locking the 2mm in place.</p>\n<p>If you don’t place the 3mm open-ended spanner on the preload bolts as you tighten the 2.5mm locking bolts, the preload bolts have a tendency to undo over time, resulting in a loose headset.</p>\n<p>It would be great if Specialized made the system more user-friendly to work on.</p>\n<h2>Wider tyre clearance with an all-road agenda</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Running wider tyres has the single biggest impact on ride quality.</span></figcaption><span> <i>David Caudery / Immediate Media</i></span></div>\n<p> </p>\n<p>The current Roubaix can accept <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bike-tyres/\">road bike tyres</a> up to 33mm wide, whereas the Cannondale Synapse can take tyres up to 35mm. Trek’s Domane swallows even wider rubber, with clearance rated to 38mm tyres (measured width).</p>\n<p>Many endurance bikes seem to be moving in an <a href=\"https://www.bikeradar.com/advice/buyers-guides/all-road-bikes-explained/\">all-road</a> direction, where they can head onto light gravel. Out of Specialized’s range, the Roubaix seems the prime road bike candidate to take on this duty.</p>\n<p>Ideally, I’d like the Roubaix to be capable of accommodating tyres up to 35mm wide. This would put it in line with its rivals, although I’d prefer this to be achieved without compromising its racey geometry.</p>\n<h2>Frame storage</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Storing spares in the down tube means you can free up your jersey pockets or saddlebag.</span></figcaption><span> <i>Robert Smith / Immediate Media</i></span></div>\n<p>While in-built frame storage is increasingly popular on mountain and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a>, it’s also starting to find its way onto <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-endurance-road-bikes/\">endurance road bikes</a>, such as the latest Trek Domane.</p>\n<p>Specialized was one of the first brands to introduce frame storage with its SWAT door, so surely it’s time the Roubaix gets it too.</p>\n<p>Down-tube storage is a great way to carry your riding essentials such as an inner tube, tyre levers, multi-tool and even snacks.</p>\n<p>On the subject of storage, top-tube mounts for a bento box would also expand on-bike options for carrying long-ride essentials.</p>\n<h2>Lighter (and more aero)</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Will a new Roubaix take design cues from the Tarmac SL7?</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Specialized has always tried to balance the Roubaix as a comfortable mile-muncher with the lightweight and aerodynamic properties of a race bike.</p>\n<p>The brand claims a 900g frame weight for the current S-Works Roubaix in a size 56cm, unpainted.</p>\n<p>The frame also uses truncated aerofoil tube shapes and, on release, Specialized claimed it was more aerodynamic than the <a href=\"https://www.bikeradar.com/reviews/bikes/road-bikes/specialized-s-works-tarmac-sl6-disc-review/\">Tarmac SL6</a> (its previous all-round road racing bike).</p>\n<p>Will a new Roubaix inherit more of the Tarmac SL7’s aerodynamic tube profiles?</p>\n<p>While 900g is still a competitive frame weight for an endurance bike, if Specialized opts to head down the route of adding Future Shock Rear, presumably the overall frame weight would rise unless weight savings can be found elsewhere.</p>\n<p>The Roubaix also needs to remain somewhat aerodynamic and fast, otherwise it could lose its appeal to racers.</p>\n<p> </p>","author":"Oscar Huckle","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"9d2470c83890c76271bfff70e08325a5d509ebaad1101c448cf475edc44da13e","category":"Cycling"}