{"title":"Factors associated with pregnancy termination in six sub-Saharan African countries","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002280","date":1715263200000,"content":"<p>by Rahel Nega Kassa, Emily Wanja Kaburu, Uduak Andrew-Bassey, Saad Ahmed Abdiwali, Bonfils Nahayo, Ndayishimye Samuel, Joshua Odunayo Akinyemi</p>\r\n\r\nPregnancy termination continues to be a leading cause of maternal morbidity and mortality among young women in Africa. The sub-Saharan Africa region has the highest rate of abortion-related deaths in the world, at 185 maternal deaths per 100,000 abortions. The aim of this study is to investigate the factors associated with pregnancy termination among women aged 15 to 29 years in six sub-Saharan African countries. We used secondary data from the most recent Demographic and Health Survey of six sub-Saharan African countries: Kenya, Tanzania, Ethiopia, Burundi, Nigeria, and Rwanda. A total weighted sample of 74,652 women aged 15–29 were analyzed. A multivariable logistic regression model was used to identify the factors associated with pregnancy termination at a p-value &lt; 0.05. Results were presented using adjusted odds ratios (AOR) with 95% confidence interval. The study showed that 6.3% of women aged 15–29 reported pregnancy termination with a higher prevalence rate in Tanzania (8.8%) and lowest in Ethiopia (4%). Highest odds of pregnancy termination occurred among women aged 20–24 as compared to women aged 15–19 in Rwanda (AOR: 4.04, 95%CI 2.05, 7.97) followed by Nigeria (AOR: 2.62, 95% CI 1.99, 3.43), Kenya (AOR: 2.33, 95%CI 1.48, 3.66), Burundi (AOR: 1.99 95%CI 1.48, 2.85), Tanzania (AOR: 1.71 95%CI 1.29, 2.27), and Ethiopia (AOR: 1.69, 95% CI 1.19, 2.42). Women with no education had 4 times higher odds of pregnancy termination compared to women with higher education in Tanzania (AOR: 4.03 95%CI 1.00, 16.13) while women with no education and primary level education were 1.58 times (AOR: 1.58 95% CI 1.17, 2.13) and 1.78 times (AOR: 1.78 95% CI 1.34, 2.37) as likely to terminate pregnancy in Ethiopia. In Tanzania, the likelihood of a pregnancy termination was associated with a relationship to the household head; head (AOR: 3.66, 95% CI (2.32, 5.78), wife (AOR: 3.68, 95% CI 2.60, 5.12), and in-law (AOR:2.62, 1.71, 4.03). This study revealed that a significant number of women had pregnancy termination. Being in the age group of 20–24 &amp; 25–29, having a lower level of education, being a domestic employee and professional, being single/never-in-union, being in the poorest and richer wealth quantile category, and being head, wife, daughter, and in-law to the household head were the significantly associated with pregnancy termination. Taking these socio-economic factors into consideration by stakeholders and specific sexual education targeted to women aged 15 to 29 would help tackle the problem.","author":"Rahel Nega Kassa","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9d30b84b6519e78ca7c36033a15a6312a724658eee2c5b47acbabfad63ff3500","category":"Environment"}