{"title":"Transcriptome profiling research in urothelial cell carcinoma","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300002?af=R","date":1717665340000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9c0b8875-e90e-481f-9263-7877d059c2b5/appl202300002-gra-0001-m.png\" alt=\"Transcriptome profiling research in urothelial cell carcinoma\" /><p>This review explores the utilization of RNA-sequencing technology to decipher the complex genetic underpinnings of urothelial cell carcinoma, offering insights into disease pathogenesis, biomarker identification, and disease classification. It further proposes the application of single-cell sequencing for a deeper understanding of the disease.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Urothelial cell carcinoma (UCC) is the ninth most common cancer that accounts for 4.7% of all new cancer cases globally. UCC development and progression are due to complex and stochastic genetic programs. To study the cascades of molecular events underlying the poor prognosis that may lead to limited treatment options for advanced disease and resistance to conventional therapies in UCC, transcriptomics technology (RNA-Seq), a method of analyzing the RNA content of a sample using modern high-throughput sequencing platforms has been employed. Here, we review the principles of RNA-Seq technology and summarize recent studies on human bladder cancer that employed this technique to unravel the pathogenesis of the disease, identify biomarkers, discover pathways and classify the disease state. We list the commonly used computational platforms and software that are publicly available for RNA-Seq analysis. Moreover, we discussed the future perspectives for RNA-Seq studies on bladder cancer and recommended the application of a new technology called single-cell sequencing to further understand the disease.</p>","author":"Umar Ahmad, \nBuhari Ibrahim, \nMustapha Mohammed, \nAhmed Faris Aldoghachi, \nMahmood Usman, \nAbdulbasit Haliru Yakubu, \nAbubakar Sadiq Tanko, \nKhadijat Abubakar Bobbo, \nUsman Adamu Garkuwa, \nAbdullahi Adamu Faggo, \nSagir Mustapha, \nMahmoud Al‐Masaeed, \nSyahril Abdullah, \nYong Yoke Keong, \nAbhi Veerakumarasivam","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"9d364f42119f22a257112ff913377a9f28b255756f5cb89c66729dd9372460e7","category":"Environment"}