{"title":"Spatial variations and determinants of timely completion of vaccination in Ethiopia using further analysis of EDHS 2019 data: Spatial and multilevel analysis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301409","date":1712325600000,"content":"<p>by Muluken Chanie Agimas, Aysheshim Kassahun Belew, Mekonnen Sisay, Lemlem Daniel Baffa, Moges Gashaw, Zufan Yiheyis Abriham, Esmael Ali Muhammad, Zeamanuel Anteneh Yigzaw, Berhanu Mengistu</p>\r\nBackground <p>Timely vaccination is the practice of administering the vaccine within the first birthday of the child. Not vaccinating the child at the appropriate age is the cause of improper protection of diseases and can be a possible factor in death. The problem of not completing the vaccine in the scheduled period is a globally distributed problem, but especially in sub-Saharan African countries, it is a bottleneck to child health. Even if timely vaccination is crucial for reducing the impact of VPDs, there are no current national-level studies to generate conclusive and tangible evidence in Ethiopia.</p> Objective <p>To assess spatial variations and determinants of timely completion of vaccination in Ethiopia using further analysis of EDHS 2019 data.</p> Method <p>The secondary data analysis of a community-based cross-sectional study design was employed among 3094 participants. Stata-14 software was used for data cleaning, recording, and analysis. Arc GIS version 10.3 and Kuldorff SAT scan version 9.6 software are used for spatial and SAT scan statistics. A multilevel mixed-effect binary logistic regression analysis was used to identify the predictors of timely vaccination. The clustering effect was also evaluated by Moran’s I statistics and intra class correlation.</p> Results <p>The timely completion of vaccination among Ethiopian women who had a child aged 12–35 months was 19.5% (95%CI: 18.2–20.8), and the spatial distribution of timely completion of vaccinations in Ethiopia was non-randomly distributed. A statistically significant high proportion of timely completion areas were clustered in the eastern part of Amhara, the south part of Afar, Addis Ababa, and Oromia. The primary cluster was located at a 13.11 km radius in Diredawa, which was 3.68 times higher than outside the window (RR = 3.68, LLR = 68.76, p-value &lt; 0.001). History of antenatal care follow-up (AOR = 1.63, 95% CI: 1.3–2.04), giving birth at health facilities (AOR = 1.63, 95% CI: 1.25–2.13), age ≥ 35 years (AOR = 186, 95% CI: 1.35–2.63), age 25–34 years (AOR = 1.72, 95% CI: 1.33–2.21), and being richest (AOR = 2.71, 95% CI: 1.86–3.94) were the factors contributing to the timely completion of vaccination.</p> Conclusion <p>The prevalence of timely completion of vaccination was low in Ethiopia, and the spatial distribution of timely completion of vaccination in Ethiopia was non-randomly distributed across the regions. The factors associated with the timely completion of vaccinations were ANC follow-up, place of delivery, age of the participant, and wealth index. We recommend expanding facility delivery, antenatal care services, and empowering women to scale up timely vaccination in Ethiopia.</p>","author":"Muluken Chanie Agimas","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9d363597c3c00b3a387519aef468292cc68df034cec3d1471b0ce6d4ca041229","category":"Interdisciplinary"}