{"title":"Bathymetric origin shapes the physiological responses of Pterygophora californica (Laminariales, Phaeophyceae) to deep marine heatwaves","link":"https://onlinelibrary.wiley.com/doi/10.1111/jpy.13433?af=R","date":1712751025000,"content":"<h2>Abstract</h2>\n<p>Kelp communities are experiencing exacerbated heat-related impacts from more intense, frequent, and deeper marine heatwaves (MHWs), imperiling the long-term survival of kelp forests in the climate change scenario. The occurrence of deep thermal anomalies is of critical importance, as elevated temperatures can impact kelp populations across their entire bathymetric range. This study evaluates the impact of MHWs on mature sporophytes of <i>Pterygophora californica</i> (walking kelp) from the bathymetric extremes (8–10 vs. 25–27 m) of a population situated in Baja California (Mexico). The location is near the southernmost point of the species's broad distribution (from Alaska to Mexico). The study investigated the ecophysiological responses (e.g., photobiology, nitrate uptake, oxidative stress) and growth of adult sporophytes through a two-phase experiment: warming simulating a MHW and a post-MHW phase without warming. Generally, the effects of warming differed depending on the bathymetric origin of the sporophytes. The MHW facilitated essential metabolic functions of deep-water sporophytes, including photosynthesis, and promoted their growth. In contrast, shallow-water sporophytes displayed metabolic stress, reduced growth, and oxidative damage. Upon the cessation of warming, certain responses, such as a decline in nitrate uptake and net productivity, became evident in shallow-water sporophytes, implying a delay in heat-stress response. This indicates that variation in temperatures can result in more prominent effects than warming alone. The greater heat tolerance of sporophytes in deeper waters shows convincing evidence that deep portions of <i>P. californica</i> populations have the potential to serve as refuges from the harmful impacts of MHWs on shallow reefs.</p>","author":"Antonella C. Almeida‐Saá, \nSchery Umanzor, \nJose Antonio Zertuche‐González, \nRicardo Cruz‐López, \nRaquel Muñiz‐Salazar, \nAlejandra Ferreira‐Arrieta, \nPaula Bonet Melià, \nJessica Anayansi García‐Pantoja, \nLaura K. Rangel‐Mendoza, \nManuel Vivanco‐Bercovich, \nLeonardo Ruiz‐Montoya, \nJose Manuel Guzmán‐Calderón, \nJose Miguel Sandoval‐Gil","siteTitle":"Wiley: Journal of Phycology: Table of Contents","siteHash":"075314558bff8e0edacb3dfb38f8f4294da4472e850554531438d5242e6a587b","entryHash":"9d3879efb8bc1a85ffdade3b3e573786d2597abe44e05fdd383ecf9bbe0f8ac7","category":"Environment"}