{"title":"Tiny room at Pompeii villa reveals how Roman slaves lived","link":"https://arstechnica.com/?p=1811416","date":1636483254000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/20211104_102151-800x450.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/20211104_102151.jpg\">Enlarge</a> (credit: Pompeii Archaeological Park)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Just outside the ancient city of Pompeii, archaeologists recently unearthed a small room where at least three enslaved people lived and worked until Mount Vesuvius erupted in 79 CE. The rediscovery of the dreary space near the villa’s stables provides a rare glimpse into the lives of the people at the bottom of the ancient Roman social order.</p>\n<h2>A small room in a grand villa</h2>\n<p>When Mount Vesuvius buried the Roman city of Pompeii under meters of ash and pumice, the destruction didn’t stop at the city walls. The Civita Giuliana villa, about 700 meters northwest of the city’s walls, also vanished under dust and rock. Inside the house, <a href=\"https://arstechnica.com/science/2020/11/archaeologists-find-two-more-bodies-among-the-ruins-of-pompeii/\">a wealthy man and a young laborer</a>—probably enslaved—died together when a pyroclastic flow swept down the volcano’s slopes. Three horses died in the villa’s stables, and archaeologists unearthed their remains in 2018. An <a href=\"https://arstechnica.com/science/2021/03/archaeologists-discover-lamborghini-of-chariots-near-ruins-of-pompeii/\">ornate ceremonial chariot waited in a nearby portico</a> facing the stables, too late to aid any last-ditch escape attempts.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/villa-layout.jpg\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/villa-layout-640x905.jpg\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/villa-layout.jpg\">The layout of the stables, the portico, and the recently excavated \"room of the slaves.\"</a> (credit: Pompeii Archaeological Park)</p></div>\n<p>Archaeologists have been excavating the villa from beneath layers of volcanic sediment since 2017, and they recently unearthed a small room near the portico and stables, where it appears three people once lived and worked in close, dreary quarters. The three beds of rough wooden planks and rope webbing probably <a href=\"http://pompeiisites.org/en/comunicati/the-room-of-the-slaves-the-latest-discovery-at-civita-giuliana/\">belonged to enslaved people</a> who worked at the villa, according to Pompeii archaeological park director Gabriel Zuchtriegel and his team. No human remains were found in the room, so we have no way of knowing whether its occupants escaped or died elsewhere.</p></div><p><a href=\"https://arstechnica.com/?p=1811416#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1811416&amp;comments=1\">Comments</a></p>","author":"Kiona N. Smith","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9d393ea4cfe58847efab3bdb1e10431249beccc759355fb8336e48d7a38ef007","category":"Tech"}