{"title":"Enhanced parasitisation of caterpillars and aphids on field‐grown Brassica oleracea plants upon soil amendment with insect exuviae","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14555?af=R","date":1717564918000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/b6ed06dc-2de3-4fa6-a7a8-686c5db2682e/fec14555-toc-0001-m.png\" alt=\"Enhanced parasitisation of caterpillars and aphids on field-grown Brassica oleracea plants upon soil amendment with insect exuviae\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/20/adding-shed-insect-skins-to-agricultural-soil-enhances-attraction-of-natural-enemies-of-aboveground-pest-insects-to-crop-plants/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMultitrophic plant–insect interactions are mediated by plant volatiles. The emission of herbivore-induced plant volatiles is influenced by environmental conditions, such as soil microbes and nutrient composition, with consequences for above-ground trophic interactions. Here, we investigated whether insect exuviae in the soil alter the plant's volatile blend and attraction of parasitoids in the laboratory and whether this attraction also occurs in the field.\n\nWe studied the effects of soil amendment with exuviae originating from three insect species, <i>Tenebrio molitor</i>, <i>Acheta domesticus</i> and <i>Hermetia illucens</i>, on the proportion of parasitised <i>Plutella xylostella</i> caterpillars and <i>Brevicoryne brassicae</i> aphids in the field in three consecutive years. In the laboratory, we collected and analysed the volatile blend of amended plants infested with caterpillars or aphids. The attraction of the parasitoids <i>Diadegma semiclausum</i> and <i>Diaeretiella rapae</i>, respectively, towards these volatile blends was assessed in an olfactometer.\n\nOur study shows that insect exuviae-amended soil enhanced the proportion of parasitised herbivores of two species in the field. Relative amounts of several components of the plant volatile blend were affected by soil amendment. Soil amendment with <i>Acheta domesticus</i> or <i>Tenebrio molitor</i> exuviae resulted in an increased attraction of the two parasitoid species in the olfactometer.\n\nSoil amendment with insect exuviae altered the plant volatile blend leading to enhanced attraction of parasitoids in laboratory assays. These effects were sustained under the complex and variable biotic and abiotic conditions in the field. Our results underline the importance of belowground processes, such as the decomposition of insect exuviae, on aboveground volatile-mediated multitrophic interactions.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/03/20/adding-shed-insect-skins-to-agricultural-soil-enhances-attraction-of-natural-enemies-of-aboveground-pest-insects-to-crop-plants/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Els M. van de Zande, \nLina Ojeda‐Prieto, \nAndreas Markou, \nJulia van Leemput, \nJoop J. A. van Loon, \nMarcel Dicke","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"9d3c38e989f96a48abde0985b0005bd2f45f619c5cabc93c46841943b5df508e","category":"Environment"}