{"title":"Seed Coat Pigmentation Plays a Crucial Role in Partner Selection and N2 Fixation in Legume Root-Microbe Associations in African Soils","link":"https://www.preprints.org/manuscript/202404.0891/v1","date":1713163565000,"content":"The legume-rhizobia symbiosis is one of the most important plant-microbe interactions in sustainable agriculture due to its ability to provide much needed N to cropping systems. This interaction is mediated by the mutual recognition of signaling molecules from the two partners, namely legumes and rhizobia. With legumes, these molecules are in the form of flavonoids and anthocyanins, which are responsible for the pigmentation of plants parts, such as seeds, flowers, fruits and even leaves. Seed coat pigmentation in legumes is a dominant factor influencing gene expression relating to N2 fixation, and may be responsible for the different N2-fixing abilities observed among legume genotypes under field conditions in African soils. Cowpea, Kersting’s bean and Bambara groundnut landraces with black seed coat color are reported to release higher concentrations of nod-gene-inducing flavonoids and anthocyanins when compared to the Red and Cream landraces, hence the black seed coat pigmentation is considered a biomarker for enhanced nodulation and N2 fixation. Cowpea, Bambara groundnut and Kersting’s bean with differing seed coat colors are known to attract different native soil rhizobia, confirmable by PCR-RFLP analysis of bacterial DNA from root nodules of these legumes. Even when seeds of the same legume with diverse seed coat colors were planted together in one hole, the nodulating bradyrhizobia clustered differently in the PCR-RFLP dendrograms. In one study, Kersting’s groundnut, Bambara groundnut and cowpea with differing seed coat colors were selectively nodulated by different bradyrhizobial species. Multilocus sequence analysis showed that different Bradyrhizobium species nodulated the Kersting's bean based on seed coat color. Phylogenetic analysis also placed the bradyrhizobial isolates in close proximity to different Bradyrhizobium species such as B. vignae 7-2T, B. subterraneum 58 2-1T, B. kavangense 14-3T, B. liaoningense 2281 (USDA 3622)T, B. yuanmingense LMG 21827T, B. huanghuaihaiense CCBAU 23303T, B. pachyrhizi PAC48T, and a reference type strain of B. elkanii according to seed coat color. Using 16S rDNA amplicon sequencing, we also found significant selective influences of seed coat pigmentation on microbial community structure in the rhizosphere of five Kersting’s groundnut landraces. For example, the rhizosphere of Belane Mottled landrace was dominated by Proteobacteria, while Bacteroidetes dominated the rhizospheres of the other landraces. With legumes, seed coat pigmentation therefore plays a dominant role in the selection of the bacterial symbiotic partner.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9d4fca669ef6f75dd424802fa0da5c111fae86579929cf36867dd3497f42cc20","category":"Interdisciplinary"}