{"title":"Unlike chemical fertilizer reduction, organic fertilizer substitution increases soil organic carbon stock and soil fertility in wheat fields","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13167?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Improvements in farmland soil organic carbon (SOC) stock enhance crop yield and soil fertility while mitigating climate change. Rational fertilization in agricultural production is crucial for safeguarding SOC stock. In this study, field experiments were conducted with different ratios of chemical fertilizer reduction and organic fertilizer substitution for three consecutive years (2018–2020) to explore their effects and interlinkages on SOC fractions, soil properties and SOC stock.</p>\n<h2>RESULTS</h2>\n<p>The results showed that organic fertilizer substitution increased SOC and its fractions content, SOC stock (by 3.98–12.98% and 7.15–18.13%) and soil fertility index (by 11.76–49.26% and 33.33–91.47%) compared to conventional fertilization in 2019 and 2020, while chemical fertilizer reduction had the opposite effect. Moreover, soil properties (except total nitrogen to total phosphorus ratio, N/P) and SOC fractions significantly affected SOC stock, with SOC fractions contributing more than soil properties. The high sensitivity of microbial biomass carbon (MBC) and dissolved organic carbon (DOC) can indicate changes in soil carbon pool. Structural equation modeling (SEM) revealed that organic fertilizer substitution increased SOC content and stock by increasing SOC fractions [recalcitrant organic carbon (ROC) and labile organic carbon (LOC) fractions] content and soil fertility.</p>\n<h2>CONCLUSIONS</h2>\n<p>Our study revealed the corresponding mechanisms of the two fertilization modes affecting SOC stock changes. The use of organic fertilizer substitution is recommended to increase SOC stocks and soil fertility in wheat fields. © 2023 Society of Chemical Industry.</p>","author":"Hao He, \nMengwen Peng, \nZhenan Hou, \nJunhua Li","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9d523840249ceb34df798ce21584c666cd61db4e09c81783556406397e07437b","category":"Environment"}