{"title":"From 5-year-old racer to the WorldTour: a Q&A with Ruby Roseman-Gannon","link":"https://cyclingtips.com/2021/11/from-5-year-old-racer-to-the-worldtour-a-qa-with-ruby-roseman-gannon/","date":1636424223000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/GettyImages-1298099143-650x433.jpeg\" /></div><h2>From 5-year-old racer to the WorldTour: a Q&amp;A with Ruby Roseman-Gannon</h2><p>\n</p><p><em>It’s been a big week or so for Australian track and road rider Ruby Roseman-Gannon. In the same week that she finished a science degree at the University of Melbourne (majoring in neuroscience), the 23-year-old was also announced as a new signing for Women’s WorldTour outfit Team BikeExchange for 2022 and 2023.</em></p>\n\n\n\n<p><em>CyclingTips caught up with Roseman-Gannon to chat about her journey to the big leagues, what she’s expecting out of joining the WorldTour, how she’s going to balance road and track going forward</em>, <em>and much more.</em></p>\n\n\n\n<hr />\n\n\n\n<p><strong>CyclingTips: Congratulations on signing with BikeExchange. How did that all come about?</strong></p>\n\n\n\n<p>Ruby Roseman-Gannon: In 2020 I had some conversations with teams, but I also wasn’t ready to commit to the road because at the time, on the track, there was an Olympic spot open and I hadn’t even really done any track to see where I was at. And by the time I could give a more firm answer [to road teams], those doors had closed, which is understandable because I wasn’t able to commit.</p>\n\n\n\n<p>I was pretty sad, so I think it really solidified that I really wanted to pursue the road. And then I came out with a vengeance for the [2021 Australian] Summer of Cycling just to give it everything I had. I was kind of having conversations with a few different teams after that because that was really our only opportunity to race properly this year.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CVmuS4aKvCr/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CVmuS4aKvCr/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Team BikeExchange (@greenedgecycling)</a></p></div></blockquote> \n\n\n\n<p><strong>Did you approach teams yourself or did you have an agent that you were going through?</strong></p>\n\n\n\n<p>No, I haven’t actually had an agent. I have just contacted teams myself pretty much. I probably, in hindsight, should have looked to get an agent because there’s a lot of aspects to negotiations and things I didn’t really know about that I kind of had to research myself and ask people.</p>\n\n\n\n<p>I mean, I have the privilege of having a lot of people at hand, being in the [track] program here <em>[in Adelaide, where the Australian track program is based – ed.]</em>, so it wasn’t like I was all by myself; a lot of people know other people involved. Especially as the sport’s becoming a bit more professional – in the women’s peloton I think a lot of riders are going for agents and I think it’s probably what I’ll do in the future. </p>\n\n\n\n<p><strong>How are you feeling about the contract and the opportunity over the next two years?</strong></p>\n\n\n\n<p>Yeah, I’m pretty excited. I think it hasn’t really fully sunk in yet because I’ve just been so busy living the life here, which is kind of all-consuming. I guess I’m really excited to start a new chapter. It feels like a lot of things will change next year for me. But yeah, I’m very excited. It’s been a long dream.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CVm1gK9hIDa/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CVm1gK9hIDa/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Ruby Roseman-Gannon (@rubyrg)</a></p></div></blockquote> \n\n\n\n<p><strong>Where are you planning to live?</strong></p>\n\n\n\n<p>I’m not actually sure yet. I think probably Girona because I know people there, and it’s probably good to have a bit of a support network when I go over there. But I haven’t actually organised that yet, which I probably should get onto very soon.</p>\n\n\n\n<p><strong>When do you think you’ll head over? Will you stick around in Australia for the Nationals and the Santos Festival of Cycling in January?</strong></p>\n\n\n\n<p>I think I’ll definitely do Nationals and TDU, whatever machination of that [happens]. But yeah, I will definitely race those and then probably head over [to Europe] straight after that I’d say.</p>\n\n\n\n<blockquote><div> <a href=\"https://www.instagram.com/p/CFuAVULFqQQ/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\"> <div> <div></div> <div> <div></div> <div></div></div></div><div></div> <div></div><div> <div>View this post on Instagram</div></div><div></div> <div><div> <div></div> <div></div> <div></div></div><div> <div></div> <div></div></div><div> <div></div> <div></div> <div></div></div></div> <div> <div></div> <div></div></div></a><p><a href=\"https://www.instagram.com/p/CFuAVULFqQQ/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Ruby Roseman-Gannon (@rubyrg)</a></p></div></blockquote> \n\n\n\n<p><strong>You were talking about track racing before, and obviously that was a big part of your career to this point. Do you see yourself doing much truck going forward, now that you’ve signed a road contract?</strong></p>\n\n\n\n<p>Yeah, I think I will actually. I’ve had a weird love affair with road and track, just going from one to the other. I think as a junior, I always loved road more. My physiology – generally, the harder and longer [a race] goes, the better I get … within reason – I’m not a Sarah Gigante by any means. I think my forte is a hard race and then I’m the last sprinter there. </p>\n\n\n\n<p>I think with the [track] funding I focused on the track and then lost a bit of my road form and then wasn’t so keen on the road, then got super keen on the road, and then I was like ‘I just wanna do road – I don’t wanna do track’. But also a little part of me, because I have done track for so long, I kind of wanted to prove to myself this year that I could improve.</p>\n\n\n\n<p>We did track trials this year. They were technically for Worlds, but with the borders [and COVID restrictions], they didn’t end up selecting a teams pursuit team for Worlds. And those trials went really well and I improved a lot. And I think AusCycling will continue to support me with track commitments. So I think my priority will probably be road next year, but with a bit of track as well, just to keep that ticking along.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/GettyImages-1178634221-1340x851.jpeg\" /><figcaption>Roseman-Gannon during a London Six-Day track meet.</figcaption></figure>\n\n\n\n<p><strong>What are you hoping to get out of yourself for the first two years of your contract and particularly next year – your first in the European peloton?</strong></p>\n\n\n\n<p>I think I just need to get to a point where I feel comfortable and understand the dynamics of the bunch. I think each step I’ve made up – I’ve been racing since I was five, so a very long time – each step I’ve made, up to NRS [Australia’s National Road Series] or even in juniors and then even the small amount of racing I did in 2019 overseas, you need a few races and to understand how the bunch works and how you fit into that. And then once I get to that stage, I can kind of just switch on my race mode where I don’t really think and everything just happens, and then I finish the race and I’m like ‘Oh, what happened?’</p>\n\n\n\n<p>I love racing because I love that flow state so my goal is just to get to a point where I can get in that when I’m over there and I think the results and everything else will come.</p>\n\n\n\n<p><strong>And what about BikeExchange? What is the team expecting from you?</strong></p>\n\n\n\n<p>I think GreenEdge has had a long history of developing Australian riders, so I think they see me definitely as [focusing on] development and just to experience a lot of different racing and see what sort of future rider I will be.</p>\n\n\n\n<p>And I think, obviously, with riders like Spratty [Amanda Spratt] and even Kirsten Faulkner and Georgia Baker, they’ve got a lot more experience than me and are very, very good riders. So I’ll probably have some support roles in supporting them and helping them get some team wins, hopefully. And then, yeah, just giving it everything I’ve got, really.</p>\n\n\n\n<p><strong>And what sort of rider do you think you’ll be?</strong></p>\n\n\n\n<p>I think I will probably be a resilient sprinter. I don’t think I’ll ever be a pure sprinter, but I have obviously raced for a long time and I can generally position pretty well and race like a track racer in the bunch. So if I’m up there, I’ll be trying to go for the win or help my team win. And yeah, I think the Classics – something that’s a bit climby, but not pure climbing. And a bit sprinty but not pure sprinting. Somewhere in the middle is what I love.</p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/11/GettyImages-1230982311-1340x894.jpeg\" /><figcaption>Roseman-Gannon (left) after taking silver in the elite women’s race at the Australian criterium championships in February 2021. Roseman-Gannon <a href=\"https://www.instagram.com/p/BsP507plncV/\" target=\"_blank\">won the U23 title in 2019</a> and 2020.</figcaption></figure>\n\n\n\n<p><strong>Are there particular races that you watch on TV and you go ‘I’d love to win that one day’?</strong></p>\n\n\n\n<p>I’m a very realistic person and it feels like a fantasy, all the European races. Obviously I’d love to win anything over there, really.</p>\n\n\n\n<p>To me sometimes, I like to race the race, be there, and then I’m like ‘OK, I know where I’m at and I know what I’ve gotta do to get there’. I did Cadel’s [Race] when it was, I think, a 1.1 and then it was WorldTour, and after the 1.1 I could see where I needed to be and then when I did it in 2020 I was like, ‘I’m not actually that far off going for the win’ <em>[Roseman-Gannon finished 34th in 2019, and then 12th in the 2020 WorldTour race – ed.]</em></p>\n\n\n\n<p>I was super, super motivated for that and it feels like, for me, I do have those lofty dreams, and I definitely am motivated and I love winning, but I like to kind of experience it and I guess know where I’m at and make a realistic and more concrete goal.</p>\n\n\n\n<p><strong>That’s all the questions I had. Was there anything else you wanted to talk about before we finish up?</strong></p>\n\n\n\n<p>I came up through the Brunswick Cycling Club and I think it’s easy to see a snapshot of a rider like where I am now and, I guess even in my mind, I kind of forget the last … 18 years, wow. I’m indebted to the club level and the grassroots level and all the volunteers and the club really, and the other clubs in Melbourne.</p>\n\n\n\n<p>Because all those people, and the B-grade men that I’ve raced, and Cam Mcfarlane and Dave Morgan, the greats of our club – and Alf Walker, who died recently – they were the ones who told me … and Alan Grindal, who told me I looked like I was riding to school and Alf said one day ‘Oh, she’s finally got a bit of mongrel in her’ … these little steps along the way, where I wasn’t very good and I wasn’t winning everything, and I was trying hard, but I was definitely not the best junior.</p>\n\n\n\n<p>I guess from the perspective of parents, or other juniors, or even riders new to the sport, I didn’t just pop out of nowhere, and now I’m going WorldTour. It was a really long, slow drag of small improvements and a lot of help and a lot of support and a lot of mental turmoil at times, and not believing in myself.</p>\n\n\n\n<p>So I think it’s a journey and I am here, and it feels surreal, but I guess I’m just so thankful for everyone who got me here.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/11/from-5-year-old-racer-to-the-worldtour-a-qa-with-ruby-roseman-gannon/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9d56d082511928aae273af399cd6fe0ac8d6b85430e9776e434ab2408b651c42","category":"Cycling"}