{"title":"2021 Bespoked UK: Part 02 – Fahrradbau Stolz, OTT Cycles, The Vandal Metalworks, Variangle – Petor Georgallou","link":"https://theradavist.com/2021/11/2021-bespoked-uk-2/?utm_source=rss&utm_medium=rss&utm_campaign=2021-bespoked-uk-2","date":1637672412000,"content":"<p><em>Today we’re continuing our coverage of the <a href=\"https://theradavist.com/2021/11/2021-bespoked-uk/\" target=\"_blank\">2021 Bespoked UK</a> framebuilder showcase with words and photos by <a href=\"https://www.instagram.com/dear_susan_bicycles\" target=\"_blank\">Petor Georgallou</a>…</em><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate996.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Fahrradbau Stolz</strong></p>\n<p>Zurich-based ‘<a href=\"https://fahrradbaustolz.ch/en/fahrradbau/velos\" target=\"_blank\">Fahrradbau Stolz</a>’ brought a bike designed for extreme comfort and practicality, the dream old man spine commuter. Obviously built for someone tall, with its insane stack and comparatively modest reach, the build pivots on a pinion gearbox in a custom-made shell, the seat tube and down tube are squished to meet the shell neatly while adding a little vertical compliance. Everything on this bike is integrated, but not aggressively so. It has dynamo lights and mudguards, and a sweet little minimal rack that matches the radius of the rear mudguard, protecting it from any harm that a saddlebag might inflict, and providing a neat little perch for a pair of panniers.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate1002.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate1001.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>This raw stainless rack and its twin on the front are joined with the daintiest of silver fillets, and marry up nicely with the bike’s understated grey and pink paint. It has a kickstand, the height of commuter bike luxury, and a sweat-polished Giles Berthoud saddle and bar tape that exudes the ethos of functional design and craftsmanship that Fahrradbau Stolz represent. I love the cool rotating dropouts that neatly integrate into the seat stays for tensioning the chain. This bike makes me want to meet it again in the future, chipped and loose from 20 faithful years of providing transport and a quiet contented, comfortable joy.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate869-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>OTT Cycles</strong></p>\n<p>For me the wildest and most fun build of the show was this ‘<a href=\"http://ottcycles.com/\" target=\"_blank\">OTT Cycles</a>’ fixed/free/geared build. Its maker, Jonathan Perrott loved the rhythmic integrated feel of riding fixed but didn’t think that riding fixed in a city was safe, so he designed and made (with a little help from a local engineering company) a hub with a clutch that switches from fixed to free while riding. Which is nuts. Not content with just a single gear, he then designed and built a derailleur with a separate tensioner so the hub could be used with a geared drive train.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate911-1-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>James wanted to show people what he’d made so he applied for a new builder’s booth at Bespoked, with the intention of teaming up with a builder, to build a frame around his drive train. When he discovered that no one else wanted to build around his weird drive train (which won’t work on an ordinary frame), he decided to learn to build frames himself so the bike on his stand was the first frame that he’d ever built, which is a remarkable achievement.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate889-scaled.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate888-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>For the record, I completely disagree with the whole idea of this bike, firstly I don’t see any issues with riding fixed in town, and secondly, I feel like adding things to a fixed build that don’t need to be there seriously detracts from the enjoyment of using that bike. THAT’S WHY ONE-OFF BIKES ARE THE BEST! My opinion doesn’t count! I’m sure there are tens, if not hundreds of hours invested in the OTT. Its proof of concept for an idea, that I’m not aware of as having been successfully carried out before, or at least not recently. Beyond that, it’s Johnathan’s personal bike, that brings him immense enjoyment and has been a tool for learning and working things out, as well as starting a dialogue and engaging with a new group of people.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate862-scaled.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The last two remotely radical drive trains I’ve seen were <a href=\"https://www.feathercycles.com/\" target=\"_blank\">Ricky Feather</a>‘s retro direct two-speed from Bespoked years ago, where Ricky was already an experienced builder and ceramic speeds shaft drive 13-speed concept bike (which wasn’t a rideable bike) that I saw at NAHBS in 2019. To have come up with an idea that is a deviation from a “normal bike” however abstract and carried it out, from concept to rideable bike, is an incredible achievement that deserves to be celebrated, especially from a first-time builder.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate967.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>The Vandal Metalworks</strong></p>\n<p>At this year’s show there was something for everyone and Glasgow-based ‘<a href=\"https://www.thevandalmetalworks.com/\" target=\"_blank\">The Vandal Metalworks</a>’ struck me immediately as being my jam. For a start, there was a super fun-looking kind of small tall bike. Knowing full well I couldn’t resist its shoddy charms, I fought what ended up being losing battle, to look away and like a different bike instead. Thankfully all of the bikes on the Vandal stand appealed to my sensibilities for fun everyday bikes. TVMW represented a type of early career every-persons frame building that I really value. The focus was just on everyday fun bikes. Bikes that fit people’s bodies, budgets, and lives. All the bikes on the booth were painted in ‘<a href=\"https://www.montana-cans.com/\" target=\"_blank\">Montana Cans</a>‘, and there wasn’t a fancy component in sight.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate983.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>While the tall bike looked at me with its irresistible sad puppy eyes, I chose this tiny pink city shredder to whisk away from the harsh LED spotlights, for photos outside the hyper ornate but lazily named “Chinese restaurant”. Aside from its pendulum flavoured bubble-gum splatter paint, I enjoyed its hyper practical, mostly second-hand build kit. It’s like this frame was built simply for the pleasure of crushing the spirit of anyone trying to take it seriously, like a sledgehammer to the solar plexus. Details can’t have been picked at random because if they had been, two would at least almost match.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate980.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate975.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>If the details almost matched it would grate on me, but as it stood, it was the embodiment of a builder having fun, and it brought great joy in the beholding. A lugged bottom bracket shell here, some bilaminate supports there, a biplane fork for seat stays, ends filled with brass. Functionality and decent cable routing gave it away as having been built by a builder who’s been a mechanic. ‘The Vandal Metalworks’ didn’t come to win a brazing competition they came to show good, weird, fun, practical everyday bikes that I thoroughly enjoyed looking at and would love to have ridden home.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate1030.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Variangle</strong></p>\n<p>This variable angle headtube mountain bike was pretty wild in so many ways. The second iteration of the variable head angle bike from its maker, Peter Charnaud of Brighton-based ‘<a href=\"https://variangle.com/\" target=\"_blank\">Variangle</a>’, incorporates a new system allowing for height compensation. Peter builds as <a href=\"https://woodenbikedotcom.wordpress.com/\" target=\"_blank\">Woodenbike.co</a> alongside his business selling woodworking machinery, so this build really stuck out in and amongst all the other wooden framed bikes on his stand. Aside from outwardly having the aesthetics of a ride-on frame building jig, it’s made in a way that’s so separate from most frame building. Most of the frame is milled from plate material and for the most part, it’s bolted together with the exception of a small number of welds.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate1059.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Astonishingly, you can wind the lever on the top of the top tube in or out, to change the head angle while riding, to get a steep climbing geometry or a slack descending geometry, without significantly changing the reach or stack. While I can’t see the idea ever becoming mainstream, what an incredible project and an awesome tool for understanding the effect of the head angle and how it feels while actually riding. More than most bikes, it really made me want to jump on and take it for a ride, which the gentle coating of mud and trail debris that adorned the frame assured me could be a possibility.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/11/bespoked-2021-harrogate1068.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Obviously, I know how head tube angle affects the way a bike feels and rides, however, knowing something in any sort of academic way is so separate from the tacit knowledge you receive from feeling something in real life. This bike expresses the need to feel and therefore know, which I find admirable.</p>\n<p>____</p>\n<p><em>We’d like to thank Bespoked and Petor for allowing us to host these wonderful creations at The Radavist!</em></p>\n<p>The post <a href=\"https://theradavist.com/2021/11/2021-bespoked-uk-2/\">2021 Bespoked UK: Part 02 – Fahrradbau Stolz, OTT Cycles, The Vandal Metalworks, Variangle</a> appeared first on <a href=\"https://theradavist.com\">The Radavist</a>.</p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"9d627b32bd047285e1e06cd1578bdb9f677a2eff50f3f0278d8ca4fffaa08bbb","category":"Cycling"}