{"title":"กูเกิลอธิบายระบบความปลอดภัย Pixel 6 มีชิปแยกอีก 2 ตัว, ชิป Titan M2 เปลี่ยนเป็น RISC-V","link":"https://www.blognone.com/node/125567","date":1635515404000,"content":"<div><div><div><p>กูเกิลเขียนบล็อกอธิบายระบบความปลอดภัยของ Pixel 6 ประเด็นสำคัญอยู่ที่ชิปฮาร์ดแวร์ ซึ่งประกอบด้วย 3 ส่วน (ตามแผนผัง)</p>\n<ul>\n<li>ในตัวชิป Tensor หน่วยประมวลผล (Application Processor) มีพื้นที่ปลอดภัย (TrustZone) ที่เป็นมาตรฐานของ Arm อยู่แล้ว ตรงนี้ใช้รัน<a href=\"https://source.android.com/security/trusty\">ระบบปฏิบัติการ Trusty OS ของโครงการ Android</a> สำหรับรันในสภาพแวดล้อมปลอดภัย (Trusted Execution Environment - TEE) ซึ่งรองรับทั้งซีพียูฝั่ง Arm/Intel</li>\n<li>ในตัวชิป Tensor มีชิปคัสตอม Tensor Security Core ที่กูเกิลออกแบบเอง แยกจากตัวหน่วยประมวลผลหลัก มีซีพียู รอม แรม ของตัวเอง งานหลักของมันคือใช้เก็บคีย์ข้อมูลตอนรันไทม์, จัดการ secure boot และใช้คุยกับชิป Titan M2</li>\n<li>นอกตัวชิป Tensor มีชิปความปลอดภัยแยกเฉพาะ Titan M2 ซึ่งกูเกิลพัฒนาต่อจาก <a href=\"https://www.blognone.com/node/105968\">Titan M ที่เริ่มใช้ใน Pixel 3</a> จุดต่างสำคัญคือ Titan M2 เปลี่ยนมาใช้สถาปัตยกรรม RISC-V แทนแล้ว (<a href=\"https://security.googleblog.com/2018/10/building-titan-better-security-through.html\">ของเดิมเป็น Arm Cortex-M3</a>) กูเกิลยังไม่เผยข้อมูลของ Titan M2 มากนัก บอกแค่ว่ามีความเร็วเพิ่มขึ้น มีหน่วยความจำมากขึ้น และผ่านมาตรฐานความปลอดภัย AVA_VAN.5</li>\n</ul>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/96e9c53ec038aedccf5ec47520fef00e.jpg\" /></p>\n<p>ประเด็นอื่นด้านความปลอดภัย Pixel 6 ฝั่งซอฟต์แวร์ มีดังนี้</p>\n<ul>\n<li>สามารถสั่งปิดการเชื่อมต่อ 2G ได้ เพราะกูเกิลมองว่าเครือข่าย 2G เป็นเทคโนโลยีเก่าที่ไม่ค่อยปลอดภัยแล้ว ถ้าไม่จำเป็นต้องใช้ก็ปิดโอกาสโดนโจมตีลงได้</li>\n<li>มือถือ Android ทั่วไปมี<a href=\"https://www.blognone.com/node/92522\">ระบบสแกนมัลแวร์ Google Play Protect</a> ที่สแกนจากฝั่งเซิร์ฟเวอร์ แต่ Pixel 6 สามารถรันโมเดล machine learning ได้ในตัวเลย ทำให้ตรวจจับมัลแวร์ได้แม่นยำขึ้น</li>\n<li>Pixel 6 ยังมีระบบ anti-phishing ที่คอยสแกนสายเข้า SMS อีเมล และลิงก์ที่ส่งมายังช่องทางต่างๆ</li>\n<li>ฟีเจอร์ใหม่ของ Android 12 ชื่อ Private Compute Core ไว้รันงานที่อ่อนไหวกับข้อมูลส่วนตัว เช่น Live Caption ถอดเสียงวิดีโอในเครื่อง หรือ Smart Reply ที่แต่งข้อความให้อัตโนมัติ จะรันในพื้นที่พิเศษที่ไม่แชร์ข้อมูลให้แอพตัวอื่น (ตัวอย่างคือ แอพคีย์บอร์ดจะมองไม่เห็นข้อความที่ Smart Reply แต่งให้ จนกว่าเราจะกดยอมรับว่าใช้ข้อความนี้)</li>\n<li>ฟีเจอร์ใหม่อีกตัวคือ Google Binary Transparency (GBT) ตรวจสอบว่า Pixel รันเฉพาะ OS เวอร์ชันที่ยืนยันได้ว่าเป็นของจริงเท่านั้น โดยใช้วิธีเก็บล็อกไฟล์แบบต่อกันไปเรื่อยๆ (append-only) แล้วเช็คค่าแฮชกับฝั่งเซิร์ฟเวอร์</li>\n</ul>\n<p>ที่มา - <a href=\"https://security.googleblog.com/2021/10/pixel-6-setting-new-standard-for-mobile.html\">Google Security</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/google-pixel-6\">Google Pixel 6</a></div><div><a href=\"/topics/security\">Security</a></div><div><a href=\"/topics/google-tensor\">Google Tensor</a></div><div><a href=\"/topics/soc\">SoC</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9d6b8cc8793c15adea8ea95dc561b914d01389d59892b5aaf6b8d8d2dffee3ff","category":"Thai"}