{"title":"Eddy Cue ให้การต่อศาล อธิบายเรื่องใช้ Google เป็น default เสิร์ชใน iPhone","link":"https://www.blognone.com/node/135943","date":1695773425000,"content":"<div><div><div><p>Eddy Cue หัวหน้าส่วนธุรกิจ Services ของแอปเปิล ได้ให้การต่อศาลเพื่อเป็นพยานในคดีที่กระทรวงยุติธรรมสหรัฐฯ ฟ้องกูเกิล เกี่ยวกับการผูกขาดธุรกิจเสิร์ช ซึ่งแอปเปิลถือเป็นพยานรายสำคัญ เพราะกูเกิลจ่ายเงินให้แอปเปิล ด้วยตัวเลขระดับหลายพันล้านดอลลาร์ต่อปี เพื่อแลกกับการเป็นเสิร์ชค่าเริ่มต้น (default) ใน iPhone, iPad และ Mac</p>\n<p>ทนายของกระทรวงยุติธรรมฯ ถาม Cue เรื่องการเจรจาผลประโยชน์ระหว่างแอปเปิลกับกูเกิลครั้งสุดท้ายในปี 2016 ว่าหากตกลงตัวเลขกันไม่ได้ แอปเปิลจะทำอย่างไร Cue บอกว่า เขารู้สึกเสมอว่าทั้งสองฝ่ายต่างต้องการผลประโยชน์ที่ดีที่สุด แต่เรื่องนี้มีมากกว่าแค่ตัวเงิน เพราะทางเลือกอื่นคือย้ายไปใช้เสิร์ชรายอื่น หรือสร้างเสิร์ชขึ้นมาเอง ซึ่งแอปเปิลแทบไม่ได้คิดถึงเรื่องนี้เลย ก็อาจบอกได้ว่าในตอนนั้นไม่ได้มีตัวเลือกอื่นมากกว่าอยู่กับกูเกิล</p>\n<p>Cue ยังเสริมว่าที่เลือกใช้กูเกิลเป็นค่าเริ่มต้นเพราะเป็นเสิร์ชที่ดีที่สุด แต่ขณะเดียวกันเราก็ทำให้ผู้ใช้งานเปลี่ยนค่าเริ่มต้นได้ง่ายด้วย ทนายจึงถามต่อไปว่าทำไมไม่มีขั้นตอนการเลือกเสิร์ชค่าเริ่มต้น ในขณะเซตอัพเครื่องใหม่ Cue บอกว่า ขั้นตอนเซตอัพนั้นออกแบบมาให้รวดเร็วที่สุด จึงมีเฉพาะสิ่งที่สำคัญจริง ๆ ซึ่งการเลือกเสิร์ชค่าเริ่มต้นไม่ใช่ และสามารถเปลี่ยนภายหลังได้ ซึ่งทนายของกระทรวงยุติธรรมฯให้ข้อมูลว่าการเปลี่ยนตั้งค่านี้มีหลายขั้นตอนเกินไป (Settings &gt; Safari &gt; Search Engine)</p>\n<p>เมื่อถามถึงประเด็นที่แอปเปิลโปรโมตความเป็นส่วนตัวอยู่ตลอด แต่เลือกใช้เสิร์ชกูเกิลที่เก็บข้อมูลผู้ใช้งาน Cue บอกว่า แอปเปิลกำหนดให้แสดงคำเตือนส่วนนี้ และผู้ใช้งานสามารถใช้กูเกิลแบบไม่ล็อกอิน ซึ่ง Safari มีการจัดการป้องกันข้อมูลส่วนตัวเพิ่มอยู่แล้ว</p>\n<p>ยังมีประเด็นเล็ก ๆ ก่อนเริ่มให้การ โดย Cue ทักในระหว่างเจ้าหน้าที่เซตอัพจอภาพคอมพิวเตอร์ว่า ภาพดูไม่ชัด น่าจะลองเปลี่ยนมาใช้ Mac เรียกเสียงหัวเราะในศาล ก่อนผู้พิพากษาจะตอบกลับว่า ก็ถ้าแอปเปิลจะบริจาคให้... ทำให้เสียงหัวเราะในศาลดังกว่าเดิม ก่อนจะเข้าสู่ขั้นตอนการพิจารณาคดี</p>\n<p>ที่มา: <a href=\"https://www.theverge.com/2023/9/26/23891037/apple-eddy-cue-testimony-us-google\">The Verge</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/0bac5d58db232038a6e128c70ad2dbca.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/eddy-cue\">Eddy Cue</a></div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/google\">Google</a></div><div><a href=\"/topics/lawsuits\">Lawsuits</a></div><div><a href=\"/topics/antitrust\">Antitrust</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9d7b6c3b8e38fd81f469d82039a619b5185da7c30895de913b42582448c288f6","category":"Thai"}