{"title":"281 Effects of dietary Aspergillus oryzae postbiotic during gestation and lactation on sow and progeny performance","link":"https://academic.oup.com/jas/article/102/Supplement_2/175/7664807?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>This study aimed to evaluate effects of <span>Aspergillus oryzae</span> postbiotic (AOP) supplementation in gestation and lactation diets on sow performance, litter performance, and offspring performance through the nursery period. Sows [n = 118; Landrace × Yorkshire; body weight (BW) = 238 ± 2.2 kg; parit y= 3.8 ± 0.32] were blocked by parity and assigned randomly to one of two treatments. Treatments were a control diet and a control diet supplemented with AOP (Biozyme Inc.) at 1.5 g/sow/d in gestation from 5 days before breeding until farrowing, and adjusted to 1.55 g•sow<sup>-1</sup>•d<sup>-1</sup> during lactation. Sow BW and P2 backfat thickness were measured on d 0, 30, and 109 of gestation and 24 h postpartum and at weaning on d 20 ± 2. Litters were standardized to 13 piglets within 24 h of farrowing. Piglets were weighed individually at birth, after 24 h, and at weaning. At weaning, 369 pigs were allotted to pens within maternal dietary treatment (48 pens, with 7 or 8 pigs/pen) for a 42-d nursery trial. All pigs received a common nursery diet in 3 dietary phases. Sows fed AOP had a lighter (P &lt; 0.01) BW than those in the control group on d 109 of gestation (234.1 vs 244.1 kg) and post-farrowing (227.4 vs 236.7 kg), respectively, but not at other time points. Moreover, sows fed AOP showed less (<span>P</span> &lt; 0.01) BW loss from d 109 of gestation to weaning (-0.9 vs -7.8 kg) and from post-farrowing to weaning (4.1 vs -1.9 kg) compared with control sows. Total feed intake and average daily feed intake (Control: 6.0 vs AOP: 6.2 kg/d) during lactation were not impacted (<span>P</span> &gt; 0.10) by dietary treatments. Supplementation of AOP did not influence (<span>P</span> &gt; 0.10) litter size (14.8 vs 16.0), litter birth weight (17.4 vs 18.2 kg), percentage of low birth weight piglets (13 vs 12.5 %) or normal birth weight piglets (87.0 vs 87.5 %), stillbirths (1.2 vs 1.2/litter), or mummies (0.9 vs 0.5/litter) for Control and AOP sows, respectively. Across treatments, no differences (<span>P</span> &gt; 0.10) were observed for litter weight gain (43.2 vs 40.4 kg), average piglet BW at weaning (5.1 vs 4.9 kg), or piglet mortality rate (12.4 vs 13.1 %) for Control and AOP sows, respectively. Piglets weaned from AOP sows tended (<span>P</span> = 0.07) to have an increased average daily feed intake (ADFI) during the first week after weaning compared with pigs weaned from Control sows (0.28 vs 0.26 kg), but AOP did not influence other performance parameters for the entire nursery period. There were no interactions between maternal dietary treatment and nursery phase (<span>P</span> &gt; 0.10), suggesting consistent responses to maternal dietary treatments over time. In summary, feeding sows AOP reduced sow BW loss but had no impact on litter or nursery performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9d84ca4aa135dcf61e00dad93f8150f22c71d61adcd90b39444ce160401c5e9a","category":"Environment"}