{"title":"Energy evolution mechanism of structural surfaces in sandstones with different dips based on the energy principle","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300931","date":1711029600000,"content":"<p>by Yongjiang Yu, Zhiyuan Song, Jiaming Liu, Yuntao Yang, Xu Dong</p>\r\n\r\nA uniaxial compression test was conducted on sandstone specimens at various inclination angles to determine the energy evolution characteristics during deformation and damage. Based on the principle of minimum energy dissipation, an intrinsic model incorporating the damage threshold was developed to investigate the mechanical properties of sandstone at different inclination angles, and the energy damage evolution during deformation and damage. This study indicated that when the inclination angle of the structural surface remained below 40°, sandstone exhibited varying mechanical properties based on different inclination angles. The peak strain was positively correlated with the inclination angle, whereas the compressive strength and modulus of elasticity showed negative correlations. From an energy perspective, the deformation and damage of sandstone under external loading entail processes of energy input, accumulation, and dissipation. Moreover, higher inclination angles of the structural surface resulted in a smaller absorbed peak strain and a reduced proportion of dissipated energy relative to the energy input, thereby affecting the evolution of energy damage throughout the process. As the inclination angle of the structural surface increased, the absorbed total strain at the peak value decreased, whereas the proportion of the dissipated energy increased. Additionally, the damage threshold and critical value of the rock specimens increased with the inclination angle. The critical value, a composite index comprising the peak strain, compressive strength, and elastic modulus, also increased accordingly. These findings can offer a novel perspective for analyzing geological disasters triggered by fissure zones within underground rock formations.","author":"Yongjiang Yu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9d8ea71e06e3f007919ab034d5f00245de6c411722c3bf21e26eee7a1c7eecd4","category":"Interdisciplinary"}