{"title":"Schwalbe Begins Recycling Bicycle Inner Tubes in US","link":"https://bikerumor.com/schwalbe-bicycle-inner-tube-recycling/","date":1684871154000,"content":"<p>Schwalbe’s leaders say they want to create a more circular economy. And what better way to do it than recycling circles?</p>\n\n\n\n<p>This month, the bike tire maker announced its first-ever bike tube recycling program in the United States. Named <a href=\"https://www.schwalbetires.com/recycling/\" target=\"_blank\">Cradle-to-Cradle</a>, the initiative focuses on waste reduction in the cycling industry, according to a company press release.</p>\n\n\n\n<p>A pilot program starts June 1, with <a href=\"https://bikerumor.com/beware-schwalbe-tires-warns-of-fake-online-stores/\" target=\"_blank\">Schwalbe</a> accepting used tubes from select dealers throughout the United States. Company leaders hope to add hundreds of dealers by the end of this year. </p>\n\n\n\n<p>Millions of bike tubes end up in landfills every year, Schwalbe said. The materials take hundreds of years to decompose while making new ones contributes to greenhouse gas emissions.</p>\n\n\n\n<p>To avoid that waste,<span> the company will transform discarded bicycle tubes into new, “top-quality” tubes, it said. When compared to using the same amount of virgin materials, tube recycling reduces energy consumption by over 80%, including transport, Schwalbe claimed. </span></p>\n\n\n\n<figure><a href=\"https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2.jpg\"><img width=\"800\" height=\"533\" src=\"https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-800x533.jpg\" alt srcset=\"https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-800x533.jpg 800w, https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-297x198.jpg 297w, https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-120x80.jpg 120w, https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-768x512.jpg 768w, https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2-720x480.jpg 720w, https://bikerumor.com/wp-content/uploads/2023/05/tube-recycling-2.jpg 1200w\" /></a><figcaption>Photo c. Schwalbe</figcaption></figure>\n\n\n\n<h2>How Does It Work?</h2>\n\n\n\n<p>For Schwalbe, the program has already proven successful in Europe, where the company has recycled 9 million tubes from five countries, the press release said. Every tube from the company incorporates 20 percent recycled content, and Schwalbe aims to increase the amount of recycled material in the future.</p>\n\n\n\n<p>The closed-loop recycling process begins with collecting used tubes from various brands and manufacturers, gathered from bike shops and cyclists.</p>\n\n\n\n<p>Once a bike shop accumulates up to 45 pounds of used tubes (or <a href=\"https://bikerumor.com/schwalbe-bicycle-tire-recycling-system/\" target=\"_blank\">20,000 tires</a>), they can schedule a shipment, free of charge, via a custom UPS portal back to Schwalbe. The collected tubes are then transported to Schwalbe’s recycling plant in Indonesia, where the rubber is recovered for later use.</p>\n\n\n\n<p>“It is estimated that nearly 10 million used inner tubes find their way to US landfills each year,” Sean Cochran, representative of Schwalbe North America, said in the press release. “Instead of considering them as trash, we regard them as valuable resources to produce new, high-quality tubes. We are proud to announce the launch of our tube recycling program in the US.”</p>\n\n\n\n<p><a href=\"https://www.schwalbetires.com/sustainability/\" target=\"_blank\"><em>schwalbetires.com</em></a></p>\n<p>The post <a href=\"https://bikerumor.com/schwalbe-bicycle-inner-tube-recycling/\">Schwalbe Begins Recycling Bicycle Inner Tubes in US</a> appeared first on <a href=\"https://bikerumor.com\">Bikerumor</a>.</p>","author":"Andrew McLemore","siteTitle":"Bikerumor","siteHash":"49f427af0a926f4232eb837006841d7242e153e3afbb590f32e4b104ea3e2718","entryHash":"9d91c407bb9581892fc50d0a7fe188b8c70f56ac285db26f7eae936f35a1db97","category":"Cycling"}