{"title":"Red chili powder dietary supplementation regularized the performance, hematobiochemical indices, oxidative status, and 8-hydroxy-2’-deoxyguanosine of aflatoxin B1 exposed broiler chickens","link":"https://academic.oup.com/tas/article/doi/10.1093/tas/txae006/7516496?rss=1","date":1704931200000,"content":"<span><div>Abstract</div>The effects of red chili powder dietary supplementation on the performance, hematobiochemical indices, oxidative status, and DNA damage in broiler chickens fed aflatoxin B<sub>1</sub> (AFB<sub>1</sub>) contaminated diets were studied. Two hundred and forty Cobb 500 breed day-old broiler chicks were randomly distributed into control group (CONT), 0.5 mg/kg AFB1-exposed group (AFTB), 0.5 g/kg red chili pericarp powder supplementation alongside the 0.5 mg/kg AFB1 exposed group (RCPA), and 0.5 g/kg red chili seed powder supplementation alongside the 0.5 mg/kg AFB<sub>1</sub> exposed group (RCSA). The red chili supplementation, in both pericarp powder and seed powder, positively influenced broiler performance by improving (<span>P</span> &lt; 0.05) weight gain, feed intake, and feed conversion ratio, with a reduction in mortality rates compared to the AFTB group. Hematological indices showed that AFB1 exposure decreased (<span>P</span> &lt; 0.05) the red blood cell count, packed cell volume, and hemoglobin (Hb) concentration, but the red chili supplementation mitigated these reductions. Additionally, total white blood cell counts were maintained (<span>P</span> &gt; 0.05) in red chili-supplemented groups compared to CONT. Red chili supplementation increased (<span>P</span> &lt; 0.05) the total protein and globulin concentrations and reduced (<span>P</span> &lt; 0.05) liver enzyme levels compared to the AFTB group. The oxidative enzyme levels in RCPA and RCSA were similar (<span>P</span> &gt; 0.05) to CONT groups. The red chili supplementations counteracted DNA damage, as reflected by similar (<span>P</span> &gt; 0.05) 8-hydroxy-2’-deoxyguanosine levels recorded in RCPA, RCSA, and CONT groups levels. These findings suggest that 0.5 g/kg red chili supplementation has the potential to ameliorate the adverse effects of AFB<sub>1</sub> exposure on broiler chickens, improving their performance and health.</span>","author":"","siteTitle":"Translational Animal Science Current Issue","siteHash":"8d61840e583a2175b88aabf652537e7d7651f335c062d8dd995327edd84f85e0","entryHash":"9da03c39dcb9b7c8a10fcf34a3d757275c4c89780034fff2cda424d00d5fbec5","category":"Environment"}