{"title":"Effect of Acute Salinity Stress on Metabolism, Antioxidant Status, and Histological Structure of Procambarus clarkii","link":"https://onlinelibrary.wiley.com/doi/10.1155/2023/2748257?af=R","date":1675929600000,"content":"<p><i>Procambarus clarkii</i> is a well-known invasive species with a strong environmental tolerance that has spread worldwide. Crayfish were exposed to five different salinities (0, 6, 12, 18, and 24 parts per thousand (ppt)) to determine how salinity affects physiological and histological responses. The metabolism-related enzymes pyruvate kinase (PK) and fatty acid synthase (FAS) activities of the hepatopancreas and gill tissues significantly decreased with an increase of salinity (6, 12, 18, 24 ppt), except the increase of FAS activity at 6 ppt. Salinity caused an immune disorder, as displayed by the decreased activities of lysozyme (LSZ) and superoxide dismutase (SOD). In contrast, catalase (CAT) activities showed increased activity. The heat shock protein 90 (HSP90) concentration significantly increased at 6 ppt and then significantly decreased at 24 ppt in the hepatopancreas and gill tissues. A HE section revealed that salinity stress influenced the tissue structures. High salinity (24 ppt) damaged the hepatopancreas and deformed the gills. In conclusion, <i>P</i>. <i>clarkii</i> is resistant to acute exposure to low salinities and suffers physiological damage when exposed to hyperosmotic salinities. Our study provides a valuable reference to analyse the adaptation mechanisms of crayfish in response to salinity.</p>","author":"Yi Zhao, \nLei Luo, \nDong-liang Liu, \nJian-Hua Huang, \nShi-Gui Jiang, \nFa-Lin Zhou, \nQi-bin Yang, \nSong Jiang, \nYun-Dong Li, \nLi-Qi Tan, \nLi-Shi Yang, \nMahmoud Dawood","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"9da1d5d505419c8a4189bfd1a9d674234edede84539d5b63b5a723ec6e199866","category":"Environment"}