{"title":"Here’s everything Apple is planning to release over the next 12 months","link":"https://www.macworld.com/article/1968474/apple-new-products-m3-macs-ipad-pro-imac-2024.html","date":1687882175000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>If you’re an Apple fan, 2023 has already been a great year. We got the new MacBook Pro with the M2 Pro and M2 Max processors, a <a href=\"https://www.macworld.com/article/1948603/15-inch-macbook-air-m2-review.html\">15-inch MacBook Air</a>, a <a href=\"https://www.macworld.com/article/347010/new-mac-pro-2023.html\">Mac Pro with M2 Ultra</a> processor, and of course, the <a href=\"https://www.macworld.com/article/557878/apple-reality-headset-ar-vr-design-features-specs-price.html\">Apple Vision Pro</a> headset. But according to a new report, lots more products are in the works.</p>\n\n\n\n<p>Following the launch of the <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15</a> and <a href=\"https://www.macworld.com/article/1472709/apple-watch-series-9-rumors-specs-features-price-release.html\">Apple Watch Series 9</a>, and a new <a href=\"https://www.macworld.com/article/1967628/new-apple-watch-ultra-fall-2023.html\">Apple Watch Ultra</a> later this year, Mark Gurman reports in his latest <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-06-25/apple-2023-and-2024-road-map-iphone-15-m3-macs-ipad-air-vision-pro-headset-ljbftjwx&amp;xcust=1-1-1968474-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Power On</a> newsletter that <a href=\"https://www.macworld.com/article/671090/new-apple-products.html\">Apple has numerous products in development</a> for release in 2024 and beyond, including several that use the M3 processor:</p>\n\n\n\n<ul>\n<li>13-inch MacBook Pro (codenamed J504)</li>\n\n\n\n<li>14-inch and 16-inch MacBook Pros (codenamed J514 and J516)</li>\n\n\n\n<li>24-inch iMac (codenamed J433 and J434)</li>\n\n\n\n<li>13-inch and 15-inch MacBook Airs (codenamed J613 and J615)</li>\n\n\n\n<li>11-inch and 12.9-inch iPad Pros (codenamed J717 and J720)</li>\n\n\n\n<li>iPad Air (codenamed J507)</li>\n</ul>\n\n\n\n<p>None of these are all that surprising, but there are some interesting tidbits. For one, they’re all dependent on the release of the M3 processor, which is likely coming in early 2024. The M3 will be Apple’s first Mac processor built on a 3nm process and it will likely bring significant performance and architectural changes that could have an impact on design and specs. </p>\n\n\n\n<p>Gurman doesn’t share any new information about the updates other than they will have M3 versions of the same M2 processors they have now. However, he notes that the iPad Pro will have OLED displays and the iMac may offer a high-end model with a screen “over 30 inches.”</p>\n\n\n\n<p>Additionally, Gurman mentions several products “in early development” with no timetable for release. Among them are a 3rd-generation version of the AirPods Pro and an updated Apple TV 4K with “improved specifications.” All said, there are more than a dozen new products in development not including the Vision Pro line of headsets.</p>\n\n\n\n<p>Also in the pipeline is “new home equipment such as smart displays,” which have been rumored for a while now. Previous reports have suggested a device similar to Google’s new Pixel Tablet could be on the way, with a magnetic docking station that lets it switch between a smart home device and a tablet.</p>\n\n\n\n<p></p>\n\niMac, Mac, MacBook</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9da269f55dbc8797017c83b0dcf0bc7beb97a5fe0abc65e2865f70a3f90aaec0","category":"Apple"}