{"title":"Preferential Hydrologic States and Tipping Characteristics of Global Surface Soil Moisture","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR034858?af=R","date":1711609200000,"content":"<h2>Abstract</h2>\n<p>A dynamic transition in soil hydrologic states through meteorological variability and terrestrial feedback governs soil-vegetation-climate (SVC) interactions, constrained by critical soil moisture (SM) thresholds. However, observational and scaling constraints limit critical SM threshold estimation at the remote-sensing (RS) footprint scale. Using global surface SM (<i>θ</i>\n<sub>\n   <i>RS</i>\n</sub>) from NASA’s Soil Moisture Active Passive (SMAP) satellite, we characterize the seasonal preferential hydrologic states of <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> and derive three tipping characteristics to estimate the intensity (Mean Tipping Depth, ε‾ $\\overline{\\boldsymbol{\\varepsilon }}$), frequency (Tipping Count, <b>\n   <i>η</i>\n</b>), and duration (Mean Tipped Time, τ‾ $\\overline{\\boldsymbol{\\tau }\\,}$) of the excursion of <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> from wet- to dry-average conditions. The preferential state provides the seasonally dominant hydrological states of <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub>, while tipping characteristics capture the ecosystem linkages of the dynamic transition in <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> hydrologic states. Globally, <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> predominantly exhibits a (unimodal) dry-preferential state, especially over arid/semi-arid drylands and a unimodal wet-preferential <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> state in high-latitude boreal forests and tundra biomes. Prevalence of (bimodal) bistable <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> state overlaps with regions of strong positive SM-precipitation coupling and monsoonal climate in semi-arid/subhumid climates. Seasonal preferential hydrologic states co-vary with the regional variability in plant water stress threshold and land-atmospheric coupling strength. Tipping characteristics of <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> show sensitivity to intra-biome variability in SVC coexistence patterns and display high skill in partitioning global ecoregions. While ε‾ $\\overline{\\boldsymbol{\\varepsilon }}$ and <b>\n   <i>η</i>\n</b> are climate-controlled, τ‾ $\\overline{\\boldsymbol{\\tau }\\,}$ is moderated by soil and vegetation through their influence over <i>θ</i>\n<sub>\n   <i>RS</i>\n</sub> drydown during water-limited evapotranspiration. Preferential states and tipping characteristics find applications in quantifying SVC coexistence patterns, climate model diagnosis, and assessing ecosystem sensitivity to climate change.</p>","author":"Vinit Sehgal, \nBinayak P. Mohanty","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"9dacab96ce7c3f91ef2126a6983cda627bd1e58520ee81716246908c3af87fca","category":"Environment"}