{"title":"Understanding reaction to corporate activism: The moderating role of polarization","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae313/7821169?rss=1","date":1728950400000,"content":"<span><div>Abstract</div>In our polarized societies, more companies are taking a stand on divisive sociopolitical issues. However, given the mixed findings from previous studies, it remains unclear whether Corporate Activism (CA) is more likely to hurt or help a company's performance and reputation, or shape the public's attitudes toward the sociopolitical issue involved. To better understand the impact of CA in polarized societies, it is valuable to study moderating factors, especially those linked to polarization. A meta-analysis of 72 scholarly works is conducted to examine the impact of CA on various outcomes (e.g. ads and social media engagement, cognitive and attitudinal reactions, public's intentions and actions, emotional reactions, social and ethical engagement, workplace, and employee perceptions) and the role of moderators (a sociopolitical issue's political leaning and controversy level, political orientation of the target audience, key demographics). The analysis reveals a positive, albeit small, effect size (0.085 [95% CI (0.0542, 0.1158)]) with the most impact on two outcomes: cognitive and attitudinal reactions, and emotional reactions. It further reveals that companies adopting liberal-leaning CAs elicit more favorable responses than those adopting conservative CAs and that liberals respond positively to CA, while conservatives are more neutral. However, when there is alignment between the CA's political leaning and the audience's political orientation, conservatives have a stronger positive response than liberals. Also, younger audiences view CA more positively. Finally, per national culture, while power distance and individualism positively moderate the reaction to CA, uncertainty avoidance has a negative effect.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"9db8aa33aa4a5c00a2c92033bd9733ddff111a05e0a0047d22aa292f1defb60c","category":"Interdisciplinary"}