{"title":"Mollema gets a win in France: Daily News","link":"https://cyclingtips.com/2021/02/mollema-gets-a-win-in-france-daily-news/","date":1613775304000,"content":"<p>Hello again, CyclingTips readers,</p>\n\n\n\n<p>We close out the week with the start of the Tour des Alpes Maritimes et du Var (the race formerly known as the Tour du Haut Var), where plenty of big names are  getting some early-season racing into the legs.</p>\n\n\n\n<p>In other news, Romain Bardet could be heading to the Giro d&#8217;Italia and the Vuelta a España this year.</p>\n\n\n\n<p>Read on for the latest from the world of cycling.</p>\n\n\n\n<p><em>Dane Cash<br>News Editor</em></p>\n\n\n\n<h2>What&#8217;s news?</h2>\n\n\n\n<h3>Mollema wins Tour des Alpes Maritimes et du Var opener</h3>\n\n\n\n<p>Bauke Mollema stormed to victory on stage 1 of the Tour des Alpes Maritimes et du Var, triumphing in a tough finale.</p>\n\n\n\n<p>The 186.8 km stage from Biot closed out with three trips ascents of the Col du Gourdon climb. Riders fired off attacks out of a reduced pack on the last trip up, but nothing really stuck, and leaving the win still in play in the last kilometer. Mollema made his move with a few hundred meters left on the uphill run to the line and opened a small gap that he held to the line to nab the win, with Greg Van Avermaet settling for runner-up honors one second later and Valentin Madouas in third.</p>\n\n\n\n<p>Mollema will take the leader&#8217;s jersey into the second stage of the three-day race.</p>\n\n\n\n<h3>Bardet reportedly plans to race the Giro and the Vuelta this year</h3>\n\n\n\n<p><a href=\"https://www.lequipe.fr/Cyclisme-sur-route/Actualites/Romain-bardet-dsm-commencera-sa-saison-sur-les-paves-et-les-chemins-de-terre/1224877\" target=\"_blank\" rel=\"noreferrer noopener\">L&#8217;Equipe</a> reports that Romain Bardet&#8217;s plans for his first season with DSM (after making the move over from AG2R La Mondiale) will include the Giro d&#8217;Italia and the Vuelta a España – and not the Tour de France.</p>\n\n\n\n<p>According to L&#8217;Equipe, Bardet will get his season underway with his first ever start at the Omloop Het Nieuwsblad next Saturday, February 27. He will then head to Strade Bianche and then Tirreno-Adriatico. Later in the season, he will reportedly race the Giro d&#8217;Italia in what will mark his debut in the Italian Grand Tour. The 30-year-old Frenchman had initially been planning on racing the Giro last year but ultimately changed plans and rode the Tour instead.</p>\n\n\n\n<p>Following the Giro, Bardet is hoping to be selected to race the Tokyo Olympics, and is then set to race the Vuelta a España.</p>\n\n\n\n<h3>Marquee riders set to race Omloop Het Nieuwsblad</h3>\n\n\n\n<p>Going back to the Omloop Het Nieuwsblad, race organizers have announced some of the stars expected to be in attendance at this year&#8217;s event.</p>\n\n\n\n<p>Notables set to attend the men&#8217;s race include defending champ Jasper Stuyven and his Trek-Segafredo teammate Mads Pedersen, Philippe Gilbert, Oliver Naesen and new AG2R-Citroën teammate Greg Van Avermaet, Julian Alaphilippe, Zdenek Stybar, Alexander Kristoff, Arnaud Démare, Niki Terpstra, and the aforementioned Bardet, to name only some of the provisional starters.</p>\n\n\n\n<p>On the women&#8217;s side, big names include 2020 winner Annemiek van Vleuten, Chantal van den Broek-Blaak, Anna van der Breggen, Amy Pieters, Jolen D&#8217;hoore, Marta Bastianelli, Coryn Rivera, Lizzie Deignan, Ellen van Dijk, and Elisa Longo Borghini.</p>\n\n\n\n<h3>ISN manager Calström: UAE Tour will be a &#8216;building block&#8217; for Froome</h3>\n\n\n\n<p>Chris Froome is set to get his first season with Israel Start-Up Nation underway this weekend at the UAE Tour, following an offseason that saw the four-time Tour winner focused on getting back to his best, spending time in Southern California combining sessions at the Red Bull Performance Center with training out on the road.</p>\n\n\n\n<p>Rider and team see the UAE Tour as an opportunity for Froome to continue working his way back into top form, with team manager Kjell Carlström saying in a press release, “Being as it’s Chris’s first race following a good and successful period of training and rehab, we expect him to use the UAE Tour as a building block to further develop his shape towards the bigger objectives that are waiting down the line.&#8221;</p>\n\n\n\n<h2>Moving Pictures</h2>\n\n\n\n<p>A video from the Ineos Grenadiers offers a chance to get to know Richard Carapaz.</p>\n\n\n<p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/f57TvvQS6oo\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe></p>\n\n\n<h2>In case you missed it&#8230;</h2>\n\n\n\n<h3>How to layer for cold weather riding</h3>\n\n\n\n<p>Ronan Mc Laughlin has some <a href=\"https://cyclingtips.com/2021/02/how-to-layer-for-cold-weather-riding/\" target=\"_blank\" rel=\"noreferrer noopener\">excellent advice</a> on how to layer when riding in winter.</p>\n\n\n\n<h3>Review: The $725 Assos Johdah Jacket and Equipe RS range is frustratingly good</h3>\n\n\n\n<p>On another cold-weather-riding-related note, Ronan Mc Laughlin reviews the <a href=\"https://cyclingtips.com/2021/02/review-the-725-assos-johdah-jacket-and-equipe-rs-range-is-frustratingly-good/\" target=\"_blank\" rel=\"noreferrer noopener\">Equipe RS range from Assos</a>.</p>\n\n\n\n<h3>Women&#8217;s Cycling Weekly, Issue 13</h3>\n\n\n\n<p>Amy Jones has the latest from the world of women&#8217;s cycling in <a href=\"https://cyclingtips.com/2021/02/womens-cycling-weekly-issue-13/\" target=\"_blank\" rel=\"noreferrer noopener\">Issue 13 of the Women&#8217;s Cycling Weekly</a>.</p>\n\n\n\n<h3>Bikes of the Bunch: Bowie-inspired Haley Cycles all-roader</h3>\n\n\n\n<p><a href=\"https://cyclingtips.com/2021/02/bikes-of-the-bunch-bowie-inspired-haley-cycles-all-roader/\" target=\"_blank\" rel=\"noreferrer noopener\">This week&#8217;s Bike of the Bunch</a> is a versatile custom titanium bike from Haley Cycles.</p>\n\n\n\n<h3>Freehweeling Podcast: 2021 Season Preview</h3>\n\n\n\n<p>The latest episode of the <a href=\"https://cyclingtips.com/2021/02/freewheeling-podcast-2021-season-preview/\" target=\"_blank\" rel=\"noreferrer noopener\">Freewheeling Podcast</a> looks ahead at what&#8217;s to come in the 2021 racing season.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/02/mollema-gets-a-win-in-france-daily-news/\">Mollema gets a win in France: Daily News</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"9dbba9276d0db60df714903f1229fd61faf37bf0f29e77442b5bca8b723552e3","category":"Cycling"}