{"title":"Tour de France 2021 Stage 9 Preview - The longest climb so far","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021-stage-9-preview","date":1625328000000,"content":"\n      <p>Stage 9 of the Tour de France will take in five categorised climbs in the Alps and the first .HC category ascent of the race – that makes for a demanding day. The stage finishes atop the monstrous Monteé de Tignes which is over 20km in length. <br /><br />The mountain was used at the 2007 Tour de France, where Michael Rasmussen conquered the climb, allowing the Dane to move into the yellow jersey after starting the stage in 39th place.</p>\n<p>Stage 8 of the 2021 Tour was dominated by Tadej <span>Pogačar who obliterated his GC rivals to gain a colossal lead in the general classification. No other rider vying for the yellow jersey finished within three minutes of Pogačar in Le Grand-Bornand. Dylan Teuns won the stage from a breakaway ahead of Ion Izagirre and Mike Woods.</span></p>\n<div></div>\n<p><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-2021\"><b><i>Tour de France 2021 Guide</i></b></a></p>\n<h4><b>Route</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_PROFILS_ETAPES_SANS_RAVITO_ETP09_1024x1024.jpg?v=1625229688\" />Stage 9 profile</span></i></p>\n<p>After leaving Cluses, the first 17km of the stage are flat. There will be constant attacks to join the breakaway here which means it may not form until the climbs begin. The first climb is the Côte de Domancy, which is short at two and a half kilometres but averages more than 9%, making it a second category climb. The breakaway is more likely to form in this phase of the race.<br /><br />An intermediate sprint occurs at kilometre 32 in Praz-sur-Arly. This is a good chance for Peter Sagan, Sonny Colbrelli and Michael Matthews to gain ground on Mark Cavendish who currently holds the green jersey.</p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_ETP09_PROFILS_PARTICULIERS_CORMET_DE_ROSELEND_1024x1024.jpg?v=1625229741\" /></span></i><i><span>Col du Pré and Cormet de Roselend profile</span></i></p>\n<p>The first-category Col des Saisies is next and is swiftly followed by a long descent. The Col du Pré directly follows which marks the first .HC category climb of the Tour de France this year. The ascent is 12.6km at 7.7% average gradient. Between kilometre 5 and 12 of the climb, the gradient averages just under 9.5%, making it a gruelling effort. There will be little respite afterwards with the Cormet de Roselend peaking 51km from the finish.</p>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/TDF21_ETP09_PROFILS_PARTICULIERS_MONTEE_DE_TIGNES_1024x1024.jpg?v=1625229808\" /></span></i></p>\n<p><i><span>Monteé de Tignes profile</span></i></p>\n<p>A long, 20km descent is next before a short valley section which leads directly into the final climb to Tignes. The Monteé de Tignes is defined by its length rather than steep gradients. The ascent does have an easier section just further than halfway and flattens in the final kilometre, providing two sections of brief respite.<br /><br />By the conclusion of the stage, the riders will have climbed over 4,500m and crossed 2,000m altitude for the first time at the 2021 Tour de France. This means that GC riders will be scattered across the road and a mass reshuffling in the GC standings will take place.</p>\n<h4><b>Contenders</b></h4>\n<p><i><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1326809833-min_1024x1024.jpg?v=1625330310\" />Tadej Pogačar will be chasing further GC gains. (Image credit: Chris Graythen/Getty Images)</span></i></p>\n<p><strong>Tadej Pogačar</strong> is the big favourite to win the Tour de France after he obliterated his opponents on the stage five time-trial and then in the Alps on stage eight. Seemingly, no one can touch <span>Pogačar in the mountains at the moment. Although his team are weakened after a long, gruelling chase on stage seven, </span><span>Pogačar is the big favourite to win stage nine unless the breakaway steal stage honours for the third day in a row.</span><br /><br />Jumbo-Visma contributed to the stage seven drama where among others, <strong>Wout van Aert</strong> joined the mega breakaway. Van Aert started the stage in third overall, just 30 seconds behind Mathieu van der Poel in the yellow jersey. The time he gained there means he is a genuine card that Jumbo-Visma could play in the general classification. He’ll likely leak some time to the pure climbers here, though he proved on the Prati di Tivo at Tirreno-Adriatico earlier this season that he’s no walkover in the mountains. <strong>Primož Roglič</strong> has now fallen entirely out of contention which means that Jumbo-Visma must concentrate on Van Aert and <strong>Jonas Vingegaard,</strong> who are second and fifth in the general classification respectively.</p>\n<p>How will the Ineos Grenadiers approach the stage? Despite the plethora of GC options available to them, they have been unable to make an impression on the general classification so far. <strong>Richard Carapaz </strong>is their only rider left in the top ten, as<strong> Geraint Thomas, Richie Porte </strong>and <strong>Tao Geoghegan Hart</strong> have fallen out of contention. They haven't been able to make their numbers pay, which was necessary if they were to worry Pogačar. Carapaz has been unable to gain time in the mountains despite numerous attacks over the past couple of days. The team must rally around the Ecuadorian and remain aggressive.</p>\n<p>The other GC riders to watch are <strong>Wilco Kelderman, David Gaudu </strong>and<strong> Rigoberto Urán.</strong></p>\n<p>The breakaway will fancy going on to take the stage. <strong>Simon Yates</strong> is one of the strongest climbers at the Tour and isn’t challenging for the general classification, instead choosing to focus on stage victories. However, a plethora of riders find themselves in this position including <strong>Jakob Fuglsang, Miguel Ángel López, Mike Woods </strong>and<strong> Esteban Chaves</strong>. They will be allowed to join the breakaway too, so could all prove to be likely stage winners.</p>\n<p>Other riders that could challenge for the stage in the breakaway include <strong>Dan Martin, Pierre Latour, <span>Jesús Herrada</span> </strong>and<strong> Carlos Verona.</strong></p>\n<h4><strong>Prediction</strong></h4>\n<p>UAE must control the race with <span>Pogačar in the yellow jersey. The Slovenian superstar already has one stage win in the bag at the Tour de France this year and may want to double up in Tignes. However, we think the stage will be won by the breakaway and are backing </span>Miguel Ángel López <span>to win stage nine of the 2021 Tour de France. The diminutive Colombian is one of the best pure climbers in the world and with 4,600 vertical climbing metres on the menu, this stage has his name written all over it.</span></p>\n<p><i>Cover image: <span>A.S.O./Pauline Ballet</span></i></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9dc205f7d6f9a3a5ac1d36e64ce73ff45681b0201eb5b016e5ea083277b14c61","category":"Cycling"}