{"title":"A spectrophotometric analysis of extracted water-soluble phenolic metabolites of lichens","link":"http://link.springer.com/10.1007/s00425-024-04474-3","date":1719878400000,"content":"<h3>Abstract</h3>\n                    <span>\n                      <h3>Main conclusion</h3>\n                      <p>Rainwater most probably constitutes a relatively effective solvent for lichen substances in nature which have the potential to provide for human and environmental needs in the future.</p>\n                    </span>\n                    <span>\n                      <h3>Abstract</h3>\n                      <p>The aims were (i) to test the hypothesis on the potential solubility of lichen phenolic compounds using rainwater under conditions that partly reflect the natural environment and (ii) to propose new and effective methods for the water extraction of lichen substances. The results of spectrophotometric analyses of total phenolic metabolites in rainwater-based extracts from epigeic and epiphytic lichens, employing the Folin–Ciocalteu (F.–C.) method, are presented. The water solvent was tested at three pH levels: natural, 3, and 9. Extraction methods were undertaken from two perspectives: the partial imitation of natural environmental conditions and the potential use of extraction for economic purposes. From an ecological perspective, room-temperature water extraction (‘cold’ method) was used for 10-, 60-, and 120-min extraction periods. A variant of water extraction at analogous time intervals was an ‘insolation’ with a 100W light bulb to simulate the heat energy of the sun. For economic purposes, the water extraction method used the Soxhlet apparatus and its modified version, the ‘tea-extraction’ method (‘hot’ ones). The results showed that those extractions without an external heat source were almost ineffective, but insolation over 60- and 120-min periods proved to be more effective. Both tested ‘hot’ methods also proved to be effective, especially the ‘tea-extraction’ one. Generally, an increase in the concentration of phenolic compounds in water extracts resulted from an increasing solvent pH. The results show the probable involvement of lichen substances in biogeochemical processes in nature and their promising use for a variety of human necessities.</p>\n                    </span>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"9dc5b36e021a8c1c159172c45202e93268f3642a0eed402b87bfce1d3d8c1291","category":"Environment"}