{"title":"Down Syndrome in Children: An Inborn Error of Immunity with Immune Dysregulation","link":"https://www.preprints.org/manuscript/202409.0750/v1","date":1725974201000,"content":"Background. The multisystemic features of Down syndrome (DS) in children are accompanied by an immunodeficiency, making them susceptible to infections and immune dysregulation with autoimmune, allergic, inflammatory, and hematological complications. This study was aimed at a better understanding of the abnormalities within the B and T cell compartments and their correlations with clinical immunophenotypes. Methods. Medical records of 35 DS children were retrospectively reviewed, referring to clinical symptomatology including history of infections, immune dysregulation disorders, and humoral and cellular immune response. Results. While the etiology of respiratory tract infections included typical viral and bacterial pathogens, SARS-CoV2-induced inflammatory disease and syndromic immunodeficiency contributed  significantly to deterioration of the clinical course. Allergic diseases in the form of asthma, allergic rhinitis, and alimentary allergy were the most frequent manifestations of immune dysregulation and were followed by autoimmune disorders, such as Crohn disease, celiac disease, autoimmune thyroiditis, and alopecia, as well as inflammatory disorders, balanitis xerotica obliterans and lymphadenopathy, and a hematological disorder of myelopoiesis. Deficiency of serum immunoglobulin levels, reduced numbers of naïve B cells, and non-switched memory B cells along with low naïve T helper cells and significantly reduced regulatory T helper cells were the most prominent immune abnormalities. Conclusions. The loss of naïvete in B and T lymphocyte compartments with a deficiency of regulatory T cells may be underpinning pathomechanisms for the skewed immune response. The clinical immunophenotype in DS is complex and represents syndromic inborn error of immunity with immune dysregulation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9dca46ef4ab3929349e08d0dd7a0b61fa505dace54780264bf68ce1289ddf711","category":"Interdisciplinary"}