{"title":"COVID trial using antidepressant cut short due to apparent effectiveness","link":"https://arstechnica.com/?p=1808613","date":1635455520000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1224555304-800x534.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/10/GettyImages-1224555304.jpg\">Enlarge</a> (credit: <a href=\"https://www.gettyimages.com/detail/photo/female-pharmacist-picking-some-drugs-with-face-mask-royalty-free-image/1224555304?adppopup=true\">FG Trade / Getty Images</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Despite the wide availability of vaccines, the most recent surge in COVID-19 cases left several US states struggling to provide adequate health care to their citizens. The situation reinforces the potential value of <a href=\"https://arstechnica.com/science/2021/10/meet-molnupiravir-mercks-thor-inspired-pill-that-hammers-covid/\">drugs like molnupiravir</a>, which reduce the need for hospitalization among those with COVID-19. But monupiravir <a href=\"https://arstechnica.com/science/2021/10/mercks-thor-inspired-covid-treatment-hammered-for-700-price-a-46x-markup/\">will be expensive</a> and will likely be difficult to supply globally for some time. So ongoing trials that test existing drugs for effectiveness against COVID-19 can still provide significant value.</p>\n<p>One of those trials has just produced some promising results. A cheap generic drug, developed as an antidepressant, appears to reduce hospitalization rates. While the effect was limited, it was clear enough to cause the trial to be cut short.</p>\n<h2>A decent trial</h2>\n<p>The drug in question is called fluvoxamine and is part of the class of drugs known as selective serotonin reuptake inhibitors, which are used to treat depression. There is absolutely no reason to expect that fluvoxamine would be effective against SARS-CoV-2, but a small trial tested it anyway, and the study looked promising. So the drug was picked up by a project called the TOGETHER trial, which is running a series of clinical trials using cheap drugs that are already approved for use.</p></div><p><a href=\"https://arstechnica.com/?p=1808613#p3\">Read 9 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1808613&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9dd6c92b19421eae53f2f263f03c635c907bffa3410a8f52d18fdfffc49ca664","category":"Tech"}