{"title":"iOS 15: Beta 6 is released with Safari changes, SharePlay removal","link":"https://www.macworld.com/article/348126/ios-15-public-beta-install-profile-features-updates-release.html","date":1629311939000,"content":"<div>\n<section><div></div></section><p><em><strong>Update 08/18/21:</strong> iOS 15 Beta 6 has been released to public testers.</em></p>\n\n\n\n<p>Every year, Apple releases major updates for its iPhone and iPad operating systems in the fall. For months before that, it releases beta test versions for developers and the public. They’re often incomplete and buggy, but it can be exciting to try out everything before it gets pushed out to a billion devices in the fall. We highly recommend you do <em>not</em> run this beta on a critical device. Yes, you can downgrade back to iOS or iPadOS 14, but it’s not a fast and easy process, and you may lose some of the information that you haven’t backed up or saved in the cloud. We also recommend you <a href=\"https://www.macworld.com/article/3410567/how-you-back-up-your-iphone-and-ipad-in-macos-10-15-catalina.html\">backup your iPhone or iPad</a> before you get started. If you want to know all about the new features coming to your iPhone and iPad this fall, <a href=\"https://www.macworld.com/article/348123/ios-15-features-facetime-notifications-sharing-live-text-compatilibity-release-beta-how-to-install.html\">check out our iOS 15</a> <a href=\"https://www.macworld.com/article/348175/ipados-15-features-features-multitasking-widgets-home-screen-app-library-compatibility-release-date-beta-how-to-install.html\">and iPadOS 15</a> guides.</p>\n\n\n\n<p>Besides, beta testing is a good way to help find bugs and problems and results in a more stable release this fall. Just use the Feedback app to submit bug reports. If you’re interested in running the iOS 15 or iPadOS 15 beta, here’s how you get it.</p>\n\n\n\n<p><em>[<a href=\"https://www.macworld.com/article/350966/ios-15-super-guide-features-tips-tricks-updates-safari-facetime-focus-notification-summary.html\">For more tips, tricks, news, features, and updates, check out our iOS 15 superguide.</a>]</em></p>\n\n\n\n<h2>What’s new in Beta 6?</h2>\n\n\n\n<p>We’re still discovering new items in Beta 6, but here’s what we have found so far:</p>\n\n\n\n<ul><li>SharePlay is disabled, and will not be in the initial iOS 15 release. Apple’s developer site says: <br />“SharePlay has been disabled for use in the developer beta 6 versions of iOS 15, iPadOS 15, and tvOS 15, and will be disabled in the upcoming beta 6 release of macOS Monterey. SharePlay will also be disabled for use in their initial releases this fall. SharePlay will be enabled for use again in future developer beta releases and will launch to the public in software updates later this fall.”</li><li>Safari’s bottom address bar is no longer floating, but a permanent fixture below all page content. There is now an option to show the address bar at the top. Learn <a href=\"https://www.macworld.com/article/353448/ios-15-safari-how-to-move-the-address-bar-back-to-the-top.html\">how to change the tab bar on iOS 15 Safari</a> if you want it back on top.</li></ul><h2>Registering for the Public Beta</h2>\n\n\n\n<p>It couldn’t be easier to enter the public beta program. Simply head to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://beta.apple.com/&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">beta.apple.com</a> and tap “Sign up.” You need to do this <em>on the device upon which you wish to run the beta.</em> You’ll be asked to sign in with your Apple ID, agree to terms of service, and then download a beta profile.</p>\n\n\n\n<p>Once you download the beta profile, you need to activate it.</p>\n\n\n\n<p>Open <em>Settings</em>, then tap <em>General</em>. Scroll down to <em>Profile</em> and select it. You can then tap on the iOS 15 or iPadOS 15 beta software profile and choose to activate it.</p>\n\n\n\n<p>Note that the Developer Beta is available right away, but Apple says the Public Beta won’t begin until July.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ios15-beta-profile.jpeg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>Before you install the beta, you have to download and install the Beta Profile.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Downloading the Beta</h2>\n\n\n\n<p>Once you’ve registered, downloaded the profile, and activated it, you’re ready to download the beta.</p>\n\n\n\n<p>Open <em>Settings</em>, then <em>General</em>, then <em>Software Update</em>. You should see that the iOS or iPadOS 15 public beta is available for download—if you don’t see it, make sure the profile is activated and installed. It can take a few minutes for the beta to show up after installing the profile, so don’t be in too big a hurry.</p>\n\n\n\n<p>Once you have the profile installed, you will continue to get beta updates throughout the beta program. Every time a new public beta release is available, you will automatically receive it, or can go to <em>Settings</em> &gt; <em>Software Update</em> to download it manually. There’s no need to re-download or activate the profile.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/06/ios15-install.jpeg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The iOS 15 beta, especially the Developer Beta, is bound to be buggy and should only be installed on secondary devices.</figcaption></figure><p>IDG</p></div>\n\n\n\n<h2>Registering for the Developer Beta</h2>\n\n\n\n<p>If you’re a registered developer (which costs $99/yr, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/programs/enroll/&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">go here</a> to enroll), you can download beta releases a little earlier than the general public. Apple often makes a developer beta release available for iOS and iPadOS immediately during its WWDC conference in June, with the first Public Beta release following a few weeks later. Subsequent updates are much closer together: developers usually get the update just a day before the public release, if that.</p>\n\n\n\n<p>That initial developer beta is often <em>very</em> sketchy, so we highly recommend you back up your device first, and don’t run it on your primary device!</p>\n\n\n\n<p>Once you’ve registered your Apple ID as a developer, head to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://developer.apple.com/download/&amp;xcust=1-1-348126-1-0-0&amp;sref=https://www.macworld.com/feed\">developer.apple.com/download/</a> using the iPhone or iPad upon which you wish to run the beta. You’ll have to sign in, and then you can download and install the beta profile from that page.</p>\n\n\n\n<p>Then, activate the profile by opening <em>Settings</em>, then <em>General</em>, then scrolling down to the bottom to tap on <em>Profile</em>. You may have to restart your device, but then the beta should show up in <em>General</em> &gt; <em>Software Updates</em> for you to download and install.</p>\n\n\n\n<h2>Leaving the iOS 15 Beta</h2>\n\n\n\n<p>If you want to stop receiving beta updates, that’s easy enough. Just remove the profile and you won’t get any more beta releases—you’ll just stay on the one you have. Once the final public release of iOS 15 or iPadOS 15 is made available in the fall, your device will download that, and you’ll be on the regular public non-beta release schedule.</p>\n\n\n\n<p>Simply removing the profile will stop you from getting further beta releases, but it doesn’t get you back to iOS 14 or iPadOS 14. To do that, you need to put your iPhone or iPad in recovery mode, connect it to your Mac or PC, and then use Finder (or iTunes on PC) to download the current regular iOS version and restore your device. This will reset it to a fresh out-of-the-box state. We told you to back up anything important and not to run the beta on a critical device!</p>\n\n\n\n<h2>Supported Devices</h2>\n\n\n\n<p>You can run iOS 15 on any iPhone that runs iOS 14, and iPadOS 15 runs on any iPad that is compatible with iPadOS 14.</p>\n\n\n\n<p>Here’s the list of supported iPhones for iOS 15:</p>\n\n\n\n<ul><li>iPhone 12</li><li>iPhone 12 mini</li><li>iPhone 12 Pro</li><li>iPhone 12 Pro Max</li><li>iPhone 11</li><li>iPhone 11 Pro</li><li>iPhone 11 Pro Max</li><li>iPhone XS</li><li>iPhone XS Max</li><li>iPhone XR</li><li>iPhone X</li><li>iPhone 8</li><li>iPhone 8 Plus</li><li>iPhone 7</li><li>iPhone 7 Plus</li><li>iPhone 6s</li><li>iPhone 6s Plus</li><li>iPhone SE (1st generation)</li><li>iPhone SE (2nd generation)</li><li>iPod touch (7th generation)</li></ul><p>And here’s the list of supported iPads for iPadOS 15:</p>\n\n\n\n<ul><li>iPad Pro 12.9-inch (5th generation)</li><li>iPad Pro 11-inch (3rd generation)</li><li>iPad Pro 12.9-inch (4th generation)</li><li>iPad Pro 11-inch (2nd generation)</li><li>iPad Pro 12.9-inch (3rd generation)</li><li>iPad Pro 11-inch (1st generation)</li><li>iPad Pro 12.9-inch (2nd generation)</li><li>iPad Pro 12.9-inch (1st generation)</li><li>iPad Pro 10.5-inch</li><li>iPad Pro 9.7-inch</li><li>iPad (8th generation)</li><li>iPad (7th generation)</li><li>iPad (6th generation)</li><li>iPad (5th generation)</li><li>iPad mini (5th generation)</li><li>iPad mini 4</li><li>iPad Air (4th generation)</li><li>iPad Air (3rd generation)</li><li>iPad Air 2</li></ul>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9ddc81b3f3479d7bdaa9453fc7373593be0db49e3effc62146208bc3ac288d19","category":"Apple"}