{"title":"Genotype-by-Environment Interaction and Stability of Canola (Brassica napus L) for Weed Suppression through Improved Interference","link":"https://www.preprints.org/manuscript/202408.0227/v1","date":1722838691000,"content":"Canola (Brassica napus L) is a profitable grain crop for Australian growers. However, weeds remain a major constraint for its production. Chemical herbicides are used for weed control, but this tactic also leads to the evolution of herbicide resistance in different weed species. Suppression of weeds by crop competition and allelopathic mechanisms has been receiving significant attention. Here, the weed suppressive ability, and associated functional traits and stability of four selected canola genotypes (PAK85388-502, AV-OPAL, AV-GARNET and BAROSSA) were examined at different locations of NSW, Australia. Results showed that there were significant effects of canola genotypes and of genotypes by crop density interaction on weed growth. Among the tested genotypes, PAK85388-502 and AV-OPAL were the most weed suppressive and, at plant density of 10 plants/m2, they reduced weed biomass of wild radish, shepherd’s purse and annual ryegrass by more than 80%. No significant differences were found in the primary root lengths among canola varieties; however, plants of the allelopathic genotype PAK8538-502 exhibited a 35% increase in lateral root number relative to plants of non-allelopathic genotype BAROSSA. The analysis of variance revealed a significant influence of genotypes with PAK85388-502 and AV-OPAL performed the best across all the research sites. Results showed that canola genotypes PAK85388-502 and AV-OPAL were more weed suppressive than AV-GARNET and BAROSSA and may release specific bioactive compounds in their surroundings to suppress neighbouring weeds. This study provides valuable information that could be utilised in breeding programs to select weed suppressive varieties of canola in Australia. Thus, lateral root number could be a potential target trait for weed suppressive varieties. Additionally, other root architecture traits may contribute to the underground allelopathic interaction to provide a competitive advantage to the crop.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9ddd1c680b0e101fd9f8a9c7ea4aeb39922dbc8edb3f5715cab993536ff6b6c6","category":"Interdisciplinary"}