{"title":"What’s going on at the Giro Donne? The state of play at the halfway point","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/what-s-going-on-at-the-giro-donne-the-state-of-play-at-the-halfway-point","date":1688487335000,"content":"\n      <p><span>Annemiek van Vleuten is back. There can no longer be any doubt about that. The Movistar rider leading the Giro d'Italia Donne resplendent in pink almost feels like a return to normality in the women’s peloton after a season so far of Van Vleuten slightly underperforming – by her own incredibly high standards. Of course, there’s no Demi Vollering at the Giro Donne this year after SD Worx confirmed they are heading to Italy mostly with the ambitions of achieving stage wins with their star sprinter, Lorena Wiebes (Vollering remains at altitude preparing for the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-de-france-femmes-preview\">Tour de France Femmes</a>). The absence of the usual super strong SD Worx team in the mountains at the Giro makes it slightly hard to quantify how amazing Van Vleuten’s form really is in comparison to the best climber currently, Vollering, but there is no denying that the Dutchwoman is looking very good indeed at the Giro Donne. So, how did Van Vleuten end up with pink on her shoulders? In a classic Van Vleuten style. </span></p>\n<div></div>\n<p><span>Naturally, the opening stage of the Giro Donne was as chaotic as the lead-up to the race itself. While there was no one else to blame for the lack of information about the stages and the rumours of cancellation other than the race organisers ahead of the race, the crazy nature of the opening stage was somewhat out of everyone’s control. Instead, it was the wild weather in Chianciano that instigated the drama – lashing rain and hailstones made the Italian roads slippery and soapy, meaning that 18 of the first 30 riders who set off in the opening time trial ended up face-to-face with the wet tarmac. It was for this reason that the organisers ended up cancelling the stage mid-way through, meaning that a lucky majority didn’t have to start the time trial at all.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1505474252_1024x1024.jpg?v=1688484363\" alt /></span><em><span>Elynor Backstedt of Lidl-Trek in the opening prologue (Image: Getty/</span>Dario Belingheri)</em></p>\n<p><span>The likes of Annemiek van Vleuten, Marianne Vos and Mavi García were some of the less fortunate, however. They started early and were forced to complete the short prologue. Though only five kilometres long, the stress of preparing for the timed effort, alongside the warm-up and warm-down, still adds to the fatigue of a rider. People wondered if this may impact Van Vleuten the following day, meaning she was more tired than some of her rivals. As it turned out, however, they had absolutely nothing to worry about.</span></p>\n<p><span>Stage two was well and truly the Van Vleuten show. Her trademark, powerful attack on the Passo della Colla category two climb blew away Gaia Realini (Lidl-Trek) and Marta Cavalli (FDJ-Suez) and Van Vleuten left only tyre tracks in her wake as she disappeared into the distance on the rolling roads to Marradi. She crossed the line 45 seconds ahead of a chasing group, led home by Cecilie Uttrup Ludwig (FDJ-Suez) and Juliette Labous (Team DSM). The first pink jersey of the race was awarded to the world champion who smiled widely as she crossed the line, any doubters firmly proved wrong.</span></p>\n<p><span>A straightforward sprint stage followed, won by none other than European champion Lorena Wiebes (SD Worx) ahead of the ever present Marianne Vos (Jumbo-Visma). On stage four, the race returned to hilly terrain and the hearts of Italian fans had the chance to sing for the first time.</span></p>\n<p><span>After an early breakaway and a scare for Van Vleuten in the form of a small crash in the opening kilometres, things kicked off on stage four when Veronica Ewers of EF Education-EasyPost attacked on the penultimate climb of the day, passing the remnants of the breakaway and going solo. It wasn’t to be an easy ride to the finish for the American though, with Van Vleuten using attacking as the best form of defence behind, launching a move on the final climb with Elisa Longo Borghini (Lidl-Trek) tight on her wheel. Ewers was caught by Longo Borghini and Van Vleuten on the final climb and a tense descent followed which saw the Italian try to drop her companions by railing it fast down her home roads. She was caught in the approach to the line, however, and a three-up sprint ensued. Proudly wearing the Italian tricolore, Longo Borghini took the win and delighted fans who awaited her in Borgo Val di Taro. Van Vleuten finished third and retained the race lead, while Longo Borghini and Ewers moved up to second and third overall respectively.</span></p>\n<p><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1513983433_1024x1024.jpg?v=1688484385\" alt /></span><em><span>Annemiek van Vleuten of Movistar wears the pink jersey as race leader after stage two (Image: Getty/</span>Dario Belingheri)</em></p>\n<p><span>That brings us to stage five, the most recent of the race and the day which included the <em>cima coppi</em> (the highest point in the race). Live TV coverage kicked off when Van Vleuten and Realini were riding together up the 9.8km Passo del Lupo (the main climb of the day) with around 70km of racing remaining (line to line coverage would be appreciated next year, RCS.)</span></p>\n<p><span>Once the Passo del Lupo was crested by Realini and Van Vleuten, the duo were able to descend safely but ended up quickly being rejoined by Longo Borghini and then another group of select climbers. With about 26km to go, Antonia Niedermaier (Canyon//SRAM) used the attacks of others on the final climb as a launchpad to make her own move, building up a solid lead. It was time for another Longo Borghini attack with just under 12km left and she took Van Vleuten with her. Then, drama struck when Van Vleuten crashed on the final descent – though luckily could quickly get back on her bike. Longo Borghini suffered the same fate just behind the Dutch rider on the road, but crashed more severely, taking some time to get back riding again.</span></p>\n<p><span>Niedermaier ended up taking a spectacular solo stage win, the biggest of the 20-year-old rider’s career so far, while Van Vleuten increased her lead overall as Longo Borghini suffered to the line, finishing seven and a half minutes behind. </span></p>\n<p><span>With the drama of stage five, the GC behind Van Vleuten has been heavily shaken up. Niedermaier’s spectacular ride catapulted her to second place overall, with EF’s Ewers in third and DSM’s Labous in fourth. Realini rounds out the top five for Lidl-Trek, with Longo Borghini’s chances out of the window. Van Vleuten’s advantage is now two minutes with four stages to go – does she have this in the bag?</span></p>\n<p><span></span><span><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/GettyImages-1513853359_1024x1024.jpg?v=1688484465\" alt /><em><span>Elisa Longo Borghini of Lidl-Trek crashes on a descent during stage five. The Italian rider got back up but finished the stage seven minutes down on the race winner. (Image: Getty/</span>Dario Belingheri)</em></span></p>\n\n<p><span>The most likely answer is yes, she does. Van Vleuten’s form looks solid and her riding style indicates she is not likely to crack over the next four days of racing. Without a team like SD Worx to really put her under pressure, Van Vleuten can now simply follow the attacks of others, without even having to worry about launching moves herself.</span></p>\n<p><span>On the other hand, however, this is a bike race, and nothing is certain.</span></p>\n<p><span>The Dutch rider has now had three crashes in the Giro Donne in five stages, and Longo Borghini has been able to put her under pressure on multiple occasions on the descents so far. If the upcoming stages were more mountainous, it would likely play into the favour of Van Vleuten even more as she would be able to distance others on the long climbs but some of the more complicated, punchy terrain that is coming up will likely not be the Movistar rider’s favourite stomping ground. The attacks will come thick and fast, and a coherent approach from the rest of the peloton could put the Dutch rider under pressure.</span></p>\n<p><span>And what of Niedermaier, the German 20-year-old who sits in second place in the first Giro Donne of her career? Could she pose a serious challenge to Van Vleuten who is 20 years her senior? It’s a tall order for the young rider, but she has truly announced herself as one of the key talents to watch for the future of women’s stage racing and is a beacon of light for Canyon//SRAM who have struggled to secure victories for multiple seasons now. </span></p>\n<p><span>Realini, Labous and Ewers are all talented climbers who have the biggest chance at putting Van Vleuten under pressure as the gradients kick up in the next few stages, but it is going to take a concerted effort to bring back a time gap of over two minutes. It’s likely that, unless things go terribly wrong for Van Vleuten, the fight for podium positions on the general classification behind her is going to be more nail-biting than the fight for the win. Movistar are in a strong position, and Van Vleuten likely feels right back at home dominating another Giro Donne, but the race is not quite over yet. There’s stage wins to fight for and some gutsy riders behind the World Champion who won’t give up easily, even though taking pink still seems like a very difficult task at this point in the race.</span></p>\n<p><em><span>Cover image:</span> Getty/Dario Belingheri</em></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"9df1707e7397b0d9852ff118c44ef7b365819d8eb627d7da5504917a73b6a548","category":"Cycling"}