{"title":"Patterns of constitutive and induced herbivore defence are complex, but share a common genetic basis in annual and perennial monkeyflower","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14601?af=R","date":1723009194000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/fc9fa005-5ba4-4314-9476-69f1ca429458/fec14601-toc-0001-m.png\" alt=\"Patterns of constitutive and induced herbivore defence are complex, but share a common genetic basis in annual and perennial monkeyflower\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/06/06/complex-genetic-basis-of-constitutive-and-induced-herbivore-defense-in-monkeyflower/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nDespite multiple ecological and evolutionary hypotheses that predict patterns of phenotypic relationships between plant growth, reproduction and constitutive and/or induced resistance to herbivores, these hypotheses do not make any predictions about the underlying molecular genetic mechanisms that mediate these relationships.\n\nWe investigated how divergent plant life-history strategies in the yellow monkeyflower and a life-history altering locus, <i>DIV1</i>, influence plasticity of phytochemical herbivory resistance traits in response to attack by two herbivore species with different diet breadth.\n\nLife-history strategy (annual vs. perennial) and the <i>DIV1</i> locus significantly influenced levels of constitutive herbivory resistance, as well as resistance induction following both generalist and specialist herbivory. Perennial plants had higher total levels of univariate constitutive and induced defence than annuals, regardless of herbivore type. Annuals induced less in response to generalist herbivory than did perennials, while induction response was equivalent across the ecotypes for specialist herbivory.\n\nThe effects of the <i>DIV1</i> locus on levels of constitutive and induced defence were dependent on genetic background, the annual versus perennial haplotype of <i>DIV1</i> and herbivore identity. The patterns of univariate induction due to <i>DIV1</i> were non-additive and did not always match expectations based on patterns of divergence for annual/perennial parents. For example, perennial plants had higher levels of constitutive and induced defence than did annuals, but when the annual <i>DIV1</i> was present in the perennial genetic background induction response to herbivory was higher than for the perennial parent lines.\n\nPatterns for multivariate defence arsenals generally echoed those of univariate, with annual and perennial monkeyflowers and those with alternative versions of <i>DIV1</i> differing significantly in constitutive and induced resistance. Like univariate resistance, induced multivariate defence arsenals were affected by herbivore identity.\n\nOur results highlight the complexity of the genetic mechanisms underlying plastic response to herbivory. While a genetic locus underlying substantial phenotypic variation in life-history strategy and constitutive defence also influences defence plasticity, the induction response also depends on genetic background. This result demonstrates the potential for some degree of evolutionary independence between constitutive and induced defence, or induced defence and life-history strategy, in monkeyflowers.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/06/06/complex-genetic-basis-of-constitutive-and-induced-herbivore-defense-in-monkeyflower/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Megan L. Blanchard, \nDavid B. Lowry, \nLiza M. Holeski","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"9df8cb541447ab4325c60af5397676a2b440a5ac5cd930bc42342db8244fa78d","category":"Environment"}