{"title":"Garmin Vivoactive 5 In-Depth Review: Now With An AMOLED Display!","link":"https://www.dcrainmaker.com/2023/09/garmin-vivoactive-5-in-depth-review-now-with-an-amoled-display.html","date":1695207600000,"content":"<p></p>\n<p>To the surprise of many, Garmin has just announced the Vivoactive 5 – which is essentially a mini-Venu 3 (both in price and features). Garmin has killed off the MIP-based display of the previous Vivoactive series, instead adopting a more modern AMOLED display. With it, the device got a massive overhaul – both inside and out, making it look almost nothing like the previous Vivoactive series.</p>\n<p>Garmin’s added literally more features than I can keep track of, but at the same time, they took some away too. While the new device boasts a number of new sport profiles (including openwater swimming), as well as virtually all of Garmin’s newer 24×7 health and sleep tracking metrics – it loses the barometric altimeter of the past. And without that, we see a few other cuts as well. Whether or not you appreciate the gains (or cuts) will depend mostly on how much you want to pay for the features.</p>\n<p>Both my wife and I have been testing the new watch, across our workouts. This includes everything from more normal daily workouts, to 4-hour long rides, long runs, swims, and plenty more – all compared to numerous other devices on the market.</p>\n<p>As usual, this watch is a media loaner, and it’ll go back to Garmin shortly. After which, I’ll go out and get my own for any future testing needs.  If you found this review useful, you can use the links at the bottom, or consider becoming a <a href=\"https://www.dcrainmaker.com/support\">DCR Supporter</a> which makes the site ad-free, while also getting access to a mostly weekly video series behind the scenes of the DCR Cave. And of course, it makes you awesome.</p>\n<p>With that, let’s get into it.</p>\n<h3><span>What’s New:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8243.jpg\"><img title=\"DSC_8243\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8243_thumb.jpg\" alt=\"DSC_8243\" width=\"720\" height=\"480\" /></a></p>\n<p>The Garmin Vivoactive 5 is probably best looked at through the lens of a slightly cut-down Garmin Venu 3. And frankly, if I had my way, I’d just call it the Venu 3 Lite or something. Gone is the differentiation of display type that used to separate Vivoactive (MIP) vs Venu (AMOLED), and instead the differentiation is mostly features, with a touch of hardware differences. Still, when comparing it against the previous Vivoactive 4, the differences are massive – and frankly, it’s near impossible as so much has changed in 4 years, especially compared to that watch, as it rarely received meaningful updates.</p>\n<p>So instead, here’s all of the big-ticket new items:</p>\n<p>– Changed display type from MIP to a 1.2” AMOLED<br />\n– Switched back to a single size, 42mm<br />\n– Added Sleep Coach feature, including sleep recommendation factors<br />\n– Added Nap detection support (new to Garmin, finally!)<br />\n– Added HRV tracking support (at night)<br />\n– Added Morning Report feature<br />\n– Added Daily Summary report feature (new to Garmin)<br />\n– Added Recovery Time (for sports)<br />\n– Added Workout Benefit feature (tells you what the benefit of a given workout was)<br />\n– Added on-watch interval workout creation (plus existing downloadable structured workout support)<br />\n– Added eBike sensor support (ANT+)<br />\n– Added support for tracking Wheelchair pushes, as well as wheelchair sport-specific workouts<br />\n– Added ‘Recents’ quick switching between widgets<br />\n– Added more new live watch faces<br />\n– Added a number of new sport profiles (openwater swim, handcycle, etc – listed below)<br />\n– Added new guided Meditation Activity<br />\n– Added muscle map feature in strength workouts<br />\n– Expanded ‘Shortcuts’ feature<br />\n– Added ability to switch between small fonts and larger fonts for text<br />\n– Added quick-access Flashlight feature (using screen, not dedicated LED flashlight)<br />\n– Added photos in text messages (Android only)<br />\n– Revamped user interface in a massive number of different ways<br />\n– Upgraded from Garmin ELEVATE V3 HR sensor to ELEVATE V4 HR sensor (but V5 is latest)<br />\n– Switched GPS sensor to multi-GNSS (but not multi-band)<br />\n– Battery life is 11 days in smartwatch mode<br />\n– GPS battery life up to 21 hours, depending on mode.<br />\n– Price at $299<br />\n– Removed barometric altimeter<br />\n– Removed floors counted (stairs) metric<br />\n– Reduced functionality in skiing/snowboarding modes (no longer automatically counts runs)<br />\n– Removed workout animations in strength/yoga/etc (but added muscle maps, per above)</p>\n<p>Here’s the battery chart:</p>\n<blockquote><p>Smartwatch mode: Up to 11 days (5 days display always-on)<br />\nBattery Saver Smartwatch mode: Up to 21 days<br />\nGPS-Only GNSS mode: Up to 21 hours<br />\nAll-Systems GNSS mode: Up to 17 hours<br />\nAll-Systems GNSS mode with music: Up to 8 hours</p></blockquote>\n<p>Now, what about compared to the Venu 3 series? Well, that’s where things get a bit more messy. Here’s the core differences:</p>\n<p>– Venu 3 has newer Garmin ELEVATE V5 optical HR sensor, Vivoactive 5 has V4 sensor<br />\n– Venu 3’s new V5 HR sensor is hardware-capable of ECG (if Garmin turns it on), the Vivoactive 5 is not<br />\n– Venu 3 has a microphone and normal speaker for voice calls, Vivoactive 5 has beeper only<br />\n– Venu 3 has a barometric altimeter for stair tracking and outside altitude/elevation, Vivoactive 5 does not<br />\n– Venu 3 has three buttons, Vivoactive 5 has two<br />\n– Venu 3 has a larger 1.2”/1.4” display vs the Vivoactive 5 at only one size of 1.2”<br />\n– Venu 3 is offered in two sizes (41mm/45mm), vs Vivoactive 5 in one size (42mm)<br />\n– Venu 3 has Jetlag Advisor, the Vivoactive 5 does not<br />\n– Venu 3 has on-screen workout animations (e.g., yoga/strength movements), the Vivoactive 5 does not<br />\n– Venu 3 has automated downhill ski run tracking, the Vivoactive 5 does not.<br />\n– Venu 3 smartwatch battery life of 14 days (10 days for Venu 3S), Vivoactive 5 battery life up to 11 days<br />\n– Venu 3 GPS battery life of up to 26 hours (21 hours for Venu 3S), Vivoactive 5 GPS battery life is 21 hour<br />\n– Venu 3 has stainless steel bezel, Vivoactive 5 is aluminum<br />\n– Venu 3 is priced at $449, Vivoactive 5 at $299</p>\n<p>There are undoubtedly numerous other tiny features I haven’t quite been able to surface yet, but those are the big-ticket ones. With that, let’s start diving into using it.</p>\n<h3><span>The Basics:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8081.jpg\"><img title=\"DSC_8081\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8081_thumb.jpg\" alt=\"DSC_8081\" width=\"720\" height=\"480\" /></a></p>\n<p>This section is all about the day-to-day usage of the watch, focusing mostly on the health/fitness daily tracking aspects, as well as just general tidbits like the touchscreen display, buttons, and hardware components.</p>\n<p>To begin, the watch includes two buttons on it (compared with three on the Venu 3 series, and five on most other Garmin watches). This means that on the Vivoactive series you tend to rely more on the touchscreen for your actions. Nonetheless, it mostly works out and is akin to an Apple Watch, which also just has two buttons. Still, there are some functions that are reserved for the buttons – like starting/stopping a workout, and using the lap feature.</p>\n<p>Roughly speaking, the buttons perform the following tasks:</p>\n<p><strong>Upper right:</strong> Quick tap for sports menu, long-hold for quick-access customizable controls menu<br />\n<strong>Lower right:</strong> Quick tap acts as ‘back/escape’, long-hold for Settings</p>\n<p>You can also swipe right to get to the new ‘Recents’ menu, accessing your most recently used widgets. It’s interesting to see the different ways Garmin implements this new feature on different watches. For the Fenix 7/Epix series, it’s long-hold of the lower right button. For Venu 5 it’s quick tap of the middle right button. For Vivoactive 5, it’s a swipe right. For the Instinct series, it’s merely a dream in your head – it doesn’t exist there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8257.jpg\"><img title=\"DSC_8257\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8257_thumb.jpg\" alt=\"DSC_8257\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8256.jpg\"><img title=\"DSC_8256\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8256_thumb.jpg\" alt=\"DSC_8256\" width=\"355\" height=\"237\" /></a></p>\n<p>That said, the entire swipe-right function is actually customizable as a ‘Shortcut’ feature. You can customize it to be anything from the Flashlight, to the Wallet, to a given widget (e.g., steps), timers, and so on. Garmin says that the goal of this shortcut feature is to get quicker access to things in the controls menu. And while that’s good, it has meant that the Controls menu (long-hold upper right) has seemingly lost some of its luster. Take for example, accessing the wallet or flashlight. If it’s not set as my one-and-only Shortcut feature, you actually can’t access it via Controls anymore. Nor customize it that way. Frankly, that makes zero sense. Just like it made zero sense on the Venu 3.</p>\n<p>In any case, as for the flashlight, that’s here too. This is a virtual flashlight, and has three levels of white brightness, and one level of red brightness. While it’s not quite as bright/directed as Garmin’s Instinct/Epix/Fenix watches that have actual flashlights built into them, it’s perfectly functional for getting around in a strange hotel room in the middle of the night:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8087.jpg\"><img title=\"DSC_8087\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8087_thumb.jpg\" alt=\"DSC_8087\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8086.jpg\"><img title=\"DSC_8086\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8086_thumb.jpg\" alt=\"DSC_8086\" width=\"355\" height=\"237\" /></a></p>\n<p>As noted, you can set it as your swipe-right Shortcut, but I found that accidentally activates it too often. I really wish I could just activate this via the Controls menu instead (long-hold upper right).</p>\n<p>As for the touchscreen in general, it generally works well in dry scenarios, but like the Venu 3, it can struggle a bit in wet conditions. For example, on yesterday’s ride, it was dumping out. Getting the display to change data pages was a task (though equally, on the Apple Watch it took me nearly a minute to get it to finally accept a swipe to end the darn workout). The good news is that on the Garmin Vivoactive 5, that workout-ending task is done via button, rather than touch.</p>\n<p>In general though, I find you can just swipe off the water droplets and usually it’s fine. It’s just trickier when you’re wet and it’s wet, then it’s still basically water on water. Note that during swimming activities the touchscreen is disabled.</p>\n<p>From a visibility standpoint, I’ve had no problems seeing the display in either bright sunny periods, or dim-dreary days (like yesterday). While past AMOLED or LED displays (from many companies) have had visibility issues in bright sun, that’s simply not the case for almost all AMOLED displays released in the last year or two. And this includes the Vivoactive 5. Zero issues seeing it in bright sunny conditions. Note that taking photos/video of AMOLED displays with a black watch background in the sun is tricky, because all modern cameras will automatically expose/compensate for the rest of the scene, which tends to be very bright. Point being, don’t overthink photos you see out there. If you see a modern AMOLED display (Vivoactive 5, Apple Watch, Samsung Watch, etc…) in the sun that’s hard to read, then it’s just the photographer didn’t do it right. In real life, it’s perfectly visible.</p>\n<p>With that said, there is something to be aware of: On AMOLED displays, such as the Vivoactive 5, there are essentially three modes:</p>\n<p>1) On (with varying brightness levels)<br />\n2) Dimmed<br />\n3) Off</p>\n<p>For virtually everything in this review I leave things at the default levels. However, in this case I set my watch for the ‘Always-On’ display configuration, so that the watch face is always-on, but at a dimmed state. When I raise my wrist, the display goes to normal brightness. And then, when I put my wrist down, it returns to a dimmed state. You can still easily read the numbers in that dimmed state, but in bright sunlight it can be trickier (but just slightly twisting your wrist a few millimeters will wake it up, if you don’t want to raise your wrist). For most people, this becomes a subconscious motion pretty quickly. AMOLED displays are *FAR* easier to read in dark/dim/indoor conditions than historical MIP-based displays, as those require backlight in darker conditions to read.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8088.jpg\"><img title=\"DSC_8088\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8088_thumb.jpg\" alt=\"DSC_8088\" width=\"720\" height=\"480\" /></a></p>\n<p>The Vivoactive 5 claims 11 days of battery life in the default mode, but only 5 days in always-on mode. I’d say those battery estimates are on par with what I’m getting when accounting for the roughly 60-90 minutes of workouts (mostly GPS ones) per day, I was closer to about 4 days. So I’m perhaps burning a touch bit higher than that, because GPS time impacts battery life considerably. It’s worth noting the Vivoactive 5 also has a battery saver option as well, in case things get dicey and you need to squeeze a tiny bit more battery to get back to a charger:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8092.jpg\"><img title=\"DSC_8092\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8092_thumb.jpg\" alt=\"DSC_8092\" width=\"720\" height=\"480\" /></a></p>\n<p>From a watch face standpoint, the Vivoactive 5 has most (if not all) of the same watch faces as the Venu 3, including both static watch faces as well as ‘live’ watch faces. Further, you can grab boatloads more from the Garmin Connect IQ app store.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8096.jpg\"><img title=\"DSC_8096\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8096_thumb.jpg\" alt=\"DSC_8096\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8095.jpg\"><img title=\"DSC_8095\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8095_thumb.jpg\" alt=\"DSC_8095\" width=\"355\" height=\"237\" /></a></p>\n<p>As I said in the Venu 3 review, Garmin seems to artificially limit which data fields you can stick on these watch faces, especially compared to their higher-end units. For example, you have the HRV data widgets/fields available on the watch, but on the Vivoactive 3 you can’t put it as one of the watch face data fields (whereas you can on a Forerunner or Fenix). Same goes for Recovery Time (whereas I can add a quick-access option to turning on ANT+ Bike Lights, something I just can’t imagine has a huge overlap with the audience for this watch).</p>\n<p>In any case, swiping down from the watch face, you’ve got the widgets. These widgets have most of your health/fitness data, and are divided into two portions. The first is the so-called ‘Widget Glance’, which is basically the more key bit of that information. Whereas once you tap on it, you’ll get more detailed information and further data pages. All of these widgets are customizable in terms of which ones you see or don’t see. Here’s the initial widget glances:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8104.jpg\"><img title=\"DSC_8104\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8104_thumb.jpg\" alt=\"DSC_8104\" width=\"720\" height=\"480\" /></a></p>\n<p>And then I can, for example, tap on the steps one, to see more steps data:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8105.jpg\"><img title=\"DSC_8105\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8105_thumb.jpg\" alt=\"DSC_8105\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8106.jpg\"><img title=\"DSC_8106\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8106_thumb.jpg\" alt=\"DSC_8106\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8107.jpg\"><img title=\"DSC_8107\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8107_thumb.jpg\" alt=\"DSC_8107\" width=\"235\" height=\"157\" /></a></p>\n<p>All of this information (be it steps, sleep, or otherwise) is also available on Garmin Connect as well, via the smartphone app or website. Here’s an example of the same info on the steps page:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image001-1.png\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image001_thumb-1.png\" alt=\"clip_image001\" width=\"237\" height=\"511\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image0016-1.png\"><img title=\"clip_image001[6]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image0016_thumb-1.png\" alt=\"clip_image001[6]\" width=\"237\" height=\"511\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image0018-1.png\"><img title=\"clip_image001[8]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image0018_thumb-1.png\" alt=\"clip_image001[8]\" width=\"237\" height=\"511\" /></a></p>\n<p>Now many of those widgets depend either directly or indirectly on the optical heart rate sensor on the back. For example, not just 24×7 heart rate tracking, but metrics like breathing rate, stress, blood oxygen level, and sleep. There are further metrics that use portions of it – like recovery time. Here’s that optical heart rate sensor, which is Garmin’s slightly older generation Elevate V4. It’s somewhat weird to me that Garmin is introducing a new watch with a couple-year old sensor, when the Venu 3 and other new watches this summer got the new Elevate V5 sensor. As with most optical HR sensors, the green light will illuminate 24×7 when tracking, and will actually be stronger/brighter in workout modes to enable better accuracy.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8139.jpg\"><img title=\"DSC_8139\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8139_thumb.jpg\" alt=\"DSC_8139\" width=\"720\" height=\"480\" /></a></p>\n<p>Note that this watch hardware/sensor combination is not capable of ECG, not now, and not in the future. While as of this writing Garmin has only enabled ECG on the Venu 2 Plus, though it’s expected that you’ll see ECG enabled on Garmin ELEVATE V5 watches once Garmin finishes the regulatory process for that. Of course, Garmin can’t officially confirm or deny that piece, however, I can confirm the Vivoactive 5 definitely doesn’t have ECG hardware in it.</p>\n<p>In any event, for regular heart rate tracking, you’ll see that both on the watch, as well as later on afterwards in the app. The watch shows you your heart rate over the last little while (and you can scroll with your finger along that chart), while it also shows you your resting HR values too:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8111.jpg\"><img title=\"DSC_8111\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8111_thumb.jpg\" alt=\"DSC_8111\" width=\"355\" height=\"236\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8110.jpg\"><img title=\"DSC_8110\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8110_thumb.jpg\" alt=\"DSC_8110\" width=\"355\" height=\"236\" /></a></p>\n<p>Now, one of the big components that leverages the heart rate sensor is sleep tracking. And with that comes a bunch of new sleep-related features that launched a few weeks ago on the Venu 3, notably Sleep Coach and Nap tracking. To begin though, let’s start with the normal/existing sleep tracking. For that piece it’ll automatically track your sleep times, as well as estimated sleep phases/stages:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8125.jpg\"><img title=\"DSC_8125\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8125_thumb.jpg\" alt=\"DSC_8125\" width=\"176\" height=\"118\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8122.jpg\"><img title=\"DSC_8122\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8122_thumb.jpg\" alt=\"DSC_8122\" width=\"176\" height=\"118\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8123.jpg\"><img title=\"DSC_8123\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8123_thumb.jpg\" alt=\"DSC_8123\" width=\"176\" height=\"118\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8124.jpg\"><img title=\"DSC_8124\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8124_thumb.jpg\" alt=\"DSC_8124\" width=\"176\" height=\"118\" /></a></p>\n<p>In testing the Vivoactive 5 against both an Apple Watch as well as the Whoop 4.0 and Oura V3 ring sensors, I noticed the Vivoactive 5 seemed to show my ‘Fall Asleep’ time as earlier, almost as if listed as an ‘in bed’ time. Here’s an example from last night, showing how these devices handled:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/SleepNight1.png\"><img title=\"SleepNight1\" src=\"https://media.dcrainmaker.com/images/2023/09/SleepNight1_thumb.png\" alt=\"SleepNight1\" width=\"722\" height=\"107\" /></a></p>\n<p>Here’s another night where I pulled all the data from the different devices:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/SleepNight2.png\"><img title=\"SleepNight2\" src=\"https://media.dcrainmaker.com/images/2023/09/SleepNight2_thumb.png\" alt=\"SleepNight2\" width=\"722\" height=\"108\" /></a></p>\n<p>Note that I don’t do accuracy validation of the sleep phase/stage detection. The reason is simple: The technology to validate it simply isn’t all that accurate. Using prosumer devices like the Dreem headband will only have about an 80% accuracy rating, in a best-case scenario. And even so-called gold-standard clinical grade tracking isn’t much higher when accounting for scoring differences between the humans that score it. Thus, as a general rule of thumb, I presume all of this is incorrect, even if it’s sometimes correct.</p>\n<p>The challenge, of course, is that Garmin (and other companies) lean heavily on the deep/REM sleep portions when calculating various readiness or sleep scores. Thus, it’s sorta a double-edged sword.</p>\n<p>In any event, the first new piece here is the nap tracking. This will automatically track naps for you, though you can also somewhat manually force it by using the controls menu to enable sleep mode. But that’s not required. I did the hard work one day of ‘properly testing’ this feature by taking a nap. It got my falling asleep time within a minute or two, as well as my wakeup time.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image0017-1.jpg\"><img title=\"clip_image001[7]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image0017_thumb-1.jpg\" alt=\"clip_image001[7]\" width=\"720\" height=\"485\" /></a></p>\n<p>You’ll see this nap data in a few places. The first is in the Body Battery section, shown on your timeline as a little sleep icon. Then, as you swipe down, you’ll see it listed in a bunch of components/factors of your day (along with other pieces like workouts and restful time periods):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image001-2.jpg\"><img title=\"clip_image001\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image001_thumb-2.jpg\" alt=\"clip_image001\" width=\"355\" height=\"266\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image0015-1.jpg\"><img title=\"clip_image001[5]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image0015_thumb-1.jpg\" alt=\"clip_image001[5]\" width=\"355\" height=\"266\" /></a></p>\n<p>However, the second place you’ll see the nap data is within the new Sleep Coach feature. This feature aims to suggest how much you should try to sleep each night. It starts with a “personal baseline”, and then adjusts accordingly from there. However, it’ll never adjust to recommending more than 9 hours, nor less than 7 hours. Adding to that, your “personal baseline” is merely an age-graded scale. In my case, a 35-49 year old, the starting point is 7 hours and 50 minutes. And then each night it’ll adjust accordingly. You can see the widget details here:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8126.jpg\"><img title=\"DSC_8126\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8126_thumb.jpg\" alt=\"DSC_8126\" width=\"355\" height=\"239\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8127.jpg\"><img title=\"DSC_8127\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8127_thumb.jpg\" alt=\"DSC_8127\" width=\"355\" height=\"243\" /></a></p>\n<p>It’ll also say a bit more if you tap into it:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8128.jpg\"><img title=\"DSC_8128\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8128_thumb.jpg\" alt=\"DSC_8128\" width=\"720\" height=\"480\" /></a></p>\n<p>And then you can swipe down and see the “factors” that contribute to this, including that nap time:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8129.jpg\"><img title=\"DSC_8129\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8129_thumb.jpg\" alt=\"DSC_8129\" width=\"720\" height=\"480\" /></a></p>\n<p>If you tap on the nap, it’ll list details about it here too:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image0019-1.jpg\"><img title=\"clip_image001[9]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image0019_thumb-1.jpg\" alt=\"clip_image001[9]\" width=\"720\" height=\"479\" /></a></p>\n<p>I guess to me this seems pretty limited. Since my not-so-personal range is 7hrs 50 mins, and the min/max it’ll ever show is 7hrs to 9hrs, we’re basically talking about a feature that’ll fluctuate a mere 1-hour. It’s essentially going to tell me the same thing every day. It doesn’t really seem like there’s anything personal about it. It’s not looking at my years of past sleep data, or sleep HRV data, or sleep phase data, or really anything to figure out what might be best for me. It’s just telling me to sleep 7-9 hours.</p>\n<p>In any event, going to something that is cooler, is the HRV tracking. This is the same feature that’s been on Garmin’s higher-end devices over the past 16 months or so. Within the Garmin world, this will automatically track your heart rate variability levels each night while you sleep, but it does require 19 nights before it starts giving you the ‘Balanced’ type message below (it will immediately show you the exact values each night however).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8117.jpg\"><img title=\"DSC_8117\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8117_thumb.jpg\" alt=\"DSC_8117\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8118.jpg\"><img title=\"DSC_8118\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8118_thumb.jpg\" alt=\"DSC_8118\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8119.jpg\"><img title=\"DSC_8119\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8119_thumb.jpg\" alt=\"DSC_8119\" width=\"235\" height=\"157\" /></a></p>\n<p>Next, once you’ve woken up from all this sleep tracking, you’ll get your Morning Report. This too was introduced on various other Garmin devices over the past year, and it’s now finally arrived on the Vivoactive series. The Morning Report has quickly become the favored feature of many Garmin users, and is the first thing you’ll see when you wake up. It can show a customized list of different widgets, including your sleep, HRV status, calendar items, weather, and more. You can also shut it off if you don’t want it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8162.jpg\"><img title=\"DSC_8162\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8162_thumb.jpg\" alt=\"DSC_8162\" width=\"720\" height=\"480\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8165.jpg\"><img title=\"DSC_8165\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8165_thumb.jpg\" alt=\"DSC_8165\" width=\"355\" height=\"237\" /></a><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8162.jpg\"> </a><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8164.jpg\"><img title=\"DSC_8164\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8164_thumb.jpg\" alt=\"DSC_8164\" width=\"355\" height=\"237\" /></a></p>\n<p>Note that you don’t quite get as much customization as you would on a Forerunner or Fenix watch, mainly because those added features don’t exist. For example, you can’t see Daily Workout suggestions, as that doesn’t exist on the Vivoactive 5.</p>\n<p>Now, in addition to the morning summaries, there’s also the evening summary, officially known as “Daily Summary”, which shows 2 hours before your configured bedtime. This is basically a short recap of the day, albeit all it’s ever told me is that today was a ‘Workout Day’. Eventually I’ll have a non-workout day. Albeit, it never once showed for me, which is kinda odd. Note that, like Morning Report, these are optional features you can turn off if you want to. It’s located under Settings &gt; Notifications &amp; Alerts &gt; Health &amp; Wellness &gt; Daily Summary.</p>\n<p>Finally, the Vivoactive 5 displays smartphone notifications, as well as calendar notifications. Here’s an example of a smartphone notification:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8159.jpg\"><img title=\"DSC_8159\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8159_thumb.jpg\" alt=\"DSC_8159\" width=\"720\" height=\"480\" /></a></p>\n<p>Even more notable is that if on Android, you can both respond with text replies as well as see photos/images sent to your phone. Unfortunately, on iOS, Apple disallows responding to text messages from non-Apple watches, as well as disallows 3rd party devices from seeing photo data from text messages. Thus, Garmin’s hands are tied there.</p>\n<p>With that, let’s dig a bit deeper in the watch.</p>\n<h3><span>Sports Usage:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8232.jpg\"><img title=\"DSC_8232\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8232_thumb.jpg\" alt=\"DSC_8232\" width=\"720\" height=\"480\" /></a></p>\n<p>For most Garmin watches, the main appeal tends to be a blend of battery life and the advanced sports tracking capabilities. Now, while the Vivoactive 5 doesn’t have quite the same level of fancy sports bits as a Fenix or Forerunner watch, it does have far more than most of its competitors, both in terms of depth of those features as well as breadth of them. Where you’ll see differences though within Garmin’s lineup is that the Vivoactive/Venu series doesn’t tend to have the more advanced ‘Training Load’ and ‘Recovery’ type features. Sure, the Vivoactive 5 has Recovery Time metrics, but it lacks much of the more advanced recovery components or training load pieces like Acute Load, Training Status, Training Readiness, and more, found on the Forerunner/etc series.</p>\n<p>In any case, that high-level difference aside, let’s dive into it. To start a workout you’ll tap the upper right button, which accesses the newly redesigned Sports/Apps menu. This splits out non-sports apps (like the Timer or Wallet) into a new section called ‘Apps’, which is a welcome addition and makes tons of sense. Previously you had a bunch of random non-sports stuff in the sports menu. Now it’s got clear separation. I like it.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8231.jpg\"><img title=\"DSC_8231\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8231_thumb.jpg\" alt=\"DSC_8231\" width=\"720\" height=\"480\" /></a></p>\n<p>From here you can pick which sports you want, sort them, customize them, and generally make it your own – such as defining your favorites.</p>\n<p>Here’s the full list of sport modes available on the Vivoactive 5 at the moment. Garmin sport modes generally have very specific data metrics recorded with each profile, whereas most other companies tend to use it mostly just for slightly different calorie burn. For example, in SUP you’ll get stroke rate metrics. In Handcycling you’ll get push metrics. In Pool Swimming, you’ll get stroke rate and related, and so on. The full list:</p>\n<blockquote><p>Walk, Run, Bike, Strength, Cardio, Meditation, Bike Indoor, Breathwork, Disc Golf, Elliptical, eBike, Gaming, Golf, Handcycling, Handcycling Indoor, HIIT, Indoor Track, Open water, Padel, Pickleball, Pilates, Pool Swim, Row, Row Indoor, Ski, Snowboard, Snowshoe, Stair Stepper, SUP, Tennis, Treadmill, Walk Indoor, XC Classic Ski, Yoga</p></blockquote>\n<p>For comparison, here’s the additive sports not on the Vivoactive 5, but available on the higher-end Venu 3:</p>\n<blockquote><p>Bouldering, Climb Indoor, Floor Climb, and the Ski/Snowboard ones do proper automated run/descent calculation</p></blockquote>\n<p>Over time we sometimes see Garmin add new sports profiles in firmware updates (especially to the Forerunner/Fenix/Epix watches). However, the Venu/Vivoactive series has a pretty slim history of that happening, which is fairly disappointing. The most recent update for the Fenix 7/Epix saw 30+ new sport profiles added, and the also-$449 Forerunner 265 saw a dozen+ new sport profiles added.</p>\n<p>When it comes to sensors, the Vivoactive 5 supports both ANT+ and Bluetooth Smart sensors, but doesn’t get the new cycling power meter sensors or trainers that the Venu 3 just got. Instead, here’s the list of connected sensors that are supported:</p>\n<blockquote><p>Headphones (Bluetooth audio devices), Heart Rate Sensors, Speed/Cadence, eBike, Foot Pod, Tempe (Temperature), ANT+ Cycling Lights, Cycling Radar (ANT+), Golf Club sensors</p></blockquote>\n<p>This is kinda an interesting/quirky point for Garmin. Just two days ago, Apple released WatchOS 10, which includes support for cycling power meters on basically all Apple Watches made in the last 5 years. Additionally, last year Apple released running power support (and running efficiency metrics) for that same set of watches – including the Apple Watch SE series, priced at $249. Yet here, Garmin – the king of sport watches, offers neither on the $299 Vivoactive 5, nor even running power/efficiency metrics on the $449 Venu 3. But hey, we get Disc Golf.</p>\n<p>In any case, you can save sensors and rename them, as well as save multiple of the same sensor type. For example, if you had multiple bikes, or perhaps different heart rate straps.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8233.jpg\"><img title=\"DSC_8233\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8233_thumb.jpg\" alt=\"DSC_8233\" width=\"720\" height=\"480\" /></a></p>\n<p>Additionally, it’s worth noting that the Vivoactive 5 does broadcasting of your heart rate over ANT+ &amp; Bluetooth Smart to 3rd party apps/devices, such as Peloton or Zwift. Apple doesn’t do that natively, though some platforms (including Peloton) have apps that make it relatively seamless. Still, it’s a much appreciated feature on Garmin, and something I suspect we’re going to see others continue to adopt this fall.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8234.jpg\"><img title=\"DSC_8234\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8234_thumb.jpg\" alt=\"DSC_8234\" width=\"720\" height=\"480\" /></a></p>\n<p>Now, back to starting a sport/workout, you’ll choose the sport mode you want, and then you’ll be on a waiting screen. This screen shows the GPS and HR status, as well as any sensors you may have connected:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8235.jpg\"><img title=\"DSC_8235\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8235_thumb.jpg\" alt=\"DSC_8235\" width=\"720\" height=\"480\" /></a></p>\n<p>You can swipe down to load up a structured workout, create a one-off interval workout, or change any settings. It’s actually notable that Garmin has added one-off custom interval workouts to the watch. Previously you had to create the structured workout ahead of time on the app and then push it to the watch.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8236.jpg\"><img title=\"DSC_8236\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8236_thumb.jpg\" alt=\"DSC_8236\" width=\"720\" height=\"480\" /></a></p>\n<p>Now you can additionally just configure an interval workout on-watch:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8237.jpg\"><img title=\"DSC_8237\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8237_thumb.jpg\" alt=\"DSC_8237\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8238.jpg\"><img title=\"DSC_8238\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8238_thumb.jpg\" alt=\"DSC_8238\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8239.jpg\"><img title=\"DSC_8239\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8239_thumb.jpg\" alt=\"DSC_8239\" width=\"235\" height=\"157\" /></a></p>\n<p>In addition, in the Garmin Connect App, they’ve got plenty more training plans and workouts. There’s triathlon, running, and cycling plans, as well as nearly 100 different structured workouts for the gym.</p>\n<p>Back on the watch, down in those same pre-run settings, you can modify the data field configuration on the Vivoactive 5. This is true for any sport profile, and the Vivoactive 5 allows for three fully custom pages (each with up to four data fields each), as well as a heart rate zone gauge page (same as the Venu 3). This means you can configure your running pages differently than your cycling or yoga pages.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8240.jpg\"><img title=\"DSC_8240\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8240_thumb.jpg\" alt=\"DSC_8240\" width=\"720\" height=\"480\" /></a></p>\n<p>Further, you can also configure alerts for heart rate, run/walk, pace, time, distance, cadence, and calories. Which is different than auto-lap, which can be configured for a distance of your choosing, all the way down to 0.10 miles and up to 99.99 miles. Most of us probably just leave it on 1mi/1km. Or, simply turn it off altogether and manual lap instead (or do both). There’s also auto-pause and auto-scroll (which automatically iterates through your data pages).</p>\n<p>You can do all of these settings on the phone as well. Also, you can enable LiveTrack to automatically notify a predefined list of recipients every time you start a workout, which sends them an e-mailed link with your exact position and historical data for that workout (including heart rate/pace/speed/etc.). Note that the Vivoactive/Venu series doesn’t support preplanned routes/courses, so it doesn’t send them that.</p>\n<p>With all that set, you’ll finally run somewhere, ride somewhere, or whatever it is that you’re doing. In the process of that, you’ll see your workout stats on the screen in real-time. You can pause the workout by pressing the stop button (which will then give you a choice to resume or save). Fun tidbit: On one ride I put this on the handlebars, and the display stayed on the entire time. Occasionally it dimmed briefly, but usually some road bumps brought it back to full brightness.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/clip_image00111-1.jpg\"><img title=\"clip_image001[11]\" src=\"https://media.dcrainmaker.com/images/2023/09/clip_image00111_thumb-1.jpg\" alt=\"clip_image001[11]\" width=\"720\" height=\"480\" /></a></p>\n<p>And again, if doing a water-based workout, like a pool or openwater swim, the touch screen will be locked to prevent wonkiness.</p>\n<p>After you’ve finished suffering, you can end the workout and get a set of summary data pages. This includes the track outline, a bunch of stats on a per-metric basis, as well as summary stats. This is all much better than what Apple shows on-watch, and more in line with what Samsung shows on their watches. These have come a long way since the Vivoactive 4, and really start to leverage the AMOLED display.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8244.jpg\"><img title=\"DSC_8244\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8244_thumb.jpg\" alt=\"DSC_8244\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8245.jpg\"><img title=\"DSC_8245\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8245_thumb.jpg\" alt=\"DSC_8245\" width=\"235\" height=\"157\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8246.jpg\"><img title=\"DSC_8246\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8246_thumb.jpg\" alt=\"DSC_8246\" width=\"235\" height=\"157\" /></a></p>\n<p>There’s two new metrics here on the Vivoactive 5; first is the new ‘Training Benefit’ item, which shows you the value of that workout from a training standpoint time, as well as the new ‘Recovery Time’ metric. Recovery time has been on many other Garmin wearables for some time, but it’s nice to see it now on the Vivoactive series as well.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8248.jpg\"><img title=\"DSC_8248\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8248_thumb.jpg\" alt=\"DSC_8248\" width=\"720\" height=\"480\" /></a></p>\n<p>In addition, as always, you can see even more information on Garmin Connect afterwards. And, of course, it’ll also push all this data to 3rd party apps as well automatically, such as Strava or TrainingPeaks, assuming you’ve configured that.</p>\n<p>Lastly, it’s worthwhile noting there are other sport types that have more advanced functionality. This is especially notable in the strength training and yoga realm. These will show which exact muscle groups are being used. To see this, you can either create your own structured workout from Garmin Connect (the app), or use one of the ones built-in. Here’s an example of one of the ones on the watch:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8250.jpg\"><img title=\"DSC_8250\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8250_thumb.jpg\" alt=\"DSC_8250\" width=\"355\" height=\"237\" /></a> <a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8251.jpg\"><img title=\"DSC_8251\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8251_thumb.jpg\" alt=\"DSC_8251\" width=\"355\" height=\"237\" /></a></p>\n<p>Note that the Vivoactive 5 no longer shows you the actual animations for each workout component, whereas the Vivoactive 4 did (and the Venu 3 does). In fact, it was the <a href=\"https://www.dcrainmaker.com/2019/09/garmins-vivoactive-4-series-everything-you-need-to-know.html\">Vivoactive 4 back in 2019</a> that originally introduced it to the Garmin lineup, thus it’s kinda strange it gets removed here to upsell the higher-end Venu series.</p>\n<h3><span>Accuracy:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8252.jpg\"><img title=\"DSC_8252\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8252_thumb.jpg\" alt=\"DSC_8252\" width=\"720\" height=\"480\" /></a></p>\n<p>In this section we’ll evaluate the accuracy of both the GPS/GNSS tracks, as well as the optical heart rate sensor. Of course, this optical heart rate sensor (Garmin ELEVATE V4) has been around the block a number of years, so it’s pretty well understood (both good and bad). But equally, each watch can be different in terms of how it’s implemented. Meanwhile, the GNSS/GPS isn’t unique either, though as noted earlier on, it lacks multiband found in some of Garmin’s other watches at the same price point. Typically multiband (aka dual-frequency GNSS) delivers better results. Whereas Garmin has “multi-GNSS”, which is yet another GPS term to keep track of, but not at all the same as multi-band/dual-band/dual-frequency (all the same thing).</p>\n<p>However, as I’ve said many times since dual-frequency GPS started appearing in watches: I don’t care how a company gets accurate results, as long as they do. As we’ve seen with both Polar and COROS’s dual-frequency/multiband implementations, those actually perform worse than Garmin’s recent not-multiband implementations. Likely because Garmin is seemingly using the exact same chipset on both, but only seemingly has the required dual-frequency antenna pieces on some of the units. In fact, we’ll see that again here too – comparing them head to head.</p>\n<p>For all these tests, I’ve got multiple other recording devices and sensors. As always, no two watches are on the same wrist, so as to not interfere with each other from a heart rate standpoint. Extra watches are either worn elsewhere on the body (like the hand if for GPS, but not HR), or on a bike (handlebars). Those watches not on the wrist are collecting heart rate data from connected HR sensors/straps.</p>\n<p>First up, we’ve got a relatively stable 15-mile run my wife did, here you can see it against the multi-band Fenix 7S Pro. She didn’t have a 3rd or 4th GPS on this run to settle any differences, though frankly you don’t need it. The two tracks are <a href=\"https://analyze.dcrainmaker.com/#/public/330416c0-64e8-43be-6b9b-c86bab006bff\">virtually identical the entire time</a>, with nothing throwing them.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-GPSWide.png\"><img title=\"VA5-LongRun-GPSWide\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-GPSWide_thumb.png\" alt=\"VA5-LongRun-GPSWide\" width=\"722\" height=\"353\" /></a></p>\n<p>You can see this easily when zoomed in, very solid performance.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-GPSCloseUp.png\"><img title=\"VA5-LongRun-GPSCloseUp\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-GPSCloseUp_thumb.png\" alt=\"VA5-LongRun-GPSCloseUp\" width=\"722\" height=\"261\" /></a></p>\n<p>Next, we’re gonna increase difficulty substantially on the GPS front, by going into the city for testing. This downtown business district is where I punish all GPS watches. For the moment I’ll leave this map as just two GPS tracks, but a bit later today I’ll update it with the results from more GPS units, including some multi-band units.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-GPSWide.png\"><img title=\"VA5-CityRun-GPSWide\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-GPSWide_thumb.png\" alt=\"VA5-CityRun-GPSWide\" width=\"722\" height=\"258\" /></a></p>\n<p>Still, you can see the differences here a bit between the multi-band Epix Pro and the Vivoactive 5, yet, the Vivoactive 5 does reasonably well for this section. Especially in light of the other GPS units that give it a go later today. It’s these sorts of really tough 20-30 story building scenarios that multiband tends to shine.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-GPSCloseUp.png\"><img title=\"VA5-CityRun-GPSCloseUp\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-GPSCloseUp_thumb.png\" alt=\"VA5-CityRun-GPSCloseUp\" width=\"722\" height=\"273\" /></a></p>\n<p>Next, we’ve got an outdoor ride. This is from a <a href=\"https://analyze.dcrainmaker.com/#/public/ded35256-c793-46c6-4c2b-22abd8e55abd\">4-hour ride my wife did</a>. At first glance everything looks pretty normal:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-Wide.png\"><img title=\"VA5-4hrRide-GPS-Wide\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-Wide_thumb.png\" alt=\"VA5-4hrRide-GPS-Wide\" width=\"722\" height=\"386\" /></a></p>\n<p>Except what was abnormal is she decided to burn about 3 hours of that at a small 2KM cycling-only looped track (that meanders through the woods). We’re talking insane numbers of loops here on the same chunk of pavement:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-Medium.png\"><img title=\"VA5-4hrRide-GPS-Medium\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-Medium_thumb.png\" alt=\"VA5-4hrRide-GPS-Medium\" width=\"722\" height=\"444\" /></a></p>\n<p>In counting them up, it looks like about 40-45 loops she did here before she meandered elsewhere. Yet, the GPS tracks are virtually identical, all on the pavement. Usually with numerous loops like this you see a couple of odd ducks, but this is spot on (from all units):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-CloseUp.png\"><img title=\"VA5-4hrRide-GPS-CloseUp\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-GPS-CloseUp_thumb.png\" alt=\"VA5-4hrRide-GPS-CloseUp\" width=\"722\" height=\"278\" /></a></p>\n<p>Then we’ve got an openwater swim. In this case it’s up against the Fenix 7S Pro on one wrist (in multiband configuration), and then of course the swim buoy reference. We can see here it sails through this – even despite the relatively choppy waters on this day:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-OWS-GPS.png\"><img title=\"VA5-OWS-GPS\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-OWS-GPS_thumb.png\" alt=\"VA5-OWS-GPS\" width=\"722\" height=\"350\" /></a></p>\n<p>Switching over to heart rate, let’s look at a few different things. First, we’ve got my wife’s 2.5-hour long run, again against just her Fenix 7S Pro. While this is a relatively stable run, we see virtually no differences between the two. Normally I’d have a HR strap in my data sets, but I figured folks would find this interesting nonetheless.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-HR.png\"><img title=\"VA5-LongRun-HR\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-LongRun-HR_thumb.png\" alt=\"VA5-LongRun-HR\" width=\"722\" height=\"186\" /></a></p>\n<p>Next, we’ve got an interval run workout I did on a treadmill. Here compared to the chest strap and Whoop 4.0, we see the Vivoactive 5 nail this. Very solid.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-Peloton-HR.png\"><img title=\"VA5-Peloton-HR\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-Peloton-HR_thumb.png\" alt=\"VA5-Peloton-HR\" width=\"722\" height=\"167\" /></a></p>\n<p>Then we’ve got some shorter every-kilometer sprints I did during the city run test. Here we see a little bit of fumbling on the 3rd interval, but it seems to recover well after that, and didn’t entirely miss it. I’ve seen far worse. It’s these sorta of things you see the newer Garmin ELEVATE V5 often edge out the older V4 sensor.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-HR.png\"><img title=\"VA5-CityRun-HR\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-CityRun-HR_thumb.png\" alt=\"VA5-CityRun-HR\" width=\"722\" height=\"167\" /></a></p>\n<p>Then we’ve got my wife’s 4-hour long ride, compared to a chest strap as well as her Fenix 7S Pro. This is actually a surprising result, as it’s incredibly accurate, with only a few seconds where it has a blip or two. Often outside cycling is challenging for optical HR sensors, but this performs very well.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-HR.png\"><img title=\"VA5-4hrRide-HR\" src=\"https://media.dcrainmaker.com/images/2023/09/VA5-4hrRide-HR_thumb.png\" alt=\"VA5-4hrRide-HR\" width=\"722\" height=\"175\" /></a></p>\n<p>Overall, with these sets, as well as other equally boring sets from both myself and my wife, I’m not seeing anything of concern in the GPS or heart rate departments. In fact, frankly, the GPS here is easily outperforming other brand’s multi-band configurations (more on that later).</p>\n<p>Additionally, from a heart rate during workout standpoint, it’s largely matching the HR performance of newer HR sensors. Every once in a while you see a tiny blip for a few seconds on the heart rate side, but there’s no major or prolonged errors to be concerned about.</p>\n<p><em>(Note: All of the charts in these accuracy sections were created using the DCR Analyzer tool.  It allows you to compare power meters/trainers, heart rate, cadence, speed/pace, GPS tracks, and plenty more. You can use it as well for your own gadget comparisons, </em><a href=\"http://www.dcrainmaker.com/analyzer\"><em>more details here</em></a><em>.)</em></p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/09/DSC_8255.jpg\"><img title=\"DSC_8255\" src=\"https://media.dcrainmaker.com/images/2023/09/DSC_8255_thumb.jpg\" alt=\"DSC_8255\" width=\"720\" height=\"480\" /></a></p>\n<p>When I look at the Vivoactive 5, I view it through two different lenses. First, there’s the component of whether or not this watch does a good job, relative to the specs it lists, and the price it has. In that case, unquestionably, yes, it’s a very solid little watch for $299. It did virtually everything I asked of it, and did it reasonably well. In other words, ignoring the rest of the Garmin landscape for a second, this watch understood the assignment. Well done.</p>\n<p>The challenge is how to view this unit against the rest of the umpteen different Garmin watch brands and models. I’m just not sure the Vivoactive lineup needed to live on, especially after a switch to AMOLED, and even more so, after removing a number of the Vivoactive 4 features (like the barometric altimeter). Of course, Garmin absolutely needs a sub-$300 AMOLED unit to compete with Apple, Samsung, Fitbit, and others. No question. But I’m not sure if they needed to cut all the features they did, especially around the altimeter (which kills off stair tracking too). After all, the Venu 3 for $150 more still would have had the calling features, the newer heart rate sensor that’s hardware capable of ECG (down the road), and a bigger screen. Not to mention cycling power meter support and more.</p>\n<p>I got an e-mail just a few hours ago from a reader trying to decode Garmin’s mid-range watch lineup. It’s a labyrinth of options for a consumer that often doesn’t want that many choices. In this price bucket, Garmin has the Venu Sq 2, Venu 3, Venu 3S, Vivoactive 5, Forerunner 265, Forerunner 255, Instinct series, and more. And that even ignores things like golf watches, which have considerable overlap here too. This new Vivoactive 5 will probably be what they want – but since they’re coming from an older Venu watch, they’re going to have to make some sacrifices potentially. And when you compare Garmin’s sprawling lineup to their competitors, the answers become more and more complicated and nuanced.</p>\n<p>In any event, I think the Vivoactive 5 is a great little watch at a solid price point, but I think it’s also another example of where a bit of restraint in watch brand lineups might serve Garmin better, or at least minimize complexity for people wanting to choose their watches.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"9dfa7f130fdb5481ff44240a6af354c87c45687ca2cc7bdf106db4909cdb6af1","category":"Cycling"}