{"title":"Differential Effects of High-Energy Diet Consumption on Body Composition, Gut Microbiota, and Inflammatory Markers in Male and Female Rats","link":"https://www.preprints.org/manuscript/202410.0118/v1","date":1727859262000,"content":"Background/Objectives: Consumption of a high energy density diet (HED) leads to increased body weight and fat mass, gut dysbiosis, and obesity. The aim of this study was to characterize the initial response to HED consumption, as well as identify any sex differences, on body composition, systemic inflammation, gut microbiome, and fecal fat excretion in rats. Methods: Male and female Sprague-Dawley rats were fed a low energy density (LED) for 10 days and then were switched to HED for four weeks. Food intake was measured twice a week, body weight and body composition were measured weekly. Serum samples were collected to measure inflammatory cytokines/chemokines. Fecal samples were collected for microbiome analysis and lipid content. Results: Both males and females experienced increases in body weight, fat mass and fecal fat excretion, while males were more susceptible to significant weight gain, particularly in the diet-induced obesity-prone (DIO-P) group. Males showed elevated TGF-β levels, while females exhibited increases in IP-10, RANTES, and FGFb. Changes in gut microbiota composition revealed a reduction in beneficial species like Bacteroides uniformis and Parabacteroides distasonis and an increase in species such as Akkermansia muciniphila. Sex differences in fat metabolism were shown in the greater fecal fat excretion observed in males. Conclusions: Our study demonstrates that short-term consumption of a high-energy diet elicits notable sex-specific differences in body weight, body composition, inflammatory markers, gut microbiota, and fat excretion in Sprague-Dawley rats. These findings underscore the importance of considering sex as a biological variable in studies of diet-induced obesity and its metabolic consequences.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9dfbae2044289092e1d1acf5cb5360af22e59d18818feefa8a5bbbc100e4b479","category":"Interdisciplinary"}