{"title":"Apple running ‘technology investigation’ ahead of potential smart glasses launch","link":"https://www.macworld.com/article/2248163/apple-technology-investigation-smart-glasses-launch.html","date":1708969590000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>The <a href=\"https://www.macworld.com/article/557878/apple-vision-pro-release-date-headset-specs-price.html\">Vision Pro</a> launch might have received something of a mixed reception, but Apple has no intention of slowing its assault on the wearables market. Next on the list? Maybe a <a href=\"https://www.macworld.com/article/2240636/missing-piece-apple-ecosystem-ring.html\">ring</a> or a set of smart glasses that would bring some of Vision Pro’s advantages to consumers at a fraction of the price.</p>\n\n\n\n<p>In the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2024-02-25/apple-ponders-making-new-wearables-ai-glasses-airpods-with-cameras-smart-ring-lt1kb7cd&amp;xcust=1-1-2248163-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">latest edition</a> of his Power On newsletter, Bloomberg reporter Mark Gurman discusses three wearables projects currently in what he describes as an exploratory phase of development down at Apple Park. The company is giving serious consideration to a smart ring and an upgraded version of the AirPods with cameras and AI features, but the smart glasses are the most intriguing item on the list.</p>\n\n\n\n<p>This is because, as appealing as Vision Pro is in many respects, it has several huge barriers to widespread adoption. It’s heavy, bulky, and has limited battery life, all factors that make owners unlikely to wear the device for long periods or outside. And it simply costs far too much for most of us to even contemplate a purchase.</p>\n\n\n\n<p>By contrast, smart glasses—a market Apple has never previously tried to enter, but which has been explored by Google and its Glass product among others—offers something smaller, lighter, and altogether less obtrusive. It’s also likely to cost a lot less than the full mixed-reality headset. Gurman says the glasses are “in an exploratory phase known as ‘technology investigation’ within Apple’s hardware engineering division” as well as other wearable projects including AirPods equipped with cameras.</p>\n\n\n\n<p>“The glasses,” Gurman explains, “could provide audio (so users don’t have to wear AirPods) and take advantage of AI and cameras to identify things in the surrounding world. The device also could act as a stepping stone toward Apple’s long-held dream: true augmented reality spectacles you can wear all day.” Vision Pro is seen by many as an early prototype for a device that’s worn all day and allow users to interact with the world in an entirely new way. However, it’s likely many years away.</p>\n\n\n\n<p>In other words, we’re not talking about a fully fledged vision of the future quite yet; indeed Gurman specifically says that augmented reality spectacles in the true sense—”ones that would meet Apple’s standards for visual quality, performance, battery life and size”—are several years from becoming reality. This would be something less ambitious, with a focus on simpler features like taking videos and giving voice commands.</p>\n\n\n\n<p>As Gurman explains in the usual leaker’s disclaimer, the smart glasses are just a theory for now and may never launch. But it’s clear that this is an area where Apple wants to bolster its portfolio, and build on the success of wearable products like the AirPods and Apple Watch.</p>\n\nApple Inc</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9e07d403446d5ba9ee300bff08ad54d63d4edc1cb1a474ea6952f87ec7901fbe","category":"Apple"}