{"title":"The dispersal potential of endangered plants versus non‐native garden escapees","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12319?af=R","date":1711522800000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/45fc39d0-a8b0-46ff-83d6-4fbd825e27fa/eso312319-toc-0001-m.png\" alt=\"The dispersal potential of endangered plants versus non-native garden escapees\" />\n<p>Given the enormous potential for human-mediated plant dispersal in our modern landscapes, and the tendency for this type of dispersal to favour species that thrive in human habitats, this research raised the question of whether we could use this potential to benefit our at-risk native flora by growing them in our habitats, such as gardens. I found that endangered native plant species have a dispersal ecology that is broadly comparable to that of non-native plants, which are known to frequently spread from managed green spaces. The key takeaway from this study for practitioners is that integrating at-risk native plant species into our green spaces could help to promote an essential aspect of species survival: dispersal.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nAmidst climate change, enhancing plant dispersal pathways is crucial for adapting ecosystems and preserving biodiversity. In our human-dominated landscapes, urban and rural green spaces, especially gardens, are promising conduits for plant dispersal. Non-native plants are known to benefit from these spaces, yet the potential benefits for at-risk native plants remain unclear.\n\nHere, I synthesized data on dispersal traits, comparing endangered native plants with non-endangered and non-native species in Germany. To make my analysis pertinent to understanding the potential role of gardens in aiding the dispersal of at-risk native plants, I further contrasted the dispersal ecology of garden-friendly endangered plants with non-native plants known to escape gardens. I analysed several traits including seed weight, terminal velocity, dispersal distance, germination rate, dispersal mode, seed structures and seedbank type.\n\nOverall, dispersal traits between native and non-native plants showed minor, but in some cases statistically significant differences. Endangered plants were more often wind-dispersed and more frequently had seed appendages conducive to a wider range of dispersal vectors. Conversely, non-native plants leaned more towards non-assisted local dispersal, heavier seeds and more persistent seed banks. Other traits were largely consistent across groups.\n\nThis research shows that endangered native plants possess a dispersal ecology similar to non-native species, which frequently spread from green spaces like gardens. Thus, integrating endangered flora into our green spaces could help to promote an essential aspect of species survival: dispersal.\n</p>","author":"Ingmar R. Staude","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"9e080da47e8dcc77aa8e764308af03a2eb67d0ce7640cd552074d7b93ba370a8","category":"Environment"}