{"title":"Combination Therapy in Hypertension: Renin-Angiotensin-Aldosterone System Inhibitor with a Diuretic or Calcium Channel Blocker","link":"https://www.preprints.org/manuscript/202402.0835/v3","date":1721859119000,"content":"Hypertension is a frequent risk factor for cardiovascular diseases and the prevalence rate is continuously rising. Multiple pathophysiological mechanisms are responsible for hypertension, necessitating a combination of drugs from different classes for best management. Combination therapy is five times more effective in decreasing blood pressure compared to escalating the dose of a single agent. As per the ACCOMPLISH trial analysis, coupling a renin-angiotensin system inhibitor with a calcium channel blocker is more effective than the combination of a renin-angiotensin system inhibitor with diuretics in reducing major cardiovascular events, cardiovascular-related mortality, and the progression of chronic kidney disease. The renin-angiotensin system can be suppressed by inhibiting the angiotensin-converting enzyme or angiotensin type 1 receptor (AT1R), resulting, in decreased vascular smooth muscle contraction, heart performance, and reduced aldosterone synthesis. Calcium channel blockers work by inhibiting L-type calcium channels, reducing heart performance via negative inotropic, chronotropic, and bathmotropic effects, along with reducing vascular smooth muscle contraction. Diuretics exert their antihypertensive impact by changing body fluid volume and electrolytes. Initially, hypertension treatment commences with a single medication but often, different classes of two or more antihypertensive medications are necessary for achieving the target blood pressure goal. Sometimes, for Resistant hypertension four different classes of antihypertensive medications are necessary to reach the target blood pressure goal.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e0d42a950710caa24189a4abf53f722d190d51dd68f33b72977bc0480e9d116","category":"Interdisciplinary"}