{"title":"Retrieval of the Crop Canopy Chlorophyll: Machine Learning vs. Radiative Transfer Model","link":"https://www.preprints.org/manuscript/202405.1002/v1","date":1715754440000,"content":"In recent years, the utilization of machine learning algorithms and advancements in Unmanned Aerial Vehicle (UAV) technology have marked significant shifts in remote sensing practices. In particular, the integration of machine learning with physical models and their application in UAV-satellite data fusion have emerged as two prominent approaches for estimating vegetation biochemistry. This study evaluates the performance of five machine learning regression algorithms (MLRAs) for mapping crop canopy chlorophyll at the Kellogg Biological Station (KBS) in Michigan, USA, across three scenarios: (1) application to Landsat 7, RapidEye, and PlanetScope satellite images; (2) application to UAV-satellite data fusion; and (3) integration with the PROSAIL radiative transfer model (hybrid methods PROSAIL + MLRAs). The results indicate that the majority of the five MLRAs utilized in UAV-satellite data fusion perform better than the five PROSAIL + MLRAs. The general trend suggests that the integration of satellite data with UAV-derived information, including the normalized difference red-edge index (NDRE), canopy height model, and leaf area index (LAI), significantly enhances the performance of MLRAs. The UAV-RapidEye dataset exhibits the highest coefficient of determination (R2) and the lowest root-mean-square errors (RMSE) when employing kernel ridge regression (KRR) and Gaussian processes regression (GPR) (R2 = 0.89 and 0.89 and RMSE = 8.99 µg/cm2 and 9.65 µg/cm2, respectively). Similar performance is closely observed for the UAV-Landsat and UAV-PlanetScope datasets (R2 = 0.86 and 0.87 for KRR, respectively). For the hybrid models, maximum performance is attained with Landsat data using KRR and GPR (R2 = 0.77 and 0.51 and RMSE = 33.10 µg/cm2 and 42.91 µg/cm2, respectively), followed by R2 = 0.75 and RMSE = 39.78 µg/cm2 for PlanetScope data upon integrating partial least squares regression (PLSR) into the hybrid model. Across all hybrid models, RapidEye data yielded the most stable performance, with R2 ranging from 0.45 to 0.71 and RMSE ranging from 19.16 µg/cm2 to 33.07 µg/cm2. The study highlights the importance of synergizing UAV and satellite data which enables effective monitoring of canopy chlorophyll in small agricultural lands.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e198396854ee62d06a171a5711b15c9bbe7e14908258ec2847cf91d0d5670b2","category":"Interdisciplinary"}