{"title":"Biogeographical Variation in Termite Distributions Alters Global Deadwood Decay","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13915?af=R","date":1726056857000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Termites are a crucial group of macroinvertebrates regulating rates of deadwood decomposition across tropical and subtropical regions. When examining global patterns of deadwood decay, termites are treated as a homogenous group. There exist key biogeographical differences in termite distribution. One such clear distinction is the distribution of fungus-growing termites (FGT, subfamily Macrotermitinae). Considering that climate will have shaped termite distribution and ecosystem processes, we evaluate the roles of termite distribution (presence of FGT) and climate (aridity) on global patterns in deadwood decay.</p>\n<h2>Location</h2>\n<p>Between 46° N-43° S and 175° E-85° W.</p>\n<h2>Time Period</h2>\n<p>Present (between 2016 and 2021).</p>\n<h2>Major Taxa Studied</h2>\n<p>Termites (Blattodea: Termitoidae).</p>\n<h2>Methods</h2>\n<p>We add salient data to an existing global dataset on deadwood decomposition, including new data from five existing sites and seven additional African sites. We analyse a dataset spanning six continents, 16 countries and 102 experimental sites. Firstly, we evaluate climatic differences (mean annual temperature, mean annual precipitation and mean annual aridity) between sites with and without FGT. Secondly, using aridity as a single comparative climate metric between sites that accounts for temperature and precipitation differences, we examine the interaction between FGT and aridity on global patterns of termite deadwood discovery and decay through multivariate logistic and linear regressions.</p>\n<h2>Results</h2>\n<p>Termite-driven decay and wood discovery increased with aridity; however, responses differed between FGT and NFGT sites. Wood discovery increased with aridity in FGT sites only, suggesting a greater role of FGT to deadwood decay in arid environments. On average, both termite discovery and decay of deadwood were approximately four times greater in regions with FGT compared with regions without FGT.</p>\n<h2>Main Conclusions</h2>\n<p>Termite discovery and decay of deadwood is climate dependent, and higher decay may be through greater discovery of deadwood in FGT sites. Inclusion of biogeographical differences in termite distribution could potentially alter current and future global estimates of deadwood turnover.</p>","author":"Stephanie J. Law, \nHabacuc Flores‐Moreno, \nCatherine L. Parr, \nStephen Adu‐Bredu, \nKatherine Bunney, \nWilliam K. Cornwell, \nFidèle Evouna Ondo, \nJeff R. Powell, \nGabriel W. Quansah, \nMark P. Robertson, \nAmy E. Zanne, \nPaul Eggleton","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"9e1fec9a3cb819f7673e624b37fae120b2e0050525bc8197b32bf0f0299a7692","category":"Environment"}