{"title":"The (missing) social aspect of the circular economy: a review of social scientific articles","link":"http://link.springer.com/10.1186/s42055-024-00083-w","date":1712102400000,"content":"<h3>Abstract</h3>\n                    <p>Academic research on the Circular Economy has been proliferating at an unprecedented pace during the last decade. However, scholarly work on the topic is dominated by a focus on hard scientific, technical and corporate/business management approaches, leaving the social sciences underrepresented in the relevant literature. This review article covers the current Anglophone social scientific research on the circular economy with special attention to waste. A total of 161 works aligning with the scope of this article were examined. These works were analysed in light of two questions: the reviewed studies’ knowledge interest and the dimension(s) of the CE they gave emphasis to. In result, the articles were charted along two axes: Instrumental/Technical (Quadrant I), Analytical/Technical (Quadrant II), Instrumental/Social (Quadrant III), and Analytical/Social (Quadrant IV). The findings of this review article demonstrate a strong thematic interest related to the circular economy in global, major issues of governance; transition and implementation; consumption and consumer behaviour; as well as the associated logic, concepts and definitions. A weaker thematic interest appeared in relation to the cultural, political and ethical dimensions of the circular economy, while critical engagements with and contestations of the model remain fairly rare. Moreover, the analysis revealed the relative absence of detailed empirical scholarship on the more-than-human relations and the micro-level, local everyday practices through which the circular economy becomes actualised. This review calls for the proliferation of such works currently situated in the margins of the circular economy literature. However, as is finally proposed, a balanced mapping of a circular economy transition would require an approach that would problematise levels, scales and dichotomies like ‘global’ and ‘local’ as categorical givens.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"9e278e855d9dbe121b29ad73ba9637f253c23237b53ad8c841971cdb5c4fc141","category":"Environment"}