{"title":"Genomic Data Characterize Reproductive Ecology Patterns in Michigan Invasive Red Swamp Crayfish (Procambarus clarkii)","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.70007?af=R","date":1726383600000,"content":"<h2>ABSTRACT</h2>\n<p>The establishment and spread of invasive species are directly related to intersexual interactions as dispersal and reproductive success are related to distribution, effective population size, and population growth. Accordingly, populations established by r-selected species are particularly difficult to suppress or eradicate. One such species, the red swamp crayfish (<i>Procambarus clarkii</i>) is established globally at considerable ecological and financial costs to natural and human communities. Here, we develop a single nucleotide polymorphism (SNP) loci panel for <i>P. clarkii</i> using restriction-associated DNA-sequencing data. We use the SNP panel to successfully genotype 1800 individuals at 930 SNPs in southeastern Michigan, USA. Genotypic data were used to reconstruct pedigrees, which enabled the characterization of <i>P. clarkii's</i> mating system and statistical tests for associations among environmental, demographic, and phenotypic predictors and adult reproductive success estimates. We identified juvenile cohorts using genotype-based pedigrees, body size, and sampling timing, which elucidated the breeding phenology of multiple introduced populations. We report a high prevalence of multiple paternity in each surveyed waterbody, indicating polyandry in this species. We highlight the use of newly developed rapid genomic assessment tools for monitoring population reproductive responses, effective population sizes, and dispersal during ongoing control efforts.</p>","author":"Nicole E. Adams, \nJared J. Homola, \nNicholas M. Sard, \nLucas R. Nathan, \nBrian M. Roth, \nJohn D. Robinson, \nKim T. Scribner","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"9e2daea6ef0d4d6b1563bed869ac7879eb6683b257d1f4bab189507127e8c3ec","category":"Environment"}