{"title":"Conspicuous chloroplast with light harvesting-photosystem I/II megacomplex in marine Prorocentrum cordatum","link":"https://academic.oup.com/plphys/article/195/1/306/7603414?rss=1","date":1707350400000,"content":"<span><div>Abstract</div>Marine photosynthetic (micro)organisms drive multiple biogeochemical cycles and display a large diversity. Among them, the bloom-forming, free-living dinoflagellate <span>Prorocentrum cordatum</span> CCMP 1329 (formerly <span>P. minimum</span>) stands out with its distinct cell biological features. Here, we obtained insights into the structural properties of the chloroplast and the photosynthetic machinery of <span>P. cordatum</span> using microscopic and proteogenomic approaches. High-resolution FIB/SEM analysis revealed a single large chloroplast (∼40% of total cell volume) with a continuous barrel-like structure, completely lining the inner face of the cell envelope and enclosing a single reticular mitochondrium, the Golgi apparatus, as well as diverse storage inclusions. Enriched thylakoid membrane fractions of <span>P. cordatum</span> were comparatively analyzed with those of the well-studied model-species Arabidopsis (<span>Arabidopsis thaliana</span>) using 2D BN DIGE. Strikingly, <span>P. cordatum</span> possessed a large photosystem-light harvesting megacomplex (&gt;1.5 MDa), which is dominated by photosystems I and II (PSI, PSII), chloroplast complex I, and chlorophyll <span>a</span>–<span>b</span> binding light harvesting complex proteins. This finding parallels the absence of grana in its chloroplast and distinguishes from the predominant separation of PSI and PSII complexes in <span>A. thaliana,</span> indicating a different mode of flux balancing. Except for the core elements of the ATP synthase and the cyt<span>b</span><sub>6</sub><span>f</span>-complex, the composition of the other complexes (PSI, PSII, and pigment-binding proteins, PBPs) of <span>P. cordatum</span> differed markedly from those of <span>A. thaliana</span>. Furthermore, a high number of PBPs was detected, accounting for a large share of the total proteomic data (∼65%) and potentially providing <span>P. cordatum</span> with flexible adaptation to changing light regimes.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"9e313dcb823c35dab7735018d59d0b45b60ce8e23b3aa90043ae8c67d4a26afb","category":"Environment"}