{"title":"The Untapped Potential of Hairy Root Cultures and Their Multiple Applications","link":"https://www.preprints.org/manuscript/202410.1240/v1","date":1729064453000,"content":"Plants are rich source of specialized metabolites, such as alkaloids, terpenes, phenolic acids, flavonoids, coumarins, and volatile oils, which provide various health benefits including anticancer, anti-inflammatory, antiaging, skin-altering and anti-diabetic properties. However, challenges such as low and inconsistent yields, environment and geographic factors, and species-specific production of some specialized metabolites limit the supply of raw plant material for the food, cosmetic or pharmaceutical industries. Therefore, biotechnological approaches using plant in vitro systems offer an appealing alternative for the production of biologically active metabolites. Among these, hairy root cultures induced by the Rhizobium rhizogenes have firmed up their position as “green cell factories” due to their genotypic and biosynthetic stability. Hairy roots are valuable platforms for producing high-value phytomolecules at low cost, are amenable to pathway engineering and can be scaled up in bioreactors making them attractive for commercialization. This review explores the potential of hairy roots for specialized metabolites biosynthesis focusing on biotechnology tools to enhance their production. Aspects of morphological peculiarities of hairy roots, the diversity of bioreactors design, and process intensification technologies for maximizing biosynthetic capacity, as well as examples of patented plant-derived (green-labeled) products produced through hairy root cultivation at lab and industrial scales are addressed and discussed.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e33517a69e4ad53da5a2a0a57e9035805fa2972cb4e4cd52e38eebc63c608d7","category":"Interdisciplinary"}