{"title":"Apple Tweaks New EU App Store Business Terms After Developer Feedback","link":"https://www.macrumors.com/2024/03/05/apple-tweaks-eu-app-store-business-terms/","date":1709664107000,"content":"With the launch of iOS 17.4, Apple's app ecosystem changes in the European Union have gone into effect. Apple today said that it made some last minute updates to its terms of service after receiving feedback from developers.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2024/01/App-Store-vs-EU-Feature-2.jpg\" width=\"2500\" height=\"1406\" />\r<br />\nTo distribute apps through an app marketplace, with a reduced fee to Apple, or with an alternative payment option, developers have to opt in to new business terms that accept the Core Technology Fee and other new pricing mandates. Apple did not initially provide a way for developers to try the new system and then opt back out if it does not work out, but now there is a one-time term swap option available in some circumstances.\r<br />\n\r<br />\nApple says that developers have a one-time option to terminate the new rule addendum [<a href=\"https://developer.apple.com/contact/request/download/alternate_eu_terms_addendum.pdf\">PDF</a>] and swap back to Apple's standard business terms, though there is a catch. Developers who want to change back cannot have distributed an app through an alternative app marketplace or have used an alternative payment processing method.<blockquote>You may terminate this Addendum without also terminating the Developer Agreement one time, provided You have never had an Application be an Alternative App Marketplace (EU), be distributed through an Alternative App Marketplace (EU), use Linking Out, or use Alternative Payment Processing.</blockquote>Opt-out will be available for developers who decided to continue to distribute their apps through the <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a> while adopting the Core Technology Fee and reduced commission option. The CTF is .50 euros per download after 1 million downloads, and the commission is 13 percent for small business owners and 20 percent for installs over 1 million (this includes the ‌App Store‌ payment processing fee).\r<br />\n\r<br />\nDevelopers who want to create an alternative app marketplace <a href=\"https://developer.apple.com/support/alternative-app-marketplace-in-the-eu/\">can now do so</a> without a stand-by letter of credit for €1,000,000, which would restrict marketplace creation to large companies. Developers who have been a member of good standing in the Apple Developer Program for two continuous years or more and have an app that had more than one million first annual installs in iOS in the EU in the prior calendar year can create a marketplace without the proof of funds.\r<br />\n\r<br />\nThere is also no longer a corporate entity requirement when signing up for new terms, so a large business can sign up at the developer account level rather than having to have each controlling membership approve the swap to the updated business terms.\r<br />\n\r<br />\nWith iOS 17.4 released, we should soon be seeing the first alternative app marketplaces launch. Developers are now free to adopt the new business terms, distribute their apps outside of the ‌App Store‌, and use third-party payments in their apps. Note that all of these changes are limited to developers and users in the European Union.<div>Tags: <a href=\"https://www.macrumors.com/guide/app-store/\">App Store</a>, <a href=\"https://www.macrumors.com/guide/apple-developer-program/\">Apple Developer Program</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2024/03/05/apple-tweaks-eu-app-store-business-terms/\">Apple Tweaks New EU App Store Business Terms After Developer Feedback</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-tweaks-new-eu-app-store-business-terms-after-developer-feedback.2421134/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9e387c59adcf3665c9711fb4dd3fd16122a3215f0c825ac9978a0d86a2f633f5","category":"Apple"}