{"title":"Taste and odor interactions after metabolic surgery","link":"https://academic.oup.com/chemse/article/doi/10.1093/chemse/bjae034/7760135?rss=1","date":1726617600000,"content":"<span><div>Abstract</div>Most patients report “taste” changes after undergoing metabolic surgeries. Yet, most studies that used validated sensory evaluation techniques, including ours, found no changes in perceived taste intensity from before to after surgery. However, we assessed participants with pure gustatory stimuli and after an overnight fast, which raises questions about whether patients’ self-reported “taste” changes are due to conflating changes in retronasal smell/“flavor” with taste changes or whether they only manifest during the fed state. To investigate this, we conducted a cross-sectional study comparing sensory responses in women who underwent metabolic surgery 2 to 6 yr ago (<span>n</span> = 15) with 2 nonoperated control groups: one with a body mass index (BMI) equivalent (<span>n</span> = 15) and one with a healthy BMI (<span>n</span> = 15). Participants attended 2 sessions, one fed and one fasted. Using a sip-and-spit method, women tasted liquid samples containing gustatory and olfactory stimuli and puddings with varying fat content with and without nose clips. They used separate general labeled magnitude scales to rate their perceived intensity of taste, smell, flavor, and liking. Mixed ANOVAs indicated that the surgery and BMI equivalent groups rated retronasal smell intensity of coffee stronger than the healthy BMI group (<span>P</span> ≤ 0.015). However, there were no differences in taste/flavor intensity or liking ratings among groups. Additionally, feeding conditions did not significantly affect perceived intensity ratings. Our findings suggest that changes in the sensory-discriminatory component of taste or taste–odor interactions are not significant contributors to dietary modifications following metabolic surgery.</span>","author":"","siteTitle":"Chemical Senses Current Issue","siteHash":"eaf999c97f18ab6d9732972032217d08ae5a0287f7a7d719a702f9f5727afa53","entryHash":"9e3d416fd119fb191de73a8d3e47be8a18ac8c8e6811bc65a205f75d18e04097","category":"Environment"}