{"title":"[Sponsor] Kolide — Zero Trust for Okta","link":"https://l.kolide.co/3JWbXEv","date":1687305358000,"content":"\n<p>Here’s an uncomfortable fact: at most companies, employees can download sensitive company data onto any device, keep it there forever, and never even know that they’re doing something wrong.</p>\n\n<p>Kolide’s new report, <a href=\"https://l.kolide.co/3I7025A\">The State of Sensitive Data</a>, shines a light on an area of security that is often ignored, but is nevertheless a massive hole in many companies’ Zero Trust fortress.</p>\n\n<p><img src=\"https://daringfireball.net/martini/images/kolide-survey-results.png\" width=\"600\" alt=\"Study results showing that companies have poor policies for requiring user authentication to access sensitive data (65%); prohibiting downloading sensitive data onto personal devices (46%); ensuring plain-text access credentions are not stored on employee devices (38%); setting a specified time period sensitive data can reside on an employee device (16%).\" /></p>\n\n<p>These findings are particularly alarming given the overall state of device security. IT teams routinely struggle to enforce timely OS updates and patch management, meaning that end users are storing your most sensitive data–things like customer records, confidential IP, and plain-text access credentials–on devices that are vulnerable to attack.</p>\n\n<p>This problem has gone unaddressed because until now there hasn’t been a good solution for it. <a href=\"https://l.kolide.co/3lch4WK\">MDM solutions are too blunt an instrument</a> for dealing with sensitive data, and <a href=\"https://l.kolide.co/3DTTpRA\">DLP tools are too extreme and invasive</a> for most companies. After all, you’re not trying to ban downloads together, nor regard every download as suspicious. You’re just trying to make sure employees aren’t keeping data for longer than they need or keeping it on an unmanaged or un-secure device.</p>\n\n<p>Kolide offers a more nuanced approach to setting and enforcing sensitive data policies. </p>\n\n<p><em>Our premise is simple: if an employee’s device is out of compliance, it can’t access your apps.</em></p>\n\n<p>Kolide lets admins run queries to detect sensitive data, flag devices that have violated policies, and enforce OS and browser updates so vulnerable devices aren’t accessing data.</p>\n\n<p>Our unique approach makes device compliance part of the authentication process. If a device isn’t compliant, users can’t log in to their cloud apps until they’ve fixed the problem. But instead of creating more work for IT, Kolide provides instructions so users can get unblocked on their own.</p>\n\n<p>To learn more and see our product in action, <a href=\"https://l.kolide.co/3XlSqAq\">visit kolide.com</a>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/feeds/sponsors/2023/06/kolide_zero_trust_for_okta_1\"> ★ </a>\n</div>\n\n\t","author":"Daring Fireball Department of Commerce","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9e40b33005205e3e821af2ac19a865933b5cb4b38eefaa9c464e8ca06e63c0cb","category":"Tech"}