{"title":"Nukeproof waterproof shorts, Ergon’s new hydration hip pack, Topeak’s latest digital pressure gauge and Fox’s new Float 34 suspension forks","link":"https://www.bikeradar.com/features/first-look-friday/nukeproof-waterproof-shorts/","date":1633068040000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/09/FotoJet-a26cef9.jpg?quality=45&amp;resize=620,413\" />                                            <p>This week, First Look Friday kicks off with a celebration as <a href=\"https://www.bikeradar.com/news/mbuk-400/\">Mountain Biking UK magazine just published its 400th issue</a> – massive congratulations to the team at MBUK on this impressive milestone!</p>\n<p>Inside this bumper issue, you’ll find an extended feature with the 50 MTB heroes who have thrilled and enthralled us all over the years, a Mint Sauce comic book from creator Jo Burt, and a massive subscriber competition where you can win nearly £900 of Muc-Off goodies. Grab a copy while you can!</p>\n<p>Back here on BikeRadar, Tom reviews the <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/ribble-ht-al-review/\">Ribble HT AL</a> for all you hardtail fans out there. In addition, Alex has compiled a buyer’s guide to <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">18 of the best dropper posts in 2021</a>, along with this review of the outlandish and revamped <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/pole-stamina-160-remastered-review/\">Pole Stamina 160</a>.</p>\n<p>The team also discussed carbon wheels and if they have a place in mountain biking on the <a href=\"https://www.bikeradar.com/news/bikeradar-podcast-carbon-fibre-wheels/\">Bike Radar podcast</a>. Give it a listen to find out our thoughts.</p>\n<p>It’s not all MTB news, though, as Warren checks out the latest <a href=\"https://www.bikeradar.com/news/2022-cervelo-r5/\">Cervélo R5 race bike</a> with an incredible claimed frame weight of just 703g. Also, Italian’s <a href=\"https://www.bikeradar.com/news/wilier-garda/\">Wilier release their latest Garda bike</a> with updates to keep it bang on-trend.</p>\n<p>Plus, Wahoo enter the indoor training market with a <a href=\"https://www.bikeradar.com/news/wahoo-systm/\">new online software programme called SYSTM</a>. Buiding on the infamous Sufferfest, this is claimed to be the most comprehensive training app out there.</p>\n<p>Furthermore, on the training theme, don’t miss out on<a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-plan-your-winter-training/\"> Tom Bell’s top five winter training tips</a>, so when spring rolls around, you’ll be in your best shape ever.</p>\n<h2><strong><span>Fox 34 Factory GRIP2 forks</span></strong></h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Fox’s 34 Factory GRIP2 forks are the brand’s top-spec 140mm travel trail bike fork.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>While these have been out for a while now, due to reasons we’re all familiar with now in the bike industry, it’s taken Fox a while to hunt a pair down for us to test. Still, here they are, and they will be joining our trail forks group test in the coming months.</p>\n<p>So, here’s a quick refresh about what’s new with the latest Fox 34 forks. With the introduction of the Fox 38, Fox reshuffled the travel options for their fork range, and the 34’s now top out at 140mm travel (shown here).</p>\n<p>The 34’s get Fox’s new chassis design, including the re-shaped lower leg arch that claims to shave the grams without affecting strength, stiffness, or on-trail handling. This pair weighs in at 1845g.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The chassis on the new Fox 34 forks has had an overhaul to shave weight and keep strength and stiffness.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>The lower legs also include a ‘bypass channel’, which serves two functions. Firstly, to allow air in the lower legs (not the EVOL spring) extra space when the fork compresses to alleviate the additional ramp-up that can happen. Secondly, it gives oil in the lower legs a path to help keep the bushings and foam rings lubricated.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Fox 34 Factory bypass channel helps prevent unwanted ‘ramp-up’ and keep bushings and foam rings lubricated.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>The 34 spans the three model ranges – the Factory, Performance Elite, and Performance. With the Factory version, you get the option of the GRIP2 or FIT4 damper and 130mm or 140mm travel. The Performance Elite uses the FIT4 and is limited to 130mm travel. Lastly, the Performance fork comes uses the simpler GRIP damper with 140mm travel.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Fox 34 Factory GRIP2 compression adjuster with low and high-speed adjustment.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>Fox’s 34 Factory here, with its GRIP2 damper, has high and low-speed compression and rebound damping featuring their patented VVC (Variable Valve Control) technology. The same damper is found in their 36, 38, and 40 forks. It also uses Fox’s EVOL air spring with a larger negative chamber to help with mid-stroke support.</p>\n<ul><li>Fox 34 Factory GRIP2 £1099</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Ergon BA Hip Pack</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Ergon’s BA Hip Pack is a 3-litre pack aimed at enduro, trail and gravel riders.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>This three-litre hip pack is aimed for the enduro, trail, or gravel crowd and features a host of pockets to stash your ride essentials for a good day out and even comes with a water bladder.</p>\n<p>The deep waist belt uses a non-slip lining to help keep the pack secure on the roughest trails. In addition, the foam padding helps airflow under the pack to keep you comfortable. You can even fine-tune the length of the Velcro waist strap, and it’s secured with an additional clip buckle.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The hip back features padding to help airflow and a non-slip lining to keep it secure.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>Storage-wise, the belt features two mesh pockets, one zipped and one elasticated with a Velcro closure, ideal for storing quick-access items. The internal storage has three zipped pockets, a storage sleeve and two small side pouches to help organise your kit.</p>\n<p>Its three-litre capacity has enough space for spares, snacks, a small jacket, or most things needed for an all-day ride. It can even hold a 1.5-litre bladder to carry extra water.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Ergon BA hip pack internal pockets offer enough space, and security to keep your essentials safe.</span></figcaption><span></span></div>\n<p>On the outside, a dial and cable system, similar to a Boa, will tighten to hold everything secure to stop things from rattling around inside while you’re riding, helping to keep the pack more stable.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> This Boa-style dial is there to squash down the contents to stop things rattling around when riding.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>It also has zipped away additional straps that allow you to strap extra gear to the outside of the pack. The material is weather and splashproof, so you don’t have to worry about your kit getting wet.</p>\n<ul><li>Ergon BA Hip Pack £79.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Nukeproof Blackline Winter Waterproof short</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> Nukeproof’s Blackline Winter Waterproof shorts should help keep you riding through the most miserable weather.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>With winter and wet weather just around the corner, we’ve got an upcoming test of waterproof shorts. These Nukeproof shorts stood out to us thanks to their additional internal gaiter that you can tighten up. We’re assuming this is to help stop water, splashes and puddles from spraying up your legs.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nukeproof’s Blackline Winter Waterproof shorts feature a gaiter that you can tighten up.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>Additionally, the Cordura Fabric feels durable, a plus for riding in muddy, gritty conditions, and comes with a 10,000mm2 waterproof and 10,000gsm breathability rating.</p>\n<p>There are two waterproof zip pockets, welded seams for added waterproof protection, a zip and popper fastener with Velcro adjustments and silicone grippers to help keep them in place when thick and heavy with mud.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> There’s plenty of scope for a tailored fit around the waist to hopefully keep them in place when caked in mud.</span></figcaption><span> <i>Luke Marshall/Immediate Media</i></span></div>\n<p>Bad weather should never stop riding, so we hope these can help us get out in the worst of it.</p>\n<ul><li>Nukeproof Blackline Winter Waterproof short £100</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h2>Topeak Smartgauge D2X</h2>\n<ul><li>\n    </li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> The new Topeak Smartgauge D2X is a digital pressure gauge that can work with Presta and Schrader values for tyres, forks and shocks.</span></figcaption><span> <i>Rob Weaver/Immediate Media</i></span></div>\n<p>Sometimes, the small things are the most important, and an accurate pressure gauge is undoubtedly used before every bike ride to ensure my pressures are precisely what I want.</p>\n<p>Topeak has just released its new Smartgauge DX2. This digital pressure gauge works with both Presta and Schrader valves without needing to change the head. Instead, simply press on to either valve.</p>\n<p>Claimed to measure and display pressures from 5 to 260psi (0.35 to 18bar) in a resolution of 0.1psi, Topeak says you can accurately measure tyre, fork and shock pressures. Also, the Smartgauge reads pressure continually during bleeding air from the gauge, so you accurately fine-tune your pressures without removing it.</p>\n<ul><li>Topeak Smartguage D2X £39.99</li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>","author":"Luke Marshall","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"9e483e42651db04b488efaa32c8a7ea9e35407261156dd5a0d0de23fe52565e5","category":"Cycling"}