{"title":"Universal Basic Income","link":"https://markpeak.net/universal-basic-income/","date":1616379185000,"content":"<p>ตามอ่านแนวคิดเรื่อง Universal Basic Income (UBI) มาได้สักพักใหญ่ๆ แล้วแต่ยังไม่ค่อยตกผลึกนัก ช่วงหลังมีการสนทนาเรื่อง UBI ในระดับโลกกันมากขึ้น และในไทยเองก็เริ่มมีการพูดถึงเรื่องนี้เช่นกัน</p>\n<p>ล่าสุดมีเคสของเมือง Stockton ในแคลิฟอร์เนีย ที่ทดลองจ่ายเงิน UBI ให้กลุ่มคนมีรายได้น้อยเป็นระยะเวลานาน 2 ปี และผลที่ได้ออกมาดี รายละเอียดดูได้จาก<a href=\"https://www.theatlantic.com/ideas/archive/2021/03/stocktons-basic-income-experiment-pays-off/618174/\">บทความใน The Atlantic</a></p>\n<div class=\" content_cards_card content_cards_domain_www-theatlantic-com\">\n\t\t\t<div class=\"content_cards_image\">\n\t\t\t\t<a class=\"content_cards_image_link\" href=\"https://www.theatlantic.com/ideas/archive/2021/03/stocktons-basic-income-experiment-pays-off/618174/\">\n\t\t\t\t\t<img src=\"https://cdn.theatlantic.com/thumbor/QO9vOrceRxpoLEaqxDPsBuw8bO0=/0x43:2000x1085/960x500/https://cdn.theatlantic.com/media/img/mt/2021/03/StocktonCA2/original.jpg\" alt=\"Stockton’s Basic-Income Experiment Pays Off\">\t\t\t\t</a>\n\t\t</div>\n\t\n\t<div class=\"content_cards_title\">\n\t\t<a class=\"content_cards_title_link\" href=\"https://www.theatlantic.com/ideas/archive/2021/03/stocktons-basic-income-experiment-pays-off/618174/\">\n\t\t\tStockton’s Basic-Income Experiment Pays Off\t\t</a>\n\t</div>\n\t<div class=\"content_cards_description\">\n\t\t<a class=\"content_cards_description_link\" href=\"https://www.theatlantic.com/ideas/archive/2021/03/stocktons-basic-income-experiment-pays-off/618174/\">\n\t\t\t<p>A new study of the city’s program that sent cash to struggling individuals finds dramatic changes.</p>\n\t\t</a>\n\t</div>\n\t<div class=\"content_cards_site_name\">\n\t\t<img src=\"https://cdn.theatlantic.com/_next/static/images/favicon-3888b0e329526a975703e3059a02b92d.ico\" alt=\"The Atlantic\" class=\"content_cards_favicon\"/>\t\tThe Atlantic\t</div>\n</div>\n<p>ผมคิดว่าเราสามารถ conceptualize แนวคิดและความจำเป็นของ UBI ออกมาเป็นหลักใหญ่ๆ ได้ดังนี้</p>\n<ul>\n<li>โลกยุคปัจจุบันมีปัญหาเรื่อง income equality มาก คนรุ่นปัจจุบันเป็นรุ่นแรกที่ &#8220;จน&#8221; กว่ารุ่นพ่อแม่ <a href=\"https://markpeak.net/economic-depression-of-new-generations/\">จนมีชีวิตที่ยากลำบากในทางเศรษฐกิจ</a> ชีวิตบีบคั้น มีเงินเดือนชนเดือน ห้ามเจ็บ ห้ามป่วย ห้ามมีอุบัติเหตุ ฯลฯ (นี่ยังไม่นับรวมปัจจัย COVID ที่มาทีหลังด้วยซ้ำ)</li>\n<li>เมื่อชีวิตมีความยากลำบากในทางเศรษฐกิจ ก็มีปัญหาอื่นตามมาอีกมาก เช่น หมดไฟ เป็นโรคซึมเศร้า เจ็บป่วย ความสามารถในการทำงานลดลง ฯลฯ มีผลกระทบต่อทั้งภาวะเศรษฐกิจและสังคมของประเทศ</li>\n<li>ดังนั้น เราจึงต้องมี safety net บางอย่างคอยเป็นที่ให้คนเหล่านี้มีหลังพิง\n<ul>\n<li>ในแง่สุขภาพกาย ประกันสุขภาพถ้วนหน้า (Universal Healthcare) ที่ประเทศไทยทำในยุค 30 บาท ก็พิสูจน์แล้วว่าได้ผลจริง</li>\n<li>ในแง่สุขภาพเศรษฐกิจ อันนี้ยังเป็นที่ถกเถียงในเรื่องแนวทาง การมีรัฐสวัสดิการ (welfare state) หรือสวัสดิการโดยรัฐ (เช่น รถเมล์ฟรี ค่าไฟฟรี) ก็เป็นทางออกหนึ่ง</li>\n</ul>\n</li>\n<li>แต่คำว่ารัฐสวัสดิการนั้นมีความหมายกว้าง ก็ต้องตีความกันว่าควรมีอะไรบ้าง ในอีกแง่หนึ่ง การที่รัฐเข้าไปบริหารจัดการบริการหรือโครงสร้างพื้นฐานเอง ก็มีปัญหาตามมาอีกหลายอย่าง ตั้งแต่ต้นน้ำอย่าง สวัสดิการนั้นตรงใจประชาชนจริงๆ หรือไม่ ไปจนถึงปัญหาปลายน้ำคือ คอร์รัปชันหรือความไม่มีประสิทธิภาพในการบริหารจัดการ</li>\n<li>UBI จึงเป็นวิธีคิดมุมกลับกัน คือ แทนที่รัฐจะเป็นผู้จัดสรรเงินงบประมาณ แล้วมา &#8220;เลือก&#8221; ให้ว่าควรมีสวัสดิการอะไรดี ก็เอาเงินงบประมาณเหล่านั้นมาจ่ายให้ประชาชนไปเป็นคนตัดสินใจ &#8220;เลือก&#8221; เอาเองเลยว่าอยากได้สวัสดิการอะไร</li>\n<li>มุมมองของ UBI จึงเป็นการเชื่อมั่นในประชาชนมากๆ ว่าโตเป็นผู้ใหญ่แล้ว มีความคิดของตัวเอง และมีสิทธิที่จะเลือกเอง (รัฐไม่เป็นคุณพ่อรู้ดีคิดให้) ประชาชนจะนำไปใช้หนี้ ไปซื้อหุ้น ซื้อเหล้าบุหรี่ ซื้อมือถือหรือรถกระบะ ก็สุดแล้วแต่ความต้องการของแต่ละคน</li>\n<li>แนวคิดแบบนี้จึงคล้ายๆ กับ &#8220;กองทุนหมู่บ้าน&#8221; ในอดีต ที่ให้เงินก้อนกับหมู่บ้านไปบริหารจัดการกันเอง (ซึ่งก็พิสูจน์แล้วว่าเวิร์คซะเป็นส่วนใหญ่ หนี้เสียน้อย) เพียงแต่รอบนี้ให้เป็นกองทุนส่วนบุคคล ให้เป็นรายบุคคลไปแทน</li>\n<li>ผลการทดลองของ Stockton ก็ค่อนข้างได้ผลออกมาดี คือ คนที่ได้เงินก็นำไปใช้อย่างเหมาะสม (ซึ่งคำว่าเหมาะสมก็ subjective อีกนั่นแหละ) แต่ที่ดีกว่านั้นคือ ไม่ว่าจะใช้เงินอย่างไรก็ตาม คนที่ได้เงินเหล่านี้มีชีวิตในเชิงบวกขึ้น มีความเครียดน้อยลง พอมีความเครียดน้อยลงก็มีเวลา มีพลังไปทำสิ่งที่สร้างสรรค์ ไปหางานที่ดีกว่าทำ ไปรักษาตัวให้หายป่วย ไปใช้หนี้ที่คั่งค้าง ฯลฯ</li>\n<li>ประเด็นหนึ่งที่คนเถียงกันเยอะเรื่อง UBI คือ &#8220;ได้เงินฟรีแล้วไม่ทำงาน&#8221; (แนวคิดเดียวกับ &#8220;จนเครียดกินเหล้า&#8221;) ซึ่งผลการทดลองของ Stockton ก็ยืนยันแล้วว่าไม่จริง กลับเป็นว่าพอยิ่งมีเงิน (สำรองก้นกระเป๋าให้อุ่นใจ) ยิ่งอยากออกไปทำงาน</li>\n</ul>\n<p>มาถึงตอนนี้แล้วก็เริ่มเชื่อมั่นว่า UBI มีข้อเสียมากกว่าข้อดี ยิ่งในโลกยุคนี้ที่ภาครัฐทำอะไรก็ช้าไปหมดเมื่อเทียบกับความเร็วของโลกเอกชน และคนก็มีช่องทางมากมายในการเข้าถึงข้อมูลข่าวสารเพื่อใช้ตัดสินใจเรื่องต่างๆ ดังนั้น การให้ UBI จึงเหมาะสมมากขึ้นเรื่อยๆ ในโลกสมัยใหม่</p>\n<p>คำถามถัดมาคงเป็นเรื่องรายละเอียดทางเทคนิค ว่าจะจัดสรร UBI อย่างไร ซึ่งก็มีอยู่หลายสูตร ที่แต่ละประเทศคงมีบริบทแตกต่างกันไป</p>\n<ul>\n<li>ให้เงินใครดี? เป็นคำถามสำคัญที่สุดของนโยบาย Basic Income เพราะเป็นการเลือกที่สำคัญ\n<ul>\n<li>ถ้าเอาแบบง่ายที่สุดเลยคือ ให้ทุกคน (universal) เท่ากันอย่างถ้วนหน้า ลดปัญหาเรื่องความไม่เท่าเทียม แต่ก็อาจมีงบประมาณไม่มากพอ</li>\n<li>อีกสูตรหนึ่งก็อาจเป็นการให้คนที่มีรายได้น้อยก่อน มีแนวคิดเรื่อง Negative income tax (NIT) ที่ให้เงินกับคนรายได้น้อย (เสียภาษีติดลบ นั่นคือได้เงินแถมมาแทน) แต่ก็มีคำถามตามมาอีกว่า เส้นรายได้อยู่ตรงไหน แบ่งอย่างไรถึงแฟร์</li>\n</ul>\n</li>\n<li>ให้เงินเท่าไรดี? เป็นอีกคำถามโลกแตก มีตั้งแต่การให้เงินนิดหน่อย (เบี้ยคนชราไทย 600 บาท) หรือช่วยพอแค่ให้มีชีวิตอยู่ได้ (ซึ่งค่าครองชีพในแต่ละประเทศก็ต่างกันอีก) ไปจนถึงให้เงินในระดับเทียบเท่าค่าแรงขั้นต่ำ</li>\n<li>เอาเงินมาจากไหนจ่าย? อันนี้ตอบง่ายครับ ถ้าจะทำ UBI ต้องกลับไปคอนเซปต์ว่าเป็นการให้ประชาชนเลือกสวัสดิการด้วยตัวเอง ดังนั้นเงิน UBI ก็มาจากการตัดสวัสดิการอื่นบางอย่างออก รัฐเลิกทำ แล้วเอาเงินมาแจกจ่ายแทน\n<ul>\n<li>แต่ในรายละเอียดก็ยังมีคำถามอีกว่า สวัสดิการอะไรบ้างที่ควรตัด เช่น เบี้ยคนชราควรตัดไหมถ้ามี UBI แล้ว, โครงการอย่างคืนค่ามิเตอร์ไฟฟ้า ควรยกเลิกไหม? เป็นต้น ซึ่งรายละเอียดมีมาก และคำตอบคงแตกต่างกันไปตามแต่ละพื้นที่สังคม</li>\n<li>ตัดสวัสดิการอื่นแล้วอาจยังไม่พอ? เป็นไปได้ (แต่เมืองไทยนี่ตัดงบไร้สาระออกน่าจะเกินพอ) ทางแก้คือ ขึ้นภาษีในบางด้าน เช่น ภาษีคนรวย ภาษีสรรพสามิต ของฟุ่มเฟือย รวมถึง VAT ซึ่งแน่นอนว่าคนที่ได้รับผลกระทบย่อมไม่พอใจ</li>\n</ul>\n</li>\n</ul>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-2226\" src=\"https://markpeak.net/wp-content/uploads/2021/03/andrew-yang-poverty.jpg\" alt=\"\" width=\"800\" height=\"811\" srcset=\"https://markpeak.net/wp-content/uploads/2021/03/andrew-yang-poverty.jpg 800w, https://markpeak.net/wp-content/uploads/2021/03/andrew-yang-poverty-296x300.jpg 296w, https://markpeak.net/wp-content/uploads/2021/03/andrew-yang-poverty-768x779.jpg 768w, https://markpeak.net/wp-content/uploads/2021/03/andrew-yang-poverty-691x700.jpg 691w\" sizes=\"(max-width: 800px) 100vw, 800px\" /></p>\n<p>นักการเมืองสหรัฐที่โดดเด่นในแง่นโยบาย UBI คือ Andrew Yang ที่ลงชิงตำแหน่งประธานาธิบดี 2020 และกำลังลงชิงตำแหน่งนายกเทศมนตรี NYC ปี 2021 โดยชูนโยบาย UBI ทั้งสองรอบ</p>\n<ul>\n<li>นโยบายตอนสมัครประธานาธิบดีเรียกว่า <a href=\"https://2020.yang2020.com/policies/the-freedom-dividend/\">Freedom Dividend</a> ให้เงินคนอายุเกิน 18 ทุกคน คนละ 1,000 ดอลลาร์ต่อเดือน (มี<a href=\"https://freedom-dividend.com/\">เว็บคำนวณงบประมาณ Freedom Dividend</a> ด้วย)</li>\n<li><a href=\"https://www.yangforny.com/policies/a-basic-income-for-new-york-city\">นโยบายตอนลงนายกเทศมนตรี UBI</a> เปลี่ยนมาเป็นให้กลุ่มคนจนก่อน เริ่มที่ 2,000 ดอลลาร์ต่อปี</li>\n</ul>\n<p>ส่วนในประเทศไทยตอนนี้ มีทางกลุ่ม CARE ของพรรคเพื่อไทย ที่ออกมาพูดเรื่องนี้ ในรูปของ Negative Income Tax อย่างน้อย 3,000 บาทต่อเดือน</p>\n<div class=\"fb-post\" data-href=\"https://www.facebook.com/careorth/posts/279752510443113?__cft__%5B0%5D=AZXM-S5qLKPBjTVh4r9CQBdD8JnLPOq0vrv7wnaNiABxVXXf2Cy1IPPCbb1hmlgJJaTMpnEcV7mE7JU04Rf_MI4OBP_ILklCNDpahexK-E5EvoyI6YV3QcQ9iYJKIVF_uP8_HMoQf5jgOa0BiU03vNnF&#038;__tn__=%2CO%2CP-R\" data-width=\"552\"></div>\n<p>กล่าวโดยสรุปแล้ว ผมคิดว่า UBI เป็นนโยบายที่ &#8220;เชื่อมั่นในมนุษย์&#8221; เชื่อว่ามนุษย์แต่ละคนมีความคิดอ่านของตัวเอง มีเกียรติมีศักดิ์ศรีมากพอ</p>\n<p>แน่นอนว่าย่อมมีบางคนในสังคมที่มัก abuse ระบบ แต่เรื่องไหนๆ ก็มีนี่ หากเราเชื่อว่า มนุษย์ควรมีอำนาจกำหนดชะตาทางการเมืองของตัวเอง (ผ่านการเลือกตั้ง ทุกคนมีสิทธิเท่ากัน) และเราไม่เห็นว่าอะไรหากบางคนไม่ออกไปใช้สิทธิ เราก็น่าจะมองว่า มนุษย์ควรมีอำนาจกำหนดชะตาทางเศรษฐกิจของตัวเองเช่นกัน</p>\n<p>ภาพประกอบจาก <a href=\"https://www.pexels.com/photo/aerial-photo-of-people-riding-in-truck-1869580/\">Pexels</a></p>The post <a href=\"https://markpeak.net/universal-basic-income/\">Universal Basic Income</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"9e5c311d7d136ed1ba892ee5934bc6be073bc227c709208bac09c7e3afce6ad4","category":"Thai"}