{"title":"Safety and feasibility of Neuromuscular Electrical Stimulation in patients with Extracorporeal Membrane Oxygenation","link":"https://www.preprints.org/manuscript/202405.1341/v1","date":1716304945000,"content":"Background/Objectives: The aim of this study was to investigate feasibility and safety of neuromuscular electrical stimulation (NMES) in patients on extracorporeal membrane oxygenation (ECMO) and assess thoroughly any potential adverse events. Methods: We conducted a safety and feasibility study including 16 ICU patients on ECMO support who were admitted to the cardiac surgery ICU from January 2022 to December 2023. Patients underwent a 45-minute NMES session, still on ECMO support, that included a warm up phase of 5 minutes, a main phase of 35 minutes and a recovery phase of 5 minutes. NMES was implemented on vastus lateralis, vastus medialis, gastrocnemius and peroneus longus muscle of both lower extremities. Two stimulators delivered biphasic, symmetric impulses of 75 Hz, with 400 μsec pulse duration, 5 sec on (1,6 sec ramp up and 0,8 sec ramp down) and 21 sec off. The intensity levels aimed to cause visible contractions and be well tolerated. Primary outcomes of the study were feasibility and safety, evaluated by whether the NMES sessions were successfully achieved, and by any adverse events and complications. Secondary outcomes included indices of rhabdomyolysis from biochemical blood test, 24 hours after the application of NMES. Results: All patients successfully completed their 45-minute NMES session, without presenting hemodynamic deterioration, adverse events or signs of rhabdomyolysis. The majority of patients achieved type 4 and 5 quality of muscle contraction. Conclusions: NMES is a safe and feasible exercise methodology in patients supported with ECMO.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e6734bce269bb61dce916e19de096f419f8ccbed1c0cbe21581e88ac3cb2780","category":"Interdisciplinary"}