{"title":"Medical Support Vehicle Location and Deployment at Mass Casualty Incidents, Case Study: Mexico City","link":"https://www.preprints.org/manuscript/202403.0600/v1","date":1710188091000,"content":"Anticipating and planning for the urgent response to large-scale disasters is critical to increase the probability of survival in these events. These incidents present various challenges that complicate the response, such as unfavorable weather conditions, difficulties in accessing affected areas, and the geographical spread of the victims. Furthermore, local socioeconomic factors such as insufficient prevention education, limited disaster assets, and inadequate coordination between public and private emergency services may complicate these situations. In large-scale emergencies, multiple hotspots are usually observed, which requires efforts to coordinate the strategic allocation of human and material resources in different geographical areas. Therefore, the precise management of these resources based on the specific needs of each area becomes fundamental. To address these complexities, this paper proposes a methodology that models these scenarios as an optimization problem, focusing on the location and allocation of resources in mass casualty incidents. The proposed case study is Mexico City in a post-earthquake scenario, using voluntary geographic information, open government data, and historical data from the September 19, 2017 earthquake. Additionally, it is assumed that the resources that require optimal location and allocation are ambulances, which focus on medical issues that affect the survival of victims. The designed solution involves the use of a metaheuristic optimization technique, along with a parameter tuning technique, to find configurations that perform at different instances of the problem, i.e., different hypothetical scenarios that can be used as a reference for future possible situations. Finally, the objective is to present the different solutions graphically, accompanied by relevant information to facilitate the decision-making process of the authorities responsible for the practical implementation of these solutions.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e77571538ae7a35903d5933f034453e54bb3447ca48c926862dd80ba6f19003","category":"Interdisciplinary"}