{"title":"Amino acid carbon isotope profiles provide insight into lability and origins of particulate organic matter","link":"https://onlinelibrary.wiley.com/doi/10.1002/lno.12567?af=R","date":1716913718000,"content":"<h2>Abstract</h2>\n<p>Identifying the phytoplankton origin of particulate organic matter (POM) in the deep ocean is challenging due to the changing phytoplankton composition and varied extent of decomposition by heterotrophic bacteria and zooplankton. Here, we report vertical distributions of amino acid stable carbon isotope values (δ<sup>13</sup>C) measured in particles in the South China Sea. Carbon-weighted amino acid δ<sup>13</sup>C values generally parallel bulk POM δ<sup>13</sup>C profiles with a positive offset from 2.4‰ in the surface water to 6.0‰ in deep. Accordingly, a lability model is introduced to describe the relative distribution and isotopic linkage of labile and refractory particulate organic carbon. Temporal changes of amino acid δ<sup>13</sup>C were observed during the microbial decomposition of two phytoplankton strains, the prokaryote cyanobacterium <i>Synechococcus</i> and the eukaryote diatom <i>Thalassiosira weissflogii</i>. Principal component analysis of individual amino acid δ<sup>13</sup>C values from the decomposing cells separate samples into two components, reflecting the influence of microbial decomposition and taxonomic differences, respectively. These two components were further applied to particles. A major contribution from decomposing phytoplankton to particles below the euphotic zone was observed, with more prokaryote organic matter in the basin and a larger contribution from eukaryotes at stations near the productive northern shelf. Our findings show the applicability of amino acid δ<sup>13</sup>C values in tracing the lability and phytoplankton origins of POM in samples with varied extents of decomposition in marine environments.</p>","author":"Peihong Kang, \nLingyu Ma, \nHan Zhang, \nXi Dai, \nJie Liu, \nWeifang Chen, \nTiantian Tang","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"9e78a862e3a435442865de094bb1542c9e219a9d093eabadf1f9f566f8d7df27","category":"Environment"}