{"title":"Apple Reports 3Q 2023 Results: $19.9B Profit on $81.8B Revenue","link":"https://www.macrumors.com/2023/08/03/apple-3q-2023-results/","date":1691094956000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/08/apple-reports-third-quarter-results/\">announced</a> financial results for its third fiscal quarter of 2023, which corresponds to the second calendar quarter of the year.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/aapl-3q23-line.jpg\" alt width=\"1756\" height=\"772\" />\r<br />\nFor the quarter, Apple posted revenue of $81.8 billion and net quarterly profit of $19.9 billion, or $1.26 per diluted share, compared to revenue of $83.0 billion and net quarterly profit of $19.4 billion, or $1.20 per diluted share, in the <a href=\"https://www.macrumors.com/2022/07/28/apple-3q-2022-results/\">year-ago quarter</a>.\r<br />\n\r<br />\nGross margin for the quarter was 44.5 percent, compared to 43.3 percent in the year-ago quarter. Apple also declared a quarterly dividend payment of $0.24 per share, payable on August 17 to shareholders of record as of August 14.<blockquote>\"We are happy to report that we had an all-time revenue record in Services during the June quarter, driven by over 1 billion paid subscriptions, and we saw continued strength in emerging markets thanks to robust sales of iPhone,\" said Tim Cook, Apple's CEO. \"From education to the environment, we are continuing to advance our values, while championing innovation that enriches the lives of our customers and leaves the world better than we found it.\"</blockquote>As has been the case for over three years now, Apple is once again not issuing guidance for the current quarter ending in September.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/08/aapl-3q23-pie.jpg\" alt width=\"2304\" height=\"1188\" />\r<br />\nApple will <a href=\"http://www.apple.com/investor/earnings-call/\">provide live streaming</a> of its fiscal Q3 2023 financial results conference call at 2:00 p.m. Pacific, and <em>MacRumors</em> will update this story with coverage of the conference call highlights.\r<br />\n\r<br />\n<b>Conference call recap ahead...</b>\r<br />\n\r<br />\n<b>1:40 pm</b>: Apple's revenue was down approximately 1% year-over-year, but earnings and earnings per share were up slightly. AAPL shares were down approximately 0.75% in regular trading, briefly spiked after the close of regular trading, but then dropped again following the earnings release and is currently right around $190 per share.\r<br />\n\r<br />\n<b>1:42 pm</b>: Apple set an all-time record for Services revenue during the quarter at $21.2 billion, but iPhone revenue was down slightly compared to the year-ago quarter. Apple Watch was up just a bit, while iPad and Mac revenue dropped significantly to their lowest levels in three years.\r<br />\n\r<br />\n<b>1:55 pm</b>: While Apple's total sales dropped from just shy of $83 billion in the June 2022 quarter to just shy of $82 billion this year, profit nonetheless climbed from $19.4 billion to $19.9 billion thanks to an increase in the highly profitable Services division that more than offset the drop in hardware sales.\r<br />\n\r<br />\nBetween the increase in net income and a decrease in outstanding shares thanks to Apple's repurchase program, earnings per diluted share rose from $1.20 to $1.26.\r<br />\n\r<br />\n<b>1:57 pm</b>: Apple also saw sales growth in its European and Greater China geographic segments, while Americas, Japan, and AsiaPac slipped moderately. Wearables, Home and Accessories joined Services as the product segments that saw growth year over year.\r<br />\n\r<br />\n<b>1:59 pm</b>: Apple holds $10 billion more in marketable securities than it did at the end of September 2022, growing from $24.6 to $34 billion, while total outstanding term debt dropped from $99 to $98 billion as higher interest rates appear to be playing a role in Apple CFO Luca Maestri's cash management operations.\r<br />\n\r<br />\n<b>2:03 pm</b>: The earnings call with analysts is beginning, a minute or so late. Apple CEO Tim Cook and Apple CFO Luca Maestri are on the call, as usual.\r<br />\n\r<br />\n<b>2:04 pm</b>: Tim sounds upbeat, noting that revenue was better than expectations. iPhone set June quarter records in a whole host of emerging markets plus France, the Netherlands, and Austria.\r<br />\n\r<br />\n<b>2:04 pm</b>: Apple has passed 1 billion paid subscriptions on its various stores.\r<br />\n\r<br />\n<b>2:05 pm</b>: On a constant currency basis, Apple grew sales year over year. Expect to hear the words \"FX Headwinds\" several times in the next hour.\r<br />\n\r<br />\n<b>2:05 pm</b>: Tim is now talking up Apple Vision Pro and the company's vision for Spatial Computing.\r<br />\n\r<br />\n<b>2:06 pm</b>: \"The most advanced personal electronics device ever created.\"\r<br />\n\r<br />\n<b>2:07 pm</b>: Starting with iPhone. iPhone revenue was $39.7 billion, down 2% YoY. June quarter record for Switchers and on a constant currency basis, sales grew. This means that the strength of the US dollar hurt Apple's profit on international sales as foreign currency is turned back into US dollars for income reporting purposes.\r<br />\n\r<br />\nMac down 7%  year over year, and notes the entire Mac lineup now runs on Apple silicon.\r<br />\n\r<br />\n<b>2:08 pm</b>: iPad revenue was $5.9 billion, down 20% year over year, including a difficult compare because of the timing of the iPad Air launch in 2022.\r<br />\n\r<br />\n<b>2:08 pm</b>: Wearables, Home and Accessories sales were up 2% year over year.\r<br />\n\r<br />\n<b>2:10 pm</b>: $21.2 billion in Services revenue, with 8% year over year increase, exceeding Apple's expectations. Records in Video, AppleCare, Cloud, and Payment Services.\r<br />\n\r<br />\n<b>2:10 pm</b>: $10 billion in deposits to Apple Savings accounts.\r<br />\n\r<br />\n<b>2:11 pm</b>: Touting Lionel Messi joining InterMiami and MLS.\r<br />\n\r<br />\n<b>2:12 pm</b>: Apple opened the Apple Online Store in Vietnam during the quarter and redesigned the first Apple Store in Tysons Corner, Virginia.\r<br />\n\r<br />\n<b>2:13 pm</b>: Apple feels strongly about user privacy and accessibility.\r<br />\n\r<br />\n<b>2:14 pm</b>: Also racial justice and equity.\r<br />\n\r<br />\n<b>2:14 pm</b>: Apple is building a culture of belonging and a workforce that reflects the communities it serves.\r<br />\n\r<br />\n<b>2:16 pm</b>: Tim is turning the call over to Luca to talk about money.\r<br />\n\r<br />\n<b>2:16 pm</b>: Revenue was better than expectations, even with 4% of negative impact from foreign exchange.\r<br />\n\r<br />\n<b>2:17 pm</b>: FX headwinds and an uneven macro environment, hurting Product sales. June quarter records for iPhone Switchers and high new-to rates for Mac, iPad, and Watch.\r<br />\n\r<br />\n<b>2:17 pm</b>: Services grew 8%, and double digits in constant currency, with strong performance around the world, including all-time records in Americas and Europe, and June quarter in China and AsiaPac.\r<br />\n\r<br />\n<b>2:18 pm</b>: OpEx was below the low end of the guidance range provided at the beginning of the quarter, decelerating from the March quarter. Apple is tightening its belts, apparently.\r<br />\n\r<br />\n<b>2:19 pm</b>: iPhone revenue was $39.7 billion, down 2%, but up on constant currency basis. Revenue records in India, Indonesia, the Phillippines, and other countries. iPhone install base grew to an all-time high thanks to a June record for Switchers. iPhone 14 family has 98% customer satisfaction in the US.\r<br />\n\r<br />\n<b>2:20 pm</b>: Mac down 7% year over year, as transition to Apple Silicon completes. Strong upgrade activity plus new customers, and almost half of Mac buyers in the quarter were new to the product.\r<br />\n\r<br />\n<b>2:21 pm</b>: Wearables revenue was up 2% year over year, June quarter record in Greater China and strong performances in several emerging markets. Apple Watch saw 2/3 of customers being new to the product. 98% customer sat in the US.\r<br />\n\r<br />\n<b>2:22 pm</b>: For Services, Apple set June quarter records for Advertising, App Store, and Music. Installed base of 2 billion active devices continues to grow, establishing a solid foundation for the future expansion of the ecosystem. Increased customer engagement with services. Transacting and paid accounts grew double-digits, each reaching a new all-time high. Paid subs showed strong growth, surpassing 1 billion paid subscriptions across the platform. Up 150 million over the past year, and more than double 3 years ago.\r<br />\n\r<br />\n<b>2:23 pm</b>: Apple entered the quarter with $166 billion in cash, paid $7.5 billion in maturing debt plus issuing $5.2 billion in new debt. $109 billion in total debt. Net cash is $57 billion.\r<br />\n\r<br />\n<b>2:24 pm</b>: $24 billion returned to shareholders, including $18 billion in open-market repurchases of AAPL shares.\r<br />\n\r<br />\n<b>2:25 pm</b>: For September, assuming macro outlook doesn't worsen, FX will continue to be a headwind. Year-over-year revenue impact of over 2%. iPhone YoY performance to accelerate over June, Mac and iPad to decline double-digits due to difficult compares. Significant pent-up demand in the year-ago quarter.\r<br />\n\r<br />\nGross margin to be between 44 and 45 percent. OpEx between $13.5 and $13.7 billion. Tax rate to be around 16 percent. Cash dividend of $0.24 per share, payable on August 17.\r<br />\n\r<br />\n<b>2:26 pm</b>: The Q&amp;A is starting.\r<br />\n\r<br />\n<b>2:28 pm</b>: Q: You mentioned an uneven macro environment several times. Can you talk on a geographic basis of trends you're seeing on iPhone?\r<br />\n\r<br />\nA: Great performance for iPhone in emerging markets, June quarter records in many markets. Grew double digits and performance was strong in emerging markets from China to many other areas, including India (June record), Indonesia, Southeast Asia, Latin America, Middle East. It's been really good there.\r<br />\n\r<br />\nAs you can see from our geographic segments, we had a slight acceleration of performance in Americas, primarily in the US, but we declined there as the smartphone market has been in a decline in the last couple of quarters in the US.\r<br />\n\r<br />\n<b>2:29 pm</b>: Q: In terms of gross margin, you were at the high end of the range. You're guiding to 44-45 now, which I think is the highest I've seen. Seems like there's a perfect storm of good things.\r<br />\n\r<br />\nA: I think you remember correctly, it was an all-time record for us in June. Up 20 bp sequentially, driven by cost savings and mix-shift towards Services which helps company gross margins, offset by seasonal loss of leverage. Commodity environment is favorable to us. Our product mix is quite strong. With the exception of foreign exchange, which continues to be a significant drag, we are in a good position for the June quarter and we expect similar levels of gross margin for the same reasons, frankly, for the September quarter.\r<br />\n\r<br />\n<b>2:32 pm</b>: Q: Can you give additional color around guidance? You called out FX impact on iPhone, is that constant currency or is there something changing on seasonality that is causing not as much step up in product revenue?\r<br />\n\r<br />\nA: We don't report in constant currency, but we are also pointing out iPhone growth but double-digit decline for Mac and iPad due to year-ago factory shutdowns that were alleviated and filled pent-up demand last year during the September quarter. An unusual amount of activity a year ago, so both iPad and Mac down double-digits, offsetting an expected growth in iPhone and Services.\r<br />\n\r<br />\n<b>2:33 pm</b>: Q: What amount of iPhones are sold on an installment vs up front basis globally, and do you expect big promotions on iPhone from US carriers this year?\r<br />\n\r<br />\nA: We've done a good job with affordability programs around the world, both in our direct channel and with our partners around the world. The majority of iPhones at this point are sold using some kind of a program, trade-in, installments, some kind of financing. That percentage, well over 50%, is very similar across developed and emerging markets. We want to do more of that because we think it helps the affordability threshold of our products. It helped our product mix across the last couple of cycles.\r<br />\n\r<br />\n<b>2:36 pm</b>: Q: To be clear, you're talking about an acceleration on iPhone but the comp is 2% easier on FX, is that a like for like basis from June to September quarter? Last quarter you talked about buying inventory at favorable prices, where do you sit today and what's the timing and duration of that commodity backlog and subsequent quarters from a favorable cost dynamic?\r<br />\n\r<br />\nA: Re our guidance, we are referring entirely to reported numbers, taking into account that we have a slight improvement on foreign exchange. Similar performance, I refer to reported performance in June versus reported performance in September. On a reported basis, we expect iPhone and Services performance to accelerate, and iPad and Mac to decline double digits.\r<br />\n\r<br />\nOn a commodity front, the environment is favorable. We always make sure that we take advantage of the opportunities available in the market and we will continue to do that going forward.\r<br />\n\r<br />\nQ: Any sense of how long of a runway that gives you, any sense of a short-term tailwind?\r<br />\n\r<br />\nA: I don't want to speculate beyond the September quarter because that's how far we guide. 44-45 gross margin, which is historically very high, which reflects a favorable environment for us.\r<br />\n\r<br />\n<b>2:38 pm</b>: Q: Are there signs consumers will spend on consumer electronics, are there regions where you see more consumer strength and how sustainable is that?\r<br />\n\r<br />\nA: We did exceptionally well in emerging markets last quarter, and even better on a constant currency basis. Emerging markets were a strength. China, we went from a -3 in Q2 to a +8 in Q3. Look at the US, the Americas segment, there was a slight acceleration sequentially, though Americas slightly declining year over year. Primary reason for that is that it's a challenging smartphone market in the US currently. \r<br />\n\r<br />\nEurope saw a record June quarter, so some really good signs in most places in the world.\r<br />\n\r<br />\n<b>2:40 pm</b>: Q: 3 quarters with OpEx growing below seasonality or below expectations, first time we've seen R&amp;D growing less than 10% since 2007? What's giving you the idea of a more regular seasonal cadence of R&amp;D or is this the new normal?\r<br />\n\r<br />\nA: We look at the environment and this has been an uncertain period over the last few quarters. Being careful controlling our spend across the company, been quite effective at slowing down the spend. We slowed down hiring within the company in several areas, and we are very pleased with our ability to decelerate some of the expense growth, taking into account the overall macro situation. We will continue to manage deliberately, we continue to grow our R&amp;D costs faster than the rest of the company. Our focus continues to be on innovation and product development and we continue to do that.\r<br />\n\r<br />\n<b>2:42 pm</b>: Q: Encouraging to see Services outperformance in the quarter and more expected next quarter, can you talk more about key underlying drivers for confidence in Services next quarter, anything to call out as it relates to things in Apple Search Ads, making lots of investments in AppleTV+.\r<br />\n\r<br />\nA: We've seen an improvement in the June quarter and we expect further improvements in September. In June, performance across the board, we set records. All-time records in Cloud, Video, AppleCare, Payments. June quarter records in App Store, Advertising, Music. We saw improvements in all Services categories. We think the situation will continue to improve as we go through September and that's very positive. Not only good for financial results, but it shows a high level of engagement of our customers in the ecosystem. The sum of all of the things that I mentioned in my prepared remarks.\r<br />\n\r<br />\nOur install base continues to grow, a larger pool of customers, more transacting and paid accounts, the subscription business is very healthy with growth of 150 million paid subscriptions just in the last 12 months. Almost double what we had three years ago. The combination of all of these things gives us good confidence for September.\r<br />\n\r<br />\n<b>2:44 pm</b>: Q: Re hardware install base and services ARPU, with Services strength and 2 billion installed base, do you think about it on a per active iPhone user basis or per device basis? Do you think there's an incremental opportunity for users who have multiple devices for an ARPU uplift?\r<br />\n\r<br />\nA: Customers who own more than one device are more engaged in our ecosystem. They spend more on the Services front, but the biggest opportunities that we know, a lot of our customers are very familiar with our ecosystem. Some are using only the portion of the ecosystem that is free, by offering more content over time, we believe we can attract more of them as paid customers.\r<br />\n\r<br />\n<b>2:46 pm</b>: Q: How do you think about Wearables going into September, you haven't talked much about that.\r<br />\n\r<br />\nA: We had really good performance in Greater China, very important for us, a June quarter record for Greater China. The engagement with the ecosystem in a market that is so important, continues to grow. More and more customers. We continue to grow the installed base of the category quickly. 2/3 of Apple Watch buyers in the June quarter was new to the product. That is all additive to the installed base. Great to see that the AirPods continue to be a great success in the marketplace. Things are moving in the right direction there. A great business for us, $40 billion in the last 12 months, nearly the size of a Fortune 100 company. Diversified both our revenues and our earnings.\r<br />\n\r<br />\n<b>2:47 pm</b>: Q: Europe growth, up 5% is fairly notable. A few emerging markets in Europe, but what's happening in Europe and what should we think about it in Western vs emerging markets?\r<br />\n\r<br />\nA: Primarily good on the emerging markets side of Europe, India, Middle East are in \"Europe\" segment. A number of markets that did well, France, Italy, Netherlands, Austria. It was a good quarter for Europe.\r<br />\n\r<br />\n<b>2:49 pm</b>: Q: For some time now, you've had a currency headwind. It's conceivable that it might start to come down next year, and the dollar weakens. How would that affect revenues and cost?\r<br />\n\r<br />\nA: We try to hedge our FX exposures because we think it's the right approach for the company in terms of minimizing volatility across the movement of currencies. We cannot effectively hedge every single exposure around the world because in some cases it's not possible, in others it is prohibitively expensive. We tend to cover all the major currency pairs we have. About 60% of our business is outside the US, so it's a very large and very effective hedging program.\r<br />\n\r<br />\nWe set up these hedges, and they tend to roll over very regularly, and we replace them with new hedges at the new spot rate. Impact on revenue and cost will depend where spot rates are at different points in time. Therefore, because of the way the program works, that should be a bit of a lag in both directions as the foreign exchange moves over time.\r<br />\n\r<br />\n<b>2:50 pm</b>: Q: To help folks upgrade, cash rebate or trade-in, as you get into the December quarter, are you aware of programs that are in place? You said more than 50% of phones are sold through the programs, I assume it's even higher in the US.\r<br />\n\r<br />\nA: I don't want to get into specifics of different carriers, but generally speaking I would think that it would be quite easy to find a promotion on a phone provided you're hooking up to a service and either switching services/carriers or upgrading your phone at the same carrier. Both of those cases, today, you can find promotions out there. I expect you'd be able to find those in the December timeframe as well.\r<br />\n\r<br />\n<b>2:52 pm</b>: Q: Tim, strategically, as we think about services growth and the content expansion behind that, what have you seen from a sports perspective with the engagement with MLS and MLB, how strategically are you thinking about expansion in sports as a services driver?\r<br />\n\r<br />\nA: We're focused on original content with Apple TV+, we're about giving storytellers a venue to tell great stories and get us to think a little deeper. Sport is the ultimate original story and for MLS we could not be happier with how the partnership is going. It's clearly in the early days, but we're beating our expectations in terms of subscribers and the fact that Messi went to Inter Miami helped us out there a bit. We're very excited about it.\r<br />\n\r<br />\n<b>2:54 pm</b>: Q: An update on the continued growth in India, how do we think about that market opportunity going forward? Is there anything that could accelerate the opportunity for iPhones in that large mobile market?\r<br />\n\r<br />\nA: We hit a June quarter revenue record in India. We grew strong double digits. We opened our first two retail stores during the quarter, and it's early going currently but they're currently beating our expectations in terms of how they're doing. We're continuing to work on building out the channel and putting more investment in our direct to consumer offers as well. I think if you look at it, it's the second largest smartphone market in the world. We ought to be doing really well, and I'm really pleased with our growth there but we still have a very modest and low share in the smartphone market. It's a huge opportunity for us and we're putting all of our energies into making that occur.\r<br />\n\r<br />\n<b>2:56 pm</b>: Q: How do you see your investment in AI, is it about building a faster upgrade cycle or higher ASP, or building services?\r<br />\n\r<br />\nA: AI and ML is integral to every product we build. Think about WWDC and features coming in iOS 17, live voicemail, previous features like crash or fall detection, these wouldn't be possible without AI and machine learning. We've been doing research across a wide range of AI tech, including generative AI, for years. We will continue to responsibly advance our products with these technologies with a goal of enriching people's lives. We announce things as they come to market, that's our MO and I'd like to stick to that.\r<br />\n\r<br />\n<b>2:57 pm</b>: Q: Talk about VIsion Pro?\r<br />\n\r<br />\nA: We're very excited about Vision Pro; everyone who has gone through the demos have been blown away, whether talking about the press or developers or analysts. We're looking forward to shipping early next year. We're not going to forecast revenues and so forth on the call today, but we're very excited about it.\r<br />\n\r<br />\n<b>2:59 pm</b>: Q: On iPhone, Tim you mentioned a record number of switchers on the quarter. Given weak macro and consumer spending, how's the replacement cycle for iPhone? Similar, longer or shorter to prior years?\r<br />\n\r<br />\nA: Switchers were a very key part of our iPhone results for the quarter, we set a record in Greater China and it was at the heart of our results there. We continue to try to convince more and more people to switch, because of the experience and the ecosystem we can offer them. We think switching is a huge opportunity for us. In terms of the upgrade cycle, it's difficult to estimate in real time what is going on with the upgrade cycle. \r<br />\n\r<br />\nThink about iPhone results year over year, you have to think about the SE announcement in the year ago quarter, that provides a bit of a headwind on the comp. As Luca said as he talked about how we view Q4, we see iPhone accelerating in Q4.\r<br />\n\r<br />\n<b>3:00 pm</b>: Q: On retail, many new stores seem to have been open for more than a year. How did retail traffic look and what does that suggest for the back half of the year?\r<br />\n\r<br />\nA: If you look at retail, it's a key part of our go-to-market approach. It will be so key and a competitive advantage with Vision Pro and it will give us an opportunity to launch a new product and demo to people in the stores. It has many advantages in it, and we continue to roll out more stores. Opened two in India last quarter. Still a lot of countries out there that don't have Apple Stores that we would like to go into. We continue to see it as a key part of how we go to market and we love the experience that we can provide customers there.\r<br />\n\r<br />\n<b>3:00 pm</b>: The call has ended!<div>Tag: <a href=\"https://www.macrumors.com/guide/earnings/\">Earnings</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/08/03/apple-3q-2023-results/\">Apple Reports 3Q 2023 Results: $19.9B Profit on $81.8B Revenue</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reports-3q-2023-results-19-9b-profit-on-81-8b-revenue.2397701/\">Discuss this article</a> in our forums<br /><br />","author":"Jordan Golson","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9e856d52dd862f27b27ae236ff951ea2b257a711f472981b997c9f21b3ca963c","category":"Apple"}