{"title":"The Weeping Angels are as terrifying as ever in Doctor Who: Flux trailer","link":"https://arstechnica.com/?p=1804682","date":1634355440000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div><div></div><p>Jodie Whittaker returns for one last stint as our favorite time lord in <em>Doctor Who: Flux</em>. </p></div>\n<p>We got the briefest of teasers for the upcoming 13th season (or series) of <a href=\"https://en.wikipedia.org/wiki/Doctor_Who_(series_13)\"><em>Doctor Who</em></a> during San Diego Comic-Con in July, hinting at the return of some of the show's most classic villains. Now we finally have the full official trailer, and it's a doozy, particularly for hardcore fans, with glimpses of the <a href=\"https://en.wikipedia.org/wiki/Ood\">Ood</a>, the <a href=\"https://en.wikipedia.org/wiki/Cyberman\">Cybermen</a>, the <a href=\"https://en.wikipedia.org/wiki/Sontaran\">Sontarans</a>, and the <a href=\"https://en.wikipedia.org/wiki/Weeping_Angel\">Weeping Angels</a>—for my money the most frightening and disturbing creatures the series has yet invented. Just the brief shot of them in this trailer gave me chills. And apparently there will be alien creatures known as the Ravaegers. This will also, alas, be <a href=\"https://arstechnica.com/gaming/2020/03/review-jodie-whittakers-time-lord-returns-to-classic-doctor-who-form/\">Jodie Whittaker's</a> last full season as the Doctor.</p>\n<p>(<strong>Spoilers for the 2021 New Year's Day special below.)</strong></p>\n<p>We last saw Whittaker's Doctor on New Year's Day earlier this year in the special episode \"Revolution of the Daleks,\" which found her being held in a Judoon prison. Her faithful companions—Yasmin (Mandip Gill), Ryan (Tosin Cole), and Graham (Bradley Walsh)—were back in Sheffield, searching for her. Meanwhile, some corrupt politicians were building a defense drone squad by cloning the remains of the Reconnaissance Scout Dalek the Doctor and her compassions encountered in the 2019 New Year's Day special, \"Revolution.\" Naturally, wacky, world-threatening highjacks ensued.  </p></div><p><a href=\"https://arstechnica.com/?p=1804682#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1804682&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9e8b113cf11d532df282aa9a5e51db19da4eb364aad21cf5c7604bcbeef4cb02","category":"Tech"}