{"title":"Mixbiotic society measures: Assessment of community well-going as living system","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307401","date":1723039200000,"content":"<p>by Takeshi Kato, Jyunichi Miyakoshi, Tadayuki Matsumura, Ryuji Mine, Hiroyuki Mizuno, Yasuo Deguchi</p>\r\n\r\nSocial isolation and fragmentation represent global challenges, with the former stemming from a lack of interaction and the latter from exclusive mobs—both rooted in communication issues. Addressing these challenges, the philosophical realm introduces the concept of the “mixbiotic society.” In this framework, individuals with diverse freedoms and values mix together in physical proximity with diverse mingling, recognizing their respective “fundamental incapacities” and uniting in solidarity. This study aims to provide novel measures to balance freedom and solidarity, specifically the intermediate between isolation and mobbing, within a mixbiotic society. To achieve this, we introduce simplified measures to evaluate dynamic communication patterns. These measures complement traditional social network analysis of static structures and conventional entropy-based assessments of dynamic patterns. Our specific hypothesis posits that the measures corresponding to four distinct phases are established by representing communication patterns as multidimensional vectors. These measures include the mean of Euclidean distance to quantify “mobism” for fragmentation, the relative distance change for “atomism” indicating isolation, and a composite measure derived from multiplying the mean and variance of cosine similarity for “mixism,” reflecting the well-going state of a mixbiotic society. Additionally, nearly negligible measures correspond to “nihilism.” Through the evaluation of seven real-society datasets (high school, primary school, workplace, village, conference, online community, and email), we demonstrate the utility of the “mixism” measure in assessing freedom and solidarity in society. These measures can be employed to typify communities on a radar chart and a communication trajectory graph. The superiority of the measures lies in their ability to evaluate dynamic patterns, ease of calculation, and easily interpretable meanings compared to conventional analyses. As a future development, alongside additional validation using diverse datasets, the mixbiotic society measures will be employed to analyze social issues and applied in the fields of digital democracy and platform cooperativism.","author":"Takeshi Kato","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9e9545edf258ae9d2d04f1ae15c5751e5be04c29c4e003a7a2aaa672d060b488","category":"Interdisciplinary"}