{"title":"Relevance of Diet in Schizophrenia: Focusing on Prenatal Nutritional Deficiency, Obesity, Oxidative Stress and Inflammation","link":"https://www.preprints.org/manuscript/202407.2111/v1","date":1721986236000,"content":"Schizophrenia is a complex mental disorder influenced by genetic and environmental factors, including diet. Oxidative stress and inflammation play a crucial role in the pathophysiology of schizophrenia. Nutritional deficiencies, such as lack of omega-3 fatty acids, vitamin D, and B vitamins, during prenatal and postnatal periods can nega-tively impact neurodevelopment and increase the risk of schizophrenia. Patients with schizophrenia show imbalances in antioxidant enzymes such as: glutathione peroxidase (GPx), superoxide dismutase (SOD), catalase (CAT) and reduced levels of antioxidants (vitamin E, vitamin C), leading to increased oxidative stress markers such as malondialdehyde (MDA). Cytokine-mediated inflammation, microglial activation, and gut dysbiosis are associated with schizophrenia onset and symptom severity. There is no clear and universally accepted diet for the treatment of schizophrenia, which is considered the most popular. However, various diets and nutritional methods are being researched and applied to alleviate the symptoms of schizophrenia and improve the general health of patients, including the mediterranean diet, ketogenic diet, gluten-free diet and DASH diet. A healthy diet rich in anti-inflammatory and antioxidant nutrients can help manage schizophrenia by reducing oxidative stress, preventing complications, and improving quality of life. Omega-3 fatty acids, vitamin D and B vitamins are par-ticularly important for brain development and function. In this review we will focus on the influence of diet on schizophrenia. Additional research is needed to develop per-sonalized dietary recommendations for patients with schizophrenia.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9e9b211b5210d3beb88608dc1e03ff84ff7e9c768e89e6bbae6d0e23ff3a7f8d","category":"Interdisciplinary"}