{"title":"Hands-On With Brydge's 12.9-Inch iPad Pro Keyboard With Trackpad","link":"https://www.macrumors.com/2021/05/04/brydge-keyboard-hands-on/","date":1620154108000,"content":"<a href=\"https://www.brydge.com\">Brydge</a> has been making keyboards for Apple's iPads for years now, and the newest model, the Brydge 12.9 MAX+, is compatible with the third, fourth, and fifth-generation <a href=\"https://www.macrumors.com/roundup/ipad-pro/\">iPad Pro</a> models, so it works even with the new mini-LED ‌iPad Pro‌.\r\n<br />\r\n\r\n<br />\r\n<div></div>\r\n<br />\r\n<div><em><a href=\"https://www.youtube.com/user/macrumors?sub_confirmation=1\">Subscribe to the MacRumors YouTube channel</a> for more videos.</em></div>\r\n<br />\r\nIn our latest YouTube video, we checked out the new Brydge 12.9 MAX+ to see if it's a viable alternative to Apple's own Magic Keyboard. Note that we have a preproduction unit and haven't had a lot of time with it, so is more of an overview than an in-depth review.\r\n<br />\r\n\r\n<br />\r\nShipping out in June, <a href=\"https://www.brydge.com/products/brydge-12-9-max-plus\">the Brydge 12.9 MAX+</a> is priced at $250, which is quite expensive, but it is a full $100 cheaper than Apple's Magic Keyboard for the 12.9-inch ‌iPad Pro‌. Like the Magic Keyboard, it offers a full keyboard and a trackpad that's compatible with the ‌iPad Pro‌ models, turning an <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a> touch experience into a more laptop-like experience.\r\n<br />\r\n\r\n<br />\r\nThe Brydge 12.9 MAX+ is a keyboard case that connects to the back of the ‌iPad Pro‌ magnetically similar to the Magic Keyboard, but it does not have the same elevated angling, instead using a flatter, more typical laptop design.\r\n<br />\r\n\r\n<br />\r\nThe keys, which are arguably one of the most important aspects of any keyboard, feel great under the fingers and have a good amount of travel. There's a row of shortcut keys above the number row for controlling screen brightness, accessing media controls and emoji, and more.\r\n<br />\r\n\r\n<br />\r\nThe trackpad is huge, much larger than the trackpad on the Magic Keyboard and comparable to the trackpad on the MacBook Pro. The trackpad works well, and there are no dead zones. You can tap anywhere on the trackpad (and click in most areas minus the edges), and it's a major improvement over the trackpad on Brydge keyboards that we tested last year. You're not going to feel a lot of difference with this trackpad and the trackpad on the Magic Keyboard.\r\n<br />\r\n\r\n<br />\r\nSince this is a Bluetooth keyboard, it does not connect to the <a href=\"https://www.macrumors.com/guide/smart-connector/\">Smart Connector</a> like the Magic Keyboard, which is not as convenient because it does need to be charged at times. There are some other minor downsides. The keyboard is a bit wobbly when you touch the ‌iPad‌'s screen while using it, and the hinge is tight and it takes some force to adjust the position of the ‌iPad‌, but overall, it's a solid keyboard and looks like it will be a good alternative to the Magic Keyboard. \r\n<br />\r\n\r\n<br />\r\nMake sure to take a look at our full video to get a look at the keyboard in action.<div>Tag: <a href=\"https://www.macrumors.com/guide/brydge/\">Brydge</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/04/brydge-keyboard-hands-on/\">Hands-On With Brydge's 12.9-Inch iPad Pro Keyboard With Trackpad</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/hands-on-with-brydges-12-9-inch-ipad-pro-keyboard-with-trackpad.2294816/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MWxtsgVQmCI:hM6FfA_a_AY:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=MWxtsgVQmCI:hM6FfA_a_AY:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/MWxtsgVQmCI\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9e9df18a70222b2a5cb36b8114f4b7dbd65dd87628dbe77509484a278b60ab28","category":"Apple"}