{"title":"Removal of lead(II) ions from aqueous solution using mesoporous and microporous coals: characterization, isotherm and kinetic studies","link":"http://link.springer.com/10.1007/s13762-024-05480-4","date":1717200000000,"content":"<h3>Abstract</h3>\n                    <p>Exposure to heavy metals in water bodies is of environmental concern; hence, their removal is necessary. As-received coals obtained from two sedimentary basins in Nigeria were characterized and tested for their potential application as adsorbent in the removal of lead(II) ions from contaminated water. Physical and chemical properties of the coals including their elemental composition, conductivity, density, pH, pore structure, surface morphology and thermal behaviour were studied using standard instruments and techniques. The removal efficiency of the coals, adsorption isotherms and kinetics were studied from batch experiments. Results showed that the coals possessed adsorbent properties in terms of carbon content, pH, density, surface morphology and pore structure. The removal efficiency of Pb(II) ions from aqueous media using Ogwashi-uku coal ranged from 89.01 to 99.45%, while it ranged from 80.77 to 98.51% with Onyeama coal. Adsorption equilibrium for the removal of lead ions was established at pH of 6, 1 g dosage, at 100 ppm concentration with the contact time of 90 and 75 min for Ogwashi-uku and Onyeama coals, respectively. The adsorption process followed Langmuir isotherm, while the kinetics best fitted the pseudo-second-order model. The adsorption data did not fit Elovich isotherm for chemisorption. Factors such as pore structure, density and morphology influence the ability of a coal to adsorb heavy metals from lead aqueous solution. The availability, adaptability, ease of use, cost effectiveness and environmental considerations recommend the tested raw coals for application in the removal of lead from contaminated water bodies.</p>","author":"","siteTitle":"SPRINGER Environment","siteHash":"64455e3c11ee7d19661e3f0c9bc69bdeacdb46a64041908256c3ac2895bbf514","entryHash":"9ea2f2442c9976b1c2f8ac7a1be9de70c6b9f3f1efe50af5c6b7258971a1a7f5","category":"Environment"}