{"title":"An era of sports car racing will end with this year’s Petit Le Mans","link":"https://arstechnica.com/?p=1812676","date":1636747581000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/M21_0515_fine-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/11/M21_0515_fine.jpg\">Enlarge</a> <span>/</span> A pack of GT cars at the beginning of the 2021 12 Hours of Sebring. If you needed proof of sportscar racing being too complicated for the casual fan, consider the fact that the white #79 Porsche 911 RSR is actually radically different from the blue #16 Porsche 911 GT3 R right next to it. From next year, that confusion will be lessened. (credit: Porsche)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>On Saturday, the North American sports car season will draw to a close with the Petit Le Mans, a 10-hour race held at Road Atlanta in Georgia. This year's Petit Le Mans is also the last race for a fan-favorite class of cars known as GTLM. The category covered Le Mans-legal versions of two-door production cars, which over the years represented a playground for manufacturer-supported programs and some of the world's best racing drivers.</p>\n<p>On the one hand, cutting GTLM is a massive step for the US side of endurance racing, as it ends a direct link between the WeatherTech SportsCar Championship and the annual 24 Hours of Le Mans. But it also makes the sport a bit less complicated.</p>\n<p>\"Even for some of the most avid car people, they have a hard time understanding why the red BMW is so much faster than the yellow and blue one or [why] the red, white, and blue Porsche is so much faster than the #9 car or the #16 or the #88,\" said John Doonan, president of the International Motor Sports Association (IMSA), the sport's organizer.</p></div><p><a href=\"https://arstechnica.com/?p=1812676#p3\">Read 17 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1812676&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9eaebfcc8378a6404b6558560f600717e12f498b20a5f3fb0bddf892ac34e63d","category":"Tech"}