{"title":"Apple Music expands spatial audio and lossless to Android","link":"https://www.macworld.com/article/351849/apple-music-spatial-audio-lossless-android.html","date":1627059844000,"content":"<div>\n<section><div></div></section><p>Apple on Friday completed <a href=\"https://www.macworld.com/article/346837/apple-music-lossless-hi-res-lossless-spatial-dolby-atmos-iphone-airpods-homepod-dac.html\">the rollout of lossless and spatial audio in Apple Music</a> with the launch of the higher-quality audio formats on Android. However, if you don’t have a newer flagship phone, you might not be able to get the full listening experience.</p>\n\n\n\n<p>In the update notes, Apple says users can “experience spatial audio and enter a new dimension in sound on compatible devices.” In a support document, Apple adds that you’ll “need an Android device that supports Dolby Atmos.” You’ll also need a pair of wired headphones since Apple doesn’t support spatial audio in AirPods on Android devices.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/07/apple-music-spatial-android.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The Galaxy S10, left, supports Dolby Atmos spatial audio but the newer Google Pixel 5, right, does not.</figcaption></figure><p>IDG</p></div>\n\n\n\n<p>But while Apple says “built-in speakers on an iPhone XS or later (except iPhone SE), iPad Pro 12.9-inch (3rd generation or later), iPad Pro 11-inch, or iPad Air (4th generation)” as well as AirPods and most Beats headphones will support Dolby Atmos, the same isn’t true for Android phones. For example, the Pixel 5, which was released last October, doesn’t show the Dolby Atmos toggle. The Galaxy S10 does, however.</p>\n\n\n\n<p>Lossless, however, is available on all Android phones, though you’ll need an external DAC—or possibly an LG phone with a built-in DAC—to hear the highest-quality recordings. And of course, high-res lossless tracks will consume more data due to their size.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9ebcc9e859ea624a7ce6c369c6caf2b96b462d57107cd73c4d568748f169f5c3","category":"Apple"}