{"title":"Associations between body mass index and all-cause and CVD mortality in agriculture, forestry, and fishing occupations: A prospective cohort study using NHANES data (1999–2014)","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0305922","date":1720447200000,"content":"<p>by Yanmeng Qi, Baoshan Zhang, Han Yang</p>\r\nIntroduction <p>Obesity, as indicated by elevated Body Mass Index (BMI), is a well-established global health concern associated with increased morbidity and mortality across diverse populations. However, the influence of BMI on individuals in Agriculture, Forestry, and Fishing (AFF) occupations, characterized by unique challenges and environmental factors, has received limited research attention.</p> Methods <p>Our study, a prospective cohort analysis, utilized National Health and Nutrition Examination Survey (NHANES) data from 1999–2014, targeting adults above 18 in AFF occupations with comprehensive BMI data, omitting individuals with a history of cancer. Mortality outcomes were extracted from the NHANES mortality file, and BMI was segmented into eight categories. Essential covariates such as age, sex, race, and various health factors were incorporated. The statistical analysis encompassed Cox regression, generalized additive models, smooth curve fitting, and stratified analyses.</p> Results <p>During 1,005 person-years with 201 all-cause and 57 CVD deaths, we observed L-shaped and U-shaped correlations of BMI with all-cause and CVD mortality, featuring a pivotal inflection at 26.69 and 27.40 kg/m<sup>2</sup>. Above this BMI threshold of 26.69 and 27.4 kg/m<sup>2</sup>, all-cause mortality association was not significant while CVD mortality was positive.</p> Conclusions <p>This study highlights a unique BMI-mortality association in AFF occupations, diverging from standard patterns. The rigorous labor and environmental conditions in AFF jobs suggest that a certain range of higher BMI could reduce mortality risk. This highlights the necessity for tailored health guidelines in different occupations. Future research should concentrate on diverse health indicators and enhanced risk assessment for physically strenuous occupations.</p>","author":"Yanmeng Qi","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9ecc29443e6e108edc9b8bc9f9b75bb66276edd03f8723a2c5a7ab1305dd15f8","category":"Interdisciplinary"}