{"title":"Affective Sensitivity to Air Pollution (ASAP): Person-specific associations between daily air pollution and affective states","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0307430","date":1723039200000,"content":"<p>by Michelle Ng, Denis Gerstorf, David E. Conroy, Aaron L. Pincus, Nilàm Ram</p>\r\n\r\nIndividuals’ sensitivity to climate hazards is a central component of their vulnerability to climate change. In this paper, we introduce and outline the utility of a new intraindividual variability construct, <i>affective sensitivity to air pollution</i> (ASAP)–defined as the extent to which an individual’s affective states fluctuate in accordance with daily changes in air quality. As such, ASAP pushes beyond examination of differences in individuals’ <i>exposures</i> to air pollution to examination of differences in individuals’ <i>sensitivities</i> to air pollution. Building on known associations between air pollution exposure and adverse mental health outcomes, we empirically illustrate how application of Bayesian multilevel models to intensive repeated measures data obtained in an experience sampling study (<i>N</i> = 150) over one year can be used to examine whether and how individuals’ daily affective states fluctuate with the daily concentrations of outdoor air pollution in their county. Results indicate construct viability, as we found substantial interindividual differences in ASAP for both affect <i>arousal</i> and affect <i>valence</i>. This suggests that repeated measures of individuals’ day-to-day affect provides a new way of measuring their sensitivity to climate change. In addition to contributing to discourse around climate vulnerability, the intraindividual variability construct and methodology proposed here can help better integrate affect and mental health in climate adaptation policies, plans, and programs.","author":"Michelle Ng","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9ed62b35ed92b1f3a6f6dd4c26387b55d2d3d27500c5897c389137fe6eb7f793","category":"Interdisciplinary"}