{"title":"Clever DNA tricks","link":"https://arstechnica.com/?p=1951322","date":1688210107000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2017/03/DNA-Stock-Image_22532584_SMALL-800x600.jpg\" alt=\"Clever DNA tricks\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2017/03/DNA-Stock-Image_22532584_SMALL.jpg\">Enlarge</a> (credit: <a href=\"https://commonfund.nih.gov/newinnovator/programhighlights\">NIH</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<div>\n<p>Every person starts as just one fertilized egg. By adulthood, that single cell has turned into roughly 37 trillion cells, many of which keep dividing to create the same amount of fresh human cells every few months.</p>\n<p>But those cells have a formidable challenge. The average dividing cell must copy—perfectly—3.2 <em>billion</em> base pairs of DNA, about once every 24 hours. The cell’s replication machinery does an amazing job of this, copying genetic material at a lickety-split pace of some 50 base pairs per second.</p>\n<p>Still, that’s much too slow to duplicate the entirety of the <a href=\"https://knowablemagazine.org/article/living-world/2020/the-blueprint-life-neatly-folded\" target=\"_blank\">human genome</a>. If the cell’s copying machinery started at the tip of each of the 46 chromosomes at the same time, it would finish the longest chromosome—No. 1, at 249 million base pairs—in about two months.</p>\n<p>“The way cells get around this, of course, is that they start replication in multiple spots,” says James Berger, a structural biologist at the Johns Hopkins University School of Medicine in Baltimore, who co-authored <a href=\"https://www.annualreviews.org/doi/10.1146/annurev-biochem-090120-125407\" target=\"_blank\">an article on DNA replication in eukaryotes</a> in the 2021 Annual Review of Biochemistry. Yeast cells have hundreds of potential replication origins, as they’re called, and animals like mice and people have tens of thousands of them, sprinkled throughout their genomes.</p>\n<p>“But that poses its own challenge,” says Berger, “which is, how do you know where to start, and how do you time everything?” Without precision control, some DNA might get copied twice, causing cellular pandemonium.</p>\n<p>Keeping tight reins on the kickoff of DNA replication is particularly important to avoid that pandemonium. Today, researchers are making steps toward a full understanding of the molecular checks and balances that have evolved in order to ensure that each origin initiates DNA copying once and only once, to produce precisely one complete new genome.</p>\n<h2>Do it right, do it fast</h2>\n<p>Bad things can happen if replication doesn’t start correctly. For DNA to be copied, the DNA double helix must open up, and the resulting single strands—each of which serves as a template for building a new, second strand—are vulnerable to breakage. Or the process can get stuck. “You really want to resolve replication quickly,” says John Diffley, a biochemist at the Francis Crick Institute in London. Problems during DNA replication can cause the genome to become disorganized, which is often a key step on the route to cancer.</p>\n<p>Some genetic diseases, too, result from <a href=\"https://www.mdpi.com/1422-0067/22/2/911\" target=\"_blank\">problems with DNA replication</a>. For example, Meier-Gorlin syndrome, which involves short stature, small ears, and small or no kneecaps, is caused by mutations in several genes that help to kick off the DNA replication process.</p>\n<p>It takes a tightly coordinated dance involving dozens of proteins for the DNA-copying machinery to start replication at the right point in the cell’s life cycle. Researchers have a pretty good idea of which proteins do what, because they’ve managed to make DNA replication happen in cell-free biological mixtures in the lab. They’ve mimicked the first crucial steps in initiation of replication <a href=\"https://www.nature.com/articles/nature14285\" target=\"_blank\">using proteins from yeast</a>—the same kind used to make bread and beer—and they’ve mimicked much of the entire replication process <a href=\"https://www.nature.com/articles/s41586-022-04759-1\" target=\"_blank\">using human versions of replication proteins</a>, too.</p>\n<p>The cell controls the start of DNA replication in a two-step process. The whole goal of the process is to control the actions of a crucial enzyme—called a helicase—that unwinds the DNA double helix in preparation for copying it. In the first step, inactive helicases are loaded onto the DNA at the origins, where replication starts. During the second step, the helicases are activated, to unwind the DNA.</p>\n<h2>Ready (load the helicase) …</h2>\n<p>Kicking off the process is a cluster of six proteins that sit down at the origins. Called ORC, this cluster is <a href=\"https://www.nature.com/articles/nature14239\" target=\"_blank\">shaped like a double-layer ring</a> with a handy notch that allows it to slide onto the DNA strands, Berger’s team has found.</p>\n<p>In baker’s yeast, which is a favorite for scientists studying DNA replication, these start sites are easy to spot: They have a specific, 11- to 17-letter core DNA sequence, rich in adenine and thymine chemical bases. Scientists have watched as ORC grabs onto the DNA and then slides along, <a href=\"https://www.nature.com/articles/s41467-021-22216-x\" target=\"_blank\">scanning for the origin sequence</a> until it finds the right spot.</p>\n<p>But in humans and other complex life forms, the start sites aren’t so clearly demarcated, and it’s not quite clear what makes the ORC settle down and grab on, says Alessandro Costa, a structural biologist at the Crick Institute who, with Diffley, wrote <a href=\"https://www.annualreviews.org/doi/10.1146/annurev-biochem-072321-110228\" target=\"_blank\">about DNA replication initiation</a> in the 2022 Annual Review of Biochemistry. Replication seems more likely to start in places where the genome—normally tightly spooled around proteins called histones—has loosened up.</p>\n<div><img alt=\"The initiation of DNA replication starts at the tail end of the previous cell division and continues through the cell cycle phase known as G1. DNA synthesis happens during the S phase. Levels of a protein called CDK are critical to ensuring that DNA is replicated once and only once. When CDK levels are low, helicases can jump onto the DNA and start to unwind it. But repeat binding does not happen because CDK levels rise, and this blocks the helicase from binding again.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-30-at-09-19-03-Clever-DNA-tricks.png\" /><p>The initiation of DNA replication starts at the tail end of the previous cell division and continues through the cell cycle phase known as G1. DNA synthesis happens during the S phase. Levels of a protein called CDK are critical to ensuring that DNA is replicated once and only once. When CDK levels are low, helicases can jump onto the DNA and start to unwind it. But repeat binding does not happen because CDK levels rise, and this blocks the helicase from binding again. (credit: <a href=\"https://knowablemagazine.org/article/living-world/2023/how-dna-is-copied\">Knowable Magazine</a>)</p></div>\n<p>Once ORC has settled onto the DNA, it attracts a second protein complex: one that includes the helicase that will eventually unwind the DNA. Costa and colleagues used electron microscopy to work out how ORC <a href=\"https://www.nature.com/articles/s41586-019-1768-0\" target=\"_blank\">lures in first one helicase, and then another</a>. The helicases are also ring-shaped, and each one opens up to wrap around the double-stranded DNA. Then the two helicases close up again, facing toward each other on the DNA strands, like two beads on a string.</p>\n<p>At first, they just sit there, like cars with no gas in the tank. They haven’t been activated yet, and for now the cell goes about its usual business.</p>\n<div><a name=\"page-2\"></a></div>\n<h2>Get set (activate the helicase)...</h2>\n<p>Things kick into high gear when a crucial molecule called CDK waves the green flag, jump-starting chemical steps that lure in even more proteins. One of them is DNA polymerase—what Costa calls the “typewriter” that will build new DNA strands—which hitches onto each helicase. Others activate the helicases, which can now burn energy to chug along the DNA.</p>\n<p>As this occurs, the helicases change shape, pushing on one DNA strand and pulling on the other. This creates strain on the weak hydrogen bonds that normally hold the two strands together by the bases—the As, Cs, Ts and Gs that make up the rungs of the DNA ladder. The two strands get ripped apart. Costa and colleagues have observed how the two helicases <a href=\"https://www.nature.com/articles/s41586-022-04829-4\" target=\"_blank\">untwist the DNA between them</a>, and they’ve seen how the helicases keep the unbound bases stable and out of the way.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-30-at-09-20-12-Clever-DNA-tricks.png\"><img alt=\"Left: Several genes involved in the initiation of DNA replication (horizontal axis) are amplified—that is, mistakenly copied in extra numbers — to varying degrees (vertical axis) in different cancers. Right: On chromosome 8, a cluster of three genes—shown in green text—are frequently amplified together in certain cancers.\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-30-at-09-20-12-Clever-DNA-tricks-640x438.png\" srcset=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-30-at-09-20-12-Clever-DNA-tricks.png 2x\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/Screenshot-2023-06-30-at-09-20-12-Clever-DNA-tricks.png\">Left: Several genes involved in the initiation of DNA replication (horizontal axis) are amplified—that is, mistakenly copied in extra numbers — to varying degrees (vertical axis) in different cancers. Right: On chromosome 8, a cluster of three genes—shown in green text—are frequently amplified together in certain cancers.</a> (credit: <a href=\"https://knowablemagazine.org/article/living-world/2023/how-dna-is-copied\">Knowable Magazine</a>)</p></div>\n<h2>Go!</h2>\n<p>At first, both helicases are wrapped around both strands of DNA, and they can’t get very far like this, because they are facing each other and will just run into each other. But next, they each undergo a change in position, spitting one DNA strand or the other out of the ring. Now separated, they can jostle past each other, and replication proceeds apace.</p>\n<p>Each helicase motors along its single strand, in the opposite direction from the other. They leave the origin behind and yank apart those hydrogen-bonded base pairs as they travel. The DNA polymerase is right behind, copying the DNA letters as they’re freed from their partners.</p>\n<p>CDK’s second job is to stop any more helicases from hopping on the origins. Thus, there is one start of replication per origin, ensuring proper copying of the genome—although copying doesn’t begin at the same time at each site. The whole process of DNA replication, in human cells, takes about eight hours.</p>\n<p>There is still plenty to be worked out. For one thing, the DNA that’s being copied is not a naked double helix. It’s wrapped around histones and attached to lots of other proteins that are busy turning genes on or off or <a href=\"https://knowablemagazine.org/article/living-world/2020/what-do-genes-do-things-know\" target=\"_blank\">making RNA copies of the genes</a>. How do those jostling proteins affect each other and avoid getting in each other’s way?</p>\n<p>Beyond this fascinating, fundamental biology—a remarkable process essential for all life on Earth—there are implications for diseases like cancer. Scientists already know that faulty replication can destabilize DNA, and an unstable genome that’s prone to mutation may be an early hallmark of cancer development. And they are <a href=\"https://reporter.nih.gov/search/kOCJ2EoIXUyMRjVy9712gA/projects\" target=\"_blank\">further investigating</a> links between replication proteins and cancer.</p>\n<p>“I think that there are opportunities for therapeutic interventions for these systems,” says Berger, “once we have enough insights about how they work and what they look like.”</p>\n<p><em><b>Amber Dance</b>, a science writer in the Los Angeles area, also likes to break large tasks into smaller segments: It took her five days to complete the steps to draft this article. This article originally appeared in <a href=\"https://knowablemagazine.org/article/living-world/2023/how-dna-is-copied\">Knowable Magazine</a>, an independent journalistic endeavor from Annual Reviews. Sign up for the <a href=\"https://www.knowablemagazine.org/page/newsletter-signup\">newsletter</a>.</em></p>\n<p><img src=\"https://www.knowablemagazine.org/assets/images/logo-k.svg\" alt=\"Knowable Magazine | Annual Reviews\" /></p>\n</div>\n\n</div><p><a href=\"https://arstechnica.com/?p=1951322\">Read on Ars Technica</a> | <a href=\"https://arstechnica.com/?p=1951322&amp;comments=1\">Comments</a></p>","author":"Knowable Magazine","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9ed634e2229c8605c3d15f56c4caf551936bb054192757696740a262a6854e63","category":"Tech"}