{"title":"ถึงคราว TikTok โดนสอบสวน GDPR เก็บข้อมูลเด็กอย่างไร ส่งข้อมูลส่วนตัวกลับไปยังจีนหรือไม่","link":"https://www.blognone.com/node/124762","date":1631693155000,"content":"<div><div><div><p>คณะกรรมการคุ้มครองข้อมูลของไอร์แลนด์ ซึ่งเป็นหน่วยงานบังคับใช้กฎระเบียบให้ความคุ้มครองข้อมูลส่วนบุคคลของผู้บริโภคของสหภาพยุโรปหรือ GDPR เริ่มการสอบสวน TikTok เกี่ยวกับการจัดการข้อมูลของเด็กและจากการถูกกล่าวหาว่า TikTok ถ่ายโอนข้อมูลผู้ใช้ไปยังประเทศจีน</p>\n<p>ในการสอบสวนจะตรวจสอบการประมวลผลข้อมูลส่วนบุคคลของเด็กอายุต่ำกว่า 18 ปี รวมถึงมาตรการตรวจสอบอายุของเด็กอายุต่ำกว่า 13 ปีว่าใช้เทคโนโลยีอะไร มีมาตรการอย่างไร</p>\n<p>ถ้าผลการสอบสวนพิสูจน์ว่าม่ีความผิด TikTok จะถูกสั่งปรับ 4% ของรายได้ทั้งปี ซึ่ง ByteDance บริษัทแม่ TikTok ได้รายงานรายรับต่อปีอยู่ที่ 34.3 พันล้านดอลลาร์ในปี 2020 ซึ่งเพิ่มขึ้น 111% จากปีก่อนหน้า นอกจากนี้ TikTok กำลังจะเปิดสำนักงานใหญ่ในดับลินด้วย</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/172e9ad686463d6e37f46e91c0994c96.jpg\" /><br />\nภาพจาก <a href=\"https://news.aa.com/news/default.aspx\">American Airlines Newsroom</a></p>\n<p>แน่นอนว่า TikTok ยืนกรานปฏิเสธว่าไม่ได้ส่งข้อมูลไปยังประเทศจีน และช่วง 1-2 ปีที่ผ่านมาโดยเฉพาะในรัฐบาลโดนัลด์ ทรัมป์ TikTok อยู่ในสถานการณ์ลำบาก เสี่ยงโดนแบนในสหรัฐฯ อันเนื่องมาจากการเมืองระหว่างประเทศสหรัฐ-จีน ในตอนนั้นมีความเป็นไปได้สูงมากที่ต้องขายบริษัทออกไป</p>\n<p>หากไม่นับเรื่องข้อกล่าวหาการส่งข้อมูลกลับไปยังจีน TikTok ก็โดนข้อกล่าวหาเรื่องความเป็นส่วนตัวอยู่เนืองๆ ล่าสุดคือสหราชอาณาจักร นำโดย Anne Longfield อดีตกรรมาธิการเด็กของอังกฤษ ที่ออกมากล่าวหาว่า TikTok เก็บข้อมูลเด็กโดยไม่ได้รับความยินยอม</p>\n<p>ที่มา - <a href=\"https://www.ft.com/content/31da34b7-5610-43a9-b9ee-78ef166ccd5c\">Financial Times</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/privacy\">Privacy</a></div><div><a href=\"/topics/gdpr\">GDPR</a></div><div><a href=\"/topics/ireland\">Ireland</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9ed7a80854f9b164fa558ea1e541a7786928c44fd3be4adf08f1be401e6754db","category":"Thai"}