{"title":"Exploring perceptions of self-stigma of substance use and current alcohol and marijuana use patterns among college students","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301535","date":1712325600000,"content":"<p>by Victoria O. Chentsova, Adrian J. Bravo, Eleftherios Hetelekides, Daniel Gutierrez, Mark A. Prince, Stimulant Norms and Prevalence (SNAP) Study Team </p>\r\nBackground <p>While research has examined the effect of stigma from others towards individuals with substance use disorders, few studies have examined the relationship between perceived self-stigma and engagement in substance use more broadly, especially among non-clinical samples.</p> Aims <p>The present study examined the relationships between perceptions of self-stigma if one were to develop a substance use disorder, consisting of negative self-esteem and negative self-efficacy, and alcohol or marijuana use behaviors and outcomes.</p> Method <p>Participants (<i>n</i> = 2,243; 71.5% female) were college students within the U.S. recruited to participate in an online survey on substance use with a special focus on alcohol and marijuana.</p> Results <p>Results indicated no significant differences in stigma scores across individuals with different lifetime alcohol and marijuana use. Stigma ratings did differ between individuals with different profiles of last 30-day alcohol and marijuana use where, generally, individuals with lifetime use but no use in the last 30-day reported higher levels of self-stigma. Correlation analyses indicated that perceived impact of substance use disorder on sense of self-efficacy and self-esteem related negatively to nearly all observed factors of alcohol and marijuana use.</p> Conclusions <p>Though self-stigma, and stigma more broadly, has been shown to have negative implications for people with substance use disorders, the present study suggests that for non-clinical populations there may be some protective association between perceived self-stigma and alcohol or marijuana use engagement. This is not to say that self-stigma is a positive clinical intervention. Rather, we interpret these findings to indicate that negative perceptions of substance use disorder on the sense of self may be associated with distinct alcohol and marijuana use behaviors among young adults.</p>","author":"Victoria O. Chentsova","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9edfbed4d88331624b3679f790e6c8b7ed4bcecb4e86a308888f52ba6993a862","category":"Interdisciplinary"}