{"title":"Best indoor bikes 2023 | Everything you need to know about dedicated smart bikes","link":"https://www.bikeradar.com/advice/buyers-guides/indoor-bikes/","date":1683036000000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2020/11/Wattbike-Atom-5-06ec8bd.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Wattbike Atom indoor smart bike\" title=\"Wattbike Atom indoor smart bike\" />                                            <p><span>The best smart bikes are more effective and realistic than ever, with great power accuracy, adjustable positions and even features such as simulated gradients. </span></p>\n<p><span>If you’re growing to love cycling in the great indoors</span><span>, whether that’s to beat bad weather or make the most of limited time, a smart bike provides a dedicated training setup designed for the task in hand.</span></p>\n<p><span>Unlike the turbo, a smart bike packages up everything you need to ride indoors in one bundle. You don’t need to worry about <a href=\"https://www.bikeradar.com/advice/fitness-and-training/using-bike-on-turbo-trainer/\">using your carbon fibre bike on the turbo trainer</a>, nor do you need to be concerned about the increased wear and tear of expensive components. </span></p>\n<p><span>On the flip side, smart bikes are a significant investment and require space for a dedicated <a href=\"https://www.bikeradar.com/advice/fitness-and-training/tips-for-building-the-ideal-indoor-training-space/\">indoor training space</a>.</span></p>\n<p>Here’s BikeRadar’s pick of the indoor bikes we’ve tested, plus our <a href=\"#buyersguide\">buyer’s guide</a> on what to look for if you’re thinking about splashing out on a smart bike.</p>\n<h2>Best indoor bikes in 2023</h2>\n<h3>Wahoo Kickr Bike</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Wahoo Kickr Bike impressed our tester with its sense of realism.</span></figcaption><span> <i>James Witts / Our Media</i></span></div>\n<ul><li>£4,000/$4,000/€4,000/AU$6,5000 as tested</li>\n<li>Realistic ride</li>\n<li>Wide compatibility (including Zwift and TrainerRoad)</li>\n<li>Broad top tube</li>\n</ul><p>The second-generation Wahoo Kickr Bike provides an incredibly realistic ride, with plenty of adjustability, accuracy and reliability justifying the high price tag.</p>\n<p>Wahoo has added WiFi connectivity to the latest Kickr Bike. Our tester experienced no connection dropouts during testing despite racking up hundreds of kilometres on <a href=\"https://www.bikeradar.com/features/tech/zwift-vs-wahoo-x-vs-trainerroad/\">Wahoo X</a>.</p>\n<p>The real-time gradient change function is a standout feature of this bike. Whether tilting forward or back, this is a smooth process that adds to the experience and edges virtual riding closer to reality.</p>\n<p>Wahoo claims the bike’s power measurement is within 1 per cent accuracy. Our tester found its readings matched his heart rate and wattage data from using the Wattbike Atom.</p>\n<p>The large flywheel and motor combine for a quiet ride, with only a gentle hum emanating from the static bike.</p>\n<p>The only real downside to the Wahoo Kickr Bike is the wide top tube, which is broader than an outdoor bike and could cause issues if you have wider thighs.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/wahoo-kickr-bike-smart-bike-review/\">Read our full Wahoo Kickr Bike review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Stages SB20 Smart Bike</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Stages SB20 is secure while feeling like an outdoor bike.</span></figcaption><span> <i>Stages Cycling</i></span></div>\n<ul><li>£2,249 as tested</li>\n<li>Easy to assemble and use</li>\n<li>Authentic ride experience</li>\n<li>Quality construction</li>\n</ul><p>The Stages Cycling SB20 is a smart bike from a brand best known for its <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meters</a>.</p>\n<p>As you’d expect from an indoor bike, it’s much more expensive than a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-smart-trainer/\">smart trainer</a> – but, as an all-in-one package, it leaves your other bike free to ride outside.</p>\n<p>The SB20’s saddle and cockpit can be micro-adjusted, allowing you to fine-tune the fit, and there are four crank-length options.</p>\n<p>You can also choose your preferred shifting configuration (Shimano, SRAM, Campagnolo) and customise your drivetrain, thanks to the in-built shift buttons, but there’s no tactile feedback when making gear changes.</p>\n<p>The SB20 can be connected to the most popular indoor training <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-indoor-cycling-apps/\">apps</a>, including <a href=\"https://www.bikeradar.com/advice/fitness-and-training/best-zwift-setups-for-every-rider/\">Zwift</a>. The Stages Link app also allows you to save virtual bikes and monitor workout data.</p>\n<p>This is a heavy piece of kit and arrives in a 100kg-plus box but, once you’ve completed the straightforward setup process, the SB20’s bulk keeps it firmly in place when putting in efforts.</p>\n<p>Stages says the bike can register 2,200 watts. Although our tester couldn’t verify this, they couldn’t fault the in-built power meter’s accuracy. The bike also produces a smooth, fluid pedalling sensation and remains quiet during efforts.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/resistance-trainer/stages-cycling-sb20-smart-bike-review/\">Read our full Stages SB20 Smart Bike review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Wattbike Atom (Next Generation)</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>4.0 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The Wattbike Atom is easy to set up and adjust.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<ul><li>£1,899 as tested</li>\n<li>Easy to set up and adjust with good connectivity</li>\n<li>Lots of metrics and plenty of training routines available from Wattbike</li>\n</ul><p>The Wattbike Atom is easy to set up and get connected to your computer, tablet (for which there’s integrated support) or smartphone, as well as third-party indoor training apps, including <a href=\"https://www.bikeradar.com/features/zwift-your-complete-guide/\">Zwift</a>. There are plenty of training routines available in the accompanying Wattbike app, too.</p>\n<p>It’s easy to change <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-get-your-bike-saddle-height-right/\">saddle height</a>, <a href=\"https://www.bikeradar.com/advice/workshop/how-to-adjust-your-handlebar-height/\">handlebar height</a> and a number of bike fit adjustments, but <a href=\"https://www.bikeradar.com/advice/sizing-and-fit/what-is-the-best-crank-length-for-cycling/\">crank length</a> is fixed at 170mm. Although it’s heavy, you can roll the Atom around on its small front wheels.</p>\n<p>With a chain drive for the resistance unit, there’s an outdoor bike feel to the Atom, although that does generate a bit more noise than its competitors. The drop handlebar at the front mimics the setup of a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-road-bikes/\">road bike</a> but, with 22 sequential gears, set ratios and no brake levers, that’s where the comparison ends.</p>\n<p>The Atom generates loads of data on power output, pedalling smoothness and other metrics, although when doing <a href=\"https://www.bikeradar.com/advice/fitness-and-training/hiit-interval-training/\">HIIT sessions</a>, we found the lag when changing resistance sometimes made for awkward transitions.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/wattbike-atom-next-generation-review/\">Read our full Wattbike Atom review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Also consider…</h2>\n<p>The following indoor bike scored fewer than 4 out of 5 stars in our reviews but is still worth considering.</p>\n<h3>Tacx NEO Bike Smart</h3>\n            <div>\n                <div>\n            <div>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                                    <i></i>\n                            </div>\n            <span>\n                <span>3.5 out of 5 star rating</span>\n                            </span>\n        </div>\n    </div>\n\n<ul><li>\n    </li>\n</ul><div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Road Feel, Gear Feel and Descent Simulation features increase the realism on the Tacx NEO Bike.</span></figcaption><span> <i>Tom Marvin / Immediate Media</i></span></div>\n<ul><li>£2,299 / $3,200 / €2,600 / AU$5,000 as tested</li>\n<li>Tricky adjustment</li>\n<li>Works well in Normal mode, but difficult to maintain correct power in Erg mode</li>\n</ul><p>The step-through frame of the Tacx NEO Bike Smart makes getting on and off easy and there’s an extension for your tablet, which also includes a couple of fans and the bike’s display.</p>\n<p>There’s lots of adjustment possible, including crank length, although it’s a bit fiddly to get your setup right. You can adjust the gear ratios to match your outdoor bike; the Shimano-like shifters were awkward to use, though. We found that we had to supplement the small, built-in fans to get effective cooling.</p>\n<p>The Tacx NEO doesn’t tilt like the Wahoo Kickr Bike, but the Road Feel, Gear Feel and Descent Simulation features do add to the ride realism.</p>\n<p>In Normal mode, the NEO Smart’s resistance changes were realistic through the testing period, but in <a href=\"https://www.bikeradar.com/advice/fitness-and-training/erg-mode/\">ERG mode</a>, the bike sometimes struggled to maintain the power required by Zwift.</p>\n<ul><li><a href=\"https://www.bikeradar.com/reviews/training/indoor-trainers/tacx-neo-bike-smart-review/\">Read our full  Tacx NEO Bike Smart review</a></li>\n</ul><div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<hr /><h2>Other options</h2>\n<p>The smart bike market has grown significantly in the past couple of years. We haven’t tested these indoor bikes, but here’s a range of alternative options.</p>\n<h3>TrueKinetix TrueBike</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The TrueBike has a flywheel-free design.</span></figcaption><span> <i>TrueKinetix</i></span></div>\n<p><span>The TrueBike is a neat-looking option from Dutch brand TrueKinetix. </span></p>\n<p><span>Priced at €3,250, the company says it’s designed to offer a realistic ride feel, with an algorithm that takes into account factors including your weight.</span></p>\n<p><span>Its flywheel-free design will provide resistance of up to 1,500 watts and simulate gradients of up to 15 per cent up or down, with 22 gears and connectivity to Zwift and other training apps.</span></p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>SRM SmartIT</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The SmartIT is SRM’s take on the smart bike.</span></figcaption><span> <i>SRM</i></span></div>\n<p><span>If you’ve got deep pockets and have become accustomed to hunkering down in your bunker, there’s the </span><a href=\"https://www.bikeradar.com/news/srm-smartit-indoor-training-bike/\"><span>SRM SmartIT</span></a><span>.</span></p>\n<p>Unlike most of its competitors, the SmartIT runs off a regular drivetrain with 11-speed shifting courtesy of Shimano 105 components. Resistance is controlled via a handlebar-mounted remote, plus it has wireless connectivity for use with third-party software. SRM says the SmartIT can simulate up to 1,400 watts.</p>\n<p><span>It’s a suitably spendy option from the maker of the pros’ favoured power meter, and it’s fair to say the design doesn’t quite look as sleek as other options we’ve listed here. </span></p>\n<p><span>It does, however, incorporate SRM’s Origin power meter, which the brand says has an accuracy of +/- 1%. That, however, does mean crank length is fixed.</span></p>\n<p><span>The 65kg weight and stainless steel frame mean you’ll probably want a home gym to keep the SRM in – but you’ve got that already, haven’t you?</span></p>\n<div>\n    <h5>Latest deals</h5>\n    <div></div>\n    <div></div></div>\n\n<h3>Peloton</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Peloton has made a splash in recent years, but is aimed more at the home fitness crowd.</span></figcaption><span> <i>Peloton</i></span></div>\n<p><span>Peloton’s exercise bike is another indoor training solution, although unlike the other options featured here, this one isn’t really designed specifically with cyclists in mind. It</span><span>’s more of a replacement for the spinning classes at your gym than support for structured cycling workouts. </span></p>\n<p><span>Unlike most smart bikes, power is an estimate from an algorithm based on <a href=\"https://www.bikeradar.com/advice/skills/what-is-cycling-cadence/\">cadence</a> and resistance – there’s no strain gauge built into the bike.</span></p>\n<p><span>There is, however, a built-in screen to pipe video of live daily classes to you, as well as access to Peloton’s library of workouts. There’s also a monthly fee, though that does give you access to community features such as leaderboards, music and playlists.</span></p>\n<p><span>Peloton is a closed system, so you won’t be able to hook it up to third-party training apps.</span></p>\n<hr /><h2>Buyer’s guide to indoor bikes</h2>\n<h3>What does an indoor bike offer?</h3>\n<p><span>Unlike the spin bikes you might see in a gym, the latest generation of smart bikes are designed with dedicated cyclists in mind. You can expect accurate power measurement, a highly adjustable position and variable (and automatically controlled) resistance to give you the best <a href=\"https://www.bikeradar.com/advice/fitness-and-training/beginners-guide-to-indoor-training-all-you-need-to-get-started/\">indoor training</a> experience.</span></p>\n<p><span>Whereas an indoor exercise bike will usually have limited manual adjustability to resistance, indoor smart bikes use similar tech to smart trainers and are designed to offer a realistic, road-like feel when pedalling.</span></p>\n<p><span>They will measure your power output and, if you want them to, automatically adjust resistance, whether that’s to match the incline of a virtual road on </span><span>Zwift</span><span> or so you hit the required wattage in a </span><span>structured workout</span><span>.</span></p>\n<p>The best indoor bikes will offer lots of adjustment, too, including saddle height and fore/aft, handlebar position and even crank length, allowing you to replicate the position of your regular bike. That adjustability will also allow multiple members of the same household to use the bike.</p>\n<h3>Connectivity to third-party training apps</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Cycling-specific smart bikes offer wireless connectivity to link up to apps.</span></figcaption><span> <i>Wahoo</i></span></div>\n<p><span>Most smart bike brands offer workouts developed in-house, as well as Bluetooth and/or ANT+ connectivity to third-party apps such as Zwift, Wahoo SYSTM, <a href=\"https://www.bikeradar.com/advice/buyers-guides/rgt-cycling-guide/\">RGT Cycling</a> and TrainerRoad.</span></p>\n<p><span>Training apps provide a much more engaging and immersive indoor ride experience, often with a video or virtual simulation of outdoor terrain. They’ll also let you </span><a href=\"https://www.bikeradar.com/advice/fitness-and-training/zwift-group-rides/\"><span>challenge your mates</span></a>, embark on a training plan<span> or simply ride against others.</span></p>\n<h2>Do you have the space?</h2>\n<p><span>Unlike most turbo trainers or <a href=\"https://www.bikeradar.com/advice/fitness-and-training/how-to-ride-on-rollers/\">rollers</a>, which fold down for storage, smart bikes are a permanent fixture.</span></p>\n<p><span>What’s more, in order to handle a cyclist riding at full tilt or out of the saddle, smart bikes are usually heavy and have large bases, so they’re not something you will want to lug around. Nor will they fit in the bottom of a cupboard when not in use. </span></p>\n<p><span>With that in mind, you’ll want to make sure you’ve got the space for a smart bike, with an electricity supply close by so it’s set up ready to ride.</span></p>\n<p><span>Plus, all that tech is pricey – a dedicated smart indoor bike will set you back at least four figures, and a lot more for the latest crop of machinery.</span></p>\n<p><span>The flip side, of course, is a dedicated, high-tech training tool ready for you to jump on at any point.</span></p>","author":"Paul Norman","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"9ee13655f9629452f2204a4408bd308b5622069c76110a272c2ddfa0b3f9d1d8","category":"Cycling"}