{"title":"Scoping review of hearing loss attributed to congenital syphilis","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302452","date":1714140000000,"content":"<p>by Aleena Amjad Hafeeez, Karina Cavalcanti Bezerra, Zaharadeen Jimoh, Francesca B. Seal, Joan L. Robinson, Nahla A. Gomaa</p>\r\nBackground <p>There are no narrative or systematic reviews of hearing loss in patients with congenital syphilis.</p> Objectives <p>The aim of this study was to perform a scoping review to determine what is known about the incidence, characteristics, prognosis, and therapy of hearing loss in children or adults with presumed congenital syphilis.</p> Eligibility criteria <p>PROSPERO, OVID Medline, OVID EMBASE, Cochrane Library (CDSR and Central), Proquest Dissertations and Theses Global, and SCOPUS were searched from inception to March 31, 2023. Articles were included if patients with hearing loss were screened for CS, ii) patients with CS were screened for hearing loss, iii) they were case reports or case series that describe the characteristics of hearing loss, or iv) an intervention for hearing loss attributed to CS was studied.</p> Sources of evidence <p>Thirty-six articles met the inclusion criteria.</p> Results <p>Five studies reported an incidence of CS in 0.3% to 8% of children with hearing loss, but all had a high risk of bias. Seven reported that 0 to 19% of children with CS had hearing loss, but the only one with a control group showed comparable rates in cases and controls. There were 18 case reports/ case series (one of which also reported screening children with hearing loss for CS), reporting that the onset of hearing loss was usually first recognized during adolescence or adulthood. The 7 intervention studies were all uncontrolled and published in 1983 or earlier and reported variable results following treatment with penicillin, prednisone, and/or ACTH.</p> Conclusions <p>The current literature is not informative with regard to the incidence, characteristics, prognosis, and therapy of hearing loss in children or adults with presumed congenital syphilis.</p>","author":"Aleena Amjad Hafeeez","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9ee4549b414e812bca0c3dd780a62aa9d481914621b29c3d71f69766c2cefc15","category":"Interdisciplinary"}