{"title":"The 2021 Swim/Bike/Run Gear I Use List","link":"https://www.dcrainmaker.com/2021/12/gear-i-use-swim-bike-run-list.html","date":1638369736000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/12/GearIUse2021.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/GearIUse2021_thumb.jpg\" /></a></p>\n<p>I know, I know, I’m about <a href=\"https://www.dcrainmaker.com/2019/07/the-2019-swim-bike-run-gear-i-use-list.html\" target=\"_blank\">two years behind</a> on a refreshed ‘Gear I Use’ list. Which, is probably because, for the most part, I’m a creature of habit. While I might (ok, definitely) buy plenty of sports gadgets, the rest of my gear remains almost identical. My winter cycling coat? The same from 12 years ago (seriously, here’s the <a href=\"https://www.dcrainmaker.com/2009/04/riding-into-night.html\">same blue coat to prove it</a>). My socks? The same brand as a decade ago too. I buy maybe a single piece or two of cycling/running apparel each year, usually over Black Friday weekend (which, I didn’t this year).</p>\n<p>Nonetheless, I know plenty of you want to know what gear I use. So thus, I present you with a boatload of links. And while there’s a lot of gear here (<strong>because I’m covering three sports</strong>), I think you’ll find I’m actually pretty simple when it comes to most of my gear (tech goodies aside). And this gear is built up over more than a decade.</p>\n<p>I’ve divided it up into the three main sports (swim/bike/run), plus a random section at the end.  Obviously, I don’t use all this gear at the same time.  For example, cold-weather swim booties are reserved for those <a href=\"https://www.dcrainmaker.com/2011/06/ironman-boise-703-2011-race-report.html\">hideous cold weather triathlons</a> that I’ve succeeded in avoiding in the past decade. I have zero plans to do any crazy-cold weather triathlons anytime soon (though some year the Norseman Triathlon might still tempt me), so the booties basically just hang out in a container in the DCR Cave.</p>\n<p>As anyone will tell you – there’s a lot of gear to be had for triathlon, and there’s unfortunately simply no getting around that.  I’m typically not one to buy the most expensive piece of fashionable stuff – and apparel brands don’t tend to mean a lot to me.  I just buy what works for me.  None of these brands sponsor me or anything here.  <strong>Everything on this list I’ve bought myself and use day to day.</strong></p>\n<p><strong>Also note:</strong> This is NOT my usual gadget recommendations post, that’s different. This is simply the gear I happen to use myself. If you’re looking for my specific recommendations on gear, you’ll find my <a href=\"https://www.dcrainmaker.com/2021/11/best-gps-sport-smartwatches-recommendations-guide-2021.html\">GPS watch recommendations here</a>, my <a href=\"https://www.dcrainmaker.com/2021/11/best-cycling-gps-computers-recommendations.html\">cycling GPS guide here</a>, and <a href=\"https://www.dcrainmaker.com/2020/11/smart-cycle-trainer-recommendations-guide-winter.html\">my trainer recommendations here</a> (still accurate from last year given only one new trainer in 2021, the <a href=\"https://www.dcrainmaker.com/2021/07/jetblack-volt-smart-trainer-in-depth-review.html\">JetBlack VOLT was released</a>, which I’ve added to the recommendations guide).</p>\n<h3><span>Swimming:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/DCR-Swim-Gear.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/DCR-Swim-Gear_thumb.jpg\" /></a></p>\n<p>Perhaps the easiest category, simply due to the least amount of stuff on one’s body.  At least most of the time.  I start off with the three basics, and then the drill stuff – and then the open water swimming pieces.</p>\n<p><strong>Swimsuit:</strong> <a href=\"https://amzn.to/2PkvaAw\">Nike Victory Jammer</a> and <a href=\"https://www.decathlon.com/collections/swimming-boxers-briefs/products/mens-boxer-swimming-shorts-b-active?\">Decathlon Boxer swim Short</a>: I use both, for example in the above shot it’s the shorter Decathlon one.<br />\n<strong>Goggles:</strong> <a href=\"https://www.amazon.com/Speedo-Fastskin-Speedsocket-Swimming-Goggles/dp/B01M65QSJV?keywords=Speedo+Unisex+Fastskin+Speedsocket&amp;qid=1638363441&amp;sr=8-1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=9c7b0fd76040262930205389176e5750&amp;language=en_US&amp;ref_=as_li_ss_tl\">Speedo Fastskin Speedsocket 2</a> and <a href=\"https://www.amazon.com/dp/B07CFFHK11?psc=1&amp;pd_rd_i=B07CFFHK11&amp;pd_rd_w=asdDI&amp;pf_rd_p=8a8f3917-7900-4ce8-ad90-adf0d53c0985&amp;pd_rd_wg=POS7m&amp;pf_rd_r=CNH0VM85EYX396V4PW4V&amp;pd_rd_r=b8ccca59-f065-4f7d-b51e-44c685e60484&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=842dc30193ba7bcfa9e1c68dfd98d925&amp;language=en_US&amp;ref_=as_li_ss_tl\">Speedo Vanquisher</a>: For the most part, it’s whatever I haven’t lost recently. At present, this is what I ordered after I managed to lose my most recent pair of goggles, whereas pictured above from this summer is the Vanquisher. Goggles are like socks in the dryer around here.<br />\n<strong>Swim Cap:</strong> Random Race Caps – Essentially whatever I pull from the massive Ziploc bag of past race caps.<br />\n<strong>Swim Watch:</strong> <a href=\"https://www.dcrainmaker.com/2020/09/garmin-forerunner-745-depth-review.html\">Garmin Forerunner 745</a>: Assuming I’m not <a href=\"https://www.dcrainmaker.com/2021/08/massive-openwater-swim-gps-test-accuracy.html\">testing anything else</a>, you’ll likely find me wearing this when in the water.<br />\n<strong>Openwater – Wetsuit:</strong> <a href=\"https://amzn.to/2JU7TE0\">Orca S6 Fullsleeve Wetsuit:</a> This was more a purchase of necessity than anything else. My previous 2XU wetsuit finally died after an apparent shark attack (judging by the holes), and <a href=\"https://www.dcrainmaker.com/2019/02/5-random-things-i-did-this-weekend-85.html\">while down in Cape Town three winters ago</a> I needed something. There was an Orca store near the waterfront, so…problem solved. I’m not thrilled with it though, given it ripped along a seam line on my third wearing. Three winters later the small rip is still there. Sigh.<br />\n<strong>Openwater – Visibility Buoy:</strong> <a href=\"https://www.dcrainmaker.com/2013/06/safer-swimmer-review.html\">Safer Swimmer</a> – When swimming in openwater by myself, I use this to be seen by boats and the like, for example, <a href=\"https://www.dcrainmaker.com/2021/08/massive-openwater-swim-gps-test-accuracy.html\">during these swims</a>.  I take this all around the world with me on virtually all my openwater swims.<br />\n<strong>Openwater – Booties:</strong> <a href=\"https://amzn.to/32NDxM5\">Blueseventy Swim Socks</a> – For 60°F and below water, I use these booties to keep my toes warm. Notably, I try incredibly hard to never swim in such water voluntarily.<br />\n<strong>Openwater – Swim Cap:</strong> <a href=\"https://www.amazon.com/blueseventy-Adjustable-Thermal-Skull-Large/dp/B08VFBTY8Q?keywords=blueseventy+Skull+Cap&amp;qid=1638363340&amp;sr=8-2&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=7685bb5eba19a3e14fde220a33be520c&amp;language=en_US&amp;ref_=as_li_ss_tl\">Blueseventy Skull cap</a> – Again, for super-cold water (looking at you, <a href=\"https://www.dcrainmaker.com/2011/06/ironman-boise-703-2011-race-report.html\">Boise 70.3</a>), I use this swim cap – but I cut off the annoying chin strap (most people do).<br />\n<strong>Openwater – Anti-chaff:</strong> <a href=\"https://www.amazon.com/Body-Glide-Original-Anti-Chafe-0-80oz/dp/B01IBVUY6Y?pd_rd_i=B01IBVUY6Y&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=e1923cbb0e672f971a1fc65a8ffc5667&amp;language=en_US&amp;ref_=as_li_ss_tl\">BodyGlide</a> – To prevent any wrong rubbing of the wetsuit near my neck.  Works well, every triathlete should have it in their swim bag.</p>\n<p>Invariably, a strictly pool swimmer will say that’s a lot of gear – but if you divide it up (normal vs openwater), it’s really not that much stuff…especially compared to cycling. Some will ask why not the <a href=\"https://www.dcrainmaker.com/2020/07/hands-on-form-goggles-openwater-swim-mode-released-for-apple-garmin-watches.html\">FORM Swim goggles</a>. Simply put – while I think the tech side of the unit is superb, and super-well executed, I just can’t get past the limited side peripheral vision visibility of the goggles. In openwater swims, seeing what’s out and about keeps me just as entertained as it does watching the denizens of the pool go past. With the FORM swim goggles, that peripheral side visibility just isn’t there anymore.</p>\n<h3><span>Cycling:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/CyclingGear.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/CyclingGear_thumb.jpg\" /></a></p>\n<p>Now once we hit cycling, things can get pretty crazy pretty quick. Such is cycling life!</p>\n<p><strong>Road Bike:</strong> <a href=\"https://www.dcrainmaker.com/2018/01/build-complete-details.html\">Canyon Ultimate CF SL</a> – I built this four years ago and absolutely love it. It’s as much my main bike these days as my core test platform for new cycling gadgets. It was built with testing devices in mind (hence why I skipped aero handlebars, due to complexities with mounts). It’s working great for me as my workhorse, and I could easily see buying another Canyon down the road (mainly because they’re so darn cheap here in Europe).<br />\n<strong>Mountain Bike:</strong> <a href=\"https://www.canyon.com/en-nl/exceed-cf-sl-5.0/50005700.html?utm_source=csemail&amp;utm_medium=email&amp;utm_campaign=customer-email&amp;campaigndate=20200225\">Canyon Exceed CF SL 5.0</a>: Since I ride relatively tame terrain here in the Netherlands, I went with a hardtail, rather than spend more on something I’ll honestly rarely use. But, I’m pretty happy with it.<br />\n<strong>Triathlon Bike:</strong> <a href=\"https://www.cervelo.com/en/triathlon/p-series/p3\">Cervelo P3C </a>– This is undoubtedly getting a bit long in the tooth. Ok, a lot long. But I don’t do as much long-course triathlon anymore, and a chunk of the short-course stuff I do is draft legal, thus, triathlon bikes aren’t permitted.<br />\n<strong>The Cargo Bike:</strong> <a href=\"https://www.urbanarrow.com/en/family\">Urban Arrow:</a> This is how I get all my goods back and forth to the office, as well as get the kiddos (and The Girl) around town. Also, random visitors get stuck in it too. We couldn’t live in Amsterdam without a cargo bike (since we have no car here). We put about 3,500-4,000km per year on it. Actually, we have two of them now. Look, given we don’t own/have any cars, so this is the most practical solution to getting three kids (+ often friends) to their various activities and schools.<br />\n<strong>The Commuter Bike:</strong> <a href=\"https://www.dcrainmaker.com/2012/08/the-800-bike-part-iv-final-result.html\">Trek Belleville</a>: Now, in reality, I rarely ride this bike. For no particular reason other than that I usually ride the cargo bike as my daily commuter, since I’m usually dragging kids around.<br />\n<strong>Power Meter:</strong> Everything? Seriously, I’m not sure what I call ‘my’ power meter anymore. On my main road bike, the three units you’ll usually find on are the Quarq DZero plus a PowerTap G3 wheelset as a reference point for testing. I’ve also got some power meter pedals on there usually. It’ll either be the Garmin Rally pedals or the <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">Favero Assioma</a>. Same goes for my MTB. <a href=\"https://www.dcrainmaker.com/2017/04/quarq-dzero-power-meter-in-depth-review.html\">A Quarq Dzero baseline</a>, followed by a <a href=\"https://www.dcrainmaker.com/2020/04/4iiii-lowers-power-meter-prices-to-299-increases-warranty-to-3-years.html\">4iiii dual-sided crankset</a>, and then a pair of <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">Garmin Rally XC’s</a>.<br />\n<strong>Race Wheels:</strong> <a href=\"https://www.dcrainmaker.com/2013/08/powertaps-bluetooth-trainers.html\">PowerTap G3 Carbon 46mm Wheelset</a>: I’ve been riding variants of these for a while.  I also still own a pair of HED 3’s Tubular, though they’re still down in a friend’s cave in Paris…one one of these trips back to Paris I’ll pick them up…<br />\n<strong>Bike Pedals:</strong> <a href=\"https://www.dcrainmaker.com/2021/03/garmin-rally-power-meter-review-spd-spd-sl-look-keo.html\">Garmin Rally</a> or <a href=\"https://www.dcrainmaker.com/2017/09/favero-assioma-in-depth-review.html\">Favero Assioma pedals</a> – I use them interchangeably on my bikes. I have no use for non-power meter pedals in my line of work. Well, I guess the cargo bike has flats. But give me one boring rainy day and I’ll fix that!<br />\n<strong>Water Bottle:</strong> DC Rainmaker Water Bottle: Duh. Also, because I bought like 1,500 of them. So…yeah. One of these days I’ll figure out how to get these listed in both the US &amp; Europe for sale. Till then, I await the next DCR Open House.<br />\n<strong>Regular Helmet: </strong><a href=\"https://www.dcrainmaker.com/2018/11/specialized-helmet-sensor.html\">Specialized Evade II with ANGi</a> – This helmet includes tracking/crash detection for friends/family (and Specialized changed their policy to no longer require a subscription fee for helmet purchases). Albeit, I almost never connect the app for crash detection, but hey, I like the red color.<br />\n<strong>Sunglasses: </strong><a href=\"https://www.rapha.cc/gb/en/shop/pro-team-frameless-glasses/product/ZER01XX\">Rapha Pro Team Frameless:</a> I finally caved and bought these replacements last summer, after the previous ones I’d had for a number of years got too scratched up.<br />\n<strong>Bike jerseys:</strong> <a href=\"https://www.dcrainmaker.com/2018/09/dcrainmaker-cycling-available.html/\">DC Rainmaker kit by Pedal Mafia</a>: Duh!!! I’ve got both the red and blue variants of course, and use them quite a bit. When not using either of these two I’m using another kit from Pedal Mafia (Cobbled Classic is the name). And failing that, just random bike jerseys I’ve got around that I’ve bought here and there.<br />\n<strong>Bike shorts/bib:</strong><a href=\"https://www.dcrainmaker.com/2018/09/dcrainmaker-cycling-available.html/\"> DC Rainmaker kit by Pedal Mafia</a>: Duh Part II!<br />\n<strong>Road Cycling Shoes:</strong> <a href=\"https://www.amazon.com/Fizik-Overcurve-Classiques-Special-Numeric_7/dp/B088ZSQ8PF?keywords=OVERCURVE+R4&amp;qid=1638364052&amp;sr=8-7&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=bc5f6861e87f944b96086671e560df84&amp;language=en_US&amp;ref_=as_li_ss_tl\">Fizik Tempo Overcurve R4</a>: I bought these after buying the Fizik X5 MTB shoe below, so that…umm…my shoes match. Actually, fun tidbit: I also have a slightly different model/color scheme of shoe for each cleat type: SPD-SL, SPD, LOOK-KEO, and Speedplay. Those being all the cleat types for power meters I test. The reason for the slight differences? At a glance I know I’ve grabbed the right cleat type when packing up the bike, to match the bike I’ve grabbed.<br />\n<strong>Mountain Biking Shoes:</strong> <a href=\"https://amzn.to/2LDShb0\">Fizik X5 Terra:</a> Also somewhat oa purchase of necessity, was down in Cape Town and needed another pair of shoes for mountain biking. X5’s for the win.<br />\n<strong>Cold Weather Bike Coat:</strong> <a href=\"http://www.amazon.com/gp/product/B003XKO8XO/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B003XKO8XO&amp;linkCode=as2&amp;tag=dcr07-20\">Gore Men’s Contest SO Jacket</a> – I layer this over a long sleeve bike jersey. Seriously, I still own this – like 12 or 13 years later or something. On one hand, I probably do need a new coat. On the other hand, it works just fine.<br />\n<strong>Cold Weather Bike Tights:</strong> <a href=\"http://www.amazon.com/gp/product/B002PU9U9U/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B002PU9U9U&amp;linkCode=as2&amp;tag=dcr07-20\">Gore Bike Wear Vista Tights</a> – These work well, and are windproof and reasonably water-resistant – which is sorta the basic requirement for me. Also, 12+ years old.<br />\n<strong>Bike Case:</strong> <a href=\"https://www.amazon.com/Aerus-Biospeed-Bike-Travel-Case/dp/B00PGCGHS6?ie=UTF8&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=9c719f5053b447c38af91aea48d5bb1c&amp;language=en_US&amp;ref_=as_li_ss_tl\">Aerus Biospeed Bike Case</a> – Here’s a <a href=\"https://www.dcrainmaker.com/2011/02/how-i-travel-with-my-bike.html\">bit more in-detail</a> on the case, and how I use it while traveling.  Unfortunately, the Biospeed model isn’t made anymore, but, a new case that appears to be exactly the same is now out (links in that post). I still use this case at least a few times or more a year. My guess is my case has about 250,000+ miles on it by now. No issues. Apparently, the <a href=\"https://www.pikapackworks.com/\">Pika Pack Works case is the same/original</a> and still available.<br />\n<strong>Bike Trainer:</strong> <a href=\"https://www.dcrainmaker.com/2018/12/tacx-neo-2-smart-trainer-in-depth-review.html\">Tacx Neo 2 Smart Trainer at home</a>, and <a href=\"https://www.dcrainmaker.com/2020/08/wahoo-kickr-v5-2020-smart-trainer-in-depth-review.html\">Wahoo KICKR V5 at DCR Cave</a> – This is just sorta how it worked out. One day I brought home my Tacx NEO 2 (not 2T), and it’s sat in the shed ever since. For me the Neo has a heavy ‘just works’ factor from an accuracy standpoint (there’s no calibration). Also, I kinda like the rumble that it creates replicating cobblestones and such. Meanwhile at the office/DCR Cave, if not testing anything else, you’ll find me on the Wahoo KICKR V5. You’ll notice that both of these trainers are essentially no-calibrate trainers.<br />\n<strong>Bike Computer/GPS:</strong> <a href=\"https://www.dcrainmaker.com/2019/04/garmin-edge-530-cycling-gps-in-depth-review.html\">Garmin Edge 530</a> (mostly): Obviously, I’m almost always riding with 3-4 head units for power meter data gathering, but lately I’ve mostly been using the Edge 530, with occasionally the <a href=\"https://www.dcrainmaker.com/2019/04/garmin-edge-830-cycling-gps-in-depth-review.html\">Edge 830</a> floating around. I also semi-rarely will ride with an Edge 1030 Plus, it’s a perfectly great unit, but for whatever reason I’ve grown more fond to the Edge 530. Typically speaking my ‘most preferred’ unit of the 3-4 I ride with is whichever unit I prefer is that I usually put it out on my out-front mount (there are occasional exceptions to this, but that’s usually my tell), versus the others on my handlebars.<br />\n<strong>Speed Sensor:</strong> <a href=\"https://www.dcrainmaker.com/2019/04/garmin-speed-cadence-sensors-v2-with-ant-bluetooth-smart-in-depth-review.html\">Garmin Speed Sensor V2:</a> I don’t use a combo speed/cadence sensor anymore, and frankly I rarely use this speed sensor. But you will find it on my bikes for various test purposes. This version has dual ANT+/Bluetooth Smart, but more importantly, <a href=\"https://www.dcrainmaker.com/2021/04/my-stupidly-overcomplicated-2021-bike-mileage-tracking-project.html\">we use it on the cargo bike since it records each trip</a> even without a head unit and syncs it up.<br />\n<strong>Cadence Sensor:</strong> For the most part, I don’t use a cadence sensor except for occasional test validation. All my power meters transmit cadence, as do many of my non-Wahoo trainers.<br />\n<strong>Heart Rate Strap: <a href=\"https://www.amazon.com/Polar-Heart-Monitor-Bluetooth-Chest/dp/B07H3B1HV6?keywords=Polar+H10&amp;qid=1638364731&amp;sr=8-2-spons&amp;psc=1&amp;smid=A3H9V1EMGQSHX7&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzNTNVRkc0UUVMUkFBJmVuY3J5cHRlZElkPUEwMjQzMjUzMjBYREg4Qk5TRlVCRCZlbmNyeXB0ZWRBZElkPUEwNDk1MjEwMkE5OVdORDZQSTVGUSZ3aWRnZXROYW1lPXNwX2F0ZiZhY3Rpb249Y2xpY2tSZWRpcmVjdCZkb05vdExvZ0NsaWNrPXRydWU%3D&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=962b6ee082cfab39e3de098bd177dec0&amp;language=en_US&amp;ref_=as_li_ss_tl\">Polar H10:</a></strong> If I had to pick just a single strap I use the most, it’s the Polar H10. It’s always reliable and has dual Bluetooth Smart &amp; ANT+. That said, you’ll find an Garmin <a href=\"https://www.dcrainmaker.com/2019/01/garmin-hrm-dual-heart-rate-strap-in-depth-review.html\">HRM-DUAL</a> &amp; <a href=\"https://www.dcrainmaker.com/2020/09/garmin-hrm-pro-chest-strap-depth-review.html\">HRM-PRO</a> usually nearby, as well as a <a href=\"https://www.dcrainmaker.com/2020/01/polars-new-h9-heart-rate-strap-everything-you-ever-wanted-to-know.html\">Polar H9</a> that sits as backup at home.<br />\n<strong>Bike Computer Mount: </strong><a href=\"https://www.amazon.com/Bar-Fly-Aluminum-Cycling-Computers/dp/B01M66Y4H3?ie=UTF8&amp;qid=1538950377&amp;sr=8-2&amp;keywords=barfly+out+front&amp;dpID=31RJTFh6htL&amp;preST=_SX300_QL70_&amp;dpSrc=srch&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=49027cae93299d0a967baa0c85a407b6&amp;language=en_US&amp;ref_=as_li_ss_tl\">Barfly 4 Prime Out-Front Mount:</a> I like this one, it’s metal and has tons of options for swapping to different bike computer types if I need to (such as to Wahoo or what-not). The GoPro mount aspect is functional and the whole thing is solid. But again, it’s just what’s been on my bike the longest lately, I’m also totally good with the K-Edge variants, and in fact, usually ride a K-Edge under-saddle mount for my GoPro.<br />\n<strong>Trainer Apps:</strong> <a href=\"http://www.zwift.com\">Zwift</a>, <a href=\"http://www.trainerroad.com\">TrainerRoad</a>, and <a href=\"https://www.dcrainmaker.com/2021/02/peloton-bike-plus-in-depth-review.html\">Peloton</a>: I pay for subscriptions to all of these (and a number of other platforms for testing), but these three are are what I primarily use. In general, I’ll use all three of those each week, mixing it up.<br />\n<strong>Training Logs:</strong> <a href=\"http://www.strava.com\">Strava</a> &amp; <a href=\"http://www.trainingpeaks.com\">TrainingPeaks</a>: I use Strava as my ‘public’ activity feed (when I remember to toggle it from private to public), and I use TrainingPeaks as my private training log.</p>\n<p>I should mention that I rarely wear arm warmers, and they are just a pair that I picked up at some random demo day somewhere.  In my little mind, if it’s cold enough for arm warmers, it’s cold enough for a long sleeve jersey.  And vice versa.</p>\n<h3><span>Running:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/12/RunningGear.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/12/RunningGear_thumb.jpg\" /></a></p>\n<p><strong>Running Shoes:</strong> <a href=\"https://www.amazon.com/ASICS-Gel-DS-Trainer-Running-Digital/dp/B08VS1WK3W?keywords=Asics%2BGel-DS%2BTrainer%2B26&amp;qid=1638365965&amp;sr=8-1-spons&amp;smid=AU2SJWQ0WCZ47&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEzMUk0REdPUzJYUTdFJmVuY3J5cHRlZElkPUEwMjM5MTk5M0owVEk1WjhJQjEyQSZlbmNyeXB0ZWRBZElkPUEwNDU3Nzg5NVhRSEZaSjVYOVlHJndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=ef51a30ce95e2500c19c55182e137b4c&amp;language=en_US&amp;ref_=as_li_ss_tl\">Asics Gel-DS Trainer 26</a>: I switched this up again this year from the 22to the 26, just a minor change over the previous versions I’ve used. Obviously, I have the amazing blue with crazy orange base coloring.<br />\n<strong>Running T-Shirt:</strong> Whatever technical t-shirt I grab out of the massive drawer of dozens of them.  If you don’t have any running t-shirts, you’re not doing enough races. 😉<br />\n<strong>Running Shorts:</strong> This is a pretty random assortment of running shorts, some Nike, some Decathlon, some still in the laundry machine. I’m not particular, but I do prefer a pocket or two to stash things.<br />\n<strong>Running Socks:</strong> <a href=\"http://www.amazon.com/gp/product/B0015VHIF8?ie=UTF8&amp;tag=dcr07-20&amp;linkCode=as2&amp;camp=1789&amp;creative=390957&amp;creativeASIN=B0015VHIF8\">Balega Hidden Comfort</a> – No questions, these socks…forever.  So soft, just love them.  I’ve never had blisters with them.  Ever.<br />\n<strong>Running Watch:</strong> <a href=\"https://www.dcrainmaker.com/2020/09/garmin-forerunner-745-depth-review.html\">Garmin Forerunner 745</a>: As outlined in my <a href=\"https://www.dcrainmaker.com/2021/04/garmin-forerunner-745-review-update-8-months-later.html\">8-months later review</a> (it’s now like 16 months), I’ve come to like this little watch. I think the biggest draw for me is the silly 7-day load watch face, which isn’t available on any other watch face for some reason. Helps keep me in check when not on a training plan. Also, I like the size and color. It doesn’t have maps, but I rarely need maps day-to-day.<br />\n<strong>Running Headphones:</strong> <a href=\"https://www.amazon.com/dp/B096SSCV5K?_encoding=UTF8&amp;aaxitk=953535e0259e4a68ebb55c036e6b2f56&amp;hsa_cr_id=2122939910701&amp;pd_rd_plhdr=t&amp;pd_rd_r=c5467f5f-0c8e-4141-aac8-de9455aef0ef&amp;pd_rd_w=xJHhA&amp;pd_rd_wg=k0tZ9&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=adcc3e3e35808e66808ddce3181d9121&amp;language=en_US&amp;ref_=as_li_ss_tl\">Beats Studio Buds</a> &amp; <a href=\"https://www.amazon.com/Powerbeats-Pro-Totally-Wireless-Earphones/dp/B07R5QD598?keywords=powerbeats%2Bpro&amp;qid=1638365016&amp;sr=8-1-spons&amp;spLa=ZW5jcnlwdGVkUXVhbGlmaWVyPUEyMlFHRzFKT1BXUk1CJmVuY3J5cHRlZElkPUExRlAxNzAxNkZZNVk2JmVuY3J5cHRlZEFkSWQ9QTA5Njg5MTUxTkM3Ukk4SFQ2QUw1JndpZGdldE5hbWU9c3BfYXRmJmFjdGlvbj1jbGlja1JlZGlyZWN0JmRvTm90TG9nQ2xpY2s9dHJ1ZQ&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=a41d28313a5eae057208965154dbb6eb&amp;language=en_US&amp;ref_=as_li_ss_tl\">PowerBeats Pro</a>: I use both pretty interchangeably, and like both. I have a slight preference for the over-ear option of the older PowerBeats Pro, purely for security purposes. Note that while I use these while running, I don’t tend to run with music unless I’m testing something.<br />\n<strong>Long Run Hydration:</strong> <a href=\"https://www.amazon.com/CamelBak-Octane-Reservoir-Hydration-Atomic/dp/B01LA4PF90?keywords=Camelbak%2Bmarathoner&amp;qid=1638362343&amp;sr=8-5&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=3f886b30f29584f8ba8cca88a5359451&amp;language=en_US&amp;ref_=as_li_ss_tl\">CamelBak Marathoner</a> – I’ve had this for probably close to a decade now, and it just works. Fear not, I’ve replaced the water inset in it, but it’s what I use on longer runs or hikes. I also use it sometimes on runs to hold more GPS watches. 🙂<br />\n<strong>Place to stick stuff on runs:</strong> <a href=\"http://www.amazon.com/mn/search/?_encoding=UTF8&amp;camp=1789&amp;creative=390957&amp;field-keywords=Spibelt&amp;linkCode=ur2&amp;tag=dcr07-20&amp;url=search-alias%3Daps\">Spibelt</a> – Most runs, I don’t bother with anything.  But for some random runs, while traveling, this works as a great place to stick house/car keys, credit cards, or even gels.  I’ve tried a few brands, this one just works the best for me.<br />\n<strong>Cold Weather Running Top:</strong> I don’t have a specific top I use, rather, I tend to layer bits and pieces together. Here’s an older post on all my <a href=\"https://www.dcrainmaker.com/2012/01/what-i-wear-cold-weather-running.html\">cold weather running thoughts</a>.<br />\n<strong>Cold Weather Running Tights:</strong> <a href=\"https://www.amazon.com/ASICS-Thermopolis-Running-Apparel-Performance/dp/B09GTBWGSB?keywords=asics+mens+running+tights&amp;qid=1638366078&amp;sr=8-7&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=52ae5c86ebbf8ea35dd8f667a7fe4fbf&amp;language=en_US&amp;ref_=as_li_ss_tl\">Asics Running Tights</a> – Look, like most of my clothing choices, it’s often just what I happen to find available at a running shop. That was the case here. My previous Sugoi ones were getting a bit tattered, but I was headed on <a href=\"https://www.dcrainmaker.com/2018/12/5-random-things-i-did-in-finland-in-the-arctic-circle.html\">a trip to the Article Circle in December</a>, so I desperately needed new running tights, and this was what my local running shop had that I tried on and liked. I do very much like them, but my research is hardly extensive here. Also, I can’t figure out the exact model that it is. It just says H1 on it, but nothing else.<br />\n<strong>Cold Weather Running Gloves:</strong> $1.00 race expo gloves – That’s it.  It’s easy.  I almost never throw them away, I feel guilty.  So I use a few rotating pairs, all from expos – some even free!  I’ve got a pair of no-brand mittens that I toss on if the weather is super-cold, but like running tops in cold weather, you’d be surprised what your body is fine with once it’s up to speed.  All you folks in Minnesota though shouldn’t adhere to this section.  Just go to the Arctic section of REI instead.<br />\n<strong>Ice Running: </strong><a href=\"https://amzn.to/2zWMcPZ\">Yaktrax</a> – There’s no better way to run on compact snow and ice, albeit not much of that in Amsterdam most of the time. Though, last year they got some serious ice usage here. Note that for deeper snow though, they aren’t as useful/necessary.</p>\n<h3><span>The Random Category:</span></h3>\n<p><img src=\"https://media.dcrainmaker.com/images/2021/09/GoPro-Hero10-MaxLensMod_thumb.jpg\" /></p>\n<p>Here’s a few random things that didn’t fit above into a specific category.</p>\n<p><strong>Daily Action Cam:</strong> <a href=\"https://www.dcrainmaker.com/2021/09/gopro-hero-10-black-in-depth-review.html\">GoPro Hero 10</a>: This came out this past fall, and I’ve iterated from the Hero 9 to the Hero 10, mainly for the extra resolution and framing with higher modes.<br />\n<b>GoPro </b><b>Accessories</b><b> I use:</b> <a href=\"https://www.dcrainmaker.com/2018/04/my-6-favorite-action-cam-accessories-i-use-daily.html\">Complete list here:</a> It’s basically all the accessories I still use daily.<br />\n<strong>Preferred Drone: <a href=\"https://www.dcrainmaker.com/2019/12/skydio-autonomous-sports.html\">Skydio 2</a></strong> &amp; <a href=\"https://www.amazon.com/DJI-Mavic-Air-More-Combo/dp/B086XCGMN7?keywords=DJI%2BAir%2B2&amp;qid=1638363014&amp;sr=8-3&amp;th=1&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=4fa0180619186a939623e38f538705ef&amp;language=en_US&amp;ref_=as_li_ss_tl\">DJI Mavic Air 2</a>: I use these two drones for most of my stuff. The Skydio if I need to track myself, and the Mavic Air 2 if I’m looking for more general usage. That said, I’ve also got a little <a href=\"https://www.amazon.com/DJI-Mavic-Mini-Quadcopter-Renewed/dp/B082FS981D?keywords=DJI+mini&amp;qid=1638363072&amp;sr=8-6&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d0cf258df901d99ba568943e6089cbd1&amp;language=en_US&amp;ref_=as_li_ss_tl\">DJI Mini</a> and <a href=\"https://www.amazon.com/DJI-Mini-SE-Improved-Resistance/dp/B098XMSQ3P?keywords=DJI+mini&amp;qid=1638363072&amp;sr=8-2&amp;linkCode=ll1&amp;tag=dcr07-20&amp;linkId=d7252a6bafae65d6a68ec551ea5febfd&amp;language=en_US&amp;ref_=as_li_ss_tl\">Mini SE</a> that I sometimes take with me on trips for general stuff if I really want to pack light.<strong><br />\nAll Other Photography Gear:</strong> Be sure to check out <a href=\"https://www.dcrainmaker.com/2016/11/photography-cameras-equipment.html\">my full photography page</a>, which lists all the cameras I use when I’m not swim/bike/running.<br />\n<strong>Race belt:</strong> <a href=\"https://www.amazon.com/s?k=FuelBelt&amp;linkCode=ll2&amp;tag=dcr07-20&amp;linkId=c1b1b755a02d87a160bd49d22b1793a4&amp;language=en_US&amp;ref_=as_li_ss_tl\">FuelBelt GelReady Race Belt</a> –  For races, to put your number on for the bike and run.  It also holds gels, though, not as well as I’d like.  Better just as a race belt for the number than a storage platform.<br />\n<strong>Transition Bag:</strong> I’ve simply moved to a generic REI backpack or literally, a plastic bag this past September. I’ve just found less is more here. There’s little reason for me to have a giant bag full of gear if you’re prepared ahead of time. As long as it has places to clip stuff on the sides, you can carry a lot with a little creativity.</p>\n<h3><span>Wrap-up:</span></h3>\n<p>Phew!</p>\n<p>For long-term readers, you’ll notice that I don’t tend to change the apparel side very much. Most of that stays pretty much the same for years (even including this paragraph). Things like shoes only change a tiny bit between available variants of the same model. Same goes for other non-tech categories.  I tend to be a person that sticks with what works rather than re-invent the wheel.</p>\n<p>Whereas on the tech side I tend to stay with the most recent. Obviously, this site sorta drives that a bit.</p>\n<p>Obviously, there’s a lot of gear there, but that’s primarily because you’re training for three different sports.  Actually, it’s sorta like 4-5 sports, with openwater swimming and pool swimming both having different requirements (I.e. wetsuits), plus you have specific gear you’d use in triathlon that you don’t use in road cycling (like triathlon suits).</p>\n<p>It should be noted that none of the stuff seen above is stuff that I’m tests for reviews.  Every single item above I’ve bought and use in my normal day-to-day training.  Obviously, you see me use gear in testing too – but this is what’s left after you peel the testing and reviewing away.</p>\n<p>Thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"9ee6cc7533e37029c66bbe9097806637d5f7a603924d638dede294c812422055","category":"Cycling"}