{"title":"Clinical value of questionnaires & physical tests for patellofemoral pain: Validity, reliability and predictive capacity","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0302215","date":1713362400000,"content":"<p>by Gema Chamorro-Moriana, Fernando Espuny-Ruiz, Carmen Ridao-Fernández, Eleonora Magni</p>\r\nObjectives <p>To determine the most appropriate method of functional assessment for \"patellofemoral pain\" (PFP)/“chondromalacia patella” for its diagnostic value, (validity, reliability, sensitivity, specificity, predictive value and clinical applicability); to outline initial interpretations of the questionnaires and their appropriateness, through the cut-off points determined in their scores based on physical test and Magnetic Resonance Imaging (MRI); to establish which methods should be used in conjunction with each other to obtain clinical diagnoses that are robust effective and efficient.</p> Methods <p>(1)Intra- and inter-observer reliability and of the relationship among PFP questionnaires/physical tests validated. (2)Predictive capacity of the questionnaires. Subject: 113 knees with PFP, assessed using “<i>Knee-injury-and-Osteoarthritis Outcome-Score-for-Patellofemoral-pain-and-osteoarthritis</i>” (KOOS-PF), “<i>Kujala-Patellofemoral-Score</i>” (KPS), “<i>Victorian-Institute-of-Sports-Assessment-for-Patellar-tendons-questionnaire</i>” (VISA-P), and the physical tests: “<i>patellar-palpation”</i>, <i>“patellar-tilt”</i>, <i>“patellar-apprehension”</i>, <i>“Clarke”</i> and <i>“squat”</i>.</p> Results <p>Questionnaires correlations themselves was 0.78&lt;<i>r</i>&lt;0.86. Tests intra-rater reliability was “<i>excellent</i>”. <i>Squat</i> inter-rater reliability was “<i>excellent”</i>/“<i>good”</i>. <i>Palpation</i>, <i>tilt</i>, <i>Clarke</i> and <i>squat</i> showed a statistically significant relationship (<i>p</i>&lt;0.05) with all questionnaires/specific items. AUC of the questionnaires showed a \"useful\" accuracy, except for <i>Tilt</i>. No statistically significant differences were found between grades 0 and 1 chondromalacia (by MRI) knee scores, but between 1 and ≥2. AUC of the questionnaires showed \"useful\" accuracy.</p> Conclusions <p>KOOS-PF, KPS and VISA-P demonstrated their diagnostic value in PFP/chondromalacia (validity, reliability, sensitivity, specificity, predictive value and clinical applicability). KOOS-PF was the most versatile, and the most appropriate in mild cases and for early detection and prevention. <i>Squat</i> was the best due to its reliability and clinical relationship with the questionnaires, which predicted it correctly. The functional assessment tools discussed should be applied by combining them with each other.</p>","author":"Gema Chamorro-Moriana","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9eea454fe48aa53dc8bfba24cb945f316e5d32d32c7536072e9f8bce54c5fb32","category":"Interdisciplinary"}