{"title":"Potential drivers of differences in breeding phenology as a component of life history strategies among coexisting species","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14640?af=R","date":1724311136000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/c81e0d7c-6d19-410d-95e7-9cb094021333/fec14640-toc-0001-m.png\" alt=\"Potential drivers of differences in breeding phenology as a component of life history strategies among coexisting species\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/08/14/when-should-coexisting-species-start-and-stop-breeding/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nBreeding phenology can have strong demographic consequences. Yet, the reasons why coexisting animal species differ in breeding phenology have received little attention.\n\nWe tested selection pressures that underlie life history variation, such as age-specific mortality, diet, and body size to explain breeding phenology of 16 coexisting songbird species in arid shrubland in South Africa.\n\nThe average start and end dates for the earliest and latest species differed by 1.5 months, with a gradient among remaining species. Nest predation risk generally increased through the season, although species differed in seasonal patterns. Species with lower annual adult mortality, greater seasonal increases in nest predation, and greater nest predation rates had earlier start and stop dates, thereby reducing demographic risks. Species with higher adult mortality had larger brood sizes that require more food and they bred later when food was more abundant. Evolved timing of breeding thereby reflected risk management and food availability related to longevity and brood size.\n\nThese factors may place unrecognized constraints on within-species responses to climate change. Given the importance of phenology for fitness, phenology should be integrated as a core life history trait in future theory, and evolutionary constraints need to be considered in responses to climate change.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/08/14/when-should-coexisting-species-start-and-stop-breeding/\">Plain Language Summary</a> for this article on the Journal blog.</p>","author":"Thomas E. Martin, \nPenn Lloyd","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"9eec3e3ee8b868b527e80a0eb1bcf13e2a07324910e6dcc22a5b093648a3fd51","category":"Environment"}