{"title":"Suunto 7 Update Adds Body Resources, Advanced Sleep Tracking, Komoot Routes: Hands-on","link":"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html","date":1618829562000,"content":"<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022283.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022283_thumb.jpg\" /></a></p>\n<p>Suunto has started a phased roll-out today of a <a href=\"https://www.suunto.com/en-us/Support/Software-updates/Release-notes/suunto-7-software-updates/\">new firmware update</a> for their <a href=\"https://www.dcrainmaker.com/2020/02/suunto7-wearos-gps-watch-in-depth-review.html\">WearOS based Suunto 7</a>, which adds in a smattering of new features – both for sports and non-sport aspects. Here’s the consolidated list of what’s in that firmware update:</p>\n<p><strong>– Added tiles for sleep tracking with stages:</strong> This will now show a far more detailed sleep tracking page, which then feeds into the Suunto app.<br />\n<strong>– Added ‘body resources’ tile with data capture:</strong> This tracks how much energy you have, over the course of the day, including recharging via sleep. This is akin to Garmin’s Body Battery feature, as are both licensed from FirstBeat. The data also feeds into the Suunto app.<br />\n<strong>– Added real-time heart rate tracking/history page/tile:</strong> Shows your current heart rate, but also historical HR for the last 24 hours. This too feeds into the Suunto app.<br />\n<strong>– Added turn by turn navigation via Komoot:</strong> This is the same as on the other Suunto watches which was <a href=\"https://www.dcrainmaker.com/2021/03/suunto-9-adds-komoot-routes-turn-by-turn-integration-in-latest-update.html\">added a few weeks back</a>. It’ll give you breadcrumb style routing with turn alerts. It does not give you re-routing though using the underlying maps.</p>\n<p>The rollout schedule is as follows, phased to total Suunto 7 users:</p>\n<p><strong>Monday:</strong> 10%<br />\n<strong>Tuesday:</strong> 25%<br />\n<strong>Wednesday:</strong> 50%<br />\n<strong>Thursday:</strong> 100%</p>\n<p>In addition to that, there’s the recently released Suunto 7 Titanium version, which includes a new fuzzy super soft strap. That’s the watch shown above/below. Technically the strap is called “ultra-soft microfiber”, and the color variant is ‘stone gray titanium’.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/DSC_4139.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/DSC_4139_thumb.jpg\" /></a></p>\n<p>In my using it the last 3-4 days, I actually like the strap, though, this variant doesn’t also come with a silicone strap. That means if you intend to use the watch for sporting activities, beach-going, or other intense evening activities, then you’ll need to buy another strap for it – as this one will get pretty yucky pretty quick with sweat. Still, I do like that it feels incredibly lightweight – I’ve never had another watch band like it. It is easily removable using the two little compression pens – so it’s not hard to do.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022284.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022284_thumb.jpg\" /></a></p>\n<p>Ok, with that fuzziness out of the way, let’s talk tech.</p>\n<h3><span>Added Features:</span></h3>\n<p>All three of these new 24×7 type features have existed on other Suunto watches, however, they are definitely more detailed here than other watches of theirs, and also include more recent algorithms. Going through them, first is sleep tracking.</p>\n<p>Like other Suunto watches you’ll need to enable this once, so that it tracks from thereon. Once enabled, you’ll see your sleep summary each morning/day for the previous night. On the main page it’ll show how much sleep you got, the multi-day rolling average, and then how much resources y you gained (%-wise).</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022271.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022271_thumb.jpg\" /></a></p>\n<p>If you tap into it, it’ll quietly open the Suunto app on your watch and then show a bit more on sleep quality, average heart rate, sleep phases, and whether or not you met your sleep goal. It’ll also show historical sleep information too.</p>\n\n<a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html/p1022274\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022274-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html/p1022275\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022275-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html/p1022276\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022276-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html/p1022272\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022272-200x132.jpg\" /></a>\n<a href=\"https://www.dcrainmaker.com/2021/04/suunto7-update-firmware-resources-advanced.html/p1022273\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022273-200x132.jpg\" /></a>\n\n<p>All of this seemed accurate enough to me, and was within a few mins of my actual sleep times. That said, it does appear to require syncing with the Suunto app on your phone in order to correctly update the data (specifically sleep duration and resources and how they relate). For example, the resources tab shows me (at 10:42AM) at 79% ‘charged’. Yet the sleep tab said I only gained 11% overnight. Given I went to bed in the 17-19% range last night, that means that in reality I gained 60-80% overnight – not 11%. I say a range, because I didn’t see exactly what my resources were when I woke-up 3 hours ago. So the two pieces actually seem to be working fine by themselves, but don’t appear to be talking to each other. Or, they just have a case of the Monday’s.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/HR3.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/HR3_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/HR6.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/HR6_thumb.jpg\" /></a></p>\n<p>As for resources, the best way I describe that is the Street Fighter video game style. On a magical day without toddlers, you’d wake-up fresh with birds chirping at 100%. Then over the course of the day activities would reduce that value, such as a hard run or even just shuffling between a series of non-existing in-person meetings. It’s not perfect, but I find on both Suunto and Garmin, it’s generally a pretty good proxy. Both companies license it from FirstBeat – though Suunto did note over the weekend that the algorithms used on the Suunto 7 are newer than the Suunto 3/5/9 algorithms.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022277.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022277_thumb.jpg\" /></a></p>\n<p>Now to contrast the sleep + resources not talking to each other, here’s an example from Sunday morning, where they did talk to each other just fine – and you can see I gained 41% during sleep, to wake-up at 85%.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022258.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022258_thumb.jpg\" /></a></p>\n<p>Geeks aside: In an interesting ‘Huh, things I never done that before’ moment, yesterday I did a track workout around 5PM. Except, I was starting from home (versus the DCR Cave with lots of gadgets), and since I had the fuzzy strap with me and not a silicone strap, I left the Suunto 7 at home. As a result, my Body Resources basically ignored the run. After I got back and resumed wearing it, it showed negligible change in body resources. Showing you that it’s less about a point in time measurement, and more about cumulative strain over the course of the day. I figured someone might find this interesting, because for all the years I’ve been using Suunto/Garmin watches with this feature, I don’t think I’ve ever taken off a watch before a workout and then resumed it afterwards. Thus, I’ve never quite seen how that aspect works. Anyway, like I’ve said, I’ve found the algorithm on both vendors to be quite good on most days at approximating how I feel. Sure, there are outliers, but mostly it’s pretty good.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022251.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022251_thumb.jpg\" /></a></p>\n<p>Next, there’s the updated 24×7 heart rate tracking page. This shows your heart rate graph over the last 24 hours, including sleep. You can see the little gap to the left of the runner man icon – this is when I took it off for the run (the runner man icon was then a short test activity I did). Then you’ll also see the bed icon, following that a short bit ago there’s the gap for charging. Using all the default settings here straight out of the box, I seem to be right about 24hrs before I need to charge.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022282.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022282_thumb.jpg\" /></a></p>\n<p>You can then tap this screen to see the min/max heart rates for the day:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/P1022280.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/P1022280_thumb.jpg\" /></a></p>\n<p>And again, all of this is sent over to the Suunto app, where it shows up there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0019.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0019_thumb.png\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image00111.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image00111_thumb.png\" /></a></p>\n<p>Though it doesn’t appear to quietly sync in the background, instead, I seem to need to manually bring the Suunto app to the foreground and let it sync – at least on my iPhone. I don’t have to manually press anything, but the app doesn’t seem to background sync these stays for whatever reason. Not a huge deal – just an FYI.</p>\n<h3><span>Komoot Navigation:</span></h3>\n<p>Next up is the Komoot Navigation. This allows you to take routes from Komoot and navigate them on your Suunto 7. As noted, Suunto rolled this out to other watches a few weeks ago, and technically speaking I think it actually worked here too then, but now it’s officially supported end to end.</p>\n<p>To begin, you’ll create a route on Komoot:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/image-23.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/image_thumb-22.png\" /></a></p>\n<p>Then on the Suunto app you’ll tap the flag/save for later icon, which brings up your routes library. You’ll see the Tour de Monday is already listed there immediately. The sync happens from Komoot to Suunto virtually instantly.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image00115.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image00115_thumb.jpg\" /></a> <a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-4.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-4.png\" /></a></p>\n<p>However, you’ll need to tap the ‘Use in watch’ toggle to sync it to your watch. After you do that, it’ll take perhaps 20-30 seconds to sync it over. Like I said two weeks ago, that toggle should automatically be set for new routes going forward. If someone wants to take a route out of their watch, sure it’s useful. But just Garmin/Wahoo/Stages/Sigma/Hammerhead/etc… – nobody wants one more step to have a route show up in their watch. After all, that’s the point of creating routes.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017.png\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0017_thumb.png\" /></a></p>\n<p>Now on the watch, go to the Suunto app to start an activity, and then go down to ‘Select a route’, and choose the route. You’ll see it there.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image00113.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image00113_thumb.jpg\" /></a></p>\n<p>Normally above it shows the preview base map behind it, but I think there’s a minor bug preventing that on just synced routes. The rest of my routes (starting in the same area) all show mini preview maps, but this one doesn’t yet.</p>\n<p>If you haven’t downloaded the maps for your particular route yet, you’ll need to remember to do that (and have the charging cable handy). This is where it would be could be cool to see Suunto pop-up a notification on the watch that says ‘Yo, the route you just added doesn’t have maps downloaded, do you want to add them to the download queue?’ (roughly). Or, I suppose this could also be solved if the Suunto 7 allowed a bigger map area to be downloaded (like an entire country/region).</p>\n<p>With the route selected, I’ll get started on navigation. You’ll see the line of your route, overlaid atop the base map you’ve downloaded. Sorry this photo looks like hot garbage, it was bizarrely sunny the last two hours, and finding a shady spot to take a picture of this display was tricky. To ones own eyes, it looks nice and crispy.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image00111.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image00111_thumb.jpg\" /></a></p>\n<p>It’ll show your distance to the next turn, as well as an ETA to that turn in time (both duration as well as time of day arrival):</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0014.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0014_thumb.jpg\" /></a></p>\n<p>For each turn it’ll specify a “Turn left” or “Turn right” type instructions, with reminders as you get closer. It didn’t specify any street/path name or such in my tests, perhaps it does in some cases.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image001-3.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image001_thumb-3.jpg\" /></a></p>\n<p>In the event you go off-course, it’ll tell you that you’re off-course, but won’t offer any corrective action. Meaning, it won’t re-route you. This is just the same as Suunto’s existing routing with the Suunto 7 that they <a href=\"https://www.dcrainmaker.com/2020/09/suunto-7-and-new-routes-features-hands-on-details-explainer.html\">added last September</a>. Think of it as simply breadcrumb style routing overlaid atop a picture of a map. It doesn’t have underlying understanding of the routable elements of that map (like street names, trails, bike paths, etc…). Instead, it’s just an image for you to refer to. Which is certainly useful – you can clearly see things like the pond, the highway, etc…</p>\n<p>The one downside to the Suunto 7 and routing is the finicky nature of the display to save battery. In the default settings it’s turning off the display pretty quickly, and then each time you raise your wrist it turns it back on. There’s about a 1.5-2 second lag before the map appears with all the data. Not a big deal, since I suspect those doing more hard-core endurance efforts aren’t going to use a watch with these battery limitations on the regular, but it is something that hopefully in future hardware iterations can be improved.</p>\n<p>Still, having the Komoot integration is one more step forwards for this watch to more closely match the rest of the Suunto lineup in terms of sport capabilities.</p>\n<h3><span>Wrap-Up:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2021/04/clip_image0019.jpg\"><img src=\"https://media.dcrainmaker.com/images/2021/04/clip_image0019_thumb.jpg\" /></a></p>\n<p>It’s good to see this update, as well as of course the recent <a href=\"https://www.dcrainmaker.com/2021/03/suunto-9-adds-komoot-routes-turn-by-turn-integration-in-latest-update.html\">Suunto 5/9 updates a few weeks ago</a>. The three new tiles are a good blend of things that both athletes and non-athletes would find useful, which, is sorta the mantra for the Suunto 7 – trying to find that blend. Given the watch doesn’t have the battery levels of Suunto’s other watches for endurance athletes, the focus has mostly been on having a sportier watch to non-endurance athletes. Meaning they weren’t really targeting ultra runners or triathletes here, but more mainstream people that wanted a sportier WearOS option. Whereas the Komoot integration undoubtedly skews more towards the sportier side of that equation.</p>\n<p>I thought it mildly notable that I think some wondered whether FirstBeat (<a href=\"https://www.dcrainmaker.com/2020/06/garmin-acquires-firstbeat-analytics-a-quick-analysis-of-the-winners-and-losers.html\">acquired by Garmin last June</a>) would continue licensing algorithms to competitors. Garmin &amp; FirstBeat both said they would, and we’ve seen other less competitive watches continue to license algorithms from FirstBeat. But it’s been a while since Suunto has gone back to the well, and I think the first time since the FirstBeat acquisition. Anyway, point being – that yes, they are still licensing.</p>\n<p>I don’t know what the future holds for the Suunto 7 or a successor holds. As I’ve said before, basically there’s two pieces that Suunto would want to focus on for the future. The first is the Suunto 7 software itself (both watch app and tie-ins like these new tiles). Today’s update targets that, but high on my list for the future update would be at least heart rate sensor support, if not other sensor support – as would focus on more sport-specific features like seen on the Suunto 5. The second piece of the puzzle for Suunto is the hardware. Certainly, the Suunto 7 is a beautiful watch, but it’s limited by the WearOS platform’s battery challenges. Future hardware platforms iterations (which are largely controlled by Google), will undoubtedly increase battery life – and I’d expect that would be the long pole in the tent for Suunto making a Suunto 5-like sport variant built atop Wear OS.</p>\n<p>That’s ultimately where I think Suunto’s best long-term position is here – bringing a full-sport featured Wear OS watch to market (e.g. Suunto 5 features baked into a Suunto 7 watch), offering an alternative to an Apple Watch (for people that don’t have iOS), while also offering a more brilliant display and smart-watch driven alternative to a typical endurance-focused watch, inclusive of all the things they’d expect like payments, music, and more.</p>\n<p>With that, thanks for reading.</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"9ef27022e254efea36fb1f5daa6f0434021b09ff12431c844b549ec8afbd5517","category":"Cycling"}