{"title":"The potential contributions of bouillon fortification to meeting micronutrient requirements among women and preschool children in Senegal: A modeling study using household consumption and expenditure survey data","link":"https://onlinelibrary.wiley.com/doi/10.1111/nyas.15156?af=R","date":1720422000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/097fd6bd-9f5c-4237-ad03-f63224da1f1c/nyas15156-gra-0001-m.png\" alt=\"The potential contributions of bouillon fortification to meeting micronutrient requirements among women and preschool children in Senegal: A modeling study using household consumption and expenditure survey data\" />\n<p>We used household food consumption data to model the potential contributions of multiple micronutrient–fortified bouillon in Senegal. Accounting for existing refined oil and wheat flour fortification, our modeling suggests that a bouillon fortification program could bring about sizeable reductions in the prevalence of vitamin A, folate, vitamin B12, and zinc inadequacies, including among poor and rural households that are typically harder to reach via fortification of oil or wheat flour.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>To reduce micronutrient deficiencies, Senegal mandates the fortification of refined oil with vitamin A and wheat flour with iron and folic acid. Expanding Senegal's large-scale food fortification programs to include fortified bouillon could help fill the remaining gaps in dietary micronutrient requirements. Using 7-day household food consumption data collected between 2018 and 2019, we assessed the potential contributions of bouillon fortified with vitamin A (40–250 μg/g bouillon), folic acid (20–120 μg/g), vitamin B12 (0.2–2 μg/g), iron (0.6–5 mg/g), and zinc (0.6–5 mg/g) for meeting micronutrient requirements of women of reproductive age (WRA; 15–49 years old) and children (6–59 months old). Most households (90%) reported consuming bouillon, including poor and rural households. At modeled fortification levels, bouillon fortification reduced the national prevalence of inadequacy by up to ∼20 percentage points (pp) for vitamin A, 34 pp (WRA) and 20 pp (children) for folate, 20 pp for vitamin B12, 38 pp (WRA) and 30 pp (children) for zinc, and ∼8 pp for iron. Predicted reductions in inadequacy were generally larger among poor and rural populations, especially for vitamins A and B12. Our modeling suggests that bouillon fortification has the potential to substantially reduce dietary inadequacy of multiple micronutrients and could also help address inequities in dietary micronutrient inadequacies in Senegal.</p>","author":"Katherine P. Adams, \nStephen A. Vosti, \nAnn Tarini, \nMaguette Beye, \nHelena Pachón, \nSophia Kiselova, \nReina Engle‐Stone","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"9ef9dcd8102984404ab75f76a04c1832dfcf2c3213008b6429bd4ffe1518bdaf","category":"Environment"}