{"title":"ทีมวิจัย Netflix เสนอแนวทางซ้อนฉากหลัง Green Screen แบบใหม่ ใช้ AI ผสมกับแสงสีมาเจนต้า","link":"https://www.blognone.com/node/134749","date":1688898859000,"content":"<div><div><div><p>ทีมนักวิจัยของ Netflix เผยแพร่วิธีการซ้อนภาพด้วยฉากหลังสีเขียวแนวทางใหม่ สำหรับภาพยนตร์และรายการโทรทัศน์ ซึ่งทำให้ได้ภาพที่สมจริงมากขึ้นในด้านสีสันและรายละเอียด</p>\n<p>ฉากหลังสีเขียวเป็นวิธีการถ่ายทำเพื่อซ้อนภาพสิ่งที่อยู่ตรงหน้า ให้เข้ากับฉากหลังที่ต้องการใส่เข้าไป ซึ่งเป็นที่นิยมในกระบวนการผลิตทั้งภาพยนตร์และโทรทัศน์ อย่างไรก็ตามวิธีการนี้มีข้อจำกัดอยู่บ้าง เช่น เครื่องแต่งกายต้องไม่มีสีเขียว รวมทั้งวัตถุที่มีความละเอียดสูงอย่างเส้นผมอาจมีปัญหาการแสดงผลให้ครบถ้วน วิธีการดังกล่าวสามารถปรับแก้ไขได้ แต่ต้องใช้เวลาในการปรับแต่งทีละช็อต</p>\n<p>วิธีที่ทีมวิจัยของ Netflix นำเสนอเรียกว่า MGS ย่อมาจาก Magenta Green Screen หรือ ฉากสีมาเจนต้า-เขียว โดยใช้ฉากหลังสีเขียวเหมือนเดิม แต่นักแสดงในฉากหน้าจะถูกส่องด้วยแสงสีแดงและสีน้ำเงิน เกิดเป็นเฉดสีมาเจนต้า</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fa0a929435002eb339c297a252ab5228.png\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/f1b794dc4195f31fdff5d4f90f0a8850.png\" /></p>\n<p>กระบวนการแยกแยะวัตถุจะเริ่มด้วยการจับฉากหลังเฉพาะสีเขียว ทำให้วัตถุฉากหน้าทั้งหมดที่ถูกย้อมสีจะมองเป็นสีดำ อีกขั้นตอนคือการซ้อนด้วยภาพที่แยกด้วยสีแดง-น้ำเงิน เพื่อหาวัตถุฉากหน้า ตำแหน่งต่าง ๆ จึงมีความชัดเจนมากขึ้น ขั้นตอนสุดท้ายคือการถอดวัตถุฉากหน้าที่ย้อมสีมาเจนต้าให้ออกมาเป็นสีปกติ โดยใช้ AI รวบรวมฟุตเทจภาพในแสงสีขาวปกติก่อน นำมาประมวลผลรวมกัน ทำให้แม้นักแสดงใส่ชุดสีเขียว ถือขวดแก้วใส สยายผม ภาพที่ซ้อนออกมาทั้งหมดก็คงความสมจริงมากขึ้น</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/fdcad8736f5e957ff0bdfd6098d6aebc.png\" /></p>\n<p>อย่างไรก็ตามงานวิจัยนี้ยังมีข้อจำกัดในการนำมาใช้จริงตอนนี้ เพราะ AI ยังไม่สามารถประมวลผลได้เรียลไทม์ จึงอาจใช้งานสำหรับในกองถ่ายเพื่อประเมินผลลัพธ์ได้เท่านั้น แต่ยังใช้กับงานถ่ายทอดสดไม่ได้ รวมทั้งการใช้งานต้องทำในสภาพแวดล้อมปิดที่ควบคุมแสงได้ทั้งหมด ซึ่งเป็นความท้าทายมากในหลายสถานการณ์</p>\n<p>ที่มา: <a href=\"https://editorialge.com/netflix-creates-green-screen-filming/\">Editorialge</a> และ <a href=\"https://dmsm.github.io/magenta-green-screen/\">GitHub: Dmitriy Smirnov</a></p>\n<p>วิดีโอสาธิต</p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/netflix\">Netflix</a></div><div><a href=\"/topics/movies\">Movies</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9efff6fcec0fa57dd91e1d83c9ab918688eef59376f2026df51a76ec01621956","category":"Thai"}