{"title":"Polar Vantage V3 Hands-On: Everything You Need to Know","link":"https://www.dcrainmaker.com/2023/10/polar-vantage-v3-hands-on-details.html","date":1697018400000,"content":"<p></p>\n<p>Polar has just announced their newest watch – the Polar Vantage V3. With this 3rd generation watch, Polar is focusing heavily on the hardware – swapping out the MIP-based display for a new AMOLED display, while concurrently upgrading the GPS/GNSS chipset to multiband/dual-frequency. However, the biggest ticket item on the docket is going to be the addition of offline maps, allowing you to see not just the rivers, towns, and streams around you – but also topographic contour lines. Oh, and then there’s the new optical heart rate sensor, skin temperature sensor, SpO2 sensor, ECG, and more.</p>\n<p>In this post I’m going to dive into all the new features with a look at how they actually work in real life. Note that this isn’t a full review – that’ll come later, once the unit has final firmware and starts shipping later this month. However, this device is a final production device from a hardware standpoint.</p>\n<p>With that – let’s dive into it!</p>\n<h3><span>What’s New:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099760-1.jpg\"><img title=\"P1099760\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099760_thumb-1.jpg\" alt=\"P1099760\" width=\"720\" height=\"480\" /></a></p>\n<p>This is unquestionably the biggest leap in a watch Polar has made in years – arguably, the biggest technological leap they’ve ever made since the addition of GPS. While many of these features are found on competitor watches, for Polar, this type of jump is a big deal. And, for the larger endurance sports market and consumers alike, it’s important to see Polar coming back with viable options.</p>\n<p>Here’s all the big-ticket items that are new on the Polar Vantage V3. Or at least, everything I’ve found thus far. Undoubtedly there are plenty of even smaller tweaks along the way I haven’t found yet.</p>\n<p>– Added offline mapping, with free global maps at high detail levels<br />\n– Added/switched to 1.39” AMOLED display<br />\n– Added dual-frequency/multiband GNSS (GPS) chipset<br />\n– New optical heart rate sensor version (Gen4)<br />\n– Added new ‘Elixir biosensing’ technology, which is their new algorithm fusion thingy<br />\n– Added SpO2 sensor (blood oxygen levels)<br />\n– Added ECG capabilities (note: not certified as a medical device, however)<br />\n– Added skin temperature sensor<br />\n– Added skin temperature tracking feature and baselining/guidance<br />\n– Added virtual flashlight (display-based)<br />\n– Increased GPS battery time to 43 hours (full fidelity tracking), and 140 hours (reduced tracking rates)<br />\n– Increased CPU speed by 129% for faster user interface usage<br />\n– Increased internal storage to 32GB for saving multiple map regions/continents<br />\n– Smartwatch regular usage battery life is 8 days, or ~5 days with always-on display enabled<br />\n– Switched to standard 22mm straps (without adapter required)<br />\n– Switched charging cable to USB-C (watch-side connector is still propriety)<br />\n– Watch is water-resistant to 50m, and has Gorilla Glass 3 (curved)<br />\n– Pricing is $599USD, shipping October 25th, 2023</p>\n<p>In the rest of this first-look style post, I’ll give an explainer of these features. Keep in mind that again, this isn’t a review. The firmware isn’t final, and thus, I’ll reserve final judgment of how well things work, once it is. Of course, in this post I’ll also cover the features, and where they stand in relation to the norm of other devices.</p>\n<p>With that – let’s dive into it!</p>\n<h3><span>AMOLED Display &amp; Dual-Frequency GPS:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099764.jpg\"><img title=\"P1099764\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099764_thumb.jpg\" alt=\"P1099764\" width=\"720\" height=\"480\" /></a></p>\n<p>First up is the new 1.39″ AMOLED touchscreen display (462ppi), which has a peak brightness level of 1,050 nits, or essentially the same as most of the other AMOLED displays out there, save the new Apple Watch Series 9 &amp; Apple Watch Ultra editions (2,000/3,000 nits respectively). Still, as I’ve said on several reviews lately, ~1,000 nits for AMOLED displays is plenty bright to see in direct sunlight. It has been for a few years. These aren’t the AMOLED displays of yesteryear.</p>\n<p>As a very simplistic demonstration of that – here’s the Polar Vantage V3 display at noon in full sun brightness in Hawaii, taken today. I’ve had no issues seeing it in either dreary overcast days in the Netherlands, nor on nice sunny days on a tropical island.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h00m47s579.png\"><img title=\"vlcsnap-2023-10-10-21h00m47s579\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h00m47s579_thumb.png\" alt=\"vlcsnap-2023-10-10-21h00m47s579\" width=\"720\" height=\"405\" /></a></p>\n<p>In fact, it’s those typical Dutch dark days that AMOLED displays are better than MIP-based displays (which is what the Polar Vantage V2 and prior had). As I’d complained in multiple reviews lately, Polar’s MIP-based displays weren’t great from a visibility standpoint – and desperately needed an update. This delivers that update.</p>\n<p>Even in the shade, or at night, it’s super bright:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h00m55s474.png\"><img title=\"vlcsnap-2023-10-10-21h00m55s474\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h00m55s474_thumb.png\" alt=\"vlcsnap-2023-10-10-21h00m55s474\" width=\"720\" height=\"483\" /></a></p>\n<p>And, with that, Polar added a new flashlight mode. This uses the display as a flashlight:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h01m49s392.png\"><img title=\"vlcsnap-2023-10-10-21h01m49s392\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h01m49s392_thumb.png\" alt=\"vlcsnap-2023-10-10-21h01m49s392\" width=\"720\" height=\"405\" /></a></p>\n<p>Next, is the new multi-band GNSS chipset. Multi-band, or dual-frequency GPS, is effectively the ‘holy grail’ of GPS technology. It uses two different frequencies, which can help to deal with obstructions or interference better, as it has access to more satellites as well. In the case of the Polar Vantage V3, you’ve effectively got two core options when it comes to GPS settings. You can use full multi-band/dual-frequency, or single-frequency.</p>\n<p>Now, what’s more notable here is Polar’s changing of their antenna design. Most of these companies are actually using the same GPS chipset in their watches, yet their performance is significantly different. Take Garmin vs COROS for example. Both have used the exact same chipset in their multi-band watches, yet Garmin’s GPS performance in those dual-frequency watches is universally agreed upon by reviewers as superior. Similarly, when Polar launched their <a href=\"https://www.dcrainmaker.com/2022/11/polar-ignite3-in-depth-review-display-multiband.html\">Ignite 3 a year ago</a> with multi-band/dual-frequency), it didn’t do well at all GPS-wise.</p>\n<p>Why? Antenna design.</p>\n<p>It’s incredibly critical to good GPS reception, particularly in challenging environments. In a recent conversation with another watchmaker, Suunto, they talked about how fractions of a millimeter made the difference between incredible performance and unacceptable performance. Of course, companies can’t just copy/paste this from Garmin (and even Garmin can’t copy/paste to themselves), because each watch case/bezel/materials design is different – and all of that impacts accuracy.</p>\n<p>All of which is a long-winded way of noting that Polar explicitly noted their antenna design has changed here with the Polar Vantage V3, in an effort to ensure they had better GNSS/GPS tracks for this higher-end watch.</p>\n<p>Of course, I’ll save the full GPS accuracy testing for my in-depth review on the final firmware. That’ll include everything from challenging skyscraper style building tests, to mountains and jungles, and just regular activities on easier terrain. Polar explicitly noted that the firmware related to the GPS tracking portions isn’t final yet on the unit I have. Thus, be wary of anything else out there titled a review until the October 25th timeframe.</p>\n<h3><span>Topographic Mapping:</span></h3>\n<p>Arguably the biggest feature on the Polar Vantage V3 is the new mapping capabilities. This is the first time we’ve seen offline maps on a Polar watch, and follows just months after we saw Suunto add it in their new Suunto Vertical (and to a sorta-extent, Apple on the Apple Watch in WatchOS 10). This appears to be the year of the offline map, finally.</p>\n<p>In Polar’s case, they’ve added 32GB of storage inside the Vantage V3 – dedicated virtually exclusively to maps. I say exclusively, because there’s no onboard music capabilities – so about the only thing you’re gonna use that space for is maps (workout/activity files are trivially small, usually measured in the 30-100KB range per hour).</p>\n<p>The first step is getting the maps you want on the watch. By default the Vantage V3 will come with the European and North American maps pre-loaded in a ‘Basic’ configuration. However, you can easily download other regions, and the more detailed maps, for free, via Polar Flow. To do so, you’ll go to <a href=\"http://flow.polar.com/maps\">flow.polar.com/maps</a> to get started (that site only works if you have a Polar Vantage V3 registered on your account). Which brings you here:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m33s112.png\"><img title=\"vlcsnap-2023-10-10-21h03m33s112\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m33s112_thumb.png\" alt=\"vlcsnap-2023-10-10-21h03m33s112\" width=\"722\" height=\"407\" /></a></p>\n<p>You’ll see you’ve got two options to begin with: Basic or Detailed.</p>\n<p>Basic maps show the general gist of things, including main roads and town names. Whereas ‘Detailed’ maps show down to the names of rivers/streams, as well as small trails. Additionally, detailed maps include topographic counter lines.</p>\n<p>From a basemap standpoint, Polar loads both the North American and European ‘Basic’ maps by default, which in total take up about 15.3GB of storage (8.4GB for Europe, 6.8GB for North America). From there, you’d likely want to add detailed maps for the country or region that you want more detail on. You can see how this is divided up in various spots:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m43s540.png\"><img title=\"vlcsnap-2023-10-10-21h03m43s540\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m43s540_thumb.png\" alt=\"vlcsnap-2023-10-10-21h03m43s540\" width=\"720\" height=\"405\" /></a></p>\n<p>For context, here’s some random map sizes for the ‘Detailed’ maps:</p>\n<p>– USA West: 4.9GB<br />\n– USA Midwest: 2.3GB<br />\n– USA Northeast: 1.1GB<br />\n– USA South: 3.4GB<br />\n– Canada West: 4.1GB<br />\n– Canada East: 3.8GB<br />\n– Canada North: 6.1GB<br />\n– France 2.7GB<br />\n– Spain and Andorra: 1.3GB<br />\n– Germany: 2.4GB<br />\n– Australia and Oceania: 5.2GB<br />\n– Brazil: 6.0GB<br />\n– South-east Asia: 7.0GB</p>\n<p>Generally speaking, from the above quick-hit list, you can probably figure out a ballpark for your specific region. Interestingly, there’s only ‘Basic’ maps offered for North America &amp; Europe. You can’t get a ‘Basic’ map for anywhere else, only detailed.</p>\n<p>Now, once you select the region you want, you’ll choose to download the file, which is simply a single file.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m54s660.png\"><img title=\"vlcsnap-2023-10-10-21h03m54s660\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h03m54s660_thumb.png\" alt=\"vlcsnap-2023-10-10-21h03m54s660\" width=\"720\" height=\"405\" /></a></p>\n<p>In case it isn’t clear at this point, downloading maps requires a computer of some sort. You’ll need your Polar Vantage V3 connected via the included USB-C cable, which then makes the watch appear as a standard USB mass storage device (like a thumb drive). You’ll take said map file, and simply drag it onto the watch. Done, it’s as simple as that.</p>\n<p>Now, over on the watch, you’ll see your maps as part of a map page:<br />\n<a href=\"https://media.dcrainmaker.com/images/2023/10/P1099778.jpg\"><img title=\"P1099778\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099778_thumb.jpg\" alt=\"P1099778\" width=\"720\" height=\"480\" /></a></p>\n<p>You can zoom/pan/etc on the map using the touchscreen, and the responsiveness is reasonably good.</p>\n<p>From a routing standpoint, the Polar Vantage V3 has turn-by-turn routes when paired with Komoot routes. This means it’ll give you upcoming turns, which are overlaid atop the maps. Note that the Vantage V3 cannot re-route on the fly, nor can it do routing without a pre-planned route. The exception for that is routing back to the start, in which case it’s either doing a route as the crow flies, or following the exact path you took to get there. I point that out, because the level of routing that Polar has is equal to Suunto and COROS, but falls short of Garmin’s ability to dynamically re-route you, or create routes between points on the fly. These are effectively different tiers of the mapping capabilities. Likewise, waypoints are not supported at this time.</p>\n<p>If you go off-course on the Vantage V3, it’ll simply tell you how far off-course, but won’t dynamically re-route you back to your planned route on alternate trails. You will however see those trails on the map (unless you’re out in a field, or in the ocean, in which case…umm…good luck).</p>\n<p>Polar says that this is their starting point for going deeper in the mapping realm, both with respect to connected providers (e.g., Komoot), as well as the features/functionality around maps/routing on the watch itself.</p>\n<h3><span>New ECG-Capable Heart Rate Sensor:</span></h3>\n<p>Next, Polar has added a new optical sensor to the Vantage V3, which they’re officially titling as “Gen 4”. This new optical HR sensor is paired with a new skin temperature sensor, as well as a new blood oxygen sensor. This is the first time we’ve seen Polar have either of those features. They’ve previously had neither in their watches.</p>\n<p>Additionally, and most notably, this is the first time ECG (electrocardiogram) has been included in a Polar wearable product. Starting with that, to take an ECG, you’ll tap down to the ‘Tests’ section, and then ECG’.</p>\n<p>It’s here you’ll see the new ECG screen, which requires you to place your other hand on the upper left button. That completes the ‘circuit’, allowing proper measurement. Once you’ve done that, you’ll start to see the ECG trace:</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m07s414.png\"><img title=\"vlcsnap-2023-10-10-21h07m07s414\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m07s414_thumb.png\" alt=\"vlcsnap-2023-10-10-21h07m07s414\" width=\"720\" height=\"405\" /></a></p>\n<p>After 30 seconds of showing you the trace/signal, the ECG will be complete. On the watch you’ll see average HR, HRV, and beat-to-beat interval.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m17s148.png\"><img title=\"vlcsnap-2023-10-10-21h07m17s148\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m17s148_thumb.png\" alt=\"vlcsnap-2023-10-10-21h07m17s148\" width=\"720\" height=\"405\" /></a></p>\n<p>At that point it’ll save the results to Polar Flow, where you can view the results and export out a PDF to take to your doctor.</p>\n<p>Now, it’s really important to note this is <strong>substantially different</strong> than what Apple, Garmin, Google/Fitbit,  Samsung, and others are providing. Very very different. To begin, Polar is not claiming to be a medical device (certified or otherwise). Instead, they are saying they are merely providing a trace that you can talk with your doctor about. While the company says they are interested in the medical realm, and have history there, at present, the Polar Vantage V3 is not a medical device from an ECG standpoint.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m27s652.png\"><img title=\"vlcsnap-2023-10-10-21h07m27s652\" src=\"https://media.dcrainmaker.com/images/2023/10/vlcsnap-2023-10-10-21h07m27s652_thumb.png\" alt=\"vlcsnap-2023-10-10-21h07m27s652\" width=\"720\" height=\"405\" /></a></p>\n<p>Feature-wise, the differences are arguably even more important in this context. All the others (Apple/Garmin/Fitbit/etc) are doing what’s called ‘Afib detection’, meaning, they’re looking for signs of an abnormal rhythm – either manually (when doing an ECG), or as a background process 24×7. Polar is doing neither. Thus, while you can take and record an ECG anytime you’d like on the Vantage V3, Polar is not going to tell you if it found an abnormal result (whereas the others are).</p>\n<p>Now, while I appreciate what Polar is doing here – I think in this context, given the existing landscape of the wearables world and certified ECG devices, that Polar’s marketing/implementation is probably misleading. While I agree it’s technically correct, the average consumer will see what they are doing, and assume the ECG will provide feedback as seen in countless “this saved my life” news stories over the past few years. The Vantage V3 won’t do that. It’s merely going to take a trace that you can send to your doctor. That trace could indeed show signs of something concerning, but it’s not going to give you instant feedback.</p>\n<p>Hopefully though, as Polar says, with their interest in the medical realm, we’ll see them make that leap towards a proper FDA or EU/CE certified medical device. But that process is typically at least a year, if not often much longer.</p>\n<h3><span>Initial Thoughts:</span></h3>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099783.jpg\"><img title=\"P1099783\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099783_thumb.jpg\" alt=\"P1099783\" width=\"720\" height=\"480\" /></a></p>\n<p>Now, like always, I’ve got my full in-depth review coming. That’ll be timed to when the unit actually starts shipping later in October. I generally prefer to align my reviews with the final firmware – to ensure there isn’t a case where the end-state firmware doesn’t match earlier firmware. While the unit I’m testing is final hardware, there are a few bits not yet finalized on the firmware side – hence, the date gap.</p>\n<p>The key thing I’m really digging into on the GPS side is ensuring that Polar’s new multi-band GPS chipset is acting like a proper high-end multi-band chipset. Meaning, on the Polar Ignite 3 last year, Polar’s multi-band implementation simply wasn’t good, easily beaten by lesser watches without multi-band GNSS. To rectify that on the Polar Vantage V3, Polar says they’ve re-architected the antenna design. While people often focus on GPS chipsets, the cold-hard truth is it’s antenna design these days that separates incredible, from good. Literally fractions of a millimeter one way or another in the antenna design is the difference between those two.</p>\n<p>In any event, from an overall product standpoint, I think Polar is on the right track here. They’ve checked off key boxes they needed to check off badly, most notably maps and an AMOLED display, but also a theoretically more accurate GNSS solution. Likewise, I’ll also be looking to see if the new optical HR sensor can improve upon some of the minor blips that the previous Vantage series was known for.</p>\n<p><a href=\"https://media.dcrainmaker.com/images/2023/10/P1099786.jpg\"><img title=\"P1099786\" src=\"https://media.dcrainmaker.com/images/2023/10/P1099786_thumb.jpg\" alt=\"P1099786\" width=\"720\" height=\"480\" /></a></p>\n<p>I like the starting point for the maps that Polar has here. The maps look great, and are responsive. And downloading them is easy enough. As noted earlier, while the Polar Vantage V3 lacks WiFi entirely, from a map-downloading standpoint while traveling, it’s actually not a bad thing to allow USB downloads of maps. Watches don’t tend to work with most hotel WiFi networks, so having the option to simply download a big file and transfer via USB is most functional for last-minute additions.</p>\n<p>In my full review, I’ll dive into some of the gaps that I see here, such as the lack of routing providers (e.g., Strava Routes) as well as re-routing capabilities. But these can largely be solved via software updates. I wouldn’t expect anything like onboard music support or contactless payments. Polar simply won’t be able to get the business contracts in place at their scale, to make that work (for streaming platforms like Spotify, or payment providers). Instead, like Suunto, they’ll need to make up for those gaps in other sport/fitness-focused areas.</p>\n<p>In any event, stay tuned for the full in-depth review, later this month.</p>\n<p>With that – thanks for reading!</p>","author":"DC Rainmaker","siteTitle":"DC Rainmaker","siteHash":"32f541eec2062fbf675b0daf837db78b41cd6160cf993de3c4b5e9b44a978706","entryHash":"9f05e2969d1fb7f7f39913e4b5f4737645744743d578150500cf2089ee0c5ed8","category":"Cycling"}