{"title":"How to remove location data in photos that you want to share","link":"https://www.macworld.com/article/351888/how-to-remove-location-data-in-shared-photos.html","date":1628067600000,"content":"<div>\n<section><div></div></section><p>In the naive early days of smartphone photography on devices with GPS or Wi-Fi-based approximate positioning, Apple and other operating system makers didn’t think about the implication of embedding coordinates in the metadata of the files when it came to sharing them.</p>\n\n\n\n<p>Back in 2010, Mythbusters’ and Tested.com’s <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/2010/08/12/technology/personaltech/12basics.html&amp;xcust=1-1-351888-1-0-0&amp;sref=https://www.macworld.com/feed\">Adam Savage posted a picture of his car to Twitter</a>, which at the time didn’t scrub geolocation information. Suddenly, people could find out exactly where he lived—and he wasn’t technically unsophisticated.</p>\n\n\n\n<p>Twitter and other social networks got savvier after that and removed coordinates from photos along with additional identifying metadata, reserving geolocation as something that could be chosen and was clearly identified.</p>\n\n\n\n<p>But when you share an image taken by the Camera app or other hardware or software that geotags images and videos via iOS, iPadOS, or macOS, you may inadvertently share that location even if you prefer not to. Here’s how to avoid that.</p>\n\n\n\n<h2>Photos for iOS and iPadOS</h2>\n\n\n\n<p>Apple added a way to remove location while sharing images and videos two years ago, even though it’s a little hard to spot:</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/ios-photo-options-dialogs.png?w=1200\" /><figcaption>The small Options link lets you remove location information before sharing through any means.</figcaption></figure></div>\n\n\n\n<ol><li>Open Photos.</li><li>Select one or more images and tap the <em>Share</em> button.</li><li>At the top of the sheet that appears, Apple shows in quite tiny text the number of images selected and “Options &gt;”. Tap that target.</li><li>The <em>Location</em> field is enabled under the Include label. Tap it to disable sending coordinates embedded in the photo or photos. You can also enable <em>All Photos Data</em> to send not just metadata but the entire history of editing and modifications stored for the image, enabling another Photos user to see and modify previous changes.</li><li>Tap <em>Done</em> and then tap your sharing method.</li></ol><p>In iOS/iPadoS 13 and 14, Location under Include is enabled by default; in current beta versions of iOS/iPadOS 15, it’s turned off.</p>\n\n\n\n<h2>Photos for macOS</h2>\n\n\n\n<p>It’s not quite so clear how to opt-out of location sharing in Photos for macOS.</p>\n\n\n\n<p>You can use a global setting that uses language so far out of date you will be forgiven for not understanding its purpose. In <em>Photos &gt; Preferences &gt; General</em>, notice a checkbox at the bottom labeled “Metadata: Include location information for published items.” This description made more sense when Photos had add-ons that let you publish directly to Twitter, Facebook, and other services. With Apple’s shift to sharing services, you’d be forgiven for not knowing that “published items” means “items you’re sharing.”</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-photos-prefs-disable-location.png?w=1176\" /><figcaption>“Published” here means anything you share.</figcaption></figure></div>\n\n\n\n<p>Uncheck this box, and geolocation data is removed before an image is shared, copied out when you drag the image from Photos to the Finder or another compatible app, or exported when choosing <em>File &gt; Export</em>. You can toggle it whenever and as frequently as you want.</p>\n\n\n\n<p>You can also select one or more images and then choose <em>Image &gt; Location &gt; Hide Location</em>, which prevents the location from appearing in Photos and from being included in any sharing or exporting. This preserves the location, however, so you can restore the geotag by selecting the image and then choosing <em>Image &gt; Location &gt; Revert to Original Location</em>.</p>\n\n\n\n<p>There’s one more way to suppress location from being included with media. Choose <em>File &gt; Export &gt; Export Photo</em> and uncheck the Location Information box. This option isn’t available for <em>File &gt; Export &gt; Export Unmodified Original</em> because it’s…an unmodified original you’re exporting!</p>\n\n\n\n<div><figure><img src=\"https://www.macworld.com/wp-content/uploads/2021/08/mac911-export-remove-location.png?w=1084\" /><figcaption>You can uncheck Location Information to suppress the geolocation in an image’s metadata on export.</figcaption></figure></div>\n\n\n\n<h2>Ask Mac 911</h2>\n\n\n\n<p>We’ve compiled a list of the questions we get asked most frequently, along with answers and links to columns: <a href=\"http://www.macworld.com/article/3077986/os-x/your-top-questions-to-mac-911-and-some-answers.html\">read our super FAQ</a> to see if your question is covered. If not, we’re always looking for new problems to solve! Email yours to <a href=\"mailto:mac911@macworld.com\">mac911@macworld.com</a>, including screen captures as appropriate and whether you want your full name used. Not every question will be answered, we don’t reply to email, and we cannot provide direct troubleshooting advice.</p>\n</div>","author":"Glenn Fleishman","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"9f0c1d0e757def5d36f7d03b9b1fc634d1e182a5cd2b41cc23f8125400be8068","category":"Apple"}