{"title":"Elicitor‐mediated simultaneous accumulation of phloridzin and ursolic acid in Annurca apple peel‐derived calli","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13955?af=R","date":1728623689000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Apple peel is rich in natural molecules, many exhibiting a significant bioactivity. In this study, our objective was to establish a novel callus line derived from the apple peel of the Italian local variety Annurca, known to accumulate high levels of dihydrochalcones and terpenes. In this regard, we tested the impact of one elicitor, yeast extract, on the expression of genes encoding key enzymes involved in phloridzin and ursolic acid biosynthesis, leading to the accumulation of these antioxidant compounds. We also assessed the bioactivity of callus extracts enriched in these phytochemicals.</p>\n<h2>RESULTS</h2>\n<p>After the elicitation, data showed increased expression of genes directly related to the synthesis of phloridzin and ursolic acid that were found to accumulate within the cultures. This presumably could explain the remarkable activity of extracts from the elicited-calli in inhibiting the growth of <i>Staphylococcus aureus</i> and <i>Bacillus cereus</i>. Also, the extracts enriched in antioxidant compounds inhibited reactive oxygen species (ROS) production in human cells exposed to ultraviolet-A (UV-A) radiation.</p>\n<h2>CONCLUSION</h2>\n<p>Our results underscore the vast potential of the Annurca apple peel cell line in producing natural compounds that can be employed as food components to promote human health. © 2024 The Author(s). <i>Journal of the Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Carmen Laezza, \nMaria Maisto, \nPaola Imbimbo, \nDaria Maria Monti, \nMariavittoria Verrillo, \nAntonio Di Loria, \nSimona Maria Monti, \nAdua Marzocchi, \nPaolo Grieco, \nGian Carlo Tenore, \nVincenzo D'Amelia, \nMaria Manuela Rigano","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"9f0f59db95a998d6ca4f1d9ed35b4ce0c43f3fbbb7833d4ba9198adde1976703","category":"Environment"}