{"title":"Evidence for an RNAi-independent role of Arabidopsis DICER-LIKE2 in growth inhibition and basal antiviral resistance","link":"https://academic.oup.com/plcell/article/36/6/2289/7625437?rss=1","date":1710115200000,"content":"<span><div>Abstract</div>Flowering plant genomes encode four or five DICER-LIKE (DCL) enzymes that produce small interfering RNAs (siRNAs) and microRNAs, which function in RNA interference (RNAi). Different RNAi pathways in plants effect transposon silencing, antiviral defense, and endogenous gene regulation. DCL2 acts genetically redundantly with DCL4 to confer basal antiviral defense. However, <span>DCL2</span> may also counteract <span>DCL4</span> since knockout of <span>DCL4</span> causes growth defects that are suppressed by <span>DCL2</span> inactivation. Current models maintain that RNAi via DCL2-dependent siRNAs is the biochemical basis of both effects. Here, we report that DCL2-mediated antiviral resistance and growth defects cannot be explained by the silencing effects of DCL2-dependent siRNAs. Both functions are defective in genetic backgrounds that maintain high levels of DCL2-dependent siRNAs, either with specific point mutations in DCL2 or with reduced DCL2 dosage because of heterozygosity for <span>dcl2</span> knockout alleles. Intriguingly, all DCL2 functions require its catalytic activity, and the penetrance of <span>DCL2</span>-dependent growth phenotypes in <span>dcl4</span> mutants correlates with DCL2 protein levels but not with levels of major DCL2-dependent siRNAs. We discuss this requirement and correlation with catalytic activity but not with resulting siRNAs, in light of other findings that reveal a DCL2 function in innate immunity activation triggered by cytoplasmic double-stranded RNA.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"9f1302df44ff89be2a05a66c6c12cf75fb4d5ee14ea1affb4f33ad0150bc0688","category":"Environment"}