{"title":"The Critical Role of Hydrological Distance in Shaping Nutrient Dynamics Along the Watershed‐Lake Continuum","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004860?af=R","date":1729100569000,"content":"<h2>Abstract</h2>\n<p>Terrestrial hydrological and nutrient cycles are subjected to major disturbances by agricultural operations and urbanization that profoundly influence freshwater resources. Non-point source pollution is one of the primary causes for water quality deterioration, and thus an emerging imperative in limnology is establishing empirical models that connect watershed attributes and hydrological drivers with lake nutrient dynamics. Here, we compiled three nation-wide nutrient, meteorological, and watershed-landscape data sets, to develop Generalized Linear Models that predict lake phosphorus and nitrogen concentrations as a function of the surrounding watershed characteristics within various hydrological distances across 104 Chinese lakes and reservoirs. Our national-scale investigation revealed that lake nutrient concentrations can be satisfactorily predicted by proxies of natural drivers and anthropogenic activities, reflecting the properties of the surrounding watershed. Counter to previous studies, we found that China's lake nutrient concentrations strongly depend on watershed characteristics within a hydrological distance of less than 45 km rather than the entire watershed. Furthermore, extensive human activities in watersheds not only compromise our predictive capacity, but also increase the hydrological distance that is relevant to predict lake nutrients. This national-scale characterization can inform one of the most contentious issues in the context of China's lake management, that is, the determination of the extent of the nearshore area, where nutrient control should be prioritized. As far as we know, our study represents the first attempt to apply the concept of hydrological distance and establish statistical models that can delineate the critical spatial domain primarily responsible for the nutrient conditions along the watershed-lake continuum.</p>","author":"Jiacong Huang, \nGeorge B. Arhonditsis, \nYinjun Zhang, \nShuai Zhang, \nYulai Ji, \nHans W. Paerl, \nErik Jeppesen, \nJunfeng Gao","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"9f16cdd688e88a21145558a7a1d5b253c1a6a2d25ee815dcb7590fa136c5ca3e","category":"Environment"}