{"title":"288 Effects of increasing water concentrations of oregano essential oil supplementation for lactating sows","link":"https://academic.oup.com/jas/article/102/Supplement_2/232/7664890?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>The use of essential oils as a supplement for sows has gained attention in recent years to potentially improve sow and litter performance. Sows (n = 182; avg. lactation length = 19.8 d) were blocked by parity, genetics, estimated farrowing date, and randomly allotted to one of four treatments when entering the farrowing barn. Treatments included: control, 0 mL, (CON, n = 46), 31 mL (L-OEO, n = 45), 47 mL (M-OEO, n = 46), or 63 mL (H-OEO, n = 45) of oregano oil (OEO; Ecodiar Liquid, Nutrinae, Palo Alto, CA) per liter of dosing water with medicators set at 1:128 dilution. Sows were fed a corn-soybean meal-DDGS based lactation diet that met or exceeded NRC (2012) requirements. Sow body weight (BW) was recorded upon entry, 2 d post-farrowing, and weaning. Sow backfat depth (BF) and loin muscle depth (LD) ultrasound measurements, body condition score (BCS), and Knauer sow caliper measurements were collected upon entry and weaning. Sow average daily feed intake (ADFI) was recorded daily 1-wk post-farrowing, then weekly until weaning. Sow water intake was recorded daily (DWI). Individual piglet BW were recorded d 1, d 7, and weaning. Data were analyzed using Proc Mixed procedure in SAS 9.4 with treatment and rep as fixed effects, parity class (P1, P2/P3, P4+) as a covariate, and individual sow as a random effect. Lactation length and number of piglets weaned were used as covariates for weaning data. Linear, quadratic, and cubic contrasts were analyzed among treatments. Litter scouring and medication rates were analyzed using chi-square analysis in the Proc Freq procedure in SAS 9.4. Differences were considered significant at <span>P</span> ≤ 0.05 and trend at 0.05 &lt; <span>P</span> ≤ 0.10. Week 3 lactation sow ADFI increased for L-OEO and H-OEO treatments but decreased for M-OEO compared with CON sows (CON: 7.29 kg/d, L-OEO: 7.60 kg/d, M-OEO: 7.03 kg/d, H-OEO: 7.55 kg/d; cubic; <span>P</span> = 0.0427). No differences were observed among treatments in overall lactation ADFI, DWI, changes in BF, LD, BCS, and piglet and litter growth performance. Sow BW change tended to decline and then increased as OEO increased in the water (CON: -8.79 kg, L-OEO: -6.36 kg, M-OEO: -8.03 kg, H-OEO: -10.52 kg; quadratic, <span>P</span> = 0.0640). There was a cubic tendency for OEO supplementation to reduce loss of caliper measurement (CON: -1.91, L-OEO: -0.98, M-OEO: -1.68, H-OEO: -1.00; <span>P</span> = 0.0598). Percentage of piglets treated with medications for various health issues decreased in the H-OEO supplemented group compared with the L-OEO and M-OEO supplemented groups, with CON group being intermediate and not different (CON: 7.01%, L-OEO: 9.35%, M-OEO: 9.91%, H-OEO: 4.15%; <span>P</span> = 0.0322). Overall, there were no significant impacts of OEO supplementation on sow and litter performance in this study. Future research is needed to determine the effectiveness of OEO in health-challenged sows and litters and the long-term effects of OEO on piglets post-weaning.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9f17ba3ab5232b2ceefbdf933b301708ab2859c52c47cb8a9d95101f2c29b9ee","category":"Environment"}