{"title":"Home sweet home: Evaluation of native versus exotic plants as resources for insects in urban green spaces","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1002/2688-8319.12380?af=R","date":1727265725000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/91848dab-9aca-4d8b-8318-27d815776152/eso312380-toc-0001-m.png\" alt=\"Home sweet home: Evaluation of native versus exotic plants as resources for insects in urban green spaces\" />\n<p>Our study shows that planting urban green spaces with native plants as a food source for flower-visiting and leaf-feeding insects can be a way to promote different insect species in urban areas. Planting or seeding based only on the needs of honey bees is less suitable for the conservation and promotion of insect diversity in urban green spaces, as the flower preferences and needs of honey bees do not match those of most other insects. Quantitative network of insect-group plant-species interactions. Each group is shown as a rectangle (Plant species: green = NATIVE, yellow = RELATED, pink = EXOTIC perennials; insect groups = black). The widths of the black rectangles are proportional to the abundance of insect species; those of the green, yellow and pink rectangles are proportional to the number of interactions of each plant species with insect individuals. Interactions are shown as connecting bars; their width reflects the number of interactions. Lines indicate interactions that were observed only once. Flower visitor groups: purple = <i>Apis mellifera</i>, pink = Lepidoptera, green = <i>Bombus</i>, yellow = Wild Bees, brown = Coleoptera, turquoise = Diptera, blue = Wasps. The numbers 1-4 in the green, yellow or pink rectangles of the individual plant species illustrate the order of the percentage of feeding damage.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nInsect decline and loss of biodiversity not only affect large-scale agricultural landscapes, but are increasingly recognized in urban environments. It is undisputed that a greater supply of flowers in urban green spaces can provide insects with more food and habitat. However, it is still controversial whether native wild plants or non-native ornamental plants and varieties are the right choice.\n\nTo answer this question we investigated the number of insects interacting with different types of plants: twelve ornamental and six related wild perennials. In this context, the number of flower visitors per plant species and plot was recorded at 10-minute observation intervals, as well as the feeding damage caused by insect herbivores on the leaves and stems of the study plants. We established 18 plant species in ten independent study plots in the city of Darmstadt, Germany. The plants were six native wild plant species, six ornamental plant species related to the wild plants from the same genus or family and six exotic ornamental plant species from other genera and families than the wild plants.\n\nNative insects (wild bees, flies, beetles, wasps) that feed on pollen and nectar visited wild perennials significantly more often (67% of all visits) than related ornamental (24%) and unrelated exotic plants (9%). In contrast, honey bees (<i>Apis mellifera</i>) showed no preferences to any of the three target plant groups and interacted with other plant species than most of the native insects in our study according to analyses of interaction networks.\n\nThe assessment of leaf damage caused by insect herbivores on the individual plants confirmed a similar and significant difference in the insects' choices. Leaves from wild plants showed the highest herbivory (mean 2.3% of the leaf area), followed by related ornamental plants (0.8%), whereas unrelated exotic plants were hardly consumed (0.1%) by herbivores.\n\n<i>Practical implication</i>. Our study shows that in urban green spaces, both flower-visiting and leaf-feeding insects are more likely to use native wild plants as a food source than closely related and exotic ornamental plants.\n</p>\n<h2>Zusammenfassung</h2>\n<p>\n\nDer Rückgang von Insekten und der Verlust der biologischen Vielfalt betreffen nicht nur großflächige Agrarlandschaften, sondern werden zunehmend auch im städtischen Umfeld festgestellt. Es ist unbestritten, dass ein größeres Blütenangebot in städtischen Grünflächen Insekten mehr Nahrung und Lebensraum bieten kann. Es ist jedoch umstritten, ob einheimische Wildpflanzen oder nicht-einheimische Zierpflanzen und -sorten die richtige Wahl sind.\n\nUm diese Frage zu beantworten, haben wir die Anzahl der Insekten untersucht, die mit verschiedenen Pflanzenarten interagieren: zwölf Zierpflanzen und sechs verwandte Wildpflanzenarten. In diesem Zusammenhang wurde die Anzahl der Blütenbesucher pro Pflanzenart und Parzelle in 10-minütigen Beobachtungsintervallen erfasst, ebenso wie die Fraßschäden, die Insektenherbivoren an den Blättern und Stängeln der untersuchten Pflanzen verursachen. Wir haben 18 Pflanzenarten in zehn unabhängigen Untersuchungsparzellen in der Stadt Darmstadt, Deutschland, angesiedelt. Bei den Pflanzen handelte es sich um sechs heimische Wildpflanzenarten, sechs mit den Wildpflanzen verwandte Zierpflanzenarten aus derselben Gattung oder Familie und sechs exotische Zierpflanzenarten aus anderen Gattungen und Familien als die Wildpflanzen.\n\nEinheimische Insekten (Wildbienen, Fliegen, Käfer, Wespen), die sich von Pollen und Nektar ernähren, besuchten die Wildpflanzen signifikant häufiger (67% aller Besuche) als verwandte Zierpflanzen (24%) und nicht verwandte exotische Pflanzen (9%). Im Gegensatz dazu zeigten Honigbienen (<i>Apis mellifera</i>) keine Vorliebe für eine der drei Zielpflanzengruppen und interagierten mit anderen Pflanzenarten als die meisten der einheimischen Insekten in unserer Studie, wie die Analyse der Interaktionsnetzwerke ergab.\n\nDie Bewertung der durch Insektenherbivoren verursachten Blattschäden an den einzelnen Pflanzen bestätigte einen ähnlichen und signifikanten Unterschied in der Wahl der Insekten. Blätter von Wildpflanzen wiesen die höchste Herbivorie auf (durchschnittlich 2,3% der Blattfläche), gefolgt von verwandten Zierpflanzen (0,8%), während nicht verwandte exotische Pflanzen kaum (0,1%) von Herbivoren gefressen wurden.\n\nUnsere Studie zeigt, dass in städtischen Grünanlagen sowohl blütenbesuchende als auch blattfressende Insekten einheimische Wildpflanzen eher als Nahrungsquelle nutzen als eng verwandte und exotische Zierpflanzen.\n</p>","author":"Doris Lerch, \nNico Blüthgen, \nKarsten Mody","siteTitle":"Wiley: Ecological Solutions and Evidence: Table of Contents","siteHash":"2d59a3492421ff8dc6c930252c6b4149e9691eaa8596381f5a50d8e1d8243fb4","entryHash":"9f1a47adc94f808f6a76784f80951ac47f6942ef2aabe7cb4ae03a7cd854cfed","category":"Environment"}