{"title":"Robust differential gene expression patterns in the prefrontal cortex of male mice exposed to an occupationally relevant dose of laboratory-generated wildfire smoke","link":"https://academic.oup.com/toxsci/article/201/2/300/7728454?rss=1","date":1722902400000,"content":"<span><div>Abstract</div>Wildfires have become common global phenomena concurrent with warmer and drier climates and are now major contributors to ambient air pollution worldwide. Exposure to wildfire smoke has been classically associated with adverse cardiopulmonary health outcomes, especially in vulnerable populations. Recent work has expanded our understanding of wildfire smoke toxicology to include effects on the central nervous system and reproductive function; however, the neurotoxic profile of this toxicant remains ill-explored in an occupational context. Here, we sought to address this by using RNA sequencing to examine transcriptomic signatures in the prefrontal cortex of male mice modeling career wildland firefighter smoke exposure. We report robust changes in gene expression profiles between smoke-exposed samples and filtered air controls, evidenced by 2,862 differentially expressed genes (51.2% increased). We further characterized the functional relevance of these genes highlighting enriched pathways related to synaptic transmission, neuroplasticity, blood–brain barrier integrity, and neurotransmitter metabolism. Additionally, we identified possible contributors to these alterations through protein–protein interaction network mapping, which revealed a central node at ß-catenin and secondary hubs centered around mitochondrial oxidases, the Wnt signaling pathway, and gene expression machinery. The data reported here will serve as the foundation for future experiments aiming to characterize the phenotypic effects and mechanistic underpinnings of occupational wildfire smoke neurotoxicology.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"9f221aabb45fc061abab5ee09dad872aa44e41b0c37107161f909fcb5880a2bd","category":"Environment"}