{"title":"156 Probiotics (direct fed microbials) and feed efficiency in dairy cows","link":"https://academic.oup.com/jas/article/102/Supplement_3/394/7757348?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Enhancing feed efficiency in dairy cattle is important because on one side it improves the utilization of natural resources, and thus reduces the environmental impact to produce milk; and on the other it may contribute to improve economic returns. Key factors modulating feed efficiency of cows include the fermentation process in the rumen as well as the digestion in both the small and large intestines, but also the way nutrients are metabolized and diverted to different body functions. These four aspects are influenced by the type and amounts of dietary nutrients, which in turn influence the rumen, as well as intestinal microbiomes. These four aspects can also be modulated by probiotics. Probiotics are defined as “live microorganisms, which, when administered in adequate amounts, confer a health benefit on the host”, but a better word for this type of microorganisms is “direct fed microbials” (DFM), as they can confer benefits not associated to heath. Most DFM for dairy cows have focused on the rumen (to foster fiber degradation or reduce risk of rumen acidosis) and have mainly been yeast-based. But there is a poorly explored opportunity to use bacterial and also fungal DFM targeting not only the rumen but also the small and large intestines. Some DFM have been shown to modify nutrient digestion, pH of the digesta, and alter the microbiome and the metabolites it produces. However, inconclusive results are reported in the literature, mainly due to the type of DFM supplemented and the lack of a holistic approach to understand the potential alteration in the dynamics of the entire digestive microbiome. Microbes in the digestive system have a role in degrading some of the nutrients, but they also interact with the intestinal epithelium, altering its absorptive capacity, and may exert an effect in the metabolism of the gut wall, and even influence the metabolism of the host. Modifications in the digestive microbiome elicited by some DFM have resulted in drastic changes in gene expression in whole blood from cows. These changes in the gut microbiome may also facilitate rapid fluctuations in the metabolism of the host and help the cow to adapt to sudden environmental changes, such as heat waves. Many studies using DFM have focused on milk yield, with fewer evaluating consequences on feed efficiency and digestive function. Some DFM may play a role on methane returns to the environment by modulating hydrogen fate in both the rumen and hindgut, and these DFM may also have potential to increase feed efficiency as more carbons could be potentially retained in the digesta. A summary of current state-of-the-art will be provided along with possible future directions and opportunities with DFM in dairy cows.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9f27a99dea46f0fa1f3d9a066144edf65685cd468773364e171c52b91328615d","category":"Environment"}