{"title":"Human genomic bycatch: Our DNA shows up in environmental samples","link":"https://arstechnica.com/?p=1939649","date":1684266258000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1368534275-800x533.jpg\" alt=\"Image of a DNA molecule formed from shrubbery.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/05/GettyImages-1368534275.jpg\">Enlarge</a> <span>/</span> People may accidentally sequence your DNA while trying to study something else entirely. (credit: <a href=\"https://www.gettyimages.com/detail/photo/green-dna-royalty-free-image/1368534275?phrase=dna&amp;adppopup=true\">Andriy Onufriyenko</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>It used to be that if you wanted to find a DNA sequence in a particular sample, you had to go searching for that specific sequence—you had to fish it out with a hook designed especially to catch it. But no more. DNA sequencing technology has advanced to the point where you can take a sample from almost any environment—a drop of water, an ice core, a scoop of sand or soil, even air—and just see whatever DNA is in there.</p>\n<p>This provides a non-invasive way to study wild populations and invasive or endangered species and has been used to monitor for pathogens (SARS-CoV-2, mpox, polio, tuberculosis) in wastewater. But guess who else’s DNA is in those environmental samples? Yup. Ours.</p>\n<h2>Something identifiable in the air</h2>\n<p>Liam Whitmore is a zoologist and conservationist who studies green turtles. He and his colleagues realized that having human DNA slip into research samples might be an issue, so they looked to see if they could find any in old water and sand samples they had taken as part of a wildlife and pathogen monitoring study. They did. Then they went intentionally searching for specific human sequences, and, in water, sand, and air samples, they found plenty of genomic regions that could identify a person’s ancestry and susceptibility to a number of diseases. They didn’t go so far as to identify individuals but noted that someone probably could compare these sequences to public genetic data without too much difficulty.</p></div><p><a href=\"https://arstechnica.com/?p=1939649#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1939649&amp;comments=1\">Comments</a></p>","author":"Diana Gitig","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9f352cd999ee9ba2c8f91caf7fb66d364852726a30874a388607d690627d9bba","category":"Tech"}