{"title":"Maresin-like 1 Ameliorates Neuropathology of Alzheimer&#039;s Disease in Brains of a Transgenic Mouse Model","link":"https://www.preprints.org/manuscript/202407.0723/v1","date":1720520669000,"content":"1) Background: Impeded resolution of inflammation contributes substantially to the pathogenesis of Alzheimer's disease (AD); consequently, resolving inflammation is pivotal to the amelioration of AD pathology. This can potentially be achieved by the treatment with specialized pro-resolving lipid mediators (SPMs), which should resolve neuroinflammation in brains. 2) Methods: Here, we report the effects of long-term treatment with a SPM, maresin like 1 (MarL1), on AD pathogenesis in a transgenic 5xFAD mouse model. 3) Results: MarL1 treatment reduced Aβ overload, curbed the loss of neurons in brains especially cholinergic neurons associated with cleaved-caspase-3-associated apoptotic degeneration, reduced astrogliosis and microgliosis and the pro-inflammatory M1 polarization of microglia, curbed the AD-associated decline in an-ti-inflammatory Iba1+Arg-1+-M2 microglia, reduced astrogliosis-associated level of neuroin-flammatory TNF-α, inhibited phenotype switching of pro-inflammatory neurotoxic A1 astrocytes and N1 neutrophils, promoted polarization of inflammation-resolving neuroprotective A2 as-trocytes, promoted the blood–brain-barrier-associated tight-junction protein claudin-5 and de-creased neutrophil leakage in 5xFAD brains, and induced the switch of neutrophils toward the inflammation-resolving N2 phenotype. 4) Conclusion: Long-term administration of MarL1 mit-igates AD-related neuropathogenesis in brains by curbing neuroinflammation and neurodegen-eration. These findings provided the preclinical leads and mechanistic insights for the develop-ment of MarL1 into an effective modality to ameliorate AD pathogenesis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9f3c32c19aed74aafe46380c023b52da42d49cae393429684a067b7872e97808","category":"Interdisciplinary"}