{"title":"Google’s Stadia Controller salvage operation will run for another year","link":"https://arstechnica.com/?p=1991731","date":1702924427000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/stadia-graffiti-removal-800x450.jpg\" alt=\"Man removing Stadia logo from a wall with high pressure water spray\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2022/10/stadia-graffiti-removal.jpg\">Enlarge</a> <span>/</span> Like it never even happened. (credit: Aurich Lawson / Getty Images)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Stadia might be dead, but the controllers for Google's cloud-based gaming platform are still out there. With the service permanently offline, the proprietary Stadia Controller threatened to fill up landfills until Google devised a plan to convert them to generic Bluetooth devices that can work on almost anything. The app to open up the controller to other devices is a web service, which previously had a shutdown date of December 2023. That apparently isn't enough time to convert all these controllers, so the Stadia Controller Salvage operation will run for a whole additional year. X (formerly Twitter) user <a href=\"https://twitter.com/Wario64/status/1735720037053501607\">Wario64</a> was the first to spot <a href=\"https://stadia.google.com/controller/\">the announcement</a>, which says the online tool will continue running until December 31, 2024.</p>\n<p>As a cloud-based gaming service, Stadia had all the game code run on remote servers, with individual video frames streaming live to the user and showing the gameplay. The user would press buttons on their local controller, and every single individual button press had to travel across the Internet to the remote game server to be processed. These services live and die by their latency; in an attempt to reduce latency, the Stadia Controller connected to the Internet directly over Wi-Fi instead of connecting via Bluetooth to your computer and <em>then</em> to the Internet. Google claimed that one less hop on the local network led to shorter latency, especially since  the service was originally built around the power-limited Chromecast dongle.</p>\n<div><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/StadiaController.png\"><img alt=\"The official Stadia Controller in &quot;clearly white.&quot;\" src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/StadiaController-980x817.png\" /></a><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/StadiaController.png\">The official Stadia Controller in \"clearly white.\"</a> (credit: Google)</p></div>\n<p>With the service dead, the Wi-Fi-only controller wouldn't work wirelessly, leaving old-school USB as the only way to use the controller. However, Stadia Controllers already came with a <a href=\"https://arstechnica.com/gadgets/2022/09/stadia-controllers-could-become-e-waste-unless-google-issues-bluetooth-update/\">dormant Bluetooth chip</a>, so Google cooked up a way to convert the orphaned controllers from Wi-Fi communication to Bluetooth, allowing them to wirelessly connect to computers and phones as a generic HID (Human Interface Device). Normally you'd expect a download for some kind of firmware update program, but Google being Google, the Stadia Controller update process happens entirely on a webpage. Google's controller update page has a very fancy \"<a href=\"https://wicg.github.io/webusb/\">WebUSB</a>\" API setup—you fire up a <a href=\"https://caniuse.com/?search=WebUSB%20\">Chromium browser,</a> plug in your controller, grant the browser access to the device, and the webpage can access the controller directly and update the firmware, without any program to install.</p></div><p><a href=\"https://arstechnica.com/?p=1991731#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1991731&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9f536f61c0c38b4bc7b7ef3a6d5996a2f2f7484c606f62714351cb9111ba8064","category":"Tech"}