{"title":"Usefulness of Perioperative Nutritional Therapy with the Glutamine/Arginine/Calcium &beta;-Hydroxy-&beta;-Methylbutyrate Product in Esophageal Cancer Surgery: A Single-Center Retrospective Study","link":"https://www.preprints.org/manuscript/202406.1219/v1","date":1718702955000,"content":"A useful perioperative nutritional therapy for highly invasive esophageal cancer surgical cases needs to be developed. We clarified the usefulness of amino acid-enriched nutritional therapy using glutamine (Gln)/arginine (Arg)/calcium β-hydroxy-β-methylbutyrate (HMB) products on the short-term postoperative outcomes of minimally invasive esophagectomy for esophageal cancer. Altogether, 114 patients (Gln/Arg/HMB group) received perioperative nutritional therapy with Gln/Arg/HMB products, and we retrospectively investigated the change in nutritional parameters including skeletal muscle mass, occurrence of postoperative complications, and short-term postoperative outcomes in this group. The results were compared between the Gln/Arg/HMB and control groups (79 patients not receiving the Gln/Arg/HMB products). The incidence of all postoperative complications, sputum expectoration disorder, and pleural effusion of grade ≥III was significantly lower in the Gln/Arg/HMB group (62.0% vs. 38.6%, p = 0.001; 44.3% vs. 28.1%, p = 0.020; 27.8% vs. 13.2%, p = 0.011, respectively). The psoas muscle area and postoperative body weight was significantly higher at 1 month and 1 year after surgery in the Gln/Arg/HMB group than in the control group (93.5% vs. 99.9%, p &amp;lt; 0.001; 92.0% vs. 95.4%, p = 0.006). Perioperative amino acid-enriched nutritional therapy may improve the short-term postoperative outcomes, nutritional status, and skeletal muscle mass of esophageal cancer surgical patients.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9f58399877053e3d043c7a9b41409501227f0380d1328b288d54f5eb4a28ab66","category":"Interdisciplinary"}