{"title":"New Roomba promises to not smear dog poop all over the house","link":"https://arstechnica.com/?p=1793242","date":1631211138000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/19-980x735.jpg\" /></div>\n        <p>\n          Oh no, Fido... What have you done?!                  </p>\n        </div>\n      </li>\n      </ul><p>Robot vacuums are a great investment for a pet owner, since they give you a helper that can stay on top of all that dirt and pet hair. With a noisy motor and lots of scheduling options, people are often tempted to run the robot while they're away, but if you do that, you'd better be very confident in your pet's potty training. If you've never seen what happens when a robovac encounters Fido's little accident, consider yourself lucky.</p>\n<p>iRobot is out to fix this robovac edge case with the new <a href=\"https://www.irobot.com/roomba/j-series\">Roomba j7+ Robot Vacuum</a>. It has a new \"Genius 3.0\" obstacle detection system, a new front camera, and some AI-powered software. And one of the obstacles it looks out for is poop.</p>\n<p>If you've never heard of this \"poop+Roomba\" phenomenon, you definitely shouldn't ever Google it and click on the results that pop up, like <a href=\"https://www.reddit.com/r/Wellthatsucks/comments/jf17lt/the_roomba_ran_over_our_dogs_shit/\">this one</a> or <a href=\"https://deadspin.com/our-roomba-vacuumed-the-house-with-dog-shit-1744174290\">this</a> or <a href=\"https://www.unilad.co.uk/viral/guys-roomba-runs-over-dog-poo-smears-it-everywhere/\">this</a>. To save you some trauma, robo vacs have a lot of moving parts, like wheels and spinning brushes. This is great if you're driving over and picking up dry dirt, but if the robot encounters a soft mass of <em>something </em>that it can grind up, those spinning brushes quickly become paint rollers. Then the robot drives <em>all over</em> the house. It's bad.</p></div><p><a href=\"https://arstechnica.com/?p=1793242#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1793242&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"9f735b9715ce0fc0091ae870ac19edddb6049228da88e1fa40cf142ad06bac50","category":"Tech"}