{"title":"Mountain bike tyre pressure explained | Everything you need to know","link":"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/","date":1623763860000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/three-different-size-tyres-2-c552996.jpg?quality=45&amp;resize=620,413\" />                                            <p>\n</p><p>Tyres are one of the most important components when it comes to the performance of your <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-how-to-choose-the-right-one-for-you/\">mountain bike</a> – after all, they’re the only thing connecting you and your bike to the ground. As such, getting the tyre pressure on your mountain bike just right is vital to its performance on the trail.</p>\n<p>However, there are a number of variables that go into figuring out the ideal pressure range for a mountain bike tyre, such as the tyre’s width and carcass thickness, the rubber compound, the diameter, and the rim’s width and overall shape.</p>\n<p>The types of conditions and trails you’re riding, and your own riding style will also have a significant impact on how much air is appropriate.</p>\n<p>Get your tyre pressure right and it will improve the comfort, grip and speed of your mountain bike. Get it wrong and, well, everything goes in the opposite direction.</p>\n<p>Sound scary? Well, don’t worry because we’re here to help and will run through everything you need to know to get your MTB tyre pressures just right, from the factors influencing tyre pressures, right through to our own pressure recommendations.</p>\n<p>First, a quick disclaimer: it’s worth noting that what works for one person might not work for you – everyone has different experiences and preferences when it comes to tyre pressures.</p>\n<p>So, treat this as a guide and not a concrete system. The key is to fine-tune your pressure so you find what works for you, your bike and where you ride.</p>\n<h2>What’s the right tyre pressure for your mountain bike?</h2>\n<div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/proper-tyre-pressure-root-f516699.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The right tyre pressure for you and your bike will provide a balance of comfort, grip, puncture protection and rolling speed.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/too-high-pressure-root-24572b0.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>If the pressure is too high, as pictured here, the tyre will ping off or lose grip on obstacles and trail features.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/06/too-low-tyre-pressure-flat-ground-91770e8.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>If your tyre pressure is too low, you may feel dings through to the rim when you hit a root or rock. Equally, the tyre will squirm and feel unstable through corners.</span>\n    </figcaption><span>\n                    <i>Russell Burton / Immediate Media</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\n\n<p>Well, it depends – unfortunately, there’s not an easy answer here. When trying to decide on the correct tyre pressure for your mountain bike, it’s all about balance.</p>\n<p>We want a tyre to remain stable and grip well in corners, and it needs to add some insulation from trail features, such as rocks and roots, again to help with grip. It also needs to remain inflated when it suffers a big hit – nobody likes punctures!</p>\n<p>Rolling resistance is a big factor, too – how can you find a trade-off between grip and rolling speed?</p>\n<h2>What factors influence mountain bike tyre pressure?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> A wide range of factors influence tyre pressure.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>As we’ve already touched upon, a number of factors influence the ‘right’ tyre pressure for you and your bike. Let’s run through them.</p>\n<h3>Rider and bike weight</h3>\n<p>The logical place to start is the combined weight of you and your bike. It stands to reason that a heavier rider and bike is going to need higher pressures than a lighter rider.</p>\n<p>Why? A heavier rider will put more force through the tyres and thus this needs to be balanced with correspondingly higher pressures. The opposite applies to a lighter rider.</p>\n<h3>Terrain</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> No one wants to spend time fixing punctures at the side of a trail.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Likewise, where are you going to ride? If you’re riding somewhere super-rocky and rooty, perhaps on fast terrain so you might be hitting those features at speed, you might need to up your pressure a touch.</p>\n<p>Higher pressures mean less tyre deformation when you hit a rock, and so less chance of it puncturing – though if pressures are too high, you may increase the risk of tearing your tyre’s carcass on a sharp edge.</p>\n<p>Conversely, if you’re riding on smoother terrain, or perhaps at lower speeds (think super-steep muddy and rooty tech trails), lower pressures will allow the tyre to deform more, enabling it to better mould to the ground’s shape, boosting grip.</p>\n<p>As you’ll notice, there’s also some nuance here to appreciate – a track in the dry might be very different when it’s wet, and so your pressures might have to change depending on the trail’s condition.</p>\n<h3>Riding style</h3>\n<p>Though less ‘measurable’, a rider’s style might also be taken into account.</p>\n<p>If you’re a bit more precise with your riding, weaving smoothly through obstacles, you might get away with a couple of psi less. However, if you’re someone with more of a point-and-shoot style, you might need to pay a little more attention to puncture protection.</p>\n<h2>How does a tyre’s construction influence tyre pressure?</h2>\n<p>Now let’s look at the tyres themselves. After all, even the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">best mountain bike tyres</a> come in a wide range of widths, diameters, compounds and carcass types – all of which can influence the pressure required.</p>\n<h3>Tyre width</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The width of tyres will have an impact on the correct pressure. Here we have (from left to right) a 2.2in XC tyre, a 2.4in trail tyre and a 2.6in enduro tyre.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>First up is the obvious one – the width of the tyre. This also relates to the overall shape and volume of the tyre, which itself is dependent on the internal width of the rim of the <a href=\"https://www.bikeradar.com/features/best-mountain-bike-wheels/\">mountain bike wheel</a> it is fitted to.</p>\n<p>A wider tyre will have a larger volume of air inside it. Likewise, a given tyre, on a wider rim, will inflate wider than the same tyre on a narrower rim.</p>\n<p>As a general rule, a larger volume tyre can handle lower pressures before it feels imprecise and there’s excessive movement of the tyre on the rim, or before it becomes more susceptible to punctures or burping, whereby the bead of a tubeless tyre pulls away briefly from the rim, expelling air.</p>\n<p>Furthermore, running a higher volume tyre at too high a pressure makes it more likely to feel pingy and skittery.</p>\n<p>As a rule of thumb, a higher volume tyre can be run at slightly lower pressures than a lower volume tyre setup.</p>\n<h3>Rim width</h3>\n<p>Going a bit deeper into this, wider tyres tend to perform better on correspondingly wider rims. A wide tyre on a narrow rim can be more lightbulb-shaped once inflated and prone to rolling side-to-side on a rim, leading to an imprecise feel.</p>\n<p>A narrow tyre on a wide rim becomes too square, which changes the feel of the tyre as you lean in a corner, and can lead to the shoulder treads squirming. Cornering lean angles can also be reduced.</p>\n<p>So, what do we mean when we talk about ‘narrow’ rims and ‘wide’ rims? And what’s the best match between tyre width and rim width?</p>\n<ul><li>Though there are variations, a narrower 2.2in tyre will be better mounted to a rim with an internal width of roughly 25mm</li>\n<li>A 2.4in tyre mounted to a 25mm to 30mm rim is a good starting point</li>\n<li>At 2.5 to 2.6in wide, we’d be looking for a 28 to 35mm rim</li>\n<li>Finally, 2.8in tyres are likely best suited to a 35mm+ rim</li>\n</ul><h3>Tyre carcass</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Mountain bike tyres come with different carcass constructions, depending on their intended use.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>The next key variable with the tyre is its carcass and this comes down to the construction. Quite often, tyre brands will supply the same tyre tread and width with a number of carcasses because different carcasses have pros and cons, depending on the intended use.</p>\n<p>A thicker carcass will have more puncture protection and may have a more ‘damped’ feel to it. However, it’ll be heavier and as there’s more material in the sidewall of the tyre it could be less supple – this can change how efficiently it rolls.</p>\n<p>As a thicker carcass tyre is inherently stronger, in a mountain bike application we might be tempted to run a little less pressure. The tyre should add some puncture protection back into your setup and, as the tyre is more robust overall, it should also retain a bit more stability on the rim.</p>\n<p>A thinner tyre, on the other hand, might be run at a touch higher pressure to guard against punctures. With the additional suppleness that comes with a thinner carcass, it’ll still deliver the grip and comfort you want.</p>\n<p>As always, the carcass you choose will depend on the balance you want between weight, rolling efficiency, puncture protection and grip.</p>\n<h3>Tyre compound</h3>\n<p>As well as the tyre carcass type, you will also want to consider the tyre compound. Tyre compound refers to the blend of materials made up to make the rubber – some will be softer than others.</p>\n<p>A soft compound tyre will give more grip for a given pressure, as the rubber itself boosts traction. Here you might consider adding a touch more pressure because this will give the tyre more protection and stability, while retaining that grip you want.</p>\n<h2>Should a rear tyre be pumped up harder than the front?</h2>\n<p>Finally, let’s look at the job of the front and rear tyres, and what impact that has on pressure.</p>\n<p>The front tyre’s role is very much one of grip – both for braking and cornering.</p>\n<p>We know that lower pressures increase grip so, as long as you’re not so low as to induce tyre roll, we want to increase grip as much as we can, to boost control.</p>\n<p>At the other end of the bike, the rear wheel generally has to put up with more abuse – it’s the one most likely to <a href=\"https://www.bikeradar.com/advice/workshop/how-to-fix-a-puncture-video/\">suffer a puncture</a>. On top of that, the rear tends to be the draggier of the two wheels due to rider weight distribution between the wheels.</p>\n<p>While the relationship between pressure and rolling efficiency is complex, on a mountain bike it’s advisable to run the rear tyre pressure a little higher than the front – it usually makes it roll faster and adds puncture protection.</p>\n<h2>So, what pressure should you run your tyres?</h2>\n<p>As you’ll have learnt by now, there’s a lot of detail here, and finding the right pressure for you and your bike is part art, part science.</p>\n<p>Everything we’ve covered illustrates why tyre pressure is a continuous process of trial and error, to find the right pressure for your setup, the terrain and conditions.</p>\n<p>Now we’re going to delve into a few numbers to help you pick a starting point. However, before we kick things off, we’re going to make two very quick assumptions about your tyre setup.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> We’d recommend using tubeless tyres for mountain biking.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>First off, we’re assuming that your mountain bike is set up <a href=\"https://www.bikeradar.com/advice/buyers-guides/tubeless/\">tubeless</a>. This means the <a href=\"https://www.bikeradar.com/advice/buyers-guides/bike-inner-tubes/\">inner tube</a> has been removed, the rim sealed with a rim strip or it’s a UST (Universal Standard Tubeless) design, and a tubeless valve and <a href=\"https://www.bikeradar.com/features/which-tubeless-sealant-works-the-best/\">tubeless sealant</a> have been added.</p>\n<p>A tubeless setup will give you more protection against punctures and help provide a better ride quality because the friction between an inner tube and the inside of the tyre can inhibit the tyre’s ability to deform to the trail.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Switching to tubeless will avoid pinch flats if you hit a root or rock with a soft tyre.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>You can also run tubeless tyres at slightly lower pressures because you remove the risk of pinch flats, where an inner tube gets pinched against the rim and punctures. If you’re running inner tubes, we’d recommend looking into the advantages of tubeless for mountain biking.</p>\n<p>Secondly, we’re not talking about <a href=\"https://www.bikeradar.com/features/no-more-flat-tyres-three-puncture-preventers-tested/\">tyre inserts</a> in this guide. Tyre inserts are rings of foam that sit inside a tubeless tyre. They offer a range of potential benefits, including increased tyre stability, puncture protection and tyre security. Generally, they’ll allow you to run lower tyre pressures too.</p>\n<section><div>\n        <h3>Should you just pump your tyres up to the pressure recommended on the sidewall?</h3>\n<p>Tyres usually have a lot of information to digest on the sidewalls. This may include the carcass type, width, compound and maximum and minimum pressures.</p>\n<p>As a general rule, you shouldn’t go above or below the stated pressure range, but many riders do run lower pressures without any issues, particularly on a tubeless setup. Obviously, you do so at your own risk.</p>\n<p>\n\n    </p></div>\n    </section><h2>Tyre pressure guide for mountain bikes</h2>\n<p>As we mentioned at the top, the best tyre pressure can vary from one rider to another and is influenced by a wide range of factors. As a result, our goal here is to give you a starting point from which to experiment with your individual setup, rather than make cast-iron recommendations.</p>\n<p>Let’s take BikeRadar’s technical editor Tom Marvin as a case study when looking at tyre pressure for all-round trail riding. He weighs, fully kitted up, around 80kg.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> 21psi in the front and 23psi in the rear is a good starting point for trail riding with a 2.4in tyre on a 30mm-wide rim.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>If he’s on his regular <strong>trail bike</strong>, riding <strong>mixed terrain</strong> and in <strong>mixed conditions</strong>, with <strong>2.4in tyres</strong> on a <strong>30mm-wide rim</strong>, with a <strong>medium-strength carcass </strong>and <strong>regular stickiness compound</strong>, his starting point would be:</p>\n<ul><li>21psi in the front</li>\n<li>23psi in the rear</li>\n</ul><p>This should give a good combination of grip, control, tyre stability, rolling resistance and puncture resistance.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Drop the pressure for a wider tyre.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>If he was to pop a <strong>2.6in tyre</strong> on the same <strong>trail bike</strong>, he’d look at dropping to:</p>\n<ul><li>19psi in the front</li>\n<li>21psi in the rear</li>\n</ul><div>\n    <img /></div><div><figcaption><span><i></i> With a 2.2in tyre on a narrower rim, we’d recommend 24psi in the front and 26psi in the rear.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Alternatively, a <strong>2.2in tyre </strong>on a <strong>slightly narrower rim</strong> (approx. 25mm) would equate to:</p>\n<ul><li>24psi in the front</li>\n<li>26psi in the rear</li>\n</ul><p>As we’ve already covered, terrain and conditions have an impact, and on rocky terrain Tom might add a couple of psi, but if it was wet and muddy, he’d drop down a couple of psi – even as low as 18 to 19psi in the front tyre, if it was nice and wide.</p>\n<p>There will be riders who want to ride at higher pressures, for other reasons. For example, if you regularly burp tyres or have a particularly aggressive cornering style, then higher pressures will keep the tyre securely locked into the rim</p>\n<p>If you find burping tyres to be a problem on your trails with your riding style, then you might even look towards pressures in the high-twenties.</p>\n<p>From our examples, hopefully you can start to work out what’s right for you. It’s worth noting that the differences in pressures look relatively small – a couple of psi here or there. However, we’ve found that the bigger the tyre volume, the more noticeable small changes are.</p>\n<p>We’d recommend using a digital pressure gauge to adjust your tyre pressure. It’s a really handy tool to get accurate readings and also allows you to fine-tune pressure out on the trail if you’re really trying to get things dialled in. We’ve got a round-up of the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tyre-pressure-gauges/\">best tyre pressure gauges</a>.</p>\n<p>Context is everything, so if you’re going to start experimenting with tyre pressures, we’d strongly recommend getting hold of a digital pressure gauge and using it consistently to get a good impression of how the various factors we’ve spoken about influence one another.</p>\n<h2>How do you know if you’ve got the right tyre pressure?</h2>\n<p>Finally, assuming you’re now starting to fine-tune your tyre pressures, how do you know when you’ve landed on the right numbers?</p>\n<p>Well, if you’re on steep, slow technical tracks or fast and high-load tracks, and can feel the front tyre roll as you push it, or if you start feeling harsh knocks and dings through the rim when you hit a rock or root, you should add more air in your tyres to give better stability and puncture protection.</p>\n<p>On the other hand, you’re likely to be too high in pressure if, when you ride over rocks or roots (and especially if they’re crossing your track at an angle), your tyre feels like it pings or slides off in an uncontrolled manner.</p>\n<p>Equally, if you’re struggling to hold a line when the trail is off-camber, perhaps you need a little less pressure in there.</p>\n<p>Remember, it’s a real balancing act, so get out there and start experimenting.</p>","author":"Tom Marvin","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"9f7445a1d763ab9cb716b9ba757905cb2a73c839243bd0437200299ab0abd5b5","category":"Cycling"}