{"title":"Indiana Jones จะเป็นเกมเอ็กคลูซีฟสำหรับ Xbox หลัง Microsoft ซื้อ ZeniMax สำเร็จ","link":"https://www.blognone.com/node/134506","date":1687501208000,"content":"<div><div><div><p>ปี 2020 ทาง Microsoft <a href=\"https://www.blognone.com/node/121609\">เข้าซื้อ ZeniMax (บริษัทแม่ของ Bethesda Softworks)</a> เข้ามาอยู่ในเครือ Xbox Game Studios สิ่งแรกที่เปลี่ยนไปหลังจากการซื้อกิจการเสร็จสิ้นคือการประกาศว่า Starfield จะเป็นเกมเอ็กคลูซีฟของ Xbox Series X/S และล่าสุดเกม Indiana Jones ที่เคยเปิดตัวในปี 2021 ก็เป็นอีกหนึ่งเกมที่กลายเป็น Xbox เอ็กคลูซีฟเช่นกัน</p>\n<p>เรื่องนี้ถูกค้นพบจากการที่ FTC ไต่สวนกรณีดีล Activision Blizzard  โดยได้ข้อมูลจาก Pete Hines รองประธานของ Bethesda เรื่องดีลระหว่าง ZeniMax กับ Disney ในการทำเกม Indiana Jones ที่จากเดิมจะเป็นเกมลงหลายแพลตฟอร์ม แต่หลังจากการซื้อกิจการ ก็มีการแก้ไขรายละเอียดสัญญาให้ Indiana Jones เอ็กคลูซีฟเฉพาะ Xbox</p>\n<p>Pete Hines ระบุเพิ่มเติมว่า เนื่องจากในกระบวนการพัฒนาเกม ทีมพัฒนาได้รับฟีดแบ็คมากมายจาก Disney ซึ่งการจะทำและปรับทั้งหมด จะกระทบต่อไทม์ไลน์ที่วางเอาไว้ และในการเซ็นสัญญาเป็นพาร์ทเนอร์กับ Disney ทำให้สตูดิโอไม่มีสิทธิมีเสียงมากนัก ดังนั้นการจะทำให้ทันตามไทม์ไลน์ ก็ต้องทำลงแพลตฟอร์มเดียว</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/e628d4757a1f70fe6086f232d5adc74c.jpg\" /></p>\n<p>เกม Indiana Jones พัฒนาโดย MachineGames ที่มีผลงานก่อนหน้าอย่างซีรี่ส์ Wolfenstein เปิดตัวในปี 2021 ตอนนั้นผู้พัฒนาไม่ได้ระบุว่าจะลงในเครื่องไหนบ้าง และข่าวคราวของตัวเกมก็เงียบหายไปกว่า 2 ปี และอัพเดตเพิ่มเติมจากคุณ Todd Howard ที่ทำหน้าเป็น Executive Producer ให้กับเกมว่า ตัวเกมจะดำเนินเรื่องในปี 1937 ณ เมืองวาติกัน ซึ่งจะอยู่ระหว่างหนังภาค Raiders of the Lost Ark และ the Last Crusade</p>\n<p>ตัวเกมจะลงให้กับเครื่อง PC และ Xbox Series X/S เท่านั้น และจะเป็นเกม Xbox Game Pass ตั้งแต่วันแรกที่วางจำหน่าย</p>\n<p>ที่มา - <a href=\"https://www.engadget.com/new-indiana-jones-game-became-an-xbox-exclusive-after-microsoft-bought-zenimax-210157957.html\">Engadget</a>,<a href=\"https://www.ign.com/articles/machinegames-indiana-jones-game-was-originally-planned-for-release-on-ps5\">IGN</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/xbox-series-x\">Xbox Series X</a></div><div><a href=\"/topics/microsoft\">Microsoft</a></div><div><a href=\"/topics/games\">Games</a></div><div><a href=\"/topics/zenimax\">ZeniMax</a></div><div><a href=\"/topics/activision-blizzard\">Activision Blizzard</a></div></div></div>","author":"Exfreedom","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9f76b78be0c2ced60bc3efec06143f85b6d02762ba4c6592521070fa26ec1f3d","category":"Thai"}