{"title":"Performance of DNA barcodes for informing the subspecies controversy in North American populations of Callophrys gryneus (Hübner, [1819]) (Lepidoptera: Lycaenidae)","link":"https://academic.oup.com/biolinnean/article/doi/10.1093/biolinnean/blad094/7257086?rss=1","date":1693440000000,"content":"<span><div>Abstract</div>Analysis of genetic divergence in published mitochondrial DNA barcodes from ‘juniper’ and ‘cedar’ hairstreaks, <span>Callophrys gryneus</span> (Hübner) and <span>Callophrys muiri</span> (Hy. Edwards), together with a comparison of phenotypic differences in populations from North America, have been used to address the long-standing controversy regarding subspecies and species assignments in this confusing group of hairstreaks. The most recent view holds that <span>C. gryneus</span> is a single polytypic species comprising 11 nominal subspecies and that <span>C. muiri</span> from California is a valid species. An alternative view subdivides <span>C. gryneus</span> into three nominal species, <span>C. gryneus</span> (<span>s.s.</span>), <span>Callophrys siva</span> and <span>Callophrys nelsoni</span>, each with several named subspecies, and retains <span>C. muiri</span> as a full species. Haplotype networks, phylogenetic analysis and analysis of molecular variance of barcodes provided evidence supporting the subspecies scenario. However, barcodes from closely related congeners of <span>C. gryneus</span> (<span>s.l.</span>) revealed pairwise genetic divergences that would also support elevating three subspecies (<span>C. g. castalis</span>, <span>C. g. siva</span> and <span>C. g. nelsoni</span>) to full species. The barcode data also raise the question of whether <span>C. muiri</span> warrants full species status. Larval host plant preference as a possible driver of genetic differentiation in western populations of this group is also discussed briefly.</span>","author":"","siteTitle":"Biological Journal of the Linnean Society Current Issue","siteHash":"49e2627ca4236f035605387a5e9b308f0f71198bce05f1a2f79007f5fd444361","entryHash":"9f7c1d3ff866f22b7a23090a498a0e8ded1a86fbeefb63f97128e10e4eadeee5","category":"Environment"}