{"title":"Pursuit of perfection: Matej Mohorič profile","link":"https://www.cyclist.co.uk/in-depth/matej-mohoric-cyclist","date":1688052933000,"content":"<p><a href=\"https://www.cyclist.co.uk\">Cyclist</a><br />\n<a href=\"https://www.cyclist.co.uk/in-depth/matej-mohoric-cyclist\">Pursuit of perfection: Matej Mohorič profile</a></p>\n\n<p>Matej Mohorič would be a superb pub quiz teammate for the maths and science rounds, but don’t rely on him for any pro cycling history.</p>\n\n\n\n<p>‘I don’t know anything. I got caught out a couple of times during my career,’ he says. ‘It’s not something I’m proud of, I just don’t have enough time. Or enough interest, because of the fact that I’m not super-emotional about the sport. I’m more rational about it. I see it as my profession.’</p>\n\n\n\n<p>Take descending. It is often regarded as an art form, somewhere on the spectrum between God-given ability, instinct and experience. As a teenager in the Slovenian backcountry, Mohorič did his best to turn it into a scientific experiment: he rode into corners at different speeds, making a note of which one made his wheels lose grip. Risky research that gave him a tear or two in his shorts, maybe, but also invaluable wisdom and confidence.</p>\n\n\n\n<p>‘I was always in search of the limit, also with mountain biking and jumping. I was never afraid of crashes, I always got up and did it again. It’s still like that now,’ he says.</p>\n\n\n<div>\r\n                <div>\r\n                   <div>\r\n                      <div>\r\n                         <h3><span>Related Posts</span></h3>\r\n                      </div>\r\n                      <div>\r\n                         <div>\r\n                            <div>\r\n                            <article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/paris-roubaix-merida-reacto\">Pro bike: Matej Mohoric’s remarkably normal Paris-Roubaix Merida Reacto</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/milan-san-remo-2022-photos\">Gallery: Milan-San Remo 2022 is a victory for dropper posts everywhere</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article><article>\r\n                    <div>\r\n                       <h3>\r\n                          <a href=\"https://www.cyclist.co.uk/in-depth/tour-de-france-route-live-tv-guide-startlist-stage-by-stage\">Men’s Tour de France 2023: Stage-by-stage preview and everything you need to know</a>\r\n                       </h3>\r\n                    </div>\r\n                 </article></div>\r\n                                    </div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <div>\r\n                                            <span></span><span></span><span></span>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                        <div>\r\n                                            <div>\r\n                                                <div></div>\r\n                                            </div>\r\n                                        </div>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                <div>\r\n                                    <div>\r\n                                    <div>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                        <span></span>\r\n                                    </div>\r\n                                    </div>\r\n                                </div>\r\n                                \r\n                            </div>\r\n                        </div>\r\n                        </div>\n\n\n<p>He is a rare road racer who can threaten in every scenario apart from Grand Tour general classification assaults. He has the attributes to challenge for almost any Classic and is a top-five finisher in races as diverse as Paris-Roubaix, Liège-Bastogne-Liège and Milan-San Remo, where he came out on top to win in 2022.</p>\n\n\n\n<p>Then there’s his lethal threat from breakaways. Mohorič was the king of the fugitives at the 2021 Tour de France, winning on Stage 7 to Le Creusot and Stage 19 to Libourne. On winning the first, he sobbed as he crossed the line. The second was charged with a different feeling: frustration. He had time to prepare his victory celebration after a 25km solo move, and chose to do a ‘zipping the lips’ motion, mirroring Lance Armstrong’s gesture to <em>omertà</em>-breaking domestique Filippo Simeoni in 2004. Would he change anything about it now?</p>\n\n\n\n<p>‘Yes, everything!’ Mohorič says and laughs. Back then, he says, he was not familiar with the parallels to cycling’s toxic Texan and the gesture was an ‘overreaction’, fuelled by anger in light of French police raids at the Bahrain Victorious team hotel in Pau. He was hurt by ‘so many people saying bad things about us without any proof’.</p>\n\n\n\n<p>‘And the way they still sometimes treat us, especially in France,’ he says. Who are ‘they’? ‘Journalists. And people. If you’re a professional cyclist, you’re automatically also a doper. The other day, I was in Monaco and even the concierge for our building said to me, “What do you professional cyclists all take to be able to ride the whole Tour de France?”</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-647x970.jpg\" alt=\"Matej Mohoric\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-2.jpg 1200w\" /><figcaption>David Powell / Cyclist</figcaption></figure></div>\n\n\n<p>‘I understand why people say that, especially the older ones. They know the history of the sport. But for us younger generation it also hurts because you know the sacrifices you’ve put in, you know that you are not taking any illegal drugs and you know that you never saw anybody taking any illegal drugs or anything sketchy. You’re really just fed up with it.’</p>\n\n\n\n<p>Bahrain Victorious were also raided by police on the eve of the 2022 Tour de France in Denmark, days after several staff and rider residences had been searched.</p>\n\n\n\n<p>‘It’s painful for us to accept, the fact that we were raided without proof of anything. And still there’s no proof,’ Mohorič says. ‘Nothing, not a single conclusion, not a single apology. So I was a little bit hurt, when you manage to reach a goal of yours and win a big bike race like that.’</p>\n\n\n\n<h2>Best in class</h2>\n\n\n\n<p>Those Tour de France stage wins were 15 years in the making. Mohorič grew up in a tiny village outside the Slovenian city of Kranj. On the family farm he milked cows, drove a tractor and hauled firewood around. At the age of 12 he joined the local cycling club and discovered that riding his bike boosted his energy levels and helped him to make new friends.</p>\n\n\n\n<p>‘I was definitely more introverted when I was a child because of the fact I was sometimes bullied at school. But as I got into cycling, I got more extroverted and that helped me to open up,’ he says.</p>\n\n\n\n<p>He would be teased for not skipping lessons like everyone else, and for being clever. To simply call Mohorič intelligent, though, is like describing candy floss as sugary. He has a curious, analytical mind and he can read race scenarios like a supercomputer. When he speaks, the Slovenian radiates a calm confidence that comes from knowing himself supremely well.</p>\n\n\n\n<p>Mohorič has an intelligence that makes him almost too smart for sport. Carried by hard work and his love of science and mathematics, the young Mohorič wanted to be an engineer and graduated high school with one of the highest marks in Slovenia. He could have gone to the University of Ljubljana, but with a junior rainbow jersey in his wardrobe, he opted to turn professional in 2014 with Cannondale.</p>\n\n\n\n<p>‘I maybe regretted my choice for the first two years. Or not regretted, but not necessarily embraced it,’ he says. ‘But then in the last six years I have to come to think I made the right call. I love what I do and I’m happy I took the decisions I did earlier in my life.’</p>\n\n\n\n<p>The opening seasons of his career were bursting with lessons but barren in terms of significant results. Mohorič attributes his gradual development to the different nutrition, intra-team support and science at the time. The advised low-carb diets and long training hours in the saddle did not suit him.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-647x970.jpg\" alt=\"Matej Mohoric\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-3.jpg 1200w\" /><figcaption>David Powell / Cyclist</figcaption></figure></div>\n\n\n<p>‘They cared much more about weight and less about the other factors that actually influenced performance,’ he says. Little wonder the possibility of going back to academia briefly lingered.</p>\n\n\n\n<p>‘I knew there were always many things I was working on improving and that was always my drive: to continue, be better and to fix stuff,’ Mohorič says. ‘Then as I fixed more things, I started to win more races and it was finished. Then you are infected.’</p>\n\n\n\n<p>The way he talks about self-improvement borders on seeing man as a machine, as a constant work in progress. He’s the kind of man who, while spending time at home, would devise a dishwasher efficiency system to maximise stacking space yet ensure optimal cleaning quality. Being with Mohorič can’t always be easy for his partner.</p>\n\n\n\n<p> ‘I think sometimes she wishes she was with another man who is not that much into detail and stressing about needing to be the best version of himself,’ he says, smiling. ‘I don’t allow myself to be lazy or to do something I could do right now later, or to do it with less commitment.</p>\n\n\n\n<p>‘I’m super-strict with myself and I expect a lot from others, the best of them. I hate to see someone not putting the effort in,’ he adds. ‘A stupid example: when I see someone at a checkout counter in the grocery store and they’re completely not paying attention, being slow and lazy, that’s hard for me to deal with. I understand they maybe have a problem in their life, I respect it and I would never say anything, but I could never be like this. I’m always in a rush, I always have 30 tasks and I always manage to do 31 having found a new one. It’s just the kind of person I am.</p>\n\n\n\n<p>‘I’m a perfectionist,’ he says. ‘I was always driven by the desire to do everything in the best possible manner. Therefore, not succeeding results-wise was never a problem for me as I was never comparing myself to the others. I was just comparing myself to myself, my best performances and achievements.</p>\n\n\n\n<p>‘Whenever I am struggling I don’t care about the outcome: I just want to be sure that I make the best possible decision at that certain moment in time, knowing what I know.’</p>\n\n\n\n<p>It can’t be easy for him to square his rationalism with the random, uncontrollable parts of life and sport: the asymptomatic Covid-19 positive that likely left him underpowered at last year’s Tour de France; the rider who crashed and took him down at this year’s Tour of Flanders while doing 70kmh. (Scarily, Mohorič had <em>déjà vu</em>: he says he dreamed months before that he would fall where he did, on the run-in to the Kanarieberg.)</p>\n\n\n\n<p>A crash earlier in the same race was caused by teammate Filip Maciejuk, who swerved off a footpath into the front of the bunch and was disqualified. Mohorič mentions that they didn’t disqualify ‘half of the peloton who did it two seconds before’.</p>\n\n\n\n<p>‘That’s frustrating – the inconsistency of applying rules. Or when organisers put a left-hand turn 50m before the line in a sprint stage, or a gap in the fences for a deviation 150m before the finish.</p>\n\n\n\n<p>‘I think the way they punished Filip is correct, but it needs to be applied more often,’ he adds. ‘Like in Formula 1, they constantly have penalties for dangerous behaviour or whatever. I think that should also be more of the case in professional cycling.’</p>\n\n\n\n<p>‘It’s a matter of preventing riders from taking too many risks, although there will always be an element of danger in a competitive sport.</p>\n\n\n\n<p>‘We are a bunch of idiots racing 75kmh down a hill with only our Lycra on.’</p>\n\n\n\n<h2>Drop it like it’s hot</h2>\n\n\n\n<p>Mohorič would know all about that: at the 2022 Milan-San Remo he was the winning idiot. His victory came from a nail-biting descent of the Poggio towards the end of the race, and much attention was given in the aftermath to the fact that Mohorič had used a dropper post to get a really low position while flying down the hillside.</p>\n\n\n\n<p>The idea to do so was the brainchild of Bahrain Victorious mechanic and passionate mountain biker Filip Tisma. He had actually suggested it the previous November and Mohorič’s initial doubts melted away when he tested it and observed the potential advantage.</p>\n\n\n\n<p>In many ways, Milan-San Remo is an engineer’s dream, a planning and problem-solving exercise over 300km with minimal unpredictability, given the immense likelihood that the action will play out on the race’s final hill. It’s a case of eating, drinking, saving energy, not crashing and, if you’re Mohorič, planting a seed of doubt in the minds of fellow contenders. ‘Don’t try and follow me down the Poggio,’ he warned compatriot Tadej Pogačar.</p>\n\n\n\n<p>Teammates sacrificed themselves to set him up at the front into the Cipressa and Poggio. When Pogačar fired four attacks on the decisive climb, Mohorič was close enough to the front to keep his speed in the corners, far enough back to hide from the wind in the slipstream of others. He took a clear line back to the leaders on the descent and attacked them straight away.</p>\n\n\n\n<p>Only then did his tech secret weapon come into play, as Mohorič carved down corkscrewing corners like a man without presents going round Oxford Street on Christmas Eve. Those old Slovenian cornering experiments came in handy. It was nerve-wracking to watch, but effective.</p>\n\n\n\n<p>‘Of course I took risks, especially on that last left-hand corner when I slipped, lost both wheels and almost crashed,’ he says. ‘That was not ideal. I could have done that corner better but I’m not sure about the other ones. They were very, very close to the physical limits of how fast you can take them. It was just the perfect day when everything comes together. That doesn’t happen many times and that’s why you never give up on chances.’</p>\n\n\n\n<p>Mohorič’s triumph bears the hallmarks of a great feat of engineering: technical proficiency, creativity, analytical thinking, attention to detail, smart communication, teamwork and adaptability. He still needed the engine to hold off the best in the final kilometres though.</p>\n\n\n\n<p>The next victory projects are already well underway. Another Tour de France stage success is on his wish-list and then there is August’s corner-strewn, spiky Road Race World Championships in Glasgow.</p>\n\n\n\n<p>‘The <em>parcours</em> there is probably one of the best shots I will have in my career,’ he says. ‘I think I would be the only rider ever to win the rainbow jersey in all three categories [junior, under-23 and elite], so that would be something special.’</p>\n\n\n\n<p>His rivals should beware another Matej Mohorič masterclass that is months in the making, one that if it doesn’t come off won’t be for lack of effort or thought. He might not be well-schooled in pro cycling legend, but the Slovenian is making history in his own innovative way.</p>\n\n\n<div>\n<figure><img width=\"647\" height=\"970\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-647x970.jpg\" alt=\"Matej Mohoric\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-647x970.jpg 647w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-200x300.jpg 200w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-768x1152.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-1024x1536.jpg 1024w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-750x1125.jpg 750w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4-1140x1710.jpg 1140w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/06/matej-mohoric-4.jpg 1200w\" /><figcaption>David Powell / Cyclist</figcaption></figure></div>\n\n\n<h2>Mind over Matej</h2>\n\n\n\n<p><em>Mohorič’s racing career to date</em></p>\n\n\n\n<p><strong>2012</strong>: Wins the Junior Road Race World Championships, attacking over the Cauberg in the Netherlands. Also tastes success in Italian race for juniors, Giro della Lunigiana.</p>\n\n\n\n<p><strong>2013</strong>: Hit by a car in training during spring, but wins the Under-23 Road Race World Championships on his first attempt. Turns pro with Cannondale at the end of the year, aged 19.</p>\n\n\n\n<p><strong>2016</strong>: With few results to his name, Mohorič joins Lampre-Merida, races the Olympics and finishes the season with his maiden pro victory, a stage of the Tour of Hainan. From a breakaway, naturally.</p>\n\n\n\n<p><strong>2017</strong>: Takes another breakaway victory at the Vuelta a España, using the descent of the final hill as his launchpad. Follows it up with victory at the Hong Kong Challenge.</p>\n\n\n\n<p><strong>2018</strong>: Joins Bahrain-Merida and is a rider transformed. Among seven victories, wins a long Giro d’Italia stage, the Binckbank Tour, the Slovenian national title and a stage and overall of the Deutschland Tour.</p>\n\n\n\n<p><strong>2019</strong>: Fifth in Milan-San Remo. Makes his debut at Paris-Roubaix and the Tour de France. Wins a Tour de Pologne stage. Suffers broken ribs and a collapsed lung in a Cro Race crash.</p>\n\n\n\n<p><strong>2020</strong>: Fourth in Liège-Bastogne-Liège – his best from a Covid-disrupted season.</p>\n\n\n\n<p><strong>2021</strong>: Crashes out of the Giro d’Italia. Makes up for it with two stage wins at the Tour de France in the jersey of Slovenian national champion. Second in the Clásica San Sebastián, the Tour de Pologne and Benelux Tour.</p>\n\n\n\n<p><strong>2022</strong>: Wins Milan-San Remo. Fourth at E3 and fifth at Paris-Roubaix, thwarted by a puncture, and an asymptomatic Covid-19 positive stifles his Tour. Ends the year pipping Jonas Vingegaard to the Cro Race title.</p>\n\n\n\n<p><strong>2023</strong>: So far… eighth in Milan-San Remo, sixth in Strade Bianche, third at Kuurne-Brussels-Kuurne.</p>\n\n\n<div>\n<figure><a href=\"https://www.cyclist.co.uk/subscriptions\"><img width=\"842\" height=\"297\" src=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg\" alt=\"Subscribe to Cyclist Magazine\" srcset=\"https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3.jpg 842w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-300x106.jpg 300w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-768x271.jpg 768w, https://dqh479dn9vg99.cloudfront.net/wp-content/uploads/sites/9/2023/04/clickable-subs-promo3-750x265.jpg 750w\" /></a><figcaption></figcaption></figure></div>\n\n\n<h2>Mohoric on…</h2>\n\n\n\n<h3>…potentially being the next Danny MacAskill</h3>\n\n\n\n<p>‘I had a trials bike and I could perform a lot of tricks with it. Then it got dangerous and I sold it. I always had mountain bikes and cyclocross bikes too, but just for fun, I never raced them.’</p>\n\n\n\n<h3>…why he so wants to win Paris-Roubaix</h3>\n\n\n\n<p>‘I think I got emotional about this race when Sonny Colbrelli won in 2021. I’m not a very emotional kind of person, especially not about racing, but Paris-Roubaix is different. It has a special charm attached to it. It’s the history of cycling. You always remember who won Roubaix – there were so many incredible stories written over the years. Deep inside yourself you do dream of winning it one day. It’s one of a few races that I actually care about.’</p>\n\n\n\n<h3>…his total recall </h3>\n\n\n\n<p>‘I have a good memory for details, not just wins, also the bad things. Especially in the Classics, I can remember all the micro-positioning things: where the bus stops are; where I did it wrong the past edition or two years ago; where I took the gutter to pass the peloton and when it suddenly stops; which side of the road is better.’</p>\n\n\n\n<p><strong>• This article originally appeared in issue 140 of Cyclist magazine. <a href=\"https://www.cyclist.co.uk/subscriptions\" target=\"_blank\">Click here to subscribe</a></strong></p>\n<p>The post <a href=\"https://www.cyclist.co.uk/in-depth/matej-mohoric-cyclist\">Pursuit of perfection: Matej Mohorič profile</a> appeared first on <a href=\"https://www.cyclist.co.uk\">Cyclist</a>.</p>","author":"mdonlevy","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"9f9c16703b593d90d1366baa55ea86081cdad80fd9d36ce3fff2df39cc15d296","category":"Cycling"}