{"title":"Impacts of counting protocols for light microscopy on estimates of biodiversity and algal density of phytoplankton","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lom3.10651?af=R","date":1728618284000,"content":"<h2>Abstract</h2>\n<p>Knowledge on the biodiversity and abundance of phytoplankton is key for many ecological and societal (e.g., blue growth) questions. Gathering temporal variation and spatial patterns on key indicators requires reliable and standardized protocols on sampling, species identification and counting. Numerous methods are used but consequences for comparing the biodiversity and abundance of phytoplankton of these different techniques are not well known. We evaluated the consequences of different counting protocols using light microscopy (i.e., subsampling transects or wedges within counting chambers) for these indices using samples collected weekly to bi-weekly (<i>n</i> = 398, 2009–2018) from the Wadden Sea (southern North Sea). Phytoplankton cells were counted (by one person under similar conditions) in a fixed number of viewing fields (58, 70, and 29) at three respective magnifications (10 × 100, 10 × 40, and 10 × 10). Patterns in the spatial distribution of phytoplankton cells varied among species and clustering of cells occurred in more than one-fifth of the samples. This will induce error in the conversion from counts (per viewing field) to abundance (cells mL<sup>−1</sup>). Our present effort resulted in a high accuracy (95%) in overall cell abundances. This was not the case for species richness, for example, capturing 90% of all species present in the sample would require an almost threefold increase in effort for the 10 × 40 and 10 × 10 magnifications. We recommend that counting methods be tailored to the main research objectives and that counting protocols should quantify uncertainty as well as potential bias to provide an estimation of the error in phytoplankton abundance and species composition.</p>","author":"Pascalle Jacobs, \nLéon Serre‐Fredj, \nReinoud P. T. Koeman, \nAnneke van den Oever, \nMyron A. Peck, \nCatharina J. M. Philippart","siteTitle":"Wiley: Limnology and Oceanography: Methods: Table of Contents","siteHash":"1f94d009c9004887a6eb995bba0123a0db9011ce2034714a79b9376dbd1edfea","entryHash":"9fa32182ede49172585ef0c79daf3f1a70d45f453dddc41ea343904fcc14b19a","category":"Environment"}