{"title":"Improved Gaussian Filter Deep Learning Based General Adversarial Network Artificial Humming Bird Optimization Classifier for Hand Written Personality Prediction","link":"https://www.preprints.org/manuscript/202408.1684/v1","date":1724488351000,"content":"Deep learning-based handwriting personality prediction uses neural networks (CNNs) to consider and predict personality characters from handwritten text to improve applications such as adaptive technology and automated data access. This method requires high computational resources and widely classified data, and its accuracy may suffer from signature variation and overfitting. This study introduces a novel optimizeddeep learning for Hand Written Personality Prediction. First the input data is collected from givendataset and an enhanced Gaussian filter is used in pre-processing to improve image quality by reducing noise and increasing contrast.After pre-processing, features are extracted by PCA-based normalized GIST, which standardizes the features to improve image representation.These extracted features are generated using an adaptive horse herd optimization algorithm to select the most important features. Based on selected features Improved Generative Adversarial Networks with artificial hummingbird optimization (IGAN_AHb) enables fast and efficient convergence of GANs. This reduce the mode collapse and ensures training with consistently fine-tuned parameters.The selected features are considered by characters such as openness, conscientiousness, extroversion, agreeableness and neuroticism, and finally classified using the IGAN_AHb classifier. In the result section, the proposed model is compared with various models with the matrix precision, recall, F1-score. The proposed model attained the value of 97.3% of precision and a recall rate of 96%, respectively. By comparing with other models, the proposed model attained highest values.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9fa93788d64b3de4b877f8a1d4c5102178c4e503c9b4b97713dfb016e6c7ea07","category":"Interdisciplinary"}