{"title":"Users&rsquo; Psycho-Social and Socio-Economic Characteristics in an Inclusive Health Resort Design, Port-Harcourt, Nigeria","link":"https://www.preprints.org/manuscript/202403.1531/v1","date":1711436690000,"content":"Health comprises physical, mental and social dimensions whose interactions influence users’ experiences. Health experiences are within the context of environments. These contexts are definitive contributors to experiences – primarily because of the link to social dimensions as human beings - psychological and economic. Therefore, the study aims to investigate health resort users’ psycho-social and socio-economic characteristics to improve their access to quality healthcare. The objectives are identifying the socio-economic characteristics of an inclusive health resort, analysing the psycho-social characteristics of the inclusive health resort user, and analysing the effects of users’ psycho-social and socio-economic characteristics on their access to healthcare. The study employs the mixed research method (qualitative and quantitative). The researchers engaged in a pragmatic research philosophy that underscores positivist and interpretivist paradigms. The data collection instruments include survey questionnaires, an interview guide with a digital recorder, a direct participant observation schedule, field notes and photographs. The data analysis process involves the clustering and categorisation of data and examining concepts and themes. The research findings show a correlation between the users’ socio-economic status and access to quality healthcare in an inclusive health resort. The result further reveals that psycho-social and socio-economic characteristics of health resort users are quality healthcare access predictors. Therefore, the users’ social, psychological, and economic status should play a vital role in the design of an inclusive health resort by all stakeholders.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9faabe603a7cc22e047f01bc59a7c6b0109ca7eefaeae20542ca54d72ab816d1","category":"Interdisciplinary"}