{"title":"Apple Expands Self Service Repair in Europe, Now Covers iPhone 15 and M2 Macs","link":"https://www.macrumors.com/2023/12/13/apple-expands-self-service-repair-iphone-15/","date":1702469824000,"content":"Apple today <a href=\"https://www.apple.com/newsroom/2023/12/apple-expands-self-service-repair-and-introduces-new-diagnostics-process/\">announced</a> it has expanded its Self Service Repair program to cover the iPhone 15 lineup and Mac models powered by M2 chips, including the 14- and 16-inch MacBook Pro, the 15-inch MacBook Air, Mac mini, Mac Pro, and Mac Studio. \r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/05/Apple-Self-Service-Repair-Program-iPhone.jpeg\" width=\"1600\" height=\"900\" />\r<br />\nApple also said that Self Service Repair is now available for Apple users in 24 additional European countries, including Croatia, Denmark, Greece, Netherlands, Portugal, and Switzerland. With this latest expansion, Self Service Repair now supports 35 Apple products in 33 countries and 24 languages.\r<br />\n\r<br />\nAdditionally, Apple Diagnostics for Self Service Repair is available today in the U.S. for <a href=\"https://support.apple.com/en-us/101965\">iPhones</a> and <a href=\"https://support.apple.com/en-us/102488\">Macs</a>, with availability in Europe to come next year. Intended for users with the knowledge and expertise to repair Apple devices, Apple Diagnostics troubleshooting sessions gives customers the same ability as Apple Authorized Service Providers and Independent Repair Providers to test devices for optimal part functionality and performance, as well as identify which parts may need repair.\r<br />\n\r<br />\nLaunched in 2022, Apple's Self Service Repair program is designed to allow Apple device owners to do their own repairs in their homes using Apple parts, repair manuals, and tools.\r<br />\n\r<br />\nTo conduct a repair, customers first need to review the repair manual for their product and the specific repair on Apple's support website. After, they'll be able to order the required parts and tools from the Self Service Repair Store and begin the repair. \r<br />\n\r<br />\nThe program is part of Apple's efforts to \"further expand access to repairs,\" according to the company. That said, Apple cautions that the \"vast majority\" of customers should still visit a professional repair provider, such as an Apple Store, to ensure their devices are repaired safely and reliably. <div>Tag: <a href=\"https://www.macrumors.com/guide/self-service-repair/\">Self Service Repair</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/13/apple-expands-self-service-repair-iphone-15/\">Apple Expands Self Service Repair in Europe, Now Covers iPhone 15 and M2 Macs</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-expands-self-service-repair-in-europe-now-covers-iphone-15-and-m2-macs.2413590/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"9fab36a05cf2d15d448899499ae6c649f6579ee48cdb5e5ddb8de33e5d37590b","category":"Apple"}