{"title":"A scalable and transferable approach to combining emerging conservation technologies to identify biodiversity change after large disturbances","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2664.14579?af=R","date":1712118390000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/524c08f3-6ed8-415a-807d-98714381f921/jpe14579-toc-0001-m.png\" alt=\"A scalable and transferable approach to combining emerging conservation technologies to identify biodiversity change after large disturbances\" />\n<p>We have shown that three emerging conservation technologies, passive acoustic monitoring, machine learning animal sound identification algorithms, and advances in Bayesian statistical tools, can provide previously unattainable information about biodiversity responses to ecological change. Critically, our approach is transferrable and scalable, as the workflow is agnostic to species or ecosystem and each component is either freely available (all relevant software) or relatively inexpensive (recording hardware). Environmental change is unfolding rapidly, but new analytical techniques may help our understanding and—thus interventions—keep pace.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nEcological disturbances are becoming more extensive and intensive globally, a trend exemplified by ‘megafires’ and industrial deforestation, which cause widespread losses of forest cover. Yet the hypothesis that contemporary environmental disturbances are affecting biodiversity has been difficult to test directly.\n\nThe novel combination of landscape-scale passive acoustic monitoring, a new machine learning algorithm, BirdNET and improved Bayesian model-fitting engines enables cohesive, community-level before-after, control-impact studies of disturbances. We conducted such a study of a 2020 megafire in the Sierra Nevada, USA. We used a bespoke dynamic multi-species occupancy modelling approach, which enabled us to account for imperfect detection, misclassifications, and to share information among species.\n\nThere was no community-level difference in colonization between burned and unburned forest. In contrast, the probability of site extinction in burned forest, 0.36, was significantly higher than in unburned forest, 0.12. Of the 67 species in our study, 6 (9%) displayed a positive colonization response to the fire, while 28 (41%) displayed a significant extinction response.\n\nWe observed a 12% decrease in avian biodiversity 1 year post-fire, and a substantial shift in community composition. However, in this ecosystem, many species display time-dependent responses to the fire that are unobservable after just 1 year.\n\n<i>Synthesis and applications</i>. We have shown that three emerging conservation technologies, passive acoustic monitoring, machine learning animal sound identification algorithms, and advances in Bayesian statistical tools, can provide previously unattainable information about biodiversity responses to ecological change. Critically, our approach is transferrable and scalable, as the workflow is agnostic to species or ecosystem and each component is either freely available (all relevant software) or relatively inexpensive (recording hardware). Environmental change is unfolding rapidly, but new analytical techniques may help our understanding and—thus interventions—keep pace.\n</p>","author":"Connor M. Wood, \nJacob Socolar, \nStefan Kahl, \nM. Zachariah Peery, \nPhilip Chaon, \nKevin Kelly, \nRobert A. Koch, \nSarah C. Sawyer, \nHolger Klinck","siteTitle":"Wiley: Journal of Applied Ecology: Table of Contents","siteHash":"ea12fccecb0d31a49741c726eda58c700903553dacb4deca14c5e50acabee724","entryHash":"9fb46f735b818940303d46a57ac54e13ca1a7d1135f30e9f8d64ce3e31882586","category":"Environment"}