{"title":"The Best of Two Worlds: Using Stacked Generalisation for Integrating Expert Range Maps in Species Distribution Models","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13911?af=R","date":1726032625000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Species distribution models (SDMs) are powerful tools for assessing suitable habitats across large areas and at fine spatial resolution. Yet, the usefulness of SDMs for mapping species' realised distributions is often limited since data biases or missing information on dispersal barriers or biotic interactions hinder them from accurately delineating species' range limits. One way to overcome this limitation is to integrate SDMs with expert range maps, which provide coarse-scale information on the extent of species' ranges and thereby range limits that are complementary to information offered by SDMs.</p>\n<h2>Innovation</h2>\n<p>Here, we propose a new approach for integrating expert range maps in SDMs based on an ensemble method called stacked generalisation. Specifically, our approach relies on training a meta-learner regression model using predictions from one or more SDM algorithms alongside the distance of training points to expert-defined ranges as predictor variables. We demonstrate our approach with an occurrence dataset for 49 bat species covering four biodiversity hotspots in the Eastern Mediterranean, Western Asia and Central Asia.</p>\n<h2>Main Conclusions</h2>\n<p>Our approach offers a flexible method to integrate expert range maps with any combination of SDM modelling algorithms, thus facilitating the use of algorithm ensembles. In addition, it provides a novel, data-driven way to account for uncertainty in expert-defined ranges not requiring prior knowledge about their accuracy, which is often lacking. Integrating expert range maps into SDMs for bats resulted in more realistic predictions of distribution patterns that showed narrower niche breadths and smaller range overlaps between species compared to traditional SDMs. Our approach holds promise to improve assessments of species distributions, while our work highlights the overlooked potential of stacked generalisation as an ensemble method in species distribution modelling.</p>","author":"Julian Oeser, \nDamaris Zurell, \nFrieder Mayer, \nEmrah Çoraman, \nNia Toshkova, \nStanimira Deleva, \nIoseb Natradze, \nPetr Benda, \nAstghik Ghazaryan, \nSercan Irmak, \nNijat Hasanov, \nGulnar Guliyeva, \nMariya Gritsina, \nTobias Kuemmerle","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"9fb5f7978a060a55ef1d3b1cc485f5082c7384990f70cb0d0334ede76099372c","category":"Environment"}