{"title":"TikTok เตรียมเพิ่มป้ายกำกับระบุวิดีโอที่สร้างหรือแก้ไขด้วย AI","link":"https://www.blognone.com/node/135833","date":1695184854000,"content":"<div><div><div><p>TikTok เปิดตัวเครื่องมือช่วยระบุเนื้อหาที่เป็น AI เนื่องจากปัจจุบันมีการใช้ AI ในการผลิตคอนเทนต์มากขึ้นและคนดูอาจสับสนได้ ซึ่งเครื่องมือนี้จะช่วยระบุเนื้อหาที่ใช้ AI ในการสร้างรูปภาพเสมือนจริง, สติ๊กเกอร์เสียง, วิดีโอที่เป็น Deepfakes เพื่อป้องกันการกระจายข้อมูลที่ผิดพลาด</p>\n<p>ครีเอเตอร์ต้องติดป้ายระบุทั้งเนื้อหาที่สร้างทั้งหมดหรือการแก้ไขบางส่วนด้วย AI โดยป้ายนี้จะถูกติดไว้ใต้ชื่อผู้ใช้บนวิดีโอ ซึ่งทางบริษัทบอกว่าจะไม่มีการลงโทษครีเอเตอร์ที่ไม่ติดป้ายระบุเนื้อหา AI เนื่องจากไม่ได้อยู่ภายใต้นโยบาย Synthetic media</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6ee2baf8f9a1f0c83bb065853b31de70.png\" /></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/dfd1ff4d04b90530cfb1bae351f039c1.jpg\" /></p>\n<p>TikTok บอกเพิ่มเติมว่ากำลังพัฒนาวิธีการตรวจจับเนื้อหา AI และระบุป้ายแบบอัตโนมัติ ซึ่งภายในสัปดาห์นี้จะเริ่มทดสอบป้ายกำกับ “AI-generated” แต่บริษัทไม่ได้เปิดเผยรายละเอียดเกี่ยวกับเทคโนโลยีที่ใช้ในการระบุ AI</p>\n<p>นอกจากนี้ TikTok จะเพิ่มคำว่า AI ในชื่อเอฟเฟกต์ทั้งหมดที่ใช้ AI เนื่องจากมีประเด็นเรื่องฟิลเตอร์ Bold Glamor ฟิลเตอร์แต่งหน้าเสริมจนเป็นกระแสไวรัลก่อนหน้านี้ มีผู้ใช้งานบางคนสงสัยว่าฟิลเตอร์นี้ไม่ได้ใช้ AR แต่เป็น AI ซึ่งตอนนั้น TikTok ไม่ได้ออกมาชี้แจ้งว่าฟิลเตอร์นั้นใช้ AI หรือไม่</p>\n<p>ที่มา: <a href=\"https://techcrunch.com/2023/09/19/tiktok-debuts-new-tools-and-technology-to-label-ai-content/\">Techcrunch</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/tiktok\">TikTok</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"Chomsu","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"9fb80b1fff8511609ac5b77a3524e0d155381633dca10aff483cad0234bac65e","category":"Thai"}