{"title":"Human Centered Sensor Technologies for Soft Robotic Gripper: A Comprehensive Review","link":"https://www.preprints.org/manuscript/202408.1704/v1","date":1724719477000,"content":"The importance of bio robotics has been increasing day by day. Researchers are trying to mimic nature in a more creative way so that, the system can easily adopt the complex nature and its environment. Hence, bio robotic gripper plays a role in physical connection between the environment and bio robotics system. While handling the physical world in biorobots gripper, the complexity occurs in feedback system where sensor plays a vital role. Therefore, human centered gripper sensor has a good impact on bio robotics field. But categorical classification and their selection process is not very systematic. This review paper follows PRISMA methodology to summarize the previous works on bio robotics gripper sensor and its selection process.. This paper discusses challenges in soft robotics systems, and the importance of sensing systems to facilitate critical control mechanisms along with their selection considerations. Furthermore, a classification of soft actuation based on gripper has been introduced. Moreover, some unique characteristics for soft robotics sensor are explored namely compliance, flexibility, multifunctionality, sensor nature, surface properties, and material requirements. In addition, a categorization of sensors for soft robotic gripper in terms of modalities has been established ranging from the tactile and force sensor to slippage sensor. Various tactile sensors ranging from piezoelectric sensing to optical sensing are explored as it has utmost importance in soft gripper to effectively address the increasing requirements for intelligence and automation. Finally, taking everything into consideration, a flow diagram has been suggested for selecting sensors specific to soft robotics applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9fc8514ec6b201d2da741b432540769c8aa0336f6a0df89ae49b9fb61c56e4fa","category":"Interdisciplinary"}