{"title":"Study on the multifunctional spatial-temporal evolution and coupling coordination of cultivated land: A case study of Hebei Province, China","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306110","date":1719842400000,"content":"<p>by Shijie Liu, Yapeng Zhou, Yuepu Qi, Yaheng Chen, Wei Liu, Hao Xu, Shutao Wang</p>\r\n\r\nThe rational use of cultivated land can guarantee food security and thus is highly important for ensuring social stability, economic development and national security. The current study investigated the multifunctional temporal and spatial variation characteristics of cultivated land and explored the spatial and temporal characteristics of the multifunction and coupling coordination degrees of cultivated land throughout Hebei Province. Based on the administrative division data, statistical yearbook data and land use status data of the impacted areas, a multifunctional evaluation index system of cultivated land was established. The CRITIC weight method and entropy weight method were used to determine the weight of the index, the comprehensive index model was used to determine the production, social security, ecology and landscape functions of cultivated land of Hebei Province in different periods, the coupling coordination model was used to explore the multifunctional coupling coordination degree of cultivated land in each county, and spatial autocorrelation analysis was performed to determine the correlation of the multifunctional coupling coordination degrees. From 2000 to 2020, the production, social security and landscape function of cultivated land in Hebei Province trended upward; the ecological function trended slightly downward. The multifunctional coupling coordination degree of cultivated land in Hebei Province trended significantly upward and changed from limited coordination to intermediate coordination. Furthermore, it exhibited strong agglomeration and a significant positive spatial correlation, forming a ’V’-type change rule of first decreasing and then increasing. Hebei Province exhibited remarkable spatial and temporal characteristics of the multifunction and coupling coordination degrees of cultivated land. Regions could thus customize different cultivated land functions to maximize the benefits of cultivated land use. The findings of this study may provide a scientific basis and theoretical support for sustainably using and managing cultivated land resources in areas with similar human geographical environments.","author":"Shijie Liu","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"9fd15c45427958bf70473a34521592064f0f221c9f6ded37127628a0b33b688a","category":"Interdisciplinary"}