{"title":"Facebook Is Trying to Avoid App Store Fees With Custom ‘Subscription Links’ for Creators","link":"https://www.theverge.com/2021/11/3/22761620/facebook-apple-app-store-fees-subscription-links-creators","date":1635986317000,"content":"\n<p>Alex Heath, reporting for The Verge:</p>\n\n<blockquote>\n  <p>On Wednesday, Mark Zuckerberg, the CEO of Facebook parent company\nMeta, announced that creators will <a href=\"https://www.facebook.com/creators/earn-money-with-subscriptions\">soon be able to share custom\nweb links</a> directing their fans to pay them for subscriptions\nusing Facebook’s native payments system. If a fan signs up through\nthe link rather than Apple’s in-app subscription, the creator will\nkeep all of the money minus taxes. Facebook subscription feature,\nwhich lets creators charge on a reoccurring basis for access to\nexclusive content, is available in 27 countries and accessible to\ncreators who meet certain eligibility requirements.</p>\n\n<p>Facebook is operating in a gray zone under Apple’s rules for the\nApp Store, though a spokesperson said the social network believes\nits approach has always been allowed on iOS. The App Store\ncurrently forbids iOS apps from offering alternative payment\noptions for purchasing digital goods, but in this case, it’s the\ncreator, not Facebook, the app developer, that will be sending\npeople to pay for a subscription on the web. The spokesperson for\nFacebook confirmed the social network isn’t removing the ability\nfor users to sign up for a creator subscription using Apple’s\nnative payments system.</p>\n</blockquote>\n\n<p>Think: Substack or Patreon, but through Facebook.</p>\n\n<p>Is this payment scheme going to fly with Apple? A year ago, I think Apple would have nipped the idea in the bud. It’s been a long year, though. Optically, Apple is pinned down here. Facebook is making a legit case that it’s scrappy independent creators who’d be paying these fees to Apple, not mega-profitable Facebook. And in spirit, this is a workaround Apple should have (<a href=\"https://daringfireball.net/2021/06/app_store_the_schiller_cut\">and could have</a>) allowed years ago: that in-app means “in the actual app”, and if you want to steer users <em>out</em> of the app to the web, fine. If in-app purchasing is so good as to justify Apple’s fees, let it compete with out-of-app purchasing flows on the web.</p>\n\n<p>Facebook isn’t a “reader app”, but to me, allowing this would be aligned with the spirit of <a href=\"https://daringfireball.net/linked/2021/09/01/apple-anti-steering-relaxation\">Apple’s settlement two months ago with the Japan Fair Trade Commission</a>. It <em>is</em> about content creation and consumption.</p>\n\n<p>As ever, stock up on the popcorn.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/03/facebook-subscription-links\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"9fddea12e9681cf7312985658ad82694b8ec51aafb182a577e6bc0f011da7d1d","category":"Tech"}