{"title":"The use of PD-1 functional knockout rats to study idiosyncratic adverse reactions to nevirapine","link":"https://academic.oup.com/toxsci/article/200/2/382/7674865?rss=1","date":1715731200000,"content":"<span><div>Abstract</div>Idiosyncratic drug reactions (IDRs) are associated with significant patient morbidity/mortality and lead to considerable drug candidate attrition in drug development. Their idiosyncratic nature makes the study of IDRs difficult. In particular, nevirapine is associated with a relatively high risk of serious skin rash and liver injury. We previously found that nevirapine causes a similar skin rash in female Brown Norway rats, but these animals do not develop significant liver injury. Programmed cell death protein-1 (PD-1) is an immune checkpoint involved in immune tolerance, and anti-PD-1 antibodies have been used to treat cancer. However, they increase the risk of liver injury caused by co-administered drugs. We found that PD-1<sup>−/−</sup> mice are more susceptible to drug-induced liver injury, but PD-1<sup>−/−</sup> mice are not a good model for all drugs. In particular, they do not develop a skin rash when treated with nevirapine, at least in part because they lack the sulfotransferase in their skin that forms the reactive metabolite responsible for the rash. Therefore, we developed a PD-1 mutant (PD-1<sup>m/m</sup>) rat, with an excision in the ligand-binding domain of PD-1, to test whether nevirapine would cause a more serious skin rash in these animals. The PD-1<sup>m/m</sup> rat was based on a Sprague Dawley background, which has a lower incidence of skin rash than Brown Norway rats. The treated PD-1<sup>m/m</sup> rats developed more severe liver injury than PD-1<sup>−/−</sup> mice, but in contrast to expectations, they did not develop a skin rash. Functional knockouts provide a unique tool to study the mechanisms of IDRs.</span>","author":"","siteTitle":"Toxicological Sciences Current Issue","siteHash":"9a1c78de8c6d4dbe6bf7afd8036a773f2a2df7314f7a3b562b04af837f4a2cf1","entryHash":"9fdfef9db59540111c0ed9909b233a0d52b67ec0df35a069cab12881a1397c0a","category":"Environment"}