{"title":"498 Feeding hydroxychloride or organic sources of zinc, copper, and manganese to broiler breeders on growth performance of offsprings when fed hydroxychloride or inorganic sources of the same minerals","link":"https://academic.oup.com/jas/article/102/Supplement_3/158/7757309?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The study investigated the effect of feeding different sources of trace minerals (TM) such as zinc (Zn), copper (Cu), and manganese (Mn) in broiler breeders (BB) and their offspring on the growth performance of offspring. Ross 708 BB were housed in 24 pens (17 ♀ and 2 ♂) and allocated to two diets (12 replicate pen/diet): 1) HO, a blend of 80% hydroxychloride (HC) and 20% organic (OR) sources, and 2) OR, 100% OR sources (Table 1-4). Hatching eggs were collected from BB pens at 46, 54 and 62 wk of age, and incubated. Upon hatching, chicks were sexed, weighed, and placed in 24 sex-segregated pens (40 birds/pen), maintaining BB diet identification. One-half of chicks from BB fed HO or OR were fed HC and the other one-half were fed inorganic (InO) sources of Zn, Cu and Mn, effectively creating 4 treatments for offspring phase (n = 6; 3 pens per sex). Body weight (BW), average daily feed intake (ADFI), average daily gain (ADG), and feed conversion ratio (FCR) were calculated. Results showed that parental diets did not significantly affect chicken BW, ADFI, ADG, or FCR. However, parental age had significant effects (Tables 5-8). Offspring from 46-wk BB had greater BW on d 10, 21, and 42, increased ADFI on all diets, greater ADG on starter and grower diets, and improved FCR on starter and grower diets. Chicks fed HC diets displayed greater BW, ADFI, and ADG in certain phases. Overall, the study highlights the importance of TM sources and parental age in influencing broiler performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9fe37f4eb2cb1c6df33f90ae80f3131a4c09babb5f55ad5c62083ce7e047b687","category":"Environment"}