{"title":"509 Growth and health of Holstein and Holstein x Angus calves from birth to the end of the grower phase","link":"https://academic.oup.com/jas/article/102/Supplement_3/152/7757121?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Feedlot growth performance and carcass traits often differ between Holstein and dairy-beef crossbred calves. However, little is known about their performance and health during the growing phase when reared under similar conditions. This study aimed to compare purebred Holstein (n = 20) and Holstein x Angus crossbred (n = 20) steers from birth until the end of the grower phase. Male calves sourced from one commercial farm arrived at a calf rearing facility at 4.7 ± 1.94 d of age. Calves were fed milk replacer (24 % CP, 20% fat) twice daily at 12 % of birth body weight (BW) for the first 2 wk after arrival and 15 % BW thereafter until wk 6. Calves were gradually weaned from wk 7 to 9. Calves were offered starter (21 % CP, 28% starch) ad libitum until wk 12, and were fed a grower diet (15 % CP, 56 % starch) until wk 32. Milk intake was recorded daily and starter intake on a weekly basis. Once on the growing diet, feed intake was recorded daily using automated feed bins (Roughage Intake Control system, Hokofarm Group). Until wk 12, fecal and respiratory scores were recorded twice daily to estimate the incidence of disease, BW was measured weekly and frame measurements (hip and wither heights, and heart and chest girth) were recorded on wk 4, 7 and 12. From wk 12 to 32, BW and frame measurements were recorded monthly. Data were analyzed using PROC GLIMMIX (SAS 9.4), with breed as fixed, and calf and time as random effects. There were no differences between breeds in initial BW (<span>P</span> = 0.69), proportion of days with diarrhea (<span>P</span> = 0.21) or respiratory disease (<span>P</span> = 0.11), intake of milk (<span>P</span> = 0.45), starter (<span>P</span> = 0.83) or grower diet (<span>P</span> = 0.28). Crossbred calves tended to have greater average daily gain during the rearing phase (<span>P</span> = 0.07) and were growing 250 g/d faster than Holstein calves throughout the growing phase (<span>P</span> &lt; 0.01). Thus, at the end of the growing phase, crossbred calves were 33.5 kg heavier than Holstein calves and had a better feed conversion rate (<span>P</span> &lt; 0.01). During the growing phase, crossbred calves had larger heart and chest girths (<span>P</span> &lt; 0.01) than Holstein calves, whereas hip and wither heights were higher (<span>P</span> &lt; 0.01) for Holstein calves throughout the study. Overall, crossbred calves had greater average daily gain and improved feed conversion rate than Holstein calves during the growing phase, but it remains unknown if these differences will affect their feedlot performance.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"9fe823afb4f5ba8be630847c044af1589659af09b0911db46f939853c01a2e5a","category":"Environment"}