{"title":"HashiCorp 2023 year in review: Community","link":"https://www.hashicorp.com/blog/hashicorp-2023-year-in-review-community","date":1703178000000,"content":"<p><em>Be sure to also read our <a href=\"https://www.hashicorp.com/blog/hashicorp-2023-year-in-review-customers-and-partners\">2023 customers and partners</a> and <a href=\"https://www.hashicorp.com/blog/hashicorp-2023-year-in-review-product-innovation\">2023 product innovation</a> year in review blogs.</em></p>\n\n<p>2023 marked a return to many of the rhythms of connection with the HashiCorp community, including in-person events around the world as well as a full slate of virtual talks and presentations. In addition, we set new records for community downloads and expanded our partner ecosystem. And 2023 also saw the HashiCorp certifications program accelerate into new territory.</p>\n\n<h2>A year of community and events</h2>\n\n<p>There were many event highlights for the HashiCorp community in 2023, and here are a few we think are especially important.</p>\n\n<p>First, we’re excited about having more than 27,000 combined attendees and visitors at our <a href=\"https://www.hashicorp.com/blog/infrastructure-security-lifecycle-releases-open-hashiconf-2023\">HashiConf</a> event in San Francisco in October and the <a href=\"https://www.hashicorp.com/blog/hashicorp-at-aws-re-invent-your-blueprint-for-cloud-success\">HashiCorp booth at AWS re:Invent</a> in Las Vegas at the end of November. Back in June, we hosted <a href=\"https://hashidays.com/\">HashiDays</a> events online and in London, Paris, and Munich.</p>\n\n<p>We also are proud to count more than 180 HashiCorp User Groups (<a href=\"https://www.meetup.com/pro/hugs/\">HUG</a>s) in 63 countries, comprising nearly 51,000 members (<a href=\"https://www.meetup.com/pro/hugs/\">find one near you</a> or reach out to us about starting your own HUG). We love the chance to connect with the community in person. We also produced a digital conference series, HashiTalks, spanning the globe and reaching people in 10 different languages.</p>\n\n<p>We had the opportunity to engage with our 111 <a href=\"https://www.hashicorp.com/ambassadors\">HashiCorp Ambassadors</a> in person and online throughout the year to share sneak previews of our roadmap and plans while gathering feedback on how to make our products better for everyone. We celebrated contributions from more than 100 Core Contributors.</p>\n\n<h2>A year of learning and achievement</h2>\n\n<p>Of course, community is more than just get-togethers, it’s also about learning and sharing information. We now have four HashiCorp Cloud Engineer Certifications available, including <a href=\"https://www.hashicorp.com/certification/terraform-associate\">Terraform Associate 003</a>, <a href=\"https://www.hashicorp.com/certification/vault-associate\">Vault Associate 002</a>, <a href=\"https://www.hashicorp.com/certification/vault-operations-professional\">Vault Operations Professional</a>, and <a href=\"https://www.hashicorp.com/certification/consul-associate\">Consul Associate 002</a>. <a href=\"https://www.hashicorp.com/certification/consul-associate-next\">Consul Associate 003</a> will be available in 2024. </p>\n\n<p>In 2023, more than 24,000 certification exams were taken by community members in 108 countries. At HashiConf alone, 178 people took a certification exam and we got some great feedback on an early version of the Terraform Professional exam.</p>\n\n<p>To break it down a bit, Terraform Associate was the most awarded certification, driven in part by the launch of the new <a href=\"https://www.hashicorp.com/certification/terraform-associate\">Terraform Associate 003 certification</a> for cloud engineers specializing in operations, IT, or development. Of the folks who achieved the Vault Professional certification, 84% were upskilling from the Vault Associate certification they had previously earned. To date, we’ve awarded more than 51,000 total certifications. </p>\n\n<p>We’re plenty proud of all the folks who earned certifications this year, and so are they! On average, people who have earned a HashiCorp certification have shared their badges with up to three other people and encouraged/challenged their friends to get certified as well. </p>\n\n<p>We also want to give a shout out to all the folks who helped develop and QA our certification exams with their expertise, including the 109 beta and alpha testers, the 56 subject matter experts who worked on the associate certification exams, and the 39 who contributed to the professional exams.  </p>\n\n<h2>A year of software downloads</h2>\n\n<p>It’s also important to note the acceleration in community creation and use of HashiCorp software and integrations. There were some 487 million community downloads this year, and HashiCorp community software was downloaded or used in 85.8% of the Fortune 500.</p>\n\n<p>Equally impressive, as of October 2023, the Terraform Registry holds more than 3,500 providers and 15,000 modules. The partner ecosystem now holds more than 3,000+ providers and integrations.</p>\n\n<h2>A fond goodbye to Mitchell</h2>\n\n<p>Finally, we can’t talk about the year in the HashiCorp community without acknowledging the <a href=\"https://www.hashicorp.com/blog/mitchell-reflects-as-he-departs-hashicorp\">bittersweet departure of HashiCorp Co-Founder Mitchell Hashimoto</a>. No one has had more influence on the HashiCorp community than Mitchell, and we are all eternally grateful for his many essential contributions. We’re definitely going to miss him, but we’re also excited to learn about what’s next for him — and for the entire HashiCorp community. </p>\n\n<h2>On to 2024</h2>\n\n<p>2023 has seen even more engagement and growth from the HashiCorp community than in years past, and we hope to accelerate that even more in the years to come. As in previous years, we build our tools with your needs in mind and remain deeply thankful for the opportunity to help all of you in your learning journey around HashiCorp’s infrastructure and security solutions. </p>\n\n<p>Please stay tuned and engage with us as we work to make our tools even better for you to use to solve your most important technical and business challenges. Thank you for your continued trust in allowing us to help solve your cloud infrastructure needs and the feedback you share to improve everyone’s experience in making our tools better.</p>\n","author":"Adam Fitzgerald","siteTitle":"HashiCorp Blog","siteHash":"219aa6310b3388f2335eba49871f4df9581f2c58eaeb5e498363b54e835b7001","entryHash":"9fef456b33a30fea615085b0d22e42b521aa7f8a3fba6a10c7240f7ecb18695f","category":"Tech"}