{"title":"Digital health literacy, vaccine information sources, and vaccine acceptance among parents in Ontario: Quantitative findings from a mixed methods study","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003154","date":1715954400000,"content":"<p>by Sarah Ashfield, Lorie Donelle, Panagiota Tryphonopoulos, Ève Dubé, Maxwell Smith</p>\r\n\r\nParents make important vaccination decisions for their children and many variables affect parents’ decisions to accept or decline vaccines. Parents are tasked with locating, understanding, and applying information to inform health decisions often using online resources; however, the digital health literacy levels of parents are unknown. The purpose of this study was to investigate parents’ digital health literacy levels, their sources for vaccine information, and analyze how demographics, digital health literacy, health literacy, parental attitudes and vaccine beliefs, trust, and vaccine information sources predict vaccine acceptance. Quantitative findings of a mixed methods study that examined parental vaccine decision making across the continuum of vaccine hesitant to vaccine accepting is reported. An online survey of parents of young children living in Ontario, Canada was conducted in 2022. Multiple linear regression determined predictors of vaccine acceptance. 219 participants completed the survey and on average reported adequate digital health literacy skill. Healthcare providers were reported as the most commonly used source of vaccine information. Two models were retained that predicted vaccine acceptance, both models predicted about 50% of the variability in vaccine acceptance. Model A identified that trust predicted parent vaccine acceptance and model B identified that digital health literacy, and the vaccine information sources healthcare providers, family and friends, and alternate healthcare providers predicted vaccine acceptance. Family and friends and alternate healthcare providers negatively predicted vaccine acceptance. Most parents in our study had high levels of digital health literacy. Opportunities exist for further research and policy change focused on trust at a systemic public health level. While clinical level implications included the importance of healthcare providers as a vaccine information source and adequate digital health literacy to facilitate parental vaccine decision making. Continued efforts to develop awareness on the importance of digital health literacy among the public and healthcare providers is needed, including further research on the digital health literacy levels of Canadians.","author":"Sarah Ashfield","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"9ff5dc6f2ddd10fb5345f922e877a71c43cd6816579789d16254a34ed071c2cc","category":"Environment"}