{"title":"The Sarcoplasmic/Endoplasmic Reticulum Ca2+-ATPase (SERCA) Activator CDN1163 Exerts Complex Time-Dependent and SERCA Isoform-Specific Effects on T Lymphocyte Ca2+ Store Functions","link":"https://www.preprints.org/manuscript/202402.0568/v2","date":1717138841000,"content":"The allosteric SERCA (Sarcoplasmic/Endoplasmic Reticulum Ca2+-ATPase) activator CDN1163 has been recently added to the group of pharmacological tools for probing SERCA function. We chose to investigate the effects of the compound on T lymphocyte Ca2+ stores, using the well-described Jurkat T lymphocyte as a reliable cell system for Ca2+ signaling pathways. Our study identified the lowest concentrations of the SERCA inhibitors thapsigargin (TG) and 2,5-di-(tert butyl)-1,4-benzohydroquinone (tBHQ) capable of releasing Ca2+, permitting the differentiation of the TG-sensitive SERCA 2b Ca2+ store from the tBHQ-sensitive SERCA 3 Ca2+ store. We proceeded to test the effects of CDN1163 on Ca2+ stores, examining specific actions on the SERCA 2b and SERCA 3 Ca2+ pools using our low dose SERCA blocker regimen. In contrast to previous work, we find CDN1163 exerts complex time-sensitive and SERCA isoform-specific actions on Ca2+ stores. Surprisingly, short-term exposure (0-30 minutes) to CDN1163 perturbs T cell Ca2+ stores by suppressing Ca2+ uptake with diminished Ca2+ release from the SERCA 2b-controlled store. Concomitantly, we find evidence for a SERCA-activating effect of CDN1163 on the SERCA 3 regulated store, given the observation of increased Ca2+ release inducible by low dose tBHQ. Intriguingly, longer-term (&amp;gt;12 hours) CDN1163 exposure reversed this pattern, with increased Ca2+ release from SERCA 2b-regulated pools, yet decreased Ca2+ release responses from tBHQ-sensitive SERCA 3 pool. Our results reveal differential effects of CDN1163 on Ca2+ stores regulated by distinct SERCA isoforms, prompting the need for careful interpretation of the compound’s effects, particularly in cells expressing multiple SERCA isoforms.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"9ffd9c3a7a169371230360eb82e93a5b2b21b62a94684cd6914ccf12513ce7bc","category":"Interdisciplinary"}