{"title":"Unraveling the role of low‐density lipoprotein‐related genes in lung adenocarcinoma: Insights into tumor microenvironment and clinical prognosis","link":"https://onlinelibrary.wiley.com/doi/10.1002/tox.24230?af=R","date":1710506749000,"content":"<h2>Abstract</h2>\n<h2>Background</h2>\n<p>The hypothesized link between low-density lipoprotein (LDL) and oncogenesis has garnered significant interest, yet its explicit impact on lung adenocarcinoma (LUAD) remains to be elucidated. This investigation aims to demystify the function of LDL-related genes (LRGs) within LUAD, endeavoring to shed light on the complex interplay between LDL and carcinogenesis.</p>\n<h2>Methods</h2>\n<p>Leveraging single-cell transcriptomics, we examined the role of LRGs within the tumor microenvironment (TME). The expression patterns of LRGs across diverse cellular phenotypes were delineated using an array of computational methodologies, including AUCell, UCell, singscore, ssGSEA, and AddModuleScore. CellChat facilitated the exploration of distinct cellular interactions within LDL_low and LDL_high groups. The findmarker utility, coupled with Pearson correlation analysis, facilitated the identification of pivotal genes correlated with LDL indices. An integrative approach to transcriptomic data analysis was adopted, utilizing a machine learning framework to devise an LDL-associated signature (LAS). This enabled the delineation of genomic disparities, pathway enrichments, immune cell dynamics, and pharmacological sensitivities between LAS stratifications.</p>\n<h2>Results</h2>\n<p>Enhanced cellular crosstalk was observed in the LDL_high group, with the CoxBoost+Ridge algorithm achieving the apex c-index for LAS formulation. Benchmarking against 144 extant LUAD models underscored the superior prognostic acuity of LAS. Elevated LAS indices were synonymous with adverse outcomes, diminished immune surveillance, and an upsurge in pathways conducive to neoplastic proliferation. Notably, a pronounced susceptibility to paclitaxel and gemcitabine was discerned within the high-LAS cohort, delineating prospective therapeutic corridors.</p>\n<h2>Conclusion</h2>\n<p>This study elucidates the significance of LRGs within the TME and introduces an LAS for prognostication in LUAD patients. Our findings accentuate putative therapeutic targets and elucidate the clinical ramifications of LAS deployment.</p>","author":"Pengpeng Zhang, \nXinyi Wu, \nDingli Wang, \nMengzhe Zhang, \nBin Zhang, \nZhenfa Zhang","siteTitle":"Wiley: Environmental Toxicology: Table of Contents","siteHash":"3e19664e1b03dbc2a34b78954cb357c115e887427c6329aabe3978a05669aef6","entryHash":"9ffde115574e3f12d8b9c1d6ca9923560c51f72fbced6d35271d33995217847e","category":"Environment"}