{"title":"Apple กำลังศึกษาการพัฒนาออกแบบชิ้นส่วนเซ็นเซอร์กล้อง เพื่อใช้งานเอง","link":"https://www.blognone.com/node/136828","date":1700411489000,"content":"<div><div><div><p>ข้อมูลนี้มาจากจดหมายข่าวรายสัปดาห์ Power On โดย Mark Gurman แห่ง Bloomberg คนเดิม ซึ่งพูดถึงแผนงานของแอปเปิลในการพัฒนาชิ้นส่วนฮาร์ดแวร์ขึ้นมาเอง นำทีมโดย Johny Srouji หัวหน้าฝ่ายเทคโนโลยีของแอปเปิล</p>\n<p>ที่ผ่านมาผลงานเด่นของแอปเปิลคือการพัฒนาชิปประมวลผลเอง ทั้งที่ใช้ใน iPhone มานาน และที่โดดเด่นล่าสุดคือชิปสำหรับ Mac รวมถึงชิปที่ไปถึงระดับเทคโนโลยี 3 นาโนเมตร ทั้งหมดนี้เป็นการวางแผนยาวนานมากกว่า 10 ปี อย่างไรก็ตามทีมของ Srouji ยังมีงานออกแบบพัฒนาชิ้นส่วนอีกหลายอย่าง ที่อยู่ในแผนงานและตอนนี้ยังไม่สำเร็จ</p>\n<p>ตัวที่มีรายงานข่าวมานานคือชิปโมเด็ม ซึ่งปัจจุบันแอปเปิลซื้อจาก Qualcomm แต่<a href=\"https://www.blognone.com/node/135893\">การพัฒนายังไม่สำเร็จตามแผน</a> ข้อมูลล่าสุดคาดว่าแอปเปิลจะเริ่มใช้ชิปโมเด็มพัฒนาเองได้ในปี 2026 และจากตรงนั้นต้องใช้เวลาอีก 2-3 ปี เพื่อให้ได้ชิปโมเด็มสำหรับ iPad และ Apple Watch</p>\n<p>รายการชิ้นส่วนอื่่นที่ทีมย่อยของ Srouji กำลังพัฒนามีทั้ง ชิปที่รวม Wi-Fi และบลูทูธเข้าด้วย เพื่อแทนที่ชิปที่ซื้อจาก Broadcom, จอแสดงผล MicroLED พัฒนาเอง<a href=\"https://www.blognone.com/node/100795\">เพื่อเตรียมใช้กับ Apple Watch</a> ก่อน, เซ็นเซอร์ตรวจสอบระดับกลูโคส และแบตเตอรี่แบบคัสตอม</p>\n<p>สุดท้ายคือชิ้นส่วนที่แอปเปิลเพิ่งเริ่มศึกษาแนวทางพัฒนาเอง คือเซ็นเซอร์กล้อง ที่ถือเป็นจุดขายทุกปีของ iPhone ตามแผนงานนั้นแอปเปิลมองไกลกว่าว่าเซ็นเซอร์กล้อง จะมีความจำเป็นมากในเฮดเซต Mixed Reality และระบบขับเคลื่อนอัตโนมัติของรถยนต์ จึงจำเป็นที่แอปเปิลต้องพัฒนาชิ้นส่วนขึ้นเอง</p>\n<p>ที่มา: <a href=\"https://www.bloomberg.com/news/newsletters/2023-11-19/apple-in-house-technologies-team-eyes-making-cameras-screens-modems-batteries-lp5j5h6b\">Bloomberg</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/1747c5ee0c7031cde8318be1d3ea2a02.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/apple\">Apple</a></div><div><a href=\"/topics/rumors\">Rumors</a></div><div><a href=\"/topics/mobile-camera\">Mobile Camera</a></div><div><a href=\"/topics/hardware\">Hardware</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a001990667b8b6a74165821d74961c66f9ff34a7ac66082f7ea6e5babc65b7e2","category":"Thai"}