{"title":"Microsoft seizes domains used by “highly sophisticated” hackers in China","link":"https://arstechnica.com/?p=1818425","date":1638875742000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/china-inside-800x533.jpg\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2020/09/china-inside.jpg\">Enlarge</a> <span>/</span> Computer chip with Chinese flag, 3d conceptual illustration. (credit: <a href=\"https://www.agefotostock.com/age/en/Stock-Images/Royalty-Free/SPH-f0280232/1\">Steve McDowell / Agefotostock</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Microsoft said it has seized control of servers that a China-based hacking group was using to compromise targets that align with that country’s geopolitical interests.</p>\n<p>The hacking group, which Microsoft has dubbed Nickel, has been in Microsoft’s sights since at least 2016, and the software company has been tracking the now-disrupted intelligence-gathering campaign since 2019. The attacks—against government agencies, think tanks, and human rights organizations in the US and 28 other countries—were “highly sophisticated,” Microsoft said, and used a variety of techniques, including exploiting vulnerabilities in software that targets had yet to patch.</p>\n<h2>Down but not out</h2>\n<p>Late last week, Microsoft sought a court order to seize websites Nickel was using to compromise targets. The court, in the US District Court for the Eastern District of Virginia, granted the motion and unsealed the order on Monday. With control of Nickel’s infrastructure, Microsoft will now “sinkhole” the traffic, meaning it’s diverted away from Nickel’s servers and to Microsoft-operated servers, which can neutralize the threat and allow Microsoft to obtain intelligence about how the group and its software work.</p></div><p><a href=\"https://arstechnica.com/?p=1818425#p3\">Read 10 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1818425&amp;comments=1\">Comments</a></p>","author":"Dan Goodin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a0021c7d9b02c6629b236a991a8c2df2b3bb452fddde253be7356bbadcce8660","category":"Tech"}