{"title":"Ocean conditions influence the quality of recruiting benthic marine invertebrate larvae—Insights from fatty acids","link":"https://aslopubs.onlinelibrary.wiley.com/doi/10.1002/lno.12702?af=R","date":1727691829000,"content":"<h2>Abstract</h2>\n<p>Many marine benthic invertebrates have a pelagic life stage, during which larvae need to accumulate enough reserves to complete metamorphosis to a settled benthic juvenile. Currently, very little is known about how ocean conditions affect quality of the larvae. We studied this for three settlement seasons (2017–2019) by collecting returning Dungeness crab (<i>Metacarcinus magister</i>) megalopae at the Oregon coast and analyzing them for fatty acid biomarkers. We found that the larvae are omnivorous and have versatile diets. The daily larval abundance was positively correlated with larval quality. Despite the relatively high day-to-day variation, we found pronounced seasonal and inter-annual differences in the body condition (size and total fatty acid content) and biomarker composition of megalopae. Especially, the early season recruits of 2017 had lower content of lipids and polyunsaturated fatty acids known to be beneficial to crustaceans. This is likely related to lingering effects of the eastern Pacific marine heat wave (2014–2016) on pelagic communities. The larvae were rich in docosahexaenoic acid (DHA) and eicosapentaenoic acid (EPA) with lower levels in benthic juveniles, indicating an ontogenetic diet shift and likely lower availability of DHA and EPA in the benthic environment. The pulsed megalopa recruitment may provide substantial carbon and lipid inputs to the nearshore ecosystem as a form of pelagic subsidy. Our results reveal that ocean conditions may have an effect on the quality of returning larvae, which likely influence their recruitment performance and early juvenile success, and thus potentially also the population size and commercial catch 4 yr later.</p>","author":"Minna Hiltunen, \nMichael Thomas, \nAlan L. Shanks, \nAaron W. E. Galloway","siteTitle":"Wiley: Limnology and Oceanography: Table of Contents","siteHash":"483837404a651916bc0fc2a986656bb768431b5eda97cb95890947a6f32d3b51","entryHash":"a003f0a6e57319d2443bc0d2e3260e42a013bcb3b92ec0bf0330231b18f16cc5","category":"Environment"}