{"title":"An Assessment of Agent-Based Modelling Tools for Community-Based Adaptation to Climate Change","link":"https://www.preprints.org/manuscript/202407.2328/v3","date":1726472114000,"content":"Human induced climate change led to the recognition of Community-Based Adaptation (CBA) as one of the remedies in building adaptive capacity and resilience of communities. It recognizes the resources and the skills as well as the agency of communities in shaping the optimal strategy. CBA interventions are vital in addressing community needs and contextual specificities, enable participatory and inclusive engagement and thereby facilitate more profound adaptation impacts. Agent-based modelling (ABM) harbors the potential to be the ideal tool to support developing of tailored adaptation strategies while considering capacities, resources, skills, priorities, needs and the cultural context of local communities. ABM allows to capture the complex relationships among various components within community decision making on CBA actions, the CBA actions themselves and the environment. There exist plenty of tools, however they provide for varying degrees of freedom in agent definition, sensitivity analysis, scalability, experiment design and output analysis to name a few. A set of required key criteria for CBA modelling is developed and all available ABM modelling and simulation tools are assessed for their suitability for CBA. NetLogo emerges as the most fitting tool for incorporating and handling the special features of CBA. It is closely followed by GAMA and Envision. The article provides insights and guidance to researchers and practitioners in selecting ABM tools aligned with the specific requirements of their CBA simulations and projects.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a0051fed57e36db70bb15122e4211de6cd47b0c56869c42acd8f119d0deeb355","category":"Interdisciplinary"}