{"title":"Kuo: Apple Upgrading iPhone 16 Microphone to Boost Siri AI Experience","link":"https://www.macrumors.com/2023/12/07/apple-iphone-16-microphone-upgrade-siri-ai/","date":1701940059000,"content":"Apple plans a significant upgrade to the iPhone 16 microphone to improve the new AI-enhanced Siri experience, according to Apple analyst Ming-Chi Kuo.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/iPhone-16-Side-Feature.jpg\" width=\"3532\" height=\"1986\" />\r<br />\nWriting in his <a href=\"https://medium.com/@mingchikuo/瑞聲科技與歌爾股份為ai-iphone的領先受益者-aac-and-goertek-are-ai-iphones-leading-beneficiaries-1ec29ee45e42\">latest Medium post</a>, Kuo suggests Apple's generative AI ambitions and integration of large-language models (LLMs) into Siri will make voice input a key interface factor.\r<br />\n\r<br />\nTo that end, Apple is preparing a major microphone upgrade for the iPhone 16, with better signal-to-noise ratio a key specification that will \"improve the Siri experience significantly,\" says Kuo. The new microphone will also have better water resistance. \r<br />\n\r<br />\nThe upgrade corroborates other reports suggesting Apple plans to make enhanced Siri features a key selling point of the iPhone 16. New Siri features <a href=\"https://www.macrumors.com/2023/10/22/apple-generative-ai-features-and-smarter-siri/\">powered by large language models</a> are expected in iOS 18, and Kuo's report notes that Apple reorganized its Siri team in the third quarter to integrate generative AI and LLMs. However, Kuo's predictions also add weight to rumors that additional on-device AI features could remain <a href=\"https://www.macrumors.com/2023/11/09/iphone-16-exclusive-ai-features-ios-18/\">exclusive to the iPhone 16 models</a>.\r<br />\n\r<br />\nAccording to the analyst's latest survey, AAC and Goertek are the microphone suppliers for the iPhone 16, and will benefit equally from the specification upgrade. \"The ASP of microphones for each iPhone 16 will be at least 100–150% higher than that of the iPhone 15,\" says Kuo. \"As a result, AAC's and Goertek's revenues and earnings are expected to benefit significantly from this upgrade.\"<div>Related Roundups: <a href=\"https://www.macrumors.com/roundup/iphone-16/\">iPhone 16</a>, <a href=\"https://www.macrumors.com/roundup/iphone-16-pro/\">iPhone 16 Pro</a></div><div>Tag: <a href=\"https://www.macrumors.com/guide/ming-chi-kuo/\">Ming-Chi Kuo</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/07/apple-iphone-16-microphone-upgrade-siri-ai/\">Kuo: Apple Upgrading iPhone 16 Microphone to Boost Siri AI Experience</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/kuo-apple-upgrading-iphone-16-microphone-to-boost-siri-ai-experience.2413044/\">Discuss this article</a> in our forums<br /><br />","author":"Tim Hardwick","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a006dee017466afca92620aa685dee9f0c5a854806c43e6693c0e38acf6228fc","category":"Apple"}