{"title":"Medically unexplained symptoms and experiences with healthcare among emerging adults exposed to multiple types of potentially traumatic events","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310335","date":1725890400000,"content":"<p>by Caterina Obenauf, Gina P. Owens, Sam DeHart</p>\r\n\r\nExperiencing multiple types of traumatic events can increase the risk of developing somatic and posttraumatic stress symptoms (PTSS). Medically unexplained symptoms (MUS), or somatic symptoms that lack a distinct medical explanation, often coexist with PTSS in emerging adults and may be due to common underlying mechanisms. Coping strategies have been associated with PTSS, but have not been studied in trauma-exposed individuals with MUS. The current study examined the relationship between the number of types of potentially traumatic events experienced and MUS among emerging adults, considering the influence of PTSS and engagement and disengagement coping. A sample of 363 emerging adults (Mean = 18.91) completed self-report measures of trauma history, PTSS, MUS, experiences with healthcare providers, and coping strategies. Dissatisfaction with healthcare providers was reported by 11.3% of participants reporting MUS, with over half (52.8%) feeling their concerns were dismissed. Hierarchical linear regression showed that the number of types of traumatic events experienced did not predict MUS after accounting for PTSS. Moderation hypotheses linking traumatic events and coping strategies were not supported. Results suggest that PTSS explains the relationship between exposure to different traumatic events and MUS. Findings may have diagnostic and treatment implications for healthcare providers working with emerging adults who have experienced trauma.","author":"Caterina Obenauf","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a006452b75deeed9802fb974bd15abe3dfed4e242511168ddfcb3a85f9ba7f42","category":"Interdisciplinary"}