{"title":"Assisted migration of coho salmon: Influences of passage and habitat availability on population dynamics","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4355?af=R","date":1721989458000,"content":"<h2>Abstract</h2>\n<p>Assisted migration is a means of introducing a species into a previously unoccupied area. Although this idea is relatively new for many species, there are many extant examples involving fish that can be instructive. We studied a case of assisted migration where upstream access of migrating adult coho salmon <i>Oncorhynchus kisutch</i> over a naturally impassible barrier was established through construction of fish ladders. Although these passage structures have successfully allowed coho salmon to colonize upstream locations, managers had concerns regarding how efficiently these structures passed fish, as well as questions regarding access to specific upstream habitats, and passage barriers further upstream. To address these concerns, we developed a stage-based population model to explore: (1) influences of passage over structures, (2) rearing habitats upstream of the structures, and (3) consequences of additional barriers to passage in the system. Model simulations suggest high fish passage at the ladders was associated with the highest smolt and adult abundance of coho salmon. The importance of passage was strongly influenced by juveniles rearing in a lake, where increased lake rearing at each passage scenario increased abundance of smolts and adults. Opening habitat further upstream was estimated to increase adult and smolt abundance up to 12%. Results of model simulations also helped to identify uncertainties that could be evaluated further (e.g., juvenile rearing in the lake). In general, our findings point to the importance of considering a full range of processes that can drive expected outcomes for assisted migration.</p>","author":"Joseph R. Benjamin, \nJason B. Dunham, \nNicholas Scheidt, \nCarla Rothenbuecher, \nCory Sipher","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"a007ac0e156641bf5b58d576db457d2ec8cb05ea30f6749b67bec38b7138d67b","category":"Environment"}