{"title":"Population parameters and conservation implications for one of the world's rarest marine fishes, the red handfish (Thymichthys politus)","link":"https://onlinelibrary.wiley.com/doi/10.1111/jfb.15651?af=R","date":1712853919000,"content":"<h2>Abstract</h2>\n<p>Population estimates are required for effective conservation of many rare marine species, but can be difficult to obtain. The critically endangered red handfish (<i>Thymichthys politus</i>) is a coastal anglerfish known only from two fragmented populations in southeast Tasmania, Australia. It is at a high risk of extinction due to low numbers, loss of habitat, and the impacts of climate change. To aid conservation efforts, we provide the first empirical population size estimates of red handfish and investigate other important aspects of the species' life history, such as growth, habitat association, and movement. We surveyed both red handfish local populations via underwater visual census on scuba over 3 years and used photographic mark-recapture techniques to estimate biological parameters. In 2020, the local adult population size was estimated to be 94 (95% confidence interval [CI] 40–231) adults at one site, and 7 (95% CI 5–10) at the other site, suggesting an estimated global population of 101 adults. Movement of individuals was extremely limited at 48.5 m (± 77.7 <span>S.D.</span>) per year. We also found evidence of declining fish density, a declining proportion of juveniles, and increasing average fish size during the study. These results provide a serious warning that red handfish are likely sliding toward extinction, and highlight the urgent need to expand efforts for ex situ captive breeding to bolster numbers in the wild and maintain captive insurance populations, and to protect vital habitat to safeguard the species' ongoing survival in the wild.</p>","author":"Tyson J. Bessell, \nRick D. Stuart‐Smith, \nOlivia J. Johnson, \nNeville S. Barrett, \nTim P. Lynch, \nAndrew J. Trotter, \nJemina Stuart‐Smith","siteTitle":"Wiley: Journal of Fish Biology: Table of Contents","siteHash":"bfc1ed2d932ada5ee9516152bf3d31ffc68bde2c213c37054bc19369ce2744a8","entryHash":"a00e01071482a8434b8a6f6a57a61a859823af994b440f7a2ee77be8abfe93fa","category":"Environment"}