{"title":"FBI: Rent-a-Hitman site nabbed Air National Guardsman who was “excited” to kill","link":"https://arstechnica.com/?p=1932368","date":1681764107000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/josiah-garcia-800x586.jpg\" alt=\"Selfie photo of a young man in a military uniform.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/04/josiah-garcia.jpg\">Enlarge</a> <span>/</span> A picture from Josiah Garcia's Facebook profile. </p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>US authorities say a 21-year-old Air National Guardsman applied for hitman work on the satirical RentAHitman.com website and later agreed to kill a fictional person in exchange for $5,000. Tennessee man Josiah Ernesto Garcia was arrested and charged with use of interstate commerce facilities in the commission of murder-for-hire, US Attorney Henry Leventis <a href=\"https://www.justice.gov/usao-mdtn/pr/air-national-guardsman-charged-murder-hire-scheme\">announced</a> Friday.</p>\n<p>\"Garcia submitted an employment inquiry indicating that he was interested in obtaining employment as a hit man,\" the announcement said. \"Garcia followed up on this initial request and submitted other identification documents and a resume, indicating he was an expert marksman and employed in the Air National Guard since July 2021.\"</p>\n<p>Garcia's resume allegedly said his nickname, \"Reaper,\" was \"Earned from Military experience and Marksmanship.\" The resume said he was recognized as an expert marksman \"for not missing a single bullseye on all of the targets and for shooting expert with 2 (or more) weapons,\" according to the FBI.</p></div><p><a href=\"https://arstechnica.com/?p=1932368#p3\">Read 25 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1932368&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a015ed89cc96726ccd9c07526f016719762382339a6879bf8005ffd86a465eb1","category":"Tech"}