{"title":"To understand Apple’s Vision Pro strategy, look to the iPod","link":"https://www.macworld.com/article/1950084/apples-vision-pro-strategy-ipod-mini-cheaper-version.html","date":1686712473000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple’s Vision Pro may be the most intriguing new Apple product in years, but at $3,499, very few people are going to actually buy one. But fret not: Apple is reportedly already working on a cheaper model to be announced in 2025.</p>\n\n\n\n<p>In his latest <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/newsletters/2023-06-11/will-there-be-a-cheaper-apple-vision-how-apple-can-lower-cost-of-new-headset-lirfnvz1&amp;xcust=1-1-1950084-1-0-0&amp;sref=https://www.macworld.com/feed\">Power On newsletter</a>, Gurman claims that a “cheaper” version of the Vision Pro is in development, likely with “lower quality screens, either an iPhone-grade chip or an older Mac chip and fewer cameras.” Dubbed Apple Vision or Apple Vision One, the headset is expected to launch in 2025.</p>\n\n\n\n<p>We’ve heard this rumor before, but now that we know what Apple’s high-end headset looks like, does, and costs, it puts the less-expensive model in a bit more context. The headset is packed with very high-end tech, so we can expect the cheaper model to cut back on some of the specs, not unlike the <a href=\"https://www.macworld.com/article/666267/ipod-mini-2004-review.html\">iPod mini</a>. Compared to the iPod, the iPod mini had a smaller case and screen, and introduced the Click Wheel, a compact version of the original iPod’s iconic scroll-wheel, as well as less storage for $249, about 40 percent less than the original iPod. A similar formula puts the lower-priced Vision at around $2,000, which seems like a bargain compared to the Vision Pro.</p>\n\n\n\n<p>Like the iPod mini, Gurman says certain features are likely to make it into the cheaper model, including the external EyeSight screen that projects an image of the wearer’s eye and the eye- and hand-tracking interface. However, a cheaper headset could sacrifice screen, audio, and build quality to lower the price.</p>\n\n\n\n<p>Like the iPod, it makes sense to price Vision Pro so high. With the first version, you want to showcase the best possible tech, and in the case of the Vision Pro, it needs to blow people away. Apple will sell some Vision Pro headsets for sure, but its main job will be to make people who won’t buy one want one—so when the cheaper model arrives they’ll rush to buy one. Just like the iPod mini.</p>\n\nApple, Virtual Reality</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a01a3d8b606d63b5f9374c141114dc16fdc6ec0fdded6d4a3c9899a326b41e39","category":"Apple"}