{"title":"Kristen Faulkner: “There are so many business models that cycling can adopt”","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/kristen-faulkner-theres-so-many-business-models-that-cycling-can-adopt","date":1619088373000,"content":"\n      <p><span>Kristen Faulkner is having a moment</span></p>\n<div></div>\n<p><span>On the bike her tenacity and determination saw her ride to seventh place at Gent-Wevelgem, 10th at Flanders and — after getting dropped and riding back up to the bunch multiple times — 15th at Amstel Gold Race. Off the bike, the same characteristics are what earned Faulkner a place at Harvard to study computer science and a job as a venture capitalist in Silicon Valley before pivoting to a cycling career in 2020. </span></p>\n<p><em><strong><a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/iris-slappendel-interview\">Related – Iris Slappendel interview</a></strong></em></p>\n<p><span>At 28-years-old and on her second season as a pro with Team Tibco-Silicon Valley Bank, Faulkner is the latest in a succession of North American women who have entered the sport after studying and/or working and gone on to achieve great things. Evelyn Stevens, Katie Hall, and Megan Guarnier are the most prominent recent examples of a similar journey. However, what might truly set Faulkner apart — aside from her natural physiological prowess — are her ideas for improving the sport, particularly for women. </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2021-04-22_at_10.11.44_AM_1024x1024.jpg?v=1619080344\" /></div>\n\n<p><span><em>Photo credit Brian Bailey @bbaiiey </em></span></p>\n<p><span>Faulkner’s newcomer status combined with her business background gives her a distinct approach to solving the inequalities between the men’s and women’s side of the sport, inequalities that shocked her when she first encountered them. </span></p>\n<p><span>“The biggest things were salaries and TV coverage,” she says over Zoom from the temporary team house in Belgium. “Those were just, to me, a complete shock to my system. I didn't believe it, actually. I would hear numbers and for weeks I was like, ‘There's no way that can be true’, because it's so absurd.”</span></p>\n<p><span>While applying US-centric capitalist models to a decidedly European sport steeped in tradition hasn’t quite worked out for football this week, Faulkner is determined that — in order to progress — the sport of cycling must put its business hat on. “I'm very passionate about this,” she asserts. “there's so many business models that cycling can adopt.” </span></p>\n<p><span>“I come from this from a business standpoint, a business background,” she adds, “and people aren't applying business principles to cycling. And it just makes me mad. Because I'm like: this is a business, this is an entertainment business.” </span></p>\n<p><span>One of the models from which cycling could benefit, Faulkner believes, is through better targeting of advertising during race broadcasts, “Sometimes they show commercials that aren't even targeting women,” she says. \"[Broadcasters] put the exact same advertisements in the women's races that you do in the men's races, and the viewership might be completely different. So no wonder you're not making any money on women's cycling.”</span></p>\n<p><span>While some would argue that the existence of any live coverage of women’s cycling at all could be considered enough of a win, Faulkner wants to see it go one step further and turn the exposure into direct profit. “Right now, yes, the riders are losing, but everyone's losing because the media companies could be making so much more money if they could leverage these races and market them and promote them and build a following,” she says.</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2021-04-22_at_10.07.58_AM_1024x1024.jpg?v=1619080377\" /></div>\n<p><span>She believes that riders themselves could also take greater charge of their own fortune, “A lot of riders think, I'm here to be the best rider, they don't think, I'm here to make my sponsors money,” she says. “And they don't realise who's paying, and that there's actually a value chain of money.” </span></p>\n<p><span>Social media and other forms of self-promotion could be better utilised by the women’s peloton, Faulkner argues.“That's why I'm so passionate about advocacy, because I think everyone needs to understand that if you want to be a higher paid rider, you don't just become a better rider, you become more entertaining.” </span></p>\n<p><span>Many established riders might argue that they do understand, and that — rather than any failings on their part to promote their image — they are let down by structural inequalities within the sport. Australian Canyon//SRAM domestique Tiffany Cromwell is one of the most active female riders on Instagram and has 113k followers on the platform, the perennially effervescent Cecille Uttrup Ludwig, has built a loyal fan following and 56.9k Instagram followers. Liv Racing’s Alison Jackson has become the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/action-jackson\">TikTok queen</a> of the peloton. </span></p>\n<p><span>Despite remaining relatively private and rarely posting on social media, former world champion Lizzie Deignan’s account has 95.1k followers. It is through her status as a mother, however, that Faulkner believes Deignan might be best placed to leverage revenue. Because, she argues, while Deignan, “inspires women to believe that having a baby and being a human produces a baby, and having a woman's body does not hinder you from achieving amazing things with your body,” she says. The value, she argues, is in the fact “you will make more money in the sport by offering maternity leave, because people latch on to those stories, and people follow them on Instagram, and they buy the products that she promotes.” </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2021-04-22_at_10.07.55_AM_1024x1024.jpg?v=1619080402\" /></div>\n<p><span>For Faulkner, it is stories such as Deignan’s, and the resulting connections that can be made with fans which have the ability to transcend the sport and broaden the appeal of cycling, thus bringing in more money. “There's this notion that you need to sell cycling — you don't — you need to sell stories based on inspiration, you need to have icons and heroes,” she says. “You can sell anything if you're good at marketing, it's not always about the product, it's about, how does the product make the person feel? How do we create an emotional connection with that product?” She cites basketball as an example, “A lot of people might not have watched basketball before Michael Jordan, but they watch basketball because of Michael Jordan.” </span></p>\n<p><span>Many of Faulkner’s ideas for improving the lot of the women’s peloton include raising the profile of the sport as a whole and making it appeal to the average consumer. “I think there needs to be products and brands built around the non-professional cyclists,” she says. “There's just so many audiences that cycling hasn't tapped. Imagine if you only sold makeup to white women? I sometimes feel like that's cycling, we only sell to middle-aged white men.” </span></p>\n<h4>VC vision</h4>\n<p><span>During a conversation that felt like it began with a deep intake of breath and was followed by an expelling of repressed frustration, Faulkner also lamented the myopic ambitions of cycling’s administrators. \"If you're a CEO of a company, and you don't have a long term vision for how you're going to appeal to the mass market, you're going to get fired, because you're not maximising potential,\" she asserts, arguing that there needs to be more of a crossover. </span></p>\n<div></div>\n<p><span>The fault, she says, lies in the fact that the majority of those in charge do not have business experience and as such are not familiar with how to maximise profits. To that end, risk is also a key factor for Faulkner — for whom it was a daily part of her working life as a venture capitalist before she quit her job in January to focus on cycling. “I think race organisers could be more creative and maximise long-term profits,” she says. “If they were willing to take on a little bit of risk for a lot more reward long-term and think more in the long-term and less in the short term.” </span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2021-04-22_at_10.07.55_AM_1_1024x1024.jpg?v=1619080461\" /></div>\n<p><em><span>Photo credit: Twila Muzzi @twilcha</span></em></p>\n<p><span>Has she posited any of these ideas to fellow riders? “I'm one of very few people who come from a business background who are in professional cycling,” she says. “So honestly, I don't think a lot of cycling people have studied business. And I think a lot of business people don't want to work in cycling, because it doesn't pay as much business.”</span></p>\n<p><span>Riders need to take up the mantle, she says, but, “frankly, we're overworked. We're overstressed and we don't make enough money. Like, we're exhausted. It's no wonder we're not going to have the time to learn all this and sell ourselves.” But, she insists, “Someone's got to do it, it needs to happen. So, if not me, who?”</span></p>\n<p><span>Whether her colleagues are on board or not, Faulkner is determined to get the point across to some of women’s cycling’s major stakeholders. “I got a phone call with the head of the Flanders Classics because I wanted to understand the business model more,” she says. “So I just cold reached out to them and said: I'm trying to understand, help me understand. I wanted to understand where the economics flowed.” </span></p>\n<p><span>It isn’t just race organisers like Flanders Classics who are on her radar, “I'm a member of  The Cyclists' Alliance. I think what they're doing is great,” she says. “I was talking to Iris [Slappendel, founder of The Cyclists’ Alliance] this morning, and I had a phone call with her two days ago.” </span></p>\n<p><span>She also contacted the man behind the Strade Bianche prize money GoFundMe page, “My next outreach is actually going to be to media companies,” she says. “I'm trying to talk to all the stakeholders, or as many as I can, and just understand where some of the big holes are. And the positions that some of the stakeholders are in, because I want to understand what they can do, what they can't do and what they are doing.”</span></p>\n<div><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/WhatsApp_Image_2021-04-22_at_10.11.46_AM_1_1024x1024.jpg?v=1619080554\" /></div>\n<p><em><span>Photo credit Brian Bailey @bbaiiey </span></em></p>\n<p><span>Her ambition is to understand how she can make it easier for them to support women's cycling. “My goal, and my mission, when I'm not riding, is to understand where all the economics flow, and how to expand the pie. And hopefully, through these conversations, apply some business principles where they don't exist.”</span></p>\n<p><span>The confidence with which Faulkner reels off her ambitions for the growth of the sport speak to the characteristics inherent in the mindset of both a businesswoman and a professional athlete, that Faulkner is both means her conviction is twofold. Whatever the merits of her ideas are in practise, her tenacity and ambition to change the sport for the better has to be commended. </span></p>\n<p><span>“I think there's too many opportunities in women's cycling that are getting passed up,” she says. “And too many women are suffering because of it. Change isn’t going to happen on its own, it takes people putting in the time, so if I feel like it's inadequate, I'm going to step in.”</span></p>\n<p><span>“It's no different from racing, right?” she says. “It's like, when everyone around you is giving up, that’s when you need to push the hardest. I think the same is true right now, that's how you win.”</span></p>\n<p><span>If her results are as consistent off the bike as they are on it, then it won’t be long before she does see a win. </span></p>\n<div></div>\n    ","author":"Peter Stuart","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a01f78cb938bf4b7eedd487a251db3d4d9345ac758f699b9344f6d7a9af98f15","category":"Cycling"}