{"title":"Postoperative trachomatous trichiasis and associated factors among adults who underwent trachomatous trichiasis surgery in Ambassel District, North-East Ethiopia","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304407","date":1716904800000,"content":"<p>by Abdu Tabor Yimam, Gizachew Tadesse Wassie, Getu Degu Alene</p>\r\nBackground <p>In Trachoma endemic countries, many people who underwent Trichiasis surgery faced a recurrence of the disease. Postoperative Trichiasis is a significant problem for patients and health care providers because it puts the eye at renewed risk of sight loss. Despite the low utilization of Trachomatous Trichiasis surgery and the high recurrence rate, evidence that elucidate why it recurs after surgery is limited. This study was aimed to assess the magnitude and associated factors of postoperative Trichiasis among 18 years and above individuals who underwent Trachomatous Trichiasis surgery between 2013 and 2019 in Ambassel District, Northeast Ethiopia, 2020.</p> Methods <p>The community-based cross-sectional study design was conducted from March 10 to March 23/2020 in selected <i>kebeles</i> of Ambassel District. The required sample size (506) was calculated using EPI-INFO Version 7. A multi-stage sampling technique was used to employ study participants. Data were collected through the interviewer-administered structured pre-tested questionnaire and entered into EpiData version 3.1 and then exported to SPSS version 23.0 for analysis. Bi-variable and multivariable logistic regression models were fitted to identify associated factors of Postoperative Trachomatous Trichiasis.</p> Results <p>Four hundred ninety two individuals participated in this study with a response rate of 97.2%. In Ambassel district, the prevalence of postoperative Trichiasis was 23.8% (95% CI = 19.9–27.8). Among associated factors of postoperative Trachomatous Trichiasis: age 50–59 (AOR = 3.34, CI = 1.38–8.1), 60–69 (AOR = 3.24, CI = 1.38–7.61), ≥70 years (AOR = 6.04, CI = 2.23–16.41), duration since surgery (AOR = 1.7, CI = 1.35–2.14), complication (AOR = 2.98, CI = 1.24–7.2), washing the face two times (AOR = 0.25, CI = 0.13–0.47), washing the face three and more times (AOR = 0.1, CI = 0.41–0.25), taking Azithromycin following surgery (AOR = 0.19, CI = 0.09–0.41), pre-operative epilation history (AOR = 2.11, CI = 1.14, 3.9) and having a knowledge about TrachomaTtrichiasis (AOR = 0.21, CI = 0.08–0.58) showed a statistical significant association.</p> Conclusions <p>The prevalence of postoperative Trichiasis in Ambassel District was higher than most Ethiopian studies. Age, frequency of face washing, medication following surgery, duration since the last surgery, knowledge about trachoma, pre-operative epilation history, and complication after surgery were identified to be independent factors. To minimize postoperative Trachomatous Trichiasis stakeholders need to consider health education for patients, provision of Azithromycin after surgery, and proper training for integrated eye care workers.</p>","author":"Abdu Tabor Yimam","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a02d850ece3d607a11d1dda4aee859771a4057e6c1bfc2647fbb6a63c1dc87f1","category":"Interdisciplinary"}