{"title":"The transgenerational consequences of paternal social isolation and predation exposure in threespined sticklebacks","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2656.14151?af=R","date":1721892240000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/64613a78-52a0-4927-8eca-9c5261eee2bf/jane14151-toc-0001-m.png\" alt=\"The transgenerational consequences of paternal social isolation and predation exposure in threespined sticklebacks\" />\n<p>This paper investigates factors underlying paternal resilience to ecological stress by examining whether conspecific social buffering mitigates adverse outcomes of paternal predation exposure for offspring. This work will strengthen our ability to predict when paternal experiences will be inherited by future generations and how organisms will cope with novel environmental change.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nParents routinely encounter stress in the ecological environment that can affect offspring development (transgenerational plasticity: TGP); however, parents' interactions with conspecifics may alter how parents respond to ecological stressors.\n\nDuring social buffering, the presence of conspecifics can reduce the response to or increase the speed of recovery from a stressor. This may have cascading effects on offspring if conspecifics can mitigate parental responses to ecological stress in ways that blunt the transmission of stress-induced transgenerational effects.\n\nHere, we simultaneously manipulated both paternal social isolation and experience with predation risk prior to fertilisation in threespined stickleback (<i>Gasterosteus aculeatus</i>). We generated offspring via in-vitro fertilisation to allow us to isolate paternal effects mediated via sperm alone (i.e. in the absence of paternal care). If social buffering mitigates TGP induced by paternal exposure to predation risk, then we expect the transgenerational effects of predation exposure to be weaker when a conspecific is present compared to when the father is isolated.\n\nOffspring of predator-exposed fathers showed reduced anxiety-like behaviour and tended to be captured faster by the predator. Fathers who were socially isolated also had offspring that were captured faster by a live predator, suggesting that paternal social isolation may have maladaptive effects on how offspring respond to ecological stressors. Despite additive effects of paternal social isolation and paternal predation risk, we found no evidence of an interaction between these paternal treatments, suggesting that the presence of a conspecific did not buffer fathers and/or offspring from the effects of predation risk.\n\nOur results suggest that socially induced stress is an important, yet underappreciated, mediator of TGP and can elicit transgenerational effects even in species that do not form permanent social groups. Future studies should therefore consider how the parental social environment can affect both within and trans-generational responses to ecological stressors.\n</p>","author":"Jennifer K. Hellmann, \nMichaela M. Rogers","siteTitle":"Wiley: Journal of Animal Ecology: Table of Contents","siteHash":"f972b3d77fac21002287eba655b32ce98ce44eaf7af59ef5bf44597986b2c27f","entryHash":"a02edd1fa53f97a52347f6dfa41597fec324b4b22e26e92854783fc2e7401e4d","category":"Environment"}