{"title":"Apple’s AI future could be a lot brighter than it seems","link":"https://www.macworld.com/article/1928362/apple-ai-siri-future.html","date":1684919700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Everyone wants to talk about AI. Most of them don’t know what it is (artificial intelligence), but they still want to talk about it. Who’s got it and who doesn’t. What industries it’s ripe to disrupt. And the one company that’s <em>not</em> in the middle of that conversation is Apple.</p>\n\n\n\n<p>Viral images generated by Stable Diffusion, and pathological chatbots from OpenAI, Microsoft, and Google are the story of the day. Apple, meanwhile, has nothing. Or perhaps, considering the current <a href=\"https://www.macworld.com/article/697273/macworld-podcast-the-state-of-siri.html\">state of Siri</a>, less than nothing.</p>\n\n\n\n<p>Apple’s nowhere when it comes to AI. That’s the narrative. The thing is, it’s not true. At least, not yet.</p>\n\n\n\n<h2>Presenting the Neural Engine</h2>\n\n\n\n<p>It’s hard to imagine that you could portray Apple as a company that’s been asleep at the AI switch when it built its first machine-learning-focused custom silicon, the Neural Engine, into the A11 chip that shipped in iPhones five years ago and has continued to upgrade it almost every year.</p>\n\n\n\n<p>If you hadn’t noticed, Apple is pretty serious when it comes to its chip designs. And for the last five years–and who knows how many years of development before that–Apple has believed so much in empowering its devices to run machine-learning algorithms that it’s designed and included special processor cores dedicated specifically to the task. Apple clearly understood the power of this technology back before most of us had even <em>heard</em> of it.</p>\n\n\n\n<p>And clearly, Apple’s been paying attention to the latest trends that have gotten the world’s attention. Last December, Apple <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://machinelearning.apple.com/research/stable-diffusion-coreml-apple-silicon&amp;xcust=1-1-1928362-1-0-0&amp;sref=https://www.macworld.com/feed\">released its own Apple Silicon optimizations</a> for the Stable Diffusion image-generation engine. That’s Apple looking at the latest trends and pointing out ways that its hardware can be better used to take advantage of them.</p>\n\n\n\n<h2>Weaving AI webs</h2>\n\n\n\n<p>A few weeks ago, Apple CEO Tim Cook used an interesting word <a href=\"https://www.macworld.com/article/1809623/apple-second-quarter-2023-earnings-iphone-services-siri.html\">when describing Apple’s approach to AI</a>: “weave.” Apple <em>weaves</em> AI algorithms into its products, he said.</p>\n\n\n\n<p>And he’s absolutely right. Apple has been dropping purpose-built machine-learning algorithms into its software since at least 2016 when it added object, face, and scene identification to the Photos app. Since then, in addition to expanding its Photos algorithms, Apple has added machine-learning techniques to biometric security identification, ECG on the Apple Watch, fall and crash detection on both the iPhone and Apple Watch, and many aspects of the creation of the perfect iPhone camera image.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"Apple Watch Series 8\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?quality=50&amp;strip=all 3024w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=1536%2C863&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=2048%2C1151&amp;quality=50&amp;strip=all 2048w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/04/IMG_1594.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption>Apple has used machine learning in its features for years.</figcaption></figure><p>Petter Ahrnstedt</p></div>\n\n\n\n<p>Unfortunately for Cook and Apple, none of those examples have ended up being the ones people have been talking about lately. But there’s no denying that it has been–carefully and tactically–<em>weaving</em> AI stuff into its products for years. As Cook said, “We’ll continue weaving [AI] in our products on a very thoughtful basis.”</p>\n\n\n\n<h2>Your chatbot lied to me</h2>\n\n\n\n<p>But thoughtful weaving is probably not going to set the world on fire. Chatbots and image algorithms, on the other hand, are flashy and tend to blow the minds of people who can’t believe computers are capable of such things. Apple is like a magician, one who prefers to keep their methodology a secret.</p>\n\n\n\n<p>Apple’s care and conservatism when releasing products have both helped and hurt it here. Maybe there’s no such thing as bad publicity, but high-profile chatbot launches are immediately followed by days or weeks of coverage of bad chatbot behavior. The image algorithms immediately came under fire over questions of copyright infringement.</p>\n\n\n\n<p>Can you imagine the firestorm that would’ve happened if Apple launched a “beta” version of Siri powered by an AI chatbot that couldn’t get facts right, tried to get a reporter to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.nytimes.com/2023/02/16/technology/bing-chatbot-microsoft-chatgpt.html&amp;xcust=1-1-1928362-1-0-0&amp;sref=https://www.macworld.com/feed\">leave his wife for it</a>, and accused a professor <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.usatoday.com/story/opinion/columnist/2023/04/03/chatgpt-misinformation-bias-flaws-ai-chatbot/11571830002/&amp;xcust=1-1-1928362-1-0-0&amp;sref=https://www.macworld.com/feed\">of sexual harassment</a>? It would be Sirigate! Apple would be rushing out crisis-management PR and promising to fix the problem.</p>\n\n\n<div><figure><img src=\"https://www.idg.se/editorial/980/path/1.721636.1564218628!imageUploader/1918886444.jpg?quality=50&amp;strip=all\" alt=\"Siri på Apple Watch\" loading=\"lazy\" /><figcaption>Siri has been surpassed by AI chatbots. It’s time Apple took risks with Siri.</figcaption></figure><p>Michael Simon/IDG</p></div>\n\n\n\n<p>This is why Apple is careful and thoughtful. It holds itself to a higher standard–and it knows the world does, too.</p>\n\n\n\n<h2>So now what?</h2>\n\n\n\n<p>All that is well and good, but the fact remains that Siri isn’t very good, and when you talk to an AI chatbot, you start to get the sense that we’re very close to a world where semi-intelligent agents will be able to carry on contextual conversations and perform basic tasks.</p>\n\n\n\n<p>Just the other day, a friend needed some help parsing a giant data file. I realized I could probably write a quick Python script to get him the output he wanted. But rather than do that, I asked ChatGPT to do it. It came up with a working script in less than a minute.</p>\n\n\n\n<p>The way I see it, Apple’s greatest risk in AI is not failing to capture the attention of the world. It’s the company’s commitment to being careful and thoughtful–because, if taken to an extreme, it might cause Apple to turn its back on promising areas of research. Sure, a chatbot mishap would be very embarrassing for Apple, but so will sticking with Siri when the world is filled with far more capable intelligent assistants.</p>\n\n\n\n<p>Or, to put it another way: Apple’s probably announcing a mixed-reality headset next month. By most accounts, the device will be very expensive and ship in extremely low quantities–but it’s a risk Apple’s willing to take because it’s playing the long game. Shouldn’t Apple be willing to do the same and take more risks with AI-powered technology if the rewards are potentially so great?</p>\n\nApple, Internet</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a02e9a51b51c9febe5f7f05560d1ec54627b099c50ee0a82de284933866b5af1","category":"Apple"}