{"title":"One‐bite‐sized 3D printed finger foods, oriented to malnutrition, sarcopenia and frailty prevention in the older people","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13463?af=R","date":1711543761000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>In this study, innovative chocolate, citrus and mixture flavoured tofu-based nutritionally customised, dysphagia-oriented, comfortably consumed, appetising, one-bite-sized finger foods, oriented to malnutrition, sarcopenia and frailty prevention in older people were created by using 3D printing technology. Developed products were characterised by evaluating chemical composition and physical properties and performing sensory evaluation among geriatric clinic residents (≥60 years).</p>\n<h2>RESULTS</h2>\n<p>The dietary composition of the developed foods was: 19–21 g (100 g)<sup>−1</sup> protein, 6–8 g (100 g)<sup>−1</sup> fibre, 8–9 g (100 g)<sup>−1</sup> fat, 11 mg (100 g)<sup>−1</sup> iron, 14 mg (100 g)<sup>−1</sup> zinc, 70 μg (100 g)<sup>−1</sup> selenium. Foods were also enriched with branched-chain amino acids, such as leucine, isoleucine and valine. All formulated foods were classified as level 6 by International Dysphagia Diet Standardisation Initiative classification. Chocolate-flavoured food was much harder (4914 g) with lower adhesiveness value (−33.6 g s), compared to the citrus- or mixture-flavoured foods. Older people evaluated all finger foods as very easy handled by hand, soft, easy to swallow, having a moderate flavour intensity and a weak afterfeel. Despite the fact that the chocolate food was evaluated as having the highest hardness and gumminess values by the instrumental method, this difference was not noticeable to the evaluators. However 7% of the participants said that 3D printed foods were sticky to dentures.</p>\n<h2>CONCLUSION</h2>\n<p>The results suggest that it is possible to create nutrient-dense comfortably consumed 3D printed foods, oriented to malnutrition, sarcopenia and frailty prevention in older people. © 2024 Society of Chemical Industry.</p>","author":"Aušrinė Kurapkienė, \nRimantė Vinauskienė, \nIna Jasutienė, \nGytė Damulevičienė, \nJurgita Knašienė, \nVita Lesauskaitė, \nClaire Sulmont‐Rossé, \nViktorija Eisinaitė, \nDaiva Leskauskaitė","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a0314c875db637b8f53bde7aab7855392bd186210ead0651808f946ce3655a7a","category":"Environment"}