{"title":"Trends of primary liver cancer incidence and mortality in the United States: A population-based study over the last four decades","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0309465","date":1725544800000,"content":"<p>by Saryia Adra, Yousef Alabrach, Anas Hashem, Amir Mahmoud, Amani Khalouf, Ahmed El-khapery, Ali Abdelhay, Mohamad Mansour, Batool Aldaher, Hiba Barqawi, Eman Abu-Gharbieh</p>\r\nBackground <p>Primary liver cancer is the third leading cause of cancer deaths worldwide and has one of the worst 5-year survival rates. This study examines US primary liver cancer incidence and incidence-based mortality trends over four decades.</p> Research design and methods <p>The SEER-9 registry was used to study primary liver cancer cases from 1978 to 2018. The incidence and mortality rates were calculated based on gender, age, race, and stage of diagnosis. Joinpoint regression software was used to calculate the annual percent change.</p> Results <p>The overall incidence rate of primary liver cancer from 1978 to 2018 increased by 2.71%/year (p&lt;0.001). Rates in patients &lt;50 years old began to fall in 2002 at a rate of -3.62%/year (p&lt;0.001). Similarly, the incidence-based mortality rates for primary liver cancer increased by 2.15%/year (p&lt;0.001). Whereas Whites incidence-based mortality rates began to plateau in 2012 (0.18%/year; p = 0.84), Blacks rates have declined since 2010 (-2.93%/year; p = 0.03), and Asian rates have declined since 1999 (-1.30%/year; p&lt;0.001).</p> Conclusion <p>While the overall primary liver cancer incidence and incidence-based mortality have been increasing over the last four decades, there was an observed decline in incidence and incidence-based mortality in recent years, especially among at-risk subgroups.</p>","author":"Saryia Adra","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a03e8bdf985095539605927b2bb56f26a56d3b21d4f01ac8536ac4299cfa86c4","category":"Interdisciplinary"}