{"title":"Apple Reveals Annual Japanese New Year Promotion With Special AirTag","link":"https://www.macrumors.com/2023/12/26/apples-japanese-new-year-promotion-2024/","date":1703617551000,"content":"In celebration of the Japanese New Year, Apple will be <a href=\"https://www.apple.com/jp/shop/gifts/new-year\">holding a promotion</a> that offers customers in Japan a free Apple gift card worth up to ¥30,000 with the purchase of an eligible Apple product from January 2 through January 5.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/12/Japanese-New-Year-Apple-2024.jpeg\" width=\"1200\" height=\"630\" />\r<br />\nGift card values range from ¥4,000 for products like the iPhone SE and third-generation AirPods to ¥30,000 for the 15-inch MacBook Air.\r<br />\n\r<br />\nIn addition to a gift card, the first 50,000 customers in Japan who purchase a new iPhone 14, iPhone 14 Plus, iPhone 13, or third-generation iPhone SE from Apple during the promotion will receive a limited-edition AirTag with a \"Year of the Dragon\" engraving.\r<br />\n\r<br />\nApple has shared <a href=\"https://www.apple.com/jp/shop/gifts/new-year/terms-conditions\">terms and conditions</a> for the promotion with additional details. Notably, iPhone orders placed through the Apple Store app will not qualify for a limited-edition AirTag, so make sure to complete your purchase on Apple's website or at a physical Apple Store in Japan if you are interested in receiving one.\r<br />\n\r<br />\nApple holds a Japanese New Year promotion on an annual basis, and this is the third consecutive year it has offered a special AirTag.<div>Tag: <a href=\"https://www.macrumors.com/roundup/airtag/\">AirTag</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/26/apples-japanese-new-year-promotion-2024/\">Apple Reveals Annual Japanese New Year Promotion With Special AirTag</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/apple-reveals-annual-japanese-new-year-promotion-with-special-airtag.2414723/\">Discuss this article</a> in our forums<br /><br />","author":"Joe Rossignol","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a04fa7cb85fb3bb14fa6dfe2cef13ebc29ac21758668cf17803cdf511ce1767b","category":"Apple"}