{"title":"E3 ligase SlCOP1-1 stabilizes transcription factor SlOpaque2 and enhances fruit resistance to Botrytis cinerea in tomato","link":"https://academic.oup.com/plphys/article/196/2/1196/7723791?rss=1","date":1722297600000,"content":"<span><div>Abstract</div>CONSTITUTIVE PHOTOMORPHOGENIC 1 (COP1), a pivotal repressor in plant photomorphogenesis, has been extensively studied in various plant processes. However, the specific roles of COP1 in fruit remain poorly understood. Here, we functionally characterized SlCOP1-1 (also known as LeCOP1), an Arabidopsis (<span>Arabidopsis thaliana</span>) COP1 ortholog, in tomato (<span>Solanum lycopersicum</span>) fruit ripening and disease resistance. Despite the clear upregulation of <span>SlCOP1-1</span> during fruit ripening, knockout or overexpression (OE) of <span>SlCOP1-1</span> in tomatoes only minimally affected ripening. Intriguingly, these genetic manipulations substantially altered fruit resistance to the fungal pathogen <span>Botrytis cinerea</span>. Proteomic analysis revealed differential accumulation of proteins associated with fruit disease resistance upon <span>SlCOP1-1</span> knockout or OE. To unravel the mechanism of SlCOP1-1 in disease resistance, we conducted a screen for SlCOP1-1-interacting proteins and identified the stress-related bZIP transcription factor SlOpaque2. We provide evidence that SlOpaque2 functions in tomato resistance to <span>B. cinerea</span>, and SlCOP1-1-mediated mono-ubiquitination and stabilization of SlOpaque2 contributes to fruit resistance against <span>B. cinerea</span>. Our findings uncover a regulatory role of COP1 in controlling fruit disease resistance, enriching our understanding of the regulatory network orchestrating fruit responses to disease.</span>","author":"","siteTitle":"Plant Physiology Current Issue","siteHash":"ae0dd91e0e34bd11f0967b3d022711a41fe204ab105b0105eff3839f731c5b5d","entryHash":"a04f882e03da3a49431c34ca4a4b8ca3a108b596066ddd855e7d3c7eccb490f0","category":"Environment"}