{"title":"Horse for the Course: Gravel or MTB for the 613km Torino-Nice Rally?","link":"https://www.bikeradar.com/features/routes-and-rides/horse-for-the-course-torino-nice-rally/","date":1637488858000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/horse-0e28261.jpeg?quality=45&amp;resize=620,413\" />                                            <p>When faced with the prospect of riding the first-ever Women’s Torino-Nice Rally, my mind quickly turned to my equipment. What would provide the combination of comfort and capability required for a bikepacking ride covering more than 600km over road cols and military gravel roads in the high Alps?</p>\n<p>Drop-bar or flat-bar? Rigid frame or suspension? Gravel bike or mountain bike? The Torino-Nice Rally is a ride like no other, but what was the best tool for the job?</p>\n<h2>Introducing the first Women’s Torino-Nice Rally</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> While 21 of us started in Turin, a few more joined along the way to boost the crew to 28 riders.</span></figcaption><span> <i>Tristan Bogaard</i></span></div>\n<p>If you haven’t heard of the Torino-Nice Rally before, then you’re in for a real treat (as was I). Several friends had completed the course in previous years and touted it as the best <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking-routes/\">bikepacking route</a> they’d ever ridden. They were not wrong.</p>\n<p>The event was established in 2015 by James Olsen with an aim of exploring parts of the Alps often missed by riders, linking dirt tracks and high cols to valleys and towns for resupply points.</p>\n<p>It also runs in support of the Smart Shelter Foundation: a charity that creates building manuals and constructs earthquake-resistant buildings such as schools, homes and hostels in high-risk areas such as Nepal.</p>\n<p>Although you can take on the route at any time (outside of winter), the Rally itself is an annual event held in early September. Komoot came on board as a title sponsor of the annual event in 2021, with revised route options due to the devastation caused in and around the Roya Valley in October 2020 by Storm Alex.</p>\n<p>Riders can enter the ballot by sending founder Olsen a postcard (cute), while women are automatically guaranteed a place in an initiative designed to increase participation. Bravo, TNR team.</p>\n<p>This year, the first Women’s Torino-Nice Rally came about in a fabulously spontaneous last-minute fashion when ultra-endurance frontwoman Lael Wilcox put the idea of a mass women’s start to Gaby Thompson, Komoot’s global community manager.</p>\n<p>The rest is history. Fast forward just a matter of weeks and there were some 28 women aged 22 to 54 gathered in the mountains, having travelled from across Europe and North America to tackle the ride together.</p>\n<section><div>\n        <h3>Katherine’s Komoot Women’s Torino-Nice Rally</h3>\n<p><strong>The horse</strong>: The new Juliana Wilder, a 120/115mm downcountry full-suspension mountain bike, with a few modifications for the Torino-Nice Rally, including more durable, fast-rolling tyres, a standard seatpost in place of a dropper, and ergonomic grips with integrated bar ends. All loaded up with bikepacking bags, of course.</p>\n<p><strong>The course</strong>: The Torino-Nice Rally: more than 600 kilometres from Turin in Italy to the south coast of France at Nice, including both road cols and high-altitude gravel military roads. There are 10 major cols along the way, topping out with the 2,744-metre Col Agnel on the French/Italian border.</p>\n<p><strong>The goal</strong>: Survival? To ride the full route within eight days, as part of the Komoot Women’s edition alongside 28 badass women from across the globe, including instigator Lael Wilcox and her wife Rue, Emily Chappell and countless other inspiring endurance riders and racers.</p>\n<p>\n\n    </p></div>\n    </section><h3>620km, 10 cols and some of Europe’s best high-Alpine riding</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> The spectacular climb of the Col Agnel in autumn featured a sprinkling of snow.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>The Torino-Nice Rally typically provides a choice of route options but, for the purposes of this ride and to keep everyone on the same trail, a single route was chosen, avoiding the very highest Alpine passes in case of early-season snowfall.</p>\n<p>Still, this course posed some 620km (385 miles) of riding, with 15,800m (51,837ft) of climbing over no fewer than 10 cols, including the paved Col d’Izoard, Col Agnel and Col de Turini, as well as the off-road Colle del Colombardo, Colle delle Finestre, Gardetta Pass and Colle di Tenda.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Torino-Nice Rally zig-zags over the French/Italian border several times, most notably here at the Col Agnel.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>We’d planned to ride it in just over a week, with a finishers’ party of sorts held at The Service Course in Nice on the afternoon of the eighth day.</p>\n<p>Zig-zagging over the French/Italian border, the Torino-Nice Rally also takes in some of the most spectacular high Alpine military and gravel balcony roads, including the Strada dell’Assietta, Strada dei Cannoni and astoundingly beautiful ‘Little Peru’.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The rough and rugged Strada Cannoni is an incredible reward at the top of the Colle di Sempeyre.</span></figcaption><span> <i>Katherine Moore</i></span></div>\n<p>Intended as a self-supported <a href=\"https://www.bikeradar.com/features/routes-and-rides/heres-what-you-need-for-a-bikepacking-adventure/\">bikepacking</a> challenge, the ethos of the Torino-Nice Rally is a refreshingly human one: “(Don’t) get hung up on purity of style, unwritten rules of self-supported racing or any other stuff like that. If offered a 3-course meal sharing a 3-litre bottle of red, you’d take it, right?”</p>\n<p></p>\n<h2>The rig – Juliana’s Wilder downcountry MTB</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Wilder has been a trusty steed on the trails, but could it also be the best choice for a week in the mountains?</span></figcaption><span></span></div>\n<p>Having <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/full-suspension-mountain-bikes/juliana-wilder-cc-x01-axs-tr-reserve-review/\">recently tested the new Juliana Wilder for BikeRadar</a>, it was my first thought when I heard about the Komoot Women’s Torino-Nice Rally.</p>\n<p>I’d ridden the 330-kilometre Catalunya Trail in the Pyrenees a few years before and learnt the importance of bike choice the hard way: while we turned up on <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-bikes/\">gravel bikes</a> loaded to the hilt with camping gear, the locals were all on lightweight <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cross-country-bikes/\">XC bikes</a> with minimal kit, planning to overnight in the mountain refuges.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Wilder in downcountry dress…</span></figcaption><span> <i>Immediate Media</i></span></div>\n<p>I wasn’t going to be caught under-geared in the mountains again, and the 10 to 50-tooth <a href=\"https://bikeradar.production.wcp.imdserve.com/features/sram-eagle-how-the-revolutionary-groupset-has-evolved-in-six-years/\">SRAM Eagle</a> cassette of the Wilder was too good to resist. But would this hugely-capable <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-downcountry-mountain-bikes/\">downcountry bike</a> – designed as a trail/XC bike capable of hauling riders back up the hill, not for 600km through the Alps – really be suitable for the long haul? With a few adaptations, I was about to find out.</p>\n<p>You might also be wondering about the suspension; surely that would make pedalling long distances really inefficient? Thankfully, both the <a href=\"https://www.bikeradar.com/news/2022-fox-34-fork/\">FOX 34</a> Step Cast Factory fork and<a href=\"https://www.bikeradar.com/reviews/components/rear-shocks/fox-racing-shox-float-dps-evol-factory-shock-review/\"> FOX Float Factory DPS</a> shock feature three modes: open, medium and firm. In the firm mode, the XC bike is surprisingly rigid.</p>\n<h2>Bikepacking mods</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> …and in bikepacking mode at the top of the Colle di Tenda.</span></figcaption><span> <i>Katherine Moore</i></span></div>\n<p>I’ll admit to being a little apprehensive about bikepacking on the Wilder, as bar a casual three-day trip around Dartmoor, I’d never ridden a long-distance tour on a mountain bike. I set about researching how this incredibly fun trail rig could be adapted into something a little more endurance-focused.</p>\n<h3>Durable, fast-rolling rubber</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Teravail’s Rutland tyres in a 2.2in width replaced the racier Maxxis Rekon stock rubber.</span></figcaption><span> <i>Katherine Moore</i></span></div>\n<p>First up were the tyres. Although I hadn’t had any troubles with the stock Maxxis Rekon Race (a semi-slick XC race tyre) during testing, bar switching out for a more mud-friendly front tyre, the word ‘race’ didn’t fill me with confidence for a week of rugged, remote riding.</p>\n<p>I turned to Teravail for a recommendation, as I’ve previously been impressed with the durability of its tyres and the brand has gained a decent reputation in the bikepacking world. Teravail offers a wide selection of size options too, meaning I had the choice of the 2.2in Sparwood or Rutland <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-gravel-tyres/\">gravel tyres</a> for the Wilder’s Reserve 29er wheelset.</p>\n<p>The slightly chunkier tread of the Rutland tyres took my fancy in the end, of course opting for the durable casing option. A few more grams might cost you time on longer alpine climbs, but I’d much rather that than spend 15 minutes trailside in the middle of nowhere fixing a flat.</p>\n<h3>Hand positions, hand positions…</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> They’re not the most attractive option, but ergonomic grips with integrated bar-ends can make a huge difference.</span></figcaption><span> <i>Katherine Moore</i></span></div>\n<p>From a comfort perspective, my main concern was how my hands, wrists and upper body would fare with the straight bar position. Compared to drops, there are fewer options for changing up your hand positioning, so I went in search of bar ends to mix it up a bit on the longer climbs.</p>\n<p>The very cosy ESI foam grips were switched out for the much less appetising Ergon GP3 ergonomic grips, with a flared palm area and integrated three-finger bar end. I couldn’t say that they look good (sorry, Ergon) but I really hoped they’d do the job when it came to staying comfortable over eight long days in the saddle.</p>\n<h3>Making space for luggage</h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> I ditched the dropper in favour of a standard seatpost.</span></figcaption><span> <i>Katherine Moore</i></span></div>\n<p>The final adjustment I made to the Wilder was to remove the <a href=\"https://www.bikeradar.com/reviews/components/seatposts/rockshox-reverb-stealth-c1-dropper-with-1x-remote-review/\">RockShox Reverb Stealth dropper post</a>, replacing it with a Thomson standard seatpost that I handily had going spare.</p>\n<p>I didn’t anticipate needing to use a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-dropper-posts/\">dropper post</a> much, as the terrain promised to be less technical than my normal MTB riding, plus I didn’t want to cause any damage to it by strapping my 16.5L seat pack to it. As an added bonus, this switch would also save a few grams.</p>\n<section><div>\n        <h3>Katherine’s bikepacking kit list</h3>\n<p>Curious to see what I needed for eight days in the high mountains? Here’s how I loaded my <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a> with overnight gear, kit and spares. I was preparing for hotter days and potential overnight temperatures down to zero degrees Celsius, although camping in the valleys and good weather meant it was never too cold.</p>\n<p><strong>Ortlieb 15L handlebar pack</strong></p>\n<ul><li>Outdoor Research Helium hooped bivvy, pole and peg</li>\n<li>Alpkit SkyeHigh 500 hydrophobic down sleeping bag</li>\n<li>Rab silk sleeping bag liner</li>\n<li>Thermarest NeoAir XLite inflatable mat</li>\n<li>Fohn down jacket</li>\n<li>Velocio TRAIL Anorak waterproof jacket</li>\n<li>Survival blanket</li>\n<li>Lightweight Birkenstock Arizona EVA sandals strapped on front</li>\n</ul><p><strong>Ortlieb 16.5L seat pack </strong></p>\n<ul><li>Bamboo leggings</li>\n<li>Spare socks, pair of bamboo pants</li>\n<li>Decathlon Quechua MH500 lightweight hiking trousers</li>\n<li>7mesh Farside baggy shorts</li>\n<li>Spare Velocio LUXE bib shorts</li>\n<li>Casual T-shirt</li>\n<li>Velocio Micromodal long sleeve</li>\n<li>5-panel hat</li>\n<li>Toiletries pouch\n<ul><li>Mini toothbrush/toothpaste</li>\n<li>Emergency chamois cream in a 15ml lip balm container</li>\n<li>Personal medication</li>\n<li>Mini SPF50 sunscreen and SPF30 lip balm stick</li>\n</ul></li>\n<li>Electronics/spares pouch\n<ul><li>SRAM AXS battery charger and cable</li>\n<li>Exposure light charging cable</li>\n<li>EU plug with multiple USB ports</li>\n<li>Mini USB cable for Wahoo and camera charging</li>\n<li>USB-C charging cable for phone</li>\n<li>Anker battery pack</li>\n<li>2 sets of spare SRAM brake pads</li>\n<li>Spare universal SRAM mech hanger</li>\n<li>12-speed quick link</li>\n<li>Squirt lube 15ml bottle</li>\n</ul></li>\n<li>MSR Pocket Rocket stove with gas canister, lighter and mini sponge inside</li>\n<li>Hydrapak Seeker 2L collapsible water bladder with Katadyn water purification nozzle</li>\n<li>Emergency Some Thing Good dehydrated meal</li>\n<li>Safety pizza</li>\n</ul><p><strong>Hip pack</strong></p>\n<ul><li>High-volume Topeak hand pump</li>\n<li>Pedro tyre lever</li>\n<li>Tubeless repair pouch</li>\n<li>Toothpaste tube tyre boot</li>\n<li>Muc-Off tubeless plug inserter and thick/thin plugs</li>\n<li>Park Tool pre-glued patch kit</li>\n<li>Cash/passport pouch</li>\n<li>Exposure Diablo helmet light and mount, Lezyne rear light</li>\n<li>TheTentLab Ultralight trowel</li>\n<li>Opinel knife, titanium spork</li>\n<li>Pen and small notebook</li>\n<li>Velocio TRAIL Ultralight Jacket</li>\n</ul><p><strong>Snack pouches</strong></p>\n<ul><li>Sony Alpha A6000 camera</li>\n<li>Phone</li>\n<li>Snacks: Outdoor Provisions bars, nut butters and local delicacies from the road</li>\n</ul><p><strong>Other</strong></p>\n<ul><li>29er tube strapped to the frame</li>\n<li>2x 650ml water bottles</li>\n<li>Spare Voile strap</li>\n</ul><p>\n\n    </p></div>\n    </section><h2>Taking to the mountains</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Wilder rigged up with kit and ready to go.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>There was a lot of nervous energy in that Italian piazza for 8am on a Friday morning. If you looked at the palmares of the riders assembled, you’d be surprised to hear that. The North Cape 4000, Silk Road Mountain Race, French Divide, the Transcontinental – some of the toughest bikepacking races in the world had been completed by these women. I was lining up alongside a real bunch of hitters.</p>\n<p>After the long, flat ride out of Turin to the mountains, the first climb was upon us, and it was one we’d been forewarned would be the toughest of them all.</p>\n<p>The 1,888m Colle de Colombardo ramped up sharply on tarmac at first, twisting and turning through the trees with gradients regularly over 18%, before degrading into a wide but rough gravel doubletrack at a farmstead. The midday heat was already taking its toll, and with the climb opening up with less and less shade, it couldn’t have been more of a contrast to the last couple of years of riding confined to the UK.</p>\n<p>On fresh legs, the Colombardo wasn’t as bad as feared, especially thanks to the wide gearing with the 32-50t bottom gear. While other riders were forced to walk, I was able to keep spinning my way up, although I soon learnt that taking a short hike every now and then was good to change it up a bit, and relieve myself of the saddle.</p>\n<p>Getting started after each pause took some getting used to, though: with the standard seatpost and high bottom bracket, I had to really hoist myself up onto the saddle. Especially tricky when starting out again on a climb!</p>\n<h2>The col cycle</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-25-09-2021-13-08-48-71daedf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Reaching the Colle dell’Assietta after climbing through endless mist with Charlotte Inman.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-18-10-2013-23-54-19-71daedf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Traversing the gravel tracks atop the Colle di Tende with Emily and Sara.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-16-10-2013-21-58-35-609dc32.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Refuelling at the summit of Col Agnel before a chilly descent into Italy.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-25-09-2021-13-05-14-71daedf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The long Strada Assietta climb out of the mist after the Finestre.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nIt took a few days to get into the rhythm of the ride. My routine? Up early, a quick munch of whatever was to hand for breakfast and out onto the road, hitting the first slope of the day with a half-an-hour or so head start before the others caught up. I could say that the burly wider tyres slowed me down on the tarmac climbs, but in reality it was fitness. In a year when I’d mostly focused on learning new MTB skills rather than pedalling, that came as no surprise.\n<p>Higher up, where the road often turned to gravel, that’s when the Wilder really came into its own. I’d click the fork onto the medium suspension mode, and sometimes the rear shock too for rougher ground.</p>\n<p>There was just one problem there, though: my first-generation Ortlieb seat pack had a bit of ‘bag sag’, so would need hoisting up and tightening before those rougher sections. I spotted an Ortlieb aftermarket fixing strap on Sara’s bike that would be ideal; I’ll invest in one of those before next time.</p>\n<h2>The highs and lows in between</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/DSC09181-be44ca1.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>‘Little Peru’ did not disappoint.</span>\n    </figcaption><span>\n                    <i>Katherine Moore</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/cows-d9915aa.jpeg?quality=90&amp;resize=0%2C0\" /></div>    <figcaption><div>\n    <figcaption><span>Saying hello to the locals, in this case Piedmontese cows, in Little Peru.</span>\n    </figcaption><span>\n                    <i>Gaëlle Bojko</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-20-10-2013-04-59-57-71daedf-1.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Getting together on the last night in the Maritime Alps for a communal camp before descending into Nice.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nA handful of vivid memories stick in my mind from the Torino-Nice Rally.\n<p>Winching my way up the never-ending gravel of the Colle delle Finestre in gloomy, atmospheric mist while drops of sweat fell down onto my knees as if I was on a turbo trainer.</p>\n<p>The fear I felt while descending from Montgenèvre in a thunderstorm, rain stinging at my face and lightning flashing across the sky in a pale pink. Checking into a hotel in Briançon to wait it out overnight – just hours before the sun came out.</p>\n<p>Spontaneously deciding it was time to hit the Col d’Izoard after all, with just two hours to ride the 20-kilometre climb before sunset, and reaching this unique, desolate and moon-like rocky pass with the last golden light of day hitting the peaks.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> There was a special kind of magic to riding with this many women that’s hard to describe.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>Summiting the drop-dead gorgeous Col Agnel, the high point of the route at 2,744m and straddling the Italy/France border, after marmot-spotting on the way up, all of us layering up with puffa jackets and trousers, and tucking into baguettes before the spectacular descent.</p>\n<p>A night camping in a terraced olive grove where a sneaky mouse stole one of Nic’s AirPods and hid it in a dry-stone wall (yes, really).</p>\n<p>The most divine high-altitude gravel of the Strada dell’Assietta, climbing through the mist on a 17th century military road to reveal jaw-dropping views of the peaks above and valleys below, and the wild and wonderful Little Peru, a 16km stretch of gravel dotted with Piedmontese cows and watched over by dozens of kestrels.</p>\n<p></p>\n<h2>Dreamy descents</h2>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/Photo-25-09-2021-15-52-44-71daedf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The most incredible descent from the Strada Assietta to Sestriere on wide and fast-flowing Alpine gravel tracks.</span>\n    </figcaption><span>\n                    <i>Bicycle Factory</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/11/PXL_20210928_121401220-71daedf.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>Although staggeringly peaceful here, relics of the mountains’ military past, such as these barracks at Caserme della Bandia, are a haunting reminder of conflicts past.</span>\n    </figcaption><span>\n                    <i>Katherine Moore</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nThe off-road descents were a real blast: head down, elbows cocked, heels dropped and flying down the mountainside. The wide Rutlands ate it up a treat: even over the really rough (and utterly delicious) Strada Cannoni, which almost everyone hated apart from Charlotte, on her chunky <a href=\"https://www.bikeradar.com/reviews/bikes/mountain-bikes/surly-karate-monkey-ops-review/\">Surly Karate Monkey</a>, and I. The tyres held up perfectly, without a hitch all trip.\n<p>My body was beginning to adapt to the effort, too. After some lower-back pain on day one, probably from the sheer gradient of the Colombardo, I was now surprisingly comfortable on the bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Spectacular gravel descents like this section of the Strada Assietta are what make the long Alpine climbs worthwhile.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>The Ergon GP3 grips were certainly helping here, as I could easily switch up between the grips and ends on the longer climbs. I was reluctant to tell anyone about the knee pain though, as if that would really confirm and accentuate its existence. After so long not indulging in this kind of riding, there were bound to be some niggles.</p>\n<h2>Weighing it up</h2>\n<p>I got dropped on Col d’Èze, the final uphill before descending to Nice. It wasn’t surprising, after eight days my body was rinsed of energy, and a stinking cold had crept in when I was at my most vulnerable.</p>\n<p>Around the corner, Lael and Rue had held up waiting: I just couldn’t match the speed of the more aerodynamic, slicker-tyred gravel riders on the tarmac, and the pace had steadily inched up as we rolled closer to the salty sea air.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Most of the riders, including Lael, had chosen a drop-bar gravel bike for the TNR.</span></figcaption><span> <i>Bicycle Factory</i></span></div>\n<p>Ultimately, however, I was happy with my choice of the Wilder over the last 600 kilometres or so. It comes down to what you enjoy: if you want to race up the paved cols, something rigid and slicker-tyred would have the advantage here. If you want to razz it down the gravel descents, an MTB might be best. For me, I knew just getting up the mountain passes would be the hardest part, so mega-low gearing was at the top of the priority list. Brilliant capability on the rougher stuff just came as an added bonus.</p>\n<p>For me, the absolute ideal bike for the Torino-Nice Rally would be some mega-geared drop-bar bike with 2in tyres, but alas there’s not one of those in my garage. In fact, most groupset manufacturers seem to be pretty slow in cottoning on that we’d love really wide gearing for drop-bar bikepacking to contend with both the mountains and the luggage. <a href=\"https://www.bikeradar.com/advice/buyers-guides/gravel-bike-setup/\">Gravel bike gearing</a> still leans towards sportier riding, rather than heavily-laden, multi-day epics.</p>\n<p>Anyway, route founder James Olsen says “It’s not about the bike”, and I’d have to agree: no one bike will be perfect for the whole route. That’s part of its charm and there’s so much more along the way to appreciate. Of course, good kit helps, but at the Torino-Nice Rally, the bike is just the facilitator for enjoying some of Europe’s best high-mountain riding.</p>","author":"Katherine Moore","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a0540acf7f32b7b4738716f9dd83dc83a6ebef0f516f1f35923e9d3f3f4a0a0b","category":"Cycling"}