{"title":"DeepMind เผยแพร่งานวิจัย ระบบ AI สำหรับหุ่นยนต์ ที่พัฒนาความสามารถได้เอง","link":"https://www.blognone.com/node/134529","date":1687685380000,"content":"<div><div><div><p>DeepMind เผยแพร่งานวิจัยระบบ AI ที่สามารถพัฒนาได้ด้วยตัวเองสำหรับหุ่นยนต์ มีชื่อเรียกว่า RoboCat โดยสามารถทำงานได้หลากหลาย รองรับหุ่นยนต์ที่มีกลไกแขนแตกต่างกัน รวมทั้งสามารถสร้างชุดข้อมูลใหม่เพื่อเรียนรู้ได้เองอีกด้วย</p>\n<p>งานวิจัยที่ผ่านมา DeepMind ได้พัฒนาให้หุ่นยนต์สามารถทำงานได้หลากหลาย และอีกงานวิจัยก็ให้หุ่นยนต์ผู้ช่วยเรียนรู้จากข้อมูลในสภาพจริง (Real-world) ซึ่ง RoboCat ได้ปรับปรุงให้เป็นระบบที่ทำงานได้หลากหลาย แต่รองรับหุ่นยนต์แต่ละแบบที่แตกต่างกันด้วย จากการเรียนรู้ผ่านสภาพจริง</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/230c980d304040bb48960ac1722d9b55.png\" /></p>\n<p>โมเดลที่ RoboCat ใช้เป็นโมเดลข้อมูลหลายชนิดทั้งตัวหนังสือ รูปภาพ แอคชัน ชื่อ Gato ที่เป็นภาษาสเปนแปลว่าแมว การเรียนรู้เริ่มจากใช้ตัวอย่าง 100-1,000 ต้นแบบ ของแขนหุ่นยนต์ที่ใช้คนควบคุม จากนั้นปรับแต่ง RoboCat ให้เรียนรู้งานตัวใหม่ ซึ่งจะสร้างระบบแยกออกมา ตัวระบบใหม่ก็จะเรียนรู้ด้วยตัวเองและสร้างชุดข้อมูลซ้ำ เฉลี่ยประมาณ 10,000 ครั้ง ทำให้ได้ RoboCat ใหม่สำหรับงานใหม่ รองรับหุ่นยนต์ที่แตกต่างไปได้</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/6926c9d13874fe232de1da8e4e48b7b2.png\" /></p>\n<p>ข้อมูลที่ใช้เทรนใน RoboCat ทั้งหมดมาจากทั้งข้อมูลในสภาพจริง ข้อมูลที่สร้างขึ้นมา (Simulated) และข้อมูลที่ RoboCat สร้างเองจากเรียนรู้</p>\n<p>ตัวอย่างที่ DeepMind สาธิต คือข้อมูลตั้งต้นมาจากหุ่นยนต์แบบมือจับ 2 นิ้ว เมื่อเทรนข้อมูลก็ได้ระบบที่สามารถนำไปทำงานที่ซับซ้อนขึ้นได้ โดยทดลองใช้กับหุ่นยนต์มือจับ 3 นิ้ว เป็นต้น ได้ความถูกต้องที่ระดับ 86% ขณะเดียวกัน DeepMind ก็พบว่าเมื่อมีงานประเภท RoboCat จำเป็นต้องได้เรียนรู้และเทรนด้วยข้อมูลที่มากพอระดับหนึ่งเช่นกัน ตัวอย่าง เมื่อให้ทำงานทันที อัตราสำเร็จอยู่ที่ 36% แต่เมื่อให้เทรนซ้ำ 500 ครั้ง อัตราสำเร็จก็เพิ่มเป็น 74% คล้ายกับคนที่แม่นยำและเก่งขึ้น เมื่อได้ฝึกฝนมากพอในงานทักษะใหม่</p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/3ee0832a4d383d1ad849eb803364099b.gif\" /></p>\n<p>ที่มา: <a href=\"https://www.deepmind.com/blog/robocat-a-self-improving-robotic-agent\">DeepMind</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/deepmind\">DeepMind</a></div><div><a href=\"/topics/robotics\">Robotics</a></div><div><a href=\"/topics/artificial-intelligence\">Artificial Intelligence</a></div></div></div>","author":"arjin","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a058e8f47c705ff5b553de074f0a716052a43423170d6aac025ad969d3d100a6","category":"Thai"}