{"title":"More than just geosmin and 2‐methylisoborneol? Off‐flavours associated with recirculating aquaculture systems","link":"https://onlinelibrary.wiley.com/doi/10.1111/raq.12949?af=R","date":1720069451000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/95f4eb70-07a9-4b05-b290-46b3dcc78383/raq12949-toc-0001-m.png\" alt=\"More than just geosmin and 2-methylisoborneol? Off-flavours associated with recirculating aquaculture systems\" />\n<p>High flavour quality remains a significant challenge for many species produced in recirculating aquaculture systems (RAS). Endogenous off-odours and exogenous off-odours from feeds and microbes encapsulate the great diversity of chemical compounds reported to drive off-flavour in RAS-reared fish species.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The consumption of seafood is driven by flavour, yet achieving its high quality remains a challenge for many species reared in recirculating aquaculture systems (RAS). A comprehensive knowledge of off-odour sources in aquatic foods is indispensable in ensuring flavour quality standards. At the beginning of the production chain, early post-harvest lipid oxidation products develop into endogenous off-odours and accumulate over time. These malodours add to those already absorbed exogenously, namely from the water and feeds, although the information on the interactions between these sources is currently scarce. Despite geosmin and 2-methylisoborneol receiving significant attention in relation to fish off-flavour, only limited knowledge on the molecular and ecological mechanisms driving their production in aquatic environments has been reported. Moreover, RAS-hosted bacteria have been associated with a wide range of other odour-active compounds, such as pyrazines, terpenoids, and other degradation byproducts that are frequently overlooked when studying flavour taint in fish. The influence of aquaculture feeds on the flavour of fish flesh has been underestimated, too, both as a source of off-odours but also as a novel modulator strategy to achieve desirable aquatic food flavours. Finally, the influence of water treatment processes widely used in RAS operations, such as advance oxidation process, ozone, ultraviolet and hydrogen peroxide disinfections, is greatly underexplored with respect to odour quality. This article reviews the current scientific evidence with supporting data on the chemical diversity of off-odours found in aquaculture fish worldwide and their potential sources and highlights knowledge gaps that should be addressed in future research.</p>","author":"Pedro Martínez Noguera, \nMatteo Egiddi, \nJulia Södergren, \nMariana Rodrigues da Silva, \nJonathan Beauchamp, \nMikael Agerlin Petersen, \nAndrea Buettner, \nNiels O. G. Jørgensen","siteTitle":"Wiley: Reviews in Aquaculture: Table of Contents","siteHash":"e603512385355dc11b8c11c7000aba80fad3ae9faea7a2537d8e3609c19b97a1","entryHash":"a05a1027fc95b079ddae0c5761e7a6d395ec5f7f4b865b341def41e5a7872705","category":"Environment"}