{"title":"Patterns of methylation and transcriptional plasticity during thermal acclimation in a reef‐building coral","link":"https://onlinelibrary.wiley.com/doi/10.1111/eva.13757?af=R","date":1721199600000,"content":"<h2>Abstract</h2>\n<p>Phenotypic plasticity can buffer organisms against short-term environmental fluctuations. For example, previous exposure to increased temperatures can increase thermal tolerance in many species. Prior studies have found that acclimation to higher temperature can influence the magnitude of transcriptional response to subsequent acute thermal stress (hereafter, “transcriptional response modulation”). However, mechanisms mediating this gene expression response and, ultimately, phenotypic plasticity remain largely unknown. Epigenetic modifications are good candidates for modulating transcriptional response, as they broadly correlate with gene expression. Here, we investigate changes in DNA methylation as a possible mechanism controlling shifts in gene expression plasticity and thermal acclimation in the reef-building coral <i>Acropora nana</i>. We find that gene expression response to acute stress is altered in corals acclimated to different temperatures, with many genes exhibiting a dampened response to heat stress in corals pre-conditioned to higher temperatures. At the same time, we observe shifts in methylation during both acclimation (11 days) and acute heat stress (24 h). We observed that the acute heat stress results in shifts in gene-level methylation and elicits an acute transcriptional response in distinct gene sets. Further, acclimation-induced shifts in gene expression plasticity and differential methylation also largely occur in separate sets of genes. Counter to our initial hypothesis no overall correlation between the magnitude of differential methylation and the change in gene expression plasticity. We do find a small but statistically significant overlap in genes exhibiting both dampened expression response and shifts in methylation (14 genes), which could be candidates for further inquiry. Overall, our results suggest transcriptional response modulation occurs independently from methylation changes induced by thermal acclimation.</p>","author":"Leslie Guerrero, \nRachael Bay","siteTitle":"Wiley: Evolutionary Applications: Table of Contents","siteHash":"df2df3df25f90ba55fdf535f13dd2e89e7355c6f34118f20800f9e7201897f76","entryHash":"a05c1bb3b351b446296b0ccfcecd9f3050084ac92337ccfb9d41329849a441ab","category":"Environment"}