{"title":"A comprehensive analysis of photovoltaic panel integrated thermoelectric cooling system for enhanced power generation","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400100?af=R","date":1724308486000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/320d5d9b-e586-4128-8c25-7419e722cad4/appl202400100-gra-0001-m.png\" alt=\"A comprehensive analysis of photovoltaic panel integrated thermoelectric cooling system for enhanced power generation\" /><p>Photovoltaic (PV)-integrated thermoelectric cooling system analysis for enhancing solar power generation. In this study, PV-thermoelectric cooling system modeling and its experimental validation, is conducted under real outdoor conditions. The technology is found to be superior to other technologies due to its efficient controllability and can be utilized for enhancing efficiency, performance, and energy storage capabilities of PV modules worldwide.\n</p>\n<br />\n<h2>Abstract</h2>\n<p>The integrated photovoltaic-thermoelectric cooling systems (PV-TECS) can be used to enhance the performance and life expectancy of commercial PV power plants for sustainable power generation. The objective of the study is to assess the efficacy of PV-TECS to address these concerns. In this study, computational fluid dynamics/finite element method analysis and experimental investigation of photovoltaic micro-modules (PVMM-2) with a thermoelectric cooling system and a reference system without it (PVMM-1), is carried out under real outdoor conditions. The logged data and infrared thermal imaging analysis results show that thermoelectric cooling is very effective in maintaining a consistent PV back temperature difference of 18.24°C between PVMM-2 and the reference system, even reaching subzero temperature when the reference module operates close to 60°C. The simulated results are found to be in close agreement with the experimental results (<i>R</i>\n<sup>2</sup> values of 0.83 and 0.94) which allows accurate prediction of system performance under actual solar loading conditions. Further analysis shows that PV-TECS can be effectively used in photovoltaic power plants for efficiency enhancement with a gain in the range of 1%–22% for a monocrystalline PV module depending on location and type of integration. The study is of interest for further research to develop industrial applications.</p>","author":"Rahul Chandel, \nShyam Singh Chandel, \nDeo Prasad, \nRam Prakash Dwivedi","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"a06244abe9e6e4079f0afee1d42552becc04e453d20c8f1ff7c7fcf8134764b4","category":"Environment"}