{"title":"Needs-Assessment for an Artificial Intelligence-based Chatbot for Pharmacists in HIV Care: Results from a Knowledge-Attitudes-Practices Survey","link":"https://www.preprints.org/manuscript/202408.1153/v1","date":1723771659000,"content":"Background: Pharmacists need up-to-date knowledge and decision-making support in HIV care. We aim to develop MARVIN-Pharma, an adapted artificial intelligence-based chatbot initially for people with HIV, to assist pharmacists, considering evidence-based needs.\nMethods: From Dec 2022 to Dec 2023, an online needs-assessment survey evaluated Québec pharmacists' knowledge, attitudes, involvement, and barriers relative to HIV care, alongside perceptions relevant to the usability of MARVIN-Pharma. Recruitment involved convenience and snowball sampling, targeting National HIV and Hepatitis Mentoring Program affiliates.\nResults: Forty-one pharmacists (28 community, 13 hospital-based) across 15 Québec municipalities participated. Participants perceived their HIV knowledge as moderate (M=3.74/6).  They held largely favorable attitudes towards providing HIV care (M=4.02/6). They reported a “little” involvement in the delivery of HIV care services (M=2.08/5), most often ART adherence counseling, refilling, and monitoring. The most common barriers reported to HIV care delivery were a lack of time, staff resources, clinical tools, and HIV information/training, with pharmacists at least somewhat agreeing that they experienced each (M≥4.00/6). On average, MARVIN-Pharma's acceptability and compatibility were in the ‘undecided’ range (M=4.34, M=4.13/7, respectively), while pharmacists agreed to their self-efficacy to use online health services (M=5.6/7).\nConclusion: MARVIN-Pharma might help address pharmacists' knowledge gaps and barriers to HIV treatment and care, but pharmacist engagement in the chatbot’s development seems vital for its future uptake and usability.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a064e3956df4c97638fd6d0a3c14cfc16f9683c9fe5ff7404e9976356cb738d9","category":"Interdisciplinary"}