{"title":"Intra‐individual modulations and inter‐individual variations of female signals in the domestic canary (Serinus canaria)","link":"https://onlinelibrary.wiley.com/doi/10.1111/eth.13502?af=R","date":1729138246000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/1974534d-0042-425c-8db9-127a29a3e486/eth13502-toc-0001-m.png\" alt=\"Intra-individual modulations and inter-individual variations of female signals in the domestic canary (Serinus canaria)\" />\n<p>We exposed female canaries to two types of male song (very attractive and attractive songs). Each song type was broadcasted twice in a row. We measured both visual and vocal female signals in response to male songs. We observed that females could modify the characteristics of their signals depending on song attractiveness and the number of times they were exposed to a male's song.</p>\n<br />\n<h2>Abstract</h2>\n<p>During courtship, animals perform conspicuous and elaborate signals. In birds, courtship involved often mutual engagement by both partners but most research on courtship behaviours has focused on male signals despite of growing interest for female signals in recent years. Here, we show that female domestic canaries (<i>Serinus canaria</i>) have the ability to modulate their sexual response to male songs. To do so, we exposed females to two types of song (very attractive and moderately attractive songs) during two consecutive reproductive cycles. We measured both visual (copulation solicitation displays, CSD) and vocal signals (copulation solicitation trills, CST; contact calls, CC and simple trills, ST) emitted by the females during song broadcast. We observed that females could modify the characteristics of their signals (duration and the number of elements of CSD, duration, frequency and number of notes of calls) depending on song attractiveness and the number of times they were exposed to a male's song. We also found that some females always emitted more signals than others (i.e. stable inter-individual differences) regardless of the song attractiveness and across reproductive cycles. Further studies are necessary to check whether female signals constitute sexual ornaments and if they could stimulate male canaries during courtship.</p>","author":"Camille Le Gal, \nSébastien Derégnaucourt, \nMathieu Amy","siteTitle":"Wiley: Ethology: Table of Contents","siteHash":"7a94182f50d5fe321f60efa1a57eebe5c3e6a74d1fa25ba04a906a999025c0b6","entryHash":"a07749124af0e21e0c0fb24b2cdd0c4de6aefadc5ebe3e66cf812b21a231568e","category":"Environment"}