{"title":"This EV truckmaker is gigacasting its battery packs for longevity","link":"https://arstechnica.com/?p=1951770","date":1688587192000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Harbinger_050223-8754-800x534.jpg\" alt=\"A blue package truck drives past the camera under leaden skies\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/07/Harbinger_050223-8754.jpg\">Enlarge</a> <span>/</span> One of Harbinger's trucks on a demo ride at ACT Expo in May. (credit: Harbinger)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>We make no secret of our affection for the electric vehicle here at Ars, and that extends beyond the light-duty cars and trucks we usually drive and write about. The commercial vehicle sector is electrifying, too, but most of what we've seen in terms of commercial EVs have been either at the lightest end of the scale—class 2 trucks like the <a href=\"https://arstechnica.com/cars/2022/01/weve-driven-fords-other-electric-workhorse-the-2022-e-transit/\">Ford E-Transit</a> and <a href=\"https://arstechnica.com/cars/2022/04/our-first-impressions-after-driving-fedexs-new-electric-delivery-van/\">BrightDrop Zevo 600</a>—or the biggest class 8 trucks like we've seen from Daimler, Volvo, and Tesla.</p>\n<p>But what about a middle ground? One of the first companies to address the missing commercial EVs between the two ends of the spectrum is Harbinger, which has developed its own platform for <a href=\"https://www.fleetequipmentmag.com/making-sense-of-truck-classification/\">class 4-7</a> EVs. It recently debuted a new medium-duty electric truck platform designed for last-mile delivery. Harbinger designed the powertrain in-house with durability in mind.</p>\n<p>\"When we look at the biggest product in our segment—for delivery vehicles anyways—it's the Ford F-59, which is a stripped chassis, and that's basically an engine with like minimal additional stuff,\" Harbinger CEO John Harris told Ars. \"It's the same engine that Ford will put into an F-250. The engine has the durability, it can be mounted and handled properly, and there's not much else there. But if we look at an EV, it's much different. Its battery packs more than the drivetrain. And Ford doesn't have a medium-duty toolbox for electrification.\"</p></div><p><a href=\"https://arstechnica.com/?p=1951770#p3\">Read 8 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1951770&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a0772b9e85762c3abff2051284c18b3791914284fe59a3f849d58d59c015fb79","category":"Tech"}