{"title":"Skull & Bones เกมโจรสลัดของ Ubisoft ทำมา 8 ปี ยังไม่เสร็จ ปัญหาเพียบ อนาคตยังไม่แน่นอน","link":"https://www.blognone.com/node/123839","date":1626945392000,"content":"<div><div><div><p>Skull &amp; Bones เป็นเกมออนไลน์แนวโจรสลัด พัฒนาโดย Ubisoft Singapore เป็นทีมหลัก เริ่มต้นพัฒนาจากการเป็นภาคเสริมของ Assassin’s Creed Black Flag ในปี 2013 ก่อนจะแยกออกมาเป็นเกมเดี่ยวเต็มตัว</p>\n<p>เกมนี้<a href=\"https://www.youtube.com/watch?v=_9YYYVG0YQI\">เปิดตัวครั้งแรกในงาน E3 ปี 2017</a> ก่อนจะ<a href=\"https://www.youtube.com/watch?v=y1G8NsAxCC0\">โชว์เกมเพลย์เพิ่มเติมในปี 2018</a> และมี<a href=\"https://www.ign.com/articles/2017/06/12/e3-2017-ubisoft-singapore-reveals-pirates-game-skull-and-bones\">กำหนดวางจำหน่ายในปีเดียวกัน</a></p>\n<p>ตัวเกมถูกเลื่อนวางจำหน่ายหลายครั้ง <a href=\"https://www.polygon.com/2018/5/17/17366090/skull-bones-delayed-launch-date-ubisoft\">จากปี 2018 เป็นปี 2019</a> <a href=\"https://www.ign.com/articles/2019/05/15/skull-and-bones-not-being-released-until-after-march-2020\">จากปี 2019 ไปเป็นหลังเดือนมีนาคม 2020</a> หลังมีนาคม 2020 ไปเป็นช่วงเมษายน 2021 ถึงมีนาคม 2022 และล่าสุด<a href=\"https://www.gameinformer.com/2021/05/11/skull-bones-gets-a-new-release-window-ubisoft-lineup-schedule-announced\">ถูกเลื่อนไปเป็นช่วง เมษายน 2022 จนถึงมีนาคมปี 2023 แทน</a> รวมถูกเลื่อนมาแล้ว 4 ครั้งในระยะเวลา 3 ปี</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/a83a4116196082170d9499d75c2416d9.jpg\" /></p>\n<p>เว็บไซต์ <a href=\"https://kotaku.com/first-it-was-an-assassins-creed-expansion-now-its-ubis-1847326742\">Kotaku</a> สัมภาษณ์ทีมงานและอดีตทีมงานไม่เปิดเผยตัวตนกว่า 20 ชีวิต ได้ความว่าตัวเกมใช้เวลาพัฒนามา 8 ปี หมดเงินไปแล้วกว่า 120 ล้านดอลลาร์สหรัฐ ผ่านการรีเฟรช เปลี่ยนเซ็ตติ้งหลายรอบ ทั้งเคยจะใช้โลกจริงและมหาสมุทรอินเดียเป็นฉากหลัง ไปจนถึงใช้โลกจำลองชื่อ Hyperborea</p>\n<p>เกมเพลย์เองก็ถูกเปลี่ยนหลายแบบ ทั้งเป็นเกมที่จบเป็นแมตช์ไปแบบ Rainbow Six Siege แต่มีโหมด Hunting Grounds ซึ่งคล้าย Dark Zone ของ The Division ไปจนถึงพยายามทำตามเกมแนวเอาตัวรอดแบบ Rust หรือ Ark: Survival Evolved และปัจจุบันก็ยังไม่มีใครแน่ใจว่าเกมจะออกมาแบบไหน</p>\n<p>ทีมงานหลายคนที่ให้สัมภาษณ์ต่างก็เล่าสาเหตุต่างกันไป ทั้งทีมบริหารที่แก่งแย่งอำนาจและขาดทิศทาง บางคนก็ระบุว่าเกมเร่งสร้างเกินไป และทีมงาน Ubisoft Singapore ทีมที่เคยทำเกมฝั่ง Assasin’s Creed และทีมฝั่ง Ghost Recon Phantoms มีระบบการทำงานต่างกัน และทำให้เกิดการขัดแย้งทางวัฒนธรรมการทำงาน</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/d1204fce5aa25c9558cb5c1ee2ce62d6.jpg\" /></p>\n<p>ทีมงานส่วนใหญ่บอกว่าถ้าเป็นบริษัทอื่น โปรเจกต์เกมนี้คงถูกพับไปนานแล้ว และตอนนี้เกมนี้ “ใหญ่เกินกว่าจะพัง” เพราะ Ubisoft ลงเงินและเวลาไปมากกับเกมนี้ นอกจากนี้ Ubisoft ติดสัญญารับเงินสนับสนุนกิจการจากรัฐบาลสิงคโปร์ ภายใต้เงื่อนไขว่าต้องออกเกมไอพีใหม่ที่สร้างโดยทีม Ubisoft Singapore ให้ได้อีกด้วย</p>\n<p>ปัจจุบัน Ubisoft ยืนยันกับ Kotaku ว่าตัวเกมผ่านขั้น Alpha แล้ว และจะเปิดเผยข้อมูลเพิ่มเติมในอนาคต แต่จากปัญหาหลากหลายที่ Kotaku รายงาน ก็ยังไม่แน่ชัดว่าตัวเกมจะออกตามกำหนดการล่าสุดคือภายใน เมษายน 2022 จนถึงมีนาคมปี 2023 ได้หรือไม่ คงต้องติดตามกันต่อไป</p>\n<p>ที่มา - <a href=\"https://kotaku.com/first-it-was-an-assassins-creed-expansion-now-its-ubis-1847326742\">Kotaku</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/ubisoft\">Ubisoft</a></div><div><a href=\"/topics/games\">Games</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a07b09a5d67aedb68b24b705e9947f374eb431402cf082d8726b537bd04bbb24","category":"Thai"}