{"title":"A Study on The Relationship Between Sport Psychological Capital, Coach Leadership Behavior, and Training Satisfaction Among Sports Candidates","link":"https://www.preprints.org/manuscript/202406.0393/v1","date":1717721287000,"content":"Objective: This study aims to investigate the relationship between sports psychological capital, coach leadership behavior, and satisfaction among middle school students in the 2023 sports college entrance examination in Chongqing. Methods: Using the structural questionnaire design, this paper carries out a questionnaire survey on the candidates who come to participate in the volleyball specialty college entrance examination in Chongqing, the corresponding database was established and the data were statistically processed by spss21.0 and amos18.0. Results: 1) there was a significant positive correlation between sports psychological capital, coach leadership behavior and examinees satisfaction; 2) sports psychological capital and coach leadership behavior had a certain influence on five dimensions of examinees' personal treatment, personal performance, team integration, team interaction and support from relatives and friends; 3) The sense of self-efficacy in sports psychological capital and coach's leading behavior are the most important to examinees' satisfaction; 4) Both coaches' leadership behavior and sports psychological capital can directly affect examinees' satisfaction, but sports psychological capital is the most important. It can not only directly affect examinees' satisfaction, but also act as an intermediary between coaches' leadership behavior and examinees' satisfaction. Conclusion: Sports College Entrance Examination Students can improve training satisfaction and sports performance by strengthening sports psychological capital training and perceiving coach's leadership behavior; In the leadership behavior of coaches, we should emphasize training and appropriately weaken authoritative teaching, while the training of sense of hope and toughness should be highlighted in sports psychological capital.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a07bd85126445d856d7e420ef9e361c5ed35e76e014db67e6a1855ed613adcda","category":"Interdisciplinary"}