{"title":"Looking for a tiny but powerful PC? Check out the Minisforum U820/U850","link":"https://arstechnica.com/?p=1740024","date":1612553534000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/02/configuration-980x980.jpg\" alt=\"\"></div>\n        <p>\n          Like Minisforum's earlier designs, the U8x0 packs a lot more expandability into its tiny form factor than you might expect—including room for two internal 2.5-inch SATA SSDs or HDDs.                      [credit:\n                        Minisforum                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>Hong Kong-based miniature PC specialist Minisforum announced two new models of its signature NUC-like minis available for pre-order this week; <a href=\"https://fave.co/3txowM0\" target=\"_blank\" rel=\"noopener\">the U820 and U850</a>. These sibling models share the same basic form factor and specifications—they're palm-sized boxes crammed with input, output, and storage ports as shown below. The U850 offers an Intel i5-10210U CPU, and its less expensive U820 sibling sports an i5-8259U.</p>\n<p>These systems measure 5x5 inches, at 2.5 inches tall, and come with VESA mount hardware that can be used to mount them directly to the back of most monitors. They support up to three simultaneous displays (HDMI, DisplayPort, and USB-C), and can make great homebrew routers thanks to their dual Ethernet interfaces.</p>\n<p>We should note that these systems are available for <em>pre-</em>order now, with shipping expected in April—but this is not Minisforum's first rodeo; it has been shipping miniature PCs like these for several years through direct sales and Amazon.</p></div><p><a href=\"https://arstechnica.com/?p=1740024#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1740024&comments=1\">Comments</a></p>","author":"Jim Salter","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a09a8172561746c4b89e77f5648b2c53e32cd52947bc99d140b1226ef87a5219","category":"Tech"}