{"title":"Education Through Experiences: Bikepacking the Yellow Dirt Route onto Comb Ridge with Dzil Ta’ah Adventures – john watson","link":"https://theradavist.com/2021/05/education-through-experiences-bikepacking-the-yellow-dirt-route-onto-comb-ridge-with-dzil-taah-adventures/?utm_source=rss&utm_medium=rss&utm_campaign=education-through-experiences-bikepacking-the-yellow-dirt-route-onto-comb-ridge-with-dzil-taah-adventures","date":1621339242000,"content":"<p><i>In the Navajo Nation town of Kayenta, Arizona, Jon Yazzie runs a guide company called <a href=\"https://www.dziltaahadventures.com/\" target=\"_blank\">Dzil Ta</a></i><span>’</span><i>ah Adventures. Its intent is to educate visitors on the history of the areas surrounding Kayenta through guided bike trips. This particular route is one he’s been working on for a while which parallels the mighty Comb Ridge before climbing the Sandstone Backbone via an old Mormon dugway, overlooking Kane Valley where the US government drilled into the Earth, uncovering uranium for the Manhattan Project. The result would send waves of radiation through the community for decades to come…</i><span></span></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-3.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Prologue: Riding Mountain Bikes in Kayenta</strong></p>\n<p>Jon works at the N.A.T.I.V.E. School District and in his free time, he loves riding the sandstone escarpments that envelop his area of the 27,000 mile Navajo Nation. Bikepacking is his passion and singlespeed mountain bikes are his vehicle of choice. He has a healthy collection of Vassago frames, all singlespeed, all geared for their respective activities. There’s his fatbike, his hardtail, and <a href=\"https://theradavist.com/2021/05/jon-yazzie-from-dzil-taah-adventures-and-his-ti-vassago-optimus-29-ss-bikepacking-rig/\" target=\"_blank\">his rigid titanium bikepacking rig</a>.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-16.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>He and his partner NNadine Johnson, the co-founder and CFO of Dzil Ta’ah Adventures live in a house adjacent to campus, which neighbors a series of double-track roads that lead out to a veritable sandstone playground. Nadine and Jon have created a series of trails that zigzag up, down, and across these formations. They have their favorite sunset spots which they’ll spend their evenings at after a long day, often with their dogs, Benji and Dexter.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-21.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“We’re excited to have you guys. My plan is to take you on a new route that camps out above Kane Valley. Do you know that book <span><i>Yellow Dirt</i></span>? We’ll camp overlooking the valley where the events outlined in that book takes place.”</p>\n<p>That’s how my phone conversation began with Jon the week leading up to our trip. Jon was hoping to get photos for this new route he made before his company officially launches when the Navajo Nation opens back up to tourism. Over the past year, he’s had to overcome several obstacles, including working with the council member in his area to get bike tours added to the normal Jeep, horseback, and walking tours. The Navajo Nation is hoping to create a recreation corridor surrounding Comb Ridge and Jon is pushing to have cycling included in their agenda but as with every small town, things take time and patience.</p>\n<p><em>Why does Jon need a special permit to take people on these trips? Well, to ride bikes in the Navajo Nation, as an outsider, you have to be accompanied by a Navajo and in order for Jon to make money doing so, he has to have permits in addition to his tour guide license. This process has been over a year in the making but it’s looking like this year it will finally happen.</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-28.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>On our ride were Bailey Newbrey, a fellow singlespeeder, and Josh Weinburg, an author at the Radavist who’s documented various trips for <a href=\"https://theradavist.com/2019/11/bikepacking-navajoland-with-dzil-taah-adventures/\" target=\"_blank\">Dzil Ta<span>’</span>ah Adventures over the years here on the site</a>. Josh’s photos have helped Jon promote his community endeavors as well as his forthcoming business. My intent was to do the same on this trip but first, I had some learning to do.</p>\n<p>Before I picked Bailey up at our local coffee and burrito spot, I downloaded the audiobook for <span><i>Yellow Dirt</i></span>. Ever so curious about the industrialization and mineral extraction history of the American West, I was vaguely familiar with the uranium race of WWII and later, the Cold War. I knew Canyon Country was ripe with Uranium – so much so that the Dirty Devil River is not potable as its waters are tainted with uranium – and knew the Navajo had a huge hand in supplying the raw material for making the first atomic bombs. Yet I was completely unaware of the following account.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-86.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Yellow Dirt: An American Story of a Poisoned Land and a People Betrayed</strong></p>\n<p>Judy Pasternak is a 24-year veteran journalist with the New York Times and in <span><i>Yellow Dirt</i></span>, she tackles the convoluted story surrounding the Monument II mine, tucked within Kane Valley on Hosteen Adakai’s family land. With the world in the throes of WWII, many Navajo were recruited for US armed forces, including the revered Code Talkers who sent messages to Pacific outposts in their native tongue, one the Japanese couldn’t decipher.</p>\n<p>While these soldiers fought on faraway lands, the Navajo people surrounding Kayenta, a small outpost just south of Monument Valley, would play a very different role in the United States’ nuclear program, dubbed the Manhattan Project. Set up in secret, this military operation began working on designing a nuclear weapon that would mark a sea change in modern warfare but they needed one thing to make it happen: carnotite.</p>\n<p>This mineral is used in steel alloy for tanks, ships, and other armored vehicles but upon discovering trace amounts of uranium in samples from the lands within the Navajo Nation, the government began prospecting for domestic sources of carnotite and uranium to build atomic weapons. The war itself had hindered attempts to amass sufficient quantities of uranium from the typical sources in the Congo and elsewhere as German U-boats torpedoed ships carrying this precious mineral back to US soil.</p>\n<p>After Luke Yazzie, Adakai’s son brought government officials to their land after providing samples of carnotite, higher than anything mined from the Congo, a mine was opened, dubbed Monument II for its adjacency to Monument Valley, atop “Yazzie Mesa” overlooking Adakai’s ranch. Soon, members of the Navajo Nation were put to work, drilling, dynamiting, and scraping Mother Earth with metallic jaws for <span><i>leetso, </i></span>or “Yellow Dirt.”</p>\n<p>From 1944 to 1986, nearly 30 million tons of uranium ore were extracted from Navajo lands under leases with the Navajo Nation, and still to this day, its radioactive reach continues to send ripples through the community as cancer cases have been rising dramatically for decades. It wasn’t only the miners who were exposed to radioactive dust, as tailing sand from the mine was used in building houses throughout the area. Still to this day, many homes carry trace amounts of radon, a radioactive gas emitted from uranium.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-17.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><strong>Reportage: Wild Horses, Windmills, and Blow Sand – Bikepacking the Dzil Ta’ah Adventures Yellow Dirt Route</strong></p>\n<p>After our shakedown sunset ride in Kayenta, we camped out in Jon and Nadine’s backyard, bonding over that atavistic tradition of telling tales around a campfire. Jon laid out our rough plan for the weekend, what to expect, what we should pack, and a general idea of mileage. Luckily, this was not a climbing-intensive route but it would be far from easy. I’ve spent enough time in the desert and Canyon Country to know that the biggest challenges are finding water, battling wind, washboard roads, and sand. No bike ride is easy in this terrain. You will work hard but the rewards are always worth it.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-108.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-109.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We discussed supplies, paired down, culling our collective tool kits. I brought my new water filter and was eager to use it after backpacking in Canyonlands with it a few weeks prior. Just to be safe, we all packed about 3-5 liters of water and plenty of food. 35 miles each way doesn’t sound like that long of a trip but in this terrain, every mile presents a different challenge.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-110.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-111.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Setting out after the cloud cover burned off, we headed to the southwestern terminus of the mighty Sandstone Backbone, Comb Ridge (<span><i>Tséyíkʼáán</i></span> in Navajo). A monocline formation that spans 80 miles from Kayenta, AZ to the mighty Abajo mountains, just a dozen miles from Blanding, Utah, Comb Ridge is one of the area’s most remarkable geological formations. Within this monocline ridgeline lie hundreds of Ancestral Pueblo, Basketmaker, Pueblo II, III, and Hopi cliff dwellings (homes), each with petroglyphs/pictographs (stories), and other human-made creations such as moki benches. Humans have lived in this area since archaic times yet these ruins mostly age from between 800 and 1400AD, with Navajo sheepherders finding these dwellings after the Long Walk relocated the Navajo people back to these lands in 1868. In 1923, the newly-formed Navajo Nation established 27,000 miles of land spanning Arizona, Utah, and New Mexico.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-51.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The dense population of Ancestral Puebloans sites was evident, as we came upon a dwelling not long into our route. A truly remarkable site, tucked away within a canyon resembling a Mobius arch that had been split down the middle. A rippling wave of sandstone created an overhanging opening where from 800-1400AD, various Indigenous peoples built upon the original dwelling, each leaving their own unique trademark details and stories painted on the adjacent walls.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-52.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-53.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p><em>A kiva remains as the centerpiece, used in ceremonial rituals. These places are sacred and we all greeted this powerful place with reverence, respect, and care. Please, when visiting ancestral sites, leave no trace, take only photos, and remember, you’re standing on sacred ground.</em></p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-46.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-55.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We examined the area, noting certain details which can be found throughout similar sites throughout Canyon Country like yucca rope strongholds, hand and foot nooks for climbing, moki staircases, pottery sherds, and slated rocks, the remnants of making arrowheads and spear tips. Before leaving the valley, we filled up at a pool of water, formed by a trickling spring, and examined the rest of our route.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-71.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>“I think we have about 16 more miles. There are a few windmills we can fill up before heading to the top of Comb Ridge.” Jon announced, as the sun peeked from the clouds and the wind picked up. “The road gets covered by blow sand so we’ll stick to the sandstone as much as possible.”</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-73.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>A group of wild horses, alarmed by our presence, hastily broke out in front of us, with two white mares stopping to investigate our curious modes of transport. The overflow pool from a windmill trough provided water for these beautiful, yet invasive bovine friends. Horses and cattle have killed off much of the cryptobiotic soil, the biological ‘crust’ that seals in water for the native plant life. Once the crust is busted, the sand it was containing blows across the landscape, doing irreparable damage to flora and fauna alike. Decades of grazing have forever altered this landscape.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-80.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Finding refuge on the sandstone, we tick-tacked our way up Comb Ridge before ascending an old Mormon wagon road, cut by settlers in the late 1800s during the Hole-in-the-Rock Expedition. This “road” is still very much accessible today by horseback, 4×4, and bicycle.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-84.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Once atop the ridge, we were greeted by the sprawling compound once owned by Hosteen Adakai’s family. Yazzie Mesa, where the Monument II mine was formed, still exists today, along with the uranium-tainted tailings. Needless to say, being high above the site, and far from any potential uranium exposure was close enough for me. I was thankful for my 200mm zoom lens.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-91.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Jon laid back on the sandstone, soaking in the last bit of light from an eventful day. “I do this all the time, just lay here and wait for the stars.” For Jon, bikes are but a vehicle to bond with the land, and camping is just another way he stays in close connection with his roots.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-89.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>The clouds parted, as the sun showed us its true potential, coating the sandstone backbone of Comb Ridge with warm light and illuminating Monument Valley, far off in a distance. As the sun went down, our conversations and stories lit up the night until a blanket of stars filled the sky, each twinkling light beckoning us to our much-deserved slumber.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-92.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>With a new understanding of the scale of the Monument II mine and its role in the nuclear arms race, my mind began to drift into what would become the narrative for this story. Jon had shown us something truly powerful. His words and stories provided a backdrop to this equally powerful, rightfully-arduous overnighter.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-112.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Pedaling out of camp, Jon could sense our awe and said “trips like this are how I like to teach people about Indigenous history; these experiences are educational,” to me as we regrouped at the top of Comb Ridge. This sentence stuck with each of us.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-119.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-117.jpg?fit=1024,9999&amp;quality=75\" /><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-121.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>We stopped back at the windmill to refill, as a new herd of horses approached, patiently awaiting us to depart. While Jon ate an avocado and checked his text messages. It was a slow-moving morning, which was perfectly fine. We broke camp by 8:30 am and had plenty of time to make the journey back to town, so why rush it?</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-125.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>I kept mulling over Jon’s words about experiences as education on the ride back, as they provided a distraction from the 20mph wind gusts and 15 miles of washboard roads. Every hour, we’d regroup, whet our parched mouths, and snack on the side of the road. The desert has the uncanny ability to deceive one’s journey. What looks like a mile is in fact, ten.</p>\n<p><img src=\"https://media.theradavist.com/uploads/2021/05/dzil_Taah_Adventures-YellowDirt-131.jpg?fit=1024,9999&amp;quality=75\" /></p>\n<p>Cresting the hill out of the valley and back into Kayenta, we all commented on our mutual respect for the route we’d just completed. I knew the next challenge I’d face would be doing it justice in a story…</p>\n<p><i>I’d like to personally thank Nadine and Jon for their hospitality and you all for following along. An equally beautiful as contentious area awaits you all, with Dzil Ta</i><span>’</span><i>ah Adventures at the helm. If you’re curious about the Indigenous history of this area or perhaps you just want to ride bikes in this part of the Navajo Nation, reach out to Jon Yazzie and head to <a href=\"https://www.dziltaahadventures.com/\" target=\"_blank\">Dzil Ta</a></i><span>’</span><i>ah Adventures for more information.</i></p>","author":"prolly","siteTitle":"The Radavist","siteHash":"96eb481d8084f04a4602bac57874ba717baf56b758f45547b5caf2312da766ef","entryHash":"a09ebf5dd6d9a90de15de788fe4c86d15a08de8772d2debf2b5917bd3f969fe7","category":"Cycling"}