{"title":"Performance Evaluation of a National 7-Day Ensemble Streamflow Forecast Service for Australia","link":"https://www.preprints.org/manuscript/202403.1751/v1","date":1711616499000,"content":"The Australian Bureau of Meteorology offers a national operational 7-day ensemble streamflow forecast service covering regions of high environmental, economic and social significance. This semi-automated service generates streamflow forecasts every morning and is seamlessly integrated into the Bureau's Hydrologic Forecasting System (HyFS). Ensemble rainfall forecasts, European Centre for Medium-Range Weather Forecasts (ECMWF) and Poor Man's Ensemble (PME), available in the Numerical Weather Prediction (NWP) suite, are used to generate these streamflow forecasts. The NWP rainfall undergoes pre-processing using the Catchment Hydrologic Pre-Processer (CHyPP) before being fed into the GR4H rainfall-runoff model, which is embedded in the Short-term Water Information Forecasting Tools (SWIFT) hydrological modelling package. The simulated streamflow is then post-processed using the Error Representation and Reduction In Stages (ERRIS). We evaluated the performance of the operational rainfall and streamflow forecasts for 96 catchments using four years of operational data between January 2020 and December 2023. Performance evaluation metrics included CRPS, relative CRPS, CRPSS, and PIT-Alpha for ensemble forecasts and NSE, PCC, MAE, KGE, PBias and RMSE and three categorical metrics CSI, FAR and POD for deterministic forecasts. The skill scores CRPS, relative CRPS, CRPSS and PIT-Alpha, gradually decreased for both rainfall and streamflow as the forecast horizon increased from Day 1 to Day 7. A similar pattern emerged for NSE, KGE, PCC, MAE and RMSE as well as the categorical metrics. Forecast performance also progressively decreased with the higher streamflow regime. Most catchments showed positive performance skills, meaning the ensemble forecast outperformed climatology. Both streamflow and rainfall forecast skills varied spatially across the country – and were generally better in the high runoff generating catchments, and poorer in the drier catchments situated in the western part of the Great Dividing Range, South Australia and mid-west of Western Australia. We did not find any association between model forecast skill and the catchment area. Our findings demonstrate that the 7-day ensemble streamflow forecasting service is robust and draws great confidence from agencies that use these forecasts to support decisions around water resources management.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a0a2aaffe8a6f8beea94dd925c97e2217c80e848acdcd220b6368cc37caf9b5c","category":"Interdisciplinary"}