{"title":"Estimates of Lake Nitrogen, Phosphorus, and Chlorophyll‐a Concentrations to Characterize Harmful Algal Bloom Risk Across the United States","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024EF004493?af=R","date":1724726387000,"content":"<h2>Abstract</h2>\n<p>Excess nutrient pollution contributes to the formation of harmful algal blooms (HABs) that compromise fisheries and recreation and that can directly endanger human and animal health via cyanotoxins. Efforts to quantify the occurrence, drivers, and severity of HABs across large areas is difficult due to the resource intensive nature of field monitoring of lake nutrient and chlorophyll-<i>a</i> concentrations. To better characterize how nutrients interact with other environmental factors to produce algal blooms in freshwater systems, we used spatially explicit and temporally matched climate, landscape, in-lake characteristic, and nutrient inventory data sets to predict nutrients and chlorophyll-<i>a</i> across the conterminous US (CONUS). Using a nested modeling approach, three random forest (RF) models were trained to explain the spatiotemporal variation in total nitrogen (TN), total phosphorus (TP), and chlorophyll-<i>a</i> concentrations across US EPA's National Lakes Assessment (<i>n</i> = 2,062). Concentrations of TN and TP were the most important predictors and, with other variables, the RF model accounted for 68% of variation in chlorophyll-<i>a</i>. We then used these RF models to extrapolate lake TN and TP predictions to lakes without nutrient observations and predict chlorophyll-<i>a</i> for ∼112,000 lakes across the CONUS. Risk for high chlorophyll-<i>a</i> concentrations is highest in the agriculturally dominated Midwest, but other areas of risk emerge in nutrient pollution hot spots across the country. These catchment and lake-specific results can help managers identify potential nutrient pollution and chlorophyll-<i>a</i> hot spots that may fuel blooms, prioritize at-risk lakes for additional monitoring, and optimize management to protect human health and other environmental end goals.</p>","author":"Meredith M. Brehob, \nMichael J. Pennino, \nAmalia M. Handler, \nJana E. Compton, \nSylvia S. Lee, \nRobert D. Sabo","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"a0a59d8c3a0aeebb348d1ec4bedf4a821a01f5064916f5d13d4fb45c8fe43bb6","category":"Environment"}