{"title":"Cyclist's 31 Inspirational Women: honourable mentions","link":"https://www.cyclist.co.uk/sponsored/9433/cyclists-31-inspirational-women-honourable-mentions","date":1617270784000,"content":"<span>\n      <span><a href=\"/authors/maria-david\">Maria David</a></span>\n      <span><a href=\"/authors/sponsored\">Sponsored</a></span>\n  </span><div>  \n  <div>      <div><span>1 Apr 2021</span></div>    </div></div><p>\nThey may not have made our final list of 31, but these inspirational women have made their mark all the same</p>\n<div>\n      <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/styles/article_main_image/public/2021/04/alfonsina_strada.jpg?itok=ONfKIDa-\" />  </div>\n<div>\n      <p> <a href=\"/tags/zwift-womens-history-month\"><img src=\"https://cdn1.cyclist.co.uk/sites/cyclist/files/2021/02/31_inspirational_women_clickable_logo_new.jpg\" /></a></p>\n<p><strong>To celebrate International Women's Month, we have partnered with Zwift to tell the stories of 31 inspirational women across 31 days</strong></p>\n<p><strong>Words</strong>: Maria David <strong>Photos</strong>: Offside</p>\n<p>Over the month of March <a href=\"/tags/zwift-womens-history-month\">we profiled 31 inspirational women in cycling</a> to mark International Women’s Month.</p>\n<p>However, there are so many more than just 31 women who have done – and continue to do – ground-breaking, influential and truly marvellous things in the cycling world.</p>\n<p>Below are some honourable mentions, to name but a few and you can find the rest of <a href=\"/tags/zwift-womens-history-month\"><em>Cyclist's 31 Inspirational Women</em> here</a></p>\n<h3>Alfonsina Strada</h3>\n<p><em>The only woman to ever compete in the men’s Giro d’Italia</em></p>\n<p>Born Alfonsina Morini in Castelfranco Emilia, near Bologna, in 1891, Alfonsina married Luigi Strada in 1905 at the age of 24.</p>\n<p>As a slightly tomboy-ish teenager, she had spent a few years secretly competing in small races when her parents thought she had gone to church.</p>\n<p>It was after she got married and her husband gave her a road bike as a wedding present that Alfonsina began training seriously, and she would pursue her love of all things two wheeled right up to the day she died in 1959.</p>\n<p>Alfonsina paved the way for women’s racing in Italy by entering whichever races she could, even racing against men. Alfonsina became the first woman to compete in men’s professional races when she raced in the Tour of Lombardy in 1917 and 1918, and famously raced in the 1924 <a href=\"/tags/giro-ditalia\">Giro d’Italia</a> after concealing her gender when registering for the race.</p>\n<p>The organisers excluded Alfonsina from the race when she finished outside the time limit after crashing on the stage from L’Aquila to Perugia.</p>\n<blockquote><p>She would be there in the workshop repairing tyres and it was hard to believe that this was the same woman who had broken the Hour record and competed in the Giro d’Italia</p></blockquote>\n<p>However, public support for her was so strong and she was allowed to continue the race, albeit without getting an official finishing position. Nevertheless, Alfonsina captured the public imagination, particularly as she was one of only 30 riders to complete the course out of 90 starters.</p>\n<p>Alfonsina broke the Hour record at the end of her racing career in her forties and in retirement co-owned a bike shop with her second husband and fellow pro racer, Carlo Messori, in Milan.</p>\n<p>Marino Vigna, a track cyclist who won gold in the team pursuit at the Rome 1960 Olympics, lived near the shop and was a regular customer. At the time, he was a teenager, and like other visitors to the bike shop, was in awe of Alfonsina and her achievements.</p>\n<p>He recalls, ‘Everyone knew all the great things Alfonsina had achieved in cycling, but she was very modest. She would be there in the workshop repairing tyres and it was hard to believe that this was the same woman who had broken the Hour record and competed in the Giro d’Italia.’</p>\n<p>Alfonsina died of a heart attack when her motorbike came off its stand, knocking her to the ground. She was 68.</p>\n<div>\n<div>    <img src=\"https://cdn2.cyclist.co.uk/sites/cyclist/files/2021/04/nicole_cooke.jpg\" />  </div>\n</div>\n<h3>Nicole Cooke</h3>\n<p>Olympic Champion, 2008; World Road Race Champion, 2000 and 2008; Ten-time National Road Race Champion</p>\n<h3>Corrine Hall (sighted pilot) and Lora Fachie</h3>\n<p>Paralympic Champions 2016 (Tandem Individual pursuit B); Paracycling World Track Champions, 2017 (Tandem Sprint, Kilo, Pursuit B); World Road Race Champions 2013, 2014 (Tandem Time Trial and Road Race B respectively)</p>\n<h3>Rachel Hedderman (née Heal)</h3>\n<p>First female sports director of a men’s team (ProContinental, UnitedHealthcare) in a WorldTour Race</p>\n<h3>Yvonne McGregor</h3>\n<p>Commonwealth Champion, 1994 (Points race); World Track Cycling Champion, 2000 (Pursuit); Hour record Holder 1995</p>\n<h3>Dervla Murphy</h3>\n<p>Multi-country cycle tourist and travel writer for over 40 years</p>\n<h3>Billie Fleming</h3>\n<p>Long-distance cyclist; former record holder for greatest distance cycled in a year</p>\n<p><strong>For more from Zwift this International Women's Month</strong>, <a href=\"http://pubads.g.doubleclick.net/gampad/clk?id=5659013978&amp;iu=/359/impcount.co.uk\" target=\"_blank\">visit here</a></p>\n<div>      <div>See related </div>\n  \n  <div>      <div><a href=\"/ribble/9427/ribble-launches-new-gravel-range\">Ribble launches new gravel range</a></div>      <div><a href=\"/ribble/8287/ribble-ultra-tt-review\">Ribble Ultra TT review</a></div>      <div><a href=\"/sponsored/8550/ribble-cgr-al-e-cyclist-off-roads-best-e-gravel-bikes\">Ribble CGR Al e: Cyclist Off-Road's best e-gravel bikes</a></div>      <div><a href=\"/rapha/9475/rapha-reopens-its-bigger-and-better-london-clubhouse\">Rapha reopens its bigger and better London Clubhouse</a></div>      <div><a href=\"/news/6463/cyclist-magazine-new-issue-on-sale-buy-it-now\">Cyclist magazine issue 112: on sale now!</a></div>    </div></div>  </div>\n<div>  \n  <div>      <div><a href=\"/cyclists\">Cyclists</a></div>    </div></div>","author":"mjames","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"a0a7f56737335361a729d9cad59ffae15bf164d18b7fe367e8e7c5d7dde784e8","category":"Cycling"}