{"title":"PSLBI-28 Assessing the impact of a potential canine vaccine for the control of Chagas Disease","link":"https://academic.oup.com/jas/article/102/Supplement_3/649/7757682?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>T<span>rypanosoma cruzi</span> is the causative agent of Chagas disease, a neglected tropical disease affecting 8 million people in the Americas. Chagas disease, a zoonotic infection transmitted by triatomine bugs, poses serious public health risks in endemic areas. As dogs are important reservoirs in the spread of the disease, developing a canine vaccine could be transformative for controlling disease transmission to dogs and humans. We developed a compartmental Susceptible-Infected model to simulate the transmission dynamics of <span>Trypanosoma cruzi</span>, considering interactions among dogs, humans, cats, rodents, and triatomine vectors. We used the model to assess the direct and indirect impacts of two vaccine mechanisms; all-or-nothing and leaky, on disease incidence across different host populations. The sensitivity of the model to changes in triatomine bugs feeding patterns on dogs was also analyzed to gauge the influence of vector behavior on canine vaccine effectiveness. Our model showed that with a 90% vaccine efficacy, an all-or-nothing vaccine could reduce the cumulative incidence of <span>T. cruzi</span> in dogs by 91.3% over 5 yr. The 60% and 30% vaccine efficacies would result in reductions of 63.47% and 33%, respectively, over 5 yr. Similarly, the leaky vaccine achieved a 92.62% reduction in dog infections over 5 yr with 90% efficacy. The indirect effects on human <span>T. cruzi</span> infection were notable; the all-or-nothing vaccine reduced human disease incidence by 14.37% at 90% efficacy, while the leaky vaccine achieved a 32.15% reduction over 5 yr. Both vaccine mechanisms may substantially reduce <span>T. cruzi</span> incidence among dogs, and generate indirect benefit to other hosts, such as humans, by reducing their infection risk. The indirect benefits of vaccination were heavily influenced by the proportion of triatomine bugs blood meals taken from dogs. The study highlights the potential of targeted canine vaccination in controlling Chagas disease transmission and burden in endemic countries. It provides additional evidence for pursuing the development of a canine vaccine as a valuable tool for Chagas disease elimination.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a0b5a349c91b4b12d7439773bb8745d7c07830d6ea75e34cc4e06b793ef5d1cd","category":"Environment"}