{"title":"Zero Trust VPN (ZT-VPN): A Cybersecurity Framework for Modern Enterprises to Enhance IT Security and Privacy in Remote Work Environments","link":"https://www.preprints.org/manuscript/202410.0301/v1","date":1728028031000,"content":"Modern organizations have migrated from localized physical offices to work-from-home environments. This surge in remote work culture has exponentially increased the demand and usage of Virtual Private Network (VPN), which permits remote employees to access corporate offices effectively. However, the technology raise concerns including security threats, latency, throughput, and scalability, among others. These Newer generation threats are more complex and frequent, which makes the legacy approach to security ineffective. The research paper gives an overview of contemporary technologies used across enterprises including VPN and Zero Trust Network Access (ZTNA), Proxy Servers, Secure Shell (SSH) Tunnels, Software-defined wide area network (SD-WAN), and Secure Access Service Edge (SASE). This paper also presents a comprehensive cybersecurity framework named Zero Trust VPN (ZTVPN), which is a VPN solution based on Zero Trust principles. The proposed framework is aimed to enhance IT security and privacy for modern enterprises in remote work environments and addresses concerns of latency, throughput, scalability, and security. Finally, the paper demonstrates the effectiveness of the proposed framework in various enterprise scenarios, highlighting its ability to prevent data leaks, manage access permissions, and provide seamless security transitions. The findings underscore the importance of adopting ZTVPN to fortify cybersecurity frameworks, offering an effective protection tool against contemporary cyber threats. This research serves as a valuable reference for organizations aiming to enhance their security posture in an increasingly hostile threat landscape.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a0b8a5a9c7f9c203d777994d61ce9c2c7e3bf42d53d6dfaf37f059fb4d485467","category":"Interdisciplinary"}