{"title":"Analysis of Renal Responses to Whole-body γ-Irradiation alone or Combined with Skin Injury Before the Onset of Renal Dysfunction in Mice","link":"https://www.preprints.org/manuscript/202406.0680/v1","date":1718098067000,"content":"The delayed effects of radiation alone and combined with skin injury on the kidney are poorly understood. We aimed to unravel and compare the inflammatory, oxidative stress, and survival signaling pathways in the kidney cortex before mice manifested renal dysfunction after these two injuries. Mice were analyzed 30 days post irradiation (9.5 Gy for radiation alone, 9.0 Gy for radiation combined with a skin wound). Radiation alone did not significantly alter BUN, NGAL, or KIM-1 protein levels, indicating preserved kidney function. However, the combined injury had increased KIM-1 protein levels, indicating a nuanced effect on renal health. Radiation and combined injury activated distinct inflammatory pathways. Radiation increased STAT3-Y705 phosphorylation, while combined injury boosted STAT1-Y701 phosphorylation. Additionally, radiation increased mRNA abundance of IFNγR1, IFNγR2, heparanase and IL-10, while combined injury tended to increase heparanase mRNA levels and reduced IL-4 mRNA levels. Both injuries increased the abundance of HO-1 protein, indicating oxidative stress, but radiation alone also reduced MnSOD and catalase proteins. Both injuries promoted AKT1-S473 phosphorylation and diminished p53 protein levels, suggesting inhibition of apoptosis. In summary, despite the distinct activation of inflammatory and oxidative stress pathways, both radiation alone and combined injury activated protective mechanisms such as HO-1 and AKT1, offering insights into molecular events before manifesting renal dysfunction.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a0b94c985df7bdc57fcc909784111e47638e311887ff7ed45739fc109cfdd66d","category":"Interdisciplinary"}