{"title":"Spatio-Temporal Study of Galactolipid Biosynthesis in Duckweed Using Mass Spectrometry Imaging and in vivo Isotope Labeling","link":"https://academic.oup.com/pcp/article/65/6/986/7642521?rss=1","date":1711584000000,"content":"<span><div>Abstract</div>Isotope labeling coupled with mass spectrometry imaging (MSI) presents a potent strategy for elucidating the dynamics of metabolism at cellular resolution, yet its application to plant systems is scarce. It has the potential to reveal the spatio-temporal dynamics of lipid biosynthesis during plant development. In this study, we explore its application to galactolipid biosynthesis of an aquatic plant, <span>Lemna minor</span>, with D<sub>2</sub>O labeling. Specifically, matrix-assisted laser desorption/ionization-MSI data of two major galactolipids in <span>L. minor</span>, monogalactosyldiacylglycerol and digalactosyldiacylglycerol, were studied after growing in 50% D<sub>2</sub>O media over a 15-day time period. When they were partially labeled after 5 d, three distinct binomial isotopologue distributions were observed corresponding to the labeling of partial structural moieties: galactose only, galactose and a fatty acyl chain and the entire molecule. The temporal change in the relative abundance of these distributions follows the expected linear pathway of galactolipid biosynthesis. Notably, their mass spectrometry images revealed the localization of each isotopologue group to the old parent frond, the intermediate tissues and the newly grown daughter fronds. Besides, two additional labeling experiments, (i) <sup>13</sup>CO<sub>2</sub> labeling and (ii) backward labeling of completely 50% D<sub>2</sub>O-labeled <span>L. minor</span> in H<sub>2</sub>O media, confirm the observations in forward labeling. Furthermore, these experiments unveiled hidden isotopologue distributions indicative of membrane lipid restructuring. This study suggests the potential of isotope labeling using MSI to provide spatio-temporal details in lipid biosynthesis in plant development.</span>","author":"","siteTitle":"Plant and Cell Physiology Current Issue","siteHash":"4cc6f9f83376b07c027fd7e94a91f237de774cefb179ee46a5bc732f13bf71a5","entryHash":"a0be36e41c6505d23fb4719f74232361e999d45ff717c181f1f2acf013f70724","category":"Environment"}