{"title":"Google reportedly optimistic about Pixel 6 sales, increases production by 50%","link":"https://arstechnica.com/?p=1791128","date":1630519546000,"content":"<div>\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul><li>\n        <div>  \n        <div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/E7zCs8iXsAM4RZE-980x980.jpg\" /></div>\n        <p>\n          The Pixel 6. Notice how the bottom one has a bigger area above the camera block? That's the \"Pro\" model.                       [credit:\n                        Google                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p><a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Google-developing-own-CPUs-for-Chromebook-laptops\">Nikkei Asia</a> has been sniffing around the Google supply chain and came away with a fun pair of Google rumors. The first is that Google is so optimistic about Pixel 6 sales that it's increasing the production capacity by 50 percent. The second is that the Pixel 6's \"Google Tensor\" SoC is headed for Chromebooks around 2023.</p>\n<p>First, Pixel 6 optimism: Nikkei reports that Google \"has high hopes for the Pixel 6 range and has asked suppliers to prepare 50% more production capacity for the handsets compared with the pre-pandemic level in 2019.\" Google shipped 7 million phones in 2019 according to research firm IDC, so Google is hoping for 10.5 million in sales. For a gut check, <a href=\"https://www.statista.com/statistics/276306/global-apple-iphone-sales-since-fiscal-year-2007/\">Apple ships</a> over 200 million iPhones a year, and <a href=\"https://www.statista.com/statistics/299144/samsung-smartphone-shipments-worldwide/\">Samsung ships</a> anywhere from 260-300 million phones.</p>\n<p>Google has a lot of reasons to be optimistic about the Pixel 6. It marks the company's return to the flagship smartphone market after bowing out in 2020 with the mid-range Pixel 5. It will be the first phone to ship with the hyped-up \"Google Tensor\" SoC, Google's first self-branded main smartphone SoC. With its own SoC, there's nothing to stop Google from dramatically increasing the lifespan of Pixel phones above the current three-year mark, which we're really hoping the company does. Google's image-stacking camera algorithms have long made it a leader in the smartphone camera quality wars, but it has also rested on its laurels when it comes to the hardware, choosing to ship essentially the same camera sensor in the Pixel 2, 3, 3a, 4, 4a, 5, and 5a. The Pixel 6 will mark the first big camera upgrade in years, and expectations are high for what Google can do with modern camera hardware. The phone will also be the first to ship with Android 12, which puts a <a href=\"https://arstechnica.com/gadgets/2021/06/android-12s-beautiful-color-changing-ui-already-lives-up-to-the-hype/\">beautiful color-changing UI</a> front and center. It will look great in all the commercials.</p></div><p><a href=\"https://arstechnica.com/?p=1791128#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1791128&amp;comments=1\">Comments</a></p>","author":"Ron Amadeo","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a0bfcee140c660afef7f360755716900d1c69147141039e92a322eff46e3841b","category":"Tech"}