{"title":"Assessment of the environmental impacts of conflict-driven Internally Displaced Persons: A sentinel-2 satellite based analysis of land use/cover changes in the Kas locality, Darfur, Sudan","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304034","date":1717077600000,"content":"<p>by Abdalrahman Ahmed, Brian Rotich, Kornel Czimber</p>\r\n\r\nInternal displacement of populations due to armed conflicts can substantially impact a region’s Land Use and Land Cover (LULC) and the efforts towards the achievement of Sustainable Development Goals (SDGs). The objective of this study was to determine the effects of conflict-driven Internally Displaced Persons (IDPs) on vegetation cover and environmental sustainability in the Kas locality of Darfur, Sudan. Supervised classification and change analysis were performed on Sentinel-2 satellite images for the years 2016 and 2022 using QGIS software. The Sentinel-2 Level 2A data were analysed using the Random Forest (RF) Machine Learning (ML) classifier. Five land cover types were successfully classified (agricultural land, vegetation cover, built-up area, sand, and bareland) with overall accuracies of more than 86% and Kappa coefficients greater than 0.74. The results revealed a 35.33% (-10.20 km<sup>2</sup>) decline in vegetation cover area over the six-year study period, equivalent to an average annual loss rate of -5.89% (-1.70 km<sup>2</sup>) of vegetation cover. In contrast, agricultural land and built-up areas increased by 17.53% (98.12 km<sup>2</sup>) and 60.53% (5.29 km<sup>2</sup>) respectively between the two study years. The trends of the changes among different LULC classes suggest potential influences of human activities especially the IDPs, natural processes, and a combination of both in the study area. This study highlights the impacts of IDPs on natural resources and land cover patterns in a conflict-affected region. It also offers pertinent data that can support decision-makers in restoring the affected areas and preventing further environmental degradation for sustainability.","author":"Abdalrahman Ahmed","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a0cb90469adf2dcf03375c77809df650a867f7510674ffd1024c9bf00d37144a","category":"Interdisciplinary"}