{"title":"Heatwaves exacerbate pollen limitation through reductions in pollen production and pollen vigour","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae045/7755451?rss=1","date":1726099200000,"content":"<span><div>Abstract</div>Increasingly frequent heat waves threaten the reproduction of flowering plants; compromising the future persistence, adaptive capacity, and dispersal of wild plant populations, and also the yield of fruit-bearing crop plants. Heat damages the development of sensitive floral organs and gametes, which inhibits pollen germination, pollen tube growth, and fertilization. However, the role of heat has not been integrated into the framework of pollen quantity and quality limitation and how heat influences the success of cross and self-pollination. We exposed developing flowers to either controlled temperature (25 °C:20 °C) or extreme heat (35 °C:20 °C) over 72 h. We then hand-pollinated them with either crossed or self-derived pollen from the same temperature treatment to determine the direct and interactive effects of simulated heatwaves on pollen tube growth and resulting seed set. We also collected anthers from virgin flowers to measure heat impacts on pollen production. Under cooler control temperatures pollen tube survival of self-derived pollen was approximately 27% lower than that of crossed pollen. Pollen tube survival in heat-treated cross-pollinated and heat-treated self-pollinated flowers were 71% and 77% lower compared to flowers cross-pollinated at control temperatures. These differences in pollen tube survival rate <span>between</span> heat-treated cross-pollinated and heat-treated self-pollinated flowers were insignificant. Furthermore, extreme heat reduced seed set by 87%, regardless of pollen origin, and also reduced pollen production during flower development by approximately 20%. Our results suggest flowers that develop during heatwaves are likely to experience exacerbated pollen quantity and quality limitation driven by changes in pollen production and pollen vigour. Heatwave-induced pollen limitation will likely reduce crop yields in agricultural systems, and depress mating and reproduction in wild plant species, the latter of which may hinder the adaptive capacity of plants to a rapidly changing world.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"a0cbad0c82c8da116421c6a5192fbc33568248a7bc8357bced957c39eeeb1cd8","category":"Environment"}