{"title":"Effects of Loading and Perforation Parameters on Rock Deformation and Damage Behaviors Induced by Dynamic Loadings Caused by the Fracturing of Tight Oil Reservoirs","link":"https://www.preprints.org/manuscript/202408.0711/v1","date":1723215912000,"content":"This study presents a numerical analysis of rock deformation and damage behaviors induced by dynamic loadings, specifically focusing on the fracturing of tight oil reservoirs. An elastoplastic model based on finite element methods was utilized to simulate the effects of varying loading and perforation parameters. Three distinct scenarios were modeled: a single perforation, boundary loading on three sides, and multiple perforations, each providing unique insights into the mechanical responses of the rock material. The analysis revealed that dynamic effects are highly localized around perforations and loaded boundaries across all scenarios. Acceleration magnitudes are captured with rapid attenuation observed as the distance from the perforation increased. This indicated that the highest stress concentrations and deformation occurred close to the points of loading or perforation. Strain rate analysis in the x direction showed significant fluctuations near the perforations, reflecting intense stress redistributions and compressive deformation, especially prominent in the scenario with multiple perforations. Plastic strain, representing irreversible damage, was found to concentrate near perforation tips and loaded boundaries. However, the pattern of plastic strain accumulation varied: in the small domain scenario with boundary loading, plastic strain did not immediately accumulate next to the loading boundary, whereas in scenarios with single and multiple perforations, damage developed from the loading boundaries. These findings highlight the need for precise control in perforation and dynamic loading processes to manage stress and deformation effectively. It is concluded that optimizing perforation patterns and loading strategies can enhance reservoir stimulation efficiency while minimizing unintended damage to the surrounding formation.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a0cc0afa7e5b53e85c66d806a22798b52742309f8a5624e039e403ddd0227e9f","category":"Interdisciplinary"}