{"title":"The mitigative role of novel aflatoxin‐degrading enzymes in diverse broiler performance indicators and gut microbiota following the consumption of diets contaminated with aflatoxins","link":"https://scijournals.onlinelibrary.wiley.com/doi/10.1002/jsfa.13564?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>This study aims to explore both the toxic effects of aflatoxins (AFs) and the protective effects of degrading enzymes (DE) on broilers exposed to AFs.</p>\n<h2>RESULTS</h2>\n<p>The findings reveal that a diet contaminated with 69.15 μg kg<sup>−1</sup> of aflatoxin B<sub>1</sub> had significant adverse effects on broilers. Specifically, it led to a reduction in average daily gain, dressed yield percentage, half-eviscerated yield with giblet yield percentage, eviscerated yield percentage, as well as serum superoxide dismutase (SOD), glutathione peroxidase activity and liver SOD activity (<i>P</i> &lt; 0.05). Conversely, the diet increased the feed conversion ratio, liver index, serum glutamic oxaloacetic transaminase levels and malondialdehyde levels in both serum and liver (<i>P</i> &lt; 0.05). Additionally, AFs disrupted the intestinal microflora significantly (<i>P</i> &lt; 0.05), altering the relative abundance of <i>Enterococcus</i>, <i>Lactobacillus</i> and <i>Escherichia</i> in broiler jejunum. The addition of DE to AF-contaminated feed mitigated these negative effects and reduced the residues of aflatoxin B<sub>1</sub>, aflatoxin B<sub>2</sub> and aflatoxin M<sub>1</sub> in the liver and duodenum (<i>P</i> &lt; 0.05). We also observed that broilers fed the diet pelleted at 80 °C exhibited improved dressing percentage and water holding capacity compared to those on the 75 °C diet.</p>\n<h2>CONCLUSION</h2>\n<p>In summary, DE serves as an effective feed additive for mitigating AF contamination in poultry production. © 2024 Society of Chemical Industry.</p>","author":"Ru Jia, \nSenmiao Tian, \nZhaofeng Yang, \nSimeng Lu, \nLan Wang, \nGuohua Zhang","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a0cd5cc59695abc9a439ff4ebe4fbb5053d5b3d6398eba622f495082a238e8e4","category":"Environment"}