{"title":"PSVIII-14 The significance of colostrum quality on feed efficiency in Canadian Holstein calves","link":"https://academic.oup.com/jas/article/102/Supplement_3/592/7757692?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>For a more sustainable dairy industry it is crucial to select for feed-efficient cattle. Although feed efficiency research has primarily focused on lactating animals, genetic selection for feed efficiency in calves has continued to gain research interest. Previously estimated genetic parameters for pre-weaned calf feed efficiency suggest residual metabolizable energy intake (RMEI) as a potential trait for selection. However, the trait definition of RMEI needs further evaluation. In previous studies only the intake of colostrum, fed in the first hours of the lif of a calf, was included to define RMEI. The inclusion of colostrum quality ([grams of immunoglobulin (g IgG)] might better represent the transfer of passive immunity to calves and enhance the indicator trait for feed efficiency. Therefore, the objective of this study was to evaluate the impact of colostrum characteristics on estimating RMEI as a measure of calf feed efficiency in Canadian Holstein calves. Records from 330 pre-weaned Canadian Holstein calves between 0 and 65 d of age, born between 2016 and 2021 were provided by The Ontario Dairy Research Centre (Elora, ON, Canada). Data included calf health (incidence of scours, 1 = event, 2 = no event), feed intake (kg), body weight (BW; kg), and colostrum quality (g IgG) ranging between 17.41 and 151.69 g IgG. RMEI was estimated by four linear regression models using metabolizable energy intake (MEI) for two time periods (RMEI1 = first month of age calves, RMEI2 = second month of age calves) according to previous studies. For both time periods, colostrum quality was then included in the linear regression model, in addition to scours incidence, year and season, trial, and regression on average daily gain and metabolic BW to estimate RMEI corrected for colostrum quality (i.e., RMEIc1 and RMEIc2). Colostrum quality was fitted as a fixed effect with four classes (≤72 g IgG, 73-76 g IgG, 77-96 g IgG, ≥97 g IgG), divided according to the quartiles of its distribution. The inclusion of colostrum quality had a significant effect on MEI in the first month of age (<span>P</span> ± 0.001) and a trend for significance in the second month of age (<span>P</span> = 0.095). RMEIc model had an adjusted R<sup>2</sup> value of 0.86 with the inclusion of colostrum quality in the first time-period. As a next step, genetic parameters need to be estimated to determine any possible gain using RMEIc over RMEI. Improving the definition of RMEI will further the potential to select for feed efficiency in younger animals to achieve sustainability goals.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a0d6bf67310dc9165705d70cf34bf97e1417c59464c0a09073e51f24f9745c89","category":"Environment"}