{"title":"Impact of the Covid-19 pandemic on inpatient health care in Switzerland 2020–2021—A descriptive retrospective study using admission data of all Swiss hospitals","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306791","date":1720447200000,"content":"<p>by Brigitte Wirth, Michael Stucki, Reto Joerg, Christoph Thommen, Marc Höglinger</p>\r\nBackground <p>As part of the Covid-19-restrictions in Switzerland, a federal ban on non-urgent examinations and treatments was applied to all hospitals during six weeks in spring 2020 (“spring lockdown”). The aim of this study was to comprehensively investigate the consequences of the Covid-19 pandemic on Swiss inpatient admissions based on data of <i>all</i> hospitals, focusing on selected procedures of different medical urgency.</p> Methods <p>The study includes all acute care inpatient cases (including Covid-19 cases, excluding cases in psychiatry and rehabilitation) according to the Swiss Medical Statistics of Hospitals. Besides the total number of admissions, subdivided by regions, hospital types and age groups, we focused on selected procedures representing different medical urgency: elective surgeries, cancer surgeries, and emergencies. Procedures were selected based on expert interviews. We compared the number of admissions during spring lockdown and for the whole years 2020 and 2021 in absolute numbers and in percentage changes to the corresponding periods in 2019 (baseline year).</p> Results <p>During spring lockdown, the number of admissions decreased by 47,156 (32.2%) without catch-up effect by the end of 2020 (-72,817 admissions/-5.8%). With procedure-specific decreases of up to 86%, the decline in admissions was largest for elective surgery, a decline that was only fully reversed in the case of a few procedures, such as joint arthroplasty. Strikingly, admissions due to emergencies also substantially decreased during spring lockdown (stroke -14%; acute myocardial infarction STEMI: -9%, NSTEMI: -26%). Results for the selected procedures in cancer surgery showed no consistent pattern. In 2021, admission numbers for most procedures reached or even exceeded those in 2019.</p> Conclusions <p>The substantial reduction in admissions, particularly in elective procedures, may reflect the impact of the triage in favor of anticipated Covid-19-cases during spring lockdown. By the end of 2020, admissions were still at lower levels relative to the previous, pre-pandemic year. The numbers in 2021 reached the same levels as those in 2019, which suggests that the Covid-19 pandemic only temporarily impacted inpatient health care in Switzerland. Long-term consequences of the observed reduction in admissions for emergencies and cancer surgery need to be investigated at the individual level.</p>","author":"Brigitte Wirth","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a0da7b9d511fe6b48728395d010ba8d9b9fa274205af2bb40faf967bba741027","category":"Interdisciplinary"}