{"title":"How to build an Apple smart home","link":"https://www.macworld.com/article/230868/homekit-faq-apple-smart-home-homekit-siri-hom-scenes-automations.html","date":1616104469000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>We may not yet live in the world of the Smart Home, but we&rsquo;re getting there. Consumers are starting to outfit their homes with connected lights, locks, alarms, cameras, thermostats, garage doors&hellip;the list goes on and on. How is all of this stuff going to work together? Apple&rsquo;s answer is HomeKit. This quick primer will tell you what HomeKit is, how it works, and how to get started building your smart home around it.</p>\n\n\n\n<h2 class=\"toc\" id=\"what-is-homekit\">What is HomeKit?</h2>\n\n\n\n<p>First announced as <a href=\"https://www.macworld.com/article/2357527/apples-homekit-will-bring-smart-home-control-to-ios-8.html\">part of iOS 8</a> way back in in 2014, HomeKit is a software framework for making smart home stuff work with iPhones, iPads, and Apple Watch.</p>\n\n\n\n<p>Companies making smart home products have to adhere to specific technical standards and support Apple&rsquo;s HomeKit software interface and hardware guidelines in order to be HomeKit certified. Apple used to require a specific hardware security chip in HomeKit compatible devices, but announced a new software-based solution in 2017. This opens the door to many more supported products, and many existing products can add HomeKit support through a software update.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image\"><img src=\"https://images.idgesg.net/images/article/2018/01/homekit-kitchen-100746502-large.jpg\" alt=\"homekit kitchen\"><figcaption><p>Apple&rsquo;s original pitch for HomeKit involved a vision that hasn&rsquo;t exactly come to pass. We&rsquo;re not all controlling our blinds with our iPhones just yet.</p>\n</figcaption></figure></div>\n\n\n\n<p>HomeKit allows you to set rooms, scenes, actions, and triggers to automate all your smart home gear. Want your phone to automatically detect your location and unlock the front door, turn on the downstairs lights, and start playing music when you get home from work? Want to lock the door and turn off all the lights at 11 p.m. every night? These are the scenarios HomeKit was made for.</p>\n\n\n\n<h2 class=\"toc\" id=\"what-is-the-home-app\">What is the Home app?</h2>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage right\"><div class=\"wp-block-image\"><figure class=\"alignright\"><img src=\"https://images.idgesg.net/images/article/2018/01/homekit-home-100746501-medium.jpg\" alt=\"homekit home\"><figcaption><p>The Home app is your central hub for managing and controlling your HomeKit accessories.</p>\n</figcaption></figure></div></div>\n\n\n\n<p>Initially, Apple left control of HomeKit-enabled devices to third party software developers. That turned out to be a bit of a mess, so iOS 10 brought us the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/home/id1110145103&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Home app</a>.</p>\n\n\n\n<p>In the Home app you&rsquo;ll view and manage your HomeKit-enabled devices. But more importantly, you&rsquo;ll create &ldquo;Rooms&rdquo; where they all live, and then combine products into &ldquo;scenes.&rdquo;&nbsp;</p>\n\n\n\n<p>For example, you may make a scene called &ldquo;Good Night&rdquo; that, when you select it, turns off all your HomeKit-enabled lights, locks your HomeKit-enabled front door lock, and adjusts your thermostat to a cooler temperature.&nbsp; Think of Scenes as macros that set a group of smart home devices at once.</p>\n\n\n\n<p>The Home app also allows you to build &ldquo;Automations,&rdquo; which are rules to control your smart home gear without your intervention. You can set certain actions to happen at a specific time of day, or when specific people arrive home or leave home (based on their iOS device location). You can make one device trigger another, too: think turning on lights when your front door is unlocked, or when a motion detector is triggered.</p>\n\n\n\n<p>Apple has a <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT204893&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">detailed help page</a> showing how to set up and use the Home app.</p>\n\n\n\n<h2 class=\"toc\" id=\"which-smart-home-products-work-with-homekit\">Which smart home products work with HomeKit?</h2>\n\n\n\n<p>There are too many to list them all. Apple has a page listing all the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apple.co/3eUyDFy&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">smart home accessories supported by HomeKit</a>. Popular brands include LIFX, Elgato, Honeywell, Hunter, August, Kwikset, and Logitech.</p>\n\n\n\n<p>Perhaps as important as the brands that have HomeKit-enabled products are those that do not. Of note, Nest does not support HomeKit with any of its products, nor does popular home security company ADT.&nbsp;</p>\n\n\n\n<h2 class=\"toc\" id=\"how-does-homekit-work-with-siri\">How does HomeKit work with Siri?</h2>\n\n\n\n<p>Once you add your devices to the Home app, you can easily control them with Siri.&nbsp;</p>\n\n\n\n<p>Siri will recognize the homes, rooms, zones, and automations you&rsquo;ve set and can respond accordingly. Here are just a few examples:</p>\n\n\n\n<ul><li>&ldquo;Turn off the lights in the family room.&rdquo;</li><li>&ldquo;Set brightness to 55 percent.&rdquo;&nbsp;</li><li>&ldquo;Set the temperature to 68 degrees.&rdquo;&nbsp;</li><li>&rdquo;Did I lock the front door?&rdquo;&nbsp;</li><li>&rdquo;I&rsquo;m home.&rdquo;</li><li>&ldquo;Turn on the fan in the office.&rdquo;&nbsp;</li><li>&ldquo;Set my reading scene.&rdquo;&nbsp;</li><li>&ldquo;Turn off the lights in the Chicago house.&rdquo;&nbsp;</li></ul><p>Some accessories will not work with Siri unless you unlock your phone, as a security measure. Door locks, for example: You wouldn&rsquo;t want someone who had stolen your phone to be able to say &ldquo;Siri, unlock my front door&rdquo; and get inside your house.&nbsp;</p>\n\n\n\n<h2 class=\"toc\" id=\"what-are-scenes-and-automations\">What are Scenes and Automations?</h2>\n\n\n\n<p>Scenes are groups of settings that control multiple accessories at once. This is especially useful with lights. You can set a scene called &ldquo;Arrive Home&rdquo; that unlocks the front door and turns on the lights in the living room and hall, for example. Then, with a single tap (or Siri command) you can activate everything. A &ldquo;Nighttime&rdquo; scene might dim the lights in the living room and turn on the lights in the bedroom, or a &ldquo;Good Night&rdquo; scene might turn off everything and adjust your thermostat to 68 degrees.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/ios14-home-automation-apple-1.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100059008\"><figcaption>Automations are a way to trigger several smart home devices whenever something specific happens.</figcaption></figure><p class=\"imageCredit\">Apple</p></div>\n\n\n\n<p><a rel=\"nofollow\" href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://support.apple.com/en-us/HT207057&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\">Automations</a> are triggers used to control your HomeKit accessories without even needing to tap on anything. In order to set Automations, you must have a &ldquo;home hub&rdquo; (a 4th generation Apple TV or Apple TV 4K, or an iPad) that remains in your home and connected to Wi-Fi. You can then set triggers to apply scenes to control accessories whenever certain conditions are met. When you arrive home, or leave, or whenever a certain sensor is triggered. For example, you can make a motion sensor turn on all the lights in a room, but only between the hours of 8 p.m. and 6 a.m., and only when you&rsquo;re not at home.&nbsp;</p>\n\n\n\n<h2 class=\"toc\" id=\"can-i-use-accessories-that-dont-support-homekit\">Can I use accessories that don&rsquo;t support HomeKit?</h2>\n\n\n\n<p>Yes! Just because you use an iPhone doesn&rsquo;t mean you&rsquo;re forbidden from using products that only support Alexa, Google Assistant, or other smart home ecosystems.</p>\n\n\n\n<p>The catch is, those smart home devices won&rsquo;t appear in the Home app, and you can&rsquo;t easily control them with Siri. You&rsquo;ll need to open the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/google-home/id680819774&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Google Home app</a>, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://apps.apple.com/us/app/amazon-alexa/id944011620&amp;xcust=1-1-230868-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">Amazon Alexa app</a>, or the app from the maker of your smart home product. That may not be a big deal if you&rsquo;ve got Google Home or Alexa devices at home, but it&rsquo;s a little bit clunky if you want to control your smart home devices with your iPhone or iPad.</p>\n</div></body></html>","author":"Jason Cross","siteTitle":"Why the next iPad Pro will be closer than ever to a Mac","siteHash":"7b8e50ee24918aa4b0ece52f9db5bd351585151def14e1e810af7a8801e1e873","entryHash":"a0dd6d6444e9be4bbc72040634c0240169ed6e721d0ac9a92fa753cdb3b36fdd","category":"Apple"}