{"title":"What is a fat bike? Everything you need to know about fat-tyre bikes","link":"https://www.bikeradar.com/advice/buyers-guides/best-fat-bike/","date":1680699622000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=45&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=45&amp;resize=2400,1598 2400w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=45&amp;resize=1920,1278 1920w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/03/TK22MY23FarleyMunisingMIDR0698-c044346.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Trek Farley 7 packed in snow\" title=\"Trek Farley 7 packed in snow\" />                                            <p>The monster trucks of the cycling world, fat bikes can venture to places other bikes can only dream of.</p>\n<p>But what exactly are fat tyre bikes and do they make sense? In this article, we will explain their uses, pros and cons.</p>\n<p>We’ll also explain the key things to consider when shopping for fat bike components, including what to look for with fat bike tyres.</p>\n<h2>What is a fat bike?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Fat bikes are defined by their voluminous tyres.</span></figcaption><span> <i>Josh Patterson / Immediate Media</i></span></div>\n<p>In short, a fat bike is a bicycle with very wide tyres, usually at least 3.8 inches in width.</p>\n<p>They come in all shapes and sizes, but are usually geared up for off-road adventure riding and <a href=\"https://www.bikeradar.com/features/routes-and-rides/bikepacking/\">bikepacking</a>.</p>\n<p>Fat bikes commonly rely on their high-volume tyres for absorbing impacts from the trail, however, full-suspension fat bikes are also available.</p>\n<h2>What is a fat bike good for?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Surly was one of the first brands to bring fat bikes to market.</span></figcaption><span> <i>Surly</i></span></div>\n<p>Originally designed to be ridden on sand and snow, the massive contact patch between tyres and ground enables fat bikes to float on top of soft terrain, where other bikes quickly sink and become stuck.</p>\n<p>However, fat-tyred bikes aren’t confined to beaches, bogs and <a href=\"https://www.bikeradar.com/features/winter-mountain-biking-what-to-wear-where-to-ride-and-how-to-set-up-your-bike/\">winter riding</a> – they offer incredible grip on any terrain.</p>\n<p>Due to their high volume, fat bike tyres can be run at <a href=\"https://www.bikeradar.com/advice/workshop/trail-tech-mountain-bike-tyre-pressure-all-you-need-to-know/\">very low pressures</a> (between 5 and 15psi), giving them a floaty ride feel as the bike hoovers up roots, bumps and anything else you may come across on the trail.</p>\n<p>Fat bikes are also very popular among adventure riders and bikepackers, especially when the route involves sandy or snowy stretches, and are often designed with mounting points for extra kit and <a href=\"https://www.bikeradar.com/advice/buyers-guides/bikepacking-bags/\">bikepacking bags</a>.</p>\n<h2>What are the disadvantages of fat bikes?</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Fat bikes – even ‘mid-fat’ bikes with 3in tyres – aren’t the best for technical descents.</span></figcaption><span> <i>Steve Behr</i></span></div>\n<p>The most obvious pay-off is the increased weight brought about by the massive tyres, rims and oversized components (more on that later).</p>\n<p>Despite their floaty ride feel, fat bikes are limited on technical descents.</p>\n<p>Their wide tyres can feel very vague when precise riding is required. The large undamped air volume can create a pogo-stick-like ride when the trails get fast and rough.</p>\n<p>Braking performance on steep trails is also sub-par compared to other <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike/\">mountain bikes</a>.</p>\n<p>Fat bikes have a very high rotating mass, meaning a lot of braking power is required to slow down their wheels.</p>\n<p>Cost and component choice are also factors worth considering.</p>\n<p>Fat bikes require specialist parts such as tyres, rims, hubs and cranks.</p>\n<p>These can be more expensive than comparable parts for regular bikes and are often harder to come by, meaning there is less of a choice when it comes to speccing your bike.</p>\n<h3>Are fat bikes harder to pedal?</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> While fat bike races exist, they shouldn’t be your first choice if going fast is your primary goal.</span></figcaption><span> <i>Josh Patterson / Our media</i></span></div>\n<p>A common question is whether the big tyres make fat bikes harder to pedal than a regular mountain bike.</p>\n<p>The answer is not entirely straightforward and depends on what (comparatively) skinny-tyred mountain bike is used as a reference point.</p>\n<p>Fat bikes are indeed generally heavier than non-fat bikes. This can make them harder to pedal, especially uphill. The extra rotating mass and increased rolling resistance also makes them harder to get up to speed and limits their acceleration.</p>\n<p>However, in some situations, such as slippery technical climbs, fat bikes benefit from their increased traction and make light work of terrain that would leave regular bikes guessing.</p>\n<h2>What types of fat bike are there?</h2>\n<p>Made to take you off the beaten track, fat bikes are designed with adventure riding in mind.</p>\n<p>While they all share wide 3.8 to 5-inch <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-tyres/\">mountain bike tyres</a>, there are three key categories into which they can be grouped.</p>\n<h3>Hardtail or rigid fat bikes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Most fat bikes, such as the Salsa Beargrease pictured, don’t have suspension.</span></figcaption><span> <i>Salsa</i></span></div>\n<p><a href=\"https://www.bikeradar.com/advice/buyers-guides/best-hardtail-mountain-bikes/\">Hardtail</a> frames are the most common choice for fat bikes because they are lighter and easier to maintain.</p>\n<p>Without <a href=\"https://www.bikeradar.com/features/the-ultimate-guide-to-mountain-bike-rear-suspension-systems/\">rear suspension</a>, hardtail fat bikes rely entirely on their oversized tyres to provide grip and comfort on the trail.</p>\n<p>Some fat-tyre mountain bikes come specced with a specially designed suspension fork, but because the bikes aren’t designed with aggressive trail or enduro riding in mind, it’s just as common to see a fully rigid fork instead, especially on budget-priced options.</p>\n<h3>Full-suspension fat bike</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Full-suspension fat bikes are rare beasts.</span></figcaption><span> <i>Russell Eich / Immediate Media</i></span></div>\n<p>Full-suspension fat bikes are a rare sight on the trails. Full-suspension frames are, by nature, heavier and more complex than hardtails.</p>\n<p>Fat bikes further exaggerate these differences, because their frames are designed around accommodating super-wide tyres, meaning tyre clearance, axle spacing and wide <a href=\"https://www.bikeradar.com/features/what-is-a-bottom-bracket/\">bottom bracket</a> junctions have to take priority over optimising suspension layouts.</p>\n<p>While some fat-tyre riders may benefit from the extra grip and control made possible by rear suspension, the overall use case of fat bikes renders them somewhat irrelevant when compared to the lighter and simpler designs enabled by hardtails.</p>\n<h3>Electric fat bikes</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Electric fat bikes are generally designed for urban riding.</span></figcaption><span> <i>Russell Burton / Immediate Media</i></span></div>\n<p>Electric innovation is taking the world of cycling by storm, so it’s hardly surprising to see fat bikes joining the <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a> crowd.</p>\n<p>However, it seems the mid-to-high-end fat bike market has been slow to adopt the trend. Looking at their intended use, it’s easy to see why.</p>\n<p>Fat bikes are designed as adventure bikes, capable of taking on the extremes of sand, mud and snow-covered terrain.</p>\n<p>While an <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motor</a> may help them cover ground more quickly, the extra weight and finite battery capacity hinder their performance and adventurous intentions.</p>\n<h2>Fat bike components explained</h2>\n<p>Fat bikes require specialist frames and components to accommodate their massive tyres, which can make finding spares a tricky and expensive affair.</p>\n<p>Here’s what sets fat bike components apart.</p>\n<h3>Fat bike wheels</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Fat bike wheels are wide – really wide.</span></figcaption><span></span></div>\n<p>Fat bikes are one of the few modern bike types still using <a href=\"https://www.bikeradar.com/mtb/mountain-bike-wheel-sizes-26in-650b-and-29in-explained/\">26-inch wheels</a> (alongside other niche examples such as <a href=\"https://www.bikeradar.com/advice/buyers-guides/dirt-jump-bikes/\">dirt jump bikes</a>).</p>\n<p>Some 27.5-inch fat bikes are also available, however, the smaller wheel size is the more common of the two.</p>\n<p>Built to accommodate massive tyres and provide huge air volume, fat bike rims are wider and heavier than most. Their width ranges from 50mm to over 100mm, with the sweet spot for most tyres sitting at 60 to 80mm.</p>\n<h3>Fat bike tyres</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Fat bike treads are, generally speaking, less aggressive than narrower mountain bike tyres.</span></figcaption><span> <i>Oli Woodman/BikeRadar</i></span></div>\n<p>With the majority of the grip being created by the tyre’s massive contact patch, tread designs take somewhat of a back seat on fat bike tyres.</p>\n<p>A tyre with a medium level of tread is a great starting point, because aggressive tread can exaggerate the squirm of fat tyres even further when riding on firm ground.</p>\n<p>Weight savings should also take a back seat when it comes to choosing a fat bike tyre.</p>\n<p>Usually, the heavier the tyre, the better damped it will be – important for minimising pogo-stick rebound and improving comfort on rougher trails.</p>\n<p>Because fat bike tyres are run at very low pressures (under 15psi), seemingly small changes (as little as 1psi higher or lower) can have a big impact on the bike’s handling.</p>\n<p>Therefore, it’s recommended to invest in a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-tyre-pressure-gauges/\">digital pressure gauge</a> and to check your tyre pressure before each ride.</p>\n<h3>Fat bike suspension</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Mainitou makes a fat-bike specific suspension fork.</span></figcaption><span> <i>Russell Eich / Our Media</i></span></div>\n<p>While the tyres generate grip, the suspension on a fat bike is there to provide damping and comfort.</p>\n<p>Special <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-mountain-bike-suspension-forks/\">suspension forks</a> are required to bridge the wide tyres, with the most common front axle spacing measuring 150mm in width. Brands such as <a href=\"https://www.bikeradar.com/advice/buyers-guides/rockshox-suspension-fork-guide/\">RockShox</a> and Manitou are the ones to look out for because both have dedicated fat bike forks in their range.</p>\n<h3>Drivetrain</h3>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Fat bike cranksets have a wider Q-factor than regular cranksets.</span></figcaption><span> <i>James Huang / Our Media</i></span></div>\n<p>Fat bikes can run the same <a href=\"https://www.bikeradar.com/advice/buyers-guides/1x-drivetrains/\">1x drivetrains</a> as the best modern mountain bikes. However, due to their super-wide rear-hub spacing (commonly 197x12mm, though that’s by no means a universal standard), they also require a very wide bottom bracket junction to keep the chain line in check.</p>\n<p>This has resulted in fat bikes exhibiting Q-factors of around 200mm, which means riders will have their feet roughly 30mm wider apart than on a normal bike.</p>\n<p>This wider pedalling position can take some getting used to and also reduces pedal clearance on tight trails.</p>","author":"Finlay Anderson","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a0f068aba2b1237b2945206aaaecc011aeb92a06b007920515a4addfe0270fdd","category":"Cycling"}