{"title":"294 The use of dried bakery products as an alternative ingredient in dog food","link":"https://academic.oup.com/jas/article/102/Supplement_3/107/7757370?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Utilizing upcycling food materials that otherwise go to waste, such as dried bakery products (DPB), in pet food offers an opportunity to promote sustainability within the pet food industry. However, utilization of DBP as an ingredient in dog food has yet to be evaluated. This study aimed to assess the canine response to including DBP on extruded diets. Four diets were extruded containing 0% (control), 8.5%, 17% or 22.5% of DBP, replacing brown rice, lentil and sorghum (Table 1). Palatability was assessed using 20 dogs in a split-plate test with control presented against each other diet to determine intake ratio (IR) and first choice (FC). In a second study, experimental diets were fed to 12 adult Beagle dogs enrolled in replicated 4 x 4 Latin square design (9 d of diet adaptation and 5 d of sample collection) to evaluate apparent total tract digestibility (ATTD) of energy and macronutrients, and fecal characteristics. Statistical analyses were conducted using the GLIMMIX procedure in SAS with diet as a fixed effect, and square, dog nested within square and period as random effects. For palatability, IR was analyzed in a 1-way ANOVA and FC using a Chi<sup>2</sup> test. Dogs did not (<span>P</span> &gt; 0.05) have a preference when the control and 8.5% DBP diets were compared. However, they preferred (<span>P</span> &lt; 0.05) the control over the diets with greater inclusion of DBP based on both IR and FC. In the second study, food intake was similar (<span>P</span> &gt; 0.05) among all treatments. Dogs fed diets containing DBP had greater (<span>P</span> &lt; 0.05) dry fecal outputs compared with those fed the control diet, but fecal quality scores remain within acceptable range. Inclusion of DBP quadratically decrease (<span>P</span> &lt; 0.05) ATTD of dry matter, organic matter, protein, fat and gross energy, but coefficients were still within acceptable ranges (&gt; 80%). No effect (<span>P</span> &gt; 0.05) of dietary treatment was observed on fecal pH. Concentrations of fecal volatile fatty acids, however, were greater (<span>P</span> &lt; 0.05) in dogs fed control compared with those fed 17% and 22.5% DBP, with dogs fed 8.5% DBP not differing (<span>P</span> &gt; 0.05) from those fed the other dietary treatments. Nonetheless, there was no effect (<span>P</span> &gt; 0.05) of diet on the relative proportion of each short chain fatty acid (acetate, butyrate, propionate) or branched chain fatty acid (valerate, isobutyrate and isovalerate). The findings of this study suggest that at 8.5% DBP can replace certain grains and legumes in extruded dog diets without affecting palatability and digestibility. Although greater inclusion of DPB reduced ATTD of macronutrients and energy, additional research is needed to determine the optimal amount of DBP to be used in combinations with other grains and legumes.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a0fb03f82942bcd62a43bb05ba9c9f837beaea22ab71c3b90b9fa1fa4bf94368","category":"Environment"}