{"title":"Mavic plots brand rebirth with new X-Tend motor – and it’s claimed to be lightest on the market","link":"https://www.bikeradar.com/news/mavic-xtend-motor/","date":1681286405000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=620,413\" srcset=\"https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=45&amp;resize=1440,959 1440w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=45&amp;resize=1200,799 1200w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=960,639 960w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=720,479 720w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=576,383 576w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=360,239 360w, https://images.immediate.co.uk/production/volatile/sites/21/2023/04/Mavic-eMotor-launch-news-story-05-79c5bb6.jpg?quality=90&amp;resize=180,119 180w\" width=\"620\" height=\"413\" alt=\"Mavic X-Tend prototype electric bike motor system - launch story\" title=\"Mavic eMotor launch - news story - 05\" />                                            <p>Mavic claims its new X-Tend electric bike motor will be the lightest mid-mounted motor on the market.</p>\n<p>It’s the French brand’s first foray into pedal assistance motors and is designed to compete with <a href=\"https://www.bikeradar.com/advice/buyers-guides/electric-bike-motors/\">electric bike motors</a> from established brands such as Shimano, Bosch and Yamaha.</p>\n<p>Mavic says the way the drive unit mounts means brands need to make fewer modifications to their bikes at the design stage to accommodate the motor.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The new X-Tend motor system is barely noticeable on this BMC Teammachine mule bike.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The X-Tend is also claimed to deliver the most natural-feeling ride experience of any motor.</p>\n<p>The new motor is still in its prototype phase, as Mavic looks to show off the work that has continued to go on behind the scenes through a troubled few years in which it has emerged from receivership.</p>\n<p>The system won’t be specced on production <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-bikes/\">electric bikes</a> until 2025 or 2026, but Mavic says it has multiple bike brands interested in the system.</p>\n<h2>A troubled start</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The new motor has emerged from a turbulent five years for the French brand.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The X-Tend motor is a big deal for Mavic, representing a four-year development project with BMC, and five years since the designs first started hitting the drawing board.</p>\n<p>It technically pre-dates the company’s sale to American investors (by the Amer Sports group), subsequent financial troubles, receivership, and eventual 11th-hour buy-out by the French Bourrelier investment group.</p>\n<p>It’s been a rocky development road for the system from the start, occurring alongside “necessary” downsizing, restructuring and investment in the company, also punctuated by the Covid-19 pandemic.</p>\n<p>However, with the recent opening of its €10m-plus headquarters on the fringes of Annecy, the launch of the <a href=\"https://www.bikeradar.com/news/mavic-cosmic-ultimate-45-disc/\">Cosmic Ultimate SLR wheelset</a>, and now diversifying into ebike motor technology, the ‘new Mavic’ would appear to be taking its first confident strides back to prominence.</p>\n<h2>The lightest ebike motor?</h2>\n<p> </p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The X-Tend motor could lead to even lighter ebike designs.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Mavic positions the new X-Tend motor system as capable of delivering the most efficient rider experience, with the most natural ride quality, while achieving the lightest weight in the ebike category.</p>\n<p>It says it will be possible to design sub-10kg <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-road-bikes/\">electric road bikes</a> that use the motor.</p>\n<p>Mavic has worked with BMC to design the mounting system for the motor. A Teammachine with a modified bottom bracket area houses the drive unit, battery and control system.</p>\n<p>All-in, on a 58cm test bike complete with a <a href=\"https://www.bikeradar.com/reviews/components/groupsets/groupset-road/shimano-dura-ace-di2-r9200-review/\">Shimano Dura-Ace Di2 R9200</a> groupset and Mavic’s Ultimate SLR wheelset, the entire prototype weighs 9.7kg without pedals.</p>\n<p>The motor system is claimed to weigh 3.2kg, including the drive unit (1.2kg), battery (1.8kg), and bottom bracket bearings, sensors and power meter.</p>\n<p>Mavic says it expects to be able to achieve a sub-9kg system weight before long. This compares to current electric road bikes, which weigh in the region of 11kg.</p>\n<p>For context, Pinarello says its<a href=\"https://www.bikeradar.com/news/pinarello-nytro-2023/\"> Nytro E9</a> bike is the lightest on the market, weighing a claimed 11.4kg with a TQ motor system.</p>\n<p>The X-Tend motor system is targeted primarily at the electric road and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-gravel-bikes/\">electric gravel bike</a> markets first, although it could be tailored for urban and <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-electric-mountain-bikes/\">e-MTB</a> usage, according to Mavic’s product manager Maxime Brunand.</p>\n<h2>Easy integration for designers, natural feeling for riders</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The bottom bracket zone needs adapting, but Mavic says no other structural adaptations are required.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Mavic says the X-Tend system enables bike brands to design standard and electric bike frames alongside each other, rather than necessitating comprehensive redesigns to accommodate the motor and battery.</p>\n<p>In theory – and as demonstrated by BMC – this means a brand would only need to modify the bottom bracket area, plus include internal housing for the battery, charge port and top tube control unit.</p>\n<p>This compares to Fazua’s Evation motor system, which requires more extensive modifications to be accommodated into a frame, including a drop-out battery design in the down tube.</p>\n<p>Mavic says such minimal integration means brands can keep the overall characteristics of a pre-existing bike, which leads to a more natural ride feel. It believes this is one of the leading issues for a potential road and gravel ebike customer.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> Bike brands will need to keep the holes underneath to aid cooling.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The brand also says that although a rear-hub based motor arguably requires fewer design changes, a mid-mounted motor retains wheel upgradeability (again, something it thinks detracts from the appeal of ebikes).</p>\n<p>The X-Tend drive unit is 87mm in diameter. It slots into an 88mm-diameter oversized bottom bracket shell of sorts.</p>\n<p>The device is cylindrical in shape, and uses a brushless motor that can spin up to 4,500rpm. This connects to a patented two-ring cycloidal reducer, which in turn connects to a clutch mechanism.</p>\n<p>A standard crankset can be fitted to the motor system, attaching via a simple add-on bracket. Our test bike used a Dura-Ace R9200 crankset.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The crankset spindle runs through the X-Tend motor, just like a regular bottom bracket interface.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The driveside face of the motor unit features a faceplate. This engages with a bracket that is fitted to a crankset. Assistance is delivered through this.</p>\n<p>The outer plates also feature a <a href=\"https://www.bikeradar.com/advice/buyers-guides/freehubs/\">two-pawl freehub design</a>. This enables the motor to mechanically disengage completely from the<a href=\"https://www.bikeradar.com/advice/buyers-guides/drivetrains-explained-all-of-the-parts-that-make-your-bike-go/\"> drivetrain</a> when not in use.</p>\n<p>Mavic says it’s the only brand with such a design, which allows the crankset to spin freely on the bottom bracket bearings alone with the chain disconnected.</p>\n<p>Mavic says the motor adds “zero” resistance to the drivetrain when not in use.</p>\n<h2>Accurate power and assistance</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The system includes a power meter (+/- 2 per cent accuracy, claimed) and a speed sensor with a magnet mounted to the rotor lockring.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Pedal assistance can be delivered in three modes – 30 per cent, 60 per cent and 120 per cent of rider’s input – but Mavic says this will be customisable up to 150 per cent in future.</p>\n<p>The 250W-rated motor is capable of delivering up to 390W peak power, and up to 50Nm of torque for short periods.</p>\n<p>The motor includes a <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-power-meters/\">power meter</a> (accurate to +/-2 per cent) to measure rider input. Mavic says this, in tandem with a speed sensor integrated into the rear chainstay and accompanying brake rotor lockring magnet, delivers the most accurate power measurement of any electric motor.</p>\n<p>A 360Wh battery is housed in the down tube. Mavic claims BMC didn’t have to modify the tube size to accommodate it.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The neat control unit gives access to three power modes and a battery readout.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The control unit is positioned on the top tube, behind the stem.</p>\n<p>Mavic has not made claims about the system’s range, but says its testers have seen real-world total ascent hit 3,000m on one charge.</p>\n<p>The charge port is housed on the lower portion of the seat tube, although there’s no reason why this or the control unit couldn’t be positioned elsewhere should a brand decide to do so. Mavic also says handlebar remote controls are in development.</p>\n<p>Mavic says it’s also working on a range extender that will fit to bottle cage eyelets.</p>\n<p>Also in development is a smartphone app. Mavic claims this will enable riders to remove motor power from ride logs. A Garmin IQ app is also in the works.</p>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> A phone app is in development, which can record total and disassociated power. It will also record diagnostic data in the background for service centres to troubleshoot issues.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>Mavic says riders interested in their own power numbers should be able to enjoy the benefits of the integrated power meter without needing to add their own (as long as they’re happy to settle for +/- 2 per cent claimed accuracy).</p>\n<p>Brunand also says integration with <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-cycling-apps/\">cycling apps</a> such as <a href=\"https://www.bikeradar.com/news/strava-spotify-integration/\">Strava</a> is theoretically possible, too.</p>\n<p>The smartphone app will also enable user customisation of the drive unit, with factors such as reactivity, power delivery and speed cut-off all modifiable. The app will also enable diagnostic data to be gathered in the cloud, with Mavic service centres able to access it in the event of a problem.</p>\n<h2>Competitive pricing, brand-wide availability</h2>\n<div>\n    <img width=\"620\" height=\"413\" alt title /></div><div><figcaption><span><i></i> The charge port features on the left side of the lower seat tube.</span></figcaption><span> <i>Ashley Quinlan / Our Media</i></span></div>\n<p>The X-Tend motor system is still in development, but Mavic hopes to have it included in ebikes hitting the market for “around 2025-2026”.</p>\n<p>When it comes to market, Mavic says X-Tend will be priced competitively versus systems from Fazua and TQ.</p>\n<p>The motor will only be available for bike brands to purchase, so there’s no chance of buying a compatible frameset and motor and building it yourself.</p>\n<p>Mavic says it doesn’t intend to launch the motor with an exclusive launch partner, but didn’t rule it out either. It suspects BMC, its development partner, will likely feature as the system’s launch partner when the time comes, with more brands to follow soon after.</p>","author":"Ashley Quinlan","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a10261a764b030976341f016d0708e8765dd61d95750ea4117a62b524a8b88fe","category":"Cycling"}