{"title":"Estimating immunization coverage at the district level: A case study of measles and diphtheria-pertussis-tetanus-Hib-HepB vaccines in Ethiopia","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003404","date":1721916000000,"content":"<p>by Latera Tesfaye, Tom Forzy, Fentabil Getnet, Awoke Misganaw, Mesfin Agachew Woldekidan, Asrat Arja Wolde, Samson Warkaye, Solomon Kassahun Gelaw, Solomon Tessema Memirie, Tezera Moshago Berheto, Asnake Worku, Ryoko Sato, Nathaniel Hendrix, Meseret Zelalem Tadesse, Yohannes Lakew Tefera, Mesay Hailu, Stéphane Verguet</p>\r\n\r\nEthiopia has made significant progress in the last two decades in improving the availability and coverage of essential maternal and child health services including childhood immunizations. As Ethiopia keeps momentum towards achieving national immunization goals, methods must be developed to analyze routinely collected health facility data and generate localized coverage estimates. This study leverages the District Health Information Software (DHIS2) platform to estimate immunization coverage for the first dose of measles vaccine (MCV1) and the third dose of diphtheria-pertussis-tetanus-Hib-HepB vaccine (Penta3) across Ethiopian districts (“woredas”). Monthly reported numbers of administered MCV1 and Penta3 immunizations were extracted from public facilities from DHIS2 for 2017/2018-2021/2022 and corrected for quality based on completeness and consistency across time and districts. We then utilized three sources for the target population (infants) to compute administrative coverage estimates: Central Statistical Agency, DHIS2, and WorldPop. The Ethiopian Demographic and Health Surveys were used as benchmarks to which administrative estimates were adjusted at the regional level. Administrative vaccine coverage was estimated for all woredas, and, after adjustments, was bounded within 0–100%. In regions with the highest immunization coverage, MCV1 coverage would range from 83 to 100% and Penta3 coverage from 88 to 100% (Addis Ababa, 2021/2022); MCV1 from 8 to 100% and Penta3 from 4 to 100% (Tigray, 2019/2020). Nationally, the Gini index for MCV1 was 0.37, from 0.13 (Harari) to 0.37 (Somali); for Penta3, it was 0.36, from 0.16 (Harari) to 0.36 (Somali). The use of routine health information systems, such as DHIS2, combined with household surveys permits the generation of local health services coverage estimates. This enables the design of tailored health policies with the capacity to measure progress towards achieving national targets, especially in terms of inequality reductions.","author":"Latera Tesfaye","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a105f66d33195f0bf5f6ccb729b5c6b2a894ab015deb474ec3bf62577c628084","category":"Environment"}