{"title":"Is Geraint Thomas' career heading for an age-defying grand finale?","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/is-geraint-thomas-career-heading-for-an-age-defying-grand-finale","date":1698476401000,"content":"\n      <p>With each year that passes during what must surely be the twilight of Geraint Thomas’ career, it seems there’s a new age-defying record he aims to break. In 2022, he went into the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> looking to become the oldest winner of the race in a century. Then, last year, it was the status as the oldest winner in the whole history of the <a href=\"https://www.rouleur.cc/pages/giro-ditalia\">Giro d’Italia</a> that was his primary objective.</p>\n<p>Though he didn’t quite manage to achieve either milestone, Thomas is not done yet. Earlier this week, he signed a new two-year contract renewal with Ineos Grenadiers, committing him to continue racing at the highest level until the end of the 2025 season, by which time he will have reached the grand old age of 39.</p>\n<p>Thomas is bucking the trend of many of the other stalwarts of his generation. As the 2023 season has come to a close, the likes of Peter Sagan, Thibaut Pinot and Greg Van Avermaet have all decided to bow out of the sport, following in the footsteps of Philippe Gilbert, Tom Dumoulin, Vincenzo Nibali and Alejandro Valverde a year earlier. The rapid rise of a new generation has seen them usurped, unable to keep up with the race in a quickly evolving peloton.</p>\n<p>Against this new generation, and as he grows ever older, can Thomas really stay competitive in the biggest races? He certainly intends to and mentioned continuing to ride for GC at Grand Tours as among his potential targets for the upcoming seasons. And based on how he has ridden recently, you can see why. Though it will soon be six years since he won his one and only Grand Tour title, the 2018 Tour de France, he did come close in both of the aforementioned record attempts: only Jonas Vingegaard and Tadej Pogačar finished higher than him at the 2022 Tour de France, and he came just one day short of holding onto the pink jersey at the Giro d’Italia earlier this year before Primož Roglič took it from him in the climactic time trial.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW_Photography_-Giro_d_Italia_2023_-_Stage_20-04432.jpg?v=1698396784\" /><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><em><strong>See Geraint Thomas at Rouleur Live</strong></em></a></p>\n<p>However, as impressive as his ongoing longevity has been, there will surely come a time when age does at last begin to take its toll on Thomas’ body. He’s now 37 years old and will turn 38 during the final weekend of next year’s Giro d’Italia — which, given how frustrated he was to come so close to winning last year, and the expected strength of the 2024 Tour de France line-up, appears the most likely Grand Tour for him to target. Were he to win it, he’d not only break the previous oldest Giro winner Fiorenzo Magni’s record by more than three whole years, he’d also become the second oldest winner of any Grand Tour, behind only Chris Horner’s triumph at the 2013 <a href=\"https://www.rouleur.cc/pages/vuelta-a-espana\">Vuelta a España</a> at the age of 41.</p>\n<p>Doing so would therefore make him a historical anomaly and also buck a recent trend in cycling. Much is made of how cycling has become a young man’s game in recent years, and the stats regarding recent Grand Tour winners bear this out. Remarkably, in the 16 Grand Tours that have taken place since Thomas’ Tour victory in 2018, Primož Roglič and Sepp Kuss are the only riders to have won one over the age of 26. Even competitors in their late twenties are struggling to keep up; what hope for a man in his late thirties? Older riders have still managed to make the podium during that time, with Richie Porte (aged 34) and Steven Kruijswijk (32) doing so at the Tour in 2019 and 2020 respectively, Vincenzo Nibali (34), Damiano Caruso (33), and Mikel Landa (32) at the 2019, 2021 and 2022 Giro d’Italia, plus the notoriously evergreen Alejandro Valverde (39) at the 2019 Vuelta. But would another Grand Tour podium finish be enough to satisfy Thomas’ ambition?</p>\n<p>It could be that the next, and likely final, two years of Thomas’ career will see him take a new path away from Grand Tour GC bids. “I want to continue to be highly competitive in anything really,” he said upon signing the contract. “Maybe look at going to the Classics again or ride GC in Grand Tours or help whoever is going to be the next guy coming through. But I just want to have a positive impact on the team.”</p>\n<p>Targeting the Classics might be a way for Thomas to continue expanding his palmarès during his final years. Before he became the Grand Tour contender we know today, it seemed as though the Welshman would most likely find success as a one-day specialist. He made the top 10 at both the <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/tour-of-flanders-all-the-essential-info-for-the-flemish-monument\">Tour of Flanders</a> and <a href=\"https://www.rouleur.cc/blogs/the-rouleur-journal/paris-roubaix-everything-you-need-to-know\">Paris-Roubaix</a> in 2014, then claimed a major win a year later at E3 Harelbeke. He ceased prioritising them in the coming years as his climbing drastically improved, and he became a super-domestique for Chris Froome at the Tour de France and hasn’t finished either of the cobbled Monuments since 2016. But a change in training and preparation could see him make a successful return.</p>\n<p><img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ZW-00495_6d366ab1-195d-4bc5-be3f-9bc2a65b30c4.jpg?v=1698396860\" /><a href=\"https://www.rouleur.cc/pages/rouleur-live\"><em><strong>Hear from Geraint Thomas at Rouleur Live</strong></em></a></p>\n<p>Interestingly, the Classics in recent years have not been as dominated by younger riders as the Grand Tours have been. Though young starlets Tadej Pogačar and Remco Evenepoel have taken to one-day racing just as formidable as they have Grand Tours, there has, in general, been more room for success for older riders, with five of the last 25 Monuments having been won by riders in their thirties. Thomas could take particular inspiration from the Indian summers enjoyed by Jakob Fuglsang and Philippe Gilbert; Fuglsang won his first and second career Monument aged 34 and 35, while Gilbert’s 2019 Paris-Roubaix triumph came when he was 35.</p>\n<p>Failing that, if his legs do start to fade, then Thomas could alternatively settle into more of a support role at Ineos Grenadiers. His continued status as one of the team’s top GC candidates has as much to do with the likes of Egan Bernal’s inability to rediscover his best form as it is Thomas’ ongoing vitality. Yet as the team’s younger riders like Carlos Rodríguez, Thymen Arensman, Luke Plapp and Tom Pidcock continue to develop and learn the ropes of Grand Tour GC racing, he may soon find himself supporting them rather than vice versa — much like he did prior to his own rise to the top, in aid of Chris Froome. Having spent his whole career at Ineos, he clearly has a close affinity with the team and sounds very earnest when he states that he wants to “try and help us push forward to get back to the very top of the sport”. It was also a role he was very good at, with the diverse set of abilities and innate selflessness that made him an ideal super-domestique.</p>\n<p>However he ends up spending these next two years, Thomas is likely to remain one of the major players of the peloton.</p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a106353f1a4eb6f04fddcd2724dd49a197a325e085f171d205c09eae3696acd5","category":"Cycling"}