{"title":"New WebKit Features in Safari 15.2","link":"https://webkit.org/blog/12140/new-webkit-features-in-safari-15-2/","date":1639422818000,"content":"<p>The internet has always been about communication and collaboration. It started with asynchronous messages made of text. As it matured, the internet became real-time. Then the web came along, adding images, and later, video. Websites provided a means to publish, to broadcast, to run stores, to gather communities and create worlds.</p>\n<p>Now, the web is maturing to the point where web apps make rich collaboration experiences possible — including digital creation. Recent updates to WebKit bring a number of improvements to Safari 15.2 that focus on supporting creative applications and leveraging the incredible power of today’s hardware.</p>\n<h3>WebAssembly Enhancements</h3>\n<p><a href=\"https://developer.mozilla.org/en-US/docs/WebAssembly\">Web Assembly (Wasm)</a> is a low-level assembly language that allows a multitude of programming languages like C/C++, C#, Objective-C, Swift, Python, Java or even Cobol to be compiled to run on the web at near native speed — without the user needing to install anything special. It’s designed to work alongside of JavaScript, allowing sites to use both together. Wasm provides the tools needed to bring powerful software applications to the web.</p>\n<p>In Safari 15.2, the addressable memory for Wasm has been expanded to 4GB, opening up possibilities for bigger and more powerful applications. The addition of zero-cost <a href=\"https://github.com/WebAssembly/exception-handling/blob/master/proposals/exception-handling/Exceptions.md\">exception handling</a> also provides potential performance gains.</p>\n<h3>COOP/COEP  HTTP Headers</h3>\n<p>Shared memory provides powerful functionality for native applications, but on the web, such power must be balanced with strong security protections.  <code>SharedArrayBuffer</code> was supported in WebKit for Safari 10.1–11, but was disabled along with other browsers due to the risk of using it for speculative execution attacks like Spectre.</p>\n<p>Safari 15.2 adds support for <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Opener-Policy\"><code>Cross-Origin-Opener-Policy</code> (COOP)</a> and <a href=\"https://developer.mozilla.org/en-US/docs/Web/HTTP/Headers/Cross-Origin-Embedder-Policy\"><code>Cross-Origin-Embedder-Policy</code> (COEP)</a> HTTP response headers. Sites can adopt these headers to opt into process isolation and be better protected. If sites serve both <code>Cross-Origin-Opener-Policy: same-origin</code> and <code>Cross-Origin-Embedder-Policy: require-corp</code>, they are now able to use SharedArrayBuffer and Wasm threading again.</p>\n<h3>Wide gamut support for Canvas</h3>\n<p>These days modern creative tools depend on amazing camera and gorgeous displays. Yet, most colors on the Web today are sRGB colors, which match the limited color capabilities of computer monitors from the late 1990s. The human visual system can perceive a much broader range of colors. Today’s modern displays reproduce the colors of the Display P3 gamut, with significantly higher saturation than sRGB.</p>\n<p>Since 2016, WebKit has supported wide color images and video, and last year became <a href=\"https://webkit.org/blog/10042/wide-gamut-color-in-css-with-display-p3/\">the first browser engine to implement the new color syntax</a> defined in <a href=\"https://drafts.csswg.org/css-color-4/\">CSS Color Module Level 4</a>. One notable omission in wide gamut color support was in the HTML <code>canvas</code> element. Earlier this year, a proposal for support was added to the HTML standard, and now, in Safari 15.2, WebKit adds wide gamut support — including Display P3 — for use in <code>canvas</code>.</p>\n<p>Read more about the details, with demos of stunning results, in <a href=\"https://webkit.org/blog/12058/wide-gamut-2d-graphics-using-html-canvas/\">Wide Gamut 2D Graphics using HTML Canvas</a>.</p>\n<h3>More information</h3>\n<p>For more on what’s in Safari 15.2, including bug fixes, see the <a href=\"https://developer.apple.com/documentation/safari-release-notes/safari-15_2-release-notes\">Safari 15.2 Release Notes</a>.</p>\n<h3>Availability</h3>\n<p>Safari 15.2 is available on macOS Monterey, macOS Big Sur and macOS Catalina. To update on macOS, go to Apple menu  &gt; System Preferences, and click Software Update.</p>\n<p>Safari 15.2 is available on iOS and iPadOS 15.2. To update, go to Settings &gt; General, then tap Software Update.</p>\n<h3>Feedback</h3>\n<p>If you run into issues, we welcome your <a href=\"https://bugreport.apple.com/\">bug reports</a> for Safari, or <a href=\"https://bugs.webkit.org/\">WebKit bugs</a> for web content issues. Send us a tweet <a href=\"https://twitter.com/webkit\">@webkit</a> to share your thoughts on this release.</p>","author":"","siteTitle":"Blog – WebKit","siteHash":"7f8dbea0b8f53db2e11a2faa08c6dca9954c01638d09a2ce585b77a60d10f7a1","entryHash":"a10989a429b1fea887a5e07b6d88fdc6a9ad2e90898de5647371a6d1658af52f","category":"Tech"}