{"title":"Now that WWDC is official, time has all but run out for a spring Apple event","link":"https://www.macworld.com/article/1675493/apple-event-spring-2023-time-almost-run-out.html","date":1680115622000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>This weekend the U.K. celebrated (if that’s the correct word) the beginning of British Summer Time, while U.S. daylight saving time began a fortnight before that. In both nations, it means, in theory at any rate, that the long dark nights of winter are behind us and spring is here. And for tech aficionados interested in a particular ecosystem that time of year means one thing: an Apple event.</p>\n\n\n\n<p>This year, however, we might have to manage without one and accept that Cupertino winter is likely to carry on until the start of Cupertino summer on June 5, when <a href=\"https://www.macworld.com/article/678333/wwdc-ios-macos-watchos-hardware-keynote.html\">WWDC kicks off</a>. All the evidence strongly suggests Apple has decided not to bother with a <a href=\"https://www.macworld.com/article/1484151/apple-spring-2023-event-date-time-how-to-watch-rumors.html\">spring event in 2023</a>.</p>\n\n\n\n<p>For a start, let’s take a look at the dates of the 10 most recent Apple spring events, arranged by lateness in the year:</p>\n\n\n\n<ul><li>March 2 (2011)</li><li>March 6 (2008)</li><li>March 7 (2012)</li><li>March 8 (2022)</li><li>March 9 (2015)</li><li>March 21 (2016)</li><li>March 25 (2019)</li><li>March 27 (2018)</li><li>April 8 (2010)</li><li>April 20 (2021)</li></ul>\n\n\n\n<p>As you can see, this week we’re passing the final date in March, leaving only those unusual April get-togethers (one held a long time ago to show off iOS 4 before it became a WWDC staple, and the other seemingly pushed back by the pandemic) as reasons to hold out hope. If Apple held an event tomorrow, it would already be the third latest on the list. (It obviously won’t do that, because it needs to send out invitations, and that generally happens around a week beforehand.) Once you add on invite time we’re pushing up close to the date from 2010; beyond that, there’s only the very uncharacteristic outlier from 2021. Every day that passes makes an Apple spring event less likely, fairly obviously, but the chances are low already.</p>\n\n\n<div><figure><img loading=\"lazy\" src=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?quality=50&amp;strip=all&amp;w=1200\" alt=\"wwdc 2023 logo\" srcset=\"https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?quality=50&amp;strip=all 1960w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=300%2C168&amp;quality=50&amp;strip=all 300w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=768%2C432&amp;quality=50&amp;strip=all 768w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=1200%2C675&amp;quality=50&amp;strip=all 1200w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=1536%2C864&amp;quality=50&amp;strip=all 1536w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=1240%2C697&amp;quality=50&amp;strip=all 1240w, https://b2c-contenthub.com/wp-content/uploads/2023/03/Apple-WWDC23-hero.jpg?resize=150%2C84&amp;quality=50&amp;strip=all 150w\" width=\"1200\" height=\"675\" /><figcaption><p>WWDC 2023 will be held the week of June 5, but will we get an Apple event before then?</p></figcaption></figure><p>Apple</p></div>\n\n\n\n<p>And it isn’t only the calendar that counsels pessimism. You see, Apple <em>has</em> made an announcement this spring, when it launched the yellow iPhone 14 on March 7. It wasn’t an event, just a discreet press release, but it was exactly the sort of reveal that normally folds in with the spring bonanza. (The Alpine Green iPhone 13 Pro was unveiled at the Peek Performance event in March 2022, and the purple iPhone 12 at Spring Loaded in April 2021.) As I’ve <a href=\"https://www.macworld.com/article/1534315/yellow-iphone-spring-event-macbook-air.html\">discussed elsewhere</a>, if Apple was going to have an event, it stands to reason that it wouldn’t have announced the yellow iPhone 14 in that way, at that time.</p>\n\n\n\n<p>But the other thing worth noting about that list is the gaps. Apple spring events happen most years, but it’s hardly a shock when they don’t: as recently as 2020 the company went through the whole of March and April without inviting anyone to a virtual or in-person gathering. It’s not a positive sign, implying a lack of groundbreaking products ready for launch, but it’s not a disaster either. The company evidently doesn’t feel comfortable showing off the AR headset just yet, but that’s better than forcing it. (Members of the headset design team reportedly feel that any launch this year <a href=\"https://www.macworld.com/article/1655723/ar-vr-headset-2023-launch-design-team-tim-cook.html\">will be forcing it</a>, but that’s a story for another day.)</p>\n\n\n\n<p>So while the ever-diminishing likelihood of an Apple event in spring 2023 is disappointing, there remain reasons for tech fans to be cheerful. We can still, by all accounts, look forward to the reveal of the Reality Pro headset at some point in 2023, and the novelty of the category and the importance of this product to Apple’s post-iPhone future will make the unveiling a must-watch event. Sure, it would have been nice if it had happened before April Fools Day, but it ought to be worth the wait.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a10ac7ed8b2d88d54b4a3f6e5fe8f25de7993c60879980d88901dcf2c03c5593","category":"Apple"}