{"title":"Study finds no “smoking gun” for mental health issues due to Internet usage","link":"https://arstechnica.com/?p=1986728","date":1701181644000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/teenager-smartphone-800x533.jpg\" alt=\"young woman using smartphone\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2023/11/teenager-smartphone.jpg\">Enlarge</a> <span>/</span> The report contrasts with a growing body of research in recent years that has connected the beginning of the smartphone era with growing rates of anxiety and depression, especially among teenage girls. (credit: <a href=\"https://www.gettyimages.com/detail/photo/young-woman-using-smart-phone-royalty-free-image/1288682230\">Isabel Pavia</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>A study of more than 2 million people’s Internet use found no “smoking gun” for widespread harm to mental health from online activities such as browsing social media and gaming, despite widely claimed concerns that mobile apps can cause depression and anxiety.</p>\n<p>Researchers at the Oxford Internet Institute, who said their study was the largest of its kind, said they found no evidence to support “popular ideas that certain groups are more at risk” from the technology.</p>\n<p>However, Andrew Przybylski, professor at the institute—part of the University of Oxford—said that the data necessary to establish a causal connection was “absent” without more cooperation from tech companies. If apps do harm mental health, only the companies that build them have the user data that could prove it, he said.</p></div><p><a href=\"https://arstechnica.com/?p=1986728#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1986728&amp;comments=1\">Comments</a></p>","author":"Financial Times","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a1181fd8cae4c243b49da29c6a4b0558c5b52dd6dc22e5d73fbe95542649ca46","category":"Tech"}