{"title":"Host Genetics Background Affects the Intestinal Cancer Development Associated with High-fat Diet-induced Obesity and Type 2 Diabetes","link":"https://www.preprints.org/manuscript/202409.1094/v1","date":1726282607000,"content":"Background: Obesity and Type 2 diabetes (T2D) promote inflammation, increasing the risk of colorectal cancer (CRC). High-fat diet (HFD)-induced obesity plays a key role in these diseases through biological mechanisms. This study examined the effect of genetic background on the multimorbidity of intestinal cancer, T2D, and inflammation due to HFD-induced obesity. Methods: A cohort of 357 Collaborative Cross (CC) mice from 15 lines was fed either a control chow diet (CHD) or HFD for 12 weeks. Body weight was tracked biweekly, and blood glucose was assessed at weeks 6 and 12 via intraperitoneal glucose tolerance tests (IPGTT). At the study's endpoint, intestinal polyps were counted, and cytokine profiles were analyzed to evaluate the inflammatory response. Results: HFD significantly increased blood glucose levels and body weight, with males showing higher susceptibility to T2D and obesity. Genetic variation across CC lines influenced glucose metabolism, body weight, and polyp development. Mice on HFD developed more intestinal polyps, with males showing higher counts than females. Cytokine analysis revealed diet-induced variations in pro-inflammatory markers like IL-6, IL-17A, and TNF-α, differing by genetic background and sex. Conclusions: Host genetics plays a crucial role in susceptibility to HFD-induced obesity, T2D, CRC, and inflammation. Genetic differences across CC lines contributed to variability in disease outcomes, providing insight into the genetic underpinnings of multimorbidity. This study supports gene-mapping efforts to develop personalized prevention and treatment strategies for these diseases.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a127e1c0b155cb66b36532294dca332de47ca2a48191708c0c1419dcebda53c1","category":"Interdisciplinary"}