{"title":"After Sunday’s launch, SpaceX is on the cusp of a historic reuse milestone","link":"https://arstechnica.com/?p=1749503","date":1615813712000,"content":"<div id=\"rss-wrap\">\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n      <ul class=\"gallery shortcode-gallery gallery-wide\"><li>\n        <div class=\"gallery-item-content\">  \n        <div class=\"gallery-image\"><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/03/51036945097_bdc3b79eaa_k-980x653.jpg\" alt=\"\"></div>\n        <p>\n          SpaceX launched its 21st batch of operational Starlink satellites on Sunday morning.                      [credit:\n                        SpaceX                        ]\n                  </p>\n        </div>\n      </li>\n      </ul><p>SpaceX launched another batch of Starlink satellites early on Sunday morning and, in doing so, came close to a substantial rocket reuse milestone. The first stage of the Falcon 9 rocket that lofted this payload toward orbit, Booster no. 1051, was making its ninth flight. It successfully landed on the <em>Of Course I Still Love You</em> droneship.</p>\n<p>As this is the first Falcon 9 rocket to launch nine missions, it raises the prospect of a first stage making a tenth flight in the near future, probably within a month or two. Reaching ten flights would accomplish one of the main goals set by SpaceX with the Falcon 9 rocket, after optimizing the vehicle for reuse about three years ago.</p>\n<p>The company <a href=\"https://arstechnica.com/science/2018/05/block-5-rocket-launch-marks-the-end-of-the-beginning-for-spacex/\">debuted its \"Block 5\" version</a> of the Falcon 9 rocket in May 2018, and since then this vehicle has flown 55 missions, all of which have successfully delivered their payloads to orbit. More importantly, the changes SpaceX engineers incorporated into this new rocket to ensure its robustness for reuse, such as strengthening its \"Octaweb\" engine bay, have largely been validated.</p></div><p><a href=\"https://arstechnica.com/?p=1749503#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1749503&comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a12f548d956436458227848c41f5bf55899aef9d5caf61d9719f734716c6dac4","category":"Tech"}