{"title":"Apple reportedly wants to make its own wireless chips for the iPhone","link":"https://www.macworld.com/article/560257/apple-reportedly-wants-to-make-its-own-wireless-chips-for-the-iphone.html","date":null,"content":"<div>\n<section><div></div></section><p>It’s no secret that Apple is looking to design its own wireless chips, ending its reliance on companies like Qualcomm, Broadcom, and Skyworks. Two years ago, <a href=\"https://www.macworld.com/article/233067/apple-confirms-that-it-will-acquire-most-of-intels-smartphone-modem-business.html\">Apple bought most of Intel’s smartphone modem business</a> to give it a jumpstart on IP, patents, and engineering talent. Now, according to a report from Bloomberg, Apple is opening an office in southern California in an attempt to recruit talent from Broadcom and Skyworks.</p>\n\n\n\n<p>According to the<a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.bloomberg.com/news/articles/2021-12-16/apple-builds-team-in-new-office-to-bring-wireless-chips-in-house&amp;xcust=1-1-560257-1-0-0&amp;sref=https://www.macworld.com/feed\"> Bloomberg report</a>, the Irvine expansion is just beginning and Apple plans to increase its presence gradually. It is hiring engineers to work on wireless radios, radio-frequency integrated circuits, and a wireless SoC. Current Apple products include those parts from Broadcom and Skyworks, both of which have engineering offices in the area.</p>\n\n\n\n<p>Designing and manufacturing high-performance, reliable, power-efficient wireless radios is an incredibly specialized skill set that is in constant demand. Apple wants future products to have wireless chips that are all designed by Apple and doesn’t want them to be second-best, which means it will have to recruit the best talent from existing wireless chip companies. Hence the need to open a local office–telling in-demand engineers they don’t need to move makes recruitment a lot easier.</p>\n\n\n\n<p>Development of wireless chips within Apple has been underway for several years, but it takes a long time to make a great product in this area. It’s expected that we probably won’t see Apple’s own Wi-Fi, Bluetooth, or cellular chips in an iPhone until at least 2023, or perhaps later. The company has long-term supply and licensing agreements with Qualcomm and Broadcom that extend at least that far.</p>\n</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a1311edab6fbedc289c25a901f1e26e81fcbb98989546ebefb705fa8876ead39","category":"Apple"}