{"title":"On the Sensitivity of Future Hydrology in the Colorado River to the Selection of the Precipitation Partitioning Method","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2023WR035801?af=R","date":1717743600000,"content":"<h2>Abstract</h2>\n<p>The accurate partitioning of precipitation is important for snowpack and streamflow simulations in mountainous regions. However, most hydrologic models employ a partitioning method based on near-surface air temperature (<i>T</i>\n<sub>a</sub>) and the sensitivity of hydrologic simulations to the selection of the precipitation partitioning method (PPM) under climate change has been underexplored. To address this, we compared simulations using two PPMs, a conventional <i>T</i>\n<sub>a</sub>-based scheme and a wet-bulb temperature (<i>T</i>\n<sub>w</sub>)-based approach (TA and TW) with the Variable Infiltration Capacity model. Our study focused on the Colorado River Basin (CRB) which is vulnerable to future snowfall and streamflow reductions due to climate warming. Historical simulations demonstrated the improved performance of the TW scheme in simulating snowfall fraction (<i>SF</i>) and snow water equivalent (<i>SWE</i>) in relation to in situ observations and a gridded <i>SWE</i> product. Subsequently, we evaluated the influence of the PPM selection on snowpack and streamflow projections from eight climate models under two emissions scenarios. The ensemble median results revealed more substantial decline in annual <i>SF</i> with the TW scheme as compared to the TA method (−12% vs. −9%) from the historical (1976–2005) to the far future (2066–2095) period, especially at lower elevations. Hydrologic simulations showed that the TA scheme underestimated reductions in <i>SWE</i> and streamflow (<i>Q</i>) under warming as compared to the TW scheme. This finding has important implications on future projections for the CRB and in other mountainous basins where climate warming can shift conditions from snowfall to rainfall.</p>","author":"Zhaocheng Wang, \nEnrique R. Vivoni, \nKristen M. Whitney, \nMu Xiao, \nGiuseppe Mascaro","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"a13a3f8897d5e3c19d62bb6f5859aa3c7983f20abdcaac68317f5e663c2f1b09","category":"Environment"}