{"title":"Intel’s terrible anti-Mac ads only mean one thing: Apple is winning","link":"https://www.macworld.com/article/340259/macalope-intel-go-pc-ads-apple-m1-processor.html","date":1616486400000,"content":"<!DOCTYPE html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\">\n<html><body><div id=\"link_wrapped_content\">\n<section class=\"wp-block-bigbite-multi-title\"><div class=\"container\"></div></section><p>Well, the Macalope watched all of the recently released train wreck so you wouldn&rsquo;t have to and, let him tell you, there went too many minutes of his life that he&rsquo;ll never get back.</p>\n\n\n\n<p>What? No, he&rsquo;s not talking about the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://en.wikipedia.org/wiki/Zack_Snyder%27s_Justice_League&amp;xcust=1-1-340259-0-0-0&amp;sref=https://www.macworld.com/feed\" data-type=\"URL\" data-id=\"https://en.wikipedia.org/wiki/Zack_Snyder%27s_Justice_League\" rel=\"nofollow\">Snyder Cut</a>.</p>\n\n\n\n<p>Is he?</p>\n\n\n\n<p>No, no, he&rsquo;s not. He&rsquo;s talking about Intel&rsquo;s recently released <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtube.com/playlist?list=PLk2sjg_-F-MfQL0aUbKyDX909ZfKCUq1c&amp;xcust=1-1-340259-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">&ldquo;Go PC&#157;&rdquo; ads</a> starring Justin Long.</p>\n\n\n\n<p>Long, as you may recall, played the Mac in the <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://youtu.be/1gpWerS7-1E&amp;xcust=1-1-340259-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">&ldquo;Get a Mac&rdquo; ads</a> of the 2000s against John Hodgman&rsquo;s lovable loser PC. John Gruber aptly <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://daringfireball.net/2021/03/intel_goes_long&amp;xcust=1-1-340259-0-0-0&amp;sref=https://www.macworld.com/feed\" rel=\"nofollow\">summed up</a> Intel&rsquo;s supposed &ldquo;thinking&rdquo; here:</p>\n\n\n\n<blockquote class=\"wp-block-quote\"><p>The concept isn&rsquo;t actually anything beyond &ldquo;Let&rsquo;s hire Justin Long as our new pitchman, that&rsquo;ll show them.&rdquo;</p></blockquote>\n\n\n\n<p>Hey, nothing against Long. Get paid, Justin. It&rsquo;s not like you&rsquo;re advertising cigarettes or crime or cigarette crime. Go for it.</p>\n\n\n\n<p>Intel, on the other hand? Phew. To say the ads comes across as defensive is like saying sharks could be more approachable. Content warning: those with sensitive eye conditions should not watch these ads as severe rolling may occur.</p>\n\n\n\n<div class=\"extendedBlock-wrapper block-coreImage undefined\"><figure class=\"wp-block-image size-large\"><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" alt=\"\" class=\"wp-image-100059258\"></figure><p class=\"imageCredit\">IDG</p></div>\n\n\n\n<p>At the start of each ad, Long identifies himself as, &ldquo;Just a real person doing a real comparison between Mac and PC.&rdquo; Well, okay, sure, but most &ldquo;real people&rdquo; aren&rsquo;t <em>paid</em> to do these comparisons when they&rsquo;re making buying decisions so&hellip;no, actually. You are an actor reading a script, and a rather wooden one at that.</p>\n\n\n\n<p>The ads stick it to Macs with a series of jabs that range from valid to, &ldquo;these walls we&rsquo;re throwing things against to see if they will stick seem to be made of a space-age non-stick composite material that repels any material.&rdquo;</p>\n\n\n\n<p>In one ad, Long talks to a gamer who is gaming all the games that can be gamed, but only on a PC! Indeed, it is true that PCs are generally better gaming machines. But that&rsquo;s really thanks to graphics chips that are not made by Intel. It&rsquo;s a slight exaggeration but a fair criticism to say, as the gamer in the ad does, that &ldquo;no one really games on a Mac.&rdquo; But people game a lot on mobile devices and consoles, none of which run on chips made by Intel.</p>\n\n\n\n<p>It is undeniably true that, as another ad points out, Apple&rsquo;s PC competitors provide a more varied set of hardware options. Again, though, very little of that has anything to do with Intel. One ad shows how one manufacturer&rsquo;s PC has two touch screens while the most any Mac has is the Touch Bar, without really explaining why all the extreme touching is any kind of advantage. Two touch screens seems cool until you see a laptop with three, four, or 27 touch screens. Those are cool. Of course, none of those will be Macs, so advantage: Intel.</p>\n\n\n\n<p>When it gets down to brass tacks, however, not one of these ads discusses the difference between the processors in PCs and M1 Macs. Which is weird because that&rsquo;s what it&rsquo;s all about, right? That&rsquo;s why Intel&rsquo;s making these crummy ads, because Apple dumped their chips. For the record, the most notable differences are that the M1 is faster and requires less power. Those are the real differences and Intel wants to talk about anything other than that.</p>\n\n\n\n<p>Maybe Intel could spin that by saying PCs will keep you warmer in winter. Will the Mac keep you warm? No, it will not.</p>\n\n\n\n<p>Advantage: Intel.</p>\n\n\n\n<p>Intel has a real Microsoft-circa-2009 vibe to it right now, sticking to its big, dumb guns that are shooting everything but the target. The Macalope would advise the company to quit wasting its money on defensive ad campaigns and to get its house in order. One of the ways it might do that is by working out a deal to manufacture Apple&rsquo;s chips for them. But ads attacking Macs aren&rsquo;t exactly going to help land that business.</p>\n</div></body></html>","author":"The Macalope","siteTitle":"Intel's terrible anti-Mac ads only mean one thing: Apple is winning","siteHash":"6d9431c7cb992628366f54c44637893570d3c6cccab6bd82dbaa88ce5aa30f83","entryHash":"a13d2a55f5fc09c0489de1e09bdec268ca9aa460f6154886b47743b4886353b3","category":"Apple"}