{"title":"Stream and river flows mediate adult lamprey spawning migrations: Considerations for management","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4322?af=R","date":1716970185000,"content":"<h2>Abstract</h2>\n<p>Organisms have adapted to dynamic river flows as part of the natural flow regime. However, climate change and humans' use of fresh water are associated with decreases in the quality and quantity of surface waters. In addition, river impoundments and water withdrawals for human use regulate and dampen the dynamism of flow in many rivers. These changes to the natural flow regime can impact the spawning migrations of lampreys (Petromyzontiformes). Here, our goal is to review the ecology of lamprey spawning migrations associated with river flows, with considerations for controlling invasive sea lamprey (<i>Petromyzon marinus</i>) and conserving native lampreys (including native, anadromous sea lamprey). We identify five common themes: (1) natural flow regimes provide a competitive edge to native fishes over non-native fishes; (2) high flows (up to a threshold) attract adult lamprey and large streams attract large numbers of lamprey; (3) larval lamprey pheromones attract adult lampreys; (4) behavioral responses by adult lamprey to flow (including localized hydraulics) can inform dam passage and trapping methods; and (5) changes to rivers induced by climate change have been implicated in changing the phenology of run timing and spawning location. Controlling invasive sea lamprey and conserving native lampreys can be done with pheromones and flow management. Pheromones may be of more use under focused management efforts to control invasive sea lamprey, whereas flow management can provide a foundation for conservation of native lampreys.</p>","author":"Benjamin J. Clemens, \nC. Michael Wagner","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"a13eb3ab1d31eeb7eb14f0bf67e1a371403aaca8c8702852cd6c39120e4ea5ca","category":"Environment"}