{"title":"Inclusive Design","link":"https://markpeak.net/inclusive-design/","date":1621784842000,"content":"<p>ประเด็นเรื่อง Inclusive Design หรือ Accessibility เป็นสิ่งที่ได้รับความสนใจเพิ่มขึ้นมากในช่วงหลัง และเป็นคำที่หาคำแปลภาษาไทยได้ยาก เพราะในเซนส์ของคนทั่วไปมันหมายถึง “การออกแบบเพื่อให้คนพิการเข้าถึงได้” ซึ่งเป็นความหมายเชิงแคบ แต่จริงๆ แล้วก็คือการออกแบบให้ทุกคน (ที่อาจไม่พิการ) เข้าถึงอะไรบางอย่าง (เข้าอาคาร, ใช้งานคอมพิวเตอร์) ได้ง่ายที่สุดเท่าที่จะเป็นไปได้</p>\n<p>เมื่อไม่นานมานี้มาเจอ<a href=\"https://download.microsoft.com/download/b/0/d/b0d4bf87-09ce-4417-8f28-d60703d672ed/inclusive_toolkit_manual_final.pdf\">เอกสาร Inclusive Design ของไมโครซอฟท์</a> (ซึ่งโดดเด่นมากในวงการนี้ จาก <a href=\"https://www.blognone.com/node/102375\">Xbox Adaptive Controller</a>) ที่อธิบายเรื่องนี้ไว้เข้าใจง่ายดี</p>\n<p>เปิดมาก็น่าสนใจแล้ว กระตุกต่อมคิดของดีไซเนอร์ตั้งแต่เริ่ม</p>\n<blockquote><p>Let’s face it, as designers, we often generate and evaluate ideas based on what we know. We strive to make experiences that solve needs, work well with the human body, and improve lives.</p>\n<p>But here’s the problem: If we use our own abilities as a baseline, we make things that are easy for some people to use, but difficult for everyone else.</p></blockquote>\n<p>ดังนั้น ดีไซเนอร์จึงไม่ควรใช้ตัวเองเป็นศูนย์กลาง เพราะจะเผลอ exclude คนบางกลุ่ม (ที่ไม่เหมือนตัวเอง ไม่เคยรับรู้ว่ามีอยู่) โดยไม่ได้ตั้งใจ ดีไซเนอร์ที่ดีจึงต้องยึดหลักการ (principles) ในเชิงวิชาการไว้อยู่เสมอ ซึ่งหลักของไมโครซอฟท์มี 3 ข้อคือ</p>\n<ol>\n<li><strong>Recognize exclusion</strong> คือการรู้สึกตัวว่าเราได้มองข้ามใครไป ถ้ามีความรู้พื้นฐาน และมีสติ จะได้ไม่หลงลืมใคร</li>\n<li><strong>Learn from diversity</strong> เข้าใจว่าคนมีความแตกต่างกันมาก จึงต้องพยายามหามุมมองใหม่ที่แตกต่าง (fresh, diverse perspective) มาช่วยใช้งาน</li>\n<li><strong>Solve for one, extend to many</strong> สุดท้ายคือ ออกแบบให้คนที่มีข้อจำกัดมากที่สุดก่อน แล้วคนอื่นๆ ที่อยู่ระหว่างทางจะได้ประโยชน์ด้วย</li>\n</ol>\n<p>ข้อ 3 อาจฟังดูวิชาการ เข้าใจยาก ไมโครซอฟท์เลยทำแผนภาพที่เรียกว่า Persona Spectrum ให้เข้าใจง่ายเลย โดยแยกระดับของคนที่มีปัญหาการเข้าถึง 3 กลุ่มคือ Permanent (พิการถาวร), Temporary (พิการชั่วคราว เช่น บาดเจ็บ) และ Situational (บางโอกาสที่เราใช้งานบางอย่างไม่ได้)</p>\n<p>แผนภาพนี้ดีมาก คือ ยกตัวอย่างแล้วเห็นภาพชัดเจน เหมาะแก่การพิมพ์ไปแปะข้างฝาไว้ดูระลึกถึงบ่อยๆ เวลาต้องออกแบบงานเพื่อคนหมู่มาก</p>\n<p><img src=\"https://markpeak.net/wp-content/uploads/2021/05/persona-spectrum.png\" /></p>\n<p><a href=\"https://www.microsoft.com/design/inclusive/\">ในเว็บ Inclusive Design ของไมโครซอฟท์</a>มีบทความและเอกสารอื่นๆ แต่คิดว่าที่สำคัญที่สุดก็คือแผนภาพ Persona อันนี้ละ</p>\n<p>ปิดท้ายด้วยซีรีส์ Xbox Adaptive Controller เผื่อใครไม่เคยดู</p>\n<p></p>\n<p></p>The post <a href=\"https://markpeak.net/inclusive-design/\">Inclusive Design</a> first appeared on <a href=\"https://markpeak.net\">markpeak.net</a>.","author":"Isriya Paireepairit","siteTitle":"markpeak.net","siteHash":"174209a41ef21fd794de2993285c799df6ec31048fd82206fb5c8fe38898acfe","entryHash":"a13f07d892726b9acacc5579fbecfda444d534dd7a136d777959f3a786754132","category":"Thai"}