{"title":"Why Apple’s Facebook hiring fiasco never should have happened","link":"https://www.macworld.com/article/346788/macalope-apple-facebook-hiring-fiasco-antonio-garcia-martinez-inclusion-privacy-controversy.html","date":1621332000000,"content":"\n<div>\n<section><div></div></section><p>The Macalope doesn’t know about you, but he went on quite a personal journey of discovery about Apple’s <a href=\"https://www.macworld.com/article/346432/apple-hires-then-fires-controversial-ex-facebook-employee.html\">controversial hiring then firing</a> of Antonio García Martínez, a rollercoaster of a human resources debacle that played out last week.</p>\n\n\n\n<p>The Macalope’s first thought was “I don’t have an opinion about this because I don’t know who this person is.” You know, like you do about things you don’t know anything about. Then he learned García Martínez used to work at Facebook. So, starting to have some feelings, feelings that can largely be summed up by “Ew”. But Facebook employment should not necessarily be a disqualifying event, provided you perform certain acts of contrition and possibly an exorcism or two.</p>\n\n\n\n<p>But we’re just getting started.</p>\n\n\n\n<p>Apple, you may recall, is a company that prides itself on its pro-privacy stance and uses it in marketing as a differentiating factor between itself and its competitors. The Macalope in particular has consistently been a cheerleader for this stance and believes smartphone reviews should take it into consideration, which they almost never do.</p>\n\n\n\n<p>So it’s really a burr in the fur when you see the company hiring someone who <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.vox.com/2018/5/11/17342530/facebook-privacy-antonio-garcia-martinez-advertising-targeting-mark-zuckerberg-kara-swisher-podcast&amp;xcust=1-1-346788-0-0-0&amp;sref=https://www.macworld.com/feed\">said this</a>:</p>\n\n\n\n<blockquote><p>“Here’s the reality: Most people don’t care about privacy,” García-Martínez said. “Media elites care about it, underemployed Eurocrats care about it. And the entire privacy-industrial complex — there’s an entire set of very loud voices who are constantly beating the drum and building media careers around this.”</p></blockquote>\n\n\n\n<p>Nobody cares about it but people can build media careers on it because media careers occur in a vacuum. Got it.</p>\n\n\n\n<p>Suffice it to say, this is not the kind of hire the Macalope likes to see a privacy-forward company make. You could make a good argument that Apple shouldn’t have hired García Martínez based on this comment alone, but maybe it was just a thing he said. You know how you sometime just say things about privacy you don’t mean? Sure.</p>\n\n\n\n<p>But we’re not done yet! No, no, no.</p>\n\n\n\n<p>Apple also prides itself on having a culture of inclusion and respect for all people. So it’s a little weird that García Martínez was hired after writing:</p>\n\n\n\n<blockquote><p>Most women in the Bay Area are soft and weak, cosseted and naive despite their claims of worldliness, and generally full of [expletive deleted]</p></blockquote>\n\n\n\n<p>If you need more to convince you that García Martínez was a <em>bad fit</em> for Apple, he also wrote that an Indian co-worker reminded him of a rickshaw driver and that if a female colleague wanted to “disarm” him, she needed “either more cleavage or more charm”. Classy.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macalope-2021.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>IDG</p></div>\n\n\n\n<p>García Martínez explains away his mal mots by comparing his style to Hunter S. Thompson because that’s what you do. Whenever anyone complains about the Macalope’s writing or points out a logical error or typo or the fact that he forgot to file a column, he just asks them why they hate fine literature. Works every time.</p>\n\n\n\n<p>A number of Apple employees were none too pleased about this hire after it became known and they circulated a petition directed to Senior Vice President Eddy Cue demanding an investigation into it. The stink that was raised was enough for Apple to pull the plug, a plug that should never have been put into the outlet or the bathtub drain or whatever the plug is for in that analogy.</p>\n\n\n\n<p>To be clear, the Macalope believes Apple should not have hired García Martínez only to fire him. He believe it never should have hired him in the first place.</p>\n\n\n\n<p>García Martínez says <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.latimes.com/business/technology/story/2021-05-14/antonio-garcia-martinez-fired-apple-engineer-speaks-out&amp;xcust=1-1-346788-0-0-0&amp;sref=https://www.macworld.com/feed\">Apple was aware of his comments</a> before they hired him and the Macalope believes him. Apple is too careful a company to not make a thorough check of someone who’s such a high-profile hire. Which to this be-horned observer is really disturbing. Who hired this guy? Whoever it was decided either the comments weren’t a big deal or that no one would notice. Either one is not a good look.</p>\n\n\n\n<p>If you’re worried about García Martínez’s right to free speech, don’t be. He wrote a whole book! It was on the New York Times’ best seller list! Just ask him! His speech is not under threat. The First Amendment protects your right to speak your mind, it doesn’t say you can still get employed anywhere you want after you shoot your mouth off, no matter which great writer you think you sound like.</p>\n</div>","author":"The Macalope","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a14599ca17d08b88ad0664de0cfd8acf8909263e4225a2f9576a46442b794eb5","category":"Apple"}