{"title":"Study on fermentation preparation, physicochemical properties and biological activity of carboxymethylpachymaran with different degrees of substitution","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13305?af=R","date":1712768606000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>Carboxymethylpachymaran (CMP) is created by carboxymethylating pachyman (PM), which increases its water solubility and enhances a number of biological activities. Traditional polysaccharides modified by carboxymethylation employ strong chemical techniques. Carboxymethylcellulose (CMC) has been used previously for liquid fermentation to carboxymethyl modify bacterial polysaccharides. This theory can be applied to fungal polysaccharides because <i>Poria cocos</i> has the ability to naturally utilize cellulose.</p>\n<h2>RESULTS</h2>\n<p>CMC with different degrees of substitution (DS) (0.7, 0.9 and 1.2) were added to <i>P. cocos</i> fermentation medium, and CMPs with different DS (0.38, 0.56 and 0.78, respectively) were prepared by liquid fermentation. The physical and chemical properties and biological activities of the CMPs were determined. Their structures were confirmed by Fourier transform infrared (FTIR) spectroscopy and monosaccharide composition. With the increase of DS, the viscosity and viscosity-average molecular weight of CMPs decreased, whereas polysaccharide content and water solubility increased, although the triple helix structure was not affected. The results of bioactivity assay showed that the higher the DS of CMPs, the higher the 2,2-diphenyl-1-picrylhydrazyl radical scavenging ability, and the stronger the bacterial inhibition ability.</p>\n<h2>CONCLUSION</h2>\n<p>The present study has developed a method for producing CMPs by <i>P. cocos</i> liquid fermentation. The results of the study confirm that enhancing the DS of CMP could effectively enhance its potential biological activity. The findings provide safe and reliable raw materials for creating CMP-related foods and encourage CMP application in the functional food industry. © 2024 Society of Chemical Industry.</p>","author":"Yiming Ma, \nRuixiang Zang, \nMo Chen, \nPei Zhang, \nYaqing Cheng, \nGuoyuan Hu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a14982a083a4276e997ed1030e2958b1520fed5aeac7e57ce137edafc48025fa","category":"Environment"}