{"title":"2,671 miles of rugged, empty terrain - The Tour Divide, Lachlan Morton’s biggest challenge yet","link":"https://www.rouleur.cc/blogs/the-rouleur-journal/2-671-miles-of-rugged-empty-terrain-the-tour-divide-lachlan-morton-s-biggest-challenge-yet","date":1693492511000,"content":"\n      <p><span>At 9:03am on August 29, Lachlan Morton took the first pedal strokes of his 2,671 mile Tour Divide attempt. He set off from Banff, Alberta, deep in the Canadian Rockies, and ahead of him lay some of the most daunting terrain he will ever encounter in his cycling career. </span></p>\n<div></div>\n<p><span>Of course, this is not the first time Morton has attempted a long distance challenge like this – his Alt Tour in 2021 saw the Australian ride the <a href=\"https://www.rouleur.cc/pages/tour-de-france\">Tour de France</a> route fully unsupported behind the professional peloton – but the Tour Divide poses an entirely new set of obstacles, some more unexpected than others.</span></p>\n<p><span>The first of these is that the Tour Divide represents a shift in how Morton approaches ultra-distance rides. While in the past he has attempted to break records by riding with as few stops as possible, the 31-year-old will impose 12 hours of resting time every 48 hours during his challenge to allow him to enjoy and soak up the experience. He notes that riding on minimal sleep can diminish concentration and general awareness – a space that Morton is certain he does not want to enter into during the Tour Divide.</span></p>\n<p><span>“I’ve done a few ultras now and they have all involved a fair bit of sleep deprivation in trying to go fast,” Morton said ahead of starting the challenge. “The last one I did was the Colorado Trail around this time last year. And I enjoyed that experience, but in the last kind of push I was pretty sleep deprived and wasn’t enjoying it and had that realisation that ‘I don’t want to do this again.”<img src=\"https://cdn.shopify.com/s/files/1/0040/5251/6910/files/ezgif.com-webp-to-jpg_17_1024x1024.jpg?v=1693483383\" alt /></span></p>\n<p><span>In true ultra-racing style, the clock won’t stop while Morton takes his rest and he will complete the route entirely unsupported – though he will have a small film crew following his attempt. The route spans from Banff, Alberta, Canada and ends in Antelope Wells, New Mexico on the border of the United States and Mexico and includes plenty of long, empty stretches of road where there will be nowhere for the Australian to stop for sustenance. The fastest known time on the route, which also includes 47,737m of elevation gain, is held by the late Mike Hall, who completed the ride in 13 days, 22 hours, and 51 minutes in 2016. </span></p>\n<p><span>Morton often uses his challenges to raise money for good causes, and during the Tour Divide he will raise money for Adventure for All, a national non-profit organisation that empowers individuals with down syndrome, autism, and other intellectual and developmental exceptionalities through outdoor adventures. Morton encountered Adventure for All in Colorado where they were teaching kids how to ride bikes. </span></p>\n<p><span>“They are definitely doing things that help a group of people that all cycling hasn’t been inclusive of in the past. I think it is inspiring to see someone who has taken that on and used the bike as a tool to empower that group of people and give them a life skill,” Morton said about the charity.</span></p>\n<p><span>Morton’s Tour Divide approach can be followed using the dot watching page <a href=\"https://efprocycling.com/culture/the-great-divide-mountain-bike-route/\">here</a>. At the time of writing, the Australian rider has completed just under 700km of riding, curtailed somewhat on days one and two when he had to take detours around wildfires in the area. Morton is said to have seen packs of wolves, wild horses and he narrowly avoided snow storms after climbing mountain passes in Montana.</span></p>\n<p><span>While Morton expects to complete the entire route in around 14 days, the time he finishes with at the end is secondary to the wider purpose of the challenge: \"Ultimately, I hope the ride inspires people to wander, to push themselves, and to see these big, wild places,” Morton says.</span></p>\n<div></div>\n    ","author":"Rouleur Media","siteTitle":"Rouleur - Rouleur: Inside the peloton","siteHash":"ea8d66ea396dc8e8ee093b36b528071101364ebaa7b32b2b8db5023e357746ea","entryHash":"a14e99b6263a45bb45fbae3a513e859fddc2f32bc96e7b3e6cca1b441f1ebf3f","category":"Cycling"}