{"title":"Cytokine Receptor Like Factor 1 (CRLF1) and its Role in Osteochondral Repair","link":"https://www.preprints.org/manuscript/202403.1072/v1","date":1710822277000,"content":"Background: Since cytokine receptor like factor 1 (CRLF1) has been implicated in tissue regeneration, we hypothesized that CRLF1 released by mesenchymal stem cells can promote the repair of osteochondral defects. \nMethods: The degree of a femoral osteochondral defect repair in rabbits after intra-articular injections of bone marrow derived mesenchymal stem cells (BMSCs) that were transduced with empty adeno associated virus (AAV) or AAV containing CRLF1 was determined by morpholog-ical, histological and microCT analyses. The effects of CRLF1 on chondrogenic differentiation of BMSCs or catabolic events of interleukin-1beta-treated chondrocyte cell line TC28a2 were deter-mined by alcian blue staining, gene expression levels of cartilage and catabolic marker genes us-ing real time PCR analysis, and immunoblot analysis of Smad2/3 and STAT3 signaling.  \nResults: Intra-articular injections of BMSCs overexpressing CRLF1 markedly improved repair of a rabbit femoral osteochondral defect. Overexpression of CRLF1 in BMSCs resulted in the release of a homodimeric CRLF1 complex that stimulated chondrogenic differentiation of BMSCs via enhancing Smad2/3 signaling, whereas the suppression of CRLF1 expression inhibited chondro-genic differentiation. In addition, CRLF1 inhibited catabolic events in TC28a2 cells cultured in an inflammatory environment, while a heterodimeric complex of CRLF1 and Cardiotrophin like Cytokine (CLC) stimulated catabolic events via STAT3 activation. \nConclusion: A homodimeric CRLF1 complex released by BMSCs enhanced the repair of osteochondral defects via the inhibition of catabolic events in chondrocytes and the stimulation of chondrogenic differentiation of precursor cells.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a14fa9efb1e5117fbd9ed0d224faa9cedf1fdb2e2db025f3c173c763f3f17a9b","category":"Interdisciplinary"}