{"title":"Preview: Here’s how (we think) the women’s Olympic road race will play out","link":"https://cyclingtips.com/2021/07/preview-heres-how-we-think-the-womens-olympic-road-race-will-play-out/","date":1627002000000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00026894-027-650x433.jpeg\" /></div><h2>Preview: Here's how (we think) the women's Olympic road race will play out</h2><p>\n</p><p>Every four years the Olympic Games roll around and upend the women’s peloton as we know it. The racing gets faster, the riders more cutthroat. As the only women’s event viewed globally by millions of people, the Olympic road race is without question the most prestigious race in women’s cycling from a non-hardcore-fan’s perspective. People who have no idea the women don’t have a Tour de France (yet) and who don’t watch the Spring Classics still tune in to watch just a few hours of bike racing during the Olympic Games. </p>\n\n\n\n<p>Heck, actor and comedian <a href=\"https://www.mic.com/articles/150895/leslie-jones-has-the-only-twitter-account-you-need-to-follow-during-the-rio-2016-olympics\" target=\"_blank\">Leslie Jones</a> tweeted to her 1 million followers a play-by-play reaction to the finale of the women’s road race in Rio de Janeiro back in 2016. I don’t know Leslie, but I’m pretty sure she didn’t get the bug to keep watching women’s cycling once the race had ended. For a few hours only, the sport of cycling is no longer seen by only a small number of fans.</p>\n\n\n\n<p>One year late, the 2020 Olympic Games are set to kick off on Friday July 23 with the opening ceremony. Although the Olympics continue to be controversial, there is no question that the road events have all the ingredients for fireworks. The women’s race, slated for Sunday July 25, will feature the best in the sport right now on a 137 km course that boasts multiple types of terrain and obstacles. </p>\n\n\n\n<h2>The course</h2>\n\n\n\n<div><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-23-at-11.40.22-am-1340x1298.jpg\" /></figure></div>\n\n\n\n<p>Do not be fooled by the tame-looking course for the women in Tokyo. Sure, they don’t go up Mt. Fuji or the steep Mikuni Pass <a href=\"https://cyclingtips.com/2021/07/preview-your-guide-to-the-mens-road-race-at-the-tokyo-olympics/\" target=\"_blank\">like the men</a> but an argument could be made that without those climbs the race is going to be more exciting in the long run. Racing will be aggressive throughout the day, instead of the peloton all conserving energy and waiting for those final climbs. </p>\n\n\n\n<p>Just like the Ardennes – the beloved three, one-day events that close out the Spring calendar – the Olympic road race will be a race of attrition. The “flat” run-in to the climb is actually constantly rolling. “There’s lots of climbing, and lots of descending, and not much flat,” a secret inside source told CyclingTips.</p>\n\n\n\n<div><figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/Screen-Shot-2021-07-23-at-11.40.50-am-1340x336.jpg\" /></figure></div>\n\n\n\n<p>The longer climb is actually a stair-step ascent that gets steeper and steeper as it goes, with the final 2 km acting as the most decisive section. Once over the top, however, the long descent could fuel hesitation in anyone hoping for a long-range attack.</p>\n\n\n\n<p>The trickiest part of the course is actually the bit that goes around Lake Yamanaka, just before the Kagosaka Pass. There is a kicker climb that will shed a lot of riders immediately into a technical descent to the Fuji International Speedway. </p>\n\n\n\n<p>If there is any rain (according to the forecast the odds are high) the descent onto the speedway will allow gutsy riders to distance themselves from those with more self-preservation. </p>\n\n\n\n<p>If riders like <strong>Emma Norsgaard (Norway)</strong> and <strong>Lisa Brennauer (Germany)</strong> – sprinters who can get themselves over bergs – are dropped on the long climb they could get back on the descent only to find themselves caught out on Kagosaka Pass. </p>\n\n\n\n<p>It will be up to the four-person teams to make sure any sprinters dropped on the valley climb of Doushi Road can’t get back on when the road descends. In order to do that the bigger nations will have to sacrifice riders to make the race hard. The problem is … the biggest teams still only have four riders. And four riders does not a formidable team make (unless you’re Dutch). Only Germany, the USA, Australia, Italy, and the Dutch have four riders on the start line. </p>\n\n\n\n<p>The final circuits around the motor park are actually quite challenging. The road is made for going fast, so a fast finish it will be. Around the lap, there are also “walls” that will work as the perfect launching pad for any riders hoping to make a last-minute escape. </p>\n\n\n\n<p>Based on the course, the race will be won solo or from a group of six to eight of the sports best. </p>\n\n\n\n<h2>The contenders </h2>\n\n\n\n<p>It is impossible to look past the Dutch winning this event. If this was an accurate list of contenders it would be <strong>Anna van der Breggen (Netherlands)</strong>, <strong>Demi Vollering (Netherlands)</strong>, and <strong>Annemiek van Vleuten (Netherlands)</strong>. They even have the G.O.A.T. <strong>Marianne Vos</strong> as another possible contender. However, there are definitely some women who will give the Killer Vs a run for their money.</p>\n\n\n\n<p>With a maximum allotment of four riders, the Dutch have stacked their team with winners. Two have won Olympic Gold in the past: Van der Breggen in 2016 and Vos in 2012. They have a rider for every possible outcome of the race. Van Vleuten is their early race option for a long-range attack on the first gradual climb. If she is unsuccessful Van der Breggen and Vos can make the race hard to the circuits where Van der Breggen can launch a late-race move and ride away. If it comes down to a small bunch, Vollering and Vos can take the victory. There is no way around it: the Netherlands are nearly unbeatable right now. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00032538-173-1340x893.jpg\" /><figcaption> Anna van der Breggen (Netherlands) pictured during World Championships road race in Imola, Italy.</figcaption></figure>\n\n\n\n<p>Lucky for us there are some women in the peloton who will simply not stand to let the Dutch ride away with Olympic gold. The Americans have two pretty good options in <strong>Coryn Rivera </strong>and <strong>Ruth Winder</strong>. Winder is strong on the climbs and smart when it comes to race tactics and Rivera has found her best legs in years just in time for an event that <a href=\"https://cyclingtips.com/2021/07/in-tokyo-coryn-rivera-will-ride-for-her-father-wally/\" target=\"_blank\">holds a lot of special significance for her personally</a>. If the race is hard but comes down to a small group, Rivera could mimic her win at the Tour of Flanders in 2017. </p>\n\n\n\n<p>A wildcard on the USA team is <strong>Chloe Dygert</strong>. No one really knows what her form is like, except those who have been around her in the buildup to the games. She is not great at teamwork-style racing, but she is incredibly strong. It would come as no surprise to see Dygert following Van der Breggen’s attacks in the latter half of the race. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00032538-189-1340x893.jpg\" /></figure>\n\n\n\n<p>Next, we’ve got the Italians. Just like the Americans, Italy has two really strong options in <strong>Elisa Longo Borghini</strong> and <strong>Marta Cavalli</strong>. The two both showed form at the Giro Donne earlier in July, especially Cavalli who finished in the top five on three stages and sixth overall. Cavalli has a great kick, so if she can make it to the end she can factor in a sprint, although might not be able to outsprint Vollering. </p>\n\n\n\n<p>Longo Borghini will be aggressive. She will make the race fun to watch, and if she can get away from the Dutch she can definitely win solo,<a href=\"https://cyclingtips.com/2021/03/elisa-longo-borghini-wins-trofeo-alfredo-binda/\" target=\"_blank\"> just like she won Trofeo Alfredo Binda in the spring of 2021</a>. Cavalli and Longo Borghini have two other teammates to work for them so they have the upper hand on some of the other teams stacked with leaders. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00032538-264-1340x895.jpg\" /></figure>\n\n\n\n<p>Australia’s <strong>Grace Brown </strong>and <strong>Tiffany Cromwell </strong>will make a great pair. Cromwell has been outstanding in 2021, earning her spot at the Games with her sweat and sacrifice. She has been seen throwing down brutal attacks in the finale of races like La Course by the Tour de France that open the door for her trade-team teammates. Now, she has an opportunity to try some moves and potentially go for a result or play a 1-2 punch game with Brown where either of them could take glory. </p>\n\n\n\n<p>If Brown gets off the front the rest of the race should assume full panic positions. A strong time-trialist, Brown won the Oxyclean Classic Brugge-De Panne solo in March. The two also have <strong>Amanda Spratt</strong> to help them on the climb.</p>\n\n\n\n<p>Working our way from teams with four to teams with three, there are two that stand out. Poland’s <strong>Kasia Niewiadoma</strong> and Belgium’s <strong>Lotte Kopecky.</strong> Both have an advantage the teams of four do not have. They are sole leaders with two teammates dedicated to helping them win. </p>\n\n\n\n<p>Niewiadoma sat out the Giro Donne in favour of focusing on herself, her training, and her headspace. She is going into Tokyo fresh and in form. The course is great for her, especially if the finish is anything like the Amstel Gold Race. Niewiadoma can use the “walls” in the circuit to her advantage. </p>\n\n\n\n<p>Kopecky last raced at the end of June in the Lotto Belgium Tour where she won the final stage and the overall. All year she has been upping her game and transforming as a rider. The teams with more riders will be purposefully trying to get rid of Kopecky every time the road goes up, but as she proved this spring, she’s not easily dropped. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00027172-109-1340x939.jpg\" /></figure>\n\n\n\n<p>Of the nations who only managed to secure two starters, a couple stand out as potentials for victory on Sunday. <strong>Lizzie Deignan </strong>of Great Britain will have only Anna Shackley with her to help her pull back anything she’s missed, to bring her bottles, to be her helper. Shackley will have a big job throughout the race with Deignan as a hot favourite to win.</p>\n\n\n\n<p>Deignan came very close in London, finishing second behind Vos, and has been eyeing a gold medal at the Olympics ever since. She has been getting better and better all season, after illness sidelined her in the spring, and she finished fourth overall at the Giro Donne a few weeks before the Olympics. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00030094-290-1340x893.jpg\" /></figure>\n\n\n\n<p>Denmark will start the road race with two super strong riders who are very different in their strengths. <strong>Cecilie Uttrup Ludwig </strong>won her first WorldTour race this year but has been consistently impressive for a few years. She is aggressive and fights in every situation she’s thrown into. Next to her, <strong>Emma Norsgaard </strong>is a strong but quiet sprinter who has taken 2021 and made it her year. She’s won five races this year including a stage of the Giro Donne recently. Her only downfall could be the hills. Norsgaard will really need to be on a good day to make it to the circuit, and if she does, woe is the rest of that group. </p>\n\n\n\n<figure><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/CORVOS_00032538-031-1340x893.jpg\" /></figure>\n\n\n\n<p>The Olympics are weird. Only 67 riders will start the road race; half the number that usually lines up in a professional women’s event. Team sizes make the race a lot less about tactics and more a race of fitness, luck, and who can just be in the right place at the right time. Still, there are a handful of women who can simply outmuscle luck who will feature in the finale of the Olympic road race.</p>\n\n\n\n<p>It will be a fantastic event, no matter the outcome. </p>\n\n\n\n<h2>The coverage</h2>\n\n\n\n<p>For those in Europe, the race will be live on Eurosport and GCN+ at 5:50am CET. In the United States, the race is on NBC Sports. In Australia, 7Plus has coverage.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/preview-heres-how-we-think-the-womens-olympic-road-race-will-play-out/\">Read More</a>","author":"Abby Mickey","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a1546cd0bd0aecece01b0f523d09417b9eb2a85573da4904af5f665d52692ce8","category":"Cycling"}