{"title":"Hubble update: One camera back, more to come","link":"https://arstechnica.com/?p=1814204","date":1637278052000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2016/09/europa01-hsta-1920x1080-160919-800x450.png\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2016/09/europa01-hsta-1920x1080-160919.png\">Enlarge</a> <span>/</span> Hubble Space Telescope above Earth, photographed during STS-125, Servicing Mission 4, May 2009. (credit: <a href=\"https://www.nasa.gov/\">NASA</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Earlier this month, NASA announced that the scientific instruments aboard the Hubble Space Telescope had <a href=\"https://arstechnica.com/science/2021/11/hubbles-science-on-hold-as-instruments-switch-into-safe-mode/\">been left in safe mode</a> after a series of problems with the timing signals that coordinate their activity. While NASA is still uncertain about the cause of the problem, it has already returned one camera to operations and plans to bring a second online shortly.</p>\n<p>Meanwhile, the agency is making plans for updates that would make all instruments less sensitive to failures of the timing signals. But, since it can't figure out the source of the problems, and the problem hasn't recurred recently, it's moving very cautiously.</p>\n<h2>It’s all in the timing</h2>\n<p>Each of the Hubble's four major scientific instruments has its own control hardware; to get all of them to play nicely with each other, the telescope uses a synchronization signal to ensure that all activities operate on the same timeline. Late in October, some of these synchronization messages weren't received, which caused the instruments to go into what's called safe mode, meaning they stop collecting data. After the problem recurred, the instruments were left in that mode while controllers tried to discern what was happening.</p></div><p><a href=\"https://arstechnica.com/?p=1814204#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1814204&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a156314ff08a4b41ba205ca03cf28b09cadf67e7ce44c75449d90ff9256751fc","category":"Tech"}