{"title":"Forest Disturbance Thresholds and Cumulative Hydrological Impacts","link":"https://agupubs.onlinelibrary.wiley.com/doi/10.1029/2024WR037339?af=R","date":1714806000000,"content":"<h2>Abstract</h2>\n<p>Forest disturbance threshold is defined as a critical disturbance level (e.g., % of forest cover change) in forested landscapes above which significant hydrological impacts are detected. Determining disturbance thresholds is critically important for supporting forest management to ensure the sustaining of ecological and hydrological functions. However, there are very few quantitative evaluations of forest disturbance thresholds globally. In this study, we applied a well-tested methodology (the modified double mass curve) to derive the long-term, continuous hydrological response curves and then to quantify forest disturbance thresholds on annual streamflow in 42 forested watersheds in British Columbia, Canada. The results show that forest disturbance thresholds for significant and cumulative hydrological impacts vary from 7% to 52% of cumulative equivalent clear-cut area with an average of 17% or from 8% to 52% of disturbed area with an average of 19%. Climate (inter-annual and intra-annual) and watershed properties exert critical controls on forest disturbance thresholds. Watersheds with greater snowfall proportions (more annual precipitation falling as snow), more desynchronizations (temporal mismatching) of energy demand and water supply at the intra-annual scale, less diverse ecosystems, and larger watershed sizes have lower forest disturbance thresholds. Given the present forest disturbance levels in the central interior of British Columbia, about half (53%) of the forested watersheds have already crossed the average disturbance threshold. These results highlight that watershed planning and management using forest disturbance thresholds must carefully consider local climate and watershed properties. The methodology can be effectively and robustly extended elsewhere around the globe.</p>","author":"Yiping Hou, \nXiaohua Wei","siteTitle":"Wiley: Water Resources Research: Table of Contents","siteHash":"ca1391b07e3b2d1f792df0b58af4899cba27371db5789ac011fef67cb3632757","entryHash":"a16e649bb1cba51f05bc03c4645dc429acfc48b3fbef24815420e2b60e6ace7e","category":"Environment"}