{"title":"PSX-9 Comparison of single- and multiple-trait genomic predictions of cattle carcass quality traits in multibreed and purebred populations","link":"https://academic.oup.com/jas/article/102/Supplement_3/453/7757544?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>Estimation of genetic parameters for carcass traits and their use in the evaluation of carcass quality is of considerable importance in the genetic improvement of beef cattle. The objective of this study was to compare the predictive ability of single- and multi-trait genomic prediction models for the following carcass quality traits: hot carcass weight (HCW); fat thickness (FAT); rib eye area (REA); marbling score (MARB); and peak force (PEAKF) from multibreed and purebred populations. The purebred population included 1,068 purebred Angus animals from Iowa State University whereas the multibreed population consisted of 887 animals sired by 1 of 8 purebreds (209 Angus-, 10 Brahman-, 182 Charolais-, 76 Hereford-, 44 Limousin-, 136 Maine-Anjou-, 96 Shorthorn-, and 134 South Devon- sired offspring) from the Carcass Merit Project funded by the US beef cattle industry to evaluate the genetic prediction of tenderness. After quality control of SNP markers generated with Illumina v1 50K BeadChips, 33,718 SNP markers from were used to obtain heritability and genetic correlation estimates between traits separately in either the multibreed or purebred populations. Genotyped individuals were randomly clustered into 10 groups for cross-fold validation to quantify the correlations between and predicted performance (without the individual’s data) and the realized phenotype of the individual from single- or multi-trait genomic prediction in the multibreed and purebred populations. Heritability estimates of traits from multi-trait analyses ranged from 0.42 to 0.61 in multibreed population and from 0.24 to 0.44 in the purebred population, whereas the single trait values were 0.30 to 0.53 in multibreed, and 0.23 to 0.42 in the purebred population. Estimates were greater in the multibreed population compared with the purebred population (Table 1). Compared with the single-trait analyses, multi-trait analyses resulted in higher heritability estimates for FAT, REA and PEAKF traits in the purebred population and for HCW, REA, MARB and PEAKF traits in multibreed population. Genetic correlations from multi-trait analyses indicated the genetic association between traits. In testing data sets, correlations between observed and predicted phenotypes from single-trait analyses were 4- to 7-fold greater in purebred than in the multibreed population (Table 2). These results may be due to the greater genomic relationship expected in purebred than in the multibreed population. However, the multi-trait analyses resulted in a considerable increase in correlations between observed and predicted values in multibreed population due to genetic correlations between traits.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a17d5969eaf40df127990ac247e6a9facd0ed26e2581da033de06588e1ce5431","category":"Environment"}