{"title":"Influence of sea ice concentration, sex and chick age on foraging flexibility and success in an Arctic seabird","link":"https://academic.oup.com/conphys/article/doi/10.1093/conphys/coae057/7749844?rss=1","date":1725494400000,"content":"<span><div>Abstract</div>Declining sea ice and increased variability in sea ice dynamics are altering Arctic marine food webs. Changes in sea ice dynamics and prey availability are likely to impact pagophilic (ice-dependent and ice-associated) species, such as thick-billed murres (<span>Uria lomvia</span>), through changes in foraging behaviour and foraging success. At the same time, extrinsic factors, such as chick demand, and intrinsic factors, such as sex, are also likely to influence foraging behaviour and foraging success of adult murres. Here, we use 3 years of data (2017–2019) to examine the impacts of environmental conditions (sea ice concentration and sea surface temperature), sex and chick age (as a proxy for chick demand) on foraging and diving behaviour (measured via biologgers), energy expenditure (estimated from activity budgets) and foraging success (measured via nutritional biomarkers) of thick-billed murres during the incubation and chick-rearing stages at Coats Island, Nunavut. Murres only exhibited foraging flexibility to environmental conditions during incubation, which is also the only stage when ice was present. When more ice was present, foraging effort increased, murres foraged farther and made deeper dives, where murres making deeper dives had higher foraging success (greater relative change in mass). During incubation, murre behaviour was also influenced by sex of the individual, where males made more and shorter trips and more dives. During chick-rearing, murre behaviour was influenced primarily by the sex of the individual and chick age. Males made shallower dives and fewer dive bouts per day, and more dives. Birds made longer, deeper dives as chicks aged, likely representing increased intra-specific competition for prey throughout the season. Our results suggest variation in sea ice concentration does impact foraging success of murres; however, sex-specific foraging strategies may help buffer colony breeding success from variability in sea ice concentration.</span>","author":"","siteTitle":"Conservation Physiology Current Issue","siteHash":"4a082912a4c56fb995cff6adef0ae38f92bdd1ebaf3cc138784c2e321f859f92","entryHash":"a187db895449ea3c6ecb61aa88cae5b94d23e34c69e0e6c27a18b14fb82dbec2","category":"Environment"}