{"title":"The Effect of Flood Exposure on Insurance Adoption Among US Households","link":"https://onlinelibrary.wiley.com/doi/10.1029/2023EF004110?af=R","date":1719666612000,"content":"<h2>Abstract</h2>\n<p>Despite increasing exposure to flooding and associated financial damages, estimates suggest more than two-thirds of flood-exposed properties are currently uninsured. This low adoption rate could undermine the climate resilience of communities and weaken the financial solvency of the United States National Flood Insurance Program. We study whether repeated exposure to flood events, especially the disaster-scale floods that are expected to become more frequent in a warming climate, could spur insurance adoption. Using improved estimates of residential insurance take-up in locations where such insurance is voluntary, and exploiting variation in the frequency and severity of flood events over time, we quantify how flood events impact local insurance demand. We find that a flood disaster declaration in a given year increases the take-up rate of insurance by 7% in the following year, but that the effect diminishes in subsequent years and is gone after 5 years. This effect is more short-lived in counties in inland states that do not border the Gulf and Atlantic coasts. We also find that the effect of a flood on take-up is substantially larger if there was also a flood in the previous year, and that recent disasters are more salient for homeowners whose primary residences are exposed to a disaster declaration compared to non-primary residences. Overall, these findings suggest that relying on households to self-adapt to increasing flood risks in a changing climate is insufficient for closing the insurance protection gap.</p>","author":"June Choi, \nNoah S. Diffenbaugh, \nMarshall Burke","siteTitle":"Wiley: Earth's Future: Table of Contents","siteHash":"2958dd76fb7907b9b5d9ef7cbca00ecda25efa9c5b75e193900a164a1ec3c84c","entryHash":"a18e8785382a67245888418ae4a68467590a4abbccca787b2ea27e813db897fd","category":"Environment"}