{"title":"Low-Temperature X-ray Microanalysis Sheds New Light on Mineral Nutrition Aspects of Insect Leaf Galling","link":"https://academic.oup.com/mam/article/30/3/607/7602459?rss=1","date":1707264000000,"content":"<span><div>Abstract</div>Manipulation of host plant physiology by leaf-galling insects is a multifaceted process. Among fundamental knowledge gaps surrounding this scientifically intriguing phenomenon is the appropriation of plant mineral nutrients and moisture for galling advantage. Small, soluble mineral ions and watery cell contents in dense gall tissues risk disruption during routine sample preparations. In this study, an X-ray microanalysis was applied to investigate gall mineral nutrition. Morphologically diverse leaf galls were sampled from three Australian rainforest tree species. Using cryo-analytical scanning electron microscopy, real-time X-ray analytical maps of cellular mineral nutrients and water were integrated with anatomical images of gall and leaf cross-sectional surfaces. A comparison of host-leaf and gall anatomies bore direct evidence of drastic changes to leaf cells through the galling process. Distinct “wet” and “dry” regions within galls were anatomically and/or chemically differentiated, suggesting specific functionality. “Wet” regions comprising hydrated cells including soft gall-cavity linings where larvae are known to feed contained soluble plant mineral nutrients, while C-rich “dry” tissues largely devoid of mineral nutrients likely contribute structural support. Mapping immobile nutrients such as Mn may provide a means of “matching” specific gall cell types to those in ungalled host-leaf tissues. The findings here provided otherwise inaccessible insights into leaf-gall mineral nutrition.</span>","author":"","siteTitle":"Microscopy and Microanalysis Current Issue","siteHash":"4696c64d0a05ab8306669645a687c52cc4f52f5a57db1c180736d38256b41e79","entryHash":"a18fcc269641152d954166a70817eaa7455a487b25d443853cd35c1467f8bc07","category":"Environment"}