{"title":"Microencapsulation of lemongrass and mangosteen peel as phytogenic compounds to gas kinetics, fermentation, degradability, methane production, and microbial population using <i>in vitro</i> gas technique","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0304282","date":1717596000000,"content":"<p>by Rittikeard Prachumchai, Chaichana Suriyapha, Gamonmas Dagaew, Sukruthai Sommai, Maharach Matra, Srisan Phupaboon, Yupin Phasuk, Metha Wanapat</p>\r\n\r\nThe purpose of the current study was to evaluate the impact of various doses of microencapsulated lemongrass and mangosteen peel (MELM) on gas dynamics, rumen fermentation, degradability, methane production, and microbial population in <i>in vitro</i> gas experiments. With five levels of microencapsulated-phytonutrient supplementation at 0, 1, 2, 3, and 4% of substrate, 0.5 g of roughage, and a concentrate ratio of 60:40, the trial was set up as a completely randomized design. Under investigation, the amount of final asymptotic gas volume was corresponding responded to completely digested substrate (<i>b</i>) increased cubically as a result of the addition of MELM (<i>P</i> &lt; 0.01) and a cubic rise in cumulative gas output. The amount of MELM form did not change the pH and NH<sub>3</sub>-N concentration of the rumen after 12 and 24 h of incubation. However, methane production during 24 h of incubation, the levels were cubically decreased with further doses of MELM (<i>P</i> &lt; 0.01) at 12 h of incubation. Increasing the dosage of MELM supplementation at 2% DM resulted in a significant increase in the digestibility of <i>in vitro</i> neutral detergent fiber (IVNDF) and <i>in vitro</i> true digestibility (IVTD) at various incubation times (<i>P</i> &lt; 0.05), but decreased above 3% DM supplementations. Moreover, the concentration of propionic acid (C3) exhibited the variations across the different levels of MELM (<i>P</i> &lt; 0.05), with the maximum concentration obtained at 2% DM. The populations of <i>Fibrobacter succinogenes</i>, <i>Ruminococcus albus</i>, <i>Ruminococcus flavefaciens</i>, and <i>Megasphaera elsdenii</i> revealed a significant increase (<i>P</i> &lt; 0.05), while the quantity of Methanobacteriales decreased linearly with increasing doses of MELM. In conclusion, the inclusion of MELM at a concentration of 2% DM in the substrate which could enhance cumulative gas production, NDF and true digestibility, C3 production, and microbial population, while reducing methane concentration and Methanobacterial abundance.","author":"Rittikeard Prachumchai","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a195537c06189fe4519de2f20c76ee5aca9565ba12dff733027b7d50c917cc71","category":"Interdisciplinary"}