{"title":"Refining Holocene sea‐level variations for the Lofoten and Vesterålen archipelagos, northern Norway: implications for prehistoric human–environment interactions","link":"https://onlinelibrary.wiley.com/doi/10.1002/jqs.3604?af=R","date":1709551225000,"content":"<h2>ABSTRACT</h2>\n<p>The Lofoten and Vesterålen archipelagos are located off the outer coast of northern Norway far from the center of the former Fennoscandian Ice Sheet and near the continental shelf edge. Existing relative sea-level (RSL) data indicate a pronounced mid-Holocene transgression and interesting connections with the region's prehistoric human settlement history. Here we present seven new sea-level index points from isolation basins and five terrestrial limiting points from a coastal sedimentary sequence to refine the region's RSL history. Ingression and isolation contacts in isolation basin sediment cores are identified using sedimentary geochemical data, scanning X-ray fluorescence profiles and phytoplankton analysis. The ages of these contacts are determined using radiocarbon-based age models. Our index points range from 11.2 to 1.5k cal a <span>bp</span> and are combined with previously published data to predict the spatiotemporal evolution of sea level in this region using an ensemble of spatiotemporal empirical hierarchical models (STEHME). The new RSL curve constrains the timing of the mid-Holocene transgression, which occurred from c. 9 to 6k cal a \n<span>bp</span> when sea level increased from −4 to 7 m above present day. From c. 6 to 5k cal a \n<span>bp</span>, RSL rapidly fell to c. 4 m above present values, and more gradually declined at an average rate of c. 0.8 m ka<sup>−1</sup> over the last 5k cal a \n<span>bp.</span> Isobase maps derived using the STEHME show a decrease in the regional shoreline gradients since the transgression maximum from 0.25 to 0.07 m km<sup>−1</sup>. Our data also better define how RSL variations influenced the location and preservation of coastal settlement locations and harbors from the early Stone Age through historic intervals, improving understanding of regional human–environment interactions.</p>","author":"Nicholas L. Balascio, \nWilliam J. D'Andrea, \nRoger C. Creel, \nLeah Marshall, \nMoussa Dia, \nStephen Wickler, \nR. Scott Anderson, \nJacqueline Austermann, \nKristian Vasskog, \nPål Ringkjøb Nielsen, \nSvein Olaf Dahl","siteTitle":"Wiley: Journal of Quaternary Science: Table of Contents","siteHash":"e4cb264adfd99de4695eda5f992d61d2819971c444b4237b1e7b12202742678e","entryHash":"a1969a420d62297151681cab31d4370524c85c2b63e74d145acf32fe4882e07d","category":"Environment"}