{"title":"Persistent Illegal Hunting of Wildlife in an African Landscape: Insights from a Study in the Luangwa Valley, Zambia","link":"https://www.preprints.org/manuscript/202406.0110/v1","date":1717425503000,"content":"Decades of illegal hunting (poaching) have adversely affected wildlife populations and thereby limited sustainable wildlife conservation in the Luangwa Valley, Zambia. Despite intervention efforts to address the problem, illegal hunting of wildlife has persisted. Therefore, this study was conducted to understand the persistence of illegal hunting by investigating drivers of poaching and intervention measures using mixed-methods approach. Stratified random sampling was used to collect data from 346 respondents through structured questionnaires. Purposive sampling was used to collect data through nine (9) focus group discussions and three (3) in-depth interviews with experts. The study revealed that persistent illegal hunting was mainly driven by people’s critical needs for survival and sustaining livelihoods and not by inadequate law enforcement as presumed by resource managers. Although law enforcement was the most prevalent intervention measure, it did not deter local illegal hunters because the main motivations for poaching were not effectively addressed. The key implication of findings is that where illegal harvesting of natural resources in protected areas by local resource users is driven by people’s critical needs for survival and livelihoods which are ineffectively addressed, illegal harvesting may persist even with increased law enforcement. The study provides empirical evidence, novel conceptual knowledge and understanding on how prevalent drivers of poaching and other factors may have influenced persistent illegal hunting in the Luangwa Valley.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a1975e8eb3c581e82b80f0ffac45fd3d2d4e2ffe7b6428e642c8edfb0e792fea","category":"Interdisciplinary"}