{"title":"Fracture Resistance Analysis of 3D-Printed and Prefabricated Artificial Teeth for Removable Dentures","link":"https://www.preprints.org/manuscript/202404.1153/v1","date":1713353013000,"content":"The integration of three-dimensional (3D) printed resin denture teeth represents a significant ad-vancement in digital dentistry. This study aimed to assess their ability to withstand chipping and indirect tensile fractures, comparing them with conventionally manufactured resin denture teeth. Four groups, each comprising 30 specimens, were examined: Group 1 featured 3D printed denture teeth (NextDent, 3D Systems, Soesterberg, The Netherlands), while the others included commer-cially obtained Ivostar Shade, SpofaDent Plus, and Major Super Lux teeth. Stereolithography 3D printing was utilized to produce methacrylate-based photopolymerized resin teeth models for Group 1, while the remaining groups were commercially sourced. Chipping and indirect tensile fracture tests were performed at a speed of 1 mm/min until fracture occurred. Statistical analysis was conducted using one-way analysis of variance (ANOVA) with Tukey's honestly significant difference multiple comparisons test (p &lt; 0.05). Results indicated that 3D-printed teeth exhibited higher indirect tensile fracture resistance than Major Super Lux and Ivostar Shade but lower than SpofaDent Plus. Additionally, in the chipping test, buccal chipping occurred in 3D-printed resin teeth without distortion. In the indirect tensile test, the fracture line emerged near the loading point, extending cervically from the inner incline of both cusps. Overall, denture teeth produced via 3D printing with printable resin materials demonstrated sufficient fracture resistance, making them suitable for prosthetic applications.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a19d32f891c01675a7ab61cd2ed089cc56216850bd1258b57ef3287299a0f0bb","category":"Interdisciplinary"}