{"title":"The Basement Tapes: Jojo Harper","link":"https://www.cyclingtips.com/2023/03/the-basement-tapes-jojo-harper/","date":1678392315000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/WhatsApp-Image-2019-01-16-at-07.33.15-1024x682-1.webp?width=1200\" alt=\"The Basement Tapes: Jojo Harper\" /></figure><p>Jojo Harper is a cycling photographer at the top of her game. I caught up with her to learn more about her life and career.</p>\n<figure><img loading=\"lazy\" src=\"https://pelotonmagazine.com/wp-content/uploads/2021/10/WhatsApp-Image-2019-01-16-at-07.33.15-1024x682.jpg?width=730\" alt width=\"1024\" height=\"682\" /><figcaption>Jojo Harper.</figcaption></figure>\n<p><strong>JOJO HARPER</strong><br />\n<strong>Girona, Spain</strong></p>\n<p><strong>The last time I saw you was in Girona 2020 and shortly thereafter Spain went into lockdown. Overall, how did the roller-coaster year treat you?</strong> I remember. It was a few days pre-lockdown! It was pretty brutal in Spain. The police were out in force ready to pounce at any opportunity! We weren’t allowed outside at all; even walking our dog proved tricky. I tried to be productive and learn a language and learn to write, but that lasted about a day. I did manage to document a lot of it with my camera as I took it with me whenever I went shopping. Inside the home, my boyfriend and I became obsessed with the turbo trainer and that was about it! In terms of work, I was lucky. My clients remained loyal and supportive, which was a relief. The first race back was Strade Bianche, which is my favorite race. The heat and the break from racing made it extra special to return to.</p>\n<p><strong>The one word I think of when I see your captures is “intimate.” You tend to capture moments that are “atypical,” not the usual capture. Do you agree? </strong>I take that as a real compliment, thank you! I don’t want to be seen as a “cycling/sports” photographer; that stuff can be seen on TV and by anyone. I aim to capture intimate images and I never know if I succeed, so thank you. I think working with one team and getting to know them well really helps. They then trust you and allow you to be there for those special moments. I sometimes think I have an “odd” eye as when exiting the press room with other photographers, what I like is often what others don’t like. Do I agree with you? I have no idea; it’s what I aim to do, but judging my own work is something I am not very good at.</p>\n<figure><img loading=\"lazy\" src=\"https://pelotonmagazine.com/wp-content/uploads/2021/10/L1140276-1024x683.jpg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption>Lizzie Deignan (L) and Elisa Longo Borghini (R).</figcaption></figure>\n<p><strong>It seems that being embedded with a specific team like the women’s Trek-Segafredo squad is where you feel most at home. What is it about following a team that you love? </strong>Getting to know the riders and building relationships. It feels like I am on a race with a group of friends, which makes my job so much easier and more fun.</p>\n<p><strong>In issue 96 of Peloton, the Photo Annual, I asked about a sport you’d love to capture more, and you said, “skiing.” Did anything come about that desire? </strong>Skiing is my absolute passion! We managed to get away in October for a holiday in Zermatt, Switzerland. When we were there it just so happened that the French ski team were there training. They allowed me access and I had a great time shooting them. I emailed a few ski brands who were actually very interested. That reminds me, I need to follow them up!</p>\n<p><strong>You went from the Giro Donne to the Tour de France. Is there any shift in mentality for doing that? </strong>Stress levels for sure increase at the Tour, especially during a pandemic! There is a lot more going on and it’s not as relaxed. I had my own car so I had to properly plan each evening how I would catch the race. Choices had to be made as I was in the mountains and only one mountain could be shot at each stage. It’s hard. Do I shoot the Tourmalet, an iconic climb, or the finish, Luz-Ardiden? I chose the latter and it didn’t disappoint; those decisions are stressful to make, and I often make the wrong one. The TdF is strict; you do something wrong and you are chucked off the race. I was very aware of this and was constantly unsure if I was allowed to be in a certain place or not. The Giro Donne is a lot more chilled; I felt I could be anywhere and I was never questioned. Both awesome races for different reasons.</p>\n<p><strong>Technology keeps evolving in photography. Give us the camera setup you use. </strong>Leica q2 (best camera I have ever owned). Leica sl2, 50mm 1.2, Canon 5d iv, 24-70 2.8.</p>\n<figure><img loading=\"lazy\" src=\"https://pelotonmagazine.com/wp-content/uploads/2021/10/L1130899-1024x683.jpg?width=730\" alt width=\"1024\" height=\"683\" /><figcaption>Lucinda Brand (L), Lizzie Deignan (C) and Elisa Longo Borghini (R).</figcaption></figure>\n<p><strong>This particular image stands out to me. Talk us through it. </strong>When they were all snuggled together my first reaction was, that’s so cute, I have to get that moment. They looked like a group of giggling schoolgirls. Lucinda [Brand] came over the line first; it was a super-hot day and she was very frustrated as she had a puncture and had done the last 10 kilometers of the race with it. She still sprinted, but she was totally cooked and for sure the flat tire didn’t help! Lizzie [Deignan] and Elisa [Longo Borghini] joined her and made her laugh. Spirits were high; it was so nice to see, despite them not getting the result they had hoped for.</p>\n<p><strong>CONTACT SHEET</strong><br />\nEmail: <a href=\"mailto:jojo@jojoharper.com\" target=\"_blank\">jojo@jojoharper.com</a><br />\nInstagram: <a href=\"https://www.instagram.com/jojoharper_\" target=\"_blank\">@jojoharper_</a><br />\nWebsite: <a href=\"https://jojoharper.com\" target=\"_blank\">jojoharper.com</a></p>\n<p><i>This story originally appeared in Peloton magazine.</i></p>","author":"Will Tracy","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a1a1986cc10327e2ec497f4a6750a6b797969681ab1168318e587163dca8ad69","category":"Cycling"}