{"title":"The must-have iPhone 15 accessory might be Apple’s 20W charger","link":"https://www.macworld.com/article/1665706/iphone-15-20w-charger-fast-charge.html","date":1679401006000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple is gearing up for the launch of the iPhone 15 later this year, and that includes the ecosystem of accessories that will accompany the new handsets. One of the most important of these will be the official 20W USB-C charger. An analyst has claimed Apple is anticipating a surge in demand because the iPhone 15 won’t be able to fast-charge without it.</p>\n\n\n\n<p>Ming-Chi Kuo, one of the most widely read Apple analysts, today posted a brief article on <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://medium.com/@mingchikuo/%E9%A0%98%E7%9B%8A%E6%99%BA%E9%80%A0%E7%82%BAiphone-15%E7%B3%BB%E5%88%97%E6%94%B9%E6%8E%A1usb-c%E8%88%87apple%E9%A1%AF%E8%91%97%E8%AA%BF%E5%8D%8720w-usb-c%E5%85%85%E9%9B%BB%E5%87%BA%E8%B2%A8%E9%A0%90%E4%BC%B0%E7%9A%84%E4%B8%BB%E8%A6%81%E8%B4%8F%E5%AE%B6-ly-itech-is-the-primary-beneficiary-of-the-79743df328f&amp;xcust=1-1-1665706-1-0-0&amp;sref=https://www.macworld.com/feed\" target=\"_blank\">Medium</a> discussing Apple’s expected to <a href=\"https://www.macworld.com/article/1362886/apple-confirms-future-iphones-will-switch-from-lightning-to-usb-c.html\">transition from Lightning to USB-C ports </a>on its late-2023 smartphones, and the effect on accessories sales. Apple, he says, is “optimistic about strong replacement demand for 20W USB-C chargers following the switch to USB-C for the iPhone 15 series,” and he expects 30–40 percent year-over-year growth.</p>\n\n\n\n<p>As usual, Kuo focuses on the supply chain, identifying the firm LY iTech as the principal beneficiary of the move, but there are plenty of implications for consumers. The reason Kuo expects Apple to make and sell far more 20W chargers is a potential annoyance for those buying the phones: “I believe Apple will optimize the fast charging performance of MFi-certified chargers for the iPhone 15,” he writes euphemistically. The “optimization” he’s talking about means Apple will lock down this important feature of the new iPhone so that it only works properly when connected to an officially sanctioned charging accessory with MFi (or Made For iPhone) certification.</p>\n\n\n\n<p>As annoying as it would be, this wouldn’t be entirely unexpected. The MFi program is a minor but reliable source of passive income for Apple, and it loves to push customers toward officially sanctioned accessories. Chargers without MFi certification are likely to be cheaper than the official versions, but Apple would like us to believe they are less reliable and efficient, and even <a href=\"https://www.macworld.com/article/672659/why-you-shouldnt-buy-cheap-iphone-cables.html\">dangerous</a> to use; in this case, it appears that will be true.</p>\n\n\n\n<p>It’s worth noting that the 20W power adapter isn’t a new product: Apple sells it right now for <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1665706-1-0-0&amp;u=https://www.apple.com/shop/product/MHJA3AM/A/20w-usb-c-power-adapter\" target=\"_blank\">$19 in the U.S.</a> and <a href=\"https://apple.sjv.io/c/321564/435031/7613?subid1=1-1-1665706-1-0-0&amp;u=https://www.apple.com/uk/shop/product/MHJF3B/A/20w-usb-c-power-adapter\" target=\"_blank\">£19 in the U.K.</a> for use charging Lightning and USB-C devices alike. (It doesn’t come with a cable, so you simply provide the correct one for your device.) Those who own one of these already will be all set when they buy an iPhone 15, which likely won’t come with a bundled power adapter, but plenty more iPhone owners have been getting by with lower-wattage or unofficial chargers and will need to upgrade in order to benefit from the new phone’s fast-charging feature.</p>\n\n\n\n<p>It’s not clear from the report whether Apple will be selling the same 20W charger or making a new one with gallium nitride tech. Apple sells 140W and 35W gallium-nitride chargers for MacBooks that are significantly more compact than previous models. Any of Apple’s current chargers should be able to fast-charge the iPhone 15, but we’ll need to test them to be sure.</p>\n\n\n\n<p>For all the latest news and rumors about Apple’s upcoming phones, check our regularly updated <a href=\"https://www.macworld.com/article/1351959/iphone-15-plus-pro-ultra-rumors-specs-release-price.html\">iPhone 15 superguide</a>. And if you want to shop for a power adapter, <a href=\"https://www.macworld.com/article/234733/best-usb-c-power-adapters-for-iphone-12-buying-tips-recommendations.html\">we’ve rounded up our favorites</a>—including the one that you’ll apparently need to buy with your iPhone 15.</p>\n\niPhone</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a1aac0d9747b4222b24079524c7727ab09da775dce57ebcb2b38fd2e661f03c9","category":"Apple"}