{"title":"Optimizing the series cascade control structure for nonminimum phase system regulation","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202300051?af=R","date":1712055816000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/9da729cb-6e9b-44d4-b3c2-f87c53705848/appl202300051-gra-0001-m.png\" alt=\"Optimizing the series cascade control structure for nonminimum phase system regulation\" /><p>This work introduces a novel control strategy for nonminimum phase systems, utilizing a fractional-order proportional-integral-derivative controller in a series cascade configuration, demonstrating improved performance and robustness. The controller settings are optimized using the Teaching Learning Based Optimization (TLBO) algorithm with an objective to minimize Integral Square Error (ISE).\n</p>\n<br />\n<h2>Abstract</h2>\n<p>This work elucidates the control of integrating a nonminimum phase system via a series cascade scheme with fractional-order P.I. (Proportional–Integral) plus D (Derivative) controller. The traditional Internal Model Control (IMC) is adopted for inner loop controller design. The feedback D controller is synthesized with the outer loop process model, showing the proposed work's universality. The outer loop controller is suggested in the IMC framework after the accountability of fractional-filter and inverse response compensator. This combination is revealed to enhance performance without compromising robustness. The Riemann sheet principle is explored to compute the stability of the suggested controller. The sensitivity analysis has asserted the robustness. More importantly, the optimal value of controller settings is achieved via the Teaching Learning Based Optimization (TLBO) algorithm. This TLBO algorithm uses an objective function that minimizes Integral Square Error. Two illustrative problems are utilized to examine the recommended control structure's virtue.</p>","author":"Ashish Kumar Singhal, \nManish Yadav, \nVijay Yadav, \nJyoti Deshmukh, \nManish Billore, \nHirak Mazumdar","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"a1aa10fa2b0607aab149be7c1f2640b5628ea80f4d883b0aed510de4af450fba","category":"Environment"}