{"title":"Scarlett Johansson ฟ้องดิสนีย์ฐานละเมิดสัญญาฉาย Black Widow บน Disney+ ทำให้เสียรายได้จากบ็อกซ์ออฟฟิศ","link":"https://www.blognone.com/node/123969","date":1627614468000,"content":"<div><div><div><p>Scarlett Johansson นักแสดงนำหนัง Black Widow ฟ้องร้องบริษัทดิสนีย์ จากการสตรีมหนังใน Disney+ ควบคู่ไปกับฉายในโรงภาพยนตร์ ซึ่งอยู่นอกเหนือข้อตกลง และลิดรอนผลประโยชน์ที่เธอควรจะได้ในฐานะนักแสดง</p>\n<p>Johansson ระบุว่าค่าตอบแทนหลักของนักแสดงขึ้นอยู่กับรายรับจากบ็อกซ์ออฟฟิศหรือรายได้จากการฉายหนังในโรงภาพยนตร์  เธอยังบอกด้วยว่าดิสนีย์ให้สัญญาว่าจะฉายหนังในโรงก่อนแบบเอ็กซ์คลูซีฟ แต่กลายเป็นว่าดิสนีย์นำหนังฉายผ่านสตรีมมิ่ง Disney+ ไปพร้อมๆ กัน ซึ่งเป็นเรื่องที่อยู่นอกเหนือข้อตกลง</p>\n<p>John Berlinski ทนายความของ Johansson กล่าวว่า ดิสนีย์มองเห็นโอกาสในการโปรโมต Disney+ ซึ่ง Johansson ก็ทำหน้าที่ของตนต่อไปโดยไม่รู้ว่าดิสนีย์เปลี่ยนเงื่อนไขการฉายหนัง</p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/6faaa66b9582de0c3cac75afa0d7c59d.png\" /></p>\n<p>ด้านดิสนีย์ออกมาโต้กลับว่า คดีนี้เป็นการเพิกเฉยต่อผลกระทบโควิด-19 ที่โรงหนังหลายแห่งยังต้องปิดบริการ ที่สำคัญดิสนีย์ได้ปฏิบัติตามสัญญาของ Johansson  อย่างสมบูรณ์ และยิ่งกว่านั้นการเปิดตัว Black Widow บน Disney+ ด้วย Premier Access  ยังทำให้เธอมีรายได้เพิ่ม 20 ล้านดอลลาร์</p>\n<p>ก่อนหน้านี้ดิสนีย์ออกมาประกาศว่า ตัวหนัง Black Widow <a href=\"https://www.blognone.com/node/123659\">สร้างรายได้เฉพาะบน Disney+ ไป 60 ล้านดอลลาร์</a>หรือเกือบ 2 พันล้านบาท ส่วนช่องทางโรงภาพยนตร์ในสหรัฐฯ ตัวหนังสร้างรายได้ไป 80 ล้านดอลลาร์และ 78 ล้านดอลลาร์จากโรงหนังทั่วโลก</p>\n<p>ที่มา - <a href=\"https://www.today.com/popculture/scarlett-johansson-sues-disney-claims-black-widow-streaming-cut-box-t226948\">Today.com</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/disney-plus\">Disney+</a></div><div><a href=\"/topics/movie-0\">Movie</a></div><div><a href=\"/topics/streaming\">Streaming</a></div><div><a href=\"/topics/lawsuit\">Lawsuit</a></div><div><a href=\"/topics/marvel\">Marvel</a></div></div></div>","author":"sunnywalker","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a1ae9fb81fcdcb1024071ad85fed3784dca4d25330d33bb58e943e65a0e1f9f7","category":"Thai"}