{"title":"The interplay between memory control and emotion regulation","link":"https://nyaspubs.onlinelibrary.wiley.com/doi/10.1111/nyas.15107?af=R","date":1707318779000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8ab0f0aa-9d69-49bf-83bc-7fc71164764b/nyas15107-gra-0001-m.png\" alt=\"The interplay between memory control and emotion regulation\" />\n<p>Memory control (MC) and emotion regulation (ER) are critical cognitive functions for adapting to life's challenges. Accumulating evidence suggests these processes are interrelated, yet comprehensive discussion of their interplay remains lacking. We introduce an integrative framework exploring the mutual influence between MC and ER. The framework spotlights the need to harness MC–ER interplay for future research.\n\n</p>\n<br />\n<h2>Abstract</h2>\n<p>Memory control (MC) and emotion regulation (ER) are critical cognitive functions for adapting to life's challenges, drawing significant research attention. Accumulating evidence suggests these processes are interrelated, yet a comprehensive discussion of their interplay remains lacking. We introduce an integrative framework exploring the mutual influence between MC and ER, composed of two interrelated branches: first, MC aids in ER through the retrieval of positive memories, intentional forgetting of undesirable content, and the adaptive updating of memory stores. Second, ER impacts MC by upregulating positivity and downregulating negativity in memories. The framework spotlights the need to harness MC–ER interplay for future research. Potential directions include utilizing MC to amplify ER capabilities, training ER skills to refine MC performance, and modulating the cognitive and neural overlapping of both processes to improve both functions. Delving into the MC–ER nexus advances understanding of the intricate emotion–memory relationship and holds great promise for developing novel behavioral interventions.</p>","author":"Yun Luo, \nRui Wang, \nHui Xie, \nZhenhong He","siteTitle":"Wiley: Annals of the New York Academy of Sciences: Table of Contents","siteHash":"98c7119f6adff358c1cf3a15f5efdc68ead59681d375d3da00900b474221c3c5","entryHash":"a1c049b31d3d1a7076deedf336fd4585dc6abcee32d93a8d5ef9cc69a17e3ea9","category":"Environment"}