{"title":"Upcoming iOS update to allow third-party iPhone 13 screen repairs after all","link":"https://www.macworld.com/article/550184/cracked-iphone-13-screen-repair-face-id-disabled.html","date":1636569607000,"content":"<div>\n<section><div></div></section><p>After iFixit reported last week that Apple had taken away the ability to fix cracked iPhone 13 screen without disabling Face ID, Apple has backed off its hard stance, <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.theverge.com/2021/11/9/22772433/apple-iphone-13-screen-replacements-face-id-software-update&amp;xcust=1-1-550184-1-0-0&amp;sref=https://www.macworld.com/feed\">telling the Verge</a> that an upcoming software update will change the process.</p>\n\n\n\n<p><a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/News/54829/apples-new-screen-repair-trap-could-change-the-repair-industry-forever&amp;xcust=1-1-550184-1-0-0&amp;sref=https://www.macworld.com/feed\">iFixit reported last week</a> that the iPhone 13 contains a small chip “about the size of a Tic-Tac” in the screen that is necessary for operating Face ID. Therefore, when the screen is replaced with a non-Apple part, Face ID access will break as the iPhone 13 is unable to pair to its screen without the tiny microcontroller.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/11/iphone-13-face-id-screen.jpg?quality=50&amp;strip=all&amp;w=1200\" /></figure><p>iFixit</p></div>\n\n\n\n<p>With the current system, at-home repairs are basically impossible, and smaller shops would have difficulty fixing iPhone 13 screens without breaking Face ID. iFixit anticipated many small repair shops shutting down as a result of the change, due to the expensive new equipment and training required for the new screen repair. Apple didn’t give a timeline for the software update, but it is currently testing <a href=\"https://www.macworld.com/article/547488/ios-15-2-features-beta-release-date-how-to-install.html\">iOS 15.2</a>.</p>\n\n\n\n<p>iFixit reported that authorized technicians needed access to Apple Services Toolkit 2 to log the repair to Apple’s cloud servers and sync the serial numbers of the phone and screen, making the repair expensive and laborious. The only workaround iFixit has found is to physically move the soldered chip from the original screen onto the replacement, which is no easy task.</p>\n\n\n\n<p>It’s common for Apple to <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.ifixit.com/News/48768/the-new-important-iphone-camera-message-is-another-bad-omen&amp;xcust=1-1-550184-1-0-0&amp;sref=https://www.macworld.com/feed\">issue iOS warnings</a> about third-party parts, including cameras, batteries, and screens, but iFixit said “Apple has crossed the Rubicon” with this new requirement. It’s unclear whether Apple is rolling back the requirement due to pressure or whether it was always planning on changing the repair process. In the meantime, you might want to pick up <a href=\"https://www.macworld.com/article/541224/iphone-13-and-13-pro-cases-best-cases.html\">a good case for your iPhone 13</a>—or make sure you have <a href=\"https://www.macworld.com/article/230521/applecare-warranty-faq.html\">AppleCare+</a>.</p>\n</div>","author":"Michael Simon","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a1c54d03d62d2a76198b9e663fb1ed0c733b8a2a955a9cc44417930be8edb6fc","category":"Apple"}