{"title":"A qualitative study on the adoption of the new duty hour regulations among medical residents and faculty in Korea","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0301502","date":1712844000000,"content":"<p>by Eui-Ryoung Han, Eun-Kyung Chung</p>\r\n\r\nDuty hour regulations (DHRs) were enforced in 2017 in Korea to prevent the detrimental effects of excessively prolonged working hours among medical residents. We investigated the adoption of and implications of the new DHRs among medical residents and faculty members. Semi-structured interviews were conducted with 15 medical residents and 9 faculty members across general surgery, internal medicine, obstetrics–gynecology, and pediatrics departments at Chonnam National University Hospital. Based on the constructivist grounded theory, we developed themes from the data by concurrent coding and analysis with theoretical sampling until data saturation. In addition, respondent validation was used to ensure accuracy, and all authors remained reflexive throughout the study to improve validity. The methods of DHRs adoption among residents and faculty members included the following 4 themes: DHRs improved work schedule, residents have more time to learn on their own, clinical departments have come to distribute work, organization members have strived to improve patient safety. Residents have undertaken initial steps towards creating a balance between personal life and work. Teamwork and shift within the same team are the transitions that minimize discontinuity of patient care considering patient safety. Teaching hospitals, including faculty members, should ensure that residents’ work and education are balanced with appropriate clinical experience and competency-based training.","author":"Eui-Ryoung Han","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a1c637635e47c3daa9fdb947ea842451e8295d91ba8718e5531a067f2a5d0553","category":"Interdisciplinary"}