{"title":"Intel เตรียมลงทุน 7.1 พันล้านดอลลาร์ สร้างโรงงานผลิตชิปใหม่ในมาเลเซีย","link":"https://www.blognone.com/node/126305","date":1639458004000,"content":"<div><div><div><p>หน่วยงานพัฒนาการลงทุนแห่งมาเลเซีย (Malaysian Investment Development Authority) เปิดเผยข้อมูลว่า Intel เตรียมลงทุนมูลค่ากว่า 7.1 พันล้านดอลลาร์ เพื่อสร้างโรงงานประกอบชิป (semiconductor packaging) แห่งใหม่ใน Bayan Lepas ใกล้สนามบินนานาชาติในปีนัง และจะมีการแถลงข่าวเพิ่มเติมโดยมี Pat Gelsinger ซีอีโอของ Intel และ Mohamed Azmin Ali รัฐมนตรีอาวุโสของกระทรวงการค้าและอุตสาหกรรมนานาชาติของมาเลเซียร่วมด้วยในวันพุธที่ 15 ธันวาคมนี้</p>\n<p>Intel มีโรงงานประกอบชิปในมาเลเซียอยู่แล้ว แต่คาดว่าด้วยดีมานด์ที่เพิ่มขึ้น และซัพพลายเชนที่ได้รับผลกระทบจากโควิด-19 และทำให้ชิปขาดแคลนในช่วงนี้ อาจทำให้ Intel ที่กำลังมุ่งเอาดีด้านการจ้างผลิตชิป มองหาหนทางเพิ่มกำลังการผลิตมากขึ้น หลังประกาศ<a href=\"https://asia.nikkei.com/Business/Tech/Semiconductors/Intel-breaks-ground-on-20bn-Arizona-chip-plants-in-battle-with-TSMC\">เตรียมสร้างโรงงานในรัฐแอริโซนา สหรัฐอเมริกา</a> ขับเคี่ยวกับ TSMC ที่ก็เตรียมสร้างโรงงานในรัฐเดียวกัน และ <a href=\"https://www.cnbc.com/2021/11/24/samsung-announces-17-billion-chip-plant-in-texas.html\">Samsung Electronics ที่เตรียมสร้างโรงงานในรัฐเท็กซัส</a></p>\n<p><img src=\"https://www.blognone.com/sites/default/files/externals/9ef5a4072493c81e36995081e887be23.jpg\" /></p>\n<p>ศึกการยึดกุมฐานผลิตชิปในประเทศน่าจะเริ่มร้อนแรงมากขึ้นเรื่อยๆ หลังเกิดวิกฤตชิปขาดแคลนจากการรบกวนซัพพลายเชนของโควิด-19 รวมไปถึงฐานการผลิตที่มีประสิทธิภาพสูงของ TSMC ยังอยู่ในไต้หวัน ซึ่งเสี่ยงต่อการมีข้อพิพาทกับจีน</p>\n<p>เมื่อบริษัทต่างๆ ต้องการขยายกำลังการผลิตและกระจายความเสี่ยง ประเทศที่ต้องการใช้ชิปเซมิคอนดักเตอร์ความซับซ้อนสูงซึ่งอยู่ในอุปกรณ์สำคัญหลายชนิด จึงต้องมีการแข่งขันกันดึงดูดการลงทุนในภาคการผลิตจากบริษัทต่างๆ มากขึ้น เช่น<a href=\"https://www.blognone.com/node/126288\">ญี่ปุ่นที่เตรียมลงทุนกว่า 6 แสนล้านเยนก่อนหน้านี้</a> เพื่อรับประกันซัพพลายชิปในประเทศ ที่น่าจะถือได้ว่าเป็นปัญหาความมั่นคงอีกปัญหาที่สำคัญของยุคนี้เลยทีเดียว</p>\n<p>ที่มา - <a href=\"https://asia.nikkei.com/Spotlight/Supply-Chain/Malaysia-says-Intel-to-invest-7.1bn-in-local-chip-facility2\">Nikkei Asia</a></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/intel\">Intel</a></div><div><a href=\"/topics/semiconductor\">Semiconductor</a></div><div><a href=\"/topics/malaysia\">Malaysia</a></div></div></div>","author":"mheevariety","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a1cb4bcead97218ee3669eb3231d06e9fda7d0490065e785ddd127563b9cb2a1","category":"Thai"}