{"title":"Optical Coherent Tomography Four Optical Couplers and Attenuator Balance System","link":"https://www.preprints.org/manuscript/202409.1566/v1","date":1726809877000,"content":"OCT (Optical coherent tomography) is an imaging\nmethod used to generate a picture of the back of the eyes and\nretinas. By using an interferometer, part of the light is directed\nto the sample and another portion is sent to a reference arm\nwith a well-known length [1]. Interferometers merge two or\nmore sources of light to create interference patterns. We split the\nlight into two beams that travel different optical paths and are\ncombined to produce interference. There are two types of OCT:\none is time domain (TD-OCT) and the other Fourier domain (FDOCT).\nTD-OCT is a system which depends on a mechanical cycle\ntime of the moving reference mirror. In FD-OCT the reference\nmirror is fixed, and assists in sampling multiple points from the\nocular structures simultaneously. Optical coherent tomography\n(OCT) generates sub-surface images of translucent or opaque\nmaterials at a resolution equivalent to a low power microscope.\nOCT build up clear 3D images of thick samples by rejecting\nbackground signals whilst collecting light directly reflected from a\nsurface of interest. OCT systems use broadband sources and split\nlight in a fiber coupler, first on a direct reference mirror, and as\nthe sample is being measured. The noise types in OCT systems are\nreceiver noise shot noise, intensity noise, and beat noise. In OCT\nsystems there is balanced detection and unbalanced detection.\nIn balanced detection, the total photo current variance or noise\nis σ2\ni = σ2\nre + σ2\nsh + σ2\nbe. In contrast, OCT unbalanced systems\ncontain Michelson interferometer. A balanced OCT system is an\nextended version of the unbalanced variant with two more beam\nsplitters added for double detection. Balanced OCT systems can\ninclude additional attenuators at the detector arm to improve\nthe detection efficiency. OCT balanced systems with four optical\ncouplers and attenuator gives graphs of noise [V 2] as a function\nof typical values of IDC (detector photo current or mean photo\ncurrent) for different attenuation values, and SNR as a function\nof mean photo current (IDC) for different attenuation values and\nother OCT system parameters. OCT SNR graphs for different\nK1, K2, K3 and K4 splitt","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a1cd54de396d8a5f207ac8ef7cbdbdc201c4ee3d0f39b77e861265c78b63d9e2","category":"Interdisciplinary"}