{"title":"Unveiling the environmental significance of acetylperoxyl radical: Reactivity quantification and kinetic modeling","link":"https://academic.oup.com/pnasnexus/article/doi/10.1093/pnasnexus/pgae330/7728468?rss=1","date":1722988800000,"content":"<span><div>Abstract</div>Acetylperoxyl radical (CH<sub>3</sub>C(O)OO<sup>•</sup>) is among highly reactive organic radicals which are known to play crucial roles in atmospheric chemistry, aqueous chemistry and, most recently, peracetic acid (PAA)-based advanced oxidation processes. However, fundamental knowledge for its reactivity is scarce and severely hampers the understanding of relevant environmental processes. Herein, three independent experimental approaches were exploited for revelation and quantification of the reaction rates of acetylperoxyl radical. First, we developed and verified laser flash photolysis of biacetyl, ultraviolet (UV) photolysis of biacetyl, and pulse radiolysis of acetaldehyde, each as a clean source of CH<sub>3</sub>C(O)OO<sup>•</sup>. Then, using competition kinetics and selection of suitable probe and competitor compounds, the rate constants between CH<sub>3</sub>C(O)OO<sup>•</sup> and compounds of diverse structures were determined. The three experimental approaches complemented in reaction time scale and ease of operation, and provided cross-validation of the rate constants. Moreover, the formation of CH<sub>3</sub>C(O)OO<sup>•</sup> was verified by spin-trapped electron paramagnetic resonance, and potential influence of other reactive species in the systems was assessed. Overall, CH<sub>3</sub>C(O)OO<sup>•</sup> displays distinctively high reactivity and selectivity, reacting especially favorably with naphthyl and diene compounds (<span>k</span> ∼ 10<sup>7</sup>–10<sup>8</sup> M<sup>−1</sup> s<sup>−1</sup>) but sluggishly with N- and S-containing groups. Significantly, we demonstrated that incorporating acetylperoxyl radical-oxidation reactions significantly improved the accuracy in modeling the degradation of environmental micropollutants by UV/PAA treatment. This study is among the most comprehensive investigation for peroxyl radical reactivity to date, and establishes a robust methodology for investigating organic radical chemistry. The determined rate constants strengthen kinetic databases and improve modeling accuracy for natural and engineered systems.</span>","author":"","siteTitle":"PNAS Nexus Current Issue","siteHash":"fea58439d6cc2c0ccad3ee11497de51870b6a2407c2235f665cca3245ef20ac2","entryHash":"a1d4af374087562f4a756dbf20a54e9d161bc4aafbc025d1ca31ef51fa11fe56","category":"Interdisciplinary"}