{"title":"Sorry, but XMPP Was Doomed, Not Extinguished by Google","link":"https://ploum.net/2023-06-23-how-to-kill-decentralised-networks.html","date":1687827317000,"content":"\n<p>Ploum, in a piece titled “How to Kill a Decentralised Network (Such as the Fediverse)”:</p>\n\n<blockquote>\n  <p>In 2013, Google realised that most XMPP interactions were between\nGoogle Talk users anyway. They didn’t care about respecting a\nprotocol they were not 100% in control. So they pulled the plug\nand announced they would not be federated anymore. And started a\nlong quest to create a messenger, starting with Hangout (which was\nfollowed by Allo, Duo. I lost count after that). [...]</p>\n\n<p>While XMPP still exist and is a very active community, it never\nrecovered from this blow. Too high expectation with Google\nadoption led to a huge disappointment and a silent fall into\noblivion. XMPP became niche. So niche that when group chats became\nall the rage (Slack, Discord), the free software community\nreinvented it (Matrix) to compete while group chats were already\npossible with XMPP. (Disclaimer: I’ve never studied the Matrix\nprotocol so I have no idea how it technically compares with XMPP.\nI simply believe that it solves the same problem and compete in\nthe same space as XMPP).</p>\n\n<p>Would XMPP be different today if Google never joined it or was\nnever considered as part of it? Nobody could say. But I’m\nconvinced that it would have grown slower and, maybe, healthier.\nThat it would be bigger and more important than it is today. That\nit would be the default decentralised communication platform. One\nthing is sure: if Google had not joined, XMPP would not be worse\nthan it is today.</p>\n</blockquote>\n\n<p>This is in the context of <a href=\"https://daringfireball.net/2023/06/more_on_preemptively_blocking\">the situation with Mastodon and Facebook’s upcoming “Threads” project</a>, and the subset of Mastodon instance admins who are pledging preemptively to block it. Basically it’s an argument that Google applied Microsoft’s old <a href=\"https://en.wikipedia.org/wiki/Embrace,_extend,_and_extinguish\">Embrace, Extend, Extinguish strategy</a> to kill XMPP, and that thus XMPP is a better example than email when debating whether large scale federated protocols should allow large corporate instances to join.</p>\n\n<p>I don’t buy it. XMPP is an instant messaging protocol. Instant messaging is effectively dead. AIM is gone and I learned only while writing this post that ICQ is apparently still around. All modern messaging protocols have some form of message persistence; instant messaging did not. With instant messaging you could only send a message to someone while they were logged in with the client app open and running. You can’t prove a negative, but I see no scenario where XMPP would have any relevance today, regardless of Google’s decisions a decade ago.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/06/26/xmpp-google\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a1e0dad42069cbfd6442ff308e8eaac0d570012acac144f7847f660bf6bf1a0b","category":"Tech"}