{"title":"Repurposing of Synthetic Acetaminophen Derivatives Containing Benzothiazole Scaffold as Alternative Therapy for Infectious Diarrhea Caused by Drug-Resistant Shigella Species","link":"https://www.preprints.org/manuscript/202405.0491/v1","date":1715160804000,"content":"Diarrhea remains one of the leading causes of mortality worldwide, especially among children. Recent epidemiological studies conducted in developing countries identified Shigella species as the most predominant pathogenic bacteria responsible for diarrhea. Antimicrobial therapy is necessary for Shigella infections; however, the rapid emergence of resistance against existing antimicrobials in Shigella spp. poses a serious global health problem. To identify alternative antimicrobial compounds with activity against Shigella species, the pathogens responsible for bacterial diarrhea. In this study, we have applied antibacterial phenotypic screening to identify potent anti-Shigella compounds across a broad chemical diversity, including selected acetaminophen derivatives containing benzothiazoles backbone, and their combination with certain antibiotics. In continuation to our effort in searching potent antimicrobial compounds, we have found this time around that two acetaminophen derivatives containing benzothiazoles backbone (4a and 4b) could inhibit the growth of Shigella flexneri with common MIC value of 12.5 µg/ml. These compounds were established through a time-kill kinetics’ study to be bactericidal. Meanwhile, the 2-aminobenzothiazoles (1a and 1b) used for the synthesis of compounds 4 (a &amp; b) were found to be poorly active (MIC: 100 µg/ml) against this pathogen. Combination studies of 4a and 4b with the least susceptible antibiotics (ceftriaxone and cotrimoxazole) demonstrated synergistic anti-Shigella activity. The present study demonstrates that the azobenzothiazole dyes 4 (a &amp; b) can be repurposed as potential anti-Shigella compounds, which can serve as scaffolds for the development of new agents against infectious diarrhea caused by Shigella and other enteric pathogens, especially in developing countries.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a1e6354306d77301bc963e268fdae3ee0ed4787ebaf5d9ef550f81db6cc7893f","category":"Interdisciplinary"}