{"title":"An Innovative Method to Deal with the Spread of Aedes albopictus in the Urban Centers of Alessandria Used by Citizen","link":"https://www.preprints.org/manuscript/202407.0323/v1","date":1719985932000,"content":"Introduction: Known for its persistent blood-feeding behavior from dawn to dusk, Aedes albopictus is recognized as one of the most dangerous mosquito species due to its role as a vector for diseases such as dengue. Studies have demonstrated that Aedes albopictus thrives in micro-breeding sites predominantly located on private properties, including abandoned containers and manholes used for rainwater and irrigation. This study investigates an innovative methodology, the TombiniNet, to mitigate the proliferation of Aedes albopictus by engaging citizens in the active management of micro-breeding sites on their properties. Materials and Methods: The study was conducted in Alessandria, a city with approximately 100,000 inhabitants, focusing on a sample of 200 houses and a population of about 5,000 people. Researchers conducted a comprehensive survey and analysis of micro-breeding sites for Aedes albopictus on both private and communal properties. The larval control measures were conducted from April to October, aligning with the peak mosquito breeding season. The study's sample included 51% of houses that allowed researchers access, and within these, 81% had Aedes albopictus larvae, often found in diverse water Containers holes of which basically manholes on villa garden floors. For monitoring the adult populations were used ovitraps that were not placed in private homes but in public areas to monitor and control the mosquito population. Results: The study identified that up to 70% of micro-breeding sites for Aedes albopictus in northern Alessandria were located on private properties. Citizen participation was critical to the success of the intervention, with a marked decrease in the number of adult tiger mosquitoes observed in areas where residents actively managed breeding sites using the TombiniNet. The TombiniNet was particularly effective in private areas, as it could be regularly maintained by residents, preventing debris accumulation that could hinder drainage. Discussion: The findings highlight the importance of engaging citizens in mosquito control programs to effectively manage Aedes albopictus populations in urban areas. The TombiniNet intervention demonstrated that a simple, cost-effective solution could significantly reduce mosquito breeding sites on private properties. By addressing both communal and private breeding sites, a comprehensive and sustainable approach to mosquito management can be achieved, thereby reducing the risk of disease transmission. Future studies should focus on long-term monitoring and the development of additional innovative solutions to enhance citizen participation and control measures. The study's success also pointed out the limitations of applying such interventions in public areas where debris could impede the net's effectiveness.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a1f963b834ef310cc399aa0ac34ed2dbf30200e7759b7219bebb894602ec4c5c","category":"Interdisciplinary"}