{"title":"429 Maternal rate of gain and one-carbon metabolites supplementation alters the gene expression profile of fetal brain during early gestation in beef heifers","link":"https://academic.oup.com/jas/article/102/Supplement_3/204/7757320?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Maternal nutritional plane during pregnancy may leave lifelong impacts on offspring in beef cattle. Given that, we hypothesized that the supplementation of one-carbon metabolites (OCM) during pregnancy would mitigate the negative effects of maternal rate of gain through brain gene expression regulation in early developing bovine fetuses. The objective of this study was to evaluate the effects of OCM supplementation and maternal rate of gain on gene expression in the developing fetal brain in gestating beef heifers. Herein, Angus crossbred heifers (n = 72, body weight = 406 ± 33 kg) were randomly assigned to 2 × 2 factorial arrangement of treatments with two levels of maternal rate of gain (CON, 0.60 kg/d; and RES, -0.23 kg/d) each with or without OCM supplementation (+OCM, and -OCM). Heifers were fed individually and were bred using female-sexed semen from a single sire. The OCM supplementation included rumen-protected choline (44.4 g/d) and methionine (7.4 g/d) in corn carrier fed daily and weekly injections of folate (320 mg) and vitamin B12 (20 mg). The -OCM heifers received the corn carrier and saline injections. The treatments started at the time of breeding and continued until d 63 of gestation when pregnant heifers (n = 29) were slaughtered to collect fetal brain tissues for RNA sequencing. The fetal brain phenotypic data were analyzed using MIXED procedures of SAS, indicating that restricted nutrition affected the fetal right hemisphere weight (<span>P</span> &lt; 0.05), and there was a strong tendency for overall fetal brain weight (0.05 &lt; <span>P</span> &lt; 0.1) to be affected as well. Brain transcriptomics data were analyzed using STAR aligner and a total of 177 differentially expressed genes (DEGs, FDR &lt; 0.05) were identified across all treatment comparisons using DESeq2. Most of the DEGs were either isoforms of spliceosomal non-coding RNAs or micro-RNAs (miRNAs) associated with biological processes (FDR &lt; 0.1) like mRNA processing, cellular nitrogen metabolism, lipid metabolism, and post-transcriptional gene silencing. The key miRNAs upregulated in the brain tissue of restricted fetuses without OCM supplementation, bta-mir-2375, bta-mir-876, and bta-mir-196a-1, were found to be associated with early embryogenesis and essential cellular regulatory processes. Conversely, in restricted fetuses with OCM supplementation, upregulated miRNAs such as bta-mir-216b, bta-mir-2285dd, and bta-mir-1298 were linked to early embryonic development, muscular development, and lipid metabolism in cattle. Both phenotypic and transcriptomics data here revealed that the maternal rate of gain altered fetal brain development, with differences seemingly compensated by OCM supplementation. USDA is an equal opportunity provider and employer.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a1f93929ca5d064d892bce2aca3b0642bd79e3df9e354d85b90e55669f68e2a7","category":"Environment"}