{"title":"In the Drops: Heating period shorts, POC glasses, Tether smart bike light and Always Sunny","link":"https://www.cyclist.co.uk/news/10246/she-thinx-cycling-shorts","date":1636562983000,"content":"<span>\n      <span><a href=\"/authors/robyn-davidson\">Robyn Davidson</a></span>\n  </span><div>  \n  <div>      <div><span>12 Nov 2021</span></div>    </div></div><p>\nThis week’s new gear round-up and a chance to declare my love for Charlie Kelly.</p>\n<div>\n      <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/article_main_image/public/2021/11/tether_1.jpeg?itok=d6LlLXow\" />  </div>\n<div>\n      <p> I like to start my Friday off with some Megan Thee Stallion and coffee. You can begin the day with a fresh round up of new gear courtesy of our latest instalment of In the Drops. Lucky!</p>\n<p>Hi, I’m editorial assistant <em>Troy Mcclu-</em> Robyn Davidson. You might remember me from tweets about dogs at cycling races or being up at 3am watching baseball or basketball.</p>\n<p>This week at <em>Cyclist</em> we reviewed the <a href=\"https://www.cyclist.co.uk/reviews/10229/pactimo-womens-summit-classic-bib-shorts-review\" target=\"_blank\">Pactimo Women's Summit Classic</a> bib shorts courtesy of the wonderful Emma Cole, and wondered how good our balancing could be with the announcement of <a href=\"https://www.cyclist.co.uk/news/10232/muoverti-tiltbike\" target=\"_blank\">Muoverti's TiltBike</a>.</p>\n<p>James Spender was let loose with the <a href=\"https://www.cyclist.co.uk/reviews/10080/pinarello-dogma-f-disc-review\" target=\"_blank\">Pinarello Dogma F Disc</a>, as Sergio Higuita was let loose from (and then reeled back into) his contract at EF-Education First.</p>\n<p>So without further ado, let's get into it.</p>\n<h2>She Thinx Cycle Shorts</h2>\n<p>When researching products relating to menstruation, I found She Thinx had launched a different kind of cycle shorts. As part of the brand's new activewear line, it also produces absorbent sleep shorts, training shorts, leggings and a leotard.</p>\n<p>The cycle shorts are a light absorbency - approximately one regular pad’s worth, so not for heavier days - with side pockets. But what I love the most is the heating pad pocket at the front.</p>\n<p>\n</p><div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/97907102-7c6b-4abe-ac26-6059f81a79c2.jpeg?itok=zUU7B6PB\" />  </div>\n</div>\n<p></p>\n<p><span> </span></p>\n<p>You need to buy the pad yourself and the space to slot it in is compact, but it can provide some form of relief from cramps and other period symptoms.</p>\n<p>The shorts come in grey or black, and sizes from XS to 4X. If you experience bloating, it’s probably best to size up.</p>\n<p>She Thinx shorts don't have the kind of padding inside that you'd find in a standard pair of <a href=\"https://www.cyclist.co.uk/buying-guides/7957/best-womens-bibshorts-buyers-guide\" target=\"_blank\">women's bib shorts</a>, so they're likely be be best suited to more leisurely and less intense rides, or even wearing underneath padded shorts.</p>\n<p>They're made with breathable mesh lining and can be washed on cold in the washing machine. Period and environmentally friendly, what's not to like?</p>\n<ul>\n<li><strong>£57.45 (currently £28.73) / $75 (currently $37.50)</strong></li>\n<li><strong><a href=\"https://www.shethinx.com/collections/thinx-apparel/products/thinx-cycle-shorts?variant=36505069125704\" target=\"_blank\">Buy now from She Thinx</a></strong></li>\n</ul>\n<h2>POC Elicit Clarity sunglasses</h2>\n<p>People say cyclists have no upper body strength, but they also failed to consider that I just have no body strength.</p>\n<p>Fortunately for me, POC launched their <a href=\"https://www.cyclist.co.uk/news/10233/poc-elicit-clarity-sunglasses\" target=\"_blank\">lightest ever sunglasses</a>. At just 23g, it weighs the same as about five sugar packets from my kitchen cupboard.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/poc_elicit_clarity_3_0.jpg?itok=b0GVgMh8\" />  </div>\n</div>\n<p>Aerodynamics and 'marginal gains' have been done to death in recent years, but the Elicit Clarity's lightweight polyamide Grilamid has flex fatigue strength and impact resistance that doesn't swap lens size for weight savings.</p>\n<p>They're designed with detachable arms to avoid major damage in the event of a crash, something that's good to keep in mind if you're the one that keeps hitting the ground on those group rides.</p>\n<p>I might not need them around Manchester until next year, but I know Mitch Docker had a heavy part to play in their testing. I tend to trust anything when it comes from someone with a moustache as glorious as that.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/poc_elicit_clarity_4.jpg?itok=jA-oww4C\" />  </div>\n</div>\n<p>POC's Elicit Clarity sunglasses are available in Spring 2022, with frame colours ranging from white to orange and pink. Lens colours will be available in the likes of gold, silver, and clear.</p>\n<ul>\n<li><strong>£205 / €240 / $275</strong></li>\n<li><strong><a href=\"https://www.pocsports.com/pages/elicit-release\" target=\"_blank\">Find out more at POC</a></strong></li>\n</ul>\n<h2>Tether bike light<a href=\"https://www.pocsports.com/pages/elicit-release\" target=\"_blank\"></a></h2>\n<p>Tether is a device that attaches onto any type of handlebars and projects a safe zone around your bike. It then shares close passes in real-time via a companion app to other riders.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/tether_0.jpeg?itok=i_TlH5aP\" />  </div>\n</div>\n<p>The app is in beta and only available on iPhone at the moment, so the one pictured is one of 12 prototypes being used by early adopters.</p>\n<p>With this device, Tether is on a mission to create safer roads, encouraging drivers to give you enough space while overtaking and signals to everyone when they are too close.</p>\n<p>Embedded sensors on the front, left and right of the device continuously monitor and detect other road users. Locations of overtakes are recorded along with the overtake distance to identify safe and unsafe city zones for safer routing.</p>\n<div>\n<div>\n    <img src=\"https://cyclist.b-cdn.net/sites/cyclist/files/styles/insert_main_wide_image/public/2021/11/tetherlights.png?itok=QMZv6yhG\" />  </div>\n</div>\n<p>Tether, the startup based in Peckham, is the creation of Omar Bakhshi. He was inspired to create the device after being knocked off his bike by an overtaking car and wants to reduce these types of accidents for others.</p>\n<p>I believe in anything that contributes to making the roads a safer place, so will definitely be trying this as the season changes into winter. It's already winter? I'm in denial.</p>\n<p>The beta edition of Tether is available for <a href=\"https://www.kickstarter.com/projects/91367227/tether-projecting-safe-zones-around-bikes\" target=\"_blank\">pre-order on Kickstarter</a>, with the campaign running until 27 November 2021. </p>\n<p>The consumer version should be available by February 2022.</p>\n<ul>\n<li><strong>Pricing begins at £130, RRP of £200 when it hits the shelves</strong></li>\n</ul>\n<h2><strong>What we're into this week: binge watching <em>It's Always Sunny</em> </strong></h2>\n<p>Finally. I've been waiting for a chance to pour my heart and soul into this. </p>\n<p>If anyone asks me if I'm okay, my answer is that I have binge watched 13 – <em>yes, 13</em> – seasons of <em>It's Always Sunny in Philadelphia</em> in a matter of a couple weeks, so make of that what you will. </p>\n<p>I was bored one night, waiting for the next Netflix season (other streaming services are available) to work my way through after Squid Games and found the exact sitcom I had been missing. Think Parks and Rec style, but with less parks and more Danny DeVito. So not Parks and Rec style at all.</p>\n<p>It's cynical, nihilistic and episodes are only 20 minutes long. Perfect for me and my attention span.</p>\n<p>The show centres around some of the most obnoxious characters you've ever seen repeatedly undertaking ridiculous schemes and making mistakes. </p>\n<p>While Rob McElhenney, Glenn Howerton and Danny DeVito do a great job of playing Mac, Dennis and Frank respectively, a special shoutout must be made to Charlie Day. Charlie, who also plays Charlie, has simply set my standards too high.</p>\n<p>I want to add that I almost threw the remote at the TV in excitement when Kaitlin Olson appeared on the screen as Deandra – an actress who also features in my favourite film <em>The Heat</em>. But that's for another day. Maybe my next instalment of <em>In the Drops.</em></p>\n<p>Season 15 arrives in the United States in December; a Netflix date is yet to be revealed.</p>\n<p>In the meantime, I'm off to see if The Gang needs a sixth member. </p>\n  </div>\n<div>  \n  <div>      <div><a href=\"/general-news\">General news</a></div>    </div></div>","author":"rdavidson","siteTitle":"Cyclist.co.uk","siteHash":"561486e7070fa5351de9318ad0fa26c2a39332acba5fc7c7d1694a01d53d431e","entryHash":"a20f442a74c1d1f25f690ede7718e4feed090944e1ca3ebdec2d5ee502f38576","category":"Cycling"}