{"title":"The end of a dream: Kitsbow to close its doors for good","link":"https://www.cyclingtips.com/2023/03/kitsbow-closing/","date":1679500420000,"content":"<figure><img src=\"https://www.cyclingtips.com/wp-content/uploads/2023/03/Kitsbow-collection.jpeg?width=1200\" alt=\"The end of a dream: Kitsbow to close its doors for good\" /></figure><p><span>Pour one out for Kitsbow. The employee-owned American apparel manufacturer will cease operations in April 2023 after an 11-year run.</span></p>\n<p><span>Kitsbow developed a cult following over its 11 years of manufacturing cycling-adjacent apparel. Their process was a bit different than most manufacturers, <a href=\"https://www.cyclingtips.com/2022/02/nerd-alert-podcast-maybe-slower-is-better-when-it-comes-to-cycling-clothing/\">as they made their apparel in the U.S. rather than overseas</a>. </span></p>\n<p><span>“</span><span>We like to think we were showing that there was a different way: made local, respecting artisan skills, paying a Living Wage with benefits, and working together as a community,” Kitsbow wrote in an <a href=\"https://www.instagram.com/p/CqEDBg_SxEl/\" target=\"_blank\">Instagram post</a>.</span></p>\n<blockquote>\n<div>\n<p> </p>\n<div>\n<div></div>\n<div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div></div>\n<div></div>\n<div>\n<div>View this post on Instagram</div>\n</div>\n<div></div>\n<div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<div>\n<div></div>\n<div></div>\n<div></div>\n</div>\n</div>\n<div>\n<div></div>\n<div></div>\n</div>\n<p> </p>\n<p><a href=\"https://www.instagram.com/p/CqEDBg_SxEl/?utm_source=ig_embed&amp;utm_campaign=loading\" target=\"_blank\">A post shared by Kitsbow Cycling Apparel (@kitsbow)</a></p>\n</div>\n</blockquote>\n<p><br />\n<span>As noted by Kitsbow in </span><a href=\"https://www.kitsbow.com/blogs/news/goodbye\"><span>a recent blog post</span></a><span>, Kitsbow was only able to raise about 50 percent of their $1m funding target from their latest Community Round of Financing. </span></p>\n<blockquote><p>“But most of all, it is the end of a dream for our employees, 30,000 customers, and thousands of supporters for our vision of making clothes in a new way that respects the worker and pays a living wage (with benefits). Our apparel industry is deeply broken, and like to think we were showing that there was a different way: made local, respecting artisan skills, paying a Living Wage, and working together as a community,” wrote David Bilstrom, CEO of Kitsbow.</p></blockquote>\n<p><span>While there are several cycling apparel companies that have folded over the last few months, Kitsbow’s U.S. construction set them apart. Their apparel was loved by cyclists of all backgrounds, from mountain bikers to commuters and everything in between. Kitsbow was also one of the first to offer PPE at the start of the COVID pandemic. </span></p>\n<p><span>Kitsbow closing down means you won’t be able to use their in-house garment repair, but all of their </span><a href=\"https://www.kitsbow.com/\"><span>7,000+ items of apparel are on sale now</span></a><span>. </span></p>\n<p><span>“And in the years ahead, please give a nod or a wave when you see someone wearing Kitsbow in the wild. Durable Kitsbow gear will last for years to come, and every use of each garment is a reminder that this journey mattered, to you and to us,” wrote Bilstrom.</span></p>","author":"Alvin Holbrook","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a2171833d2b7d8794d26b96d3eabcf6f34407a723e9f4f5a87e7a24aa5728a9d","category":"Cycling"}