{"title":"Overall Survival and Prognostic Factors in Metastatic Triple-Negative Breast Cancer: an NCDB Analysis","link":"https://www.preprints.org/manuscript/202404.1138/v1","date":1713348086000,"content":"Background: Metastatic triple-negative breast cancer (TNBC) is aggressive with a poor median overall survival (OS), ranging from 8 to 13 months. There exists considerable heterogeneity in the survival at the individual patient level. To better understand the survival heterogeneity and improve risk stratification, our study aims to identify the factors influencing survival utilizing a large patient sample in the National Cancer Database (NCDB). \n\nMethods: Women diagnosed with metastatic TNBC from 2010 to 2020 in the NCDB were included. Demographic, clinic-pathological, treatment data, and overall survival (OS) outcomes were collected. Kaplan-Meier curves were used to estimate OS. The log-rank test was used to identify OS differences between groups for each variable in the univariate analysis. For the multivariate analysis, the Cox proportional hazard model with backward elimination was used to identify factors affecting OS. Adjusted hazard ratios and 95% confidence intervals are presented. \n\nResults: 2,273 women had a median overall survival of 13.6 months. Factors associated with statistically significantly worse OS included older age, higher comorbidity scores, specific histologies, higher number of metastatic sites, presence of liver or other site metastases in those with only one metastatic site (excluding brain metastases), presence of cranial and extra-cranial metastases, lack of chemotherapy, lack of immunotherapy, lack of surgery to distant sites, lack of radiation to distant sites, and receipt of palliative treatment to alleviate symptoms. In the multivariate analysis, comorbidity score, histology, number of metastatic sites, immunotherapy, and chemotherapy had a statistically significant effect on the OS.\n\nConclusions: Through NCDB analysis, we have identified prognostic factors for metastatic TNBC. These findings will help improve prognostication at diagnosis, optimize treatment strategies, and facilitate patient stratification in future clinical trials.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a22023f8846c46bbf23b501bc618c9897d8dc12be40a7991861f14dfbe121473","category":"Interdisciplinary"}