{"title":"Why should we study plant sex chromosomes?","link":"https://academic.oup.com/plcell/article/36/5/1242/7499156?rss=1","date":1704153600000,"content":"<span><div>Abstract</div>Understanding plant sex chromosomes involves studying interactions between developmental and physiological genetics, genome evolution, and evolutionary ecology. We focus on areas of overlap between these. Ideas about how species with separate sexes (dioecious species, in plant terminology) can evolve are even more relevant to plants than to most animal taxa because dioecy has evolved many times from ancestral functionally hermaphroditic populations, often recently. One aim of studying plant sex chromosomes is to discover how separate males and females evolved from ancestors with no such genetic sex-determining polymorphism, and the diversity in the genetic control of maleness vs femaleness. Different systems share some interesting features, and their differences help to understand why completely sex-linked regions may evolve. In some dioecious plants, the sex-determining genome regions are physically small. In others, regions without crossing over have evolved sometimes extensive regions with properties very similar to those of the familiar animal sex chromosomes. The differences also affect the evolutionary changes possible when the environment (or pollination environment, for angiosperms) changes, as dioecy is an ecologically risky strategy for sessile organisms. Dioecious plants have repeatedly reverted to cosexuality, and hermaphroditic strains of fruit crops such as papaya and grapes are desired by plant breeders. Sex-linked regions are predicted to become enriched in genes with sex differences in expression, especially when higher expression benefits one sex function but harms the other. Such trade-offs may be important for understanding other plant developmental and physiological processes and have direct applications in plant breeding.</span>","author":"","siteTitle":"The Plant Cell Current Issue","siteHash":"79e412e6ce1f089d84dc121a8f42d56bd85cc8a0cd2445169b4ab961f78a7517","entryHash":"a222e129524a457e1019df71bd10d26462c60e41c9192fdcd8fe0aa1ae332aa0","category":"Environment"}