{"title":"Sexual satisfaction of postmenopausal women: An integrative review","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0306207","date":1722348000000,"content":"<p>by Nasim Shahrahmani, Raheleh Babazadeh, Abbas Ebadi</p>\r\n\r\nA prerequisite for interventions for sexual satisfaction in postmenopausal women is a clear, objective measurement of the concept. Despite the large number of studies on the sexual satisfaction of postmenopausal women, there is no clear definition of sexual satisfaction in menopause. This study was conducted to investigate the concept of sexual satisfaction in postmenopausal women. The present study was carried out using an integrated review of data obtained from secondary sources, utilizing Whittemore and Knafl’s method of bibliographic search. A literature search was performed without any data limitations in journals and international databases. The primary inclusion criterion was relevance to sexual satisfaction in postmenopausal women. The full texts of all these articles were evaluated using the checklists of the MMAT and PRISMA. Data were analyzed using MAXQDA 10 software using a constant comparison method. Meaning units were identified and coded. The codes were classified into subgroups and categories according to the characteristics, antecedents, and consequences of sexual satisfaction in postmenopausal women. During the integrative review of the 62 articles and three books, 580 codes about sexual satisfaction in menopause were extracted. The codes were grouped into three main attributes, five main antecedents, and three main consequences of sexual satisfaction in postmenopausal women. Four attributes, symptoms, or components were identified for the concept. These attributes were as follows: Change in sexual objective and subjective dimensions of sexual satisfaction after menopause, conditional sexual consent, change in behavior, and sexual function. These dimensions distinguish sexual satisfaction in menopause from other conditions. The concept of sexual satisfaction in menopause is a subjective (emotional interaction) and objective (physical interaction) experience that is conditioned by the fulfillment of expectations and the reconstruction of sexual relations while also being influenced by the change in sexual capacity during menopause.","author":"Nasim Shahrahmani","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a22356b03881dcd708d27c70623178c809fadf1e53306582faf244c5d3ccf100","category":"Interdisciplinary"}