{"title":"Divergent structural leaf trait spectra in succulent versus non-succulent plant taxa","link":"https://academic.oup.com/aob/article/134/3/491/7687686?rss=1","date":1717459200000,"content":"<span><div>Abstract</div><div>Background and Scope</div>Plant functional traits are the result of natural selection to optimize carbon gain, leading to a broad spectrum of traits across environmental gradients. Among plant traits, leaf water storage capacity is paramount for plant drought resistance. We explored whether leaf-succulent taxa follow trait correlations similar to those of non-leaf-succulent taxa to evaluate whether both are similarly constrained by relationships between leaf water storage and climate.<div>Methods</div>We tested the relationships among three leaf traits related to water storage capacity and resource use strategies in 132 species comprising three primary leaf types: succulent, sclerophyllous, and leaves with rapid returns on water investment, referred to as fast return. Correlation coefficients among specific leaf area (SLA), water mass per unit of area (WMA), and saturated water content (SWC) were tested, along with relationships between leaf trait spectra and aridity determined from species occurrence records.<div>Results</div>Both SWC and WMA at a given SLA were ~10-fold higher in succulent leaves than in non-succulent leaves. While SWC actually increased with SLA in non-succulent leaves, no relationship was detected between SWC and SLA in succulent leaves, although WMA decreased with SLA in all leaf types. A principal component analysis (PCA) revealed that succulent taxa occupied a widely different mean trait space than either fast-return (<span>P</span> &lt; 0.0001) or sclerophyllous (<span>P</span> &lt; 0.0001) taxa along the first PCA axis, which explained 63 % of mean trait expression among species. However, aridity only explained 12 % of the variation in PCA1 values. This study is among the first to establish a structural leaf trait spectrum in succulent leaf taxa and quantify contrasts in leaf water storage among leaf types relative to specific leaf area.<div>Conclusions</div>Trait coordination in succulent leaf taxa may not follow patterns similar to those of widely studied non-succulent taxa.</span>","author":"","siteTitle":"Annals of Botany Current Issue","siteHash":"4dcd6862a4440fa3d0035d60c859bc6843aabf7c9786ca821198500245ae243e","entryHash":"a22a696b11682b879496b9df9957bb0aa80a0846767bd66c30838721a468774b","category":"Environment"}