{"title":"Rocket Report: Starbase will expand into state park; another Japanese rocket","link":"https://arstechnica.com/?p=2008850","date":1709899209000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/maxarstarbase-800x542.jpeg\" alt=\"This satellite view of SpaceX's Starbase facility shows a fully-stacked Starship rocket on the launch pad, just inland from the Gulf of Mexico.\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/03/maxarstarbase.jpeg\">Enlarge</a> <span>/</span> This satellite view of SpaceX's Starbase facility shows a fully-stacked Starship rocket on the launch pad, just inland from the Gulf of Mexico. (credit: <a href=\"https://x.com/Maxar/status/1493270944126808069?s=20\">Maxar</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Welcome to Edition 6.34 of the Rocket Report! It's Starship season again. Yes, SpaceX appears to be about a week away from launching the third full-scale Starship test flight from the company's Starbase site in South Texas, pending final regulatory approval from the Federal Aviation Administration. Ars will be there. SpaceX plans to build a second Starship launch pad at Starbase, and the company's footprint there is also about to get a little bigger, with the expected acquisition of 43 acres of Texas state park land.</p>\n<p>As always, we <a href=\"https://arstechnica.wufoo.com/forms/launch-stories/\">welcome reader submissions</a>, and if you don't want to miss an issue, please subscribe using the box below (the form will not appear on AMP-enabled versions of the site). Each report will include information on small-, medium-, and heavy-lift rockets, as well as a quick look ahead at the next three launches on the calendar.</p>\n<div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/05/smalll.png\" /></div>\n<p><b>Astra's founders take the company private. </b>Astra's three-year run as a public company is over. Chris Kemp and Adam London, Astra's co-founders, are taking the company private after a string of rocket failures and funding shortfalls, <a href=\"https://arstechnica.com/space/2024/03/after-astra-loses-99-percent-of-its-value-founders-take-rocket-firm-private/\">Ars reports</a>. Kemp and London bought the company for 50 cents a share. Astra's board approved the transaction, the company announced Thursday, as the only alternative to bankruptcy. Kemp and London founded Astra in 2016. After emerging from stealth mode in 2020, Astra launched its light-class launcher, called Rocket 3, seven times, but five of those flights were failures. Astra went public via a special purpose acquisition company (or SPAC) in 2021, reaching a valuation of more than $2 billion. Today, its market cap sits at approximately $13 million.</p></div><p><a href=\"https://arstechnica.com/?p=2008850#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2008850&amp;comments=1\">Comments</a></p>","author":"Stephen Clark","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a22c36d71fa71242c40e546b0bba6b0064a1880415f412eea77d1c0b767175d7","category":"Tech"}