{"title":"US cracks down on “Fulfilled by Amazon,” citing sale of 400,000+ hazardous items","link":"https://arstechnica.com/?p=1780635","date":1626375360000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/amazon-matches-fire-800x450.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/07/amazon-matches-fire.jpg\">Enlarge</a> (credit: <a href=\"https://arstechnica.com/author/aurich-lawson/\">Aurich Lawson | Getty Images</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>The US Consumer Product Safety Commission (CPSC) yesterday filed a complaint against Amazon over the sale of hundreds of thousands of hazardous products, including carbon monoxide detectors that fail to detect carbon monoxide, hair dryers without required protection from shock and electrocution, and flammable sleepwear meant for children. The CPSC said it sued Amazon to \"force [the] recall\" of the dangerous products. While Amazon has halted sales of most of them already and issued refunds, the CPSC said it isn't satisfied with how Amazon notified customers and said the industry giant must do more to ensure that the faulty products are destroyed.</p>\n<p>The dangerous products were offered by third parties using the \"Fulfilled by Amazon\" (FBA) program, in which Amazon stores products in its warehouses, ships them to customers, and takes a sizable cut from the proceeds. The CPSC's <a href=\"https://www.cpsc.gov/s3fs-public/pdfs/recall/lawsuits/abc/001-In-re-Amazon-com-Inc__.pdf?TvLLxHy1UMfiz3BpfXaKjQy1ibQbYAiU\">administrative complaint</a> alleges that Amazon hasn't taken enough responsibility for dangerous third-party products that it ships via FBA.</p>\n<p>The complaint didn't mention any specific incidents of injury but said the evidence supporting the charges includes \"lawsuits concerning incidents or injuries involving various consumer products identified in the Complaint.\" It also said that CPSC staff tested the products and found that they don't meet safety requirements. Products that don't meet these requirements pose a substantial risk of injury or death to consumers, the agency said.</p></div><p><a href=\"https://arstechnica.com/?p=1780635#p3\">Read 24 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1780635&amp;comments=1\">Comments</a></p>","author":"Jon Brodkin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a234c419f4fbcd1e57b90f01910b3c2a723065df27683842f3d7bf62e7b925b8","category":"Tech"}