{"title":"NFT of Colnago C64 sells for $2,300 more than actual Colnago C64","link":"https://cyclingtips.com/2021/05/nft-of-colnago-c64-sells-for-2300-more-than-actual-colnago-c64/","date":1622094587000,"content":"<p>Hey, remember when Colnago announced it was <a href=\"https://cyclingtips.com/2021/05/colnagos-latest-release-is-ultra-lightweight-limited-to-one/\">auctioning off a unique non-fungible token</a> of one of its bikes?</p>\n\n\n\n<p>Well, happy days: it’s #NewBikeDay for one lucky individual. User MTD-01 has plonked down 3.2 wETH tokens for an NFT of a Colnago C64. </p>\n\n\n\n<p>Oof, this is confusing. Let’s break that disaster of a sentence down …  </p>\n\n\n\n<p>An <strong>NFT</strong> – non-fungible token – is a unique digital asset that cannot be replicated. It is stored on a digital ledger called a blockchain which records who possesses the NFT – in this case, ownership of a rendering of a Colnago C64 in a melange of colours. A rendering that anybody is free to access and download (<a href=\"https://www.colnago.com/wp-content/uploads/2021/05/0001-0450.mp4\" target=\"_blank\">here</a> it is – you’re sitting on a goldmine!)</p>\n\n\n\n<p><strong>MTD-01</strong>, whoever that is and wherever they live, emerged triumphant from a <a href=\"https://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/883895239910526120454725785775488271928209486882969309829251624026308083713\">two-way bidding war</a> and is now the owner of the <em>rights </em>to the image of this particular Colnago C64 (but crucially, not the image itself). </p>\n\n\n\n<p>A <strong>wETH token</strong> is a cryptocurrency, and MTD-01 has paid 3.2 of them to be able to say they own the digital rendering of an imaginary bike. </p>\n\n\n\n<p>According to cryptocurrency conversion rates at the time of the transaction, that equated to US$8,592 – or, about US$2,300 more than an actual Colnago C64 frameset that exists in the real world, which you can touch and look at and maybe even, heaven forbid, go for a ride on. </p>\n\n\n\n<p>Good stuff. Normal transaction. Everything’s fine and humanity is definitely going in the right direction. Coolcoolcool.</p>\n<p>The post <a href=\"https://cyclingtips.com/2021/05/nft-of-colnago-c64-sells-for-2300-more-than-actual-colnago-c64/\">NFT of Colnago C64 sells for $2,300 more than actual Colnago C64</a> appeared first on <a href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Iain Treloar","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a23cd28bcc739aa78b1aba0a2e33e5a3a0a4ee4bb7b395cbe8ecd5556d36d87b","category":"Cycling"}