{"title":"Salinity/ionic balance interactions on the zootechnical performance and histology of Litopenaeus vannamei and water quality in a biofloc system","link":"https://onlinelibrary.wiley.com/doi/10.1111/jwas.13093?af=R","date":1723610337000,"content":"<h2>Abstract</h2>\n<p>This study aimed to evaluate the interactions between two low salinities (S = 4 and 8 g L<sup>−1</sup>) and two ionic balances (Na<sup>+</sup>/Mg<sup>+2</sup>/Ca<sup>+2</sup>/K<sup>+</sup> ratio, IB1 = 27.6/3.6/1.05/1 and IB2 = 40.6/4.7/1.98/1) on zootechnical performance and histology of <i>Litopenaeus vannamei</i> postlarvae (0.0073 ± 0.0007 g) and juveniles (0.2163 ± 0.0080 g) reared in a biofloc system at stocking density of 1500 and 300 individuals m<sup>−3</sup>, respectively, over two culture phases: nursery (30 days) and grow-out (60 days). High nitrification processes were detected at lower salinity treatments, with the lowest ammonia and nitrite concentration in those. There were no significant differences on shrimp survival between treatments; however, the best final weights were observed in the S8IB2 (0.24 ± 0.01 g) and S4IB1 (2.80 ± 0.12 g) treatments for the nursery and grow-out stages, respectively. The most frequent histological lesions were the absence of lipid vacuoles in the hepatopancreas and abundant organic debris in the gill lamellae. The viability of rearing <i>L. vannamei</i> juveniles in biofloc at low salinity is still relatively weak because of their low growth and low efficiency to store fatty acids in the hepatopancreas; however, higher postlarvae productivity was found at 8 g L<sup>−1</sup> and Na<sup>+</sup>/Mg<sup>+2</sup>/Ca<sup>+2</sup>/K<sup>+</sup> ratio of 40.6/4.7/1.98/1 in the nursery stage.</p>","author":"Mitsuaki Ueno Fukura, \nLuis Felipe Collazos Lasso, \nLuis Alejandro Vinatea Arana, \nBernardo Baldisserotto","siteTitle":"Wiley: Journal of the World Aquaculture Society: Table of Contents","siteHash":"37af84d1672a7a0aed631ea0e96fc35b51a97e6d1b0636559e85b358a16c98a6","entryHash":"a2404c3862661af51c0b13276179ebecb0e7f809fceb3eea9cc7e2f937720e74","category":"Environment"}