{"title":"World’s largest predatory shark had elevated body temperature","link":"https://arstechnica.com/?p=1950118","date":1687815878000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2023/06/image-6.jpeg\" alt=\"Artist's image of a shark swelling a seal.\" />\n      <p>(credit: <a href=\"https://mailchi.mp/4a3e84809605/megalodon-had-a-hot-body?e=cdcce1dd0b\">Alex Boersma/PNAS</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>The largest shark alive today, reaching up to 20 meters long, is the whale shark, a sedate filter feeder. As recently as 4 million years ago, however, sharks of that scale likely included the fast-moving predator megalodon, famous for its <a href=\"https://en.wikipedia.org/wiki/Megalodon#/media/File:Megalodon_shark_jaws_museum_of_natural_history_068.jpg\">utterly enormous jaws</a> and correspondingly huge teeth.</p>\n<p>Because of incomplete fossil data, we're not entirely sure how large megalodon was and can only make inferences based on some of its living relatives, like the great white and mako sharks. But thanks to some new research on its fossilized teeth, we're now fairly confident that it shared something else with these relatives: it wasn't entirely cold-blooded and apparently kept its body temperature above that of the surrounding ocean.</p>\n<h2>Taking a temperature</h2>\n<p>Most sharks, like most fish, are ectothermic, meaning that their body temperatures match those of the surrounding water. But a handful of species, part of a group termed mackerel sharks, have a specialized pattern of blood circulation that helps retain some of the heat their muscles produce. This enables them to keep some body parts at a higher temperature than their surroundings. A species called the salmon shark can maintain a body temperature that's 20° C warmer than the sub-Arctic waters that it occupies.</p></div><p><a href=\"https://arstechnica.com/?p=1950118#p3\">Read 11 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1950118&amp;comments=1\">Comments</a></p>","author":"John Timmer","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a24b6693513505fcb6dfe7bc7377a44a5432bbb0c63240d3f17b1fd4aace34ad","category":"Tech"}