{"title":"Exploration of Candidate Korean Native Poaceae Plants for Breeding New Varieties as Garden Materials in the New Climate Regime","link":"https://www.preprints.org/manuscript/202410.0111/v1","date":1727863088000,"content":"There are increasing needs for models of public garden with low-maintenance, and environmental stress to plant due to climate change is growing. Therefore, the demand for developing new plant varieties based on native plants as garden materials against climate change has increased fairly. Many plants in the family Poaceae are applied for various purposes such as food crops, fodder grasses, ornamental plants, or medical plants. Also, native plants have some economic and ecological benefits, and the utilization of native plants is positive in a garden. However, there are some difficulties in Poaceae breeding researches and utilization of wild native plants for breeding. To overcome these problems, model plants can be utilized in breeding researches of Poaceae plant species. In this study, to explore the possibility of utilizing Korean native Poaceae plants as model plants and for breeding new cultivars, the candidate species were selected from the Korean Plant Names Index (KPNI). A total of 3 Korean native plants in the family Poaceae including Brachypodium sylvaticum, Setaria viridis, and Zoysia japonica were selected, and their properties and their genome information were compared with the representative model plants, Arabidopsis thaliana and Brachypodium distachyon. The modern research status of B. sylvaticum, S. viridis and Z. japonica has been summarized, and the genome size, life cycle, and other characteristics of these model plants have been compared and discussed. Application of these newly selected candidate plants in breeding research would build a foundation for breeding of native Poaceae plants in Korea against the new climate regime.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a24c85df835941d91b3280e029e89a080c3e50758197ac6638cb532df0cf68ca","category":"Interdisciplinary"}