{"title":"That time an Air Force sergeant spotted pulsars months before astronomers","link":"https://arstechnica.com/?p=1958018","date":1690903711000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/pulsar-banner-800x450.jpg\" alt=\"Pulsars are spinning neutron stars, the relics of massive stars gone supernova. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2018/09/pulsar-banner.jpg\">Enlarge</a> <span>/</span> Pulsars are spinning neutron stars, the relics of massive stars gone supernova.  (credit: NASA's Goddard Space Flight Center)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Here's a bit of science history that genuinely surprised many of us here at Ars Technica. We all know the <a href=\"https://arstechnica.com/science/2018/09/jocelyn-bell-burnell-wins-3-million-prize-for-discovering-pulsars/\">famous story</a> of how Jocelyn Bell-Burnell <a href=\"https://www.nature.com/articles/217709a0\">discovered</a> pulsars in 1967 as a graduate student at the University of Cambridge—and the longstanding debate about whether she should have shared the Nobel Prize awarded to her supervisor, Antony Hewish. But apparently, an Air Force staff sergeant manning an early warning radar station in Alaska arguably beat Bell-Burnell to the punch. He just couldn't come forward until 2007, after the instrument had been decommissioned. Nature <a href=\"https://www.nature.com/articles/448974a\">reported the story</a> at the time, but we most definitely missed it—and we probably weren't the only ones.</p>\n<p>Pulsars are rapidly spinning neutron stars that create pulsed emissions as their magnetic fields sweep across the line of sight with Earth. As <a href=\"https://arstechnica.com/science/2018/09/jocelyn-bell-burnell-wins-3-million-prize-for-discovering-pulsars/\">previously reported</a>, whenever a massive star runs out of fuel, it explodes into a supernova. If it's above a certain threshold in mass, it becomes a black hole. Below that threshold, it becomes an ultra-dense neutron star. Pulsars are unusual in that they spin rapidly and have very powerful magnetic fields, so they emit very high-energy beams of light. The star's rotation makes it seem like those beams are flashing on and off like a cosmic lighthouse.</p>\n<p>Bell-Burnell was monitoring the new radio telescope at the Mullard Radio Astronomy Observatory, sifting through reams and reams of paper records to hunt for any unusual anomalies in the peaks of data representing incoming galactic radio waves. Three weeks in, on August 6, she spotted a faint signal coming from a particular area of the sky that disappeared, then reappeared, in 1.34-second intervals. The team quickly ruled out any known natural sources or other kinds of interference. She and Hewish even joked that it might be a signal from an alien civilization, dubbing the object \"LGM-1\" for \"Little Green Men.\" </p></div><p><a href=\"https://arstechnica.com/?p=1958018#p3\">Read 4 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1958018&amp;comments=1\">Comments</a></p>","author":"Jennifer Ouellette","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a2505724451f215d9f2bbcd4f8de0165be8efe02fc5dec47faffa91f635f53aa","category":"Tech"}