{"title":"Journalists Detail Seeing Their Own Spatial Videos on Apple Vision Pro","link":"https://www.macrumors.com/2023/12/14/journalists-experience-spatial-videos-vision-pro/","date":1702584357000,"content":"With the <a href=\"https://www.macrumors.com/guide/ios-17-2-features/\">launch of iOS 17.2</a>, Apple added a camera feature that allows <a href=\"https://www.macrumors.com/roundup/iphone-15-pro/\">iPhone 15 Pro</a> and ‌iPhone 15 Pro‌ Max models to record 3D spatial video that will be viewable on the <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a> when it becomes available for purchase.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/09/spatial-video-apple-visioin-pro.jpg\" width=\"1600\" height=\"898\" />\r<br />\nTo demonstrate the feature, Apple this week invited several members of the media to record spatial video with their iPhones and then view it on an ‌Apple Vision Pro‌ headset. Those who were able to experience their videos in 3D have now written about the experience and what it's like using the Vision Pro for reliving memories.\r<br />\n\r<br />\n<em><a href=\"https://www.cnet.com/tech/computing/i-saw-my-iphone-spatial-movies-in-apple-vision-pro/\">CNET</a></em>'s Scott Stein found that videos of his family members were the most compelling, and a recording of his mother in particular seemed to make eye contact and made him feel like he was \"almost there.\" In video with a lot of motion, the 30 fps limit was noticeable, though less so in videos with less motion. HDR photos \"looked great,\" with Stein saying they appeared as good as or better than on a Mac or a TV, with HDR that \"popped\" and options to zoom in.\r<br />\n<blockquote>I also got a kick out of seeing some of my favorite exhibits at the Museum of Natural History in 3D. I went to the Hall of Ocean Life, where a trio of little tanks on the top floor house dioramas of prehistoric sea creatures that I've loved since I was a kid. I captured the ammonites and trilobites, gliding from case to case. In 3D on Vision Pro, it felt like a little home diorama revisited. I could see the joy of capturing little immersive installations, or spaces, that aren't easy to go back to, and having them in front of you again.</blockquote>\r<br />\n<a href=\"https://www.techradar.com/computing/virtual-reality-augmented-reality/seeing-your-own-spatial-video-on-vision-pro-is-an-immersive-trip-and-i-highly-recommend-it\"><em>TechRadar</em>'s Lance Ulanoff</a> said that he was \"startled by the quality and immersive nature\" of panoramic images that he had captured, and the wider view showed him details he had not seen before. A video of a model train looked like it would \"ride right into [his] lap.\" Compared to standard videos, Ulanoff said the videos \"felt more real\" and resulted in heightened emotions. He said the level of emotion that can be experienced from family videos in 3D \"can be quite intense.\"\r<br />\n\r<br />\n<a href=\"https://www.inverse.com/tech/apple-vision-pro-photos-app-spatial-video-hands-on\"><em>Inverse</em>'s Raymond Wong</a> said that spatial videos \"feel alive\" because of the way the border becomes \"glowy and dream-like\" when looked at, giving the content the \"characteristics of a memory.\" In a spatial video of his mom, he says he was transported back to the moment, and it was \"surreal\" to see his mom \"talking, laughing, and eating in spatial video.\"\r<br />\n\r<br />\nWong said that spatial videos can \"look life-sized\" at a certain distance and window size, but even zoomed out, he felt emotional seeing his mother in 3D.<blockquote>I think Apple was right in suggesting I capture sentimental content in spatial video. Cool as it was to see my colleagues at the office and a bar with a little bit of the third dimension, I don't think rewatching those clips had the same impact on me as the ones of my family. I suspect once people have the opportunity to see their own content in Vision Pro, they'll get a better sense of when and when not to tap the spatial video icon in the camera app on their iPhones.</blockquote>\r<br />\nJosh Rubin of <em><a href=\"https://coolhunting.com/tech/recording-spatial-video-and-viewing-it-in-apple-vision-pro/\">Cool Hunting</a></em> said that even in recordings where he was warned there wasn't enough light, the video on the headset was \"crisp and not grainy.\" He found that the best scenes had multiple focal points in a two to eight foot range. Too much movement in a spatial video can be disorienting, leading to nausea.\r<br />\n<blockquote>Shots with the camera stationary (such as on a tripod) are ideal, but camera movement is often necessary or desired to make a satisfying story. I found that recording linear and gently curved movements, especially in open spaces, created videos that were easy to view. By contrast, sharp turns in close quarters created more jarring videos.</blockquote>\r<br />\nThe Vision Pro headset is set to launch in early 2024, and Apple is hoping that customers who plan to buy it will have a selection of their own spatial videos ready to go when it comes out. Spatial video can be recorded right now on the ‌iPhone 15 Pro‌ and ‌iPhone 15 Pro‌ Max, though the captured video will look normal until viewed in 3D on the Vision Pro headset.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/12/14/journalists-experience-spatial-videos-vision-pro/\">Journalists Detail Seeing Their Own Spatial Videos on Apple Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/journalists-detail-seeing-their-own-spatial-videos-on-apple-vision-pro.2413756/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a254ed3ca9398f3bf4e59de148786ab53ee77d843648ef41db158374ddfde134","category":"Apple"}