{"title":"An Assessing the Role of Watershed Management Practices in Gullele Botanical Garden, Addis Ababa, Ethiopia","link":"https://www.preprints.org/manuscript/202408.1889/v1","date":1724755818000,"content":"AbstractEthiopia is a country that is in the process of development. Unfortunately, the management and utilization of watershed resources in this region are inadequate. This has resulted in a decrease in the quality of essential resources like soil, water, plants, and animals. Our research delved into the intricate biophysical conditions, conservation practices, and key issues surrounding watersheds along with their root causes and current strategies. The study was particularly focused on understanding the reality and different approaches employed in watershed management practices at the Gullele Botanical Garden located in Addis Ababa. We gathered information through interviews with experts and technicians, direct on-site observations, and official records from the garden's administration office. The gathered data was meticulously analyzed both qualitatively and quantitatively using Arc Map 10.3 to gain a comprehensive understanding of the area. Our findings revealed that the main objective of watershed management in areas surrounding restricted forest sites, Dam A, and Dam B was centered on conserving soil and water resources. The study emphasized the importance of selecting appropriate technologies for effective water and soil conservation practices. Data collection was done using purposive and random sampling methods, drawing information from a variety of sources such as the Gullele Botanical Garden office, literature, research reports, student theses, and both published and unpublished organizational documents. Despite these efforts, our study highlighted inefficiencies in the institutions responsible for watershed management. In particular, the maintenance of stone bunds, gullies, and gabions was not conducted adequately, leading to project deficits. Moving forward, we recommend raising awareness, enhancing training programs, and strengthening law enforcement and watershed policies to transform the knowledge, skills, and attitudes of technicians and staff involved in watershed management techniques for the better.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a25ab04f0f74bb15c6b36a6fd544a904921a5fe43c7da3ff08b0ce1f4d57db52","category":"Interdisciplinary"}