{"title":"New drivers add performance-boosting memory-access feature to older AMD GPUs","link":"https://arstechnica.com/?p=1794214","date":1631565787000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/chrome_2019-06-11_13-43-17-800x450.png\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2019/06/chrome_2019-06-11_13-43-17.png\">Enlarge</a> <span>/</span> The Radeon RX 5700 XT.  (credit: <a href=\"https://www.amd.com/en\">AMD</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>GPU driver releases normally aren't very newsworthy; they usually fix bugs, boost performance in some games, and add support for new GPUs. But owners of last-generation AMD Radeon RX 5000-series graphics cards should take note of today's <a href=\"https://www.amd.com/en/support/kb/release-notes/rn-rad-win-21-9-1\">Adrenalin 21.9.1 release</a>. This update adds support for AMD's \"<a href=\"https://www.amd.com/en/technologies/smart-access-memory\">Smart Access Memory</a>\" (SAM) feature for older GPUs. AMD says the feature can improve game performance by up to 15 percent in some games.</p>\n<p>SAM support was previously restricted to the Radeon RX 6800 series (and Nvidia's GeForce RTX 3000 series, which support a mostly identical feature that Nvidia calls <a href=\"https://www.nvidia.com/en-us/geforce/news/geforce-rtx-30-series-resizable-bar-support/\">Resizable BAR</a>). In addition to the right GPU and the right drivers, you'll also need to be running a supported processor on a supported chipset: either a 10th- or 11th-generation Intel Core CPU in a 400- or 500-series motherboard or a Ryzen 3000 or 5000-series CPU in a 400- or 500-series motherboard.</p>\n<p>Whether you're talking about SAM or Resizable BAR, the different names all refer to the same PCI Express functionality. Normally, your computer's processor can only directly access 256MB of your GPU's video memory at a time, and the memory requires larger assets to be broken up into smaller chunks for transfer. Resizable BAR removes that limit and noticeably improves performance in some games. A <a href=\"https://www.techspot.com/article/2178-amd-smart-access-memory/\">TechSpot test of 36 games</a> using an RX 6800 GPU and Ryzen 5950X processor observed an improvement of up to 20 percent depending on the game and the settings. For most games, though, performance improved by a much smaller amount or didn't improve at all. A few games even showed performance decreases with SAM enabled, though never by enough to make any games unplayable.</p></div><p><a href=\"https://arstechnica.com/?p=1794214#p3\">Read 2 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1794214&amp;comments=1\">Comments</a></p>","author":"Andrew Cunningham","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a25e177ce2fc83929c77d5d26bc3aa3c86df1f7f0e0f35501ffb87496e0bb83c","category":"Tech"}