{"title":"Perceived ease of use of Truenat among laboratory staff as a new diagnostic tool for TB in Nigeria: Result of a pilot roll-out","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003652","date":1726840800000,"content":"<p>by Austin Ihesie, Nkiru Nwokoye, Jamiu Olabamiji, Kingsley Ochei, Rupert Eneogu, Debby Nongo, Aminu Babayi, Rayi Olugbemiga, Bethrand Odume, Aderonke Agbaje, Omosalewa Oyelaran, Wayne van Germert, Lucy Mupfumi, Omoniyi Amos, Elom Emeka, Chukwuma Anyaike, Edmund Ndudi Ossai</p>\r\n\r\nIn January 2020, WHO released a rapid communication on use of molecular assays as initial tests for diagnosis of tuberculosis, recommending Truenat as a replacement for smear microscopy in TB diagnosis. This study was designed to assess perceived ease of use of Truenat among Laboratory staff as a new diagnostic tool for TB in Nigeria. This study used a cross-sectional design. All trained Laboratory personnel operating the Truenat Duo equipment in 38 Truenat sites in the country were included. Information was obtained using a pre-tested self-administered questionnaire. Ease of use of Truenat was assessed using twenty-three variables on a five-point Likert scale of 1–5. The variables were analyzed quantitatively and qualitatively. Good Ease of use of Truenat was determined by proportion of respondents who answered ≥70% of the variables in the positive. All 50 Truenat Laboratory staff participated in the study. (Response rate 100%). Majority, (58%) were male. The median estimated number of tests before Laboratory staff became proficient with Truenat machine was 9 (IQR, 4–20), median number of tests to be analyzed within eight working hours was 10, (IQR = 8–15) and median time to conduct a Truelab MTBPlus test from start to finish was 60 minutes (IQR = 60–80). The commonest operational challenge that required Molbio service support was Trueprep errors/blockage, 47.4%. Overall, mean ease of use score was 4.0±0.4. Majority, (76%) had Good Ease of use of Truenat. No factor significantly influenced Ease of use of Truenat. Truenat machine is easy to use for a trained laboratory staff with minimal technical support and hence could be rolled out easily and successfully by various National TB Programs. Considering the high Trueprep challenges reported, there is need for further studies into the common errors/challenges, the contexts surrounding them and the programmatic intervention to address the high rate of Trueprep equipment faults.","author":"Austin Ihesie","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a26156d06828ce57a65c88ba768ab3e2568d5e4d949bf315e9421346dd4156b2","category":"Environment"}