{"title":"Wirecutter Union Is Striking","link":"https://www.wirecutterunion.com/","date":1637785434000,"content":"\n<p>Wirecutter Union:</p>\n\n<blockquote>\n  <p>During two years of bargaining, The New York Times company has\nslow-walked contract negotiations with unfair labor practices and\ninsignificant wage offers that severely underpay our staff. We,\nmembers of the Wirecutter Union, are fed up. To win the fair\ncontract we deserve, we’re prepared to walk out during the Black\nFriday shopping week.</p>\n\n<p>Wirecutter continues to bring in record revenue for the Times,\nwhich is sitting on over $1 billion in cash. Yet our members\nhave seen next to no financial benefit from their vital\ncontributions to this success. Times management has offered\npaltry guaranteed wage increases of only 0.5%, despite soaring\ninflation and cash flows.</p>\n</blockquote>\n\n<p>Choire Sicha, writing at New York Magazine, has the headline of the day, “<a href=\"https://nymag.com/intelligencer/2021/11/wirecutter-strike-new-york-times.html\">Here’s the Best Strike for Most People</a>”:</p>\n\n<blockquote>\n  <p>Many Wirecutter staff realized early on that their Times\ncolleagues weren’t as excited about their arrival, even as the\nthen-CEO extolled at sale time that Wirecutter “embodies the same\nstandards and values that are the pillars of our own newsroom.”\nBut Wirecutter was always treated as a second-class citizen,\nisolated in its own Slack, its own offices, and its own reporting\nstructure under Perpich. It never joined the newsroom, and its\nwork was openly sneered at by some longtime staffers. Many Times\nstaffers don’t believe their work is journalism at all. The pay\nscale, as well, is substantially different from Times salaries.\nEven Times fellows, which are yearlong full-time jobs in the\nnewsroom designed to train emerging journalists, receive a\nsignificantly higher salary than the starting rate for Wirecutter\nwriters.</p>\n</blockquote>\n\n<p>The Times will take the money Wirecutter generates — remember, they now charge a subscription fee, on top of their original (and successful) monetization strategy of earning revenue through affiliate links for recommended products — but they do not treat Wirecutter staff as peers.</p>\n\n<p>Fuck ’em, I say. Stay away from Wirecutter this weekend, and tell everyone in your family tomorrow to do the same. There are a zillion other places to find links to Black Friday deals.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2021/11/24/wirecutter-union\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a26981759f0c18dcf2e02f01c360c92a75641cc550fd3b3d829933a7c32bbd78","category":"Tech"}