{"title":"A Comparative Analysis of Key Features for Tracing the Causes of Abnormal Electricity Prices in Market Environments","link":"https://www.preprints.org/manuscript/202407.2460/v1","date":1722351282000,"content":"Electricity price signal is a direct reflection of the attributes of electric power commodities, but due to the influence of market supply and demand, power producers' offer, line capacity and other factors, electricity price signals often show a variety of abnormal forms. The identification and traceability of abnormal tariff signals is an important daily work of power trading centers at all levels. However, at present, it is common to rely on manual experience to analyze the causes of abnormal tariffs, which is inefficient and difficult to ensure the objective and scientific traceability of abnormal tariff causes. Since different types of abnormal tariff signals are caused by different dominant factors, if the key features of abnormal tariffs can be classified and matched, the identification efficiency can be effectively improved. For this reason, this paper proposes a traceability method of abnormal tariffs based on the comparison analysis of key features. First of all, based on the characteristics of historical tariff data, this paper completes the classification of tariff spike magnitude anomaly and tariff mean value anomaly, further establishes the key features of each type of abnormal tariff signal based on principal component analysis, and finally calculates the influence degree of each element within the key features one by one based on alternative algorithms, and then realizes the screening and traceability of the causes of abnormal tariffs based on the importance of the degree of influence ordering. The effectiveness of the proposed method has been verified in a large number of examples constructed based on the actual data of the electricity market, and the average correctness rate of the proposed method for the traceability of the causes of the average value and spike anomalies of the electricity price reaches more than 85%, which can reduce the labor cost in the process of the traceability of the causes of the anomalous electricity price.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a26a2ee2680df46d45ee9854f3fd70f98f8be6e6109273a7f68b201b32d2952a","category":"Interdisciplinary"}