{"title":"Apple has a tablet problem and it starts with the iPad Air","link":"https://www.macworld.com/article/540082/ipad-air-tablet-staggered-updates.html","date":1633341600000,"content":"<div>\n<section><div></div></section><p>With the update of the <a href=\"https://www.macworld.com/article/348867/2021-ipad-mini-design-display-price-release.html\">iPad mini</a> last month, Apple’s tablet lineup now has a series of strong offerings across the board, from the base model ninth-generation iPad all the way up to the 12.9-inch iPad Pro. At first glance, it seems like there’s something for everyone—but look closer, and the cracks start to show.</p>\n\n\n\n<p>The high-end and low-end of the lineup have been pretty clearly staked out: Nobody who’s in the market for a $329 iPad is seriously looking at the top of the line iPad Pro, or vice versa. In the middle, though, things get squishier, especially when it comes to the iPad Air. In part, this is because the tablet lineup is out of joint, as Apple’s update schedule for the different models has varied widely over the last year or two.</p>\n\n\n\n<p>Will 2022 bring an opportunity for Apple to gets its tablet ducks in a row? Maybe, but if so, it’s got some decisions to make first.</p>\n\n\n\n<h2>Time after time</h2>\n\n\n\n<p>Apple updates the iPhones and Apple Watches in the fall, regular as clockwork. Sure, there’s occasionally an out-of-cycle spring release such as the iPhone SE or the purple iPhone 12, but when it comes to <em>new</em> models, you can count on them in September (or, rarely, October). It’s no surprise as to why: the holiday shopping season is routinely Apple’s biggest quarter, and the iPhone is its biggest product.</p>\n\n\n\n<p>The iPad, on the other hand, has always been a little bit more scattershot, its progression more closely resembling the Mac. In the last year, we got an iPad Air update (fall 2020), an iPad Pro update (spring 2021), two updates to the base-level iPad (fall 2020 and fall 2021), and an update to the iPad mini (fall 2021).</p>\n\n\n\n<p>But in addition to splitting the product line to debut at different points, they’re also on different refresh cycles. For example, the base iPad has been updated every fall since September 2019 and the iPad Pro has been updated twice since spring 2020, but the iPad Air and the iPad mini hadn’t been updated since March 2019 until their most recent updates in September 2020 and September 2021, respectively.</p>\n\n\n\n<p>Apple can, of course, update its products on whatever schedule works best for it, but by having new iPad models come out a couple of times a year, it means that the line-up is always uneven <em>somewhere</em>.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/tim-cook-ipad-lineup.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption><p><br /></p>The regular iPads are updated at a different time than the Pro models, which can throw the lineup out of sync.</figcaption></figure><p>Apple</p></div>\n\n\n\n<h2>Out of sync</h2>\n\n\n\n<p>When the fourth-generation iPad Air came out last fall, it was in a peculiar position. With its A14 processor, it handily outpaced the A12Z in the then-state-of-the-art iPad Pro—and it was cheaper, to boot. Likewise, the Air added a lot of the features that had previously been exclusive to the Pro, like support for the Magic Keyboard and second-generation Apple Pencil, as well as a USB-C connector. While its storage options were more limited, and its cameras not as good, its $749 price tag for a 256GB model was $150 cheaper than the slower 11-inch iPad Pro at the same storage capacity.</p>\n\n\n\n<p>The iPad mini now finds itself in a similar situation. At heart, it seems like it truly wants to be an iPad Air mini, having gained similar features like second-generation Pencil integration, Touch ID on the home button, and a USB-C connector. But it also surpasses the Air in several regards, such as its A15 processor, 5G support, and a better front-facing camera with Center Stage.</p>\n\n\n\n<p>Even if the mini isn’t in bargain-basement territory, it’s still $100 cheaper than the Air that it outperforms. Obviously, if the screen size is the driving factor, there’s simply no substitute, but for those who don’t mind a smaller display and don’t need the convenience of an attachable keyboard, it’s reasonable to wonder why they should spend more to get less.</p>\n\n\n\n<h2>The Air down there</h2>\n\n\n\n<p>All of this points to a question about the future of the iPad Air. It seems as though it’s intended to sit between the ninth-generation iPad and the iPad Pro, right at the “mid-range” of the line. And yet its price tag is weighted firmly towards the Pro side of the market, its price point $100 more than the $499 at which the “standard” model has generally resided.</p>\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/09/ipad-air-2020.jpg?quality=50&amp;strip=all&amp;w=1200\" /><figcaption>The iPad Air currently has an odd position in the iPad lineup.</figcaption></figure><p>Apple</p></div>\n\n\n\n<p>And that’s for a paltry 64GB, the same starting storage as a ninth-generation iPad. (A storage tier, it should be noted, that Apple did away with on its iPhone 13 line this year.) The only other storage option for the Air is 256GB, which adds a significant $150 to the price tag—at which point, just $50 more will get you into a 128GB iPad Pro.</p>\n\n\n\n<p>Long story short, the iPad Air looks like it’s out of touch and out of time. With no rumors of a revamp this year, it suggests that a new Air is more likely to show up this spring. The question is whether Apple will decide to keep its pricing where it is or position it once again as the modern iPad for most people.</p>\n\n\n\n<p>But with these staggered updates, Apple may be condemned to always having its tablet line somewhat disorganized. Maybe that is a bonus to Apple, in terms of pushing more expensive models and weighting the pricing towards the high-end, but it doesn’t feel as though it benefits consumers looking for a reasonably-priced modern iPad.</p>\n</div>","author":"Dan Moren","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a26db0724e5357df4c1ddd745538ec82c20641f4d2d22d2491039b00cbbd9fd8","category":"Apple"}