{"title":"Chemical range recognized by the ligand-binding domain in a representative amino acid-sensing taste receptor, T1r2a/T1r3, from medaka fish","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0300981","date":1711116000000,"content":"<p>by Hikaru Ishida, Norihisa Yasui, Atsuko Yamashita</p>\r\n\r\nTaste receptor type 1 (T1r) proteins are responsible for recognizing nutrient chemicals in foods. In humans, T1r2/T1r3 and T1r1/T1r3 heterodimers serve as the sweet and umami receptors that recognize sugars or amino acids and nucleotides, respectively. T1rs are conserved among vertebrates, and T1r2a/T1r3 from medaka fish is currently the only member for which the structure of the ligand-binding domain (LBD) has been solved. T1r2a/T1r3 is an amino acid receptor that recognizes various l-amino acids in its LBD as observed with other T1rs exhibiting broad substrate specificities. Nevertheless, the range of chemicals that are recognized by T1r2a/T1r3LBD has not been extensively explored. In the present study, the binding of various chemicals to medaka T1r2a/T1r3LBD was analyzed. A binding assay for amino acid derivatives verified the specificity of this protein to l-α-amino acids and the importance of α-amino and carboxy groups for receptor recognition. The results further indicated the significance of the α-hydrogen for recognition as replacing it with a methyl group resulted in a substantially decreased affinity. The binding ability to the protein was not limited to proteinogenic amino acids, but also to non-proteinogenic amino acids, such as metabolic intermediates. Besides l-α-amino acids, no other chemicals showed significant binding to the protein. These results indicate that all of the common structural groups of α-amino acids and their geometry in the l-configuration are recognized by the protein, whereas a wide variety of α-substituents can be accommodated in the ligand binding sites of the LBDs.","author":"Hikaru Ishida","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a27172befcd8a4de65b484ab64056280fdc1d3123d71a890ee5164a45936ff9c","category":"Interdisciplinary"}