{"title":"SRAM adds extra-large chainring options for Red eTap AXS drivetrains","link":"https://cyclingtips.com/2021/03/sram-adds-extra-large-chainring-options-for-red-etap-axs-drivetrains/","date":1616621520000,"content":"<p>Remember those <a href=\"https://cyclingtips.com/2020/01/bigger-chainrings-for-trek-segafredo-but-not-for-the-usual-reasons/\">oversized chainrings we spotted</a> at the Tour Down Under in 2020? SRAM insisted at the time that they were developed especially for pro riders who had &#8220;specific needs&#8221; and wanted &#8220;extra gearing options.&#8221; If you have those same needs and wants — and to fulfill UCI rules on public availability — SRAM has now decided to offer a selection of extra-large chainring setups to the general public.</p>\n\n\n\n<p>In fact, SRAM has added three new one-piece double chainrings: 52/39T, 54/41T, and 56/43T. When combined with the groupset’s usual 10-tooth small cassette sprocket, those yield the truly massive rough equivalents of a 57-11T, 59-11T, and 62-11T, respectively.</p>\n\n\n\n<p>You’d better be pretty sure you need those enormous roll-outs, though. SRAM is exclusively offering these combos with the integrated power meter option, so it’s not like this is something you’ll be able to casually add to your race-day setup on the cheap. Moreover, because most modern road racing and time trial bikes have dedicated front derailleur mounts that can’t be easily moved, the larger total diameter of these oversized rings requires SRAM to bundle together a special &#8220;two-position&#8221; front derailleur. </p>\n\n\n\n<p>Retail pricing is, therefore, about what you’d expect, at US$1,349 / £1,160 / €1,300 (VAT-inclusive) — and that’s without crankarms. Australian pricing is to be confirmed.</p>\n\n\n\n<p>More information can be found at <a href=\"https://www.sram.com/en/sram/models/pm-axs-kitr-d1\">www.sram.com</a>.</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/03/sram-adds-extra-large-chainring-options-for-red-etap-axs-drivetrains/\">SRAM adds extra-large chainring options for Red eTap AXS drivetrains</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"James Huang","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a276e7278d59e8c72ed992bb485f8e8a0af40b6514851f9522828919b16d7ec1","category":"Cycling"}