{"title":"Thermal conditions alter the mating behaviour of males in a polygynous system","link":"https://besjournals.onlinelibrary.wiley.com/doi/10.1111/1365-2435.14664?af=R","date":1727753683000,"content":"<img src=\"https://besjournals.onlinelibrary.wiley.com/cms/asset/f9bf2856-4d71-49a2-9dc0-b073a522581e/fec14664-toc-0001-m.png\" alt=\"Thermal conditions alter the mating behaviour of males in a polygynous system\" />\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/19/will-climate-change-affect-who-wins-and-who-loses-during-the-mating-season/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<br />\n<h2>Abstract</h2>\n<p>\n\nMales in polygynous systems may be facing a trade-off between the traits that enhance reproductive success and the need to cope with environmental change. To secure mates, males invest into large bodies, lavish ornaments and costly activities, but these investments may be incompatible with future environments. As climatic change intensifies, thermal stressors could be disrupting the energy-intensive pathways that historically have yielded mating opportunity.\n\nWe evaluated how traits associated with social dominance interacted with environmental conditions to shape mating behaviour and opportunity in moose (<i>Alces alces</i>), a heat-sensitive species in which southern populations live at the edge of their thermal tolerance. We anticipated that males with favourable characteristics (e.g. age, weaponry) would allocate more to reproduction, resulting in increased mating opportunity. We expected that warm temperatures would limit reproductive effort, especially as age and weapon size increased.\n\nWe quantified mating tactics, effort, and opportunity for male moose ranging in age from 1.5 to 11.5 years. We used hidden Markov models to detect mating tactics, accelerometer data to quantify movement effort, and proximity to females as a proxy for mating opportunity. We modelled these mating dynamics as a function of age, weapon size, and ambient temperature.\n\nWarm temperatures exaggerated age-related differences in time and effort allocated to reproductive movement. Heat disproportionately limited reproductive effort in old males, the ages that also had the greatest mating opportunity. Even though warm temperatures altered mating behaviour, they did not reduce mating opportunity. Across temperatures, mating opportunity was highest in prime-age and old males, yet time and effort devoted to reproductive movement decreased with age.\n\nClimate change, which is increasing autumn temperatures, may increase variation in reproductive effort across ages and depress the movement of old males, who are typically the primary breeders. The discrepancy between behaviour and opportunity suggests that movement is not a reliable pathway to reproduction and emphasizes the advantages of energy-saving strategies, especially as environments become more taxing for heat-sensitive species. We reveal the limitations of movement effort in polygynous mating strategies and the susceptibility of this critical life history stage to environmental change.\n</p>\n<p>Read the free <a href=\"https://fesummaries.wordpress.com/2024/09/19/will-climate-change-affect-who-wins-and-who-loses-during-the-mating-season/\">Plain Language Summary</a> for this article on the Journal blog.</p>\n<h2>Resumen</h2>\n<p>\n\nLos machos en sistemas poligínicos pueden enfrentar un intercambio entre las características que mejoran el éxito reproductivo y la necesidad de afrontar al cambio ambiental. Para conseguir parejas, los machos invierten en cuerpos grandes, adornos lujosos y actividades costosas, pero estas inversiones pueden ser incompatibles con el medio ambiente del futuro. A medida que se intensifica el cambio climático, estresores térmicos podrán quebrantar las vías de uso intensivo de energía que históricamente han generado oportunidades de apareamiento.\n\nHemos evaluado cómo las características asociadas con el dominio social interactúan con las condiciones ambientales para determinar el comportamiento y la oportunidad de apareamiento en los alces (<i>Alces alces</i>), una especie sensible al calor cuyas poblaciones sureñas viven al límite de su tolerancia térmica. Anticipamos que los machos con características favorables (e.g. edad, armas) dedicarían más tiempo a la reproducción, lo que les daría mayor oportunidad de apareamiento. Nuestra expectativa era que las temperaturas cálidas limitarían el esfuerzo reproductivo, especialmente a medida que aumente la edad y tamaño de armas de los machos.\n\nCuantificamos las tácticas, el esfuerzo, y la oportunidad del apareamiento de los alces machos de entre 1.5 y 11.5 años. Utilizamos modelos ocultos de Márkov para detectar las tácticas de apareamiento, datos de acelerómetro para cuantificar esfuerzo de movimiento y datos de la proximidad a las hembras como indicador de la oportunidad de apareamiento. Modelamos estas dinámicas de apareamiento en función de la edad, el tamaño del arma y la temperatura ambiental.\n\nLas temperaturas cálidas exageraron las diferencias relacionadas con la edad en el tiempo y el esfuerzo que los alces asignan al movimiento reproductivo. El calor limitó desproporcionadamente el esfuerzo reproductivo en los machos viejos, cuando en estas edades había mayor oportunidad de apareamiento. Aunque las temperaturas cálidas alteraron el comportamiento, no redujeron las oportunidades de apareamiento. En todas las temperaturas, las oportunidades de apareamiento fueron mayores en los machos viejos y de edad madura, pero el tiempo y el esfuerzo dedicado al movimiento reproductivo disminuyó con la edad.\n\nEl cambio climático, el cual está aumentando las temperaturas otoñales, puede agrandar la variación en el esfuerzo reproductivo a lo largo de las edades y reducir el movimiento de los machos viejos, que suelen ser los reproductores primarios. La discrepancia entre el comportamiento y la oportunidad sugiere que el movimiento no es una vía segura para la reproducción y enfatiza las ventajas de estrategias de ahorro de energía, especialmente a medida que la vida se pone más fatigante para las especies sensibles al calor. Nuestro trabajo revela los límites del esfuerzo de movimiento en las estrategias del apareamiento poligínicas y la susceptibilidad de esta etapa de vida al cambio ambiental.\n</p>","author":"Rebecca L. Levine, \nBart Kroger, \nKevin L. Monteith","siteTitle":"Wiley: Functional Ecology: Table of Contents","siteHash":"d6d44f91b8c3d0319e19739e0c9e63f664582eafb34301dcbb8f144284121b6c","entryHash":"a27776813deee6d46c0e564ea85d016552583fdb5be25664f86cf0776a3ee20b","category":"Environment"}