{"title":"Exercises you can do off the bike to improve climbing, sprinting and endurance","link":"https://www.bikeradar.com/advice/fitness-and-training/exercises-you-can-do-off-the-bike/","date":1618588800000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2020/03/GettyImages-906511792-a88ae3c-scaled.jpg?quality=45&amp;resize=620,413\" />                                            <p>What you do off your bike can have as big an impact on your riding as what you do in the saddle. We share the best do-anywhere exercises from top coaches to improve your climbing, sprinting and endurance.</p>\n<p>If you’re interested in how specific sports can affect your cycling performance, check out our <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cross-training/\" target=\"_blank\">comprehensive guide to cross-training for cyclists</a>.</p>\n<h2>Three exercises to improve your climbing</h2>\n<p>The pro climbers of this world know the difference between their mobilisers and stabilisers, says Andy Wadsworth, director of <a href=\"http://www.mylifept.com\" target=\"_blank\">MyLifePT</a> personal training and online cycle coach.</p>\n<p>“The chain of movement goes from the tips of your ﬁngers to the tips of your toes, all working in one line,” he explains. “Think of your body like a bike chain – your links are your muscles, which stabilise and provide strength, while your pins are your joints, which provide mobility.</p>\n<p>“The biggest area of confusion here, which ties in directly with climbing, relates to your glutes. Because most of us sit on them all day we assume they’re mobilisers when they’re actually stabilisers. You need to work them accordingly off the bike for real gains on it.”</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nobody climbed quite like good ol’ Contador.</span></figcaption><span> <i>IONEL BONAVENTURE/AFP via Getty Images</i></span></div>\n<p>Imagine yourself as a table football player with an axle going through your hip so that you only move in one plane of motion with no sideways movement and no hip rocking.</p>\n<p>“If you’re ever out of the saddle or grinding up a hill, your glutes are paramount to holding the chain of movement together,” Wadsworth says.</p>\n<p>“If you watch classic footage of a legendary climber like <a href=\"https://www.bikeradar.com/news/bikeradar-meets-alberto-contador/\" target=\"_blank\">Alberto Contador</a>, you’ll see that his axis of movement was almost perfect because he understood this and constantly worked on his glute strength while off the bike and away from hills.”</p>\n<h3><strong>1. One-leg bridge changeovers</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Do this one before every ride.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Lying on your back with your knees at 90 degrees, feet ﬂat on the ﬂoor and arms by your sides, lift your hips and tense your glutes.</p>\n<p>Then lift your left leg, tense your right glute and hold for two seconds. Switch legs and repeat for 30 seconds.</p>\n<p>“It’s vital to make your glutes work as independently as they would during cycling but without activating your back and hamstrings, so tilt your pelvis up and pull your belly button in,” says Wadsworth. “Do it before every ride, especially interval sessions, to ﬁre the glutes.”</p>\n<p>Up the speed by doing fast reps for a minute at a time while maintaining control and form.</p>\n<h3><strong>2. Leg squat with rotation</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> This exercise is fantastic for hitting the gluteus medius muscle.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Standing on one leg, squat down and push your hips back while keeping your knees level to prevent your hips rotating.</p>\n<p>Assume a cycling position, bending forwards from the hip with a ﬂat back and your hands out as if holding a bar.</p>\n<p>Rotate your upper body until your shoulders are almost at 90 degrees but keep the bottom half of your frame perfectly still. Hold for two seconds and do 10 reps on each side.</p>\n<p>“This is fantastic for hitting the gluteus medius muscle on the side of your bum,” says Wadsworth. “This helps prevent lateral movement so your hips stay in line on that one axis when you’re out of the saddle.”</p>\n<h3><strong>3. Press-up hold-to-knee raise</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> This activates the gluteus maximus muscles in cycling positions.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>In a press-up position, tense your glutes and lift your right knee to your right elbow, keeping everything in the plank position.</p>\n<p>Then take your right foot back and straighten it. Just before you touch the ground, tense your right glute and change legs. Repeat 10 times on each side.</p>\n<p>“This activates the gluteus maximus muscles in cycling positions,” Wadsworth says. “Recruiting your glutes in the saddle is amazingly hard so do this just before you get on the bike to be ﬁred up and ready to go. By working these muscles you’re also protecting your back and nervous system and preventing spasming.”</p>\n<h2>Five exercises to improve your acceleration</h2>\n<p>You need the fast-twitch, type-two muscle ﬁbres in your glutes, quads and hamstrings for Chloe Hosking-style all-out sprinting speed.</p>\n<p>“By training these muscles over a month and making speciﬁc groups expand and contract at speed you can get the edge,” says Wadsworth. “These plyometric drills can make the difference between ﬁnishing ﬁrst and trundling into last place.”</p>\n<p>In fact, US researchers have found that jump squats can boost body power and acceleration by 13 per cent in ﬁve weeks.</p>\n<p>Complete as many of these exercises as you can in 30 minutes, breaking for two minutes between each. Try to land and explode rapidly, keeping ground contact brief.</p>\n<h3><strong>1. One-legged squat jumps</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Do 10 in a row on one leg before turning around and repeating on the other.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Stand on one leg and squat down until the top of your thigh is parallel with the ground, keeping your knee behind your front toe.</p>\n<p>Jump forwards and land on the same leg, squatting down to cushion the landing.</p>\n<p>Do 10 in a row on one leg before turning around and repeating on the other.</p>\n<h3><strong>2. Alternate leg bounds</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Do 10 reps per leg in each set.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Leap forward off your right leg as far as you can so your left leg and right arm go forward as you jump.</p>\n<p>Land on the ball of your left foot and immediately bound off it with your right leg and left arm extended. Bound up a hill to make it harder.</p>\n<p>Do 10 reps per leg in each set and do three sets, resting for 60 seconds after each.</p>\n<h3><strong>3. Depth jumps</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Quickness off the ground is the key to this drill.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Step off a 50 to 70cm high box or stair and jump up from both legs as high as possible.</p>\n<p>“Quickness off the ground is the key to this drill,” says Wadsworth. “React as though the ground was covered in burning ash and you had no shoes on.” Repeat ﬁve to eight times.</p>\n<h3><strong>4. Power skipping</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Push forcefully off the ground with each hop.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>You remember how to skip. Now make it explosive by pushing forcefully off the ground with each hop and lifting the knee of your forward leg up to your chest.</p>\n<p>“Exaggerate lifting the knees to get the greatest beneﬁt,” Wadsworth recommends.</p>\n<p>Do 16 skips per set and three sets, with a 60-second rest between each.</p>\n<h3><strong>5. Single leg hops</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Do six reps per leg per set and do three sets.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Hop forward on your right leg as far as you can, swinging your arms for help.</p>\n<p>Immediately repeat the movement. After you’ve done it six times, rest for 15 seconds and then repeat the exercise with your left leg.</p>\n<p>Do six reps per leg per set and do three sets, resting for 30 seconds after each.</p>\n<h2>Two exercises to improve your cycling endurance</h2>\n<p>On top of all the other beneﬁts – back protection, power, speed – a rock-hard core is your key to lasting 12 quality hours in the saddle.</p>\n<p>But while you might think that a six-pack means you’re on the right lines, it’s essential to delve deeper for truly functional beneﬁts.</p>\n<p>You actually have four cores with 29 different muscles in your abdominal cavity. “Your core is the single most fundamental element in your kinematic chain,” says <a href=\"https://www.mattrabin.com/aboutmattrabin\" target=\"_blank\">Matt Rabin</a>, chiropractor with the EF Pro Cycling Team. “It transfers power most efﬁciently from your body to the bike.</p>\n<p>“Think of it like your drivetrain connecting the engine with your tyres. Without stability, valuable power is wasted and you’ll tire quicker and have to tap into vital glycogen reserves sooner.”</p>\n<p>If that happens, a sportive will transform from an endorphin-ﬁlled, manageable challenge into a Herculean task.</p>\n<p>“The prehab and rehab exercises here are a must for any cyclist wanting to move up a gear in their riding,” says Rabin.</p>\n<p>“They’ll also help you recover faster after rides, you’ll ﬁnd you’re working with rather than against the bike and any injuries you do sustain will heal quicker. I’d say that 70 to 80 per cent of undiagnosed or non-responsive <a href=\"https://www.bikeradar.com/advice/fitness-and-training/cycling-knee-pain-the-problem-areas/\">knee issues</a> I see have nothing to do with the joint but are related to core weaknesses.”</p>\n<h3><strong>1. Deep core holds/pulses</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> This exercise speciﬁcally strengthens the transverse abdominis (TVA) core and multiﬁdus spine-stabilising muscles.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Lying on your back, put your feet ﬂat on the ﬂoor with your knees together and make an angle of 90 degrees.</p>\n<p>Roll your pelvis back so it’s pointing towards the ceiling, pull your belly button towards your spine to activate your deep core and push your back ﬂat against the ground so there’s no arch. Hold for 10 seconds, rest brieﬂy and repeat 10 times.</p>\n<p>This exercise speciﬁcally strengthens the transverse abdominis (TVA) core and multiﬁdus spine-stabilising muscles, and helps pelvic proprioception, taking the strain off your lower back and hamstrings.</p>\n<p>“Don’t hold your breath because this can bring in your quads and glutes when you really want to focus all your efforts on the TVAs,” Rabin explains.</p>\n<p>Take things up a gear by pulsing your head towards your midriff and raising your shoulders off the ﬂoor slightly while maintaining full back contact with the ground. Again, press down as hard as you can through the line of the belly button.</p>\n<p>Do three sets of 10, keeping complete control throughout each small movement. “You’ll be working the crucial corset muscles that are responsible for holding everything together,” says Rabin.</p>\n<h3><strong>2. Planks</strong></h3>\n<div>\n    <img /></div><div><figcaption><span><i></i> Planks hit TVA muscles and lateral obliques.</span></figcaption><span> <i>Robert Smith</i></span></div>\n<p>Get into a press-up position and hold your head, shoulders and hips in a perfectly straight line while resting on your forearms. “Again, activate your deep TVA core muscles by pulling your belly button towards your spine throughout,” says Rabin.</p>\n<p>Hold for 60 seconds then rotate 90 degrees so your right hip and shoulder are pointing up and you’re resting on your left forearm in a side plank position. Hold for 60 seconds and repeat on the other side.</p>\n<p>“Planks hit TVA muscles and lateral obliques to prevent thoracic rotation – and resultant loss of energy – and hip strains,” Rabin explains.</p>\n<p>“Add extra pressure by throwing in side pulses. Lower your hips towards the ground and then raise them towards the ceiling while lifting your straight upper leg at the same time.”</p>","author":"BikeRadar","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a282e6823a2f4db862345c7a46424d499abe6c7324ca3794ef270218fad5dcd0","category":"Cycling"}