{"title":"Characterization and molecular docking of sustainable wine lees and gelatin‐based emulsions: innovative fat substitution","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13563?af=R","date":1722924325000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The present study aimed to determine how various amounts (0.00, 0.58, 1.52 and 4.50 g 100 g<sup>−1</sup>) of wine lees (WL), which contains numerous essential components, impact the emulsifying properties of fish gelatin (FG) at a low concentration (0.5 g 100 g<sup>−1</sup>) in the high-fat phase (65 g 100 g<sup>−1</sup>). This study conducted rheology, physicochemical technical and characterization analyses on the emulsions to provide sustainable and innovative approaches for spreadable oils.</p>\n<h2>RESULTS</h2>\n<p>The addition of WL to FG emulsions improved oxidative stability, emulsion stability and bioactive compounds. The zeta potential (−101 ± 5.62 mV) of 0.58 g 100 g<sup>−1</sup> WL-containing emulsion (PE1) was found to be high, whereas particle size (347.6 ± 5.25 nm) and polydispersity index (0.50) were statistically low. It was also found that the addition of WL improved the intermolecular interactions, crystallinity and microstructural properties of the emulsions. All these results were supported by simulating the molecular configuration between FG and WL. The compounds gallic acid, caffeic acid, myricetin, quercetin and resveratrol showed a strong affinity to FG, with free binding energies of −5.50, −5.88, −6.53, −6.68 and −6.66 kcal mol<sup>−1</sup>, respectively.</p>\n<h2>CONCLUSION</h2>\n<p>As a result, WL-supported FG has the potential to be used as an alternative to egg proteins to develop sustainable low-cost spreadable emulsions. © 2024 The Authors. <i>Journal of The Science of Food and Agriculture</i> published by John Wiley &amp; Sons Ltd on behalf of Society of Chemical Industry.</p>","author":"Gülce Bedis Kaynarca","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a2888b39266c729811f11438d3c66d326ebac89a268d99ae342cd55bea9c88ca","category":"Environment"}