{"title":"PSX-8 Genetic characterization of Raramuri Criollo cattle introduced into the Southwestern United States","link":"https://academic.oup.com/jas/article/102/Supplement_3/447/7757738?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The Raramuri Criollo (RC) is a heritage cattle biotype preserved with minimal selection or crossbreeding for nearly five centuries by the Tarahumara communities of the Sierras of the Copper Canyon region in Northern Mexico. Previous studies at the USDA Jornada Experimental Range (JER) in the Chihuahuan Desert have indicated that RC cows travel farther, use large shrubland areas and are less susceptible to heat-stress than conventional breeds. These behavioral adaptations may represent traits that translate into a lower carbon, water and environmental footprint, and better adaptation to the variable forage conditions and hotter, drier summers of the arid U.S. Southwest. Understanding the genetic diversity of RC cattle is essential for the continued preservation of this genetic resource. The objective of this study was to assess the genetic diversity and structure of the USDA JER RC cattle herd in comparison with other heritage cattle biotypes. Ear tissue samples were collected from 128 animals and genotyped with a ~64K SNP Chip (Genetic Visions-ST). Genotype quality control and relatedness tests were conducted using PLINK 1.9, and 89 animals were retained for further analyses. Genetic diversity was evaluated through observed (H<sub>o</sub>) and expected heterozygosity (H<sub>e</sub>) using PLINK 1.9, and inbreeding coefficient based on runs of homozygosity (F<sub>ROH</sub>) using the consecutive runs method in the detectRUNS R package. Principal component analysis (PCA) was performed with PLINK 1.9 and visualized with ggplot2 R package to illustrate the relationships within the USDA JER RC herd. The effective population size (Ne) across generations was estimated using GONE software. Another PCA was performed to evaluate the relationship between RC and other heritage biotypes. For this, a representative subsample (n = 20) from the USDA JER RC herd was generated with the BITE R package. The overall mean H<sub>o</sub> and H<sub>e</sub> were 0.402 ± 0.126 and 0.384 ± 0.113, respectively, while the F<sub>ROH</sub> inbreeding coefficient was 0.113 ± 0.045. The relatively high heterozygosity and low F<sub>ROH</sub> indicated sufficient genetic variability. The USDA JER RC population showed low stratification possibly due to multiple sires, allowing for genetic diversification of the herd (Figure 1). Despite these results, the demographic history revealed an accelerated Ne decrease to a value of 33 (Figure 2), falling below the critical threshold of 50 to 100 recommended for a long-term viable population. The USDA JER RC was distinctly separated from the other heritage biotypes with the US Texas Longhorn cattle as the nearest distant population (Figure 3). In conclusion, the results suggest that RC may represent a distinctive heritage genetic biotype and a valuable genetic resource that may facilitate the selection of livestock resilient to climate change and extreme weather. Therefore, measures are being implemented for the long-term conservation of the USDA JER RC genetic pool.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a29070b83aff69c35ec6eabc027286d84c0735572dad2132f2577ee478459337","category":"Environment"}