{"title":"Virtual Reality Neurofeedback Training combined with Trauma-Informed Motivational Interviewing for the Treatment of Post-Traumatic Stress Disorder","link":"https://www.preprints.org/manuscript/202410.1594/v1","date":1729511576000,"content":"Background: Neurofeedback (NFB) or EEG-Biofeedback is a non-invasive therapeutic method, based on the theory of operating conditioning, and designed to change the functioning of the brain by sending feedback that provides positive or negative reinforcement. The goal is to teach the patient how to perceive specific cortical activation states and how to achieve them on purpose. NFB has been used to treat various mental disorders, including Post-traumatic Stress Disorder (PTSD). Traditional treatments for PTSD have several limitations; very few individuals are willing to relive the traumatic experience. Placing itself as an effective alternative, Neurofeedback allows the unresponsive patient to recourse to an alternative intervention to relieve their symptoms without reliving the anguish of trauma, consequently presuming a lower percentage of drop-out. Considering the importance of integrated approaches to clinical practice, NFB was integrated with Trauma-Informed Motivational Interviewing (TIMI). The TIMI approach is a new therapeutic paradigm for clinical interviews that aims to help users work through their trauma and transform it from a point of weakness to a point of strength. Integrating TIMI with NFB can help overcome the current trend of passive implementation of intervention tools, leading to greater user responsiveness and fewer residual symptoms. To improve treatment adherence, moreover, it has been suggested to incorporate Virtual Reality (VR) into the NFB system. VR, through the \"sense of presence,\" provides a more immersive experience than 2D visualization, potentially resulting in faster cortical training. Lastly, the research protocol aims to focus on a population at high risk of PTSD that is often overlooked in research, such as workers who are victims of occupational PTSD.Methods: The study design involves in-depth analysis of a specific clinical case. Baseline measurements were taken for enrollment and at the following time points: T1 (pre-treatment), T2 (post-treatment), and T3 (follow-up). These measurements included various psychometric assessments to evaluate PTSD symptoms, treatment acceptability, safety, and adherence, as well as biological measures related to the brain's electrophysiological activity.Results and Conclusion: Our research reveals that the synergy between virtual reality-mediated Neurofeedback and trauma-motivational interviewing produces significant results. TIMINB stands out as a low-cost, effective, and completely risk-free procedure. This approach could represent a groundbreaking innovation in the field of Cyberpsychology and psychological therapies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a295dc6ce10a045627e594720933b13cb1229915e1deb41d487e37b6ed62241b","category":"Interdisciplinary"}