{"title":"River flow intermittence influence biodiversity–stability relationships across spatial scales: Implications for an uncertain future","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17457?af=R","date":1724137200000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/61151820-22d5-4e89-8966-c03a92605cfe/gcb17457-toc-0001-m.png\" alt=\"River flow intermittence influence biodiversity–stability relationships across spatial scales: Implications for an uncertain future\" />\n<p>Climate change is increasing the proportion of river networks experiencing flow intermittence, which may impact biodiversity at local and regional scales. Here, we demonstrate that scale-dependent biodiversity responses to intermittence influence the spatial scaling of stability in river metacommunities. Whereas the regional stability of perennial rivers is mainly achieved through local stability, spatial asynchrony is the main stabilizing component of intermittent river networks. As more rivers become intermittent and disconnected due to global change, managers will need to focus on the spatial dynamics of metacommunities more than on local-scale processes to maintain the regional stability of ecosystem services.</p>\n<br />\n<h2>Abstract</h2>\n<p>Climate change is increasing the proportion of river networks experiencing flow intermittence, which in turn reduces local diversity (i.e., α-diversity) but enhances variation in species composition among sites (i.e., β-diversity), with potential consequences on ecosystem stability. Indeed, the multiscale theory of stability proposes that regional stability can be attained not only by local processes but also by spatial asynchrony among sites. However, it is still unknown whether and how scale-dependent changes in biodiversity associated with river flow intermittence influence stability across spatial scales. To elucidate this, we here focus on multiple metacommunities of French rivers experiencing contrasting levels of flow intermittence. We clearly show that the relative contribution of spatial asynchrony to regional stability was higher for metacommunities of intermittent than perennial rivers. Surprisingly, spatial asynchrony was mainly linked to asynchronous population dynamics among sites, but not to β-diversity. This finding was robust for both truly aquatic macroinvertebrates and for taxa that disperse aerially during their adult stages, implying the need to conserve multiple sites across the landscape to attain regional stability in intermittent rivers. By contrast, metacommunities of truly aquatic macroinvertebrates inhabiting perennial rivers were mainly stabilized by local processes. Our study provides novel evidence that metacommunities of perennial and intermittent rivers are stabilized by contrasting processes operating at different spatial scales. We demonstrate that flow intermittence enhances spatial asynchrony among sites, thus resulting in a regional stabilizing effect on intermittent river networks. Considering that climate change is increasing the proportion of intermittent rivers worldwide, our results suggest that managers need to focus on the spatial dynamics of metacommunities more than on local-scale processes to monitor, restore, and conserve freshwater biodiversity.</p>","author":"Andros T. Gianuca, \nVictor R. di Cavalcanti, \nLeonardo Cruz, \nMathieu Floury, \nJulie Crabot, \nLaurent Valette, \nJeremy Piffady, \nThibault Datry","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"a2992269890b6bb655b8455d88eaddb6dd1373db3aa8c0f0cea31961a625f3dd","category":"Environment"}