{"title":"Lenovo ฝันไกล อยากดัน Motorola ขึ้นอันดับ 3 โลกภายใน 3 ปีข้างหน้า, ตอนนี้อันดับ 8","link":"https://www.blognone.com/node/137773","date":1705806119000,"content":"<div><div><div><p>ถึงแม้สมาร์ทโฟนแบรนด์ Motorola ไม่ได้ทำตลาดในไทยมาสักพักแล้วก็ตาม แต่ก็ยังไปได้ดีในหลายประเทศ โดยเฉพาะในสหรัฐอเมริกาและละตินอเมริกา มีผลิตภัณฑ์อย่าง<a href=\"https://www.blognone.com/node/134130\">มือถือจอพับตระกูล Razr</a> เป็นผลิตภัณฑ์เด่นของตัวเอง</p>\n<p>ล่าสุด Matthew Zielinski ประธานฝ่ายตลาดนานาชาติของ Motorola ให้สัมภาษณ์กับ CNBC ว่าเป้าหมายของ Lenovo คือดันขึ้น Motorola ขึ้นเป็นผู้ขายสมาร์ทโฟนเบอร์ 3 ของโลก (ตามหลังแอปเปิลและซัมซุง) ภายในเวลา 3 ปีข้างหน้า</p>\n<p>ปัจจุบัน Motorola มีส่วนแบ่งตลาดโลกราว 4% ถือเป็นผู้เล่นอันดับ 8 ของโลก แต่ถ้านับตามภูมิภาค อยู่อันดับ 3 ในสหรัฐ และอันดับ 2 ในละตินอเมริกาแล้ว เป้าหมายถัดไปของบริษัทคือขยายส่วนแบ่งตลาดในภูมิภาคเหล่านี้ให้ถึง 10% อย่างมั่นคง และผลักดันสินค้ากลุ่มพรีเมียมให้มากขึ้น ซึ่ง Razr เข้าข่ายผลิตภัณฑ์กลุ่มนี้ เขายังบอกว่าผู้ใช้ Razr ส่วนใหญ่ย้ายมาจาก \"สมาร์ทโฟนอื่นที่ไม่ใช่แอนดรอยด์\"</p>\n<p>อีกประเทศที่ Motorola เตรียมบุกตลาดคืออินเดีย ซึ่งเป็นประเทศที่มีประชากรเติบโตสูง โดยใช้ยุทธศาสตร์การผลิตมือถือที่โรงงานของ Lenovo ในเมือง Pondicherry ให้สอดคล้องกับนโยบายของรัฐบาลอินเดียที่ต้องการสร้างฐานผลิตสินค้าอิเล็กทรอนิกส์ในประเทศ</p>\n<p>ที่มา - <a href=\"https://www.cnbc.com/2024/01/19/lenovo-bets-motorola-will-be-the-third-biggest-smartphone-player-in-3-years.html\">CNBC</a></p>\n<p><img alt=\"No Description\" src=\"https://www.blognone.com/sites/default/files/externals/8547a421ee3bae6c915044778549db72.jpg\" /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/motorola\">Motorola</a></div><div><a href=\"/topics/lenovo\">Lenovo</a></div><div><a href=\"/topics/mobile\">Mobile</a></div></div></div>","author":"mk","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a29d19fb6849cccf4f550ee30b9d64e7b7169f820893b9e6e1b786309e8c04e6","category":"Thai"}