{"title":"The Manuela Fundación is getting back into professional cycling","link":"https://cyclingtips.com/2021/07/the-manuela-fundacion-is-getting-back-into-professional-cycling/","date":1626453300000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/07/200406244_4258026330887398_9074153704416699428_n-650x434.jpeg\" /></div><h2>The Manuela Fundación is getting back into professional cycling</h2><p>\n</p><p>A little over a year on from the Manuela Fundación’s ill-fated attempt to sponsor the team now known as BikeExchange, the Spanish not-for-profit is working its way back into professional cycling.</p>\n\n\n\n<p>In a <a href=\"https://www.facebook.com/manuelafundacionsportbike/posts/208277511301392\" target=\"_blank\">Facebook post</a> published earlier this week, the Manuela Fundación announced that it will sponsor a Continental team in 2022 as “the first step on the roadmap towards the WorldTour.”</p>\n\n\n\n<p>“Since last year’s purchase of Mitchelton was frustrated and after several conversations with managers of other squads, [founder] Francis Huertas made the decision to create the project from the Continental category and go up step by step,” the statement reads.</p>\n\n\n\n<h2>What happened last year? </h2>\n\n\n\n<p>In early June 2020, the Mitchelton-Scott team (now BikeExchange) announced that it <a href=\"https://cyclingtips.com/2020/06/mitchelton-scott-is-becoming-team-manuela-fundacion/\" target=\"_blank\">would become Team Manuela Fundación</a> for the remainder of the season. After considerable confusion about the surprise deal – both <a href=\"https://cyclingtips.com/2020/06/confusion-reigns-inside-and-out-over-mitchelton-scotts-new-sponsor/\" target=\"_blank\">from outside the team and within</a> – team owner Gerry Ryan <a href=\"https://cyclingtips.com/2020/06/gerry-ryan-cancels-greenedge-deal-with-manuela-fundacion/\" target=\"_blank\">cancelled the Manuela Fundación deal</a> just days after it had been announced, later saying he <a href=\"https://cyclingtips.com/2020/07/gerry-ryan-sheds-light-on-decision-to-call-off-manuela-fundacion-deal/\" target=\"_blank\">hadn’t been involved in organising the deal</a>. The Manuela Fundación was <a href=\"https://cyclingtips.com/2020/06/manuela-fundacion-blindsided-by-collapse-of-greenedge-deal/\" target=\"_blank\">far from happy</a> about the way things ended up.</p>\n\n\n\n<p>The architect of the deal, Mitchelton-Scott’s then-general manager <a href=\"https://cyclingtips.com/2020/06/mitchelton-scott-boss-bannan-reportedly-out-after-manuela-fundacion-fiasco/\" target=\"_blank\">Shayne Bannan soon left the team</a>, and the Manuela Fundación offered to <a href=\"https://cyclingtips.com/2020/06/report-manuela-fundacion-offers-e10-million-for-worldtour-license/\" target=\"_blank\">buy Mitchelton-Scott’s WorldTour license</a>. When that came to nothing, the foundation <a href=\"https://cyclingtips.com/2020/07/the-manuela-fundacion-is-in-talks-to-invest-in-the-ccc-team/\" target=\"_blank\">looked to invest in the CCC team</a> and <a href=\"https://cyclingtips.com/2020/07/manuela-fundacion-reportedly-looking-into-options-with-other-teams/\" target=\"_blank\">other squads</a>.</p>\n\n\n\n<p>Those plans also failed to eventuate, and the Manuela Fundación soon faded back into obscurity.</p>\n\n\n\n<h2>What is the Manuela Fundación?</h2>\n\n\n\n<p>When Manuela Fundación was announced as new title sponsor of the Mitchelton-Scott team it was a not-for-profit that hadn’t yet started operations and that had no functioning website.</p>\n\n\n\n<p>The organisation was headed up by Francisco Huertas, a Spanish car dealership and construction company owner who’d been involved in various sports sponsorships for more than a decade – several of which <a href=\"https://cyclingtips.com/2020/06/confusion-reigns-inside-and-out-over-mitchelton-scotts-new-sponsor/\" target=\"_blank\">ended poorly</a>.</p>\n\n\n\n<p>The foundation was created by Huertas and his wife, María Angustias González, and named after the couple’s daughter who passed away just two days after her birth. According to the company’s <a href=\"https://manuelafundacion.org/inicio/\" target=\"_blank\">website</a>, the foundation “aims to help build a better world” with “Granad as a world reference”. It is “a group of committed people [who] fight to achieve it, like a solidarity legion that will not stop until it is achieved, bringing happiness and hope to homes, infecting the Manuela spirit.”</p>\n\n\n\n<p>The organisation has sponsored amateur racing teams since 2019. Some riders from the organisation’s U23 squad will join the Continental team when it debuts next year.</p>\n<p></p><a href=\"https://cyclingtips.com/2021/07/the-manuela-fundacion-is-getting-back-into-professional-cycling/\">Read More</a>","author":"Matt de Neef","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a2a176a1cf2fc331c4d61c0b59cc26840ff0b66f9c519cfa10cdeedf5b50d65e","category":"Cycling"}