{"title":"Anxiety and Depression Disorders in Undergraduate Medical Students during the COVID‐19 Pandemic: An Integrative Literature Review","link":"https://www.preprints.org/manuscript/202410.0037/v1","date":1727771506000,"content":"Introduction: The COVID-19 pandemic has triggered several challenges to mental health worldwide. Undergraduate medical students face considerable stress in their academic routines. Thus, there is a need to explore the implications of the mental health of undergraduate medical students during the COVID-19 pandemic. Objective: To review the global literature about anxiety and depression disorders in undergraduate medical students during the COVID-19 pandemic. Method: we developed an integrative literature review on the occurrence of anxiety and depression symptoms in undergraduate medical students during the COVID-19 pandemic. We assessed the results on the occurrence of anxiety and depression and the severity of symptoms in medical students during the COVID-19 pandemic using quantitative studies applying the GAD-7 questionnaire for anxiety or PHQ-9 for depression. Results: We reviewed 85 selected studies, and the results showed a significant prevalence of moderate and severe symptoms of anxiety and depression, with 28.2% of participants presenting scores ≥ 10 on the GAD-7 and 38.9% on the PHQ-9. Statistical analyses revealed associations between higher rates of anxiety symptoms in developing countries and data collected after the lockdown period in 2020, at the Pandemic lockdown. Conclusion: Our findings highlight the need for specific interventions to support the mental health of undergraduate medical students, critically in female students from developing countries during a Pandemic crisis.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a2aa86db08284ae83168b787840ff3cc747557141a9c807120c6f7a1ab197b07","category":"Interdisciplinary"}