{"title":"These Gestures Are How You Control Apple Vision Pro","link":"https://www.macrumors.com/2023/06/08/apple-vision-pro-gestures/","date":1686244612000,"content":"<a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a>, Apple's new \"spatial computing\" device, does not have a hardware-based control mechanism. It relies on eye tracking and hand gestures to allow users to manipulate objects in the virtual space in front of them. In a <a href=\"https://developer.apple.com/videos/play/wwdc2023/10073/\">recent developer session</a>, Apple designers outlined the specific gestures that can be used with Vision Pro, and how some of the interactions will work.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/apple-vision-pro-gestures.jpg\" alt width=\"3000\" height=\"1687\" />\r<br />\n<ul>\r<br />\n \t<li><strong>Tap</strong> - Tapping the thumb and the index finger together signals to the headset that you want to tap on a virtual element on the display that you're looking at. Users have also described this as a pinch, and it is the equivalent to tapping on the screen of an <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a>.</li>\r<br />\n \t<li><strong>Double Tap</strong> - Tapping twice initiates a double tap gesture.</li>\r<br />\n \t<li><strong>Pinch and Hold</strong> - A pinch and a hold is similar to a tap and hold gesture, and it does things like highlighting text.</li>\r<br />\n \t<li><strong>Pinch and Drag</strong> - Pinching and dragging can be used to scroll and to move windows around. You can scroll horizontally or vertically, and if you move your hand faster, you'll be able to scroll faster.</li>\r<br />\n \t<li><strong>Zoom</strong> - Zoom is one of two main two-handed gestures. You can pinch your fingers together and pull your hands apart to zoom in, and presumably zooming out will have a pushing sort of motion. Window sizes can also be adjusted by dragging at the corners.</li>\r<br />\n \t<li><strong>Rotate</strong> - Rotate is the other two-handed gesture and based on Apple's chart, it will involve pinching the fingers together and rotating the hands to manipulate virtual objects.</li>\r<br />\n</ul>\r<br />\nGestures will work in tandem with eye movements, and the many cameras in the Vision Pro will track where you are looking with great accuracy. Eye position will be a key factor in targeting what you want to interact with using hand gestures. As an example, looking at an app icon or on-screen element targets it and highlights it, and then you can follow up with a gesture.\r<br />\n\r<br />\nHand gestures do not need to be grand, and you can keep your hands in your lap. Apple is encouraging that, in fact, because it will keep your hands and arms from getting tired from being held in the air. You only need a tiny pinch gesture for the equivalent of a tap, because the cameras can track precise movements.\r<br />\n\r<br />\n<div><blockquote> <section> <a target=\"_blank\" href=\"https://www.tiktok.com/@macrumors?refer=embed\">@macrumors</a> Eye tracking and pinching is the interface on the new <a target=\"_blank\" href=\"https://www.tiktok.com/tag/applevisionpro?refer=embed\">#AppleVisionPro</a> and we could to try jt out! <a target=\"_blank\" href=\"https://www.tiktok.com/tag/apple?refer=embed\">#Apple</a> <a target=\"_blank\" href=\"https://www.tiktok.com/tag/vr?refer=embed\">#VR</a> <a target=\"_blank\" href=\"https://www.tiktok.com/tag/ar?refer=embed\">#AR</a> <a target=\"_blank\" href=\"https://www.tiktok.com/music/original-sound-7242130214243142446?refer=embed\">♬ original sound - MacRumors</a> </section> </blockquote> </div>\r<br />\nWhat you're looking at will let you select and manipulate objects that are both close to you and far from you, and Apple does anticipate scenarios where you might want to use larger gestures to control objects that are right in front of you. You can reach out and use your fingertips to interact with an object. For example, if you have a Safari window right in front of you, you can reach your hand out and scroll from there rather than using your fingers in your lap.\r<br />\n\r<br />\nIn addition to gestures, the headset will support hand movements such as air typing, though it doesn't seem like those who have received a demo have been able to try this feature as of yet. Gestures will work together, of course, and to do something like create a drawing, you'll look at a spot on the canvas, select a brush with your hand, and use a gesture in the air to draw. If you look elsewhere, you'll be able to move the cursor immediately to where you're looking.\r<br />\n\r<br />\nWhile these are the six main system gestures that Apple has described, developers can create custom gestures for their apps that will perform other actions. Developers will need to make sure custom gestures are distinct from the system gestures or common hand movements that people might use, and that the gestures can be repeated frequently without hand strain.\r<br />\n\r<br />\nTo supplement hand and eye gestures, Bluetooth keyboards, trackpads, mice, and game controllers can be connected to the headset, and there are also voice-based search and dictation tools.\r<br />\n\r<br />\nMultiple people who have been able to try the Vision Pro have had the same word to describe the control system - intuitive. Apple's designers seem to have created it to work similarly to multitouch gestures on the ‌iPhone‌ and the <a href=\"https://www.macrumors.com/roundup/ipad/\">iPad</a>, and so far, reactions have been positive.\r<br />\n\r<br />\n<em>MacRumors</em> videographer Dan Barbera was able to try out the headset and he was impressed with the controls. You can see his <a href=\"https://www.youtube.com/watch?v=RSeqXeZHjRY\">full overview of his experience on our YouTube channel</a>.<div>Related Roundup: <a href=\"https://www.macrumors.com/roundup/apple-vision-pro/\">Apple Vision Pro</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/apple-vision-pro.209\">Apple Vision Pro</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/08/apple-vision-pro-gestures/\">These Gestures Are How You Control Apple Vision Pro</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/these-gestures-are-how-you-control-apple-vision-pro.2392259/\">Discuss this article</a> in our forums<br /><br />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a2b54fa02de43bad98c553461e29196a547ac3724018943991773e1b05c19fb8","category":"Apple"}