{"title":"470 Reducing crude protein levels with amino acid supplementation in the finishing diets of heavy Duroc sire line pigs: Effects on growth performance and nitrogen balance in males and females","link":"https://academic.oup.com/jas/article/102/Supplement_3/410/7757066?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Nutrition represents 70% of pig production costs, particularly protein; then, decreasing protein costs is of capital importance. Reducing crude protein (CP) contents to levels below recommended whilst supplementing with amino acids (AAs) is an interesting strategy to reduce costs without decreasing production performances with environmental benefits. It has been conducted essentially in lean genotypes during the growth stage. Few studies address heavy genotypes or differences between males and females during the finishing period. Our objective is to study productive performances of heavy [Duroc X (Landrace X Large-White)] male and female pigs during the finishing stage under a 2% CP reduction with crystalline AA supplementation, hypothesizing that both sexes will equally be affected. In total, 60 males and 60 females were used. At 9 wk of age, animals were allotted in split-sex pens (6 pigs/pen, 0.9 m<sup>2</sup>/animal) with water and dry feed ad libitum. At 15 wk of age, when pigs weighed an average of 68 kg, two isoenergetic diets with different CP levels were provided (145 and 125 g CP/kg, control and low-CP) during the last 42 d of fattening, under the ideal protein concept. In the low-CP diet, crystalline AAs were added. Feed intake was measured daily, and animals were weighed every 3 wk to calculate average daily feed intake (ADFI), average daily gain (ADG), feed conversion ratio (FCR) and N balance on d 21 and 42. Data were analyzed using the simple least squares models that included dietary treatment and sex and their interaction as fixed effects with the pen as the experimental unit. At d 21, animals weighed 90 to 95 kg with males being 5 to 6 % heavier (<span>P</span> &lt; 0.01). No significant differences were recorded regarding diet. The same difference (<span>P</span> &lt; 0.001) was recorded at day 42, with males (119-122 kg) being 7.25% heavier than females in both treatments. Males had 16% higher ADGs than females in both treatments (<span>P</span> &lt; 0.0001) No differences were recorded for ADFI as a consequence of sex for both diets. FCRs were higher in females of both nutritional treatments (<span>P</span> &lt; 0.0001). Retained N was 22% greater in males than in females for both dietary treatments. The N efficiency was greater in Low CP males by comparison with low CP females and control males, whereas control CP females had decreased N efficiency compared with all other experimental groups. Results demonstrate that the 20g/kg CP reduction supplemented with AAs can efficiently be used in heavy Duroc sire line genotypes during the finishing phase without a decrease in production parameters with females having poorer growth performances than males, whereas N efficiency was impaired when females had no limiting dietary CP.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a2bb4a63e1a3ac1b6f14ac5a6359fd353412196a459d33856d551f7be10ecda3","category":"Environment"}