{"title":"Evaluating agricultural activity dynamics over the Uttar Pradesh state of India using satellite-based datasets","link":"http://link.springer.com/10.1007/s42965-023-00320-x","date":1725148800000,"content":"<h3>Abstract</h3>\n                    <p>Climate change and anthropogenic activities (changes in rainfall and temperature pattern) activities have significantly affected agricultural activity and crop production. So, studying cropland greenness and crop yield trends is essential to understand their impacts and to ensure food security. The present study attempted to depict the cropland greenness and wheat yield trends in Uttar Pradesh (UP) state, India, during 2001–2019. The Moderate Resolution Imaging Spectroradiometer (MODIS) based Normalised Difference Vegetation Index (NDVI) dataset was used to decipher the cropland greenness trends through the Mann-Kendall (MK) test. Furthermore, the wheat yield dataset from Baghel and Sharma (<span>2022</span>) was used to depict the wheat yield trends using the Thiel-Sen slope test from 2001 to 2019. The study’s results showed that ~ 37.3% (82,041 km<sup>2</sup>) area of the total agricultural land was with positive cropland greenness (NDVI) trend, and 1.67% (3673 km<sup>2</sup>) area was under a negative cropland greenness trend. On the other hand, ~ 8463 km<sup>2</sup> (at 99% significance level) and 160,557 km<sup>2</sup> (90% significance level) area corresponding to the ~ 4% and 73%, respectively, of the total agricultural land has shown positive (increasing) wheat yield trends during 2001–2019. In conclusion, the findings of this study emphasize the need for ongoing monitoring and a comprehensive understanding of cropland greenness and wheat yield trends over different agroclimatic zones. By gaining insights into these trends, policymakers and stakeholders can develop and implement effective mitigation and adaptation strategies to minimize the adverse effects of climate change and anthropogenic activities on agricultural systems.</p>","author":"","siteTitle":"SPRINGER Ecology","siteHash":"1089acfc3d822f13908492f60c57e4969750bab33665a32c6ecd61d1e946f905","entryHash":"a2cb6cb3a9143c546289e9fb99f27cbc56e7fdbaf627091d2b8495fa30fc5015","category":"Environment"}