{"title":"Apple’s ‘Spring Loaded’ event: iPad Pro, AirTag, AirPods, and… iMacs?","link":"https://www.macworld.com/article/343237/apple-spring-loaded-april-2021-event-ipad-pro-airtags-airpods-apple-tv-imac-2.html","date":1618598985000,"content":"\n<div>\n<section><div></div></section><p>Earlier this week, <a href=\"https://www.macworld.com/article/343225/apple-spring-event-april-ipad-pro-airtags-imac-airpods.html\">Apple sent out invitations</a> sporting the tagline ‘Spring Loaded” and teasing an online event streaming at 10 am PT on Tuesday, April 20. We had all but given up on a spring event, so the invitation was something of a surprise. But now that we know it’s coming, what might we see at this event? Here’s everything we expect, hope, and really want to see.</p>\n\n\n\n<h2>Nearly certain</h2>\n\n\n\n<h3>iPad Pro</h3>\n\n\n\n<p>The iPad Pro hasn’t gotten a <em>real</em> update since 2018. Yeah, there was a <a href=\"https://www.macworld.com/article/234174/ipad-pro-2020-review.html\">minor refresh in 2020</a> that added LiDAR, an UltraWide camera, and the A12Z processor (which is just the A12X with an extra GPU core enabled), along with the Magic Keyboard and full-on trackpad support, but a real upgrade for the iPad Pro is long overdue, and it’s the most likely product to be unveiled at this event. </p>\n\n\n\n<p>First things first. The new iPad Pro will probably have an A14X processor. If historical patterns for these “X” processors hold true, it will more or less mirror the M1 in Apple Silicon Macs: an A14 with double the number of high-performance CPU cores and GPU cores, which is crazy fast. Other expected improvements are a camera module that mirrors the one in the iPhone 12 Pro, 5G connectivity in the cellular models, and Thunderbolt support.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/ipad-pro-magic-keyboard.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<p>However, the display might be the biggest upgrade. Apple is expected to make the move to mini LED backlighting at least in the larger 12.9-inch model, which would add dozens of small lighting zones for better contrast, color, and HDR. You can <a href=\"https://www.macworld.com/article/235002/what-is-a-mini-led-display-and-why-do-you-want-it.html\">lear</a><a href=\"https://www.macworld.com/article/235002/what-is-a-mini-led-display-and-why-do-you-want-it.html\">n more about mini LED here</a>, but the upshot is it’s <em>kind of</em> like the Pro Display XDR, but with many more, smaller, LED backlights.</p>\n\n\n\n<h3>Apple Pencil (3rd generation)</h3>\n\n\n\n<p>As several of our readers pointed out, the Spring Loaded invitation was almost certainly drawn on an iPad using an Apple Pencil, but which Apple Pencil is the question. The latest version of the Apple Pencil was released back in 2018, but all it really added was a new wireless charging method. Otherwise, it’s essentially the same as the first-gen (which Apple still sells).</p>\n\n\n\n<p>However, there are persistent rumors that <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.macrumors.com/2021/04/15/apple-pencil-3-again-rumored/&amp;xcust=1-1-343237-0-0-0&amp;sref=https://www.macworld.com/feed\">Apple is working on a new Apple Pencil</a>. We don’t know all that much about it other than it might have a new glossy finish, but it seems likely that Apple would use the Spring Loaded event to launch the new model. We expect it will bring new functionality, better accuracy, and improved latency to take advantage of the new iPad Pro’s display.</p>\n\n\n\n<h3>AirTags</h3>\n\n\n\n<p>We’ve heard rumors of an Apple-produced object tracking device (like Tile) for what feels like <em>ages</em> now, but it looks like this will finally be the event where it arrives. Apple just <a href=\"https://www.macworld.com/article/342763/apple-opens-up-its-find-my-network-to-third-party-devices-no-airtag-needed.html\">updated Find My to support item tracking</a> from third-party manufacturers, so the software layer is in place, the interest is there, and the timing seems perfect for Apple to finally drop its <a href=\"https://www.macworld.com/article/234037/apple-airtags-bluetooth-track-find-my-ultrawide-band-u1-keychain-locate-lost-items.html\">AirTags item trackers</a>.</p>\n\n\n\n<p>We’re just not sure how relevant they’ll be now that any manufacturer can hook up with the Find My network. Rumor says <a href=\"https://www.macworld.com/article/341875/apples-upcoming-airtags-estimated-to-undercut-samsungs-galaxy-smarttags.html\">they’ll cost around $39 each</a> and support Bluetooth LE for coarse location with broad compatibility along with ultra-wideband for precision location mapping using the <a href=\"https://www.macworld.com/article/235016/will-2021-be-the-year-apples-u1-chip-goes-wide.html\">latest iPhones</a>. As far as the design, they’re expected to be stylish and circular but may need separate accessories to attach to things like keys and backpacks.</p>\n\n\n\n<h2>Very possible</h2>\n\n\n\n<h3>Apple TV</h3>\n\n\n\n<p>An updated version of the Apple TV 4K is another product we’ve heard a lot about lately. Such a device would likely be very similar to the Apple TV 4K with an updated processor (the current A10X is rather old by now), and hopefully <a href=\"https://www.macworld.com/article/342131/its-increasingly-likely-that-the-next-apple-tv-will-finally-get-a-new-remote.html\">a new remote</a>. An <a href=\"https://www.macworld.com/article/342629/apple-tv-may-get-120hz-support-before-the-iphone.html\">upgrade to HDMI 2.1</a> is also expected, which would allow for 120Hz output to supported TVs. It will likely cost the same but we wouldn’t be opposed to a price cut.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/apple-tv-siri-remote.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Apple</p></div>\n\n\n\n<h3>AirPods</h3>\n\n\n\n<p>We’ve heard about significant updates to the entry-level AirPods for quite some time now. Colloquially called “AirPods 3” (although there was never an AirPods 2), they are said to have a new design that more closely resembles the <a href=\"https://www.macworld.com/article/233522/airpods-pro-review.html\">AirPods Pro</a>. The most recent rumors suggest that these won’t actually be released until the fall, but as with all Apple rumors, you never really know, and AirPods can (and do) ship at any time.</p>\n\n\n\n<h2>Definitely maybe</h2>\n\n\n\n<h3>Services</h3>\n\n\n\n<p>There’s always a decent chance that Apple will announce some stuff related to its services. While we haven’t heard any solid rumors of <em>new</em> services to be announced, we could hear about updates and new content to existing services. We already got an update to Fitness+ with <a href=\"https://www.macworld.com/article/343446/apple-expands-fitness-with-new-workouts-and-a-new-instructor.html\">new workouts and a new instructor</a>, but at the very least, Apple may re-tread some of its <a href=\"https://www.macworld.com/article/342517/apple-arcade-games-exclusive-policy-shift.html\">recent changes to Apple Arcade</a> and highlight <a href=\"https://www.macworld.com/article/340717/apple-tv-plus-upcoming-shows-future-moves-series-release-dates-film-television.html\">upcoming Apple TV+ content</a>. And we certainly wouldn’t mind getting an update to iCloud, especially now that it’s part of the <a href=\"https://www.macworld.com/article/234604/apple-one-faq.html\">Apple One bundles</a>.</p>\n\n\n\n<h2>Less likely</h2>\n\n\n\n<p>There are several other Apple products rumored to be released this year, but we don’t expect them to be ready to announce on April 20. For example, some non-Pro iPads are due for an update and we hear that both the iPad mini and 10.5-inch iPad have significant redesigns in the works. But we usually hear rumors from parts suppliers and manufacturing partners close to release, and there hasn’t been any of that yet for those iPads. So those will probably be fall releases.</p>\n\n\n\n<p>The MacBook Pro only got an <a href=\"https://www.macworld.com/article/234838/13-inch-macbook-pro-m1-review-amazing-breakthroughs-in-processing-and-battery-performance.html\">Apple Silicon option</a> in the 13-inch model, and Intel-based models are also still available (unlike the MacBook Air, which is now M1-only). Both 14-inch and 16-inch models of the MacBook Pro with Apple Silicon are supposedly on the way, with a new design that has smaller bezels around the display and some other significant design and feature updates. We expect these are likely coming at WWDC or later in the year.</p>\n\n\n\n<div><figure><img src=\"https://b2c-contenthub.com/wp-content/uploads/2021/03/macbook-air-m1.jpg?quality=50&amp;strip=all&amp;w=1024\" /></figure><p>Jason Cross/IDG</p></div>\n\n\n\n<p>The iPhone SE launched last year around this time, but rumors suggest Apple will be keeping the current model around for at least another year. That’s totally fine—the SE has a great processor and still well worth its $399 price tag.</p>\n\n\n\n<h2>Fingers crossed</h2>\n\n\n\n<p>Bloomberg’s Mark Gurman <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://www.youtube.com/watch?v=e6lGR6xDmwk&amp;#038;feature=youtu.be&amp;xcust=1-1-343237-0-0-0&amp;sref=https://www.macworld.com/feed\">said in an interview Friday</a> that the Spring Loaded event will be mostly “iterative, basic stuff,” with one possible exception: the iMac. Gurman’s sources haven’t ruled it out and he admits that “if the iMac does indeed get launched next week, that’s gonna be a big deal.” It’s been about a year since we started hearing about a radical new iMacs in the works, and the spring event could be the perfect time to unveil it. Rumors haven’t discounted it arriving at this event, and it’s the only product we’ve heard about that has any potential wow factor. We’re nearly certain that an <a href=\"https://www.macworld.com/article/340440/a-new-imac-with-apple-silicon-may-be-coming-even-sooner-than-we-think.html\">updated iMac </a>with a bigger screen and a whole new design language is on the way, and the latest <a href=\"https://www.macworld.co.uk/news/macos-big-sur-release-date-3779573/\">macOS 11.3 beta</a> includes potential references to them. It might be a little too early in the year, but Apple has several Macs to launch this year—not to mention updates to the existing M1 Macs—so it can’t release <em>all</em> of them at WWDC. Plus, there might be <a href=\"https://www.macworld.com/article/343414/this-apple-spring-loaded-invite-theory-is-kinda-blowing-our-mind.html\">a clue hiding in the event invite</a>—so you never know.</p>\n</div>","author":"Jason Cross","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a2cd2057d5e82349e662f79e773420f31069d564e8eccbf0b2a0398721d69dff","category":"Apple"}