{"title":"AirTag Anti-Stalking Measures 'Just Aren't Sufficient' Says Washington Post Report","link":"https://www.macrumors.com/2021/05/05/airtags-anti-stalking-measures-not-sufficient/","date":1620263014000,"content":"The safeguards that Apple built into <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a> to prevent them from being used to track someone \"just aren't sufficient,\" <em><a href=\"https://www.washingtonpost.com/technology/2021/05/05/apple-airtags-stalking/\">The Washington Post</a></em>'s Geoffrey Fowler said today in a report investigating how ‌AirTags‌ can be used for covert stalking.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/05/airtag-1.jpg\" />\r\n<br />\r\nFowler planted an AirTag on himself and teamed up with a colleague to be pretend stalked, and he came to the conclusion that the ‌AirTags‌ are a \"new means of inexpensive, effective stalking.\"\r\n<br />\r\n\r\n<br />\r\nApple's safeguards include <a href=\"https://www.macrumors.com/2021/04/30/airtag-privacy-alert-trigger-arriving-home/\">privacy alerts</a> to let <a href=\"https://www.macrumors.com/guide/iphone/\">iPhone</a> users know that an unknown AirTag is traveling with them and may be in their belongings, along with regular sound alerts when an AirTag has been separated from its owner for three days.\r\n<br />\r\n\r\n<br />\r\nFowler said that over a week of tracking, he received alerts both from the hidden AirTag and from his ‌iPhone‌. After three days, the AirTag being used to stalk Fowler played a sound, but it was \"just 15 seconds of light chirping\" that measured in at about 60 decibels. It played for 15 seconds at a time, went silent for several hours, then chirped for another 15 seconds, and it was easy to muffle by applying pressure to the top of the AirTag.\r\n<br />\r\n\r\n<br />\r\nThe three-day countdown timer resets after it comes in contact with the owner's ‌iPhone‌, so if the person being stalked lives with their stalker, the sound might not ever activate.\r\n<br />\r\n\r\n<br />\r\n<img src=\"https://images.macrumors.com/article-new/2021/04/airtag-privacy-alert.jpg\" />\r\n<br />\r\nFowler also received regular alerts about an unknown AirTag moving with him from his ‌iPhone‌, but pointed out those alerts aren't available to Android users. He also said that Apple does not provide enough help locating a nearby AirTag since it can only be tracked by sound, a feature that didn't often work.<blockquote>I got multiple alerts: from the hidden AirTag and on my ‌iPhone‌. But it wasn't hard to find ways an abusive partner could circumvent Apple's systems. To name one: The audible alarm only rang after three days -- and then it turned out to be just 15 seconds of light chirping. And another: While an ‌iPhone‌ alerted me that an unknown AirTag was moving with me, similar warnings aren't available for the roughly half of Americans who use Android phones.</blockquote>The planted AirTag on Fowler kept his colleague well-updated with his location information, updating once every few minutes with a range of around half a block. While Fowler was at home, the AirTag reported his exact location, all using his own devices thanks to Apple's <a href=\"https://www.macrumors.com/guide/find-my-network-accessory-program/\">Find My</a> network.\r\n<br />\r\n\r\n<br />\r\nThe ‌Find My‌ network is designed to make it easier to find a lost Apple device or item attached to an AirTag by utilizing hundreds of millions of active Apple products around the world. If you lose an AirTag and someone else's device picks it up, the lost AirTag's location is relayed back to you, and this also applies to ‌AirTags‌ tracking people.\r\n<br />\r\n\r\n<br />\r\nApple's vice president of ‌iPhone‌ marketing Kaiann Drance told <em>The Washington Post</em> that the safeguards built into the ‌AirTags‌ are an \"industry-first, strong set of proactive deterrents.\" She went on to explain that ‌AirTags‌ anti-tracking measures can be bolstered over time. \"It's a smart and tunable system, and we can continue improving the logic and timing so that we can improve the set of deterrents.\"\r\n<br />\r\n\r\n<br />\r\nShe also commented on some of the safeguards. Apple chose a three day timeline before an AirTag starts playing a sound because the company \"wanted to balance how these alerts are going off in the environment as well as the unwanted tracking.\" Drance declined to say whether Apple had consulted domestic abuse experts when creating the ‌AirTags‌, but she said that Apple is \"open to hearing anything from those organizations.\"\r\n<br />\r\n\r\n<br />\r\nFowler admits that Apple has done more to prevent ‌AirTags‌ from being used for stalking than other Bluetooth tracking device competitors like Tile, but there are still concerns that need to be addressed. Fowler's full report that goes into more detail on how he mimicked being stalked and the shortcomings that he found in the ‌AirTags‌ can be found over at <em><a href=\"https://www.washingtonpost.com/technology/2021/05/05/apple-airtags-stalking/\">The Washington Post</a></em>.<div>Tag: <a href=\"https://www.macrumors.com/guide/airtags/\">AirTags</a></div><div>Related Forum: <a href=\"https://forums.macrumors.com/forums/airtags.232\">AirTags</a></div><br />This article, \"<a href=\"https://www.macrumors.com/2021/05/05/airtags-anti-stalking-measures-not-sufficient/\">AirTag Anti-Stalking Measures 'Just Aren't Sufficient' Says Washington Post Report</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/airtag-anti-stalking-measures-just-arent-sufficient-says-washington-post-report.2295003/\">Discuss this article</a> in our forums<br /><br /><div>\r\n<a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jvEko8ZP3r8:qoLqg_FUuCc:6W8y8wAjSf4\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=6W8y8wAjSf4\" /></a> <a href=\"http://feeds.macrumors.com/~ff/MacRumors-All?a=jvEko8ZP3r8:qoLqg_FUuCc:qj6IDK7rITs\"><img src=\"http://feeds.feedburner.com/~ff/MacRumors-All?d=qj6IDK7rITs\" /></a>\r\n</div><img src=\"http://feeds.feedburner.com/~r/MacRumors-All/~4/jvEko8ZP3r8\" />","author":"Juli Clover","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a2ec4cb65237e25fe7a2a72b9247bf70e5c7ddd95a4bc495bf22495b845e983f","category":"Apple"}