{"title":"Identification of Anastatica hierochuntica L. Methanolic Leaves Extract-Derived Metabolites Exhibiting Xanthine Oxidase Inhibitory Activities: In Vitro and in Silico Approaches","link":"https://www.preprints.org/manuscript/202405.1500/v1","date":1716454382000,"content":"There is growing interest in the discovery of novel xanthine oxidase inhibitors for gout prevention and treatment with fewer side effects. This study aimed to identify the xanthine oxidase (XO) inhibitory potential and drug-likeness of the metabolites present in the methanolic leaves extract of Anastatica (A.) hierochuntica L. using in vitro and in silico models. The extract-derived metabolites were identified by liquid chromatography-quadrupole time-of-flight mass spectrometry (LC-QTOF-MS). Molecular docking predicted the XO inhibitory activity of the identified metabolites and validated the best scored in vitro XO inhibitory activities for experimental verification as well as predictions of their anticancer, pharmacokinetic and toxic properties, oral bioavailability, and endocrine disruption using SwissADMET, PASS, ProTox-II and Endocrine Disruptome web servers. A total of 12 metabolites with a majority of flavonoids were identified. Rutin, quercetin and luteolin flavonoids demonstrated the highest ranked docking score of -12.39, -11.15 and -10.43, respectively, while the half-maximal inhibitory concentration (IC50) values of these metabolites against XO activity were 11.35 µM, 11.1 µM and 21.58 µM, respectively. In addition, SwissADMET generated data related to physicochemical properties and drug-likeness of the metabolites. Similarly, PASS, ProTox-II and Endocrine Disruptome prediction models stated the safe and potential use of these natural compounds. However, in vivo studies are necessary to support the development of prominent and promising therapeutic use of A. hierochuntica methanolic leaves extract-derived metabolites as XO inhibitors for the prevention and treatment of hyperuricemic and gout patients. Furthermore, the predicted findings of the present study open a new paradigm for these extract-derived metabolites by revealing novel oncogenic targets for the potential treatment of human malignancies.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a2f633c8fbc91a647e1a064f723dbe6d68c5919bcf860f3592baa520723308f0","category":"Interdisciplinary"}