{"title":"Narrowed gene functions and enhanced transposon activity are associated with high tolerance to ocean acidification in a juvenile subarctic crustacean","link":"https://journals.plos.org/climate/article?id=10.1371/journal.pclm.0000319","date":1711634400000,"content":"<p>by Laura H. Spencer, William Christopher Long, Ingrid B. Spies, Krista M. Nichols, Robert J. Foy</p>\r\n\r\nOcean acidification (OA) threatens marine crustaceans, particularly those at high latitudes where conditions are rapidly changing. Red king crab (RKC) support important fisheries in Alaskan waters. RKC early life stages are sensitive to OA when exposure occurs as embryos and juveniles. However, in a supporting study, RKC were surprisingly tolerant of varying OA conditions (pH 7.5, 7.8, &amp; 8.0) when reared long-term from larval hatching to the first crab stage (C1). Here, we examined gene expression in the C1 juveniles to characterize transcriptional activity of these OA-tolerant crabs. Expression of nearly half of all genes (44%) correlated with OA treatment, suggesting a strong molecular response to OA, contrary to the phenotypic results. Downregulated functions were numerous in response to OA, and included reduced energy production, biosynthesis, immune function, and notably lipid and carbohydrate metabolic processes, which suggest a shift in metabolic strategy to protein catabolism, possibly to reduce CO<sub>2</sub> production and facilitate acid/base regulation. Only a handful of functions were enriched in OA-induced genes, which were related to transcription regulation, control of growth and cell death, and signaling activity. Transposon activity was high in OA-reared crab, many of which were upregulated at consistent levels, suggesting that transposon mobilization may be a component of the RKC OA-response system. Genetic composition did not differ among OA treatments indicating that transcriptional differences in OA-reared crab were more likely attributed to phenotypic plasticity than selective mortality. Our results suggest that OA-reared RKC have a narrowed, possibly optimized, set of gene functions that enables OA-tolerance through the early juvenile stage. OA-exposure from hatch may benefit RKC and related species by “hardening” them against OA through physiological reprogramming. Future studies should test OA-hardened crabs in additional challenges, as metabolic and immune limitations may ultimately make them more vulnerable to infection or secondary stressors.","author":"Laura H. Spencer","siteTitle":"PLOS Climate","siteHash":"ab511bb583c9cc103fc6bd74737f07eb1311e1e62c758b30431d090c3da71072","entryHash":"a305b67e5e0a2897b6cd64735025dc01899fa50cbf39389260b8a4a3f4934bb2","category":"Environment"}