{"title":"221 Impact of parity on stall use in free access stall systems","link":"https://academic.oup.com/jas/article/102/Supplement_2/223/7664945?rss=1","date":1714780800000,"content":"<span><div>Abstract</div>Consumer pressure is leading producers to transition to gestational group-housing systems. One such system, free access stalls, allows the unique opportunity to investigate the preference of the animal for individual or group-housing. The objective of this study was to describe stall use by gestating gilts and parity 1 (P1) sows in a free access stall system. A gilt pen and a P1 pen, each with 8 stalls and 1 pig allocated per stall space (n = 16 total), were used for this study. Pigs were locked in the stalls 5 d before mixing (30 dg) to allow acclimation to the new pen environment and feeding schedule. On the day of mixing, females were moved out of their stalls at noon and continuous overhead video was captured for 72h post-mixing. To characterize stall use, videos were manually decoded sows time of entry into and exit from stalls. Time spent in stalls was analyzed using a Gaussian linear mixed model with fixed effects of parity, day, interaction between parity and day, and a random effect of individual animal. On average gilts spent significantly more time in stalls compared with P1 sows (20.9 h vs 16.4 h, <span>P</span> = 0.050). Overall, there was no change in stall utilization over the 3 d post-mixing but there was a significant interaction of parity and day (<span>P</span> = 0.008). On d 1, time spent in stalls did not differ between gilts and P1s (<span>P</span> = 0.743). However, on d 2 and 3 we observed significant differences between parities, with P1 sows spending less time in stalls than gilts (<span>P</span> = 0.032, <span>P</span> = 0.004, respectively). In conclusion, gestating females spent more time in stalls than in loafing areas. Ongoing research will explore how gestating females use their time in each space. The observed parity differences may suggest that P1 sows adapt more quickly to group housing systems compared with gilts.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a3097e90cd6f70d4fbab5026a435b978f40545ac098442b7edba190b4e4bbafa","category":"Environment"}