{"title":"Exploring the Relationship between Melioidosis Morbidity Rate and Local Environmental Indicators Using Remotely Sensed Data","link":"https://www.preprints.org/manuscript/202404.0446/v1","date":1712319674000,"content":"Melioidosis is an endemic infectious disease caused by Burkholderia pseudomallei bacteria, which contaminates soil and water. To better understand the environmental changes that have contributed to melioidosis outbreaks, this study used spatiotemporal analyses to clarify the distribution pattern of melioidosis and the relationship between melioidosis morbidity rate and local environmental indicators (land surface temperature, normalised difference vegetation index, normalised difference water index) and rainfall. A retrospective study was conducted from January 2013 to December 2022, covering data from 219 sub-districts, with each exhibiting varying morbidity rate of melioidosis on a monthly basis. Spatial autocorrelation was determined using local Moran’s I, and the relationship between melioidosis morbidity rate and the environmental indicators was evaluated using geographically weighted Poisson regression. The results revealed clustered spatiotemporal patterns of melioidosis morbidity rate across sub-districts, with hotspots predominantly observed in the northern region. Furthermore, we observed a range of coefficients for the environmental indicators, varying from negative to positive, which provided insights into their relative contributions to melioidosis in each local area and month. These findings highlight the presence of spatial heterogeneity driven by environmental indicators and underscore the importance of public health offices implementing targeted monitoring and surveillance strategies for melioidosis in different locations.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a30ad3a0ae93c76d89fc518dd8858d9952b2407bc083795f3d1eb16cd62ec901","category":"Interdisciplinary"}