{"title":"First state-level look at long COVID reveals the seven hardest-hit states","link":"https://arstechnica.com/?p=2003697","date":1708025384000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1998844745-800x533.jpeg\" alt=\"A woman with Long COVID who is completely bedridden, requiring the use of a wheelchair to move between rooms of her home. \" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/02/GettyImages-1998844745.jpeg\">Enlarge</a> <span>/</span> A woman with Long COVID who is completely bedridden, requiring the use of a wheelchair to move between rooms of her home.  (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/fran-haddock-and-dan-kenny-met-while-studying-vetinary-news-photo/1998844745?adppopup=true\">Getty | Rhiannon Adam</a>)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Over four years after SARS-CoV-2's debut, researchers still struggle to understand long COVID, including the ostensibly simple question of how many people have it. Estimates for its prevalence vary widely, based on different study methods and definitions of the condition. Now, for the first time, the Centers for Disease Control and Prevention has attempted to estimate its prevalence among adults in each US state and territory. The results again show a wide range of prevalence estimates while revealing the states that were hardest hit as well as those that seem relatively spared.</p>\n<p>Overall, the CDC found that seven states in the South, West, and Midwest had the highest prevalence of long COVID in the country, between 8.9 percent and 10.6 percent: Alabama, Montana, North Dakota, Oklahoma, Tennessee, Wyoming, and, the state with the highest prevalence of 10.6 percent, West Virginia. The results are published today in the <a href=\"https://www.cdc.gov/mmwr/volumes/73/wr/mm7306a4.htm\">CDC's Morbidity and Mortality Weekly Report</a>.</p>\n<p>On the other end of the spectrum, New England states, Washington, and Oregon had lower prevalence rates, between 3.7 percent and 5.3 percent. The lowest rate was seen in the US Virgin Islands with 1.9 percent. Washington, DC, and Guam had ranges between 1.9 percent and 3.6 percent.</p></div><p><a href=\"https://arstechnica.com/?p=2003697#p3\">Read 3 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=2003697&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a313246cf85b211fa3394a1b736bdc652c06805600ef595d4625cbaef42514b2","category":"Tech"}