{"title":"Harnessing the Power of Communication and Behavior Science to Enhance Society's Response to Climate Change","link":"https://new.annurev.org/content/journals/10.1146/annurev-earth-031621-114417?TRACK=RSS","date":1685491200000,"content":"<div><p>A science-based understanding of climate change and potential mitigation and adaptation options can provide decision makers with important guidance in making decisions about how best to respond to the many challenges inherent in climate change. In this review we provide an evidence-based heuristic for guiding efforts to share science-based information about climate change with decision makers and the public at large. Well-informed decision makers are likely to make better decisions, but for a range of reasons, their inclinations to act on their decisions are not always realized into effective actions. We therefore also provide a second evidence-based heuristic for helping people and organizations change their climate change–relevant behaviors, should they decide to. These two guiding heuristics can help scientists and others harness the power of communication and behavior science in service of enhancing society's response to climate change.\n</p><ul>\n<li><span>▪ \n</span>Many Earth scientists seeking to contribute to the climate science translation process feel frustrated by the inadequacy of the societal response.\n</li>\n<li><span>▪ \n</span>Here we summarize the social science literature by offering two guiding principles to guide communication and behavior change efforts.\n</li>\n<li><span>▪ \n</span>To improve public understanding, we recommend simple, clear messages, repeated often, by a variety of trusted and caring messengers.\n</li>\n<li><span>▪ \n</span>To encourage uptake of useful behaviors, we recommend making the behaviors easy, fun, and popular.\n</li>\n</ul><p></p></div>","author":"Edward W. Maibach, Sri Saahitya Uppalapati, Margaret Orr and Jagadish Thaker","siteTitle":"Annual Reviews: Annual Review of Earth and Planetary Sciences: Table of Contents","siteHash":"3673234039065d61c10e2c644135584372f7dd9be183427347ecf8d080bad075","entryHash":"a320677e6d37bc1cf95f14f9f2792f849b450d1080080709cee5365691b45c2b","category":"Environment"}