{"title":"Prospects of Quantum Dots for Photodetection in LIGO and Other Interferometric Gravitational Experiments","link":"https://www.preprints.org/manuscript/202408.0181/v1","date":1722827616000,"content":"Quantum dots are semiconductor Nano-structures with Optical or photoelectric properties and Quantum mechanical properties such as Quantum confinement due to the Nano-scale size of the molecular structure where Quantum mechanical effects are dominant. Because of its Optical properties Quantum dots have found applications in the development of future Solar cells and Photovoltaic detectors. The developments of these Solar cells and detectors are made possible through the use of Spray-coated layering of colloidal solutions containing the quantum dots forming what can be regard as thin quantum dot films, of which the compound thickness of all the layers is in nanometers. These quantum dots are capable of detecting a very wide range of electromagnetic frequencies and even single photon sources with very fast response time overall promising enhanced sensitivity. The features of quantum dots films gives them desirable advantages for detecting minute phase changes in Laser interferometric observatories such as LIGO which was designed and developed to detect gravitational waves coming from distant astrophysical sources. However the detection of low frequency gravitational waves with longer wavelength and those of much lower amplitudes have been rather elusive even with the high sensitivity of LIGO, as its usual Photodetector may not be sensitive to the interferometric phase changes due to gravitational waves of longer wavelengths and low amplitudes. As a potential means of improving phase change detection in LIGO, the use of quantum dots as photodetectors is conceptually proposed exploiting the fast reaction times and its sensitivity to wider range of frequencies. Whether it detects the interferometric phase changes induced by subtle amplitude or low frequency gravitational waves or not, it still promises an improvement to the detection capabilities of LIGO. Other interferometric gravitational experiments can also be performed, such as interferometric detection of Phase difference due to gravitational time dilation, using two laboratory interferometers one of which is positioned at sea level and the other at much higher altitude leading to a difference in gravitational potential. Together with the use of Quantum dot films as Photo-detectors one can detect the small interferometric phase difference between both interferometers due to Gravitational time dilation at different altitudes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a3209055c4f208688c3494f2c2532eb9b59bf08d8cd814668af0b32c13f0e301","category":"Interdisciplinary"}