{"title":"Rising star Aleksandr Vlasov will join Bora-Hansgrohe next season","link":"https://cyclingtips.com/2021/08/rising-star-aleksandr-vlasov-will-join-bora-hansgrohe-next-season/","date":1628530341000,"content":"<p></p><div><img src=\"https://cyclingtips.com/wp-content/uploads/2021/08/vlasov1-650x433.jpg\" /></div><h2>Rising star Aleksandr Vlasov will join Bora-Hansgrohe next season</h2><p>\n</p><p>Aleksandr Vlasov is headed to Bora-Hansgrohe next season on a three-year deal after two seasons in the Astana-Premier Tech organization.</p>\n\n\n\n<p>The 25-year-old Russian, who currently sits eighth in the UCI’s World Rankings, has enjoyed plenty of success in his first two years so far at the WorldTour level. He rode to fifth at Tirreno-Adriatico and third at Il Lombardia last year while also taking one-day wins at the Giro dell’Emilia and the inaugural Mont Ventoux Dénivelé Challenge, among other strong results. This year, he nabbed runner-up honors at Paris-Nice, took third at the Tour of the Alps, and then powered to fourth overall at the Giro d’Italia.</p>\n\n\n\n<p>Capable both on the climbs and against the clock, he is set to take on his second Grand Tour of the season at the upcoming Vuelta a España.</p>\n\n\n\n<p>At Bora-Hansgrohe, he will join an ever-improving core of riders who can be in the mix in stage races and climber-friendly one-days. With the likes of Maximilian Schachmann, Emanuel Buchmann, and Wilco Kelderman already on the roster, the team has added Jai Hindley, Sergio Higuita, and now Vlasov this transfer season.</p>\n\n\n\n<p>“Alexandr is certainly one of the biggest talents with respect to stage racing and we’re very pleased that he has decided to join us,” said Bora-Hansgrohe team manager Ralph Denk via a press release.</p>\n\n\n\n<p>“As you know, there was interest from other teams. We will definitely set our sights on the Grand Tours with him. In the medium term, the goal is the Tour de France, yet he still has to learn and develop further, which might be easier at the Giro or Vuelta. Overall, we are now very broadly positioned in terms of GC riders, but that was also our goal. Each rider will receive his chances. I’m confident that we’ll form a great team that will open up tactical possibilities and put us in a position to be right up there.”</p>\n<p></p><a href=\"https://cyclingtips.com/2021/08/rising-star-aleksandr-vlasov-will-join-bora-hansgrohe-next-season/\">Read More</a>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a32ab7748fd51c3b72ca40c88d3ee155ab0493aa7f1e17432d25a58ed0308f8d","category":"Cycling"}