{"title":"Downplaying the Fact That Apple Shot ‘Scary Fast’ With iPhones","link":"https://www.theverge.com/2023/10/31/23940060/apple-event-shot-on-iphone-behind-the-scenes","date":1698798741000,"content":"\n<p>Jess Weatherbed, writing for The Verge under the headline “Here’s What Apple Really Means When It Says ‘Shot on iPhone’”:</p>\n\n<blockquote>\n  <p>It’s a neat way to promote the recording quality of iPhone \ncameras, but it’s not like everyday folks can recreate these kinds \nof results at home unless they happen to own a shedload of \nludicrously expensive equipment. The gear shown in the “Scary \nFast” behind-the-scenes footage is fairly standard for big studio \nproductions, but Apple’s implication with these so-called “shot on \niPhone” promotions is that anyone can do it if only they buy the \nnewest iPhone. </p>\n</blockquote>\n\n<p>I saw a few folks mocking Apple for this on Mastodon and Threads, too. This is ridiculous. Do these people think that previous Apple keynote films were shot with just a single camera person wielding something like a $40K RED cinema camera and no crew, no lighting, no cranes? That the iPhone “needs help” that traditional cinema cameras do not? I mean, guess what, they used professional microphones too.</p>\n\n<p>The whole point is that an iPhone 15 Pro camera is so good that it can fit right in on a high-budget commercial film shoot, and produce world-class results. There’s no implication that a casual user can get results like this by just hitting the shutter button in the iPhone Camera app. That’s why Apple made an entire <a href=\"https://daringfireball.net/linked/2023/10/31/behind-the-scenes-at-scary-fast\">behind-the-scenes documentary</a>! To show us what it takes to make something look this good.</p>\n\n<p>Why be so cynical? What Apple has accomplished here is extraordinary. They shot a 30-minute film using the same phone cameras they sell to hundreds of millions of people around the world, and the footage looked so good that <em>no one could tell it was shot using iPhones until they told us so</em>.</p>\n\n<div>\n<a href=\"https://daringfireball.net/linked/2023/10/31/downplaying-shot-on-iphone\"> ★ </a>\n</div>\n\n\t","author":"John Gruber","siteTitle":"Daring Fireball","siteHash":"fc569638025dadf22a867470f8215f38855cf50e975782a6c989909474292a36","entryHash":"a33b7f3c6e5d7cb5fd46605a33c2cc40283710a3ad6e9a75377da66117a03a00","category":"Tech"}