{"title":"PSXI-16 Using a multi-omics approach to decipher trans-10 shift biomarkers in ruminants","link":"https://academic.oup.com/jas/article/102/Supplement_3/774/7757903?rss=1","date":1726272000000,"content":"<span><div>Abstract</div>The trans-10 shift is a recognized deviation from the normal ruminal biohydrogenation (BH) pathways of the dietary polyunsaturated fatty acids (FA) in the rumen. This phenomenon leads to the formation of the harmful t10-18:1, which is detrimental to the health of the animal, instead of the beneficial t11-18:1, which has positive effects. The phenomenon known as the t10-shift has been observed in animals consuming diets that are high in starch but low in forage. Although consuming such similar diets, there exists a significant variability in t10-shift expression among animals. The reasons behind the t10-shift are not well understood. With the aim of finding biomarkers associated with t10-shift, this study utilized multiple levels of information, including lipidomics, metabolomics, and proteomics of ruminal contents. Rumen contents from male lambs (n = 16) distributed by two diets with distinct forage:concentrate ratios (20:80 and 80:20) were collected after 42 d on ad libitum feed. FA from rumen contents were prepared and analyzed by gas chromatography, metaproteomics analyzes were performed from rumen bacterial pellets using LC-MS/MS-based label-free quantification, and metabolomics analyzes were performed from rumen fluid supernatants using IMS-TOF technology. Multivariate analyses and correlations were performed using the Metaboanalyst R package. Several fatty acids, proteins, and metabolites showed a strong correlation with the proportion of t10-18:1 in rumen contents. Among fatty acids, 17:0, 14:0, a-15:0, and t15-18:1 were positively correlated, while t11-18:1, t11,c13-CLA and c9,t11-CLA showed negative correlation. The metabolites, thiamine aldehyde, mevinolinic acid, 2-hydroxy-2H-benzo[h]chromene-2-carboxylate, or biotin were positively correlated with t10-18:1, as well as proteins associated with gluconeogenesis, stress response or amino acid metabolism. This work provides, for the first time, a multi-level integrated view of t10-shift phenomena in sheep. Fundação para a Ciência e a Tecnologia (FCT) provided financial support through the research projects PTDC/CAL-ZOO/29654/2017 (RumOmics), PTDC/CAL-ZOO/4515/2021 (Gene2Rumen), UIDB/00276/2020 (CIISA), UIDB/04129/2020 (LEAF), and LA/P/0059/2020 (AL4Animals).</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a342b91adf606427071727679f2f83993dd24d099e525b6fe82fe9036cd26d77","category":"Environment"}