{"title":"Comparative analysis of the nutrient components in the muscle and skin tissues of hybrid sturgeon (Acipenser baerii ♀ × Acipenser schrenckii ♂) of different sizes","link":"https://onlinelibrary.wiley.com/doi/10.1111/are.16086?af=R","date":1667394512000,"content":"<h2>Abstract</h2>\n<p>The nutritional quality of muscle and skin tissues of hybrid sturgeon of different sizes, 1500.05 ± 1.50 g, 3002.25 ± 2.55 g and 4505.25 ± 4.15 g, were systematically studied to provide basic data for the processing and efficient use of hybrid sturgeon. The results showed that in hybrid sturgeon weighing 3002.25 ± 2.55 g, the muscle and skin accounted for the highest proportion of body weight. With increasing body mass, essential amino acids (EAAs), umami amino acids (UAAs) and total amino acids in each group first increased and then decreased, with the middle-sized hybrid sturgeon showing the highest levels. The concentrations of fatty acids detected from the muscle and skin were the same among hybrid sturgeon of different weights, linolenic acid, DHA and linoleic acid were the top three polyunsaturated fatty acids in muscle and skin. In the muscle tissue of the three weight classes of hybrid sturgeon, the contents of Na, Mg and K ranked as the top three essential mineral elements, and the measured essential mineral elements all first increased and then decreased with increasing body mass. The mineral elements with the highest content in skin were Mg, Na and K. The content of mineral elements in skin was higher than that in muscle. The contents of Cr, Pb and Cd in the muscles and skin of the three weight classes of hybrid sturgeon were within the national standards. The results showed that the muscle nutritional quality of the medium-sized hybrid sturgeon was the best.</p>","author":"Quansen Xie, \nYiran Liu","siteTitle":"Wiley: Aquaculture Research: Table of Contents","siteHash":"cda0a545b1dc6c99e9df3430a4cdd52070596f30f0a34f537ad0a3d28cdc2bfc","entryHash":"a35c0a9efafe23bc5850b5a09b282599a2de48b30753915f61a56018d22b7045","category":"Environment"}