{"title":"Silca releases $175 3D-printed titanium computer mount","link":"https://www.bikeradar.com/news/silca-mensola/","date":1621346430000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/05/Silca-Mensola-computer-mount-5eda21d.jpg?quality=90&amp;resize=620,413\" />                                            <p>Silca has released a £175 / $175 3D-printed titanium <a href=\"https://www.bikeradar.com/advice/buyers-guides/best-bike-computers/\">bike computer</a> mount that integrates with a wide variety of stem faceplates, doing away with band-on bar clamps.</p>\n<p>Made from 6Al/4V titanium and shipping with matching titanium bolts, the Mensola computer mount is Silca’s first 3D-printed bicycle accessory, having invested in the machinery to print titanium at the end of 2020 and spent the first half of this year developing accessories.</p>\n<p>Additive titanium printing has been around for a while in the world of cycling, with many brands exploring the manufacturing technology, including <a href=\"https://www.bikeradar.com/features/pinarello-to-offer-custom-3d-printed-titanium-cockpit-as-used-by-froome/\">MOST printing one-piece titanium cockpits</a> and Australian company <a href=\"https://www.bikeradar.com/news/bastion-3d-printed-argon-18-sprint-stem/\">Bastion cycles producing stems and cranks</a>.</p>\n<p>If you know anything about 3D-printed titanium – or indeed MOST and Bastion – you might be able to guess what comes next. The Mensola comes with an impressive price tag. At £175 / $175 it is possibly the most expensive computer mount on the market.</p>\n<h2>Why has Silca 3D printed a computer mount?</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The computer integrates into the faceplate of a number of stems.</span></figcaption><span> <i>Silca</i></span></div>\n<p>Silca says 3D printing has freed it from the constraints of CNC machining and the limitations of metal billet sizes.</p>\n<p>This means it has been able to develop over a dozen different versions of the Mensola, making it compatible with a wide range of stem faceplates and opens up the possibility of print to order manufacturing and customisation.</p>\n<p>Being freed from the constraints of traditional manufacture also opens up new design possibilities.</p>\n<p>Silca looked to architecture and aerospace engineering when deciding on a design for the Mensola. The result is a “stressed skin design”, which features two external layers joined together with internal truss elements. This allows Silca to use the minimal amount of material required.</p>\n<p>This structural design results in the Mensola being a claimed six to 12 times stronger than aluminium mounts manufactured by CNC techniques, and 10 to 15 per cent lighter too with a claimed weight of between 27 to 35g depending on the version.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Mensola is claimed to be aerodynamically efficient.</span></figcaption><span> <i>Silca</i></span></div>\n<p>Silca says “the stressed skin also allows for aerodynamic design elements to be used resulting in reduced drag coefficient compared to previous designs.”</p>\n<p>We haven’t seen any stats or comparisons that back this up yet, and any aerodynamic advantage offered by the mount is likely to be (very) modest, but the Mensola certainly looks the part.</p>\n<p>3D printing results in less waste than traditional manufacture because only the required amount of material is used instead of material being cut away from a larger block of metal, so Silca is keen to point out the environmental benefits of the process too.</p>\n<p>The cycling computer mount features an adaptable, single-bolt puck that rotates 90 degrees to fit either a Wahoo or <a href=\"https://www.bikeradar.com/advice/buyers-guides/garmin-edge-bike-computers-buyers-guide-to-all-the-models/\" target=\"_blank\">Garmin bike computer</a>.</p>\n<p>Currently, the mount is only available in one length, but Silca says it is roomy enough to fit even the larger <a href=\"https://www.bikeradar.com/reviews/training/gps-computers/gps-devices/garmin-edge-1030-plus-review/\">Garmin Edge 1030 Plus</a>.</p>","author":"Stan Portus","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a362ea97989105b0c4640a1941a8397ee051ab5bc56a1136ddd4f4afef32cf62","category":"Cycling"}