{"title":"Identification of risk factors and establishment of prediction models for mortality risk in patients with acute kidney injury: A retrospective cohort study","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0312482","date":1729692000000,"content":"<p>by Shengtao Li, Zhanzhan Li, Yanyan Li</p>\r\n\r\nThis study investigated factors influencing death in patients with Acute Kidney Injury (AKI) and developed models to predict their mortality risk. We analyzed data from 1079 AKI patients admitted to Changsha First Hospital using a retrospective design. Patient information including demographics, medical history, lab results, and treatments were collected. Logistic regression models were built to identify risk factors and predict 90-day and 1-year mortality. The 90-day mortality rate among 1079 AKI patients was 13.8% (149/1079) and the one-year mortality rate was 14.8% (160/1079). For both 90-day and 1-year mortality in patients with AKI, age over 60, anemia, hypotension, organ failure, and an admission Scr level above 682.3 μmol/L were identified as independent risk factors through multivariate logistic regression analysis. Additionally, mechanical ventilation was associated with an increased risk of death at one year. To ensure the generalizability of the models, we employed a robust 5-fold cross-validation technique. Both the 90-day and 1-year mortality models achieved good performance, with area under the curve (AUC) values exceeding 0.8 in the training set. Importantly, the AUC values in the validation set (0.828 for 90-day and 0.796 for 1-year) confirmed that the models’ accuracy holds true for unseen data. Additionally, calibration plots and decision curves supported the models’ usefulness in predicting patient outcomes. The logistic regression models built using these factors effectively predicted 90-day and 1-year mortality risk. These findings can provide valuable insights for clinical risk management in AKI patients.","author":"Shengtao Li","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a365980029468dab3738d79fcbd4992eab534b136213bdc52abc0bbf57858d16","category":"Interdisciplinary"}