{"title":"Health workers get panic buttons as COVID deniers get violent","link":"https://arstechnica.com/?p=1799538","date":1632956981000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1234454758-800x533.jpeg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/09/GettyImages-1234454758.jpeg\">Enlarge</a> <span>/</span> A health care worker treats a patient inside a negative pressure room in the COVID-19 intensive care unit at Freeman Hospital West in Joplin, Missouri, on Tuesday, Aug. 3, 2021. (credit: <a href=\"https://www.gettyimages.com/detail/news-photo/healthcare-worker-treats-a-patient-inside-a-negative-news-photo/1234454758?adppopup=true\">Getty | Bloomberg</a>)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>Hospitals in several states are ramping up security and even providing wearable panic buttons to staff amid a wave of violent attacks sparked by COVID-related misinformation, denialists, and conspiracy theorists.</p>\n<p>In a hospital in Branson, Missouri, as many as 400 staff members will have panic buttons added to their identification badges after assaults on staff members tripled amid the pandemic. Assaults rose from 40 in 2019 to 123 in 2020, <a href=\"https://apnews.com/article/coronavirus-pandemic-business-covid-19-pandemic-missouri-springfield-397f9fca72155f35035df85c9f2e0941\">the Associated Press reported</a>. The numbers for 2021 have not been released. When pressed, the panic buttons will immediately alert hospital security and trigger a tracking system to locate the endangered worker.</p>\n<p>Jackie Gatz, vice president of safety and preparedness for the Missouri Hospital Association, told the AP that, in addition to panic buttons, hospitals are also adding extra security cameras and having security personnel wear body cameras. A hospital in Springfield, Missouri, added security dogs, as well as panic buttons. Gatz noted that staff are also receiving training on de-escalation and physical protection tactics, such as keeping a hospital bed between a nurse and an agitated person.</p></div><p><a href=\"https://arstechnica.com/?p=1799538#p3\">Read 7 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1799538&amp;comments=1\">Comments</a></p>","author":"Beth Mole","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a3677aa5f26439cbe2da16a2b802c5fb8a34d52554a1cedbe6556980595172f3","category":"Tech"}