{"title":"Google just showed Apple what it needs to plant inside its walled garden","link":"https://www.macworld.com/article/1817011/google-apple-generative-ai-messages-photos-mail.html","date":1683803700000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Google wrapped up another I/O keynote and we heard a lot of what we expected to: there are several new Pixel devices, a dig at Apple for <a href=\"https://www.macworld.com/article/606152/imessage-green-bubbles-sms-rcs-reactions.html\">not supporting RCS</a> (can’t say we disagree there), and a massive focus on AI.</p>\n\n\n\n<p>It wasn’t just AI taking the stage at Google’s event, but <em>generative</em> AI. It’s an annoying name but an important distinction. <a href=\"https://www.macworld.com/article/1507282/generative-ai-chatgpt-midjourney-bard-bing-siri.html\">Generative AI</a> is that which creates new stuff, rather than simply analyzing and adjusting what already exists. DALL·E and Stable Diffusion create new artwork from a text prompt, they don’t just tweak the exposure and sharpen up an image you supply. Chatbots such as ChatGPT and Bard answer questions and perform tasks by making new text. There is AI that makes new music from a simple description, write code, or synthesize voices that sound like real people.</p>\n\n\n\n<p>When asked about AI at Apple’s recent quarterly results meetings, Tim Cook said, “I do think it’s very important to be deliberate and thoughtful in how you approach these things. And there are a number of issues that need to be sorted, but the potential is certainly very interesting.”</p>\n\n\n\n<p>The CEO’s statement could be viewed as the typical caution Apple employs in bringing new and potentially dangerous products to market, or as cover for appearing to be light years behind the rest of the tech sector in one of the most exciting and revolutionary advances of our time. Either way, it’s clear that Apple’s walled garden approach, with its ecosystem of self-made apps and services, is going to need an AI strategy that includes <em>generative</em> AI, and fast.</p>\n\n\n\n<h2>AI is pervasive at Apple</h2>\n\n\n\n<p>Yeah, AI is everywhere at Apple. Every Apple-made chip of the last several years (except for the Apple Watch processor) has a Neural Engine built in to accelerate the Machine Learning code used in AI tools and applications so they can run on devices in a power-efficient and privacy-protecting way.</p>\n\n\n\n<p>AI translates your speed into text, massages a bunch of different camera exposures into a single superior image, stabilizes video, identifies objects and people in your photos, produces a <a href=\"https://www.macworld.com/article/1427242/apple-music-sing.html\">faux-karaoke mode</a> in almost any song you listen to, and lets you copy text out of any image with ease. It’s great stuff, and the company shows no signs of slowing down.</p>\n\n\n\n<p>But none of that is generative AI. That doesn’t make new things where something didn’t exist before. Apple’s got AI-powered Photographic Styles while Google is upgrading Magic Eraser to <a href=\"https://www.pcworld.com/article/1816493/these-three-google-apps-are-gaining-ai-powers.html\">Magic Editor</a>, using a generative AI technique called “inpainting” to let you <em>completely move stuff around in a photo.</em> Apple’s latest Mail feature is “search works now” while Google’s over here <em>writing entire freakin’ emails</em>. </p>\n\n\n\n<h2>Don’t just copy, innovate</h2>\n\n\n\n<p>Obviously, Apple doesn’t need to have everything Google has just because Google has it. Apple doesn’t need to have the same generative AI features to be successful any more than it needs its own ad network or search engine. But where Apple does compete, it needs to be competitive.</p>\n\n\n\n<p>Apple’s approach is to sell hardware, software, and services that are tightly integrated to work together in a holistic ecosystem. <a href=\"https://www.macworld.com/article/817000/how-to-continuity-camera-iphone-webcam-for-your-mac.html\">Use your iPhone as a top-quality wireless webcam</a>. Drag your mouse pointer and keyboard straight <a href=\"https://www.macworld.com/article/609440/how-to-universal-control-mac-ipad-mouse-keyboard-settings.html\">off your Mac desktop and onto your iPad</a>. Messages, Photos, Files, Mail…the things you do and save on one Apple device are synced and available elsewhere.</p>\n\n\n\n<p>The company is heavily invested in keeping users in its ecosystem; the “walled garden” approach so often ascribed to Apple where everything is pleasant, safe, and works great together. Recent filings in the company’s many antitrust cases across the world have shown just how far the company will go to keep its customers in its own ecosystem. If your iPhone isn’t “sticky”–if you don’t <em>lose</em> something going outside the walled garden–you might be tempted by another company’s products.</p>\n\n\n\n<p>As Google and Microsoft start building generative AI into their ecosystems in ways that are powerful, useful, and let’s face it, <em>fun</em>, it’s going to become harder to justify staying within Apple’s walls. </p>\n\n\n\n<p>This doesn’t mean Apple needs to be a copycat to Google or Microsoft’s features. We don’t need a SiriGPT chatbot, or the ability to change your iMessages into the style of Shakespeare. Apple can create and integrate generative AI experiences in its own way.</p>\n\n\n\n<p>I can imagine creative apps like Logic, GarageBand, and Final Cut Pro letting users generate royalty-free background music tracks with AI using just a few words. Podcasters would love it. That #images button in Messages that lets you search for the perfect GIF? What if it could also generate an AI image based on your last few messages or a handful of keywords? Xcode should definitely have code auto-generation and auto-commenting features. What if you could drag the subject out of one photo <em>and into another</em>, with proper lighting and perspective? Or fix the closed eye on that one person who blinked with AI that would draw their open eyes using all your other photos of that person as a reference?</p>\n\n\n\n<p>Apple doesn’t often talk about things it’s working on until they’re ready for release–at least in beta form. So the company could be all-in on adding generative AI experiences to its devices and we wouldn’t know much about it until the downloads are ready. But if not, if Tim Cook’s cautionary words represent a wait-and-see approach the company is going to find that the very foundations of its ecosystem will look obsolete, and the walled garden will feel less like a beautiful and magical place to stay and more like a prison you can’t escape.</p>\n\nApple</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a36d33b99ca21b15e55b199a06bbbdd80027a61f14a040aed6c0b6c841845758","category":"Apple"}