{"title":"252 Evaluating the impact of inclusion of field pea (Pisum sativum) on rumen fermentation profile, production parameters, and composition of rumen bacterial community of dairy cattle","link":"https://academic.oup.com/jas/article/102/Supplement_3/354/7757241?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>Field peas (FP) are characterized by a crude protein (CP) content ranging from 24% to 28% of dry matter (DM). Approximately 78% of this protein is rumen degradable. Hence, FP can be a viable alternative protein source for livestock. We examined the effect of partially substituting corn-based concentrates with FP on production parameters, rumen fermentation profile, and the composition of the rumen bacterial community in lactating dairy cows. Lactating, non-pregnant Holstein cows (n = 12) were used in a repeated 3 × 3 Latin square with 21-d experimental periods, with the last 7 d used for sample and data collection. Cows were fed a basal TMR (control), or partially mixed diets to which 3.9% (LP), or 7.8% DM (HP) of FP were added. The control diet contained on a DM basis 17.4% CP, 4.5% crude fat, 28.0% starch, and an estimated 1.67 Mcal/kg of net energy for lactation (NEL). The FP contained 22.5% CP, 1.67% crude fat, 44.7% starch, and an estimated 1.81 Mcal NEL/kg. The rumen bacterial composition was analyzed by high-throughput sequencing of the V4 region of the 16S rRNA gene. Cows fed the HP diet had greater (<span>P</span> &lt; 0.05) ruminal ammonia (NH3-N), milk urea nitrogen (MUN), and plasma urea concentrations than those fed control and LP diets. Digestibility of DM was greater (<span>P</span> &lt; 0.05) for cows fed control and LP diets than for cows fed the HP diet. The CP total tract digestibility decreased (<span>P</span> &lt; 0.05) with increasing levels of peas in the diet. Compared with the control, the HP diet tended (<span>P</span> = 0.09) to increase the total ruminal concentration of branched-chain volatile fatty acids. The addition of FP to the diets did not affect the alpha diversity, as indicated by Shannon’s index, and the beta diversity of the rumen bacterial community [p<sub>(PERMANOVA)</sub> = 0.97]. However, the relative abundances of several bacterial taxa, including amplicon sequence variants (ASVs) belonging to <span>Bacteroidia</span>, <span>Clostridia</span>, and <span>Gammaproteobacteria</span> decreased in response to the addition of FP to the diet. Taken together, our results suggest that up to an inclusion rate of 7.8% DM, FP can be included in corn grain-based diets of lactating dairy cows without adverse effects on milk yield, milk composition, rumen fermentation characteristics, and rumen microbial composition.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a381b6d42ac927b3caac6f1f0260f8462b1a60a543774033586183b90f0048de","category":"Environment"}