{"title":"Apple Music’s new Discovery Station takes aim at Spotify","link":"https://www.macworld.com/article/2022581/apple-music-discovery-station.html","date":1691445061000,"content":"<p><a href=\"https://www.macworld.com\">Macworld</a></p>\n\n<div>\n<section><div></div></section>\n\n\n\n<p>Apple has its answer to Spotify’s “Discover Weekly” in a new custom algorithmic radio station aptly named Discovery Station. </p>\n\n\n\n<p>You’ll find it in on the Listen Now tab in the Made for You section, in the Stations for You subhead. It is similar to the [Your name]’s Station, with a twist. While your own station chooses many songs you’ve added to your library, liked, or listen to repeatedly, the Discovery Station chooses songs <em>similar to</em> those. </p>\n\n\n\n<p>You’ll find artists you’ve liked or listened to often, or songs similar to your favorites, but Discovery Station <em>avoids</em> playing songs that are in your playlists, library, or have been Liked by you. The whole point is to present music you may not have heard before but that Apple Music thinks you’ll probably like.</p>\n\n\n\n<p>This is distinct from the New Music mix, which is a limited playlist that updates once a week and plays music published recently; Discovery Station is a never-ending radio station that can play music from any era. </p>\n\n\n\n<p>Apple appears to have been testing the new station for about a year, with some users saying they see it for a time before it disappears. It’s now rolling out to all users and should be visible in the app, but you can access it on the web <a href=\"https://go.redirectingat.com/?id=111346X1569486&amp;url=https://music.apple.com/us/station/discovery-station/ra.q-GAI6IDA1ZmYwZGUyZjI2ZTcwOGMxYWJiNzBmZjc1N2FhOTVm&amp;xcust=1-1-2022581-1-0-0&amp;sref=https://www.macworld.com/feed\">through this link</a> if you don’t see it yet.</p>\n\nStreaming Media</div>","author":"","siteTitle":"Macworld","siteHash":"37e84dd5a21fa961d6d6630e269546024dbb7741b2e2fadbe74f47383c70dfbb","entryHash":"a38bda5f47c778fe41c2cc62be450db0c762dac5d1577016a54e49c26e8db412","category":"Apple"}