{"title":"Aryl structural effect on the photoinitiation abilities of aryl glycine derivatives for polymerization upon exposure to blue light","link":"https://onlinelibrary.wiley.com/doi/10.1002/appl.202400080?af=R","date":1719308070000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/791d94dc-b2b5-465c-8a5e-d06d6ee7d1ed/appl202400080-gra-0001-m.png\" alt=\"Aryl structural effect on the photoinitiation abilities of aryl glycine derivatives for polymerization upon exposure to blue light\" /><p>The research illustrates the design and synthesis of aryl glycine derivatives as photoinitiators under visible light. Combined with diphenyliodonium hexafluorophosphate, they efficiently initiate free radical and cationic photopolymerization under light-emitting diode (LED) irradiation. One derivative forms a photobase generator with diazabicyclo[4.3.0]non-5-ene, initiating epoxy-thiol polymerization, demonstrating potential for advanced photopolymerization applications.\n</p><br />\n<h2>Abstract</h2>\n<p>The design and development of photoinitiating systems applicable to visible light delivered from light-emitting diodes (LEDs) have attracted increasing attention owing to the wide application of photopolymerization. In this study, four aryl glycine derivatives are designed and synthesized, and their applicability as visible light-sensitive photoinitiators is thoroughly investigated. Specifically, the photoinitiation mechanism of these aryl glycine derivatives, when combined with iodonium salt, is investigated using steady-state photolysis, fluorescence, and electron paramagnetic resonance spin trapping techniques. It is revealed that radicals can be generated from aryl glycine derivatives/iodonium salt combinations upon exposure to blue LEDs (410 and 445 nm) to induce free radical photopolymerization (FRP) of (meth)acrylates. Additionally, besides FRP, a photobase generator based on one of the investigated aryl glycine derivatives is synthesized and demonstrates the capability to initiate epoxy-thiol polymerization under light irradiation. The remarkable photolatent characteristics demonstrate the significant potential in broadening the application of aryl glycine derivatives in controlled photopolymerization processes.</p>","author":"H. Lai, \nX. Peng, \nD. Zhu, \nJ. Zhang, \nP. Xiao","siteTitle":"Wiley: Applied Research: Table of Contents","siteHash":"a2be93a8f95ba138c1b0e647d01be1a546d9d2dd729340bbfccb521bcdddc260","entryHash":"a39384f619672f1c7c8b5b7ca076886fb0efdd2ec1b6e24e34e4ed43f9a65aae","category":"Environment"}