{"title":"A Latitudinal Cline in the Taxonomic Structure of Eelgrass Epifaunal Communities is Associated With Plant Genetic Diversity","link":"https://onlinelibrary.wiley.com/doi/10.1111/geb.13918?af=R","date":1727753297000,"content":"<h2>ABSTRACT</h2>\n<h2>Aim</h2>\n<p>Biogenic structural complexity increases mobile animal richness and abundance at local, regional and global scales, yet animal taxa vary in their response to complexity. When these taxa also vary functionally, habitat structures favouring certain taxa may have consequences for ecosystem function. We characterised global patterns of epifaunal invertebrates in eelgrass (<i>Zostera marina</i>) beds that varied in structural and genetic composition.</p>\n<h2>Location</h2>\n<p>North America, Europe and Asia.</p>\n<h2>Time Period</h2>\n<p>2014.</p>\n<h2>Major Taxa Studied</h2>\n<p>Peracarid crustaceans and gastropod molluscs.</p>\n<h2>Methods</h2>\n<p>We sampled epifaunal invertebrate communities in 49 eelgrass beds across 37° latitude in two ocean basins concurrently with measurements of eelgrass genetic diversity, structural complexity and other abiotic and biotic environmental variables. We examined how species richness, abundance and community composition varied with latitude and environmental predictors using a random forest approach. We also examined how functional trait composition varied along with community structure.</p>\n<h2>Results</h2>\n<p>Total species richness decreased with latitude, but this was accompanied by a taxonomic shift in dominance from peracarid crustaceans to gastropods, which exhibited different sets of functional traits. Greater eelgrass genetic diversity was strongly correlated with both richness and abundance of peracarids, but less so for gastropods.</p>\n<h2>Main Conclusions</h2>\n<p>Our results add to a growing body of literature that suggests genetic variation in plant traits influences their associated faunal assemblages via habitat structure. Because peracarids and gastropods exhibited distinct functional traits, our results suggest a tentative indirect link between broad-scale variation in plant genetic diversity and ecosystem function.</p>","author":"Collin P. Gross, \nJ. Emmett Duffy, \nKevin A. Hovel, \nPamela L. Reynolds, \nChristoffer Boström, \nKatharyn E. Boyer, \nMathieu Cusson, \nJohan Eklöf, \nAschwin H. Engelen, \nBritas Klemens Eriksson, \nF. Joel Fodrie, \nJohn N. Griffin, \nClara M. Hereu, \nMasakazu Hori, \nA. Randall Hughes, \nMikhail V. Ivanov, \nPablo Jorgensen, \nMelissa R. Kardish, \nClaudia Kruschel, \nKun‐Seop Lee, \nJonathan Lefcheck, \nKaren McGlathery, \nPer‐Olav Moksnes, \nMasahiro Nakaoka, \nMary I. O'Connor, \nNessa E. O'Connor, \nJeanine L. Olsen, \nRobert J. Orth, \nBradley J. Peterson, \nHenning Reiss, \nFrancesca Rossi, \nJennifer Ruesink, \nErik E. Sotka, \nJonas Thormar, \nFiona Tomas, \nRichard Unsworth, \nErin P. Voigt, \nMatthew A. Whalen, \nShelby L. Ziegler, \nJohn J. Stachowicz","siteTitle":"Wiley: Global Ecology and Biogeography: Table of Contents","siteHash":"3c0e5aaffe8fee3c8550c0a05a71fc802d704add877621e55c59b91462c01050","entryHash":"a39ba321cfb5e7351114fcc296c7e84c4736b05807646d3ba4f9178298bb7c96","category":"Environment"}