{"title":"Abundance of two Guiana dolphin (Sotalia guianensis) populations inhabiting adjacent areas in southeastern Brazil","link":"https://onlinelibrary.wiley.com/doi/10.1111/mms.13188?af=R","date":1727332787000,"content":"<h2>Abstract</h2>\n<p>Guiana dolphins (<i>Sotalia guianensis</i>) are commonly found in shallow waters from South and Central America. From March 2018 to June 2019, boat surveys were conducted to monitor two populations inhabiting the adjacent waters of Ilha Grande Bay and Sepetiba Bay to estimate population abundances and population parameters of apparent survival and capture probability. Photo-identification was used as a mark-recapture technique. A total of 672 dolphins was cataloged in Ilha Grande Bay and 826 in Sepetiba Bay, with two individuals being photographed in both areas. Population parameters were estimated through mark-recapture models and total population abundance was estimated at 1,949 and 1,560 individuals in Ilha Grande Bay and Sepetiba Bay, respectively. Seasonal estimates were modeled showing that the Sepetiba Bay population may have stronger site fidelity to the study area than individuals in Ilha Grande Bay. Apparent survival was estimated in a mixed model framework avoiding bias due to the large presence of transient individuals. The estimates presented here are a result of an effort conducted months after an unusual mortality event linked to Guiana dolphin cetacean morbillivirus and our findings indicated that surviving individuals did not have long-term deadly effects, but continuous efforts should be considered for a long-term evaluation.</p>","author":"Rafael R. Carvalho, \nCarlos Eduardo P. Quintana, \nCarlos Vinícius C. dos Santos, \nElitieri B. Santos‐Neto, \nLis Bittencourt, \nKarina S. Pereira, \nTatiana L. Bisi, \nMaja Kajin, \nJosé Lailson‐Brito Jr, \nAlexandre F. Azevedo","siteTitle":"Wiley: Marine Mammal Science: Table of Contents","siteHash":"41f2ab2fb7823483a860925793cfe03661521bf60a4c6416d33f6b2a3c4db49f","entryHash":"a3a01d21f379693362494dccf7f020f6dc8ab5c3a49448c9c4e438a6c2c69f9a","category":"Environment"}