{"title":"Remco Evenepoel signs the longest extension a Deceuninck-QuickStep rider has ever signed","link":"https://cyclingtips.com/2021/04/remco-evenepoel-signs-the-longest-extension-a-deceuninck-quickstep-rider-has-ever-signed/","date":1617727517000,"content":"<p>Remco Evenepoel will be sticking with Deceuninck-QuickStep for the long haul.</p>\n\n\n\n<p>The 21-year-old Belgian, one of cycling&#8217;s most promising youngsters, has signed a lengthy extension with the Belgian WorldTour squad that will keep him there through the 2026 season.</p>\n\n\n\n<p>&#8220;I feel really honored to put pen to paper for the next five years,&#8221; Evenepoel said via a team press release. &#8220;As Patrick [Lefevere, team manager] told me, this is the longest agreement he has ever signed with a rider. I’m really proud and happy to stay in this wonderful team, where I have already enjoyed a lot of success, and hopefully we can reach our big dreams.&#8221;</p>\n\n\n\n<p>Evenepoel joined Deceuninck-QuickStep at the start of the 2019 season after making a name for himself with a stellar run of results as a junior that included junior world titles in the road race and the time trial.</p>\n\n\n\n<p>He had success in his first season at the WorldTour level as well, with big results that included the overall win at the Baloise Belgium Tour, a WorldTour one-day win at the Clásica San Sebastián, and the European time trial title. He enjoyed immense success in 2020 as well, taking the overall wins at the Vuelta a San Juan, Volta ao Algarve, Vuelta a Burgos, and Tour of Poland before he suffered a broken pelvis in a crash at Il Lombardia that ended his season.</p>\n\n\n\n<p>He has since been working on his recovery with a plan to return to racing in time to target this year&#8217;s Giro d&#8217;Italia.</p>\n\n\n\n<p>&#8220;It’s an important step for the future, for the team. Everybody knows what Remco is capable of and how talented he is,&#8221; Lefevere said. &#8220;As he said, he’s happy, and one of my most important roles is to keep him happy and to put the right people around him. Because I know from experience, and I think I have some after a small 40 years in the sport, that happy people perform better than unhappy people. We’re glad Remco continues with the Wolfpack, and as he said, we hope we’ll enjoy many more great moments together.”</p>\n<p>The post <a rel=\"nofollow\" href=\"https://cyclingtips.com/2021/04/remco-evenepoel-signs-the-longest-extension-a-deceuninck-quickstep-rider-has-ever-signed/\">Remco Evenepoel signs the longest extension a Deceuninck-QuickStep rider has ever signed</a> appeared first on <a rel=\"nofollow\" href=\"https://cyclingtips.com\">CyclingTips</a>.</p>","author":"Dane Cash","siteTitle":"CyclingTips","siteHash":"30feca30fb3902119bf2da6559e7337232527b61c9abe0a00f5d7543c6aa6c84","entryHash":"a3a12a0c0e4787dcfe9e0a64877b75f1db51f0b9f2c8335d5a7e06f048616d8d","category":"Cycling"}