{"title":"204 Changes in DNA methylation 5 days after exposure to acute heat stress in beef cattle skeletal muscle","link":"https://academic.oup.com/jas/article/102/Supplement_3/40/7757037?rss=1","date":1726185600000,"content":"<span><div>Abstract</div>The objective of this study was to investigate the effects of acute heat stress on the skeletal muscle epigenome using reduced representation bisulfite sequencing (RRBS). March-born crossbred (5/8 Red Angus, 3/8 Simmental) steers (n = 14; average body weight = 308.7 kg) were exposed to heat stress (HS) conditions of 35°C + 35% relative humidity (Temperature Humidity Index = 81) for 12h/d for 2 d (48 h). Longissimus dorsi samples were collected via biopsy and flash-frozen in liquid nitrogen immediately following the HS period at 48 h and from the contralateral longissimus dorsi 5 d later. DNA was isolated and underwent RRBS using 150 bp paired-end reads at an achieved average depth of 15.3 million reads/sample. Reads were trimmed and mapped to a bisulfite-converted bovine genome (ARSUCD1.2). Methylation calls were extracted and used to identify differentially methylated regions (DMRs) with methylkit in R comparing samples collected 5 d post-HS to those taken immediately post-48 h of HS. Differentially methylated regions (1,000 bp) had q &lt; 0.05 and at least a 15% difference in methylation. There were 1,015 DMRs in genes. Hypomethylated DMRs 5 d post-HS included IGF1R, IGF2, IGF2BP1, IGFBP4, IGF2R, IKBKB, and IL34. Hypermethylated DMRs 5 d post-HS included FGF5, FGFR1, and FGFR3. There were 81 DMRs in putative promoter regions (2000 bp 5’ of a gene). MYLK2, SIGIRR, and 25 other genes had hypomethylated promoter regions. Genes that contained DMRs were used as input for DAVID to explore KEGG pathways. Enriched pathways (<span>P</span> &lt; 0.1) included multiple hormone pathways, MAPK, PI3K-Akt, HIF-1, and VEGF. Hypomethylation of IGF-related genes and hypermethylation of FGF-related genes suggests impaired growth capacity post-HS, as does the enrichment of MAPK and PI3K-Akt pathways. Hypomethylation of SIGIRR’s promoter region, IL34 and IKBKB, indicates enhanced anti-inflammatory activity given their known regulation of inflammatory cytokine production. This, coupled with enrichment of the HIF-1 and VEGF pathways, suggests regulatory dampening of HS-induced oxidative stress. These findings reveal key regulatory changes in muscle growth, inflammatory response, and oxidative stress activity for cattle recovering from acute HS. Previous cattle skeletal muscle RNA studies predicted that HS altered metabolism, inflammation, and oxidative stress pathways, similar to the methylation results of this study. Overall, evidence suggests growth dysregulation, which may help explain observed HS-induced poor growth due to HS, as well as subsequent anti-inflammatory activity during recovery from HS.</span>","author":"","siteTitle":"Journal of Animal Science Current Issue","siteHash":"e0a9c8db33f44d0a010c49c2ee87259ddd1875917af2bbb2b4ca0cd095c0aaf6","entryHash":"a3b1a08f15b2a09f9c4926dd74677e9edb102c69d921a331aada3aec296b34ce","category":"Environment"}