{"title":"Canopy cover and soil moisture influence forest understory plant responses to experimental summer drought","link":"https://onlinelibrary.wiley.com/doi/10.1111/gcb.17424?af=R","date":1721718000000,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/b884860f-8b1a-48b7-a5db-7b0de7f1afcd/gcb17424-toc-0001-m.png\" alt=\"Canopy cover and soil moisture influence forest understory plant responses to experimental summer drought\" />\n<p>We assessed the impacts of a 45-day experimental summer drought on the performance of six boreal forest understory plants, using a transplant experiment with rainout shelters. Drought negatively affected the performance of all plants, but the effects were stronger and more persistent in bryophytes than in the vascular plants. Higher ambient soil moisture and canopy cover reduced some negative effects of drought, indicating that landscapes can be actively managed to alleviate drought effects on boreal forest biodiversity.</p>\n<br />\n<h2>Abstract</h2>\n<p>Extreme droughts are globally increasing in frequency and severity. Most research on drought in forests focuses on the response of trees, while less is known about the impacts of drought on forest understory species and how these effects are moderated by the local environment. We assessed the impacts of a 45-day experimental summer drought on the performance of six boreal forest understory plants, using a transplant experiment with rainout shelters replicated across 25 sites. We recorded growth, vitality and reproduction immediately, 2 months, and 1 year after the simulated drought, and examined how differences in ambient soil moisture and canopy cover among sites influenced the effects of drought on the performance of each species. Drought negatively affected the growth and/or vitality of all species, but the effects were stronger and more persistent in the bryophytes than in the vascular plants. The two species associated with older forests, the moss <i>Hylocomiastrum umbratum</i> and the orchid <i>Goodyera repens</i>, suffered larger effects than the more generalist species included in the experiment. The drought reduced reproductive output in the moss <i>Hylocomium splendens</i> in the next growing season, but increased reproduction in the graminoid <i>Luzula pilosa</i>. Higher ambient soil moisture reduced some negative effects of drought on vascular plants. Both denser canopy cover and higher soil moisture alleviated drought effects on bryophytes, likely through alleviating cellular damage. Our experiment shows that boreal understory species can be adversely affected by drought and that effects might be stronger for bryophytes and species associated with older forests. Our results indicate that the effects of drought can vary over small spatial scales and that forest landscapes can be actively managed to alleviate drought effects on boreal forest biodiversity. For example, by managing the tree canopy and protecting hydrological networks.</p>","author":"Irena A. Koelemeijer, \nIsabelle Severholt, \nJohan Ehrlén, \nPieter De Frenne, \nMari Jönsson, \nKristoffer Hylander","siteTitle":"Wiley: Global Change Biology: Table of Contents","siteHash":"56ef18e1189a664bbaadbb00b32211653cb373b47aecc10bc04695f501416119","entryHash":"a3b1ab71ea9b5388e1658ab95617972b95552fd5033145eb7a5c7d8a43a2e507","category":"Environment"}