{"title":"Weirdly, a NASA official says fixed-price contracts do the agency “no good”","link":"https://arstechnica.com/?p=1948558","date":1686939720000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2015/11/1280px-Pratt_Whitney_Rocketdyne_space_shuttle_main_engines-640x480.jpg\" alt=\"Six of the 18 reusable space shuttle engines NASA has in storage. Each will be used once by the SLS rocket, then discarded.\" />\n      <p>Six of the 18 reusable space shuttle engines NASA has in storage. Each will be used once by the SLS rocket, then discarded. (credit: NASA)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<p>Last week NASA official Jim Free appeared before the Aeronautics and Space Engineering Board and Space Studies Board in Washington, DC. There are many of these review boards that act as outside observers for NASA's space policy plans and offer advice from seasoned hands. Free spoke about the agency's Artemis Program to return humans to the Moon.</p>\n<p>He made some news with his remarks, saying publicly for the first time what is widely known inside the space industry—the Artemis III mission, the first to carry humans down to the lunar surface since Apollo, will not happen in 2025. Free, <a href=\"https://spacenews.com/nasa-concerned-starship-problems-will-delay-artemis-3/\">according to Space News</a>, said he had some \"concern\" about the viability of the 2025 launch date. Well, yes, a <a href=\"https://arstechnica.com/science/2022/11/the-oracle-who-predicted-slss-launch-in-2023-has-thoughts-about-artemis-iii/\">more realistic starting target</a> for Artemis III is probably 2028-ish.</p>\n<p>It's all well and good for Free to acknowledge the likelihood of a delay. But it was his assignation of blame for the delay that raised some eyebrows. Free pinned the schedule slip on SpaceX, which is developing the large Starship rocket to, in part, serve as a Human Landing System to carry astronauts down to the surface from lunar orbit and back. SpaceX has an extensive test program to demonstrate the capability of Starship to launch and land, as well as transfer and store propellant in orbit. And Free is correct; they have much work to do.</p></div><p><a href=\"https://arstechnica.com/?p=1948558#p3\">Read 18 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1948558&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a3b9ad2b78d5523acbd182bd4b42e3d83b210b3bad158b0acefd9d655167351c","category":"Tech"}