{"title":"Near extinct Argyreia versicolor and rare Argyreia mekongensis are dependent on carpenter bee pollinators","link":"https://academic.oup.com/aobpla/article/doi/10.1093/aobpla/plae001/7571226?rss=1","date":1705449600000,"content":"<span><div>Abstract</div><span>Argyreia versicolor</span> and <span>Argyreia mekongensis</span> are extremely rare plant species. The former had not been seen for nearly 100 years until two individuals were found in Thailand in 2018, and only a handful of populations are known for the latter. The aims of this study were to examine the breeding systems of <span>A. versicolor</span> and <span>A. mekongensis</span> using pollination experiments and to determine their potential pollinators via floral observations. Our controlled pollination experiments uncovered the self-incompatibility of both species. Pollinator censuses indicated that females of two carpenter bee species, <span>Xylocopa aestuans</span> and <span>Xylocopa latipes</span>, were the predominant floral visitors for both <span>Argyreia</span> species. Our observations confirmed a harmonious match between the floral shape of both <span>Argyreia</span> species and the body sizes of these pollinators, ensuring effective pollen transfer and validating their role as putative pollinators. In line with the high frequency of pollinator visits observed, our controlled pollination experiments found no evidence of pollen limitation under field conditions. The findings of this study hold significance for the conservation of these endangered species, yet the situation is dire for <span>A. versicolor</span>, with one of the two individuals under study recently lost. Hence, it is crucial to intensify monitoring efforts for the species, aiming to identify additional individuals for potential inclusion in an ex-situ conservation program. Simultaneously, safeguarding the habitat of these plant species and their pollinators will be critical.</span>","author":"","siteTitle":"AoB PLANTS Current Issue","siteHash":"8840dd5ab55c091f7de845d03e42c474dbe2d076eb4181d88cf52a09aca2b17e","entryHash":"a3bf83c6bdf35f70358506e05f4f3dba055b57f6146b41704aa425a80666c2f0","category":"Environment"}