{"title":"Crude Tieguanyin oolong tea polysaccharides regulate intestinal immune and gut microflora in dextran sulfate sodium‐induced mice colitis","link":"https://onlinelibrary.wiley.com/doi/10.1002/jsfa.13206?af=R","date":1709912947000,"content":"<h2>Abstract</h2>\n<h2>BACKGROUND</h2>\n<p>The global incidence and prevalence of inflammatory bowel diseases (IBDs) have been increasing. Epidemiological studies, clinical trials, and animal experiments have indicated a negative association between the consumption of tea and IBD. This study aims to investigate the protective effects of crude Tieguanyin oolong tea polysaccharides (CTPS) on experimental colitis, while also exploring the underlying mechanisms.</p>\n<h2>RESULTS</h2>\n<p>The administration of CTPS significantly alleviated IBD in the mouse model, and was found to regulate T-cell mediated immune responses in the colon by modulating cytokine production associated with T cells. Furthermore, CTPS demonstrated a positive impact on the gut microbiota, reversing the increase in pathogenic <i>Helicobacter</i> and enhancing the relative abundances of beneficial bacteria such as <i>Akkermansia</i>, <i>Lachnospiraceae</i>, and <i>Odoribacter</i>. Oral administration of CTPS also led to an improvement in intestinal metabolism, specifically by increasing the levels of short-chain fatty acids.</p>\n<h2>CONCLUSION</h2>\n<p>This study provides the first <i>in vivo</i> evidence of the protective effects of CTPS on colitis in mice. The effects are likely facilitated through the regulation of T cell-mediated responses and modulation of the gut microbiota, suggesting that CTPS may be a potential preventive and therapeutic approach for IBD. © 2023 Society of Chemical Industry.</p>","author":"Yuxi Zhang, \nYani Pan, \nHaiyu Lin, \nXue Chen, \nPuming He, \nYuefei Wang, \nPing Chen, \nQiang Chu","siteTitle":"Wiley: Journal of the Science of Food and Agriculture: Table of Contents","siteHash":"fec355e96833084e79d8fcfe545b79bc45871fa0d8eab764467d4e96ba48f4c0","entryHash":"a3c0cba4b9531aa76fc32ce0884e9408a1a23cc4b4500b0835b49eed5f27b747","category":"Environment"}