{"title":"Comparison of passive and manual chlorination in small piped water networks in rural Ghana: Technical performance, ease-of-use, and cost","link":"https://journals.plos.org/water/article?id=10.1371/journal.pwat.0000295","date":1729087200000,"content":"<p>by Caroline Delaire, Katherine Marshall, Michal Usowicz, Tom Mahin, Daniel Kwaah, Bashiru Yachori, Bastian Schnabel, Ranjiv Khush, Rachel Peletz</p>\r\n\r\nChlorination is the most common water treatment method globally and leads to proven health benefits. Yet, many rural water supplies in low-income settings are unchlorinated, exposing consumers to waterborne diseases. Insufficient technical and financial capacity of water suppliers in low-resource settings are common barriers to more widespread chlorination. We conducted a case study of two approaches to chlorinate small piped water supplies− passive (inline) chlorination and manual chlorination− and compared their technical performance, ease-of-use, and costs in rural Ghana. Based on 685 water quality measurements across two piped networks over three months, both methods provided adequate free chlorine residuals (i.e., 0.2–2.0 mg/L) most of the time (71% for manual chlorination and 86% for passive chlorination). Follow-up measurements five months later revealed a decline in chlorine levels with the manual approach (47% in the target range) and an increase with the passive (inline) approach (100% in the target range). We observed large fluctuations in chlorine levels over time, particularly with inline chlorination, that pH, temperature, conductivity, and turbidity variations did not fully explain. Temporal changes in chlorine demand and/or inconsistently implemented protocols possibly contributed to these fluctuations. Inline chlorination scored higher for ease-of-use (85%) than manual chlorination (70%) but was less financially viable: it represented an 11% increase in operational expenses, compared to 4% for manual chlorination. Initial equipment and installation cost approximately 6,000 USD for inline chlorination and about 260 USD for manual chlorination. Our results highlight the tradeoffs between passive (inline) and manual chlorination. Although less favorable for ease-of-use, manual chlorination is more viable financially and can achieve comparable performance with strict dosing protocol adherence, suggesting this approach deserves similar consideration as passive chlorination when evaluating options for low-resource settings. Both methods are susceptible to changes in operator behaviors and require external oversight plus support for troubleshooting and recalibration.","author":"Caroline Delaire","siteTitle":"PLOS Water","siteHash":"76ba47a8597c89f4cf217272433133ba8aa6d0dba9c907d21e63f90c34e21e00","entryHash":"a3c20ba969f07a9eb98d7a4c57df08fbd03aac83d71022ba7a38f365a734b944","category":"Environment"}