{"title":"Orbea teases new aero bike at Vuelta a España","link":"https://www.bikeradar.com/news/orbea-orca-aero-vuelta-a-espana/","date":1629112274000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Orbea-aero-bike-Vuelta-a-Espana-3-b6831a2.jpg?quality=45&amp;resize=620,413\" />                                            <p>The Euskaltel–Euskadi team appears to be using a new and as-yet-unreleased Orbea aero bike at the 2021 Vuelta a España.</p>\n<p>The season’s final Grand Tour opened with a time trial on Saturday, with Olympic champion Primož Roglič winning in Burgos, before Sunday’s road stage.</p>\n<p>Euskaltel–Euskadi rider Xabier Mikel Azparren got into the break riding an Orbea model we’re unfamiliar with. It looks to be an entirely aero-focused frame, sporting a different paint scheme to the team’s usual black bike.</p>\n<h2>Ordu-inspired</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Xabier Mikel Azparren was riding an unreleased Orbea aero bike on stage two of the Vuelta a España.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>The Basque brand already has the Orca Aero, but using this bike in Spain looks to step things up. The most notable change is at the head tube, which extends rearward with a deep aero profile to merge with the top tube and down tube.</p>\n<p>Orbea may have drawn inspiration from the recently-launched <a href=\"https://www.bikeradar.com/news/orbea-ordu-2021/\">Ordu time-trial bike</a>, which uses a hinged design to increase the depth of the aerofoil in a much more dramatic fashion.</p>\n<p>The down tube also appears to have a deeper profile, again most likely in a bid to improve aerodynamics.</p>\n<p>The front tyre runs extremely close to the underside of the down tube, with a cutaway to provide clearance – a feature we’re much more used to seeing at the rear of a bike (as is the case with the current Orca Aero) but, once again, something we’ve recently seen from Orbea on the Ordu TT bike.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The new model looks to be inspired by the Ordu time trial bike.</span></figcaption><span> <i>Orbea</i></span></div>\n<p>The Ordu, by the way, is optimised for tyres between 25mm and 28mm, but has clearance for up to 30mm depending on the tyre and rim combination.</p>\n<p>The fork also looks to share a similar design to that of the Ordu, dropping straight from the head tube before bowing outwards on either side.</p>\n<div>\n    <img /></div><div><figcaption><span><i></i> The fork arcs away from the wheel in a similar design to the Ordu.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>The similarities continue at the rear of the bike, most notably at the seat tube and seatstay junction. Like the current Orca Aero, a cutaway keeps the rear wheel close to the seat tube, but the seatstays flow into the seat tube with a more pronounced, sculpted step.</p>\n<h2>Getting kinky</h2>\n<p>The changes continue with the dropped driveside chainstay, which has a distinctive kink near the rear axle, rather than around the down tube and <a href=\"https://www.bikeradar.com/advice/buyers-guides/the-complete-guide-to-bottom-bracket-standards/\">bottom bracket</a> junction as we sometimes see.</p>\n<p>Might there be an aerodynamic advantage to the design? Some <a href=\"https://www.bikeradar.com/advice/buyers-guides/time-trial-bikes/\">time trial bikes</a>, including <a href=\"https://www.bikeradar.com/news/cubes-new-ultimate-aero-c68-tt-bike-will-be-a-stealth-bullet-at-kona/\">Cube’s Aerium</a>, have used a similar design.</p>\n<p>Elsewhere, the aero seatpost now extends inline with the seat tube, whereas the current Orca Aero’s post is skinnier in profile than the seat tube.</p>\n<p>As you’d expect, there’s barely a cable in sight, with all Di2 cables and hydraulic hoses – the frame has <a href=\"https://www.bikeradar.com/features/road-disc-brakes-everything-you-need-to-know/\">road disc brakes</a>, of course – hidden internally at the front of the bike.</p>\n<h2>Watch this space</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Three Euskaltel–Euskadi appeared to be on the bike at the pre-race team presentation.</span></figcaption><span> <i>Getty Images</i></span></div>\n<p>Three Euskaltel–Euskadi riders were on the bike at the pre-race team presentation, having possibly been tasked with final testing ahead of an official launch or, more likely, teasing the new model to the public and media.</p>\n<p>It’s not uncommon for brands to tease new bikes pre-release in a distinctive paintjob and that’s the case here, though Euskaltel–Euskadi’s trademark orange is present and correct.</p>\n<p></p><div>\n    <i></i>\n    <div>\n  <div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Euskaltel%E2%80%93Euskadis-Orbea-Orca-OMX-for-2021-Vuelta-a-Espana-5-3caa03a.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>This is Euskaltel–Euskadi’s regular race-day Orbea Orca OMX for 2021 Vuelta a España.</span>\n    </figcaption><span>\n                    <i>Orbea</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Euskaltel%E2%80%93Euskadis-Orbea-Orca-OMX-for-2021-Vuelta-a-Espana-4-7fe2ca8.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The frame has been given a new lick of paint to celebrate Euskaltel–Euskadi’s return to the Vuelta.</span>\n    </figcaption><span>\n                    <i>Orbea</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Euskaltel%E2%80%93Euskadis-Orbea-Orca-OMX-for-2021-Vuelta-a-Espana-2-48e8f3f.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The team’s iconic orange features across the bike.</span>\n    </figcaption><span>\n                    <i>Orbea</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n          <div>\n        \n<figure><div>\n    <img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/08/Euskaltel%E2%80%93Euskadis-Orbea-Orca-OMX-for-2021-Vuelta-a-Espana-6-0f16ea2.jpg?quality=90&amp;resize=556%2C723\" /></div>    <figcaption><div>\n    <figcaption><span>The detailing extends to the fork, too.</span>\n    </figcaption><span>\n                    <i>Orbea</i>\n            </span>\n</div>\n\n    </figcaption></figure></div>\n      </div>\n</div>\n</div>\nOn that note, the team’s regular race day bike – the Orca OMX – has also had a new splash of paint for the Vuelta, with orange detailing on the top tube, seat tube, fork and handlebar tape to bring the otherwise black frame to life.\n<p>Anyway, that’s all we know – or can decipher – about Orbea’s new bike for now. There are no more clues on the UCI’s list of approved frames or forks so we’ll have to sit tight until Orbea lifts the lid on details.</p>","author":"George Scott","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a3c3b634344dbc705e8a2cc003a24112cfc0116085e931f35622e6e286e424eb","category":"Cycling"}