{"title":"Integrated Neuro-Symbolic Analysis Pipeline for Cerebral Aneurysm Rupture Diagnosis","link":"https://www.preprints.org/manuscript/202403.1484/v1","date":1711367451000,"content":"The importance of detecting and diagnosing the imminence of aneurysm rupture before it occurs cannot be overstated. However, this process is often time-consuming and challenging, with variability in conclusions not uncommon among experts. Furthermore, current state-of-the-art models in medical image segmentation suffer from limited availability of large annotated datasets for training, exacerbated by an immense data imbalance. In most segmentation tasks, 3D segmentation is preferred due to its capacity to leverage more contextual information. However, these models require more data, which is constrained by the aforementioned issues. In the realm of current diagnosis models, those lacking geographic context are notably ineffective. To address these issues, the aim is to develop a model pipeline to accurately detect cerebral intracranial aneurysms and diagnose rupture imminence through 3D magnetic resonance angiography (MRA) and tabular input, augmented with the implementation of neuro-symbolic ai.  The utilization of data fusion to tackle the lack of context in tabular models is proposed, leveraging extracted geographical features from a segmentation model. To enhance segmentation results and tackle the data imbalance in aneurysm segmentation, a two-stage model pipeline that extracts contextual geographic features before aneurysm segmentation is suggested. Segmentation results are additionally improved through ensemble techniques and novel preprocessing techniques. Finally, a neuro-symbolic aspect is introduced to enhance model diagnosis, interpretability and performance. The multi-step Integrated Neuro-Symbolic Analysis Pipeline for Cerebral Aneurysm Rupture Diagnosis is introduced.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a3c534e69f61bd3235a8f908933985a8689d783e6873698835afda6c1a9dca13","category":"Interdisciplinary"}