{"title":"Visual Evoked Potentials Sensitization/Habituation Mechanisms in Chronic Migraine Patients with or without Medication Overuse","link":"https://www.preprints.org/manuscript/202409.0967/v1","date":1726156193000,"content":"Background/Objectives: Habituation and sensitization are opposite phenomena that play a role in the pathophysiology of episodic migraine and its progression to chronic migraine (CM). There have been just a few studies that have investigated these phenomena in patients with medication overuse headache (MOH) in comparison to those with chronic migraine (CM) and healthy controls (HCs), and the findings have been inconsistent. Methods: We measured and examined visual evoked potentials (VEPs) in 81 patients with MOH and 24 patients with CM, as well as 24 HCs. The VEPs were used to assess sensitization by analyzing the amplitude of the first block (100 sweeps), and to evaluate habituation by measuring the amplitude response decrement after 6 blocks. We further examined patients diagnosed with MOH based on their acute medication type and after a 3-week acute medication withdrawal program. Results: There were no significant differences between groups in terms of the first N1-P1 VEP amplitude block and its habituation. It was found that patients with MOH had a greater drop in the amplitude of the VEP P1-N2 complex after repeated stimulation than patients with CM or HC. The VEPs parameters showed no significant differences based on the specific overused drug and after a 3-week acute medication off. Conclusions: We propose that the results obtained in patients with MOH indicate an abnormal activation of inhibitory circuits in the parieto-occipital region in response to repeated modulatory stimuli.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a3cdfe235b3e5aacd7c46929c725be11f4422c0fd59426c5c19d1d61d3be40fe","category":"Interdisciplinary"}