{"title":"Patient satisfaction with the management of refractory and unexplained chronic cough in Canada: Results from a national survey","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0308275","date":1722520800000,"content":"<p>by Sana Khan, Danica Brister, Ted Abraham, Samuel Laventure, Sevag Sahakian, Berta Juliá, Imran Satia</p>\r\nBackground <p>Chronic cough (persisting for ≥8 weeks) is a common disorder affecting approximately 5 to 10% of adults worldwide that is sometimes refractory to treatment (refractory chronic cough [RCC]) or has no identifiable cause (unexplained chronic cough [UCC]). There is minimal information on the patient’s experience of RCC/UCC in Canada. The aim of this study was to evaluate the patient journey and perceptions related to RCC/UCC management in Canada.</p> Methods <p>Our exploratory study included Canadians in the Leger Opinion Panel and focused on individuals with RCC or UCC. Key entry criteria were: age ≥18 years, cough on most days for ≥8 weeks, no smoking within 1 year, no serious respiratory disease or lung cancer, and not taking angiotensin-converting enzyme inhibitors. Individuals who met entry criteria were invited to complete an approximately 30-minute online survey with questions on demographic characteristics, healthcare professional (HCP) interactions, diagnosis of underlying conditions, current treatments, and satisfaction with HCPs and chronic cough therapies.</p> Results <p>A total of 49,076 individuals completed the chronic cough screening questionnaire (July 30, 2021 to September 1, 2021): 1,620 (3.3%) met entry criteria for RCC or UCC, and 1,046 (2.1%) completed the online survey (mean age of 45 years, 61% female). Most respondents (58%) reported their chronic cough was managed by a general practitioner (GP). Forty-four percent of respondents did not have a diagnosis of an underlying condition for their cough. Breathing tests (39%) and chest imaging (34%) were the most common diagnostic tests. Cough suppressants (18%) were the most frequent current treatment. Respondents were moderately satisfied with their HCPs, but more than half considered their treatment ineffective and 34% had considered no longer seeking medical attention because of a lack of treatment success.</p> Conclusions <p>Individuals with RCC/UCC in Canada are largely unsatisfied with the effectiveness of treatment. Additional HCP education and new treatment options are needed to improve patient satisfaction.</p>","author":"Sana Khan","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a3d2a5ec276fe4d46bd0912859af75168e3b9f535a98e719e4cdc0fe33ccc775","category":"Interdisciplinary"}