{"title":"Recent range shifts of moths, butterflies, and birds are driven by the breadth of their climatic niche","link":"https://academic.oup.com/evlett/article/8/1/89/7076361?rss=1","date":1678579200000,"content":"<span><div>Abstract</div>Species are altering their ranges as a response to climate change, but the magnitude and direction of observed range shifts vary considerably among species. The ability to persist in current areas and colonize new areas plays a crucial role in determining which species will thrive and which decline as climate change progresses. Several studies have sought to identify characteristics, such as morphological and life-history traits, that could explain differences in the capability of species to shift their ranges together with a changing climate. These characteristics have explained variation in range shifts only sporadically, thus offering an uncertain tool for discerning responses among species. As long-term selection to past climates have shaped species’ tolerances, metrics describing species’ contemporary climatic niches may provide an alternative means for understanding responses to on-going climate change. Species that occur in a broader range of climatic conditions may hold greater tolerance to climatic variability and could therefore more readily maintain their historical ranges, while species with more narrow tolerances may only persist if they are able to shift in space to track their climatic niche. Here, we provide a first-filter test of the effect of climatic niche dimensions on shifts in the leading range edges in three relatively well-dispersing species groups. Based on the realized changes in the northern range edges of 383 moth, butterfly, and bird species across a boreal 1,100 km latitudinal gradient over c. 20 years, we show that while most morphological or life-history traits were not strongly connected with range shifts, moths and birds occupying a narrower thermal niche and butterflies occupying a broader moisture niche across their European distribution show stronger shifts towards the north. Our results indicate that the climatic niche may be important for predicting responses under climate change and as such warrants further investigation of potential mechanistic underpinnings.</span>","author":"","siteTitle":"Evolution Letters Current Issue","siteHash":"ccc44437a8276654c44dddd156a8ce3b5dae5730f1c2406ed04aa90599bdf071","entryHash":"a3de93b177de5fc9b9a491fc29b630720346379379b05f28c8b3508e7c7c96bc","category":"Environment"}