{"title":"Tropical Storm Henri will make landfall in the northeastern United States","link":"https://arstechnica.com/?p=1788793","date":1629476167000,"content":"<div>\n<figure><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/henri-satellite-800x583.jpg\" /><p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/henri-satellite.jpg\">Enlarge</a> <span>/</span> Henri satellite appearance as of 10:30 am ET (14:30 UTC) on Friday. (credit: NOAA)</p>  </figure><div><a name=\"page-1\"></a></div>\n<p>After several days of uncertainty and wild swings in forecast models, confidence is increasing in a large tropical system making landfall in the northeastern United States this weekend. In addition to causing surges along the coastline, Henri could bring gusty winds and widespread heavy rainfall from late Saturday through Monday to a region from New Jersey to Maine.</p>\n<p><a href=\"https://www.nhc.noaa.gov/graphics_at3.shtml?start#contents\">The latest forecast</a> from the National Hurricane Center, issued at 11 am ET on Friday, shows Henri holding at sustained winds of 65 mph, just below hurricane strength. However, the wind shear hampering Henri's organization should relax some later today, and as the storm passes over the Gulf Stream, forecasters anticipate Henri will become a Category 1 or 2 hurricane. It may weaken some before landfall, however, as it passes over the cooler waters off the coast of New England.</p><div><img src=\"https://cdn.arstechnica.net/wp-content/uploads/2021/08/nhc-forecast.jpg\" /><p>Official track forecast for TS Henri at 11 am ET Friday. (credit: National Hurricane Center)</p></div>\n<p>Over the next 48 hours, the storm should now move more or less due north and will likely make landfall somewhere along Long Island, Connecticut, or Rhode Island on Sunday.</p></div><p><a href=\"https://arstechnica.com/?p=1788793#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1788793&amp;comments=1\">Comments</a></p>","author":"Eric Berger","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a3fce427995c78d076987e395b4443127d0bb3ac7ffb809cde5a25223da99488","category":"Tech"}