{"title":"Predictors of unmet needs among people with diabetes mellitus type 2 in Gampaha district of Sri Lanka","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0002462","date":1728568800000,"content":"<p>by Nimali Widanapathirana, Rajitha Wickremasinghe, Susie Perera, Martin McKee, Benjamin Palafox, Dina Balabanova</p>\r\n\r\nDiabetes mellitus is a significant contributor to the disease burden in Sri Lanka. Despite government efforts to improve access to care for those with chronic illness, major gaps remain. We assessed the prevalence and correlates of unmet needs among persons with diabetes mellitus type 2 to inform policies on improving healthcare access in a predominantly tax-funded public healthcare system. A descriptive cross-sectional study identified 401 persons with diabetes mellitus type 2 using a multi-stage cluster sampling method from 1767 individuals aged 40–69 from the Gampaha district, just north of the capital Colombo. An interviewer-administered questionnaire gathered data on unmet needs for physician care, medicines, and investigations during the preceding year. Associated factors, identified from the health behaviour model, were examined using binomial logistic regression with significance set at p&lt;0.05. One-fifth experienced an unmet need (95%CI:15.7–23.7), with 16% for physician care (95%CI:12.7–20.2), 4.2% for medicines (95%CI:2.5–6.7) and 6.0% for investigations (95%CI:3.9–8.8). People who frequently visited a private provider experienced less unmet needs overall. Being female (AOR 0.50; 95%CI:0.27–0.92) and having a higher income (AOR 0.37; 95%CI:0.16–0.83) reduced unmet need for physician care. Absence of other major chronic illnesses (AOR 0.31; 95%CI:0.12–0.80) and having a regular care provider in the public (AOR 0.24; 95%CI:0.07–0.89) or private sectors (AOR 0.18; 95%CI:0.05–0.68) reduced unmet need for investigations with the latter also reducing unmet need for medicines (AOR 0.11; 95%CI:0.02–0.77). Despite Sri Lanka having a predominantly publicly financed healthcare system, persons with diabetes mellitus experienced unmet healthcare needs, mainly for physician care which varied with socio-economic characteristics. It is important to ensure uninterrupted care, universally for all, through patient-centred models of care linked to a regular provider. Health planners should take account of unmet needs when expanding public sector coverage for chronic illness care.","author":"Nimali Widanapathirana","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a4094e9daf902cdc8070beb4c7d7a0364b2237cbaf885e3fd0eb99db2173ea54","category":"Environment"}