{"title":"Qingyang Sachet: Literature Review on Traditional Crafts in Sustainable Development","link":"https://www.preprints.org/manuscript/202409.1587/v1","date":1726804213000,"content":"The Qingyang sachet is a traditional handcraft that originates from Qingyang City in Gansu Province. We have observed the resurgence of the Qingyang sachet handcraft known as \"Qingyang sachet embroidery\". How does this revival demonstrate the incorporation of traditional handicrafts and the principles of sustainable development? The objective of this study is to investigate the possibilities and difficulties associated with the sustainable development of the traditional handcraft known as \"Qingyang Sachet\". This study utilizes a research approach that combines literature review and field investigation to thoroughly analyze domestic literature on sachet research and traditional handicrafts in international journals. The objective is to examine the cultural inheritance, traditional handicrafts, and sustainable development of Qingyang sachets. Perform a thorough evaluation. Through extensive investigation of both domestic and international literature, it was found that the Qingyang sachet is a traditional craft deeply embedded in the local culture. This craft holds significant historical significance and serves as a symbol of the local community's heritage and emotional expression. The aim of this study is to consolidate the various literature advantages of the traditional handicraft of Qingyang sachet in relation to sustainable development. It also proposes recommendations for future research and implementation of Qingyang sachet, and offers a framework for the sustainable development of other traditional handicrafts.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a40c631c0acd4344d55fad2cc767a2a1c66c94220db475703d793587f49b3817","category":"Interdisciplinary"}