{"title":"Ford pushes the off-road button with F-150 Lightning Switchgear","link":"https://arstechnica.com/?p=1997045","date":1705601214000,"content":"<div>\n<figure>\n  <img src=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Ford-F-150-Lightning-Switchgear-1-800x600.jpg\" alt=\"A Ford F-150 Lightning Switchgear sprays mud as it turns\" />\n      <p><a href=\"https://cdn.arstechnica.net/wp-content/uploads/2024/01/Ford-F-150-Lightning-Switchgear-1-scaled.jpg\">Enlarge</a> <span>/</span> I normally prefer my performance cars on race circuits, but the Lightning Switchgear impressed this off-road racing novice. (credit: Jonathan Gitlin)</p>  </figure>\n\n\n\n\n\n\n<div><a name=\"page-1\"></a></div>\n<aside>Ford provided accommodation and flights from Washington to Charlotte so we could attend the 2024 season launch of Ford Performance. Ars does not accept paid editorial content.</aside>\n<p>CONCORD, NC—The venerable pickup truck can play a multitude of roles these days. For some, it's nothing more than a work vehicle, something to carry around lumber or tools or tow a trailer full of equipment. For others, <a href=\"https://arstechnica.com/cars/2024/01/a-week-with-a-ford-f-150-lightning-this-truck-is-too-big-for-city-life/\">it's the new American family car</a>. But some truck owners like to leave the tarmac behind to have a little fun in the wilderness. Mostly, that involves low-speed rock crawling, perhaps up the side of a steep mountain. But it doesn't <em>have </em>to be slow—vehicles like Ford's range of Raptors are designed to do highway speeds across expanses of desert wilderness, largely thanks to very clever dampers and plenty of suspension travel to munch up those bumps and bounces.</p>\n<p>Ford is yet to make a Raptor version of its F-150 Lightning electric pickup, but we got an idea of what one could be capable of this week thanks to a ride in the Blue Oval's latest electric demonstrator, the F-150 Lightning Switchgear. It's the result of a collaboration between Ford Performance and RTR Vehicles, a tuning company founded and run by drifting champion and off-road racer Vaughn Gittin Jr., and while it's just a one-off for now, the Lightning Switchgear is a testbed for pushing the boundaries of what we can expect from electric trucks, Ford says. (You may remember RTR <a href=\"https://arstechnica.com/cars/2020/07/check-out-this-bonkers-1400-horsepower-ford-mustang-mach-e/\">previously worked with Ford to create a 1,400-hp Mustang Mach-E in 2020</a>.)</p>\n<p>\"This is going to focus on chassis and suspension. So to that end, just like you do with any good racing vehicle, you start with the tires,\" explained Sriram Pakkam, head of F1 and EV demonstrators at Ford.</p></div><p><a href=\"https://arstechnica.com/?p=1997045#p3\">Read 6 remaining paragraphs</a> | <a href=\"https://arstechnica.com/?p=1997045&amp;comments=1\">Comments</a></p>","author":"Jonathan M. Gitlin","siteTitle":"Ars Technica","siteHash":"5b0ddf6e8923e49262a7894cfd77962733e43fbcc565a103b48373820b310636","entryHash":"a40f0992be4c876999436f70beb8180d3794eaf3264f49524782fc005de0f0fa","category":"Tech"}