{"title":"MBUK June 2021 issue on sale now. Subscribe and get a pair of Madison Flux shorts!","link":"https://www.bikeradar.com/news/mbuk-latest-issue-gift/","date":1620734422000,"content":"<img src=\"https://images.immediate.co.uk/production/volatile/sites/21/2021/04/MBK_394_digiads.1440x958-d34c5bb.jpg?quality=90&amp;resize=620,413\" />                                            <p>Fun for pinners and pootlers alike, this issue MBUK begins the hunt for Britain’s best blue trail. There are also tests of £1,000ish bikes, clipless pedals and enduro helmets, plus the team explain how to rectify six common riding errors. Ride wise, they head to Bedgebury Forest in Kent and The Bull Track in East Sussex, show you how to have a great weekend on the North York Moors and check out what’s going on at Caersws in Mid Wales. There’s tons more besides, from servicing SPDs to maximising your lunch break. Pick up your copy now!</p>\n<ul><li><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW395&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=flux_MBW395&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to Mountain Biking UK to receive your free gift as well as discounts and more</a></li>\n</ul><h2>Blues cruise</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> MBUK scours England to find its best blue trail. <em>Andy Lloyd</em></span></figcaption><span></span></div>\n<p>You can’t beat a good blue trail. Designed to be accessible to beginners, but also packed with fun features for more experienced riders, the best blues are fun for all riders. We’re scouring the UK to find the best blue trails and in this issue it’s England’s turn.</p>\n<h2>One-grand wonders</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Three of the best affordable hardtails reviwed in depth this issue. <em>Ian Linton</em></span></figcaption><span></span></div>\n<p>In this month’s biketest the testers see whether you can get a trail-slaying demon for under a grand or whether you need to spend a little more to get the most bang for your buck. The team reviews three affordable hardtails head to head.</p>\n<h2>Clipless pedals on test</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Nine sets of the best clipless pedals in this month’s grouptest. <em>Andy Lloyd</em></span></figcaption><span></span></div>\n<p>A must for XC, DH and enduro racers, clipless pedals are designed with aggressive riding in mind. In this grouptest, our testers have put together a selection of nine of the best clipless pedals on the market in a bid to find the most secure, stable and confidence-inspiring pair you can buy.</p>\n<h2>Power hour</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> How far can you ride in your lunch hour? <em>James Vincent</em></span></figcaption><span></span></div>\n<p><span>James Vincent and Pat Campbell-Jenner are on a mission to find out exactly how much awesome riding you can fit into your lunch break. In a time when we’re all keen to make the most of the time we’ve got, these two Lake District lads aim to prove that it doesn’t always require a huge roadtrip to get out on the trails.</span></p>\n<h2>Bedgebury Forest and The Bull Track trail crew</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> The Bull Track Bike park – a gem of the South East. <em>Steve Behr</em></span></figcaption><span></span></div>\n<p>Ed Thomsett heads over to the South East to check out a pair of riding locations that are making a big splash on the Kent and Sussex border – Bedgebury Forest and The Bull Track Bike Park. These places are proof of the healthy state of the modern MTB scene and show that you can have as much fun in the home counties as you can in the Scottish Highlands.</p>\n<h2>And that’s not all…</h2>\n<div>\n    <img /></div><div><figcaption><span><i></i> Troy Lee Designs’ A3 helmet – reviewed this issue in Wrecked and Rated. <em>Andy Lloyd</em></span></figcaption><span></span></div>\n<p>This issue of MBUK is jam-packed with all the latest and greatest bikes, product reviews and news stories from the mountain biking world. There’s a brand new e-bike from Specialized and forks from RockShox and Fox, along with pages of product reviews that include Troy Lee Designs’ new A3 helmet.</p>\n<h2>Subscription offer</h2>\n<div>\n    <img /></div>\n<p><a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW395&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=flux_MBW395&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">Subscribe to MBUK</a>, Britain’s best-selling mountain biking magazine – made by riders to inform, excite and entertain other riders – and receive <span>a pair of Madison Flux shorts</span><span>!</span></p>\n<p>Since MBUK’s first issue in 1988, it’s blazed a trail all of its own, combining unrivalled product testing with easy-to-understand skills tips and maintenance advice, inspiring route guides, entertaining riding features and stunning photography from the world’s best snappers – and all while never taking things too seriously.</p>\n<section><div>\n        <h2>Why subscribe?</h2>\n<ul><li>Save 25%* on the shop price: only £58.49 every 13 issues</li>\n<li>Get a pair of <span>Madison Flux shorts!</span></li>\n<li>Every issue delivered straight to your door</li>\n<li>Never miss an action-packed issue or supplement</li>\n<li>Exclusive offers and competitions with our Subs Zone!</li>\n</ul><p>\n\n    </p></div>\n    </section><p>You can <a href=\"https://www.buysubscriptions.com/print/mountain-biking-uk-magazine-subscription?promo=MBW395&amp;utm_medium=brandsite&amp;utm_source=bikeradar.com&amp;utm_campaign=flux_MBW395&amp;utm_content=editorial-link&amp;style=brand\" target=\"_blank\">subscribe to MBUK here</a> and check out our <a href=\"https://www.facebook.com/MBUKMag/\" target=\"_blank\">Facebook</a>, <a href=\"https://www.instagram.com/mbukmagazine/\" target=\"_blank\">Instagram</a> and <a href=\"https://twitter.com/mbukmagazine?lang=en\" target=\"_blank\">Twitter </a>accounts for all of the latest mountain bike action.<br />\nAnd don’t forget to sign up to the <a href=\"http://www.mbuk.com/newsletter\" target=\"_blank\">newsletter!</a></p>\n<p>*Offer open to new UK customers subscribing to the print edition by direct debit only. Full details of the Direct Debit Guarantee will be provided and are available on request. Please allow 28 working days for delivery of your gift. You will receive 13 issues per year. Your subscription will start with the next available issue. 25% saving based on buying 13 issues at full UK shop price. In the unlikely event your selected gift is unavailable, we reserve the right to send an alternative gift. Offer ends: 10/06/21.</p>","author":"Chris Barnard","siteTitle":"BikeRadar","siteHash":"df99dd1320fcd97327a2def4c67247c08cd4090a7dab684a0eddb9b856f80ef1","entryHash":"a41690337a82d2d4b7c7e558bdeb2fec19e3cc77005cd7cd51daa0b7828d2358","category":"Cycling"}