{"title":"Triple Negative Breast Cancer Subclassified by Immunohistochemistry: Correlation with Clinical and Pathological Outcomes in Patients Receiving Neoadjuvant Chemotherapy","link":"https://www.preprints.org/manuscript/202404.1625/v1","date":1713965377000,"content":"Intrinsic subtype of triple-negative breast cancer (TNBC) is based on genomic evaluation. In this study, we report the survival and pathological complete response (pCR) rates of TNBC patients subtyped by IHC and treated with neoadjuvant chemotherapy (NACT). A retrospective cohort of 187 TNBC patients who received NACT between 2008 and 2017 was used, and IHC subtyping was performed on biopsy specimens before chemotherapy. The subtyping revealed predominant basal-like tumors (IHC-BL, 61%), followed by basal-like immune-suppressed (IHC-BLIS, 31%), mesenchymal tumors (12.5%), luminal androgen receptor tumors (IHC-LAR, 12%) and basal-like immune-activated (IHC-BLIA, 10.9%). The pathological complete response (pCR) rate varied among subtypes, with IHC-BLIA showing the highest (30.0%) and IHC-LAR showing the lowest (4.5%). IHC-BLIS led in recurrence sites. Overall and disease-free survival analyses did not show significant differences among subtypes. Although, IHC-BLIA demonstrated a trend toward better survival and IHC-mesenchymal worse. Patients who achieved pCR exhibited significantly better disease-free survival and overall survival than non-responders. This study underscores the potential of IHC-based subtyping in TNBC management, highlighting distinct response patterns to neoadjuvant chemotherapy and potential implications for treatment strategies. Further research is warranted to validate these findings and explore tailored therapeutic approaches for specific TNBC subtypes.","author":"","siteTitle":"Preprints.org - The Multidisciplinary Preprint Platform","siteHash":"abac34b0506002eba4392ac15186820b9b5d7a0f2e5fce3a3511408258fb1a7e","entryHash":"a416d1aed41c892e819f5fe88d3f48a5c83a22a199fb34c23333b98d615781cb","category":"Interdisciplinary"}