{"title":"Project Kuiper โครงการอินเทอร์เน็ตดาวเทียมของ Amazon เตรียมเปิดบริการจริงปลายปี 2024","link":"https://www.blognone.com/node/133030","date":1678898844000,"content":"<div><div><div><p>ทุกวันนี้โครงการอินเทอร์เน็ตดาวเทียม Starlink มีการใช้งานเป็นวงกว้าง แถบอาเซียนนั้นก็เปิดบริการในฟิลิปปินส์แล้ว แต่ Project Kuiper ของ Amazon ที่เปิดตัวโครงการมานานกลับไม่มีความคืบหน้ามากนัก ล่าสุดทาง Amazon ออกมาประกาศว่าจะยิงดาวเทียมจริงสองดวงแรกกลางปีนี้ และน่าจะเปิดบริการได้จริงภายในสิ้นปี 2024</p>\n<p>Project Kuiper จะเป็นดาวเทียมชุดแรกที่ส่งด้วยจรวด Vulcan Centaur ของ ULA นอกจากนี้ทาง Amazon ยังทำสัญญาส่งดาวเทียมกับ Arianespace และ Blue Origin ไว้ด้วย ร่วมการส่ง 83 เที่ยวบิน ซึ่งต้องการส่งดาวเทียมทั้งหมด 3,236 ดวง</p>\n<p>จานรับส่งสัญญาณดาวเทียมของ Project Kuiper มีทั้งหมด 3 รุ่น ได้แก่</p>\n<ul>\n<li>รุ่น 11 นิ้ว น้ำหนักน้อยกว่า 2.3 กิโลกรัม แบนด์วิดท์สูงสุด 400Mbps ราคาต่ำกว่า 400 ดอลลาร์</li>\n<li>รุ่นเล็ก 7 นิ้ว น้ำหนักน้อยกว่า 0.5 กิโลกรัม แบนด์วิดท์ 100Mbps ต้นทุนต่ำที่ไม่บอกราคา โดยอาจจะใช้กับงานรัฐบาลหรือองค์กรที่ต้องการเชื่อมต่ออุปกรณ์ IoT</li>\n<li>รุ่นใหญ่ 19x30 นิ้ว เน้นความเร็วระดับ 1Gbps</li>\n</ul>\n<p>ระหว่างที่บริษัทเริ่มยิงดาวเทียมทดสอบกลางปีนี้ก็จะเตรียมสร้างสายการผลิตดาวเทียม และเริ่มเดินสายการผลิตในปลายปี 2023 จากนั้นจึงผลิตจำนวนมากภายในกลางปี 2024 เพื่อให้ทันเปิดบริการปลายปี</p>\n<p>หาก Amazon สามารถเปิดบริการได้ภายในปี 2024 จริงก็นับว่าค่อนข้างเร็ว เพราะ Starlink นั้นเริ่มยิงดาวเทียมสองดวงแรกเดือนกุมภาพันธ์ 2018 และกว่าจะเปิดบริการจริงในแบบเบต้าก็เดือนพฤศจิกายน 2020 โดยการเปิดบริการช่วงแรกของ Project Kuiper ก็น่าจะคล้ายกับ Starlink ที่เปิดบริการจำกัดพื้นที่มากๆ ในช่วงแรก แล้วค่อยๆ ขยายออกไปภายหลัง</p>\n<p>ที่มา - <a href=\"https://www.aboutamazon.com/news/innovation-at-amazon/heres-your-first-look-at-project-kuipers-low-cost-customer-terminals\">Amazon</a></p>\n<p><img src=\"https://assets.aboutamazon.com/dims4/default/217710e/2147483647/strip/true/crop/1600x900+0+0/resize/1320x743!/format/webp/quality/90/?url=https%3A%2F%2Famazon-blogs-brightspot.s3.amazonaws.com%2F34%2F95%2F8c9a0200422783287bcb1c21d1f5%2Fprada-lifestyle-inline-1.jpg\" alt /></p>\n</div></div></div><div><div>Topics: </div><div><div><a href=\"/topics/project-kuiper\">Project Kuiper</a></div><div><a href=\"/topics/amazon\">Amazon</a></div><div><a href=\"/topics/satellite\">Satellite</a></div></div></div>","author":"lew","siteTitle":"Blognone","siteHash":"ededadcf18490b3937e7dd89ebe8c00dc129addbdf1ebe4aff1f458146693da0","entryHash":"a4177f9144041c648f16eef025af4cfeb5e835597c2fd1df3e7b0e37fd765dec","category":"Thai"}