{"title":"Hederagenin regulates the migration and invasion of hepatocellular carcinoma cells through FOXO signaling pathway","link":"https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0310930","date":1728482400000,"content":"<p>by Shuchang Bao, Songzhe Li, Yang Sun</p>\r\nObjective <p>This study aimed to elucidate the effects of Hederagenin (HG) on hepatocellular carcinoma (HCC) and explore its potential molecular mechanisms.</p> Materials and methods <p>Virtual screening was employed to identify potential targets within core pathways of liver cancer and to analyze the possible mechanisms of HG. CCK-8 assays were used to assess the viability of HCC cells, while Hoechst 33342/PI staining was utilized to evaluate apoptosis. The migration and invasion abilities of HCC cells were examined using Transwell and scratch assays, and single-cell cloning ability was assessed via colony formation assays. Subsequent qRT-PCR was conducted to determine the mRNA expression levels of FOXO1 and FOXO6 following HG treatment. Western blot (WB) analysis was employed to measure the protein expression levels of IGF1R, FOXO1, FOXO6, MMP2, MMP9, and VEGFA, as well as the phosphorylation status of FOXO1 Ser249.</p> Results <p>Virtual screening indicated that HG might exert antitumor effects through the FOXO signaling pathway. Experimental results demonstrated that HG induces apoptosis in a dose-dependent manner and inhibits the proliferation, migration, invasion, and single-cell cloning ability of HCC cells. After HG treatment, FOXO1 expression was upregulated, while the expression levels of IGF1R, phosphorylated FOXO1 Ser249, MMP2, MMP9, and VEGFA were downregulated.</p> Conclusion <p>In summary, our study is the first to demonstrate that HG regulates the phosphorylation of FOXO1, affecting the proliferation, migration, and invasion of HCC cells. The findings suggest that HG can inhibit the migration of HCC cells in vitro. The data indicate that HG-mediated targeting of the FOXO1/FOXO6 pathway holds promise as a novel therapeutic approach.</p>","author":"Shuchang Bao","siteTitle":"PLOS ONE","siteHash":"e9ab556ceb1e4ea76e897a5fa4f394f0bb75c2c2f3d5b0f4766ff77b4a262ac1","entryHash":"a42680f491562a17b17ee8701128a2cdf4fc9d9b3fbab40739bb837f08748c57","category":"Interdisciplinary"}