{"title":"Utility of artificial river reef structures to enhance fish habitat below a hydropeaking dam","link":"https://onlinelibrary.wiley.com/doi/10.1002/rra.4365?af=R","date":1723691054000,"content":"<h2>Abstract</h2>\n<p>Large-scale modification of river ecosystems for navigation, power generation, flood control, and irrigation has largely homogenized benthic habitats and altered fish assemblages. Although riverine habitat rehabilitation and enhancement techniques are well-studied for wadable streams and small rivers, relatively little is known about the potential utility of artificial fish habitat installation in large rivers impacted by hydropeaking. Lightweight artificial fish habitat structures composed of wood or plastic have demonstrated effects on fish populations in static environments; however, these structures are not able to withstand the high discharge and dynamic flows of a large river system. The Colorado River below the Davis Dam is a representative ecosystem impacted by hydropeaking, where water release can range from 2000 to 23,000 ft<sup>3</sup>/s (56.6–651.3 m<sup>3</sup>/s) in a single day. In coordination with multiple state and federal government agencies, we deployed a series of concrete river reef structures, mimicking small-scale artificial reefs, to increase habitat complexity and provide in-river patches of relief from high-flow events. Benthic habitat cover measurements were paired with visual surveys of river reef structures 6 months and 2.5 years post-deployment. Generalized linear models indicated that cobbles increased structure visibility above the riverbed, displayed less erosion, and allowed for greater potential fish use, whereas sand and gravel (i.e., loose bedload materials) decreased visibility and caused structures to sink into the riverbed over time, limiting fish use. Our case study provides instructional information on the construction of artificial river reef structures and recommendations for deployment, and highlights their potential to increase benthic habitat heterogeneity, with conservation and sport fish implications.</p>","author":"Michael C. Cavallaro, \nDavid A. Schumann","siteTitle":"Wiley: River Research and Applications: Table of Contents","siteHash":"dd8f8dcb48cf1db6f6edba43098839a842d88bad9f088e9d186fa05ae3366ba7","entryHash":"a42dbcb4dd19904f8ce68f5564adfb039937a5e8bd492acabef9f2868d94f0be","category":"Environment"}