{"title":"Assessment of the policy enabling environment for large-scale food fortification: A novel framework with an application to Kenya","link":"https://journals.plos.org/globalpublichealth/article?id=10.1371/journal.pgph.0003211","date":1715868000000,"content":"<p>by Veronique Theriault, Lilian Kirimi, Ayala Wineman, Ephiphania Kinyumu, David Tschirley</p>\r\n\r\nLarge-scale food fortification (LSFF) programs have potential to improve a population’s nutritional status. Though their success depends heavily on the prevailing policy environment, few tools exist to understand this environment. To address this gap, we develop a novel framework to define and assess the policy enabling environment for LSFF. This easy-to-apply framework can be used in any setting to track progress and identify next steps for continued improvements. The policy enabling environment is conceptualized as having three domains—policy agenda setting, policy implementation, and policy monitoring and evaluation—each of which is captured through indicators that can be evaluated using existing documentation, key informant interviews, and/or a survey of stakeholder perceptions. To validate the framework and demonstrate how it can be operationalized, we apply it in Kenya, where a mandatory LSFF program for salt has been in place since 1978, and a program for packaged maize and wheat flours and vegetable oils was introduced in 2012. Per our assessment, Kenya has achieved the greatest success within the domain of policy agenda setting, has realized moderate success in policy implementation, and has a weaker record in policy monitoring and evaluation. The positive trajectory for many indicators points to a promising future for Kenya’s LSFF program. This assessment yields policy implications for Kenya to improve its policy environment for LSFF, especially around financial sustainability of the program; ways to improve the processes for surveillance and enforcement; efforts to support fortification among medium-and small-scale millers; and a need to improve the data landscape.","author":"Veronique Theriault","siteTitle":"PLOS Global Public Health","siteHash":"68f201c31de345e71f5412928085f03739d747ad0de6373b46c0cd4b6cadb74e","entryHash":"a434138da5214ab8d426cade0395e53c3ddea0da79fa76b05aa5c34b20f8c6cd","category":"Environment"}