{"title":"Amazon Prime Day 2023 Will Run July 11-12","link":"https://www.macrumors.com/2023/06/21/amazon-prime-day-2023/","date":1687360027000,"content":"Amazon today <a href=\"https://www.aboutamazon.com/news/retail/amazon-prime-day-2023-date\">announced</a> that its annual <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fprimeday\">Prime Day sale event</a> will take place beginning Tuesday, July 11 and run through Wednesday, July 12. Amazon began Prime Day back in 2015, and since 2019 the event has been running for two days straight every summer.\r<br />\n\r<br />\n<img src=\"https://images.macrumors.com/article-new/2023/06/prime-day-2023.jpg\" alt width=\"2476\" height=\"1390\" />\r<br />\nShoppers can expect massive discounts on an array of products, including Apple devices. Some deals will last the entire run of the sale, but there will also be lightning deals that drop every 30 minutes and last for select periods, or until they sell out.\r<br />\n\r<br />\nTo get in on these Prime Day deals, you will need to be an Amazon Prime member. If you aren't, you can <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Famazonprime%3Fref%3Dst_wlp_opt_out%26ms3_c%3Dbe84addb4094c3d3fdf3ade361e920a0\"><strong>join Prime</strong></a> via a free 30-day trial to participate in this year's Prime Day. Once your trial is over, Prime membership will run for $14.99/month or $139/year. For students, that's $7.49/month or $69/year.\r<br />\n\r<br />\n<div><a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Famazonprime%3Fref%3Dst_wlp_opt_out%26ms3_c%3Dbe84addb4094c3d3fdf3ade361e920a0\" target=\"_blank\"><div><div>30-DAY FREE TRIAL</div>Amazon Prime Membership</div></a></div>\r<br />\n\r<br />\nAmazon is already <a href=\"https://buy.geni.us/Proxy.ashx?TSID=3088&amp;GR_URL=https%3A%2F%2Fwww.amazon.com%2Fprimeday\">highlighting early Prime Day deals</a> that you can shop now, weeks ahead of the event. For now, this mainly includes Amazon devices like Kindles, Echo Dot, Fire TVs, and other Amazon branded products.\r<br />\n\r<br />\nOnce Prime Day kicks off, Amazon's website will be filled with lightning deals on everything from tech products to home appliances, clothing, toys, and much more. We'll be covering all of the best deals you can get throughout Prime Day, particularly on all of the Apple products that appear, so be sure to keep an eye on the MacRumors front page starting July 11.\r<br />\n\r<br />\nLast year, Prime Day discounts were available to Amazon Prime members in Austria, Australia, Belgium, Brazil, Canada, China, Egypt, France, Germany, India, Italy, Japan, Luxembourg, Mexico, the Netherlands, Poland, Portugal, Saudi Arabia, Singapore, Spain, Sweden, the United Arab Emirates, the UK, and the United States. Although Amazon has not confirmed exact countries for 2023, shoppers can expect the same countries to participate again this year.\r<br />\n\r<br />\nAdditionally, Amazon held two Prime Day events last year, one in July and a second in October. Given that we're only now hearing about the July event, we don't know yet if the retailer will again host a second Prime Day, which it called \"Prime Early Access,\" in the fall. If and when that is announced, you can also expect us to cover all of the deals that come out.\r<br />\n\r<br />\n<em><small>Note: MacRumors is an affiliate partner with Amazon. When you click a link and make a purchase, we may receive a small payment, which helps us keep the site running.</small></em><br />This article, \"<a href=\"https://www.macrumors.com/2023/06/21/amazon-prime-day-2023/\">Amazon Prime Day 2023 Will Run July 11-12</a>\" first appeared on <a href=\"https://www.macrumors.com\">MacRumors.com</a><br /><br /><a href=\"https://forums.macrumors.com/threads/amazon-prime-day-2023-will-run-july-11-12.2393716/\">Discuss this article</a> in our forums<br /><br />","author":"Mitchel Broussard","siteTitle":"MacRumors: Mac News and Rumors - All Stories","siteHash":"4c0f1b1ecc2ed084c9f5be50f1058e33a55cdf9b904dadc33a2071fc2d63e8c1","entryHash":"a4353310b92202b6aca2910abfc2fc1703f4d7f00f71b84891adef5f7c555b6f","category":"Apple"}